["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Moira smelled him before she saw him.</p><p>She had been strolling through the rose garden, which sounded nice but was actually chilly and miserable, being mid-winter on Cape Cod. She shivered among bare branches, because she couldn't bear to watch her pack leader nuzzle his mate for another second. Which made her feel like a jealous cow. Which only contributed to her misery.</p><p>She was a werewolf. A good one, in fact, but that didn't mean she didn't get lonesome just like a regular person. It wasn't that she didn't adore Michael and Jeannie Wyndham. She would have killed for them.</p> <p>She had killed for them. They were her sun and moon and, like lovers, they established her world. She accorded her pack leaders the respect due an alpha male and female, but more than that, she loved them as friends.</p><p>But she was alone and likely always would be. Her mother had mated with a human and it had brought her nothing but pain. She had wanted more for her daughter. Moira had promised her mother she would settle only for absolute happiness in a mate. Fine and good, except it pretty much doomed Moira to a solitary life. Which, for a werewolf, was usually a disaster.</p><p>It was one thing when Michael had been a loner, too. Once Jeannie arrived (or, as Jeannie put it, \"was kidnapped\"), things were exciting for several months. Helping the new non-werewolf alpha female settle in had been one surprise after another. There had been no time to be lonesome.</p><p>Now Jeannie had given the pack a marvelous girl-child, had made her home with the werewolves, and never gave a thought to her old life. No conflict in that time, while good for the pack, meant there'd been nothing to distract Moira from her troubles.</p><p>Michael's utter happiness with his mate only made Moira more acutely aware of her own loneliness. She loved them, but could watch them snuggling, smell their lust, only so long before she needed to walk, or snivel in self-pity.</p> <p>The pack, Moira thought grimly, was no place for loners. Werewolves were enormously social and tended to mate for life as soon as possible. Loners got into trouble, and a loner who got into too much trouble went rogue. Rogue was bad.</p><p>Very bad.</p><p>She shivered, remembering Gerald. He was the only rogue male she had ever run across and, by God, he was enough. Gerald was on her mind because his estranged eldest, Geraldine, had just left Wyndham manor after a brief visit.</p><p>After Gerald had been driven out, Geraldine had remained loyal to the worthless bundle of fur. Since no pack would welcome a rogue, the two had wandered the country for years. Admirable loyalty, but the price the poor girl had paid! Her father had been dead a year and Geraldine still roamed.</p><p>No, a werewolf alone did more harm than good, and she had no business begrudging Michael and Jeannie their happiness. Better to leave the house and take her poor attitude with her. Thus, the rose garden in February. Thus, she would probably catch a cold from skulking in the sparse snow—and serve her right! Thus, there was a stranger on the grounds.</p><p>Her thoughts derailed in sudden confusion as she sniffed and caught the scent again. Stranger, yes. Male.</p> <p>Not pack. Probably a reporter; Michael Wyndham was a charismatic, handsome billionaire frequently courted for interviews. Now that he'd married and had a daughter, \"journalists\" (her lip curled) constantly tried to get a picture of the baby for People magazine.</p><p>She would find the man and escort him off the grounds; the Wyndham estate was private property. Her woes aside, there was, as always, duty. She turned to search and saw the stranger about fifteen yards away.</p><p>She was suddenly furious with herself because he wouldn't have crept up on her, downwind or not, if she hadn't been busy drowning herself in an ocean of pity. And she was also amazed, because he looked</p><p>. . . well, amazing.</p><p>The stranger, who was rapidly approaching, had dark blonde hair pulled back in a ponytail. He was quite tall, easily a head taller than she was, dressed in jeans so faded they were nearly white, and a black duster which swept past his knees. And his eyes . . . his eyes were the color of the ocean on the first day of winter, dark blue and filled with restrained fury. She caught his scent again: clean and crisp, like freshly ironed linen. Male linen. Incredibly gorgeous, highly masculine linen. Linen she could wrap herself in, sink her teeth into . . .</p><p>Her mouth popped open, both at the man's sudden appearance and his exceptional good looks. He was the handsomest non-pack member she'd ever seen. Too bad she had to kick him off their property.</p><p>He opened his mouth and she spoke, too; they said in unison, \"You can't be here.\"</p><p>They reacted in unison, too: \" I can't be here?\"</p> <p>Moira stared at him, almost afraid to speak, and heard him say, \"I'm really sorry. It's incredibly dangerous here. I'll try not to hurt you.\"</p><p>His unbelievable speed so shocked her, she let him hit her. He struck her with the flat of his hand, just below her chin, hard enough to knock her back into the frozen ground, hard enough to render a human unconscious.</p><p>Instantly, he was lifting her into his arms, carrying her away like a demented bridegroom. Demented and blind—he hadn't noticed she hadn't been knocked out.</p><p>Outraged, she seized his nose and twisted. He howled and dropped her; her butt thudded into the dirt.</p><p>He clapped both hands to his face, but not before she saw she had given him a nosebleed. Good.</p><p>\"That hurt.\" She flipped to her feet and growled, literally growled. She could feel the fine hairs on the back of her neck come to stiff attention. If she'd been in her wolf form, her fur would have been standing out in bristly spikes. \"You're an interloper, a trespasser, a creep, and this is private property.\"</p><p>\"This is a derrible blace,\" he warned nasally, still clutching his nose. \"You cad be here.\" He seized her elbow with a bloody hand and tugged. She set her feet and didn't move. He pulled harder. She kicked his ankle and heard the 'crack' and his groan at the same moment. \"Lady, for Christ's sake, I'b drying do save your life here!\"</p><p>\"My life doesn't need saving, moron, idiot, twit. Get your degenerate hands off me or I'll snap your spine.\"</p><p>\"Fuck it,\" he muttered. He let go of her so abruptly she staggered. Then he stepped back, pulled out a gun, and shot her in the throat.</p><p>Jared watched the gorgeous blonde topple over and had to fight a sigh of relief. Cripes, what a balls-up!</p><p>He hadn't thought she'd ever go down. His own damned fault—he was so worried about really hurting her he'd gone too easy. Hadn't had the heart to give her a really firm slam. And he'd paid the price: his nose was still streaming blood. The tranquilizer had worked (thank goodness for the Boy Scout motto!), but now what?</p><p>After years of research, of greasing palms, of knocking skulls together, of doing anything to get the information he needed, finally, finally, he had the murdering bastards cornered. His reconnaissance trip had instantly been cut short when he'd run across the woman. He'd been watching the Wyndhams for weeks and had their routine memorized . . . this was the time of day when the grounds were usually deserted. But there she was—obviously she hadn't read his recon notes—right in the line of fire, looking at him with those big eyes, probably getting ready to inflate those pipes and screech like a banshee.</p><p>Who would have thought a five foot nothing girl with eyes the color of pale violets would be so hard to knock out? Who would have thought she'd pack such a wallop?</p><p>Who would have thought he wouldn't be able to stop staring at her?</p><p>He knelt, pulled the tranquilizer dart out of her throat, and checked her pulse. Nice and strong. Weirdly strong. It was as if she was in a light sleep, not a drugged unconsciousness. If he didn't know for a fact that werewolves were all men, he'd wonder . . .</p><p>He picked her up, surprised again at how light she was. His dirty laundry weighed more. Now what to do with her? He couldn't leave such a delectable morsel lying around for anyone to nibble. Besides, if she had the freedom to wander Wyndham's grounds, she was probably a source of information. Perhaps a slave to the werewolves.</p><p>Anger swelled at the thought of this little sweetie at the beck and call of those monsters. Well, he could help her, and she could certainly help him. When she woke up, he'd pump her for whatever info she could provide.</p><p>The thought of pumping the blonde brought a surge of heat to his groin, which annoyed the hell out of him. You've got a dirty mind, buddy, he told himself. Just because you haven't gotten laid in a while . . .</p><p>He started back toward his truck. Wyndham and his pack of murdering dogs weren't going anywhere.</p><p>His sister had been waiting too long in her grave for vengeance. He'd get the information he needed, see blondie on her way, and come back to avenge his sister.</p><p>God help anyone who got in his way.</p><p>Chapter Two</p><p>Moira opened her eyes and said, \"I'm going to rip off your skin for that.\"</p><p>Beside her, the idiot-twit-jerkoff who'd shot her jumped in surprise. She heard the 'thump' of his book hitting the floor, and sat up.</p><p>And nearly fell herself, as a wave of dizziness slammed into her. She quickly shut her eyes, and groped for the edge of the bed. \"As soon as I get my hands on you. Death. Agony. Screaming. I foresee all of these happening to you. Perhaps several times.\"</p><p>He had picked up his book, and now she felt cool hands on her, easing her back. \"Take it easy, cutie.</p><p>The trank packs a punch.\"</p><p>\"Believe me, schmuck, putz, moron,\" she said. \"You don't know what a punch is.\"</p><p>\"You shouldn't even be awake yet,\" he soothed.</p><p>She seized his wrist, twisted, ready to crush the bone into splinters, already hearing his screams . . .</p><p>\"Cut that out, it tickles.\"</p><p>\"Dammit! How long am I going to have the strength of a newborn?\" She had meant to shout thunderously. Instead what came out was a pitiful wheeze.</p><p>\"Probably for the rest of the day.\" And did the lout have the gall, the temerity, the nerve to sound apologetic? After punching her and shooting her and trespassing?</p><p>\"Why were you trespassing?\"</p><p>She opened her eyes and took in the room at a glance and a sniff: cream and white bedroom, south-facing window, double bed, wool blankets, hardwood floors in dire need of a waxing, mothballs in the closet, cedar lined wardrobe. And him , sitting on the lone chair, holding his book (Vengeance for Dummies) and looking at her with honest interest. His dark blue eyes were thoughtful, and bracketed with laugh lines. As if he ever laughed. His hair was down from the ponytail; the sandy strands brushed his shoulders. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'm glad you asked,\" he said. Unfortunately, she'd forgotten the question. \"That's a bad place. Do you work there? Do they force you? It doesn't matter. You don't have to go back, sweetie.\"</p><p>\"Thanks, sweetie. \" Ugh. Had this oaf been sent to warn the Wyndhams about something? Alarm pierced the fog produced by the drug. \"Is Michael in danger? Or Jeannie?\"</p><p>His face didn't change, but his lips went white. And his scent . . . it shifted so quickly it nearly burned her nostrils. Acrid smoke. The smell of danger, the smell of hate. \"How long have you known him?\" he asked slowly, pleasantly. \"Wyndham?\"</p> <p>Be careful, Moira. \"Forever,\" she said shortly. \"He's my boss.\" And a whole host of other things you'll never, never understand. \"And if he's in trouble, you've got to tell me. And if you're bringing trouble to him or his, I'll kill you.\"</p><p>\"God, you're beautiful,\" he said softly, which was not the usual response to a death threat. \"You should see how fierce you look. He's not worth that kind of loyalty. If you knew what he was . . .\"</p><p>If you knew what I am . . . She was starting to get really, really angry. Oh, for a full moon right about now! It wasn't just the humiliation of being snatched practically from her front yard. It was that he was an ordinary man, nothing special at all, and he had made it look easy. \"Who are you?\" she practically snapped.</p><p>\"The UPS guy. But we were talking about you, cutie.\"</p><p>\"We were not.\" She felt like leaping from the bed and throttling the information out of him. \"And you haven't answered my question.\"</p> <p>\"Well,\" he said with maddening reason, \"you haven't, either.\"</p><p>Like that, is it? Think you can outsmart me, monkey boy? We'll see.</p><p>\"My jaw,\" she said, \"hurts like hell.\" She made her eyes go big; blinked pathetically. \"Why'd you hit me?</p><p>I wasn't doing anything.\"</p><p>Monkey boy had the grace to look embarrassed. \"Sorry,\" he muttered. \"I didn't want you to raise the alarm. Besides, you don't want to be there, anyway, hon. It's a bad place. It's going to get a lot worse, too.\"</p><p>Moira wasn't listening anymore. Her head was clearing, though her body still felt as limp as overcooked pasta. An alarming series of facts was ripping through her brain.</p> <p>Fact: this man managed to get on the grounds without anyone spotting him until he was on top of her.</p><p>Fact: he knew how to fight.</p><p>Fact: he had come armed.</p><p>Fact: he had drugged her, taken her away, and no one knew, and no one had stopped him.</p><p>Fact: he didn't like Michael.</p><p>Fact: he seemed to like her.</p><p>Fact: she had to stop this man.</p><p>Fact: she couldn't do shit until she had her strength back.</p> <p>Fact: she couldn't let him leave until she had her strength back. More, she wouldn't leave, not until she better understood exactly what he represented for her pack.</p><p>Conclusion? Nakedness was in her future. Possibly quite a lot of it. He was a man and she had, quite frankly, a nice rack. He'd take one look at her tits and forget everything except his name. She'd buy recovery time and pump him for all the information she could.</p><p>It was annoying: she could count on one hand how many times she'd gotten laid in the last two years; she was extremely selective. Or, as her friend Derik put it, \"weirdly frigid.\" Now she had to expend precious energy to seduce this human.</p><p>Moira was not a promiscuous woman by any means . . . not, in fact, strictly a woman at all. A pack animal first and forever, everything she was, did, and said was shaped by that knowledge, that identity.</p><p>When the leader was in danger, the pack was in danger.</p><p>When the pack was in danger, she'd do whatever it took.</p><p>\"My head,\" she whispered, breath-soft.</p><p>\"What?\" the idiot said, bending closer.</p><p>Fighting the urge to shriek, \"Gotcha!\" , she put her mouth right near the cup of his ear and murmured,</p><p>\"My head hurts soooooo much . . . may I please have a glass of water?\"</p><p>\"Oh. Sure. I'm sorry, I should have . . .\" Moron Boy moved away, and she couldn't help staring at the exceptional way his butt filled out the seat of his jeans. Yes indeedy, the world-class ass had a world-class ass. She wrenched her thoughts back on a more business-like track . . . then remembered his butt sort of was the business at hand, at least until her metabolism blasted the last of that hateful trank out of her system.</p><p>The idiot came back with a glass of water, which she promptly spilled all over her blouse. \"Oh, it's cold!\"</p><p>she squealed, inwardly groaning—Derik would be laughing his head off if he could see this—and outwardly shuddering as her nipples came to stiff attention. What's-his-face had been helping her sit up, and nearly dropped her back into the pillows. \"Do you have a shirt I can borrow?\" She fumbled at the buttons of her soaked blouse.</p><p>Jared blinked, taking in Moira's smooth, pale skin as she stripped the wet fabric away. He wondered if she had a fever. He wondered if he had a fever. He knew who this little cookie was. He'd taken her prints while she'd been unconscious, scanned them into his laptop, and found out her name over an hour ago.</p><p>Technology was swell.</p><p>Moira Wolfbauer, place of residence: Wyndham Manor. Place of business: Wyndham Manor.</p><p>Employer: Michael Wyndham. But she'd tried her hand at social work just out of college, lucky for him, and thus her prints were on file. Mother deceased, father unknown. He'd pretended to know none of this, of course, and began a gentle interrogation, and hadn't been pleased to hear how protective she was toward the Wyndhams.</p><p>Obviously fond of the asshole, what was she up to? She'd threatened to kill him, had assaulted him, and was pulling off her blouse and—yep, there went the bra—a frothy, lilac-colored concoction that exactly matched her eyes.</p><p>All right.</p><p>It would take more than a wet blouse to distract him.</p><p>He was Jared Rocke and he would have his vengeance. He was Jared Rocke and she had the nicest rack he'd ever seen, all creamy white skin with nipples the color of wild roses. He was Jared . . . uh . . .</p><p>Rocke . . . and . . .</p><p>\"Aren't you cold?\" he asked hoarsely.</p><p>\"Extremely,\" she whispered, her hands on his shoulders, pulling him down, her mouth by his ear, her small white teeth sinking into his earlobe, and the sensation shot straight from his ear to his groin.</p><p>He groped, seeking a blanket to cover her, and instead his hands found the delicious firmness of her breasts. She arched against him, her tongue in his ear, and his mouth found her throat. She wriggled delightfully, tugged at him, and then his shirt was sliding off his shoulders and floating to the floor.</p><p>Her wriggling had been to good effect; she was nude, he was nude, their clothes a tumbled heap on the floor. Her soft skin made for an erotic contrast against the wool blankets, and for a moment all he could do was stare. Her violet eyes were huge, dominating her face, the arched golden brows above them making her look sweetly surprised. Her short hair was a delightful muss of tumbled blonde curls, curls so light they were almost silver, and her limbs were slim but strong-looking. Her nails were short, almost brutally so, and he had time for a quick, analytic thought: They're short because she bites them all the time. He wondered what a cookie this cute had to worry about. Men probably fell over themselves trying to take care of her.</p><p>Then she opened her arms and he fell into her embrace, and that was the end of his analysis. For the first time in years, thoughts of vengeance fled his mind as he buried himself in her creamy softness.</p><p>Moira braced herself for the oaf's full weight, but to her surprise he caught himself on his hands and came into her gently, almost carefully. His hand caressed her messy hair, and then his mouth came down on hers, his tongue skimming across her teeth and, when she obligingly parted her lips, probing her mouth. His taste overwhelmed her, all smoky masculine heat, and she gasped.</p><p>She'd never mated with someone who wasn't pack. This was partly out of self-imposed obligation to her mother and partly out of pure concern. She had always, in some part of her subconscious, worried about hurting an ordinary man. And really, wasn't that her problem? She had promised her mother she wouldn't mate into the pack . . . but couldn't bring herself to mate with an ordinary human. Now here she was, buying time, and he didn't seem so ordinary, this man, and his hands, what his hands were doing, that didn't seem all that ordinary eitherrrrrrrrrrr . . .</p><p>\"Oh!\" Her hips bucked. He moved, kneeling beside her, and his thumb settled back atop her clitoris, his fingers spread and resting against her thighs, barely touching, almost not touching, but moving so slowly and delicately that she could almost . . . feel it . . . and it was driving her crazy. Meanwhile, he had reached for her breast, was pinching her nipple between his thumb and forefinger, hard enough to almost hurt. Between the throbbing of her nipple and the light, delicate, feathery touch between her legs, she was halfway to a climax. Ridiculous! He'd been touching her for less than a minute. She wasn't a goddamned windup doll. She didn't even like him. She didn't even . . . she didn't . . . she . . . she felt a flood of heat between her legs and reached out.</p><p>She found him, hard and hot and long, and squeezed, and his eyes tipped up and he stared blindly at the ceiling, the muscles in his neck standing out in rigid relief. He turned his hand and his thumb was now wiggling inside her.</p><p>Moira reached for him again but he kept that maddening distance, almost as if he were afraid to be too close to her. She opened her eyes wide, and in the afternoon light had a postcard-perfect look at him, at the way the light bathed him, made him seem more tan than he was. She could see the muscles moving beneath his taut flesh and, reaching up, felt the tension in his abdomen. He was holding himself back, rigidly so, and she wondered why. She could smell his urgent lust and it kindled her own; she knew he wanted to shove her down and bury himself inside her until they were both screaming. So why did he hold back?</p><p>More, she wondered how she could have gotten caught up so quickly in what had started out as a stalling technique, an act she had been prepared to dislike, or at least find dull. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He smiled at her, reached for her, cupped her chin in his hand. They stared at each other and Moira forgot to breathe, so amazed that there could be such a tender, perfect moment between strangers.</p><p>Then he eased her over, onto her stomach, and nudged her thighs apart with his knee. She could feel his thumbs on either side of her spine, pressing, soothing, and instinctively arched into his touch. Then she felt a silky firmness, and realized he was dragging the tip of his cock down her spine, between the cleft of her buttocks, and pausing at the opening of her vagina. She waited expectantly, but he paused. Bent.</p><p>Murmured.</p> <p>\"I'm Jared.\"</p><p>She said nothing, just surged toward him.</p><p>\"And you're Moira.\"</p><p>The bare tip of him was teasing her nether mouth, almost easing inside but not quite, and she swallowed a groan. His fingers were on her, spreading her wide for him, but still he didn't enter, still he lingered.</p><p>\"Say it, Moira.\"</p> <p>\"Jared.\" The word was nearly wrenched from her. \"You're Jared.\"</p><p>He chuckled, deep in his throat, almost a purr. \"Nice to meet you.\"</p><p>He pushed forward and was almost—almost!—inside her, but not quite. She began to shake. Had she imagined she'd have the upper hand in this seduction? Had she really?</p><p>\"Please . . .\"</p><p>\"Moira, we're going to have a nice long talk when I'm finished.\" Coming inside her now, the full, engorged head pushing, pushing. \"About you . . .\" Another inch, \"the company you keep . . .\" Another.</p><p>\"And your boss.\" Abruptly he was gone from her, and she could have cried. His finger replaced his cock, dipping, teasing, feeling her slippery wetness, and then he was stroking the tight bloom of her anus, gently rubbing the rich core of nerve endings there. She made a surprised sound which escalated to a muffled shriek as he slowly pushed his finger past that tight muscular ring.</p> <p>\"Easy.\"</p><p>\"Don't.\" She tried to scramble away—she had never, no one had ever —but he nudged her again and she couldn't get the leverage she needed. When he was up to the first knuckle she felt his cock at the mouth of her vagina, and there was no gentle easing this time, this time he was instantly inside her, while his finger slid around slowly, out just a touch and then back in, no big dramatic strokes, just an overall pressure and gentle wriggling. She could feel him everywhere, filling her up, taking everything . . .</p><p>\"Yes, we'll have a nice long talk,\" he said, his voice so gritty she could scarcely understand him. He pulled out and his finger stilled; she was reasonably certain her heart would stop. \"About your unfortunate choice of associates.\" He slammed all the way in.</p><p>She screamed.</p><p>She screamed into the pillow as he thrust, rocked, as he took her again and again, one hand on the small of her back, one hand . . . doing things inside her, doing things no man had ever . . . and always his cock, throbbing and huge and a terrible thing, doing his bidding, ignoring her pleas, her cries, just shoving and thrusting, and it was a terrible thing, a terrible wonderful thing, because somehow the tables had turned, she wasn't using him, he was using her.</p><p>She would kill him. She would kill him for making her scream. She would kill him if he stopped.</p><p>\"Moira,\" he groaned. He wouldn't let her move, wouldn't listen to her cries, but his hands on her were gentle. \"Moira, ah, God. \" His tempo increased, he slammed into her, the bed moved, she braced herself and shoved back as hard as she could, because she could sense it, feel it, her orgasm was on the horizon, was almost there, and another finger joined the first inside her, stretching her, and that was enough, that tipped her over.</p><p>She tried to throw back her head and howl, but all that escaped was a wild groan as she bucked against him. She felt him clench behind her, felt his seed pour into her, could actually feel the temperature change as he heated her up from the inside, and came again, so quickly and fiercely that white spots danced on the edge of her vision.</p> <p>He pulled out of her, away from her, and she collapsed, alone, on the bed. She lay on her stomach for long moments, shaking from the aftereffects of the most cataclysmic sex (with a human! a human!) she'd ever had, then finally rolled over and looked at him.</p><p>To her surprise, he'd pulled on his jeans, had sat down in the chair and was watching her with hungry interest, the way a wolf watches a limping fawn. She could still smell the musk they had made. Could smell herself, on him.</p><p>\"Now,\" he said, smiling, and she didn't much care for that smile, not at all, \"let's talk about your boss.\"</p><p>Chapter Three</p><p>Moira sucked in her breath in a startled, hurt gasp. \"You . . . you were using me.\"</p><p>He blinked. \"Well, you were using me first. In fact, you sort of gave me the idea.\"</p><p>She glared. She felt like a fool—where did she get off, accusing him of anything? She sounded like a brat. Well, she couldn't help it. Right now, she felt like a brat. He was right, but that didn't make accepting it easier . . . or lessen the hurt. However, she would eat her own eyeballs before letting him see how she felt. \"Yes, that's true, I did start things,\" she said slowly. \"It's just as well, since you apparently enjoy forcing women to get them to do what you want.\"</p><p>Score! Bright color jumped into his cheeks. Suddenly she felt a bit better. It was hard to feel triumphant, though, when her thighs were still throbbing from what he'd been doing to her. For a while—a teeny, tiny while—she'd forgotten all about the pack, about this man being a threat to her leaders. It just . . . just went completely out of her head. She could count how often this had happened on one finger. Yesterday, she would have been able to count it on no fingers.</p><p>Jared cleared his throat, obviously piqued to see her interest was elsewhere. \"Now . . . where were we?</p><p>Oh, right. Your scumsucking boss. You—\"</p><p>\"I'm not telling you spit about Michael Wyndham, you cretinous globulous fornicator, and you can just—stop laughing!\"</p><p>He'd thrown his head back at \"globulous\" and was still chortling, despite her specific order to the contrary. He finally stopped and looked at her admiringly. \"Has anyone ever told you how you insult people in threes? Cretinous-globulous-fornicator? Schmuck-putz-moron? Anybody mention this before?\"</p><p>\"Yes. Michael Wyndham, for one.\" That wiped the smirk off his face. \"I don't know what you want with him or his, but he's—\"</p><p>The brother I never had.</p><p>\"—my dearest friend and not only am I not going to tell you things about him, I'm going to put you to the floor if you go near him with harmful intent.\"</p><p>Of course, now Michael would be laughing at the thought of her defense, because a pack leader who couldn't fight off intruders wouldn't be a pack leader very long. Still, her pride demanded some sort of action.</p><p>He shook his head at her. \"You poor kid. You have no idea what he is, do you? I suppose you're fooled by a pretty face.\"</p><p>\"I wasn't fooled by yours,\" she said coldly. He grinned. It made him look years younger. It made him look nice. When he most assuredly was not.</p><p>She sat up suddenly, testing herself, pleased to find she wasn't dizzy. In a bound she leaped out of the bed and stood on the floor, fists planted on her hips. Jared's gaze lowered to her breasts and she could practically hear his I.Q. dropping. Pretty soon his mouth would fall open and a silvery line of saliva would start tracking down his chin. \"I'm out of here, schmuck, putz, idiot. I don't appreciate being kidnapped and drugged and—er—seduced—\"</p><p>\"Technically,\" he pointed out mildly, \"you were the one to introduce sex into the equation. I was just—er—a willing pupil.\"</p><p>\"Details. Anyway, stay away from the Wyndhams, or I'll pull off your ears and you can use them for cufflinks.\" With that, she whirled and marched toward the smell of Comet cleanser . . . presumably the bathroom.</p><p>It was the bathroom. Excellent. Shutting and locking the door behind her, she ignored the laughter coming from the bedroom. Moira had always been the shortest person in any room and was used to people— men—laughing at her fierceness. The laughter usually stopped when they had to spit out their back teeth to avoid choking.</p><p>It was time—past time—to get the hell out of Dodge. She didn't trust herself to remain around The Insufferable One. When he laughed he threw his head back and she thought about nibbling on his throat, licking until she tasted his sweat and—oh, yes, it was time to leave.</p><p>She spotted the window above the toilet and opened it. Three stories up—hmmm. Big house. She could easily get to the ground, but there was the small problem of being naked. Not that she cared—no werewolf cared—but she was supposed to pretend to care. A lot more humans lived in this town than werewolves, even here, the seat of Michael and Jeannie's power.</p><p>She snatched at the shower curtain—a silly thing with imprints of grinning ducks, and were the little bastards mocking her? They were!—and tugged it down. There was a paft-paft-paft! sound as the curtain hooks disengaged, but she didn't hear approaching footsteps. Good.</p><p>In a flash she wrapped it around herself, a sort of plastic, duck-laden toga. Wriggling through the window with a minimum of grunting, she dropped to the porch roof, about twenty-five feet straight down.</p><p>And fell through it.</p><p>That wasn't in the plan, she thought, dizzy with surprise. Stupid old Cape Cod houses with shoddy porch roofs! And are those splinters in my . . . aarrgh! This day is never going to end. She slowly climbed to her feet and heard Jared thundering down the stairs.</p><p>She ran.</p><p>Chapter Four</p><p>Moira limped into the combination dining hall/family room at Wyndham Manor (or, as Derik called it, Carnivore Central). For a moment she just watched them, drinking in the cozy domestic scene. She'd brought chaos and bad news (and splinters) with her, and was loath to disturb them.</p><p>Derik, her oldest friend, was deeply engrossed in a back issue of Martha Stewart Living. He was tall, broad, rippling, muscular, etc., etc., and made a quiche like nobody's business. His Chilean sea bass, served on a bed of sautéed spinach, could make grown men weep. Derik was convinced Ms. Stewart was a cleverly concealed werewolf, and read each magazine to tatters, looking for clues. When the article on steak tartare came out, he was sure she'd made a fatal slip. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jeannie and Michael, her pack leaders, were stretched out on the carpet in front of a crackling fireplace.</p><p>Baby Lara was lying between them. She would carefully extend a bare, pink foot (a foot that looked quite a bit like a pork chop with toes), giggle while her mother tickled it, then would withdraw, and slowly extend the other foot for her father.</p><p>Jeannie had settled in, if not seamlessly, at least with minimal trouble after that first hellish week. Moira often wondered if Jeannie thought of her old life. She'd never had friends to the manor, and never talked about her family. It was almost as if she hadn't really come alive until Michael had—almost literally!—swept her off her feet.</p> <p>Moira felt the usual envy crawling up from the back of her throat, and fought it down. She was happy for Michael. She was. And she adored Jeannie. It was just . . . hard to take sometimes. That was all. They were so happy, and she'd just had the best sex of her life with a man who was trying to pump her for information.</p><p>She delicately cleared her throat (\"Ah-CHEM!\"), gratified to hear the yells of dismay. After the bruising her pride (and bottom!) had endured today, she was grateful to be surrounded by family.</p><p>Jeannie, her best friend and the pack's alpha female, was yelling the loudest. The leggy blonde rushed over to her, holding baby Lara and raking Moira with her piercing, blue-eyed gaze.</p><p>\"What the hell happened to you?\"</p><p>\"Glah!\" Lara added, waving a chubby hand.</p> <p>Moira caught the baby's hand, kissed it gently. Lara had her mother's lungs, and her father's charisma.</p><p>With a headful of dark, glossy curls and eyes the color of good cognac, she was a striking infant.</p><p>Michael took her in at a glance—bumps, bruises, smelling of sweaty sex and plastic, tired and pissed off.</p><p>\"Who should I kill?\" he asked calmly.</p><p>\"Are you okay?\" Derik asked, hurrying over to join their small group.</p><p>\"Only my pride has been savaged.\" She felt the shower curtain start to slip and adjusted it. \"But probably permanently.\" Directly to Michael and Jeannie: \"Can we talk?\"</p> <p>\"Don't pull that,\" Derik protested. A broad-shouldered blonde, he and Moira had often been mistaken for siblings. Except for the fact that he towered over her, they looked a great deal alike, although Derik's eyes were the green of wet leaves. \"I want to hear what happened, too. Start with, 'I went for a walk,'</p><p>and finish with 'then I walked in wearing a ducky shower curtain'.\"</p><p>\"Not now,\" she said, and hated it, because Derik really was like a brother to her, and she had no secrets from him. He'd informally adopted her as a littermate when she'd come to live at the mansion after her mother's death.</p><p>But the pack leader deserved to hear about the threat first—Jared had named Michael specifically.</p><p>Michael would decide who to tell, after. \"Come on, you guys. This shower curtain is itchy.\"</p><p>Jeannie unceremoniously handed Lara to Derik. The baby yelped in protest, then shrieked happily as Derik tossed her four feet in the air. \"Later, Moira,\" he called after them. As in, You'll be telling me the whole story, right?</p><p>\"Later, Dare.\" She used the nickname he'd had since they'd been small. The man would do anything if you triple-dog-dared him.</p><p>She marched into the soundproofed den and waited until Michael shut the door. Then she told them how she'd spent her afternoon. She left out nothing, save for how astounding and wonderful the sex had been.</p> <p>She was feeling very guilty about that.</p><p>Michael's eyes were thoughtful, distant. \"Huh.\"</p><p>\"'Huh', he says.\" Jeannie shook her head in annoyance. \"Let's go back to the house and find out what this Jared's problem is.\" Moira could see every one of the woman's protective instincts was aroused. \"Or have him arrested.\"</p><p>\"For?\" Michael asked mildly.</p><p>\"Trespassing.\" She was scowling, but leaned into him for comfort. The scowl eased as he gently rubbed her shoulders. \"Being a flaming asshole. Rape.\"</p><p>Moira coughed. \"Uh . . . it wasn't exactly . . .\"</p><p>\"Never mind semantics! He's out to get you, Mike. I won't have it, I tell you I will not have it! \"</p><p>Moira didn't say anything. Jeannie had become one of the family, and was so utterly fearless, it was often hard to remember she wasn't a werewolf. This was hardly the first time someone had come gunning for Michael. He controlled an admirable fortune and had three hundred thousand werewolves at his back.</p><p>He was a tempting target.</p><p>\"I really think we need to go over there and fire a warning shot into his spine,\" Jeannie continued.</p><p>Michael was still rubbing her shoulders, and she raised her hands and closed them over his, gripping tightly. \"Fix him somehow. Neutralize his ass.\"</p><p>\"What do you propose we do, dear one?\"</p><p>\"Um, hmm, I'm not sure, let me think, how about . . . lock him up! \"</p><p>\"Then he skips bail and he's out and about with a hidden agenda. No.\"</p><p>\"You're insufferable. Must you always think of every stupid little thing?\"</p><p>He smiled at her. There weren't many people who dared speak to Michael Wyndham in such a way.</p><p>The pack had been deferring to him since he was in training pants. He loved his wife's sharp tongue.</p><p>\"Every stupid little thing? I thought of going after you, didn't I?\"</p><p>\"Har, har.\"</p><p>His smile faded and he looked right at Moira, who'd been watching their interaction with undeniable longing. \"Moira, will you go back?\"</p><p>\"Of course.\" She had figured out the problem as quickly as Michael had. Obviously Jared was a dangerous man . . . but was he alone? What exactly did he want, and why? And how far was he going to go in order to achieve his goal? Did he want to bring down just Michael, or Jeannie and baby Lara? The entire pack? For what purpose? When? She cursed herself for not having thought of this before jumping out the window. But there was time to make up for it. \"Let me get changed and I'll leave right away.\"</p><p>\"Leave?\" Jeannie's fingers were twitching and Moira could tell, just tell, her friend was wishing for her gun. \"Why?\"</p><p>Moira started sidling toward the door. When the Wyndhams fought, chandeliers shook and foundations cracked. And Jeannie, a good woman in all things, was still a human. She would never be pack, and could never truly understand their motivations. She'd get it intellectually. But she would never feel it.</p><p>\"Moira is going to go back to that house, and stay with Jared, and get all the information out of him she can, however she can.\" Michael said this with admirable calm, then waited.</p><p>Jeannie's eyes widened and seemed to actually bulge. \"Stay put!\" she snapped at Moira, who was tentatively reaching for the doorknob. \"Moira, you don't have to go.\"</p><p>\"Really, I'd be more comfortable up in my room—\"</p><p>\"I meant back to him. \"</p><p>\"Of course I have to. We need to know what he's up to. And I'm in a unique position—he thinks I'm a cute bimbo twit. Also,\" she added, ignoring the rush of heat to her cheeks, \"he likes fucking me.\"</p><p>Jeannie gaped at her, then swung toward Michael. \"Michael, don't make her go! She doesn't have to—to whore for us.\"</p><p>Moira laughed, then clapped a hand over her mouth.</p><p>\"Werewolves don't whore,\" he said, fighting a smile of his own, \"and I'm not making Moira do anything.</p><p>She only came here as a courtesy, you know. To—how d'you put it? Keep us in the loop.\" He glanced at her over the top of his wife's head and they shared a moment of perfect understanding.</p><p>\"It's not right,\" Jeannie said stubbornly.</p><p>\"Protecting us? Your daughter? Our friends?\"</p><p>\"Well . . . okay . . .\" She exhaled sharply, puffing blonde strands out of her face. \"I feel stupid having to say this out loud, but she shouldn't have to sleep with him.\"</p><p>\"It's a sacrifice I'm willing to make,\" Moira said, straight-faced, but her cheeks felt very warm now.</p><p>Michael looked at her sharply, and arched a dark eyebrow.</p><p>\"Moira,\" he said, \"can take care of herself. It's not like you to moralize, Jean.\"</p><p>Jeannie looked from her husband to her friend. She looked at them the way one might look at a new form of life: with superstitious awe.</p><p>After a long moment, Jeannie shook her head. Usually the difference between their cultures and species didn't seem so great, but today the gap yawned. \"You'll do as you please,\" she told him, \"you always do.</p><p>But expecting Moira to put herself in danger for you, to have sex with a bad guy for you . . . that's going too far. It's—\" She glanced at Moira and stopped. Moira was staring at her with a total lack of comprehension. \"Oh, forget it. I'm obviously the only one who's got a problem with this. Fine, knock yourself out, have a grand old time, don't forget to write.\"</p><p>She marched across the room, punctuating her exit by slamming the door. Michael turned and looked at the couch. \"It's about as uncomfortable as it looks,\" he mournfully informed Moira. \"What a pity I'll be sleeping there, probably for the rest of the week.\"</p><p>Who are you kidding? Try a month. Moira smiled wanly. \"It's actually a little flattering—if she didn't think so highly of me, she wouldn't have such a problem with me going back. But I can't think of how to explain it to her . . . why it's not a problem. Why I have to do it . . . in fact, why I should be halfway back to the house already.\"</p><p>\"Yes, but first this. You've got to be really careful. Not just for your own sake. If Jared gets too close . .</p><p>.\" He smiled, showing his teeth. They looked very white and very sharp and might have fooled someone slow to notice the smile didn't reach his eyes. \"I'd hate for my wife to have to shoot another bad guy on my property. The noise might wake the baby.\"</p><p>\"He won't get close to them. And even if he did,\" she said matter-of-factly, \"it will be very hard for him to harm my lady and my future sovereign while I'm chewing on his spinal cord.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Now the smile did reach his eyes. \"Oh, Moira. Have I told you how much I love you today?\"</p><p>They laughed together, like littermates.</p><p>Chapter Five</p> <p>Jared told himself to stop worrying about Moira.</p><p>Impossible.</p><p>Which was annoying, because he had far more important things to worry about. His sister's murder had been too long unavenged. He was in place at last, ready to strike, a blonde, blue jean wearing hammer of vengeance.</p><p>But instead of oiling his guns, practicing his sleeper hold and making sure his revenge T-shirt was clean—in general, fantasizing about blood and screaming and other good stuff like that—he was fretting about blondie.</p><p>He didn't dare go back out to the porch. Every time he saw the hole in the roof and the scattered debris on the floor, he cringed, an action frowned upon by the Marines and the varied underworld types who'd helped him prepare for this week. She had been so desperate to get away from him that she'd flung herself out the window! She had been so desperate to get away from him she had fled on foot—with nothing more than a duck-laden shower curtain covering that lovely bod! As each hour passed he felt more and more like a Grade A jerk . . . and more and more frantic with worry.</p> <p>He'd canvassed the quiet neighborhood, with no luck. She'd probably holed up somewhere to nurse a thousand wounds (and a million splinters). Probably dying! All because of—</p><p>The doorbell rang.</p><p>Jared blinked. No one in town knew who he was, it was too early for Girl Scout cookies, and was there still such a thing as a Welcome Wagon?</p><p>Had Wyndham sent the Welcome Wagon?</p><p>As was his habit, Jared fretted while he cleaned his guns. So he actually held a freshly oiled Beretta. It was a moment's work to slap a full clip in and slide a load into the chamber. Still barefoot and shirtless from his earlier (incredible, wonderful, marvelous lovemaking) tryst with (beautiful, gorgeous Moira) blondie, he padded to the door. By the time he reached it, the delicate tapping became an insistent pounding. Jared flung the door open, his gun already leveled.</p><p>At Moira's forehead.</p> <p>\"You're a limited man,\" was all she said, walking past him. Carrying a suitcase, no less. He stared. He couldn't help himself. She looked as pretty as a spring daisy, wearing a yellow dress which made her eyes seem a darker lavender, almost purple. The hem of the dress stopped a modest inch below her knees, which did nothing to disguise the fact that she was walking around on a world-class pair of stems.</p><p>The back of the dress plunged in a deep V, showing off creamy white skin.</p><p>\"Well,\" she said, when it was obvious all he could do was gape at her, \"I'm back.\"</p><p>\"Huh?\"</p><p>She rolled her eyes and muttered something under her breath. \"I . . . said . . . I'm . . . back . . .\" she enunciated loudly, as if he was feeble or deaf. Right now, he felt feeble. \"I'm staying with you until we get this mess straightened out.\"</p><p>He had the dim feeling he was in the presence of a greater intellect. And awesome tits! He shook his head, hard. Focus, moron, he ordered himself. \"Mess?\"</p><p>\"Yes. You're here to do something wretched, horrid, awful, to my friend and boss, Michael Wyndham.</p><p>I'm here to talk you out of it.\"</p> <p>Now he was focused, laser-sharp. \"No chance.\"</p><p>\"Why?\"</p><p>\"He—he's a monster. He killed someone I loved.\"</p><p>Not a blink from blondie. Not a twitch, not a fake show of sympathy. Just a cool, \"No. He didn't.\"</p><p>Jared was surprised, both at her assurance and her inference. And frankly, not hearing her ooze sympathy was something of a relief. Women were either scared shitless of him, or felt sorry for him.</p><p>Neither was conducive to hominess. And he didn't want Moira's pity. He especially didn't want her fear.</p><p>It was very important she not be afraid. He couldn't bear it if she flinched back from him.</p><p>Jesus, why the hell did he care? Why should it matter if she was scared shitless of him? It would just make his job easier. And how could she defend the monsters so quickly, without knowing any of the details?</p><p>\"Maybe not him,\" he said at last. \"But one of his dogs.\"</p><p>At 'dogs' her upper lip curled, revealing lovely white teeth. He plunged ahead, unable to believe they were having this conversation. He was explaining things to the woman who worked for the man who murdered his sister! \"Whatever or whoever, Wyndham is responsible. I don't give two fucks for the details. He's the boss dog. So he's going to tell me where I can find the dog responsible.\"</p><p>\"I'll be glad to help you find out who hurt the person you cared for,\" she said quietly, hefting her suitcase and starting toward the stairs, \"but you're wrong about Michael. Totally utterly completely wrong. I'll be around until I can convince you of that.\"</p><p>He watched her climb the stairs, silent. After a moment he wrenched his gaze from her legs and forced himself to think. His gut told him Moira was one of the good guys. His brain screamed exactly the opposite. But he was not the world's greatest thinker, as his father, training instructors, and commanding officers had pointed out on several occasions. He was alive today because he'd listened to his instincts and ignored his brain. He'd be a fool to ignore his gut now, when he was so close.</p><p>Moira was a veritable treasure trove of information. Not that she planned on telling him shit. His admiration, already high, went a notch higher. She was a safe, and if he cracked her with just the right tools, he'd get the gold.</p><p>After a while he unloaded the gun, put it away, and went up after her.</p><p>Chapter Six</p><p>\"So . . . what? We're roomies?\" Jared asked</p><p>\"Yes.\" Moira unpacked the suitcase, shoved her clothes into the empty bureau by the window. And tried very, very hard not to show how pleased she was to see him again. She wasn't the first woman in her family to feel like this, she remembered with excitement and despair. Her mother, too, had been torn between desire and duty. Except her mother had been human, and her father a beta werewolf who left to form his own pack. Left her mother, pregnant and alone in a city by the sea. If not for Michael's father taking them in . . .</p><p>There was a lesson there: love made you stupid. On her deathbed, her mother had praised her former lover, who'd planted his seed one night and then left to better himself. Moira loved her mother, but hated weakness.</p><p>\"I appreciate what you're trying to do—I think,\" Jared was saying, sounding confused—as usual. \"And I'm glad to see you're all right. In fact, I'm pretty interested in hearing the tale of your trip back to the mansion. And what you did with my shower curtain—I bought a new one, by the way, in case you need to—uh—freshen up. But I'm still a little confused.\"</p><p>\"I'm not surprised.\"</p><p>He ignored the sarcasm. \"What exactly do you do for Wyndham?\"</p><p>\"I'm his accountant.\"</p><p>\"His accountant.\"</p><p>\"Yes.\"</p><p>\"Uh . . . you don't look like an accountant.\"</p><p>\"Obviously I do, because I am one.\" 'Accountant' was understating it a bit. She had a Master's in Business Finance, another Master's in International Business Relations, and (this one had been for fun) a Master's in Japanese Literature. \"What does your accountant look like?\"</p><p>\"I don't have an accountant,\" he admitted. \"I made about eight grand last year.\"</p><p>Eight grand! She'd signed off on that much for the birthday celebration the week Lara had been born.</p><p>Heck, her Christmas bonus had been almost twice that. \"Hmm. The revenge business isn't terribly lucrative?\"</p><p>He smiled, which, annoyingly, she felt down to her knees. \"That's about right. You know, Moira, if you're going to stay here, we should probably set up some ground rules.\"</p><p>\"Such as . . . ?\" Here came the tiresome human stuff . . . he'd sleep on the couch, they'd draw up a bathroom schedule, they'd talk out their feelings in a really reallyconstructive way. He'd explain about how difficult it was to be a modern man when all he really wanted to do was cry and share his enlightened consciousness with some poor bitch, and she'd pretend not to be semi-conscious with boredom.</p><p>She squared her shoulders. She would endure much for Michael and Jeannie and Lara. Torture. A physical beating. Sharing feelings in a constructive way. \"I'm hearing what you are saying,\" she said, obediently quoting Redbook. \"What rules?\"</p><p>\"Well,\" he said, and she noticed—how had this escaped her?—that he was unbuckling his belt. Now he was sliding his jeans down his long thighs and he wasn't wearing underwear. Now he was kicking the jeans in a pile, pulling his shirt over his head and yanking the band out of his hair. He grinned and then they were flying backward and landing on the bed, his cool nakedness pressed against her, warming her through the thin fabric of her dress. His hair tickled her chin and smelled like wild perfume. \"The first rule, I think, is that we should be naked, pretty much all the time.\"</p><p>She laughed. She couldn't help it. Then she was laughing into his mouth as he kissed her. Her hands raced over him, greedy, and he was groping her with about as much finesse. She didn't care. Something about his scent drove her right out of her mind. She thought his first rule was a fine one.</p><p>Their thoughts:</p><p>He wants to hurt the pack.</p><p>She works for the monsters.</p><p>But in this moment of clean lust, logic had no force. The only thing that mattered was skin on skin, mouth on mouth. Preferably for hours.</p><p>There was a purring riiiiiiiip, and then her dress was in pieces. \"I'll care about that,\" she said, panting,</p><p>\"later.\"</p><p>\"I'll buy you a new one.\" He issued a low growl, and then his mouth was on one of her nipples, and then, even better, his teeth were.</p><p>\"That dress was worth one tenth of your total earnings last year.\"</p><p>\"God, I love it when you figure out percentages in your head,\" he moaned. She could feel his beard stubble between her breasts . . . on her stomach . . . between her thighs. \"Now talk to me about IRA rollovers and 401(k)s.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She started laughing so hard she lost her breath entirely. Which was all right, because at that moment his tongue darted inside her, and she wouldn't have been able to breathe anyway.</p><p>Her hips bucked against his mouth and he reached up, seized her waist, and shoved her back firmly against the mattress. All the while his mouth busily explored between her legs, his lips sucking and kissing and his tongue was probing. Moira heard herself scream.</p><p>He pulled back abruptly, leaving her teetering on the edge, and she screamed again, this time in frustration. She scrambled toward him, but he caught her elbows and flipped her. Her face hit the pillows as she was forced down on her stomach.</p> <p>\"God, you have the most luscious ass,\" he groaned, and she felt his hands on her, his fingers kneading her skin, hard.</p><p>Hard enough to mark my flesh, she thought with black excitement. Her blood was up so high she literally saw red; the room before her was cloaked in a red haze. Her tongue felt thick in her mouth.</p><p>She flipped back over, and grabbed him, and he laughed at her. But he quit laughing when she locked her ankles behind his back and forced his pelvis toward hers. Women had superior lower body strength anyway, and besides, she was probably twice as strong as he was, possibly three times.</p><p>He let her do it. In fact, he helped—put his hands between her thighs and gently held her apart, so that when she levered her back up off the mattress to meet him, his cock slid inside her without pause. Right up to the hilt.</p><p>They stared at each other for a long moment, then started rocking together. Her legs were still wrapped around him but now he was holding her, too, holding her and kissing her deeply while they thrust against each other, while the bed squeaked out their rhythm.</p> <p>Now his mouth was on her neck and he was gently biting her throat, then greedily sucking her flesh. His mark, she thought again, and spun away into orgasm.</p><p>A moment later, so did he. Through a gaze slitted with pleasure, she watched his eyes roll back, felt him stiffen all over.</p><p>\"Christ,\" he managed, right before collapsing on her.</p><p>\"Yes, indeed,\" she replied. She started to push him off her, but he clung like a lamprey. \"For heaven's sake, I need to get up and wash.\"</p><p>\"No,\" he muttered sleepily. \"Keep my smell on you. For a while.\"</p><p>A reasonable request. One she liked too much. She started to get up, but his arm tightened across her waist like a bar. She could have snapped it at the elbow, but didn't. Instead she nestled up next to him, and fell asleep.</p> <p>Chapter Seven</p><p>Moira snapped awake in the dark. Where the hell was she?</p><p>\"Don't. Don't. Don't.\"</p><p>Everything locked into place: she was in Jared's rented house. His stirring had awakened her. And what on earth was wrong with his voice? He sounded like a boy, not a man in his prime.</p><p>\"Don't be dead. Oh, Jesus, don't . . . don't be. Dead. Dead. She's dead. My sister's dead! Somebody help me! \"</p><p>She reached out a hand, too late. He sat up so abruptly the back of his head banged into the headboard, flung his arms out hard, belted her right below the eye. It didn't slow him down, or even bring him fully awake.</p><p>He lurched from the bed. She pressed a hand to her now-throbbing eye and forced her pupils to dilate.</p><p>Suddenly what had been dark became light, and she got a good look.</p> <p>The big, badass werewolf hunter stumbled around the room, hoarse sobs locked in his throat, compulsively rubbing at his hands. \"Everywhere.\" His voice broke. \"There's blood and it's just . . . oh, it's everywhere. Renee, my poor Renee.\"</p><p>He collapsed to his knees and scrubbed at the imaginary blood. Moira watched, horrified. In his recall of the night he found his sister's body, Jared had made the scene all too real for her. She could almost smell the blood.</p><p>What are you staring at him for, fool?</p><p>She was out of the bed in a bound and actually found herself stepping around the imaginary pool of blood. She bent to him. \"Jared, love, it's a dream.\"</p><p>\"Renee. Poor Renee. She fought and he . . . he . . . and I was too late. If I'd gotten home just half an hour earlier . . .\"</p><p>You'd be dead, too. \"Renee's out of her pain, dearest. Come back to bed.\"</p><p>\"I can't—bed?\"</p><p>\"You're dreaming, Jared. It's just an awful, awful dream. Renee knows you tried. Renee knows you loved her—love her still. You've given your life up for vengeance, isn't that so?\"</p><p>\"It's . . . yes.\" Sounding stronger now; the boy's voice was leaving. The man was coming back.</p><p>\"Lie down with me.\" She pulled him easily to his feet, although he had twelve inches and fifty pounds on her. She brought him back to bed as she would have led a child. \"It's all right.\"</p><p>\"No,\" he said, already slipping back into sleep. \"It's never going to be all right.\"</p><p>About that, you may be right.</p><p>\"Watch out, Moira. They're werewolves. I know it sounds incredible.\" He yawned, snuggled against her shoulder. \"But they're the monsters from the fairy tales. Wyndham and his dogs.\"</p><p>\"I know,\" she said softly. Thinking: Oh, what will you do when I tell you I'm one of the monsters?</p><p>And why did she care?</p><p>She was awakened by a delicious tickling between her breasts, and cracked one eye open to see Jared, nibbling her cleavage. It was still dark out—not even five o'clock in the morning.</p><p>\"Did your mother wean you a bit too early, Jared?\"</p><p>He snorted, the sound muffled against her flesh. \"Very funny. Let's take a shower. My mouth tastes like a dead rat shat in it.\"</p><p>\"Thanks for the visual. You should write for Hallmark—yee-ouch! Well, you should. And why are we getting up?\"</p><p>He wouldn't look at her. \"Can't sleep,\" he muttered. \"Every time I fall all the way under, I—I wake back up. C'mon.\"</p><p>A few minutes later, morning ablutions completed, he was soaping her all over while the scalding shower beat down on them. Moira groaned aloud from the sheer pleasure of it. Her motto had always been, if it doesn't turn your skin bright red, it's not a shower.</p><p>They weren't talking about his dream. She wasn't sure he even remembered stumbling around the room, washing his dead sister's blood off his hands. She decided not to bring it up.</p><p>\"You're probably the smartest woman I've ever met,\" he informed her out of nowhere, rinsing her breasts off again, then lathering his hands and running them over her slippery flesh. \"And definitely the prettiest.\"</p><p>\"Where'd that come from? And thank you. You're probably right. About the smart thing, I mean.\"</p><p>\"And so modest!\"</p><p>She shrugged under the water. \"My whole childhood, I was my mother's doll. Little, blonde, cute.</p><p>Something to be dressed up and fussed over. All she talked about was my looks. So it was all people talked to her about. I was a smart child, really smart. So I talk about that. My looks are boring.\"</p><p>\"They're certainly not boring, cutie,\" he said, \"but I can see how that would have been a major pain.\"</p><p>\"Yes, it was. Sorry to digress into 'poor Moira's poor childhood' silliness.\" She shrugged, embarrassed.</p><p>\"Also, I think my breasts are clean enough.\"</p><p>\"They're filthy,\" he solemnly informed her. \"Really. Yech. I won't rest until I can eat off them.\"</p><p>She felt her lips twitch. \"Indeed.\" His hands felt marvelous on her skin. She enjoyed the sensation for a moment, then went back to his earlier, most interesting comment. \"The smartest, huh?\" The pack took her brains for granted, and men who didn't know her didn't care that she was smart. She found it refreshing and marvelous to run into someone who noticed her brains, commented, and thought she was just fine. \"Really? I mean, you must have known a lot of women.\" Given your boudoir skills, I would guess thousands.</p><p>\"Mm-hmm,\" he said carelessly. \"You've probably got twenty, thirty I.Q. points on me, easy.\" He sounded as threatened as if he was telling her she had two, three cup sizes on him, easy.</p><p>Opening her eyes wide, she ignored the stinging spray. \"And that doesn't bother you?\"</p><p>\"Hell, no.\" He shrugged, water bouncing off his broad shoulders. \"Everybody's good at something.\"</p><p>\"Well.\" She chose her words carefully. This was one of the most interesting conversations she'd had in a while. \"I'm definitely book smart. You're more . . . tricky, like. In a lot of ways, that's better than having a head for numbers.\"</p><p>\"I know,\" he said casually.</p><p>\"Now who's being modest?\" She goosed him and he slapped her hand away.</p><p>\"Careful, I almost maimed you with my incredible reflexes.\"</p><p>\"Oh, sure.\"</p><p>His smile faded, and suddenly he looked through her, not at her. Just like that, he was somewhere else.</p><p>\"I was always good at fighting. Busting skulls, that stuff. I got in lots of fights as a kid—I mean, guys were always following my sister around, Renee, her name was . . .\"</p><p>\"I know.\"</p><p>He stopped talking. His hands stopped moving on her body. His eyes were narrow, blue slits. \"How d'you know?\"</p><p>\"You dreamt about her last night. You were calling her name.\"</p><p>\"Oh.\" She couldn't tell if it was the heat of the water or embarrassment at his vulnerability that made his face redden. \"Okay. Say, I didn't hurt you, did I? Sometimes the nightmare . . . it makes me thrash about a bit. Sleepwalk, too.\"</p><p>\"No,\" she lied. Of course she'd had a spectacular black eye during the night. And of course it had healed by morning.</p><p>\"Oh. That's good.\" She pumped shampoo into her palm and started washing his hair, running her fingers through the long strands. He arched unconsciously beneath her touch for a moment, then continued.</p><p>\"Anyway, I'd get into fights to keep the boys respectful, you know? And my dad, before he died he signed me up for all these martial arts classes, and boxing, that kind of stuff. To keep me out of trouble—he figured if I was punching people in a class after school, I'd be too tired to get into fights. By the time I graduated high school I could pretty much kick anybody's ass. The Marines really liked having me around.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'll bet. That's why you took it upon yourself to find Renee's killer. It was your job to protect her. And when you couldn't, that last time, the least you could do . . .\"</p><p>\"Yeah.\"</p><p>They were silent, and then Jared rinsed his hair and started running his soapy hands down her back, started kneading her buttocks.</p> <p>Moira thought, his body is his weapon. He's been using all those fighting skills to track down his sister's killer like a bloodhound. That's why he got the drop on me so easily. My whole life, I've taken my physical strength for granted. I couldn't do a karate chop if someone held a gun to my head. He's not an intellectual, and he doesn't have circus strongman strength. He's cunning, and quick, and can sneak up on people with no trouble.</p><p>He's more like a wolf, she realized with a bolt of excitement, than I am.</p><p>Could this man be the one? She would never worry about accidentally hurting Jared; he could take care of himself. Certainly it was no problem if he were to accidentally hurt her . . . she was a fast healer, and pain was, at times, almost a friend to her. Best of all, most wonderful of all, he absolutely didn't care that she was an adding machine on legs. That alone made it worth staying with him.</p><p>Her excitement derailed abruptly when she recalled one simple, devastating fact: he had no clue what she was. And once he found out, he would at least walk—run!—out of her life forever. Unless he considered her responsible for his sister's death, too.</p><p>How, she wondered forlornly, had the tables turned so quickly? Yesterday she would have seen him dead. Today tears sprang to her eyes at the thought of him leaving.</p> <p>His hands were still stroking, still soaping, and she could feel his erection against her stomach. He pressed her close to him, holding her tightly.</p><p>\"Moira, Moira,\" he whispered, his words almost lost under the thrumming of the shower, \"a guy could fall in love. But if you're holding out on me . . .\" He came into her, hard, a brutal shove, and she bit back a cry of mingled pain and pleasure. \". . . you'll live to regret it.\"</p><p>She didn't doubt it.</p><p>He picked her up, pulled her legs around him, and held her easily, pinning her against the slick tile like a butterfly to a board. He shoved, shoved, shoved, and it hurt, she wasn't ready for him, and she loved it, loved being used roughly. Had she really disdained coupling with a human because she thought they were weak? She had thrice his strength but, without leverage, could only take it. Take him. His length filled her up, took her over, he was deep, so deep. He was shoving angrily but his hands were gentle; she had a flash of intuition</p><p>(he's angry because he wants me so badly . . . wants me but doesn't quite trust me) and then could only concentrate on what he was doing to her. She squirmed against the tile. \"You're hurting me,\" she whispered.</p><p>\"I know.\" He gently tongued her earlobe . . . then bit it.</p> <p>Now his thrusts came easier because her body was easing his way, was flooding her with wetness.</p><p>\"Damn you,\" he whispered, his eyes gleaming, \"I never wanted this to happen . . . ahhhhhhhhh . . .\"</p><p>\"I'm sorry,\" she gasped.</p><p>\"You feel so slick, so sweet. I'm really close. I'm going to come and . . . you're . . . not.\"</p><p>\"Don't you dare!\" was as far as she got before she could feel him pulsing inside her. Abruptly, he pulled away, leaving her shaking with need.</p><p>\"Jared . . .\"</p><p>\"What the hell are we going to do, bright eyes?\"</p><p>\"Jared . . .\"</p> <p>\"It's a simple question, Moira,\" he said patiently, giving her nipple an impudent tweak. Oh, how she hated him. \"A guy could fall in love, but I've got to keep my priorities straight.\"</p><p>His fingers. His fingers, between her legs, finding her throbbing clit. Stroking it, rubbing it. Even squeezing, very, very gently. Her legs trembled, threatened to spill her to the tile. Her head rolled back and forth against the shower wall. \"You're smack in the middle of a mess, gorgeous, and I don't envy you at all. The question is, what are you going to do about it?\"</p><p>\"Please. Please. Please.\" The word was wrenched out of her, shoved out. \"Please, Jared. Don't make me beg.\"</p><p>\"But, sweetheart,\" his mouth very near her ear, \"you are begging.\"</p><p>She moaned, lost. He took pity on her, knelt, gently spread her apart and lapped, lapped, lapped. She came at once, a shallow spasm that did nothing, that left her wanting him inside her, her need for him a bestial craving. \"More,\" she gasped, demanded, urged. Begged.</p><p>He wordlessly led her from the shower, both of them dripping wet. Bent her over the tub. Took her again and again, until the room rang with her screams, until her legs wouldn't support her any longer and she collapsed to the floor, still feeling the spasms from her last orgasm.</p><p>Without a word, he lifted her to her feet, dried her with a big, fluffy towel, and tucked her into bed as if she were a precious treasure. Left her to nap.</p><p>Humans are weak, was her last thought before spinning into sleep. In a pig's eye.</p><p>Chapter Eight</p><p>When she woke, hours later, she was alone in the bed and utterly ravenous. The smell of frying bacon filled the room, filled her head, and she hurriedly pulled on some clothes and flew down the stairs.</p><p>She burst into the kitchen just as Jared slid three eggs onto a plate laden with bacon, toast, sliced tomatoes, home fries, and sausage links. \"Morning, sunshine. Do you want some—\" Snatching the plate away from him, she sat at the table, grabbed a fork, started shoveling. \"—breakfast?\"</p><p>\"Nnnnf.\"</p><p>He grinned down at her. \"God, you are the perfect woman. Super smart, awesome in bed, and you eat like a lumberjack.\" He ruffled her curls. \"A sexy lumberjack.\"</p><p>\"Mmmfff nnnggg mmmm,\" she said, or something like that. She swallowed. \"This is good. Thanks very much. Being hungry does nothing for my manners.\" Human manners, she amended silently.</p><p>\"I can't believe you're not throwing food at me.\" He turned back to the stove. \"After this morning.\"</p><p>\"Yes, yes, very non-PC, you beast, it's over between us, hate you forever . . . salt?\"</p><p>He turned, blinked at her, then shook his head and nodded toward the salt shaker.</p><p>\"What, I have to get up?\" she complained. \"You're standing right there.\"</p><p>\"Cripes, you've got nerve!\" He whipped around, exasperated. \"You know, technically you're my prisoner. I mean, I did kidnap you.\"</p><p>\"Yes, and then you lost me.\" At his scowl, she added, \"Plus, you're standing right there. Besides, you and I both know you'd eat your own feet before hurting any woman. So spare me the 'you are my prisoner, fear me' crapola. And pass the damned salt! Please.\"</p><p>\"I'll do it,\" he said, smirking, \"if you'll show me your tits.\" He paused, obviously braced for shrieks of feminine dismay at his crude request . . . and nearly fell onto the frying pan as her T-shirt hit him in the face.</p><p>\"Salt.\"</p><p>\"Right.\" He fetched it for her, gave her left breast a friendly squeeze, and returned to his eggs.</p><p>\"Thank you. Now there's bacon grease on my nipple.\"</p><p>\"I'll take care of that for you,\" he said, scooping eggs onto another plate. He snapped a glance at her over his shoulder, and winked. \"Later.\" He sat down across from her and fell to.</p><p>\"Great. You could just pass me a napkin, you know.\"</p><p>\"Spoilsport.\"</p><p>They ate in friendly silence, until Jared finally asked, \"Do you remember last night?\"</p><p>\"Vividly.\"</p><p>\"I mean . . . my dream.\"</p><p>\"Yes.\" She stopped mopping egg yolk with her toast and looked up. \"I'm very, very sorry about your sister.\"</p><p>He looked at her thoughtfully. She noticed he hadn't pulled his hair back in a ponytail, and had to keep brushing back the sandy blonde strands, keeping them out of his face. \"And afterward. What I said afterward . . . I'm pretty sure I told you they're werewolves. Over at Wyndham's.\"</p><p>\"Yes, you did.\" She answered his unspoken question. \"I already knew.\"</p><p>Thunderstruck silence, followed by, \"And you work for them?\"</p><p>\"They're my family.\" Get it? My family? Don't make me say it, Jared. Figure it out.</p><p>He shoved his plate back, stood, started pacing. She unobtrusively pulled his half empty plate toward her. Ah, two pieces of bacon left . . .</p><p>\"Jesus, if I didn't know for a fact that all werewolves are male, I'd be really worried about—\"</p><p>\" What? \"</p><p>\"Don't try to deny it, pretty spy. You know, I had to take a long and very fucking strange road to get to this house, this town, and on the way I met some exceedingly weird people. And heard some strange shit.\"</p><p>\"Werewolves are all men.\" She could barely get the sentence out without giggling. \"Who told you that?\"</p><p>\"I paid good money for that information,\" he said proudly. \"And I got it from an honest-to-God werewolf. I watched the beast change . . . into a bigger beast. And when the moon went down and the sun came up, he told me all about werewolves.\"</p><p>All about bullshit, more likely. \"How'd you get him to talk?\"</p><p>\"I was resting the barrel of my shotgun against his testicles while we played Twenty Questions.\"</p><p>\"Yes, that would do it.\" So he'll never guess the truth about me. Not unless I tell him outright, or show him. So: good? Or bad? Moira practically squirmed at the odd dilemma. Good for Moira-the-werewolf, because her main goal, always, was the pack's safety. Bad for Moira-the-woman, because this put more distance between her and Jared.</p><p>And why did she care ?</p><p>He looked nonplussed at the way she hadn't been horrified to hear about the shotgun, and the testicles.</p><p>That, in fact, she seemed to hardly be paying attention to his revelations. He resumed pacing. \"Which is why you shouldn't be working there. What if one of them bites you, for Christ's sake? I didn't think to ask if a woman could get infected that way . . .\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"You're worried one of them will bite me?\" She kept her voice calm, deliberately reasonable, unworried, in contrast to his violent emotions. His anger, coupled with fear for her, burned her nostrils. He was worried about her. She was annoyed and pleased at the same time.</p><p>\"You might wind up . . . I don't know . . .\"</p><p>\"I do know. The biting thing is an old wives' tale. You're a werewolf or you're not. It's a whole different species, Jared, not the measles. Not something you catch.\"</p> <p>He digested that, and she could practically hear the wheels turning in his mind. Could see the thought on his face: Why would she lie? No reason, ergo it must be the truth. She couldn't help but be warmed at this sign of trust between them. Never mind why would she lie . . . why should he believe her? And yet he did.</p><p>\"A hundred years of bad movies are wrong?\"</p><p>\"Not to mention a thousand years of folk lore.\" Moira suddenly remembered the time she and Derik were kids and had gone to see An American Werewolf in London. They had laughed so hard they were kicked out not forty-five minutes into the movie. \"The truth is always much more boring than the fable it grew from.\"</p><p>\"What if one of them kills you?\"</p><p>\"Never, ever happen.\"</p> <p>\"Bullshit. Put down that piece of toast, it's mine.\"</p><p>\"You left your plate,\" she protested.</p><p>He threw up his hands. \"Can we stay on track, please? One of them has killed, you don't deny that, right?\"</p><p>\"Right. But tell me why you think Michael knows who killed your sister.\"</p><p>Jared blinked, surprised at the abrupt question, but answered readily enough. \"Everything traces back to Wyndham manor, to your boss. Ev-er-ee-thing. The police even had a suspect, but the guy got away clean. He worked there, lived there, probably even had a family there. Then I got close, and he was smoke. Wyndham told the cops he didn't know a thing about it, which was just about the biggest lie since</p><p>'this won't hurt a bit'. The suspect worked for Wyndham practically his whole life.\"</p> <p>\"Was this . . . about a year ago?\"</p><p>\"How'd you know?\"</p><p>\"I'm just trying to figure out the timeline.\"</p><p>\"The name I had was Gerald somebody,\" Jared confirmed.</p><p>Oh shit, oh shit, oh shit. She strove to look thoughtful, rather than horrified. This was good news and bad. Good news because Gerald was dead, and thus unlikely to be murdering anyone else's sister now that he was so much meat in the ground. Bad because Jeannie, Michael's wife, had shot Gerald. Multiple times.</p><p>Of course Michael had denied knowledge of Gerald's whereabouts. He couldn't very well tell the police the truth: that Gerald was beneath the White Ivy rosebushes on the south lawn and, oh by the way, officers, would you like some tea before you haul my mate away in chains? She's pregnant, so make sure she takes her pre-natal vitamins in prison.</p><p>\"I think I can help you,\" Moira said slowly. She had no idea what to do. Tell Jared everything and trust him to keep Wyndham secrets? Ha.</p><p>Tell him nothing and neutralize him? Hit him when his guard was down and bite the back of his neck until his strong heart stopped beating and his gorgeous eyes closed forever?</p> <p>I've got a crush on the idiot.</p><p>Moira knew her limitations. She was intelligent—okay, that wasn't a limitation—but numbers were her game. She had no gift for leadership or strategy. That was Michael's job. She was a foot soldier, plain and simple.</p><p>Jared needed to hear about Gerald, but not from her. From Michael and Jeannie, and no one else.</p><p>Would Jared follow her to Wyndham manor, unquestioning? Just trot right on over to what he assumed was the belly of the beast?</p><p>Ha.</p><p>\"There's something on the back of your neck,\" she said sweetly.</p><p>\"What?\" He brought his hand up, brushed ineffectually. She put her hand on his shoulder, gently turned him around, and punched him at the base of his skull with her knuckle. Jared obligingly dropped without a sound, and she caught him on the way down.</p><p>I'm going to hear about this one for a while, she thought grimly, slinging him over her shoulder like a sack of toys.</p><p>Chapter Nine</p><p>He opened his eyes and saw he was surrounded by monsters, in a living room or den of some sort.</p><p>Michael Wyndham, Moira, and Wyndham's hottie wife, Jeannie, were all bending over him, their faces like concerned moons. He was lying on a couch, and could hear the cheerful crackle of a fire nearby.</p><p>\"You . . . bitch!\" He sat bolt upright, then clutched the back of his neck, which was incredibly stiff.</p><p>\"Aarrgghh! What'd you hit me with, a piano?\"</p><p>\"I'm sorry, Jared.\" Moira-the-Judas had the nerve to look abashed. She blinked her big purple eyes at him and spread her hands helplessly. \"I had to bring you here—we have things to tell you—but I didn't think you'd come if I asked.\"</p><p>\"So you coshed me over the head with an iron and kidnapped me?\" His hand slid down and around, but his holster was empty.</p><p>\"Don't get too far up on that high horse of yours,\" Jeannie Wyndham said dryly. \"You did the same thing to my friend yesterday.\" She waved his gun at him. Jared felt alternately nervous and aroused to see such a pretty woman handling his weapon so comfortably. \"My best friend. And since you kidnapped my friend and are here in town solely to hurt my husband, you look stupid trying to sound outraged.\"</p><p>\"Jeannie,\" Michael said quietly.</p><p>\"Well, he does.\"</p><p>\"Give him back his gun, please.\"</p><p>\"Speaking of stupid.\" Despite her comment, she popped the clip, ratcheted a bullet out of the chamber, and gave him back all three, absently puffing a hank of blonde hair out of her eyes as she did so. He was so surprised he nearly dropped them on the floor.</p><p>\"Will you listen?\" Wyndham asked quietly. The guy had funny eyes—dark brown, ringed with yellow, dog's eyes, monster's eyes—but his voice was deep and soothing. Too soothing. Jared knew there were people in the world who could make you like them. It was a talent, like being able to raise only one eyebrow. Even knowing all he did about Wyndham, Jared still wanted to shake the guy's hand and hear what he had to say. Watch it, he warned himself. \"Mister—ah—Moira?\"</p><p>Moira cleared her throat. \"Sorry. We should have done this right away. Jeannie and Michael Wyndham, this is Jared . . . uh . . .\" She flushed. \"I never did get your last name.\"</p><p>\"And after all we shared,\" he said mockingly, and was gratified to see her blush deepen.</p><p>\"Knock it off,\" Jeannie snapped. \"You're still on my shit list, buddy-roo. I don't know why we're all tip-toeing around you. As far as I'm concerned, you're the bad guy.\" She smirked at him. \"And you know what happens to the bad guy in books and movies, right, Jerked?\"</p><p>\"It's Jared,\" he said, and to his surprise he had to fight a smile. \"Jared Rocke.\"</p><p>Jeannie's eyes widened. \"Rocke? Your last name is Rocke? Oh my God, that's the silliest name ever.\"</p><p>Wyndham was looking heavenward, as if for divine intervention. \"Jeannie . . .\"</p><p>\"Seriously. It's like a bad romance novel. 'Jared Rocke brooded darkly before sweeping Shanna Silverington into his strong, rugged embrace.' Barf. What's your nickname? Rocky? Rocco? Double barf.\"</p><p>Incredibly, Jared could feel himself relaxing. He sensed no menace from any of the three—of course, he hadn't sensed menace from Moira before she'd bashed him with a serving tray, either. Still, Moira was so contrite, and Wyndham so polite, and Mrs. Wyndham so refreshingly rude, it was hard to stay tense.</p><p>And what the hell did that mean? That Moira was right? The monsters weren't all bad?</p><p>He coughed to cover his confusion. \"My nickname in second grade was Jared Poopypants, for an incident I refuse to go into, no matter how long you and your husband torture me. Creditors call me Mr.</p><p>Rocke. My friends call me Jared. I don't know what you guys are,\" he added truthfully.</p><p>\"Let's find out,\" Michael said genially. \"Something to drink, Mr. Rocke?\"</p><p>\"Barf,\" Jeannie said again, but went to the wet bar.</p><p>\"Yeah, I'd love a beer,\" he admitted. \"And a bottle of aspirin.\"</p><p>Wordlessly Moira stepped behind him, and then he felt her kneading his neck with her small, supple fingers. By the time Jeannie handed him an ice-cold, foamy beer, his neck felt much better. \"I'm still pissed at you,\" he muttered.</p><p>She bent to whisper in his ear. \"I know. You can take it out on me later. At the house. In your room.\"</p><p>Her mouth was hovering outside the cup of his ear and his dick was paying close attention to the conversation. \"Do you know any rope tricks?\"</p><p>\". . . your sister.\"</p><p>\"Mr. Rocke?\"</p><p>\"Jared,\" he said automatically, trying to shake off the surge of excitement Moira's words had brought.</p><p>Talk about the wrong place and time! \"It's Jared.\"</p><p>\"Thank you. I'm Michael, and you've met my wife, Jeannie. I was saying how sorry I was to hear about your sister.\"</p><p>\"You'll be even sorrier when you hear the stuff I've been able to dig up.\"</p><p>Michael sat across from him holding a tumbler half full of Scotch. Moira declined a drink, staying behind Jared and gently rubbing his neck, and Jeannie sat next to her husband with a glass full of milk. At Jared's stare, she mumbled, \"Still breastfeeding.\"</p><p>For some reason that made him laugh out loud. It seemed to emphasize the wholesome attributes of the room they were in, the pleasant people he was talking to. Death had no place here . . . not where women breastfed well-loved babies and potential girlfriends promised bondage games.</p><p>\"I guess Moira can tell you what's been going on as well as I can,\" he said, because he wanted to hear what Moira had to say about the situation.</p><p>She ruffled his hair in response and started to speak. She spoke for quite a while, finishing with, \" . . .</p><p>and Jared's been tracking the killer. I think—I'm sure—it's Gerald.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Wyndham and his wife looked at each other. Jared was still trying to figure out why he hadn't loaded his gun and killed everyone. Except Moira. Probably except Moira—he still couldn't believe she'd gotten the drop on him so easily. He couldn't believe he was still thinking about the clothesline coiled neatly in the garage! 'Rope tricks', she'd said. Jesus.</p><p>The woman—Jeannie—had thrown him off-guard, that was why he was off his stride. She was about as adorable as Moira, and what a temper! She hung around werewolves all day—was married to one!—and hadn't been killed or mutilated or anything like that.</p><p>It was sure something to think about.</p> <p>Then there was his pretty, purple-eyed Moira. She was hiding stuff from him, but he was seeing it less as duplicity and more as loyalty. There was nothing he admired more than loyalty . . . hell, loyalty to his family had brought him here. It was all pretty damned confusing. He hadn't counted on it becoming confusing. It had seemed pretty fucking black and white just a few days ago.</p><p>\"Gerald probably did kill your sister—and I'm very sorry,\" Michael said.</p><p>\"Really really sorry, Rococo,\" Jeannie added. \"I don't know what I'd do if something horrible happened to Michael or Lara.\"</p><p>Sympathy from the dogs—well, the dog and his wife—he hadn't expected. He had to look away from the genuine kindness on their faces. Liking the dogs was not in the plan. No, sir.</p><p>\"I only met the man twice . . . and the second time I killed him,\" Jeannie added candidly. Jared looked back in a hurry.</p> <p>\"Jeannie . . .\"</p><p>\"Michael, we've got to tell him.\" She took a big slug of her drink, and went on passionately, unaware of her milk mustache. \"If I go to jail, I go to jail . . . but I don't think Jared's the type to rat out the killer of a killer.\"</p><p>\"No, ma'am, I am not. Why don't you tell me what happened.\"</p><p>\"Yes, why don't I? Okay. Gerald was this disgusting horrible werewolf—and no, that's not redundant, so don't say it. Although it's an opinion I had myself not too long ago,\" she added, giving her husband a formidable frown. \"Anyway. This jerkoff was a wife beater, a puppy kicker, a daughter smacker. And he got the idea in his head that his wife was giving him too many girl babies . . . he really wanted a son.</p><p>Never mind biology and X chromosomes and that any idiot knows that sperm dictates the baby's sex . .</p><p>.\"</p> <p>\"Honey . . .\"</p><p>\"Right, right, I'm staying focused. I am. Anyway. He kills his wife—nice, huh? And my husband decided the guy's ass was grass, except Gerald's daughters—he had three—intervened on their dad's behalf.</p><p>Begged for his life. So Michael felt sorry for the girls and banished Gerald from the pack. So he went away and did whatever rogue werewolves do.</p><p>\"Then, when I got pregnant and turned up here, Gerald snuck back to town and tried to kidnap me. He got onto the grounds during a full moon and hurt a lot of people, so I shot him. The end.\"</p><p>\"And when was this?\"</p><p>\"Almost a year ago.\"</p><p>Jared shook his head. \"That's not right. There have been six or seven murders since then. Same M.O.</p><p>I've been researching every murder that matched my sister's.\"</p> <p>Moira turned to him, surprised. \"A serial killer? I thought you were focused on your sister.\"</p><p>\"I started out focused on one death. Then, when I started digging, I realized there was a lot more going on.\"</p><p>\"All the murders happening during a full moon,\" Michael said.</p><p>\"Yes. That's how I knew it was one of you . . .\" Freaks? Monsters? Degenerate killers? \". . . people.\"</p><p>Michael let that pass. \"And do the victims all look alike?\"</p><p>Wyndham, Jared realized with growing excitement, knew something. \"Yes. They're all between five foot two and five foot four. They've all got long dark hair parted on the left, and blue eyes. Very pale skin.\"</p><p>Jared watched Moira's eyes widen with understanding. \"What is it, babe?\"</p><p>\"You've just described Gerald's late wife,\" she said, almost gasped. \"That's exactly what she looked like!\"</p><p>\"But Gerald's dead,\" Jeannie protested. \"Nobody's got any reason to kill women who look like his wife.\"</p><p>\"Are you sure he's dead? I mean . . . he's a werewolf.\"</p><p>\"Yeah, that's right.\" Jeannie replied, nodding. \"A werewolf. Not a living god.\"</p><p>Michael coughed modestly. \"Well . . .\"</p><p>\"Shut up, honey. Werewolves are perfectly mortal. I put multiple bullets in Gerald's head. He's deader than the dodo bird, trust me, Rocky.\"</p><p>\"Well, his daughters aren't,\" Moira said quietly. \"Maybe we should go have a talk with them. Don't they still live around here?\" Then she froze. Everything within her locked for a long moment; shock had rendered her incapable of moving, even blinking.</p><p>\"Moira . . . Moira!\" Jared shook her arm lightly. \"What is it? What's the matter?\"</p><p>She gulped. Looked at Jared, then at Michael. \"Geraldine,\" she said hoarsely. \"Geraldine killed Jared's sister. Geraldine killed them all.\"</p><p>Uproar. But Jared said nothing. Just kept his gaze on Moira while she continued. \"Remember, Michael?</p><p>She was here early this week. Passing through town, she said. She's a loner, a drifter . . . Geraldine—\"</p><p>\"Geraldine, named for her father,\" Michael said with deadly quiet. \"Geraldine, the eldest. The son Gerald wanted more than he wanted anything. How long did he pour poison in her ears, I wonder? How long has she been killing her mother over and over again, to appease her father, himself a year in his grave? If we can track her movements . . . match them to the deaths . . .\"</p><p>\"Oh, she can't!\" Jeannie protested. \"You guys are wrong. And it's not me being humanly naive, it's not.</p><p>You're wrong, is all . . . it's not Geraldine. She was in this house. She played with my daughter, for God's sake. She's the sweetest thing, even nicer than Moira.\"</p><p>Moira, who knew herself to be far from nice, just shook her head numbly. And Michael, who'd seen Moira tear apart two armed men once upon a time, simply said, \"Gerald did not kill those women.</p><p>Geraldine did. And you know it, Jeannie . . . just give it a minute.\"</p><p>\"No,\" she said stubbornly, but a species of frightened doubt drifted across her face. \"She didn't do this.</p><p>I've had her in my home, and she didn't do this thing.\"</p><p>\"That may be true, ma'am,\" Jared said politely, but he was standing up, \"but appearances can be deceiving. As everyone in this room probably knows. I'm going to go check it out. Bye.\"</p><p>\"Not by yourself, you're not,\" Moira said, and was on her feet and after him in an instant.</p><p>\"Indeed,\" Michael said. He was on his feet.</p><p>Jared spun. \"No way. This isn't yours.\"</p><p>Michael and Jared were now chest to chest, and Moira saw with dismay that her leader's shoulders were up and he was leaning far forward, almost looming over Jared, although the men were close in height. The classic stance of a werewolf defending his territory. \"You're wrong about that, Jared. In fact, the plain truth is, this isn't yours. \"</p><p>\"Tell that to my sister. Where were you when one of your damned out-of-control dogs was ripping my sister in two?\"</p><p>Moira winced.</p><p>Michael's eyes—a weird gold color—went even more yellow. His mouth thinned and turned down in a sorrowful bow. \"Exactly. That's why this—this ungodly mess is mine. For your sister. For all the other sisters. I was asleep at the switch. Now I have to fix it.\"</p><p>\"Um, hello?\" Jeannie tapped Michael on the shoulder. \"Any reason you both can't go? I mean, don't get me wrong, all this chest-beating and me-boss batcrap is enthralling, really, but don't we have a murderer to catch?\"</p><p>Michael unhunched. Jared turned to look at Mrs. Wyndham, who stared back with raised eyebrows.</p><p>\"She's right,\" he said after a long moment. Moira sighed with relief.</p><p>\"She often is,\" Michael said fondly. \"What a pity it appears to go straight to her head.\"</p><p>\"What a pity you're going to bed with a fractured skull, pal.\" But Jeannie smiled as she said it, and the tension in the room ratcheted down several notches.</p><p>Chapter Ten</p><p>Who would go and who would stay turned out to be a moot point as Geraldine had a job. \"Which I s'pose we should have thought of,\" Jeannie commented.</p><p>Interestingly, Geraldine was a cemetery caretaker. According to her supervisor, the job was seasonal and Geraldine attended to it when she was in town. \"Sure I gave her the job,\" he replied to Michael's questions. \"Felt sorry for her. Nasty business with her dad, eh?\"</p><p>By necessity, Geraldine's hours were flexible. As she could be at work or at home, the two couples split up. Michael declined to let the rest of the family in on the problem, preferring instead to leave Lara in the pack's protection.</p><p>\"If we can't handle this ourselves,\" he explained, \"we deserve to get eaten. And if we do get eaten, I want to know Lara's safe.\"</p><p>\"Yuck-o,\" was Jeannie's only comment.</p><p>Based on what the cemetery supervisor had said, the group felt sure Geraldine was most likely to be at work, so Michael and Jeannie took that address. On that issue, Michael would not budge.</p><p>\"Arrogant asshole,\" Jared growled, jerking the car into reverse and squealing down the cemetery entrance—backward.</p><p>\"Yes.\"</p><p>\"Pushes people around all damn day.\"</p><p>\"Yes.\"</p><p>\"Wife seems nice, though. In a scary kind of way.\"</p><p>\"She's beyond marvelous.\"</p><p>He grunted. \"How come you didn't mention it?\" He brought the car around. Tires squealed. Gravel flew.</p><p>Moira, nigh-invulnerable werewolf, tightened her seatbelt. \"What?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"No. I mean, how come you didn't tap me on my shoulder like Mrs. Wyndham tapped Mikie? And suggest we both go find Geraldine? I mean, you're super-smart. You must have figured it out. After all,\"</p><p>he added with a grin, \"you weren't suffering from testosterone overload like me and Michael.\"</p><p>Shocked, Moira replied, \"That wouldn't have been my place.\" A beta female, thrusting herself between two alphas squaring off? Moira's mama didn't raise no fools. \"Besides, I figured out who murdered your sister. What . . . did I not reach high enough for you? Are you implying I'm an underachiever?\"</p><p>He had the grace to look abashed, and quickly changed the subject. \"Listen, when we get there—\"</p> <p>\"I am not staying in the car.\"</p><p>\"Yes, you are. I'm not having anything happen to you, too.\"</p><p>Touched by his concern, it was a long moment before she could speak. When she did, she told him a bald truth: \"I'm not having anything happen to you, either.\"</p><p>He smiled at her. \"Guess we're fucked, then.\"</p><p>\"Guess we are.\" As far as romantic declarations of love went, this one left much to be desired. So how come you can't stop grinning, you twit?</p> <p>Jared pulled into Geraldine's driveway sedately enough, and Moira noticed he had a pleasant look on his face. \"That's right, Geraldine, nothin' to worry about out here,\" he muttered, still smiling inanely as he shut off the engine. \"Just a fella who wants to ask you a couple of questions . . . nothin' to get excited about . .</p><p>.\"</p><p>\"Jared, really.\" Moira didn't try to hide her exasperation. \"Now I'm definitely not staying in the car. You need me for this. You've got this silly idea in your head that because the full moon isn't until tomorrow night, Geraldine is harmless. I can assure you that's not the case. Soothing words and silly grins aren't going to put her at ease. She's going to know what you want the minute she gets close enough to smell you.\"</p><p>He had been nodding politely during her lecture, but now smirked. \"And me without my Old Spice.</p><p>C'mere, sugar.\"</p><p>What on earth was wrong with the man? she thought before he grabbed her and pulled her close. She would have imagined he'd be a bundle of nerves, this close to confronting his sister's killer—</p> <p>Probable killer, her ever-logical mind interjected.</p><p>—but he practically whistled in contentment.</p><p>\"Listen, weirdo,\" was as far as she got before his tongue plunged into her mouth. With anyone else this kiss would have been an alarming development. Since the tongue belonged to Jared, it was actually a quite enjoyable development. Yes, indeed. Most pleasant. Especially the way his lips were so soft, the way he kissed and licked and nibbled and—</p><p>CLICK.</p><p>—handcuffed her to the steering wheel.</p><p>Moira sat stock-still for a thunderstruck moment. Then, heedless of the lurking Geraldine and the quiet neighborhood, she shrieked. \"What did you do? \"</p><p>\"Uh. Moira. Not so loud.\" He rubbed his ear. \"I don't have to answer that question, do I? It's—what d'you call it—rhetorical.\"</p><p>She tugged experimentally. She couldn't get over the fact that he'd ruthlessly distracted her and then shackled her like a dog.</p> <p>When she spoke, her voice was quite calm, but Jared looked at her warily anyway. \"You carry handcuffs in your car?\"</p><p>\"Hey, I was a Boy Scout before I was a Marine.\"</p><p>\" Boy Scouts carry handcuffs? \"</p><p>\"Okay, well, I'm out of here.\" And he was . . . he was opening the car, getting out, standing up. \"Sorry, honey. But no way are you going anywhere near that killer. Not while I'm still breathing.\"</p><p>\"Something which can be rectified!\" she shouted. He winced and shut the car door. \"And I'm a killer, too, you moron!\"</p><p>He snorted, then turned and started for the house.</p><p>Moira fumed inside the car. Oh, it would serve him right if she stayed docilely put while Geraldine cuisinarted his entrails. For two cents, she'd do it.</p><p>Yeah, right.</p><p>\"Lord, love has made me a fool,\" she mumbled aloud. Inwardly, she added, I have fallen in love at last. With a man who has spent his entire adult life hunting my kind. She normally got quite a kick out of irony. Not today.</p><p>She gave the handcuffs a hard yank. Metal groaned, but didn't break. She pulled again, and slipped her hand out of the now too-wide handcuff loop, then smacked it irritably, watching the cuffs swing from the steering wheel.</p><p>Well, that was that. No way would Jared be able to overlook that little feat of superhuman strength. One way or another, this would all be over tonight.</p><p>One way or another, this would all be over tonight. Jared expected to feel hot exultation, but instead only felt relief. Relief, and the hope that there could be a future with Moira after this was behind them.</p><p>Assuming she would speak to him ever again.</p><p>Well, he didn't care if she gave him the silent treatment for a damn year, if she was safe. Ten years. He'd take furious over dead any day.</p><p>Jared paused on the porch, unsure what to do next. Ring the doorbell, he supposed, and look into the woman's—Geraldine's—eyes and see if he could find murder there. He hadn't counted on the dog being a woman. He hadn't counted on a lot of things when he started this strange journey.</p><p>He heard a light thump behind him and turned just in time to see Moira's sneakered foot slip up and out of sight as she pulled herself up on the porch roof.</p><p>He ground his teeth. Christ, the woman was a damn monkey! He should have known someone that smart would have learned how to pick a lock . . . probably kept the picks in her hair as barrettes or whatever. Now she was on the roof, probably finding an open window . . . aarrgh!</p><p>He raised a fist to pound on the front door when it suddenly jerked open, hard enough to blow strands of his hair back from his face.</p><p>An enormously tall woman stood before him, grinning. Her hair was the color of damp dirt, as were her eyes. She had incredibly white teeth, which made her smile hard to bear. Quite thin, her collarbones stood out clearly against the yellow T-shirt she wore, a color which accentuated her sallow complexion.</p><p>She wore faded jeans with old stains on the thighs and knees—mud? Blood? She was barefoot and he saw her toenails were long enough to curl over the tops of her toes. He wondered in a distant part of his mind if she clicked when she walked on a wooden floor.</p><p>She looked cruel and hard, so he was unprepared for her soft, sweet, lilting voice: \"Hello. Can I help you?\"</p><p>He stared at her. His back itched where his gun was pressing against his flesh. \"Uh . . . yeah. My name is Jared Rocke. Uh—\" Why have you been killing women who look like your mama? How have you been able to fool the Wyndhams for so long? Are you aware you're the most frightening thing I've ever seen, and I used to live in Miami? \"You're Geraldine Cassick, right?\"</p><p>\"Yes, of course.\" The woman's smile widened, if that was possible. Jared nearly shuddered. He had no idea how this woman had been passing herself off as human for so long. \"Rocke. How's your dead sister? By the way, your cunt of a girlfriend isn't fooling anybody.\"</p><p>At \"your dead\" he reached for his gun. At \"by the way\" she slapped it out of his hand so quickly he didn't see her move, and didn't realize she'd cut him with her nails until later. At \"isn't fooling\" she seized his shirt collar and yanked him inside her house, shoving him hard enough to send him sliding across the hardwood floor, where he fetched up against the wall with a sickening thud. For a half second he thought the top of his head had fallen off. White stars exploded before his eyes.</p><p>\"Now I'm really gonna kick your ass,\" he groaned, hoping his vision would clear soon.</p><p>\"I'm terrified,\" she said in her weirdly cute, feminine voice. Her dad must have hated that voice, he thought dazedly, especially when he wanted a boy so bad. \"Actually, I'm relieved. I can get rid of you and get back to business. I did not like having you sniffing up my backtrail, Roque.\"</p><p>\"It's Rocke. You were waiting for me.\"</p><p>\"Of course I was!\" she said. She crossed the room with terrifying swiftness and squatted down to look at him. He could see two—no, three—of her heads, floating around him in a shaky semicircle. Her six eyes were gleaming, fanatical. \"Where better than to hang out and wait for you than here, where Michael-king-shit-werewolf and his monkey bitch live? My home, where I know everyone and they know me and oh, isn't it terrible about my dad, but you're all right, Geraldine, you poor, poor thing.\"</p><p>Jared shook his head, desperate to clear it. Ten seconds ago he'd been standing on her porch. \"Just in case I hadn't already figured you were off your fucking rocker,\" he informed her in a croak, \"I think I've got it now.\"</p><p>She ignored him. \"Except, Jared, you were supposed to kill them. \" Geraldine's tone became sweetly reproachful. \"You were supposed to come to me first, because you figured my father had been doing the killings, and I would have told you the killer was Michael ! But you—did—it—all—backwards.\" Each word was punctuated by a brisk, hard shake.</p><p>\"It wouldn't have worked, nutjob,\" he managed, fighting to loose himself from her grip. Cripes, she was barely holding him, but her fingers felt like steel. He smashed his palm into the underside of her jaw, but her head barely moved. \"You shouldn't have framed a dead man, Geraldine. That's where you took a wrong turn.\"</p><p>\"I'm going to kill that half-breed cow you've been fucking,\" she informed him with conspirational tenderness. \"I can smell her all over you. She actually let you touch her? Let a nasty, smelly, monkey touch her?\"</p><p>He tried to bring a knee up, hard, into her belly, but she shifted easily. She started choking him, throttling him almost absent-mindedly while banging his head against the floor. \"Mm—not—smelly—\" was what he managed before things started to go dark around the edges.</p><p>Suddenly her grip relaxed, and he sucked in painful breaths. Geraldine's face was, as if by magic, slashed in four long streaks, bleeding. So much blood, it rained into his face, spattered his shirt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Half-breed is all right,\" Moira said, and he realized she was directly above them. Geraldine whined, clutched her face and scuttled back, blood pouring through her long-nailed fingers, pattering to the floor.</p><p>\"It's tactless, but accurate. Calling me a plump herbivore is not. Also,\" she added, glancing down at him,</p><p>\"I'm not speaking to you. But I will save your ass.\"</p> <p>\"—get—out—of—here—\"</p><p>\"Oh, shut up. And you,\" she said to Geraldine, stalking toward her, \"are a nasty, smelly, wretched creature. Look at you. You look like you're going to Change any second. Feeling the stress of the coming full moon, Geraldine? How rude of you to show it.\"</p><p>\"You're surprised by how I look,\" Geraldine hissed back, flipping to her feet. \"That's because you never saw me. No one has ever! Seen! Me! Not your precious Michael or his bitch-dog or Derik or Mother or—my—my—\"</p><p>\"I don't care, Geraldine. It's too bad you had an unendurable childhood, but what gives you the right to kill? Worse, kill helpless humans? Nothing. Those women did nothing to you.\"</p><p>Jared watched the two women circle each other. They moved strangely—more like big cats than an accountant and a cemetery caretaker. He rubbed his eyes and looked again. Everything hurt, his throat was on fire and he was seeing two Moiras and two Geraldines, but he still couldn't look away. He noticed they were very careful about where they put their feet. It was almost like a dance or ritual—something very old, something stylized.</p> <p>\"No,\" Moira was saying, \"those poor women did absolutely nothing to deserve their fate.\"</p><p>\"They did! They—\"</p><p>Moira went on, implacable. Her voice rang with truth and scorn. \"You've shamed us all. You're crazy, but part of you knows. Part of you knows everything you are is wrong, and everything you've done. Your father—Gerald—was the worst creature I've ever known. But that doesn't excuse you. \"</p><p>\"Don't you talk about my father. You're not fit for him to piss on.\"</p><p>Moira shook her head. Her outrage had fled; now she just looked terribly tired. \"You fooled us for a long time. But it's over now. You're not killing anyone tonight.\"</p><p>\"Wrong, half-breed.\" Geraldine leapt. Moira dodged, pivoted quicker than thought, and sent her small foot into Geraldine's side. Jared's eyes widened; the 'crack' was very loud. Amazing! In between collecting college degrees for the hell of it and running the Wyndham finances, his Moira had apparently found time to get a black belt in karate.</p> <p>Incredibly, Geraldine ignored the pain of broken ribs. He couldn't believe it, but she was still moving, and moving quickly—she spun and regained her center as rapidly as an adder. Too quickly for him to follow, both women were literally at each other's throats, locked in a brutal battle.</p><p>He tried to get up. He tried. And again. But . . . too hard, everything hurt, his head was spinning, everything was so fast, how did Moira adjust to things happening so fast? It was almost as if she, too, possessed that same inhuman speed and agility, as if his Moira was one of the . . .</p><p>Geraldine howled and all the hairs on the back of Jared's neck came to rigid attention. It was every bad or frightening sound he had ever heard, times ten. Everything that was in him wanted to run from the sound, get the Hell out and never, never come back. The part of his brain devoted 100% to survival was wide awake and screaming at him to leave.</p><p>As if in response to the unearthly noise, Moira had made a final, desperate leap, and now she was—God, was she biting Geraldine? Her teeth were fastened at the juncture between Geraldine's neck and shoulder. The killer shrieked again and drove an elbow back into Moira's stomach. Moira grunted and held on. Geraldine's fist came up in a blur and then Moira was tumbling away. Geraldine pounced, quick as a cat.</p><p>Jared crawled toward them. He had no idea why. He sure as shit couldn't help Moira in his condition.</p><p>But somehow he was on his knees and he crawled, crawled. He saw Moira's hand come up, try to shove Geraldine away. Saw her claw for Geraldine's eyes. He crawled faster.</p><p>He wouldn't let this bitch kill another woman he loved.</p><p>He groped for his pants leg, for the small pistol in the ankle holster. Geraldine hadn't known about it, or hadn't cared. It was practically a toy, anyway. A one-shot Derringer. His Marine buddies would laugh themselves into hernias if they saw him with it.</p> <p>He stopped crawling. He heard another wet snap and didn't know whose bone had broken. Moira was kicking Geraldine away, turning, trying to get distance. Geraldine was giggling through a mouthful of blood. Jared found the pistol . . . and dropped it right out of his bloody grip.</p><p>\"Geraldine,\" he croaked, \"your daddy died screaming.\"</p><p>That got her attention; she snapped her head around so fast he practically heard it. Her eyes were huge; the irises looked like gold-flecked mud. \"What? What did you say, monkey?\"</p><p>\"Which word didn't you understand, cow, goat, uh—mammal with extra stomachs?\"</p><p>\"Ruminator,\" Moira suggested faintly, trying to get to her feet and failing. He could see the bulge in her left leg, below her kneecap. He'd heard her bone break.</p><p>The monster would pay for that. \"Ruminator, thanks, babe. Oh, Geraldine?\" Groping, groping. Got it.</p><p>Hang on. \"After Moira and I settle your hash, we're gonna find your dad's grave and fuck right on top of it.\" Hang on. \"That's not gonna be a problem, is—uurrggh!\"</p><p>Geraldine had jumped high in the air—impossibly high, his rational mind had trouble believing this wasn't a fantastic illusion—and landed squarely on top of him. That was fine. That was perfect. \"Bite me, dog,\"</p><p>he growled. \"Let's see those pearly whites.\"</p><p>Her head swooped toward his, ready to tear out his throat. For my sister. For my love. He could smell Geraldine's breath: rank, meaty. This is the last thing my sister saw. Oh, God, help me now. He brought the Derringer up, jammed it into her mouth so hard he felt teeth break. Had time to register the killer's almost comical look of surprise before he pulled the trigger and blew the back of her head off.</p><p>Geraldine fell forward, onto him. He screamed, in horror and despair and rage for the dead. \"Moira!\" he roared.</p><p>Somehow, Moira heaved the corpse off him. And that's about when everything went black.</p><p>Chapter Eleven</p><p>Jared opened his eyes, and Moira shrieked.</p><p>\"Owwwww!\"</p><p>\"I'm sorry,\" she said at once. He could see she was quite pale. Her eyes dominated her face and their color was deep, nearly purple, startling and mesmerizing at once. \"I'm just really, really happy you're awake.\"</p><p>\"Amen, sister.\" He started to sit up, hardly able to take his eyes off her, then just as quickly gave up and flopped back onto the bed. \"Argh, even my hair hurts. Is it dead?\"</p><p>\"Yes.\"</p><p>\"Where am I?\"</p><p>\"Wyndham Manor. Also known as Dogs R Us.\"</p><p>\"Funny girl.\" Jared glanced around the lush bedroom, which was roughly the size of his last apartment.</p><p>Sunlight streamed through the west window. It was late, then. They'd gone to Geraldine's before lunch.</p><p>\"Geraldine. God, what a mess.\"</p><p>\"That,\" Moira said tartly, \"is an understatement. FYI, none of the others can face you right now. They're so embarrassed they didn't see this before. Years ago.\"</p><p>\"They shouldn't be.\" Jared paused. Yes, he had really said that. Weirder, he'd meant it. Blaming the dogs—err, Moira's employers—had become habit. Bitter, but comforting in its familiarity.</p><p>But ten minutes with Geraldine had changed his mind about a lot of things. She'd been so fast, so ruthless. So inhuman and, at the same time, heartbreakingly victimized. \"You guys thought you solved the problem when Gerald was killed. Who could blame you? You wanted the nightmare to be over. I don't think there's blame in that.\"</p><p>\"Ha!\" Moira's tone was bitter, and Jared could see she would be blaming herself for a long time. She, who prided herself on her fine intelligence, hadn't noticed the killer living four miles from her bedroom. A difficult pill to swallow. He doubted Moira would do so gracefully.</p><p>He almost smiled. Christ, he adored her. She could have been killed—they both could have—but she never quit. She looked as innocent and delicate as a Hummel figurine, but had the temper of a wolverine and the tenaciousness of a pit bull. With rabies.</p><p>His thoughts derailed in sudden confusion. Geraldine was dead. His sister was avenged. Now what?</p><p>Settle down with Moira? His life had been about vengeance since . . . well, since forever. Would there now be room for other things? Was it possible? The idea was as wonderful as it was terrifying.</p><p>Vengeance was a cold blanket, but he'd been able to wrap himself in it for years. Was there room now for more?</p><p>\"I just don't understand how she held together so long ,\" Moira muttered. She made a small fist and thumped her leg in agitation.</p><p>\"I don't know how werewolves blend in with any humans,\" he said frankly.</p><p>Moira shook her head. \"It's necessary. It's a skill learned early. What you saw—that wouldn't have fooled anyone. I think Geraldine was tired. She was tired, she wanted to be done. She quit holding herself together and stayed in her little house and waited for it to be over.\"</p><p>Jared thought back to the look on Geraldine's face when he shot her. Surprise, and . . . relief?</p><p>He would have bet his gun collection on it.</p><p>\"By the way,\" the love of his life interrupted his thoughts with heavy sarcasm,</p><p>\"Mister-I-can-take-on-a-werewolf-in-her-prime-so-stay-in-the-car-Moira, you're not moving from that bed for a week. Among other things, you've got a nasty concussion and cracked ribs.\"</p><p>\"I've got . . .\" Memory returned; he lunged forward. \"How's your leg?\"</p><p>\"Lie back down.\" She gently pushed him back against the pillows. \"My leg?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It broke. I heard it break. Maybe we should take you to the hospital. Has Wyndham called a doctor?\"</p><p>\"Wyndham set it for me. You know, it wouldn't hurt you to call him Michael. Stop trying to get up.\" She sat down in the chair next to the bed, and propped her leg up on the mattress. The swelling was nasty, but Jared couldn't see the lump of broken bone any longer. Her leg was tightly wrapped in elastic. Not plaster.</p><p>\"Huh. I guess it didn't break.\"</p> <p>\"Jared.\"</p><p>\"Lucky for you, sugar, because that could have been nasty.\"</p><p>\"Jared.\"</p><p>\"And by the way, you must have had some kind of adrenaline rush in that hell house. You were tossing Geraldine around like she was made of paper. It was like watching the Hulk. A short blonde Hulk.\"</p><p>\" Jared. \"</p> <p>\"And I'm not staying here, cutie. Not even for you.\" He tossed the blankets back. \"This place creeps me right the hell out. I'm heading back to my place, and I'd love it if you came with me. In fact, I insist on it. I need a sexy nurse to take care of me.\"</p><p>She was staring at him. Why was she looking at him so strangely? Part of him knew, part of him was pulling back the veil so he could see. He willed the understanding away. \"Moira? Come on, let's book.</p><p>What do you say, babe?\"</p><p>\"I can't do that.\"</p><p>\"Sure, it's easy. We'll scoot down to the truck, hop in, make a quick stop at the Colonel's—I'd kill another werewolf just for some fried chicken—\"</p><p>\" I'm a werewolf.\"</p> <p>He didn't blink. \"No.\"</p><p>Her eyes widened. For a minute he thought she was going to fall out of the chair. She'd clearly been braced for any reaction except calm denial. \"Yes, I am. I'm a werewolf. Tonight when the moon rises I'll be hairier than the drain in the locker room at the YMCA.\"</p><p>He calmly folded his arms across his chest. \"No.\"</p><p>She leapt to her feet. Her cheeks were flushed, her forehead burning like a lamp. \"Jared, stop it! You know I am, you must know. I'm a werewolf.\"</p><p>He shouted, although it hurt his head like hell. \"I'm not having this discussion, no way, uh-uh, count me out, folks.\" Of course she wasn't. It was impossible. They were the monsters. She was Moira. Ergo, nuh-uh, not happening, no way.</p><p>She bellowed so loud he feared for the mirror across the room. \"I'm a werewolf!\"</p><p>No slouch in the vocals department, he roared back, \"The hell you are!\"</p><p>Moira's temper snapped. \"Of course I am, you idiot! Adrenaline rush! Come on!\"</p> <p>\"Science is on my side.\"</p><p>\"Bullshit is on your side. You would have seen it before now, if you'd allowed yourself.\"</p><p>\"You are not ,\" he repeated stubbornly.</p><p>\"I am, so, a werewolf.\"</p><p>\"You're just saying that so I don't think they're all scum. Which, by the way, they are.\"</p><p>\"They aren't, and I am one.\"</p><p>\"No, you're not.\"</p><p>\" How can you say that! You can only fool yourself for so long.\"</p><p>\"Because I can't care about one!\" he roared. \"That's absolutely impossible and not in the plan ! You're not you're not YOU ARE NOT ! You leap around like a monkey because you've got a gymnastics background, you heal quickly because—I dunno, you've got a super immune system—you don't get tired but big deal, one of my buddies can go for three days without sleep, he does it all the time and it never bothers him except he gets really bad breath from drinking all that Mountain Dew . . . people are different.\"</p><p>She was holding her head in her hands. \"Oh, my God. You're a moron.\"</p><p>\"I mean, don't get me wrong.\" He could hear himself talking fast and faster, almost babbling, but it was impossible to stop. \"You're definitely weird. I'll give you that. But the stuff you can do, it's all within the realms of good old homo sapiens. \"</p><p>\"So I'm a liar? Or just crazy?\"</p><p>He had no answer for that one. After a long pause, he said, \"I don't know. Maybe after working for werewolves all this time you think you're . . . I don't know. I'm not the brains of this team.\"</p><p>\"You got that right,\" she muttered.</p><p>\"I just know you're not one of them. You're not. I won't believe it.\" And you can't make me, he added silently, stubbornly.</p><p>\"Why?\"</p><p>Because she had nothing, not one fucking thing, in common with Geraldine. Because he wanted to marry her and have kids with her and his kids weren't going to be fuzzy. Because his sister's killer was dead and he wanted to finally build a life without grief. Because.</p><p>\"I just won't.\"</p><p>\"You said you couldn't care about a werewolf,\" she said slowly, and now she stood, and walked to the door (without a limp, his mind pointed out treacherously) and turned. Her eyes shone with unshed tears.</p><p>\"I take that to mean you think you care about me.\"</p><p>\"Yes.\" He paused. \"I'm sorry. I had about a thousand nicer ways planned to tell you. I didn't mean to just blurt it out in mid-yell. I do care, Moira. From the minute you hightailed it down the road dressed in my shower curtain, I never wanted anything bad to happen to you, ever.\"</p><p>She winced away from him, as if his words hurt her. \"You care about a lie then, Jared. There's no shame in not knowing things. But I won't be with someone who puts on blinders on purpose. And won't take them off, no matter what he hears and what he sees.\" She wrenched open the door and fled.</p><p>\"Moira, don't go!\" He slapped his hands over his eyes and writhed in agony. \"Oh, God, my head . . .</p><p>fuck.\"</p><p>The door slammed open, hard enough to crash against the wall and stick as the doorknob was imbedded in the wood.</p><p>A large, blonde man filled the doorway. Filled. His hair was the color of the sun, cut brutally short. His eyes were a deep, mesmerizing green. He was broad-shouldered and the T-shirt he wore did nothing to hide his excellent muscle definition. Given the man's ridiculously good looks and powerful build, Jared assumed he was dealing with a Wyndham werewolf.</p><p>\"I'm going to shove your head so far up your ass,\" the man said with ominous calm, \"that you'll be able to kiss your own colon.\"</p><p>\"Go chase a mail truck,\" Jared snapped. \"I've got bigger problems than whatever bit you on the ass today.\"</p><p>The man blinked. Held up one finger. Paused. Turned. Left. Jared heard a muffled sound from the hall—a snort? A chuckle? Then the stranger returned, looking stormier than ever. \"You blew it, Monkeyboy.\"</p><p>\"It's Rocke.\"</p><p>\"Moira hasn't given a guy so much as a come-hither look in years, and you had her. She was yours, all you had to do was ask! She saves your life, helps you avenge your sister, then finally screws up her courage and tells your bigoted sorry ass the truth, and you rejected everything she is.\"</p><p>\"Did you actually say come-hither?\"</p><p>\"Stop making me laugh. This is a serious thing, ape face.\"</p><p>\"It's Jared Rocke , do I have to paint it on my forehead?\"</p><p>\"I'm going to throw you out the window.\" This in the same tone someone else might have said, \"I'm going to fix you a cup of coffee.\" \"The fall will probably kill you, but you'll be out of Moira's hair, and it'll make me feel better. Also, you deserve multiple broken bones for making my friend cry.\"</p><p>So saying, the man moved with that same terrifying quickness Geraldine had demonstrated. He seized the footboard of the bed and shoved. As if it was sliding across ice, the bed zipped across the carpet and slammed against the far wall . . . uncomfortably close to the window. But to Jared's human senses, the man had finished with \". . . making my friend cry.\" and suddenly his bed was against the window.</p><p>He supposed he should have been terrified.</p><p>\"Bring it on, German Shepherd!\" His head pounding, Jared thrashed feebly among the blankets. \"As soon as I get out of this bed, we'll see who goes out the window!\"</p><p>\"Crud.\" The man blew out his breath in disgust. \"I forgot your injuries wouldn't have healed yet. You guys are made of tissue paper, I swear.\"</p><p>\"Derik!\"</p><p>\"What?\" The man turned. Wyndham's wife stood in the doorway, hands on her hips. Jared inwardly groaned.</p><p>\"Keep your hands off him, \"Jeannie warned, looking cutely threatening.</p><p>\"I was only going to slap him around a little,\" Derik said defensively. \"Wasn't even going to break the skin. Much.\"</p><p>\"You and what army, Liver Snack breath?\" Jared jeered.</p><p>\"See? See? This guy's an asshole squared. And he made Moira cry.\" Derik kicked the footboard. Jared heard the 'crunch' of splintering wood. \"For which he will bleed and puke and beg.\"</p><p>\"Moira would jam your ass up to your shoulderblades—\"</p><p>\"Worth it,\" Derik said stubbornly.</p><p>\"—and you know it. Besides, that's why I'm here. Ole Rockhead's got a concussion, so I figured I'd shriek at him for half an hour or so until he agreed to go after Moira.\"</p><p>At last the bickering couple had his attention. \"Go after her? Where's she gone?\"</p><p>\"You think she was going to stay here ? Tonight? She's out of here, pal. I doubt she'll be back until she gets word that you've moved on. Let me know,\" Derik added with a giant, toothy, terrifying smile, \"if you need help packing.\"</p><p>Jared threw back the bedcovers again and stood. Instantly, the floor rushed up to his head. \"What the—?\"</p><p>Jeannie and Derik were bending over him. \"You can't go anywhere,\" she informed him, while he tried to get up off the floor. \"Geraldine really rattled your cage. You've got a bad concussion and about a zillion minor injuries.\"</p><p>\"My knees work,\" he said through gritted teeth. Slowly, painfully, he rolled over onto all fours and started crawling for the door. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Aw, nuts,\" Derik sighed.</p><p>\"What?\"</p><p>\"I could get to like this puke.\"</p><p>Hand, hand, knee, knee. Hand, hand, knee, knee. What the hell had they done with his clothes? Oh, well . . . Derik could use a good mooning. Hand, hand, knee, knee.</p> <p>\"What if one of you guys gave him a transfusion?\" Jeannie asked.</p><p>\"It'd probably work,\" Derik replied indifferently. \"Speed up his healing for a day or so. Enough to fix him up.\"</p><p>\"Well, let's give him some blood, then.\"</p><p>\"Forget it. He's too stupid to let you help.\"</p><p>\"Hello?\" Jared called irritably. He kept his gaze fixed on the bedroom door, which was now a mere eighteen miles away. \"I can hear you two.\"</p> <p>\"I disagree,\" Jeannie said. \"Not about him being stupid—\"</p><p>\"And me without my gun,\" Jared muttered.</p><p>\"—but he'd probably do it if it meant he could get to Moira that much sooner. And Derik, it's really important he get to her before sundown. Isn't it ?\"</p><p>\"Don't yell, I'm standing right in front of you. And I'm telling you, he won't do it. His tiny little mind can't get around the idea, and even if it did, he's a bigot. He's a—an anti-werewolfite!\"</p><p>\"Dammit, you two, am I even in the room?\"</p><p>\"Shut up,\" they said in unison. Then, from Jeannie, \"No, wait. Derik, pick him up, would you?\"</p> <p>At once Jared felt himself effortlessly lifted and scooped into Derik's arms, as if he were a baby. A big, scowling, hairy baby. \"I have to go,\" he nearly shouted, \"and you two aren't helping.\" Moira was out there alone, thinking God knew what . . . because he was a jackass. He had to fix it right away. The thought of her unhappiness tormented him. He'd rather swallow a wasps' nest than be responsible for her pain.</p><p>Derik placed him on the bed, and Jeannie slapped her palms against his chest to keep him from rising.</p><p>\"Jared, if we give you a pint of werewolf blood, your injuries will be healed within the hour.\"</p><p>He stared at them.</p><p>\"I told you,\" Derik said triumphantly. \"Too dumb. He has no idea what you're talking about. Look, any minute he's going to start drooling.\"</p><p>There was a 'thud' as Jeannie's sneakered foot landed on Derik's instep. The smile on her face never wavered. \"What do you say, Rocky?\"</p><p>\"I say you guys better not let word of this get out,\" he replied slowly. Thinking: I'm going to pay a high price for my foolishness . . . but if it'll get Moira back, it's worth it. \"People will hunt you down just for the properties in your blood. You'd be werewolves and we'd be . . . vampires, I guess.\"</p><p>\"Okay,\" Derik muttered, \" not so dumb.\"</p> <p>\"Let's do it,\" he said firmly. \"Right now. I gotta find Moira. She made me care and by God, she's stuck with me.\"</p><p>Jeannie pretended to wipe away a tear. \"That's so beautiful.\"</p><p>\"What are we standing around for? Make a fist, Lassie Boy. Somebody get a needle,\" Jared ordered.</p><p>Derik snorted. \"A) I wouldn't piss down your throat if your heart was on fire . . .\"</p><p>\"Gross!\" Jeannie cried.</p><p>\". . . and b) I'm not giving you shit. Besides, we keep some blood on hand in case Jeannie gets hurt, or one of our other human friends.\"</p><p>\"Derik,\" Jeannie said reprovingly, \"you shouldn't—\"</p><p>\"Back off, blondie. I've known Moira my whole life. I'm not much interested in helping someone who makes her feel the way Fucko did today.\"</p><p>\"Fucko is going to try to make things right,\" Jared said. \"So get me that blood—\"</p><p>\"Don't say it,\" Derik warned.</p><p>\"Fetch!\"</p><p>Chapter Twelve</p><p>Jared ran. He ran past the rose garden, into the woods. His headache was gone. His pain was gone. He felt like he could jump over the mansion. He felt like he could defeat an army. All this, from a pint of werewolf blood.</p><p>He understood the pack's secrecy, the way they kept to themselves. And he respected their discipline in a way he never could have before. What was to stop werewolves from taking over the world? From slaughtering humans like cattle? Wyndham, of course. Wyndham kept them in line. And dealt with the rogues, when he had to.</p><p>He'd never love them, Jared thought, leaping over a felled tree trunk, nimble as a gazelle. Or a wolf. But he could sure learn to respect the hell out of them.</p><p>He turned his thoughts away from the pack, toward Moira. He could actually smell her . . . her light, flowery scent, like spring violets, called to him. He had thought finding her would be tricky in the woods, the dark. About as tricky as tying his shoes. Jeannie had warned him the effects of the blood—the heightened senses—would wear off by daybreak, but he didn't care. He only needed a little more—there!</p><p>He burst into a clearing and saw her. She was nude, kneeling on the grass. She was crying, he saw with dismay, and soothing herself by rocking back and forth.</p><p>They all have their favorite places, Jeannie had said. Places they go when they don't want us to see them. Or hear them. Moira's is the clearing just past the orchard. She'll be there, Jared, and you'd better be nice to her when you find her.</p><p>He had promised. He would have promised anything. And now here was Moira, so upset she hadn't spotted him. Here was Moira, sobbing so hard her back shook with it. He had done this. Through stupidity or willfulness or plain Rocke stubbornness, he had wrought this.</p><p>He had no idea how to fix it.</p><p>He took a slow step forward just as Moira threw her head back. \"Oh!\" she cried, almost screamed.</p><p>\"Oh! Ohhhh . . . ohhhhhhhhhhhh . . . ouuuuuuuhhhhhhh . . . oooooooooooooo!\"</p><p>One minute he was watching her cry, helpless. The next—and it was that fast, that quick, if he'd blinked he'd have missed it—she was standing on four paws. Her champagne-colored fur riffled in the brisk wind. The moon came out from behind the clouds and still she cried up at the moon, a wolf who dreamed she was a woman, or a woman who dreamed she was a wolf.</p><p>He sat on the ground. He hadn't thought to, but really had no choice . . . his knees unhinged and bam!</p><p>He was on his ass in the leaves. Suddenly, he was very glad— very glad—he didn't have his gun. He didn't want his hands anywhere near a weapon right now when he was so terrified. And fascinated.</p><p>He'd seen a werewolf change before, of course. Had been revolted, of course. But that had been a thug, someone he used for information. It hadn't been someone he cared about. Someone he'd held, kissed, made love to in the dead of night. Showered with. Cooked breakfast for. Oh, hell, it wasn't Moira.</p><p>And he'd denied her. Told her she couldn't be a werewolf. Shrugged off her confession, turned his back on what she was. For what? For vengeance? Renee was revenged. For his stupid, human sense of the way things should be? Or simply because he didn't know how to open to her?</p><p>\"Moira,\" he said, but what came out was a whisper.</p><p>She turned and looked at him. In the moonlight, her eyes were dark purple. She was as gorgeous a wolf as she was a woman.</p><p>She stepped away—no, cringed away, and he felt his face get hot with shame. He had done that. Taken a fearless, gorgeous creature and made her cower like a whipped hound. In a flash of understanding, he realized Moira was all the things he cared about—good, intelligent, strong, willful, charming—because of her heritage, not in spite of it.</p><p>Too bad he hadn't figured that out a little earlier.</p><p>\"Moira,\" he said again, just as the wolf—just as his wolf spun and ran out of the clearing.</p><p>He sprinted after her. \"Wait! I get it now! You're a werewolf! Great! Good! I figured it out!\" And all she had to do was change right before his eyes because he was so fucking stupid. But he wouldn't say that . .</p><p>. not when she already knew . . .</p><p>\"It's okay! The kids can be furry! I don't care, I swear!\" Could she even understand English in her wolf form?</p><p>A tree branch swiped him across the cheek, hard enough to make his eyes water. He plunged ahead, ignoring the pain. \"Moira, come back! I don't care that you've got more chest hair than I do!\"</p><p>He was glad Jeannie had insisted he borrow a pair of Wyndham's sweatpants. They afforded his legs some protection, but the branches were scratching the shit out of his arms, chest, and face. It didn't matter. He had it coming, anyway.</p><p>Tripping over an exposed root, he went sprawling, sliding on his stomach across the forest floor.</p><p>Gasping, he rolled to his feet and saw another wolf, one much bigger, with fur the color of sunlight and eyes so vividly green they were nearly hypnotic. The wolf's paws were as big as each of Jared's hands.</p><p>Muscles flexed and bunched beneath the luxurious pelt as the wolf started toward him, laughing.</p><p>Laughing?</p><p>Yes. A wolf-laugh—Jared hadn't imagined such a thing was possible. The wolf made chuffing noises in its throat, and there was definitely an amused gleam in its eyes. Still, as it crossed in front of Jared, the wolf let out a warning growl and Jared realized that although the wolf didn't like him, it couldn't keep from laughing.</p><p>Derik.</p><p>And, on the heels of that thought, Jared realized he was in the middle of a forest filled with werewolves.</p><p>\"I don't care,\" he said out loud, but of course he did care. He cared a shitload. \"I'm not leaving without Moira.\"</p><p>He saw her, peeking at him from behind a tree. She had stopped running, then. Or . . . maybe heard him and came back? His heart pounded giddily at the thought.</p><p>\"Moira, I'm sorry. I'm about ten thousand kinds of fool. Don't run anymore, and don't be afraid.\"</p><p>Slowly, the small, light-colored wolf came forward, staring at him. He couldn't read her expression as he could Derik's. In this moment, he had no idea if that was a good thing, or a bad thing.</p><p>She scratched at the dirt with her paw. Even her paws were small and delicate; the claws looked like mother-of-pearl. Scratching at the dirt . . . symbols? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Letters.</p><p>He went down on one knee to look. The moon was riding high, so bright it was hard to look at, lending more than enough light so he could see . . .</p><p>I-D-I-O-T.</p> <p>He grinned down on her. \"Oh, baby,\" he said, and gently reached out to touch her thick, glorious fur. \"It must be love.\"</p><p>Chapter Thirteen</p><p>Moira moved silently through her room. Jared was asleep in her bed in the mansion, but she was too tired to be surprised. Sunrise after the moon had ridden her always left its mark; all she wanted was a quick shower and a ten-hour nap.</p><p>She remembered last night fairly clearly. Of course she didn't process information the same way as a human and a wolf. But she remembered seeing him in the clearing, knowing he had watched her Change.</p><p>She remembered her hot shame, and running.</p> <p>And then he'd come after her, Moira recalled.</p><p>She turned on the shower and stepped inside before the water had time to warm. He had come, had run after her yelling the silliest things, and making as much noise as a herd of rhinos on speed. Derik had actually rolled onto his back and waved all four paws in the air; it had been just too funny.</p><p>And despite his feelings on the subject of Jared—his loudly voiced feelings—Derik, a creature of irresistible curiosity, had gone back. He always liked a good show. Moira had followed, more concerned that Jared would trip and drive a branch through his eye than anything else.</p><p>And there he had been, scratched, bleeding from half a dozen places, and smelling strongly of the werewolf blood Jeannie had no doubt transfused into him. He hadn't flinched from her wolf form, hadn't pulled a gun on her.</p><p>Instead, he had told her the most amazing things. And touched her fur with a child's wonder. Even now, she could hardly believe he'd done that.</p><p>But now what? Happily ever after? Was it possible? More, was it what she wanted?</p> <p>She finished showering, toweled herself dry, then slipped into bed. Beside her, Jared didn't even stir.</p><p>She wasn't surprised; he was likely more tired than she was.</p><p>Time enough to worry about their future (what future?) later.</p><p>She woke, practically purring. Flexed, hard. Gasped. And came, her orgasm a sweet surprise, like peeling an orange and finding a chocolate inside.</p><p>Jared's head was between her thighs, his fingers held her apart as he slowly and steadily licked, licked, licked. Given how wet she felt—how terrific she felt!—he'd obviously been at this for a few minutes at least.</p><p>\"Jared . . .\" A groan.</p><p>He laughed against her flesh. \"Shut up, darling.\" His tongue, inside her. Now gone, and lightly stabbing her throbbing clit. His fingers, inside her, now gone. Rubbing, getting slick with her juice.</p><p>She could smell his arousal, violent and sharp, like cedar on fire. His need kindled her own; she realized she wasn't gasping, she was panting, heaving for breath, desperate to have him inside her.</p> <p>And part of her, the fraction of the one percent of her concentration not focused on coming again, thought this was just fine. He wouldn't be here with me, touching me, if he didn't still want to be with me. She felt the sweet spasms of another orgasm ripple through her, and moaned.</p><p>\"Jared,\" she said again, and reached for him.</p><p>\"Moira, sweetie, I'm going to need a little help here.\" He was moving up her body, touching her everywhere with hands that smelled like sex. \"Also, you're going to marry me.\"</p><p>\"I—\"</p><p>\"But just so there's no doubt. I mean, I get that you're ten times stronger than me and twice as smart. No problem. But between us, sugar, there's never going to be any doubt about who wears the pants in the Rocke family.\"</p><p>\"Can't you stop talking,\" she groaned, wild with impatience, \"and fuck me?\"</p><p>\"Sure thing.\" He had crawled up far enough so that he was crouching over her chest, kneeling on her hands. The pressure was firm, but not painful. Her leverage, however, was for shit. \"But first I need your mouth.\"</p><p>\"Wha—\" Then his hot, hard length was pushing past her lips, his musky scent was in her nostrils, her throat. He throbbed between her cheeks. She shifted her weight to take more of him, and realized she couldn't move.</p><p>Not that this was such a problem. But still. The idea. Jared had her pinned and despite her strength, there (was his cock, thick and rude) wasn't much to be done about it. Not that Jared (was rocking back and forth, pushing himself in and out of her mouth) would ever hurt her, but the fact was, she was giving him a blowjob whether she liked it or not. She (could feel her jaws forced wide, to accommodate him, could taste his saltiness) happened to like it. But wasn't that beside the point?</p><p>Then he was pulsing and her mouth was flooded with that bitter sweetness so peculiar to semen. He groaned as she swallowed, and his hands were in her hair, roughly caressing her curls.</p><p>He pulled out, and away, and collapsed beside her. \"Definitely not the most PC moment of my life,\" he sighed, and pulled her into his arms.</p><p>\"Do you even know what that stands for?\" She tried to be irritated, but in truth, felt almost indecently satisfied. She could still taste him in her mouth.</p><p>\"Perfect Cookies. You are, you know.\"</p><p>\"What?\" She cuddled against his side, ran her fingers gently over the scratches on his chest.</p><p>\"Going to marry me.\"</p><p>\"Gosh, Jared, are you sure ! I mean, I'm so demented about being a werewolf and all . . .\"</p><p>He squinched his eyes shut. \"Okay, okay, I deserved that, have mercy. I suck, all right? Although, not as well as you do . . .\"</p><p>She poked him in the ribs, hard. \"Pig. And excuse me, but I can't help being astonished at how easy this is. I mean . . . Jared . . . I'm one of the monsters. The creature you sought for years.\"</p><p>\"Nope. Geraldine . . . she was the creature. You're the woman I love.\"</p><p>She digested that in silence, absently toying with the hair on his chest.</p><p>\"I mean, Geraldine was just one person in the . . . the group. Pack. Whatever. One person . . . she didn't define the pack. I can't paint all the other werewolves with the same brush.\" He paused expectantly.</p><p>\"What do you want, applause?\" She smiled and rolled her eyes at him. \"You're not telling me anything I don't know.\"</p><p>\"All I'm saying is, werewolves are like anybody else. They're some really fabulous ones—\" He squeezed her. \"—and some major assholes, but most of them are in between.\" Another expectant pause.</p><p>\"Jared, I know all this. I've been trying to get this idea through your head for days.\"</p><p>\"Well,\" he said tentatively, \"what kind of werewolf do you think I'll be?\"</p><p>She went up on one elbow; stared at him. \"What?\"</p><p>\"Jeannie gave me a whole pint of werewolf blood . . .\"</p><p>\"I know; I smelled it on you last night.\"</p><p>\". . . so I could get healed and go after you. I guess I'll get pretty hairy in a month or so.\" He contemplated his chest a little worriedly. \"Hairier, I mean.\"</p><p>Astonishment left her wordless for a long moment. \"You thought that the transfusion would make you pack . . . and you did it anyway. So you could find me.\" She could feel her face get hot; her eyes filled.</p><p>\"Oh, Jared . . .\"</p><p>\"Don't cry, babe. You can show me all the werewolf tricks. It'll be fine.\"</p><p>\". . . you're such an idiot.\"</p><p>One golden eyebrow went up. \"That's not very romantic.\"</p><p>\"I told you before,\" she explained, laughing through her tears, \"being a werewolf isn't something you can catch. You either are one, or you aren't. You could have a transfusion every day for a year, but you'd never howl at the moon.\" She kissed him on the mouth, a hearty smack. \"But to think that you didn't know . . . and you did it anyway . . . I love you. For all sorts of reasons, but most of all for this.\"</p><p>\"Hey, it was nothing,\" he bragged. \"And I love you, too. And you are going to marry me.\"</p><p>\"Yes, so you keep telling me.\"</p><p>He showed her his vulnerable side as he squeezed her again. \"Yeah, but you haven't answered.\"</p><p>\"Of course I'll marry you. I've been waiting for you . . .\" She thought back over the vista of lonely years.</p><p>\". . . for a long time.\"</p><p>He kissed her again, a hearty smack on the mouth. \"I've got about a million questions. Like, if you shave your legs when you're in your human form, will your wolf form have bare legs? And how much Nair do you go through in a month, anyway?\"</p><p>She closed her eyes. \"I think I liked it better when you refused to see the truth.\"</p><p>\"And what if we're making love and the moon comes up? I mean, I'm an open-minded guy, but—\"</p><p>\"Jared,\" she groaned, \"you're killing me. And you'd better be teasing, because that's both ridiculous and disgusting. I can see I'm going to have to get you some books.\"</p><p>\"So, how strong are you? Can you lift a car up over your head?\"</p><p>\"Jared . . .\"</p><p>\"Not a serious car, like a Cadillac . . . how about a Volkswagen, could you lift a Volkswagen?\"</p><p>\"Jared!\"</p><p>\"Quick! Let's arm wrestle. Winner has to do all the dishes for life.\"</p><p>She poked him in the shoulder, hard. \"I can't believe I yearned for the day you'd accept the truth.\"</p><p>\"Be careful what you wish for, bay-bee.\" His teasing grin faded and he looked at her anxiously.</p><p>\"Can we have kids? I mean . . . can you . . . with a regular guy?\"</p><p>\"Yes.\" And they'll be very special. You never knew what you got when a human mated with a werewolf. You might get a werewolf. You might get a human. You might get a human with extraordinary strength and agility. You might get a werewolf who could control their Change. It was always a toss of the dice. It was always exciting.</p><p>\"What will they be?\" His gaze was curious, wondering. His fingers moved softly over her belly, as if already feeling for the life within. She could feel him against her thigh, already hard again, and hot. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>Wanting her as badly as she wanted him.</p><p>\"They'll be whatever they want to be,\" she said, and kissed him again, pulled him to her, and opened herself to him. Body and soul. </p>  </body></html>"]