["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>Karina Tucker took a deep breath. “Jacob, do not hit Emily again. Emily, let go of his hair. Don’t make me stop this car!”</p><p>Her daughter’s face swung into the rearview mirror, outraged as only a six-year-old could be. “Mom, he started it!”</p><p>“I don’t care who started it. If you don’t be quiet right now, things will happen!”</p> <p>“What things?” Melissa whined. Megan, her twin, stuck her tongue out.</p><p>Karina furrowed her eyebrows, trying to look mean in the rearview mirror. “Horrible things.”</p><p>The four children quieted in the back of the van, trying to figure out what “horrible things” meant. The quiet wouldn’t last. Karina drove on. The next time Jill called to ask her if she would chaperone a gaggle of first graders for a school field trip, she would claim to have the bubonic plague instead.</p><p>The trip itself wasn’t that awful. The sun shone bright, and the drive down to the old-timey village, forty-five minutes from Chikasha, was downright pleasant. Nothing but clear sky and flat Oklahoma fields with an occasional thin line of forest between them to break the wind. But now, after a day of hayrides and watching butter being churned and iron nails being hammered, the kids were tired and cranky. They’d been on the road for twenty minutes and the lot of them had already engaged in a World War III–scale conflict three times. She imagined the other parents hadn’t fared any better. As the six cars made their way up the rural road, Karina could almost hear the whining emanating from the vehicles ahead of her.</p><p>They should have just gotten a school bus. But Jill had panicked half of the parents over the bus not having seat belts. In retrospect, the whole thing seemed silly. Thousands of children rode school buses every day with no problems, seat belts or not. Unfortunately, creating panic was one of her best friend’s talents. Jill meant well, but her life was a string of self-created emergencies, which she then cheerfully overcame. Usually Karina pulled her off the edge of the cliff, but with Emily involved, it was hard to maintain perspective.</p> <p>This pointless worry really had to stop. Emily wasn’t made of glass. Eventually Karina would have to let her go on a trip or to a sleepover without her mommy. The thought made Karina squirm. After Jonathan died, she’d taken Emily to a grief counselor, who offered to work with her as well. Karina had turned it down. She’d already been through it, when her parents passed away, and it hadn’t made things any easier.</p><p>Her cell beeped. Karina pushed the button on her hands-free set. “Yes?”</p><p>“How are you holding up?” Jill’s voice chirped.</p><p>“Fantastic.” Would be even better if she didn’t have to talk on the phone while driving. “You?”</p><p>“I need to go potty!” Jacob announced from the back.</p><p>“Robert called Savannah a B word. Other than that we’re good,” Jill reported.</p> <p>“I really need to go. Or I’ll poop in my pants. And then there’ll be a big stain . . .”</p><p>“Listen, Jacob needs to go potty.” She caught sight of a dark blue sign rising above the trees. “I’m going to pull over at the motel ahead of you.”</p><p>“What motel?”</p><p>“The one on the right. With the big blue sign, says Motel Sunrise?”</p><p>“Where?” Jill’s voice came through tinted with static. “I don’t see it.”</p><p>“I don’t see a motel,” Megan reported.</p><p>“Look at the blue sign.” Emily pointed at the window.</p><p>“Well, I don’t see it,” Jacob declared.</p> <p>“That’s because you’re a doofus,” Emily said.</p><p>“You suck!”</p><p>“Quiet!” Karina barked.</p><p>The exit rolled up on her right. Karina angled the car into it. “I’m taking this exit,” she said to the cell phone. “I’ll catch up with you in a minute.”</p><p>“What exit? Karina, where are you? You were right there and now you’re gone. I don’t see you in my rearview mirror . . .”</p><p>“That’s because I took the exit.”</p><p>“What exit?”</p><p>Oh, for the love of God. “I’ll talk to you later.”</p><p>The paved road brought them to a two-story building covered with dark gray stucco. Only one car, an old Jeep, sat in the parking lot.</p><p>Karina pulled up before the entrance and hesitated. The building, a crude box with small narrow windows, looked like some sort of institutional structure, an office, or even a prison. It certainly didn’t look inviting.</p><p>“Now I see it,” Megan said.</p><p>Karina shook her head. You’d think if you owned a motel, you’d want to make it seem hospitable. Plant some flowers, maybe choose a nice color for the walls, something other than battleship gray. It only made good business sense. As it was, the place radiated a grim, almost menacing air. She had a strong urge to just keep on driving.</p><p>“I have to go!” Jacob announced and farted.</p><p>Karina jumped out of the van and slid the door open. “Out.”</p><p>Fifteen seconds later, she herded them inside a small lobby. The lone woman standing behind the counter turned her head at their approach. She was skeletally thin, with long red hair dripping down past her shoulders. Karina glanced at her face and almost marched back out. The woman had eyes like a rattlesnake, no compassion, no kindness, no anger. Nothing at all.</p><p>“I’m sorry,” Karina said. “Could we please use your facilities? The little boy needs to go to the bathroom.”</p><p>The woman nodded to the archway on Karina’s right. Charming. That’s okay. They just needed to get in and get out. “Thank you! Come on, kids.”</p><p>The archway opened into a long hallway. On the left, several doors punctuated the wall, one marked “Bathroom” and another, at the very end, marked “Stairs.” On the right an older man stood in the middle of the hallway. Heavily muscled, with a face like a bulldog, he’d planted himself as if he were about to be overrun by rioters. His eyes watched her with open malice. The kids sensed it, too, and clustered around her. Karina didn’t blame them.</p><p>“Hi!”</p><p>The man said nothing.</p><p>Okay. She marched to the bathroom and swung the door open. A single-person bathroom, relatively clean. No scary strangers hiding anywhere. “In you go.” She ushered Jacob inside and stood guard by the door.</p><p>Minutes ticked off, long and viscous. The man hadn’t moved. The children kept quiet under his scrutiny, like tiny rabbits sensing a predator.</p><p>Karina knocked on the door gently. “Come on, Jacob. Let the other kids have a turn.”</p><p>“Almost done.”</p><p>Karina waited. The man kept staring at her. Gradually his face took on a new expression. Instead of staring her down, he was now studying her as if she were some bizarre alien life-form. That was even more disturbing. Karina fought a shiver.</p><p>“Jacob, we need to go.”</p><p>She heard the toilet flush. Finally.</p><p>Jacob emerged from the bathroom. “I washed my hands with soap,” he informed her. “Do you want to smell them?”</p><p>“No. Does anybody else need to go?”</p><p>They shook their heads. Emily hugged her leg. “I want to go home, Mom.”</p><p>“Excellent idea.” Karina led them down the hallway.</p><p>The man moved to block their way. “Thank you for letting us use the bathroom,” Karina said. “We’ll be on our way now.”</p><p>The man leaned forward. His nostrils fluttered. He sucked in the air through his nose and his face split in a grin. He didn’t smile; he showed her his teeth: abnormally large and sharp, triangular like shark teeth, and definitely not human.</p><p>Ice skittered down Karina’s spine.</p><p>The man took a step forward. “You ssshmell like a donor.” His teeth took up so much space in his mouth, he slurred the words.</p><p>Karina backed away, holding her hands out to shield the kids behind her. She wished she had a can of mace or a gun—some weapon in her purse other than Kleenex, her pocketbook, and a cell phone with a dead battery.</p><p>“Let us out!”</p><p>The man advanced. “Rishe! The woman ishh a donor.”</p><p>“We’ll be leaving now!” Karina put some steel into her voice. Sometimes if you looked like you were ready to fight, people backed down and looked for an easier target.</p><p>The man bared his teeth again and she glimpsed what looked like a second row of fangs behind the first in his mouth. “No, you won’t,” he said.</p><p>Time for emergency measures. “Help!” Karina screamed at the top of her lungs. “Help!”</p><p>“No help,” he assured her.</p><p>The kids began to cry.</p><p>Maybe this is a nightmare, flashed in her head. Maybe she was dreaming.</p><p>“Mom?” Emily clutched at her jeans.</p><p>Dream or not, Karina couldn’t let him get a hold of her or the kids. She kept backing away to the door behind her, the one labeled “Stairs.”</p><p>“Let us go!”</p><p>He kept coming. “Rishe! Where are you?”</p><p>The wall on their right exploded.</p><p>Splintered pieces of wood peppered the hallway, knocking the shark-toothed man back and missing Karina by mere inches. Stunned, she glanced into the gap in the wall. The redheaded woman—Rishe?—jumped over the counter and ran directly at Karina and the children, her face twisted into a grotesque mask. The skin on Rishe’s neck bulged, rolling up, as if a tennis ball slid up her throat into her mouth.</p><p>This is just crazy . . .</p><p>The woman spat.</p><p>Something dark flickered through the air. Pain stung Karina’s left side. A long thin needle, like the quill of a porcupine, sprouted from her stomach, just under the ribs. She yanked it out on pure instinct. She should’ve been terrified, but there was no time . . .</p><p>Something hit the red-haired woman from behind, arresting her in midstep. Rishe’s mouth gaped in a terrified silent scream. Huge claws grasped her face, jerked, and her head twisted completely around.</p><p>Oh, my God.</p><p>Rishe’s body fell, and beyond it Karina glimpsed a thing. Huge, dark, inhuman, it stared back at her with malevolent eyes. Its very existence was so at odds with everything Karina knew, that her mind simply refused to believe it was real. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>An odd odor saturated the air, dry and slightly metallic, like copper warmed by the sun. The thing stepped over the woman, its gaze fixed on her.</p><p>“Run!” Karina turned on her heel and dashed down the hallway, herding the children before her.</p><p>The man with shark teeth rose slowly, pulled a wooden splinter out of his eye, tossed it aside, and, with a deep bellow, charged into the lobby through the hole in the wall.</p> <p>A snarl answered him, a promise of pain and death. It whipped Karina into a frenzy. She swiped Jacob off the floor—he was the smallest—and ran faster to the heavy door barring the stairs. She jerked it open. “Up the stairs, go, go!”</p><p>They ran up, whimpering and sobbing. The same fear that drove her propelled them up the stairs better than anything she could’ve screamed.</p><p>Karina slammed the door closed, balancing Jacob on one arm, and looked for something to bar it, but the stairway was empty. Her stomach burned, the pain from the needle puncture spreading up and down her body as if her skin had caught on fire. She ran after the kids. The boy in her arms was stone heavy. They reached the top of the staircase and crowded on the landing.</p><p>Below something clanged. There it was again, the scent of hot metal burning her lungs.</p><p>Karina set Jacob down and wrenched the door open. They burst into the upstairs hallway. She scanned the rows of doors and tried to shove the nearest one open, but it was locked.</p> <p>Another—locked, too.</p><p>Third—locked.</p><p>This is a nightmare. It has to be a nightmare.</p><p>A vicious snarl chased them. Emily screamed, a high-pitched shriek that could’ve broken glass. Karina grabbed her daughter by the hand and dragged her down the hall, to the single window. “Follow me!”</p><p>Beyond the window a fire escape waited.</p><p>Karina grasped the window latch and jerked it up. Stuck.</p> <p>Her head swam. The air around her had grown scalding hot. Every breath burned her lungs from the inside out. She stumbled, caught herself on the windowsill, and pulled the sash upward with all her strength. The wood groaned and suddenly the frame slid up.</p><p>A door thumped. Kids screamed. The terrible dark beast had made it into the hallway.</p><p>She grabbed the nearest child and hurled her onto the fire escape, then the next, and the next. Little feet thudded, running down the metal stairs. Emily was last. Karina clutched her daughter to her and climbed out on the fire escape.</p><p>A black van waited below. Several men stood by the van. They had the children. They stood there silently, watching her, so calm while the kids screamed, and suddenly she realized that they and the beast inside were allies. They were trapped.</p><p>A growl washed over her.</p><p>The world gained crystal clarity, everything becoming painfully vivid and sharp. Slowly Karina turned. Her daughter hugged her, her breath a tiny warm cloud on her neck. The metal rail of the fire escape dug into Karina’s back. The thudding of her heart sounded so loud, each beat shook her rib cage like a blow from a sledgehammer. Every breath was a gift.</p><p>She saw the thing emerge from the darkness. Slowly, it solidified out of the gloom, one gargantuan paw on the windowsill, then another. Enormous claws scratched the wood. It climbed onto the windowsill and perched there, a mere foot from her. Karina stared into its eyes, inhaled its scent, and knew with absolute certainty that she was going to die.</p><p>The thing opened its maw, revealing huge fangs. Its deep voice issued forth in a single mangled word. “Donor.”</p> <p>“Are you sure?” asked a male voice from below.</p><p>The beast snarled. Karina jerked back, shielding Emily with her hands. Her legs gave out and she fell to her knees.</p><p>“My lady?” said the voice from below, closer now.</p><p>She barely turned her head, not daring to take her gaze from the monster in the window. A dark-haired man climbed the fire escape toward her. His face was preternaturally beautiful, his eyes a dark, intense blue. “I have a proposition for you, my lady . . .”</p><p>His voice faded, replaced by darkness and the feel of cotton against her body.</p><p>I agree.</p><p>Karina sat up . . . She was in her bed. The room lay dark about her. A nightmare. That was all.</p><p>Her heart thudded in her chest. She rubbed her face and her hands came away slick with cold moisture.</p><p>I agree. “I agree” to what? What did she agree to in her dream?</p><p>It didn’t matter. It was a nightmare. In the morning, she’d call the grief counselor.</p><p>Karina frowned and pushed free of the blankets. She felt a strange sense of wrongness, as if there was something very important she was missing. Something vital. A small lamp waited on the table next to the bed. She flicked it on and a cone of soft electric light illuminated the room.</p><p>The bedroom wasn’t hers.</p><p>For a moment Karina froze, and then fear caught her in its fist and squeezed. “Emily?” she whispered. “Emily?”</p><p>No answer.</p><p>She was alone in a strange bedroom.</p><p>There could be a rational explanation for this. There had to be. She just didn’t know what it was.</p><p>I agree. An echo of her voice from the dream. She had a terrible suspicion the unfamiliar bedroom and those two words were connected.</p><p>Her clothes were gone. She wore only underwear and a giant T-shirt, three sizes too big.</p><p>A pair of carefully folded jeans lay on a chair next to the bed. Her jeans, the ones she had worn on the field trip. Karina pulled them on. She had to find Emily.</p><p>The door swung open with ease and she found herself in a hallway. To the left, the hallway ended in a stairway leading up. To her right, a pool of electric light brightened the wooden floor and the rust-colored rug. Quiet voices carried on a soft discussion.</p><p>She followed the voices and stepped into a kitchen, blinking against the light. Three men sat at the round table in the center. They turned to look at her. The one sitting farthest from her wore the unearthly face of the man from her dream. His name surfaced from the depths of her memory. Arthur.</p><p>I agree.</p><p>Arthur nodded to her. “Ah. You’re up. Why don’t you sit down with us? Henry, please get a chair for Lady Karina.” His soft, intimate voice caressed her almost like a touch. It should’ve been soothing. Instead her insides clenched into a tight knot.</p><p>A tall man with a shy smile rose and held a chair out for her. So oddly domestic, all three drinking tea. Nobody was startled by her appearance. Clearly she was expected.</p><p>Karina sat. “Thank you.” The automatic response rolled from her lips before she even realized it.</p><p>“You’re welcome,” Arthur said. He leaned back with a quiet elegance, artfully posed without putting any effort into it. His hair was soft, black, and brushed back from his perfectly sculpted face. His eyebrows were equally black and so were his eyelashes, long and soft like velvet. They framed big eyes, crystalline blue, distant, and cold. Angelic, she thought. He looked like an angel, not a plump cherub, but an angel who roamed freely in the sky, possessed of heart-wrenching beauty and terrible power, an angel who had stared into the bottomless blue for so long that his eyes had absorbed its color.</p><p>“Would you like some tea?” Arthur asked.</p><p>“Children . . . ?”</p><p>“Safe,” he said and she believed the sincerity of his words even though she had no reason to do so.</p><p>Arthur rose, took a small blue mug from the shelf behind him, and poured steaming tea into it from a large kettle on the stove. He set the cup in front of her. “Please drink. It will steady your nerves.”</p><p>Karina looked at the cup.</p><p>He drank from his own cup and smiled in encouragement.</p><p>She picked up the cup and took a sip. Green tea. Odd taste, slightly sour.</p><p>Maybe she was still dreaming. The whole scene had that slightly absurd wrongness found only in dreams.</p><p>Karina looked about the table. The man who had offered her the chair, Henry, sat to her right. He was tall and whipcord lean. His face, serious with somber intelligence, lacked Arthur’s magnetism, but its sharp angles drew her all the same. His tawny hair was cut close to the scalp, but still showed a trace of a curl. His green eyes regarded her and she read pity in their depths.</p><p>The man on her left was model pretty. Strong masculine jaw, deep, dark blue eyes, high cheekbones, a mane of golden wavy hair dripping down to below his waist, hiding half of his face . . . His eyes flashed with wild humor. He gave her a wink, grinned, exposing even white teeth, and tossed his hair back. An ugly scar ripped his left cheek, almost as if something had taken a bite out of him and his flesh hadn’t healed right. She fought an urge to look away. He reached for her hand . . .</p><p>“Daniel.” Arthur’s voice gained a slight edge. “That’s extremely unwise.”</p><p>Daniel sat back.</p><p>“Just because she didn’t scream when she saw your face doesn’t mean you get to touch.” Henry refilled his cup.</p><p>“Please forgive Daniel. He doesn’t mean to be rude. He’s just forbidden to speak for the time being. Your tea is getting cold,” Arthur said.</p><p>“He tends to cause problems when he speaks,” Henry said.</p><p>Daniel gave her a smoldering smile.</p><p>She faced Arthur. “What did I agree to?”</p><p>Arthur sighed. “I see.”</p><p>Henry leaned forward. “Perhaps we should mend this.”</p><p>“Yes. The sooner, the better. Lucas might return and that would make things considerably more complicated.”</p><p>Daniel laughed softly. If wolves could laugh, they would sound just like him.</p><p>Henry held out his hand. “It’s easier if you hold on to me.”</p><p>Karina hesitated.</p><p>“You do want to remember, don’t you?” Arthur asked.</p><p>She put her hand into Henry’s. His long warm fingers closed about hers. The world tore in two and she was back on the landing of the fire escape at the not-motel, cradling Emily. Her whole body burned with a terrible ache.</p><p>Arthur leaned his head to the side, looked at them for a moment, and plucked Emily from her arms.</p><p>“No!” Karina struggled to hold on, but her hands had lost all strength.</p><p>Emily didn’t kick. Didn’t scream. Her face was completely blank, as if she had turned into a doll. Arthur turned and handed her to someone behind him on the stairs. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Emily!” Karina tried to crawl after her but her body refused to obey.</p><p>Arthur touched the hem of her black top and edged it upward. His fingers touched her stomach. Pain pierced her and she cried out.</p><p>“Ah. Now see, this isn’t good.” Arthur shook his head mournfully. “All of this must seem terribly confusing to you and our time is short, so I will keep the explanations simple. This is the house where monsters live. We are the killers of monsters. I suppose that also makes us monsters simply by necessity. I don’t know why you’re here. It’s probably a pure coincidence. An unlucky roll of the dice. You and your children were caught in the cross fire. One of the monsters poisoned you with her throat dart. The wound is fatal. You’re dying.”</p> <p>Fear shot down Karina’s spine in an icy rush. She didn’t think she could have gotten more scared, but his tone, that patient, pleasant, even tone, as if he were discussing lunch, terrified her. It’s not a dream, she realized. It’s happening. It’s happening to me right now. God, please let Emily be okay. Please. I’ll do anything.</p><p>“I can smell your fear,” Arthur said. “It rolls off your skin. A better man would feel discomfort at your pain. But I’m not a good man. I feel nothing for you. We rarely have to deal with innocent bystanders and when we do, we strive to send them back unharmed, not out of some altruistic impulse, but because we dislike attention. If you hadn’t been injured, Henry here would wipe your memory and the five of you would go merrily on your way. As it is, however, you will be dead in the next thirty minutes.”</p><p>The words refused to leave her mouth. Karina strained and forced them out. “Why are you telling me this?”</p><p>His ice-cold smile made her heart jump. “I’m talking to you because I’m about to offer you a deal. You have something we want, my lady. Your body has a genetic predisposition toward producing certain hormones one of us desperately needs. Your subspecies isn’t unique, but it’s rare enough to make you valuable. I suspect that’s also how you were able to find this place, and that’s why the yadovita, the redheaded woman, took the time to poison you instead of defending herself from us. Listen carefully, my lady, because I won’t repeat myself.”</p><p>She stared at him, committing each word to memory.</p> <p>“The creature behind you requires your blood. He will feed on you. His venom will counteract the poison that’s killing your body. In return, he will consume the chemicals your body will produce. You will give yourself to the House of Daryon. You will let the beast feed on you. You will live in quarters of our choosing. You can never leave. You can have no contact with the outside world. For your agreement to this, we will spare your life and the lives of the children.”</p><p>The thing on the windowsill let out a low whine of anticipation. That . . . that beast would feed on her. Forever. Oh, dear God. I can’t do it . . . I can’t . . .</p><p>Arthur leaned forward, his face showing no emotion beyond the pleasant, calm composure. “Consider carefully before you answer. I don’t offer this deal to you because I like you or because I’m moved by some noble emotion. I do it because we need you. What I propose won’t be pleasant for you. You won’t enjoy it. In fact, many would say you’re better off dying now.”</p><p>Fog gathered on the edge of her mind, threatening to smother her. Karina clawed at reality, trying to remain conscious.</p><p>“My daughter . . .”</p><p>The beast growled on the windowsill.</p> <p>“He guarantees her safety,” Arthur said.</p><p>“The children . . . will be returned to their families?”</p><p>“Yes.”</p><p>“I agree.”</p><p>A gentle hand seized her mind and pulled her back through time and space to the reality of the round table and the hot tea mug in her hand. She looked at Arthur.</p><p>“My daughter, Emily?”</p><p>He didn’t answer.</p><p>“You promised me the children would be returned to their families. Her father is dead. I’m the only family Emily has. Where is she?”</p> <p>He smiled, a flat curving of lips without any emotion. “She’s at the main house for the time being.”</p><p>No, she wasn’t, Karina realized. He was lying. “I want my daughter. We made a deal. Bring me my daughter, or I am leaving.”</p><p>Daniel rocked back on his chair and laughed. A door slammed. Footsteps echoed through the house. “Cooperate with Lucas and your daughter will be brought to you,” Arthur said.</p><p>A man walked into the kitchen. Tall, corded with muscle that bulged his T-shirt, he dwarfed the doorway. He wasn’t just large, he was massive and wrapped in menace, as if he were a whirlwind of violence, barely contained in the shell of his body. Black hair fell on his hard, aggressive face in long strands. He glanced at her, his eyes green and merciless. She met his gaze and gulped. It was like looking into the eyes of a tiger. His stare promised death.</p><p>Recognition sparked in his green irises and flared into rage.</p><p>He lunged forward, inhumanly quick, and hit the table with his palm. She jerked back.</p><p>“Get your hands off of her!” His voice rippled with a snarl.</p><p>Henry raised his hands in the air. The man grasped the chair, Henry still on it, and tossed it aside. Steely fingers grabbed her elbow and pulled her up. He swiped her off the floor with ridiculous ease, locking her in the crook of his arm, and snapped like a rabid dog, “Mine!”</p><p>“We have no intention of taking her from you.” Arthur sipped his tea.</p><p>“Don’t any of you fuckers touch her!”</p><p>She flailed in his arms, trying to break free, but it was like trying to push back a semi.</p><p>“You must forgive Lucas,” Arthur told her. “He tends to be overprotective of his food.”</p><p>A familiar scent of heated metal invaded her nostrils. Panic squirmed through her. She fought harder, but her feet kicked only air. He carried her away out of the kitchen back to the bedroom where she had awakened.</p><p>Chapter 2</p><p>Lucas dropped her on the bed and went to lock the door. “Stay away from Arthur. He’s a sick fuck.”</p><p>He turned and strode toward her, enormous, overwhelming in his sheer size. Karina shrank back until her spine hit the wall.</p><p>He looked her over, a long, lingering stare that made her want to cover herself, frowned and ducked into a doorway on the left. Water gushed. Lucas reappeared with a tall glass of water and handed it to her. “Drink this. It will help.”</p><p>She drank.</p><p>He sat on a chair across from her and pulled off his socks. Only now she noticed that he wasn’t wearing any shoes. He balled the socks into a clump and tossed them into the room where he’d gotten the water, then shrugged off his T-shirt. Karina’s breath caught in her throat. Faded ragged scars crisscrossed his massive back. His legs were long, his waist narrow in comparison to his vast shoulders. His lines were almost perfect. As he squared his shoulders, muscles rolled under his skin, forming hard ridges. He didn’t move—he stalked and prowled, like a huge predatory animal, menace cascading from him in waves along with his hot metallic scent.</p><p>Her memory thrust Jonathan before her. Her husband had been handsome and well built, an average-sized man. Lucas could’ve snapped him in half and wouldn’t have given it a second thought. He’d just toss the broken body aside and continue on his way. She had no chance. In a physical fight, Lucas would destroy her.</p><p>“Drink,” he said.</p><p>Karina forced some more water down. Her throat had gone dry and she drank again. Suddenly Lucas gathered himself. His gaze fixed on the door. His body tensed, his expression alert. His feet gripped the bare floorboards, his legs bent lightly, as he readied to launch himself into a leap. Muscles bunched and knotted across his shoulders and back. His arms lifted slightly, spread wide, the fingers of his big hands like talons, ready to grasp and crush. His eyes ignited with a hot, hungry fire. Poised like this, he was barely human.</p><p>Someone’s knuckles rapped on the door.</p><p>“What?” Lucas growled.</p><p>“Do you want the sedative?” Henry’s voice asked.</p><p>Lucas glanced at her and asked quietly, “Do you want to be drugged?”</p><p>“No.”</p><p>“She said no,” he snarled.</p><p>The footsteps retreated. Lucas eased, relaxing slowly, muscle by muscle. He glanced at her with his light green eyes and she shrank from his gaze.</p><p>“How much did they tell you?” he asked.</p><p>“I know what I agreed to.” She hesitated. “Are you . . . ?”</p><p>“I am.”</p><p>She tried to reconcile the beast and the man, and couldn’t. That dark, grotesque creature was huge, twice as big as Lucas. A horrible meld of ape, dog, bear—Karina struggled for a comparison, a point of reference, and could find none. Her memory was fuzzy. She remembered fangs and baleful eyes, and massive shoulders sheathed in dark fur. How was it possible? Her mind refused to admit that thing existed. But her body felt Lucas near and knew the beast was real.</p><p>She had to have an explanation. Anything at all. “Are you a vampire?” she asked.</p><p>“No.”</p><p>“What are you?”</p><p>He sighed. “There’s no myth or legend or cute explanation. People here call those like me Demons. It’s just a name, nothing religious attached to it. You might also hear people call me Subspecies 30. The rest is complicated.” He took her half-empty glass and went to top it off. “I don’t actually need your blood to sustain me. I require the endocrine hormones your body will secrete in response to my bite.”</p><p>“For what?”</p><p>“To counteract the effects of my venom. It hurts me.”</p><p>He handed her the full glass, rubbed his hand across the back of his neck, and held the palm to her face. The odor of hot metal hit her nostrils and she drew back.</p><p>“That smell means I’m hungry for you.”</p><p>He was too close. The cup trembled in Karina’s fingers. God, she was scared. It took all of her will not to scream and run. “Will it hurt?”</p><p>“Yes. It’s not like vampire movies, where the vampire bites the woman and she moans softly and comes all over herself. There’s no rapture involved. No climax. Just me chewing on you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He took her by the chin, lifting her face, and peered into her eyes. Karina pulled back. He leaned closer. She tried to scramble away, but he grasped her shoulder, keeping her still. His lips touched her forehead. “Fever.” Lucas grimaced. “Your eyes are still bloodshot.”</p><p>His presence pressed on her like a physical burden. Karina closed her eyes. She sat there, world shut out, and pretended that everything would be okay even if every instinct assured her it wouldn’t. She had to survive and adapt. She had to do whatever was necessary to get her daughter back.</p><p>When she opened her eyelids, he waited for her with a synthetic cord in his hands. She hadn’t heard him move.</p> <p>“To keep you still.” He moved toward her, uncoiling the cord.</p><p>No. Lying there tied up and completely helpless while he drank her blood would be too much. “That’s okay,” she said quickly. “I won’t change my mind.”</p><p>Lucas kept coming.</p><p>“I won’t change my mind.” Desperation put steel into her voice. “I’ve agreed to this to save my daughter. They’ll let me see her after you feed. I won’t run or fight.”</p><p>He halted.</p> <p>“Arthur said I would stay here for as long as I live. That means you have to feed frequently. Might as well start it right.”</p><p>Lucas gripped the rope. His biceps bulged. He snapped the rope apart. Karina winced. “If you’re trying to intimidate me, it’s too late. I’m already as scared as I’m going to get.”</p><p>“I’m not trying to scare you.” He rolled the section of the rope into a tight wad, wrapped the end about it several times, tied it, and dropped it in her lap. “To bite down. In case it gets too rough.”</p><p>She picked it up.</p><p>Lucas sat next to her. “Arthur isn’t in charge of your daughter. I am. I guaranteed her safety. Both of you belong to me.”</p><p>Lucas leaned to look into her face. She expected rage, hunger, some violent emotion, but instead she saw only steady calm.</p> <p>“I promise you that no matter what happens between you and me, your daughter will be safe. I will never use her against you. Everyone is afraid of me, and she will never be bullied or mistreated.”</p><p>Karina stared at him in surprise.</p><p>“You wanted to start this right,” he said. “We can do that. Let’s be honest. The bitch in the hotel poisoned you. Technically she infected you with a virus that secretes a toxin into your bloodstream. To counteract the virus, you need my venom. I’ve already bitten you once but it will take several feedings before you’re in the clear.”</p><p>“You’ve bitten me?”</p><p>“Left thigh,” he said. “I was in the attack variant at the time, and biting you anywhere else would’ve caused too much damage.”</p><p>She grabbed at her leg, trying to feel the wound through the fabric of the jeans.</p><p>“It was a very quick bite,” he said. “To keep you from dying. This will be worse.”</p><p>He was serious. The thought of him feeding on her, chewing on her, was almost too much to contemplate. “Can we do a blood transfusion instead?”</p> <p>“No. We’ve tried in the past and failed. There is some sort of relationship between your blood, my venom, and my saliva that we don’t understand. I have to feed on you. You need me to survive and I need you to . . .” He paused. “To counteract my venom.”</p><p>He was holding something back, she could feel it.</p><p>Lucas’s eyes held no mercy. “I’m a predator and my body knows that you’re my prey. Your fear is exciting. Try not to be so scared. Don’t struggle. The more you flail about and whimper, the more excited I’ll get. If you get me excited enough, I’ll chew up your veins and end up fucking you in a puddle of blood. I take it you don’t want that.”</p><p>“No.”</p><p>“Then stay calm.” He nodded at the cord in her lap. “You sure you don’t want to be tied?”</p><p>“Yes.”</p><p>Lucas stretched out on the bed, took her by the waist, and pulled her down, flush against him. They lay together, her butt pressed against his groin, her back tight against his chest. Like two lovers. Jonathan and she used to lie like this after sex. The perversity of it made her shiver.</p><p>“Lie still.” His arms pulled her tighter to him. The hard shaft of his erection dug into her butt. She tried to edge away from it.</p><p>“Don’t worry. I can’t help it, but I won’t molest you. Unless you start moaning and rubbing your ass against me.”</p><p>She stopped moving. The odor of hot copper was overpowering now. Karina cleared her throat. “I feel light-headed.”</p><p>“You’re breathing in my scent. Your body’s reacting. It will speed things up.”</p><p>That explained the shirt coming off. He wanted no fabric barriers between her and that smell, so it could roll off his skin and take her under. “Do I need to do anything?”</p><p>“Just lie there and endure. Your body needs my venom. As I said, I’ve bitten you already to kill the poison, but you got just enough to keep you alive. This will take some time.”</p><p>She brushed her hair from her neck, exposing skin. No point in drawing this out.</p><p>A low laugh answered her. He spoke into her ear, his breath a warm touch on her skin. “You ever watch hockey?”</p><p>“No.”</p><p>“The Buffalo Sabres had a goalie—Clint Malarchuk. Steve Tuttle, a guy on another team, was trying to score a goal, and as he charged at the crease, a defenseman grabbed him from behind and swung him up. Tuttle’s skate caught Malarchuk’s neck. A shallow cut, only severed the exterior jugular. Blood sprayed like water from a hose. Covered the whole crease in seconds.”</p><p>For some reason she couldn’t understand, his quiet voice steadied her nerves. “Did he survive?”</p><p>“He did. Had the skate cut a bit deeper, he would’ve been dead in about two minutes.” He gathered her even tighter against himself. “The neck nuzzling is fun, but the pressure within the jugular would expel your blood so quickly, it would kill you.” His finger traced an outline on the vein on her neck, sending electric shivers along her skin. She wished he hadn’t done that.</p><p>“If not the neck, then where?”</p><p>“The arm works well.”</p><p>“Can you . . . get on with it?”</p><p>“Not yet. The longer we wait, the less painful it will be for you.”</p><p>His body was hot against hers, his heat seeping into her. His scent enveloped her completely now. Her head spun.</p><p>“That’s it,” he prompted. “Go limp. Don’t strain.”</p><p>“I’m scared,” she told him.</p><p>“I’m sorry.” The undercurrent of violence that permeated everything he said muted slightly.</p><p>“What will happen after you feed?”</p><p>“You’ll pass out. It’s like giving blood except messier. Your body will go into shock from my venom. If you survive, you’ll get used to the feedings.”</p><p>“I might die?”</p><p>“Yes.”</p><p>“This just gets better and better.”</p><p>“Life’s a bitch.”</p><p>The room crawled. “I’m not dreaming, am I?”</p><p>“If this is your dream, you’re seriously fucked up.”</p><p>“Who are you . . . all of you?”</p><p>“You ask too many questions.”</p><p>He pulled away from her, turned her arm to him, and bit into the soft flesh just above the elbow. Pain lanced through her. Her body tensed in response, but his arms clamped her down and she could barely breathe.</p><p>It hurt. It hurt and hurt, but worse than the pain was the awful sensation of his gnawing teeth and the prickly heat squirming its way up her arm. It spread into her shoulder and fanned out, claiming her body. She wanted to break free, to get away, but Lucas held her tight.</p><p>“Promise me you will make sure my daughter is safe if I die.”</p><p>He didn’t answer.</p><p>“Promise me.”</p><p>“I promise,” he said.</p><p>Karina let herself sink into the pain. Gradually it eased into a steady ache. Her limbs relaxed. She tried to think of something else, anything else, of Emily, of their safe little apartment, of being far away in a different place. But the reality refused to recede. And so she lay there and waited it out, her entire body humming with a distinct unusual pain, until her dizziness blotted out the world and she slipped under.</p><p>Lucas nuzzled her thin neck. Feverish. Not too bad. She was healthy. And clean. The blood work from the main house had shown no abnormalities aside from the poison. That was what donors were. Resilient; resistant to most disease.</p><p>And grounded. She didn’t seem like she would snap, but he’d seen enough people break under the weight of the transition to let his guard slip. And then there was her daughter. Children complicated things.</p><p>She just lay there and let him feed.</p><p>His first donor, Robert Milder, had to be sedated for the feedings. After him, there was Galatea. He had to tie her up. Every time. She had resented her role, loathed being restrained, despised him, and yet pulled him into her bed; and when they fucked, she drained him so completely, he felt blissfully empty, as if he had poured not only his seed, but his pain into her. She took it all and reveled in it, enjoying the power she wielded over him. He wasn’t a fool. He knew she was driven by revenge, but he came back to her again and again, an idiot thirsty for a poisoned spring.</p><p>And now he had Karina.</p><p>A soothing cold spread through his veins, melting the needles of pain that always prickled him in the aftermath of his transformation from the attack variant. Funny. He had survived for six years on injections, shooting himself up every couple of days, but the synthetic hormones failed to soothe the ache. They managed to dull the pain, yet it had still gnawed at him, until he became convinced it would grind him down to nothing. Karina’s body had barely had a chance to respond to his poison, yet even this tiny dose of the hormones brought relief to him. He had forgotten what it was like not to hurt.</p><p>Lucas breathed in her scent. The memory of the chase through the motel danced through his mind. He wanted to chase her again. He felt drunk. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He slipped the narrow strap of the tank top off Karina’s shoulder, baring her left breast. Bigger, fuller, softer than he had expected. He imagined sliding his palm over the mound, brushing the nipple with his thumb. He pictured how her body would tighten in response, how the nipple would feel erect against his fingers.</p><p>He slid his fingers under the waistband of her jeans, pulled it up, and looked at the triangle of her white underwear. His cock ached. He wanted to mount her and thrust it inside her.</p><p>So what was stopping him?</p> <p>Lucas slid his hand up, to her slightly rounded stomach, holding her gently, trying to puzzle it out. Had he tied her up before feeding from her, he would’ve fucked her by now, of that he was certain.</p><p>Trust, he realized. She’d held up her part of the deal. It had cost her. She’d cried toward the end, once her grip on consciousness slipped—silent tears that left wet tracks on her cheeks. Her arm would be sore as hell tomorrow. Provided the fever didn’t rise, the poison didn’t kill her, and there was a tomorrow in her future. He wanted her to live, but he had done all he could to help her.</p><p>The feeding had cost her, but she lay there and let him do his thing, as she had promised, and she expected him to hold up his end of the bargain. And the bargain didn’t include fucking rights. She’d made that crystal clear.</p><p>He tugged her tank top back into place, covering her up, and pulled her to him, sliding his arm over her. She was his. She would take away his pain and he would guard her in return. That was the agreement.</p><p>Chapter 3</p> <p>Karina awoke to an empty room. Bright morning light flooded through the open window, drawing a yellow rectangle on the wooden floor. A draft brought an acrid stink of burning bacon.</p><p>Emily.</p><p>She pushed free of the sheets and almost fell. Her head swam. Slowly, very slowly she slid off the bed and stood upright. Her throat was so dry, it hurt. A full glass of water sat on the bedside table beside a pair of binoculars and a yellow sticky that read “Drink it.” She could practically hear Lucas’s growl.</p><p>The memory of his gnawing teeth squirmed through her, dragging nausea in its wake. Karina bent over, gripped the night table to steady herself, and saw a square bandage on her arm. She tugged at it, sending a jolt of pain through her limb. The bandage remained stuck. Karina pulled harder, trying to rip it away as if she could shed the memory of Lucas with it. She struggled with it for a few seconds, pain pounding up her biceps in hot prickly bursts, and finally tore it free.</p><p>A big bruise stained the bend of her arm. Dark purple, it sat there like a brand. Lucas’s proof of ownership. Dried blood was caked in the center, where his teeth had mangled her veins.</p><p>The price she paid for Emily’s life. And her own. The ache in her arm pushed her to scream at the sheer mind-boggling unfairness of it: at being attacked, kidnapped, hurt, held down by brute force, robbed of her daughter, stripped of her freedom . . . At being plucked from her life. Only a day ago, she felt reasonably safe, secure in the knowledge that she could dial 911 at any moment and bring a police cruiser to her door. She had rights. She had protections. She was a person.</p> <p>She felt the hot wet tears well in her eyes and clenched her teeth. She had to get a grip. Thinking like a victim would get her nowhere. Yes, it was terrifying. Yes, it hurt. But it didn’t kill her. She was still alive and as long as she breathed, she had to fight for herself and her child. She had to obey and be sweet. She had to ingratiate herself. That was her only chance at survival and escape. Karina dropped the bandage on the night table and drained the glass. It was time to find her daughter.</p><p>A harsh screech made her turn to the window. She walked to it, picking up the binoculars off the night table on the way. A wide green expanse spread before her, a wooded slope gently rolling away and down, toward mountains, brown and rust, fading to blue and eventually gray in the distance. A scrub forest hugged the roots of the mountains, dotting the grassy prairie in clumps of green. The wind fanned her face, bringing moisture and the tart fragrance of some unknown flower.</p><p>It was the middle of summer in southern Oklahoma and the prairie she’d seen through her windshield the day before had been a brown sea of dried grass. This, this looked like spring after weeks of rains somewhere in the foothills of rugged mountains.</p><p>Where the hell was she? Looked like complete wilderness, probably miles from any road, any people. Any help. If she escaped, crossing across rugged country with a six-year-old would be very difficult. She would have to plan well and bring a lot of water.</p><p>The brush quaked. A small brown animal burst from the growth. It resembled a dog, or maybe a coyote. It dashed across the grass, zigzagging in sheer panic. It didn’t run like a coyote.</p><p>What in the world?</p><p>Karina raised the binoculars to her eyes.</p><p>The creature wasn’t a dog. If anything it looked like a tiny horse, no more than two feet tall.</p> <p>The brush shivered and spat three gray shapes onto the grass, one large and two others smaller. They ran upright on a pair of massively muscled legs, their bodies sheathed with gray feathers speckled with spots of black. Long, powerful necks supported heads armed with enormous beaks. The binoculars picked up every detail, from the crests of long feathers on their heads to the tiny vicious eyes.</p><p>The horse galloped for its life, veering left. The bird closest to it slid and swung toward the house to right itself. A flash of pale red shot through the empty air, as if the bird had run into an invisible net stretched tight, and the pressure of its body caused the threads to glow. The bird screeched and fell, catapulted back. For a moment it lay on the grass stunned, and then it rolled back to its feet and rejoined the chase.</p><p>The small horse was getting tired. It slowed. Foam dripped from its mouth.</p><p>The largest bird sprinted. The monstrous beak rose, then came down like an ax, chopping at the horse and knocking it off its feet. The horse rolled in the grass and staggered upright. The three birds danced about it, jabbing and pecking. The horse cried out and fell. Bloody beaks rose again and again . . .</p><p>Karina lowered the binoculars.</p><p>She didn’t know much about zoology, but she knew enough. They weren’t emus; they weren’t ostriches; no, these were something vicious, something ancient, something that should not exist in Texas or the Ozarks. Or the twenty-first century.</p><p>Suddenly she was cold, freezing from head to toe.</p><p>A triumphant screech rolled up from the plain.</p><p>Karina dropped the binoculars on the side table and slammed the window shut.</p><p>A cloud of oily smoke greeted Karina in the kitchen. By the stove, Henry cursed, slid several charred pieces of bacon out of a pan with a spatula, and deposited them onto a plate. He saw her and waved the spatula around, flinging hot drops of grease onto the table. “Good morning.”</p><p>“Good morning,” she answered on autopilot. “I saw . . . birds.”</p><p>“Terror birds.” Henry nodded. “Nasty creatures. Don’t worry, there is a large fence around the entire hill. We call it the net—it’s thin wire with a powerful current running through it. You’re completely safe within the vicinity of the house. They won’t come close. Besides, they are mostly cowards. An adult human has nothing to worry about.”</p><p>One of those things would kill a child. A vision of a bloody beak coming down like a hatchet flashed before Karina’s eyes. She swallowed. “My daughter?”</p><p>The spatula pointed to Henry’s right. “Through that doorway.”</p><p>Karina forced herself not to run. She skirted the table and walked through the doorway into a living room. Her heart pounded.</p><p>A small shape was curled on the couch, hidden by a green blanket. Karina pulled back the covers. Emily lay on the pillow. Her mouth was open slightly, her eyes closed, her hair a tangled mess.</p><p>Karina knelt and hugged her gently. Emily stirred and she put her face to her daughter’s cheek and clenched herself, trying not to cry.</p><p>“Daniel brought her early in the morning. Arthur told him he would let him speak in return,” Henry said softly from the doorway. “I’ve wiped her memory of the assault in the motel—it was too traumatic—so she won’t recall anything about the place, and that entire day will be dim for her. There are no long-term effects to memory wipes, but there are some short-term consequences: she will sleep a lot more, she will seem confused, and she might have some anxiety. It should last for about a week. Lucas already called the main house. They have a nice room set up for her.”</p><p>Karina turned. “I want her to stay with me.”</p><p>Henry looked uncomfortable. “There is a reason why the three of us are separated from the main house.”</p><p>“Three? I thought Arthur lived here.”</p><p>Henry shook his head. “Arthur stays at the main compound. Of our entire group, Lucas is the most feared, Daniel is the most despised, and I’m the least trusted.” He paused. “This house isn’t the best place for a child.”</p><p>She paused. “Henry, why in the world would anyone not trust you?” Of the four men she’d met so far, Henry seemed the least insane.</p><p>He smiled, apologetic, almost vulnerable, and leaned closer. “I can make you forget we ever had this conversation. I can make you forget about Lucas, about the motel, and, if I strain a little, you won’t remember you ever had a daughter.”</p><p>She paused. It seemed insane, but no less insane than the idea of a man who turned into a nightmarish beast. “Can you read thoughts?”</p><p>“Nobody can read thoughts.” Henry shook his head. “Not even combat-grade operatives like me.”</p><p>Combat with whom? Why? He was wording his replies very carefully, thinking about them for a moment before answering. If she pushed him too hard, he would stop talking. “I’m not sure I understand. Do you wipe your enemies’ memories?”</p><p>Henry took his glasses off and cleaned the lenses with the corner of Emily’s blanket. Without his glasses, he seemed younger. “The mind doesn’t just store memories. It also governs many functions of the body. I can mentally scout the enemy and tell you their numbers. Obviously the more of them there are, the higher the margin of error is, but typically I’m not off by a significant number. I can find your mind in a crowd of people and attack it, so you’ll think you’re drowning. I can disconnect your brain from the rest of you and starve it of oxygen until you become a vegetable. My subspecies isn’t called Memory Wiper. It’s called Mind Bender.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For a moment she was more terrified of him than she was of Lucas, and thinking that he might somehow crack her skull open and peer into her brain scared her even more.</p><p>Henry glanced at Emily on the couch. “Do you trust me now? Do you want your daughter near me?”</p><p>No. She didn’t trust any of them. But the main house, whatever it was, would be full of strangers. The thought of someone full of violent rage, like Lucas, or cold like Arthur, being in charge of Emily without her to shield her daughter made her wince.</p> <p>Karina clenched her hands. Screaming and hysterics would do her no good. She had to reason with them. She had to be smart. Use logic. “Henry, I’d rather take you and Lucas over a house of people I don’t know. Emily woke up alone, without me. She must’ve been frightened. She’s my daughter, Henry. She’s safest with me, because I’m her mother and I would give my life to keep her from harm.”</p><p>“Speak to Lucas,” Henry suggested. “I’m sure he will permit some sort of visitation.”</p><p>Lucas. Lucas had said he owned both of them. She had to make him understand. Karina fixed Emily’s blanket and rose. “Can I make her breakfast? Or should I ask Lucas’s permission?”</p><p>Henry stepped aside. “You’re welcome to any food we have.” He cleared his throat.</p><p>The fridge contained eggs, several pounds of bacon, some slimy cold cuts, a hunk of mozzarella cheese—dried, yellow, and brittle—and a pack of green-looking hot dogs. Karina pulled out eggs and bacon. “Flour?”</p> <p>Henry dug in one of the cabinets, looking lost, frowned, and opened a door, revealing a huge supply room. “I think in here somewhere.”</p><p>She stepped into the room. Rows and rows of wooden shelves, filled with cans and jars, a huge spice rack, fifty-pound bags of sugar, flour, rice . . . three large freezers filled with meat. Enough food to feed these men for years. “Are you expecting a long siege?”</p><p>“You never know,” Henry said with a thin smile. “We’ve had a few.”</p><p>“You, Daniel, Lucas, me, Emily. . . is anybody else coming?”</p><p>“No. Does this mean we’re invited to the meal?”</p><p>“I’m using your food.”</p> <p>Henry exhaled, picked up the plate of black bacon strips, and dumped them into the trash. “Thank God.”</p><p>Karina opened the window first, so the kitchen would air out, and set about making breakfast. Henry parked himself by the refrigerator and watched her. There was something disquieting about Henry. When she looked at him, she got an impression of length: long limbs, long frame, long face. Even though she vaguely recalled that he was slightly shorter than Lucas, he appeared taller. He seemed lean, almost thin, but that notion was deceiving—his sweatshirt sleeves were pulled up to his elbows, revealing forearms sculpted with hard muscle. He smiled often, but the curving of his lips lacked emotion. His smile was paper-thin, an automatic, knee-jerk reaction like blinking.</p><p>A Mind Bender. If what he said was true, he could kill Emily in front of her, wipe Karina’s mind clean, and she would never remember it.</p><p>Karina found Granny Smith apples in the bottom of the fridge and checked the drawers. On the third try she hit what looked like a utility drawer: knives, screwdrivers, bottle openers, and wooden spoons. She fished a medium-sized knife from the drawer, peeled the apples, cored and chopped them, and set them to fry slowly, sprinkling them with brown sugar.</p><p>“It smells divine,” Henry murmured.</p><p>“Is there cinnamon?”</p><p>“I am sure there is. It’s brown powder, right?” Henry stepped into the pantry.</p><p>“Yes.” She grabbed the knife, pulled the fabric of her jeans away from her hip, and slid the knife into her pocket. The point of the blade cut the lining and she jammed the knife all the way down to the hilt. The blade scraped against her skin. She glanced down. No blood. Karina exhaled. Cutting herself was a calculated risk—she had no other place to hide the knife. Anywhere else it would make a bulge. She pulled her T-shirt down over it.</p> <p>Henry came out of the pantry. She held her breath. Maybe he could read thoughts. Maybe he would pluck the image of the knife out of her head. She had to stop thinking about it, but she couldn’t. The shape of the knife was probably glowing in her brain.</p><p>Henry shook a plastic container of cinnamon. “Found it.”</p><p>She had to say something or he would realize things were wrong. Karina willed her mouth to move. “Thank you.” She took the cinnamon and sprinkled it on the apples.</p><p>The bacon rack was missing in action, or perhaps they didn’t have one. She layered a plate with paper towels, placed the strips on top, and popped it into the microwave.</p><p>“You don’t cook often?” she asked.</p><p>“On the contrary. I cook quite frequently, out of sheer necessity. Unfortunately, most of what I produce is inedible. Daniel’s cooking is even worse than mine, if such a thing is possible. Lucas can grill quite well when pushed to it, but in the kitchen his idea of a meal involves a raw piece of meat, burned on the outside. Adrino was our cook.”</p><p>“Where is he now?”</p><p>“Dead. About nine months ago.”</p><p>She paused to look at him. “I’m sorry.”</p><p>Henry nodded. “Thank you.”</p><p>Karina resumed stirring the pancake batter. “How did he die?”</p><p>“Lucas bit him in half.”</p><p>She stopped. “Was he a member of your family?”</p><p>“He was. He was Lucas’s cousin on his mother’s side, and my stepbrother.”</p><p>Karina found the griddle and set it on the burners to heat up. She stirred the apples with a wooden spoon, then pulled the bacon out of the microwave and peeled it from the paper towels.</p><p>“I can do that,” Henry offered.</p><p>“Thank you.” She poured the pancake batter on the griddle in quick drips and watched the first pancake puff and bubble at the edges. “Why did Lucas kill him?”</p><p>“Adrino tried to murder Arthur.”</p><p>“Why?”</p><p>Henry smiled, a quick baring of teeth, meaningless and flat like a mask. “Adrino had raped a woman on base. As a punishment, Arthur had him chained for two months.”</p><p>“Chained?”</p><p>“In the courtyard. Eventually Adrino was let off the chain and everything went quite well, until he attempted to solidify Arthur’s blood during the last Christmas dinner. In retrospect, we should have expected it. His subspecies is prone to rashness.” Henry smiled again. “You will find that we’re a violent, vicious lot, Lady Karina. All of us hate Arthur, hate each other, hate who we are, what we are, why we are. This hate is so deep within us, it’s in our bones. Lucas hates stronger than most of us for his own reasons. But Lucas is also far more controlled in his rages than he lets on. He recognizes the simple truth: Arthur is the glue that holds us together. Arthur makes mistakes, and he’s brutal, but he’s also fair. Every tribe must have a leader. Without the leader there is chaos. May I just mention that your pancakes smell delicious? I don’t suppose there is any way I could steal one right now, is there?”</p><p>Thirty minutes later, the pancakes were done, the bacon was cooked, and Karina crossed the room to her daughter.</p><p>“Emily? Wake up . . .”</p><p>“Mommy!” Emily clutched Karina around the neck and hung on with surprisingly fierce strength.</p><p>Karina scooped her off the couch and held her close, afraid to hug the tiny body too hard. “I’m here, baby. I love you.” Emily never said “mommy.” It was always “mom.”</p><p>“You won’t leave?”</p><p>A hard knot formed in Karina’s throat. “Leaving” was Emily’s euphemism for dying. Her daughter thought she had died.</p><p>“I will try very hard not to,” she promised.</p><p>Emily hung on, and Karina gently carried her into the kitchen. “I made your favorite apples.”</p><p>Slowly Emily’s hold on her neck eased. A few seconds later she allowed herself to be put into a chair at the table.</p><p>Daniel marched into the kitchen. “Food.”</p><p>Henry nodded. “Yes.”</p><p>Daniel pulled out a chair, sat, and reached for the pancakes.</p><p>“Let’s wait for Lucas,” Henry said.</p><p>“Fuck Lucas.”</p><p>Karina looked at Daniel. Henry sighed. Daniel looked back at them, glanced at Emily, and shrugged. “They don’t like it that I swear. Do you mind if I swear?”</p><p>Emily shook her head.</p><p>“See, she doesn’t mind.”</p><p>Lucas loomed in the doorway. One moment it was empty and the next he was just there, green eyes watching her every move with a hungry light. Karina took her chair, trying to ignore it, but his gaze clasped her like an invisible chain. She looked back at him. Yes, I belong to you. You don’t have to ram it down my throat.</p><p>Emily’s eyes had grown big. She shied a little when Lucas stepped to the table, aware of his movements. Karina read fear in her daughter’s face and reached over to hold her hand. He’d given Emily no reason to fear him, yet she was clearly scared, almost as if she sensed on some primal level that he was a threat.</p><p>Lucas sat next to Karina, opposite of Daniel, and reached for the pancakes. She watched him load his plate: four pancakes, four links of sausage, six strips of bacon . . . The plate would hold no more. He pondered it, frustrated, then piled the apples atop the pancakes and drenched the whole thing in maple syrup.</p><p>It was good that she had made enough for ten people.</p><p>Lucas sliced pancakes with his fork, pierced a slice of the apple, and maneuvered the whole thing into his mouth. Karina sat on the edge of her seat, listening to the elevated tempo of her own heartbeat, watching him chew, and waited for him to throw the plate across the table. She wanted them to like the food; no, she desperately needed the three of them to like the food. Her survival depended on it.</p><p>Lucas swallowed. “Good,” he said and reached for more.</p><p>Karina slumped a little in her chair, unable to hide her relief.</p><p>“Good? It’s fucking divine,” Daniel said. “It’s the first decent meal we’ve had in weeks.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucas leveled a heavy stare at him but said nothing.</p><p>“Mom,” Emily said.</p><p>“What, baby?”</p> <p>“I left my backpack at Jill’s house. It has my school stuff in it.”</p><p>The three men ate, watching her.</p><p>“That will be okay, baby,” Karina said. “You have to change schools anyway.”</p><p>“Why?”</p><p>“Because we live here now and you’ll go to a special school.” The words came out painfully.</p> <p>“Do I have to ride the bus?”</p><p>Karina swallowed a lump that had formed in her throat. Acknowledging where they were was hard, as if she were driving nails into her own coffin. “No.”</p><p>“Why do we have to stay here?”</p><p>“This is where I work now.”</p><p>“Your mother is a slave,” Daniel said. “Lucas owns her.”</p><p>If only she could have reached across the table, she would have hit him with a closed fist so it would hurt. Karina forced neutrality into her face, pulling it on like a mask. Show nothing. Betray no weakness.</p> <p>“Is a slave better than a payroll supervisor?” Emily asked.</p><p>“They’re not that different,” Karina lied. So many times before she had thought she worked like a slave, pulling in long hours, picking up project after project, perpetually behind, trying to get to the bottom of her to-do stack. She thought she had experienced the worst life could throw at her. All of it seemed so pointless now. Her memories belonged to someone else, a happier, flightier, younger person. She had a new life now and new priorities, chief of which was the welfare of her daughter. She had to keep Emily safe.</p><p>Emily poked her pancake with a fork. “What about the house? All our stuff is there . . . my Hello Kitty blanket . . .”</p><p>“We’ll get new things.” She cast a quick glance around the table but none of the three men said anything to break down her fragile promises.</p><p>“Will I get my own room?”</p><p>Karina looked to Lucas. Please. Don’t separate me from my daughter.</p><p>He wiped his mouth with a napkin, his movements unhurried. “You have to stay at the main house. You can come to visit your mother on weekends. We’ll set up a room.”</p><p>“I want to stay with Mom.” Emily’s voice was tiny.</p> <p>“You can’t,” Lucas said.</p><p>Emily bit her lip.</p><p>“You’ll have a good place at the main house. A room you’ll share with a nice girl. Toys. Clothes. Everything you need. If anybody tries to be mean to you, tell them you belong to Lucas. Everyone is afraid of me. Nobody will harm you.”</p><p>“No,” Emily said.</p><p>Lucas stopped eating. Karina tensed.</p><p>“Are you telling me no?” Lucas asked. His voice was calm.</p><p>Emily raised her chin with all of the defiance a six-year-old could muster. “I’m tired and I’m scared, and I’m not going. I’m staying with my mom. Are you going to yell at me?”</p><p>“No,” Lucas said. “I don’t need to.”</p><p>“You’re not my dad. My dad left.”</p><p>Lucas glanced at Karina.</p><p>“I’m a widow,” she said quietly.</p><p>“I’m not your father, but I’m in charge,” Lucas said. “You will obey me anyway.”</p><p>“Why?” Emily asked.</p><p>Lucas leaned forward and stared at Emily. “Because I am big, strong, and scary. And you are very small.”</p><p>“You’re not nice.” Emily held his gaze, but Karina could tell it wasn’t out of courage. Emily had simply frozen like a baby rabbit looking into the eyes of a wolf.</p><p>“It’s not a nice world and I can’t always be nice,” Lucas said. “But I will try and I won’t be mean to you without a reason.”</p><p>Karina put her hand on his forearm, trying to tear his attention away from Emily. It worked; he looked at her.</p><p>“Please.” It took all of her will to keep the tremble out of her voice. “Please let her stay.”</p><p>“I want to stay,” Emily said. “I’ll be good. I’ll do all my chores.”</p><p>“I’ll think about it,” Lucas said.</p><p>Chapter 4</p><p>A half hour later, breakfast was finished. The men rose one by one, rinsed their plates, and loaded the dishes and silverware into the dishwasher with surprising efficiency. Karina put the last of the food away. Henry had stepped out, but Daniel remained in the kitchen, leaning against the counter, watching her. Lucas loomed by the door, watching Daniel.</p><p>“Can I go outside?” Emily asked.</p><p>Karina paused. “I don’t think that is a good idea.”</p><p>“Why not?” Daniel arched an eyebrow.</p><p>“Because there are scary birds out there.”</p><p>“There are scary birds? What kind of scary birds?”</p><p>“It’s safe,” Lucas said. “The net keeps everything out.”</p><p>Karina remembered the bird’s body hitting the invisible fence. “What if she walks into this net?”</p><p>“She’d have to walk a mile and a half down the hill before she reached it,” Lucas said.</p><p>“I want to see the birds,” Emily said. “Please?”</p><p>It would get them out of the house, away from the men and out into the open. She could get a better look around. Maybe she would see a road, or a house, some avenue of escape. Karina wiped her hands with a towel and hung it on the back of the chair. “Okay. But we’re going to stay by the house.”</p><p>“I’ll come with you,” Lucas said.</p><p>All she wanted was the illusion of being alone with her daughter. He wouldn’t let her have it. Karina clenched her teeth.</p><p>“That’s right,” Daniel said. “Bite your tongue. It will come in handy.”</p><p>Lucas gave him a flat stare. For a moment they stood still, then Daniel rolled his eyes and casually wandered out of the kitchen into the side hallway. Lucas moved in the opposite direction, through the doorway. Karina took Emily by the hand. “Come on, baby.”</p><p>The hallway cut through the house, straight to the door. They passed rooms: a library filled with books from floor to ceiling on the right, a large room with a giant flat-screen TV on the left, and then Lucas opened the door and they stepped on the porch into the sunlight. The yard was grass, small scrawny oaks and brush flanking it on both sides. A path led down the hill into the distance. To the left a huge oak out of sync with the rest of the scrub forest and probably planted, spread its branches.</p><p>A shaggy brown dog stepped out from behind the oak. As tall as a Great Dane, it trotted forward on massive legs, its long tail held straight behind it. There was something odd in the way it walked, waddling slightly, more like a bear than a dog.</p><p>Karina stepped between Emily and the beast.</p><p>The animal stopped. Large brown eyes stared at them from a massive head crowned with round ears.</p><p>“Don’t worry, he’s tame,” Lucas said behind her.</p><p>The meld of dog and bear peered at Lucas and let out a short snort.</p><p>“He doesn’t like it when I phase into my attack variant,” Lucas said. “It weirds him out for a couple of days. Cedric, don’t be a dick. Let the kid pet you.”</p><p>Another snort. She couldn’t really blame the dog. Considering how Lucas looked in his “attack variant” it was a wonder the dog stuck around at all.</p><p>Cedric pondered them for a long moment and waddled over. Emily stretched out her hand. Karina’s insides clenched into a tight knot.</p><p>Cedric nudged Emily’s hand with his nose, snorted again, and bumped the bulge in the front pocket of her hoodie.</p><p>“What do you have in your pocket?” Karina asked.</p><p>Emily dug into her pocket and pulled out a half-eaten apple.</p><p>Not again. Karina kept her voice gentle. “Emily, you know you’re not supposed to have that . . .”</p><p>Cedric sniffed at the apple. His mouth gaped open, revealing huge teeth.</p><p>“He won’t hurt her,” Lucas said with absolute certainty in his voice.</p><p>Emily held the apple out. Very carefully, almost gently, Cedric swiped it off her hand, sat on his behind, and raised the fruit to his mouth, holding it with long, dark claws. The black nose sniffed the apple, the jaws opened and closed, and the beast bit a small chunk from the fruit and chewed in obvious pleasure.</p><p>“He likes it!” Emily announced and jumped down off the steps into the yard. “Come on, Cedric!”</p><p>“Where are you going?” Karina took a step to follow.</p><p>“Just to the tree.”</p><p>The oak was barely fifty feet away. Karina bit her lip. Her instincts told her to clutch her child and not let go, but Emily needed to feel normal. She needed to play. Her daughter didn’t understand how precarious their situation was, she had no idea how vulnerable they were, and Karina had to keep it that way.</p><p>Emily was looking at her. “Can I go?”</p><p>“Yes. You can go.”</p><p>Emily headed toward the tree. Cedric finished his apple in a hurried gulp, rolled to his paws, and followed her to the tree.</p><p>Lucas leaned on a porch post next to Karina. She had expected him to somehow shrink in daylight, as if he were some sort of evil creature of the night whose power faded with the sun, but he remained just as big and menacing. If anything, the sun made it worse—she could see every detail of his severe face. Everything about him, the way he leaned against the rail, the way muscle bulged on his arms and chest, the way he surveyed the yard, inspecting his territory, communicated predator.</p><p>Lucas raised his face to the sun, closed his eyes, and smiled. The smile lasted only a moment, gone like a leaf blown by the breeze, but she had seen it. He was handsome and the danger he emanated sharpened that beauty to a lethal edge. He was beautiful in the same deadly way a tiger was beautiful, and now she was locked in a cage with him.</p><p>If he was on her side, nobody would ever bother them.</p><p>At the tree, Emily picked up a twig and tossed it. Cedric looked at the twig and back at her, slightly puzzled.</p><p>“What is he?” Karina asked.</p><p>“A bear-dog. We played with their genetics a few generations back. He’s gentle like a collie with the kids and he’s a lot smarter than an average dog. What’s the problem with her having an apple?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Karina sat on the stairs. “She hoards food.”</p><p>“Why?”</p><p>She didn’t want to tell him. The less he knew about them, the less information he could use against her. “It makes her feel safe.”</p> <p>By the tree Emily clapped her hands and explained something to Cedric. He sat on his butt again, listening to her.</p><p>“Was she adopted?” Lucas asked quietly.</p><p>“No.” She wouldn’t have expected him to know that adoptive children sometimes exhibited food hoarding. Now she had to explain more just to keep him from getting the wrong idea. “It happened after her father’s death. It’s not an eating disorder. She doesn’t want extra food; she’s just trying to control her environment. We handled it, but with everything that’s happened she might have relapsed. Please don’t berate her or yell at her for it. It . . .”</p><p>“It makes things worse,” he finished for her. “I know.”</p><p>“Let me have her,” she said, suddenly desperate. “Let me have her here with me. I thought I lost her on that fire escape. You have everything else—my freedom, my body, everything—and I just want one thing. Just let me keep my baby.”</p> <p>Lucas frowned. He didn’t seem vicious now. “I’m not doing this to be an asshole.”</p><p>“I’ll keep her out of the way . . .”</p><p>Cedric snarled at the bushes, baring his teeth, and lunged into the thicket.</p><p>Karina jumped to her feet. Before her knees had straightened, Lucas had leaped over the railing and was sprinting to the tree.</p><p>Emily stumbled back. Her mouth gaped in a surprised O.</p><p>Karina ran but she was so agonizingly slow.</p> <p>Lucas reached Emily, pushed her back, out of the way, and crashed through the underbrush.</p><p>Karina lunged forward. Her hand closed about Emily’s shoulder. She grabbed her daughter and backed away, keeping her hand on her pocket, feeling the hard knife handle through the fabric of her jeans.</p><p>Lucas jerked something out of the bushes. Long and green and brown, it writhed in his hand, flailing, the elongated olive tail brushing the ground. He roared, a deep growl that nearly made her jump. “Henry!”</p><p>The thing jerked, its throat caught in Lucas’s hand. He turned and Karina finally saw it: it resembled a freakishly large bearded dragon lizard bristling with inch-long spikes on its cheeks and sides. As the creature twisted, a crest snapped open along its back, the spikes standing up like the razor-sharp fins of some deepwater fish. The lizard creature clawed at Lucas’s arm with long black claws. Blood welled in the scratches.</p><p>“A monster!” Emily squeaked.</p><p>“No, just a big lizard.” Karina kept a death grip on Emily.</p><p>Behind her the door burst open. Daniel charged onto the porch. His face contorted. Something brushed past Karina like a sudden draft. The beast jerked and hung motionless, its legs abruptly gone limp.</p><p>Lucas carried the lizard to the porch. “Henry!”</p> <p>Henry burst onto the porch.</p><p>Lucas slammed the lizard down onto the porch boards. The creature blinked but lay completely still. Henry knelt by the lizard. His hands touched the back of the creature’s skull. He closed his eyes, focused for a long moment, and glanced up. “Its mind is inert. It didn’t transmit.”</p><p>Lucas looked at him. “Sure?”</p><p>Henry pushed his glasses back up his nose. “Yes. If it transmitted, there would be evidence of a spike in neural activity.”</p><p>Lucas raised his fist and brought it down like a hammer. She barely had enough warning to spin Emily around before his fist crushed the lizard’s skull, flattening it like an empty Coke can.</p><p>“Daniel, call the main house.” Lucas turned to her. “Take Emily and go to our room. Don’t come out until I get you.”</p><p>Karina didn’t ask what was going on. She just picked Emily up, ran inside the house, and didn’t stop until the door of Lucas’s room closed behind her.</p><p>The day burned down to the afternoon. Emily investigated the room, then she whined about being bored, and finally she fell asleep in the overstuffed chair in the corner. At first Karina listened for every noise and creak outside the door. Her nerves were wound so tight, she could barely sit still.</p><p>If the creature in the bushes had been just an ordinary lizard, Lucas would’ve killed it right away. She had no doubt of it. No, this beast had created an emergency. She had no idea why and that somehow made everything so much worse. Eventually her own anxiety wore her out and she sank into a light sleep, a kind of wakeful drowsiness, where every stray noise made her raise her head.</p><p>The room was so quiet. Karina closed her eyes for a moment, opened them, and then Lucas was there, walking across the room. She hadn’t heard the door open.</p><p>Lucas scooped Emily out of the chair. Karina surged to her feet. “Where are you taking her?”</p><p>“To a different room,” he said quietly and went out. She followed him down the hallway to a small bedroom. A bed with a red comforter stood against one wall, next to a bookcase filled with children’s books. A desk offered a small computer with a flat-screen monitor.</p><p>He’d made her a room. He’d changed his mind.</p><p>Lucas deposited Emily on the bed and stepped out. Karina pulled the blanket over Emily’s shoulders. She was so tiny on the bed. Karina’s mind replayed Lucas clenching the lizard’s throat. One squeeze and Emily would be dead.</p><p>He waited for her now, in the hallway. Karina made herself step away from the bed and walked out. Lucas closed the door, locked it, and handed her the key. “This is for her protection. Our room doesn’t have a lock. Daniel is pissed off tonight, and I’m feeling surly, which makes the house a dangerous place to be, so it’s best she stays in this room. This is for tonight only. Tomorrow she will go to the main house.”</p><p>But the room—it was a child’s room, made for a little girl. The blankets and the pillowcases looked brand-new and the rug still had the price sticker on it.</p><p>So he hadn’t changed his mind. She had from now until morning to convince him to let her keep her daughter. Karina opened her mouth and said the only thing she could think of. “Are you hungry?”</p><p>Lucas nodded. “I could eat.”</p><p>“Any preference?”</p><p>“Meat would be nice.” He turned away.</p><p>“Lucas?”</p><p>He glanced at her over his shoulder. “Yes?”</p><p>“What’s going on?” Karina asked him softly. “What was that thing?”</p><p>Lucas grimaced. “It’s a long explanation.”</p><p>“Please. I want to know.” Whatever he would tell her had to be better than not knowing.</p><p>Lucas sighed. “The woman who poisoned you has friends. Her people are looking for our base, so they are sending scouts out. The lizard was one of them. It’s basically a walking camera—it records what it sees and then transmits the information to its owners in short bursts. Luckily we caught this one before any transmissions had gone out.”</p><p>“And if it had sent this transmission?”</p><p>“We’d be evacuating,” Lucas said. “We still may. We’ll know more in the morning.”</p><p>Karina hugged her shoulders. “Lucas, where are we?”</p><p>He was looking directly at her. “We’re on base.”</p><p>“Where is this base? I’ve seen those birds. There are no birds like that in North America.”</p><p>Lucas examined her face for a long breath. “You want the truth?”</p><p>“Yes.”</p><p>He grimaced. “You asked for it. As the planet rotates, fluctuations between the forces of gravity and nuclear reactions on the subleptron and subquark level cause a ripple effect in reality, where time and space are not constant but dynamic. Parts of space-time become incompatible with the current reality and are discarded. In essence, Earth continuously sheds chunks of itself. They linger for a time and dissipate, some slower, some faster. We’re in one such chunk—we call them fragments. It was shed sometime during the late Pliocene, approximately two and a half million years ago in what is now Texas. This pocket is stable and shouldn’t begin to dissipate for another couple thousand years. Can you make cubed steak?”</p><p>“What?” Karina stared at him, sure she had misheard.</p><p>“I asked if you can cook cubed steak. I just realized I’d really like some.”</p><p>“Yes, I can. You’re not joking?”</p><p>“About the steak?”</p><p>“About the fragments.”</p><p>Lucas shook his head.</p><p>This was just insane. “So we’re in an alternate reality? Like in a parallel dimension? Like in Star Trek?”</p><p>“No. A mirror dimension is a self-contained, complete reality. We’re in a dimensional fragment.” Lucas leaned back against the wall. “Okay, think of an onion. The inner layers are white, and the outer layer is brown. Suppose the outer layer rots. The onion makes a replacement layer, identical to this outer one, and sheds the rotten layer in bits and pieces, some big, some tiny. We are in a piece of that rotten layer.”</p><p>She stared at him. If he wasn’t lying, they weren’t anywhere near Oklahoma. They weren’t even on the same planet. Escape was impossible.</p><p>“Don’t think about it too much,” Lucas said. “Subquantum mechanics will drive you insane.”</p><p>“Can we get back? To normal Earth?”</p><p>“It depends on how close the layer is to its reality. The motel where you were attacked was in a layer that had barely begun to separate, so we could cross in and out easily. But this pocket has peeled much too far away for you and I to exit on our own. We need someone to rip it. To open a gateway.” Lucas pushed off from the wall.</p><p>“But we can go back?” Surely they had to go back occasionally. Their clothes had tags; their plates had Corelle stamped on the back. Microwaves and refrigerators didn’t sprout on prehistoric trees, which meant the people of Daryon had to pop back and forth from the normal Earth to here and back on a whim.</p><p>Lucas leaned toward her. His gaze fixed on her. Suddenly he was occupying too much space. She took a step back, her spine pressing against the wall. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A slow smile curved Lucas’s lips. “Yes. You can go back. But never without me. If you ever try, I will find you and bring you back.” His smile grew wider. “And then all bets are off.”</p><p>He was looking at her with an open sexual hunger, so intense, for a second she didn’t think it could be sincere. She froze, terrified. And then a small part of her responded to it. For a second, Karina wondered what it would be like to cross the distance between them, laugh right into that stare, and walk away, leaving him standing there like an idiot. But as long as he controlled Emily, she could do nothing.</p><p>He leaned forward a quarter inch, like a predatory cat about to pounce.</p> <p>In her mind, Karina gulped and fled down the hallway, her heart hammering too fast and too loud. But showing weakness wasn’t an option. Lucas had told her before that he was a predator. If she ran, the predator would chase.</p><p>She raised her face toward him. “If I do go back without you, don’t find me.”</p><p>He turned his head to the side, like a dog, studying her. “Or?”</p><p>“Or I will kill you.”</p><p>He laughed, a low rich sound that sent shivers of alarm down her spine. “How?”</p> <p>“I’ll think of something.”</p><p>She turned her back to him and forced herself to walk slowly toward the kitchen.</p><p>Lucas tilted his head and watched Karina retreat down the hallway. The look in her eyes, the angle of her face, the way she stood, everything communicated defiance. She challenged him. She had no idea how exciting this made her. He wanted to pin her against the wall, until she acknowledged that he was strong enough and powerful enough for her. He wanted to kiss and taste and grind and own. Different standards, he reminded himself. For him it would be flirting. For her, it would be a prelude to rape.</p><p>Lucas looked at the ceiling. He knew exactly where this violent impulse was coming from. It was an evolutionary echo, the same echo that told him to murder every other male in the house and then hunt her until she gave in. He made a choice to reject it daily. Strangely, it wasn’t getting any easier.</p><p>Henry’s light steps approached him. “Physical assault is probably not the best way to go,” Henry murmured.</p><p>Sometimes Lucas could swear the man could read thoughts, even though every Mind Bender Lucas had ever met maintained it was impossible. “Playing in my head?”</p> <p>“Of course not.” Henry smiled at him. “Your fists are clenched and it’s written all over your face.”</p><p>He’d figured as much. “She’s beginning to ask questions.”</p><p>“That’s a little faster than I expected.” Henry frowned. “I wiped almost twelve hours of severe pain from her. Usually a wipe of that extent leaves people inert longer. You’re pacing the explanations?”</p><p>Lucas nodded. “Not my first time.”</p><p>He’d helped bring people over a few times before. A human mind could only accept so much. If he flooded her with the information contradicting her view of reality, the impact of it, combined with her physical trauma, would cause her to snap under the pressure. Her body was at its limits already, fighting the poison and coping with his venom and its consequences, which would soon follow.</p><p>Lucas started down the hallway. He needed a shower and some time away from everyone to soothe the excitement rushing through his veins.</p><p>“Lucas?” Henry called.</p><p>Lucas turned.</p> <p>His cousin looked at him for a long moment. “Be kind.”</p><p>An hour later Karina put the dinner on the table. The encounter in the hallway kept replaying in her head and she couldn’t decide if she’d botched it or handled it well. Emily still slept. Henry had said the fatigue was normal, but she worried all the same.</p><p>“Cubed steak.” Henry slid into his seat. “ ‘Beef. It’s what’s for dinner.’ ”</p><p>Karina took her seat. Lucas sat to the right of her. Too close. She should have served the dinner in the dining room instead of the kitchen. The bigger table would’ve given her more space.</p><p>Lucas crowded her, drinking in her anxiety. Karina swallowed, unable to help herself. He was simply too large and he watched her constantly. Even when she couldn’t see him, she couldn’t get rid of the pressure his gaze brought. He leaned toward her, emanating menace, and she shrank from him out of sheer self-defense.</p><p>His lips stretched and Lucas showed her his teeth, large and sharp. “Am I scary?”</p><p>She met his stare. “Yes,” she said. “But you know that already. Making me admit it makes you cruel. Corn or beans?”</p><p>He drew back. His eyes widened and for a moment the burden of his presence eased. “Corn.”</p><p>She passed the dish of corn to him.</p><p>Daniel sauntered into the room. While Henry migrated from place to place and Lucas stalked, his steps soundless and full of fierce grace, Daniel strode as if his feet did the ground a great favor. He didn’t walk but floated, devastating in his beauty and perfectly aware of it.</p><p>Daniel took a seat directly opposite her. He speared a steak and dropped it on his plate. “Are you going to do this every day? Cook the dinner, be the dinner?”</p><p>“Yes,” Karina said with a calm she didn’t feel.</p><p>“Why? Are you totally spineless? What do you think sucking up will earn you? Look at him.” Daniel pointed at Lucas. “He doesn’t care.”</p><p>“I’m not doing it for him.”</p><p>“Then why?”</p><p>“Here we go.” Henry rolled his eyes.</p><p>Daniel pushed off from the table, balancing his chair on its back legs, and crossed his arms. “No, I want her to enlighten me. How deeply has Stockholm syndrome set in?”</p><p>Karina put down her fork. Her instinct told her that whatever she said next would define her place in this house. The idea of some flattering subterfuge crossed her mind and died. She wondered if she should say nothing at all. In the end, she decided on honesty.</p><p>“I understand that I can die at any moment. Lucas’s cousin died at the last Christmas dinner. For all I know, Lucas might die tomorrow, killed by your enemies or by your family members. Without Lucas I have no worth. My daughter is here because of me. If I’m no longer needed, I expect that neither will she be. I’ve seen enough of your family to realize we won’t be allowed to leave. You will dispose of us as if we never existed. I have to find some way to make myself valued beyond Lucas. Then, if he dies, both my daughter and I might survive.”</p><p>“And you do this by becoming our housekeeper?” Daniel grinned. “Cooking, cleaning up after us? Tell me, how low will you stoop? If I leave some shit in the bathroom for you, will you clean it up?”</p><p>“No,” Karina said. “You’ll clean your own shit. Unless you’re sitting in a pile of it right now, you must know how to aim for the toilet and wipe your own ass.”</p><p>The amusement in Daniel’s eyes crystallized into anger. “If you want to ingratiate yourself, there’s a much easier way of doing it. You can come over here right now and suck my cock. That will put you into my good graces much faster than scrubbing the sink.”</p><p>Karina glanced at Lucas. He cut a piece of steak, chewed with obvious pleasure, and threw her a look that said, Sit tight.</p><p>“She isn’t a fool, Daniel.” Henry snagged another roll from the bread basket. “These are delicious. She knows that servicing you would put you and Lucas at each other’s throats. You’re playing this game for your personal gratification, but Lucas depends on her for his survival. She’d have to be mentally deficient to choose you over him.”</p><p>Daniel shifted to Lucas. “So what does his lordship think of all this? Your snack has you buried already. Are you flattered?”</p><p>Lucas cut into his third steak.</p><p>“What would you do in her place? Would you mop the floors, O mighty one?”</p><p>Lucas thought about it. “In her place I would’ve killed the two of you already. But I’m not in her place. And I’m not her. I’m not smaller and weaker than everyone around me, nor do I have a child’s life in my hands. She’s being prudent, given her situation.”</p><p>Daniel smirked. “Never thought you’d be so agreeable at the idea of your own death.”</p><p>“We all must come to terms with it one way or another,” Lucas said.</p><p>“Maybe I’ll help you on your way, then, since you’re all prepared. Seems a shame to waste the opportunity.”</p><p>“Think you can?” Lucas asked with genuine interest.</p><p>“Careful, Daniel,” Henry said. “That kind of talk will end with you breaking a nail or messing up your hair.”</p><p>Daniel ignored him and glared at Lucas. “Bring it.”</p><p>Lucas put down his fork, smiled, and shoved the table aside like it weighed nothing. Karina scrambled out of the way. Lucas’s huge hand clamped Daniel’s throat. Daniel clawed at Lucas’s forearm. The bigger man jerked him off his feet, shook him the way a dog shakes a rat, and slammed him down onto the table. Dishes flew. Trapped in a corner between the counter and the stove, Karina threw her hands in front of her face. A ceramic dish shattered next to her, spraying green beans over the counter.</p><p>“No,” Henry screamed. “Not inside! Not inside!”</p><p>Red marks sliced Lucas’s forearms. His skin bulged as if his bones were trying to break free.</p><p>“Yeah!” he snarled. “Hurt me more. Is that all you got?” His hand still locked on Daniel’s throat, he pulled him up and smashed him onto the table again. “Need some more?” Daniel’s face had grown bright red. Lucas jerked him up. “Not done yet?” He drove Daniel back down.</p><p>With a thunderous snap, the table broke in two. The two halves fell apart and Daniel crashed onto the floor, Lucas atop him, still crushing his windpipe. Daniel’s feet drummed the ground. Veins bulged on his face, his skin turning magenta. His eyes rolled back into his skull.</p><p>“Here we go.” Henry sighed. “We lose all the good dishes this way.” He showed Karina the bread basket. “At least I saved the rolls. And don’t worry, I’m keeping Emily asleep.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucas released Daniel. The blond man lay unmoving. Lucas stepped over him, his eyes blazing with fury. His gaze locked on her. “Bedtime,” Lucas growled and lunged at her. An unstoppable force swept Karina off her feet and she found herself slung over Lucas’s back.</p><p>“Let me go!” She struggled to pull free.</p><p>He swung around to face Henry. “Leave the mess for when he wakes up.”</p> <p>“Will do.” Henry saluted him with a roll.</p><p>Lucas headed out of the kitchen. Karina tried to grab onto the door frame, but her fingers slipped and she was carried through the darkness of the hallway to the bedroom.</p><p>Chapter 5</p><p>The room swung as Lucas slapped the door closed. Karina expected him to hurl her on the bed but he lowered her to the floor. She stumbled, dizzy from being spun back and forth, and scrambled to get away. Steely fingers caught her arm. He held on to her and sniffed at the sleeve of her sweatshirt. “Green beans. You want a shower?”</p><p>His tone was calm. She glanced at his face. All of the rage had gone out of him. He looked worn out, his fury muted to mere smoldering coals.</p> <p>“Yes.” She hesitated. “I don’t have any clean clothes.”</p><p>“That’s a problem,” Lucas agreed. “I’m sorry about the dinner.”</p><p>“That’s okay.” His sudden calm threw her off balance. She stood still, expecting him to swing at her or maybe roar into her face.</p><p>Lucas reached into the dresser and pulled out a white T-shirt. “That’s the best I can do for now. I’ll have something sent up from the main house in the morning.”</p><p>She took the T-shirt. He didn’t offer her any underwear. She would be naked under it.</p><p>“Come on.” Lucas pulled off his shirt and dropped it on the floor. Carved muscle bunched on his back. Nude, clothed—he could rape her at any point. Clothes wouldn’t provide much of a defense.</p> <p>He paused, his hand on the door of the bathroom. “Are you coming?”</p><p>Not if I can help it. “I’ll wait until you’re done.”</p><p>“I’ll be in here for hours,” he said. “The shower stall is enclosed. You can take your clothes off and I’ll see nothing.”</p><p>For hours . . . Why would he be in the bathroom for hours? “I thought you needed to feed.”</p><p>“I do, but I won’t be feeding for a while.”</p><p>She followed him, despite knowing better, eager for any crumb of information. “How long is a while?”</p><p>“Couple of weeks. Maybe longer. Depends on how quickly you deal with my venom.”</p><p>“Why?”</p> <p>“Because too much of my toxin at once will kill you.”</p><p>She remembered his explanation from the night before. “You said your venom hurts you. Does it hurt now?”</p><p>He nodded.</p><p>“Always?”</p><p>Lucas looked at her. “Always. Worse after I am injured and much worse after I phase out of the attack variant. Sometimes I have seizures after phasing out.”</p><p>If he hurt always, he would have to feed always . . . “How often do you . . .”</p><p>As if reading her thoughts, he shrugged. “Once the optimal ratio of my venom to your hormones is reached in my blood, I’ll need to feed every three weeks to maintain it. I won’t be drinking as much as the last time. Come on. You need a shower and I need to sit down.”</p><p>He stepped out of her way. During the day she had used the bathroom in the hallway, near the kitchen. She had assumed this one would be the same.</p><p>A room almost as big as the bedroom itself greeted her. A dark green hot tub was sunk into the sealed wooden floor. Beyond it a shower stall stretched the entire length of the wall. Its frame matched the hot tub, but the stall itself consisted of wide, dark green panels, either glass or plastic, thick and frosted from the inside. Lucas hadn’t lied—he might be able to discern her shadow, but that was about it. To the right was another stall, which she assumed hid the toilet, next to a large sink.</p><p>Lucas flipped a switch on the wall and the hot tub jets started, whipping the water into froth.</p><p>The shower called to Karina. To go on and disrobe while he was in the tub was insane, but she was covered in food and his scent from the previous night still stained her skin. She could wash him off.</p><p>Karina bit her lip and slipped past Lucas to the shower. She closed the door and saw a latch. Relief flooded her. She could lock herself in and for a few minutes pretend she was safe. She slid the latch closed and almost cried.</p><p>The shower stall was divided into a dressing area and the shower itself, separated by a curtain. Karina dug into the pocket of her jeans and fished out the knife. The blade seemed so small compared to Lucas. If she stuck it into his back, he might not even notice. She put it on the small metal shelf next to the soap and, pulled off her clothes, dropping them into a rumpled pile on the bench. An array of shampoo bottles and soaps waited her selection. She took the bottle with the picture of a green apple on the side, picked up a bar of soap at random, and stepped into the shower. Jets surrounded her on three sides. She turned the big wheel of the faucet and a wide sheet of water spilled on her from above in a warm, soothing waterfall. She dropped the shampoo and the soap. All around her water sprayed and cascaded, drenching her, washing away the scent of warm copper. She stepped into the deluge, closed her eyes, and swayed.</p><p>Lucas slid into the hot water. He liked it near scalding. It wasn’t quite hot enough, but it was getting there. The currents pummeled his body. He switched the two nearest jets off. The sharp claws of pain that scraped his ribs dulled to a low ache as he healed. His right arm still throbbed. Daniel was getting stronger.</p><p>One day one of them would get careless and they might finish each other off. Lucas closed his eyes and submerged. There were worse ways to go than being killed by your brother.</p><p>The rage that had driven him these past few days was gone, burned out in an adrenaline rush of violence.</p><p>He came up for air and settled with his head on the ledge, positioned in the dip of the shelf, the only place he could sit with the water lapping at his neck.</p><p>So tired . . .</p><p>The healing was draining his inner resources and he felt thin and weak, as if all of his muscles were a threadbare shirt hanging off his bones. From here he could see the door and the shower stall. She was in there. Naked. Wet. A fruity synthetic scent teased him—she was washing her hair. He pictured her body under the water, her hands sliding over her breasts and down . . .</p><p>A dull thud made him lift his head. In the shower, a dark shadow slumped, pressed against the glass.</p><p>It had hit her finally. He’d waited the whole day for it.</p><p>Lucas climbed out of the hot tub. The shower-stall door was locked. He hit it with his palm and the lock popped open. Karina lay curled in a corner of the shower, a small wet clump. Her legs shivered. Her skin had gained a pale, almost gray tint. He scooped her off the floor.</p><p>“No,” she stuttered. Her lips had turned blue. Not a good sign.</p><p>He bent down. She lashed out. He caught a glint of metal and pulled back, letting the knife blade miss him. Where had she even gotten one? Ah, yes. The kitchen. He plucked the knife out of her fingers and picked her up off the floor.</p><p>“No.” She pushed against his chest.</p><p>“Shhh,” he told her. “I’m not going to hurt you.”</p><p>He carried her out. Her wet skin was ice-cold against his.</p><p>She fought him even as he climbed into the tub and lowered her onto the shelf, sinking her up to her chin in the hot water. “Let me go . . .”</p><p>Afraid to agitate her any further, he put the full width of the tub between them, giving her room. No need to strain her. If she passed out, the chances of her survival would drop to almost nothing.</p><p>It took a full three minutes before her teeth stopped chattering. She looked at him. “Everything hurts.”</p><p>“Your body is reacting to the venom,” he said. “Hot water will help. It soothes the muscles. It’s normal.” Technically everything he said was true. He just didn’t go into the rest of the details. Not yet.</p><p>A short bitter laugh slipped from her lips. “Normal? Nothing about this is normal.”</p><p>True. Not for her anyway. For him, it was business as usual. “Thirsty?”</p><p>“Yes.”</p><p>He waded through the tub, reached for the small fridge beside it, and extracted a bottle of water.</p><p>She took the bottle, clamped the plastic cap in her teeth, twisted it off, and drank, draining nearly a third in a single long draft. That’s it . . . Drink, Karina.</p><p>He recalled Galatea’s first time. She’d known exactly what would happen. She had been raised for precisely this purpose: to support him. And she loathed him for it. Hate would’ve been too personal of a word; he didn’t rank that high in her mental roster. Galatea hated the family; she hated Arthur because he was in charge; but Lucas she merely despised, disgusted by his touch. The older he got, the more he realized that sex with him was her way of revenge. In feeding he dominated her and she had no choice but to submit. In bed, for a few fleeting moments Galatea dominated him. That first time, when she cried and screamed as her body struggled with its initial dose of his venom, he had tried to hold her. She was so pretty, so fragile . . . He didn’t want to break her. She had sensed that small spark of compassion in him, clutched on to it, and twisted it, used it against him again and again, until finally he could stand it no longer. Living with Galatea meant fighting a constant war. Living with Karina so far was like sparring with an honest fighter. She defied him, but she would never stick a knife in his back. She would try to stab him in plain view.</p><p>Lucas sank down into the water and closed his eyes. Thinking about Galatea left a foul taste in his mind. His ribs ached again. Drowsiness came, threatening to smother his mind like a heavy blanket.</p><p>Karina’s voice tugged on him before he passed out. “Why are you being nice to me?”</p><p>“‘Nice’ isn’t in my vocabulary. I’m just tired.”</p><p>“Your ribs are bruised.”</p><p>“Daniel.”</p><p>“I didn’t see him hit you.”</p><p>“He doesn’t have to. I’m a Demon, and he’s an Acoustic. He can mimic voices and wrench the bones from my body with a focused sound wave.” He raised his arms and stood up, showing her the long angry welts outlining his ribs. “If he really pushed, you’d see bone shards puncturing the skin.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She stared at him in horrified silence. He sank back down and closed his eyes.</p><p>“Why do you fight like that?” she asked.</p><p>“There’s no single reason. Sometimes he doesn’t like something I’ve done. Sometimes I do it because he annoys me.”</p> <p>“What about today?”</p><p>Lucas sighed. She wouldn’t let him be. “Today we fought because Daniel argued with Arthur. Daniel wants to evacuate. Arthur doesn’t. Daniel insisted and Arthur bruised his pride. I took Arthur’s side. Evacuating the base is costly. One scout isn’t reason enough to do it. It’s a bad sign—we had seen scouts before in the neighboring fragments, but never this close. But we can’t just run at the first hint of trouble.”</p><p>She frowned. “So twisting bones out of your sockets is the way he demonstrates his displeasure at being pushed around?”</p><p>“Pretty much. Daniel wants to be taken seriously. So I treated him as a serious threat and made a big production of it. I was a substitute fight. What he really wanted was a shot at Arthur, which I can’t let him take, because Arthur will kill him.” Lucas thought of leaving it at that, but something nagged him to explain. “It’s complicated. We live by different rules. In your other life, people undergo strict social conditioning that evolved over hundreds of years. They grow up in relative safety and under constant supervision. Parents, schools, peers—all of their interactions fine-tune their behavior until they are . . .”</p><p>“Safe?” she suggested.</p> <p>“Socialized. But Daniel and I grew up as outcasts, with only the extremes of our behavior corrected—so we don’t murder someone whenever the urge strikes us. Our interactions are simpler than yours, less layered and closer to . . .” Lucas grappled for the right word. When it came to him, he didn’t like it. “Animals. Both of us reached sexual maturity a while ago. We have a strong urge to mate and have our own territory, our own families, and separate lives. Instead we’re stuck with each other, in this house, with an illusion of privacy and an excess of aggression. And now there is you. Daniel doesn’t really want you for your own sake. He wants you because he views me as competition and now I have something he doesn’t. I am the only consequence he fears. He’s hostile and defensive, and Arthur made him sit down and shut up today. Daniel had to vent and I’m the only one who would put up with it.”</p><p>“Why?” she asked softly.</p><p>“Because he is my brother.”</p><p>There was a tiny pause. “But he is not a Demon like you.”</p><p>“Different fathers,” he told her. “All of us within the House of Daryon carry genes from many different subspecies. Our mother was a Demon. My father was a normal human. Daniel’s father was a powerful Acoustic. We both played the genetic lottery and got different prizes.”</p><p>He left out rape, imprisonment, and murder. It sounded much better this way.</p> <p>“Did Daniel hoard food as a child?”</p><p>She was perceptive. He would have to remember that. “Yes.”</p><p>“And you took care of him?”</p><p>“Yes.” Because nobody else would.</p><p>“Why doesn’t he just leave?” she asked. “Why don’t you? You don’t seem to like living here.”</p><p>“Because we have a job to do. We guard you from genocide.” The mission overrode everything. A logical part of him assured Lucas that life outside of the original mandate existed. He just couldn’t picture himself living it. “As long as we exist, you survive.”</p><p>“I don’t understand.”</p><p>He sighed. This was another long explanation and he had no energy for it today. Nor did he want to shock her again. She’d been through enough. “Monsters exist. They call themselves Ordinators. They want to kill people like you. Normal ordinary people. We exist to keep them from succeeding. That’s all there is to it.”</p> <p>“But what do they want?”</p><p>“They want you to die.”</p><p>“Why do they hate us so much?”</p><p>He sighed. “They don’t hate you. They simply want you not to be. It’s a genetic cleansing, a mass extermination. They view the current situation as a mistake, which they’re trying to correct. They feel that they are ordained to take your place. Subspecies 61, the ‘normal’ human, has no value to them, except maybe as an occasional food source in a pinch.”</p><p>“They’re cannibals?” Her voice spiked a little.</p><p>“Only some of them. I meant a food resource for their war animals. Do you know what a daeodon is?”</p><p>“No.”</p><p>“It’s a nasty breed of entelodon, a prehistoric boar. Picture a predatory pig, twelve feet long, seven feet tall at the shoulder, jaws like a crocodile. It eats anything, and once you mess with its genetics, it gets smart and breeds fast. They need a lot of meat.”</p><p>When he opened his eyes, he found her looking at him. Karina sat submerged so deeply, only her face floated above the water. Warm color had returned to her cheeks. Her hair, slicked by the shower, swirled in the roiling water.</p><p>Mmmmm. Mine.</p><p>Lucas could reach out and pull her to him and run his hands up and down her body, to feel the heavy fullness of her breasts, the curve of her ass . . . If it wasn’t for fatigue, and the fact that she trusted him, anchoring him to the spot, he might have done it.</p><p>His thoughts must’ve reflected on his face, because she pulled as far from him as the tub would allow. A haunted look claimed her face, sharpening her features. Like a stray dog, he thought, shivering, scared, and ready to bite. He held the key to her: turn it one way and break her; turn it the other and the pressure would ease. He’d been just like that a few years ago. The memory of being scared of everyone was still fresh.</p><p>“You know I can’t stop you. What consequences do you fear?” Karina asked.</p><p>“Right now I just don’t want to fight with you,” Lucas said. “I fight with Arthur, with Daniel, with Henry. I’m tired.” And he wanted her to stop jerking back every time he looked at her. It made him feel like he was a monster and he had enough help with that already.</p><p>“If you want peace, let me have Emily.”</p><p>“No.”</p><p>She clenched her teeth.</p><p>“Maybe later. Down the road.”</p><p>“Why not now?”</p><p>Irritation flared in him. “Because I can’t watch the two of you every moment of every day and you are stealing knives.”</p><p>“The knife was for protection. I won’t take another one. I won’t try to stab you again . . .”</p><p>“It’s not me I’m worried about.”</p><p>She became utterly still. “Oh, my God.” Her eyes widened. “You think I would hurt my own daughter?”</p><p>“You wouldn’t be the first one.” Not by a long shot. “Shock is a bitch. Especially when mixed with venom fucking with your hormones.”</p><p>“She is everything I have.”</p><p>She looked on the verge of tears. He forced himself to sound calmer. “And that’s why you could slit her throat the second I gave her to you. You’re both my responsibility. I said I would keep you safe. I don’t want you to hurt her or yourself.”</p><p>“I had the knife since breakfast,” she told him. “You sent me into the room with Emily. I didn’t kill her. If I’d tried, you couldn’t have stopped me . . .”</p><p>“Henry was monitoring your mind. Had your stress level spiked, he would’ve shut you down.”</p><p>“Then ask him if I tried to kill her or myself. I had the opportunity. I got the knife so I could hurt you. Not myself.”</p><p>Lucas rose and crossed the tub, pinning her between his body and the tub wall. The feel of her body against his shoved him right to the edge. In his mind all the leashes he put on himself were snapping one by one. Karina turned to the side, trying to hide from him.</p><p>“Look at me.”</p><p>Karina looked at him. Lucas peered into her eyes, looking for some sort of indicator of sanity. “If you had a loaded gun in your hand, would you shoot me?”</p><p>“No. If I killed you, I would be next. Either Daniel, Henry, or Arthur would murder me, and Emily would have nobody.”</p><p>An honest rational answer. “Do you want to die?” He wanted her. He wanted to crush her in his arms and see her want him.</p><p>“No.” She shook her head.</p><p>“What do you want?” He knew what he wanted. She was right there, caught against his chest. His heart was beating too fast.</p><p>“I want to escape,” she told him. “I want to go back to my life.”</p><p>She was sane and stable, or as sane as he could expect. Lucas released her and Karina scrambled away from him.</p><p>“What would you do if I let you have your daughter, Karina?”</p><p>She stopped. He read the answer on her face. Anything. She would do anything. She would let him do anything, and if he demanded, she would pretend to like it.</p><p>It was the answer his mother would’ve given.</p><p>“What do you want?” she asked hoarsely. He felt the tension hidden in her words, as if she stood on the edge of a chasm, waiting for him to push her in.</p><p>“Can you bake a chocolate cake?”</p><p>There was a tiny pause before she answered. “Yes.”</p><p>“Make one. For Daniel. It’s his favorite.”</p><p>She waited. When he didn’t say anything, she finally asked, “That’s it?”</p><p>“Yes.”</p><p>Lucas waited for relief on her face, but she just sat there, clenched up. Still looking for the catch, he realized.</p><p>“You’ll really let me have her?” He barely heard her voice. “No conditions?”</p><p>“Yes.” And the more fool he for it. Nothing good would come of it, not with the way they fought. Henry would think him insane. But Lucas felt weary. He didn’t have the strength to fight yet another war. And he didn’t want her to be miserable. “Make a list of what you both will need, and I’ll send it to the main house tomorrow. Last time I checked, you could buy Hello Kitty blankets in any department store . . .” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Karina covered her face and cried.</p><p>He sat there and watched her shudder and sob, not knowing what to do with himself. Uncomfortable, as if he were intruding on something private. Guilt rose in him and he wasn’t sure where it came from.</p><p>“Stop,” Lucas growled finally.</p> <p>“I can’t.”</p><p>Her sobs died gradually. She splashed some water on her face. “Can I stay with her in her room?”</p><p>“No. You’ll stay with me.”</p><p>“Can I sleep on the floor?”</p><p>“No. You’ll sleep in my bed, just like last night.”</p> <p>“Why?”</p><p>Because you’re mine. And because he would know if she got up in the middle of the night. “Because I want it that way.”</p><p>“I could—”</p><p>He closed his eyes and leaned his head back. “Quiet. No more talking.”</p><p>“Thank you,” she said softly.</p><p>“You’re welcome.”</p> <p>Chapter 6</p><p>Karina awoke alone. She dimly recalled seeing Lucas get out of the water, his huge muscled body wet, and feeling a sharp inner clench, the same clench that gripped her when he’d caught her in the tub. She would’ve liked to pretend it was fear or anxiety, but that would mean lying to herself. When he rose to show her the bruises Daniel had made, she stared at him for a moment too long and it wasn’t to study his injured ribs.</p><p>Lucas had brought her a towel and when he turned away, giving her a fragile illusion of privacy, she’d draped it around herself and escaped into the bedroom. He didn’t follow her. She toweled off, slipped on the giant T-shirt he’d given her, and slid into bed, curling under the blanket into a worried ball. Her nervousness should’ve kept her awake, but her body simply gave out. Lucas took his time getting to bed and by the time he lay down on the other side, she was half asleep. He asked her something, but her feverish haze mugged her and dragged her under into a dreamless sleep.</p><p>Karina struggled to sit up. She felt the steady heat of her slowly burning, low fever. At least she was alive. She forced herself all the way up. Her head swam and the dizziness nearly took her back down.</p><p>Up. Up, come on, you can do it.</p><p>And now she was talking to herself. Outstanding.</p><p>Karina walked to the shower, swaying on wobbling feet. She’d rinsed her underwear last night, and it still hung on the towel hook where she’d left it. Karina touched it. Dry. She slipped the panties on and went to use the bathroom.</p><p>A couple of minutes later she made it to the sink. A new toothbrush, still in its case, waited for her. Karina stared at it.</p> <p>Lucas hadn’t kidnapped her. He hadn’t forced her into human slavery at gunpoint. She’d been attacked by Rishe and the shark-toothed man, and she’d been given a choice: to die or to live on Lucas’s terms. She was a victim of circumstance. That didn’t change the fact that Lucas owned her now.</p><p>The House of Daryon had stripped every shred of independence from her. She depended on Lucas for everything: her food, her safety, her clothes, the safety and survival of her daughter. He had the power to tell her when to go to bed, where to sleep, when to shower . . . He was protecting her and Emily from some sort of terrible enemy she couldn’t understand and he could kill them both at a moment’s notice. Any relaxation of the rules became a kindness on his part. A small thing, like a toothbrush, seemed like some great favor. But it wasn’t, she told herself. It wasn’t. It was a basic necessity for any human being.</p><p>Then again, she could’ve been a slave without any freedom at all. She could’ve lost her daughter. She could’ve been raped. All he had to do was say, “I’ll give you your daughter,” and she would’ve done anything. The very fact that he thought to leave her a toothbrush was a small miracle.</p><p>Her own drive to survive was interfering with her sense of reality. Her instincts drove her to forge an emotional bond. The more Lucas liked her, the less likely he was to murder her or Emily. The more she liked him . . .</p><p>Karina took a deep breath. Lucas was physically overwhelming. The memory of his arms around her flashed before her. Lucas was . . . He was . . .</p><p>She stared at herself in the bathroom mirror. Just say it. Say it, acknowledge it, and walk away from it.</p><p>Seductive. Desirable. Shocking. He was masculine in the way women fantasized men to be: powerful, strong, dangerous. If she had met him at a party or in a professional setting, when he wore a suit and she wore something other than his T-shirt and a pair of underwear she’d washed in the shower, she would’ve sought him out. If he had spoken to her, she would’ve been flattered.</p><p>For a while, after Jonathan’s death, she was so wrapped up in guilt, and in Emily’s well-being, she forgot men existed. It took almost a year before she became aware of them again: a man with a nice smile in the checkout line, a random stranger in good shape stepping out of the car in the parking spot next to her. A small part of her wanted to be noticed again and checked to see if she was. She was vulnerable and the way Lucas looked at her left her no doubt that if she gave him the tiniest indication that she wanted him, he would rush to oblige and mow down whatever stood in his way.</p><p>There was an odd desperation in Lucas under all that violence. Karina sensed a deep overpowering need to be . . . not accepted exactly, but to be liked. If she were ruthless, she would seduce him to make sure he would become dependent on her, but that kind of manipulation was beyond her. She couldn’t bring herself to do it.</p><p>Karina looked at her reflection. She could practically see him in the mirror next to her. She could recall him with crystal clarity: every powerful line of his body; the promise of raw violence in the way he moved; the precise curve of his mouth, almost sardonic; the look in his eyes, the wild, unfiltered look of pure male lust. No, more than lust. Need.</p><p>Thinking of him was like playing with fire.</p><p>She had been married; she knew very well that a healthy relationship hinged on respect and constant compromise. With Lucas there could be no respect and no compromise, because they were not equals. He owned her. She was his property and once she opened the door to a relationship, he wouldn’t let her close it.</p><p>Karina shut her eyes. She could picture herself wrapped in those powerful arms. It would feel safe, so safe. Her life was broken like a mirror and the shards kept cutting her fingers. She was desperate to forget that she was little more than a slave. She craved that illusion of safety as if it were a drug and she had to score a hit. She wanted to feel the heat of his strong body warming her skin. And she wanted to see him bend, to find out what it would be like to see the vulnerability of intimacy in those hard eyes. She was completely powerless and she needed to feel powerful, as a woman does who is wanted so badly by a man, he would do anything for her.</p><p>There it was. All of it, out in the open.</p><p>You’re sick, she told her reflection.</p><p>Well, now it was out. She owned all of it.</p><p>She had to keep things in perspective. He was strong and she was weak and vulnerable and not in her right mind. She would take it one day at a time, wait until the last of the poison cleared out of her system, and when a chance to escape presented itself, she would take it—and they would never find her and Emily again. And if she let herself buy into her own lies, she would never wonder what it would have been like to feel him inside her . . . She cut off that thought. The less she imagined it, the better.</p><p>Karina opened the toothbrush. She would brush her teeth, locate her jeans, and check on her daughter. And then she would go out there and make a chocolate cake.</p><p>Emily seemed to have no memory of Lucas and Daniel’s fight the previous night. She slept well and when Karina had come to get her, she got a hug. The violent episode had passed her daughter by completely. Karina held her for a long time, breathing in the scent of her hair. They were both alive. She would get to keep Emily with her. It would be okay. It would be hard and painful, but it would be okay.</p><p>Karina took Emily to the kitchen. Sunlight poured in through the open window. Nobody waited for her. Nobody demanded breakfast. The house was quiet and serene. Karina exhaled her tension, pulled the ingredients from the pantry, and started mixing the cake batter.</p><p>Henry walked into the kitchen, looking a bit lost. “Good morning!”</p><p>“Good morning!” Emily chirped.</p><p>“I have something for you.” Henry put a drawing pad and a set of watercolor pencils on the table.</p><p>“For me?”</p><p>“For you.”</p><p>Emily pried at the pencil case.</p><p>“What do you say?” Karina murmured on autopilot.</p><p>“Thank you!”</p><p>“You’re welcome.” Henry offered her a small smile.</p><p>“Where is everyone?”</p><p>“They’ve gone to check the perimeter net. What is it you’re making?”</p><p>Karina glanced at him. “A chocolate cake. Did they go to check for signs of those people who sent the lizards to spy on us?”</p><p>Henry nodded.</p><p>“Lucas called them Ordinators. Henry, who are they? Who are you?”</p><p>Henry smiled again and slid his glasses up his nose. “It’s a long and complicated explanation. It’s better to wait a couple of days. Too much new information too fast will only make things worse.”</p><p>“I’d like to know.”</p><p>He shook his head. “You’ve been through a great deal of violence in the past two days and you’ve been exposed to things that conflict with your worldview. I don’t want to be the one to add to it.”</p><p>“Henry, not knowing is worse. All I’m asking is that you don’t treat me like a slave who is told where to be and what to do and isn’t owed any explanation.”</p><p>“No,” he said quietly.</p><p>They looked at each other over the table. Karina held his gaze. It might not have been wise, but she wouldn’t back down now.</p><p>“Look, Mom, I drew Cedric!”</p><p>Karina looked down at the ball of brown fluff that looked like a sheep with a sabertooth’s fangs. “That’s looks very nice, Emily.”</p><p>When she looked up, the kitchen was empty. Henry had escaped.</p><p>The cake smelled of chocolate and vanilla. When Karina took the two round pans out of the oven and set them out to cool, the familiar scents floated through the kitchen, so reminiscent of home and happy times, she almost cried. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A door banged. She looked up just in time to see Lucas loom in the doorway. His face was grim. He glanced at the cake, then at her. She stared back, suddenly terrified that all her thoughts would pour out through her eyes.</p><p>He didn’t seem to notice. “Would you like new clothes?”</p><p>“Yes.” Oh, God, yes.</p> <p>He jerked his head toward the door. “They have some things prepared for you at the main house. I didn’t know what size, so you have to come and try them on. Come on, I’ll walk with you.”</p><p>“Can I come?” Emily slid off the chair.</p><p>“Yes,” Lucas said. “They have clothes for you, too.”</p><p>“And Cedric?”</p><p>“Cedric doesn’t need clothes,” Lucas said.</p> <p>“Can he come with us?” Karina asked.</p><p>“Sure.”</p><p>Karina washed her hands, wiped them on a towel, and followed Lucas out. The sun shone bright. Cedric already waited for them at the foot of the stairs. Emily stepped down and the bear-dog rolled to his feet and trotted next to her, nearly as tall as she was.</p><p>Lucas led them out of the yard and down a dirt path. It wound around the hill, flanked on the left by stunted oaks and shrubs climbing up the slope and rolling off to the prairie on the right. Cedric and Emily pulled ahead a couple dozen yards. Karina watched them, aware of Lucas striding next to her, like some tiger who had learned to walk upright. The air was dry, and the heat beat down on them from the pale, burned-out sky, painting the path in stripes of bright yellow sunshine.</p><p>“We’re in a fragment of reality,” Karina said.</p><p>“Yes,” Lucas said.</p> <p>“Why is the sun shining? Why is there air?”</p><p>“Because the fluctuation occurs on the universal level,” Lucas said.</p><p>“So it’s a duplicate sun?”</p><p>“No, it’s the same sun the Earth has. We just get access to it on a different level. Think of a house with many rooms. We walked out of the main room into a smaller side bedroom, but we’re still under the same roof.”</p><p>Karina sighed. “It makes my head hurt.”</p><p>“Don’t talk about dimensions to any Rippers, then,” Lucas said.</p><p>“Rippers?”</p><p>“They make inter-dimensional rents that let people like you and me travel back and forth. You get one of them started on the subject and the insanity pours out until you want to stick your head in a bucket of water just to wash it out of your mind. When a man has to continuously cut himself, because pain helps him punch through dimensions, you can’t expect him to be lucid anyway.”</p> <p>Karina glanced at him. “You seem irritated.”</p><p>Lucas’s thick black eyebrows knitted together. “We found out how the lizard got through the net. It tunneled under it. A long, deep tunnel, almost twenty-five meters.”</p><p>“And?”</p><p>“There was more than one tunnel,” Lucas said.</p><p>More than one tunnel meant other lizards. “Did you track them down?”</p><p>Lucas nodded.</p><p>“Did they transmit what they saw?”</p><p>Another nod.</p><p>“So the enemy knows where we are?”</p><p>Lucas grimaced. “Difficult to say. The Rippers are saying there was too much inter-dimensional interference for the transmission to have gone through fully. But it’s possible.” He clenched his teeth, pondering something, and said, “We had perimeter alarms, infrared, microwave, and frequency sensors. The sensors are very specific: if you look on Cedric’s collar, you’ll see a transmitter. The transmitter broadcasts a code. The sensors check this code against the database and if the code is active, the sensors don’t register an alarm. For some reason someone loaded an old set of codes into the system. The lizards came through fitted with transmitters of their own and when they broadcast the outdated set of codes, the system didn’t flag them.”</p><p>“How did they know which codes to load?”</p><p>Lucas’s eyes turned darker. “There was a woman. Galatea. She was a donor like you.”</p><p>He said her name like she was a plague. “Was she your donor?”</p><p>“Yes. She defected.”</p><p>He’d clenched his teeth again. There was more to this story. “Were you lovers?”</p><p>Lucas stopped and for a moment she thought she might have pushed him too far. “We fucked,” he said.</p><p>Aha. She kept pushing. “For how long?”</p><p>There was a short pause before he answered. “For four years.”</p><p>“That’s some long fucking,” Karina said. He’d loved Galatea. He was in love, and she betrayed him, and now he wanted to kill her. Any woman past the age of fifteen would’ve connected these dots. He must’ve been young—it had obviously left a deep scar. “What was she like?”</p><p>Lucas took a step toward her. A wild thing looked back at her from his eyes, the thing full of lust and aggression. She realized that in his mind he was peeling off her clothes and thinking of what it would be like, and suddenly she was back in the tub, naked, sitting two feet away from him and afraid he would cross the distance.</p><p>He stared at her. “Would you like me to tell you about it?”</p><p>She squared her shoulders. “No.”</p><p>“Are you sure?”</p><p>“Yes.”</p><p>“Okay, then.”</p><p>He turned and they sped up to narrow the gap between themselves and Emily. Karina kept the pace, exhaling quietly. He had no brakes, at least not the ones she was used to as a woman. Ordinary men didn’t end dinners by breaking the table with their brother’s spine, they didn’t kill lizards by caving their heads in, they didn’t turn into monsters, and they didn’t feed on women. Ordinary men didn’t behave like this outside of movie screens and when they did it on the screen, other men ridiculed them for it. This was a game she couldn’t afford to play, because he held the best cards. She had to survive this.</p><p>Karina chanced a glance at him. The wild, hungry thing in his eyes was still there. “Since someone had to have uploaded this old code, someone on the inside is helping Galatea,” she said, trying to steer him away from whatever he was thinking.</p><p>“Looks that way. And when I find them, they’ll wish they were never born.” His voice contained so much malice, the hairs on the back of her neck stood up.</p><p>If this enemy was coming, Emily would be in danger. “Should we evacuate?”</p><p>“That’s up to Arthur.”</p><p>“Do you think we should?”</p><p>Lucas glanced at her. “It depends on how many people they bring to the fight. This is an old base, and we are actively mining this fragment for aluminum and beryllium. If the Ordinators are coming, they’re coming fast. So even if we begin full base evacuation now, we’ll take a hit in equipment. The base is run by means of a fiber network. It’s a sophisticated computer system that coordinates mining operations, bio-support, communications, and so on. It also has the locations of the nearest bases. If the Ordinators gain access to it, a lot of us will die, which is why the network must be destroyed before the evacuation is complete. Detonating it will make this base uninhabitable. Fragments like this, with a stable climate and ecosystem, are rare. Most fragments we find are dead: no plants, no animals, often no atmosphere. You have to wear a suit and live in a hermetically sealed bunker. And popping back and forth through dimensions leaves a trail. If the Ordinators don’t know where we are, they will once we start ripping.”</p><p>The path ended, joining a larger road that rolled down the hill toward the prairie. In the distance a group of small horses galloped across the grass, ducking in and out of the brush. The vast prairie rolled to the towering mountain ridge, savage and ancient and somehow so much bigger than the modern landscape, that for a moment Karina stopped and simply stared, caught by the natural majesty of it.</p><p>“This is paradise compared to some of the fragments I’ve seen,” Lucas said. “If we have a chance, we’ll fight for it. Come on.”</p><p>He turned and strode up the hill. She sped up to keep pace, Emily and Cedric in tow.</p><p>They rounded a bend and suddenly before them stood two tall white columns marking an entrance. Thrusting twenty feet up, they curved like the ribs of some prehistoric giant. An intricate network of designs covered the columns, etched into their surface. It drew the eye, hypnotic in its complexity. Once you looked, your gaze just kept sliding and sliding, up along the grooves and curved lines . . .</p><p>A hand rested on her shoulder. Karina turned, saw Lucas’s fingers on her shoulder, and jerked away. He held his hand in empty air for a second and lowered it.</p><p>Karina turned to Emily. Her daughter stood next to her, staring at the column, her expression blank.</p><p>“Come,” Lucas said.</p><p>Karina bent down and took Emily’s hand. “Come on, baby.”</p><p>Emily blinked, as if waking up from a deep sleep, and walked with her. They passed through the arches and Karina stopped again.</p><p>Pale buildings with curved roofs spread before her. On second thought, the complex was all one huge building in the shape of a horseshoe, rising three stories high. A beautiful garden lay in the crook of the horseshoe, crisscrossed by covered passageways, stonelined paths, and lush flowerbeds, artfully bordering artificial ponds. Picturesque shrubs spread their branches. Flowers bloomed, blue, orange, yellow . . . The wind brought the by-now-familiar tart flower scent.</p><p>A large white sign stood next to the wide path leading into the garden, its smooth surface marked with an odd script. It had to be writing of some sort—groups of symbols separated by spaces—but it wasn’t any language Karina was familiar with.</p><p>“What does it say?”</p><p>A string of odd words spilled from Lucas’s lips, lyrical and surprisingly familiar. She waited for the meaning.</p><p>“It says ‘The Mandate is everything.’ ”</p><p>“What is the Mandate?”</p><p>“The Original Mandate. It’s hard to explain in English. There is a word in the primary language, ile. It means ‘we,’ ‘us,’ but it also means civilization, the best of us, the best of our kind. The mandate is ‘Ile must survive.’” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That explained nothing. “That’s it?”</p><p>“That’s it. On this world, under this set of circumstances, the people among whom you lived are ile. We exist to make sure they survive. When we’re no longer needed, we’ll die out like many other subspecies before us.”</p><p>The more he explained things, the more confused she became. For now she had to just gather the crumbs of information and hope all would make sense sooner or later.</p> <p>Lucas walked on, down the wide path of smooth stones. Karina scrambled to follow. They walked side by side along the path and over a bridge. The gardens burrowed into nooks in the buildings here and there, forming small sitting areas. To the left two women sat on a bench, discussing something. They looked so normal. Both wore jeans; the older of the pair had on a flowered top, white on blue; the younger woman wore a familiar yellow blouse—Karina had looked at it in J. C. Penney last week.</p><p>Last week. A lifetime ago.</p><p>The women saw Lucas. Their faces took on a certain tightness, as if they were straining to keep calm. They looked her over next. Karina met their gaze and saw pity in their eyes. Suddenly it made her furious. If Lucas grabbed her throat right now, they wouldn’t lift a finger to help her. They would just sit there and watch him choke her to death and feel sorry for her. She raised her chin and stared at Lucas’s back. No, thank you. She didn’t need anyone’s pity.</p><p>Henry’s words came back to her. Lucas is the most feared. “They’re afraid of you,” she said.</p><p>“I’m the security specialist here; I have the right of judgment,” he said. “I can kill anyone on base at any point without any retribution.”</p> <p>“You protect them, and all you get in return is fear. Why do you keep doing this?”</p><p>Lucas kept walking. “Because everyone must have a purpose. The Mandate tells me what I am doing is right and must be done and because I’m the biggest and the strongest it’s my duty to put myself between my people and danger. I would do it for you.”</p><p>He would. She believed him. “Lucas . . .”</p><p>“Yes?”</p><p>She wanted to tell him that if he ever shielded her or Emily, she wouldn’t be afraid of him. She wanted to tell him that he didn’t have to put up with people shrinking away from him, but inside a cold rational voice warned her that she was losing her grip on reality. The plan had to be to escape. The plan couldn’t be to fall for Lucas and be that one sole person who comforted him.</p><p>He was looking at her.</p> <p>“I’m really confused right now,” she told him. “So this actually doesn’t mean anything.”</p><p>He nodded. “Okay.”</p><p>“Bend your arm at the elbow.”</p><p>He did. Karina reached out. What am I doing? She put her hand on his forearm and raised her chin. The two women on the bench stared at them, openmouthed.</p><p>“Now we walk,” she murmured, avoiding looking at him.</p><p>“We can do that,” he agreed. They started down the walkway. His arm was rock-steady under her fingers. A few moments, and the dense greenery of rhododendron shrubs hid the women from their view.</p><p>“Why?” he asked.</p><p>Because she lost it, that’s why. “Would you hurt those two women?”</p> <p>“Not unless they tried to hurt someone else first.”</p><p>“Then they’re in no danger and they know it, but they still make a big production out of you walking by, minding your own business.”</p><p>“That still doesn’t answer my question,” he said.</p><p>“Can we stop talking about this?”</p><p>He didn’t say anything. They simply kept walking. It was surreal, Karina reflected. Beautiful flowers, Emily and a tame bear-dog, and she and Lucas striding side by side.</p><p>“I’m tired,” Emily said.</p><p>Karina bent down and picked her up. The effort nearly made her lose her balance. Apparently she was weaker than she thought.</p><p>Cedric sniffed at her feet.</p><p>“Let her ride him,” Lucas offered.</p><p>“What?”</p><p>“Let her ride him. He doesn’t mind.”</p><p>“I want to ride!” Emily squirmed in her arms.</p><p>Karina surveyed the bear-dog. He was almost as big as a pony. Gingerly she lowered Emily on his back.</p><p>“Hold on to his fur,” Lucas said. Emily dug her fingers into Cedric’s brown mane and they were off again.</p><p>They emerged from the stand of rhododendrons. Lucas stepped aside, revealing a round plaza paved with dark red stone. A bronze statue rose in the center, a nude man, muscled with crisp precision. Enormous wings thrust from his shoulders. An angel, but not a garden cupid or some mournful cemetery statue. The angel leaned forward, one arm stretched out, his muscles knotted on his frame. The wings thrust up and out, featherless, as if made of sharp bone. The angel’s perfect face stared into the distance, its gaze focused. Everything about it communicated fury and power. This was a predatory being about to kill its victim. Metal letters beveled on the side of the statue read “A. Rodin.”</p><p>Karina glanced at Lucas. “A. Rodin? The sculptor who created The Thinker?”</p><p>Lucas shrugged. “He says so, but I wouldn’t put it past him to have the name slapped on there over the actual sculptor’s signature. He is vain enough.”</p><p>What? He who? She scrutinized the statue.</p><p>Oh, God.</p><p>The angel wore Arthur’s face. It had to be figurative—she hadn’t seen any wings on Arthur’s back when he offered her tea.</p><p>“But Rodin died in the beginning of the last century.”</p><p>Lucas circled the statue and kept walking.</p><p>“Lucas!”</p><p>He turned and looked at her over his shoulder, light eyes under black eyebrows like two chunks of ice. “Arthur is a Wither. Subspecies 21. They live a long time.”</p><p>“How long?”</p><p>“Long enough to have met Rodin. Come.”</p><p>She wanted to freak out. She wanted to scream and kick her feet in panic, because right here, in cold bronze, was the final proof that this was not a nightmare. Instead Karina waved Cedric ahead of her and they kept going deeper into the garden.</p><p>Lucas turned left, down a path leading to a section of the building structured with an almost Japanese flair. Except for the white roof, it could’ve been part of a teahouse. An older woman waited on the covered porch, a stack of clothes neatly folded next to her.</p><p>They were twenty feet away from the porch when the siren ripped the quiet into shreds.</p><p>Chapter 7</p><p>Karina pulled Emily off the bear-dog and into her arms.</p><p>“Stay close,” Lucas barked as he turned and ran back up the path. She followed him, trying not to stumble. They pounded over the bridge they’d crossed on the way in.</p><p>“What’s happening, Mommy?”</p><p>“I don’t know, baby. Hold on tight.”</p><p>Emily was so heavy. Karina never remembered her being that heavy. It was like all of the strength had somehow gone out of her arms.</p><p>They cleared the garden and burst into the open space between the two spires, Lucas ahead and she, out of breath, a few dozen yards behind. A group of people stood by the spires, where the road out of the settlement rolled down the hill. A familiar face looked at her with merciless sky eyes. Arthur. Daniel’s golden mane swung into view. He grinned at her, a deranged wild grin that had too much mirth. On the periphery a few yards away, Henry stood with his eyes closed, tense, his face raised to the sky. A young girl, barely a teenager, stood next to him in an identical pose. To the right an older, dark-skinned woman and another man, tall and gaunt, imitated them.</p><p>“Good of you to join us,” Arthur said.</p><p>Lucas walked up to stand next to him.</p><p>A huge sound came from the distance, deep, booming, as if someone was playing a foghorn like a trumpet.</p><p>The girl at Henry’s side inhaled sharply and dropped to her knees, breathing in ragged, painful gasps. Henry’s eyes snapped open. He thrust his hand out and clenched it into a fist. “Oh no, you don’t.”</p><p>A desperate scream of pure pain came from the distance.</p><p>Henry smiled. His face glowed with vicious joy, so shocking that Karina took a step back. He stared into the distance. “Not as fun to pick on someone your own size?”</p><p>The scream kept ringing higher and higher, pausing for the mere fraction of a second that it took the agonized being that was making it to gulp some air.</p><p>Behind Henry the fallen girl opened her eyes and rose to her feet. The older couple awakened from their trance.</p><p>Henry twisted his fist and jerked it, as if ripping something in half.</p><p>The scream died.</p><p>“Thank you,” the girl said.</p><p>“It’s all right. Next time remember to cloak.” Henry turned to Arthur. “They have two hundred civs, fifty pigs, two heavy field artillery batteries, six squads of twenty-five men each, and seven Mind Benders. Minus one.”</p><p>He’d killed an enemy Mind Bender, Karina realized. Kind, shy Henry crushed him, but not before he made him suffer.</p><p>“Too many,” someone muttered.</p><p>“It’s overkill,” Daniel said.</p><p>“There is at least one Demon, too,” Henry said.</p><p>Lucas laughed, a bitter, self-assured chuckle.</p><p>They had a Demon like Lucas. Lucas would fight it. She saw it in his face. She didn’t want him to die.</p><p>Something climbed over the crest of the distant hill, spilling onto the prairie. Karina squinted. What in the world . . .</p><p>Arthur’s face remained serene. “Begin immediate full base evacuation.”</p><p>A dark-haired woman on Karina’s left held out binoculars to her. “Here. Looks like I won’t need them.”</p><p>“Thank you.” Karina lowered Emily to the ground and took the binoculars. “Stay with me, baby.”</p><p>The woman turned and ran, back toward the garden. A moment later the alarm sounded again, but this time in two short bursts.</p><p>People peeled off from the group and headed back, deeper into the base. Now was her chance. If she could slip away and go through the gate, she could get away. Nobody would find her in the confusion . . .</p><p>“Lady Karina,” Arthur’s voice rang out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She snapped back to look at him.</p><p>The gaze of his blue eyes bore into her. “Stay close. We must hold until the evacuation is complete. Lucas may have need of your services.”</p><p>His voice was soft but his eyes left her no doubt—he knew what she was thinking and escape was futile.</p> <p>Arthur turned and looked out to the plain. She looked, too, raising the binoculars to her eyes. The mountains swung into view, suddenly clear. She tilted the binoculars lower . . .</p><p>People came walking over the hill. To the right a middle-aged man in filthy khakis and a ripped shirt with thin blue stripes climbed over a rock. Next to him two dark-skinned men in jeans helped a third limp forward. On the left a woman in business clothes walked on, stumbling. The binoculars captured her face. Her features, caked with grime and dust, twisted into an expression of abject terror.</p><p>Karina inhaled sharply. A red-haired teenage girl followed the woman. Her ruffled black skirt hung limply around her skinny legs in torn stockings. She shuddered as she walked and Karina realized she was sobbing.</p><p>Karina jerked the binoculars down. “There are people out there!”</p><p>“They are captives,” Lucas said. “People the Ordinators snatched up here and there, the missing. The pigs are running them at the net. It’s designed to stop high-impact projectiles, but if enough body mass hits it at once, it will overload and collapse.”</p> <p>The memory of the bird shocked by that red glow flashed before her. “They will die!”</p><p>“That’s the idea,” Daniel said. “They’re trying to break through before we have a chance to detonate the network.”</p><p>“Can’t they just use a tank or a vehicle?”</p><p>“The net would fry it,” Lucas said grimly. “Biomass is the best way to go.”</p><p>The people on the right broke into a run. Karina raised the binoculars.</p><p>A creature bounded over the hill. Huge and brown, it looked like a seven-foot-tall boar moving too fast on surprisingly long and skinny legs. The pig paused. Its long crocodilian jaws gaped open, flashing fangs as large as her fingers, wider, wider, until the pig’s entire head seemed to split in half. A hoarse roar burst forth. The daeodon.</p> <p>The people in front of the creature scattered like minnows, sprinting across the rough ground toward the net in a ragged herd, a blond man in a once white tank top leading the run. The daeodon roared again and gave chase.</p><p>On the left, a second pig crested the hill, sending another group of prisoners into flight. An older man in a torn flannel shirt stumbled and fell, splaying in the dirt. The pig bore down on him. The long jaws dipped down. A shriek rang out, vibrating with the sheer terror of a man who knew his life was ending, and vanished, cut off in midnote.</p><p>On the right, the blond man ran headfirst into the net and jerked, caught by a deep carmine glow. His body convulsed, his legs and arms flailing, as if he were being shocked by a live wire. The man directly behind him tried to slow down, but his momentum carried him right into the red glow and he shook, caught in a similar seizure.</p><p>Karina whipped to Lucas. “Can’t you do something? Anything? They’re dying!”</p><p>“We can give them a quick death once they break through,” Lucas said.</p><p>“But . . .”</p><p>“Lucas is correct,” Arthur said. “We will spare them the pain.”</p><p>The air around Arthur shimmered. People backed away. He bowed his head and stood very still.</p> <p>On the prairie, the prisoners tried to swerve away from the red glow, but the pigs drove them forward. One by one the bodies crashed into the net. Karina turned Emily around. “Don’t look, baby.”</p><p>“What are they doing?”</p><p>Lie, she told herself. Lie. But the words spilled out on their own. “They are dying, Emily.”</p><p>“Why?”</p><p>“Because the bad guys are killing them.”</p><p>“Are the bad guys going to get us?”</p><p>“No, little one,” Henry said. “Arthur and Lucas will kill them.”</p><p>The red glow bent forward under the weight of many bodies, and still more people were coming across the prairie, herded by the daeodons like sheep. Arthur didn’t move. His eyes stared into the distance, somewhere far away.</p><p>“How long till the detonation?” Lucas asked.</p><p>Henry closed his eyes and opened them. “Three minutes.”</p><p>Lucas rolled his head right, then left, cracking his neck.</p><p>With a bright flash the net collapsed under the weight of the bodies. People fell into the gap, tumbling over each other, convulsing on the ground. The four huge pigs who’d herded them to the net galloped into the gap, trampling the bodies beneath their hooves. The daeodons charged up the slope.</p><p>Lucas grunted. His skin seemed to peel off his bones in thick slabs. Bloody mist filled the air. Karina stared, unable to look away. Bones bent, ligaments twisted, and the beast burst forth. It was bigger than she remembered. In her memory, he had morphed into a dark, featureless shadow, but here, in the light of day, she saw every bulge of terrifying muscle, every fang, every sickle claw, every hair in the black crest of his mane.</p><p>Fear washed over her, setting every nerve on fire.</p><p>The beast turned his head. Lucas’s green eyes looked at her from a horrid face.</p><p>Don’t flinch, she told herself. He was about to fight for them. He could die in the next few moments. She didn’t want him to go into it thinking she was disgusted by what he was. Whatever Lucas’s faults were, he was about to put himself between the pigs and her daughter. He deserved better than the blind fear the two women in the garden showed him.</p><p>She met his gaze. They looked at each other.</p><p>“Good luck,” she said.</p><p>The daeodons roared, pounding up the slope.</p><p>The beast who was Lucas nodded to her, leaped down, and smashed into the first pig. His claws sliced across the daeodon’s neck and it went down. Lucas swerved away from the gaping jaws, leaped onto the second daeodon, and thrust his claws through the brown hide and wrenched a bloody shard of its spine out.</p><p>The third pig halted, unsure. The fourth veered left, around the carnage, and charged up the hill, digging into the hard dirt with its hooves.</p><p>Karina clenched Emily closer. Her instinct told her to run, but around her nobody moved.</p><p>Twenty yards. Fifteen. Ten.</p><p>Daniel stepped forward and clenched his fist. With a dry crunch, the bones of the pigs’ front legs snapped. White bone sliced through the muscles and skin. The pig squealed, crashed on its side, and rolled down the hill. Lucas rose from the body of the third pig, leaped over the fallen daeodon as it tumbled down, and smashed its skull with one brutal punch.</p><p>“Are we in a story, Mommy?”</p><p>Karina looked down into Emily’s big brown eyes. I wish we were. I wish we were dreaming. She reached deep inside herself, through the fear and anxiety and disbelief, and when she spoke, her voice was calm and confident. “It will be okay, baby. We will be just fine.”</p><p>More daeodons spilled from the prairie, dashing toward the base; so many, she couldn’t even count. A huge beast led the charge. He looked just like Lucas, except for the reddish fur. The red beast sprinted, widening the distance between himself and the mass of daeodons, moving in powerful leaps that devoured the prairie.</p><p>Lucas backed two steps up the slope and planted his giant feet.</p><p>The beast thundered at them, hurtling like a cannonball. It jumped and sailed over the mass of writhing human bodies.</p><p>Lucas leaped. The two monsters collided in midair and Karina realized that Lucas was visibly smaller. They rolled down the hill, snarling and tearing at each other like two massive feral cats.</p><p>The larger beast raked Lucas’s side. Blood wet the dirt in a hot spray.</p><p>Karina spun to Daniel. “Help him!”</p><p>“I can’t,” he growled. “I need a clear target.”</p><p>The beasts brawled and snapped, biting and ripping in a tornado of claws and teeth.</p><p>The alarm blared again, this time a single long note followed by a short beep. Daniel whirled to an older woman standing next to him. She was short and plump, with an elaborate knot of tiny braids on her head. Her gray pantsuit was pristine, her makeup flawless. She looked like a secretary or a receptionist for an upscale business firm.</p><p>“Rip it,” Daniel said. “Now.”</p><p>The woman pulled a knife out of her pantsuit, jerked the sleeve back, and slashed a gash across her skin. Blood welled. The pain must’ve been excruciating, because she bent nearly double, cradling her arm.</p><p>At the bottom of the hill, the larger beast hurled Lucas aside. He flew, flipped in the air, and landed on all fours. Blood streamed from his flanks. The two creatures squared off and collided again.</p><p>The woman straightened. A pale green glow burst from her stomach, twisting into thin strands of light. The strands snapped out, flared, and split the empty air in half. A seven-foot circle appeared, filled with darkness.</p><p>So that’s what the dimensional rip looks like.</p><p>Arthur raised his head.</p><p>The ground shook under his feet. Tiny rocks bounced up and down. The vibration pounded the bottoms of Karina’s shoes.</p><p>“Lucas! End it!” Daniel screamed. “End it now!”</p><p>The reddish beast leaped, striking with an enormous paw, claws out like daggers. Lucas spun, rolling to the side, inhumanely fast. The large beast landed in the dirt. The moment his paws touched the ground, Lucas vaulted onto his back. Huge teeth flashed and he clamped onto the rival beast’s neck. The creature screamed, kicking and trying to roll. Two beasts plunged down.</p><p>Karina held her breath.</p><p>The black beast rose, slowly.</p><p>She exhaled.</p><p>Lucas pondered the body of his fallen opponent as if he wasn’t sure where he was or what he was doing there. Behind him, the captives, caught between him and the sea of pigs, scrambled to their feet.</p><p>The vibration below the surface increased, hitting Karina’s feet like the blow of an underground hammer. Tiny red sparks flickered around Arthur.</p><p>“Hurry,” Henry whispered next to her. His gaze was fixed on Lucas, his voice an insistent low whisper, almost a command. “Hurry.”</p><p>Lucas jerked. His head snapped up. He saw them and bounded up the hill. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sparks around Arthur danced faster. Arthur’s feet left the ground. He rose three feet into the air, his body tense, looking down at the prairie stretching before him.</p><p>Oh, God.</p><p>The beast reached the apex of the hill, crashed down in a sickening revolt of flesh, and rose again, as Lucas, bloody and shaking. He shuddered on his feet, careened, and Karina caught him. For a moment his entire weight rested on her. She looked into his eyes and saw pain. And then Daniel pulled him off her and dragged him forward to the rip.</p> <p>In the distance the foghorn blared frantically. The daeodons closed in. Karina swept Emily into her arms.</p><p>Henry wrapped his arm around her. “We must go. You don’t want to see this.”</p><p>They hurried to the rent. She looked back over her shoulder, as if pulled by some invisible force. The sparks darting around Arthur’s shoulders paused. For a fraction of a breath they hung motionless, then blinked, then sparked into brilliant light. Red radiance burst from Arthur’s shoulders in twin streams, boiling with flashes of white and orange, unfurling into two enormous wings knitted of lightning.</p><p>“Come on.” Henry pulled her toward the rip. It loomed before them, lightless and frightening, a hole in reality itself.</p><p>The red lightning flashed. The front row of captives fell to their knees. Fire spilled from their eyes and mouths, as if they were being incinerated from the inside out. Their faces turned to ash. The second row followed and on and on and on . . . Jets of flames spurted from the ground. The whole hill quaked as if caught in the grip of a powerful earthquake.</p> <p>Oh, dear God. So that’s what a Wither does . . .</p><p>“Now!” Henry barked.</p><p>Karina took a deep breath, cradled Emily, and stepped into the darkness.</p><p>It was like being underwater. As if she were walking through a flooded tunnel of crystal-clear liquid filled with sunlight. Her body was very light, almost weightless. It lasted a lifetime or a single moment—Karina couldn’t tell—and then she stepped onto beige carpet.</p><p>For a second she was afraid to move, afraid to do anything, and then she remembered to breathe. The air tasted sweet.</p><p>Emily looked at her, blinking.</p> <p>“Are you okay?” Karina whispered, her voice strained.</p><p>Emily stirred. “I know!”</p><p>“Know what, Emily?”</p><p>“Mom, I know, I know! I am the Courageous Princess. Like in the comic book.”</p><p>Karina exhaled and hugged her. For some reason, she wanted to cry.</p><p>They stood in a foyer. There were people around her, both men and women. In front of her a glass wall guarded a conference room, a long black table with matching chairs; and beyond that a floor-to-ceiling window offered a view of an evening city from above, lit up with electric lights. They had to be on the twentieth floor.</p><p>They had gotten away.</p><p>In her mind the bodies still burned, vomiting fire and ashes. What the hell was Arthur? What were all of them?</p> <p>“We shouldn’t be here,” Henry said next to her, his voice vibrating with alarm. “This is wrong.”</p><p>A woman behind her snarled. “The fucking Ripper dropped us into the wrong base.”</p><p>A soft thud made her turn. Lucas crashed onto the carpet and Daniel tried to pick him up. Lucas’s eyes were closed. He looked so pale, his skin had gained an almost greenish tint.</p><p>She set Emily down and knelt by him, sliding her hand on his forehead. His skin was cold, almost clammy. Blood clung to his rib cage and a big purple bruise stained the right side of his stomach. He looked like he was dying. The heavy metallic scent rolled off him, so thick she almost choked. He wasn’t just hungry for her blood. He was starving for it and he hurt.</p><p>“What’s wrong?”</p><p>“Too much venom,” Daniel spat out. “He shouldn’t have phased into the attack variant so soon after the last fight.”</p><p>Arthur stepped onto the carpet out of thin air. “He will be fine.”</p><p>A grimace skewed Daniel’s face, stretching his scar. He looked like a rabid dog. “We should’ve evacuated yesterday. You overwork him. You know he needs at least two weeks between phasings, but you counted on him to save your ass anyway, because you knew he would do it. Look at him. Look at him, Arthur. He’s dying from the venom.”</p><p>Arthur glanced at the skyline. “Not now, Daniel. Where is the Ripper?”</p><p>“You are a fucking asshole!”</p><p>Henry closed his eyes and opened them. “She isn’t in the building.”</p><p>“Daniel, stop your hysterics and search the building . . .”</p><p>“Fuck you!”</p><p>“Will the two of you shut up?” Lucas said. His eyes were still closed. A shudder gripped him. He arched his back, his heels digging into the carpet, his arms rigid, his massive body straining against the pain.</p><p>Idiots. Karina wrapped her arms around Lucas, trying to hold him down, but it was like trying to hold down a bull. “We need something for his mouth. He’s grinding his teeth.”</p><p>“Vault, now,” Arthur snapped. “Pick him up.”</p><p>People swarmed Lucas, brushing her away. He lashed out, convulsing, throwing a man aside like a rag doll. They pulled Lucas up and dragged him down the hall.</p><p>Arthur bent down, grasped her by the elbow, and pulled her to her feet. “Come with us.”</p><p>“My daughter . . .”</p><p>Arthur’s fingers clenched her arm like a vise. He pulled her down the hallway, after the clump of people trying to move the convulsing Lucas forward.</p><p>Emily ran after her. “Mommy!”</p><p>Karina jerked. “Let go of me! You’re scaring her!”</p><p>“Do you want your daughter to live?” Arthur asked.</p><p>“Yes!” Bastard.</p><p>“Then do as you’re told.”</p><p>They were almost to the end of the tunnel. Something swung open with a heavy metallic sound. Karina caught a glimpse of a huge vault door standing ajar. The people carrying Lucas ducked into the round opening and parted, and Karina saw a room beyond the door. It lay empty and the light of the white fluorescent lamps reflected off the metal floor and walls.</p><p>They would put her into the vault with him. Lucas hurt so badly, he was convulsing. He required her blood and he’d rip her to pieces to get it. If she crossed that threshold, she would die.</p><p>“Mommy!”</p><p>She dug her heels in. “Emily!”</p><p>Henry picked Emily up. “It’s okay, little one.”</p><p>“You agreed to the contract,” Arthur said. “Time to honor it. Get in there and do whatever you have to do to keep him alive.”</p><p>If she didn’t go in, they would throw her in. She heard it in Arthur’s voice.</p><p>Karina jerked her arm out of his hand. “Take care of my baby, Henry.”</p><p>“I will,” he promised.</p><p>Karina took a deep breath and walked inside.</p><p>“No sudden movements,” Henry called out.</p><p>The door behind her clanged shut.</p><p>Chapter 8</p><p>Lucas curled into a ball on the floor. The pain scoured the inside of his spine as if someone were scraping his vertebrae with steel wool. It stretched in tight strings through his ligaments; it pooled in his joints, in his fingertips, under his tongue. He felt it in his teeth. It ground him like a grain of wheat between two millstones.</p><p>His ears caught the sound of approaching steps.</p><p>He forced his eyes open.</p><p>Karina knelt by him. He inhaled her scent and felt it spark a deep, angry hunger inside him. She pulled him like a magnet. His body screamed for her blood and the end of the pain. Tearing into her would be bliss.</p><p>She was rolling up her sleeve. Her lips were pinched together.</p><p>He had to speak now. It hurt and he was tired, but he managed. “Don’t.”</p><p>“Arthur said you had to feed.”</p><p>“Arthur is a sick fuck. I told you that.”</p><p>“I can smell you,” she said. “You need to feed.”</p><p>“If I feed now, you’ll die.”</p><p>“If you don’t, you will, and then they’ll kill Emily.”</p><p>Ah. For a second he thought she had felt sorry for him, but no. “Nobody will touch Emily. And I’m not dying. Just hurting.”</p><p>“You look awful.” He heard a soft note in her voice. In spite of everything, she cared a little bit. He would take that. That was more than he usually got from anyone.</p><p>She hadn’t shied back when he phased. Her knees had trembled but she didn’t flinch. For that he was grateful.</p><p>Karina brushed the grime off his face, her eyes kind, her voice gentle. “Lucas, don’t be an idiot. Feed. It will make you feel better.”</p><p>“The pain isn’t fatal. It will pass. You’ll need all of your blood before long.”</p><p>She pulled back. “What does that mean?”</p><p>“Do you have a fever?”</p><p>“Yes.”</p><p>“Tired?”</p><p>“Yes. Lucas, what is happening to me?”</p><p>He almost told her the truth. “I told you before, you’re reacting to the venom.”</p><p>The ache had burrowed deep into the base of his spine. Lucas forced himself to turn, trying to shift his weight, and it exploded into a blinding white, mind-numbing haze, twisting his limbs. Like being punched in the mouth by a star. He passed out.</p><p>When he awoke, her scent was everywhere. The hunger stirred inside him, demanding. Lucas clenched his teeth and felt a light touch on his cheek. His eyes snapped open. She was sitting next to him, her back resting against the wall.</p><p>“How long was I out?”</p><p>“Maybe a minute or two.”</p><p>“Try to time the next one. I need to know if they’re getting shorter.”</p><p>“Is there anything else I can do?”</p><p>The ache rolled back at him. “Talk to me.”</p><p>“About what?”</p><p>“You never did tell me exactly why Emily hoards food.”</p><p>She sighed and brushed the brown lock of hair from her face. “It happened after Jonathan died.”</p><p>“Your husband?”</p><p>“Yes. I don’t want to talk about it.”</p><p>“Why?”</p><p>She met his gaze. “Because then you will know things about me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“And that would be bad?” Lucas asked.</p><p>“Yes.”</p><p>Now he wanted to know more.</p> <p>“Does it hurt to be the beast?” she asked.</p><p>“No. Phasing is like being a superhero. I’m faster, stronger. Everything is sharper. There are no consequences. I can let myself off the leash. But my attack variant’s venom is toxic to my human phase variant. Turning back into a man is a bitch.”</p><p>A small tremor shook his legs. Lucas grunted and closed his eyes, trying to will the pain away.</p><p>“How long will we be locked in here?”</p><p>“Until I pull through. Hours. Arthur is trying to keep me safe. I’m an asset and I’m rare and difficult to replace. We shouldn’t have come here, to this building.” The words came slowly. “This base is not secure. We rent five floors here. We don’t own the buildings and don’t control access to it.”</p> <p>Karina bent down, looking closer into his eyes. Tiny red rosettes marked the skin on her cheeks and forehead. Her own transformation was closing in. Shit. He hoped she would have another day. He didn’t want her to phase here, in the vault, without medical help, without Henry to keep her calm. She could die and he wanted her to live. He had to heal fast.</p><p>Heal, Lucas willed in his mind. Heal.</p><p>The pain exploded in a white burst and dragged him under.</p><p>When the light faded he heard her voice, soothing, calm, warm. Like sitting back in the hot tub, soaking his exhausted body while she floated nearby. “. . . met in college. Jonathan was handsome. Funny. His father was the CFO for Drivers Company. It’s a big insurance company in the Southwest. Brian’s very driven, very conscious about his appearance. Brooks Brothers suits, expensive watch, a new BMW every couple of years. He and Lynda had Jonathan when they were much older, in their forties. Jonathan could do no wrong. He was their golden child. Good at sports, good at academics. He was easygoing and charming. The perfect son.”</p><p>She leaned her head against the wall. He moved closer to her and rested the back of his head on her ankle. She let him do it. From here he could see her face. He could touch her hand. Lucas closed his eyes and let himself sink into her voice.</p><p>“Things always went Jonathan’s way. I used to watch a cartoon when I was younger. Two mice were living in a lab, and one was very smart and the other one was a knucklehead. So every night the knucklehead mouse, Pinky, would ask the smart mouse, ‘And what are we going to do today, Brain?’ And Brain would say, ‘Try to take over the world!’ And Pinky would get all excited. See, Brain was serious. He was trying to take over the world. But to Pinky it was all a big game. That’s kind of how Jonathan was. The world was his huge playground and every day he’d play at taking it over. Some days he was an athlete; other days he was a student. When we met, he was finishing his MBA and I was getting my bachelor’s in accounting. My parents had died in a car accident when I was a senior in high school. I had just turned eighteen when they passed.”</p> <p>“I’m sorry,” Lucas said and meant it.</p><p>“Thank you. They left me just enough money to get me through college and I had to work to feed myself. Before they died, I wanted to go into art history.” She laughed a little, a bitter, quiet sound. “I wanted to be an art appraiser. You know, the person who examines art for auctions and museums to determine if it’s authentic. I always thought it would be so neat. But I was on my own then, so I went into accounting instead. It seemed . . . sensible. I was trying to be sensible. To have some structure. And then Jonathan shot into my world like a comet. He could make anything seem exciting. He made things fun. His parents were always very formal with me. I don’t think they ever understood why he liked me, but Jonathan picked me and he could do no wrong.”</p><p>He very badly wanted to murder Jonathan.</p><p>“It was great at first. Jonathan’s father’s connections got him a position in a private equity firm. During the day he got to play a businessman and during the night he got to play a husband. And then Emily was born. Well, you’ve seen her.”</p><p>“She is pretty,” Lucas said.</p><p>“She is. Jonathan loved her. It was yet another new game: being a dad. He used to show her off like a cute purebred puppy.” She sighed again. “I should’ve seen it then. Anyway, everything was great for a few years and then the bottom fell out of the economy. Suddenly it wasn’t fun anymore.”</p><p>“The party was over,” Lucas guessed.</p><p>“Yes. Jonathan had to start working for his living and buckle down, or the firm would cut him loose. I worked, too, and we were doing okay, but we had to mind our p’s and q’s and Jonathan didn’t want to be bogged down with details. We used to have the stupidest conversations. He couldn’t understand why he couldn’t drop thirty grand on a membership at a country club. It’s like his brain couldn’t digest the concept of a budget. I mean, the man had a master’s degree in business management, for crying out loud.” Her voice rose too high and Karina fell silent.</p> <p>“What happened?” he prompted.</p><p>“Finally he decided he was tired of playing with us. He started sending me these long rambling e-mails about how he felt constrained and unhappy and about the need to find himself. He wanted to live fully, he said. To find the zest in life. At first I was concerned, then I thought he was cheating, but he wasn’t. It’s not like we were ever on the verge of bankruptcy. We just couldn’t do exciting things anymore, like ordering champagne for the entire bar. I offered to move; he didn’t want to do it. No solution I suggested was good enough. He tortured me like that for about four months. In the end I didn’t even care anymore. I should’ve fought harder maybe, but I remember one of my friends calling and telling me she saw Jonathan at her office party without me, and you know what I thought?”</p><p>She paused. Her dark eyes were huge on her pretty face. “I thought, ‘Good. Maybe he’ll meet someone and I can divorce him.’ That’s an awful thing to think about your husband. That’s when I knew the marriage was over. We were heading downhill, except there was Emily. How do you explain to a four-year-old that Daddy decided he doesn’t want her anymore because he needs to go find himself? So I spoke to his parents. I thought maybe they would talk some sense into him.”</p><p>Lucas grimaced. “You said he could do no wrong.”</p><p>“Yes, it was stupid, but I was desperate. They called him over to have a heart-to-heart. Jonathan took me out to dinner at the end of the week. I knew something was up; I could just tell. It wasn’t a date. He told me he had filed for divorce. He had no problem paying me alimony, and I could retain all my parental rights.”</p><p>A shadow passed over her face. She seemed small all of a sudden.</p><p>“We were in the car, going to pick up Emily from the sitter’s. We were fighting about his generosity in regard to my ‘parental rights.’ ” Her voice dripped with bitterness. “He wanted to leave and stay gone. I insisted that Emily needed a father and he couldn’t just take off. He was mad. He told me that everyone had a right to be happy. He wanted to be free of me and Emily but he didn’t want to be judged for it. And then, all of a sudden, he lost consciousness. It was like someone had flipped a switch. We shot into the opposing lane. I remember headlights. I woke up in the hospital.”</p><p>She fell silent. “He had a stroke,” Karina said finally in a flat voice. “He had fibromuscular dysplasia. Nobody knew. He was healthy as a horse, played racquetball, and then he just died. It was touch and go for me for a little while but I bounced back. I was in the hospital for two weeks. Emily had to stay with his parents. They didn’t feed her.”</p><p>“What?”</p><p>“Brian, Jonathan’s father, always eats out. When Jonathan died, he spent all his time at a country club. He said it was his way to cope. Lynda is in her seventies. She has a touch of dementia. All she did was eat candy all day, but she wouldn’t give Emily any—it would ruin her teeth. She would forget to give Emily lunch, and when she did remember to feed her, she would either try to cook and burn it or she’d give Emily food that had been in the fridge for so long, it wasn’t just moldy, it was blooming.”</p><p>She was crying, not from pity but from anger. There were no tears, but he heard it in Karina’s voice, hidden behind the flat tone.</p><p>“They had a bowl of nuts set out and Emily told me she would pretend to fall asleep and then sneak out and steal them. When I got out of the hospital, she was six pounds lighter. She barely weighs anything as it is. So now you know why she hoards food. She was terrified, her father had just died, her mother was in the hospital, and her own grandparents wouldn’t feed her. I told Arthur she doesn’t have anyone except me. I meant it. We are not welcome at that house. They blame me and Emily for Jonathan’s stroke. We made his life so difficult, he died to escape.”</p><p>The red rosettes on her face were turning darker. Karina touched her hand to her forehead and looked at it. Her eyes widened. She rubbed his forearm.</p><p>“This is another reaction to the venom?”</p><p>“Mmhh-hhm,” Lucas said.</p><p>“I told you my story. Tell me yours now. It’s fair.”</p><p>“What do you want to know?” he asked, wondering what she would think if she looked inside his mind and saw him strangling her husband.</p><p>“Who are you? All of you. Who are you really? I need to know what’s happening to me.”</p><p>Lucas sighed.</p><p>She had told him too much, Karina decided. As much as she wanted for it to be a bribe, a down payment for the information he held, at least in part she told him what she did because he was lying beside her, bruised, beat up, bloody, and hurting. He needed a distraction and she had enough compassion to give him one. But she hadn’t meant to pour her heart out. It just happened. He was in pain, and although she had the means to ease his suffering, he refused to feed, because he didn’t want to hurt her. He wasn’t willing to trade his pain for hers. The least she could do was talk and try to distract him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Karina reached over and touched his hand. His fingers closed on hers. Lucas glanced at her, surprised. They had that in common now—both of them treated any act of kindness with suspicion. She didn’t expect kindness anymore, except from him. But she was an outsider. He wasn’t.</p><p>“There are no scared women here to watch us,” he told her.</p><p>“It was never for them. It was for you.”</p><p>She almost cried and couldn’t even understand why. It was the stress, Karina told herself. The trauma of watching hundreds of people die at once. And the fever, which kept rising and rising. Her breath felt hot when she exhaled. Her skin was dry and too tight. And now there were rings of red dots all over her arms.</p> <p>She had never told the entire story of her marriage to anyone. It’s the fever. Of course it is.</p><p>Lucas was looking at her. Sprawled like that, even battered, he looked enormous. If a week ago someone had told her she would be locked in a vault with a nude, bloody man who was trying his best not to devour her to stop his pain, she would’ve dialed 911 to report a lunatic running amok.</p><p>“I’m going to tell you a story,” Lucas said. His voice was laced with fatigue. “You can choose to believe it or not. It can be the truth or just a story. It’s your choice.”</p><p>“Okay.”</p><p>Lucas closed his eyes. “Suppose there is a civilization. A powerful country. It has taken over all of its available territory, but it knows that it must expand. It must continue to grow outward, or it will rot and collapse. This civilization sends colonists out to explore new territories. They find fertile lands and colonize them. When they succeed, they let the knowledge of the large civilization fade. The small colonies grow and prosper on their own, and when they develop enough, they rediscover their mother civilization and rejuvenate it with their unique achievements.”</p> <p>He glanced at her.</p><p>“Okay,” Karina said. “I can see how that would happen.”</p><p>“Suppose a new island was found for colonization. An island with an abundant ecosphere and great resources. The civilization had done this many times before and they had developed a protocol. The colony ships arrived and the colonists created thirteen small settlements, Houses, one for each colony ship.</p><p>“Genetically, all the colonists belonged to the Base Strain. It’s a very stable breed of human, long-lived, resistant to diseases, armed with superior DNA repair mechanisms to counteract mutation. To successfully colonize a new environment, a species must adapt to it. To facilitate this adaptation, most of the colonists were exposed to an agent inhibiting their cellular and DNA repair and vulnerability to native viruses.”</p><p>“They deliberately made their people weaker? How does that make sense?”</p><p>“They didn’t just want a colony,” Lucas said. “They wanted a unique colony, perfectly in tune with this new island. That’s how the civilization kept itself from stagnation. The colonists wanted an explosion of mutations in the future generations, and they needed a shorter life span and faster sexual maturity to pass the new changes on to their offspring. That’s why scientists experiment on mice: they breed quickly and don’t live very long. The shorter life span goes hand in hand with faster sexual maturity. But it also brings negative anthropological consequences: immaturity, inability to pass on knowledge, loss of ethics and culture, and so on. These consequences were considered acceptable. The colony had to develop on its own without the knowledge of its origin anyway. The sooner people forgot where they came from, the better. A small group of the colonists remained as Base Strain for control purposes. They lived in the settlements, the Houses, and monitored the whole thing. With me?”</p> <p>Sort of. “Go on.”</p><p>“Mutations bloomed. A succession of several dozen subspecies of human followed. Some subspecies developed variations, people with similar powers or physiology. Subspecies 29 showed all of the adaptations necessary for survival, but all eight of its types were plagued by sensitivity to heat and alarmingly low fertility. Subspecies 44, type 3, produced exceptional Mind Benders, who were prone to insanity.”</p><p>“Is that what Henry is?”</p><p>Lucas nodded.</p><p>“We’re not talking about islands, are we?”</p><p>“Some say islands,” Lucas said. “Some say planets. It’s just a story.”</p><p>A story, right. “Aliens.” She stared at him. “Are you trying to tell me that all of us are aliens?”</p><p>Lucas sighed. “You could say that. You could also say that once the planet shaped us and twisted our DNA, we are now just as native as anybody else.”</p> <p>“What about Subspecies 30?” What about you?</p><p>Lucas’s eyes fixed on her. “Subspecies 30, types 1 through 5, otherwise known as Demons. A venomous, carnivorous, predatory variant of human with the ability to drastically alter its morphology. They were powerful, aggressive, territorial, and they dominated their point of origin for a few hundred years, hunting in small packs, but this subspecies was not viable long term. They were crippled because their bodies couldn’t produce a set of small molecules necessary for their survival, so they had to cannibalize other humans to get it.”</p><p>“Cannibalize?”</p><p>“At that point the various subspecies of human had only a rudimentary language and no memory of where they came from,” Lucas said. “No ethics, no morals, nothing. They were forming fledgling societies and ‘might is right’ was the law. If I need your blood, and there is nothing in my upbringing or experience that tells me I shouldn’t, why wouldn’t I kill you and eat your flesh? Being a nice guy is a modern concept.”</p><p>He was serious. He was actually serious.</p><p>“Should I keep going?” he asked.</p><p>“Yes.”</p><p>“This went on for hundreds of years. The small remaining pockets of Base Strain, the original colonists, kept as a control group, meticulously documented all of it from their Houses. They didn’t interfere. They just cataloged what occurred.</p><p>“Then suddenly Subspecies 48 popped on the scene. The Rippers had a fatal vulnerability to cancers but also the ability to rupture holes in reality, accessing dimensional fragments. This was a new development, unknown to the colonists, and nobody knew what to do about it. Some Houses took Ripper children and raised them within the settlements to study them.</p><p>“The mutations bloomed and bloomed, until one subspecies emerged as best adapted. It did well in almost every climate. It reproduced quickly, showed mental agility, and demonstrated decent DNA repair. At approximately six thousand planetary cycles, Subspecies 61 was declared viable. The colonists had done their job: they had created the type of human with the best ability to survive and prosper. Now nature needed to take over. All support for other strains ceased, as dictated by the Original Mandate. Ile must survive. Subspecies 61 became ile. Everyone else needed to die to make room.”</p><p>“Subspecies 61. Humans,” Karina guessed. “Us.”</p><p>“No,” Lucas said. “Them. Your neighbors, your friends. But not you.”</p><p>Her fever was now so high, she was freezing and melting at the same time. “You said them, not me. What do you mean, not me?”</p><p>“I’m getting to that. Other subspecies were dying out, while Subspecies 61 went on to multiply and claim the island.”</p><p>“The planet.” Karina didn’t need him to keep babying her.</p><p>“The planet,” he agreed. “The colony cities began to gradually phase out their technology. They were letting themselves disappear. But there was a protocol breach at one of the cities, as a result of which Subspecies 29, the one that had trouble with heat, discovered where they came from.”</p><p>“What do you mean?”</p><p>Lucas sighed. “I mean that the scientists at the Mare House fucked up. Subspecies 29 produced several unusually smart children. A sudden explosion of kids with genius-level intelligence was rare and odd, so the idiots thought it would be a good idea to study them further. They extracted these children and raised them within Mare with the full knowledge of their history. Well, the kids grew up and decided they didn’t want to go gently into that good night while some other breed of human took over.</p><p>“There was a quiet coup. By the time it was discovered, Strain 29 and their captive personnel had genetically corrected their shortcomings. Now they had no trouble with heat and they bred like rabbits. They decided that they were more viable than Strain 61. They, not humans, were ile. A mistake was made and they decided it had to be corrected. They were ordained to take over the Earth.”</p><p>Now it made sense. “They became the Ordinators?”</p><p>“Yes.”</p><p>“So this is it? They’ve been trying to kill us off for thousands of years?”</p><p>“More or less. They went to war, using the colonists’ original technology. The other cities opposed them, but they were weak by that point and in the process of dissolving themselves, so they plucked people from different strains with combat potential. The Ordinators were broken and would’ve been wiped out, except they acquired Rippers and began hopping through dimensional fragments. Eventually, so did we.</p><p>“Strain 61, the ile humans, was reproducing too quickly, and their numbers grew too numerous. They saw us and started forming religions and folklore. We had to disappear.”</p><p>“So this is how it is,” Karina said.</p><p>He nodded. “People like me have been keeping the Ordinators at bay for over thirty thousand years. Occasionally they break through with a new weapon. Sometimes it’s a virus that kills the food supply. Sometimes it’s bubonic plague. Sometimes they find a way to fiddle with the climate. The problem is that the Ordinators breed faster than us, they’re better organized, and their job is easier: it’s much simpler to destroy something than to protect it.</p><p>“There were thirteen Houses, one for each landing site. They have one House, the House of Mare. There are probably between one and two hundred thousand of them. We are the soldiers of the remaining twelve Houses. There are maybe fifty thousand of us. We crossbreed and have children with weird powers instead of dying out the way we should. This is the planet where everything went wrong. As humanity moves closer and closer to interstellar space flight, the Ordinators are getting desperate, because once we reconnect with the root civilization, it’s all over for them. They abandoned the original mandate and they will be exterminated. They’re attacking with everything they’ve got and we’re losing the fight.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She stared at him. “And where do I fit in?”</p><p>He took her hand and squeezed it gently. “You know why my people died out?”</p><p>“Because their own venom poisoned them?” Karina said.</p> <p>“That. But also because the colonists had done some projections. It was decided that if we were allowed to exist, we would destroy the other subspecies and then die out before reaching the level of medical sophistication necessary to fix our defect. They poisoned us, wiped out the entire species almost completely. They were right—even now the synthetic substitutes are just a Band-Aid. See, if we could’ve overcome this handicap, they would’ve let us murder everyone else, but the problem is that only one very specific subspecies produces the hormones we need. The Base Strain. The donors. The ones who gave rise to all of us.”</p><p>She jerked her hand back. “You mean I am a descendant of the original colonists?”</p><p>“Yes.”</p><p>“That’s not possible.”</p><p>“It is. Your type has a remarkably stable genome.”</p> <p>“But my parents were normal people!”</p><p>“They may not have known who they were. Maybe only one of them was a donor. A donor and Subspecies 61 will produce donor offspring.”</p><p>“But what about this?” She held out her arms, speckled with brilliant red. “Explain this!”</p><p>Lucas sat up. “When I fed on you, the mutation agent entered your bloodstream. In normal humans the mutation agent has grown weak over the generations. But I am carrying a near-full dose and I gave it to you during the feeding. You are changing.”</p><p>“Into what?!”</p><p>“I don’t know. I don’t know what’s in your DNA besides the donor genes. The mutation agent is an inhibitor. It will release the brakes within your body, short-circuiting your DNA repair, and let you develop into something that’s already there in your genotype, acquired over the centuries of crossbreeding with different human subspecies but suppressed. You could become Subspecies 61, but I doubt it. Chances are, it will be one of our subspecies instead.”</p> <p>They had taken her freedom, her home, and her dignity, and now they were taking away her body. “No! No, I am not doing it! I won’t! You hear me?” Karina surged to her feet. She managed two steps. Pain shot up through her bones. She cried out. The world went red and she crashed onto the floor.</p><p>It hurt. It hurt more than any pain she could remember. At first she begged, then she prayed, then she screamed and whimpered, squeezing her eyes shut, opening them again, glimpsing Lucas’s face against the harsh light of the vault, and then sinking into more pain. If only she could pass out completely and be done with it, but no, every time she tried, he shook her back, into the place of hurt.</p><p>“Come on, stay with me. Stay awake. Snap out of it.”</p><p>“Let me be,” she snarled.</p><p>“You pass out, you die. Come on. Stay with me.”</p><p>“I hate you! You did this to me!”</p><p>“That’s right,” Lucas snarled right back. “Hate me. Fight with me. Stay awake. You die, Emily will be alone. You don’t want to leave your daughter with an asshole like me.”</p><p>She just wanted the torture to stop.</p> <p>Another bout of agony rocked her. When it was over, she was so tired, she could barely breathe.</p><p>“The other woman . . .” Karina whispered. Forcing the words out felt like trying to swallow glass. “Did she have to do this?”</p><p>“Yes.”</p><p>“Did you kidnap her, too?”</p><p>“No.” Lucas gathered her closer, holding her against him. “She was one of us. Her family were donors of Daryon.”</p><p>“Did she hurt, too?”</p><p>“Yes.”</p><p>Lucas’s eyes were so dark, they seemed almost brown.</p><p>“Tell me about her.” She wasn’t sure why she wanted to know, but she did.</p><p>“She was very smart. And she looked beautiful. Very graceful, fragile, elegant.”</p><p>“Not like me, then?” Nobody would call her fragile. Or elegant, for that matter.</p><p>“Nothing like you,” he told her quietly.</p><p>The agony burned through her in a crippling spasm. “Why does it sound like a compliment?”</p><p>“Because she only looked beautiful. In our world nobody has the luxury of doing nothing,” he said. “Everyone has a function. I protect. Someone else oversees mining. Someone else oversees stocks and finances. Galatea’s family had only one function: to provide Base Strain to the House. For that they were sheltered, fed, and protected. Galatea never worked a day in her life.”</p><p>“Must be nice,” Karina whispered.</p><p>“She didn’t think so. She wanted the mutating agent.”</p><p>“She wanted this? Why?”</p><p>“Power,” Lucas said. “She thought she would become something much more prized than a donor and she would be free of me. Her father was my first donor. She wasn’t supposed to become one, but he died, and she had to take his place. She thought I was an animal. She was convinced that once I fed, she would become a Ripper and could use it as leverage to be free of me.”</p><p>“What did she become?”</p><p>“An Electric. She senses electric currents. It’s not an uncommon subspecies. A lot of technicians come from it.”</p><p>“Uh-oh,” Karina managed. Her lips were so dry, but there was no water. “Let me guess: it was your fault, right?”</p><p>He nodded. “It was everyone’s fault. She used to scream and throw fits, and then she wanted to fuck and she wanted me to beg for it. I was young and stupid. She was older, smarter, and beautiful.”</p><p>Karina raised her hand and touched his haggard face. “You loved her.”</p><p>“Yes. And I was so dumb, I thought it was enough. That’s why I let it go that far. She once told me that we, the House, had stolen her life. She wanted to stroll the streets of London, visit the Tate Modern, go to concerts in Royal Albert Hall. I offered to take her. She told me that it wouldn’t be the same. My presence would poison London for her.”</p><p>“She sounds charming,” Karina managed.</p><p>“I am what I am,” Lucas said. “No illusions. Life with me is hard, but she made a personal hell for me and her. I wasn’t the one who started sex, but I finished it. I dealt with it for four years and when I turned twenty-two, I decided I was done. I went on synthetics and told Arthur to find her a different place. He transferred her to a technical work crew. She tried to stab me with a knife when she found out. Galatea was never fond of getting her hands dirty. Three months later, during an attack, she disappeared. The next time Henry sensed her presence, we ran into the Ordinators.”</p><p>“She betrayed you.”</p><p>“Yes, she did.” Lucas shifted her carefully. “And now you know the whole story.”</p><p>“Do you miss her?” she asked.</p><p>He peered at her face. “How did you know?”</p><p>“I miss my husband,” she whispered. “I don’t blame you, you know.”</p><p>“For what?”</p><p>“For any of it. For the motel, for the feeding, for this.” Karina tried to swallow the pain away, but it remained. She wouldn’t make it. She could feel death crouching just a few feet away. “Lucas, you’re not a bad person. You have no idea how scary you are, but you’re kind and patient. If things were different . . . It has to start right . . . And we just can’t, because I would never be more than a slave and you would always own me. Please take care of Emily for me. Don’t let anyone hurt her. She’s a great kid.”</p><p>He didn’t answer. He just held her.</p><p>Karina awoke slowly. Within her body, the pain subsided, gradually, like a receding tide, fighting for every step of its retreat.</p><p>She opened her eyes and saw Lucas’s neck. Her face was buried in it.</p><p>He was kneeling on the floor, looking up. She was wrapped in his arms.</p><p>Her voice shook. “Why are you holding me?”</p><p>Lucas turned to look at her. His face was too close to hers. “I didn’t want you to die alone on the floor.”</p><p>She said things. Stupid, stupid things. Maybe it was a dream. His eyes assured her that it wasn’t.</p><p>“Please put me down.”</p><p>He let her go slowly. Karina slid down onto her knees and sat clumsily on the floor. Her legs shook a little. She felt light, so light and cold. “Is my change over?”</p><p>“Yes,” he said.</p><p>She had survived. “I don’t feel any different.”</p><p>“The change isn’t always obvious. Something will trigger it sooner or later.” He was looking up again. She glanced up, too, and saw a monitor in the ceiling. It showed an empty hallway.</p><p>A man in dark clothes darted across the hallway, brandishing a machine gun, and hid behind the wall.</p><p>“We’re being attacked,” Lucas said. His voice was calm, almost casual.</p><p>“How is that possible?” Emily. Henry had her. If they were being attacked, her daughter would be in danger.</p><p>More people flickered past on the screen.</p><p>“The Ripper must have been an Ordinator mole,” Lucas said. “We should’ve gone to a ranch in Montana—that’s our evacuation route from that base. Instead we’re in Detroit. This building is nearly abandoned; only the bottom three floors and the top five—those are ours—are operational. The blocks in a one-mile radius around it are basically deserted. We’re sitting ducks here.”</p><p>“Why didn’t Arthur evacuate us?”</p><p>“I don’t know,” Lucas said. “The Ordinators likely blocked the exits. We landed into a trap.” His face was dark. “Our best chance is to stay here.”</p><p>No. No, she had to go and find Emily. “Why?”</p><p>“I’m at my limit. Normally I would be drugged and sleeping this off for the next two or three days until my body came to terms with my venom. I could barely hold you. Most likely Arthur has sent for reinforcements. The vault is solid and must be opened from the inside. It will take them several hours to get through the door, so it’s likely they won’t bother with us right away. By the time they get around to it, we might be reinforced. Our best bet is to stay here and wait it out. We probably die either way, but here we have more of a chance. Especially if we’re quiet.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You have to let me out.”</p><p>He looked at her, obviously trying to decide if she was crazy. She had to convince him she wasn’t.</p><p>“Henry has Emily,” she said. “She’s out there somewhere.” Out in an abandoned building full of people with guns and God knows what sort of weird powers.</p> <p>Lucas looked at her for a long moment.</p><p>“I have to find her, Lucas. You don’t have to come with me. All I ask is that you help me open the door, because I don’t know how. I’ll find her myself.”</p><p>Lucas looked at the door. If they opened the vault, he would walk out of it a dead man. She stood before him, her eyes huge and brimming with worry. She just wanted her little girl back and she didn’t understand how far gone he was or how many enemies they would face.</p><p>Everyone dies, Lucas reflected. He’d been a selfish bastard all of his life. If he walked out of that door and died helping her find her child, at least he’d die doing something worthwhile, not cowering like a dog in the vault, waiting to be gunned down.</p><p>And she couldn’t go out there alone. She would be dead in minutes.</p> <p>He sighed, rose, and stepped to the wall. Karina clenched her hands. She couldn’t read his face. He touched it and a section of it slid open, revealing a number keypad and a small speaker. His fingers played with the keys. “Cousin?” Lucas said softly.</p><p>A faint hiss of static issued from the wall, then Henry’s faint voice came through. “Lucas. Red, gray, seven, pinned.”</p><p>Lucas grimaced. “Is the little girl with you?”</p><p>“Yes. Black.”</p><p>“How bad?”</p><p>“I’ll live.”</p> <p>“Don’t move. I’m coming to get you.”</p><p>“That’s unwise,” Henry said.</p><p>Lucas slid the panel back in place. “He is two floors below us. He’s been shot. Emily is okay; he is keeping her under. He can’t move because it’s too dangerous and he is cloaking, which makes him harder to find, but they will locate him eventually. The moment we leave this vault, you and I must fight to survive. Remember how you tried to cut me with your knife?”</p><p>“Yes.”</p><p>“Find that woman and be her.”</p><p>He had no idea how hard she had worked on hiding that woman and how ready she was to let her out.</p><p>“Don’t move.” Lucas walked over to the vault door, punched in a combination in the small number pad, and turned the wheel in the door’s center. Something clanged inside the door. Lucas moved to stand on the side. With a soft hiss, the door swung open and Karina stared straight at a man with a gun.</p><p>“Hands up!”</p> <p>She didn’t move.</p><p>The barrel of the machine gun glared at her, black and huge, like the mouth of a cannon.</p><p>“I said hands up!”</p><p>Lucas nodded at her. She raised her hands.</p><p>“Subspecies?” the man demanded.</p><p>“I’m a donor,” she said.</p><p>The man’s eyes widened. “Get up and walk to me.”</p><p>Lucas shook his head.</p><p>“I can’t,” Karina said, keeping her voice monotone. “I’m sick. I can’t walk.”</p><p>The man moved into the vault, one step at a time, careful, the gun pointing at her. He took three steps in. Lucas lunged, so quick she barely saw it. His hands closed about the man’s neck. Bones crunched, and the man sagged down on the floor, limp.</p><p>A week earlier, she would’ve screamed. Now she just got up and ran over to the body.</p><p>Lucas staggered, leaned against the wall, and pushed himself upright. He wasn’t joking. He really was at his limit.</p><p>She crouched by the body and began going through the man’s pockets. “I can do this alone.”</p><p>“Yeah, yeah.” He picked up the man’s machine gun and handed it to her. “Safety here.” He flipped a small switch. “Point and pull the trigger. Your instinct will tell you to keep clenching it. Don’t. Count to three in your head and let go of the trigger. Short bursts.”</p><p>Karina took the gun and raised it. It was heavy like a cement block. “You do realize that I can kill you with this.” She didn’t mean to say it. It just came out.</p><p>“Yes.” He turned his back to her and went out of the vault. A pair of jeans and a sweatshirt lay by the door. Lucas pulled on the clothes and started down the hallway. She followed him. He moved like a cat, soundless on bare feet.</p><p>They came to the end of the hallway. Lucas leaned against the wall, glanced around the corner, and looked at her. “Point and pull the trigger,” he whispered.</p><p>“Count to three,” she whispered back.</p><p>He nodded.</p><p>There were people at the end of that hallway. People she would have to kill. It’s them or us. Kill or be killed.</p><p>She took a deep breath, stepped into the hallway, and pulled the trigger. The gun spat thunder. Bullets ripped into four distant shadows. She thought there would be blood, but no. They just jerked and went down, screaming. She pounded the bullets into the bodies for another long breath and let go. Lucas moved next to her.</p><p>It was a test, she realized. He had to know if he could rely on her. Well, he could. She’d kill every one of them to get to Emily.</p><p>“What happened to letting go on three?”</p><p>“There were four of them,” she said. Movies and books told her she should be throwing up now, but she didn’t feel queasy. Her mouth was dry. It would probably hit her later, but now only Emily mattered. “I decided to take two extra seconds.”</p><p>Karina followed Lucas through the dark passageways as fast as she could. She was squeezing everything she had out of her exhausted body. Now that the first flush of adrenaline had worn off, fatigue set in. She didn’t walk, she dragged herself forward, shot when Lucas shot, stopped when he stopped. Only the next step mattered and she gritted her teeth and managed it again and again.</p><p>They made it to a small door. Lucas punched a code into the lock, the door snapped open, and they went through onto a concrete landing. Lucas punched the lock and the small square light in its corner turned red.</p><p>“We rest,” he said. “Two minutes.”</p><p>Karina sank down to the concrete and he sprawled next to her. The grimy floor was like heaven.</p><p>“Why are you helping me?”</p><p>His voice was a quiet growl. “Because I like you. And your little girl.”</p><p>She closed her eyes, feeling the cold concrete under her cheek. That wasn’t it. Lucas was making up for his past sins, but that wasn’t all of it, either. She knew the true answer. She could read it in his worn-out face. He wanted to save her, because he wanted her to stop flinching when she looked at him.</p><p>“Thank you,” she told him. “Thank you for helping me.”</p><p>“Time to get up.” He rose.</p><p>She cried out as he pulled her off the floor and followed him down the stairs. An odd sensation clenched her, almost like some internal spring had compressed inside her and now begged to be released. She stumbled, and it vanished.</p><p>One floor. The landing. They were midway down the next flight of stairs when the door below swung open.</p><p>An icy presence clenched her mind in a hard grip. It shut her off, trapping her. She couldn’t move; she couldn’t speak. Time slowed to a crawl.</p><p>The door kept opening, wider and wider. She saw inside it; she saw armed people pour out onto the landing. She knew she had to fire. Instead she just stood there, disconnected from her body.</p><p>And then Lucas shoved her down and sprayed the landing with bullets.</p><p>The presence gripped her mind and squeezed. She couldn’t even scream.</p><p>Orange sparks flared on Lucas’s gun. It died.</p><p>More people spilled into the landing over the bodies. Lucas leaped into the attackers. He smashed one out of the way, cracking the man’s skull against concrete like a walnut. The man slid down, leaving a bright red stain on the wall. Lucas ripped a woman’s throat out with his hand, backhanded another man down the stairs, and shuddered as a handgun barked. Red spray shot out of Lucas’s side. He lunged forward and broke the gunman like a twig and dived into the doorway.</p><p>The sound faded. She was completely disconnected from her body now. Only her vision worked.</p><p>Lucas emerged from the door, bloody, his eyes furious. He must’ve jerked her up, because her view changed and suddenly he was directly above her. He barked something, angry. The world shook. He dived down. His lips closed on hers. She felt nothing. He jerked back up and rocked back and forth, screaming again.</p><p>Henry, she read his lips calling. Henry.</p><p>He kissed her again and rocked, his face jerking up and down. His hands pushed on her chest. She saw the muscles on his arms flex, but felt nothing. The red stain on his sweatshirt spread wider. Was he doing CPR? Was she dying?</p><p>Henry.</p><p>The ice cracked. She heard a distant female scream somewhere impossibly far. Warmth flooded into her. Something popped inside her mind and she saw a radiant light, bright and glorious.</p><p>She’s gone now, Henry’s voice said in her mind. She won’t bother you again. You’re free. Breathe, Karina. Breathe.</p><p>The world snapped back to its normal speed, jerking her back into her body. She felt everything at once: pain, the hardness of the stair under her back, and the rhythmic push of Lucas’s hands on her chest. She gasped. He pulled her up, into his arms.</p><p>“Mind Bender attack,” he told her. “Up. Keep moving.”</p><p>The scent of heated metal rising from Lucas was so thick, she almost choked. He wasn’t just hurt. He had to be close to dying. If he died, she would be free, but in this moment she didn’t care. She just wanted him to survive. “You’ve been shot.”</p><p>“We must move,” he told her and pulled her up to her feet. “Faster!”</p><p>He drove her down the stairs, through the door, and along the narrow hallway. They dashed past a row of offices. Lucas rammed a door head-on and they burst into a small conference room. Henry lay slumped in the corner, his back pressed against a wall that was mirrored floor to ceiling. His cracked glasses sat slightly askew on his blood-smeared face. Emily was curled in the crook of his arm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Karina cleared the room in a desperate sprint and dropped to her knees. “Is she okay?”</p><p>“She’s fine,” Henry said softly. “She woke up a little when I had to help you, but now she’s sleeping again.”</p><p>Karina hugged her, cradling Emily’s small body. Finally.</p> <p>Lucas shoved the table against the door and landed next to them.</p><p>“I see you’re bleeding, too, cousin.” Henry smiled. “Nice of you to join me.”</p><p>“Where are the others?” Lucas growled.</p><p>“I don’t know. We were hit two minutes after you went into the vault. It was a concentrated assault. They came prepared. The seventeenth floor fell within ten minutes. We were retreating, when I got cut off. I went into cloak almost immediately. Our people may have evacuated.”</p><p>“Without us?” Karina stared at them.</p> <p>“Arthur probably thought I fed,” Lucas said. “Your blood would give me enough of a boost to either get Henry and me clear or to hide.”</p><p>“They are surrounding us,” Henry said. “What’s the plan?”</p><p>“You and I go. They stay,” Lucas said.</p><p>“Ah.” Henry nodded. “I thought it might be something like that.”</p><p>“What are you talking about?” Karina gathered Emily closer.</p><p>“We’re going to open that door,” Lucas said. “Henry and I will take off. Henry will make sure they concentrate on us and I will make sure to keep them busy. They will follow us. You will wait here for three minutes, then you will take Emily, go out into the hallway, and turn right. You will come to an intersection. Turn right again. That will get you to the stairs. Shoot anyone you see. Then you get the hell out. If you make it out of the building, Arthur won’t look for you right away, since I’ll be dead and he won’t need a donor immediately. Don’t use credit cards, don’t stay twice in the same—”</p> <p>“They will kill you!” No, that was not how this would go. The spring of tension inside her shivered, compressing.</p><p>“It was never about me surviving,” Lucas said. “I died when we opened the vault.”</p><p>“He’s right,” Henry said.</p><p>God, he pissed her off. “No.” She shook her head, trying to keep a lid on her anger. “We go to the stairs together and fight our way down. Together.”</p><p>Lucas grabbed her, jerking her close. “You will do as you’re told.”</p><p>“No,” she said into his snarl. “I won’t. We go together.”</p><p>The pressure inside her built.</p><p>“This isn’t a democracy!”</p> <p>“Lucas, I can’t carry Emily and shoot at the same time. I can barely hold this stupid gun with two hands. Do you think I’m Rambo? It’s suicide for me, Emily, and you.”</p><p>“She has a point,” Henry said.</p><p>“See? They will kill me and your grand sacrifice will be wasted. I don’t want you to die for nothing. I don’t want you to die at all.”</p><p>“Why the hell not?”</p><p>“Because I care if you live or die! My God, you are a moron! We fight our way to the stairs together. We have a better chance that way.”</p><p>He shook her. “I’m trying to save your daughter, you idiot! I’ve been doing this a long time and I am telling you, if we go out there, we’ll all die.”</p><p>“He also has a point,” Henry said.</p><p>Karina exhaled. Emily’s life was all that mattered. “Then drink my blood and get her out of here.”</p><p>“I would have to drain you dry. I’m barely conscious!”</p><p>“Do it.” Karina told him, furious. “You have the best chance of getting out of here with Emily alive. Drain me.”</p><p>“No!” he snarled.</p><p>“Do it, Lucas!”</p><p>“That’s nice,” Henry said. “But the Ordinators are coming.”</p><p>“Drain me or we go to the stairs,” Karina said.</p><p>“No, we’ll do this my way.”</p><p>“Your way, I die, you die, Emily dies!”</p><p>“There is no time,” Henry said calmly. “You missed your opportunity. We are all about to die. Don’t let them take you alive. You will regret it.”</p><p>The back wall of the conference room shuddered. Cracks crisscrossed the wood. It shattered and rained down in a waterfall of tiny splinters. People stood behind it, people with automatic weapons and dark helmets shielding their faces. In front of them a tall man with pale hair down to his waist slowly lowered his hand, smiling. She looked into his face and saw her own death there.</p><p>It hit her like a punch. Emily, she, Lucas, and Henry—the four of them really were about to die.</p><p>For nothing. They would die for nothing.</p><p>Lucas surged to his feet, trying to shield her.</p><p>No. No, this was not happening. She was tired and scared and pissed off and she was done with this shit.</p><p>Fuck them all.</p><p>The coiled spring inside her snapped free. Fiery power surged through her in a glorious cascade. It was time to set things right.</p><p>The smile slid off the blond Ordinator’s face. He opened his mouth.</p><p>The power surged from her, up and over her shoulders in twin streams.</p><p>She looked right into his eyes and said, “Die!”</p><p>His face turned green, as if dusted with emerald powder. He crumpled and fell to the floor. She stared at the men behind him and they collapsed like rag dolls.</p><p>Two others burst into her view from the left. She turned and looked at them and watched them die in midstep.</p><p>“Anybody else?” she called out. Her voice rang through the building. “Does anybody else want some? Because I’ve got plenty!”</p><p>Nobody answered. She marched out into the hallway, turned the corner, and saw a hallway full of people.</p><p>Die.</p><p>They collapsed as one.</p><p>They wanted to exterminate humanity. They had declared a war. Fine. If the Ordinators wanted a war, she would introduce them to one.</p><p>Karina turned. Lucas was staring at her, his mouth hanging open. Next to him Henry stood, blinking as if he hoped that one of the times when he reopened his eyes he would see something different.</p><p>Karina looked above them and saw her own reflection in the mirror wall. Twin streams of green lightning spread out from her shoulders in two radiant green wings. Like Arthur’s red ones.</p><p>“A Wither,” Henry said in a small voice, still blinking. “She’s a Wither.”</p><p>The memory of burning faces flashed before her and she brushed it aside. Fine. She was a Wither and nobody would ever push her around again.</p><p>Lucas closed his mouth. His gaze met hers and she saw pride and defiance in his eyes. “Do it quick,” he said.</p><p>He expected her to kill him.</p><p>After everything she’d said to him, he expected her to kill him.</p><p>Karina stepped to him. Her lightning wings burned around them. “Don’t worry,” she told him. “I’m the biggest and the strongest and I’ll protect you. We are walking out of here.”</p><p>Henry stopped blinking.</p><p>It took them forty-five minutes to get down the stairs. Karina inhaled the night air. It smelled of acrid smoke and rotting garbage, but she didn’t care.</p><p>Behind her the building rose like a grim tower. It now belonged to the dead. She had walked through every hallway and checked every room, while Henry and Lucas sat waiting and bleeding on the stairs. She had no idea how many people she killed, but it had to be dozens. She checked their faces to make sure they were dead. They all looked the same: features sunken in, emerald green tint painting their skin.</p><p>And now, finally, she was done.</p><p>Her lightning wings had vanished, her power exhausted. Reality returned slowly, in bits and pieces.</p><p>Next to her Lucas stirred. “If you want to disappear, now is the time. You killed them because they were caught unaware. The House of Daryon won’t be. I don’t know what your plan is but I know that once Arthur realizes what you are, he’ll do everything he can to keep you within the House. You are too powerful to cut loose. He’ll kill you if you refuse, and I don’t know if I can stop him.”</p><p>“He’s right,” Henry said. “It’s alarming how often I keep repeating that. Withers, Subspecies 21, have several types. You’re type 4. Arthur is type 7. He is more powerful and he has a lot more experience. At your best you can’t take him, and it will take you a long time to build your reserves back up to do anything on a massive scale again. Sometimes it takes years. Not to mention that we will have to fight you if you try to kill Arthur.”</p><p>Karina looked at Lucas. “If I leave, how will you feed?”</p><p>“Synthetics,” he said. “They take the edge off.”</p><p>His entire body was tense, like a string pulled too tight. He didn’t want her to go. “Why?” she asked.</p><p>“That’s what you want,” he said. “Freedom. One more day or maybe many. It’s yours. Take it.”</p><p>Henry cleared his throat. “The Ordinators . . .”</p><p>Lucas looked at him. Henry closed his mouth with a click.</p><p>Karina peered at Lucas’s face. “Didn’t you promise me you would find me if I escaped?”</p><p>“I did. I promise you it will take me a really long time to find you. Go now.”</p><p>She hesitated. Emily stirred in Lucas’s arms, waking up.</p><p>Lucas could find her—she saw the certainty of it in his eyes. If he could find her, the Ordinators could find her as well, and they would be much more motivated. And even if she did escape, she would always be living on the run, hiding from everyone and afraid of every shadow. She had no doubt that Emily was a donor. She had a responsibility to her child—she had to teach Emily how to protect herself or when they would be found, Emily would be caught unaware, just like she was.</p><p>Karina looked out into the city. That way lay freedom. Even twelve hours before, Karina Tucker would’ve taken it in a blink. But she was no longer that Karina Tucker. Nothing would ever be the same. There was a chasm between her old self and her new self, and it was filled with Ordinator bodies. Too much had happened. It changed her and there was no going back. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The woman who only days before had driven four children on a school trip was dead. She had been a nice girl, kind and a little naive, because she thought she knew what tragedy was. That woman had a small, secure, cozy life. Karina missed her and she took a moment to mourn her. It hurt to let go of that life. She shed it anyway, but not like a butterfly breaking free of the cocoon. More like a snake leaving its old skin. And this new Karina took risks. She was stronger, harder, and more powerful. There was a war going on and she would take part in it.</p><p>And even if she chickened out and tried to walk away, the memory of Lucas would keep her from going too far. She had more in common with a man who turned into a monster than she did with Jill and her endless worry over seat belts. She couldn’t leave him behind now, back in the place where everyone was scared of him, where Arthur used him with no regard for Lucas’s life, where his brother continuously bickered and fought with him. She had Emily. Lucas had no one and he wanted her so badly. And she wanted him. Right or wrong, she no longer cared. It was her decision and she made it.</p><p>“Decide,” Lucas told her. “We can’t stay out in the open.”</p> <p>Only one question remained. Karina took a deep breath and closed the distance between her and Lucas. She lifted her face and looked into his green eyes and kissed him.</p><p>For a moment he stood still and then he kissed her back, his mouth eager and hungry for her. When they broke apart, Henry was staring at them.</p><p>“I am confused,” Henry said.</p><p>“Well, I can’t let you go back on your own,” Karina said. “All beat up and sad. Arthur might kill you somehow, or Daniel will bring the house down, or Henry, you might poison everyone with your cooking.”</p><p>Emily opened her eyes. “Mommy!”</p> <p>“Hi, baby.”</p><p>“Where are we?”</p><p>“In Detroit. We had to make a stop here for a little while, but Lucas and Henry are taking us home with them now.”</p><p>There had to be words to describe the look on Lucas’s face, but she didn’t know them. He probably didn’t know them, either. He looked like he wasn’t sure if he were surprised, relieved, happy, or mad.</p><p>“I believe there is a fast-food place three blocks north,” Henry said. “We could go there, use their phone, and drink coffee while we wait to get picked up. I could use some coffee.”</p><p>“Can you make it?” Lucas asked.</p> <p>“If I faint, just leave me in the street.”</p><p>Lucas slid his shoulder under Henry’s arm.</p><p>“Thank you.”</p><p>They started down the street.</p><p>“You don’t own me anymore,” Karina said quietly.</p><p>“Fine,” Lucas said.</p><p>“And I will have my own room.”</p><p>“Fine.”</p> <p>“And if you need to feed, you will ask me. Nicely.”</p><p>He stopped and glared at her.</p><p>“Nicely,” she told him.</p><p>“Fine.”</p><p>“But all kidding aside, you will still cook, right?” Henry asked. “You said—”</p><p>“Yes, I will definitely cook.”</p><p>“Oh, good,” Henry said. “I was afraid you would quit and we would have to eat Lucas’s cooking.”</p><p>“My cooking is fine,” Lucas said.</p><p>Ahead, the familiar yellow-on-red sign rose on the corner.</p><p>“Are we going there, Mommy?” Emily pointed at the sign.</p><p>“Yes.”</p><p>“Do we have money to get ice cream?”</p><p>“I have twenty dollars,” Henry said. “It’s a little bloody, but they will take it.”</p><p>“They’ll take it,” Lucas said grimly.</p><p>Karina pictured Lucas, a little bloody and a little pissed off, breaking the McDonald’s counter in half. Hopefully it wouldn’t come to that.</p><p>“Don’t worry, baby. We’ll get you all the ice cream you want.” Karina glanced back at the husk of the skyscraper. For a second she thought she saw her own self waving good-bye. Her new self smiled back. People who knew the old Karina would judge her, if they knew, but that didn’t matter. She made her own choices now.</p><p>She put her hand on Lucas’s arm. He bent it at his elbow, letting her fingers rest on his muscled forearm, and they walked side by side into the night. </p> </body></html>"]