["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>\" You were created. Created to give your lives to the Genetics Council at any time deemed appropriate. You are animals. Nothing more. You have no sire. You have no bitch mother. You have only us. And we will decide if you are strong enough to live or die.\"</p><p>The dream was merciless, stark in the memory of who and what he was as he watched the scientist point out the procedure that had created him.</p><p>The genetic enhancement of an unknown sperm and ova. The fertilization, the development before it was ever placed within a human womb. And finally, the death of the vessels that had carried each Feline Breed babe to term.</p> <p>Nothing was hidden from the immature creatures. They sat on (he floor of their cells and watched the graphic video daily. They saw it nightly in their dreams.</p><p>\"You are not human. No matter your appearance. You are an animal. A creation. A tool. A tool for our use. Never imagine you will ever be anything different...\"</p><p>Tarek tossed within the nightmare, years of blood and death passing by him. The lashes of the whip biting into his back, his chest. Hours of torture because he had not killed savagely enough or because he had shown mercy. The pain of knowing that the dream of freedom might be no more than a fantasy, quickly lost to death.</p><p>He came awake in a rush, the blood pounding through his veins, sweat dampening his flesh as the horrors he had fought so long to distance himself from returned.</p><p>Breathing roughly, he rose from the bed, pulling on a pair of boxer briefs before leaving the bedroom.</p> <p>He inhaled deeply as he left the room, his brain</p><p>automatically processing the scents of the house, sifting through them, searching for anomalies. There were none. His territory was uncorrupted, as secure now as it had been when he settled into his bed.</p><p>He rubbed his hand over the ache in his chest, the almost ever-present remembrance of that last beating, and the whip running with a current of electricity that sent agony resonating through his body.</p><p>He was created, not born.</p><p>Those words echoed through his mind as he opened the back door and stepped onto the porch. Created to kill. Not human...</p><p>He stared into the bleak emptiness of the late-fall Arkansas night as he let the memories wash over him. Fighting them only made it worse, only made the nightmares worse.</p> <p>You will never know love. Animals do not love, so before you ever imagine this is a benefit due you, forget it!</p><p>The trainers had been quick to destroy any flicker of hope before it drew breath, took form, or hinted at an end to their tortured suffering. The psychological training had been brutal. You are nothing. You are a four-legged beast walking on two. Never forget that...</p><p>Your ability to speak does not mean you have permission to do so...</p><p>He stared into the star-studded night.</p><p>God does not exist for you. God creates His children. He does not adopt animals...</p><p>The final destruction. A silent snarl curved his lips as he glared into the brilliance of a sky he had never been meant to see.</p><p>\"Who does adopt us then?\" he snarled to the God he had been taught had no time for him or for his kind. \"Who does?\"</p><p>Chapter One</p> <p>Wasn't there some kind of law that said a man wasn't allowed to look that damned good? Especially the tight, hard bodies who persisted in mangling a perfectly good lawn at the wrong time of the year.</p><p>Lyra Mason was certain there had to be such a law.</p><p>Especially when said male, Tarek Jordan, committed the unpardonable sin of whacking down her prized Irish roses.</p><p>\"Are you crazy?\" She ran out the front door, yelling at the top of her lungs, waving him away from the beautiful hedge that was finally managing to achieve reasonable height.</p><p>That was, before he attacked it with the weed-eater he was wielding like a sword.</p><p>\"Stop it. Dammit. Those are my roses,\" she wailed as she sprinted across her front lawn, skidded around the front of her car, and nearly slipped and broke her neck on the strip of lush green grass in front of him.</p><p>At least he paused.</p><p>He lowered the weed-eater, tipped his dark glasses down that arrogant nose of his, and stared back at her as though she was the one committing some heinous act.</p><p>\"Turn it off,\" she screamed, making a slicing motion across her throat. \"Now. Turn it off.\"</p><p>Irritation and excitement simmered in her blood, heated her face, and left her trembling before him. He might be bigger than she was, but she had been maneuvering big, brawny men all her life. He would be child's play next to her brothers. Maybe. He cut the motor, lifted a brow, and flashed all that bare, glorious muscle across his chest and shoulders. As though that was going to save him. She didn't think so.</p><p>The man had lived next door to her for almost six months and never failed to totally infuriate her at least once a week. And she wasn't even going to admit exactly how much she enjoyed razzing his ass every chance she got.</p><p>\"Those are my roses!\" She felt like crying as she rushed to the broken, ravaged branches of the four-foot-high hedge. \"Do you have any idea how long it took me to get them to grow?</p><p>Have you lost your mind? Why are you attacking my roses?\" He lifted one hand from the steel shaft of the weed-eater and scratched his chin thoughtfully.</p><p>\"Roses, huh?\"</p><p>Oh God, his voice had that husky little edge. Dark. Deep. The kind of voice a woman longed to hear in the darkness of the night. The voice that tempted her in dreams so damned sexual she flushed just thinking about them.</p><p>Damn him.</p><p>He tilted his head to the side, staring at her roses for long moments behind the lenses of his dark glasses.</p><p>\"I can't believe you did this.\" She flicked him a disgusted glance as she hunched in front of the prize bush and began inspecting the damage. \"You've lived here six months, Tarek. Surely it occurred to you that if I wanted them cut down I would have done it myself.\"</p><p>Some men just needed a leash. This was obviously one of them. But he was fun—even if he was unaware of it. It just wouldn't do for him to know how often she went out of her way to come down on him.</p><p>\"Sorry, Lyra. I thought perhaps the job was too large for you. It looked like a mess to me.\"</p><p>She stared up at him in shocked surprise as he said the blasphemous words. Only a man would consider roses a mess. It was a damned good thing she liked that helpless male look he gave her each time he messed up.</p><p>She could only shake her head. How long did the man have to live beside her before he learned to leave her side of the yard alone? He needed a keeper. She considered volunteering for the job. \"You should have to have a license to use one of those. I bet you would have failed the test if you did.\"</p><p>A grin quirked his lips. She loved that little crooked grin, almost shy, with just a hint of wickedness. It made her wet. And she didn't like that, either.</p><p>Her eyes narrowed as she ignored the chill in the early winter air, her lips thinning in true irritation this time. He was obviously ignoring the chill. He didn't even have on a shirt. It was barely forty degrees, and he was using a weedeater like it was June and the weeds were striking a campaign to take over. That or he just didn't like her roses.</p><p>\"Look, just take your little power tool to the other side of your property. There are no neighbors there. No roses to mangle.\" She gave him a shooing motion with her hand. \"Go on. You're grounded from this side of the yard. I don't want you here.\"</p><p>A frown edged between his golden-brown brows as they lowered ominously and his eyelids narrowed. What made men think that look actually worked on her? She almost laughed at the thought.</p><p>Fine, he was dangerous. He was getting ticked. He was bigger and stronger than she was. Who gave a damn?</p><p>\"Don't you give me that look,\" she snorted in disgust. \"You should know by now it doesn't work on me. It will only piss me off worse. Now go away.\"</p><p>He glanced around, appearing to measure some invisible line between where he was to his own house several yards away.</p><p>\"I believe I'm on my own property,\" he informed her coolly.</p><p>\"Oh, are you?\" She stood carefully to her feet, staring over the edge of her pitifully cropped rose bush to where his feet were planted. Boy, he really should have known better than that. \"Go read your deed, Einstein. I read mine. My roses are planted exactly six feet from the property line. From oak to oak.\" She point out the oak tree at the front of the street, then the one at the edge of the forest beyond. \"Oak to oak. My brothers ran a line and marked it real carefully just for dumb little ol' me,\" she mocked him sweetly. \"That puts you on my property. Get back on your own side.\"</p><p>She would have chuckled if it weren't so important to maintain the appearance of ire. If she was going to survive living next to a walking, talking advertisement for sex, then some boundaries would have to be established.</p><p>He cocked his hip, crossing his arms over his chest as the heavy weed-eater dangled from the harness that crossed over his back.</p><p>He was wearing boots. Scarred, well-worn leather boots. She noticed that instantly, just as she noticed the long, powerful legs above them. And a bulge... Nope, not going there.</p><p>\"Your side of the property is as much a mess as your bush is,\" he grunted. \"When do you cut your grass?\"</p><p>\"When it's time,\" she snapped, pulling herself to her full height of five feet, three and three-quarters inches. \"And it's not time in the middle of winter when it's not even growing.\" Okay, so she barely topped his chest. So what?</p><p>\"I would get in the mood if I were you.\" He used that superior male tone that never failed to grate on her nerves. \"I have a nice ride-on lawnmower. I could cut it for you.\" Her eyes widened in horror. He was staring back at her now with a crooked grin, a hopeful look on his face. She sneaked a look around his shoulder, stared at his grass, then shuddered in dismay.</p><p>\"No.\" She shook her head fervently. This could be getting out of hand. \"No, thank you. You hacked at yours just fine. Leave mine alone.\"</p><p>\"I beg your pardon.\" He threw his shoulders back and drew up in offended male pride as he propped his hands on his hips. He did it so well, too. Every time he messed up something he pulled that arrogance crap on her. He should have known it wasn't going to work.</p><p>\"And so you should,\" she retorted, propping her hands on her hips as she glared back at him. \"You hacked your grass. Worse, you hacked it in the winter. There's no symmetry in the cut, and you set your blade too low. You'll be lucky to have grass come summer. You just killed it all.\"</p><p>He turned and stared back at his lawn. When he turned back to her, cool arrogance marked his features.</p><p>\"The lawn is perfect.\"</p><p>He had to be kidding.</p><p>\"Look,\" she breathed out roughly. \"Just stick to mangling your own property, okay? Leave mine alone. Remember the line—oak to oak—and stay on your side of it.\"</p><p>He propped his hands on his hips again. The move drew her eyes back to the sweat-dampened perfection of that golden male chest.</p><p>It should be illegal.</p><p>\"You are not being neighborly,\" he announced coolly, almost ruining her self-control and bringing a smile of pure fun to her lips. \"I was told when I bought the house that everyone on this block was friendly, but you have been consistently rude. I believe I was lied to.\"</p><p>He sounded shocked. Actually, he was mocking her, and she really didn't like it. Well, maybe she did a little bit, but she wasn't going to let him know it.</p><p>She refused to allow her lips to twitch at the sight of the laughter in his gaze. He very rarely smiled, but sometimes, every now and then, she could make his eyes smile.</p><p>\"That realtor would have told you the sun rose in the west and the moon was made of cheese if it would assure him a sale.\" She smiled mockingly. \"He sold to me first, so he knew I wasn't nice. I guess he neglected to inform you of that fact.\" Actually, she had gotten along quite well with the real estate agent. He was a very nice gentleman who had assured her that the homes on this block would only be sold to a specific type of person. So, evidently, he had lied to her, too, because the man standing across from her was not respectable, nor was he family-oriented. He was a sex god, and she was within a second of worshipping at his strong, male feet. She was so weak. He was a rose assassin, she reminded herself firmly, and she was going to kick his ass if he attacked any more of her precious plants. Better yet, she would call her brothers and cry. Then they would kick his ass. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>No, that wouldn't do, she hastily amended. They would run him off. That wasn't what she wanted at all.</p><p>\"Perhaps I should discuss this with him.\" He tipped his glasses down his nose once again, staring at her over the rim.</p><p>\"At least he was right about the view.\"</p> <p>His gaze roved over her from her heels to the tip of her head as his golden-brown eyes twinkled with laughter—at her expense, of course. As though she didn't know she was too homey. A little too normal-looking. She wasn't the sexy, siren type, and she had no desire to be. That didn't mean he had to make fun of her.</p><p>It was perfectly acceptable for her to toy with him. Having him turn the tables did not amuse her in the least.</p><p>\"Thar was not amusing,\" she informed him coldly, wishing she could hide behind something now.</p><p>The ratty jeans she wore hung low on her hips, not because of fashion, but more because they were a bit too loose. The Tshirt she wore fit a bit better, but it was almost too snug. But she was cleaning house, not auditioning for Fashions R Us.</p><p>\"I wasn't trying to be amusing.\" His grin was wicked, sensual. \"I was being honest.\"</p> <p>He was trying to get out of trouble. She knew that look for what it was. It wasn't the first time he had pulled it on her.</p><p>\"I have three older brothers,\" she informed him coolly. \"I know all the tricks, mister...\"</p><p>\"Jordan. Tarek Jordan,\" he reminded smoothly. As though she didn't already know his name. She had known his name from the first day he had moved in to his house with the honkin' Harley he had ridden across her front lawn. Damn, that Harley had really looked good, but he had looked even better sitting on it.</p><p>\"Mister,\" she repeated, \"you are not putting anything over on me, so don't think you are. Now keep your damned machines away from my property and away from me, or I might have to show you how they are used and hurt all that male pride you seem to have so much of.\" She shooed him again. \"Go on. On your own property now. And leave my roses alone.\" His eyes narrowed on her again. This time, his expression changed as well. It became... predatory. Not dangerous. Not threatening. But it wasn't a comfortable expression, either. It was an expression that assured her that an abundance of male testosterone was getting ready to kick in. And he did male testosterone really well. He got all snarky and snarly and downright ill-tempered as he glared at her, his voice edging into dangerously rough as he growled at her and attempted to berate her.</p><p>She refused to back down.</p><p>\"Don't look at me like that, either. I told you. I have three brothers. You do not intimidate me.\"</p> <p>His brow arched. Slowly.</p><p>\"It was very nice to see you today, Lyra.\" He finally nodded cordially. \"Perhaps next time, you won't be in such a bad mood.\"</p><p>\"Yeah. Sometime when you're not mangling the looks of the block would be nice,\" she snorted as she turned away from him.</p><p>\"Geez, only I could get stuck with a neighbor with absolutely no landscaping grace. How the hell do I manage it?\" She stomped away, certain now that she should never have let her father talk her into this particular house.</p><p>\"It's close to the family,\" she mocked, rolling her eyes. \"The price is perfect,\" she mocked her eldest brother. \"Yeah. Right. And the neighbors suck...\"</p><p>Tarek watched her go, hearing her mocking little voice all the way to the porch as she stomped up the sidewalk. Finally, the front door slammed with an edge of violence that would have caused any other man to flinch. Breeds didn't flinch. He glanced down at the weed-eater hanging from his</p><p>shoulders and breathed in deeply before turning to glance back at the lawn.</p><p>The cut of the grass was fine, he assured himself, barely managing not to wince. Fine, it might not look so great, but he had fun cutting it. Hell, he even had fun using the weed-eater. At least, until Ms. Don't-Attack-My-Roses came storming out from her house.</p> <p>As though he wasn't well aware that all the female fury was more feigned than true anger. He could smell her heat, her arousal, and her excitement. She wasn't hiding nearly as much as she thought she was.</p><p>He chuckled and glanced back at the two-story brick-andglass home. It suited her. Nice and regal on the outside, but with depth. Lots and lots of depth. He could see it in her wide blue eyes, in the pouty softness of her lips.</p><p>She was a wildcat, though. Well, she was as fiery as a wildcat anyway. He cleared his throat, scratched at his chest thoughtfully, then hefted the weed-eater off his shoulders and headed back to the little metal shed behind his own house. He liked his house better, he told himself. The rough wood two-story with the wraparound porch was... comfortable. It was roomy and natural, with open rooms and a sense of freedom. There was something about the house that soothed him, that eased the nightmares that often haunted him.</p><p>He hadn't been looking for a home when he gave in to the realtor's suggestion to check out the house. He had been looking for a rental, nothing more. But as they pulled into the driveway, the fresh scent of a summer rainfall still lingering in the air, blending with the smell of fresh-baked bread wafting from the neighboring house, he had known, in that moment, this was his. This house, too large for him alone, the yard begging for sheltering trees and bushes and the laughter of children echoing with it, called to him. Six months later, this home he hadn't known he wanted still soothed the rough edges of his soul. He pulled open the door to the shed, pausing before stepping into the close confines of the little building to store the weed-eater. He was going to have to replace the shed with a larger one. Each time he stepped into the darkness, he felt as though it was closing in on him, trapping him. Caging him in. There was something different, though. He paused as he stepped from it, staring back into the interior as he considered it thoughtfully.</p><p>He hadn't smelled the usual mustiness of the building. For once, the smell of damp earth hadn't sent his stomach roiling with memories. It was because his senses were still filled with the soft scent of coffee, fresh-baked bread, and a warm, sweet female.</p><p>Lyra Mason.</p><p>He turned and stared back at her house, rubbing at his chest, barely feeling the almost imperceptible scars that crisscrossed his flesh there. Coffee and fresh-baked bread.</p><p>He had never eaten fresh-baked bread. He had only smelled it drifting from her house in the past months. It had taken him forever to figure out what that smell was. And coffee was, unfortunately, a weakness of his. And she had both. He wondered if she could make better coffee than he did. Hell, of course she could, he grunted as he turned away and stalked to his back door. Jerking it open, he stepped into the house, stopping to pull off his boots before padding across the smooth, cream-colored tiles.</p><p>The kitchen was made for someone other than him.</p><p>He still hadn't managed to figure out the stove. Thankfully, there was a microwave or he would have starved to death. He moved to the coffeepot with every intention of fixing some before he paused and grimaced. He could still smell the scent of Lyra's coffee.</p><p>His lip lifted in a snarl as a growl rumbled from his throat. He wanted some of her coffee. It smelled much better than his. And he wanted some of that fresh-baked bread.</p><p>Not that she was likely to give him any. He had cut her precious bush, so she would, of course, have to punish him. This was the way the world worked. He had learned that at the labs from an early age.</p><p>Well, he had known it. The scars that marred his chest and back were proof that it was a lesson he had never really fully learned.</p><p>He propped his hands on his hips and glared at Lyra's house. He was a Lion Breed. A fully grown male trained to kill in a hundred different ways. His specialty was with the rifle. He could pick off a man a half-mile away with some of the weapons he had hidden in his bedroom.</p><p>He had excelled in his training, learned all the labs had to teach him, then fought daily to escape. His chance had finally come with the attacks mounted on the Breed labs seven years before.</p><p>Since then, he had been attempting to learn how to live in a world that still didn't fully trust the animal DNA that was a part of him.</p><p>Not that anyone in the little city of Fayetteville, Arkansas, knew who or what he was. Only those at Sanctuary, the main Breed compound, knew the truth about him. They were his family and his employers.</p><p>He dropped his arms from his chest and propped his hands on his hips.</p><p>He couldn't get the smell of that coffee or that bread out of his mind. That woman would drive him crazy—she was too sensual, too completely earthy. But the smell of that coffee... He sighed at the thought.</p><p>He shook his head, ignoring the feel of his overly long hair against his shoulders. It was time to cut it, but damned if he could find the time. The job he had been sent here to do was taking almost every waking moment. Except for the time he had taken to cut the grass.</p><p>And the time he was going to take now to see if he could repair the crime of cutting that dumb bush and getting a cup of Lyra's coffee.</p><p>A taste of the woman would come soon enough.</p><p>Chapter Two</p><p>Bread lined the counter of Lyra's perfect, beautiful kitchen. Fresh white bread, banana nut bread, and her father's favorite cinnamon rolls. A fresh cup of coffee sat at her elbow, and a recipe book spread out on the table in front of her as she attempted to find the directions for the etouffee she wanted to try.</p><p>The cookbook was no more than several hundred pages, some handwritten, some typewritten, and others printed from the computer and bound haphazardly over the years. Her mother had started it, and now Lyra added her own recipes to it as well as using those already present.</p><p>The soft tunes of a new country band were playing on the stereo in the living room, and her foot was swaying in a cheerful rhythm along with the music.</p><p>\"Do you actually like that music?\"</p><p>A shocked squeak of fear erupted from her throat as she jumped from her chair, sending it flying against the wall as she nearly threw the coffee cup across the room.</p><p>And there he stood.</p><p>Her nemesis.</p><p>The man had to have been placed here just to torment and torture her. There was no other answer for it.</p><p>\"What did you do?\" She turned and jerked the chair from where it had fallen against the wall, snapping it back in place before turning and propping her hands on her hips.</p><p>He was here. And acting just a little bit too awkward to suit her. He had to have messed up something again.</p><p>He stood just inside the doorway, freshly showered and looking too damned roughly male for any woman's peace of mind. If he were conventionally good-looking, she could have ignored him. But he wasn't. His face was roughly hewn, with sharp angles, high cheekbones, and sensual, eatable lips. A man shouldn't have eatable lips. It was too distracting to those women who didn't have a hope in hell of getting a taste.</p><p>\"I didn't do anything.\" He ran his hand along the back of his neck, turning to look outside the door as though in confusion before returning his gaze to her. \"I came to apologize.\" He didn't look apologetic.</p><p>He looked like he wanted something.</p><p>He rubbed at his neck again, his hand moving beneath the fall of overly long, light-brown hair, the cut defining and emphasizing the harsh planes and angles of his face. Of course he wanted something. All men did. And she doubted very seriously it had anything to do with her body. Which was really just too bad. She could think of a lot of things that tough male body of his would be good for.</p><p>Unfortunately, men like him—tough, buff, and bad—</p><p>generally never looked her way.</p><p>\"To apologize?\" She caught the half-hidden, longing look he cast to the counter and the cooling bread there.</p><p>\"Yes. To apologize.\" He nodded ever so slightly, his expression just a shade more calculating than she would have liked.</p><p>She firmed her lips, very damned well aware that he was not there to apologize. He was wasting her time, as well as his, by lying to her.</p><p>He wanted her bread. She could see it in his eyes.</p><p>\"Fine.\" She shrugged dismissively. What else could she do. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Stay the hell away from my plants, and I'll forgive you. You can go now.\"</p><p>He shifted, drawing attention to his wide chest and the crisp white shirt he wore. He had changed clothes as well as showering. He wore form-hugging jeans with the white shirt tucked in neatly. A leather belt circled his lean hips, and the ever-present boots were on his feet, though these looked a little better than the previous pair.</p><p>His gaze drifted to the bread once again.</p> <p>It figured. And the hungry, desperate gleam in his eyes was just about her undoing. Just about. She was not going to let him sweet-talk her out of it, she assured herself.</p><p>She stared back at him coolly as her hand clenched on the back of the chair. He was not going to eat her bread. That bread was gold where her father and brothers were concerned, and she desperately needed the points it would earn her. It was the only way she was going to get her pretty wooden shed built, and she knew it.</p><p>He glanced back at her, this time not even bothering to hide the cool calculation in his gaze.</p><p>\"We could make a deal, you and I,\" he finally suggested, his voice firm, almost bargaining.</p><p>Uh-huh. She just bet they could.</p> <p>\"Really?\" She let go of the chair and leaned against the counter as she watched him with a skeptical look. \"How so?\" Oh boy, she just couldn't wait to hear this one. It was going to have to be good. She knew men, and she knew he had obviously been preparing the coming speech carefully. But she was intrigued. Few men bothered to be</p><p>straightforward or even partially honest when they wanted something. At least he wasn't pulling out the charm and pretending to be overcome with attraction for her to get what he wanted.</p><p>\"However you wish,\" he finally stated firmly. \"Tell me what I would have to do to get a loaf of that bread and a cup of coffee.\" She stared back at him in shock.</p><p>She wasn't used to such straightforward, fully mercenary tactics from anyone. Let alone a man.</p><p>She watched him thoughtfully.</p><p>He wanted the bread; she wanted a shed. Okay, maybe they could trade. Not what she had expected, but she was willing to roll with the opportunity being presented.</p> <p>\"Can you use a hammer any better than you can a weedeater?\" She needed that shed.</p><p>His lips thinned. He glanced at the bread again with a faint expression of regret.</p><p>\"I could lie to you and say yes.\" He tilted his head and offered her a tentative smile. \"I'm very tempted to do so.\" Great. He couldn't use a hammer, either.</p><p>She stared back at the muscular condition of his finely honed body. A man didn't look like that as a result of the gym. It was natural muscle and grace, not the heavy, packed-on appearance guys got from the gym. But if he couldn't cut his own lawn or swing a hammer, how the hell did he manage it?</p><p>She shook her head. Obviously nature really, really liked him, because Tarek Jordan was so not an outdoor sort of person.</p><p>\"Let me guess. You're really good on the computer?\" She sighed at the thought. Why did she attract the techies instead of the real men?</p><p>\"Well, I am actually.\" He offered her a hopeful smile. \"Does yours need work?\"</p><p>At least he was honest—in some things. She guessed that deserved some compensation, though she fully admitted she was just too nice sometimes.</p> <p>\"Look, promise to keep your machines away from my property line, and I'll give you some coffee and a slice of bread,\" she offered.</p><p>\"Just a slice?\" His expression fell, rather like a child whose favorite treat had been jerked from his hands.</p><p>Men.</p><p>She looked over at the counter. Hell, she had baked too much anyway.</p><p>\"Fine. A loaf.\"</p><p>\"Of each kind?\" Hope sprang in those golden eyes, and for a moment it made her wonder... No, of course he had eaten freshbaked bread. Hadn't everyone? But there was a curious glimmer of vulnerability there. One she hadn't expected.</p><p>She glanced at the counter again. She had four loaves of each kind and plenty of the cinnamon rolls. It wasn't like she didn't have enough.</p><p>\"Come on in.\" She turned to get an extra coffee cup when she stopped and stared at him in surprise.</p><p>He was taking his boots off? He did it naturally, toeing at the heels until the leather slid from his feet, and then pulling them off to sit them neatly at the door.</p><p>His socks were white. A pure, pretty white against the dark maroon of her ceramic tiles as he walked to the table. He waited expectantly.</p><p>What the hell was he? An alien? No man she knew had white socks. And they sure as hell didn't care if they took their shoes off at the door, no matter how grimy or muddy they often were. Her brothers were the worst.</p><p>She poured the coffee and set it in front of him before turning to get the sugar and creamer from the counter. As she turned back, she frowned as she watched him take a long sip of the dark liquid.</p><p>Ecstasy transformed his face.</p><p>The expression on his face made her thighs clench as her sex spasmed in interest. Which only pissed her off. She was not going to get any more turned on by this man than she already was. She was doing perfectly fine without a man in her life right now. She did not, repeat, did not need the complication. But if that was how the man looked when he had sex, then her virginity could be in serious danger. Strangely predatory, savage, filled with pleasure, his face carried a primal, intense look of satisfaction and growing hunger.</p><p>For a moment, her chest tightened in surprising</p><p>disappointment. She wanted him to look at her like that, not at her bread.</p><p>Just her luck. Someone else to harass her for her bread instead of for her body. Not that she wanted him to harass her for her body, but it would be nice if someone would. Taking out a bread knife, she sliced into a loaf of the banana nut bread and then into the white bread. The white bread was still warm enough to melt the fresh, creamy butter she spread atop it.</p><p>Fine. Maybe she could bribe him into hiring someone to cut and trim his lawn so he would leave hers alone. Stranger things had happened.</p><p>The coffee was rich, dark, and exquisite. The bread fairly melted in his mouth. But that wasn't what was keeping his dick painfully engorged as he savored the treats. It was the smell of this woman, hot and sweet and aroused.</p><p>That arousal was killing him. It wasn't intense and overwhelming, but curious and warm. Almost tentative. He savored the smell of it more than he savored the bread and coffee he was trying to stay focused on.</p><p>\"So what do you do on the computer?\" She was cleaning the loaf pans she had used to bake the bread, carefully washing and drying them at the sink.</p><p>He glanced at the slender line of her back, the taut curves of her rear, and shifted restlessly in his chair. His hard-on was killing him.</p><p>He hadn't meant to give her the impression he worked mainly on the computer, but he guessed it was better than telling the truth.</p><p>\"Mostly investigations and research.\" He shrugged, telling as much of the truth as possible. He hated the thought of lying to her. Which was strange. He was living a lie, and he knew it. He had been since his creation. So why should it bother him now?</p><p>\"Criminal or financial?\" She picked up the coffeepot and walked to the table, filling his cup with the last of the heated liquid.</p><p>He frowned at the question as he watched the way the soft, midnight silk of her hair fell forward, tempting his fingers. It looked soft, warm. Like everything he had believed a woman should be.</p><p>She wasn't hard, trained to kill, or living her own nightmares, as many of the Feline Breed women were. She was feisty and independent but also soft, exquisite.</p><p>\"More along the lines of missing persons,\" he finally answered. \"A little bit of everything, though.\" He nearly choked on that one. He was, quite simply, a bounty hunter and an assassin. His present assignment was the search for one of the escaped Trainers who had murdered countless Feline Breeds while they were held in captivity. The assignment was starting to take second place to the woman in front of him, though.</p><p>Damn that coffee was good, but if she didn't get the scent of that soft, heated warmth simmering in her pussy across the room and away from him, then they were going to have problems.</p><p>He could feel the growing sexual need tightening his abdomen and pounding in his brain. He wanted to shake his head, push the scent away from him in an attempt to make sense of it. He had never known a reaction so intense, so immediate to any woman.</p><p>From his first glimpse of her outraged expression when he committed the supreme sin of riding his Harley over her lawn, she had captivated him.</p><p>She wasn't frightened of him or intimidated by him. She didn't watch him like a piece of meat or an animal that could attack at any moment. She watched him with equal parts frustration, innocence, and hunger.</p><p>And if he didn't get the hell away from her, he was going to commit another sin. He was going to show her just how damned bad he did want that curvy little body of hers.</p><p>\"I guess I should be going.\" He rose to his feet quickly, finishing off his coffee before taking the cup and his empty saucer to the sink where she was working.</p><p>She stared up at him in astonishment as he rinsed them quickly before sitting them in the warm, sudsy water in front of her.</p><p>He stared down at her, caught for a moment in the depths of her incredible sapphire eyes. They gleamed. Little pinpoints of brilliant light seemed to fill the dark color, like stars on a blue velvet background. Incredible.</p><p>\"Thank you.\" He finally forced the words past his lips. \"For the coffee and the bread.\"</p><p>She swallowed tightly. The scent of her wrapped around him—a nervous, uncertain smell of arousal that had his chest filling with a sudden, animalistic growl.</p><p>He throttled the sound firmly, clenching his teeth as he backed away from her.</p><p>\"You're welcome.\" She cleared her throat after the words came out with a husky, sexy tone of nervousness.</p><p>Dammit, he didn't have time for such complications. He had a job to do. One that didn't include a woman he knew would run screaming from him if she had any idea of who and what he was.</p><p>She had wrapped the loaves and set them out on the counter by the door for him. He jerked his boots on quickly and picked up the bread, opening the door before turning back to her.</p><p>\"If you need any help.\" He shrugged fatalistically. \"If there's anything I can do for you...\" He let the words trail off. What could he do for her besides complicate her life and make her regret ever meeting him? There was little.</p><p>\"Just stay away from my yard with your gadgets.\" Her eyes flowed with humor. \"At least until you learn how to use them.\" The woman evidently had no respect for a man's pride. A grin lilted his lips.</p><p>\"I promise.\"</p><p>He turned and left the house, regretfully, hating it. There was a warmth within the walls of her home that didn't exist within his own, and it left him feeling unaccountably saddened to leave. What was it about her, about her house, that his suddenly seemed so lacking?</p><p>He shook his head, pushed his free hand into his jeans pocket, and made his way across her neatly trimmed backyard to his own less-than-pristine lawn. And his less-than-content life.</p><p>Chapter Three</p><p>A cold winter rain fell, not quite ice, but close enough to chill Tarek's flesh as he stood in the shadows of his porch late that night.</p><p>He wasn't certain what had awakened him. But something had. He had come instantly alert, his senses rioting, the tiny, almost imperceptible hairs raising along his body as he slid from the bed and dressed quietly.</p><p>Now he stood within the concealing darkness, staring around the backyard, his eyes probing the night as his unique vision aided him in seeing through the moonless night. In his hand he carried a powerful ultralight submachine pistol. It rested at the side of his leg as his opposite thigh held the weight of the lethal knife tucked securely in the scabbard he had strapped there.</p><p>The hairs along the back of his neck prickled, warning him that he wasn't alone in the darkness. His eyes scanned his yard and then turned to Lyra's.</p><p>Her upstairs lights were on; every few minutes he could see her pace past her bedroom window. She needed heavier curtains. Something hardened in his chest, became heavy at the thought that whatever stalked the darkness could be a threat to her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His jaw tightened as he lifted his head, drawing in the scents surrounding him, and quickly, automatically separating them. Something was out there; he knew it, and he should be able to smell it. It made no sense that the answers he sought weren't on the air around him.</p><p>He could smell the scent of Lyra's brothers. They had shown up that evening, carrying bread when they left. Damn their hides. He had considered mugging them for one insane minute. He could smell the lumber they brought, sitting in her backyard, and the smell of charcoal on the air from the steaks they had grilled for dinner. But there was no scent of an intruder.</p><p>He flexed his shoulders, knowing the rain could be distilling the smell, knowing he was going to have to venture into it and hating the thought.</p> <p>He moved silently from the porch, careful to stay in the shadow of the small trees he had taken the time to have planted before he moved in. Most were firs of some type, evergreens that never lost their concealing foliage. They were spaced at just the right distance to provide the concealment he needed as he made his way along the perimeters of his property.</p><p>There.</p><p>He stopped at the far corner, lifting his head to breathe in roughly, feeling the rain against his face, the ice forming in the sodden length of his hair. But there was the scent he was searching for, and it was on Lyra's property.</p><p>He turned his head, and his eyes narrowed, searching for movement that wasn't there, yet the scent of it was nearly overpowering.</p><p>Where are you, bastard? he growled silently as he made his way to the stack of lumber, using it to conceal himself from the back of the house, allowing him a clear view of her back porch as he thumbed the safety off on the powerful weapon he carried. Icy rain ran in rivulets down his hair, his arms, soaking the flannel shirt and jeans he wore. He pushed the chill and the feel of wet fabric out of his mind. He had trained in worse conditions than this for years.</p> <p>He breathed in again, sifting through the scents until he could determine where this one was coming from. The wind was blowing in from the west, moving across the house and through the small valley the housing development was situated in. The scent was definitely at the back of the house. It was too clear, too thick with menace to have been diluted by the shrubbery in the front yard.</p><p>The moonless night left the yard nearly pitch-black, but the DNA that made him an abomination also made him capable of seeing much more clearly than the enemy stalking the night with him.</p><p>It wasn't a Breed. He could smell a Breed a mile away. But neither was it a harmless threat. He could feel the menace in the air, growing thicker by the moment.</p><p>Moving from the concealment of the stack of lumber, he edged his way closer to the house. Even more important than locating the threat was keeping Lyra in the house and safe. She was so damned feisty, if she even thought anyone was in her backyard she would be out there demanding answers and ignoring the danger.</p><p>He moved around the little wooden arch that held the bench swing, carefully sidestepped the beginnings of a flowerbed he had seen her working in days before, and slid along the fence that separated her property from her neighbor on the other side.</p><p>He could feel the intruder. The itch along the back of his neck was growing more insistent by the moment. He paused, bending low beside an evergreen bush as he scanned the area again.</p> <p>And there he was. Crouched at the side of the house and working his way to the porch. Dressed entirely in black, the bastard might have escaped notice if Tarek hadn't caught the movement of the whites of his eyes.</p><p>He was good.</p><p>Tarek watched as he made his way to the electrical box at the side of the house. Too damned good. Tarek watched as a penlight focused a minute sliver of light as the intruder worked. When he was finished, Tarek bet his incisors the security system had somehow been canceled. The lights were still on, and not even a flicker of power had been interrupted. But there was an edge of satisfaction in the way the black-clad figure now made his way to the back door.</p><p>It wasn't happening.</p><p>Tarek moved quickly, raising his gun, aiming, only to curse virulently as the figure turned, jerked, and raised his own weapon.</p><p>Tarek rolled as he heard the whistle of the silenced weapon. Expecting, foolishly perhaps, for the assailant to turn and run, he came to his knees, aiming again, only to be slammed back to the wet grass as the gun was kicked from his hand.</p><p>He rolled to the side and jumped to his feet. His leg flew out to connect with a jaw, and he heard the grunt of pain as the other man went backward, flailing for balance.</p><p>Tarek whipped his knife from its sheath, prepared now as the other man came at him. He kicked the gun from his hand, turned, and delivered a power kick to his solar plexus, snarling as he flipped around to see the bastard coming for him again, armed with a knife as well.</p> <p>At the same time, the back porch light flared, blinding him for one precious second as the assailant made his move. Pain seared his shoulder as the knife found its mark before he could jump back.</p><p>A gunshot blasted through the night. The sound of the powerful shotgun made both men pause, breathing roughly before the assailant turned and ran.</p><p>\"Like hell,\" Tarek snarled as he rushed after him, his feet sliding in the muck beneath his feet before he found traction and sprinted behind him.</p><p>He almost had him, dammit. He was within inches of</p><p>throwing himself against the other man and bringing him down when another silent shot whistled past his head, causing him to duck and throw himself to the side instead.</p><p>The sound of a vehicle roaring down the street shattered the night. Tires screamed as the car slammed to a stop, voices raised demandingly, then it peeled from the front of the house as Tarek raced to get a glimpse of it.</p><p>\"Fuck! Fuck!\" His curse filled the night as the black sedan, no plates of course, roared away.</p><p>The assailant was well trained and obviously came with backup. The suspicion that it was the Trainer he was searching for filled his mind. But why go after Lyra? The man was smart enough, well trained enough that he could never have mistaken which house to attack.</p><p>On the heels of that suspicion came the knowledge that he, the hunter, could very well become the hunted. And it looked as though Lyra had been drawn into the middle of the war playing out between the Council and their now-free creations.</p><p>\"The police are on their way,\" Lyra screamed from the back door. \"Tarek, are you okay?\"</p><p>At least she was still in the house.</p><p>A growl vibrated through his chest as he turned and ran back to the yard, locating the knife and illegal machine gun from the now-muddy yard.</p><p>The back door was open, and there she stood, dressed in a long gown and matching robe, holding that fucking shotgun like it could protect her.</p><p>He snapped his teeth together as he heard the sirens roaring in the distance and stomped to the house.</p><p>\"Do not mention me, do you understand?\" he ordered as he stopped in front of her, staring into her wide, shocked eyes as she blinked up at him.</p><p>\"Do you understand me, Lyra?\" he hissed impatiently. \"Do not mention me. After they leave, I'll come back. Do you understand?\"</p><p>He reached out to grip her arm, pulling back at the sight of the blood trickling to his hand. Fuck, his shoulder burned.</p><p>\"You're hurt.\" She swallowed tightly.</p><p>The sirens were getting closer.</p><p>\"Lyra.\" He bent close, breathing in her scent, her fear. \"Did you hear me?\"</p><p>\"Yes. Why?\" Her breasts were rising and falling roughly, her pale features emphasizing her large, dark eyes.</p><p>\"I'll explain later. I promise.\" He grimaced painfully. \"As soon is they leave, I'll be back. I swear, Lyra. But don't tell them what happened.\"</p><p>His cover was shot to hell if she even hinted at him. The police would converge on his house, and he would be forced to tell them exactly who he was. Good-bye assignment, good-bye Trainer.</p><p>She nodded slowly, glancing back into the house as the sound of '.he sirens echoed around them.</p><p>He nodded fiercely before turning and disappearing into the night. The cut to his shoulder wasn't life-threatening, but it was Jeep. He was going to have to take care of that first. He disappeared into his house as the police units whipped onto the street and skidded to a stop outside Lyra's house. He locked the door quickly, taking precious seconds to pull off his boots before moving through the dark house.</p><p>What the hell was going on?</p><p>He stripped off his clothes in the laundry room, dropping the cold, soggy clothing into the washer before taking a clean towel from the cabinet and wrapping it around his arm. Damned blood was going to stain everything.</p><p>He strode quickly upstairs, moving through his bedroom to the bathroom where he could take care of the wound to his shoulder.</p><p>As he cleaned and carefully stitched the wound, he sifted through the earlier events, trying to make sense of them. Why had someone attempted to break in to Lyra's house when it was clear she was home? Burglars waited until their victims were in bed, most likely asleep, or gone. They didn't break in while lights blazed through the house, and they sure as hell didn't hang around after they were clearly caught. And they weren't as well trained as Lyra's burglar had obviously been. That wasn't an attempted robbery. It was a hit. Why would anyone want to kill Lyra, unless it was to get to him? A warning? And if it was that damned Trainer, how the hell had he learned Tarek was tracking him?</p><p>He smeared gauze with a powerful antiseptic before laying it over the stitched wound and taping it securely in place. Then he dressed and waited. He stood at his bedroom window, watching, waiting, as the police talked to Lyra, wondering how well she would heed his earlier warning. Praying she would. Knowing it might be better for both of them if she didn't.</p><p>Chapter Four</p><p>He was a Breed.</p><p>Lyra answered the questions the police asked, filled out and signed a report, and waited impatiently for them to leave. Thank God she hadn't called her brothers before jerking that shotgun up and racing to the back door. She hadn't even thought of it. She had watched through her bedroom window as the moon broke past a cloud, shining clearly on the figures struggling in her backyard. She had recognized Tarek immediately.</p><p>Tarek Jordan was a Breed.</p><p>She had seen it in the fierce glow of his amber eyes as the light had shined into them, in the overly long incisors when he had snarled his furious orders on the back porch.</p><p>It made sense.</p><p>She should have suspected it from the beginning.</p><p>He had lived in the house beside her for months. His obvious discomfort in doing things most people did every day of their lives should have clued her in. The haunted shadows in his eyes.</p><p>His inability to cut grass should have told her something immediately. All men knew at least the rudiments of cutting grass.</p><p>The joy he found in a freshly made cup of coffee and homemade bread. As though he had never known it.</p><p>She had thought him a computer geek. That wasn't a</p><p>computer geek fighting in her backyard. That had reminded her of her brothers, practicing the tae kwon do they had learned in the military. He had reminded her of an animal, snarling, his growl echoing through the yard as he fought with the attempted burglar.</p><p>She should have known.</p><p>She had followed every news story, every report of the Breeds, just as her brothers had joined in several of the missions years before to rescue them. They had told her the tales of the ragged, savage men and women they had</p><p>transferred from the labs to the Feline Breed home base, Sanctuary.</p><p>Men near death, tortured, scarred, but with the eyes of killers. Men who were slowly being fashioned into animals—</p><p>killing machines and nothing more.</p><p>\"There's nothing else we can do, Ms. Mason,\" the officer taking her statement announced as she signed the appropriate line. \"We've called your security company, and they'll be out here tomorrow to repair the system.\"</p><p>\"Thank you, Officer Roberts.\" She smiled politely as she handed the papers back to him, wishing they would just leave.</p><p>\"We'll be going now.\" He nodded respectfully. It was about time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She escorted them to the door, closing and locking it before pushing her feet into a pair of sneakers and waiting impatiently for them to pull from the drive.</p><p>The minute their taillights headed down the street, she grabbed her keys, threw open the door, and slipped onto the porch. Closing it quickly, she sprinted through the rain toward Tarek's.</p><p>She wanted answers now. Not whenever he decided to show. A frightened scream tore from her lips as she passed one of the thick evergreen trees in his yard and was caught from behind as another hand clamped over her mouth.</p> <p>A hard arm wrapped around her waist, heated, muscular, nearly picking her from her feet as he began to move quickly to the house.</p><p>\"How did I know you would do something so stupid?\" His voice was a hard, dangerous growl in her ear as he pushed her through the living room door and slammed it shut. \"I told you to stay put, Lyra.\"</p><p>He released her quickly, throwing the bolts closed on the door before punching in the code to the security pad beside it.</p><p>\"You were too slow,\" she snapped. \"What the hell was going on tonight?\"</p><p>She turned on him fiercely, with every intention of blasting him over the previous hours' events. Her eyes widened, though, as she caught sight of his pale face and the bloodstained bandage.</p> <p>\"Are you okay?\" She reached out, her fingers touching the hard, sun-bronzed flesh just beneath the bandage.</p><p>\"I'll live,\" he grunted. \"And stop trying to distract me. I told you to stay put.\"</p><p>His eyes glittered a menacing gold in the dim light of the heavily curtained living room.</p><p>\"I don't obey orders so well.\" She licked her dry lips nervously. \"And I was tired of waiting.\"</p><p>\"The police had barely left, Lyra.\" He pushed his fingers through his damp hair with rough impatience. \"I was on my way.\"</p><p>His voice gentled, though not by much as he stared down at her. For a moment, his expression softened and then turned fierce once again.</p> <p>\"You would drive a grown man to drink,\" he finally growled before turning to stalk through the house. \"Come on, I need coffee.\"</p><p>\"Do you know how to fix it?\" She followed him quickly, the question falling from her lips before she could stop it.</p><p>\"Hell no. But I'm fucking desperate,\" he snarled impatiently, his voice rough.</p><p>\"Then don't touch that coffeepot, because I want some, too.\" She moved quickly in front of him before coming to a dead stop in the middle of the immaculate kitchen.</p><p>\"Fine, go for it.\" He moved past her to the door where the tiles shone damply, the smell of disinfectant heavy in the air.</p><p>\"What are you doing?\" She was almost afraid to touch anything. It was almost sterile-clean.</p><p>\"Blood.\" He grunted. \"I don't want it staining the tiles.\" He knelt on the floor, a heavy towel in his hands as he mopped at the puddle of cleaner he had poured on the floor. Her brothers, bless their hearts, would have waited for her to try to clean it. She doubted they cleaned anything besides their weapons, at any time. The slobs.</p><p>\"Do you ever cook in this kitchen?\" she questioned him nervously as she moved to the cabinet and the coffeemaker sitting there.</p> <p>\"I'd need to know how to first,\" he grunted, working at the floor with single-minded intensity. \"I'll figure it out eventually.\" She searched the cabinets until she found the bag of preground coffee and two mugs. The term bare cupboards definitely applied to this man.</p><p>\"What do you eat?\" The silence was stifling as he rose to his feet to watch her measure the coffee into a filter with narrowed eyes.</p><p>\"I eat,\" he finally growled as he moved through the kitchen into a short hall.</p><p>Seconds later she heard water running in the sink and then a heavier flow, as though into a washer.</p><p>He moved back into the kitchen a minute later as she was checking the refrigerator.</p><p>Cheese. Baloney. Ham. Yuck.</p><p>\"Not all of us are gourmets,\" he grunted, moving to the cabinet over the stove and pulling down the bread she had given him that afternoon.</p><p>There was no sign of the cinnamon rolls. Half a loaf of white bread was left and perhaps a third of the banana nut bread. She checked the freezer and then sighed. He had to be starving. A body that big took energy.</p><p>\"What happened tonight?\" she asked as she moved back to the coffeemaker and poured two mugs of the dark brew.</p><p>\"Someone tried to break in to your house, and I caught him.\" He shrugged, his voice cool as he took his mug from her.</p><p>\"Yeah.\" She believed that one. \"Fine. I'll just go home then and call my daddy and my three ex-Special Forces brothers and let them know what happened. Shouldn't hurt, if that was all it was.\"</p><p>He paused, his gaze slicing back to her for a long moment before he lowered the mug.</p><p>She didn't think anything could take his mind off that coffee.</p><p>\"Ex-SF, huh?\" He breathed out roughly, shaking his head with weary acceptance.</p><p>\"Yes, they are.\" She nodded mockingly. \"They retired about five years ago. They were even part of the Breed rescues that took place just after the main Pride announced their existence.\" His expression stilled and grew cold and distant.</p><p>\"I know you're a Breed, Tarek.\" She wasn't playing games with him. She hated it when they were played with her. \"Tell me what's going on.\"</p><p>He grimaced tightly before picking up his mug and moving to the kitchen table as though putting distance between them. She followed him.</p><p>He turned his head, watching as she leaned against the counter across from him and waited. Other than appliances, the kitchen was bare. No disorder. No clutter or decoration. The living room had been the same as she remembered. As though he had yet to decide who he was enough to mark his home with those things that defined him. Unless...</p><p>\"Did you buy the house?\" she asked him then. Surprise crossed his features. \"It's mine.\" He nodded before sipping at his coffee. \"What does that have to do with anything?\"</p><p>Nothing, except the thought of him leaving bothered her. Fine, he had no interest in her outside of her bread and her coffee, but she liked him. At least he wasn't boring.</p><p>\"Nothing.\" She finally shrugged. Thankfully, she was wearing her thick flannel robe rather than one of her thinner ones, the ones that would have shown her hard nipples clearly and made it impossible to hide her response from him. Thar was what pissed her off so bad about him. He was the one man in years who had actually interested her, and he seemed totally oblivious to her as a woman.</p><p>It sucked.</p><p>\"You haven't told me what happened tonight yet,\" she finally reminded him. \"I've been pretty patient, Tarek.\" He grunted at that statement. \"Yeah, I saw that while you were running through the rain.\"</p><p>He inhaled deeply, grimaced, and shifted restlessly in his chair. His hand rubbed at his arm, just below the bandage, as though to rub away the ache.</p><p>She ached for him, for that wound. The sight of his blood earlier had weakened her knees and filled her with a fear she hadn't expected. He had been hurt. While she dealt with the police and filing that stupid report, all she could think about was how severely he could have been wounded.</p><p>\"I don't know,\" he finally answered, staring at her directly. \"I knew someone was out there. I followed him. I caught him messing with the electric box and attempting to get to the back door when I tried to stop him.\" He pushed his fingers through his hair again, feathering the dark gold strands back from his face. \"I don't believe he was after your TV set, though.\" She didn't like the sound of that.</p><p>\"The security company said the alarm couldn't be dismantled in the electrical box. That it has a backup...\"</p><p>\"It can be done.\" He shrugged heavily. \"Your system is residential. It has its drawbacks. I'll get you a new one tomorrow.\"</p><p>\"I didn't ask you to do anything.\" She was growing sick of this cat-and-mouse game of his. \"I want to know what the hell was going on. Any burglar worth his salt would have run when he was noticed. This guy didn't run. Why?\"</p><p>\"I don't know. I was hoping you would.\" That wasn't a lie. He stared at her, his unusual eyes darker, heavy-lidded...</p><p>She swallowed tightly. That was not lust glittering in the golden depths. Men like him didn't get turned on for frumpy little accountants.</p><p>She drew in a deep, uneven breath, flickering her tongue over her dry lips nervously. He followed the movement, his gaze heating.</p><p>Okay. This was odd enough. She could understand being hotter than hell herself, but now he was? Why? Did he have a flannel fetish or something?</p><p>\"Fine. It was no big deal then.\" She crossed her arms over her breasts just to be certain he couldn't see her nipples pushing against the cloth. \"I'll just go home...\"</p><p>\"Not tonight.\" His voice was darker, deeper. \"It's not safe as long as your system is down. You can stay here or call your brothers. It's up to you.\"</p><p>\"I can take care of myself.\" She drew herself up stiffly as she faced him.</p><p>He rose from the table, suddenly appearing stronger, broader, fiercer as he scowled down at her.</p><p>\"I said, you could stay here or call your brothers. I did not give you any other choices.\" A growl echoed in his voice as his eyes seemed to glow with arrogant intent.</p><p>\"I didn't ask you for choices, Tarek.\" She wasn't about to bow down submissively to him, either. \"I don't need a keeper.\" His jaw tightened furiously, his lips thinning as he glared at her.</p><p>And that really shouldn't have turned her on further. But it did. She could feel the moisture gathering, pooling, spilling along the sensitive folds between her thighs. Her breasts felt heavier, swollen, too sensitive.</p><p>And he wasn't exactly uninterested anymore.</p><p>Her gaze flickered down, her face flushing heatedly before she jerked it back up. He was filling out those jeans like it was nobody's business.</p><p>And he hadn't missed the direction of her look, either.</p><p>\"Don't tempt me, Lyra,\" he suddenly warned her, his voice rasping over her sensitive nerve endings. \"My control is shot for the night. Either call your brothers or march your sweet ass upstairs to my spare room, or you're going to find yourself flat on your back in my bed. Your choice. The only ones left. Make it.\"</p><p>Chapter Five</p><p>He was nearly shaking with the need to touch her. Tarek stared down at her pixie features, the blood pumping so hard and so fast through his veins it was nearly painful. His cock was a torturous ache between his legs, the glands at the side of his tongue swollen and throbbing.</p><p>His hard-on made sense. The rush of blood was explainable. The tongue was an enigma, and the taste of spice in his mouth confusing. The only thing that did make sense was the need to kiss Lyra.</p><p>She had tormented him for months. Tempted him. Laughed at him and mocked him with a gentle, feminine warmth that shouldn't have touched him as deeply as it had.</p><p>The smell of her arousal was killing him. It was hot, liquid sweet, and he was dying to lap at the soft cream he knew was spilling from her pussy. It would be hot, frothy with her growing need, and as rich as sunrise.</p><p>\"Hell of a choice.\" Her arms tightened over her breasts. He knew what she was hiding. The lush curves of her breasts, her swollen nipples.</p><p>\"Make it fast if you don't mind,\" he growled. The erection was killing him. \"Because the scent of your arousal is making me insane, Lyra. Pretty soon, I'm going to make the choice for you.\"</p><p>A whimper escaped her lips as her eyes widened in horror. In shame? He frowned as she paled and then flushed furiously, her eyes brightening as though with tears.</p><p>\"What?\" He caught her shoulders as she moved to turn from him, turning her back to face him, knowing that touching her was the biggest mistake he could make.</p><p>\"You smell me?\" She trembled, embarrassment bringing tears to her eyes as she struggled against him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He sighed wearily. Dammit, he was too tired, too hungry for the taste of her to watch every damn word he said and every move he made. He wasn't exactly the social sort, and the \"rules of polite society\" wasn't a class he had found the time to take.</p><p>\"Lyra.\" He breathed out roughly, his hand lifting to her cheek, marveling at the silken texture of her flesh. \"I'm an animal,\" he whispered softly. \"My sense of smell is so highly advanced that I can detect any scent. Especially the sweet, soft heat coming from you. It's like forcing a starving man to stand before a banquet and not taste the riches.\"</p><p>She blinked up at him, swallowing tightly, her gaze suspicious, softening only slightly as his thumb smoothed over her lips.</p> <p>He wanted to say more, but the silken curves held his attention, mesmerized him.</p><p>His tongue throbbed as the glands spilled more of the spicy taste into his mouth. The blood pumped harder through his veins as his control slipped further.</p><p>He lifted his hands from her shoulders carefully.</p><p>\"The bedroom is upstairs, third door on the landing. Get away from me, Lyra. Now. Before I lose all control.\" She frowned back at him.</p><p>\"I don't like the way you make decisions for me, Tarek,\" she snapped furiously. But, thank God, she began to back carefully away from him. \"It's annoying.\"</p> <p>\"I'm certain it is.\" The smell of her still wrapped around him, tormented him. \"We can discuss it tomorrow over coffee. Now go to bed.\"</p><p>She sniffed in disdain, glaring back at him as she reached the doorway.</p><p>\"This tendency to boss me around best not become a habit,\" she warned him again. \"Otherwise, I might disabuse you of the idea that you can get away with it. Count yourself lucky I'm letting you off the hook and escaping. Otherwise, you'd be one molested kitty, Jordan.\"</p><p>He could do nothing but stare at her disappearing back in shock as she muttered the heated words. Molested kitty? He groaned at the phrase. Good Lord, the woman was going to make him completely insane.</p><p>He sighed in relief, forcing himself to let her go before pulling the cell phone from its holder at his side and pressing the calling pad impatiently.</p><p>\"Jonas.\" Jonas Wyatt, head of Feline Enforcer Affairs at Sanctuary, answered on the first ring.</p> <p>\"We have a problem,\" Tarek said quietly. \"I think I encountered our Trainer tonight. Unfortunately, it wasn't me he was after.\"</p><p>He couldn't get the scent of the assailant out of his mind. It was too damned close to the smell of the clothing, admittedly from years before, that the bastard had worn. Not exact, but damned close.</p><p>\"Explain.\" Jonas was a man of few words, which was one of the reasons Tarek liked working for him.</p><p>\"He was breaking into the neighbor's house. Lyra Mason, she's the sister to three...\"</p><p>\"Special Forces agents.\" Jonas finished for him. \"Grant, Marshal, and Tyree Mason. They headed the force that took down some of the main Breed labs.\"</p><p>Tarek closed his eyes, pinching the bridge of his nose in irritation. \"Did you know she lived here when I bought this house?\" he questioned him.</p><p>\"I knew of her. I hadn't run a full investigation because I saw no reason to.\" He could almost see Jonas shrug with the words.</p><p>\"Twenty-four, accountant, lives modestly, a nice little nest egg but nothing substantial. Medical records show a virgin, with all the normal childhood ailments and no police record. I didn't have time to go deeper and had no reason to. Why?\" Tarek shook his head. \"No reason. I might need to come in soon, though; I think I need a checkup or something.\" He ran the sides of his tongue over his teeth, feeling a soft warmth spill into his mouth.</p> <p>\"What's wrong?\" Jonas was sounding concerned now. About damned time.</p><p>\"I don't know.\" He moved to the small foyer that led to the stairs. \"Those damned glands at the side of my tongue. They're inflamed and doing funky shit. I swear I taste cinnamon.\" Silence filled the line.</p><p>\"Where's the girl?\" Jonas asked then. \"The Mason girl.\" Tarek frowned at the question.</p><p>\"My guest room. Her security system was breached.\"</p><p>\"Hell!\" Jonas breathed roughly. \"Have you fucked her?\" A growl rose in his throat. \"That's none of your damned business now is it, Jonas?\" he asked silkily, dangerously. \"Don't overstep your place, buddy.\"</p><p>\"Can it, Tarek,\" he snorted. \"And listen close. This is straight from the old scientist who treats the main Pride members. The swollen glands contain a special hormone. That spice filling your mouth, buddy, is an aphrodisiac. Lyra Mason is your mate.\"</p><p>Tarek laughed. Damn, he hadn't taken Jonas for a</p><p>comedian.</p><p>\"Fine. Whatever.\" He grunted. \"Now tell me the truth.\" He was going to kill Jonas for playing fucking games with him. He wasn't in the mood.</p><p>\"No shit, Tarek.\" Jonas sounded much too serious. \"It's kept very quiet. A complete ban on the information unless a couple appears to be mating. One of the best-kept secrets in the world.\" Heat rushed to his head, and then to his dick.</p><p>\"What do you mean, 'She's my mate'?\" Could that account for the almost obsessive lust that had developed in the past months? The patience with her that he would never have had with anyone else? The growing, clawing hunger that kept his cock hard, his senses inflamed?</p><p>\"Biological, chemical, whatever you want to call it,\" Jonas snorted. \"If you kiss her, it causes the hormone to affect her even more than you. Mating Heat. Complete sexual abandon from now until forever. You poor bastard.\" There was an edge of envy in his voice, though.</p><p>Complete sexual abandon? From now until forever? His mate?</p><p>\"She's mine,\" he whispered.</p><p>\"Yep. That's what the doc says. Somehow, nature picked your perfect woman for you. Have fun.\"</p><p>\"Have fun?\"</p><p>Jonas chuckled. \"Tarek, you sound dazed, buddy.\" He gazed up at the stairs before closing his eyes and shaking his head miserably. He had a feeling Lyra was really going to have a reason to be pissed now.</p><p>\"Shit,\" he breathed out roughly. \"This is not a good time for this, Jonas. I don't have time for sexual abandon or some kind of fucked-up aphrodisiac. Get the cure out here.\" Jonas laughed at that.</p><p>\"I'll bring the latest attempt at contraception instead,\" he informed him. \"Tell her what the hell is going on, and before you take her, be sure she takes the little pink pill. It's worked so far. Their best guess is that the Mating Heat is nature's way of ensuring the success of the species. Because without this pill, conception of the first child occurs quickly. They sure do make some pretty babies, though.\"</p><p>Babies? Tarek swallowed hard. The thought of Lyra carrying his baby did things to him he couldn't explain.</p><p>\"Just get me some help out here,\" he snapped, attempting to cover the emotional response suddenly surging through him.</p><p>\"I'm telling you, Jonas, it's getting dangerous here.\"</p><p>\"That goes without saying,\" Jonas agreed. \"I'll head out there myself with Braden and cover you. Let me know how she takes it.\"</p><p>Tarek grunted at that one.</p><p>\"The information. Not that.\" He laughed, entirely too amused to suit Tarek. Then his voice sobered. \"She's a good woman from what I learned, Tarek. You could have done worse.\"</p><p>\"She could have done much better,\" he said. \"You say it's permanent?\"</p><p>\"Like a drug,\" Jonas said, his voice quieter now. \"There are only a few mated couples so far. They're still doing tests, trying to find answers. But so far, it's permanent.\"</p><p>He was fucked. He would have to tell her the truth. If she had a brain in her head, she would run as fast and as far from him as possible. And he would be stuck, obsessed—hell, in love with a woman he knew he had no right to, and no chance of touching.</p><p>Chapter Six</p><p>The next morning dawned cold, the rain still falling in a listless, icy drizzle along the windowpanes. Every curtain in the house—thick, heavy, rubber-backed curtains—was closed tightly, and the atmosphere between Lyra and Tarek was decidedly tense.</p><p>Breakfast consisted of rich, strong coffee and the mound of sausage biscuits Tarek had nuked in the microwave. She had managed to choke down two. God, how did he stand that stuff?</p><p>Then she sat, finishing her coffee, watching as he consumed the rest.</p><p>He was too quiet. Brooding. His expression savagely relentless as the silence became thick enough to cut with a knife. She could almost see it distorting the air around them.</p><p>\"I have to go home,\" she announced as she rose to her feet and took her cup over to the sink. \"The security company should be around soon...\"</p><p>\"I canceled the call.\" His response had her turning back to him slowly. \"My people will be here in a few hours to replace the system entirely.\"</p><p>She stared back at him silently for long moments. This wasn't the lazy, often-cautious man she had come to know. He was still, prepared, his body tense. Still sexy as hell, but the caution had been replaced by a dangerous sense of expectation.</p><p>\"Really?\" she finally answered, crossing her arms over her breasts. \"And I gave permission for this, when?\" When he raised his eyes to hers, she shivered, a tremor racing up her spine at the intense lust, the pure, driving hunger she saw in those eyes.</p><p>She could feel her vagina weeping. The juices were fairly dripping from the hidden flesh. And he could smell it. She watched him inhale slowly, as though savoring the scent of her.</p><p>\"Pervert,\" she snapped, frowning as sensuality fully marked his expression. \"Fine, you make me hot. You can smell it. Now it's time for me to go home. Thanks for saving the night and all that.\"</p><p>She turned for the door.</p><p>\"Touch that doorknob, and you'll regret it.\" Her hand was within an inch of gripping it when she drew back slowly at the sound of his voice. She turned, swallowing tightly at the savage expression on his face as he lifted his cup and finished his coffee slowly.</p><p>\"Tarek, you're going to piss me off,\" she warned him, suddenly wary. \"The silent He-Man crap doesn't get it with me.\" He leaned back in his chair, watching her with predatory interest. She had seen glimpses of this side of him, but it had never been focused entirely on her. It had her body tightening, adrenaline and excitement rushing through her.</p><p>She was sick. That was all there was to it.</p><p>He scratched at his chest slowly.</p><p>\"Amazing things, genetics,\" he finally stated with a forced calm that made her think of the eye of a hurricane. This was not going to be good.</p><p>\"Really?\" She lifted a brow, standing close to the door as she arched her brow mockingly.</p><p>\"Really.\" He nodded. \"All kinds of little things start cropping up, surprising the hell out of you, reminding you that Fate does get the final laugh on all our asses.\"</p><p>Oh, this just wasn't going to be good at all.</p><p>She moved closer. The bleak, haunted shadows in his eyes had her chest tightening in fear.</p><p>\"What's wrong?\"</p><p>He stared back at her silently for long, tense moments.</p><p>\"I'm debating something,\" he finally growled, his voice deepening, roughening as his gaze pinned hers. \"I've debated all night.\"</p><p>Why did she have this bad feeling he was debating</p><p>something that she really wasn't going to be pleased with?</p><p>\"Yeah?\" She inserted mild curiosity into her tone when every bone and muscle of her body was trained on what was coming next.</p><p>\"Yeah.\" He nodded slowly, his gaze drifting over her body with lustful intent. \"You've made me crazy for months. I'll be damned if I haven't stood by, amused, curious, letting you razz on me every chance you've had.\"</p><p>Yeah, that one had bothered her, too. He never got pissed. Surely he wasn't getting pissed now? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"What, you want an apology?\" she asked him, incredulous.</p><p>\"A little late, Tarek.\"</p><p>\"I couldn't figure out why.\" He shook his head slowly. \"Then, the strangest thing happened. The more I smelled the sweet heat flowing from your pussy, the more I denied myself a taste of it, the more I started noticing a few changes.\" She flushed heatedly at the explicit language, furiously chiding herself silently over her breathless reaction to it. He rose from the chair as she watched him warily.</p><p>\"Changes?\" She swallowed tightly as she glimpsed the morethan-healthy bulge between his thighs.</p><p>\"These little glands along my tongue swelling. The taste of spice filling my mouth. The hunger for you growing by the day until I could almost taste your kiss. And I wanted your kiss bad, Lyra. So bad it was killing me. I wanted to push my tongue in your mouth and make you taste it, too. Make you as crazy for me as I was for you.\"</p><p>He stepped closer.</p><p>Lyra was breathing roughly, her hands knotted in the front of her robe as she watched him advance on her.</p><p>\"Are you sick or something?\" She had to force the words from her mouth.</p><p>A mocking, bitter smile twisted his lips.</p><p>\"Or something,\" he agreed as he towered over her and then stepped slowly behind her.</p><p>She was not going to run from him, no matter how weird he acted.</p><p>\"Would you like to know what's wrong with me, Lyra?\" He bent close, his breath whispering over her ear as he spoke. A shiver raced up her spine as her nipples tightened further, rasping against her gown, almost making her moan at the pleasure of the action.</p><p>\"No.\" She had a feeling she was certain she didn't want to know.</p><p>\"There's this nasty little hormone filling my mouth.\" That growl was deeper now, more animalistic. \"It's an aphrodisiac, Lyra. Caused only when a male Feline Breed hungers for his mate. Do you know what's going to happen if I kiss you?\" Her knees weakened. A hormonal aphrodisiac? Something to make her hornier? She didn't think so.</p><p>\"What?\" She couldn't hold back the gasping whisper.</p><p>\"If I kiss you, it goes into Mating Heat. Complete sexual abandon until you've passed ovulation. Do you know you're preparing to ovulate? That my body is reacting to it? That my cock is so damned hard, my balls so tight with the need to fuck you that it's like an open wound in my gut? All because you're ovulating. My mate. My woman.\"</p><p>Her eyes widened in horror at the words he whispered at her ear.</p><p>\"You're crazy.\" She jerked away from him, turning on him furiously. \"That's not possible.\"</p><p>The curve of his lips was bleak.</p><p>\"You would think, wouldn't you?\" He moved to the counter, picking up a small oval disc that he slapped on the kitchen island. \"This will stop conception. Nothing can stop the heat. Now, my problem is, I'm ready to rip that gown off your body and throw you to the damn floor where I can fuck you until we're both screaming. Until you're as wild for me, as crazy for me, as I am for you. Or you can run out of that door right now, as fast as you can run, and find someplace, any place, to hide until I can find enough control to keep from hunting you down and taking you like the animal I am. Make your choice now, baby, and make it fast. Because this kitty is all out of patience.\"</p><p>Chapter Seven</p><p>Make a choice? He wanted her to make a choice?</p> <p>She stared back at him, eyes wide, trying to force her brain past the shock to actually make a decision as to whether or not she was still sleeping. Because this had to be some kind of screwed-up nightmare. That was all there was to it.</p><p>\"Let me get this straight.\" She edged farther back from him, simply because she was becoming so wet her panties felt damp and his eyes were getting darker. \"Your tongue has glands. That have a hormonal aphrodisiac in them?\"</p><p>He nodded as he advanced on her. He didn't say a word, just nodded his head as he inhaled deeply. She trembled at the knowledge that he was actually smelling her.</p><p>\"If you kiss me, we go into heat?\"</p><p>\"You go into heat.\" He smiled, a tight, hard curve of his lips that denoted way more male intent than she was comfortable with.</p><p>She cleared her throat. \"What do you do?\"</p><p>\"I put out the flames.\"</p><p>She moved back.</p><p>Okay. She was retreating. So fucking what? He was stalking her across the room like the damned Lion he was. And the closer he got, the hotter she got.</p><p>\"Tarek...\" She jerked in surprise as her back came up against the wall, staring up at him in shock as he stopped, only inches from her, his hand lifting.</p><p>He touched her. The backs of his fingers brushed against her throat before trailing down to her collarbone, his eyes tracking each movement his hand made as her breasts began to swell and throb.</p><p>\"You're running out of time.\" His guttural whisper had her womb clenching furiously, the breath locking in her chest. This was a side of Tarek she wasn't accustomed to. A side she knew should not be turning her on as it was. He had barely touched her. In nearly six months of confrontations, arguments, and snapping debates, he had never touched her, never kissed her, and she was going up in flames for him.</p><p>She could feel it in every cell of her body, every hard pulse of blood through her veins.</p><p>\"How long does it last?\" she finally asked. \"The heat stuff?\" His eyes narrowed as his head lowered. He was going to kiss her, she knew he was. But he didn't. His lips moved to her neck, burning a heated caress to the sensitive flesh where her shoulder and neck met. There, his lips opened, his tongue stroking her skin a second before the incisors scraped against it. Her hands flew to his arms, her hands gripping his wrists as her knees weakened.</p><p>\"It lasts forever.\" Bleak, bitter pain filled his voice. \"From now until forever, Lyra. Always mine.\"</p><p>He bit her. Not hard enough to break the skin or to cause her undue pain. But he bit, his teeth clenching in the tender muscle as she arched on her tiptoes, a sizzling bolt of electric pleasure pulling a strangled cry from her lips.</p><p>Her clit pulsed, her vagina wept, her nipples became so hard, so tight, they were a near violent ache as a lethargic weakness left her gasping rather than fighting for freedom.</p><p>\"Always?\" She should have been alarmed. Always was not supposed to be in her vocabulary. She had no desire to be under a man's thumb, just under this man's body.</p><p>His lips moved back up her neck, his tongue licking at her flesh as a rumbling growl broke from his chest.</p><p>\"Just a taste,\" he whispered as he reached her lips, his arms lowering from the braced position against the wall beside her head. \"Stay very still, baby. I just need a taste.\" His lips ghosted over hers as she stared back at him, her gaze locked with his, seeing the hunger, the aching, soul-deep need he had kept hidden beneath lowered lashes or behind mocking humor.</p><p>But now it was laid bare to her, as clear, as desperate as the aching hunger for him that pulsed low in her stomach. She trembled as she felt his hands at the front of her robe, his lips, nipping at hers, parting them, retreating, only to come back for more as she held on to his wrists with a death grip. The buttons on her robe gave way, the edges falling apart as they both breathed harshly, the silence of the kitchen broken only by their gasps of pleasure.</p><p>\"You're so wet. I can smell how wet you are. How sweet,\" he whispered as he stared back at her, his fingers working on the buttons of her gown. \"Like the fragrance of summer, heating me, reminding me of life, of living.\"</p><p>His words shook her to her core.</p><p>\"Do you know what the smell of your sweet pussy does to me?\" He smoothed her gown apart, the cool air brushing against her naked breasts as she whimpered in an arousal so sharp, so desperate, she wondered if she would survive it. \"It makes me hungry, Lyra. Hungry to take you, to hear you screaming beneath me as I bury every inch of my cock as deep inside you as possible.\"</p><p>She cried out sharply, unable to contain the sound. Could a woman orgasm from words alone? His explicit language was driving her over the edge, earthy and lustful, filled with a desire no man had ever shown her before.</p><p>He grimaced, showing the incisors at the side of his mouth as his gaze moved to the rapid rise and fall of her breasts.</p><p>\"Look how pretty.\" He took her hand from his wrist, spread her fingers, and then wrapped it around the lush mound. She stared back at him in shock, her eyes flickering to where she cupped her own flesh, her hand surrounded by his.</p><p>\"Feed it to me,\" he whispered then, his voice wicked, filled with lust. \"I want to taste it.\"</p><p>She shuddered, a whimper escaping her throat at the pure eroticism of what he was doing to her.</p><p>His hand moved back hers. \"Give it to me, Lyra. Press that pretty, hard nipple into my mouth.\"</p><p>She couldn't believe she was doing it. That she was lifting her breast, leaning forward as he bent his knees, lowering himself to allow the straining nub to pass his lips. He licked it first.</p><p>\"Oh God, Tarek.\" She was shaking like a leaf, pinpoints of explosive pleasure detonating through her body.</p><p>He licked it again, his tongue, rasping roughly, like wet velvet gliding over the sensitive tip.</p><p>Then he growled. A hard, savage sound as his lips opened, parted, to envelope the hard point into the wild, wet heat of his mouth.</p><p>She climaxed.</p><p>Lyra's hands shot to his head, her fingers tangling in the rough strands of his hair as something exploded deep within her womb. Pleasure rushed through her sex, drenching her, spilling to her thighs as she lost her breath.</p><p>He hadn't even kissed her yet.</p><p>His head rose from her nipple, his hands lifting, pulling hers from his hair as he settled them against her sides. He laid his against her shoulders, smoothing the unbuttoned gown and robe slowly from her arms as she shook before him. Lyra swallowed tightly, small whimpers passing her lips as she stood naked before him. Naked—she never wore underwear beneath her gowns—while he was fully clothed, watching her with glowing gold eyes, his expression predatory, savage.</p><p>\"Sweet little virgin,\" he whispered, his gaze moving down her body, finally coming to rest on the bare, slick folds between her thighs. \"Naughty little baby.\" His eyes moved back to hers.</p><p>\"Imagine how my tongue is going to feel there. Sliding through all that hot, sweet syrup. Will you come for me again, Lyra? Will you cry for me again?\"</p><p>He took her hand, moving it to the snap of his jeans as he watched her with savage eyes.</p><p>\"Make your choice now, Lyra. Accept me.\"</p><p>Good Lord, what was she supposed to do about him? She was standing there naked in front of him, and he still could not reason out that she had already accepted him? Even with all the weird Breed mating stuff, she couldn't imagine not accepting him.</p><p>\"Kiss me,\" she demanded roughly, her fingers moving to the metal snaps of his jeans, releasing them slowly, the hard heat of his erection beneath making the task difficult.</p><p>\"God.\" He snarled the prayer as he shuddered against her, his hands gripping her hips as his eyes clenched shut for long seconds.</p><p>\"Kiss me, Tarek,\" she whispered, reaching for him, her lips brushing his as his head lowered, his eyes blazing with hunger, pain, and need as he watched her. \"Make me crazier.\" The front of his jeans parted beneath her trembling fingers, the hard, generous width of his erection rising from the material, flushed and desperate as she glanced down nervously. She licked her lips.</p><p>\"I hope you know what to do with it.\" She finally swallowed lightly. \"Because I don't have a clue.\"</p><p>And he didn't bother with explanations.</p><p>In that second his head lowered, his lips slanting over hers as his tongue licked and then pressed demandingly between her lips.</p><p>Immediately the taste of spice exploded in her mouth. Heat sur-iounded her, whipped through her mind, then cell by cell began to invade her body.</p><p>She thought the clawing, driving hunger for his touch, his kiss, couldn't get worse. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She was wrong.</p><p>Exploding fingers of sensation began to tear through her nerve endings. Her womb clenched, knotted. The already aching flesh between her thighs began to burn with a spasming, violent need.</p><p>She screamed into his kiss, rising on her tiptoes for more, pressing against him, trying to sink into the heat emanating from beneath his clothing.</p> <p>He tore his lips from hers, his breathing rough, harsh as she tried to claw up his body and capture his lips again.</p><p>\"That fucking pill.\" His voice was animalistic, rough, hungry.</p><p>\"No. Kiss me again.\" She pulled his hair, dragging his head back down until his lips covered hers again, a groan tearing from his throat as her tongue pushed between his lips. It was wildfire. It was destructive. She could feel the flames licking over her body, pinpoints of electricity sensitizing her flesh. And pleasure—the pleasure was overwhelming.</p><p>She felt him pick her up. Lifting her from her feet as she lifted her legs, bending them to clasp his hips as the fiery hot length of his erection suddenly seared the folds of her cunt. He was moving. Walking. Sweet heaven, how was he</p><p>walking?</p> <p>He pulled his lips back again, his movements jerky as he braced her rear on the kitchen island and jerked open the small plastic container.</p><p>He pushed the pill between her lips.</p><p>\"Swallow it,\" he growled. \"Now, Lyra.\" He was moving against her, his cock sliding in the juices of her sex as he stared down at her fiercely, raking the tender bud of her clit, sending spasms of sensation ripping through her belly.</p><p>She swallowed the pill before her gaze dropped to her thighs.</p><p>She whimpered.</p><p>\"Do it,\" she whispered, watching the bloated head of his cock part her and then slide up, raking against her clit.</p> <p>\"Damn,\" his voice was filled with lust, with a strengthening demand as his fingers caught in her hair, pulling her head back to force her gaze to his. \"I told you. I'm eating that sweet pussy first.\"</p><p>\"I can't wait, Tarek,\" she whimpered, her hands pulling at his shirt, amazed as the buttons tore free, revealing his golden chest. \"Now. I need it now.\"</p><p>\"You can wait.\"</p><p>But he wasn't about to.</p><p>Her eyes widened as he pushed her back, spreading her thighs as he lifted her legs and buried his head between them. The first swipe of his tongue through the sensitive slit of her cunt had her screaming. He licked at her, lapping at the juices spilling from her vagina as he groaned against her flesh. She had never imagined such agonizing pleasure. She writhed beneath him, twisting, bucking against his mouth as he circled her clit, only to move lower to lap at her again. He nibbled at the sensitive lips, parted her, and then suddenly, astonishingly, drove his tongue inside her. She exploded in a firestorm of blazing pleasure as his tongue fucked inside her with hard, blistering strokes. Her muscles clenched, shuddered, and more heated liquid spilled to his greedy lips. And still, it wasn't enough.</p><p>She was gasping, tears dampening her face as she shuddered a final time, staring up at him as he straightened between her thighs.</p><p>\"Tarek?\" She sobbed his name beseechingly. \"I need more.\" She was exhausted, but the fire burning in her womb was never-ending.</p><p>\"Shh, baby.\" He lifted her quickly in his arms. \"I refuse to take you on the kitchen counter, Lyra. I won't do it.\" He stumbled as her legs wrapped around him, clasping his hips tight, her clit rubbing against the shaft of his cock as he began to carry her to the stairs.</p> <p>\"I won't make it upstairs.\" She was riding the thick wedge, the agonizing pleasure ripping through her mind.</p><p>If she could just get the right position. Just a little higher...</p><p>She felt the thickly crested head part her, lodge against the tender opening before his first step onto the stairs forced it inside her.</p><p>He stumbled, growling, one arm locked around her as he braced his hand to the wall, breathing harshly.</p><p>\"Not like this,\" he breathed roughly. \"Oh God, Lyra. Not like this. Not your first time...\"</p><p>Regret, remorse. She saw it in his expression, heard it in his voice. But stretching her entrance wide, teasing her, tempting her, was the head of the instrument she needed to relieve the agonizing lust clawing at her pussy.</p><p>She shifted in his embrace, feeling him slip farther inside her before coming to a halt against the proof of her virginity.</p><p>\"Baby...\" He whispered the endearment against her ear as he struggled up another step.</p><p>Each move pulled his cock back, pushed it in, and stroked her no more than inches inside the gripping muscles of her cunt, sending shudders wracking through her body at the exquisite pleasure.</p><p>He was killing her.</p><p>\"I'm sorry.\" He stopped, bending, placing her rear at the edge of the step as he knelt in front of her. \"God, Lyra. I'm sorry.\"</p><p>She had no more than a second's warning before his hips flexed and then pushed forward, driving his thick, hot erection to the very depths of her hungry, gripping pussy.</p><p>Shocking, blistering. The sudden penetration had her arching as the pleasure/pain of his abrupt entrance sizzled across her nerve endings. Overfilled, stretched tight, she could feel his cock throbbing inside her, setting flames to her ultrasensitive depths. Lyra's head fell back against an upper step, her legs lifting, clasping his back tightly as he began to drive inside her. It was unlike anything she could have imagined. She could feel him pushing the tender muscles apart, stroking delicate tissue, and sending almost unbearable pleasure whipping through her system.</p><p>She held on to him, feeling his lips at her neck, his incisors scraping over her flesh as the pressure began to build inside her womb, the pleasure coalescing, tightening with each desperate lunge of his cock inside the snug depths of her cunt. She could barely feel the hard wood of the step beneath her. All she felt was Tarek, heavy, hot, wide, overfilling her, making her take more, thrusting inside in an ever-increasing tempo until she felt the world dissolve around her.</p><p>Then she felt more.</p><p>Her eyes widened, staring in dazed shock at the ceiling above her as, simultaneously, his teeth bit into her shoulder, holding her still for something so incredibly unreal, she was certain she had to be imagining it.</p><p>He slammed in deep, his body tightening as she felt an additional erection, an extension swelling from beneath the hood of his cock, locking him inside her, caressing a bundle of nerves high inside her pussy, and sending her rushing past ecstasy into rapture. The heat of his semen filled her, pulse after violent pulse echoing in the flexing depths as he growled harshly at her neck.</p><p>He was locked inside her. The extension holding him in place sent cataclysms of sensation exploding through her over and over again.</p><p>When it finally eased, when the hard pulsing jets of his release and the violent shudders of her own eased, her eyes closed in exhaustion.</p><p>She had thought no arousal could be worse than what she had known before his kiss. She was rapidly learning just how wrong she was.</p><p>Chapter Eight</p><p>You are not human...You may look in the mirror and declare your humanity. You may tell yourself that looks are all that matter. They do not. You are animals. Created in a lab, a manmade creation, and you will serve the men who made you. You are animal. Our tools. Nothing more...</p><p>Tarek stared at the ceiling as he held Lyra in his arms, her head on his chest, her body draped over his. She was like a kitten, determined to get as close as possible in her sleep, curling around him with a sigh before she had relaxed into exhaustion several hours before.</p><p>He wasn't human. That had been driven irrevocably home on the stairs, his body covering hers, as it betrayed his sense of humanity. His belief in himself as a man, not an animal. A barb.</p><p>He closed his eyes as bitterness swamped him.</p><p>He pushed back the shudder of pure lust at the memory of the sensations.</p><p>Dear God, the pleasure. It had been unlike anything he could have anticipated. The extension had been highly sensitive, pulsing, throbbing in orgasmic delight as he poured his semen into her.</p><p>He breathed in roughly, grimacing at the erection he still sported. He had a feeling he would never get enough of the feel of her silken cunt, with or without the Mating Heat. His hand smoothed over her hair, his fingers tangling in the soft strands as he relished the feel of her lying against him. She was warm. Precious. She was a gift he had never imagined lie would ever have.</p><p>And she liked him. He knew she felt at least some affection for him, though perhaps not as much as he felt for her. Hell, he had fallen in love with her during the first few months he had known her. He had known it was love. Known the</p><p>possessiveness, the joy, i he sheer delight he found in her could be nothing else.</p><p>He wanted to clutch her to him, tighten his arms around her and hold the world at bay forever. But he knew, realistically, it wasn't possible. He could only hold her for now and see how she reacted when she awakened.</p><p>And that part terrified him.</p><p>Would she be disgusted?</p><p>Hell, of course she would. What sane, reasonable woman could so easily accept something so animalistic? So outside the bounds of what she knew was human?</p><p>He felt her shift against him and restrained his growl of impatient lust as her leg slid over his thigh, her knee nearly touching the taut flesh of his scrotum.</p><p>Sweet Lord, she made him hot. And he wasn't blaming it on the Mating Heat. He had known what she would do to him from his first confrontation with her.</p><p>She sighed against his chest, a soft little sound that clenched his heart as her hand smoothed over his chest and then back again.</p><p>He stilled, his breath nearly suspending as she repeated the action, her body tensing.</p><p>\"What happened to you?\" Her fingers picked up the nearly invisible line of scars that criss-crossed his chest.</p><p>\"Training.\" He hoped she would leave it alone. Prayed she would let it go.</p><p>\"What kind of training?\" She leaned up enough to open drowsy eyes, though her gaze was as sharp as ever.</p><p>He was willing to bet she drove her father insane. She was too curious, too independent, and too set on having the answers she demanded.</p><p>\"Simply training, Lyra,\" he finally answered her. \"At times, I was not the perfect little soldier I should have been.\" He heard the bitterness that laced his voice, wincing at the sound of it.</p><p>Her fingers moved over the abrasive scars once again as her gaze tuckered to his. A gaze filling with anger. Making her angry had not been his intention. He wanted only to shelter her from what he had known during those years. There was no reason for her to know the brutality, the mercilessness of those who created him.</p><p>\"I hope they're dead.\" Her snarl surprised him, as did the bloodthirsty fury in those beautiful eyes as she stared back at him. \"Whoever did this, I hope you killed him.\" He had. But it wasn't something he was proud of.</p><p>He was proud of this small sign of protectiveness from her, though. She was angry on his behalf, not with him.</p><p>\"It's over. That's all that matters.\" He touched her cheek, amazed at her, just as he had been from the first moment he had seen her.</p><p>She snorted at that, a completely unladylike sound that didn't really surprise him as her expression conveyed her disagreement with him.</p><p>\"I need a shower.\" She finally shifted from him, her moves hesitant.</p><p>\"I'll show you the shower and get you one of my shirts to wear.\" He moved from the bed before turning back and lifting her into his arms.</p><p>She gripped his shoulders, staring up at him in surprise.</p><p>\"You're tender.\" And she was as light as a feather. \"Perhaps try a bath to relieve the soreness. I have some Epsom Salts in the cabinet that will make you feel better.\"</p><p>Jonas had suggested hot baths rather than showers to help ease the soreness as well as the building heat for a small respite. He knew the scent of her and could detect the change as she moved farther through the ovulation process. The pill she had taken would do nothing to stop the heat, only the end result of the ovulation process. There would be no egg, no conception. He ignored the small flare of regret at the thought of it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'm hungry, too,\" she informed him. \"And I don't want any of those nasty biscuits, either. I want some real food.\" He set her down in the bathroom, staring down at her in confusion. \"Such as?\"</p><p>\"I'll call Liu's. She'll have one of her boys deliver.\" She stared around the large bathroom before looking back at him pointedly.</p><p>An invitation to leave. That one was hard not to miss. But not yet.</p> <p>\"Let me know what you want, I'll have a friend pick it up for us,\" he suggested instead. \"For the time being, I would prefer not to let anyone I don't know into the house.\" A small tremor raced through her body as she glanced away from him for a moment and breathed in heavily.</p><p>\"Fine. I can understand that. As long as I get my Chinese fix.\"</p><p>He listened carefully to the dishes she wanted ordered, restraining his smile. It was enough to feed an army. It was a damned good thing he had a near-perfect memory.</p><p>\"Bathe. I'll call Jonas and have the food picked up. By the time you're finished, it should be here.\"</p><p>He could smell the heat building in her and wanted her to have the time to enjoy the food.</p> <p>\"Thanks. Now go away.\" She waved him away with a delicate gesture of her fingers. \"I don't need you in here right now.\" His lips quirked at her irritated expression, but he did as she asked. And he prayed. Prayed she had forgiven him for the animal he was, rather than the man he knew she needed.</p><p>\"I need to go to the house for some clothes and stuff.\" Lyra found her gown and robe in the washroom, folded neatly on the top of the dryer after they had consumed the delivered Chinese food.</p><p>Her hunger was sated, but that was all. The steadily rising lust building in her body was about to make her crazy. It tingled in her breasts and spasmed in her vagina. And she ached for his kiss—literally. She was certain no drug could be as addictive as his kiss was.</p><p>\"You can't leave the house yet, Lyra.\" His voice brooked no refusal.</p><p>Okay, a man could be really sexy when he was being</p><p>dominant, especially this man. But she just wasn't in the mood for it. She wanted to be fucked, but she would be damned if she was going to ask him for it. And because she knew he could smell her arousal, she knew he was very well aware of the hunger building within her.</p> <p>She turned carefully, clutching the folded material to her breasts.</p><p>\"Too bad. I need clean clothes and time to think...\" A bitter smile twisted his lips as a raging pain reflected in his gaze.</p><p>\"The time for thinking was before you decided to take my kiss.\"</p><p>She shook her head against the anger in his voice.</p><p>\"Not about this,\" she informed him fiercely. \"I have to decide things, Tarek. This has changed my life, you know it and I know it. There are other things involved than just you and I and this Mating Heat, or whatever you call it.\" Heat? Try inferno. It was killing her.</p><p>\"Then take care of it on the phone.\" There was no give in him.</p><p>Good Lord, why hadn't she heeded the warnings of his complete male stubbornness that she had glimpsed over the months? He looked about as immovable as a boulder.</p><p>\"I need clothes. My laptop...\"</p> <p>\"You won't have time to wear clothes, or to work...\" He advanced on her, his eyes lowering over the lust gleaming in his gaze. \"You'll be lucky to have time to eat.\" Her stomach clenched at the growl in his voice as he reached out, taking the gown and robe from her before setting them back on the washer.</p><p>\"I want to take you in the bed this time.\" His fingers tangled in her hair as he dragged her head back, his head lowering as though for a kiss.</p><p>As though she were that easy.</p><p>She didn't care how hot she was or how much the arousal was becoming painful. She was not just going to bow down and accept whatever. She might not be a Breed with a clear appreciation of this Mating Heat stuff, but she still had a mind of her own.</p><p>Before he could stop her, she twisted away from him, moving through the doorway and stalking through the kitchen to the foyer. She wasn't going to attempt the back door. But she might have a chance of getting to her own house before he stopped her through the front yard. Icy rain and all.</p><p>\"Lyra. Where the hell do you think you're going?\" He moved ahead of her before she could reach the door, staring back at her broodingly as she restrained the urge to kick him.</p><p>\"To my own house,\" she reminded him. \"Remember?</p><p>Clothes? Laptop?\"</p><p>\"No.\" The rough growl sent shivers up her spine and spasms attacking her vagina. Damn him. A man should never have a voice so inherently sexy.</p><p>\"Tarek, you are under the impression this Mating Heat of yours somehow gives you rights you do not have.\" She pointed her finger into his chest, pushing back at the stubborn male muscle that wouldn't budge an inch.</p><p>Savage intensity tightened his expression, giving him a dangerous, predatory look.</p><p>\"You are my mate. It's my place to protect you.\" He fairly snarled the words, lifting his lip to display those wickedly white incisors.</p><p>\"It's daylight, Tarek,\" she pointed out as though speaking to a young child. Sometimes, men responded to nothing else. \"I'm safe, sweetheart. I'm just gonna walk across the lawn.\"</p><p>\"You will not.\" He stepped toward her.</p><p>And of course, she retreated.</p><p>The look on his face assured her that he was done ignoring her arousal and now ready to do something about it. Of course, the erection straining beneath the loose fit of his sweatpants pretty much assured her of that on its own.</p><p>\"Tarek, these strongman tactics are going to piss me off,\" she bit out, irritation surging through her. \"I don't like it.\"</p><p>\"So?\" His lips tilting in a mocking smile. \"Tell me, mate, how will you stop it?\"</p><p>Cool male confidence marked his features.</p><p>\"I'm really going to hurt you,\" she muttered, frustration surging through her because she knew there wasn't really a damned thing she could do.</p><p>She could call her brothers.</p><p>But that wouldn't really be fair. Would it?</p><p>No, she decided, this one she had to handle on her own. She backed up again as he moved closer, her eyes narrowing on him.</p><p>\"I am not ready to have sex with you yet,\" she stated imperiously as she tried to escape into the living room. He smiled. A wicked, sensual smile that had her pussy weeping. Damn him.</p><p>\"Aren't you?\" He stalked her through the large room, her gaze moving around the heavy furniture, taking in the clean masculine lines and nearly clinical sterility of the room. There wasn't even a picture.</p><p>\"No. I'm not.\"</p><p>Oh but she was. it was beating through her veins and pounding in her chest. Her breasts were tight with the need for it, her pussy clenching in hunger.</p><p>He stopped as she edged around the heavy cherry wood coffee table, watching him warily.</p><p>\"You make me want to smile,\" he whispered then, his eyes filled with warmth, with longing. \"Even as stubborn as you can be, you make me want to smile.\"</p><p>Her heart melted. Now, dammit, how was she supposed to stand her ground when he said things like that?</p><p>\"Now is not the time to be nice, Tarek,\" she snapped, infuriated at him.</p><p>\"But I want to be nice to you.\" He used that whiskey-rough voice like a caress, and it was much too effective for Lyra's peace of mind. \"I want to be very nice to you, Lyra. I want to lay you down on that couch, spread your pretty legs, and show you just how nice I can be to you. Wouldn't you like that, baby?\" The heat in the room jumped a hundred degrees. She could feel perspiration gathering between her breasts and along her forehead, and hunger tearing her apart.</p><p>She didn't run as he made his way around the table. She watched him, wondering what the hell had happened to her willpower, her strength, her determination to not let this man get around her so easily.</p><p>But he did. Not with his words. Or his intent. It was the longing in his eyes, the vulnerability, the joy that sparkled there as she faced him.</p><p>\"I'm really going to get mad at you one of these days,\" she warned him as he stepped closer, surrounding her, his hand moving beneath her hair to cup her neck. \"And don't bite me again, either. That's just too freaky.\"</p><p>She could feel the wound pulsing, achingly sensitive.</p><p>\"You complain about the bite, but not the barb?\" The casual tone of his voice was not reflected in the tenseness of his body.</p><p>\"Yeah, well.\" She cleared her throat nervously. \"The barb I can forgive you for. That bite is going to get your ass kicked if my brothers see it, though. I'd prefer to keep you in one piece.\" He stared down at her thoughtfully.</p><p>\"I think you enjoyed the barb.\" He lowered his head, his tongue rasping over the small wound from his bite. \"And I think you liked the bite, too, Lyra.\"</p><p>She shivered as his tongue rasped over it, sending currents of pleasure whipping through her.</p><p>\"Maybe,\" she gasped in pleasure, standing still, her hands at her sides, curled into fists to keep from touching him, to keep from disturbing the emotion she could feel weaving around her.</p><p>\"Come here, baby.\" He pulled her into his arms, leaving her no other choice but to lift her own, her hands moving to his neck, to his glorious mane of hair. \"Let's see how much you like both.\"</p><p>His head lowered, his lips covered hers, and she was lost. She knew she was lost. Taken in a firestorm of sensual heat as the delicately flavored hormone began to surge through her already prepared senses.</p><p>She moaned into his kiss, her lips parting, accepting his tongue, drawing on it as a savage growl vibrated in his throat. Her nails bit into his shoulders, scraped the flesh, caressing him in turn as his hands gripped her buttocks and lifted her against his thighs.</p><p>She was aware of him moving her, laying her back on the cushions of the overstuffed couch as he moved over her. He pushed the shirt over her breasts, but neither of them could break the kiss long enough to tear it off. But somehow he had removed his sweats.</p><p>She could feel his cock, hard and heavy against her thigh as his hands roved over her sensitized body. They moaned, the sounds of their pleasure mixing, merging as he lifted her to him, the broad crest of his erection pressing against the slick, readied entrance to her spasming pussy.</p><p>\"Lyra...\" His harsh, graveled voice pierced her heart as he tore his lips from hers, raising his head to stare down at her with eyes that seemed to melt with emotion.</p><p>Oh God, she loved him. Everything about him. Every portion of him.</p><p>\"Now,\" she whispered as he paused. \"Love me, Tarek...</p><p>Please...\"</p><p>He grimaced, his lips pulling back from his teeth in a savage snarl as he stared down at her in surprise.</p><p>\"Don't you know, Lyra?\" His smile was bittersweet. \"Don't you know just how much I do love you?\"</p><p>She would have smacked him, or at least yelled at him for saying it with such hopeless pain. But he chose that moment to begin pushing into her, stretching her snug muscles as he worked his cock inside her.</p><p>Fiery, agonizing heat filled her. The pleasure was lightning fast, flaring through every portion of her body as he rocked against her.</p><p>She felt him, inch by inch, sinking into her, just as he had taken her heart. Bit by bit, forcing her wide, searing her with not just the pleasure, but the sheer gentleness he used.</p><p>\"I would die for you,\" he whispered against her ear, hiding his expression against her neck as she convulsed around him, her hands locking in his hair. \"Don't you know, Lyra, I live for you now. For now and for always.\"</p><p>He surged through the final depths of her aching sex, pushing in fiercely before retreating with the same agonizing pace he had used to enter her.</p><p>\"Tarek.\" She bit his ear. He was making her wild, setting her heart aflame, sending her body into quaking shudders of pleasure. \"Just live for me,\" she gasped. \"Oh God.\" He thrust into her quickly, retreated slowly, stealing her breath, her thoughts. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Oh baby, I'm not nearly finished with you.\" His voice was so dark, so velvet-rough it nearly sent her into climax. Her womb convulsed; her breath caught in her throat as her clit swelled in nearing ecstasy.</p><p>He leaned back, his knees pressing into the couch as he draped her legs Over his thighs. His hands free, he lifted her against him, holding her to his chest as he stared into her shocked face.</p><p>\"Takeoff the shirt.\"</p> <p>His cock throbbed inside her. Her pussy was sucking at him with rapturous greed, and he was worried about her shirt?</p><p>\"Now.\" His voice hardened, his gaze turning stubborn. \"I won't give you what you need, Lyra, until you do.\" Her hands lowered from his neck, gripping the shirt and struggling to jerk it over her head as one hand gripped her buttock and lifted her several inches from the thick wedge of his cock. Then he released her, thrusting hard and deep inside her again as she whimpered in delirious need.</p><p>The shirt cleared her head, though she struggled to force it from her arms. Finally it was gone, her hands moving to his shoulders again, her legs tightening around his hips as she fought to force him to move inside her.</p><p>\"Tarek, I'm going to skin you alive if you keep torturing me.\" She knew the pitiful whimper in her voice didn't exactly carry the threat well. But he should know her well enough to know she would keep her word. Maybe.</p><p>He chuckled.</p> <p>\"Hold on. We're going to the bed.\"</p><p>\"The bed?\" Her eyes widened in horror as he moved easily from the couch.</p><p>She shuddered as his cock shifted with each movement.</p><p>\"I heard that last time,\" her strangled gasp nearly became a mewl of rapture as his cock began to fuck in and out of her with each step. \"Those steps...\" She moaned at the sensation of his movements inside her. \"Aren't so comfortable.\"</p><p>\"We'll make it.\" He sounded too confident. Too determined. Sweet Lord, he was going to kill her.</p><p>She swore he would. She knew he would.</p> <p>\"Oh God. Tarek. Tarek, I can't stand it,\" she was screaming his name as he began to take the steps with a heavy, quick stride.</p><p>His cock slammed inside her, taking her breath before retreating, rocking in, thrusting forcibly, then rocking inside her again.</p><p>Her nails dug into his shoulders, gasping, desperate cries fell from her lips as she tightened her legs around his hips and fought to hang on.</p><p>The first orgasm ripped through her on the sixth step. On the twelfth she was shuddering, jerking in his arms as the second stole her breath and her mind.</p><p>She was only barely aware of him actually making it to the bed, laying her back, and gripping her hips as he began to fuck her into a third, destructive climax.</p><p>She arched, her breath leaving her body in a rush as she felt his release tear through him then. The barb swelled forcibly from beneath the head of his cock, pressing into the delicate bundle of nerves that no man would have reached otherwise. It throbbed, caressed, and sent her flying into an orgasm that had no beginning and no end. It only had Tarek, holding her, his teeth scraping the wound he had left earlier before his teeth locked on it once again and dark oblivion overtook her.</p><p>\"I love you. Oh God, Tarek, I love you...\" Velvet darkness enclosed her as the words whispered free, her heart expanding as her soul seemed to lift, shudder, and open to accept a part of him that she knew even death could never steal.</p><p>Chapter Nine</p> <p>\"... I'm just tired, Dad. I had dinner out with a friend last night, and I have all this work backed up. I just think it would be best if you and the boys come over after all this rain lets up. You know how they mess up my kitchen when it's wet outside...\" Tarek listened to Lyra spin a song and dance to her father later the next evening that even he wouldn't have believed from her.</p><p>His sensual, sexual little mate was giving her father excuses that even he, who had no experience with parents, would never have tried.</p><p>What was it that made her think that delicate, sweet little voice was fooling anyone?</p><p>You're crazy! he mouthed slowly, ignoring her as she waved him away with a graceful little flip of her hand.</p><p>After two days of sex that should have killed him, in positions he hadn't tried in all his sexual lifetime, he was even prone to be fairly prejudiced in her favor. But the sweet, candycoated innocent tone had him rolling his eyes at her before giving her a fierce frown.</p><p>What? she mouthed back, shooting him an irritated glance before turning her attention back to the call she had made to her family.</p><p>Considering the fact her brothers were Special Forces, he doubted their father was dimwitted. Yet here was his independent, feisty mate, reclining naked in his bed with nothing but a sheet to cover her, weaving an excuse that had him wincing painfully.</p><p>Her silken hair was tangled around her flushed face, her blue eyes gleaming with irritation, and she had the nerve to sit there and attempt to put her father off in such a way. She was tired. She didn't feel like cooking. Her brothers made messes...</p><p>Give him a break. Hell, give him strength because he had a feeling the full fury of a father plus his sons would arrive on her doorstep, fouling the careful setup Braden had there to catch the Trainer.</p><p>\"Yes, Dad, I know how irked they get when they have to wait to do things, but my yard looks like a swamp right now, and they couldn't do anything even if they wanted to. They just want a free meal, and I'm busy.\"</p><p>She was pouting. Seriously pouting. What happened to the independent \"do it my way or no way\" woman he knew? He shook his head, pushing his fingers through his hair as he tried to think of ways to fix this before her family became his headache.</p><p>There was no stopping her. He sliced his hand across his throat, frowning at her warningly. To no effect. All he got was a glare in return.</p><p>That glare effectively hardened his cock. All she had to do was think about opposing him, and that stubborn flesh rose to rigid life. Dammit. She was wearing him out.</p><p>But what a way to go.</p><p>He would have grinned at the thought if she hadn't chosen that moment to tell daddy, in that sweet innocent tone, that she was going to work all evening.</p><p>It was enough to make him groan silently.</p><p>\"Yes, Dad, I promise I'm being careful and locking the doors and windows at night.\" The promise was made in an almost automatic tone. \"I promise, the only wild animals I'll let in are the four-legged variety. Not that I've seen any lately.\" She grinned cheekily at her words as she winked at Tarek. Insane woman! He snarled silently, mouthing the words to her as she rolled her eyes at him. Who did she think was believing this?</p><p>\"This isn't bread-baking day,\" she yawned after the muted sound of her father's deep voice stopped speaking. \"Besides, I'm busy. They can wait another day or two.\" She nestled deeper in the pillows, frowning as he watched her with almost morbid fascination.</p><p>She was actually convinced she was pulling this off. He could see it in her face. In her father's tone of voice, he heard another story. Not that he could hear the words, just the alert tone, the almost military crispness.</p><p>She was going to get him killed. His training was excellent, but three Special Forces of the caliber that had helped free the Breeds from the Council Trainers and soldiers wouldn't be in any way easy to defeat. Especially considering he couldn't exactly kill his mate's family.</p><p>\"Yes, Dad, I promise to rest, and I'll call you tomorrow,\" she answered in a placating tone that was so sickeningly sweet, it had him wondering if his dinner was going to stay down. He made a note to never be taken in by that tone of voice himself.</p><p>When she finally hung up the phone, he glared at her sternly.</p><p>\"I hope you are not convinced that you pulled that off,\" he growled furiously. \"We will now have your entire family ripping the neighborhood apart looking for you.\"</p><p>\"Don't be silly.\" She laughed at his prediction. \"They'll come here first. I don't think they entirely trust you. Something about not being able to find enough background information.\" She wiggled her finely arched brows suggestively. \"Have you been a bad boy, Tarek? Hiding records and such?\"</p><p>She shimmied beneath the sheet, bracing her hands on the mattress as she leaned closer to him, her eyes dancing with shimmering lights of amusement as she gave him a suggestive little smile.</p><p>\"Should I spank you for being bad now?\"</p><p>His brows snapped into a frown. He was ignoring the ache in his cock. He needed a shower and food or he was going to collapse in exhaustion.</p><p>\"You, I will spank later.\" He pointed his finger at her with determined emphasis. \"Someone needs to teach you better than to play such obvious games with men who know you much too well.\"</p><p>\"Yeah. Right.\" She had the nerve to laugh at him. \"I didn't he to him. He can see straight through my lies. Everything I said was the truth...\"</p><p>\"In a roundabout way,\" he grunted.</p><p>\"How do you think I managed to get out of his house?\" She plopped back against the pillow, the sheet falling away from her breasts and their hard, tempting nipples. \"But you can punish me now if you want to.\"</p><p>She was becoming much too confident in her ability to drive him completely insane.</p><p>Finally he just threw up his hands as he rose from the bed and stalked to the bathroom door. If he was going to have to fight her brothers, he didn't want to smell of sex when that happened.</p><p>\"I am taking a shower,\" he snapped. \"I have a feeling I might want to be prepared for the visit I will have to endure by your family. And you are a troublemaker, Lyra. This will come back and smack you on the ass one of these days.\"</p><p>\"Really?\" Interest lit her laughter-filled gaze. \"I bet it makes me wet.\"</p><p>He snorted. \"I have no doubt, you little hellion.\" And before his body could overrule his mind, he forced himself into the bathroom, closing the door behind him before he joined her in the bed again instead.</p><p>As he stepped beneath the steaming water, he made a note to contact Braden and warn him to be expecting trouble. He had a bad feeling that plenty of it was now heading his way. Lyra laughed as the bathroom door closed behind Tarek and let the warmth that teasing him brought her fill her heart. She loved the look on his face. For once, the shadows that normally lingered there were gone. In their place may have been irritation or incredulity, but she had seen the happiness there as well.</p><p>She made him happy.</p><p>She sighed at the thought, an odd satisfaction filling her. Making him happy shouldn't make her feel as though she were glowing from the inside out, but it did.</p><p>And it made her want to cook. Something really incredible. Something that would make that bit of confused happiness fill his eyes once again.</p><p>She had food. Finally. It had taken her hours last night to convince him to have someone deliver the basic kitchen products as well as some real meat, rather than that stuff he nuked every day.</p><p>Yuck. That was nasty stuff.</p><p>She shook her head, rising from the bed and pulling on her gown and robe as she ignored the tenderness between her thighs. That and the pulse of desire. She had a feeling that Mating Heat or not, she could forget her response to him ever dimming. He had made her wet the first time she laid eyes on him, and she had a feeling she would be wet for him on her deathbed.</p><p>She left the bedroom, padding quickly down the stairs to the wide foyer and turning into the kitchen.</p><p>She stopped abruptly. Her eyes widened, terror rushing through her system as her knees weakened.</p><p>\"Well, it looks like Tarek took a little mate,\" the intruder sneered, his weapon aimed at her heart. \"I bet the Council will have a lot of fun with this one. After we take her Lion out, of course. The only good Feline is a dead one.\"</p><p>Lyra turned to run only to slam into the hard body blocking her way. The contact sent pain streaking across her nerve endings, causing her to gasp in shock as she jerked away from the other intruder.</p><p>What now? Breathing roughly, she fought to hold back her fear, her eyes wide, as hard hands pushed her into a kitchen chair. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"He'll kill you.\" She clenched her fingers at her side, trying to think, to find a way to escape, to warn Tarek.</p><p>\"He might try. He'll fail. We were very careful this time. He won't even be able to smell us.\" Evil, malicious. The taller of the two men stared down at her curiously as he held the weapon on her. \"So tell me, what's it like to fuck an animal?\" Lyra swallowed tightly. \"Ask your wife.\"</p><p>He grunted at that, smiling mockingly. \"Doesn't matter.\" He shrugged. \"The scientists will get the answer.\" She had to warn Tarek.</p> <p>Her gaze flicked to the entrance of the kitchen. He would be finished soon, coming down the stairs, unaware of the danger awaiting him. Unable to smell the threat.</p><p>She swallowed tightly.</p><p>The Council had tortured him for most of his life, treated him like an animal, refused him even the most basic human considerations.</p><p>He had never eaten homemade bread. Had never drunk real coffee. He didn't know how to cook, but from what her brothers had said, many of the Breed labs had been dens of filth and neglect. Yet he kept his home sparkling, free of dust, and took off his shoes at the door. He was a man desperate to live, to be free. A man who knew how to love despite the horrors he had known.</p><p>And now these two thought they were going to use her to kill him?</p> <p>She couldn't, she wouldn't allow it.</p><p>He belonged to her now. He was her heart, her soul, and she couldn't imagine life without him. She would die without him. Think Lyra. Her eyes darted around her as the two watched her closely. Warn him. How could you warn him...</p><p>Smell. He could smell arousal. He could smell fear. Rather than tamping back the horror racing through her, the terror clogging her mind, she gave it free rein instead. She had to warn him...</p><p>Tarek stepped out of the shower, drying quickly before jerking clean sweatpants on and moving to the door to let Lyra know the shower was now free.</p><p>He stepped into the bedroom, frowning at the empty bed for a long second before his head raised slowly, a new, intrusive scent reaching his nostrils.</p><p>Fear.</p> <p>He could smell it, sharp, warning, riding the soft trail of Lyra's unique scent. But there was nothing else. No other smell drifting through the bedroom door to give him an idea of what awaited him downstairs.</p><p>She was his mate, and he could feel the danger surrounding her pulsing in the air.</p><p>He jerked the cell phone from beside the bed and keyed in the alert for trouble before tossing the device to the mattress and striding to the chest of drawers.</p><p>He pulled one of the smaller weapons from the drawer before stripping the adhesive backing from the light, skinadhering holster. Smacking it to the side of the gun, he anchored the weapon in the small of his back before pulling on his shirt.</p><p>He grabbed the spare gun from the top of the chest and checked the ammo before moving for the doorway.</p><p>Pausing, he listened carefully. There were no lights on, but he didn't need any. And he didn't know who or what was downstairs, but it wasn't a Breed. There wasn't a chance in hell a Breed could disguise his scent so effectively. But sometimes, rarely, certain humans could.</p><p>Trainers knew how. It was hard, at times nearly impossible, but it could be done.</p><p>As he moved to the stairs he inhaled carefully. He smelled no Breed or human scent other than Lyra's and her fear. It was overwhelming, imperative. But alongside it was a curiously hollow sterile scent. As though something had been cleaned. And another, not quite as crisp, as though something were bleeding away whatever had been used to disguise the evil that filled it.</p> <p>A cold snarl shaped his lips.</p><p>There were two, and one of them was nervous, wary.</p><p>Perhaps not quite as certain as the other. That one was weak. He would make a mistake.</p><p>As Tarek started down the stairs, he laid the extra weapon on a step, close enough to jump and retrieve if he needed it. If he went in armed, they would know he had been aware of them, and they would search him, using Lyra to keep him in place while they took the hidden weapon.</p><p>\"Lyra, you left the lights out,\" he called out as he stepped into the foyer. \"No more of your games now. Where are you?\" He kept his voice teasing, taunting as he moved to the kitchen where her scent was strongest. He stopped at the entrance, placing his hands on his hips as he surveyed the scene.</p><p>Everything inside him clenched with fear as he fought to present a casual attitude. He could feel the growl growing in his chest, his jaw clenching with the need to taste blood. The two men stood on each side of her, one with his weapon lying threateningly against her temple. She didn't make a sound, but he could see the tears shimmering on her face, her lips moving.</p><p>I'm so sorry...</p><p>\"Well, I admit, Tarek, I hadn't thought it really possible.\" Anton Creighton shook his head as he made a clucking sound.</p><p>\"And to find you so careless. Your Trainers were sloppier than I had thought them to be during your stay at the labs.\" Cold, steel-gray eyes stared out of a pale face. A black cap covered his blond hair, but Tarek remembered the color well. His broad, heavily muscled body appeared relaxed, but Tarek could see the tension in it. The other man wasn't nearly as confident as he appeared to be.</p><p>And his partner was terrified.</p><p>\"The stink of your man is starting to bleed through whatever you used to cover him,\" he informed Creighton coolly. \"He's scared.\"</p><p>Creighton's eyes narrowed as Tarek refused to rise to his prodding. His gaze flickered to the other man.</p><p>\"Good help is so hard to come by.\" He smiled coldly. \"But he did well enough to keep you from detecting us until the time was right.\"</p><p>Tarek nodded with all signs of absent attention as he glanced at Lyra.</p><p>\"So what do you boys want tonight?\" he asked, keeping his voice measured, nonthreatening.</p><p>He knew Creighton better than the other man thought he did. He was easy to play with, maneuverable to a small degree, and living on a prayer as he fought to escape both Breeds and Council soldiers.</p><p>Creighton was basically a coward. When the labs were attacked by government and independent forces to rescue the Breeds held there, he had deserted the fight rather than risking capture. He was considered a criminal to both sides now.</p><p>\"Just the girl.\" Creighton shrugged dismissively. \"As soon as I dispose of you, I can use her for a little trade. You should have stayed off my ass, Tarek. But because you're so persistent, I'll take care of you now and ensure my return to the Council ranks with your pretty little mate.\"</p><p>\"The Council is disbanded, Creighton.\" Tarek watched him pityingly. \"There's no one to trade with.\" A rich chuckle filled the air.</p><p>\"You really believe that, Tarek?\" he asked, shaking his head.</p><p>\"No need to worry, Lion-boy. They're still there. Tucked away nice and safe, but there all the same.\"</p><p>\"Shut up, Creighton,\" his partner hissed. \"Kill him and be done with it.\"</p><p>Lyra flinched, her gaze turning wild at the demand. Damn. She was the wild card, not these two bastards. And there wasn't a damn thing he could do but pray her common sense won out.</p><p>\"Your boy is a little impatient, Creighton.\" Tarek mocked as he leaned against the doorframe, crossing his arms over his chest as he watched them. \"A little bossy, too, isn't he?\" Creighton's ego was legendary.</p><p>\"Shut up, Tim,\" he snapped. \"I have him under control.\"</p><p>\"You sure he's not a Coyote?\" Tarek nodded to good old Tim, with his washed-out hazel eyes filled with fear and lanky dark brown hair. \"He shakes like one.\"</p><p>Creighton's chuckle was mocking, grating on Tarek's nerves as the barrel of his gun slid against Lyra's temple in a cold caress.</p><p>\"He'll do,\" Creighton assured him as he stared back coldly.</p><p>\"Unfortunately, there's no bounty on your head. But I guess I'm going to have to kill you anyway. If you had just let me be, boy, I would have done the same.\" He shook his head in mock regret.</p><p>\"Some Breeds never learn though.\"</p><p>Just a little more. Just a few more seconds.</p><p>He could smell Braden and another Breed at the back door. But he could also smell the overwhelming scent of fury at the front door. Human fury. A father's fury.</p><p>Shit.</p><p>\"This was really a bad time to come calling, Creighton.\" Tarek shook his head, almost feeling sorry for the other man now. \"It's bread night, you know.\"</p><p>He glanced at Lyra, praying she would get the message. She blinked, amazement and a surge of renewed fear glittering in her eyes.</p><p>\"Bread night?\" Creighton stared at him in confusion. \"What does bread have to do with anything? Has freedom rotted your brain?\"</p><p>\"Sadly, for you, I believe it may have.\"</p><p>The back door splintered as the house alarm began blaring. Lyra, bless her sweet heart, was no one's fool. Before Creighton could stop her, she threw herself to the floor, rolling beneath the table as her feet kicked out at Tim's knees as Tarek dropped, whipped the gun from his back, and fired back at the Trainer. The front door exploded as Creighton went down and Tarek threw himself beneath the kitchen table, his body covering Lyra's as he left the other man for Braden and whoever the hell was screaming bloody-assed murder to take care of.</p><p>\"I told you it wasn't going to work. You can't play with men who know you so well, Lyra,\" he growled, reminding her of his warning as she spoke to her father earlier. He pulled her deeper beneath the table, forcing her behind him, sheltering her between his body and the wall as she struggled to push him away.</p><p>Braden and Jonas were on the floor, weapons raised ready, as three well-trained Navy SEALs burst into the room, weapons drawn, murder glowing in their eyes.</p><p>\"Dammit, Tarek, let me go before they destroy the house,\" Lyra yelled at his ear. \"They'll tear it apart.\"</p><p>\"Better the house than me,\" he grunted, holding her in place as the black-clad figures halted at the table, followed by a set of legs clad in jeans.</p><p>The father.</p><p>Hell.</p><p>\"Look, I like this house better than mine.\" She smacked his shoulder before putting her knees into his back and pushing.</p><p>\"And they're going to ruin it.\"</p><p>\"Dammit, stay in place, woman,\" he snarled. \"I can rebuild the house, and as I can't kill the bastards because of you, I'd really prefer to stay out of harm's way. If it's all the same to you,\" he snarled mockingly.</p><p>\"Moron.\"</p><p>\"Brat.\"</p><p>\"Well, at least she's alive,\" a mocking voice drawled as three Navy SEALs hunkered down to stare beneath the table. Eyes amazingly similar to Lyra's stared back at him. They quickly took in the fact that he wasn't about to let her move just yet, and she was fairly content to be where she was, insults notwithstanding.</p><p>\"You can't shoot my future husband.\" She finally managed to wiggle past him.</p><p>Heaving a sigh, Tarek glanced across the floor as Braden came slowly to his feet.</p><p>\"Are those assholes bleeding on my kitchen floor?\" Lyra was out from under the table just ahead of him, facing her brothers, hands on her hips. \"Why are they bleeding on my floor?\"</p><p>\"Blame your boyfriend under there.\" The broadest of the four men faced her squarely, his black head lowered to snarl back at her, anger lighting his eyes. \"He shot them. We didn't. And since when the hell is this your house?\"</p><p>\"Since I said it was.\" Tarek pulled her back, his instincts flaring at the other man's fury toward his mate. This was not acceptable.</p><p>\"And who the hell are you?\" Violence raged in the brother's expression. A violence he could damned well direct somewhere other than toward Lyra.</p><p>\"Her mate...\" His cold smile didn't go over any better than his announcement.</p><p>Pandemonium ensued.</p><p>Chapter Ten</p><p>\"I can't believe you actually got into a fist fight with my brother.\" Lyra's expression was none too pleased later that night as she stood before him, inspecting the black eye and split lip he had gained from the effort. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Neither can I,\" he grunted, wincing as she pressed the alcohol pad she held to the abrasion on his cheek. \"It was wasted effort. You, Lyra, are a troublemaker. I've seen this tonight.\"</p><p>\"Me?\" She drew back, her eyes innocently wide as she stared back at him in surprise. \"What did I do?\"</p><p>\"You antagonize your brothers.\" He caught her hips as she attempted to move from the bed where he sat. \"You deliberately challenge their authority and continually keep them in a state of combat-readiness. That fight was your fault. Had you been a bit more forthcoming, as I encouraged you to be on the phone, they would not have charged in, determined to protect your honor.\" Her lips twitched. The little hellion.</p><p>\"If you had stayed out of it, there wouldn't have been a fight.\" She braced her hands on his shoulders to hold him back from licking once again at the scratch she had somehow gained from the night's adventures.</p><p>The red mark extended from her shoulder, past her</p><p>collarbone, and although the sting was irritating, it was nothing compared to the fires burning in the rest of her body.</p><p>\"No man gives you orders but me,\" he grunted at being denied access to her sweet flesh. He deserved something in reward for the aches and pains echoing beneath his flesh.</p><p>\"You don't give me orders, either,\" she informed him imperiously. \"What is it with you guys that you think you can?\" He sighed wearily, seeing his life stretching out ahead of him, constantly amazed or exasperated at one small woman. Not that he wasn't looking forward to it. But Lyra had a habit of antagonizing her brothers where perhaps she should be less confrontational.</p><p>He was definitely going to have to talk to them alone in regards to this. She seemed to enjoy keeping them upset.</p><p>\"The fact that you can so easily get into trouble?\" He arched his brow mockingly. \"Lyra, sweetheart, after discussing this with your brothers, I'm certain you are a trouble magnet.\" The fight had been a damned good one. Clean, brutal, fists flying, and curses raging as he and Grant, her oldest brother, proceeded to destroy the kitchen.</p><p>When they finished, Lyra had stomped to the bedroom to pout while they agreed to a beer and a heated argument on whether or not Lyra would stay with him.</p><p>Not that there was a question of it as far as he was concerned, but in the eyes of her family, he had seen their love for her, and their fears. He wasn't exactly the boy next door. He was a Breed, and he had just nearly gotten her killed. It would be enough to terrify a brother who had accepted responsibility for his headstrong sibling.</p><p>And they seemed to accept him and his ability to protect her. Most men would have been hesitant. Thankfully, the</p><p>prejudices against the Breeds were absent in the Mason family, due to the fact that her three brothers had been instrumental in the rescues of many of the Breed captives.</p><p>He pulled her to him then, his chest tightening at the memory of Creighton's gun caressing her temple, the bullet much too close to extinguishing the fire that warmed everyone she touched. How could he endure life without her now?</p><p>\"You didn't have to fight them.\" She leaned against him, her slender body flowing easily against him as he lifted her to straddle his lap, his arms wrapping tight around her back as his lips lowered to the mark he had left on her shoulder. \"I had them under control.\"</p><p>\"You had them in cardiac arrest,\" he sighed. \"Your poor father will never be the same.\"</p><p>Lyle Mason, the father in question, had been most</p><p>determined to take his daughter home, to wrap her in the protection he felt only he could provide. He had been a man tormented with thoughts of losing the daughter he so obviously adored.</p><p>Not that Tarek understood the family dynamics, but he understood the need to protect, the need to love the tiny woman he held in his arms. She was his light. His world. She could be nothing less to anyone who loved her.</p><p>He pressed her tighter against him, feeling her rock against the erection straining beneath his soft pants, dampening the material with the damp heat of her pussy.</p><p>She wasn't wearing panties beneath her gown. His hands smoothed down the material until he caught the hem and lifted it, his hands gripping her smooth, bare ass.</p> <p>A moan locked in his throat at the feel of her sliding against him, her breathing deepening, the scent of her heat filling the room.</p><p>\"Don't leave me, Lyra.\" He couldn't stop the words from slipping past his lips as he held on to her, lifting her, laying her back to the bed as he rose above her.</p><p>\"I have no intention of leaving you, Tarek.\" Her eyes were glowing with emotion, with hunger. \"I told you, I love you. And I don't say that lightly. Not to anyone.\"</p><p>He touched her cheek, his throat tightening as he fought past the confusion, the disbelief that this woman could love him. That God, in all his bountiful mercy, had finally adopted him and given him this gift he never thought he could have. Something, someone, to always call his own.</p><p>\"The next time you start a fight with your brothers, I will spank you, though,\" he growled as her head raised, her lips finding the hardened nub of his nipple as she nipped at it playfully.</p><p>\"Sounds like fun. How many fights are we talking about before I get my just desserts?\"</p><p>He moaned as her fingernails raked down his abdomen before her fingers hooked in the waistband of his sweatpants and began to lower them slowly.</p><p>\"You are a hellion,\" he breathed out roughly as he moved from the bed and stripped quickly.</p><p>Her gown went flying past him as he shucked his pants. When he straightened, there she was, on her hands and knees, her tongue reaching out to lick the bulging head of his cock. Her black hair fanned around her face, her blue eyes glowing with emotion and hunger. They were as brilliant as the brightest, purest sapphire, and more precious than gold to him. Her pink little tongue flickered over the crest of his erection again, leaving a trail of fire around the sensitive hood as he tensed at the pleasure shooting from his cock to every other nerve ending in his body. He didn't think pleasure could get any better—until her lips parted, her heated mouth opening to accept the head of his cock into the damp depths.</p><p>Tarek watched as the flushed, straining crest of his erection disappeared between her lips, her tongue stroking the underside with such incredible pleasure he wondered if he could bear it.</p><p>His hands tangled in her hair, clenching tight as a strangled growl filled his chest, escaping his lips as she began to suck him with hungry abandon.</p><p>Her movements were hesitant, innocent.</p><p>She was killing him.</p><p>She stared up at him, laughter and arousal gleaming in her gaze as her tongue stroked, her mouth drawing on him, her wicked hand moving slowly up his thigh until she cupped his balls with silken fingers and destructive pleasure.</p><p>\"Brat,\" he groaned, fighting for breath. For control. His tongue was throbbing like a toothache, the need to spill the excess hormone into her mouth making him wild. He could taste the spice, feel its effect on him, feel his cock tightening further, the need to release becoming a near-agonizing pleasure.</p><p>And still her mouth moved on him. Slow, delicate licks, deep, drawing caresses until a purely animalistic growl erupted from him.</p><p>Tarek tightened his hands in her hair, pulling her back as he felt the pulse of the barb just beneath the hood of his cock.</p><p>\"Enough.\"</p><p>\"Hmm. I'm hungry.\" She licked her lips sensually, full, swollen lips. \"Maybe I want more.\"</p><p>She laughed, a low, sweet sound, as he pushed her back to the bed, spreading her thighs as he lowered his shoulders between them.</p><p>There was no time for preliminaries. He had to taste her. Sample the delicate liquid silk of her pussy before he went insane. Or kissed her.</p><p>If he kissed her, there would be no waiting. He was riding too close to the edge, her own hunger rising so quickly the scent of it was going to his head.</p><p>\"I'm going to eat you up,\" he groaned a second before licking through the bare, syrup-laden silk of her intimate folds. \"Every inch of you, Lyra. Until the taste of you permeates every fiber of my senses.\"</p><p>She breathed in roughly, the flesh of her tummy convulsing as he watched it with narrowed eyes. He could see so much there. Each ripple of creamy flesh corresponding with the level of her arousal.</p><p>His tongue circled her clit before he drew it between his lips, watching as her stomach seemed to convulse. As he suckled at her, he moved his fingers to the drenched folds of her pussy, opening her farther until he could work a finger inside the hot depths.</p><p>She jerked against him, her hips writhing, pressing closer to the penetration as her creamy juices began to flow.</p><p>\"Oh God, Tarek, you're making me crazy,\" she cried out desperately, her vagina rippling around his finger. \"Stop torturing me like this.\"</p><p>He hummed his pleasure of her taste. Sweet. Addictive. He pushed her closer to the edge of her release, his finger thrusting deeply inside her, caressing the responsive depths as she lifted to him.</p><p>\"Tease.\" Her rough accusation was thick with her pleasure.</p><p>\"Fuck me, Tarek. Don't make me have to kill you.\" He would have smiled if he weren't so consumed by the hunger for her.</p><p>\"Tarek...\" Her half-scream was followed by the tightening of her pussy around his finger, her tummy tightening. \"You'll pay for this.\" Her knees bent, her feet pressing into the mattress as she lifted closer. \"I swear I'll make you pay...\" He gave her what she needed. Adding another finger to the snug depths of her cunt, he began to pump them inside her using his lips, his tongue, the suction of his mouth to drive her higher, to send her into fragmented explosions of ecstasy. She arched to him, crying out his name as he quickly rose above her, lifting her, pressing his cock into the convulsing tissue of her pussy as he gritted his teeth against the pleasure. She was so tight. So hot.</p><p>Liquid silk. Lava-hot cream.</p><p>He gripped her hip with one hand, lowering his weight to the elbow of his opposite arm as he felt her legs wrap around him.</p><p>Her pussy flexed around him, tiny flutters of sensation, tight, rippling caresses washing over his erection as he worked it into her, first short, desperate thrusts and then hard lunges as he began to fuck her with all the strength and desperation of the hunger surging inside him.</p><p>His lips lowered to hers, his tongue spearing into her mouth as she moved beneath him, opening for him, taking him with strangled screams and ever-tightening ripples of her responsive pussy.</p><p>She was ecstasy. She was life.</p><p>The tempo of his thrusts increased as the hormone surged from his' tongue to her system, heating them both further, sending them rushing headlong into orgasm.</p><p>As he felt his release tightening his balls, the extension beneath the hood of his cock began to engorge, becoming firmly, heatedly erect and locking him tight inside. Violent shudders shook her as her arms tightened around his neck, her head turning as his lips unerringly found the mark that branded her as his mate as he began to flood her with his semen.</p><p>Shocking, violent pleasure. A bonding unlike anything he could have known. And Lyra. Always Lyra. The center of his life.</p><p>\"Oh God. Tell me that barb thing does not go away with the heat,\" she gasped when they found the sanity to breathe. \"I wouldn't be pleased.\"</p><p>\"I guess you'd have to hurt me?\" He chuckled weakly as he rolled to his side, pulling her against his chest as he sighed in contentment.</p><p>\"I'd have to hurt you bad.\" She sighed.</p><p>\"But you'd still love me.\" She'd better.</p><p>\"I'll always love you.\" She nipped at his chest before leaning her head back to smile up at him mistily. \"Always, Tarek. You might not be the boy next door, but the Breed next door works much better.\"</p><p>Their laughter was soft, content. His soul was fulfilled. He wasn't completely human. But neither was he an animal. He was a Breed, a Breed who had found his mate, and his life. </p> </body></html>"]