["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>PROLOGUE</p><p>Everyone has a secret.</p><p>Some people will do anything to protect it.</p><p>I’m practically giddy with excitement as that dream is within grasp. I’m sitting across from Sophia Sottero. She’s an amazing wedding photographer for the affluent families of New York. In a nutshell, she is everything I want to be, and meeting her in the flesh is so overwhelming I can barely contain myself. I try not to squirm in my seat as her gaze slides over my resume.</p> <p>Sophia is in her early forties with jet-black hair that is smoothed into a neat chignon at the base of her neck. A slender, black suit showcases her figure perfectly and makes her look regal at the same time. I hold my hands in my lap, trying hard not to fidget. The smile that lines my lips is making my face hurt, but I can’t stop. A tiny voice inside my mind squeals with excitement.</p><p>Sophia glances up at me, “Tell me, Miss Lamore, why do you want to work at Sottero?”</p><p>Beaming, I reply, “Sottero is the most prestigious photography studio in New York City. The style your shooters attain is breathtaking.” My hand clutches my racing heart. It’s true. And with every fiber of my being I want to learn what she knows. “Everything about your studio makes me want to be a part of it. It’s not only the soaring reputation, but also what you do for each and every bride who comes here.”</p><p>“And what is that?”</p><p>“You make them feel like the most beautiful woman alive. For that entire day, each bride knows she’s flawless. You don’t just give them photographs, Ms. Sottero, you capture their dreams and freeze them in time. It takes heart and skill to do something like that, which is why I would love to have my internship here.”</p> <p>Sophia’s gaze lowers to my resume as I’m speaking. When I’m done talking, her dark eyes lift to meet mine, “May I ask where else you applied?”</p><p>Normally I would figure out a way to dodge that question, but I want this job so much. I smile calmly and tell the truth, “Couture and Le Femme.”</p><p>A dark brow lifts when I say Le Femme. She places my papers on her desk and leans forward, “Le Femme? Really? What on earth made you apply there?”</p><p>“The University requires a minimum of three interviews, and we are supposed to diversify the positions we are looking at. They think it gives us a better footing post-graduation.” I practiced this response before I came. Anyone who finds out that I have an interview at Le Femme won’t take me seriously. It’s a blight on a pristine resume and an excellent grade point average.</p><p>Sophia tilts her head, like that is the most ridiculous thing she’s ever heard. She points a perfectly manicured nail on the shiny desktop. “Listen, Anna. Let me do you a favor. I realize the kind of hoops you have to jump through to get your diploma, and the interview at Le Femme is just a waste of time. Cole Stevens is blight on the industry. His work is trash, and any aspiring young photographer should steer clear of him. I know it’s a necessary evil, so I’ll tell you how to end the interview quick and easy. Go in there and act confident to the point of cocky. Wear something that you should never wear to an interview and they’ll show you the door before you even sit down... Unless?” She lets the question hang in the air.</p><p>“Unless what?”</p> <p>“Unless you want to work for Cole Stevens,” Sophia says with distaste, as she leans back in her chair. Although she’s trying to hide it, Sophia’s become tense since we started talking about Le Femme. I can’t tell if she just hates what the studio does, or if it’s more personal than that. She watches me for a moment, taking in my reaction.</p><p>I visibly shudder when she suggests such a thing. “I have no intention of working for Cole Stevens, Ms. Sottero. That interview is a means to an end. I want the internship here with Sottero. I’ll be the best intern you’ve ever had because I want to be here.”</p><p>“It’s a dream?”</p><p>“It’s more than a dream,” I say leaning forward in my chair. “Sottero is the place where dreams and reality collide. And somehow you figured out how to capture those moments in photographs that are too stunning for words. Forgive me for being blunt, Ms. Sottero, but I admire your work, your studio, and everything you stand for. If I was given the opportunity to learn from you I know it would give me a secure footing in a difficult industry.”</p><p>We speak for a little longer. I don’t fumble anything. Sophia appears to genuinely like me. As she walks me out, the older woman shakes my hand and says, “I think you’ll do well here, Miss Lamore. Contact me after your interview with Le Femme and we’ll see what we can work out.”</p><p>A grin spreads across my face. I shake her hand too long and too hard, but I don’t care. My dream job is sitting in the palm of my hand. The only thing left to do is finish up with Le Femme to satisfy the University’s requirements and then I’ll have an internship at Sottero!</p><p>CHAPTER 1</p><p>Sunlight pours through the slats in the blinds, forming narrow bars of light. I blink once, clearing the sleep from my eyes. Nerves don’t slither through my body the way they had yesterday. Today is different. Butterflies don’t erupt in my stomach and threaten to fly out my nose. My tongue isn’t dry and tangled. There is no frantic pounding in my chest. Not today. A slow grin spreads across my face as I stretch. Today is a means to an end.</p> <p>After showering quickly, I slap on the outfit I selected the night before. Without glancing in the mirror, I head into the kitchen. The apartment is quiet. It’s Saturday and Emma is still asleep. At least I thought she was.</p><p>“Anna, what the hell are you wearing?” she asks groggily. My roommate is in the hallway, halfway into the bathroom. She stops and stares at me. A tattered robe clings to her narrow figure. Black hair is frizzed around her face, completely flat on one side. In a few hours, she’ll look like a model. It’s been like that since we started college. Emma is the hot one, and I’m “the hot girl’s friend.” Emma blinks several times, like her big blue eyes are broken. “Don’t you have an interview?”</p><p>I nod, grabbing an apple from the kitchen counter. As I sling my bag over my shoulder, I grab my keys and head toward the door, “All part of the plan.”</p><p>She doesn’t have time to respond before I’m out the front door, which is good because I would have lost my nerve. The entire time I’ve known Emma she has never let me escape unquestioned. I know she’ll pelt me with questions as soon as I get home. It makes sense that she’s a mass communication major. When she gets a job as a reporter, I know she’ll be good at it. Questioning people is in her DNA, and my outfit was sure to raise questions.</p><p>Sophia mentioned that she worked with Cole Stevens at one point and divulged some pet-peeves of his that will promptly end my interview. After the third interview is complete, only then can I get hired. University requirements.</p><p>I run down the stairs toward the street. Our apartment is a fourth floor walk-up, standard shoe-box-sized so that no one in their right mind would want to stay any longer than necessary. Emma and I rented it two years ago when we started graduate school.</p><p>Breakfast on the go isn’t a part of my ideal morning. Actually, getting up at the crack of dawn on a Saturday isn’t even sane, but this is the time slot I needed, the one where the interviewer is so tired that she needs to prop her head up with coffee mugs. Besides, who puts business meetings on Saturday morning at 7:00am? That makes this the worst interview time possible.</p><p>It’s just a formality, Anna, I tell myself. The past week has made me a jittery mess. The internship matters. The placements can mean getting a good job after college, and I need to be the best in my field to get anywhere in this field. Choosing the arts was insane enough, but being a photographer was even crazier. Everyone and their dog own a camera and claim to be awesome. Botching the internships could mean I’ll have to be some schlep trying to find work on Craig’s List, and I have sworn that won’t be me. Photography is art and I’m an artist.</p><p>Ambition got me this far. The rest of was guts.</p><p>My position with Sottero is cinched. I just have to finish this last task before I can take it. I stare straight ahead as I round the corner and descend underground to the subway. The air smells like burnt pretzels and blows my hair gently. I breathe deeply, relaxed—confident. When I went to my interview with Sophia Sottero, I was a mess. My palms were sweaty and I could barely stand still as the train clunked along the tracks. The same scenario occurred for my interview with Couture. Both are outstanding studios run by women that I admire. I want the internship with Sottero so badly. Couture is my fallback, and Le Femme—I can’t imagine the person who wants an internship at Le Femme. Probably some perv-with-a-camera like the infamous owner, Cole Stevens. Now, that isn’t totally accurate. The man has to have some talent to shoot high-end lingerie on nearly naked models. One of those barely-there panties costs more than my grocery bill. It isn’t my thing, but like I said—three is the magic number and this is my third interview—the one I don’t care about.</p><p>Glancing around, I notice that the subway is relatively empty, which is normal for New York on a Saturday morning. That’s the only bonus to the early interview time—I didn’t have to get up at 5:00am. I switch trains a few times and walk up into the sunlight. Structures of glass and steel tower above my head, but I don’t look up. New Yorkers never look up. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Checking my watch, I hasten my pace. Although I don’t want this job, the University still checks to make sure I apply myself, which means at least showing up on time. I find the building and exit the elevator onto the seventieth floor. A silver plaque hangs on a dark door: LE FEMME STUDIOS.</p><p>CHAPTER 2</p><p>I push through the door and step into a quiet office. I stop in my tracks. There is no one here. No receptionist. No employees. Turning, I look around the room slowly. Large portraits of Stevens’ work line the pale blue walls. All the surfaces—the desk and coffee tables—are pale blue glass. A to-die-for view of the Manhattan skyline fills the windows that line one wall. It’s a sight that costs a fortune, a clear status symbol to anyone who walks through the door.</p><p>I step further into the room, “Hello?” My voice doesn’t really come out. Why am I whispering? “Is anyone here?” I pad across to the window after looking over my shoulder. Convinced I am alone for the moment, I scan the city far below, and rest my fingers against the pane. “This must look amazing at night,” I mumble to myself.</p> <p>“It does.” Startled by the male voice, I jump. My heart ratchets up a notch when I see that Cole Stevens is the one standing behind me, looking over my shoulder. He smiles down at me like my reaction was funny. He is older, close to forty, but you’d never think it by looking at him. Everything from his bone structure to his stance screams model. He has the kind of confidence that comes from a lifetime supply of money, and the designer clothes to match. Dark jeans cling to his narrow hips, topped by a white linen shirt that’s rolled up to his elbows. The top button is undone. Cole’s dark hair has that carefully messy look.</p><p>The man is famous, sexy, powerful—he’s also everything I detest. He spent the last fifteen years of his life making his name, but he did it on the back of his father’s fortune. I pay for college myself. There is a permanent rift between me and people like him, people who have had everything handed to them. That’s part of the reason I don’t want to work for Le Femme. Aspirations of being a wedding photographer for the affluent have been running through my veins for years. The idea of capturing a woman on the most important day of her life appeals to me much more than this fettishography kind of stuff that Cole shoots.</p><p>Cole’s hands are in his pockets, his blue eyes assessing me and my outfit. He seems like he’s been up for hours. He must be a morning person. That would make working with him even worse. People who thrive at 5:00am are freaks. Unlike me, dressed to impress.</p><p>Pressing my lips together, I peel my hand off my blouse and act like I was just brushing off a speck of lint. Confused, I look past him. I thought his assistant was doing the interviews. People like Cole don’t bother with college interns. Shaking off the shock of seeing him in the flesh, I introduce myself. “I’m Anna Lamore. I have an internship interview at seven.”</p><p>He pulls a hand out of his pocket, extending it to me. His shake is confident, his hand warm. “Cole Stevens. No one is here this early since its Saturday.”</p> <p>His smile is kind, and it isn’t until now that I really look at his face. There are tiny wrinkles that line the corners of his mouth, like he smiles often. Taking his hand, I shake it and nod. His grip is gentle, but firm. Something about him sets me off kilter. Butterflies erupt in my stomach and I don’t know why. When he ends the handshake, Cole glances at me once more and turns away—gesturing for me to follow. I take in the posh offices as we walk down a long hall.</p><p>“Welcome to Le Femme,” he says. The casual tone of his voice makes me think his head isn’t as big as the media says. “As you know we are the world’s premiere boudoir studio, predominately shooting lingerie accounts for swank designers. We do everything in-house, from selecting models to make-up and postproduction. Nothing is out-sourced,” he stops and holds open a glass door. His hand flicks on the lights and we sit at a huge wooden conference table. This room has a much warmer feel than the waiting area at the front. Walking past him, I catch his scent. It’s a light clean fragrance. His eyes are on me as I pass, no doubt studying my absurd outfit.</p><p>I slide into a seat and lean back, steepling my fingers like I’m plotting to take over the world and smile at him. Cole tells me more about the company he created as I tap my fingertips together, trying to muster the guts to finish doing the things Sophia suggested so I can put this interview to rest quickly.</p><p>“The internship is a prestigious position, Miss Lamore. Many students compete to get it, and there is only one position. An internship here gives you access to employment with the company when you’re done. Correct me if I’m wrong, but you’re at the top of your class.”</p><p>His fingers tap the top of the table as he stops speaking. Cole’s gaze slides over my face, the slouch of my shoulders, and then drifts to my jeans that are rolled up to my knees, showcasing striped rainbow knee-highs. Sparkling yellow Chucks are on my feet. They match the tutu around my waist. His eyebrows creep up his face before he looks back up at me. I’m not certain if he’s questioning the data or stating that he can’t believe it from the sight of me. I should have been dressed in a suit. If I was brave and wanted this internship, I would have worn some fashionable business attire with a snazzy flare. But I’m dressed like a bedazzled circus clown. I had to make sure I don’t have any chance of getting this job, and showing up dressed like this would ensure it even if I did take Sophia’s suggestion a little too far.</p><p>Smiling, I nod, “Yeah,” my fingers tap on the table top, strumming like his. He notices the mirrored movement, and his eyes flick to my hand before returning to my face. “I’m the top in my class.” Silence fills the air before Cole finally speaks again. My manners are intentionally horrible. He notices my lack of proper decorum, my utter indifference. It’s screaming through my body language even when I’m not speaking.</p> <p>Cole’s gaze narrows. The look he gives me is irritating. It’s smug, like he knows what I’m up to. Leaning back in his chair, he folds his arms over his chest. For an old guy, he’s pretty chiseled. “Let’s cut to the chase, Miss Lamore. I don’t normally do the intern interviews. Your resume looks the same as a hundred others. Your work demonstrates potential, but it’s nothing phenomenal.” He pauses, taking in my reaction.</p><p>I’m surprised at his candor, but don’t react. I don’t want this job, I remind myself. I have nothing to prove to him. I don’t care if he thinks I suck. I know better. I know Sophia Sottero was excited when she met me. I know I want that internship and not this one.</p><p>Cole leans forward, “The reason I wanted to meet you, the reason you caught my attention, was because you chose the worst interview time we offer... ” He grins at me, and leans back into his chair again. “It implies that you wanted this position very much.”</p><p>I shrug, folding my arms, mirroring him again, “It was the only slot left.” The lie slips easily off my tongue.</p><p>“No, it wasn’t,” he replies, leaning forward, calling me on the lie. There’s a gleam in his eye that wasn’t there before, like hot curiosity igniting a match-tip. His gaze is intense, and I can’t help but squirm when he looks at me like that. “You were the first person to sign up. So tell me something, Anna, if you would—“ he looks down at the ring on his index finger and then back up at me, “why did you wake up at the crack of dawn to come to see me? Why do you want to work for Le Femme?”</p><p>His words say one thing, but his tone says something else. It’s a dare, a challenge almost, to continue with my plan. My pulse is racing. I march ahead with my idea, muttering things that Sophia assured would get me tossed out. Ignoring that gaze of his, I lower my eyes and pick at my nail polish while I speak, “Well, Le Femme has been around for a while. I mean, the company itself was formed nearly two decades ago. I mean, you’re not a fly-by-night studio, so that’s appealing. But, you’re not ridiculously old, either.” I flick my nail and a piece of red polish flutters to the carpet. I continue speaking, watching it fall, “It’s not like you’ve never seen a digital camera and insist on using an ancient Brownie or something crazy like that.” Immediately, I want to laugh and shirk off the nerves that are spilling down my spine like ice water, but I can’t.</p><p>“Thanks,” he says, smirking at me, his eyes shifting to my fingers as I pick and flick. When the piece of polish lands on the carpet, we look up at the same time. “I’m thirty-eight by the way</p><p>I’m not old, he means, I have a lot I could teach you.</p> <p>“Yeah,” I clear my throat and lean forward. I’m tactless, crass, and rude. Everything he wouldn’t want, yet he is looking at me like there is nothing he wants more. That gleam in his eye tells me that something is off. I redirect, trying to offend him, “Like I said, not that old.” I pat his knee like he’s a geriatric patient who got lost in the mall parking lot and lean closer, speaking a little too loudly, “I know things are changing fast and that’s why interns are good—they’re young and can help older people in our industry with shifting trends.” I wink at him and lean back in my seat. My heart is pounding in my chest. It’s the most brazen thing I’ve ever said to someone’s face. I slammed his age, ability, and company in one breath. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Really?” his expression is hard to read. Leaning back, he steeples his fingers and taps them one at a time, his eyes never leaving mine. The room fades away and the only thing I can see are his eyes, dark as sapphires, and glinting like he’s amused—or pissed—I can’t tell which one. Damn it. Why does he hide his reactions so well? It’s obvious that I don’t belong here, and yet, he’s still talking to me.</p><p>“Yeah, of course.” I shrug and lean back, draping my arm over the back of the chair. In the back of my mind I’m thinking that he should have ended this already and shown me the door, but he prods me to talk. And the more I talk, the more insane I sound. Pretentious brat doesn’t even come close to some of the trash coming out of my mouth.</p><p>“Coming here would be a risk for me though,” I say. “People say you’re losing your edge—that it’s only a matter of time before Le Femme is replaced by someone else.”</p><p>“And what do you think?” he taps his index fingers together once and waits for me to answer.</p> <p>I’ve been flying by the seat of my pants, making up passive-aggressive insults for over twenty minutes. I decide to give him the shove he needs to show me the door. Glancing at my arm draped over the back of the chair, I pause and then look back up into his face. Maintaining a calm exterior is getting harder and harder. I’m lying, blurting out anything I can think of to get him to dismiss me as some arrogant twit.</p><p>Looking him square in the face, I answer, “I think you’re already past your prime. I mean, come on. Let’s be honest. Your work’s been slipping for years.” I feel bad saying such a thing. I may not like his subject-matter, but Cole is a good photographer. Saying anything else is a lie, but I need to get him to show me the door and he hasn’t.</p><p>When I finish, no one speaks. His expression is neutral even as I verbally bitch-slapped his company, and then him personally. It’s clear that I think he’s a has-been. At least I think it’s clear. Cole just stares at me from behind his palms, occasionally tapping his pointer fingers together.</p><p>I stare back.</p><p>We watch each other in silence for a few moments. When Cole speaks, he’s looking at the table. Suddenly he moves and pulls a cell out of his pocket and rests it in front of him. The light stubble on his cheeks is distracting me a little. He is easy on the eyes, even if he is nearly twice my age.</p> <p>Cole’s voice is deep and rich, “You know what I think?” He glances up at me from beneath his brow. He takes his phone and taps it on the table, then continues, “I think that you’re trying to blow this interview—that you don’t want this job.”</p><p>CHAPTER 3</p><p>I start to say something, but Cole talks over me. Holding up his hand to silence me, he says, “And for the life of me, I can’t understand why. What would make you so incredibly cocky that you would walk in here and tell me to my face that I’m just another old man with a camera?” He’s grinning at me now, like he knows something I don’t. He taps the phone again.</p><p>Before I realize I’m doing it, I’m wringing my hands, my gaze lingering on his cell. I have no idea how he figured that out. Arrogant and crazy must look the same in his brain. I didn’t tip my hand. I didn’t blow my cover. At least I don’t think I did, but I’m a big girl. I can admit it when I’m busted.</p><p>“I’m sorry,” I say, utterly embarrassed. I can’t look at him. “I didn’t mean to waste your time,” I say softly. I start to stand, but he leans forward, stopping me. I feel the light touch of his hand on my wrist.</p><p>“Wait,” he says. I look up at him and our eyes lock. My stomach tingles at his touch before he slides his fingers away. There’s a slight pause before he leans back, saying, “Tell me where else you applied and why you want to work there more.”</p> <p>“Are you serious?” I blink at him, thinking I’ve already wasted enough of his time.</p><p>He nods, “Yes. If you have no desire to work here, then I’m obviously doing something wrong.” He tilts his head back, the corners of his lips seem like they want to pull into a smile, but they don’t.</p><p>Since I don’t see the harm, I sit back down. Hesitantly, I say, “I applied at Sottero, Couture, and here. I thought they’d be better suited to teaching me what I want to pursue. Both are wedding photographers. The University requires diversification during the interview process. This was my third interview.” He nods as I speak, his eyes flicking up from the table to my face as he tilts his head and leans back listening to why I didn’t chose Le Femme. “Both Sottero and Couture are self-made. They pulled themselves up by their bootstraps and became two of the best studios in Manhattan and—”</p><p>“Both are women,” he interrupts. He says it like it’s a bad thing.</p><p>My brows pinch together. I’m not sure where he’s going with this—if he wants to help me or if this is payback for wasting his time. Cole Stevens makes me uneasy. I nod my head slowly, replying, “Exactly. And I think that’s an asset.”</p><p>“Not to you,” he says, shaking his head. “You said on your resume that you wanted to be a wedding photographer for the rich,” he lifts the paper and looks at it, before looking back up at me, “Was that true or did you lie about everything?”</p><p>My cheeks flame and I squirm in my seat. Regret washes over me. I wish I didn’t listen to Sophia. I should have come in and said what I usually say and leave. Instead I’m sitting here with my stomaching twisting and doing my best not to wring my fingers and dive under the table. Mortification doesn’t look good on me.</p><p>I press my lips together and look up at him. At least I try to. I feel foolish for getting caught. My voice is soft and steady, “I didn’t lie. My resume is real. My accomplishments are true. I just felt like I’d do better somewhere that was more...”</p> <p>“More like what you already do. Anna,” he pushes away my resume and looks straight at me, “internships are to learn. While you might admire Sophia Sottero, her work is lacking. She’s a single medium artist.”</p><p>“And Couture? You think her studio is substandard, too?” I ask calmly. Those two studios are owned by women in a man’s industry. I respect them with every fiber of my being. They made something from nothing. They do exactly what I want to do. And this guy is slamming them. Tension lines my arms and trickles down my spine. People like Cole Stevens have no idea how hard it is to go it alone. Everything was handed to him.</p><p>I smile, shaking my head softly, and say what I’m thinking, “How can you be so arrogant? How can you dismiss them so quickly? Their work is beautiful.” He starts to answer, but I talk over him, “That is what I want to do—and Couture or Sottero can offer me the training I need to accomplish that dream. I want to show women what they look like on the most important day of their lives. I want them to see how stunning they really are.” My face pinches together, “I don’t want to learn how to turn them into a wet dream.”</p><p>He laughs, one short laugh, “You think that’s what I do? Make fantasy girls?”</p><p>“Yes,” I say. I don’t know where this streak of confidence is coming from, but he thought he was right and he isn’t. He doesn’t understand and I want him to. “You don’t get what I want to do. Women are more than some fantasy. They have brains, and hearts, and bodies that they never think are good enough. I want to show them they are good enough, just the way they are. I want beauty to be defined by the woman, not society. I want a woman to feel powerful and beautiful when she looks at a shot I’ve taken. It’s art, Mr. Stevens.</p><p>“Work like yours blindsides everything I want to do—everything I want to be. It’s not about heart with you, it’s about seeing how far can you push the line and still be able to shoot your ads to turn a profit.” I’m practically breathless when I suddenly stop speaking. My jaw dangles open, and I’m shocked that I’ve spoken to him like that. Everything that I hold against him came pouring out of my mouth. I sit frozen and pull my jaw shut.</p><p>Cole’s glaring at me now. His eyes flick to his phone. Before I know what’s happening, he flips it on and the screen flares to life. He presses a number and says to me, “This has been a very informative meeting. I had no idea feminists hate me so much,” he says playfully.</p><p>I smile and say, “Yes, you did.” Leaning back into my chair, I fold my arms across my chest. I have no idea what made me say it. I meant to be playful, but it came out wrong, “You just didn’t know regular women don’t like you, either.” For a hideous moment, I can feel a flirtatious smile slip across my lips. Cole stops whatever call he’s about to make and stares at me. God, his eyes are so blue.</p><p>He blinks once, hard, like he can’t believe I just said that. Neither can I. What the hell is wrong with me?</p><p>After a moment, he says, “Actually, you’re one of the only applicants who spoke frankly with me this week. I may not have conducted their interviews, but I did speak to each of them briefly. It’s been a blinding array of endless flattery. Your apparent distaste is refreshing.” I smirk at him, but don’t reply. I don’t trust my mouth anymore. My head is spinning and there is nothing I want more than to get out of there. Cole’s eyes drift over me, lowering to my shoulders and quickly sweeping to my shoes before he looks me in the eye and asks, “So, tell me. The clothes—do you usually dress like that? Or was that just for me?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A lopsided grin spreads across my lips. My voice is soft, and I can’t look at him when I say it. In hindsight, listening to Sophia was definitely a mistake.</p><p>“No, the deranged clown look was just for you. It’ll give you something to talk about for a while...” my voice trails off. Cole doesn’t seem amused. I feel bad and stand to leave, holding out my hand. The phone is next to his ear and I can tell he’s on hold. “No hard feelings, I hope.”</p><p>Cole stands, presses the phone to his ear with his shoulder, and takes hold of my hand, “None.”</p><p>A smile lights up his face. I glance at our hands. He hasn’t released me. Something feels strange, surreal, like this moment matters more than any other. His pink lips are parted slightly, and Cole breathes slowly, gazing into my eyes. I pull away, and my hand slips from between his fingers. A shiver runs through my shoulders and into my chest, stealing my breath.</p> <p>Cole watches me, like he’s completely aware of my reaction to his touch. His eyes pin me in place. For that moment, I don’t want to move...I don’t want to breathe. I don’t know what I want, but something is pulling inside of me, demanding that I don’t walk away from this man. Cole stands close enough to me that I can feel his breath on my cheek. When I drop his hand, he steps toward me. Every inch of my body reacts.</p><p>A voice rings in his ear breaking the moment. Startled by the draw to Cole Stevens, I ignore whatever happened. I don’t even want to think about it. Goosebumps cover my skin and I rub my hands over my arms quickly to smooth them down.</p><p>Nodding at Cole, I turn and start walking toward the door, taking it as a sign that I’ve been dismissed and that there are hard feelings. Damn. I didn’t want that. As I lift my hand to the knob, I look over my shoulder. Cole doesn’t look at me. He doesn’t say good-bye. Inwardly, I cringe. This is one of the biggest mistakes I’ve made. I can feel it and yet I have no idea what kind of impact this one event will have on my life. I twist the knob and pull the door open.</p><p>Talking to the person on the phone, Cole says, “Finally. What were you, sleeping? Yeah, well, I’ve been here chatting with Anna Lamore.”</p><p>My eyes go wide and I nearly trip over my sparkling feet as I come to a stop, and look back at his broad shoulders. He turned away from me, but I can see the grin on his face when he turns his head. “What are you doing?” I whisper, panicked, and walk in front of him. An insane thought crosses my mind—I could jump on his back and take the phone—but I can’t. Whatever he’s doing is already done. He already said my name, told someone I was here. My stomach sinks and my hands shake. This feels bad. Whatever he’s doing throws me into a full blown anxiety attack.</p> <p>Cole covers the phone with his hand, “Talking to your dean.” He uncovers the phone, “Yes, she is.”</p><p>Terror courses through me as my eyes go wide. If he tells the dean what I did, the university will be pissed. Attending this interview and making sure Cole didn’t want me still counted as an interview, right?</p><p>A thought takes hold and makes me feel sick—this could mess up my chances with Sottero.</p><p>For a moment, I wonder if Sophia did this to me on purpose. It could have been a cruel trick on her part, but for the life of me I can’t see why. If she intended on offering me the internship, why would she encourage me to do something to Cole that would warrant this kind of reaction? She knew him. They worked together. She told me these things, the clothes, the kid in need of a serious attitude adjustment, would make his people show me the door faster than I could blink. Instead, Cole grabbed the phone and called my dean.</p><p>My stomach twists when his eyes lock with mine. A mischievous grin spreads across Cole’s lips, he looks sweet and playful, but I’m too on edge to notice, “She told me that I’m a washed-up, sexist, has-been and that she has absolutely no intention of working for me. Yeah,” he laughs, “she really did. So I wanted to make sure that I got hold of you first.” His voice turns serious. The smile fades from his face, “Tell Sottero and Couture that they’re too late. I hired Anna this morning.”</p><p>CHAPTER 4</p> <p>I stand there like I’ve been sucker-punched. My ears are ringing with his words, but I can’t believe Cole did it. For a few moments after he hangs up, I just stare at him wide-eyed. My mind is reeling, trying to determine why he did that.</p><p>I’m near tears. “How could you?” I gasp, and fold my arms across my body. I fall back into the chair, completely deflated.</p><p>My shot with Sophia Sottero is gone. In one phone call Cole changed my future. Instead of being the elegant wedding photographer to the famous, I am going to be something else, something that will ruin my career before it starts. Shocked, I glare up at him. Cole is leaning against the side of the table. His gaze rests on my face, waiting for me to react. I try to hold everything in check, but I don’t understand. Why did he do that? Rage floods through my tiny body.</p><p>Rising to my feet, I step toward him. My hands are balled into fists at my sides, shaking, “How could you do that? You had no right!”</p><p>Cole remains relaxed, like he pisses women off all the time, like my temper-tantrum is theatrics, but it isn’t. He folds his arms across his chest, “I did you a favor, Lamore. The last thing the world needs is another wedding photographer—”</p><p>I cut him off, shoving my finger into his chest. “That wasn’t your decision to make!”</p><p>“The hell it was,” his eyes are cold, his expression rigid. He grabs my finger and flings my hand away. “Who’s the arrogant ass here, Anna? Who walked in here looking like a side-show act? That was you. Remember?”</p><p>I try to control my temper and force back tears that are building behind my eyes. “It’s not the same thing,” I say coolly. “I had no intention of working here. Ever. You know what the University puts us through. You’ve had interns before! Maybe I didn’t approach it right, but I didn’t deserve this. And just because you made one call, doesn’t mean I’ll work here.” Glaring up at him with barely contained fury I continue, “I’ll call Sophia myself and tell her that I’m still on the market—that your claim with the dean was an attempt to steal me away from her.”</p> <p>A cold dark expression crosses his face. His brow rises slightly, and his arms unfold. He leans toward me, making my heart race faster, “I wouldn’t do that if I were you.”</p><p>“Is that a veiled threat?”</p><p>He leans closer to my face, his warm breath flowing across my lips, “No, it’s a plain old overt threat. If you don’t work here, you won’t work anywhere. New York moves in social circles that you aren’t a part of. One word from me will keep you on the outside.” He pulls away, the tension in his jaw easing slightly.</p><p>Fury rages in my eyes. Every dream I had was just ripped apart. I make a false start and then press my lips together and shake my head. When I steady my voice, I say, “So this is what I get for screwing with you and wasting your time? This is my punishment for messing with the famous Cole Stevens?”</p><p>“Something like that,” he replies before pushing off the table and standing in front of me. “Don’t screw with things that you can’t control.” The fire in his eyes softens.</p><p>Rage flows through me, engulfing every muscle, every fiber of my body. The floodgates behind my eyes are ready to overflow, but I try to hold them back as I stare him down, shaking. A tear escapes from the corner of my eye and streaks down my cheek. His gaze shifts, watching it fall. Wiping it away with the back of my hand, I steady my voice. It is deep and dangerous, my rage barely in check, “I’ll never forgive you for this.”</p><p>CHAPTER 5</p><p>Fumbling the dish, it slips between my hands and lands hard on the counter. Emma is here, locked in her room. I try to be quiet. I don’t want her to know I am home. I don’t want to talk about Cole or what he did, or the threat he made. I’d go at him if I could, but I am a nobody. There are no socialites in my circles, no way to do any damage, no way to bend his arm to let me go.</p><p>The dish clangs on the counter. As I reach for it, the noise echoes loudly through the tiny apartment. Every emotion that surged through me that morning comes rushing back. Taking the bowl in my hands, I swing my arm, and send it sailing into the wall. It shatters into a million pieces, shards flying everywhere. Tears sting my eyes, and I finally give in and let them come. Burying my head in my arms, I lay it down on the counter, sobbing.</p><p>The music in Emma’s room shuts off and she opens her door. “Anna?” she asks, hanging her head out. Her eyes drift to the broken dish and then to me. I hate crying. I never cry and I’m near hysterical. “Oh my god. What happened?” She rushes toward me, not knowing what’s wrong. “Anna, are you all right? Did you cut your hand?”</p><p>“No,” my voice bleats between sobs. Raising my head, I look at her. I’m still wearing my tee shirt and jeans. I’ve taken off the tutu, socks, and sneakers. Tearstains chill my cheeks. “That dick screwed me. I... I tried to... And he...”</p><p>Emma starts looking me over like she thinks some jerk grabbed me on the subway. “No, Em! The interview. It was the interview! Cole Stevens screwed me over.” I finally get enough control over myself to tell her what happened. Emma listens to the entire story. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When I finish, she pushes a long lock of dark hair behind my ear, “So, he was mad? He did this to get back at you for wasting his time? Anna, that doesn’t make any sense. It seems too cruel.” I shoot a look at her, shocked that she doesn’t believe me. She smiles at me, knowing what I’m thinking, “Of course I believe you, but it just seems a bit drastic. You didn’t do something else to him, did you? Something that he’d want payback for?”</p><p>“Em, think about it,” I lean my head back against the wall, wiping away the tears that soak my cheeks. “I’m going to have to see him every day for three months. There were better ways to screw with me, right? I don’t understand what happened. One moment everything seemed fine—he was acting like he thought it was funny. Then he had the dean on the phone, and the whole thing fell apart.” I get up, grab the kitchen towel, and run cold water over it, before pressing it to my face.</p><p>Emma leans back against the counter, her dark hair falling over her shoulder when she looks at me. “He ruined your shot at Sottero?”</p><p>Clutching the damp towel, I nod. “What do I do? I have to do the internship to graduate. I need the experience to get a job. And without that internship referral from a prestigious studio, I’m screwed. There’s no way I’ll make it.” My lip starts to quiver again.</p> <p>Emma takes me by the shoulders, and shakes me once. “Snap out of it, Anna. You have to suck this up. Here’s what you do: Hate his guts, do your internship, and then get the hell out of there. You probably won’t even see him. Interns are like Labradors—they fetch crap—and if you’re really good they’ll throw you a bone that’ll look good on your resume. Piss on his pants when he’s not looking, and chew up his shoes. Okay? You can do this. You’ve dealt with worse than this pampered ass. You can do this.”</p><p>Her pep talk floods through me and suddenly I feel really tired. I nod at her, mute. There is nothing left to say. I have to go through with the internship at the slut factory, but I’ll do more than be a nuisance, like Em suggested. I’ll find dirt on Cole Stevens that will destroy him.</p><p>CHAPTER 6</p><p>“I thought you wanted to intern with Sottero? How’d you do a one-eighty and end up at Le Femme?” Edward holds up his hands and grins, “Not that I blame you. Having a girlfriend who shoots at Le Femme is sexy as hell.” He looks me over like he’s never seen me before and waggles his dark eyebrows.</p><p>I elbow him in the ribs, and he laughs, nearly dropping his popcorn on the movie theatre floor. “Yeah, that’s why I did it. So you can fantasize about me shooting half-naked chicks all day.” I reached into my purse, fish out a tissue, and hand it to him. “Wipe the drool off your face,” I say holding the tissue out between my fingers. It dangles there between us for a second. I can’t keep my tone serious and I snort by mistake.</p> <p>Edward pushes his hair out of his eyes and slouches back in his seat. His long lean legs are extended in front of him. There’s a soda between us in the cup-holder that’s built into the armrest. I reach over and grab some popcorn. Edward throws a few kernels at me and they get stuck in my hair. I stick my tongue out at him, and he lunges in for a kiss.</p><p>“Awh, gross,” Emma says and looks away. She’s sitting on the other side of me. Although she knows the whole story, she says nothing to Edward. I didn’t want to deal with his temper and if Edward knew what Cole did, well—I just didn’t want to deal with it—so I said I chose to work with Cole.</p><p>Emma says, “It’s bad enough you have to date my brother, but do you have to suck his face off in front of me too?” Em’s elbow bumps into my ribs and I choke. She effectively removed her brother’s lips from mine.</p><p>He grins at me, and throws popcorn at his twin sister. It sticks to her hair and she shoots him a look.</p><p>“Real mature, Edward.” She picks out the kernels and throws them on the floor.</p><p>We got to the theatre too early. Edward is like that. He wants to be in his seat fifteen minutes before the movie begins. Em and I would have walked in five minutes before, and as long as it wasn’t opening weekend, that works fine. There are only three of us, but Edward is a little bit of a control freak.</p> <p>It’s funny, although I have known him for years, we didn’t get together until a few months ago. I took my one and only business class. It was about marketing. I thought that would come in handy one day when I had my own studio. The class had all business people in it, people who spent their entire undergrad time sitting in classes and absorbing the vernacular. Meanwhile, I was learning about shadows and shading in the art department. From the first class, I felt like I was drowning in a sea of words and concepts that I didn’t understand. Edward sat next to me and helped me figure it out. During midterms, we were studying and it was late. One thing led to another and his lips met mine. Since then, I haven’t been able to stop thinking about what I want him to do to me with those sexy lips.</p><p>We lean our foreheads together and I smile at him for a second, thinking naughty thoughts. “I’m glad you’re here,” I whisper so Emma can’t hear. He wraps his arms around my shoulder and I lean my head against him.</p><p>Emma slumps down in her seat and rests her feet on the empty chair in front of her. It’s after ten and the theatre isn’t full. The lights fade and the coming attractions begin. A Le Femme ad is lumped in with some others. Edward and Emma are staring at the screen, no doubt seeing perfection that doesn’t exist. Rage floods through me when I see the ad. Cole’s perception of beauty doesn’t exist. It’s an ad produced for men, with a product aimed at women. It makes no sense and pisses me off.</p><p>Edward seems to sense the tension building in my shoulders. He mistakes it for something else, “Nervous?” he whispers in my ear.</p><p>I shake my head as the ad ends. Monday morning I start an internship that I don’t want, with a man that threatened to destroy my career. Nervous is the wrong word. Enraged is more like it. My mind swims with ideas, ways to get back at Cole for doing this to me. Come the end of summer, he’s going to wish he never met me.</p><p>CHAPTER 7</p><p>My legs are draped over the side of the bed. Edward has his hands on my shoulders, applying gentle pressure, massaging my tension away. The movie was good, but my mind was elsewhere. We came back to the apartment, and quickly ducked behind my bedroom door before Emma could comment on her brother being in my room so late.</p><p>Edward leans closer, his warm breath tickling in my ear, “I had fun tonight.” I smile absently, the hairs on the back of my neck prickle as his breath lingers.</p> <p>We haven’t been together yet. The time never seemed right. Or maybe I just keep putting it off because I’m not sure that I want to have sex with my best-friend’s brother. That is a lifetime of awkward moments if things don’t work out. He’ll be picturing me naked in his mind, doing all the naughty things I like to do—things no one knows about—with that adorable grin on his face every time he sees me. I don’t know if I’m up for that.</p><p>Edward’s hands slide along my shoulders, his fingers slipping under my collar, tracing my neck with his fingertips. I close my eyes and shudder at his touch. He’s beautiful and funny, witty and smart. He’s everything that makes my heart race, but I still feel nervous about being with him. He doesn’t pressure me, not really, but he doesn’t stop trying to seduce me either. Eventually, I’ll give in. He knows it and so do I. It’s only a matter of time until I can’t resist him any longer.</p><p>“So did I,” my voice is weak, like I’ve been sleeping. I clear my throat, trying to bat away the butterflies forming in my stomach.</p><p>As I turn toward him, Edward reaches for my face and pulls us together. His lips are soft and hot. Gently, he kisses me, over and over. The kisses are so soft and sweet that I gasp. My heart is pounding. It feels like my head is spinning and I want nothing more than to feel my body sliding against his. I want to forget this day, escape it—with him.</p><p>I slip my fingers beneath his shirt and trail my hands up his hard stomach. Our kiss deepens as I do so, and he moans softly. I pull him tighter for a moment. His bare skin is scorching under my palms. I want to lose myself in him. I want to stop thinking, stop freaking out over what happened earlier. I was so upset and scared—terrified—that my future had been ripped out of my hands. I never saw it coming.</p><p>Edward’s hand cups my breast, his lips kissing me, making me hotter and hotter. He squeezes me hard and I gasp, wishing he’d do it again. As he lowers me onto my bed, his blue eyes lock on mine. Edward’s hands slide under my shirt and he pulls it over my head before my back hits the comforter. I lay in front of him with my hair splayed around me in long dark curls. I’m wearing a lacy black bra and jeans that sit just below my waist.</p><p>He sits above me, his eyes taking me in like he could never get enough. “You’re so sexy, Anna,” he says, and lowers himself on top of me. Edward kisses my cheek, then my ear, and starts moving down my neck. The heat of his mouth leaves a hot trail in his wake.</p><p>My body is strung tight—my back arches into his touch—into his kiss. My pulse pounds faster and faster. I’m so hot. The pit of my stomach has no floor. It’s fallen away with his kisses, and the heat between my thighs is completely unbearable. He feels my body shift beneath him, notices my legs opening for him. Edward’s fingers reach for the button my jeans and he slips it through the hole, then lowers the zipper. His hand slides into my pants, slowly pressing into my panties until I feel him hesitate. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Gasping, I say, “I want you. I want to feel you. Please, Edward. Touch me.”</p><p>He smiles that beautiful smile that I love and his fingers press against the bare skin between my legs. I slide against his hand, my jeans pulling tighter as his hand moves. Edward dips his lips to my breast and he nips me gently, tugging my nipple with his teeth. A moan escapes my lips. I’m burning up inside. I want him. I want to feel him. I want to ride him and be with him.</p><p>His fingers circle the tender flesh between my legs, gently rubbing and stroking until I can’t stand it. The heat flashes through my stomach as I arch my back, begging him to touch me. He slides a finger into me and I moan, pushing back against his hand. Teeth nip my breasts, and his tongue teases me through the lace bra. I gasp, saying his name. With one hand he continues to stroke me, making me wetter and wetter. My body moves against his hand, craving more. His other hand finds the closure on my bra and flicks it open. The lace loosens and he pulls it away. His lips kiss me gently at first and then harder, drawing my tender flesh into his mouth, sucking. Writhing, I come against his hand. He pushes into me hard as he feels me pulsate, his lips still on my breast. Every time his hand pushes into me, I moan.</p><p>Edward kisses me gently and pulls away. He jumps up and walks toward the door, “Be right back.” He grins at me.</p> <p>Breathing deeply I watch him, wondering what he’s doing. I never let him touch me like that before and I didn’t expect him to get me so riled up and then stop. I thought this was foreplay, but he’s left me alone. Sweat is covering my body. The air feels too cold with him gone. When I look up, he’s standing in the doorway with a towel in his hands.</p><p>It takes me a minute. I’m dazed with a lust-induced stupor, but I figure it out and ask, “You washed your hands?”</p><p>He nods and tosses the towel aside, closing the door behind him. “Yeah. Why? Does that bother you? Most girls like that I want to be clean.”</p><p>I arch an eyebrow at him. My pulse is slowing, my senses returning. He just said several things that bothered me, but getting up and leaving me there to wash his hands was the worst. I can’t even process what he just did so I latch onto the obvious, “Girls? How many have you been with?”</p><p>Leaning on the bed, he drapes his arm over my waist, “Enough to know what I like. Enough to know I want you.” His eyes rove over my body like he’s still filled with desire, but the way he washed me off his fingers broke whatever spell he wove. The illusion is shattered. Maybe getting up and washing in the middle of having sex didn’t bother other girls, but it bothers me. I pictured my dream guy loving my scent, burying his face between my legs like he couldn’t get enough, licking me off his fingers and then begging for more. That isn’t going to be Edward. He ran to the bathroom before we were even done.</p> <p>Edward eyes me lazily and leans forward, sliding his hand into my waistband. Placing my hand over his, I stop him. He looks up into my eyes. I can’t let it go. I have to know what I am dealing with. Is he mental or was this just a precaution since we haven’t been together very long?</p><p>I ask, “If you found the right girl, the one you wanted in every way possible, would it be different? Would you want the scent and the feel of her on your hands?” Would you want to taste her? Would you swallow? I wonder, too afraid to ask . The questions rush out. Suddenly, this conversation feels very awkward.</p><p>Edward sits up and withdraws his hand from my waist. He looks confused. I pull my shirt over my head so my breasts aren’t just out there.</p><p>He watches me carefully, knowing he blew his chances with me tonight. He runs his fingers through his hair, “It bothered you.” He breathes deeply, shaking his head like he’s annoyed with himself. “I’m sorry, Anna. I didn’t mean to hurt your feelings, it’s just that—”</p><p>I waive my hands at him, shaking my head, “You didn’t hurt my feelings,” the words are falling out of my mouth before I can stop them. It did bother me. It seemed like he couldn’t get me off his skin fast enough. I was offended, but my mouth is saying I wasn’t. What the hell is wrong with me? Why can’t I just tell him what I want? I’ve only been with two guys and neither of them did what I was hoping for either. I am barely twenty-two, but I know what I want. At some point I started to think that the things I want are strange. And I can’t talk sex with Emma—not when it’s sex with her brother.</p><p>Looking relieved, he touches my cheek gently. “Good, I’m glad. I don’t know what it is, but the idea of having someone else’s fluids on me just makes me feel like I need to wash it off.” He shivers like it’s gross—like I’m gross—and my heart sinks.</p> <p>I can’t look at him. The bedspread is twirling between my fingers, my voice soft, “So, you probably don’t like the idea of tasting me. There.” The question is in my voice. I sound frail, like his words could hurt me. Maybe they could. I want him to say yes. I want him to want me.</p><p>Edward notices my tone, but he misreads my question. “I’d taste you there. I could do that.” He doesn’t sound eager. “Honestly, the idea of you doing that to me is more appealing.” He fumbles his words, laughing nervously.</p><p>I blink hard. What a dick. Did he really just say that?</p><p>Another question bashes me in the brain before I can think—why didn’t I notice this before?</p><p>Carefully, I ask, “So, I could go down on you and swallow, and you’d like that?” He nods at me, like he’s ready to do it now.</p><p>This is what I was afraid of, he doesn’t want to touch or taste me like that. It’s one-sided. We can’t do the things I want to do. Sex with him will be very limited if he doesn’t like sweat and other slippery substances. The pit of my stomach drops. This relationship wasn’t going to work. Damn. I’d asked him if he had any sexual preferences I should know about. Clean-freak didn’t come up. I lean my head back against the headboard and stare at the ceiling. I know there’s no future for us, but I can’t admit it. Things can’t be this way. Not again.</p><p>“Anna?” he asks, his hand sliding over my knee.</p><p>“Hmmm?” I can’t look at him. It feels like my insides have been carved out. I feel the loss of things I thought I’d have with him, things that will never be.</p> <p>“I love you,” he whispers. My neck snaps and I blink rapidly, staring at him. My heart rate shoots up to stroke territory. A boyish smile forms on his lips. He doesn’t realize the effect of his words. “Just because that doesn’t appeal to me doesn’t mean that I don’t want you.”</p><p>My eyes are glassy. I feel like I’m going to cry. He loves me? But he’s too grossed out to show me the way I need. The way I want. I smile softly at him and he takes me in his arms, stroking my hair.</p><p>“I know I said it too early,” he says into my hair. His breath warms my throat. “But, I couldn’t let you think—”</p><p>I pull back and look him in the eye. Smiling, I say, “I love you, too.” My words are sincere. I care about him. I think about it and realize that I do love him. I want things to work out between us, so I say it. But I say it too soon after he drops a bomb on us and the consequence is disastrous.</p><p>CHAPTER 8</p><p>The next morning I find Emma sitting in the kitchen shoveling Cheerios into her mouth. “I can’t believe you’re dating my brother. That’s so gross.” Milk drools a little from the corner of her lips and she snort-laughs, wiping it away.</p><p>I roll my eyes. We’ve had this conversation already. “I know. Ick. Yuck. Don’t tell you about sleeping with him. I know the rules, Em. I won’t make it weirder that it has to be.”</p><p>She points her spoon at me, “I never called them rules—”</p><p>“Same difference,” I shrug. It was a condition of going out with her sibling. She didn’t want to know details, didn’t want to hear anything.</p><p>Memories of the night before play through my mind. I told him I loved him. That feels like the stupidest thing to have said. It will drag out the relationship when it should have been shot in the head. I need to talk to someone about it. I don’t know what to do. Edward is great. This was his worst trait, and it doesn’t seem that major in the light of day. But then again, it does. He made me feel like I was undesirable. The expression on his face when he left to wash his hands was burned behind my eyes. If he did that after we have sex, I wouldn’t be able to take it. It was like he couldn’t wait to get to the soap. I sighed, throwing my head back in an exaggerated whine.</p><p>“Don’t even,” Emma says, “You’re the one who wanted to date him. And I heard you last night—which wasn’t ideal by the way—if you tell me what happened, I’ll cut my ears off.”</p><p>“Well, then you’ll look really dumb. And I’m not telling you a thing,” I snap and walk away.</p><p>It’s Sunday. I head to my room and pull on a pair of ratty shorts and a tank top. Screw this. I’m not sitting at home, moping. I’m not that kind of girl. When things get messed up, I can sit around and sulk or try to figure out how to fix them. There has to be a way to fix this. I don’t want to put my sexual fantasies to rest yet, although the last two guys had similar reactions. From what I’ve read on the internet, the things I want aren’t that weird. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My feet pound the pavement until I make it to the park. I have an earbud in one ear and the other is tucked into my sports bra strap. I want to be able to hear if someone is coming up behind me. I find my pace and jog the familiar trails beneath the leafy green canopy. The sunlight forms patches of lace on the ground. The splattering of light is a photographer’s nightmare, and a nature-lover’s dream. I’m both. I love the feel sunlight on my skin.</p><p>My mind goes back to last night. If I can get through this with Edward, everything will be all right. It’s always a little bumpy in the beginning, right? I think back to the other two men. Honestly, I ‘m not even sure if they count. We did stuff, but my first boyfriend wasn’t exactly skilled. And the second guy turned out to be an ass. I huff a steady stream of breaths. The music soon diverts my thoughts and I sing softly to myself, going faster—trying to outrun problems that would crush me.</p><p>I don’t realize how zoned out I am. Normally, I make sure I pay attention while I’m running, but today I’m out of it. As I pass the clearing toward the swank end of the park, I see someone on a bench stand up. My mind makes a mental note, but I don’t notice that it’s him until it is too late.</p><p>Suddenly, a strong hand touches my shoulder. Without hesitation, my elbow flies back and my fist comes up. I twist out of his grip and pivot, my knee rising to kick him in the crotch, when I see it is Cole Stevens. He is dressed in a suit like he’s been at church. My knee nearly connects. When I realize who it is, I try to stop. It throws off my momentum and my knee kind of brushes his pants and I lose my balance.</p> <p>Before I can fall back, his hand shoots out and grips my arm. He steadies me, “I didn’t mean to startle you. I’m sorry, Anna.”</p><p>Crap. Can this day get any worse? I just brushed my boss’s nuts with my knee. I pull out of his grip, and bend at the waist breathing hard. Sweat drips down my spine. I sputter, “What the hell, Stevens?” Tiny beads slip over my neck and when I look up, they slip down between my breasts.</p><p>He holds up his hands, palms facing me like he means no harm. “Again, sorry. It’s a mistake I won’t repeat. You nearly took my balls off.” His voice is light and he seems off balance.</p><p>I nod, admitting that’s exactly what I would have done. He says nothing. After a moment, I ask “What do you want? Did you stop me to throw more threats in my face?” I shouldn’t mention it again, but I had to.</p><p>“No. Nothing like that,” he twitches slightly, like my words surprised him. “Actually, I wasn’t sure it was you, until you attacked me—”</p> <p>My jaw drops, “You scared the hell out of me! I thought you—”</p><p>He’s smiling, laughing at me, “I know. I’m teasing. Listen, I’m sorry for the way things went yesterday.”</p><p>Straightening, I wipe the sweat off my temples with the back of my hand, “Yeah, me too. I shouldn’t have shown up dressed like a circus freak and you shouldn’t have been a prick. Does that sum it up?” I push the damp hair out of my face. “Let’s cut through the crap, Stevens.” The smile melts off his lips. My voice is cold and curt, “I don’t like you and an apology isn’t going to fix it. You fucked up my life, and I’m not letting it go, so deal with it.”</p><p>I stare into his eyes and wonder if he’s a sociopath, but when our gazes lock my body reacts to something else. My heart skips a beat and my stomach twists. Annoyed, I turn on my heel, ready to jog away. His hand shoots out and clasps my wrist. The movement slows me. My body is covered in sweat. His hand pulls away damp, and he makes no effort to wipe me away—no movement to show how repulsed he is by my appearance. I can’t help but notice his reaction is different than Edward’s.</p><p>Cole’s jaw tenses, like he’s trying not to fight with me, “I plan on it. In the meantime, I wanted to tell you that I’m willing to start over whenever you are—with everything.” His gaze is intense; his dark lashes lower after a moment. He looks past me, then back at my face.</p><p>“Then let me go.” My voice is soft, and askance. It doesn’t sound like me. Unblinking, I look into his face. His eyes are an intense shade of blue with black and silver flecks. They are locked on mine.</p> <p>His lips form a thin line and he shakes his head, “It isn’t what you want.”</p><p>I look both ways, making sure no one is within ear shot, “Fuck you, Stevens! You have no idea what I want.” My voice is low, threatening. He took away the thing I wanted most. In one move he out played me and I’d pay for it for the rest of my life. I jab my finger into his chest, poking his ironed shirt. “No, wait. Actually, you do know what I want, because I told you. I was stupid enough to trust you and I told you exactly what I wanted.”</p><p>“The internship with Sottero.”</p><p>I nod, dropping my hand. “And you made sure I’d never have it.”</p><p>“Fine,” he says pulling a phone out of his jacket pocket. The way the suit clings to his lean body makes me notice his figure. That suit fits him like it was made for him. It probably was. Fucking rich people think they own everyone. I don’t want to stand there. I don’t want to talk to him, but that phone makes me nervous. It feels like he’s doing a replay of yesterday.</p><p>“One call puts things back the way you wanted,” he says. “I’ll call Sophia right now. We swap interns. It’s your choice.” He arches a brow and glances at me, the phone cradled in his hand.</p><p>Shocked, I glance at his palm and then back at his face. I don’t buy it, “You’re lying. I don’t know why, buy you’ve decided—”</p><p>“Lamore, you’re trying my patience.” He shifts his weight to the other foot, like he’s been standing there too long. “You pissed me off yesterday, and there were better ways to deal with you. I apologize. I’m not saying it again, and I won’t offer this again. You blamed me for fucking up your life, so fix it. Have me call Sottero and you’ll start there tomorrow.”</p> <p>I blink. It feels like I’m falling off a cliff. There are no bearings and I can’t tell which way is up. “Why are you doing this to me?” My breath hitches in my throat and I want to punch him. “Why are you batting me around like my life doesn’t matter? I don’t come from a pampered-ass home like you did. Everything wasn’t handed to me on a silver platter with a side of gold doubloons. I carved my own path, and you decided to crush it on a whim!” My hands ball at my sides. No one pays any attention to us. They walk on by, ignoring my tirade.</p><p>“Doubloons?” his lips pull into a smirk. My eyes widen, shocked that he decides to tease me when I’m ready to rip his head off in the middle of a very public park. Every inch of me is vibrating with anger and I know he can see it.</p><p>The smile fades from his face, “Fine.” He presses a number on his phone. It dials and I hear a woman’s voice, but I can’t make out what she’s saying. “Sophia,” he says curtly. “Cole. Yes, I’d like to exchange interns with you. I know you wanted Miss Lamore.” He pauses, then nods. “Yes, a trade. Mine for yours. That’s my offer. I’m handing the phone to her. It’s her call.” Cole extends his arm, shoving the phone at me.</p><p>Time slows to a crawl. Light-years pass as I reach out to take it. Sophia’s voice echoes in my ear. It’s her. It’s Sophia Sottero. She wanted me to be her intern. Yesterday could be erased. All I have to do is say yes.</p><p>“Anna, darling let’s put this whole mess behind us.” She laughs, but it sounds bitter, “You know, for a moment I actually believed that you choose to work for Cole. As if you would sink to his level...” she continues to criticize Cole, undermining his ability and reputation.</p><p>I stare at Cole wondering if he has any idea how much Sophia Sottero hates him. I missed it during the interview, but now it’s completely clear. He’s put his hands in his pants pockets and is looking at his shoe. The action makes him seem younger than he is. Why did he do this? He chased after me through the park, risked getting maced, and clipped in the groin by my knee—for what? To say sorry? To set things right?</p><p>Something keeps me from speaking. I can’t find my voice even though Sophia is excitedly chattering in my ear about the internship and the things I’ll learn—skills that I can use toward my own business one day. Skills that will help me get a kick-ass job at the end of the summer. Skills that I don’t have and desperately need.</p><p>Skills that Cole can’t give me.</p><p>Cole pushes a rock with his shiny black shoe. He doesn’t look at me until it’s obvious Sophia has grown quiet and I’m not speaking. It feels like the air is fluid. I hear nothing. Sophia’s words float away from me as she asks if I’m still on the line.</p><p>Cole looks up at me. There’s something there—I can see it within him in that moment—something that is better than I am. I would have never tried to fix a mistake of this magnitude like this. He is offering me everything I want, I just have to take it. He apologized. He fixed his mistake. I didn’t.</p><p>Without a word to Sophia, I hand him back his phone wondering if I’m insane. He takes it, but doesn’t end the call. Glaring at him I say, “Last time I trusted you, you screwed me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Likewise,” his expression is hard.</p><p>“So, what?” my eyes shift over his face, taking in the stance of his body, the tension in his shoulders. “We just start over?”</p><p>He nods, “Yes. Or say yes to Sottero and good-bye to me.”</p><p>I eye him, my gaze sliding over his suit. My mouth hangs open and I shake my head, not believing what I’m doing.</p> <p>Reaching out, I take the phone from him and press it to my ear. “Good-bye Sophia. Enjoy your afternoon. I’ll be interning at Le Femme.” I press end call and hand him back the phone. “Prove to me that I didn’t just make the biggest mistake of my life.”</p><p>He seems surprised, but takes the phone back and slides it into his pocket. “There’s no reason to. You’ll see it for yourself soon enough.”</p><p>CHAPTER 9</p><p>Stupid men. One won’t touch me. The other won’t stop screwing with me. My head is spinning. The past twenty-four hours have left me in emotional overload. Edward is sitting next to me while I eat chocolate ice cream out of the carton. My hands are getting sticky. I can tell it’s bothering him, but he says nothing. I consider taking his face in my hands and smearing the ice cream over his cheeks, and pressing my lips to his. Getting covered in ice cream and licking it off his skin sounds wonderful, but I don’t do it. Edward would freak out. No sticky sex.</p><p>The TV flickers with some show neither of us is watching. Glancing at the carton, Edward says, “You don’t have to be nervous about tomorrow. Le Femme has a sterling reputation. I’m sure you’ll do fine.”</p> <p>Edward thinks I’m nervous. He thinks it’s because tomorrow is my first day and I have new-job-jitters. I didn’t tell him what happened in the park. Without meaning to, I bypassed an important part of my life. I just didn’t want him to freak out about Cole, and now I can’t backtrack and add what happened today.</p><p>I nod and shove another scoop in my mouth. “Thanks.” I put the carton down and push it away. Grabbing the napkin, I wipe my hand off. When I go to hold Edward’s hand, he takes it, but makes sure that he doesn’t the touch the spot I cleaned with the napkin. “I’ve known you for what, two years and I had no idea you were such a germ-a-phobe.”</p><p>He glances at me out of the corner of his eye, “I’m not. I just don’t do sticky.”</p><p>I snort, “Then what do you do?”</p><p>“What’s the matter?” his voice is soft and comforting. He wraps his arms around me and my anger deflates. “You seem bent out of shape. Like something’s wrong. You can tell me, baby. If it’s the ice cream, cover me in it. I’d do sticky for you. I’d do everything for you.”</p><p>Those are the words I wanted to hear. I melt in his arms. The tension flows out of my body. I feel better. He made things better. “I know you would.” I lean into his chest and blink at the TV, not seeing the picture on the screen. “Can you stay a little longer?”</p> <p>He nods, “As long as you need.” His hands pull my hair away from my face. “Summer sessions don’t start for another week. I can stay overnight, if you’d like. On the couch,” he adds quickly.</p><p>I smile, “When you stay overnight, it won’t be on the couch.” I feel him smile against my head. He’s happy. “What’d I say?”</p><p>“You said when... not if.” Turning me toward him, he tips my head back and lowers his lips to mine. His kiss heats my body and makes me feel better. When he releases me, he kisses my temple, and whispers into my ear, “Just let me know when. I’ll be there for you in every way you want.”</p><p>They are nice words, words that I wanted to hear—words that I needed to hear. But even as he says them, I know they are like the early morning mist that burns away in full heat of the sun.</p><p>CHAPTER 10</p><p>The skinny girl looks like a model, not a receptionist. “Yes?” she asks as I push through the door on Monday morning. “Can I help you?”</p><p>I’m dressed normally now, a dark suit clings to my body. It’s not as nice as hers, but interns aren’t paid much and I’m next to broke. “Anna Lamore. I’m the new intern.”</p><p>“Ah, yes,” she presses her manicured finger to a button on her desk phone. It looks like a sleek piece of glass. Figures. Cole has a designer phone, and a designer receptionist. The piece of plastic beeps and I hear his voice.</p> <p>“Yes,” Cole’s voice sounds relaxed.</p><p>“Miss Lamore is here. Should I send her back?” I stand there in shock. Why is she telling him? Cole can’t be the one training the intern. That doesn’t make any sense.</p><p>“Yes,” he replies.</p><p>She stands and smooths her outfit. She’s wearing a silk skirt with a vibrant floral pattern. Her blouse is sheer and I can see a lacy cami underneath. Her arms are bare. The heels make her nearly a foot taller than me. “This way Miss Lamore. I’m Vanessa Todd...” she speaks as she takes me through the building toward Cole.</p><p>I trail behind the woman, feeling like an ogre in comparison. I try to remember everything she’s saying but feel a little bit overwhelmed. When we stop in front of the mahogany doors, she places a hand on my shoulder. I glance up at her.</p><p>“If you need anything, have any questions, I’m happy to help you get on your feet here.”</p><p>Dazed, I nod and smile, “Thank you.” She walks away leaving me alone. The studio is quiet and I can’t help but wonder where everyone is. This is a huge company. There should be graphic designers, photographers, and assistants—but there’s no one in the halls. The offices we passed are empty.</p><p>I look at the silver plaque on the door. It’s Cole’s office. His name is scrawled across the plaque in an elegant script. I push the door open and step through.</p><p>I don’t feel nervous, but I’m not confident either. Yesterday knocked me off kilter. The day before that blindsided me. Since I met Cole Stevens, nothing has gone according to plan. The thought of hanging up on Sophia Sottero made me feel sick. There’s no way to know if I’ve made the right decision, not until it’ll be too late, but I refuse to second guess myself. Something burned through me yesterday in the park. It was like a spark of fate ignited within me indicating my future was somehow tied to Cole. I don’t believe in destiny, but the surge of—whatever it was—was too powerful to ignore. It made me confidently end the call with Sophia Sottero and walk into Cole Steven’s office today.</p><p>Cole’s sitting on his desk wearing designer jeans that hug his beautiful body perfectly. I wish I could afford jeans like that. After the thought passes, I realize that I’m over-dressed. He swings his legs once, dangling his feet. The desk is made from dark, carved wood. It must have cost a fortune.</p><p>Cole looks up at me from a manila file folder on his lap. “Miss Lamore. Good to see you.” His gaze slips over my body, taking in my formal attire. “For future reference, casual clothing works best here. Crawling around during shoots in a pencil skirt isn’t ideal. I would have mentioned it the other day, but your outfit kind of shocked the hell out of me.”</p><p>The corner of my lips pull up and I laugh. I didn’t know what to expect today, but this surprises me. “That was my intention.”</p><p>“Ah, well. It worked. I’ve never seen anyone show up to an interview dressed like a giant Skittle.” He looks me square in the face and grins. “I was hoping you weren’t insane. Good to see you can dress yourself.” He’s teasing me. It makes me smile and relax a little bit.</p><p>I step closer to the desk, half listening while looking at the books that line the walls. “Har. Har. Very funny. So tell me. Why is this place empty?” I can’t address him with revere, not after the way we met.</p><p>He looks up from the papers in his hands. They look like bills. There are numbers across the sheets, dates, and dollar signs. “What do you mean?”</p><p>“No one is here, except for Amazon Barbie at the front desk. Where is everyone? I would have thought Le Femme had at least twenty employees on any given day, running around half clothed—or half naked, depending on how you look at it.” Was I joking? Where’d the light teasing tone come from? What the hell is wrong with me?</p><p>I blink hard, trying to find my brain and make it work while I scan the spines on the bookcase. It’s filled with art books about Romanticism. My mind tries to make sense of that. The Romantics are known for their somber sublime works. Looking at those pieces of art make the viewer feel a sense of loss and uncertainty. Cole’s work makes people want the girl in the shot, or her underwear. I don’t turn to look at him as I ask. I don’t want him to notice my shock.</p><p>I feel his eyes on my back when he answers, “Miss Todd is the receptionist. She’s here weekdays. Everyone else is already out on the Island. We’re keeping a skeleton crew here for the week. Guess who’s on skeleton staff?”</p><p>I whip my head around, and my hair flies over my shoulders. What? Is he serious? I’m alone with him here for a week? “There’s no one else here? For a week? Why?” My mouth is hanging open. It won’t close and I have no idea why.</p><p>He chuckles and puts the papers next to him. Leaning forward on the desk, he puts a hand on either side of his hips. The effect makes his arms look perfect. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Is that a problem, Miss Lamore?”</p><p>I shake my head. It feels like it’s full of rocks. “No, it’s just—”</p><p>“Just what?”</p><p>I shrug, “I thought that someone else would be in charge of me, I mean my internship.”</p> <p>He looks me over once and says, “Well, like it or not, I’m the boss of you this week. We have a shoot later today, and then three more later in the week. I want you to assist, and then I want you to second shoot on Friday’s session.”</p><p>I can’t swallow. My mouth goes dry. I don’t think I heard him right. Did he say shoot? I cock my head and stare at him like he’s crazy, “Excuse me? Did you say you want me to shoot a real session in less than a week? I’ve never done this before!”</p><p>He blows off my high-pitched protest with a wave of his hand, “You’ll be fine.” He slides off his desk, shoves the papers in his drawer and it finally sinks in. What he said about everyone else being out on Long Island finally sinks in.</p><p>“Why is the staff out East? Is there something going on?” Truth be told, I had no idea what was going on. For all I knew it was a company retreat.</p><p>He shakes his head, “Not really. Just an expansion.”</p> <p>My mouth forms an O but I don’t say anything else. Damn. A second studio on Long Island. Unless he stuck the new studio in the ‘hood, Cole was paying more in rent each month than I could earn in a year.</p><p>He looks up at me. His dark hair curls slightly as it hangs over his forehead. He pushes it back. “Ready?”</p><p>I answer straight-faced, totally dead pan, “Ready as I’ll ever be. Show me to the naked girls.”</p><p>Cole nearly chokes, and then laughingly scoffs at me, “Why do all you feminists think I shoot naked women?”</p><p>I follow him down the hallway. We are headed towards a million dollar shooting room. Curiosity alone makes me want to see it. “Because you do,” I answer bluntly.</p><p>Cole turns and looks at me over his shoulder, “They’re wearing more clothes than most women wear at the beach. That’s hardly fair.”</p> <p>“Life’s not fair, dude. Get over it.”</p><p>He stops in his tracks and turns in slow motion. His dark brows are lifting into his hairline. “Dude? Seriously? You called me dude?” He looks shocked and can’t hide the smile that’s running across his lips.</p><p>Not realizing that I said it, I try to cover my tracks, “No, I—”</p><p>“Said dude. You called me dude.” His eyes are so blue. The way he looks at me makes my heart race. The grin on his face makes the corners of his eyes crinkle a little bit. The expression he’s making is cute and confused. I should be embarrassed, but I’m not.</p><p>I shrug, like it doesn’t matter, “Would you prefer something else?” My lips twist into a smile. I can’t help it. It doesn’t matter that I wanted to torment him yesterday. This side of him makes me want to tease him more.</p><p>His eyes sweep over me before returning to my face. He laughs, “You’re so young. You have no idea—”</p><p>I nod once, the smile fading from my lips. Completely serious, I look him in the eyes and say, “I’m sorry. I didn’t mean to be disrespectful. From now on, I’ll refrain from calling you dude.” He looks at me. I nod, and after a moment, I add in my most respectful voice, “Old dude or geezer would be way better.” Our eyes remain locked. My lips twitch as I try not to laugh. I have no idea why I’m teasing him again.</p><p>He huffs, rolling his eyes, “You’re such a child.” Running his fingers through his hair he mutters, “I’m getting too old for this crap.”</p> <p>“Mmmm,” I answer, “Then you shouldn’t have hired the chick dressed like a circus clown.”</p><p>CHAPTER 11</p><p>The studio is the coolest thing I’ve ever seen. It has everything I want in my own shooting room and more. Cole shows me around quickly and tells me to ditch my jacket and heels. We’re shooting for the rest of the afternoon. A model is due in at any moment. While we are waiting for her, I slip off my shoes and kick them under a table. That leaves me barefoot in a black pencil skirt with a sleeveless blouse.</p><p>I feel underdressed now, but barely process it because I’m too captivated by the shooting room, especially the sets. The walls are lined with them. There are four total—one white, one black, one pink, and one gray. Each set has its own feel and different items. They are all posh feeling with lots of different textures. The white set’s easily my favorite. White flocked wall paper surrounds a white velvet chaise that has a fuzzy white throw over the arm. Bleached wood floors give it just a little bit of warmth so it doesn’t feel sterile.</p><p>Cole speaks as he moves about the room, explaining how the shoot will go and what to expect. “Never touch the model without asking. Never say anything inappropriate,” Cole glances at me like he isn’t sure if I can control my mouth. “Those are the only two rules that you need to know for today.”</p><p>I nod, “What am I going to do? I thought that I’d be getting coffee or something.”</p><p>My gaze is on a rack of wardrobe, if you could call panty and bra sets wardrobe. They are the things we’re shooting today. Honestly, they’re cute. And one is insanely sexy. It is a white shelf bra with a matching lace G-string. It is the kind of thing I would want to wear, but it wouldn’t look good on me. I have too many curves for that kind of skimpy thing. I rub the lace with my thumb, feeling how soft it is.</p><p>Cole stops moving, watching me for a moment before saying, “Maybe if you were at Sottero. At Le Femme, you work. If you don’t work, you don’t get paid.”</p><p>Dropping the bra, I turn sharply. “I get paid?”</p><p>He nods and looks at me surprised, “What’d you think, you were working for free?”</p><p>“Well,” my eyes are wide and I’m still shocked, thinking he’s dicking with me, “yeah. Internships aren’t paid.”</p><p>He shrugs, “This one is. You get about $2200 per week, take home, after taxes. Miss Todd can give you the exact amount.”</p><p>“Holy shit!” the words fly out of my mouth. My jaw is hanging open. I quickly slap my palms over my face and shut the gaping hole to keep anything else from flying out.</p><p>Cole looks at me like I’m crazy. He shakes his head and lifts his camera off a shelf. Selecting a lens, he puts it on and adjusts the settings. “How did you not know it was paid?” He shakes his head. “You’re going to learn so much more here than you would anywhere else.</p><p>“Lesson 1: Never work for free. Some new photographers think you have to, that you can build your client list by offering free sessions. Don’t do it.”</p><p>“Why not?” I ask, still shocked that I’m getting paid and really happy about it.</p><p>He looks over his shoulder at me, “Because free is never free. It always costs something. Money. Time. Reputation. Those are things that you need to work hard to control. Giving them away for free screws with perceived value, and your worth as an artist.”</p><p>I’m staring at the side of his face, shocked. Cole shoots girls in their underwear. What does he know about marketing and business practices? He sells sex, and sex sells itself. Cole notices me staring at him. He glances up and opens his mouth to say something, but the intercom buzzes. The model is in the building and on her way back. Whatever he was going to say died on his lips.</p><p>CHAPTER 12</p><p>For the next three hours Cole is serious. He tells me what to do and I do it. I’m standing, bending, kneeling and doing the assistant’s job. At one point I have to reset the model’s hair. She moved and it’s no longer in place. It’s when she’s wearing that shelf bra. Her perfectly man-made boobs fill the thing up. To make the ad compliant with the company’s guidelines, there can’t be any nipples showing. Cole was right. Most of the shoot hasn’t felt weird, not once I realized that she is covered. The only thing that’s awkward is this.</p><p>“I’m sorry, Cole,” Angela says, her sultry voice matches her curvaceous body. I’m slightly envious, but she’s too tall. In real life it must be hard to find someone to kiss without bending down. That sucks for a girl.</p><p>“It’s not a problem,” he says. “Miss Lamore will reset your hair. Don’t move. Everything else is still perfect.” Cole gestures for me. I step onto the set of the white room, and he says, “Take that strand of curls and drape it over her breast. Ask her before you touch her. Company policy.”</p><p>I feel stupid. She’s leaning backward over the chase. Her hair is spilling all around her and I’m asking to move a strand over her boob. I ask, and do as I’m told. She smiles at me and grants permission. I take the lock and drape it across her flesh, but I can’t see if it covered her properly from the angle Cole is shooting.</p><p>“Is that okay?” I ask and step back.</p><p>“No, I can still see her. Use more strands,” he replies. He’s looking at his camera and adjusting settings. “Make sure I can’t see anything through the center of the curl.”</p><p>I ask the model if I can touch her again and move more curls. Her hair doesn’t want to stay. It slides off her breast and I’m starting to make it frizz. The hairstylist is standing in the corner with her arms folded over her chest. The make-up artist is watching from her chair on the other side of the room. No doubt they both think I’m going to screw this up. How hard can it be to get some hair to stay? She has enough of it and it’s insanely long. I try again, but the curls slide off. I’m starting to get bent out of shape. I’m blushing horribly, touching some girl’s breast and I still can’t do it. I refuse to ask Cole for help, but he’s already next to me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>From over my shoulder, he says, “Hook the edge of the curl on her nipple. The one curl will hold and then you can place another over it.”</p><p>I freeze when I hear him speak, and shiver. The way he says it, like he uses the word nipple frequently, shoots up warning flags in my mind. His proximity puts me off kilter. I feel his eyes on my back, waiting for me to do it. Suddenly I wonder if I can do this job, and everything it entails. Being comfortable around bodies changing in the gym is one thing, touching to make the poses right is another.</p><p>I swallow hard, my fingers hovering above the curl. Cole seems annoyed—or disappointed—and says, “Come on, Anna. This is the last set for today. Once we shoot this, we’re done.” He hoovers, waiting for me.</p><p>My hand is shaking for some reason. It might have something to do with Cole being so close. It might have to do with paying such careful attention to someone else’s nipples. Irritated with myself, I blow out a huff of air between my lips and take the curl.</p> <p>I chose this. I passed up Sottero. This was my choice.</p><p>I do as he says and the curl stays. I beam like an idiot, and then quickly drape the other locks in place. They all hold. I step back into Cole, smashing his toes with my bare feet. He’s not wearing shoes either. Cole steadies me, his warm hands on my elbows.</p><p>From behind my shoulders, he says, “Don’t be shy when you’re shooting. It makes your job harder. You could have used fashion tape to hold the hair in place, but we don’t want to do anything we don’t have to. Tape in hair sucks. The temperature in the room is warm, but it’s still chilly enough—for obvious reasons. I thought you’d be okay with this kind of stuff.” His hands slip away from my elbows and he passes in front of me. The sound of the shutter snapping fills my ears. He’s so at ease, moving, speaking, and acting like this woman is anyone else and not a nearly-naked super-model.</p><p>I don’t answer.</p><p>I didn’t want this job, but I chose it. This wasn’t my career goal, but here I am. I’m perplexed because this shoot isn’t what I thought it would be. I moved at ease through the room, right up until this last part. And the only reason I hesitated was because of Cole. It wasn’t like I didn’t notice the half nude person in the room, it’s that I wasn’t as uncomfortable as I thought I’d be.</p> <p>And Cole, he was nothing like I thought he’d be. I expected him to be sleazy, touchy, and filled with innuendo. As the shoot progressed, I don’t know if he even realized the woman he was shooting wasn’t clothed. This was second nature to him. It’s like he is a fish and this scandalous world of his is water. He doesn’t notice it, and he moves through it with ease.</p><p>Today I learned that Cole Stevens isn’t the photographer I thought he was, and neither am I.</p><p>CHAPTER 13</p><p>Edward’s arm is draped across my shoulder. We are walking down the street to the steady hum of car engines. The buildings glow against the inky sky. The diner was packed after work. We met there, shared a meal, and are walking back to my place. By the time I finished with work, I was starving.</p><p>Edward squeezes my shoulder, and grins down at me, “So, tell me how today went. What do you do all day? How’s working with your boss?” We didn’t talk about work at dinner, instead I put it off. He lifts his chin and we stop at a corner, waiting for the light to change. A car horn blares behind us. When the light changes, we walk in the mass of people.</p><p>I say, “Well, it turns out my boss is Cole Stevens.”</p> <p>Edward gasps, “No way.” He knows who Cole is. Everyone knows who Cole is, so that isn’t surprising. But, like me, Edward assumed someone else would be overseeing the internship.</p><p>Nodding, I say, “Yeah. It turns out that he’s in charge of my internship. I stay here with him to do some shoots in the city this week, and then the rest of the summer, I’ll be out East on Long Island somewhere. I probably should have asked where.” My voice trails off.</p><p>I grew up out there. In the back of my mind, I’m hoping that the new studio is near enough to my parent’s house to commute. Housing arrangements would be an issue, paid or not. Renting something short term on Long Island was expensive.</p><p>His shoulders sag and Edward stops walking, “No. The whole summer? Are you serious?”</p><p>“I’m sorry. I didn’t realize exactly what this internship included until today, but it’s only a few weeks.” He still looks crestfallen. I add, “And it’s not like I’m that far away. I’m sure we can get together a few times a week.”</p><p>He’s smiling at me again. Pulling me close, we stop on the sidewalk. People walk past us, some bumping into me, but I don’t care. In the moment, there is only Edward and me. He lowers his lips to mine and that familiar light feeling floats through my stomach. Gently, he pushes my hair away from my cheek.</p><p>He breaks the kiss, and breathes deeply. A rush of warm breath flows from his lips as he breathes, “Oh God, I want you. When you kiss me like that, I can’t think. You’re amazing.” His fingers tangle in my hair. I look up into his cool eyes. The way he looks at me makes me squirm. Someone bumps my elbow. It brings attention back to where we are.</p><p>“We’d better get home so I can make you think even less,” I try not to giggle. I try to be sexy, but I laugh softly anyway. Taking his hand in mine, we walk faster down the street.</p> <p>By the time we plow through the apartment door, his hands are all over me. One is pushing up my skirt, my leg is hiked up and wrapped around his hips, while he cups the curve of my ass. We don’t break the kiss. I’m so hot. It feels like every inch of me is on fire. I want him. I need him. The place between my legs is throbbing. Feeling his lips there is what I want, but I’m too afraid to ask. I want him to do it, I want him to take me—and not ask permission—to have me how he wants. But Edward won’t do that. He’s too cautious, that carnal part of him seems buried too deep. I wonder if I’ll ever get at the part of him that’s wild and dauntless. The part of Edward that’s more animal than man, the part that wants me in every way. I tell myself that every relationship has problems and that we can learn to deal with them.</p><p>My hand slides down between us and below his waistband. I stroke his hard length, hoping he’ll ravish me the way I want him to. His breath hitches and before I can do anything, his fingers are around my wrist. “Slow down, babe.” He’s breathing hard in my ear, his face is flushed.</p><p>Disappointed I say, “Don’t you ever just want to tear my clothes off and take me?”</p><p>Between kisses down my neck, he says, “Of course.”</p><p>My heart is pounding. Pulling his face back, I hold his cheeks between my palms. Breathing hard I say, “Then do it. Anything you want, anyway you want. Right now.”</p><p>His eyes are wide and dark. They look into mine with an expression that makes me afraid. Edward doesn’t move. His eyes drift lower, watching the deep breaths making my chest rise and fall. After a moment, he steps back and releases me. A rush of cold fills the void. Ice drips down my spine. He’s going to reject me. That look on his face says what I already know.</p><p>He pushes his hair out of his eyes and looks up at me, “I—“ he starts to say, but a noise stops him from speaking. The telltale sound of metal scraping lets us know the door is being unlocked. Emma will step into the room any second. His eyes are apologetic, like he can’t be the man I want.</p><p>I don’t understand.</p><p>We blink at each other as Emma pushes the door open and turns to yank her key out of the lock. She sees us, but doesn’t sense the tension right away, “Hey guys. Anna, you gotta tell me how today went. I can’t wait—” she turns and realizes she walked in on something. It’s probably not what she thinks it is.</p><p>I act like nothing happened, and turn toward the kitchen. I pull open the fridge door and bend over, peering inside. “It was interesting. That’s for sure.” I need a drink. Where’s the wine?</p><p>I hear plastic bags being set on the counter. Emma says, “I bought your favorite.” She holds up a bottle of White Merlot. I could die. Smiling at me, she holds the bottle by the neck. “You guys can celebrate without me. I totally didn’t mean to...”</p><p>I cut her off, “You didn’t. And we already celebrated, didn’t we Edward?”</p><p>He nods, “Yup. Dinner and stuff.” He’s staring at me. I can’t tell what he wants from me. I wish he’d just take me in his arms and say he wanted me. But he says nothing. He stands there with his arms folded like he’s an awkward kid.</p><p>Emma pulls out two glasses and looks at her brother, “Well, I want to hear about it. Sorry if it’s old news to you. So are you staying or going?” She has her fingers on a third glass, but he shakes his head.</p><p>“Nah, I’ll head home. Things to think about.” His eyes are on me, but I can’t look at him. “Congratulations, Anna.” He steps toward me, and kisses my temple. I smile at him, but it’s one of those smiles that feels wrong, like the lines of my face are filled with cement. “See you tomorrow?”</p><p>I nod, “Sure,” my voice is too soft.</p><p>He knows our relationship is broken. He likes slow and steady. I like everything else. Slow makes me fall into a coma. Steady isn’t my idea of romantic. But I don’t want to lose him. In every other way, we’re perfect together. He steps toward the door and lets himself out. I watch him go. Part of me wants to call him back and be with him his way, but I don’t move. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Emma watches me. She can tell I’m out of sorts, but she doesn’t mention it. Instead we talk about Cole and work and half-naked models. I tell her that I hold reflectors, move lights, and adjust things on set. I leave out that adjustments include things of a more sensual nature.</p><p>“So, Cole was with you today?” she asks, knowing it’s weird. “Anna, interns are treated like dirt, and you have the owner doing yours. You ever wonder why?”</p><p>For a second the only response I have is a half open mouth. “I have. And I don’t know. For some reason he didn’t want Sottero to have me. That much, I’m sure of.”</p><p>She nods at me. Although she hasn’t said it, the question—the reason she’s thinking—has crossed my mind as well. Maybe it was more than he didn’t want Sottero to have me. Maybe he actually wanted me. But that doesn’t make sense. I have next to no reputation, and the one I do have says I’m a pain in the ass, stubborn to a fault.</p> <p>“So, next week you’ll be out East somewhere. How’d Edward take that?” she asks, and then adds. “You don’t have to say anything, if you don’t want to, but when I walked through the door, you looked like someone hit you in the head with a frying pan. I’d be a shitty friend if I didn’t ask.”</p><p>I snort, and pull my knees into my chest. We’re sitting on the living room floor. Half the bottle of wine is gone. Tucking a stray hair behind my ear, I stare at my glass, “He was okay with it. That’s not the problem. He’s always supportive, exactly the kind of guy a girl hopes for.”</p><p>She watches me. After a moment she asks, “But not you?”</p><p>Shrugging, I say, “It gets into things I can’t discuss with you.” I stare at my toes. Sighing, I finally just ask her, “You know I’ve only had two serious relationships. One was a stoner, and the other was—” I try to find the right words, but Emma choses them for me.</p><p>“A dick.” She throws back the rest of her wine.</p> <p>I nod, “Yeah, so I don’t really know what to expect. I mean, if a guy was great in every single way but your bedroom preferences didn’t exactly line up, what would you do?” I stumble over the words as I say them.</p><p>She blinks once and stares at me. “If you asked me that before my third glass of wine, I think I would have puked on you. And I might now, anyway.”</p><p>I roll my eyes at her, “Stop it. Be serious for once. I need you. I’m not talking about your brother. I’m talking about me. I’m a freak, Emma. Guys seem to think that I’m this little goodie-two-shoes kinda girl, and I’m not. I want things... things that they seem to think are weird. What do I do?”</p><p>Emma seems intrigued. “What kind of things do you want that no one will do?”</p><p>I shrug, “I don’t know. Things.” I can’t say it. I don’t want to. But I know what I want, and if I’m with Edward, I’ll be three for zero, in terms of guys that make me melt.</p><p>“Okay, you’re a bad liar. But I understand if you don’t want to tell me. I’ve done some things that I wouldn’t tell anyone about either.” I glance up at her surprised. She shrugs, “The right guy makes just about anything sound sexy. But that’s not your problem.” She pushes her dark hair out of her face. “I wouldn’t throw away an entire relationship based on the sex, but staying in a relationship where you both want different things, I don’t know...” Her tone is leading, but she’s saying what I already know.</p> <p>“It’s settling, isn’t it?”</p><p>“Seems that way,” she nods and reaches for my glass. She refills both our cups and the bottle is empty. She glances at her glass, “After I drink this, I won’t have any recollection of our conversation, so if you have to ask me funky sex stuff that involves my twin, you’d better do it now.” She makes a face and I laugh.</p><p>I hold onto her shoulder, “I can’t do that to you. Telling you that I want more than he’s willing to give is enough.”</p><p>“And that’s the problem that you’ll face with every guy,” she lifts her glass and taps it against mine. The crystal rings. “Cheers, Anna. May your future be filled with someone who can give you everything you need.”</p><p>CHAPTER 14</p><p>“That’s not what I need,” Cole says in a huff.</p><p>He pushes past me and grabs a different white cloth from the prop closet. There are so many props. I have no idea how he decides which to use. He steps in front of me, takes the prop, and walks toward the set.</p><p>A model is sitting on a chaise with her back toward us. She’s wearing a tiny panty made of strings. It connects below her hips with a snake wrapped around a red crystal apple, the symbol of Evil Eve. Like Eve was in on it with the serpent in the Garden of Eden. I keep my feminist statements to myself, and follow Cole.</p> <p>“The set is too smooth,” Cole explains. “Adding something like this will visually add texture and softness. You want the viewer’s eye to rest on the curve of her back, right where that apple is. The snake is the leading line that creates the flow of the composition. If you don’t put something in the bottom quadrant of the image, it won’t work as well.” Cole tosses down a fuzzy white rug. He bends at his knees, barefoot, and plays with it until it lies haphazardly, like was thrown there.</p><p>I watch him place the rug, but I am having trouble. Shaking my head, I say, “I don’t see it.”</p><p>He doesn’t turn toward me. Instead he lifts his camera to his eye and shoots. His fingers curve over the lens and the shutter snaps. Over his shoulder, he says, “You will.”</p><p>I don’t reply.</p><p>Cole shows me settings on the cameras and lights. He has me move things on set. Basically, I’m his beckon girl. He asks for something and I do it. As the day progresses, I’m starting to see what he’s doing. It comes together with the shoot from the other day. He works his way through the four sets, always shooting to show the model’s best assets while complimenting the teeny tiny lingerie she’s wearing. The trademark Le Femme sexy poses aren’t by accident. Every bit of them is Cole. It’s the way he sees a scene and makes it come together.</p><p>At the end of the day, I’m backing up the shoot onto his computer along the back wall of the studio. Cole walks up behind me after shutting off the lights in the massive room behind us. The crew and model have left. It’s later than usual. I want to leave, but the shoot ran late.</p><p>I watch the data transfer. As each thumbnail shows up on the screen, I look at it. I kind of like that panty after seeing it all day. It’s sexy, or at least I think it is.</p><p>I wonder how many things are sexy because someone told me they are.</p><p>Cole reaches past me, his finger pressing the screen. A thumbnail just appeared. He’s pointing at it, “That’s the shot before the rug. This is the shot after.” He leans in, not paying attention to how close he is, “See how this image makes you glance and look away?” I nod. It does do that, but I didn’t know why. “It’s because the composition is messed up. The flow is broken. There’s nowhere for the eye to rest or reenter the image. But this one,” he points at the picture with the rug, “is better. Since it’s white on white, the texture doesn’t detract from the focal point, but it lends to the overall image.” He turns to look at me. He’s in my circle of space, but I don’t feel the need to force him out. Although I haven’t been around Cole very long, I’ve already noticed that he isn’t a touchy person. He doesn’t seem to linger this close to anyone else. I wonder if he’s doing it on purpose.</p><p>“This shoot was more risqué than the one we did the other day.”</p><p>I nod slowly, “Yeah, I suppose it was.” He’s still too close. I arch a brow at him, wondering what he’s doing.</p><p>He grins, “You didn’t notice, did you? That she was wearing a piece of string all day?”</p><p>Thinking about it, I lean back in my chair. Cole steps in front of me and sits down on the desk. “I suppose not. Actually, I hated that piece of clothing this morning... but it grew on me during the day.”</p><p>His eyebrow rose, surprised, “Did it?”</p><p>“When I first saw it, I thought it was saying women are evil, you know the temptress bitch scenario.” He laughs even though I’m being serious. “Shut up. It’s real. Look it up,” I say, grinning. “Anyway, as the day passed, I thought it was sexy. I think that’s kind of amazing about this place—you get to define what’s sexy.”</p><p>His arms fold over his toned chest while I speak. There’s a gleam in his eye that I can’t ignore. It makes my stomach flip-flop when he looks at me like that. “That’s why I wanted you to work here. I knew you’d see it. Le Femme isn’t about making women into sex objects. You missed that before. When you first spoke to me, that was all you thought we were. But now you see it. Don’t you?”</p><p>I nod. Cautiously, I say, “It’s more about defining femininity and power. You showcase your ideals, putting them into pictures.”</p><p>I’d only been here for a few days, but there is a reason why I am the best in my class. I see things no one else does. When I find something I don’t understand, I want to know everything about it until I understand it fully. Right now, I feel that way about Cole. He confuses the hell out of me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I tilt my head, looking up at him, “Was that your intention when you started shooting?”</p><p>He laughs, “You didn’t ask if you were right. Most people would have waited for confirmation of their claim, and then asked the next question.” He has a dimple on his cheek when he smiles hard.</p><p>“Dude, we both know I’m right and that I’m slightly arrogant—kind of like you—so let’s just call it what it is so you can answer my question.” He laughs. “When you started Le Femme, did you set out to showcase femininity and power?” Sometime while I was speaking, I sat up. By the time I finish, the tips of my fingers are on his knee, and I am looking up at him. I smile noncommittally, and lean back into my chair, slouching, not sure why I did that.</p><p>His lips press together into a straight line, almost disappearing. His hands rest on either side of his hips on the desk. He leans forward when I lean back, “You’re dangerous, you know that? Not only do you see things clearly—well, when you actually take the time to look at them—but you also call people on it. You demand honesty.”</p> <p>“I’m scary as hell,” I joke.</p><p>“More than you know,” he says seriously. His eyes rove over my face like he’s considering something. He looks to the side, careful to avoid my eyes. Rubbing an imaginary spot on his jeans, he says, “I started Le Femme as a fly-by-night artist. I wanted to be a painter, but that didn’t pay the bills. Someone took pity on me and handed me a camera. I was able to cut my own path from there.</p><p>“When I was on my own, I didn’t like what I saw. Women were portrayed as weak. They were cast into a mold that no longer fits,” he looks up at me and continues, “if it ever did. The pieces that dominated the market only show a certain type of woman—a specific type of beauty. I want to show what I think is beautiful. I want the world to see things through my eyes. And I can do that Anna, I can make you see my perspective through this lens.” He taps at the glass on the end of his camera and looks up at me. “It tilts the world on its side. It has the potential to change everything, every concept you have, every belief you hold...” he places the camera down and shakes his head, running his fingers through his hair. “God, if you saw my earlier work, you wouldn’t believe it. Le Femme pays the bills. Le Femme is the tame version of me and that’s the Cole Stevens the world knows.</p><p>“So, yeah, my ideals leaked into my work. I’ve found that it’s impossible to keep them out, no matter how hard I try.”</p><p>While he speaks, I’m glued in place, mesmerized. His blue eyes pierce me and hold me still. I forget to breathe. Stunned, I wonder, who the hell is this? Who is this man? Do I know him at all? Was every assumption I made, every educated guess about him completely wrong?</p> <p>I drool at him, lost in the shy passion barely contained in his voice, until he says he was on his own. Liar. I know that’s not true. I know he comes from money. Everyone knows that, so I wonder why he says it—why he tries to tell such a blatant lie. Does he think I’m a moron? Maybe. Instead of calling him on it, I listen to the rest of his story. His passion is addictive.</p><p>As soon as he stops speaking, I want to hear more, even if it is lies. No one talks like that anymore. No one says what they actually think, what they believe. I find myself staring at his dark eyes wondering how I could be so drawn to him when we are so different. It’s a question that I smash away with a mental broom as soon as it surfaces. Thinking about Cole Stevens is not the pastime of a prudent person.</p><p>My inner-self reminds me that I am not a prudent person.</p><p>Damn.</p><p>CHAPTER 15</p><p>The week creeps slowly by. The days are long and every minute of it spent with Cole. Work is more fun than I expected. I still wonder if I made the right decision. I have no idea what to do later in life with the things Cole is teaching me. I’m not going to shoot this kind of stuff, although I start to see more of him. He seems to trust me, and speaks more freely. It’s strange how often I have a smile on my face lately.</p> <p>I am seeing double by the time we stop after lunch. Cole stays in order to keep working, getting ready for a meeting later, but he sends me home. The halo that’s burned into my retinas from editing images all day on the computer has started to dull and fade. I don’t know how he stares at a screen all day.</p><p>The changes he makes to the photos during editing are so minute. It’s like shifting a grain of sand on the beach. The one tiny movement seems to pull the whole thing together. I’m still uncertain of myself, of what he expects from me. But I show up and I’m trying. I feel like there’s more to learn from him, but I’m not sure what. The speech he made the other night is still fresh in my mind.</p><p>I avoid Edward. I don’t know what to do with him. He said he loves me. I owe him an honest explanation about what I’m thinking, I know I do, but I can’t do it. Not yet. Mainly because I have no clue what I’m thinking.</p><p>I pull my hair into a pony tail and slip on a pair of cotton shorts and a tank top. My plan is to lounge in front of the TV while Emma is out, and let my subconscious deal with Edward.</p><p>As soon as I kick my feet up, my phone rings. I tilt the screen so I can see the name. SUFFOLK COUNTY POLICE is across the screen. Sitting up, I answer it. “Hello,” I say, wondering who is on the other end of the line.</p><p>“Anna, good you’re there.”</p><p>“Cole?” I ask, shocked. “Are you okay?”</p><p>“Yeah, I can’t talk. I only have a minute. I hate to ask you this, but I need a huge favor. I’m in jail. Please go to the studio, take cash out of the safe. The combination is scratched onto the back of my main camera body. Take ten grand and come get me out. Please.”</p> <p>I’m trying so hard to remember everything he says, but I just blink at the phone like it’s a joke. “You’re serious? You’ve been arrested and you’re all the way out in Riverhead?”</p><p>“Yes,” he says. “If you don’t get here by six, I’m going to be stuck in a cell overnight. It’s four now. Do you think you can make it?”</p><p>I glance at the clock. There are a million questions I want to ask. Emma walks through the door, but I ignore her. “Fine, but you owe me huge.”</p><p>“Fine, anything you want. Just don’t tell anyone. That’s why I asked you.”</p><p>I scoff at that. Walking away from Emma and into my room, I close the door and hiss, “You trust me? Are you insane? How the hell am I supposed to keep this a secret? You’re a frickin’ socialite! The papers will be all over this!” I rub the heel of my hand over my eyes. I have no idea why he called me. Me, out of all people!</p><p>Cole says, “I have a pretty good idea of what kind of person you are. You won’t tell the press. I know you won’t. And you keep your promises.” It’s a statement, a true cold hard fact that he picked up from working with me for hours on end. In that moment I understand why he called me and not someone else. I won’t draw attention, no one knows who I am, and no one would ever expect the intern to go bail out her boss.</p><p>He trusts me. And he’s shrewd.</p><p>“Gah,” I sigh like a melodramatic teenager and laughingly say, “You suck. You know that.” But I’ve already made up my mind. Cole was right. I won’t tell anyone he’s in jail and I won’t tell him no. I can’t turn my back on someone who asks me for help. Call it a code of ethics, or maybe it’s just a desire to be a better person, but somehow Cole sniffed it out. And that made him call me and not Miss Todd.</p><p>Shaking my head, I say, “Riverhead. Fine. I’ll be there in a couple of hours.”</p><p>He’s quiet for a moment then says, “Thanks, Anna.”</p><p>“Sure,” I reply. I press END CALL and he’s gone.</p><p>CHAPTER 16</p><p>When I hang up the phone Emma is lurking in the kitchen. She’s a bit of a busy body, always wanting to know what’s going on. I suppose that fits her personality. “Hey,” she says smiling at me. “You’re home early.”</p><p>I tug on my boots quickly and lace them up. When I come out of my room, I’ve already pulled on jeans and my leather jacket. “Yeah, well, it was short-lived. I have to go out to the Island. Something came up. I’ll probably just stay out there tonight.”</p><p>My parents live out there; I could crash at their house after I free Cole. I wonder what he did. I walk to the closet and pull out a black full face helmet and a second larger helmet. It’s white like a giant ping pong ball. Emma’s eyes drift to the white helmet.</p><p>“Riding out there with someone?” she asks. Emma is leaning her hip against the counter. Her arms are folded over her chest. She seems relaxed, but I know she’s not. I’m moving too quickly for her to think everything is all right.</p><p>I shake my head. “No.” I hold up the white helmet on my fist, “I prefer this one at night, if I ride back later.”</p><p>She arches her eyebrow, “Since when?”</p><p>“Since it’s summer and I’m taking Ocean Parkway. Geeze, what’s with the third degree?” I’m a little defensive. I strap my backpack on. This is insane. I’m going to be riding with ten grand in cash on my back.</p><p>She shrugs and uncrosses her arms, “Sorry, I didn’t mean anything by it. I just wanted to make sure you were okay.” She walks into the kitchen and grabs a loaf of bread. “You want some food to take with you? I can toss you a PowerBar or something.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I shake my head and grab the keys to my bike. “Nah, I’ll eat once I get there. Talk to you later.” And I’m out the door.</p><p>I fly down the stairs and run across the street into the parking garage. My bike is right where I left it. Grays and blacks cover the frame. There isn’t a spec of chrome or plastic on it. A pink stripe goes down the gas tank and explodes into a splash of color. Swinging my leg over the side, I kick start the thing—mostly because the time constraint is making me nervous—and pull out.</p><p>I zip in and out of traffic like I don’t value my life. It’s too close to rush hour. If I don’t get to the Tunnel fast enough, I’ll be trapped. I’m lucky. I manage to get downtown quickly and park on the sidewalk in front of Le Femme.</p><p>I rush past Miss Todd, saying that Cole forgot something. She eyes me suspiciously, but doesn’t follow. I find his camera body and flip it over. No scratches. No safe combination. Damn it. Where’d he put it? I turn it over twice in my hands, looking for the markings, but don’t find any.</p> <p>I’m wasting time. I reach for the other camera bodies, but those are all clean too. I go back to the first body—the one he always uses—and take off the lens. I look at the housing between the body and the lens, tilting it to try to see hidden markings, but nothing’s there. I reattach the lens and flip the camera over in my palms. Opening the battery door, I slide the battery out and still see nothing but black plastic.</p><p>My heart is pounding. This is taking too long. Pressing the lever for the memory cards, the little door on the side of the camera swings open. Three numbers are scratched into the curve of the casing on the inside of the door. I exhale a rush of air.</p><p>Taking the camera, I run to Cole’s office, and open the safe. There are several things that catch my eye, including a small Tiffany’s ring box. It’s pale blue with the famous logo printed in silver letter across the case. Normally I wouldn’t snoop, but the box looks like it’s been crushed, stomped under foot. The blue leather is gashed and scuffed. The lid no longer closes correctly. It pains me to look at it. Something happened involving this piece of jewelry. I reach for the tiny box and lift it out. The lid falls off in my hands to reveal a solitaire engagement ring. The stone is huge and perfect. I lift it from its padding for a moment, staring at it, wondering who it was meant for and what happened when he gave it to her. From the look of the box, it didn’t end well. My heart sinks as I hold the ring. Cole acts pulled together, but at the moment I’m not so sure. It’s like he puts his best foot forward and hides the rest. Things like lost loves and battered Tiffany’s boxes aren’t visible on his face. I breathe slowly and realize I’m holding a piece of Cole’s past, something he locked away from the world. I return the ring to the box and put it back. Ignoring it, I reach toward the back of the safe where cash is piled in neat little bundles. I grab enough stacks and shove them into my backpack. Miss Todd is going to think I’m a thief if she sees me. I move faster.</p><p>Before I slam the safe closed, a piece of paper falls. I reach out and catch it. It’s an old photograph. I can’t ignore it. It’s out an old picture of Cole wearing army clothes. STEVENS is across his chest, some medals line the other side. His eyes are cold and hard. He looks so young, younger than I’ve ever seen him. I flip the piece of paper over, looking for a date, wondering if it’s real. Was Cole a solider? Why would he enlist?</p><p>Before I have another moment to consider it, I hear Miss Todd’s heels clicking down the hallway toward me. Her slow steady sashay gives me time to put the photo back where it was, close the safe, and zip up my backpack.</p> <p>When she walks through the door, I held up his camera like I’ve found it. She cocks her head at me, like she can’t believe it. “He forgot his camera?” she asks, her narrow arms folding over her chest.</p><p>I nod and stuff that into my bag too. “Yeah, well, these things are expected. I think Cole’s getting a little senile,” I smile as I say it, half joking and not offering any other explanation. I have to get out of here.</p><p>She doesn’t laugh at my joke. “But he went to a business meeting. At least, I thought—”</p><p>Nodding, I pass her and head toward the door. Speaking over my shoulder, as she follows me out, I say “He was. Then he said he wanted it. I don’t know. Cole said he usually has one on him, and asked me to grab it. He’ll be back later tonight. Tease him then. I sure will.” Smiling at her, I wave and run through the door, leaving Miss Todd standing there with a response on her lips.</p><p>The cash on my back is making me nervous. If I get pulled over for driving like a crazy person, they’ll instantly add my name to the terrorist watch list. That would suck. Checking the time, I see that I’m cutting it really close.</p><p>After pulling into traffic, I open the throttle and punch it. The bike takes off, humming like a bee. I bob and weave through cars and trucks trapped in rush hour traffic. As soon as I’m back on Long Island, the wave of panic recedes. An hour and a half later I’m in Riverhead and my butt is vibrating like I’m still on the bike.</p> <p>I leave my helmet with the motorcycle and walk into the jail. After a few wrong turns, I’m sent to the right person.</p><p>An old lady with face-saddlebags looks up at me, “Who are you here for, hun?”</p><p>I’m out of breath, and sweat makes my hair stick to my face. I push it back and say, “Cole Stevens.”</p><p>She looks up at me from her metal desk. The eyebrow drawn on her face doesn’t move. “The bail bondsmen closed at five. You’ll have to wait until tomorrow. Next.”</p><p>The guy behind me tries to push me out of the way, buy I hold out my arm like I’m going to close-line him if he tries to push in front of me. “Wait. I don’t need a bond. I have cash.” I say to her, reaching around for my bag. Suddenly I feel like saying that out loud was a stupid idea.</p><p>The look on her face confirms my stupidity. She sniffs and raises her bloodshot eyes back up at me, “You have ten grand on you? In cash?”</p><p>I nod. The tension in the room jumps about ten slots. She waves a pudgy hand at the guard. He steps closer. “We need a secure desk for this one.” She jabs her thumb at me. “She walked in with ten grand in cash.” They both roll their eyes like I’m an enormous pain in the ass. It’s just after five, but by the time they get a secure desk, which was me and another civil service employee and a cop, it was nearly 6:00pm.</p><p>They are talking to each other after the amount is counted, and acting like I’m not even there. Finally, the woman hands me the bail slip and spews a bunch of stuff about how to get the bail money back.</p> <p>“What do I do now?” I ask.</p><p>“Nothing,” the cop says from behind me. “They’ll show the judge the bail, and he approves it. If he gets the slip in the next ten minutes, your friend is out today. Otherwise, come back first thing tomorrow.”</p><p>I nod and go to the waiting area. It’s half empty. A pregnant woman sits across from me on a wooden bench from the fifties. No one looks at anyone else. I wonder what Cole did to get tossed in here. Part of me is nervous about that. I don’t want to ask. It will conflict with the new image of him that’s floating through my mind.</p><p>I think about the picture in the safe, that younger version of Cole in the uniform. I realize that I have no idea who he is. It’s strange because after the past few days, I felt like I did know him. Cole seemed more at ease. He didn’t hold back when he was teaching me. Passion filled his voice when he spoke about photography and art.</p><p>But this? This is insane. I hardly know him and yet I’m the one he trusted with his safe combination and bail money.</p><p>The metal security doors open and a cop walks through with Cole. He’s dressed in a black suit. The jacket is hanging over his arm, his shirtsleeves are rolled up. Cole looks like he fell asleep in his suit. The cop tells Cole to get his things from the cashier’s window, and then turns and walks back behind the doors.</p><p>The few people in the room look up when Cole walks out and quickly avert their eyes. Cole straightens his shoulders like he doesn’t belong here. His cool blue eyes scan the room. He sees me and nods. I walk over to him. Part of me hesitates, like he could be dangerous, but my feet keep moving. I stop next to him.</p><p>Cole turns toward the cashier’s window and takes a yellow envelope from the woman. He puts a ring back on his finger, his watch, and stuffs his wallet into his back pocket. He hands the envelope back to the woman and she throws it in the trash.</p><p>Cole turns and I follow him to the doors. When we step outside, there are no reporters. He smiles at me, “You did good, kid. Thanks.” He sounds relieved. His posture changes and his shoulders relax a little. He takes a deep breath and runs his fingers through his hair.</p><p>I want to roll my eyes when he calls me kid, but I tease him instead, “No prob old dude,” but I’m tense and I know he can hear it in my voice. Cole looks around, breathing the air like he was inside too long. I can’t keep quiet. I have to know. “So, what’d you do?” He eyes me, startled, almost. He seems surprised that I ask. Tilting my head, I fold my arms across my chest saying, “You can’t ask me to drive all the way out here and not tell me. What’d you do?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He sighs and rubs his hands through his hair again. He does that when he’s upset. I’ve seen him do that at work when he can’t get a pose to work right. “It was nothing. Really—”</p><p>I can’t let it slide. It would be the height of stupidity to do this and not insist on knowing what happened. I lean my face a little closer to his. Catching his gaze I say, “Ten grand worth of nothing? By the way, that was insane. You have a mini bank in your office. Who needs that much cash? Is that why they picked you up?”</p><p>He shushes me, and puts his hand on my back, leading me toward the parking lot. “Oh my god, Anna. Stop talking. Really. They’re still criminals around. Do you want my office to be tossed before we even get back?”</p><p>Turning to look up at him, I ask one more time—one last time, “Listen, I think you’re...” I’m so upset that I want to cry. I like working with him. I like my internship and whatever he just did shot it all to hell. There is no way I can finish now, and the craziest part is that I want to. When did that happen? I push away the thought. I’ll deal with it later.</p> <p>A knot forms in my throat. “Why’d you have to go do something horrible, Stevens? I actually liked going to work, and now you messed it up.” I rub my face with the heel of my hand.</p><p>“What?” Shock is in his voice.</p><p>We’re standing on a cement island between the police station and the parking lot. I’m so disappointed with him that I can’t hide it. “I can’t work for a felon, and I think it’d be better for both of us...”</p><p>His laughter cuts me off. His face lights up like I said the funniest thing ever, “What are you talking about, Lamore? You think I did something? What do you think I did!”</p><p>“I don’t know. Something bad, since you won’t tell me. I can’t work for someone who might knock me into the East River one night.” I’m only half joking. He worries me now. I thought about it on the way out here and unless he was tossed in the slammer because of unpaid parking tickets—which he should have been able to tell me—then I can’t work for him anymore.</p> <p>“You watch too much TV, Anna. Seriously.” He scans the parking lot. “Where’s my car?”</p><p>I look at him like he’s crazy, “Not here. I took my ride. And I’m leaving.” I wait half a beat and when he says nothing, I say, “Have a nice life, Cole” and walk away.</p><p>Cole reaches out and grabs my arm. A shiver shoots through my body from his touch. I jerk my arm away. He holds his hands up, like he doesn’t want to fight, “Sorry. I didn’t mean to...” he closes his eyes. When he opens them again, he says, “Anna, I didn’t do anything. I was headed out here for a meeting and got ID’ed. Apparently some tranny slugged a cop today. I—” he swears and shakes his head “I can’t believe you’re making me say this. I got picked up because I look like him. They took me in because I matched his description. Then, I called you. Nothing happened. I swear.”</p><p>I stare at him as he speaks. My lips part and my jaw drops. “You were arrested for looking like someone else?” He nods. “Someone who assaulted a cop?” He nods again. “A transvestite?” my voice squeaks the question as my lips quiver into a smile.</p><p>“Yes,” his hisses, obviously still mad. “Now you see why I didn’t want to tell you, and why I don’t want anyone else to know. It’s the kind of mistake that smears people and it doesn’t matter if it’s not true.” The strain flows out of his voice and I feel his hand on my shoulder. I’m shaking from trying not to laugh. “Miss Lamore?”</p><p>I don’t trust myself to answer; I nod, “Hmmm?”</p> <p>Both his hands rest on my shoulders and I avoid his gaze. The giggles lick my stomach and toes, causing convulsions to rake through me as I try to hold myself still. Cole lifts my chin to meet his eyes. When a smile forms on his lips, I’m doomed. Before I know what’s happening, we’re both laughing. I double over, clutching my stomach, barely able to stand. Cole is leaning on me, laughing just as hard.</p><p>Wiping a tear from the corner of my eye, I straighten and look at him. “Your secret’s safe with me.”</p><p>“There is no secret, Miss Lamore. I don’t wear women’s clothes. I don’t punch police officers.” He’s still smiling, his voice lighter. He shakes his head at me, like he can’t believe he’s laughing. He must have sat inside stewing for hours. “So where’s this car of yours?”</p><p>Looking him in the eye, I grin, “I never said it was a car. Come on, old dude. I’ll take you home.” He follows me through the parking lot. When we stop before the bike, he tenses. I shove the golf ball helmet into his hands and tell him to put it on.</p><p>“You’re kidding?” he asks, his voice too high. “You drove here on that?”</p><p>I nod, fastening my chin strap. Swinging my leg over the seat, I say, “Yup, I rode here on this. And this is your ride home. Get on.” I start the bike, but Cole just stands there. I glance back at him. “What?”</p><p>“They just accused me of being...” he sputters, blinking hard like he’s in a nightmare, “I can’t ride two-up on the back of a pink bike with a girl helmet.”</p><p>Grinning, I pat the seat, “Come on, Cole. Suck it up. Be my bitch for a few miles and we can call you a cab. There’s a diner a few miles away. We can stop there, I can eat—you can grab a cab from there, that way no one knows where you were.” His lips are in a soft smile, like he’s in shock, and I wonder if he is.</p> <p>Finally he slams the helmet on, fastens it, and gets on the bike behind me. “You’ve done this before? Driven with two people on this thing?”</p><p>“Yeah, just keep your feet up and don’t grab my boobs if you freak out.” He laughs. I feel his hands slide around my waist. His weight shifts behind me when he puts his feet on the back pegs. “Hold on tight,” I say, and we’re off.</p><p>CHAPTER 17</p><p>The diner was one of those circa 1950 deals, complete with shiny façade. Cole and I walk inside. Before we even have a chance to sit down, a guy walks in behind us with a girl on his arm. Her hair is teased out to Mars, and her implants bounce around under a tiny tank top. She’s snapping her gum and I instantly hate her.</p><p>A middle-aged waitress sees us and holds up her pointer finger—the universal signal that she’ll be right back. I glance through the place. There are about five tables filled, all in the same section. Great. That means she’s waiting tables alone, so gum-smacker would end up right next to us. I try not to roll my eyes.</p><p>I don’t really notice the guy she came in with until he speaks. He has that fake Brooklyn accent that Italian guys think is so macho. He’s wearing a bowling shirt with a once-white undershirt peeking out. His hair looks like a skunk crawled onto his cranium and died. There’s a peppering of dark hair all over his body. He looks like a Sasquatch with gold medals hanging around its neck. When he walked in, he had his hand in the girl’s back pocket. They were laughing like something was hysterical.</p><p>It doesn’t happen until the waitress walks away. The tension didn’t balloon into anything until the ape-man tapped Cole’s shoulder, “Hey buddy, you lose your balls or what? Who the fuck lets the dame drive?” He snort-laughs like he’s hysterical.</p><p>As he’s speaking, I turn and glance over my shoulder at him. My mouth starts to open with some snappy retort, but Cole’s already acting. His fist flies into the man’s face and connects with his nose in a loud crack. The hairy guy grips his face and blood streaks between his fingers. Before he can say a word, Cole is tugging my hand and pulling me out the door.</p><p>I’m stumbling through the parking lot toward the bike. Ape-man’s girlfriend follows us out, but she doesn’t approach. Instead she stays by the door screaming profanities at us, saying she’s calling the cops.</p><p>“Cole, what the hell was that?” I finally manage, looking back over my shoulder. He sucker punched a guy in the face. Every muscle in Cole’s body is tense. His fingers release my wrist when we get to the bike. He thrusts my helmet at me, an obvious sign that he wants to leave.</p><p>“Are you insane?” I scold. “You just made bail and now you punched some schmuck in the face?” I’m yelling and shaking as I start the bike.</p><p>Cole says nothing. We pull away and I don’t know where to go. If they called the police, Cole’s screwed. He doesn’t tell me where to go or where to drop him off. He just sits on the back of the bike with his hands around my waist, rigid and fuming.</p><p>Since we are already out on Long Island, I decide to head toward my parent’s house. They aren’t too far away, and with the way Cole’s fingers are digging into my sides, we can’t get there fast enough. His reaction seems unwarranted, but he had his masculinity questioned too many times today. Apparently he was at his limit.</p><p>Cole doesn’t complain, but I can tell the bike isn’t his thing. Instead of wrapping his arms around my waist, he’s been trying to keep a respectable distance between us, which makes it harder for me to keep a respectable distance from the asphalt. Cole didn’t do corners when we started, but after the diner, he holds me tighter and leans farther as the bike winds down the ramps and turns corners. It makes it a hell of a lot easier to drive. I can’t really blame him for not adapting to the motorcycle at first. Trust fund babies don’t ride Harleys, not unless they are taunting some distant relative into disowning them. Me on the other hand, I was on my own and could do whatever I damn-well pleased. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The bike slows to a crawl and I stop a few houses down from my parents. Cole’s grip on my waist loosens. Lifting my visor, I speak to Cole over my shoulder, “My parent’s house is right here.” He looks surprised, so I explain, “A guy and girl on a bike with a pink splotch is kind of easy to pick out. If that guy at the diner called the cops—”</p><p>He cut me off, “I know. I’m out on bail, even though I didn’t punch the cop earlier.”</p><p>I nod. “I know and it looks like you’re punching your way to the Jersey shore.” My lips pull into a smile. Cole’s grimace doesn’t crack. I get serious, “Hey, stay here for the night. It’ll give you a few hours until your lawyer is back, and then you won’t have to worry about being thrown in jail. From what I’ve heard, if you get tossed in after six, you stay there for the night.” I cringe, and look at my parent’s house muttering, “Although I’m not really sure if this’ll be much better.”</p><p>Cool blue eyes examine my face. They move from my left eye to my right, then down. It is such a sweet expression. I can tell that he doesn’t understand why I’m being so nice to him. Looking at his hands, he asks, “Why are you helping me? I mean, I know you’re altruistic, but I kind of deserve whatever I get after today.”</p> <p>Glancing at the side of his face I notice a dusting of stubble lining his jaw, and the tension lines between his eyes. “Yeah, well...” I debate telling him how much he’s grown on me, how much I like him. “Let’s just say that I wanted to punch the girl in the face, but I didn’t have the guts to do it. We’re a little more alike than I would have thought.”</p><p>“Well spoken,” the corner of his lips twitches like he wants to smile.</p><p>I grin, “Well, one of us has to be. We can’t all turn into thugs and just smash people.”</p><p>“Assholes,” he corrects. His hands rest on my thighs just below my hips. The weight of his palm feels good. The crinkles at the corners of his eyes make me smile.</p><p>I laugh, “Fine, assholes. But I gotta tell you, my dad will probably mess with you, call you a girl, tell you that your way too old to be his daughter’s boyfriend—and if you punch him—he will shoot you in the face. He’s crazy like that.”</p> <p>I pull my visor down and drive down the street with Cole sputtering, “Boyfriend?”</p><p>CHAPTER 18</p><p>We’re standing on the front porch. I’ve rung the bell and we’re waiting. I can hear my Mom upstairs in the kitchen. They live in a spilt-ranch, so the house is broken up into several levels. The clatter of kitchen noises carries out onto the porch. The screen door is open to cool the house. The sun has set and the street lights just came on.</p><p>It’s a balmy night. I pull my hair into a ponytail to keep it from frizzing, while we wait.</p><p>Cole follows me and stands there watching me before saying, “Boyfriend?”</p><p>I nod with a plastic smile on my face, my eyes looking straight ahead, knowing exactly what we are in for. “Yup. Wait and see. It doesn’t matter what you say. I could tell them that you’re a gynecologist making house calls and they’ll still say that’s nice.” I glance over at him, “They’re insane.”</p> <p>An older woman emerges on the landing. We can see her through the door. She’s wearing a swimsuit cover-up. Her dark hair is frizzed at the temples. When she looks up, she walks toward the door with her arms extended, like she’s planning on hugging me through the screen, “Anna, honey!” She’s beaming, all five feet of her. Turning, she calls up the stairs, “Anna’s here! Set another plate!”</p><p>I pull open the screen, and say, “Hey Ma,” when she leans into hug me, her eyes shift to Cole who is standing behind me in the shadows. She stops, mid-hug.</p><p>“And who’s this? You seeing someone without telling us?”</p><p>I shake my head. I don’t know why I bother to talk, “No, Ma. This is Cole. We aren’t dating.” I give her a hug and step inside. Cole follows behind me, his expression a little concerned.</p><p>Ma steps toward Cole. He extends his hand, buy she swats it. I hear the slap. His eyes grow wider when she takes him in her arms for a hug, “Pish! You’re practically family!” She’s laughing and calls up the stairs, “Better make that two plates! Anna brought her boyfriend!”</p><p>Suddenly my dad is standing on the landing. He’s a stout guy with a beer belly and orange shorts that are a size too small. The neon color doesn’t do anything for him either. There’s a sausage impaled on his fork, “Anna’s boyfriend? How’d you know she had a boyfriend?” Dad looks at me, shaking his head, smiling, “You never tell me nothing. Anna, why you holding things back from your old man?”</p><p>He waves his hands as he’s speaking, shaking the fork. The impaled meat bobs on his utensil until the sausage flies off, and slaps me in the face. It stings before it falls. Cole reaches out and catches the meat before it hits the floor.</p><p>Cole leans in close to my ear so they can’t hear, obviously terrified, “Oh my God—”</p> <p>I don’t bother muffling my voice, “Yeah, this is nothing. Wait for dinner.”</p><p>I wipe the grease stain off my cheek, and follow my dad into the kitchen. Cole trails behind me trying to tell my mom the truth—that he’s my boss—but she won’t hear it. My dad just smiles and nods like a deranged hood ornament. It’s like they hit fifty years old, and their brains entered I-need-a-grand-baby-now mode. It never turns off. Needless to say, they are perfect for scaring the crap out of guys I want to ditch. Since I was hoping things would have worked out with Edward, I didn’t mention him, yet. As for Cole, it was the perfect alibi, assuming he didn’t run from the house screaming after dinner.</p><p>CHAPTER 19</p><p>Ma hands Cole a plate and dumps a mound of anti-pasta on it. Tonight must be meat night. Dad stabs another sausage and puts it on his plate before over-loading mine. He pinches my cheek and says, “You’re too skinny,” while I stare directly at Cole, who’s sitting across from me. He’s trying hard not to laugh.</p><p>Cole lifts his glass to take a sip when my mom says, “It’s not good for a pregnant woman to be so skinny. You remember that Cole. Fatten her up before you knock her up.” She raises her glass to my dad and they clink them together, laughing. They think they’re hysterical.</p><p>Cole chokes on his drink. Before he can recover, they’ve started talking about conception superstitions. I’m staring straight ahead with a blank look on my face, counting. If I leave the table before seventeen minutes, they’ll pester us for the rest of the night. But I don’t know if we can do it. About ten minutes have passed, and Cole looks like he’s going to die. I lean back in my chair, and shove another piece of pork in my mouth.</p><p>Ma’s saying, “It’s a spoon under the bed, not a shoe!” She’s yelling at my father who smiles sheepishly.</p><p>“A shoe seemed right,” Dad mutters.</p><p>Cole’s eyes meet mine. I can’t tell if he’s trying not to laugh or cry. The fact that my mom was a debutant makes this even more amusing, but he doesn’t know that.</p><p>Two minutes left. Just two. We can do this. I count backwards from 120. My counting increases in speed as the conversation enters ground zero.</p><p>My mom ignores Dad, saying, “If you put a spoon under the bed while you have sex, you’ll make a boy.” She’s pointing her fork at Cole while talking. She stops for a second and taps the empty utensil to her upper lip, “What’s it for a girl? Frankie, do you remember?”</p><p>Dad grins, “A red ribbon. That’s what your mother put under her mattress when we made you.”</p><p>Ma slaps her hands together and points at Dad, “That’s right!” They share a look that makes me sick. Then she gazes at me, saying, “And it worked, Anna!” She turns to Cole, and is talking to him like he’s across the room. She’s so loud, “We wanted a baby girl, and see—the red ribbon brought Anna.”</p><p>She’s still talking, saying things that make me cringe. I pick at dinner and notice that Cole hardly eats. I make a mental note to sneak into the kitchen after they’ve gone to bed. I also note to never wear a red ribbon ever again.</p><p>I tune back in when my mom is starting to talk positions, “Missionary is God’s preference for boys, but girls, Cole you have to—”</p><p>Three. Two. One. I jump up. Cole mirrors me and finds his feet. I say, “Thanks for dinner. Since we’re living in sin and trying to fornicate a set of twin grandbabies for you, do you mind if we share the den tonight?”</p><p>Ma and Dad are speechless. They say nothing as I take Cole’s hand and pull him out the backdoor. We sit in the yard talking until my parents go up to bed. They watch us out the window like we’re celebrities while they do the dishes. Periodically they wave through the window.</p><p>My parents are a little crazy, and I understand why. I just can’t tell anyone about it. They’re alone. I’m their only child. It was hard when my mom was disowned. Every single relative cut her off, and all because her evil mother didn’t like my dad. Frankie the Dock Dude wasn’t classy enough for her daughter. Grandmother forbade the relationship. My mother responded by eloping. Grandmother disowned them, and threw her daughter out like she was trash. They’ve never spoken again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My parents had been dirt poor. There were times when we had no food, no medicine. I still remember in vivid detail how hard they tried to give me things that the other girls had, but I usually went without. I learned from them that life isn’t about the stuff—it’s about the relationships—and some relationships are worth fighting for.</p><p>I want that. I want to be so insanely in love with someone that I’d walk away from everything I knew, just to be with him.</p><p>CHAPTER 20</p><p>I feel restless, like I won’t ever be satisfied. Cole’s hands are warm. His smooth skin slides over my bare waist as he kisses me harder. My lips burn, they throb as I pull him closer to me. His thick hair is tangled in my fingers, his strong arms around my waist, pulling us closer—tighter together. Heat fills me. A burning desire to feel him inside consumes every thought I have.</p> <p>There is nothing but him and me.</p><p>My nails claw his back as his kisses leave a hot trail down my neck. Our clothes are gone. It’s just his slick body against mine, but he won’t take me. He won’t push inside of me. I cry out, saying his name, begging him to take me. The third time I plead, he answers me. Without a word, he flips me over. I land on the sheets, and look up at him. My legs are splayed before him, completely exposed.</p><p>Cole doesn’t hesitate. His hard body meets mine and he pushes into me, rapidly, over and over again. I can’t stop calling his name. I want him, I want him to fill me with come.</p><p>I want things I shouldn’t want. I feel things I shouldn’t feel.</p><p>There is no hesitation, no holding back. We move together like we were made for each other.</p> <p>“Cole,” I say softly.</p><p>A hand shakes my shoulder. The dream shatters, and fades, but the emotions are still flooding my body. The spot between my legs is pulsating like he was really there, even though he wasn’t. Slowly, I realize I was dreaming and open my eyes.</p><p>Horrified, I’m looking up into Cole’s face, “Anna, you okay?” His eyes are concerned, searching my face for answers that I can’t say.</p><p>Pushing up, I shake the sleep from my eyes, “I’m fine.” My voice catches in my throat.</p><p>Cole nods and sits on the coffee table across from the couch. He’s still watching me. I feel his sapphire eyes on the side of my face, though I don’t look at him.</p><p>After that dream, I don’t think I can ever look at him again. Heat sears my cheeks and I wish I could hide, but there is nowhere to go. I know my mind was only replaying the lies I told my parents, but it felt real and that’s what scares me.</p>  </body></html>"]