["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>London, 1762</p><p>The madam of an infamous brothel has to handle many types of difficult men, Coral Smythe reflected. Drunken lords, arrogant merchants, callow youths teetering on the crumbling edges of their own personal disasters, and just too many men with more money than sense in their pockets. But few men were as irritating, provoking, vexing, or aggravating as a puritanical naval captain.</p><p>An attractive puritanical naval captain.</p> <p>Coral touched the gold mask covering her face with one finger, checking as she always did that it was in position. Thus satisfied, she descended the staircase into the gilded hellhole that was Aphrodite’s Grotto. Business was brisk tonight. The curving grand staircase spilled into the main hall. At the far end were the great double front doors to the Grotto, overhead Aphrodite herself frolicked in painted pink clouds, surrounded by her well-endowed mythical lovers, and below...</p><p>Well below was bedlam of course.</p><p>Ladies—some of the evening, some quite real swanned about in demi-masks, their faces much more decorously covered than their bodies. Gentlemen –one used the term loosely here – strutted and shouted and fell over themselves in drunken revelry.</p><p>Coral lifted her upper lip beneath the mask. Easy marks, every one of them. All these men just waiting to lose their money. And for what? A handful of soft breast? A warm wet mouth sucking on their cock? Foolish, ephemeral pleasure that disappeared with the light of the next morning. Men were such idiots, so alike in their base desires and loud demands. Dukes or coal merchants, they threw back their sweaty heads and laughed at Aphrodite, smiling down from her clouds.</p><p>All except that one puritanical naval captain.</p> <p>Captain Isaac Wargate stood like a gloomy black rook of doom at the side of the hall. He still wore his long naval cape, despite the heat in the crowded hall, and held his crocked hat propped under one arm. He surveyed the room expressionlessly, the Coral knew there was disapproval in the hawk-like eyes that peered beneath heavy black eyebrows.</p><p>Irritating man.</p><p>She sauntered toward him, aware somehow that he knew of her presence, though he didn’t deign to look her way. She could study him thus – his nose large in profile, his full lips compressed just slightly, his dark hair pulled back into a tightly braided queue, the lines about his mouth deep and cynical --- she could feel and acknowledge that traitorous bit of heat that pooled low in her belly every time she saw him. Damn him.</p><p>“Goodness Captain, we haven’t seen you here for half a year or more.” She called sweetly when she was within a few feet of him. “Have you found a lady bird for the evening?”</p><p>“You know I don’t sample these wares, madam” he growled in reply.</p><p>He didn’t bother looking at her, despite the low cut of her glittering black-and-gold dress. Her nipples were rouged tonight and peeked from the top of the square-cut bodice, a startling crimson contrast to the black material and her own white skin. She had the eyes of every other man in the room. But not his.</p> <p>Which only irked her more.</p><p>Beneath her mask she smiled and infused contrition into her voice. “Oh, of course. How silly of me to have forgotten.” She leaned closer to him, his broad, cloaked shoulders at the height of her forehead, and said conspiratorially, “You do know I can supply boys as well, don’t you?”</p><p>He turned then, his dark blue eyes hitting her like a physical blow. “I’m not interested in the trade of any human flesh, ma’am.”</p><p>“Then one wonders what you’re doing in a brothel.”</p><p>“I’m only here to round up my junior officers,” he said shortly. He nodded to a bantam man across the room−one of his sailors. “As you very well know.”</p><p>“Mm, I’m probably alerted before your admiral when the Challenger docks. All those lovely officers in their pretty uniforms come streaming off your ship and in my doors.”</p><p>She caught the eye of Big Billy, one of the Grotto bullyboys, over the captain’s shoulder. The bullyboys were employed to keep the rough out and, when needed, to help the finer hurry home when they’d overstayed their welcome. To look at Billy −a huge, hulking man with almost no forehead −one would never think that he was actually quite sharp. He brushed the tip of his nose with a thumb −a prearranged signal meaning trouble in the offing. Coral nodded imperceptibly and glanced about. The man in front of her was the only trouble she could see, but Billy knew something was up.</p><p>She turned back to the captain.</p> <p>Who was frowning down at her. “My officers gamble and wench away what little pay they have here.”</p><p>”Is that my problem?” She shook her head sorrowly and spread her hands. “I provide the enticement. They come here of their own free will. I can hardly turn those poor, lonely boys away.”</p><p>“Can’t you?’ He eyed her thoughtfully. “I’d’ve thought you could do whatever you wished in this place.”</p><p>She shrugged, her nipples rising above her bodice for a second. “Looks can be deceiving Captain. I’d’ve thought a man of your years would know that.”</p><p>“Oh, I know it well enough.” He glanced away from her as if he couldn’t bear the sight of her white flesh on display, “If I could keep my men from coming here I would, damn you.”</p><p>“So stern,” she crooned. She reached up and trailed a gold-lacquered fingernail through the strict folds of his black neck cloth. It gave her a thrill– like petting a great bird of prey who might bite at any moment. “Is there nothing I can do to relax you, Captain?”</p><p>His hand caught hers in a move so swift she started. His hand was big and hot, his fingers entirely enveloping hers. For a moment he stared at her, his blue-black eyes narrowed and watching.</p><p>Then he abruptly let her go. “You can refrain from touching me, ma’am.”</p><p>And the awful thing was she felt a pang of hurt from his words. Stupid, really. She’d been a whore since the age of fourteen. Had withstood far worse insults without turning a hair. Yet the clipped words of a puritanical naval captain could hurt her.</p><p>Fortunately, her golden mask hid everything but her eyes. She let her hand fall carelessly as her eyes trailed down his person. His cape was thrown back, revealing the dark blue of his coat, trimmed with bright gold braid, a pristine white waistcoat, and white breeches. Her gaze settled there, below the waistband of his breeches, and she cocked her head, examining the magnificent bulge under the white cloth.</p><p>Then she raised her eyes to his blue-black stare. “You do not want my ladies; you do not want my boys. I’ve heard that you are not married−”</p><p>“Widowed,” he snapped.</p><p>She inclined her head. “So tell me Captain. Is that padding to make your uniform fit properly? Or do you actually have a cock and balls like any other man, for I declare I am in doubt.”</p><p>She expected anger− even rage. Many men of her acquaintance would’ve struck her for such a shameless insult.</p><p>Captain Wargate smiled. His full lips widened and parted, revealing strong white teeth. She caught her breath. The man was astonishingly handsome when he smiled.</p><p>“You’re insulting my manhood, ma’am? I must’ve truly rattled you. Your repartee isn’t usually so crude.”</p><p>She glanced away uneasily, and again caught Big Billy’s eye. He nodded to one of the sitting rooms off the main hall. She should go find out what had Billy so worried. She should tend to her business.</p><p>Instead she turned back to the captain and purred, “you must forgive me, sir, but I’ve not seen any evidence of your, er, manhood as you so delicately put it. Quite the reverse in fact.”</p><p>Stupid. She needed to find the threat, not stand here and trade ineffectual gibes with a man from a world entirely different from her own.</p><p>He shifted and suddenly, the broad expanse of his white waistcoat was all that was in front of her face. She glanced up, startled.</p><p>To meet too-perceptive dark blue eyes. “Who’re you watching for?”</p><p>She opened her mouth, intending to deny or confess, she wasn’t sure, but a loud male voice spoke behind her before she could.</p><p>“Gentlemen!”</p><p>Coral turned, already knowing the source of that high, excited voice, already knowing what Billy had been trying to signal her.</p><p>A lithe Youngman in powdered wig and blazing orange coat leaped to the top of a table. He spread wide his arms. “Gentlemen!” Kindly lend me your ears, for I have an announcement you won’t want to miss!”</p><p>By this time the entire room had turned to look, the laughter and shouted talk gradually dying.</p><p>Captain Wargate was at Coral’s back and she felt the brush of his chest as he whispered in her ear. “That’s the one you were watching for, isn’t?”</p><p>She gave a single jerky nod.</p><p>“Who is he?”</p><p>“Jimmy Hyde,” she said grimly.</p><p>“And what is he?”</p><p>But there wasn’t time to answer and she wasn’t sure she could in any case.</p><p>Jimmy was talking again. “Tonight, gentlemen, you are very fortunate. Very fortunate indeed! For tonight you’ll witness a game of chance like no other.”</p><p>“What kind of game?” a tall elderly man in a full-bottom wig shouted.</p><p>“Loo, sir!’ Jimmy called back.</p><p>“Phht!” A thin-lipped dandy in black and scarlet shrugged a discontented shoulder. “I can get a game of loo in any gambling house in the city.”</p><p>“True, sir, very true!” Jimmy might be a spawn of Satan himself, but he knew how to work a crowd. He grinned and raised his right hand with a flourish. “But I’ll wager, sir, you’ll not find a pot like the one Aphrodite’s Grotto offers tonight.”</p><p>“And what pot’s that?” a royal duke drawled.</p><p>Jimmy turned and in the second before he spoke, Coral met his evil little eyes. “Why, gentlemen, we offer up Aphrodite herself!”</p><p>She staggered, though no one but Captain Wargate would’ve noticed since he caught her at once about the waist to steady her. What nasty plan had Jimmy come up with now? She hadn’t sold her own body in over two years. He knew that. He knew how much she hated it.</p><p>Which, obviously, was his point.</p><p>Jimmy grinned again like an impish monkey bent on destroying what soul she had left. “Seven full nights, gentlemen! Aphrodite will serve the winner for seven nights of bliss in any and every way he wishes!’</p><p>A buzz began in the crowd, like flies swarming to a wounded deer. Jimmy jumped from the table and held out his hand to her, graceful, indolent, the command almost entirely hidden. “Won’t you my dear?”</p><p>And there wasn’t anything she could do. He held the majority share in the Grotto. Four months ago a fire had raged through Aphrodite’s Grotto. She’d been very lucky. No one had died; all the girls, and boys, and the marks had gotten out; and only part of the building had been lost. But the back wing had needed to be rebuilt and furnished, and then when the Grotto opened again, she’d thrown a grand celebration to show she wasn’t down. Coral Smythe wasn’t out of the business.</p><p>But all of that had taken money. Too much money. She’d borrowed from Jimmy Hyde, only later finding out that several of her original backers had already sold their portions to him. By the time she’d realized what he was doing, he’d held the majority share in the Grotto. In effect, he owned Aphrodite’s Grotto. Which meant he owned her. If she refused, Jimmy was quite capable of tossing her out in the street. Without her, the Grotto girls and boys would be unprotected− and subject to Jimmy’s less then tender mercies.</p><p>Coral calculated and decided quickly. If she showed reluctance, he’d be twice as gleeful at her misery. That much she’d learned about Jimmy Hyde in the last four months.</p><p>So instead of trembling, instead of balking or running away, Coral threw back her shoulders and stepped away fro, Captain Wargate’s protective hands. She sauntered forward and placed her hand in Jimmy’s and then she looked about the room, her head held high. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It will be my pleasure,” she murmured, and she put every ounce of allure and promise that she’d ever learned in her life as a courtesan into that one sentence.</p><p>Which, frankly, was quite a lot.</p><p>The crowd erupted into a roar.</p><p>“One hundred guineas!” Jimmy called, raising his voice above the eager shouts. “ One hundred guineas to join this game, gentlemen! Who’s in?”</p> <p>That silenced them, and even Coral’s lips parted beneath her mask. One hundred guineas was a mad fortune. He r best working girl only made eight guineas a night− and that was when the mark was too drunk to realize his folly. Jimmy had lost his mind. No man would gamble a fortune for a chance− a mere chance– of winning her for a sennight.</p><p>But broad dark-blue shoulders were making their way through the crowd. Captain Wargate parted the men standing in front of Jimmy and without even looking at her slammed down a worn leather money bag on the table.</p><p>“I’m in.”</p><p>Chapter 2</p><p>Now the Ice Princess lived in a land far to the north where the snow and ice never melted and the winds were so cold a man's nose might very well freeze and fall off if exposed to the air for too long. Her castle was carved from drifts of snow, the huge empty halls hung with icicles and despair. The princess herself sat on a glittering throne of solid ice in the middle of a frozen lake. Her gown was of lacy frost, her crown of sharp icicles, and the icy pale oval of her face was perfect in its frozen beauty. . . .</p> <p>--from The Ice Princess</p><p>He was a fool.</p><p>Isaac Wargate knew it even before his fingers left the bag of guineas. Only a fool tried to save a whore. He'd told more than one besotted sailor the same thing in innumerable ports of call, and yet he still couldn't regret placing his money on the table.</p><p>He'd felt Aphrodite tremble when this wicked game had been called.</p><p>Thus it was with much less regret than a sane man should feel that he watched Hyde snatch up six month's wages.</p><p>\"Well done, sir!\" crowed Jimmy Hyde. \"Who else? Who else wishes to win this lovely prize?\"</p> <p>\"Count me in,\" said an elderly lord. He threw a silk purse on the table.</p><p>\"I as well,\" said a skeletal gentleman with a twisted lip. His skin looked diseased.</p><p>Suddenly there was a rush to the table, very like the churning of sharks when chum is thrown in the water. Isaac glanced at Aphrodite. If she was disturbed at being the possible prize of an old man or syphilitic she didn't show it. But then her golden mask covered her face, hiding everything but her pale green cat eyes. The mask was skillfully made, the eyeholes oval and framed by delicate gold eyelashes, the lips fashioned into a frozen golden smile. Two years he'd been coming to the Grotto to retrieve his men and he'd never once seen her without her mask.</p><p>Though sometimes in his dreams he thought he saw her face.</p><p>\"This way, gentlemen,\" Hyde called as he led them into one of the salons.</p><p>Aphrodite strolled by his side, head erect, her movements graceful and unhurried. She appeared as composed as always, but she shot him an unreadable glance from her green cat eyes as she passed.</p><p>Isaac straightened. He hadn't imagined the way she'd sagged against him when Hyde had appeared. Dammit. She might be a whore, but she didn't want this.</p><p>He jerked his chin at Lieutenant Cranston, who'd been standing quietly by the side of the hall all this time.</p> <p>Cranston came to his side. \"Sir?\"</p><p>\"Have Smith finish rounding up the men,\" Isaac ordered, \"and see that they make it safely back to the Challenger or whatever lodgings they've found.\"</p><p>\"Aye, sir,\" Cranston replied quietly. He was a man in his third decade, the oldest and most reliable of Isaac's junior officers, and thus the man Isaac often chose to accompany him on these retrieval trips.</p><p>Cranston cleared his throat.</p><p>Isaac cocked an eyebrow at him impatiently. The other loo players had already entered the salon. \"Yes?\"</p><p>\"Will you be wantin' me to return to, ah, help you, sir?\" Cranston murmured.</p><p>\"No, I think I can handle a game of chance myself, lieutenant,\" Isaac replied drily. \"And Cranston?\"</p><p>\"Sir?\"</p><p>\"I'd appreciate it if the other officers didn't hear of this matter.\"</p><p>\"Very good, sir,\" Cranston replied with a small twitch of his lips.</p><p>Isaac eyed his lieutenant a moment before grunting and entering the salon. Wonderful. Even Cranston thought him a fool.</p><p>The salon was like all the other rooms at Aphrodite's Grotto—vulgarly opulent. Marble pillars held up the high ceiling—only on closer inspection did one notice that the pillars were wood painted to mimic marble. The ceiling itself was gilded and lewdly painted with a scene of a woman being ravished by a bull. The woman seemed to be enjoying the act more than the bull.</p><p>Seven men were seated about a round card table leaving one chair empty. Hyde was shuffling a deck of cards showily. To his right was Lord Howling, his face red and bejoweled beneath his white wig. The rake sat to Hyde's left. Beyond him was a country squire, his waistcoat straining over a potbelly, his stockings splotched with mud. A young aristocrat, scarcely old enough to shave, nervously tapped his fingertips on the table whilst striving to look bored. An elegant gentleman marred by a ticking eye was beside him, and the skeletal man with the skin disease was the last of the players.</p><p>Hyde looked up as Isaac approached, his eyes glittering with malice. \"We await you, Captain. Please have a seat and we'll begin. Aphrodite, show the captain his chair.\"</p><p>She'd been sitting behind Hyde, as still as a statue, but she rose at his words and obediently went to hold out the empty chair.</p><p>Isaac tamped down rage. How dare this little manikin use Aphrodite as a servant? He kept his face bland as he sat in the offered chair, but as he lowered himself he heard her whisper, \"Don't let Hyde deal.\"</p><p>Then she was gliding away to take her place behind Jimmy Hyde again.</p><p>\"The rules of this little game are as follows, gentlemen,\" Hyde said gaily. \"To simplify matters I'll serve as dealer throughout the game. You'll play as normal otherwise, staking your own money. The winner takes not only the pot but our lovely Aphrodite as well. Agreed?\"</p><p>Heads nodded around the table. Isaac kept his face impassive, but he felt cold sweat slide down his spine. Most of his money had been in his pay purse. He might've given it all away only to lose on the first round of this game.</p><p>\"Good,\" Hyde said. \"Let us begin.\"</p><p>Isaac placed his hands on the table, careful not to let his eyes wander to Aphrodite. \"I don’t want you to deal.\"</p><p>\"Don’t you trust me?\" Hyde asked with a grin.</p><p>Isaac smiled easily. \"No.\"</p><p>Jimmy Hyde's grin froze. \"Now, captain--\"</p><p>Isaac turned to Lord Howling and raised his eyebrows, \"Do you, my lord?\"</p><p>Lord Howling stirred, his brows knit as if the possibility of Hyde's cheating had just occurred to him. \"I do not.\"</p><p>Hyde's grin went rigid, but he wasn't about to let his money-making scheme fall flat. \"Is there someone you'd suggest, my lord?\"</p><p>Lord Howling frowned. He might be the highest ranked man at the table, but he wasn't known for his quick wits.</p><p>Isaac cleared his throat. \"Perhaps Aphrodite herself will do the honor, sir?\"</p><p>Hyde's quick eyes narrowed, but Lord Howling was already nodding. \"Yes, let our Aphrodite deal the cards.\"</p><p>Hyde was forced to accede. He rose with a sour smile on his face, and held the chair for Aphrodite with exaggerated politeness. She sat--as serene as always, her golden mask concealing whatever expression she might be wearing while her bodice revealed her beautiful white titties all the way to her rouged nipples. Isaac averted his eyes, feeling a black tide of anger surging in his breast. He'd noticed it first the last time he'd visited the Grotto--a stupid urge to beat in the face of any man staring at her nudity--and the minute he'd walked in those faux golden doors tonight he'd known it was worse.</p><p>Much worse.</p><p>Only an idiot was possessive of a harlot, a woman who deliberately flaunted her naked body before any man. A woman who could be bought for a handful of coins.</p><p>Perhaps he was too long widowed. Poor Alice had died four winters ago now. He was in the prime of his life and he had needs like any other man. But he was loath to buy a woman's favors--even if most of his men had no such problem. He should never have come here tonight--had in fact vowed he wouldn't enter the Grotto again after his disturbing reaction to the madam on his last visit.</p><p>Yet here he was, vow or no vow, and moreover he was gambling for Aphrodite herself tonight. His blood heated at the thought even as he watched her nimble fingers shuffled the cards into a bridge.</p><p>Swiftly she dealt three cards to each man.</p><p>Isaac picked up his hand wondering if she'd merely wanted to replace Hyde at the table or if she had a plan in mind. His cards certainly didn't indicate any mechanism--it was a poor hand at best. He glanced at the madam under his brows. But then perhaps she had no wish to help him win.</p><p>Melancholy thought.</p><p>He pushed it from his mind as the game commenced. All survived the first and second hands, but in the third round both the youngster and the man with a tick didn't pick up tricks and, after being forced to loo to the pot, dropped from the game. Half an hour later the country squire stomped from the room, muttering about London card sharps.</p><p>Isaac sat back and watched as Aphrodite shuffled the cards. She'd called for wine to be served to the players, but he'd declined. The fact was that he might be able to continue one or two more rounds, but after that he'd have to drop from the game as well. He'd only hung on so far by his wits and luck--if his hands were indeed luck.</p><p>Aphrodite dealt the cards and Isaac looked at his hand with a sinking heart. This would be his last round--he had no more money to loo the pot--but he'd play it as well as possible. The round began and the skeletal man grinned as Isaac passed on the first trick. Aphrodite dealt two more cards to each man and Isaac picked them up without much hope. Then he had to struggle to maintain his face. He had the Pam--the Jack of clubs--and four hearts. A flush.</p><p>He glanced at Aphrodite, but her eyes were downcast. Had she slipped him the Pam? Impossible to know.</p><p>Meanwhile Lord Howling drained his glass of wine and pushed his remaining pile of coins into the pot in the middle of the table. \"Night's getting late. End this, shall we?\"</p><p>The skeletal man raised an eyebrow, but followed suit. He turned to Isaac, his twisted lip raised in a sneer. \"I'm afraid you'll have to bow out, Captain.\"</p><p>\"Not yet,\" Isaac said quietly and laid his hand down.</p><p>For a moment there was stunned silence and then Hyde began to clap. \"Oh, well done, sir, well done!\"</p><p>The man with the twisted lip stood abruptly, his chair falling backward. \"She slipped him the Pam!\"</p><p>Isaac rose slowly, his hand on his sword, his heart beating hard.</p><p>Then Lord Howling snorted. \"Don't be a fool, Whistler. The captain won fairly. Let him enjoy the spoils of victory. Come, I'll stand you a bottle of wine.\"</p><p>Whistler went reluctantly, urged on by Howling, and Isaac didn't let go his sword until they had left the room.</p><p>\"I congratulate you, sir,\" Hyde began. \"If you want to begin your, ah, victory celebration, I can assure you--\"</p><p>\"Not now,\" Isaac interrupted the foul little man. \"Have you a bag for my winnings?\"</p><p>\"Naturally.\" Jimmy Hyde smirked. \"We wouldn't want guineas falling out of your pocket as you walk the East End. I'll fetch a purse for you.\"</p><p>He left and Isaac frowned after him, wondering if Hyde planned to have him waylaid and robbed on the way home.</p><p>\"You can take Billy with you,\" Aphrodite murmured.</p><p>He turned back to her. She stood beside him, as lovely and wanton as always. \"What?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Billy.\" She indicated a bully boy idling by the door to the salon. \"He can be trusted to guard your back on the way to your ship.\"</p><p>\"Ah. Thank you.\" He eyed her, wondering what was going on behind that golden mask.</p><p>She glanced down. \"It is I who should thank you.\"</p><p>He cocked his head. \"Why?\"</p> <p>\"You know why,\" she said low. He'd never heard her sound so serious before. Gone was the whore who'd drawled ribald comments to him just hours before. \"You gambled your own money and saved me. Thank you.\"</p><p>Isaac sighed. \"I'm sorry to shatter your illusions of me as a bollocks-less white knight.\"</p><p>Her head reared back and her green eyes narrowed behind her mask. \"What do you mean?\"</p><p>He smiled and took her hand, bending over her white knuckles as he murmured, \"Only that I fully intend to enjoy my prize.\"</p><p>Chapter 3</p> <p>As the wind whistled through the Ice Princess's snowy halls it made a kind of music, high and sweet and strange. The Ice Princess herself seemed to sing as well, although her frozen lips never moved and her song had no words. Nevertheless, the eerie melody was carried on the north winds far and wide. Her wordless song told of longing and grief and a passion so deep it could never be fulfilled. . . .</p><p>—from The Ice Princess</p><p>Coral stared at Captain Wargate for a moment, her eyes wide behind her golden mask. It had never occurred to her that the puritanical captain would demand his prize. But wasn't he a man like any other? And all men were base fools when one came right down to it.</p><p>She straightened her shoulders. The curl of her upper lip was hidden by the mask, but her voice dripped with scorn when she said, \"Of course, Captain. I wouldn't dare to deprive you of anything you'd rightfully won.\"</p><p>If her distain perturbed him, he made no sign. His black hawk eyes were scanning the room as if her presence hardly mattered to him. \"Your graciousness overwhelms me, madam. Ah, Hyde.\"</p><p>This last was addressed to Jimmy who'd come strutting back into the salon with the sack Wargate had requested for his coins. Jimmy waved it in front of Wargate like a flag before a bull. \"Here you are, Captain! I hope it's large enough for your winnings. Of course it doesn't fit the most delectable prize.\" He leered at Coral.</p> <p>She stared back stonily, long since inured to Jimmy and his crass ways.</p><p>\"Now, then will you be wanting guards to walk home with you?\" Jimmy asked with mock sympathy. \"It's dangerous hereabouts for a lone man with bulging pockets, but I think we can lend you a couple of our boys, say at a half crown each?\"</p><p>\"No need,\" Wargate snapped.</p><p>Jimmy made a fussy little moue. \"I know you're a big, strong man, Captain, but remember pride goeth before a fall. Why walk alone when—\"</p><p>\"There's no need,\" Wargate interrupted Jimmy's prattle, \"because I have no intention of walking back tonight. I'll claim my first night tonight.\"</p><p>Jimmy's eyes widened even as Coral felt her heartbeat quicken. Tonight? She'd have no time to prepare. No time to—</p><p>\"Eager to taste the delights of our Aphrodite, are you?\" Jimmy giggled. \"I can't blame you. By all means, enjoy the spoils of victory, in fact—\"</p><p>But Coral lost the last part of Jimmy's snide comments because Wargate had caught her wrist and pulled her out of the salon. He started for the stairs. His legs were long and his stride fast, so she was forced to jog alongside him, panting, her breasts jiggling ungracefully.</p> <p>\"I'm not a dog on a leash, Captain!\" she hissed.</p><p>He stopped so abruptly she cannoned into his side, her breasts smashed against his arm, one hand braced against his broad shoulders. She caught her breath, looking up into his stern black eyes. His eyebrows were lowered disapprovingly. If he had any awareness of her bosom pressed against him, he didn't show it.</p><p>\"Would you prefer to stay and listen to the drivel pouring from Hyde's mouth?\"</p><p>\"No, naturally not, but—“</p><p>\"Then point me to your room.\"</p><p>She pressed her lips together and jerked her chin at the stairs.</p><p>He mounted them two at a time until she nearly tripped. Then he muttered something under his breath and slowed his pace. Coral tugged, but he still held her wrist firmly and she suddenly realized that she would be having sexual congress with this man very soon.</p><p>Possibly within minutes.</p><p>Her mouth went dry, her heart beating nearly out of her chest. It'd been years now since she'd let a man touch her. To feel the sense of helplessness, to be overpowered by another stronger than herself, to have to wall off that part of her spirit that rebelled against such servitude. Could she do it? But of course she must. She'd done it before. One more disgusting act hardly mattered, did it?</p><p>She snuck a glance at Wargate's grim face. And what if the act wasn't quite so disgusting? Could she still keep her soul intact?</p><p>Wargate halted at the top of the stairs, turning to her with a raised eyebrow.</p><p>Coral inhaled and pointed to the third door down the hall. \"That one.\"</p><p>He strode to it without comment and threw open the door.</p><p>Inside was a simple room furnished with a bed, chair, and small lit fire.</p><p>The captain frowned. \"This isn't your room.\"</p><p>Well, of course it wasn't. No one but her maid was allowed in her rooms. Coral compressed her lips and indicated a room at the very end of the hall.</p><p>Wargate was there in a few seconds, Coral panting beside him. This time he threw open the door to a much more sumptuous room. The bed was draped in crimson velvet, the rug thick and luxurious, and a table and two chairs sat before the fire. Coral gave a small satisfied smile. The Red Room was one of her best. Surely he'd be satisfied with it.</p><p>Except his scowl was thunderous when he turned to her this time. \"Quit playing with me, madam. I want your rooms, not a whore's set stage.\"</p><p>Coral stiffened, feeling an edge of panic. Her rooms were private. They were her refuge.</p><p>\"I am a whore,\" she snapped. \"You wouldn’t be bedding me otherwise, Captain.\"</p><p>He simply looked at her.</p><p>\"What do you care whose rooms these are?\" she waved at the red velvet opulence in frustration. \"Believe me, you shan't be looking at the room when you're with me.\"</p><p>His sharp eyes narrowed. \"I want your rooms. And before you try and tell me these are your rooms, let me point out that rich as the furniture is, there isn't a single personal item within it.\"</p><p>She tugged again at her wrist and had as much luck pulling it from his grasp as she’d had before. She settled for propping her free hand on her hip. \"You're ridiculous.\"</p><p>\"And you're obstinate,\" he countered. \"Do you want me to find Hyde and tell him you've reneged on the deal?\"</p><p>No, she didn't. Coral turned with ill grace and led him around the corner, down another corridor, and finally to a hidden door in the wall.</p><p>\"Watch your head,\" she muttered as she ducked inside the dark passage behind the little door.</p><p>She heard a thud and a grunt as her warning came too late and his head connected to with the low lintel. Ha! She couldn't help but smile. This man never failed to discompose her. With everyone else--even the most disgusting animals such as Hyde--she was cool. Composed and dismissive. Only with Wargate did her blood run too hot, her composure crumple like ashes.</p><p>He was her own personal Armageddon.</p><p>The narrow little hall dead-ended with a door which was locked. Coral fished under her skirts until she found the key hanging from a ribbon at her waist. She unlocked the door and entered, not bothering to see if Captain Wargate followed.</p><p>Molly, her maidservant straightened in surprise from the little fire in the grate.</p><p>\"Ma'am?\" Her eyes widened and flicked to look behind Coral.</p><p>Coral felt heat rise in her cheeks behind her mask. She'd never brought a man here before. \"That'll be all, Molly.\"</p><p>Molly curtsied, still looking curious, and left the room by a door on the far wall. It led to a back stairway that opened eventually into the kitchens and from there to a back door to Aphrodite's Grotto.</p><p>Coral turned as the door clicked shut behind her maid and looked at Captain Wargate. He'd moved away from the door they'd entered and was inspecting the objects on her dresser. She grit her teeth, feeling a sense of imposition. These were her private rooms, her private possessions.</p><p>The bed was comfortable, but by no means large, the hangings a soft, faded green stripe. By the fire was a small, square table and a single chair. She used the spot both to take her meals and to look over the Grotto's accounting books. A dark wood wardrobe held the extravagant costumes that Aphrodite wore, but at the moment a simple robe hung on the outside of the wardrobe--a gown she habitually wore whilst in her own rooms. It was a lovely emerald green velvet, but the lace at the sleeve had been mended and the elbows were beginning to go bald from wear. The dresser Captain Wargate inspected held a simple white china pitcher and washing bowl, her hairbrush, a folding mirror, a pile of hairpins in a glass dish, and a miniature portrait of a worn-looking woman.</p><p>Coral inhaled. He had no right. But she knew how to distract him from his examination of her possessions.</p><p>\"Shall we begin, Captain?\" She drawled, her fingers going to the laces of her gown. She slowly drew them apart as she spoke. \"Have you a particular fancy tonight? Perhaps you'd like my mouth and tongue on your cock? Or would you prefer to bind me to the bed for your pleasure? You may sit and I'll ride you until we both succumb. Or you may mount me from behind like a great, randy beast. What will you, sir?\"</p><p>The captain had turned during her provocative speech, but his eyes were impassive as he watched her undo the last lace. Her bodice fell open, revealing the embroidered stays underneath. She had only to unpluck the ribbon through the first few holes and then her stays gaped as well, making her breasts entirely naked. They were white and round and she knew without vanity that they were the stuff of a man's fantasy, but Captain Wargate studied her bared bosom without a change of expression.</p><p>Finally his eyes met hers. \"Will you take off your mask?\"</p><p>She stiffened and blurted her reply before she could think. \"No.\"</p><p>For a moment panic fluttered in her breast as she waited for him to demand that she remove the mask.</p><p>But he merely sighed.</p><p>\"Very well. Then, yes, there is something I'd like you to do for me.\" He went to the fireplace and sat in the only chair, his legs braced apart. \"Come here.\"</p><p>She exhaled in relief. This she could handle. She tilted her chin and strolled toward him, every bit of all the sexual seduction she'd ever learned in her life in her step.</p><p>She stopped between his spread thighs and paused, trailing a single gold-lacquered nail from her throat down between her bared breasts. \"Yes?\"</p><p>\"Turn around.\"</p><p>Coral caught her breath and pivoted.</p><p>\"Bend over.\"</p><p>Her upper lip curled beneath her mask. Was it spanking he liked, then? Oh, how easily the proud fell!</p><p>\"Now straddle my leg.\"</p><p>She frowned in confusion at that command, but obeyed.</p><p>\"And grasp my boot.\"</p><p>Her eyebrows knitted. She looked at him over her shoulder. His face was nearly upside down in this position, but she could've sworn she saw his mouth quirk. \"What?\"</p><p>\"Help me off with my boots,\" he said patiently, as if to a child.</p><p>\"Your boots—\"</p><p>\"My boots.\" And he had the temerity to put his free boot on her bottom. \"Pull.\"</p><p>Boorish, aggravating, confusing man! Coral sucked in a breath, grimly bent and grasped the boot, and yanked.</p><p>It didn't budge.</p><p>\"A little harder,\" the impossible wrench said helpfully from behind her, pressing her bottom with his foot.</p><p>Men had paid fortunes to have her merely sit by their side so that they might be envied by other men—and he was making her pull off his filthy boots! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Coral gritted her teeth and pulled with all her might. The boot came off, nearly sending her tumbling on her nose.</p><p>\"Well done,\" Wargate drawled. \"Now the other.\"</p><p>Coral threw down the boot in disgust and bent again, aware her position was comical, if not downright ungainly. Her breasts hung down, her bottom was presented to him, and he'd once again placed a foot on it. The second boot came off more easily than the first. She straightened and turned, still holding the wretched boot, and tried to regain some of her former aplomb.</p><p>\"What will you have me do now?\"</p> <p>He raised his eyebrows as if surprised. \"Why, nothing. I'm quite comfortable. I'll bid you goodnight, madam.\"</p><p>And then Captain Wargate folded his arms, stretched out his legs, and before her disbelieving eyes did the most insulting thing possible.</p><p>He fell asleep.</p><p>Chapter 4</p><p>Whenever a flesh and blood man heard the Ice Princess's song he was as if transfixed. So desperate was his need to console the woman who sang to him, he forgot his family, his country, his very self, and would turn and journey toward the singing. When at last he reached the Ice Princess on her lonely throne, she would lean far down and kiss him on the mouth. . . .</p> <p>--from The Ice Princess</p><p>Isaac woke in the morning to the sound of the maid clattering at the grate. He yawned and stretched, wincing at a twinge in his neck from having slept in the chair. Aphrodite was gone, her bedcovers thrown back, the endearingly worn green velvet robe tossed at the foot of the bed. He'd hope to break his fast with her, but was unsurprised to be disappointed. The lady was a cat--he'd invaded her inner sanctum and no doubt that made her nervous.</p><p>He'd have to wait for nightfall.</p><p>\"Will ye be wantin' coffee, sir?\" the maid asked gruffly.</p><p>\"Yes, thank you,\" Isaac replied pleasantly.</p><p>The woman's suspicious expression eased fractionally at his tone. \"I can bring you some hot water, too, if you'd like.\"</p> <p>He nodded. \"You're not used to men staying the night?\"</p><p>\"I'm not used to them staying at all.\" The maid snorted. \"Herself doesn't bring men to her rooms.\"</p><p>His jaw tightened. \"She entertains them elsewhere in the Grotto?\"</p><p>The maid shot him an unreadable look. \"I'll be getting that coffee and water, sir.\" She slipped from the room.</p><p>Isaac rose, finding and using the chamber pot. The maid was protective of her mistress' secrets, which said something about how the servants viewed Aphrodite. The worth of a naval captain could always be told by how his sailors spoke of him. When the maid returned with his breakfast. He ate, shaved, and donned his hat and cloak before leaving the Grotto. He had important business to see to if he wanted to play with Aphrodite tonight.</p><p>Nearly ten hours later Isaac tramped back up the street to Aphrodite's Grotto. He could've hired a chair to bear him, but after months at sea he welcomed the chance to stretch his legs.</p><p>Even if it was in the most notorious part of London.</p><p>The big man Aphrodite had identified as Billy stood by the doors to the Grotto tonight. He eyed the small satchel Isaac carried, but merely nodded. \"She's awaitin' you in 'er rooms.\"</p> <p>Isaac gave the man a coin and entered the entrance hall. His heart beat like an ensign boarding his first ship. Hold hard, son, she's a whore, he reminded his surging libido. She might not entertain gentlemen in her rooms, but she certainly entertained them somewhere in the Grotto. She was the brothel's madam, after all.</p><p>Yet oddly the thought did not lower his anticipation. Whore or not, he was looking forward to seeing Aphrodite tonight. He ran up the grand staircase and strode down the long corridor, past giggling girls and men with stupid lust in their eyes--pray he did not wear the same expression. No one gainsaid him when he turned down the smaller corridor and entered the hidden passage, remembering to duck his head. He paused outside the door at the end and then knocked.</p><p>There was a moment of suspense when he wondered if she would insist on meeting him elsewhere, away from her rooms.</p><p>Then she opened the door.</p><p>Aphrodite wore a dress that was almost simple tonight, green, with a bodice that was very low, although it did cover her nipples. He didn't know whether to be grateful or mourn the loss of their distraction. The cold golden mask was firmly in place. Isaac realized oddly that he knew her—knew the grace of her slim arms, the delicate hollow at the base of her neck, the challenging way she tilted her head when she caught sight of him—knew all this, yet had no idea what her face looked like.</p><p>It irked him, like a pebble caught in his shoe, that knowledge that she refused to reveal that most basic part of herself to him.</p><p>\"Do you intend to enter, Captain Wargate?\" she asked, her tone acid.</p><p>He grinned and bowed. \"I have every intention of entering your secret room, ma'am.\"</p><p>That surprised a short laugh from her. \"Touché, Captain. Please come in.\"</p><p>He passed her, conscious that she stepped back so he wouldn't brush her person as he moved. \"Call me Isaac.\"</p><p>\"What a very Biblical name.\"</p><p>\"What's yours, then?\" He turned to look at her. \"Your real name, not the one they call you here.\"</p><p>She hesitated and for a second he thought she might tell him, but she shook her head. \"Would you like some wine?\"</p><p>\"Aye.\" He set his satchel on the square table before the fire. A man must be patient with a cat. She'd only drew near when he wasn't looking.</p><p>He heard the clink of the glass behind him as he opened the satchel and brought out the board. The pieces were in a soft leather pouch and he laid them out on the black and red squares.</p><p>\"What is that?\" She was closer than he'd realized.</p><p>He hid a smile. \"What does it look like?\"</p><p>She moved around him to set a glass of wine on the table. \"A draughts board.\" She frowned down suspiciously at the game. \"What did you bring it for?\"</p><p>\"I thought we'd play.\" He sat at one side of the table and picked up the wine glass, watching her.</p><p>\"But . . .\" She glanced about the room. \"You came here to—\"</p><p>\"Play a game with you,\" he said softly. \"That is if you wish to.\"</p><p>She debated that a moment and he'd have given all the winnings from last night to have seen beneath the flat golden mask. Then she lowered herself to the chair opposite his, her back as straight and rigid as if she were about to take tea with the king.</p><p>He nodded and moved one of his men. \"You don't have wine yourself.\"</p><p>\"I don't drink it while entertaining.\" She pushed a round piece forward. \"Why draughts?\"</p><p>He shrugged and made his move. \"It's easy to play, but hard to master. I thought you might enjoy it.\"</p><p>\"Enjoy it.\" She said the words as if tasting a strange meat. \"You'd rather play a child's game than bed me?\"</p><p>\"Right here, right now, yes,\" he said and took the two pieces she'd played. \"And it's not a game for a child.\"</p><p>She stared down at the board and he knew that under the cold metal mask she was frowning.</p><p>He made sure to keep his mouth straight.</p><p>\"I don't think I like this game,\" she said regally and flicked a piece forward with her fingertip.</p><p>\"That's because you're not used to playing it,\" he replied. \"It takes but a bit of practice. A smidgen of thinking ahead.\"</p><p>\"Thinking ahead in what way?\"</p><p>He scratched his chin. \"Draughts can be played in two ways. One can move the pieces at random, reacting to the plays of the opponent. That is how a child plays draughts.\" He pushed forward a round wooden piece, tempting her to capture it. \"Or one can plan ahead, anticipate the moves the opposite player makes. The game is more complex then.\"</p><p>She stared at his lure for a moment and then moved a different piece forward. \"It sounds like too much thought for what is merely a game.\"</p><p>\"A game is what one makes of it,\" he said softly. \"Much of life is a game. If played skillfully, with an intelligent and fascinating opponent, it can become almost like a dance. One challenges and moves, the other teases and skips away, only to dart forward later and strike a telling blow.\"</p><p>She looked at the board and then suddenly leaned forward and jumped two of his men, capturing them. She set the pieces neatly by her side of the board before looking up her green eyes flashing triumphantly behind the mask. \"Perhaps I like this game after all.\"</p><p>He felt the thrill go through him—the knowledge that he'd engaged her, this mysterious woman, but he bowed his head to hide his own triumph. A commander knew not to celebrate too soon and let the enemy ship duck thorough his defenses.</p><p>Aphrodite was fingering one of the wooden markers she'd captured. \"Where did you get this game?\"</p><p>\"I made it.\"</p><p>She bent her head as if to examine the piece she held. \"You carved it?\"</p><p>\"Mmm,\" he murmured his assent. \"The evenings are long at sea. I carved that and stained it several years ago.\"</p><p>\"Who do you usually play with?\"</p><p>His lips twitched her suspicious tone. \"My first mate or one of the lieutenants. King me.\"</p><p>She placed a second marker on top of his first and then stared down at the board, but made no move. \"It must be dreary to be so long at sea.\"</p><p>\"No, not at all.\" Isaac sat back in his chair and took a sip of wine. \"The sea is ever changing, sometimes so mild and sweet it makes your heart ache at the beauty. Sometimes she throws a fit and tosses the ship about so that you'd like to leave her and never return. But a sailor always returns to the sea.\"</p><p>She pushed one of her markers too near his guard. \"You make the sea sound like a woman.\"</p><p>\"She is to most sailors,\" he murmured absently. He could see no trap so he took three of her men.</p><p>Aphrodite made a sound of displeasure at his move and bent her head to the table. \"You're widowed, but you must have a woman waiting for you somewhere?\"</p><p>\"I wouldn't be here if there was.\"</p><p>Her head jerked up. \"What a very fine sentiment, Captain.\"</p><p>He cocked his head, eyeing her. \"You don't believe me.\"</p><p>\"No.\" She took one of his men. \"In my experience all men are happy to dawdle with more than one woman, given the temptation.\"</p><p>\"Most men, perhaps—\"</p><p>\"All men,\" she said with finality.</p><p>\"Not this one, madam,\" he growled and took six of her markers at once with his king.</p><p>She gasped, looking down at what remained of her men. \"A gentleman would let the lady win!\"</p><p>\"No.\" He shook his head. \"No quarter, no false pity. We play this game as adults, you and I.\"</p><p>\"I don't understand you,\" she said and for the first time he heard uncertainty in her voice.</p><p>\"Make your move.\"</p><p>She glanced at the board. \"Whichever way I move I'll lose.\"</p><p>\"Do you admit defeat, then?\"</p><p>\"No.\" She played.</p><p>He took another man. \"I'll ask a forfeit when I win.\"</p><p>\"You made no mention of a forfeit before we started.\" She sounded indignant.</p><p>\"I do now.\"</p><p>\"Humph. Then it is my decision whether I'll grant it or not.\" She looked up at him through the slanted eyeholes of her mask, her eyes glowing green. \"Perhaps you'd like me to perform a service for you.\"</p><p>\"Perhaps I would,\" he replied and cornered her last man.</p><p>She looked at the board and then sat back in her chair, the angle of her body making her breasts thrust at him invitingly. \"What would you have me do, Isaac? What do you most desire?\"</p><p>His throat had gone dry at her purring tone. Somehow the sight of her in her own rooms, in the more modest green dress was much more alluring than the night before. There were parts of him that clamored to take her up on her offer. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But a wise player knew when to avoid the too-obvious lure. \"I want your mask. Take it off for me, Aphrodite.\"</p><p>She froze. Her hands crept to her face, touching the gold that shielded her from his eyes.</p><p>\"No.\" Her hands dropped to her lap. \"I said I'd decide whether to give the forfeit or not and I cannot give that.\"</p><p>\"I see.\" He blew out a silent breath of disappointment. Still too soon, then. He leaned forward and began gathering the draughts pieces.</p> <p>Then she cleared her throat.</p><p>He looked up, his hands stilling.</p><p>\"I'll give another forfeiture,\" she said so low it was nearly a whisper.</p><p>His eyes narrowed. \"What is that?\"</p><p>\"My name.\" She swallowed. \"My name is Coral Smythe.\"</p> <p>And the triumph that surged through him was sweeter than that he'd felt the first time he'd defeated an enemy ship.</p><p>Chapter 5</p><p>At the touch of the Ice Princess's frozen lips, the poor mortal man's blood would stop. His heart would freeze and his face and limbs ice over. He would, in fact, become a statue of ice, and then he joined the hundreds of other frozen men who stood about the Ice Princess's icy lake. Immobile. Silent. Unchanging. And her only companions. . . .</p><p>--from The Ice Princess</p><p>Coral woke early the next morning and turned to look at the chair. Empty. Isaac was already gone. Alarmed, she sat up and felt for her mask, but it was still in place. She swallowed, letting her arms fall. Strange to think that he'd seen her asleep. She usually hated the thought of being observed with her defenses down, but with Isaac . . . the knowledge that he'd seen her asleep was almost erotic.</p><p>She shivered and rose. She was letting the captain too close. A man didn't rise to command his own ship in the Royal Navy by being weak. By letting his desires control him. No matter his interest in her at the moment, it would disappear once the novelty wore off and he came to his senses.</p> <p>Coral pushed the cruel thought from her mind. She had errands to run and if she were quick she might leave the Grotto before Jimmy rose. Quickly she dressed and hurried through the little passage, but her luck ran out when she reached the main hall. Jimmy leaned against the wall as if he'd been waiting for her. Her heart jumped nervously at the sight.</p><p>\"Another late night, Aphrodite?\" He shook his head in mock concern. \"And I hear Captain Wargate spent the night in your rooms. Again.\"</p><p>She made to move past him. \"I've an appointment—\"</p><p>He caught her arm roughly. \"You're not taking your services elsewhere, are you, sweet?\"</p><p>\"Of course not.\" She inhaled to calm the panicked fluttering in her breast.</p><p>He squeezed, pinching her flesh against her bones painfully. \"Because I wouldn't like to have to discipline you, Aphrodite, not when you've suddenly proved so very profitable again.\"</p><p>She stared, truly shocked now. \"You know I don't entertain. Not anymore. After Captain Wargate's seven nights are up--\"</p><p>\"The gentlemen will be clamoring to try you.\" Jimmy grinned like the evil imp he was. \"We simply can't afford to let this opportunity slide, sweet.\"</p> <p>\"Jimmy—\"</p><p>He suddenly let go of her arm, causing her to stumble back. \"I think we'll make the Red Room solely yours. It'll lend a touch of exclusivity to your wares. Now don't let the captain tire you out. I've already got the customers lining up for your first free night.\"</p><p>He grinned again and strolled away down the hall.</p><p>Coral pressed her hand to her chest, feeling the frantic beat of her heart. Dear God, if Jimmy truly decided to whore her out, there was nothing she could do to defend herself. He held the majority share in the Grotto, had the power to toss her into the street. And worse, he had the power to make the lives of all those who worked in Aphrodite’s Grotto—the working boys and women, the maids and cooks, even the bully boys—a living hell. Jimmy could make her go back to being a common whore. Go back to suffering under strange men every night.</p><p>No. Simply no. She could not do that again—which made her appointment this morning even more urgent. Coral turned and fled down the Grotto's back staircase.</p><p>It was late by the time she returned that night. She crept up the back stairs of the Grotto. The cries of the merrymakers in the front of the building were muted but quite discernible. She'd lived in this place for over two years, yet she felt none of the warmth one should when returning home. But then what kind of fool expected the warmth of home from a brothel?</p><p>Coral paused outside the door to her room. It looked no different than it had this morning, but she sensed he was already here. She compressed her lips. He was occupying entirely too much of her thoughts. It wouldn't do. She was the madam of the most infamous brothel in London. She'd used and tossed aside men much more powerful than he. She was Aphrodite. And after these seven days were up she'd never see him again in this lifetime.</p><p>She would be the one to use and forget, not he.</p><p>So she slipped her wrap from her shoulders, tugged her bodice a little lower, and tilted her chin as she opened the door to her little room. He sat at her table, his long legs sprawled before him in perfect comfort, his eyes closed, his arms crossed over his chest as if he owned the room. The sight irritated her beyond reason.</p><p>She shut the door behind her over-hard. \"Good evening, Captain Wargate.\"</p><p>\"Isaac,\" he drawled without opening his eyes. \"And a good evening to you as well, Coral.\"</p><p>She strolled toward him, dropping her wrap on the bed as she passed it. His mere presence was an irritation, a prickling beneath her skin. What did he want with her? What game was he playing?</p><p>\"A gentleman would rise on the entrance of a lady,\" she said, sharper than she'd meant, but then he was wearing away the shell of her artifice. \"Oh, but I forgot, I'm not a lady am I?\" She was by the dresser now and she twitched the mirror slightly to the left. \"I'm a whore—a very, very high priced whore. And yet you merely sit there and talk to me. Or play draughts. What kind of man wants to talk to a whore?\" She flicked too jerkily at the miniature and it fell to the floor with a clatter. She stared at it, blinking angrily. Damn it! Why couldn't she control her mouth with him?</p><p>From behind her he sighed. \"Come sit down, Coral.\"</p><p>She turned to him, folding her arms. \"Why should I?\"</p><p>His wide mouth curved into a surprisingly sweet smile, lighting his hawkish eyes and pressing a dimple into one hard cheek. He looked almost boyish. She did not want to be attracted to this man. \"Because I bought some meat pies for our supper.\"</p><p>He bent and picked up a cloth bag from his feet and took out a wrapped bundle. The moment he unfolded the bundle, the aroma of hot meat pies filled the room, making her inhale deeply in appreciation.</p><p>She came to the table with ill grace. \"Why?\"</p><p>\"Why what?\" he murmured without looking up from the task of placing the pies on two plates.</p><p>\"Why bring me dinner?\" She was honestly confused. She didn't know what this man wanted at all and the oddity of it kept her off balance.</p><p>\"Because I'm hungry?\" He produced a bottle of wine and poured two glasses.</p><p>\"I told you, I don't drink with customers,\" she said as she sat.</p><p>He pushed the wineglass toward her without speaking, only his black eyes gave ironic challenge.</p><p>She picked up the glass and took a sip defiantly.</p><p>A corner of his mouth twitched before he picked up his meat pie and bit into it. He closed his eyes for a moment, a look of near rapture crossing his face.</p><p>Coral felt her mouth go dry. What would it be like to be the cause of such bliss? To drive this man—Isaac—to rapture?</p><p>He opened his eyes and smiled at her, swallowing, his tanned throat working. \"You have no idea how tasty a meat pie is after months at sea.\"</p><p>There were any number of ribald comments she could make to that, but simple curiosity won out. \"Tell me.\"</p><p>\"We start out with fresh meat and provisions, of course.\" He took a sip of his wine. \"But they never last long. Then we're down to mealy biscuits mostly until we make port again. Funny how each man takes it. Most simply soldier on, try not to think of better victuals.\"</p><p>\"Most?\" She poked at her pie with a fork. He'd set two out, though he was eating his own pie with his fingers.</p><p>He grunted. \"I once had a first mate, name of Jones. He would talk on and on about food. Dishes his mother made. Favorite meals he'd had. The last meal he'd eaten while on shore. He could wax eloquent about a joint of beef until you fair tasted the meat on your tongue.\"</p><p>Coral raised her eyebrows, smiling in spite of herself. \"And how did your other sailors take this?\"</p><p>\"Not always well.\" He chuckled. \"I once had to confine two sailors to the brig. I was afraid they'd murder Jones in his sleep.\"</p><p>She laughed, the soft sound surprising her. She looked down at her meat pie and took a bite. It was delicious, the gravy savory, the thick chunks of meat tender. \"Jones is no longer your first mate?\"</p><p>He didn't answer and she looked up. Isaac had stopped eating and was staring blindly down at the table.</p><p>\"Isaac?\"</p><p>He inhaled and glanced at her, his eyes empty. \"No, Jones is no longer my first mate.\"</p><p>She made a practice of leading men on and then turning away. Of never asking too deep a question. Of never becoming involved.</p><p>But not tonight. \"What happened to him?\"</p><p>His brows knit as he stared down at his half-eaten meat pie. \"We were in battle. A cannon blast caught him on the right arm, just below the shoulder. It wasn't a single ball, but shrapnel—bits of sharp iron. His arm . . .\" He swallowed, reaching for his wineglass, but he merely fingered the stem. \"His arm was destroyed. The sawbones tried to make a clean amputation, but the wound was very near the shoulder, and it wouldn't stop bleeding. We buried Jones at sea the next morning.\"</p><p>She bit her lip. For some reason the very stoicism of his recital made it all the more heart-wrenching. \"I'm sorry.\"</p><p>He didn't seem to hear her. \"It's strange. Sometimes the most ordinary of men, the ones small in stature, the ones not outstanding in intelligence or good humor, show the most extraordinary courage. He was awake the entire time, Jones was. All that night with the screams of the other wounded around him he merely lay there, his face white, a small smile on his lips. After the sawbones cut into him, carved away the bits of flesh that hung from his shoulder; after he said he could do no more, Jones looked at him and thanked him. And when I went to talk to him just before dawn, Jones tried to salute and told me it'd been an honor to serve with me.\"</p><p>She looked at him helplessly. She knew how to give a man immeasurable pleasure, how to tease and flirt, how to bring a man so close to the brink he literally begged to be released, and yet she did not know how to comfort this one man.</p><p>\"Isaac,\" she whispered.</p><p>He blinked and looked up. \"Forgive me. This is not nice conversation for a supper table.\"</p><p>She felt a spurt of unaccountable anger and blurted, \"But this is what I want to talk about. I want to know about you, about your ship and about your men. I want to know you, Isaac.\"</p><p>Her rash words hung there in the air between them. She couldn't take them back, couldn't pretend she hadn't said them, so she stared at him defiantly. For a moment he didn't move.</p><p>Then he leaned a little forward. \"Take off your mask, Coral.\"</p><p>She couldn't. She simply couldn't. If she removed her mask, he'd see what lay beneath, he'd see everything she wanted to keep hidden. He'd see her. But oddly, her hands were moving of their own volition, pulling free the ribbons at the back of her head. She laid her golden mask on the table.</p><p>And looked at him.</p><p>Chapter 6</p><p>Now one day a soldier came home from war to the village where he'd been born. And after he'd greeted his mother and father, his sisters, and his old grandmother, he looked around and exclaimed, \"But where is Tom, my younger brother? Will he not come and bid me welcome home?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>At this his family sighed and looked at their toes until the grandmother spoke for them all. \"Alas! Poor Tom has been enchanted by the Ice Princess and we've never seen him since.\"</p><p>\"Tut!\" said the soldier to that. \"Then I shall have to bring him home again.\" . . .</p><p>--from The Ice Princess</p><p>When Isaac arrived the next night, Coral was sitting at the table, as regal as a queen. She was also wearing the golden mask. He waited until her maid curtsied and left the room, and then he stalked toward her.</p> <p>\"Remove it, please.\"</p><p>She hesitated, but he stared at her in command. On this matter he would brook no retreat. Still, he must've unconsciously held his breath as she raised trembling fingers to undo the ties at the back of her head, for he exhaled as her mask fell and once again was caught by surprise.</p><p>It wasn't her beauty that was the surprise. He'd known, even before he'd seen her face last night—by the way she moved, by her confidence around men, by the fact that she'd been very, very successful at her profession—that Coral Smythe was a beautiful woman. No, what took his breath away was her youth.</p><p>The Aphrodite of Aphrodite's Grotto couldn't be more than one and twenty.</p><p>Her complexion was fine and so pale it was nearly translucent, her lips were thin with a long sensuous curve to the slightly wider upper one. Her nose straight and thin and delicate. And those eyes. Seen as they should be, with her entire face revealed, they were mesmerizing. Cat-green and tilted at the corners as if some exotic ancestor had left their imprint on her countenance. She was fragile and brave and beautiful.</p> <p>And she was much too young.</p><p>Last night she'd requested—nay, demanded—he leave after she'd revealed herself to him. Last night he'd known her—and his—emotions were too close to the surface. Last night he'd bowed to her near-hysterical entreaty and quickly withdrawn from her presence.</p><p>Tonight he stood firm and asked the question he suddenly knew he had to know.</p><p>\"How did you come to be here?\" His voice emerged rougher than he'd meant and he watched as her expression blanked. One slim hand reached for the golden mask lying on the table before her, while the other flew to her right eye, as if to shield it.</p><p>\"Dammit, don't.\" He pulled out the other chair from the table and sat, reaching across the table and catching the hand that held the golden mask. \"I'm sorry.\"</p><p>She was silent, her back ramrod straight, but her gaze fixed on the table. She'd frozen at his touch, and he saw now that her hand hid a slight deformity on her right eye. The lid of that eye drooped a little lower than the left and a small white scar ran through the eyebrow.</p> <p>Isaac took a breath and tugged gently on the hand he held. \"Don't hide yourself again.\"</p><p>Her breath trembled.</p><p>\"Please.\" He fought to keep his voice low, soothing. \"I was merely surprised by your youth last night and again today.\"</p><p>That prompted a harsh laugh from her. \"I'm four and twenty. How old did you think me, Captain?\"</p><p>\"Isaac,\" he chided absently. \"I don't know. I know only that I thought you'd been a madam, had been doing . . . this\"—he waved a hand vaguely—\"for years.\"</p><p>\"You mean whoring myself,\" she said. The words should've been defiant—before the game of loo, the Aphrodite he'd known had taken every opportunity to flaunt her profession especially, it had seemed, to him.</p><p>But this was Coral now, not Aphrodite, and her words were soft and a little sad.</p><p>\"I have been whoring myself for years. I had to when I first started. It was the only way to make enough money to feed myself and . . .\"</p> <p>She paused and for a moment he thought she wouldn't continue. Who was the other person she'd protected and provided for? A mother? Dear God, a child?</p><p>He leaned forward. \"Tell me.\"</p><p>Her fingers tightened about his hand almost painfully. \"My elder sister took care of me when I was small. Both our parents were dead. She worked as a maid—a good position—but when her employer let her go without reference she could find no other work.\"</p><p>She'd been staring at the table top, but now Coral raised those extraordinary green eyes to him. \"She could've abandoned me. She could have sold me to a whoremonger or as an indentured servant. Instead she walked the streets of London so that we both might have food to eat. For years she did this. But when I grew old enough, after men started to notice me as well . . .\"</p><p>She stopped and he could see in her haunted eyes what she'd done.</p><p>But he needed to hear her say it aloud. \"What did you do?\"</p><p>She lifted her chin. \"I found the fanciest bawdy house I could and made a deal with the madam—she would sell my virginity to the highest bidder and I'd keep one fourth of the money.\"</p><p>He felt the tension in his muscles, almost painful across his chest and arms. He wanted to leap from his chair. To throw furniture and bellow. To smash in the face of that madam and the man who'd bought Coral and every other man or woman who'd used her in her life.</p><p>Instead he closed his eyes to keep his temper inside. \"Did you work at the brothel after that?\"</p><p>\"For a while.\" Her voice was bleak. \"I made more money at the brothel than my sister did on the streets. But then I found myself a protector.\"</p><p>He looked at her, hoping that her \"protector\" had been a kind man, but knowing that was unlikely.</p><p>She stared at the table. \"I was with him for almost a year before another man, a wealthy merchant, offered to keep me. In all I had five different protectors, each one more important and richer than the last, and I was able to tell my sister she need not walk the streets of London anymore. That she could retire from that life because I now had enough money to support us both.\"</p><p>She sounded proud, and he could understand now why she might be. \"Why did you decide to come to Aphrodite's Grotto?\"</p><p>He watched as her fingers brushed over the scar in her right eyebrow. \"My last protector was a very jealous man. A woman—a rival of mine—told him I was seeing other men. He . . .\" Her voice trailed away for a moment, and then she straightened and looked him in the eye defiantly. \"He beat me. Quite badly, in fact. I thought he might kill me. After that I came to Aphrodite's Grotto. I'd rather be with a different man each night than let myself be under the power of one man.\"</p><p>He swallowed, beating down rage at the unknown man who had hurt her so. \"And now?\"</p><p>She attempted to withdraw her fingers, but he held tight. Damned if he'd let her retreat. \"Now? Now I am the Aphrodite of the most infamous brothel in London, sir. What else do you think? \"</p><p>He was in no mood for her teasing. \"Do you whore yourself now?\"</p><p>Her elegant head reared back and an ugly sneer twisted her lips. \"Of course I—\"</p><p>He shook their joined hands. \"Cut line, Coral. Tell me the truth.\"</p><p>Something vulnerable flashed behind her eyes and he wondered if she'd dare tell him the truth.</p><p>Then she sighed, the sound weary and lost. \"I haven't entertained a man in two years. I haven't had to—I am the Aphrodite.\"</p><p>\"Except for me,\" he reminded her.</p><p>\"Is that what I'm doing with you?\" she cocked her head, a sad whimsical smile on her face. \"Am I truly entertaining you?\"</p><p>\"I enjoy my time with you,\" he said carefully. This was new ground, fragile and uncertain. He didn't want to make a false move. Didn't want to destroy this new journey. \"I like talking with you, like sitting here with you. In that way I am entertained. Whether or not I am like your customers in other ways as well, I don't know. I hope not. I hope this is something different and new for you, but I think that is for you to decide.\"</p><p>She stood, gently disentangling their hands, and came around the table to stand before him. He moved his chair so that he faced her.</p><p>\"You are different.\" She lifted a hand to delicately trace his hairline.</p><p>He closed his eyes, feeling her fingers tremble against his skin.</p><p>\"For whatever reason,\" she said softly, \"when you are with me, you are simply Isaac and I am Coral.\"</p><p>And he felt her lips against his. Lightly, no more than the brush of a moth's wings. Her breath fanned against his mouth, hesitant and sweet. He curled his hands about the chair's seat, fearful of grabbing her. Fearful of breaking this fragile bond. She grew bolder, pressing her lips, still close-mouthed to his. He opened his lips slowly, savoring her, not wanting to frighten her. He licked across her mouth and tasted wine and woman. His pulse beat heavy in his body. He wanted to take her into his lap, to open her dress and feel all that smooth, pale skin.</p><p>But when she drew back he made no move to stop her.</p><p>He opened his eyes and looked at her, Coral Smythe, this mysterious woman he seemed to know so well now, and asked the only thing he could.</p><p>\"What now?\"</p><p>Chapter 7</p><p>So the soldier set off for the home of the Ice Princess. He journeyed through forests and mountains, tundra and bare ice, tramping along with a bag over his shoulder and worn boots upon his feet. He was attacked by lions, chased by bandits, and spent the night with more than one wise hermit. And as he neared the Ice Princess' palace he began to hear her song, high and sweet, and so very, very lonely. . . .</p><p>--from The Ice Princess</p><p>Coral glanced into the mirror and smoothed her already perfect coiffure. She'd waited on innumerable men in her career, but for some reason, the wait tonight for Isaac was making her as nervous as a cat strolling through a pack of dogs.</p><p>She let her hands fall on a sigh of frustration. Oh, why not admit the truth? Isaac wasn't like all the other men she'd lured and ensnared over the years. Isaac was important.</p><p>Which was perhaps why she'd cut short their tête-à-tête last night in an uncharacteristic fluster. She just didn't know what to make of the man. How to act, how to present herself. He seemed to see right through her usual wiles—damn him. He made her feel wretchedly gauche, and at the same time the mere sight of him caused her heart to jump and skitter, made her lips curve in a silly smile.</p><p>Good Lord, she was turning into a ninny.</p><p>A discreet knock came at her door and she whirled, that idiot smile attacking her face. She fought it back fiercely, took a deep breath, and glided across the room to open the door. The sight of Isaac's grave, handsome face was like a physical blow. He wore his naval uniform—crisp white, dark blue, black, and gold—and his black hair was pulled back into a severe queue. Her heart started skittering, whether she willed it or no, a tempo that increased, keeping time with her mounting excitement. She wanted to muss his uniform, take apart that tight queue and run her fingers through his hair. And why not? Wasn't that the inevitable conclusion to this game they played? Why not simply accept fate?</p><p>The only problem would be to keep herself intact as she gave into her urges. She knew she trembled on the edge of an abyss, and if she fell . . . well, there would be no climbing out of that particular pit. But she pushed that thought aside as she stood back to let him in. She'd bedded many men in her lifetime. He was just one more.</p><p>Now, if only she could convince her heart of that.</p><p>He threw his cloak over a chair and started to speak, but she was done with their dancing. She stepped close to him and, standing on tiptoe, reached up to bring his face down to her level.</p><p>She kissed him.</p><p>Ah, this was better. A part of her calmed at the touch of her lips on his, even as her belly clenched in need. His lips were firm yet supple, yielding to her pressure without surrendering. She was surprised—and a little embarrassed—by her own moan. It was the man who was supposed to yearn and lose control. She was the Aphrodite. She was immune to sexual heat.</p><p>Except that with him she was not.</p><p>She pulled back at the thought, suddenly frightened. Isaac looked down at her, his lips a little reddened by their kiss, but his eyes still alert and watchful. As if he merely waited for her next move. The sight piqued her. He should not be more calm than she. She'd make him feel, damn him, she'd make him lose control. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She reached up and pulled his queue forward across his shoulder. Then she unwound the inky black strands, spreading them, sifting them with her fingers, playing like a cat with string. All during this he stood silent and still and let her tease. When she was done she fanned his unbound hair over his shoulders and examined him. He looked like a pirate—in a naval officer's uniform. She frowned at his clothes and untied his black neckcloth, pulling it free. She threw it to the floor, prompting a frown from him.</p><p>That hint of disapproval delighted her.</p><p>She attacked his coat and waistcoat next, throwing the one on the bed and the other perilously near the fire, but he was stubbornly impassive. He began to crack, though, when she pulled his shirt off.</p><p>Unfortunately, so did she.</p> <p>He was so finely built. She ran her palms over him slowly, unable to suppress the desire to touch him. His shoulders were broad—so broad—and muscled from years of living at sea. She was used to rich men, men who would rather cut off their hand than do physical labor. Their flesh was soft, white, almost feminine. Isaac could never be mistaken for a female. His body was hard, the planes of his chest scattered with black curls of hair, and tanned as if he doffed his shirt to work when at sea. She flexed her fingers, digging her fingernails just a bit into his muscled chest.</p><p>\"Careful,\" he murmured.</p><p>She looked at him under her eyelashes. \"Do you really want me to be careful?\"</p><p>A corner of his mouth twitched. \"Maybe not.\"</p><p>She gently pushed him, shoving him backward toward the bed. She was under no illusion that she physically overpowered him--that was impossible—but he let her play at dominance. He sat on the edge of the bed and she crawled up into his lap, curling there like a cat seeking his warmth. She laid one arm across the back of his shoulders and used the palm of her other hand to tilt his face toward her. Her heart skipped at his look. With his hair sliding about his bare shoulders, and his black eyes glittering under lowered brows, he looked a barbarian—a man who could seize her and carry her away to some waiting ship. He was powerful and male and her chest ached suddenly. She wanted him. Wanted him forever.</p> <p>But that was folly.</p><p>So she smiled slowly—a seductive smile she'd first practiced at the age of fifteen—and laid her mouth against his. Her lips were trembling just a bit, but he made no comment, only sat and let her play her tongue in his mouth. She could become drunk on his taste. Forget time and place and simply live in the moment—if she dared. She bit his bottom lip and at the same time drew her nails across his chest.</p><p>He caught her hand. \"Sheath your claws, madam.\"</p><p>She pulled her hand from his grasp and with her eyes locked with his scraped one nail gently over his nipple.</p><p>He sucked in a breath.</p><p>She lowered her head, hiding her smile of triumph as she sweetly kissed his other nipple. She could feel him go still beneath her, so she used the flat of her tongue to tease that small part of him.</p> <p>\"Coral,\" he growled, the sound resonating against her lips.</p><p>She looked up through her eyelashes and nearly forgot what she was about. His sensuous lips were slightly parted, his head tilted back, and those black eyes for the moment closed. She pursed her lips around his nipple and sucked.</p><p>He swore then, low and foul, and she felt herself contract at the sound. To make a man like this lose control was simply heady. She twisted on his lap—swiftly and not particularly gracefully. She'd lost some of her own control, but she didn't let herself think about that. Instead she gathered her skirts, pulling and yanking, until underneath her bare bottom was against him.</p><p>He opened his black eyes, staring at her. His thick brows were drawn together as if he meant to reprimand her, but he seemed distracted.</p><p>She smiled and wriggled her hands underneath the froth of her skirts, seeking and finding the fall of his trousers. Delicately—expertly—she unbuttoned him until his flesh surged unrestrained into her hands. She stared into his dark eyes as she held him. He hadn't changed expression, but a muscle ticked on his jaw, giving lie to his seeming unconcern.</p><p>She ran her fingers up his length, measuring, testing, the penis she couldn't see. \"I want you. I want your cock inside of me.\"</p><p>He blinked and suddenly she saw sorrow at the back of his eyes. \"Coral . . .\"</p><p>No. No. She would not let him pity her. She rose up on her knees—braced on either side of him on the bed—and came down unerringly on his penis, taking him into her an inch or so.</p> <p>He had his hands on either side of her waist as if to stop her—and he could have had he wanted to. But his cock was already lodged within her, pushing into her sensitive flesh, and she'd yet to meet a man willing to disengage at such a moment.</p><p>She looked down at him—feeling triumph, feeling loss—and pushed against his flesh. She still held him upright with one hand, but with one last shove she took him fully and her hand fell away.</p><p>He was inside her—all of him. She nestled against him, sex against sex, in the most intimate of human positions. Yet she was still fully clothed and her skirt covered them both. Had someone entered they would not know for certain what went on under her skirts.</p><p>She bent her head and licked his nipple. \"Do you like this?\"</p><p>He bared his teeth to her.</p><p>Her heart jumped and she laughed—a nervous puff of sound. She braced her hands on his shoulders and rose, just enough, not too much—she knew the exact amount—and let him slide from her. His nostrils flared as she reseated herself, swiveling her hips a little, making them both gasp with the force of their rejoining.</p><p>\"Do you like this?\" she panted, rising again.</p><p>He shook his head, but she hardly thought he meant for her to quit.</p><p>She set a rhythm, fast and sure and entirely unstoppable. He was hard and slick now with her moisture, and with every downward stroke he widened her, rubbing against her clitoris. Warmth was spreading through her pelvis and she could feel the slide of sweat down the middle of her back. That part she'd always disliked, but she barely noticed it with him.</p><p>This was different somehow from all the other times. He was different.</p><p>And he would not break. Even when she rode him hard, using all her considerable talent, even when the sweat stood on his upper lip and he grit his teeth.</p><p>Why wouldn't he break? \"Do you like this?\" she demanded.</p><p>And he arched his hips suddenly, taking her clean off the bed, embedding himself into so deep she swore she felt him brush her womb. He threw back his head and grunted, the muscles on his arms bunching as he gripped her waist. He opened his eyes and stared at her as she felt his semen fill her to overflowing, felt his cock jerk inside her again and again.</p><p>He exhaled a mighty gust and relaxed, her knees finally touching the bed once again. She still held his shoulders—awkwardly now. For a moment she wondered if she should dismount or wait for him to recover.</p><p>Then he inhaled. \"Yes, I like this, but it's obvious that you, madam, don't.\"</p><p>Chapter 8</p><p>After many long days and nights of travel, the soldier stood before the Ice Princess herself. He bowed low, for he'd been taught proper manners by his mother, and said, \"Good day to you, madam!\"</p><p>The Ice Princess opened her icy eyes and said in a voice as cold as an iceberg, \"Come kiss me.\"</p><p>\"I thank you, no,\" the soldier replied. \"Though I do appreciate the offer.\"</p><p>\"Then why have you come?\" she asked.</p><p>\"To bring my brother Tom home,\" he said, \"and I'll not leave without him.\" . . .</p><p>--from The Ice Princess</p><p>\"Damnation!\" Isaac threw the official letter down.</p><p>Lieutenant Cranston, sitting across the tavern table from him, looked startled. \"Something amiss, Captain?\"</p><p>\"It's as we feared—we've been called back to sea early. We set sail in less than a week.\" He stared down at the congealing plate of beef before him, his appetite lost. There had been a time once, immediately after his wife had died, when he would not have minded the abrupt summons back to duty. Then there had been no one waiting for his return to land and home. Now . . .</p><p>\"Damnation,\" he growled again under his breath. \"The men will be barely rested. They'll be resentful and surly and there's bound to be fighting.\" He glanced up at Cranston. \"Better make sure our supply of grog is in order.\"</p><p>Cranston nodded. \"Aye, sir.\"</p><p>\"And tell the other officers that discipline will be tight—no looking the other way over minor incidents. Better a flogging or a stay in the brig than one of my men maimed or killed in stupid fisticuffs.\"</p><p>\"Aye, sir.\" Cranston stood. \"With your permission, I'll begin preparations.\"</p><p>\"Good man.\" Isaac watched the lieutenant weave his way through the tavern crowd. He had preparations to make as well—accounts to be settled, business to be transacted before he sailed again. The list was never-ending when one spent the majority of time at sea. But tonight he wouldn't do any of that.</p><p>Tonight he'd visit Coral once again.</p><p>He glared at his piece of beef, his mood foul as he remembered how she'd used him the night before. He'd known making love to Coral wouldn't be easy, but the woman had used him like a goddamned whore. And then she'd somehow expected him not to notice that she'd never been engaged in the act at all. He'd left her before he said or did something he'd regret later.</p><p>\"Will ye be wantin' more ale, sir?\" the tavern wench asked flirtatiously at his elbow.</p><p>He looked up and unconsciously transferred his glare to the poor woman. Her pretty blue eyes widened in fright.</p><p>Isaac smoothed his expression and made his voice gentle. \"Nay, lass, I'm done here.\"</p><p>Outside, the sun was beginning to set, taking her warmth with her. Isaac pulled his cloak about his body as he walked to Aphrodite's Grotto. All the way he brooded on Coral and her deceptions and the kind of fool who would return to a woman such as she. But when he at last stood before her little door and watched it open he forgot all that.</p><p>Coral's chin was lifted, her mouth stretched in a faintly mocking smile, but he could see the uncertainty that lurked in her exotic green eyes.</p><p>Isaac sighed. \"Invite me in, love.\"</p><p>He saw the flicker of surprise in her eyes before she stepped back. \"Please come in, Captain Wargate.\"</p><p>He nodded. \"Thank you.\"</p><p>Her small concession soothed him a bit. He entered the room and turned to study her. She didn't seem to know quite what to do, now that he was here.</p><p>Well, that made two of them.</p><p>\"I don't know what you want,\" she said, sounding accusing.</p><p>\"I know,\" he replied drily.</p><p>She looked hurt.</p><p>Oh, Christ. He rubbed his jaw, realizing absently that he needed a shave. \"Do you have any wine?\"</p><p>\"Yes.\" She glided to the table and poured him a glass, bringing it to him. She offered the wineglass to him silently, holding it in both hands.</p><p>He took it, meeting her gaze. She wasn't the type of woman to apologize, even if she'd known—and admitted—what she'd done wrong. The very first captain he'd served under—a wise old seadog—had told him that happy men accepted what was real and under their nose. Chasing after impossible wishes only drove a man to melancholy and excessive drink.</p><p>Isaac sipped his wine, then walked to the table and set the glass down, feeling suddenly lighter. He looked at Coral. \"Come here.\"</p><p>Her expression was clearly wary, but her curiosity must've won out over her reticence. She crept closer, stopping just out of arm's reach.</p><p>He sat on a chair and spread his legs, patting one knee. \"Come.\"</p><p>Her look was almost resentful, but she came nonetheless, perching uneasily on his thigh. He wrapped an arm around her, but held her back when she tried to kiss him.</p><p>\"What do you want from me?\" she exclaimed irritably.</p><p>\"Let me explain,\" he said soothingly as he drew her skirts up with his free hand. \"You and I have a confusion as to terms.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She glanced down distractedly as he slid his palm under her skirts, along her bare thigh. \"What?\"</p><p>\"Making love,\" he stated and traced a gentle circle against her warm skin. She was so soft, it was like petting a kitten. \"To you the phrase means an exchange of money, a business transaction with only one of the parties deriving pleasure. To me making love is a mutual thing of benefit to both.\"</p><p>She caught his wrist, stilling the hand on her thigh. Her eyes were a little desperate. \"What do you mean to do?\"</p><p>\"I'd like to show you my way of making love,\" he said gently.</p><p>She hesitated, clearly thinking it over. He let her, patiently waiting. She had to agree to the act—he'd not make her.</p><p>Finally she let his wrist go.</p><p>\"Good girl,\" he breathed, and traced the fine line of her leg up until he touched maiden hair.</p><p>She bit her lip.</p><p>His cock jumped at the sight, but this wasn't for him tonight. He threaded his fingers through the springy hair, letting her get used to his touch. When she began to relax he moved lower, finding soft, damp flesh.</p><p>\"What are you doing?\" she whispered.</p><p>\"Making love to you.\" He bent his head to hers and touched his mouth gently against her lips, parting them as he parted the lips below. It had always amazed him, how delicate a woman was here. How sweet and soft. His wife had been ashamed of her sex, refusing to let him explore her as he'd like. He opened his eyes as he kissed Coral and wondered if she'd let him spread her naked on her bed one day. Let him look and touch and kiss.</p><p>That thought had his balls tightening, the blood pounding through his veins. He wanted to put himself inside her, to feel that lush, wet heat again. Instead he gently stroked, seeking and finding that special place.</p><p>She jerked, her eyes flying open.</p><p>He watched her. Surely she'd been touched here before? But maybe she didn't allow her lovers this intimacy. He felt a surge of possession at the idea—that she'd let no other man play with her.</p><p>Give her pleasure.</p><p>Because she was pleasured, he could see it in the pink flush rising in her cheeks, in the dazed expression in her eyes. His fingers were becoming slippery with her desire. He circled that little bud, felt it stiffen and come erect.</p><p>\"Don't,\" she whispered suddenly, her legs clamping together so his hand couldn't move.</p><p>\"Coral,\" he said sternly. \"Let me.\"</p><p>She looked at him, and at the sight of her eyes he nearly let her go--they swam with tears. But if he backed down now they might never reach this place again.</p><p>He held her gaze. \"Please.\"</p><p>She closed her eyes and her thighs eased apart.</p><p>He leaned close and kissed her temple lightly. \"You're so beautiful I am awe-struck. I want to lay beside you and simply watch you sleep. I want to hold you in my arms and make you tremble.\"</p><p>She gasped and he smiled against her ear. \"I want to touch you until you forget yourself, forget where you are, forget the world.\"</p> <p>He could feel her fine tremors now and his fingers were drenched. She was so close! The animal part of him wanted to lay her flat, pound himself into her until he felt his own release. He grit his teeth and reined himself in, keeping his fingers gentle, trying to ignore the soft hip pressed into his erection.</p><p>\"Come for me, Coral,\" he whispered, and circled her nub. \"Come for me.\"</p><p>She jerked suddenly and he thrust a finger into her heat, groaning at the tightness, the slippery wet. This was his woman, the primitive whispered, and he'd bring her joy no matter what cost.</p><p>Her hands were wrapped about his wrist now, but not to stop him. He watched her eyes close, watched as her teeth worried her lip, and even if he couldn't be joined with her when she climaxed, he could take a small sip. So he kissed her—savagely and open-mouthed, thrusting another finger into the place his cock wanted to be, using her roughly now.</p><p>And she came apart in his arms, moaning under his mouth, jerking against him, her cream flooding his fingers.</p><p>He continued to pet her, his strokes becoming softer as she descended from her peak until he finally broke their kiss and laid his forehead against hers.</p><p>\"That,\" he whispered in a voice he struggled to contain, \"is making love.\"</p><p>She swallowed, opening her magnificent green eyes, looking almost shy. \"Thank you.\"</p><p>He wanted to smile, but damn it, he was too near the edge.</p><p>She framed his face with her small, cool palms, and kissed him chastely on the mouth. \"Now can we make love together?\"</p><p>Chapter 9</p><p>The Ice Princess stretched out a long slim arm, pointing to one of the ice statues that stood about her. \"There is your brother Tom. You may have him if you but bring me three things.\"</p><p>The soldier cocked his head. \"And what are those?\"</p><p>\"First the courage of six lions.\"</p><p>\"Tut. Is that all?\" the soldier said. He opened his sack and withdrew the severed manes of six male lions. \"I have killed six lions and thus I have the courage of six lions.\" . . .</p><p>--from The Ice Princess</p><p>Coral felt awkward--foolish and uncertain. She'd never done this thing, never made love as Isaac called it. A week ago she would have laughed scornfully at the mere words.</p><p>Prostitutes did not deal in love.</p><p>But here, alone in this quiet room with Isaac, she was no longer a prostitute. She was a woman with a man she . . . cared . . . for deeply, and suddenly the notion of making love didn't seem so very naive at all.</p><p>Of course that didn't make her any more skilled at it.</p><p>She kissed him, feeling the warmth of his lips, the rough slide of his tongue. Her skin was almost too sensitive, too aware. She tried to hide the trembling of her hands by clenching them in his coat.</p><p>And then he suddenly lifted her, prompting an undignified squeak from her throat. She looked up and saw Isaac grin, his strong white teeth flashing, as he carried her to the bed.</p><p>\"Yes,\" he said and for a moment she couldn't remember what he replied to. He laid her gently on her bed and stood back to take off his coat. \"Yes, now we can make love.\"</p><p>She wasn't sure what to do, so she simply lay and watched as he efficiently shucked his clothes. His upper body was tanned from the sun, his lower limbs a shade lighter. He was tall and well-built with broad shoulders, long, powerful legs, and large feet. He looked like a man in his prime. A man aware and sure of his own strength. He glanced at her and she was suddenly aware that she'd made no move to disrobe.</p><p>\"Oh.\" She fumbled at the hooks to her bodice, her fingers thick and clumsy.</p><p>\"Let me.\" Isaac was beside her, sitting on the edge of the bed. He glanced up at her, his black eyes glinting. \"Do you mind? I've been dreaming about this.\"</p><p>He'd dreamed of undressing her? Coral swallowed and let her hands fall away, feeling unaccountably shy. Isaac bent over her, his warm fingers working at the hooks to her bodice. His breath this close was intimate and slow. She watched his face as he worked, studied the planes of his cheeks, the firm set to his lips.</p><p>He glanced up and half smiled. \"Lift up so I can pull this away.\"</p><p>\"Of course,\" she whispered, helping him to divest herself of her gown.</p><p>But he pushed her back gently when she would've unlaced her stays. \"My job, remember?\"</p><p>She nodded, conscious of the rise and fall of her breasts beneath his hands. He opened her stays and pulled them from underneath her and then she lay in only her chemise, her breasts free underneath. For a moment he simply sat and stared at her and then he slowly stroked his big hands up to enclose her breasts in his palms.</p><p>\"You are so lovely,\" he rasped.</p><p>She closed her eyes. She'd heard these words countless times before from countless other men and yet they'd never meant anything before tonight. She was beautiful to him and here, now, she was glad.</p><p>She felt him brush gently at her nipples through the thin fabric of her chemise and then the sudden warm heat of his mouth closing over one breast. She jerked a little at the touch and he immediately raised his head.</p><p>She looked at him in question.</p><p>He shook his head. \"If there is anything you don't want to do, anything that makes you uneasy or feel sad, we don't have to do it. Just tell me.\"</p><p>She swallowed through the thickness in her throat. \"No, it isn't that. Your touch pleases me. I was . . . surprised. That's all.\"</p><p>\"Ah.\" He looked at her a moment longer before he grinned, quick and hard. \"Then let us see what else you might find surprisingly pleasing.\"</p><p>He bent and placed his mouth once again on her breast, pulling strongly through the tissue of her chemise. Coral drew a shuddering breath at the exquisite sensation--and at the almost overwhelming feeling of heartache. She laid her hand rather hesitantly on his head. She'd never done this before, this making love. But she loved his hair and she gently pulled the ribbon holding his queue free. She threaded her fingers through his hair as he moved to her other breast to suck. She was used to being the one giving the pleasure, the one in control. To simply lie back and let him attend to her was strange.</p><p>Strange, but not unpleasant.</p><p>She closed her eyes, letting the erotic warmth fill her. She was already sensitive from her earlier orgasm and Isaac's attention to her breasts was making her come alive again. She squirmed under him.</p><p>\"Lie still,\" he murmured, and she thought she heard a hint of laughter in his voice.</p><p>She would've frowned at that, but he was pulling up her chemise, bunching the fabric in his hands, baring her legs, hips and belly. He drew the chemise over her head and then she lay only in her stockings and garters. She blinked up at him, feeling a bit silly. He smoothed his hands over the silk of her stockings.</p><p>\"These are very pretty,\" he said as he pulled loose her pink ribbon garters.</p><p>She cleared her throat. \"Thank you.\"</p><p>His lips twitched. \"And these are pretty, too.\"</p><p>He ran his hands down her legs, pushing her stockings before them. She wasn't sure if he referred to her legs or the slips of silk. He divested her of those and then she was entirely naked before him.</p><p>As naked as he.</p><p>He placed his palms on her knees, spreading her wide, looking at her very center.</p><p>\"But this,\" he said in a voice that had roughened and deepened, \"is the prettiest of all.\"</p><p>And he bent forward to kiss her there.</p><p>Coral gasped--she simply couldn't stop herself. She'd been touched there, of course she had. Had even had men who had wanted to do what Isaac was so masterfully doing now. But all those times before she'd been working, had been very much in charge. She'd never let herself feel before.</p><p>Now feeling--almost painfully sweet feeling--overwhelmed her.</p><p>He was licking her, licking the flesh that he'd touched with his fingers so recently. Each pass of his tongue was slow, languidly thorough, explicitly right. Dear God, she wouldn't last a minute at this rate. His broad shoulders were between her thighs, holding them open, and she convulsively clutched at them. She mustn't clench her fingers too hard, she thought fuzzily as he opened his mouth about her bud, she mustn't hurt or scratch him.</p><p>\"Coral,\" he whispered, his hot breath brushing over her wet, throbbing flesh. \"Coral.\"</p><p>\"What?\" Dear God, he'd inserted his tongue into her and just as leisurely withdrawn it.</p><p>\"Stop thinking.\"</p><p>How did he know? Her eyes were squeezed shut, her breath coming in pants and her hips were moving in quick little jerks that she couldn't seem to control.</p><p>He took her in his mouth and sucked, flicking his tongue over and over until she arched and cried out her ecstasy. Her world exploded, shimmering heat spreading from her center, her breath caught in her throat, her nails digging into his shoulders. He didn't stop. He kept licking and sucking until she was near begging for mercy. Then suddenly he was crawling up her, big and feral, his erection brushing over her legs and thighs. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She opened her eyes, alarmed to find herself digging her nails into his shoulders. \"Oh! I'm so sorry. I didn't mean to--\"</p><p>He silenced her with a hard kiss, open-mouthed and possessive. \"Never apologize for the pleasure you feel with me.\"</p><p>She looked up at him in wonder, this good strong man who wanted to make love to her. Who wanted to give her pleasure without any of her apologies. She didn't deserve him, she'd always known that, but for now she'd lay aside that knowledge and take what he gave so freely.</p><p>So she wrapped her arms about his neck and pulled him closer. \"Please make love to me, Isaac.\"</p> <p>\"Together.\" He bent and kissed the corner of her mouth softly. \"Together we make love.\"</p><p>He reached between them and positioned himself. Then he raised his head and gazed into her eyes as he slowly--oh, so slowly!--entered her.</p><p>\"Like this,\" he whispered as his warm flesh parted hers, entered hers.</p><p>He was hard she was soft and they united as sweetly as if they'd been created to do this. Make love together. He settled on her, his hips fitted to the cradle of her thighs, his belly pressed flat to hers. It was an age-old position, a position that was impossibly intimate. She felt him inside of her and on top of her, dominant but not fearfully so.</p><p>\"Is that it?\" she whispered, daring to tease.</p> <p>\"Oh, no,\" he replied. \"There's more, I assure you.\"</p><p>He withdrew and thrust into her, his rhythm sure and strong. She lifted her hips to meet his. It wasn't as elegant as merely laying and receiving him, but he said they'd do this together and she meant to fulfill their bargain. So she moved with him, their slippery flesh sliding. His penis rubbed against her and into her with each stroke. Her breath came faster.</p><p>\"Wrap your legs about me,\" he panted.</p><p>She lifted them high, crossing her ankles above his buttocks, locking them together. They could hardly move apart to thrust together again, but somehow that made it even better. She felt a drop of his sweat splash on her shoulder. She heard the wet, squishing sounds they made. She smelled the rising mist of their bodies.</p><p>It was all so beautiful that she began to sob.</p><p>She was afraid he'd misunderstand, that he'd grow alarmed and stop, but instead he leaned down and nuzzled against her cheek. \"Don't hold it in. Let yourself feel it.\"</p> <p>She did. It was like a glorious sun, rising, bright and hot, between them. She arched back her head and shouted, crying and laughing at the same time, her emotions, her body, free and out of control.</p><p>He watched her, she knew, still rocking against her, still softly kissing her, until his own body jerked and stiffened and his own crest combusted with hers.</p><p>Until they both went up in flames together.</p><p>Chapter 10</p><p>A slight frown marred the Ice Princess' perfectly cold face, but she continued. \"Next I will need the wisdom of the oldest man alive.\"</p><p>\"Easily done,\" the soldier replied. \"For whilst on my journey I stayed the night with the oldest man alive. He was a jolly fellow and after I'd mended his smoking pipe he gave me a book in which he'd written down everything he'd learned in all his long life. I have it here.\"</p><p>And the soldier withdrew an old and battered book from his sack and gave it to the Ice Princess. . . .</p><p>--from The Ice Princess</p> <p>Isaac opened his eyes with the realization that he held a soft warm weight against himself. Coral still slept, her pale fingers threaded through the hair on his chest, her golden-red hair spread over his shoulder and against his cheek. He listened to her exhaled breaths and felt a peace such as he'd never imagined before. And in that moment he made his decision: he would marry this woman, no matter their differences and her past. He would care for her and live with her and love her until she let down her defenses and loved him back. Until they were both happy and at peace.</p><p>She opened her green eyes at that moment and blinked sleepily, yawning delicately like a cat. Her eyes focused on his face and narrowed in sudden suspicion. \"What is that look on your face? What are you thinking?\"</p><p>He leaned over to kiss her nose and then grinned. \"I'm thinking that I could eat an entire joint of beef for breakfast.\"</p><p>She wrinkled her nose as if the kiss had tickled her. \"I don't know about a joint of beef, but I'm sure we can find a gammon steak and some eggs for you.\"</p><p>\"And coffee and toast?\" he asked hopefully.</p><p>\"Of course.\" Her voice was cool, but her lips curved in a shy smile. \"I'll ring for breakfast.\"</p><p>To his disappointment she rose immediately from the bed, modestly pulling on her worn green silk wrap. He'd rather hoped to make love to her again. But as he watched her quickly yank the bell-pull and then nervously straighten the little mirror and portrait on her dresser he understood. She needed time. He must school himself to patience, win her over bit by slow bit.</p><p>So he rose as well and donned his breeches and shirt, moving slowly, feeling as if he trod delicately about a wild animal who might be frightened by sudden movement.</p><p>The maid came to the door and Coral went to consult with her before returning to the middle of the room. She stood twisting her pale hands together.</p><p>Isaac smiled. \"Come sit with me at the table.\"</p><p>She nodded and sank into a chair.</p><p>He took a seat opposite her. \"When I was a boy my mother would make me runny eggs for my breakfast.\"</p><p>She wrinkled her nose. \"Runny eggs?\"</p><p>\"With the yolk still liquid.\" He stretched his legs under the table. \"She'd toast me slices of bread, butter them well, and cut them into sticks and I'd dip them into the yolks.\"</p><p>She seemed to relax a little. \"Where did you grow up?\"</p><p>\"On the coast of Cornwall.\"</p><p>\"Really? I would've thought London or nearby.\"</p><p>He shook his head. \"I grew up near the wild windy cliffs. My father was a mining foreman and my brothers still work managing mines. But I always loved the sea. My mother's father was the captain of a ship and he bought me my first commission.\"</p><p>She looked at the table, placing her hand flat against the surface. \"Is she still alive, your mother?\"</p><p>\"Yes.\" Someday soon he'd take her to meet Mother, but he didn't tell her of that. \"And the sister you once spoke of? Is she alive as well?\"</p><p>\"Pearl.\" She smiled a little sadly. \"Yes, she's still alive. She's married, in fact, to a land steward in Essex. She seems happy.\"</p><p>\"Seems?\"</p><p>\"I haven't seen her in years,\" Coral said softly.</p><p>Isaac frowned, but before he could question her, the maid entered with a full tray of food. There was a pause as the maid set the table and arranged their repast, and then Coral thanked her and she left.</p><p>Coral placed a large ham steak on a plate and handed it to him. \"At what age did you go to sea?\"</p><p>\"Twelve.\" Isaac helped himself to coddled eggs from a dish and some toast as well. \"And I was so homesick the first month that I thought I'd die before I ever saw land again.\"</p><p>\"Truly?\" Coral paused, the teapot half-lifted toward her cup. \"I can't imagine you uncertain or afraid.\"</p><p>\"But I was just a boy like any other,\" he replied in amusement. \"All boys miss their mothers when first they go to sea.\"</p><p>\"All boys may miss their mothers, but I doubt very much that you were like all the other boys. You became a captain—surely they don't all rise so high.\"</p><p>\"No, of course not.\" Isaac buttered a piece of toast. \"I was fortunate to serve my first commission on a ship with a wise old captain. He took me under his wing.\"</p><p>\"You were fortunate.\"</p><p>\"Yes, I was. He made me into the man I am today.\"</p><p>\"Then I would thank him if I met him, for I like very much the man you are today,\" she replied quietly.</p><p>Isaac looked at her, wondering at the sad undertone in her voice. \"You'll put me to the blush.\"</p><p>\"Yes. well.\" She stared down at the table, fiddling with her silverware. \"I wonder that you haven't heard that quite often from other females.\"</p><p>\"Not so very often,\" he said gently.</p><p>\"You said your wife died years ago,\" she said, still to the table. \"Haven't you thought of marrying again?\"</p><p>\"I'm away for months at a time at sea. A captain's wife can accompany him, but not many ladies are strong enough for that life. Alice, my late wife, certainly wasn't. Any woman I take to wife would either have to be able to sail with me or be able to withstand months alone.\"</p><p>\"Ah.\"</p><p>He was thrilled that she seemed interested in the subject, but frustrated that he couldn't read her face. Was the prospect of being a captain's wife too daunting? Or was she intrigued by the thought of sailing the sea?</p><p>\"I confess,\" he said carefully, \"that for a time I thought I would never remarry. Lately, however, I have begun to think a wife would be a very good thing.\"</p><p>\"Oh,\" was all she said.</p><p>Still, he decided to take her response in a positive light--she had not rejected the idea outright. Isaac made sure to keep the conversation light after that and when he rose from the table some fifteen minutes later, his cheerful mood was restored.</p><p>\"Tonight then?\" he asked as he paused at the door to her room. \"This is the seventh night of my winnings, I believe.\"</p><p>She caught her breath as if she'd just remembered as well. Suddenly she was before him and she reached up and caught his face between her soft hands and pulled him down to kiss him. Her mouth was open, her lips wild, and he felt himself harden, took a step back into the room, crowding her toward the bed.</p><p>\"No,\" she gasped, tearing her mouth from his. She placed her hands flat on his chest and smiled, though her lips trembled. \"I'm sorry. I know you have business to do today. Go.\"</p><p>\"You're sure?\" He had business, but at the moment whatever it was had flown his mind.</p><p>\"Yes.\" Her fingers worried at one of his brass buttons. \"Just don't forget me.\"</p><p>He grinned. \"Small chance of that.\"</p><p>\"You promise?\"</p><p>\"Yes,\" he said slowly. She was too intense. What worried her now?</p><p>But before he could ask, she stepped back and wrapped her arms about herself. \"Go, then.\"</p><p>He left quickly before his body could change his mind. With only a few days left now before the Challenger sailed, he was indeed busy. Still he found time to visit a small jewelry shop and make a purchase before the day was over. By the time he made his way back to the Grotto that night, it was well past dark.</p><p>So he was a bit surprised then not to find the usual guards outside the big double doors to the brothel. Perhaps they'd been called inside to deal with an unruly patron. Isaac let himself in the Grotto and immediately saw a crowd of girls and some guests gathered at the door to one of the salons.</p><p>\"It's my house!\" someone was screaming from inside.</p><p>Isaac pushed his way through the crowd, fearful that Jimmy Hyde was threatening Coral. But what he saw inside the salon was a different scene altogether. The two men who usually stood guard by the front doors each held one of Jimmy's arms—and none too gently. The little man was half lifted off his toes. But still he managed to hurl threats and scream obscenities at the man who stood in front of him. Big Billy had his arms crossed and was watching Jimmy with dispassion.</p><p>When the little man stopped to gasp for breath, Billy spoke. \"You saw the papers right enough. Our Aphrodite has bought the shares fair and square and signed the Grotto over to me an' the girls. Now git on wi' ye. We have no use for ye anymore.\"</p><p>With that Jimmy was dragged through the crowd which began to cheer.</p><p>\"Drinks on the 'ouse for all in honor of our Aphrodite!\" Billy cried above the shouting.</p><p>Isaac made his way to Billy's side as the girls and men began to go in search of free champagne. \"What has happened?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Billy looked at him, a grin splitting his homely face. \"She did it! She went to the other shareholders and persuaded them to buy out Jimmy. He'd gotten into debt, made a few bad deals, and she had them demand a marker there, whisper a word here, and hey, presto! Jimmy's out of the Grotto. It belongs to us now—the girls and the guards.\"</p><p>\"And to Coral as well, I presume,\" Isaac said quietly.</p><p>Billy shook his big head slowly, sobering a bit. \"She sold out.\"</p><p>Isaac felt ice enter his chest. \"What do you mean?\"</p> <p>\"She's gone.\"</p><p>Even as he heard the words, Isaac was running from the salon, making for the stairs. But as he took them two at a time he knew already.</p><p>Coral had left him.</p><p>Chapter 11</p><p>A muscle twitched in the Ice Princess' cheek and a very small piece of ice chipped off.</p> <p>The soldier raised his eyebrow and asked, \"What is the last thing?\"</p><p>\"The heart of a good man,\" she whispered.</p><p>\"Ah, that is the easiest of all,\" the soldier replied softly. He leaned forward and placed his mouth against the Ice Princess' cold, cold lips.</p><p>And then a very strange thing happened. For instead of the soldier freezing, the Ice Princess thawed. Hot tears spilled from her eyes, melting the ice that covered her face. . . .</p><p>--from The Ice Princess</p><p>The wind caught her skirts and swept them against her legs. Coral pushed back a lock of hair flying against her cheek. Out beyond the cliffs the iron-grey sea was pushing whitecaps toward the shore and the heavy, damp air tasted of salt. She'd never lived by the sea, had been born and bred in the heart of London, but somehow it had seemed right when she'd left the Grotto to come settle here.</p> <p>She half-turned and looked back along the worn narrow trail by the cliffs. Her cottage was on the horizon, a small white dot. It was a tidy little house with four rooms and a garden and it was all hers. With the money she'd saved from the Grotto she should be able to live the rest of her days comfortably if not extravagantly. She'd hired a woman from the village to come in twice a week to clean and cook. Perhaps she'd even learn to garden. Coral imagined herself in a wide-brimmed hat and an old apron, cutting some type of flower-perhaps daisies. She'd bring the flowers into her kitchen and place them in a blue glass vase. Billy and the girls and boys at the Grotto would laugh if they saw her in such a domestic picture.</p><p>Coral wrinkled her nose. The cottage, her peaceful life by the sea, even the garden she had no understanding of, were perfect. Were everything she'd worked her entire life for: independence and freedom. And yet.and yet her life here was so lonely.</p><p>So very lonely.</p><p>Coral faced forward again, walking beside the cliffs as she did everyday. Maudlin regrets were simply silly. Her sister, Pearl, would've been quite pleased to have Coral come live with her and her husband, but it hadn't seemed right somehow. Pearl was so happy now, so very settled into domestic bliss, that Coral would've felt like a third wheel: unnecessary and awkward. So she'd come here, to live beside the sea. If she were honest with herself, she'd hoped, deep down inside, that Isaac would follow her. Oh, she knew the wish was impossible--she'd left no note, no direction, no way for him to figure out where she'd gone, even if he'd wished to follow her, but the hope had been there nonetheless.</p><p>Or it had been.</p><p>Coral kicked a small pebble rather viciously and it went careening off the cliff. She'd held out hope for week after week, but now it had been six months and hope had died. He was at sea again by now, or--wretched thought!--had found some other lady to court.</p><p>For he'd courted her--she acknowledged that now. He'd wooed her and made love to her, and in the end she'd fallen--hopelessly and helplessly--in love with Captain Isaac Wargate. A sob lodged in her chest and Coral stopped, gazing sightlessly out toward the gray sea. She loved Isaac. After a life lived as a whore, after never feeling the slightest emotion for any man, she'd fallen in love. A tear slipped down her cold cheek. Oh, how the gods must be laughing! She'd never see him again, would live out the rest of her dreary life here by the sea simply because it reminded her of him.</p><p>Coral sighed, fished a tattered handkerchief from her sleeve, and wiped her face. How very stupid to stand here weeping in the wind. It must be almost luncheon time and whatever stew the woman from the village had made would not taste better cold. Best to start back. She turned, watching her footing for the path was rather rocky, and when she at last looked up she thought at first that she was imagining it.</p> <p>She blinked, but the sight was still there.</p><p>A man, small in the distance, but growing larger at a rapid pace. He strode over the gorse, his steps firm and long, and even from here she could tell that he wore a naval uniform.</p><p>Coral's heart began to beat like a wild thing trying to fly. A long black cape blew against his legs and his shoulders were set with determination. He must've seen her, but his stride didn't break and his expression didn't change. He was grim, like a man going to war, his wide mouth straight, his cheeks like granite, his black eyes dour beneath lowered brows.</p><p>She had an instinctive animal urge to flee before his grim advance, but it was too late now. He was upon her.</p><p>She lifted her chin and opened her mouth--to cry for joy or to offer explanation, she did not know and it didn't matter anyway.</p><p>He seized her shoulders and kissed her.</p><p>Chapter 12</p><p>And as the ice covering the Ice Princess melted, the frozen statues thawed as well, until hundreds of living, breathing men stood where once there had only been frozen bodies.</p><p>The men gave a great cry and each and every one of them started the journey back to their own homes. Soon only the Ice Princess and the soldier remained. Hot tears continued to drip down the Ice Princess’ pink cheeks, falling into the hands she held in her lap.</p><p>The soldier looked at her and asked, “Why do you weep, sweetheart?”</p><p>The Ice Princess drew a heavy breath. “You’ve freed all my ice men and soon you’ll leave as well. Then I shall truly be alone.” . . . .</p><p>--from The Ice Princess</p><p>This. This was exactly what he wanted.</p><p>Isaac wrapped Coral in his arms and kissed her with all his soul. He’d spent the last six months wondering if he’d ever see her again—if he’d ever find her again—and now at last he had her. Something quieted in his chest. The hawk beating its wings against his ribcage all this time settled and closed its eyes. Finally. Finally he’d found her.</p><p>Not that his ire was altogether appeased.</p><p>Her lips trembled beneath his and she parted them with gratifying speed. He took her offer and plundered her mouth, making sure she knew who kissed her. Knew that he had no intention of letting her go this time.</p><p>He raised his head and examined her. She wore a plain frock and shawl, an almost Puritan white cap upon her head. Had she thought to hide her beauty from him with such a meager disguise?</p><p>“I searched for you,” he said with careful precision. “I searched for you obsessively for the six days before the Challenger left port--”</p><p>She blinked. “Six days?”</p><p>“And when I returned only a fortnight ago,” he continued, determined to speak his fill. “I stopped only long enough to see my men safely to port before continuing the chase. I haven’t even had time to sit down to a proper meal on land since I made port, all because I was searching for you. And the worst part, the most damnable part of all--is that until I came over that hill and saw you standing here I had no proof that I would find you at all.”</p><p>Here he may have let his iron control slip a bit for he found himself kissing her again, devouring her mouth like a starving man presented with a loaf of bread. When he raised his head again he saw with some satisfaction that her cheeks had pinkened and she was looking a bit dazed. He almost smiled, but he restrained himself in time.</p><p>“Explain yourself, madam.”</p><p>“I-I...” For a moment her cat-green eyes were dazed, but then they narrowed in suspicion. “How did you find me?”</p><p>Her mode of attire might have changed, but her wit obviously had not. He leaned close, her nearness warming his heart. “I’ll tell you how I found you when you tell me what was going on in that pretty head of yours when you abandoned me—”</p><p>She stiffened. “It wasn’t abandonment—”</p><p>“After a night of sublime lovemaking,” he continued, “which, I think most would agree, would lead any man to believe our relationship had taken on a permanent basis. I think I could successfully bring a suit of breach of promise against you—”</p><p>“Oh!”</p><p>He bent and bit her ear gently. “Therefore, I would be most grateful if you would give me a reason for causing me such heartache.”</p><p>When he raised his head again she was looking contrite. “I never meant to cause you heartache, Isaac.”</p><p>He raised a skeptical eyebrow.</p><p>Her color heightened. “I didn’t! You must know that we could never be together for very long. We—”</p><p>“Why not?” His words were clipped as he felt his ire rise.</p><p>She gaped at him—and then began to laugh, though the sound was a little desperate.</p><p>Isaac contemplated kissing her again—or simply taking her here on the cliffs, but they needed to have this conversation in order to move forward. And besides, it was a chilly day.</p><p>So he simply waited until her gasping laughter quieted and then raised his brow again.</p><p>Her mouth turned down at the sight, the corners bitter and lined. “I’m a whore.”</p><p>“Were.”</p><p>“I beg your pardon?”</p><p>“You were a whore,” he enunciated clearly. “But no longer.”</p><p>She shook her head as if the past tense was trifling. “You are a respectable man. A man whose entire career could be ruined simply by association with me.”</p><p>She stopped and glared at him.</p><p>He nodded encouragingly, but she simply stared at him, looking rather frustrated.</p><p>“Is that it?” he asked politely.</p><p>She threw up her hands. “Is that it? That’s everything, I should think! I left because I could not bear the inevitable severing of our relationship. I left because we could never be.”</p><p>“You left because you had a cowardly moment,” he replied drily. She opened her mouth in outrage, but he placed a finger over her lips. “My turn, I think.”</p><p>She closed her mouth and glared at him, mute, her arms cross.</p><p>“One,” he said, ticking his points off on his fingers. “You are no longer a whore. Two, you wore a mask, you little idiot—no one will recognize you if you don’t tell them your past. Three, I love you. Four, you love me. Five...”—He tapped his thumb against his chin—“Well, I really don’t have a fifth reason, but I should think the first four are sufficient.”</p><p>“But—!”</p><p>He smiled benevolently down at her. She really was quite lovely with her cheeks pinked by the wind, and he much preferred her simple white dress to the gaudy things she’d worn at the Grotto. “To answer your first question, I found you because of your sister’s portrait--remember you had her miniature on your dresser?”</p><p>She nodded, looking not a little distracted.</p><p>“Well, I had quite a lot of time to contemplate the matter whilst I was at sea. The minute I made port I went to the Grotto and talked to Billy. He sends his regards, by the way. He told me that you had received regular letters from an address in Essex. I tracked down the address, talked to your sister—she sends her love as well—and voila! Here I am.”</p><p>He watched her open her mouth once more as if to argue. “Ah, ah! Do you have any more questions for me?”</p><p>She shut her mouth, frowned quite charmingly, then said grudgingly, “No.”</p><p>“Good.” Isaac reached into his pocket and pulled out the ring he’d been carrying about for six long months. Though he had met warships in battle at sea, though he’d faced down maddened pirates, he noted with one part of his mind that his fingers actually trembled. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He dropped to one knee and stared up at the woman he loved. “Will you marry me, Coral Smythe?”</p><p>Epilogue</p><p>At the Ice Princess’ words the soldier threw back his head and laughed. “Have I not just given you my heart? Come with me and be my bride and we shall live in blissful happiness all the days of our lives.”</p><p>He held out his hand. The Ice Princess took it and gladly for she’d had enough of her icy throne.</p> <p>And the soldier and the Ice Princess did indeed live happily ever after.</p><p>--from The Ice Princess</p><p>Coral lifted her face, feeling the salt spray hit her lips. The wind was playful today, the sun shone brightly on the turquoise waves, and the Challenger rode the sea like a porpoise.</p><p>“We’ll make Gibraltar in another day,” Lieutenant Green said beside her.</p><p>Coral turned and smiled at him, watching in some amusement as the young man’s face suffused with red. He couldn’t be more than nineteen.</p> <p>“How exciting, Mr. Green,” she murmured. “Have you seen the rock yourself?”</p><p>“Me? Oh, no, ma’am.” The poor man’s ears were fiery now. “Of course the Captain has been there many a time. But this’ll be my first.”</p><p>He stopped suddenly as if fearful of babbling on too long.</p><p>Coral took pity. “Then you must be as excited as I, Mr. Green. Would you care to join the captain and me at dinner tonight? We shall both bombard him with requests for his recollections of his visits to Gibraltar.”</p><p>The lieutenant’s eyes widened. This was his first voyage on the Challenger and it was something of an honor to be asked to dine at the captain’s table.</p><p>“Yes, ma’am!”</p> <p>“Green,” came a deep voice from behind them.</p><p>The young lieutenant whirled, snapping to attention. “Sir!”</p><p>Isaac’s black eyes were impassive. “If you’re to dine with Mrs. Wargate and me tonight you’d best see to your linen.”</p><p>The boy blushed again, darted a look at his cuffs—which were sadly dingy—and darted off with a strangled, “Aye, sir!”</p><p>“You’ve scared him witless,” Coral murmured as she watched poor Mr. Green disappear below deck.</p><p>Her husband clasped his hands behind his back, still looking quite austere—if one didn’t note the twinkle in his hawkish gaze. “It’s my job to scare new lieutenants witless. Besides, I had the distinct impression that you were flirting, Mrs. Wargate.”</p><p>Coral widened her eyes innocently. “I, Captain Wargate?”</p><p>He leaned a little closer to breath in her ear. “You, Mrs. Wargate. We’re not a week out of port and already you’ve wrapped the entire crew around your little finger. As usual, I might add.”</p> <p>Coral fluttered her eyelashes. “Well, it does give me something to do.”</p><p>One ebony eyebrow lifted slowly. “If you find you haven’t enough to do on board, madam, that can easily be corrected.”</p><p>Coral felt a familiar quickening of her pulse. “Whatever do you mean, Captain Wargate?”</p><p>“I’ll be most pleased to show you,” he growled low, “tonight in our quarters.”</p><p>“Ah, captain?” One of the officers stood behind Isaac, trying to look as if he hadn’t overheard their exchange.</p><p>Coral hid a smile as Isaac turned to the man and they consulted on some business of navigation. This was her third voyage on the Challenger. On her first she’d held some trepidation that confined to a ship for months on end she might become bored. But to her surprise, the sea had won her over. Every day held a new horizon, a new possible adventure. She’d found, too, that there was something to be said for being the only female on a craft full of men. They all, from the youngest cabin boy to the most grizzled sailor, treated her as if she were a queen and, it must be confessed, she rather liked it.</p><p>But best of all, she was with Isaac. She watched as he completed his business with the officer and came toward her. He was magnificently handsome in his uniform, respected by every man aboard, and he was hers. The mere thought made her shiver.</p><p>He must’ve caught her shiver for his black brows snapped together. “Are you cold?”</p><p>“No, I--”</p><p>He stood beside her and placed one broad palm against her belly, hiding the movement with their bodies. “You are to remember to take special care of yourself now, madam.”</p><p>She lifted her chin, placing her own hand over his, both their palms against the new life that grew within her. “I know,” she said softly. “Never fear.”</p><p>His wide mouth curved into a smile, both rare and wickedly seductive. “I love you, my wife.”</p><p>“And I love you, my husband,” Coral replied with all the joy in her heart.</p><p>And Captain Isaac Wargate bent and kissed Mrs. Wargate there on the poop deck in full view of his crew and officers.</p><p>But then they were becoming somewhat used to the sight. </p> </body></html>"]