["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>Jesse had sworn Terrie would come to him. He wouldn’t spend agonizing months trying to ease her into a relationship she had stated she would never tolerate. So he tried to seduce her into it instead.</p><p>After Jesse’s brother, Thomas, died he had made himself indispensable to her. He was at the house often, fixing this or that, just talking or watching movies late into the night. Despite appearances, Terrie was a wary person, well aware of how easily she could be hurt, how weak she was physically. From what he had gathered, his brother had been more of a bastard than he had ever imagined.</p><p>Thomas had hurt her in the worst possible way. Terrie could have overcome physical abuse. She would have just left. But the systematic psychological and verbal abuse had damned near destroyed her.</p><p>“Now that was a beautiful wedding.” Terrie stumbled against him a bit as he helped her into the house.</p><p>James and Ella’s wedding ceremony had made her teary-eyed, reflective. She had sat in the limo on the way home, quiet, a bit sad, staring out the window as her fingers stroked over the upper swell of one breast her cream-colored dress had revealed. The action had caused his cock to swell—to harden in agonizing need.</p><p>Jesse’s brother, James, had married her best friend after nearly tens years of waiting impatiently on Ella to come around and be tempted by the sexuality he offered her.</p><p>“Well, it wasn’t a long one, anyway.” Jesse pulled her to him, leading her to the living room, enjoying her soft weight against his side.</p><p>The smooth silk of her dress slid against his hands, and when he sat her on the couch, the hem rode just below the crotch of her panties. Cream-colored silk as well. He was betting it was a thong.</p><p>“You kissed the bride.” Her surprising comment had his brows lifting in surprise.</p><p>He had kissed the bride. Long and deep, to her complete surprise and shocked arousal.</p><p>“Yeah, I did.” He knelt before her, removing the high-heeled shoes from her small feet.</p><p>“That was so decadent,” she sighed then. “Kissing her that way, with your tongue. You made her horny.”</p><p>He smothered his laughter. “That was the point,” he whispered up at her as he caressed the slight welts on the side of her foot.</p><p>She pouted. She had such an intriguing pout, and used it on him often.</p><p>“I promise not to kiss Ella again.” His hand stroked her calf as he felt a small tremor work over her body.</p><p>“Sax fucked her. He was at the wedding, of course.” She shot him a narrow eyed, disgruntled look. “I knew she couldn’t hold out. She gave in too easily.”</p><p>She sounded angry with Ella, though Jesse knew she was more than pleased that her friend had finally found some happiness.</p><p>“You, of course, would be much harder to convince?” he asked her, careful to keep his voice even, his hand on her calf comforting rather than arousing.</p><p>She leveled a hard look at him. “I am not so easy.”</p><p>That was sure as hell the truth. He murmured consoling words while massaging her foot, well aware of how the heels made her feet ache.</p><p>“I’m not your sister.” She jerked her foot from his grasp, staring down at him angrily. “Stop treating me like one.”</p><p>“Keep it up and I’ll turn you over my knee and paddle your ass.” He jerked her foot back. “Now what has you so upset? I thought you were happy for Ella.”</p> <p>“I am.” She was pouting again, watching him darkly.</p><p>“Then what’s your problem?” he asked her again.</p><p>“You’ve never kissed me like that,” she finally said, her cheeks blooming with a flush. “Why haven’t you?”</p><p>Her hazel eyes, more green than brown, watched him with narrow frustration and arousal. Her soft red hair cascaded around her face, the fiery waves tempting his hands to smooth them back from her flushed cheeks.</p><p>He pursed his lips. Her breasts were moving quickly beneath her dress, her nipples hard, poking impatiently at the light fabric. He allowed his hand to stroke higher along the inside of her leg.</p><p>“Because,” he whispered. “I can never decide where to put my tongue first.”</p><p>She blinked, confusion filling her expression. “What?” Her question was almost a gasp.</p><p>“You heard me.” His hand stroked to her thigh. “Do I take your lips and plunge my tongue into your mouth, Terrie, or do I push it as deep and as hard up your pussy as I can, and suck all that sweet cream into my mouth? Deciding is a bitch.”</p><p>Her mouth opened, her thighs tensed. He watched as she fought to breathe, to draw in air to counter the arousal he saw surging in her gaze. He parted her thighs then, his cock jerking at the sight of the damp spot on the silk of her panties. His gaze rose back to hers.</p><p>“Do you want that, Terrie? My mouth buried in your cunt, my tongue fucking you to orgasm?” Her thighs opened farther as a strangled moan whispered past her throat.</p><p>“Please,” she whispered, and his cock surged in joy then throbbed in disappointment as he gently closed her thighs.</p><p>“Remind me when you’re sober, Terrie.” He stood to his feet, staring down at her shocked expression. “I won’t fuck you drunk. Sober up, then call me. But don’t be surprised if you find out exactly why Sax was at that wedding, and what he’s most likely doing right now to your friend’s climaxing body. You won’t play with me, Terrie,” he warned her softly.</p><p>He turned and left the room, then the house. If he didn’t, he knew he would fuck her, knew he would drive his cock so deep and hard inside her she would scream for her orgasm. And he couldn’t. Not yet. She hadn’t seduced him; she didn’t want it enough. When she did, well then—he grinned—then he would give her everything he had ever dreamed she could take.</p><p>Chapter One</p><p>Remind me when you’re sober, Terrie. The words echoed through her head. You won’t play with me, Terrie.</p><p>She pushed her fingers restlessly through her red hair as she paced the house. He had left hours before, and she was sober, but she couldn’t find the nerve to pick up that damned phone. She was terrified.</p><p>You think I’m bad, her dead husband’s sneering voice echoed around her. I should give you a taste of Jesse, Terrie. Let him share you a time or two with his buddies. Maybe then you would appreciate me more. She shuddered. She appreciated Thomas more dead.</p><p>She shook her head as she moved into the small kitchen. She was free of one Wyman and now looking at another. Was she insane? And what was worse, she was looking at Jesse. The same Jesse who had fucked her best friend’s daughter. The same Jesse who had been her friend for the last three years. She shuddered as the thought repeated itself. She had to be crazy.</p><p>Jesse was part of a very select group of men. Tess, Ella’s daughter was married to one of them: Cole, Jesse’s best friend. Ella had walked into her ex-husband’s home to find her daughter held between Jesse and Cole in the final throes of an intense ménage.</p><p>Terrie had known for years that Jesse was part of this group. There were eight of them. Intensely dominate, charismatic men whose lusts knew few bounds. One of their greater demands was the ménage. The complete surrender and submission of their lovers to the pleasures they could bring them.</p><p>Ella, it seemed, had finally given in as well. Tess’s mother had been outraged, furious when she thought Jesse was actually his twin, James, fucking her daughter. She had nearly driven herself crazy with the pain. Loving one of those men was hell. Terrie knew this well.</p><p>Thankfully, James had grown tired of the wait and went after Ella in a way that left her little desire to fight him. Sax had been James’s choice for the final sexual obstacle in his path with Ella.</p><p>Terrie sighed bleakly. First Tess and now Ella. The two people who meant the most to her had stepped into a relationship that inhabited only Terrie’s darkest, most lust-filled dreams. The very thing that had driven her from accepting Jesse’s attentions years before in favor of what she saw as the safer brother.</p><p>Terrie moved from the kitchen to the back deck, sitting in the chair swing as she stared out into the slowly darkening evening. Her body was on fire. She knew what Jesse was. Knew his desires and what he liked. She couldn’t help but know. Thomas had been quite explicit in his description of them.</p><p>She curled her legs beneath her as the chair swayed softly with her weight. The soothing rhythm normally eased her stress, but tonight it seemed to only provoke it. The soft back and forth sway made her cunt clench with the thought of Jesse moving between her thighs, his cock thrusting into her hungry pussy with the same slow, steady movement.</p><p>She had sworn she would never allow herself to be shared, to be used by the man she loved. She remembered when Thomas first gleefully announced his brother’s preferences as Jesse sat at their dinner table. Not that Terrie hadn’t already been aware of them.</p><p>Terrie had been mortified by his drunken announcement, and more than shocked as Jesse sat back in his chair with that sardonic twist to his mouth and asked Thomas if he was trying to scare Terrie, or convince her to join in. It was then she learned that Thomas, too, had been part of the lifestyle Jesse enjoyed. Until he had married her.</p><p>She sighed wearily. Reliving the mistake her marriage had been wasn’t going to help her. Jesse was her problem now, not Thomas. And Jesse and his brother were like night and day. Of course, she had known that when she married Thomas. It was her fault. She had married what she considered a safer alternative. And had learned better, nearly at the expense of her sanity.</p><p>But none of that solved her present problem. That problem being Jesse Wyman and his incredible stubbornness. Call him when she sobered up. She snorted. She hadn’t been that drunk. She wasn’t so stupid she didn’t know Sax was joining Ella and James on their wedding night, either. Ella had confided that piece of news to her already.</p><p>God. Could she do it? Her pussy pulsed at the thought but all her previous beliefs screamed out in rejection of the idea. She knew Jesse would never go to another woman. Terrie had been with Ella when Tess imparted that information. The men wanted no one else. What they wanted was to see the women experience the pleasure of two men worshipping their bodies, glorying in their arousal.</p><p>Tess was more than happy with her marriage to Cole. Terrie’s hands clenched in jealousy as she thought of the other woman. How many times had Jesse been in Tess’s bed in the past year? How many times had he fucked her as Terrie lay aroused, dreaming of his touch. Touching herself because Jesse hadn’t been there to touch her.</p><p>God, she was demented. She had lost any claim to sanity. Or had she?</p><p>She groaned at the futility of her own argument. It didn’t matter, because fact was fact. There was no way in hell she could ask Jesse to fuck her with another man. There was no way she could seduce him...</p><p>So you’re Jesse’s lady. One of the men at the wedding had said as he had approached her. I can see why he’s dropped out of circulation now.</p><p>Jesse had moved in then, steering her away from the grinning blonde who watched her with wicked green eyes. What had his name been? She frowned as she tried to remember. Lucian. Wasn’t it Lucian? He didn’t work at Delacourte’s, she knew. Jesse had mentioned something about computers.</p><p>She snapped her fingers. Lucian Conover. He designed some kind of weird computer programs for the government, if she remembered correctly. Surely Jesse hadn’t already approached someone? What did they do, sit around with their beers and discuss who would fuck their women?</p><p>Her face flushed. Good God, what the hell was she getting herself into? Couldn’t he just fuck her? Would she settle for just being fucked?</p><p>“Dammit.” She jumped from the chair and moved quickly to the phone just inside the house. Jerking it off the base she quickly punched in Jesse’s number.</p><p>“Yes, Terrie.” His voice was dark, smooth, like rich chocolate. She had an addiction for chocolate.</p><p>“Did you ask Lucian Conover to help you fuck me?” she asked him point blank. Beating around the bush had never been her strong suit. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Silence met her abrupt question. A long, drawn out silence that made her begin to wonder if he had hung the phone up on her.</p><p>“Jesse?” Her voice was sharp, but her knees weakened.</p><p>“No,” he finally answered abruptly. “Not exactly. Are you sober now?”</p> <p>There was a shade of worry in his tone now.</p><p>“Very much so,” she snarled, thinking he was lucky she couldn’t throw something at him. “How would you like it, Jesse, if I approached one of my girlfriends to help me fuck you?”</p><p>Another silence. “Which one?” Was that curiosity in his voice? She almost rapped the phone against the table in irritation.</p><p>“You’re a menace,” she accused him heatedly. “And I’ve changed my mind. I don’t want to fuck you at all, Jesse. Actually, Mr. Conover seemed rather interested.” She checked her nails carefully as she considered the possibilities. “Maybe he’s not into the sharing deal after all?”</p><p>Jesse cleared his throat. “Terrie, I wouldn’t continue this way, if I were you.”</p> <p>“I bet he’s hung, too,” she said with apparent interest. “I hear he’s quite good in bed. Maybe I’ll find out. Good night, Jesse, and kiss my ass.”</p><p>She disconnected abruptly. Damn him. She knew he had talked to Conover. He must have. She gritted her teeth furiously. Trojans. They were Trojans, all right. Trojan headaches.</p><p>The phone rang with a harsh, shrill note. Terrie jerked at the sound before picking it up and glanced at the caller display knowingly.</p><p>“Yes, Jesse?” she greeted him sweetly.</p><p>“I’ll do more than kiss your ass, Terrie,” he promised, his voice dark, arousing. “You should know better than to dare me, baby.”</p><p>She felt a nervous shiver of anticipation work over her body. Her thighs clenched, the liquid heat of her vagina spilling from the lips of her cunt at the sound of his dark, deep voice. It rasped over the line, stroking her senses with erotic purpose.</p> <p>“Get a life,” she snorted. “I wasn’t daring you, Jesse, I was merely making a statement of intent.”</p><p>Silence sizzled over the line.</p><p>“You think you’re so brave,” he said, his voice gentle. So gentle, so filled with obvious affection, that she felt her throat tighten with emotion.</p><p>He could do that to her so easily. Have her furious, ready to flay him alive, then turn so soft, so incredibly tender she wanted to melt into a puddle of arousal at his feet.</p><p>“I am brave,” she reminded him, determined she wouldn’t be swayed this time.</p><p>She heard his disbelieving snort, as though he were trying to hide his disbelief.</p><p>“We’ll see,” he laughed gently. “Don’t worry, baby. I won’t press you on this. I want you, but I won’t take something from you that you don’t want to give. You’re safe.”</p><p>She frowned, biting her lips as she heard the regret in his voice. It was so like Jesse. The thought speared through her mind. Her heart. He was always so careful to be certain no one was hurt; that he gave rather than took from anyone. Would he pretend to want her to keep from hurting her? Or had he pretended he didn’t want her to save her from something he felt she couldn’t handle? With Jesse, it could have been either.</p> <p>“You don’t want me.” She fought the bitterness that closed her throat. She was terrified that was her answer.</p><p>“Terrie, I’m dying to fuck you,” he finally sighed. “I want you so damned bad my cock is hard enough to hammer nails. But I don’t want you hurt. Not ever again, baby. And I’m afraid what I need would hurt you. Go to bed, baby. Don’t worry about this. I promise, I still love you.”</p><p>His abrupt about face had tears stinging her eyes. He wanted her. She knew he did. But she would be damned if she would beg.</p><p>“You know, Jesse, there are times you aren’t fit to kill,” she snapped. “What makes you think I need your protection?”</p><p>“Terrie...”</p><p>“You go to bed, Jesse. See if you can sleep with that hard-on driving you crazy. And while you do, just remember. I offered. I won’t do so again. And I still love you, too.” And she realized in that moment just how much she did love Jesse.</p><p>She hung the phone up quickly. When it rang moments later, she watched it with narrow-eyed intent. She was a woman, not a child, and Jesse’s insistence on treating her with kid gloves was getting on her nerves. It was time to show him...</p><p>She smiled slowly. Oh yes, it was definitely time to show him that he wasn’t the only one who knew how to seduce. She could play the game just as well, and he was about to learn that lesson quite quickly.</p><p>Chapter Two</p><p>Terrie refused to let nerves or fear sway her. The time she had spent married to Thomas had curbed her natural responsiveness, her love of living, and she knew it. After the first month, he had refused to touch her. He had caustically broken down her confidence in herself and her sexuality. Nothing she did could please him. Each touch was dissected for faults and found wanting.</p><p>And he hadn’t been gentle in his lack of desire for her. He had raged often, and with cruel emphasis on the fact that it was her fault. Hadn’t he enjoyed sex before her, he would scream? She was destroying his manhood, destroying their lives with her inept responses. What man could want her? What man could desire her with the faults her body held? Her breasts were too large. Her legs were too short. Her hair was too thin. The list went on and on.</p><p>Of course, she had known, intellectually, that he was insane. Men had found her desirable before Thomas. But being unable to satisfy her husband, hearing daily his list of her shortcomings had damaged something inside her. If she couldn’t please her husband, how could she ever hope to please anyone else?</p><p>The cycle had nearly destroyed her. Having him invite Jesse to the house often, throwing his sexual preferences in her face, then later, after his brother left, cruelly going into detail about how little she could please a man of Jesse’s tastes, had almost broken her.</p><p>She had paid the ultimate price for her fear of Jesse’s sexuality. It had been that fear that had driven her into the arms of his brother. A man she had believed was gentler, less inclined to dominate and demand her submission sexually. Sexually, Thomas had demanded the ultimate price. He hadn’t wanted submission; he had wanted something far less gentle. Sexual slavery.</p><p>She shuddered as she smoothed the silk stockings up her legs and adjusted the elastic tops before standing to observe the effect in the full-length mirror. The black silk bra and thong contrasted softly with her creamy skin. She narrowed her eyes, smoothing her hand over her flat abdomen, then up to her full breasts.</p><p>Beneath the silk of her bra, her nipples peaked, making the small gold ring that pierced her left one weigh erotically on the sensitive tip. Between her thighs, a matching ring pierced the hood of her clit, and the weight there was driving her insane with the added sensation of pleasure.</p><p>She was wet, so slick and hot she could barely stand it. The silk of her thong was damp with need, the roughened texture against her bare cunt lips stroking her arousal higher.</p><p>Damn, the waxing Tally had talked her into had hurt like hell the first time. But as her friend had predicted, each session was less painful. The rewards had been amazing. She loved being bare. Loved the lift it gave to her sexual confidence, the amazing sense of freedom and added sensitivity had helped heal a part of her wounded pride after Thomas’s death.</p><p>Not that another man had touched her there. Until now, she hadn’t found the courage to break free of her own fears and try. If Jesse found her wanting, it would destroy her. But she needed to know. Needed to find out if she was woman enough to hold the arrogant, charismatic sexuality of the man who had fascinated her for years.</p><p>She knew what he would eventually want. Knew from her own dreams, her own fantasies that she was nearing the point of no control where they were concerned. She stared herself in the eye through the glass of the mirror. Was she perverted? Depraved? She had felt she was, years before, when she first learned of the Trojans and their sexual practices. When she had first learned she was so in lust and in love with one of the group’s major players that she had known she could and would, if he asked, join in his games.</p><p>She bit her lip, fighting her own fears and the morals she had been taught in her youth. Hell, she had broken every rule her mother had tried to drum into her head concerning sex and her body. Why should this one be any different? If he loved her...</p><p>“Oh God. I’ve lost my mind.” She threw herself on the bed.</p><p>She knew Jesse cared for her. He had to. He had taken care of her for almost three years. Had listened to her rage and cry during those first days when the guilt of Thomas’s death had weighed on her soul. He had held her, holding back his desire for her, and she knew he had wanted her. There was no hiding the erection that had filled his pants those nights.</p><p>He had never given so much time to any other woman. Hell, other than Tess, she knew he hadn’t been with another woman in ages. When she asked him about it, he had shrugged and claimed his workload was getting in the way. But he was spending plenty of time with her. Time that he could have used playing. If he had wanted to.</p><p>She loved him. She always had. Knew she did. But could she do this? Could she seduce him?</p><p>She turned her head, looking at the dress she had laid out on her bed earlier. It was sexy without being crude. The black silk would cling to her curves, without being overtly blatant. The scalloped neckline skimmed the tops of her breasts. The skirt stopped just above her knees. The matching black heels were high, and utterly feminine.</p><p>A “dress for success, knock ‘em dead” outfit just right for stepping into the offices of Delacourte Electronics and seducing one of the vice presidents in charge. And she had the perfect reason for going in. The letter that had arrived that morning in the mail. Yet another of Thomas’s hidden debts.</p><p>She drew in a hard, courage-gathering breath before moving from the bed and picking up the dress. She finished dressing quickly, knowing her bravery was waning. Thomas’s taunts drifted through her mind as she pulled the material over her head.</p><p>Her breasts were too large, he had said. She smoothed her hands over the full mounds. The size C cups of her bra held the flesh securely. Not that she sagged. At least not yet. They were firm and full, but Jesse had large hands. She closed her eyes in pleasure at the thought. And he liked looking at her breasts...hell, he did it often. And his looks were always heated and filled with lust.</p><p>She wasn’t very tall. Another of Thomas’s complaints. She never got wet enough, never acted sexual enough. God, she was so wet now she felt as though she was going to drown in her own desire.</p><p>He was wrong. She brushed her hair quickly, watching the silken strands as they curled around her shoulders in a fall of red gold. Not much makeup. She didn’t need a lot, and rarely wore it. She didn’t want to come off as seductive, but she wanted to seduce.</p><p>She was lotioned, waxed and scented from head to toe. Dressed and ready and shaking with nerves two hours later when she walked into Jesse’s outer office. Tally’s head raised, her brown eyes widening just a bit as a smirk crossed her lips. Terrie prayed she wasn’t blushing.</p><p>“Should I take my lunch break now?” the secretary drawled in amusement as she sat back in her chair and watched Terrie walk across the room.</p><p>Terrie swallowed tightly. “Quick, tell me again what Thomas was?”</p><p>Tally frowned. “A walking dick?” she asked as she watched Terrie closely. “Don’t tell me you’re going after big brother now? Come on, Terrie.” She rolled her eyes mockingly. “He’s a walking time bomb. When he gets hold of you he won’t let go.”</p><p>Terrie blew out a relieved breath. “Well, at least you didn’t call him a walking dick.”</p><p>Tally laughed, though the sound was quiet, and filled with amusement. “A walking hard-on, but that can at least be useful.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Is he alone?” She nodded to the closed door.</p><p>Tally looked at the door as she rose to her feet. “Alone and pouting, I think.” She grinned as she picked up the pretty purse sitting on her desktop. “And I’m ready for lunch now. Go on in. Tell him I’ll see him tomorrow.”</p><p>Terrie winced. “Long lunch, Tally. He’s going to fire you.”</p> <p>The other woman snorted. “I can only get so lucky. Keep him occupied and he’ll never miss me.” She winked suggestively as she breezed out of the room.</p><p>Terrie was left standing, more or less deserted, in the middle of the room. Damn Tally. The least she could have done was stick around to save her if things got too hot.</p><p>“Tally, where the hell is that cost estimate...” Jesse threw open his door and stared at Terrie in surprise. “Where the hell did she go this time?”</p><p>“Lunch?” Terrie wasn’t about to mention the fact that his secretary wouldn’t return until the next morning.</p><p>He bit off a curse then his eyes narrowed on her. He took in the black dress, the heels, and Terrie watched in fascination as sensuality filled his expression. He went from handsome, darkly dangerous, to sexual pirate within seconds. She fought to still the trembling in her legs as she lifted her hand, flashing the envelope she carried.</p> <p>He frowned. “Another one?”</p><p>Terrie shrugged. “It’s not as bad as the others, but I’ll need your lawyers to set up the payments...”</p><p>He snorted. “Come in here. I’m not going to discuss this standing up.”</p><p>He turned and disappeared back into his office. Terrie followed slowly.</p><p>When she entered the large room, she glanced at the seating arrangement in the corner. He was sitting on one end of the leather couch there, closing out whatever he had been working on in the laptop before pushing it back.</p><p>“Sit down.” He motioned beside him as he watched her walk to him.</p> <p>The dark intensity in his green eyes hadn’t changed. He looked ready to fuck, and Terrie was suddenly more nervous than she could ever remember being in her life.</p><p>She sat perched at the edge of the couch, handing him the envelope carefully.</p><p>“If you could just get the payment schedule set up...”</p><p>“I’m sure you have enough to cover it.” He took the envelope from her and pulled the legal paper from inside. “Thomas was stupid but I wasn’t. His shares in the company are safe, Terrie.”</p><p>Those shares had kept her solvent despite Thomas’s death and how quickly he had emptied out both their accounts during their marriage. Jesse had never traced the money, but at least she hadn’t suffered in the theft.</p><p>Silence filled the room for long moments as he read the letter.</p><p>“Stupid bastard,” he muttered as he threw the paper to the table. “He’s lucky he died. I would have killed him myself by now. Don’t worry about it. I’ll have the accountant take care of it tomorrow.”</p><p>“Should I watch my spending for a while?” she asked him carefully. “I don’t want to cause any added problems, Jesse.”</p> <p>His mouth tilted with a small grin. “I’ve invested your money wisely, Terrie. You’re fine. Stop worrying.”</p><p>She wondered if he ever got tired of taking care of her. From the moment news had come that Thomas had died in the car wreck, Jesse had been there. He had taken care of the burial, the horrendous news of the mounting debts. Everything. And he had been taking care of her ever since.</p><p>She smiled back nervously, wondering what the hell she was supposed to do now? How did you seduce a man like Jesse? He would give her anything, she knew, but at what cost to himself? How could she be certain she was what he wanted? That he could love her?</p><p>“Going somewhere?” He flicked a look at her dress-covered breasts. It was a heated, brooding look, a stroke of carnal interest.</p><p>She shrugged nervously. “I thought I’d go to the club today for lunch.”</p><p>“Stay away from Conover, Terrie,” he warned her softly as he turned to her, his eyes blazing with irritation. God, was it jealousy? “I’m telling you, you don’t want to push me on this.”</p><p>Her eyes widened in surprise a second before she frowned back at him. His gaze had narrowed, sensuality vying with a dominant glitter that made her stomach tighten with nerves.</p><p>“I didn’t mention his name, Jesse.”</p><p>“You and I both know he’s likely to be there,” he said. “You’re playing with fire. I let you run from me once, Terrie. I won’t let you do it again.”</p><p>She wanted to gape at him. Once again he was making very little sense. “Jesse, I had no intentions of seeing Conover today or ever. It’s not my fault you gave him the impression he could help you screw me. And for that matter, what gave you that impression?”</p><p>She was angry now. She could feel her veins throbbing with the pulse of blood, the heat that filled her face.</p><p>“You’re pushing me again, Terrie,” he growled. “It’s not wise to bait hungry men, baby. Keep it up and you may get more than you bargained for, and we both know you’re not ready for that.”</p><p>She was ready for him. She was ready to take her life back and find the happiness she had denied herself for so long.</p><p>“Ready for what?” she snapped back, her fists clenching now. “Ready to be touched? To be a woman for a change? Sorry, Jesse, you’re way off base there. I’m more than ready for that. Too bad you’re not.”</p><p>She moved to jump from the couch, to leave the office, to stomp home and scream and curse him as she had more times than she could count already. Unfortunately, Jesse didn’t seem ready to let her leave.</p><p>Before she could do more than gasp his arm hooked around her, turning her before he pressed her into the cushions of the couch. The dress rode up her thighs as she stared up at him in surprise and he wasn’t helping much as he pressed one hard thigh between hers.</p><p>“Oh, Terrie,” he said, his voice soft, filled with dark longing. “I’m more than ready for you to be a woman. But are you really ready to be my woman?”</p><p>He didn’t give her a chance to answer. His lips came down on hers in a kiss that sizzled Terrie from her head to her toes. Her hands clenched his shoulders as she fought to keep her senses from reeling, but there was no escaping the firestorm he ignited inside her.</p><p>His big hands framed her face, pushing into her hair, holding her still as his tongue invaded her mouth with decadent hunger. It swirled around her own, tempting her, teasing her as it stroked in and out, mimicking a much more earthy, sexual act.</p><p>She arched in his arms, helpless now, gorging herself on the pleasure his lips and tongue bestowed as he dominated the kiss. His head tilted, his lips slanting against hers as he groaned deeply into her mouth and one hand moved to cup the fullness of her breast.</p><p>Terrie stilled. Was she too large, as Thomas had sworn?</p><p>Before the thought was finished Jesse had lowered the zipper in the back of the dress, drawing it slowly down her shoulders as his lips moved to her neck, his breathing rough, heavy, as he began to blaze a path to her right breast.</p><p>“Jesse,” she whispered his name as she fought to breathe. The sensations rocking through her body were intense, mind destroying, and he hadn’t even truly done anything yet.</p><p>“Damn.” He paused at the cup of her bra, breathing hard and heavy as he so obviously fought for a control she didn’t want him to hold onto. “Terrie. Not like this,” he whispered, but his fingers stroked over her nipple, causing her to arch in exquisite need.</p><p>“Why?” Fear beat at her with razor-sharp talons. “What did I do wrong, Jesse?”</p><p>His head rose slowly. The look on his face had her thighs clenching, her vagina spilling more of its liquid heat in a primal demand. His cheeks were sensually flushed, his eyes a brilliant dark green and as hot as lust itself.</p><p>“You do too many things right.” He tried to laugh, but it sounded more like a strained groan, Terrie thought.</p><p>His gaze went to the flesh of her upper breast, his fingers stroking over it almost regretfully as he looked back up at her.</p><p>“You know what will happen,” he whispered. “I don’t want to hurt you, Terrie. I care too much for you to ever want to hurt you. But you know what I’ll want.”</p><p>“And only your wants matter?” she asked him.</p><p>He shook his head as he moved away from her quickly, as though if he didn’t do it then, he never would. She sat up more slowly, watching as he stared down at her, breathing hard, heavy.</p><p>“No, Terrie, that’s not all that matters,” he informed her impatiently. “If it were, then I’d be in your bed now instead of fighting an erection that never seems to go away.”</p><p>Her gaze flickered to his hips. She fought to breathe. Nope, there was no hiding that. It was thick and long, pressing demandingly against his slacks.</p><p>“Dammit, you should at least act scared,” he growled as he sat down carefully in the large chair across from the couch.</p><p>“I’m not frightened of you, Jesse.” She allowed a smile to tilt her lips as she straightened her dress then reached back to pull the zipper back into place.</p><p>She was very much aware of Jesse watching every move she made as she arched to grip the small tab and draw it up slowly.</p><p>“Could you handle it?” he asked, and she knew he wasn’t talking about the zipper.</p><p>She stood to her feet, smoothed her dress down, then looked at him coolly.</p><p>“Could you?” She arched a brow in question.</p><p>He smiled slowly. “Don’t dare me, Terrie.”</p><p>She lifted her shoulder in unconcern. “Don’t push me, Jesse. I want you, not a pack of hound dogs. Take that however you want to. And decide which one you want the most. You can let me know when you figure it out.”</p><p>So much for seduction, she thought sarcastically.</p><p>He stood slowly to his feet. “What the hell do you mean by that?” he growled.</p><p>“I mean, Jesse, when you decide you want me without all the dire warnings and predictions, then you can let me know. I care about you, as you well know. If I didn’t, then I’d be damned if I would put up with your arrogance, or your habit of showing up at my home before sunrise for coffee. The question is, can you do without your buddies long enough to take it?”</p><p>She didn’t give him time to answer. She swept out of the office quickly, fighting the shuddering need racing through her body, and the sudden tightening of Jesse’s muscles as though preparing to move for her. If he wanted her, then he knew where he could find her. Alone.</p><p>Chapter Three</p><p>He found her asleep on the couch. This was where Terrie slept most of her nights away, curled beneath a light blanket, staring up at the skylight above her. As far as Jesse knew, she hadn’t slept in a bed since she had moved from Thomas’s years before. Before his death. Before the truth of his abuse had come to light. And Jesse wouldn’t have known if he hadn’t spent that first week after his brother’s death with her.</p><p>Her nightmares had humiliated her, he remembered. They had shocked him to the very core of his being. He had known Thomas was different. Had known his brother possessed a cold, cruel side, but he had never suspected the habitual threats he had nearly destroyed Terrie with. So much so that she had been in the process of a divorce when he died. It amazed Jesse that she hadn’t killed Thomas herself.</p><p>He knelt by the couch, watching her sleep. The blanket covered only her breasts and hips, leaving her long legs bare. She was as naked as sin, lying on her back, breathing deeply as she dreamed. A large man’s shirt was pooled on the floor beside the couch as though she had dropped it, unheeded, before lying down. The fragile light of the first rays of morning touched her delicate, honey gold skin, giving it a soft, luminescent color.</p><p>She was more beautiful now than she had been dressed in silk and lace at Ella’s wedding. And more tempting. Did she, he wondered, know how much she tempted him? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He shook his head. He wasn’t a stupid man. He had watched Terrie at that wedding. Watched her expressions, the curiosity in her eyes. She was willing, but uncertain. Needy, but frightened. She was a woman searching for an end to the needs that tormented her, a woman almost willing to reach out.</p><p>Almost. His lips quirked into a smile. Terrie couldn’t be ordered. She couldn’t be persuaded. It had to be her choice. How could he convince her to choose?</p><p>Damn. As he stared at her he was amazed once again at what the very sight of her did to him. How it clenched his chest, engorged his cock, had emotions springing to life that he knew he would be much more comfortable without. He didn’t need to love this woman. He didn’t need to be tormented with her fiery will, her insatiable curiosity and her smart mouth. But there he was. Where he had been since before his brother’s death. In love with the one woman he knew he shouldn’t want.</p><p>He could very well be a fool. He could be making the biggest mistake of his life. He watched her sleep, entranced by her shifting expressions, wondering what dreams filled her head. Was it nightmare or sensual pleasure that had her sighing roughly as she shifted beneath the blanket?</p><p>His throat tightened at the thought that nightmares could be visiting her again. That the past could be haunting her with decisions and mistakes not her own. She was too willing to take fault onto her fragile shoulders. Too willing to accept blame when it lay with others.</p><p>He lifted his hand, his fingers pushing back a silken strand of red gold hair from her sleep flushed cheek. Her lips parted. Pouty pink curves that he could too well imagine moving beneath his, or enveloping the head of his cock. He grimaced, fighting a groan at the thought of that.</p><p>“Terrie?” he whispered her name gently. A soft intimate whisper that he wished he had the right to use. He was taking that right. He was tired of waiting.</p><p>The soft moue of her lips at the disturbance had him watching her in amusement. She must have been up late the night before. She shifted again, causing the light blanket to slip further along the full curves of her breasts. Her nipples were peaked, pressing hard against the cloth. On one, the outline of a small gold loop could be seen. The presence of the nipple ring never failed to make his cock jerk in a hungry response. He stared down at it, watching the peaks hardening slowly, becoming engorged as she shivered within whatever dream held her. Sensual pleasure.</p><p>“Terrie. Wake up.” He spoke louder this time, touching her cheek as her eyes flew open.</p><p>She blinked for a second, her gaze drowsy at first as she focused on him. Sensual heat lit her gaze as her lips parted in surprise, her eyes darkening with drowsy sexuality.</p><p>“Jesse?” she whispered, her voice husky and dark as she watched him.</p><p>She shifted lazily, unaware of the blanket slipping as she did so, the edge catching then falling away from the loop that pierced her nipple. God help him. His whole body tightened. Beaten gold lay against the dark rose areola, looping into the nipple, providing a decadent temptation to his hungry senses. He wondered if she would whimper when he gripped the little loop in his teeth and tugged at it sensually.</p><p>“Wake up.” He tucked the blanket over the swell of her breasts. Out of sight was not out of mind, though. “We need to talk.”</p><p>She blinked again. “Talk?”</p><p>Her awakening senses were lazy as hell, he knew. Terrie didn’t just jump out of the bed. She was like a kitten, drowsy, stretching, accustoming herself to reality before stepping into it.</p><p>“Come on, lazy bones. Coffee should be ready, and we can talk.” He patted her thigh. He wanted to pat something else instead.</p><p>She frowned slowly. “I thought I was angry with you?”</p><p>Yep, that was his Terrie. Bright-eyed and raring to go.</p><p>“You were?” He kept his tone deliberately casual. “Well, you might be madder before the morning’s out. Come on, darlin’, rise and shine.”</p><p>He rose to his feet as she thought about that for a minute. She rubbed her eyes then yawned softly behind her hand as she struggled to sit up. He gave her another minute then turned and headed quickly to the kitchen for the coffee.</p><p>“Hey,” her voice echoed through the house just seconds before she stomped into the kitchen.</p><p>He was waiting. He met her at the table, pressed her back into a chair then placed the mug before her. The scent of rich, addicting coffee steamed in temptation beneath the cute little twitch of her nose.</p> <p>She was still buttoning the overlarge man’s shirt that had lain by the couch as she slept. His shirt. His body clenched in reaction at the thought of her lounging around in the shirts he had forgotten here. This one he had used while helping her paint one of the rooms. The paint still stained it.</p><p>“You’re still in trouble,” she muttered as she wrapped her fingers around the mug. “Why the hell are you here anyway?”</p><p>Disgruntled, drowsy and clearly remembering exactly why she was angry with him, Jesse thought as he hid his smile. He didn’t care much for the welling tenderness that tightened his chest, though. Damn if she couldn’t disarm him as quickly as she could arouse him.</p><p>“Because you’re so cheerful in the morning.” He grinned as he carried his own cup to the table and sat down across from her. “My little ray of sunshine.”</p><p>She shot him a look that was anything but light and uplifting. He hid his smile behind his cup, watching her carefully.</p><p>“Cut the crap, Jesse.” She pushed her fingers through her hair, sending strands of silk flowing behind her shoulders. “Tell me what the hell you want so I can go back to sleep.”</p><p>Yep, that was his Terrie. So sweet and gracious she could melt the hardest heart. She had his. Years ago. But it wasn’t his heart that needed relief at the moment; it was his cock. Through the long, sleepless night he had come to several decisions where Terrie was concerned. First and foremost being he was tired of waiting. He wanted her with an intensity that bordered on obsession and, by God, he was about to do something about it.</p><p>Chapter Four</p><p>Silence descended between them as Terrie slowly fought her way past the drowsiness that often made it difficult for her to wake up. She was not a morning person. And if she wasn’t mistaken, it wasn’t much past daylight right now. She could have sworn she had stated her dislike of early mornings.</p><p>She finished the first cup of coffee and rose from the table to get another. As she did, she was aware of Jesse coming to his feet as well. He paced to the doorway, sighed, turned back and watched her. She fought to ignore what his look did to her.</p><p>“I want to fuck the hell out of you, Terrie.”</p><p>The smooth, cultured voice broke through the silence of the early morning light and her drowsiness.</p><p>Terrie placed the coffee pot back on the counter and fought to still her trembling hands, certain that she couldn’t have heard him correctly.</p><p>She blinked, staring at Jesse in shock. Despite the confrontation in his office the day before, despite her knowledge that he did want her, she hadn’t expected this. Not this soon.</p><p>“How very romantic,” she snorted, her temper sizzling at his attitude. “Let me just bend over for you now.”</p><p>Jesse merely watched her coolly, though, with those deep green eyes.</p><p>“If you wanted romance, you picked the wrong way to bait me for it,” he said as he leaned against the doorway, watching her carefully. “It would be a beneficial arrangement for both of us. And it would sure as hell take care of this frustration we’re both fighting tooth and nail. It’s stupid to fight something we both want.”</p><p>She shook her head, aware that her expression must be comical with disbelief. After their confrontation the day before, this was the last thing she had expected.</p><p>“Jesse, are you drunk?” she finally asked, narrowing her eyes at him. He had shown up a few times, more than a little relaxed after some party or another he had gone to, but he had never said anything so shocking before and certainly not so early in the morning.</p><p>“No, I’m not drunk.” He frowned fiercely, his bright green eyes too hot, too dangerously sexy for her peace of mind. “Come on, Terrie. You knew I’d show up after that little dare of yours.”</p><p>Terrie felt her face flushing. She had expected him, but not this early or this demanding.</p><p>She licked her suddenly dry lips nervously, all too aware of how she was dressed now. The large man’s shirt covered her okay, but she was completely naked beneath.</p><p>“Maybe we should talk about this later.” She took a deep breath, fighting for composure. “You know, when you’re sane again. And I’m awake.”</p><p>His frown grew heavier now.</p><p>“I’m perfectly sane, just as I’m perfectly aware of how naked you are under that damned shirt, and that fucking nipple ring is driving me crazy. Just as I’m aware of a lot of other things, Terrie. What the hell are you so afraid of anyway? You said you wanted it, now here I am.”</p><p>Her face flushed. She wondered what he would think of the small ring that pierced the hood of her clit as well. Or the tattoo that stretched across her back. She wasn’t nearly as unadventurous as he thought she was. He thought she was too timid, too frightened to accept the things he wanted from her. He had proven that before she met Thomas. And to be honest, she hadn’t been certain herself. Hell, she had been terrified at the time. But never once had he had given her the opportunity to try.</p><p>Nerves turned to anger at that thought. “I’m not afraid of anything,” she said furiously. “But who says I want to have sex with you now? It’s not like you’re the only man around, Jesse.”</p><p>Bad question. A sensual smile tipped his lips as his expression took on a brooding carnality that made her cunt clench in arousal. She really wished he wouldn’t watch her like that.</p><p>“Your nipples are hard,” he said softly, his gaze flickering to her breasts.</p><p>Her breath caught in her chest. They were hard and aching, just like they always were around him.</p><p>“That doesn’t mean anything,” she told him desperately. “The house is chilly.”</p><p>“Your pussy is wet.” His frank, graphic words had her eyes widening in shock.</p><p>“It is not,” she lied through her teeth. “Go home, Jesse. I’ve had enough of this conversation.”</p><p>But her pussy was wet. Wet and hot and pleading with her to spread her legs and beg him to fuck her. Fuck her hard and deep to relieve the blistering torment of arousal she suffered through. She had to get away from him before she did just that.</p><p>“I haven’t.” He blocked her as she attempted to leave the room.</p><p>His tall, leanly muscled body moved in front of her at the last minute, stopping her from reaching the doorway. Terrie stopped; trembling in what she hoped was anger.</p><p>“I decided something about this whole situation last night, baby. You’re right; you don’t need to be warned. You know the facts of my life, and evidently you’re willing to chance what’s coming. And I’ve decided something else,” he told her softly, maneuvering her until her back came against the wall and his body could press against hers heatedly.</p><p>His hands gripped her hips then, his thick, hot erection pressing against her stomach as he moved in closer.</p><p>“Like what?” she gasped, her system rioting with heat and arousal.</p><p>“Like, maybe you need to be fucked as badly as I need to fuck you,” he said softly.</p><p>“I’m abstaining,” she snapped. “And I’m changing your mind.” He pressed his hips against her, and her legs nearly turned to jelly. Oh Lord, his cock was so hard, so hot, even through his slacks.</p><p>“You know, Jesse, there’s something to be said for seduction. Romance. You remember the concepts. Right?” she reminded him breathlessly. Surely he did. She’d watched him practice it on plenty of other women.</p><p>“You want seduction, Terrie? Romance? Show me how it’s done, baby. Because right now, all I can think about are the years I’ve waited to touch you. And I’m damned tired of being patient and waiting.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As was she. But she’d be damned if she would willingly fall at his feet in accordance with his highhanded attitude.</p><p>“God. Do you have to be so arrogant? And I’ve been doing just fine without you so far, so just forget it.” Her hands pressed against his powerful chest, but he didn’t budge.</p><p>“Have you been?” he asked her silkily. “Let me tell you what I want to do to you first, then tell me no.”</p> <p>“I’ve already heard about your little games,” she told him, really angry now. “Do you think Thomas wasn’t more than willing to tell me about them?”</p><p>Oh yeah, her husband, bastard that he was, had delighted in telling her all about his older brother’s sexual exploits. He had taken something he thought Jesse wanted. Had lied to her, tricked her, and had damned near destroyed her life with it.</p><p>“I know Thomas told you,” he said, his voice gentling, softening in a way that made her ache for him. “Did he offer to let me fuck you, Terrie? Did he tell you how I wanted to tie you down, slap that perfect ass of yours, then fuck it until you screamed? Did he tell you how many times he offered to allow me the chance?”</p><p>Shock washed through her body. Months after marrying her, Thomas had refused to touch her, refused to take her in any way. He had accomplished what he wanted. He had taken the woman Jesse had desired, and he never let an opportunity slip by that he didn’t remind her of it. Shame coursed over her as she realized he had made Jesse aware of it as well. Had Thomas also told his brother her most betraying secret? The fact that he had overheard her telling Tally how easily she would have given into him? How much she wished she had been given the chance?</p><p>“Easy,” he whispered as she trembled against him.</p> <p>“What else?” she finally managed to gasp. “What else did he tell you?”</p><p>He frowned. “Was he supposed to tell me something, Terrie?”</p><p>She fought to breathe. God, this couldn’t be happening.</p><p>“Let me go.” She pushed against him harder then, too angry to be surprised when he backed up. Then she gasped in shock as he grabbed her arm and hauled her into the living room.</p><p>“Dammit, Jesse, stop manhandling me,” she ordered him, furious as he spun her around before releasing her.</p><p>“Take the shirt off,” he growled, his voice darkly dangerous.</p> <p>Terrie felt her juices begin to coat her cunt lips, her breasts swelling further as his gaze flickered to them once again.</p><p>“Jesse, this has gone too far.” She restrained the urge to do exactly what he ordered. Damn it, she shouldn’t be so turned on with this dominant side of him. Her vagina shouldn’t be flaming with arousal, her body desperate to have him touch her.</p><p>His hands went to his shirt. She watched, almost whimpering as he quickly pulled it from his trousers and began to unbutton it.</p><p>“Take it off, or I’ll rip it from you. Which suits me better. When I get you in bed I want you naked, wearing nothing but my touch.”</p><p>She shuddered, moisture sliding insidiously from her vagina, thick and hot, preparing her.</p><p>“What’s gotten into you?” she whispered breathlessly as he tore the shirt from his shoulders and dropped it carelessly to the floor.</p><p>His eyes were blazing with heat now as he watched her.</p><p>“Take the shirt off, Terrie,” he rasped out heatedly. “Make me tell you again, and I promise, you won’t like the consequences.”</p> <p>“Rape?” she questioned him, though she knew if he touched her, she would fall beneath him willingly.</p><p>He smiled. A slow sexy turn of his lips that had her breathing escalating.</p><p>“Would it be rape, baby?” he asked her with a slow, knowing drawl. “I don’t think it would be. I think your pussy is ready to drip down your leg you’re so turned on. I think you need it hard, fast and rough. And I’m more than ready to give it to you.”</p><p>Terrie felt the blood rush through her system. Lust, hot and addictive, was like a spicy scent in the air, steaming between them. Carnal intent filled Jesse’s expression and tightened every line and muscle in his body. Her quick glance to his crotch showed a bulge that made her mouth go dry. Hard, fast and rough. The words had her pussy clenching, drenching her with heated need. He had no idea just how much she did want it, need it, crave it. From him.</p><p>His hands reached out, and before she could stop him, he gripped the shirt, wrenching the material until buttons were flying in all directions and she was left bare before his gaze. Gasping, Terrie jerked back from him. Her eyes widened, her body flared with a heat so deep it terrified her.</p><p>“Good God.” His voice was strangled at he stared at her thighs, the bare folds of her pussy and the gold ring piercing the clit hood. “Son of a bitch, Terrie. Could anything be sexier than that ring? I can’t wait to see what it does for you when I get it in my mouth.”</p><p>Her clit pulsed, her womb clenching with such force it made her breathless, terrifying her with the strength of her arousal. Before she could change her mind she ran. Dodging around him, she sprinted through the room and up the stairs, aware that he had taken off after her.</p><p>The breath was sawing desperately through her chest as she scrambled up the steps to the dubious safety of her room. She could lock herself in, run a tub of cold water and immerse herself in it. Surely that would cool the naked lust spearing through her body.</p><p>He caught her at the door. One arm manacled her waist as the other slammed the door closed behind them. Jesse held her effortlessly, ignoring her struggles as he tore the shirt from her body, then allowed her to wrench out of his arms.</p><p>“Bastard!” She turned on him, wishing she were as furious as she was trying to be.</p><p>His lips quirked with a smile.</p><p>“I’m hearing everything out of your lips but ‘no’, Terrie,” he growled, his hands going to the clasp of his trousers. “Let me hear you say no. Come on, baby, I dare you.”</p><p>As she stared at him in shock, the rest of his clothes were disposed of. He stood before her gloriously naked, his cock standing out from his body in a hard, thick exclamation of arousal. Terrie’s breath caught. He was hard-packed muscle and thick eager lust.</p><p>“This is insanity,” she gasped, her breasts heaving as his gaze watched the hard-tipped mounds with sexual intensity.</p><p>She could feel the weight of the ring in her nipple and her clit, rasping against the sensitivity of each area.</p><p>“No, waiting this long was insanity,” he growled. “Waiting on you to forget Thomas’s stupidity and to see how desperately I’ve craved you was insanity. I’m about to get real damned smart and do something about it now.”</p><p>“And if I don’t want it?” she questioned desperately. Like that was going to happen in this lifetime.</p><p>“Oh, you want it,” he told her, stalking closer to her as she backed away from him uneasily. “That pretty, bare cunt of yours is glistening with how bad you want it. And I’m more than happy to give it to you.”</p><p>She knew he was right, but damn him, he didn’t have to be so sure of himself.</p><p>“You should wait until it’s offered,” she said, trying to sneer.</p><p>He laughed. A low, deep vibration of humor that speared through her cunt. Oh hell, she thought, she was a goner. She backed away further as he came too close, only to bump against the bed with a gasp. He stopped, inches from her, staring down at her with naked, carnal intent as he reached around her. Her eyes widened as he glanced down at the silk stockings he held in his hand. Stockings she had left there the day before after removing them.</p><p>Terrie swallowed tightly. She was afraid to know what was going through his mind at that moment.</p><p>“Get on the bed,” he ordered her roughly.</p><p>Her eyes narrowed on him. The blood was rushing through her system from the chase, the arousal, the forbidden potency of his dominance.</p><p>“Make me,” she snarled. She wasn’t in the mood to submit to anything.</p><p>Uh oh. Satisfaction lit his eyes in a blaze of lust so intense it nearly seared her.</p><p>“I can,” he assured her, his voice dark, sexy. “But you can never go back, Terrie. Once you get a taste of the forbidden, you’ll only need more.”</p><p>And he was forbidden. She stared up at him, sensual terror washing over her in waves. Could she handle him? She had always known she couldn’t, so what the hell was she doing here now?</p><p>As she watched him, he turned from her abruptly, striding quickly to her dresser. Terrie’s eyes widened as he started pulling out drawers, one after the other, until he found what he wanted. The breath left her body when he turned back to her, another pair of her silk stockings gripped in his hand.</p><p>She swallowed tightly.</p><p>“Get on the bed,” he ordered her again.</p><p>“Like I said; make me.” She braced her body for the struggle to come.</p><p>Her cunt was aflame, burning her with need. Sexual intent filled his expression—dark, glittering with purpose as he stared at her, gauging her mood. Then, he smiled again.</p><p>Terrie darted away from the bed. She would be damned if she would make it easy for him. But just as she feared, there was little fight involved. His arms came around her, his heavier, muscular body controlling her easily as she struggled against him. She kicked out at him, gasping as her hands went to the hard arms encircling her waist as he wrestled her to the bed.</p><p>She cursed; Jesse only chuckled. He threw her to the bed, dodging her fists and her half-hearted kicks as he secured first one wrist then the other to the metal bars of her headboard with soft, silken ties. When he had that accomplished, he moved to her feet.</p><p>Terrie kicked at his hands, her body bouncing on the bed as she fought to keep him from securing her feet with the soft stockings before he tied the end to the bed.</p><p>When he finished, they were both breathing fast, rough, filling the room with the overwhelming scent of primitive, sexual needs. He stood back from her then, one hand going to his cock, massaging it as he watched her.</p><p>“I’ve dreamed of this,” he growled. “Seeing you spread out before me, unable to fight me, unable to deny me.”</p><p>“Pervert,” she snarled.</p><p>He chuckled. “Nympho. You love it, Terrie. Your pussy is so hot and wet I swear I think I see steam rising from it.”</p><p>Chapter Five</p><p>Terrie wouldn’t doubt it. The heavy, intense ache pulsed in her clit, clenched her womb. She was so horny she felt as though she was going to disintegrate with the need.</p><p>He moved to the bed then, lying down beside her, propping his head up with one hand as he watched her. The other smoothed across her abdomen as the muscles there clenched in excitement.</p><p>“I’ve dreamed of this,” he told her, his voice soft, throbbing with lust. “Even before that stupid brother of mine fucked up, I dreamed of having you like this. Tied down, your eyes big with excitement and apprehension, the sweet scent of your arousal tempting my senses.”</p><p>“This won’t work, Jesse.” Anticipation warred with hesitancy. She had known Jesse was more man than she could handle, that his needs and his tastes could not be satisfied by her.</p><p>He liked strong, confident women. Women who could fight him, stand up to him sexually. A partner as tempestuous as he was in bed. Terrie wanted his dominance. She wanted to be made to submit to needs that even she couldn’t fantasize of in full detail.</p><p>“I think it’s working out just fine,” he grinned down at her, his hand cupping her breast, his finger tweaking the hard nipple then making her moan helplessly as he tugged at the ring piercing it.</p><p>Her breath caught in her throat as the caress speared to her cunt. Intense, fiery, that little pinch of pain nearly had her body exploding in ecstasy.</p><p>“Untie me. We’ll call it quits here and just forget this ever happened,” she gasped as his head lowered to her breast.</p><p>He halted, his eyes rising to her.</p><p>“Baby, don’t take me for a fool,” he grinned. “I have you right where I want you. I have no intentions of letting you go now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Terrie struggled against her bonds, frightened by the arousal that rose inside her as she realized she was well and truly helpless before him. As she watched in dazed fascination, his head lowered further, his tongue reaching out to lick a hard, distended nipple carefully.</p><p>“You taste good,” he whispered, his lips moving against the hard point, driving her crazy with the need to have him take it into his hot mouth and suckle her strong, deep. “You need clamps for these pretty nipples. Nice and snug. Something that will drive you over the edge with the fire they start.”</p><p>Her eyes widened. Clamps? Then a sharp, surprised moan issued from her throat as his grip tightened on her nipple, his fingers tugging at the small gold ring there and his teeth worried the other. Just enough pressure to burn with an erotic flame that danced down her spine.</p><p>“Like that, baby?” he whispered as his head rose. “A clamp would keep the pressure, make you so crazy that your sweet pussy would gush with your juices. And I’d be there between your thighs, lapping up every delicious drop.”</p><p>Her hips jerked, a convulsive shudder sweeping through her body at the image he induced. Watching her closely, his gaze went to the flaming curves of her cunt. Terrie watched as his eyes darkened, heated when his fingers met the thick juice that pooled between her spread thighs and coated her bare pussy. They slid through her narrow slit, circled the entrance to her vagina, then continued down to the tightly closed anal opening.</p><p>“No.” Her shocked whisper had him halting, the tip of his finger stretching her tight entrance erotically.</p><p>“No?” he asked her, going no further, tempting her with the forbidden, sensual bite of pain his finger had produced. “I want to fuck you there, Terrie. Not now, not today, but soon. I want to teach you how to prepare yourself for me, how to prepare your body for my cock tunneling into that tight little hole.”</p><p>She jerked against him, whimpering as the movement of her body forced his finger marginally deeper into her ass.</p><p>“Please, Jesse,” she whispered, consumed by an arousal, a lust she couldn’t hope to control. “I can’t stand it.”</p><p>“What can’t you stand, baby?” he asked her with immeasurable tenderness as his finger retreated. “The thought of it, or the building need the thought of it produces?”</p><p>She whimpered, shaking her head, unable to answer the question. She didn’t know.</p><p>“Did Thomas tell you everything about me, Terrie? During the time you were married, did he tell you the rumors of what I like, what I want?”</p><p>A woman confident enough to be as dominant as he was sexually. Oh yeah, Thomas had told her often how she could never measure up to what Jesse would need. She almost suspected that he knew how she had lusted for Jesse. The year she had been married to him had been hell.</p><p>As her gaze flickered away from his in indecision, his fingers tightened on her nipple, causing her to gasp, her body to jerk with the hot flare of sexual intensity it induced. Her gaze flew back to him.</p><p>“Good.” He rewarded her with a slow, heated lick to her nipple. “That’s what I want in this bed, Terrie. Obedience. No matter what I ask, no matter what I need.”</p><p>She blinked up him, surprised by his declaration.</p><p>“You didn’t know?” He smiled that sexy, dangerous smile she loved so well. “Oh yeah, baby. I want you submitting to me in every way, in every position imaginable. I want you screaming because you need me so damned bad. I want you needing this, as much as I need to give it.” Before she knew his intent, his open hand delivered a heated slap to her bare, damp cunt.</p><p>Terrie was shocked, frightened by a sharp, lust-born moan of pleasure that escaped her throat as the stinging blow vibrated through her body.</p><p>“Jesse...” She couldn’t say no, though she sure as hell didn’t know if she could bear it.</p><p>“Like that, baby?” he asked sensually as his hand raised again.</p><p>Terrie watched now, her eyes wide, dazed as the hand fell.</p><p>“Oh God...” She jerked when the heat came, delivered directly over her pulsing clit, throwing it into shocked, dangerous need.</p> <p>Her breath caught at the warning flare of release from the blow. Why was he doing this? Was he taunting her? Mocking her shameful needs in some way?</p><p>“God, look at you,” he growled, lust thickening his voice as he stared down at her in suspended pleasure. “You’re flushed and aroused, your expression so confused, so filled with need. You like it don’t you, baby? I knew you would.”</p><p>Another blow landed, burning her, causing her hips to jerk in response, and her juices to slide furiously from her vagina as her clit swelled in response to the sharp pleasure/pain. She was going to orgasm. Oh God, if he smacked her like that just one more time...</p><p>She exploded when the blow fell again. Her cunt flamed from the sensual pain, her vagina pulsing as her clit exploded in a firestorm of destructive heat. It raced up her spine, through her womb, shuddering through her body, flaming through her veins as she cried out in shameful pleasure.</p><p>“Yes,” his voice growled from a distance. “Oh hell, Terrie, I can’t wait.”</p><p>He moved over her body then as his lips lowered to hers. She took his kiss and fought for more. Her lips opened for his tongue, hers twining with it, stroking, tasting the heat of his mouth as he moved between her thighs. His hands weren’t still either. They cupped her breasts, tweaked her nipples with heated pressure and had her hanging on an edge of such desperate pleasure she wondered if she would survive it.</p><p>She was bucking against his body, twisting closer, needing more of his heat, his carnal promise. Lust was like a demon that possessed her now, filled her with erotic images, destroying her body with the sensual pleasure washing over it.</p><p>Finally, he tore his lips from hers, staring down at her, his eyes almost black with emotion and lust as she felt the broad head of his erection touch her slick, cream-coated cunt.</p><p>Terrie stilled, her arms straining at her bonds as she watched him in anticipation.</p><p>“Slow and easy first,” he growled.</p><p>He pressed against the soft folds of her pussy, the broad head of his cock parting them, sliding against them as he paused at her vaginal entrance. He was hot and thick, tempting her, teasing her with the invasion to come. His hand reached down, moving his shaft against the sensitive flesh, running it through the thick cream that coated her.</p><p>“Jesse.” She couldn’t halt the plea that escaped her lips.</p><p>He didn’t answer her, but she felt her breath whoosh from her throat as his cock nudged into the entrance. She could feel him parting her, stretching her already. It had been so long since she had known the touch of a man. She hadn’t had sex with Thomas since just a few months after their marriage. She knew she would be tight, and his cock was broad, and more than willing to stretch the sensitive tissue there.</p><p>He pressed in tighter, retreated, then worked the head of his shaft into her again. He repeated the sensual movements, parting her greedy flesh, stretching her as she groaned and arched into the invasion.</p><p>“So hot and tight,” he whispered. “I want to enjoy each minute it takes to work my cock into you to the hilt, Terrie.” His words had her cunt clenching on the bulging head of his erection. “Oh yeah, baby, clench that sweet cunt on me. Fight it. Make it better, Terrie. So much better.”</p><p>His expression was a tight grimace of pleasure as he worked against the further tightening. She did as he bid, tightening on him, milking his cock as he worked another inch inside her. It was the most erotic act she had ever endured. Fighting the invasion of his hot lance as he forced his way in further.</p><p>Her hips jerked, bucked, her pussy rained its moisture over him, heating them, creating a gliding friction that was making her insane. His hands tightened on her hips, his muscles tightening as she watched through eyes half closed. His control was slipping. She could feel it. She tightened her muscles on him again, straining to force him out when everything inside her wanted him deeper.</p><p>The sensual lash of heated pressure inside her vagina was killing her. A sharp burning bite as he pressed in deeper, not even half his cock had worked its way inside her. Her thighs strained as she fought the entrance, her cries whispering past her throat now as the pleasure rocked her body.</p><p>His hands clenched on her hips, perspiration glistening on his flesh as he gritted his teeth. She rolled her hips against the hard, straining penis that rocked inside her.</p><p>Her scream shattered the thick, sensually charged atmosphere as his control snapped. He thrust hard and heavy inside her, burying his cock to the hilt as her muscles quivered around him, tightened and fought to accept the broad length suddenly filling it.</p><p>Terrie felt the warning tremors of her climax pulsing in her vagina. The hot, hard burn, the pinch of pain. The flaring intensity of the pleasure was too much for her body to fight against. The hard, milking contractions on his cock were too much for Jesse to fight.</p><p>His elbows were braced at her shoulders as his hips began to move. His shaft retreated, only to return in a heavy, invading thrust that had her arching to him, twisting against him. Her body was no longer her own, but was controlled only by the hard, driving thrusts that rocked her, filled her world with a pleasure she knew would destroy her.</p><p>Deep, penetrating, stretching her to her limits, his cock thrust in and out, driving her to a pinnacle of such unbelievable pleasure she was screaming out for her release. Fire assailed her quaking pussy, tightened it, milked his cock until she exploded with such intensity that she couldn’t breathe, couldn’t fight the mind-boggling sensations as her orgasm raced through her body.</p><p>She was distantly aware of Jesse lunging powerfully inside her again and again, then his cry joined hers. She felt another rippling climax tear through her as she felt the hot, hard blasts of his semen spurting inside her gripping flesh.</p><p>His lips were at her neck, caressing her flesh, hard male growls of pleasure echoing in her ears as he shuddered over her. Pulsing mini-explosions rippled over her body, through her cunt, as she trembled through the last of her powerful climax.</p><p>She was gasping for breath now, her flesh sensitized, covered with an invisible film of ultra-sensitive nerve endings that caused her body to shudder with each ragged breath that pressed her tighter against him. Weak, spent, she collapsed long moments later, dazed and uncertain as she never had been in her life.</p><p>Chapter Six</p><p>What had he done? Jesse lifted himself from Terrie’s spent, damp body and moved gingerly to her side as he stared down at her. Her eyes were closed, her breathing still hard, heavy. The little gold ring at her nipple trembled as she shuddered again.</p><p>Jesse sighed in self-disgust as he moved to release her from the silken bonds he had tied her with. He had lost his mind and his control, something he had never done before. The minute he had seen her eyes flash with heat, her nipples poking against his shirt, all common sense had fled. He had taken her with few preliminaries. So intent on sinking his cock inside her that nothing else had mattered.</p><p>He had broken one of his own strongest rules. Complete agreement. Complete surrender and submission from her. Complete control from him. He had taken her hard, hot, without control, reveling in her heated struggles and the hot lust in her eyes.</p><p>She didn’t move as he released her, but her eyes opened the barest bit as she watched him untie her feet. He kept a careful eye on those feet. They could be lethal when she was pissed. And she had every reason to be pissed.</p><p>“So what now?” He stared down at her, wondering if, despite the pleasure, he had just made the biggest mistake of his life.</p><p>She arched her brow. The slow, deliberately mocking move had him carefully hiding a wince. He moved back from the end of the bed carefully as her legs shifted lazily.</p><p>“You have got to be the least romantic man I have ever laid my eyes on,” she sighed. “Don’t you have to go to work or something? I want to sleep.”</p><p>He cleared his throat. “I took the morning off.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why?” She frowned at him. Jesse had a feeling she was well aware of the fact that he was trying to figure out just how pissed she was. She was deliberately keeping her expression only mildly curious, giving him no hint to her feelings.</p><p>His gaze flickered over her nude body. The delicate rings piercing her flesh entranced him. Only then did he notice the one piercing the skin of her belly button as well.</p><p>“When in the hell did you get those piercings done?” He fought the need to cover her body and take her again, then and there.</p> <p>His cock was so hard it pulsed in agony.</p><p>“About a month after I got the tattoo.” She shrugged carelessly.</p><p>His eyes went over her body again. He didn’t see a tattoo.</p><p>“What tattoo?” He was instantly wary of the wicked glint in her eyes.</p><p>She turned over, slowly. His eyes widened. It stretched across her back. A delicate intricate vine and two graceful, open flowers just above the full globes of her buttocks.</p> <p>“Do you like?” She turned her head, flexing the muscles of her ass temptingly.</p><p>Jesse felt perspiration dot his forehead. His cock was screaming for action, his hands itching to clench those tight little globes, to separate them. He shook his head, fighting for control.</p><p>“Why?” he finally asked as he fought to breathe.</p><p>She turned back over, watching him carefully.</p><p>“Tally dared me.”</p><p>He shook his head, his gaze now centered on the glistening ring at her clit. He moved closer to the bed, his mouth watering, the need to taste her nearly overwhelming.</p> <p>“Tally?” he asked, wondering what the hell his secretary could have to do with this.</p><p>“Yes. Tally. Tally Raines.” The name slid through his mind with dawning horror. “We’ve been friends forever.”</p><p>He nearly lost his erection. “She’s evil,” he burst out, shaking his head as he thought of the wily, sarcastic-tongued little shrew that ruled the offices at Delacourte Electronics.</p><p>“Evil?” She tilted her head, smirking at him. “You’re just mad because she doesn’t kiss your ass and makes you do your own filing.”</p><p>He was not going to spend the rest of the morning arguing over the sharp-tongued dragon he had made the mistake of hiring last year. As soon as possible, she would be transferring to another office anyway. He’d be damned if he would have someone in his office who could out-yell him. And damned if she couldn’t do it.</p><p>“Stay away from Tally,” he growled. “She’s dangerous.”</p><p>He picked up his clothes, dressing quickly. If he didn’t get out of the bedroom he was going to lose control again. He had to figure out what the hell had happened to his control before he even considered touching her again.</p><p>She lay there on the bed. Calm. Cool. Her hazel eyes quizzical as she watched him pull his clothes on. She didn’t say anything, and he’d be damned if he knew what to say at this point.</p> <p>“I’ll call you this evening,” he said as he tucked his shirt into his pants, glancing at her, his temper building as she watched him so calmly. She should be furious. Screaming, cursing and threatening him until hell wouldn’t have him.</p><p>“Don’t bother.” She finally shrugged. “I wasn’t looking for anything, Jesse. You started this, if you’ll remember. Not me.”</p><p>“Like hell I did,” he snapped as he strode back to the bed and pulled her from it as she gasped in surprise.</p><p>He had her in his arms, her gaze widening, her perfect lips parting on a gasp.</p><p>“Jesse,” she cried out, arousal and surprise vying in her voice.</p><p>“You started this the other night, Terrie,” he reminded her brutally as he fought the lust pounding through his veins. “I told you not to push me. Not to provoke something you couldn’t handle. Now I would suggest, for the time being, you stop pushing or we may both come to regret it.”</p><p>Before she could let loose with the fury of words he could see building in her expression, his lips slammed down on hers, parting them. Her tongue meeting his halfway as he pushed it past the seam of her lips. He groaned, arching her closer into his body as he ate at her, licking at her, savoring the taste of her.</p><p>They were both breathing hard when he pulled back. He knew he was damned near as dazed as she looked and once again his body shuddered as he fought for control.</p><p>“Tonight.” He was breathing hard as he set her carefully away from him. “I’ll call you tonight.”</p><p>He left the room before he lost all sanity. He was within seconds of throwing her back to the bed and fucking her again with a driving hunger he felt would never be sated. A hunger he had never known for another woman.</p><p>Chapter Seven</p><p>“Tally, hold all calls. I’m unavailable until after lunch.” Jesse entered the outer office, his eyes narrowing on the sardonic expression his secretary held.</p><p>Tally Raines was an unholy terror as far as he was concerned. The curvy, haughtily aloof Filipino watched him with what he was terribly certain was a knowing expression.</p><p>“I’ll be sure to do that,” she drawled, her cultured voice filled with amused patience. “Would you like coffee, sir?”</p><p>He paused at his office door and glanced back at her, his eyes narrowing as she watched him with superior female indulgence.</p><p>“Coffee, please,” he said coolly. “Then get me the Conover contract so I can go over it before sending it to James.”</p><p>“It’s on your desk.” She rose gracefully from her chair, long black hair rippling down the back of her white silk blouse to touch her shapely hips. “Anything else?”</p><p>Yeah, no more body piercings for Terrie, he thought with a flash of temper that he tamped down. Dammit, the woman was a menace.</p><p>“Nothing else,” he finally growled. “Bring the coffee as soon as possible.”</p><p>“Of course.” She sounded mildly surprised that he would think she would delay.</p><p>Jesse figured he might get the coffee before he left the office that evening. He grunted rudely, jerking the door open, and entered his own office. Now he knew why she drove him crazy. Terrie had to be giving her lessons.</p><p>He grimaced as he took his seat behind his desk and flipped open the file waiting on him. Lucian Conover was an old friend; part of the exclusive group that had begun back in college. Not that any of them had been moronic enough to name the group. He did know he had broken one of the cardinal rules, though. Control. Complete control. Only her pleasure mattered. Only her complete, mindless surrender to the pleasure was the goal. Not his.</p><p>He pushed his fingers wearily through his hair, frowning down at the papers before him as he fought to make sense of what had happened. Fought to try to at least understand how he had managed to land himself in this predicament. Never in his entire adult life, certainly not since admitting to himself the extreme pleasure he gained from his sexual lifestyle, had he lost control like this.</p><p>“Oh dear. Did you find a problem with the contracts?” Tally’s smooth voice cut through his musings as she set the steaming cup of coffee at the side of the desk.</p><p>“Contracts are fine.” He lifted the edge of the paper he was staring down at. “Thank you for the coffee, Tally. I’ll call you if I need you.”</p><p>“You have messages.” Her voice was insistent.</p><p>Jesse lifted his head, turning it until he could gaze up at her with level patience. Dealing with Tally demanded patience.</p><p>Her dark brown eyes danced with amusement, her lips tilting into a smirk that had him narrowing his eyes in suspicion.</p><p>“What?” he asked her carefully.</p><p>“Messages.” She laid the papers beside the cup of coffee, still watching him, the smirk firmly in place.</p><p>“Thank you,” he growled. “You can go now, Tally.”</p><p>She sighed with exaggerated patience. “Very well. But might I suggest a shower, Mr. Wyman? The smell of sex is lingering. And since some of us are doing without at the present, we don’t like being reminded.”</p><p>She sauntered from the room. Jesse watched her leave, restraining the urge to bare his teeth in temperamental frustration. Dammit. He leaned back in the chair heavily, closing his eyes, fighting his need to stalk from the office and return to the object of his frustration. He knew years ago Terrie would drive him insane. She was now proving his fears as fact. And his cock was proving to be a very willing sacrifice to breakdown. Even now it throbbed in demand, in explicit, mounting excitement at the thought of touching her again.</p><p>Control. His jaw clenched as he fought for it. Control. His fist tightened as he returned to the file. Son of a bitch. He sighed wearily as the words blurred and once again he fought to understand his own weakness.</p><p>“Oh Terrie, you are such a bad girl.” Tally stepped into the house as Terrie stood back and welcomed her in.</p><p>Her brown eyes, usually cool and mocking, were filled with warmth and humor as Terrie shook her head wearily.</p><p>“I know he didn’t tell you. By the way, he thinks you’re evil,” Terrie informed her as she closed the door and led the way into the living room. “So how did you figure it out?”</p><p>“Hmm,” Tally mused. “It could have been the lingering smell of sex, and Giorgio’s Red was unmistakable. He should have showered before coming in,” she pouted. “I haven’t had sex in months, Terrie. I don’t like being reminded.”</p><p>Terrie flushed, though she couldn’t help the laughter that welled from her lips.</p><p>“I’ll be sure to let him know,” she promised her friend lightly.</p><p>Tally shrugged. “No problem, dear, I already have.” She sat down in the high-backed chair across from the couch and lifted a dark brow curiously. “Now come, give Tally all the dirty details. Was he positively sinful?”</p><p>Terrie collapsed back on the couch.</p><p>“He was sinful,” she sighed. “And very upset for some reason.”</p><p>She couldn’t get his reaction out of her mind. It was unlike Jesse to appear less than confident. Yet, for some reason, that impression had nagged at her brain. As though something about the act had bothered him more than he let on.</p><p>“Hmm. Yes, he was quite out of sorts when he came into the office,” Tally laughed in sheer delight. “You should have seen him trying to pretend to read that contract he had in front of him. But his expression was just dazed. I loved it.”</p><p>Terrie shook her head at her friend, but couldn’t hold her own laughter back. There was no one as dryly mocking as Tally could be. Her amusement and general outlook on life never failed to keep Terrie laughing.</p><p>“I don’t know what to do now, Tally,” she finally sighed as she leaned back on the couch. “Do you think I didn’t please him?” It was her biggest fear.</p><p>“Darling, you blew his ever loving mind,” Tally chuckled. “His nerves are fried, his preconceived notions have flown out the window, and the man is scrambling to figure out what the hell happened. I would say you were the best he’s ever had.”</p><p>Terrie bit her lip. Yeah, he seemed pretty damned confused when he rushed from the bedroom.</p><p>“You know what he’ll do next,” Tally warned her. “If he brings Lucian with him, at least videotape it so I can watch.”</p><p>Terrie’s eyes widened. “Videotape?” she gasped. “No way.”</p><p>“Oh, come on.” Tally waved her hand negligently. “At least I’m not asking to participate.”</p><p>Terrie stilled, then blinked. The object was to throw Jesse into overload. To show him she could meet him more than halfway. What if she... It would never work. Would it?</p><p>“What are you up to?” Tally asked her, laughter heavy in her voice. “Oh, I just love it when you plot. You’re almost as good as I am.”</p><p>She watched her friend closely. Was Tally really as adventurous as she swore she was?</p><p>“Participation,” Terrie whispered. “Turning the tables on Jesse.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tally’s eyes widened in surprise. “Oh Terrie,” she exclaimed gleefully. “You’re learning. You’re learning. Tell me what you’re planning.”</p><p>“Jesse likes to share his women.” Terrie fought the racing of her heart. “What if I sort of share Jesse? What would he do?”</p><p>Tally was obviously shocked. “Share him?” she said slowly. “How?”</p><p>“You know.” She lifted her brows suggestively, leaning forward. “I’ll tie him down, somehow. Like he did me. Then you can...”</p><p>“Me?” Tally questioned with mocking surprise. “Hold up here. We never said me, Terrie. Jesse is not my type.”</p><p>“Neither is Lucian, but I notice you can’t help but pant around him. Come on, Tally. Who else could I trust?” she pleaded. “I don’t want you to fuck him. Just help me torture him. That’s all. I swear.”</p><p>“Just torture him?” She lifted her eyebrows consideringly. “Nothing else. Right?”</p><p>“No way. Nothing else.” Terrie could never tolerate anything else.</p><p>Tally smirked. Her fingernails tapped out a fierce little rhythm on the arms of the chair as she watched Terrie closely. “When?”</p><p>Terrie swallowed nervously. “I don’t know. Soon.”</p><p>Terrie watched the cool, almost feline look that crossed her friend’s face. “This weekend. I need time to prepare,” Tally sighed. “These things must be planned, Terrie. Until then, you can drive him insane some more. Keep doing things that throw him off balance. Give him a blowjob under his desk. That drives those executive types crazy. Don’t let him get the best of you. The minute he does, he’ll regain control and it will all be over with. Stay in control, Terrie.”</p><p>“In control.” Terrie nodded. God, what the hell was she doing?</p><p>Tally rose to her feet. “I’ll help, of course.” She smiled with slow pleasure and for just a moment, Terrie wondered at the look of gleeful anticipation in her friend’s face.</p><p>“Tally, you scare me,” she sighed, not for the first time. “What are you planning?”</p><p>She shrugged her slender shoulders negligently. “Don’t worry, sunshine, Auntie Tally will take care of everything.” Then she narrowed her eyes. “Do you need another piercing?”</p><p>Chapter Eight</p><p>Keep him off guard. Keep him off guard. Terrie repeated the words as she breezed through Jesse’s outer office the next day. She ignored Tally’s, “Go get ‘em tiger,” and entered the office as though it were her own.</p><p>Jesse raised his head from a file and his instant response nearly had her pausing. His eyes darkened as he took in the vee cut, button-down, white silk slip dress and strappy sandals she wore.</p><p>“Terrie?” He watched her cautiously as she moved around the desk and stared down at him with a frown.</p><p>“You didn’t show up for coffee this morning,” she reminded him. “And I was up waiting on you. Do you have any idea how hard it is for me to get up at the crack of dawn, Jesse?”</p><p>His lips twitched in amusement. “I did call, baby,” he told her. “You didn’t answer so I left a message.”</p><p>“Your excuse was flimsy.” She propped her hands on her hips, deliberately allowing her breasts to swell above the top of the dress. “Come on, Jesse. You never get up late.”</p> <p>He leaned back in his chair, his eyes riveted on the swelling mounds. “I didn’t get to sleep until late.” He cleared his throat then swallowed tightly. “I was going to stop by this evening. I know I left the message.”</p><p>Terrie snorted. She got the message. “Be ready, baby. We have plans,” she repeated for him. “I don’t think so, Jesse. You just knew that one would work for me,” she assured him sarcastically, barely retraining the urge to roll her eyes.</p><p>She moved to prop her hip on his desk as Jesse moved to touch her. Her nerves and his movements, combined, had her jostling the nearby penholder and knocking it over. Pens scattered across the desktop.</p><p>“Oops.” Some of the pens rolled off the desk and she bent to try to retrieve them. “I’ll get them,” she promised softly, suggestively as two bounced from his knee to the carpet beneath the desk.</p><p>Jesse jerked in response as her hand braced on his knee and she bent to retrieve the pens. Damn her, no bra. He drew in a deep breath as her head disappeared under the desk.</p><p>“Dammit, Jesse.” The office door opened at the same time she worked herself beneath the desk. Lucian Conover walked quickly into the room, the door slamming behind him. “That viperous little shrew working the desk outside swore you weren’t even here. I knew that was your car outside.”</p><p>Jesse stilled. Terrie moved beneath the desk. A sinuous ripple of her body against his leg nearly had him trembling in anticipation.</p><p>“I have to work sometime, Lucian.” He shrugged as he leaned back in his chair. “What do you need?”</p><p>He felt Terrie’s hand move up his ankle. God, she wouldn’t. He drew in a deep breath, knowing he had never imagined his delicate little temptress daring something this sensual, this quickly.</p><p>“I need those cost estimates on that new chip your boys are working on. It was supposed to be in my office yesterday,” Lucian sighed as he sat down in one of the plush chairs in front of the desk. “Besides, I wanted to talk to you about that pretty little sister-in-law of yours.”</p><p>Jesse frowned. Beneath the desk Terrie’s hand stilled at his knee for just a second. She shifted silently then and he blinked as he felt her teeth nip the flesh above his knee.</p><p>“Go away, Lucian, I’m busy.” He fought to keep his voice calm, even.</p><p>Her hands were creeping up his thighs, her nails scraping through the silk of his slacks as she neared the engorged length of his cock. Son of a bitch. She was going to do it.</p><p>“Oh hell, don’t get possessive on me.” Lucian frowned. “She’s a pretty little thing, Jesse. Don’t tell me you haven’t fucked her yet.”</p><p>His belt came free.</p><p>“Lucian, Terrie isn’t up for discussion,” he growled.</p><p>The blood was rushing through his body, throbbing in his cock. The thought of fucking Terrie was killing him.</p><p>“Dammit, are you stalking her yourself?” the other man questioned impatiently. “Come on, Jesse, she’s family.”</p><p>“Not hardly,” Jesse growled as he felt his slacks loosen. Terrie had managed to slide the zipper down without a sound.</p><p>He felt perspiration gather on his forehead. This would kill him. Her hands were warm, inquisitive, as they worked the panel at the front of his briefs to free his straining flesh. Damn. He would have a stroke before she ever freed him. The sensation of her fingers moving against his sensitive cock was nearly more than he could bear. Her nails scraped the shaft, sending a firestorm of electrical impulses up his spine as he fought to keep from shuddering in pleasure. Hell, he wished Lucian would just get the hell out of the office.</p><p>“Not hardly what?” Lucian frowned. “Not hardly stalking her, or she’s not hardly family?”</p><p>Her tongue twirled around the head of his erection. He gritted his teeth, his hands clenching on the arms of his chair as the moist caress stole his breath. God, she was killing him.</p><p>“Jesse, are you okay?” Lucian frowned. “You’re acting damned strange.”</p><p>“Long day.” Jesse fought to keep his voice even, his gaze flickering to his lap where Terrie had laid her head against his thigh, her little pink tongue licking the shaft of his cock like it was some kind of living lollipop.</p><p>“Long day?” Lucian’s startled question had Jesse staring back up at him, dazed. “Dammit, Jesse, it’s barely afternoon.”</p><p>Jesse moved his hand to Terrie’s soft hair, clenching in the silken strands as her mouth covered the bulging head of his erection. Damn it, he was not going to come while he was fighting so hard to hide what she was doing to him. Not that he cared if the other man knew, but he was afraid she did.</p><p>“Lucian, let me call you later,” he growled as the wet heat of her mouth began to move over the head of his cock. “I’ll have the estimates for you then.”</p><p>Terrie decided that was the time to try to swallow his cock. She suckled him deep and slow, her tongue flickering along the sensitive underside like an erotic whip. At the same time, Lucian’s gaze fell to the floor and his eyes widened in surprise at something he obviously glimpsed through the inch-wide crack between the floor and the desk backing.</p><p>Lucian sat back in his chair with a wicked grin as Jesse fought to keep from cursing. Hell, he just hoped Lucian didn’t decide to ruin it for him. This was the most incredibly sensual thing he had ever experienced.</p><p>“So have you decided if you’re stalking her or not?” Lucian suddenly asked as he watched Jesse carefully. “Would be good to know before I try to fuck her myself.”</p><p>“Shut the fuck up, Luc,” he cursed roughly. But he felt Terrie shiver. Her mouth tightened on his cock, her tongue stroking him with quick little darts that were driving him crazy.</p><p>“Guess you are.” Lucian came to his feet reluctantly. “Hell, let me know if you change your mind.”</p><p>“Don’t hold your breath.” Jesse was almost panting as Terrie sucked his cock slow and easy. It was the sweetest torture he could imagine.</p><p>He ignored Lucian as he left the room, his gaze going to his lap, watching as his cock disappeared in and out of her mouth.</p><p>“There you go, baby,” he whispered, his voice rough. “Just like that. Suck it slow and easy. Just like I intend to fuck you. Slow and easy, baby.”</p><p>She slurped on his flesh, a soft moan breaking from her throat as his fingers tightened in her hair.</p><p>“Beautiful,” he growled, feeling her shudder as he spoke to her. Did she like the words, he wondered? Was that what made her tremble each time he spoke? “You’re so pretty, baby, your mouth wrapped around my cock, sucking me.”</p><p>She moaned deeply as he spoke, her hand going to her own breast, her fingers plucking at her nipple. God, he wanted to do that for her. Wanted to pull at those pretty hard points. Watch them darken, harden further.</p><p>“What are you going to do when I come in your mouth, Terrie?” he asked her. “Do you think it’s going to be over? Do you think you’ll just walk away as though it didn’t happen?”</p><p>She moaned. The bulging head of his cock was caressed, tortured, as his words spurred her on. Her lips stretched around it, her eyes closed, her expression dazed as she gave him the best blowjob he had known in his life.</p><p>“Yeah, suck it harder, baby,” he whispered as she began to do just that. “I’ll fill your mouth, then I’ll fill that tight pussy of yours, Terrie. I’m going to fuck you so hard you’ll scream for me.”</p><p>He was fucking her mouth now. Her hands gripped his cock as she moaned around his flesh, licking him, suckling at him as he fucked her, his cock tightening, throbbing. His hands clenched around the strands of hair he held captive, holding her in place, watching her glistening mouth take him with each stroke.</p><p>“I’m going to come, Terrie.” He couldn’t stand it. His body was alive for a change, his cock so sensitive, so desperate for release he was burning alive. It was one of his greatest fantasies, his greatest needs. Terrie, kneeling before him, moaning for him, her body hot and receptive. God help him, he loved her.</p><p>His hips arched, his cock pressing to her throat as he felt his release wash over him. Lightning shot through his scrotum, up his spine, arching his body as the first pulse of his seed shot into her mouth.</p><p>“Take it all,” he whispered breathlessly as he felt her swallow, felt her tongue dance over the exploding tip as he shot into her mouth again. Then again. And still he was hard. Pulsing. He fucked against her lips, panting for breath before he reached down and dragged her from beneath the desk. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Bad girl,” he accused her softly as she stared at him in surprise. “That was very bad, Terrie. Let’s see what kind of punishment we can come up with for you.”</p><p>“What?” Her eyes widened as he jerked her over his lap, holding her down on his legs as she struggled weakly against him.</p><p>Jesse jerked her skirt above her buttocks, grimacing at the sight of the bare globes he revealed.</p> <p>“Jesse, have you gone crazy? Oh my God!” she sang out as his hand connected sharply with the first rounded curve.</p><p>She stilled, her breathing heavy, hard.</p><p>“Can you still taste my come in your mouth, baby?” He smoothed his hand over the reddened flesh.</p><p>“Yes.” Her voice broke when his finger ran down the cleft of her ass.</p><p>“Son of a bitch.” He paused at the stretched, filled little hole of her rectum. The base of the plug she wore was heated, warm from her body. The ultra-soft, jelly material stretched her ass, filling her, making his cock twitch in jealousy.</p> <p>He smacked her ass again. She flinched, crying out in startled awareness at the bite of pain.</p><p>“From now on, only I can fill your ass.” He smacked her again to reinforce the order. “Seduction is over, Terrie. Now the fun begins.”</p><p>He watched the cheeks of her ass redden as he delivered several more stinging slaps. She writhed beneath him, crying out in pleasure as he spanked her with erotic heat. She was twisting on his lap, her buttocks lifting imploringly when he stilled.</p><p>He couldn’t resist. He was too weak, he thought. She was supposed to seduce him. He wasn’t supposed to be this easy. He pulled the plug free of her anus, watching the stretching of the little hole, his eyes narrowing as she whimpered at the retreating pleasure. Just as slowly he pushed it back into her, feeling her shudder in pleasure.</p><p>“I’m going to fuck you, Terrie,” he growled. “I’m going to fuck you so hard, so deep, you’ll never forget what it’s like to have me fill you.”</p><p>He ripped the small thong from her, tossing the scraps to the floor as he jerked her up then pushed her back on the desk. He spread her legs, moving between them before he paused, his eyes widening as he caught sight of the little hoop framing her swollen clit.</p> <p>“Son of a bitch.” He lost his breath.</p><p>Her cunt was perfectly bare, smooth and glistening with her juices. The little bright gold hoop piercing the hood of her clit was so sexy, so erotic he nearly came then and there from the sight of it alone.</p><p>He was within seconds of pressing his engorged cock home when a heavy knocking at the office door had them both scrambling away from the desk. Dammit. Why hadn’t he had Lucian lock the fucking door?</p><p>He hurriedly fixed his slacks, glancing at Terrie as she smoothed the dress nervously over her hips. At least she could hide the damned proof of what nearly happened. He sat down heavily in his chair to hide the telltale tenting of his slacks as the door pushed open.</p><p>“Mr. Wyman, Mr. Delacourte needs you upstairs.” Tally stepped into the office, her expression perfectly bland as Terrie fidgeted by his side. “He said to tell you they have the Conover chip ready, but there’s a problem.”</p><p>There was a problem all right, and it wasn’t with a chip. He glanced from Terrie, back to Tally, then moved carefully from behind the desk. He had talked to Jase hours ago, though he hadn’t gone through Tally to do so. That damned chip was fine. What were those two up to?</p><p>“I’ll see you tonight.” He turned to Terrie, watching her carefully.</p><p>“Alone, Jesse,” she murmured firmly. “Tonight. Alone.”</p> <p>He watched her carefully for long moments. “Alone.” He nodded shortly then moved quickly from the office. Damned women. They were up to something. The question was, what?</p><p>Chapter Nine</p><p>She could pull this off, Terrie assured herself as she prepared the bedroom for Jesse’s arrival. She knew they would make it to the bedroom. At least, she hoped they did. She drew in a hard breath, checked her appearance for at least the tenth time, and tried to still her nerves. She had never attempted anything this brave without a drink first. There was something to be said for false courage.</p><p>“Stop worrying.” Tally moved into the room from the bathroom. “Just get him in here and the rest will work out.”</p><p>Tally was dressed in form-hugging black. She looked like a cat burglar. Terrie couldn’t help but roll her eyes before her nerves got the best of her again.</p><p>“What if he doesn’t go along with it?” She pushed her fingers restlessly through her hair. “What if he’s furious, Tally?”</p><p>“Then he can’t cry foul when you won’t.” She shrugged. “Turn about and all that, darling. Besides, Jesse isn’t going to be furious. He’ll be intrigued at first. Wondering how far you’ll go. Won’t he be surprised?”</p><p>She could tell Tally was trying her best not to crack up with laughter.</p><p>“You are finding this much too amusing, Tally,” Terrie sighed. “There’s no way this is going to work.”</p><p>She sat down on the bed and shook her head wearily. Why was she doing this? It wasn’t the first time she had asked herself this question. She knew, when it came right down to it, that anything Jesse wanted she would give him willingly. She had known it years ago. She knew it now.</p><p>She also knew, though, that no one had given to Jesse in the same manner. Through the years she had known him, watched him as he gave unselfishly of himself. Always. To Thomas, it had been money. The only thing Thomas had ever cared about. For his twin, James, it was his support, continually, no matter where or when. It was the same for her, for his friends. Often, no one had to even ask. If Jesse knew there was need, then Jesse gave.</p><p>Just giving herself to him didn’t seem to be enough. She wanted to give to him in the same ways she knew he would give to her. His pleasure alone. A fantasy she knew he had never had. Dominant, alpha Jesse would have never allowed himself to be tied down, giving his control to two women. That was his territory. He bestowed the pleasure; he never selfishly took. And she had been allowing it for as long as she had known him. She had taken all he gave her, never questioning why, never wondering at his needs. Was it really so bad?</p><p>She knew it didn’t happen often. That even in Tess and Cole’s relationship it had only happened a handful of times. Just as she knew Jesse would never go back to Tess now. What happened, she wondered, as each of the group married? Why, when it was so imperative before the marriage, did that need to share their women ease later in the relationship? At first she had been unaware it did, until Jesse had brought up the subject months before.</p><p>I guess that need just isn’t there, he had said, shrugging. Love changes things, Terrie. It changes a lot. But that doesn’t mean I wouldn’t want the woman I love to know that side of me. Or to miss out on that particular pleasure. It’s a part of who I am.</p><p>She hadn’t understood it at the time. Hell, she didn’t know if she understood it now. Why would it change? And why, as she thought about it, did she want to give Jesse that brand of pleasure herself in a small way? A sexual, intensely erotic gift that there was no way in hell she would ever repeat.</p><p>She had thought it was to turn the tables on him. Had convinced herself it was. But it wasn’t really. She wanted Jesse to know she accepted him. To know she knew him. To know she understood. And she wanted to give him a gift that she knew no one else ever had.</p><p>“Terrie,” Tally sighed as she sat down beside her. “Jesse isn’t a serious thing for me. But you’re my friend. I promise you, when he gets here and we start this, I will take good care of your man and your friendship.”</p><p>Terrie looked at her friend silently. Tally sighed.</p><p>“I don’t want Jesse physically, Terrie. You know this. But I know what you want for him. We’re friends, and I want your happiness above anything. So I want to help you do this.”</p><p>Terrie tilted her head, watching the other woman closely. For once, Tally’s dark gaze held no mockery, no laughter.</p><p>“No wonder Jesse doesn’t ever know what to make of you,” she whispered softly. “You’re like him, Tally. Unselfish...”</p><p>Tally snorted as she rose quickly to her feet. “No way, Terrie. I’m very selfish. When we’re done, you’re helping me get that job at Conover’s. Your man is a lousy boss. Hell, he caught onto his own filing as though he’s supposed to do it himself,” she grunted. “So never fear, it comes with a price.”</p><p>Terrie hid her smile. She had never known what a true friend she had. But she did now. The nights Tally had forced her out of the house, getting her drunk, tattooed, pierced. Terrie remembered those bleak days clearly. Days when she had fought to make sense of her life, and who she was. Days she had wondered if Thomas had been right. If she was truly less of a woman than she had ever believed. Never enough woman for a man like Jesse.</p><p>“Okay, we can do this,” she announced. “He’ll be here in less than an hour. I’ll get him in the handcuffs, but he’s going to be pissed.”</p><p>“Of course he will.” Tally smiled. “That’s the best part.” She rubbed her hands together with mocking eagerness. “Can we blindfold him?”</p><p>Chapter Ten</p><p>Terrie was waiting for Jesse when he stepped slowly into the bedroom. The house was dark, lit only by the candles that showed the way from the front door, up the stairs and into her room. The bedroom was lit by dozens of the small scented candles, casting his expression in shadow. But she caught a glimpse of his somber expression as he stepped into the room.</p><p>Tally was waiting on the screened-in back porch, watching for the bedroom light to flicker. The sign that she could enter. What Terrie had to say to Jesse, she wanted no one else to hear.</p><p>She watched as he pushed his hands into his slacks’ pockets, watching her carefully, his green eyes quiet, reflective as she sat on the bed, dressed only in the short silk gown she had donned.</p><p>“Why do I have a feeling you want to talk first?” he quipped almost too seriously.</p><p>“Because you know me that well,” she said softly, watching him a bit sadly. “You always have. Even when I was too young to know what it meant. And when I was too stupid to accept what it was.”</p><p>He leaned against her dresser, watching her quietly. Terrie felt her chest tighten at the flood of emotion that washed over her. He was so strong, even now, as he watched her uncertainly, his eyes brilliant with all the emotions she had never realized were there before.</p><p>“You were never stupid, Terrie,” he said quietly. “Frightened. Innocent...”</p><p>“And too stupid to know what I was feeling or what I wanted,” she finished for him. “I love you, Jesse. I always have loved you.”</p><p>He frowned, his expression brooding, intense. “I know that, Terrie. I always knew that.”</p><p>She tilted her head. He wasn’t lying. She could see just how very serious he was.</p><p>“And you love me,” she whispered, fighting her tears. “You loved me, before Thomas.”</p><p>He breathed out roughly. “Before Thomas, during Thomas, now,” he growled. “Love doesn’t just turn off, Terrie. What do you want me to say?”</p><p>It was there in his voice. Husky, controlled, endearingly honest. If there was one thing she knew about Jesse, it was that he would never lie to her about his feelings for her. He might not tell her something she needed to know, but he wouldn’t lie to her.</p><p>“Why didn’t you tell me?” she asked him roughly. “Why didn’t you let me know, Jesse, instead of leaving me in the dark?”</p><p>“How, baby?” He shrugged, though she saw his fists clench in his pockets. “You were so scared of me you ran damned near every time I tried to get close. You’ve been like that ever since you realized I did want you. You ran, because who I was, what I was, frightened you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It wasn’t him. She stared at him in surprise. It had never been his needs that had her running.</p><p>She shook her head slowly. “I ran because my own feelings, my own needs, terrified me. Not you,” she whispered. “You never frightened me, Jesse. Ever. But I scared the hell out of myself.”</p><p>“Because of who I am. Because of what I wanted,” he said roughly.</p><p>“Because of who I am.” She shook her head quickly. “Don’t you see, Jesse? It wasn’t you. It was me. I couldn’t make sense of my own needs, my own desires. I couldn’t understand what I wanted.”</p> <p>“And now?” He looked so alone, so braced for her rejection.</p><p>She rose slowly to her feet, revealing the items she had left on the bed behind her. Handcuffs and leather ankle cuffs attached to chains. She saw his gaze flicker to them.</p><p>“Will you trust me to love you, Jesse?” she asked him softly. “I trust you. With everything I am. Everything you need. Will you trust me as well?”</p><p>Silence built within the room for long, intense seconds as he stared at the bed.</p><p>“I take it those aren’t for you?” He nodded to the items.</p> <p>She looked up at him from the corners of her eyes, a small smile playing at her lips. “No, they aren’t for me.”</p><p>He tensed, his expression darkening with such latent sensuality she felt her pussy creaming in response.</p><p>He cleared his throat. “No means no, Terrie,” he reminded her firmly. “I can be man enough to give you want you want, within reason.”</p><p>She smiled gently. “You’ve always given me more than I deserve, Jesse. But now, I want to give to you. My gift to you, because I love you.”</p><p>He pulled his hands from his slacks, his fingers working slowly at the buttons of his shirt. He looked around the bedroom curiously.</p><p>“Why am I suddenly nervous?” he asked her with a half smile. A halfhearted attempt to remind her how dearly he loved being in control.</p> <p>She moved to him, her hand lifting to touch his chest, reveling in the feel of the hard, warm muscle beneath his dark skin. She felt his breath quicken as she laid a kiss between the edges of his shirt as it fell open. His hands lifted, running up her back as he drew her closer.</p><p>“God, Terrie, you make me lose all my control. You know that?” He lowered his head, his lips pressing to her temple, her cheek, then her lips.</p><p>Terrie moaned in rising hunger as his tongue swept over her lips, licking at them, tasting her, savoring her as his arms tightened around her.</p><p>“That’s only fair, because you do the same to me,” she panted breathlessly against his tongue, then moaned in pleasure as his lips took control of hers, his tongue forging into her mouth in a stroke of heated pleasure.</p><p>His fingers clenched on the material of her gown. His body tightened. The small signs of his arousal, his need for her, built her own need higher. She moved against him, reveling in his kiss. His lips were hard, rough, yet incredibly gentle on hers. His tongue thrust into her mouth with forceful strokes, making her hungry for more and more of his taste.</p><p>His hands moved to her bare shoulders, smoothing over the flesh, making her tremble from the hot pleasure that streaked through her body. A touch so simple, she thought in awe, just his fingertips, yet her vagina clenched with the sharp darts of lightning-hot sensations they created.</p><p>His lips moved over hers slow and easy. So gentle. His very gentleness was at odds with the tension that made his body tighten, made him harder, stronger than ever before. The tenderness never changed. He groaned with rough hunger. His tongue plundered her mouth, mating erotically with hers, yet each touch was so controlled, so light and adoring it made her soul weep with the need it transmitted to her.</p><p>“Wait. Wait.” She pulled back, aware that once again Jesse was giving. Overloading her senses, capturing her with a pleasure so seductively erotic she could do nothing but respond.</p> <p>She couldn’t lose control of herself, she thought frantically. This was for Jesse. His pleasure. His need. She had to return to him the bone tightening ecstasy he gave her each time he touched her.</p><p>“Terrie.” He was panting for breath as he laid his forehead against hers, his hands, palms only, smoothing across her shoulders. “I need you so bad I’m shaking with it, baby. I could devour you now, standing here against this fucking wall.”</p><p>“No.” She shook her head, moving back from him until his hands caught at her hips, holding her still. “Please, Jesse.” She stared up at him, knowing he wanted to give to her. Needed to give to her. But first, she needed to give to Jesse. “Let me do this, Jesse. Please. Just this once.”</p><p>He groaned roughly, his head falling back against the wall as he stared up at the ceiling. “Terrie, you torture me all night and I promise I’ll paddle your ass for sure.”</p><p>“Promises, promises,” she grinned as her fingers went to his belt. “Come on, Jesse, be brave.”</p><p>He looked down at her as he toed his shoes from his feet, his abdomen clenching as her fingers stroked across it. “No piercings.” He frowned fiercely. “You put a ring in my nipple, Terrie, and all bets are off. I’ll have to retaliate.”</p><p>She ran her fingers over the hard little pebble of his male nipple and grinned teasingly. “Gold would look good on you, Jesse. You should think about it.”</p><p>He snorted roughly. “I don’t think so, baby,” he groaned as she slid the zipper of his slacks down, the backs of her fingers caressing the hard ridge of his cock beneath his silk boxers.</p><p>She removed the pants and boxers slowly, planting kisses down his hard thighs as she went. The muscles there tensed, his cock jerking as her tongue stroked his skin languidly.</p><p>“Son of a bitch, you’re killing me,” he groaned, his hands spearing through her hair as she blew a soft breath across his tightening scrotum.</p><p>“I’m loving you, Jesse. Loving you with everything I can give you.” She leaned closer, her tongue stroking over the tightening sac. His legs spread for her, his cock so hard, the flesh stretched so tightly on it that it glistened in the candlelight.</p><p>His scrotum was bare of hair. She loved it. The sac was so silky, so soft with nothing to hinder her light strokes. His hands tightened in her hair as her teeth raked him gently, his hips pushing the flesh closer to her teasing tongue.</p><p>“God, Terrie.” His voice was deep, strangled. “Your tongue is killing me, baby.”</p><p>One last loving lick then she moved back, licking her lips as she rose from her kneeling position on the floor.</p><p>“On the bed,” she whispered.</p><p>His gaze flickered to the cuffs. “Fuck,” he breathed out roughly.</p><p>“We’ll get there,” she laughed softly. “In ways that will leave you screaming in pleasure.”</p><p>“That screaming part.” He glanced at her nervously. “Nothing too heavy, right?”</p><p>She lifted a brow. “Don’t worry, Jesse, I promise not to breech any restricted areas.”</p><p>He breathed out in relief. “I knew I loved you for a reason,” he quipped. “Okay.” He squared his shoulders with such a show of courage she had to smother her laughter. “Let’s do this before I chicken out.”</p><p>He plopped down on the bed, spreading his arms and legs with such reluctance she almost laughed out loud. Instead, she moved quickly to his wrists. She restrained them in the metal cuffs then clipped the other end to the chains that ran from the bottom of the bed rail. The leather cuffs were harder to attach, but within minutes she had his ankles restrained as well.</p><p>He watched her with narrowed eyes, the brilliant green heating to an almost dangerous level as she trailed her fingers up the inside of his taut leg. She took a deep breath. Despite Tally’s plan, she had no intention of blindfolding him.</p><p>“Do you remember when I threatened to share you with one of my friends?” she asked him softly as she rose to her knees and pulled the silk gown quickly from her body.</p><p>His eyes widened. At first in surprise, then in growing heat. “What have you done, Terrie?”</p><p>“I want to give you a taste of what I know you’ll give me eventually,” she whispered. “Pleasure, Jesse. The most erotic pleasure I can think of for you. Would you let me do that? I can’t do it without your permission.”</p><p>He breathing was hard, rough. “Fuck. Tally.” The moan wasn’t one of pleasured anticipation. “I know damned well you wouldn’t let anyone else in this room with us.”</p><p>She could hear his nervousness now. “Terrie, honey, I would do anything in this world for you, you know that. But that woman is dangerous.”</p><p>She moved from the bed, controlling her grin. “You didn’t say no, Jesse,” she reminded him. “Are you saying no?”</p><p>He cleared his throat. “No piercings, right?” His voice was thicker, almost slurred with his arousal.</p><p>“No piercings, Jesse,” she promised as she turned on the light, held it a second, then turned it off again. “Should I blindfold you?”</p><p>“God, no!” he growled. “I’m going to watch, Terrie, every move you make. And baby, when your turn comes, I’m going to make you scream for mercy just as hard and as loud as you make me scream. You better remember that.”</p><p>“I’m looking forward to it,” she murmured as Tally stepped into the room. “You have no idea, Jesse, how much I’m looking forward to it.”</p><p>Chapter Eleven</p><p>Jesse watched the two women carefully. He’d had a feeling, years ago, that Terrie could more than match his desires, but he’d be damned if he ever expected this.</p><p>Tally. Hell, he had suspected she was a wildcat, but he couldn’t profess any driving desire for her. He had to admit she was damned pretty, though. Just a few inches shorter than Terrie, her skin a dark contrast to Terrie’s creamy flesh. Her long black hair rippled down her back, her dark eyes glinted with amused desire.</p><p>“You owe me, boss,” she murmured as she moved along his side, her lips whispering along his ear as Terrie moved to the other. “Big time.”</p><p>A whiplash of scalding lust seared his body as Terrie’s lips feathered over his neck. The twin sensations were stronger, more powerful than he had expected. He tugged at the restraints, his fingers curling into fists with his need to touch now. Two hands stroked over his chest, his abdomen, raising his blood pressure and his arousal level past heights he would have never dreamed it could.</p><p>Both hands were soft, silky and warm. Yet Terrie’s held a heat, a gentleness he would have known anywhere. She stroked him as though her pleasure came from the touch of his skin alone. Not that Tally didn’t know how to use her hands. Damned if she didn’t. And her nails. Every muscle in his body clenched when she used them across his nipple. Shit, that shouldn’t feel so damned good.</p><p>“Terrie,” he growled her name as his gaze darkened with the spiraling pleasure.</p><p>It felt as though lips, tongues and seductive fingers were everywhere. His nipples, his chest, his abdomen. A wash of silken heat as Terrie’s lips feathered toward his, Tally’s drifting to his chest.</p><p>“Do you feel good, Jesse?” Terrie breathed against his lips, her eyes dark in the candlelight and filled with emotion.</p><p>“Kiss me, Terrie,” he growled. “Before I go insane for your taste.”</p><p>She smiled. A slow tilt of her lips that had his cock jerking in response. It was an erotic, captivating smile and had him groaning in sensual frustration. She leaned over him, her breasts brushing against his arm, his chest. The gold nipple ring taunted him as he glanced down, glowing against the rosy peak as she raked it across his chest.</p><p>Her lips touched his, her tongue stroked. His body bucked as Tally’s lips moved to his chest, her tongue lapping at his nipple. Dammit, that wasn’t supposed to feel that good.</p><p>But Terrie’s kiss fried his brain. He struggled against the cuffs, desperate to touch her. He needed to touch her, to run his hands over her body, to show her with his touch, with his kiss, what she meant to him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There was no escaping the bonds. No escaping the hot ecstasy moving over his body. Terrie’s lips were silken fire on his as his head raised to get closer to the teasing kiss. Yet she was always just a breath away, licking at him, taunting him with the need for more.</p><p>Silken hands were like brush strokes of flame on his body when she finally came to him. Her tongue slipped into his mouth, her broken moan whispering around him as she took what she needed from the kiss. Deep, hungry, her tongue thrusting past his lips, tangling with his, stretching his senses on a rack of exquisite lust.</p><p>He groaned at the loss of her touch when she pulled back, his eyes opening, his gaze darkening as her teeth nipped at his jaw, then began to move lower. The scent of heated female need was like an aphrodisiac to his senses. It drifted around him, tightening his body to a flash point of sensitivity that was nearly painful.</p> <p>“Feel good?” she breathed at his ear as her body began to move lower.</p><p>“You’re killing me,” he gasped, feeling Tally’s lips and tongue stroking his abdomen, her hot little hands smoothing over his thighs.</p><p>“I’m loving you,” she denied. “All of you, Jesse. Just let me love you.”</p><p>Her lips stroked down his chest, his abdomen. He groaned in mounting pleasure, his cock throbbing, jerking, as they drew slowly closer to the center of his thighs.</p><p>Terrie was like a sleek little cat moving around him, her tongue licking at his skin, her teeth scraping sensually at his flesh. His body arched as their lips moved to his thighs. Hot, blistering with sensual delight, lips and tongue tortured his flesh, coming close to his desperate erection then moving back.</p> <p>He was certain they were determined to drive him mad. Then he felt soft lips moving up the inside of one thigh, a quick adventurous stroke of a tongue on the smooth flesh of his scrotum.</p><p>“Terrie.” He fought to arch closer as Terrie’s tongue joined the game, licking up the shaft of his cock, swirling around the bulbous head.</p><p>He could feel his release nearing. His scrotum tightened with it, his body becoming electrified. It was so damned close, he knew he was within seconds of coming from the sheer eroticism of the act alone.</p><p>He looked down along his body to see Terrie laying beside him, her breasts brushing his thigh as her mouth moved slowly, adoringly over his cock. The tight, heavily veined flesh glistened from her saliva, jerked from the heated lash of her tongue. Her eyes were closed, her enjoyment in his response clearly written in her expression.</p><p>Below her, stretched between his spread thighs, Tally was busy torturing, tormenting his tightened scrotum. She licked and suckled, her teeth scraping erotically, her tongue laving him with brilliant heat.</p><p>Control was a thing of the past. Jesse existed only in the pleasure, the overriding exquisite torment the two women practiced on his restrained body. He fought the chains, his body bucking, rough, guttural growls sounding from his chest as he fought for his release.</p> <p>Then Terrie’s mouth tightened on him, drawing him deeper into her mouth, suckling the head of his cock with a deep, rhythmic flexing of her mouth and tongue that proved to be too much when combined with Tally’s mouthing of his scrotum below.</p><p>His hoarse shout was torn from his chest as he felt his release explode through his body. His head arched back, grinding into the mattress beneath him as his hips arched higher to Terrie’s tormenting suckling. Destructive quakes of sensation ripped through his body, his testicles, shooting his semen from the tip of his cock as though it were the first release of his life.</p><p>“Terrie. Son of a bitch!” His cry was torn from his very soul as the pleasure rocked him, shuddered through him, left him gasping in an aftermath so intense he wondered if he would ever truly recover.</p><p>Chapter Twelve</p><p>Terrie dragged herself slowly out of bed the next morning. Her body ached pleasantly, drawing a satisfied smile to her lips. Jesse had been uncontrollable after the cuffs had come off. God only knew when Tally finally left, because from the minute he gained his freedom Jesse had flipped Terrie on her back, his cock thrusting hard and fast inside her, and he hadn’t stopped for hours.</p><p>Dawn had been peeking through the bedroom when he collapsed beside her, swearing she was going to pay for that loss of control. Moving into the shower she stood beneath the steamy water, her eyes closed, reveling in the memory of Jesse’s hoarse shouts of release, his steamy, sexy words as he praised her body, her sexuality. It had been the most amazing night of her life.</p><p>Leaning against the shower wall she soaped her bath sponge, her heart pounding in a hard rhythm as nerves began to take hold of her once again. She knew what was coming and though it didn’t frighten her, she wondered at the changes in herself. Jesse had always been so much a part of her life. For years he had been there, and though she had tried not to lean on him she had known he was there if the need arose.</p><p>Always there. She bit her lip as the thought crossed her mind. Always waiting, always wanting, just as she had. Always wanting the one thing, the one part of herself that frightened her more than anything else did.</p> <p>Was she brave enough to be the woman Jesse needed? She moved the sponge slowly over her breasts, shivering at the sensitivity of her own body. Yeah, she thought with another smile, she could do it. Surely she could.</p><p>She wasn’t nearly finished with Jesse Wyman either. He had whispered the words she needed to hear as sleep overtook her that morning, but he had yet to say them to her while she was fully awake. Terrie wanted to see him, to know he meant it when he shared his love with her. He had said the words hesitantly, as though uncertain of her reaction or her awareness.</p><p>I’ve always loved you. His voice had been incredibly soft, the rough timber hoarse, thick with emotion, unlike anything she had heard from Jesse before. As she dressed, she vowed that once and for all, before this relationship went any further, she and Jesse had to talk. There was too much between them, too many secrets, too many words unspoken. It was time to clear it away. Time to accept the past, not just for her, but for Jesse as well.</p><p>Thomas had left an inheritance of pain and bitter regret with many of his actions and his brutal cruelty. Somehow he had known that Jesse cared about her, just as he had guessed her feelings for Jesse. He had used those emotions and deceived both of them in his drive to hurt as many people as he could. As though only in stripping them bare, in seeing the agony he created, could he find any happiness in his life.</p><p>Terrie shook her head at the thought of that. She needed answers herself. She needed to know once and for all where she and Jesse were headed. She quickly dried her body, moving into the bedroom to dress before heading to Jesse’s office.</p><p>As she entered the room the phone rang demandingly.</p><p>“Yes?” She grabbed the receiver as she began to search her dresser drawer for just the right undergarments.</p><p>“How about lunch?” His dark voice had her shivering, her cunt pulsing with demanding need as she closed her eyes to savor the sound.</p><p>“Where?” Her voice was husky. She refused to attempt to hide her need now. He knew her, knew she could no longer resist the pleasure he could give her.</p><p>“My office, whenever you show up,” he said softly. “I have to take care of a few things first, then I’ll be free the rest of the day.”</p><p>The rest of the day to play. She fought to keep from panting like an inexperienced teenager at the thought of it. She managed it, but only barely.</p><p>“Sounds good.” She pulled a midnight blue thong from her dresser and a matching silk push-up bra as she fought to try to breathe properly.</p><p>“Terrie.” His voice was smooth, low, a sexual stroke of pleasure across her senses.</p><p>She swallowed tightly. “Yes, Jesse?”</p><p>“Use the butt plug again, and that pretty little violet slip dress hanging in your closet. And no bra, Terrie.”</p><p>The dominant, ruthless sound of his voice had her trembling in nervous anticipation.</p><p>“Maybe...”</p><p>“Terrie.” There was an edge to his voice now that had her pussy quaking in reaction. “Be wearing it or I promise you, you’ll wish you had.”</p><p>The line disconnected.</p><p>Terrie stared down at the receiver for a shocked second before she laughed softly. Oh, now there was a man fighting for control. Desperately. He was a dominant alpha male scrambling to reassert his authority. She loved it. She wondered how quickly she could throw him off balance once again? Drawing in a deep breath, smiling in anticipation, she vowed to find out.</p><p>“Men are so predictable.” Tally closed the door behind her as Jesse hung up the phone and drew in a deep, hard breath.</p><p>He arched a brow sarcastically. “Did I ring you, Tally?”</p><p>She rolled her eyes expressively. The woman was a menace. He had known she was a menace when he hired her the year before; he was even more convinced of it now.</p><p>“You know Jesse, we’ve known each other a long time.” She sat down regally in the chair across from him, smoothing out her skirt rather absently before glancing up at him again. Cool as a cucumber, that was Tally.</p><p>“We have,” he admitted carefully, wondering where she was going with this.</p><p>“I’ve known Terrie even longer,” she sighed patiently. “She’s such a brave little thing when she wants to be. But that bravery is not going to extend to a scheduled ménage, such as you and your buddies like to set up. If you want her, you’re going to have to surprise her. Dare her.” Tally’s voice was a dare itself. “But once she does it, I’m certain she’ll settle right into your little domination games.”</p><p>She leaned back in her chair, her attitude one of mocking acceptance of an eccentricity she found little amusement in.</p><p>“You know, Tally.” He leaned forward in his chair, controlling his grin. “As you stated, we’ve known each other for quite a while. And don’t think you’re the only one of us who can read easily between the lines.”</p><p>Her eyes widened in false surprise. “Sweetie, I never imagined such a thing.” She shook her head tolerantly. “You do get the strangest ideas.”</p><p>“Tally, I’m not nearly as simple as you are giving me credit for,” he warned her carefully, allowing her to see the core of steady purpose he kept carefully below the surface. “I know many of your little secrets, sweetheart, and don’t think for a minute you’ll get away with baiting the group forever.”</p><p>“Oh them.” She waved her hand carelessly. “I’d worry less about your play mates and more about your lover if I were you.” She grinned. “Terrie will keep stealing your control, Jesse, if you don’t do something quickly. She can be a dominant little thing, can’t she?” She chuckled wickedly.</p><p>Jesse remained quiet, calm, though his amusement was growing. Tally was supremely confident, mocking, more than a little dominant herself. He couldn’t wait to see her fall.</p><p>“Tally, you have the rest of the day off,” he told her softly. “Long lunch, early dinner. I’ll see you tomorrow.”</p><p>She sighed, and he was intrigued to see the impression of a pout forming along her lips before she carefully controlled it.</p><p>“So who is the playmate going to be?” She tried to come off as casual, curious, but he caught the hint of something more.</p><p>He leaned closer to his desk, tilting his head with amused inquiry. “Who would you suggest, Tally?”</p><p>She shrugged negligently. “I was merely curious, Jesse.”</p><p>“Is there someone who shouldn’t be considered, Tally?” He leaned back in his chair, watching her carefully.</p><p>She came gracefully to her feet. “You and your little playmates are really none of my concern. By the way, Lucian Conover called. He’s coming in after lunch to discuss something about that contract he had problems with,” she sniffed disdainfully. “He didn’t want to hear that you might be busy. I’ll go to lunch now, dear. Watch out for hidden handcuffs and the like.” Her amused laughter was soft, lilting in its confidence. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tally.” He stopped her as she neared the door.</p><p>“Yes, Jesse.” She turned back, her body poised gracefully to sweep from the room.</p><p>“Lucian likes handcuffs, sweetheart, and a whole lot more. You might want to watch how much you taunt him.”</p><p>Her grin turned wicked, decidedly sexual. “Oh Jesse, darling, don’t worry. I won’t hurt him too badly.”</p><p>He chuckled as she swept from the room. He knew Lucian would eventually make his move on the temperamental little beauty, he just wondered if the other man would survive it.</p><p>Chapter Thirteen</p><p>The outer office was deserted. Terrie drew in a deep breath, fighting the trembling ache in her rear from the plug inserted inside it. The silk of the dress rasped against her sensitive nipples. Her pussy creamed heatedly. To some extent she suspected what was coming. The added rush of nervous fear and anticipation had her nearly panting in arousal.</p><p>She turned the lock in the door as she closed it behind her. The main offices were quiet this afternoon but she wanted to take no chances that she and Jesse would be disturbed.</p><p>She had given to Jesse the night before in the only way she knew how, to show him she understood the needs and the desires that were so much a part of him. She even understood, to some extent, that need as well. Watching Tally touch him, seeing his arousal, his pleasure, hearing his breathing hitch as he let the pleasure suffuse him, had been incredibly arousing.</p><p>In setting up the experience she was more than aware she had given Jesse implicit permission to turn the tables on her. She had given him her acceptance without words and now she fought to stem her nervousness over the choice. She had never been taken in such a way. Had never been shared between two men. Until Jesse, she had never known such rough loving, that such incredible, spiraling pleasure could be attained from the darker edge of lust.</p><p>She bit her lip as she approached his door. It was barely open, with no sound coming from the room beyond. Somehow he had managed to find his control once again. She could sense it, knew it. His voice on the phone earlier had assured her of it.</p><p>She pushed the door open slowly, stepping into the room as her gaze sought out Jesse.</p><p>He stood in front of the large, drapery-shrouded windows. The room was dim; his form was tall, graceful, commanding.</p><p>“Lock the door.” His voice was a hard rumble of lust.</p><p>Terrie felt her womb clench, her pussy flood. With shaking hands she closed the door, turning the lock and nearly flinching at the sharp sound it made. She stood silently, watching him, trying not to pant with her own rising sexual demands. She could feel her nipples hardening further, her cunt clenching in excruciating need.</p><p>Her eyes were drawn to the low table in front of the leather couch. Terrie drew in a deep breath to keep from whimpering. Lying on the table was a tube of lubrication, two small nipple clamps and a jelly dildo perhaps half the width of his cock, but just as long. Her gaze returned to him.</p><p>She started as he moved. A ripple of motion as he walked to the low table, glancing down at the articles then back to her.</p><p>“You’ve known me for a long time, Terrie,” he said softly. “I’ve never made an effort to hide who I am or what I enjoy from you.”</p><p>He paused for long moments as though waiting to see if she would deny his words. She couldn’t. She had known all along.</p><p>“Others would call me perverted...depraved,” he continued. “I won’t deny that, either. It’s definitely not conventional, but it’s who I am. And it’s a desire you can’t deny in yourself, Terrie. Not any longer.”</p><p>She wasn’t attempting to deny it, but she would be damned if she knew now what to do. She licked her lips nervously, aware that his eyes narrowed on the movement.</p><p>“I haven’t denied it, Jesse,” she finally said softly.</p> <p>A small smile quirked his lips. “No, you haven’t.” He lifted his arm, extending his hand out to her. “Come here, Terrie.”</p><p>She walked to him slowly, trembling, achingly aware of her body and the sexual fire coursing through it. She felt as though flames were leaping in her cunt, burning clear to her soul. As she stepped close to him the heat seared her body, her breasts, her anus. She nearly shuddered from the hunger to feel him thrusting hard and heavy inside her. Dominating her. Giving the gift of her own surrender, her complete submission to her own needs.</p><p>His hands slid up her arms. Terrie drew in a hard breath, her hunger for him nearly overcoming any semblance of control she could have possessed. Her flesh prickled, small goose bumps rising at the calloused touch of his palms, the warmth of his body.</p><p>“Do you know how beautiful you are to me?” he asked her as his fingers moved to the small buttons of her dress, slipping the first one free. “How long I’ve waited to touch you, how many nights I laid in a fever of rage while Thomas lived? Praying to God he wouldn’t touch you, wouldn’t hurt you?”</p><p>She shook her head, fighting those memories.</p><p>“I’ll have no more lies between us, Terrie. No more secrets.” He leaned close, his lips feathering her ear as he whispered, “Do you know how hard it was to walk away the nights I came to dinner while he lived, his permission to fuck you ringing in my ears? My need to hear you scream my name pounding in my cock?”</p><p>Her eyes widened in shock at the near violence in his tone.</p><p>“I’m sorry.” She trembled in his grip. “I didn’t know. I was so frightened of...this.” She shuddered as he nipped at her ear lobe.</p><p>“You’re mine,” he growled. “Your pleasure, your cries, your sweet pussy, your tight ass. It’s mine, Terrie. All of it. To pleasure how I see fit. To tempt, to tease, to watch as you experience every sexual fantasy you could have ever dreamed.”</p><p>Before she could have guessed his intentions, his hand hooked in the front of her dress and with a quick motion jerked the fabric apart. Buttons scattered as she gasped in surprise, only to moan in pleasure as his lips covered hers, his tongue sinking past her parted lips into the moist interior of her mouth.</p><p>He jerked the tattered remains of silk from her body a second before his arms crushed her to his chest. The Egyptian cotton of his shirt rasped her nipples, burning her with sensation as his lips moved on hers hungrily, his tongue thrusting between her lips, licking at hers, twining with it as she moaned in rising need.</p><p>Between her thighs her pussy spasmed, creaming furiously as the weight of the nipple ring tugged at the sensitive peak of one breast. One hand moved to the heavy weight of her hair as he pulled her head farther back, his lips moving down her neck, stroking tingling electric arcs of sensation over her flesh before he raised his head and stared down at her with dark arousal.</p><p>She stood panting, swaying as he moved back from her. Reaching down he picked up the two nipple clamps as she swallowed tightly. Her gaze met his as he watched her closely, the little jeweled clamps held in his hand.</p><p>His head lowered to her breasts.</p><p>“Jesse.” Her whimper was part fear, part incredible need as his tongue began to lick, his lips to suckle until her nipples stood out hard and aching from the mounds of her breasts.</p><p>“Just a little hurt,” he whispered. “But you like a little hurt, don’t you, Terrie?”</p><p>He attached the first clamp; its firm, nipping pressure had her nearly climaxing from the pleasure/pain alone. She couldn’t hold back her cry as he applied the mate to her other nipple. She was swaying, her pussy gushing its thick juice as the sensations threatened to overwhelm her.</p><p>His finger pushed at the little jewels dangling from the clamp and she bit her lip at the tug on her furiously aroused flesh.</p><p>“Jesse, I don’t know if I can stand it.” The pleasure and the pain were swamping her.</p><p>His fingers reached up to her cheek, touching her gently, lovingly. “When it’s too much, Terrie, just say so. I won’t take from you, baby. I want to give to you.”</p><p>She bit her lip at the emotion in his voice. It throbbed with his need to show her all he was, echoed with his own deep, dark desires.</p><p>“Lie down on the couch. On your stomach.” His voice was harsh with his fight for control. “Raise your hips. Let me see how well your ass is filled with that plug.”</p><p>She nearly sank to the carpet with the burst of weakening lust that surged through her body. She did as he commanded, stretching out on the cool, fitted coverlet that fit over the leather couch. She positioned her body as he had demanded, shivering at the thought of his gaze going to the base of the thick plug stretching her.</p><p>“Beautiful,” he muttered, a second before she heard him undressing.</p><p>Agonized desire rushed through her body. The clamps on her nipples weren’t overly tight; the pressure was killing her with her need for more. A second later more came.</p><p>There was no warning. Not a sound to indicate his intentions. His hand landed firmly, heatedly on one rounded cheek of her rear. Terrie cried out, but rather than pain, pleasure tore a destructive path through her body as her pussy raged in furious demand. A second later, another blow landed on the other cheek. She flinched, crying out, though her hips arched back for more.</p><p>She couldn’t stand it. Searing lust swept through her, overtaking her in ways she would have never imagined. Within minutes her ass was burning, her cunt dripping, weeping in greedy need.</p><p>“You have the most beautiful ass I have ever seen on a woman,” he said as his hand then smoothed over the aching flesh. “Do you know how many nights I’ve jacked off thinking about fucking your sweet ass, Terrie?”</p><p>Chapter Fourteen</p><p>Terrie whimpered. Her muscles clenched around the plug that stretched her, anticipating the harder, hotter invasion of his thick cock inside her. Her buttocks were hot from the fiery sting of his hand, her cunt an inferno of unslaked arousal.</p><p>“Mine,” he whispered again as his mouth feathered over the heated curve of one buttock, causing her to jerk at the pleasure ricocheting through her system. “But first, I want you ready for me.”</p><p>He moved between her thighs, his hand at her hip, urging her to raise herself further. Terrie clenched her fists into the coverlet over the couch, bending her knees to raise herself to him. His hard, tight moan of approval had her juices spilling copiously from her hot pussy.</p><p>Terrie shuddered as she felt his fingers grip the base of the plug before moving it slowly from her body. The wide anchor stretched her heatedly, causing her to whimper in growing arousal then in loss as it slid completely from her. But Jesse had no intentions of leaving her wanting.</p><p>She heard him moving. Heard the cap on the tube of lubrication gel snap, then felt the thick application of it at her back entrance as his fingers pushed inside her briefly.</p><p>“I wanted to start easy,” he whispered as his arm hooked around her waist to draw her back with him as he half reclined against the couch behind her. “First the dildo and me, then we’ll advance, but I don’t think I can wait, Terrie.”</p><p>She struggled for a sense of balance as his hands moved her, bringing her over his hips, placing her legs on each side of him, her back to him as his cock nudged at her anal opening.</p><p>She shuddered, her hands gripping his wrists where they held her waist, her rear entrance fluttering open as he pressed his cock into it.</p><p>“Oh God, Jesse!” She could feel the thick flesh of her anus opening to the flared head of his cock as he pressed her closer.</p><p>Heat shot through her pussy, her rectum and up her spine as she felt her muscles part slowly for him. The hard bite of pain, the fiery wash of arousal, all combining to push her past her preconceived notions of lust. The need was like a demon inside her, fighting to be free as Jesse slowly slid into the well-greased channel.</p><p>She chanted his name as she felt each inch slip into her ass. Deliberately, slowly.</p><p>“Terrie, you’re so tight,” he whispered as the bulging head finally pressed home. “So hot and sweet, baby.”</p><p>She screamed. She couldn’t help it. His cock slid to the hilt inside her in one smooth stroke, forging into her hot ass as pleasure/pain whipped violently through her body. She could feel the juices dripping from her cunt, her clamped nipples throbbing in response as he drew her back against his chest. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Easy, baby.” He pressed kisses to her shoulder, his tongue stroking her flesh. “Just a minute, baby. Just get used to it. It’s okay.”</p><p>She was gasping, but not just in pain, though the pressure was biting. In pleasure. In an agony of need. She could feel her orgasm building in her very womb.</p><p>“Jesse, help me,” she whispered desperately, the fingers of one hand going to her pussy, circling her swollen clit as she undulated against him.</p><p>Oh God. That was good. She moved again, one foot slipping to the floor to anchor her as her body arched in reflex, driving his cock deeper inside her as she changed position.</p><p>She was sobbing with the pleasure now, her fingers moving frantically to the entrance of her aching pussy only to have Jesse catch them, hold them back as his hips flexed, pulling his cock back mere inches and then driving it forward again.</p><p>She writhed on the impalement, fighting to free her hands as harsh cries fell from her lips. She was so hot, so aroused she felt as though she would burst into flames at any minute.</p><p>“Jesse, I can’t take this,” she cried out as one of his hands held hers while the other helped lift her hips enough to allow him to begin a series of those easy thrusts into her ass.</p><p>She was breaking apart. She could feel her cunt tightening, spasming, begging to be filled. She was within seconds of screaming out that need when the lock to the office door clicked and the door slowly opened.</p><p>Lucian Conover stepped into the room, pocketing the key as he moved to the couch. His fingers began working quickly at the buttons of his shirt.</p><p>“Terrie?” Jesse whispered her name as his cock throbbed inside her tight ass.</p><p>She stared up at Lucian, knowing her cunt caught his gaze, the glistening juices that covered the bare folds as Jesse raided her anus. He undressed quickly, his cock springing free as he dropped his pants, the thickly veined shaft engorged and more than ready to fill her.</p><p>“Is this what you want, Terrie?” Lucian asked her as one hand went to his thick erection. “I’ll leave if you want me to.”</p><p>But did she want him to? Her eyes strayed to his cock as her mind filled with the erotic thoughts of him filling her, easing the blistering need that tormented her pussy.</p><p>He bent to his knees, spreading her legs further, his head lowering to her swollen clit as Jesse began to thrust slowly in and out of her ass once again. Their half reclining position allowed him to pull his cock free by several inches before powering it home again, rocking her body with the streaking pleasure/pain as Lucian’s suckling mouth locked onto her clit. It didn’t take long before the beginnings of the first explosive orgasm ripped through Terrie’s body. She tightened, crying out, fighting for balance when Jesse lifted his hands, gripped the nipple clamps and released her tormented flesh as the first explosion tore through her.</p><p>She had no more than screamed his name when Lucian came to his feet, bending his knees and began to work his cock into the convulsing muscles of her pussy.</p><p>“Easy, baby. There, sweetheart. Feel how good it can be. Feel, Terrie, just how fucking good it can be.” He stilled beneath her as Lucian began to fuck inside her with slow, short strokes, pushing his bulging cock deeper inside the fist-tight confines of her pussy.</p><p>Her eyes widened, her gaze darkening as Jesse continued to croon at her ear, his cock throbbing in her ass as Lucian worked his impressive erection deep inside the tightened channel of her cunt.</p><p>She was gasping, begging, distantly amazed that the cries and pleas were coming from her own throat.</p><p>“Yes.” Her head fell back on Jesse’s shoulder as his lips pressed to her cheek. “Yes. God. Fuck me. Jesse, make him fuck me hard, before I die.”</p><p>Her hoarse words acted as a catalyst on the two men. She didn’t know whose hands supported her above Jesse’s body; she didn’t care. In perfect synchronization she felt Jesse’s cock slide nearly free of the grip of her ass while Lucian’s thrusted, strong and sure, deep into her gripping pussy. Lucian pulled back, only to have Jesse surge inside the clasping heat of her ass.</p><p>The dual penetrations were more than her heightened emotions and overly sensitive body could process at once. As they began to fuck her hard and fast, their groans blending with her feminine cries, she tumbled headlong into an orgasm so explosive, so violent she lost her breath, lost her control and surrendered herself to the cyclonic whiplash of emotion and pleasure/pain that ripped through her body. Lucian and Jesse groaned her name and began spurting their own releases deep inside her spasming channels.</p><p>Chapter Fifteen</p> <p>“There, baby...” It wasn’t over. Hours later Terrie trembled, her body soaked with perspiration as yet another orgasm tore through her.</p><p>Jesse’s cock was spurting heavily up into her swollen pussy, as Lucian once again gained his release in the tight recess of her ass. There had been little respite in the hours they had pleasured her. Jesse had held her once, watching, whispering explicit directions to her as they both watched Lucian part the lips of her cunt, his cock stroking slowly inside her, driving her insane as Jesse told her how beautiful it was, whispered to her how beautiful she was in her pleasure.</p><p>And the pleasure was never ending.</p><p>There was little resistance in her when they finally pulled free of her body and Jesse helped her collapse weakly to the couch. Night had fallen, the offices she knew were empty and she was too replete, too satisfied to even consider moving now.</p><p>She felt the soft sheet drape her body as her eyes closed in weariness, only dimly aware of Jesse and Lucian dressing.</p><p>Jesse watched her. Weariness dragging at his limbs as he zipped his slacks and watched Lucian re-button his own shirt. The other man was quiet, reflective, as he glanced at Terrie. Her hair flowed over her shoulders, clinging damply to the moist flesh as she drifted into sleep.</p><p>“Thomas didn’t deserve her,” Lucian sighed as her breathing deepened.</p><p>“I do, Lucian.” Jesse was very well aware of the fact that there were several of the members of their group who had had their eye on Terrie even before Thomas’s death. “She’s mine.”</p><p>Lucian nodded sharply. He more than the others, Jesse knew, had been interested. Just as he knew that any woman who accepted Conover would likely be biting off more than she could chew.</p><p>“She’s a one-man woman,” Lucian sighed, grinning rakishly. “I doubt she would appreciate the plans I had for her.”</p><p>“Wrong woman,” Jesse agreed.</p><p>Lucian nodded again. “Take care of her, Jesse. She loves you, you know.”</p><p>Yeah, he knew that, Jesse thought. She had proved that the night before in ways he would have never imagined.</p><p>“As I love her, Lucian,” he sighed. He always had. For as long as he had known her.</p><p>Lucian nodded abruptly then left the office with a quick, purposeful stride. Jesse shook his head as he collapsed in the chair across from Terrie and watched her sleep.</p><p>She was the most beautiful thing in the world to him. For years he had feared he would have to eventually restrain his sexuality to have her. Tamp down the need to see her surrendering to the ultimate pleasure. That of allowing her body to be completely, overwhelmingly submissive to her own desires. To take the greatest gift he had to offer her. The gift of her complete, uninhibited sexuality.</p><p>Some women had that hidden core, the darker desires, the search for the ultimate pleasure. Just as Jesse and those like him held the male half of that core. The need to see and to feel the surrender of their women to that hidden sexuality. To watch someone they trusted, someone they knew, tapping into the dark desires and sensuality of their women. It was an ultimate high, a release unlike any other.</p><p>Not that it would happen often. But sometimes. Sighing, he moved to the office closet and removed the dress he had brought for her that evening. He laid it across the chair as he moved to her once again.</p><p>“Wake up, baby,” he whispered as he lifted her into his arms and headed for the shower on the other side of his office. “Come on. Time to plan the rest of our lives.”</p><p>She opened her eyes, drowsy, seductive and her lips quirking into a temptress’s smile.</p><p>“Rest of our lives, huh?” She looped her arms lazily around his shoulders, staring up at him, loving him. He could feel her love, the warmth that spread over him when he watched her.</p><p>“The rest of our lives.” He put her down in the bathroom, staring down at her. “I love you, Terrie. You have to know that by now.”</p><p>Her smile lit up his soul. “I love you, Jesse. But this sharing thing.” She rubbed hesitantly at her ear. “Let’s keep this to a minimum,” she suggested softly. “I really prefer you.”</p><p>He chuckled, wrapping his arms around her, wishing he had the energy to throw her to the floor and fuck her again. Just for the sheer pleasure of it.</p><p>“Definitely a minimum,” he promised as he drew back from her, staring down at her, adoring her. “Just when you need it, baby. I promise, just when you need it.”</p><p>Epilogue</p><p>“Hi Jaded, how’s tricks?” The words popped up on the computer screen, drawing an amused smile to Tally’s lips.</p><p>“Slow, Wicked. Very slow,” she typed back, snorting at the understatement.</p><p>The online life she led was the complete opposite of the real life she escaped each evening that she had the chance. The same men, the same parties, the same crap. She had grown bored with the endless round months ago. Why she had grown bored she had yet to figure out.</p><p>“Your boss still doing his own files?” It was a running joke in the online chat rooms she inhabited. She had told the story the first day it had occurred. Everyone had seemed awed by her accomplishment. She had personally hoped for at least a good argument out of Jesse Wyman at the time. She hadn’t expected him to actually do his own fucking files.</p><p>“Hell if I know,” she finally typed in. “I think he fired me today.”</p><p>Repositioning, firing, it was the same thing. She liked working with Wyman. It wasn’t exactly challenging but it left her plenty of time for shopping.</p><p>“Fired?” The words popped back. “He wouldn’t dare fire you.”</p><p>She laughed to herself. There were days Wyman had wanted to kill her, but he had resisted the urge with more self-control than she had given him credit for. Of course, the wedding Terrie was planning was keeping him pretty tired. That or her afternoon visits to his office.</p><p>“He says it’s repositioning. He sent me to hell, Wicked.” She sighed at the thought.</p><p>The merger between Conover’s and Delacourte’s had been more than a surprise last month. Even bigger was the surprise that she would now be the personal assistant for Lucian Conover.</p><p>“Repositioning?” The short question was so typical of Wicked. She could almost feel his impatience. “In Hell?”</p><p>“In Hell,” she sighed. “My new boss is Lucifer. This is not going to be fun. There goes all my playtime. (pout)” She typed in the expression even as she did so huffily. Lucian Conover was not her idea of the perfect boss. “Let’s hope he’s at least hiding a sense of humor under that scowl he wears. I bet he doesn’t even know the difference between a ménage and margarita. Who will I tell all my dirty jokes to?”</p><p>Lucian scowled. Son of a bitch. Lucifer, was he? Didn’t know a ménage from a margarita? He bit off a series of volatile curses as he jumped up from the computer and paced the den furiously. Smart-mouthed, viperous little termagant. He could show her a fucking ménage she would still remember into her next life if she kept this shit up. She had no sense of decorum and had shown him zero respect each time he showed up at Jesse’s office.</p><p>She stung him with that viperous tongue of hers, smirked every chance she had and showed in a hundred different ways that she expected him to grovel at the perfection of her tiny feet. Son of a bitch. For a taste of that sweet little body he just might do it, too, and that was what really rankled. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You still breathing?” Her tart question came over the instant message with a soft ring.</p><p>“Yeah, just wondering what the connection was between the ménage and the margarita,” he typed in, damning himself a thousand different ways. He was insane to have demanded her as his personal assistant. He had lost his ever lovin’ mind.</p><p>“No connection.” He paused at her answer, frowning. Jaded always had a reason for damned near everything she said. Unless she was unhappy. Unless she was lonely. He had learned that over the past year. Had made it his business to learn everything he could about her.</p><p>“You okay, Jaded?” He really shouldn’t care, but he did.</p><p>“Oh yes, I’m fine.” Her words rang hollow, even through the impersonal communication box. “Maybe I’ll go shopping tomorrow. I hear there’s a sale on shoes...”</p><p>“Uh oh. Poor cows, sacrificing their lives to support your addiction.” He shook his head, yet still he worried. She wasn’t acting normal.</p><p>“Cows, alligators, whatever.” Nope, that wasn’t his Jaded.</p><p>“Hey babe, you can talk to me, you know.” He needed her to.</p><p>There was a long silence.</p><p>“She’s my friend.” The words finally came through with a sense of sadness. “I can’t believe she has such horrid taste in men.”</p><p>“Yeah?” He didn’t even pretend to understand that one.</p><p>“I love her like a sister.” She had to be talking about Terrie.</p><p>He waited to see what else she said.</p><p>“I can’t believe she actually fucked Lucifer! Was she insane? Has she lost her mind? The man is an outcast. He has no style. No class, and I doubt he has a cock over five inches long. He probably only needs a finger or two to jack off with.”</p><p>He sat back slowly in his chair. His cock, all five inches and several more, pulsed in outrage. His eyes narrowed.</p><p>“The man scowls. He sneers. Stomps around like a bull in a china shop. He is such a bore. Geez. I need a new job.”</p><p>His fists clenched, his teeth ground together as he saw red. The viperous little witch. A bull in a china shop? Five-inch cock? Five-inch cock?? Ohh, he would show her a hell of a lot fucking more than five inches. Damn her. The woman had a bite that would do a rabid dog proud.</p><p>“If you quit, just think of all the shoes that would cry.” It was lame. Real lame, but he’d be damned if he could type his outrage to her over the Internet. She would probably save the fucking message to show all her chat room buddies. He sneered. Oh, was she in for a surprise.</p><p>“Well, this is true. But I’m definitely looking.”</p><p>He stilled. Looking, was she? He’d see about that one.</p><p>“Well, good luck darlin’. Now I’m off. Hot date tonight.”</p><p>Nothing came back for long moments.</p> <p>“All right. Goodnight.”</p><p>“Night, darlin’. Cheer up, maybe you’ll get lucky and he’ll at least have more than five inches.” He growled.</p><p>“As though that can help him.” He could almost hear the haughty vibration of the words. “Where oh where have all the alphas gone? Your mothers must have breast-fed you overly long.”</p><p>“Or yours fed you venom and spice rather than sweet milk,” he typed back furiously. And he meant it.</p><p>“LOL. Good one, Wicked. Have fun for me while you’re out. Talk to you later.”</p><p>He clicked the box away. He shut down the program, damn near shaking with rage and arousal. He came to his feet, pushing his fingers ruthlessly through his hair as he clenched his teeth against his anger. Damn her. Lucifer, was he? Five inches, was he? He snarled as he stomped through the house, jerking the leather jacket from the staircase post as he headed for the door.</p><p>Miss Jaded Tally was in for one hell of a surprise. </p> </body></html>"]