["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>In the course of space colonization, there arose a need for humans with enhanced abilities - men and women who could survive harsh conditions, who were superb warriors, gifted hunters, and brilliant scientists.</p><p>Some enhancements were technological in nature: an array of implants with various functions. Their effect ended with the death of the person who carried them.</p><p>Other improvements were biological and these enhanced capabilities persisted, lingering in the bloodline, changing and mutating into new abilities in the offspring of the original carrier. It was quickly realized that the advantage of these biological enhancements lay in their exclusivity.</p> <p>Thus, the biologically enhanced united and shut down all further biological modification.</p><p>Collectively known as kinsmen , these exceptional beings gave rise to several dozen families, which now form the financial elite of the colonized planets. The kinsmen strictly control their numbers and their loyalty to their families is absolute. Like the Sicilian mafia families and feuding Corsican clans of the old planet, the kinsmen exist in constant competition with each other. It is this competition that rules the economy, begins and ends wars, and drags human civilization to greater technological and scientific progress.</p><p>Kinsmen with the ability to telepathically attack the minds of others are called psychers.</p><p>Chapter One</p><p>Claire awoke early. Her grey ceiling hung like a bleak shroud above. She looked at it, trying to gather enough will power to leave the bed.</p> <p>A digital screen flared into life on the wal , presenting her with a digital clock. A female voice with a flat, computer-generated intonation announced, \"Good morning. You have thirty minutes until scheduled departure to work, Captain Shannon.\"</p><p>She stared at the ceiling.</p><p>\"Twenty-nine minutes. You are now one minute behind schedule.\"</p><p>\"Twenty-eight minutes. You are now two...\"</p><p>\"Dismissed,\" Claire said.</p><p>The screen died. She sat up and pushed off the bed.</p> <p>Around her, the apartment offered a dreary monochromatic palette: grey wal s, dark floor, paler ceiling. No splash of color interrupted the drabness.</p><p>She walked to the window. The shutter's photosensor detected her presence, and the thick panels of grey plastic slid aside. She was on the fortieth floor. Buildings rose around her, half-a-kilometer-tal rectangular boxes, separated by deep grim canyons of narrow streets. Above the city, the smog-smothered sky sifted chemical rain. The rainwater wet the sides of the uniform skyscrapers, bleaching long drip-trails in the concrete.</p><p>Her quarters were in the barracks of Intel igence Building 214. The apartment where she grew up with her mother was located ten blocks east. Looking out of her window, she could tel no difference between her the view from her current rooms and that apartment. Even the bleach patterns seemed the same.</p><p>If she were to leave the city, which was practical y impossible, she would find a barren rocky plain. The planet of Uley had only two relatively smal land masses, neither of them inviting. The Eastern Continent was colonized three hundred and twenty seven years ago by the Melko Corporation. Three years later the Brodwyn Mining Consortium landed on the Western Continent. Melko voiced their claim to the entire planet and demanded that all Brodwyn colonization efforts cease immediately.</p><p>Brodwyn declined to comply.</p><p>Both conglomerates began rapid exploitation of natural resources in an effort to achieve industrial and military superiority. Every industry on either continent was designed to serve the arms race. Forty years before she was born, the hostilities exploded into an open conflict: Melko against Brodwyn, Native against Invader.</p><p>She was a Brodwyn retainer, an \"evil invader,\" if the propaganda of the Melko group was to be believed. She could've just as well have been born a \"greedy native\" on the opposite side of the planet. It would have made absolutely no difference to her life. The war had dragged on for so long, with both sides claiming they were winning and trying to demoralize the other, that whatever personal victories she had achieved seemed completely meaningless.</p><p>Claire stared down to the hazy street below. If she opened the window and jumped, she would fal for about ten seconds before splattering on the pavement.</p> <p>If she jumped.</p><p>To end one's own life was the most unnatural urge, but standing there by the window, she couldn't real y muster any anxiety about it. She simply didn't care one way or the other.</p><p>\"You have fifteen minutes until scheduled departure...\"</p><p>\"Dismissed.\"</p><p>Claire stripped and stepped into the shower. The lukewarm water washed over her. She pushed the knob all the way to HOT, but the water remained mildly warm. Heat, like all other resources, had to be conserved. They were at war.</p><p>They had been at war for the last sixty-eight years. War everlasting.</p><p>She stepped out of the shower, toweled off her hair, and put on her undergarments and her grey Intel igence uniform with black captain stripes on the left shoulder.</p><p>\"You have one minute until scheduled departure...\"</p><p>She stepped into the hal way. The door hissed closed behind her. She took the elevator to the seventh floor, to the mess hal . It was half ful , as always, and she scanned it with her mind out of habit. People moved aside for her, an automatic privilege of rank afforded to her captain stripes painted in black. Most had inert minds. A few with a painted in black. Most had inert minds. A few with a predisposition to psycher activity had thoughts that luminesced slightly, and to the right, at the usual table, four soldiers of her unit glowed. She shut down the mind vision, picked up her tray with a mound of nutrient paste on it, took her vitamin-enriched water, and went to join them.</p><p>The psychers stood at attention at her approach.</p><p>\"At ease.\"</p><p>They sat, as she took her usual spot. Nobody smiled.</p><p>They were at war, after all , and extreme expression of emotion was frowned on, just as bright color, loud noise, and leisure. If they did smile, someone would come up and ask, \"Why are you smiling? Don't you know we're at war?\"</p><p>She didn't examine their minds out of courtesy but she'd learned to read their faces, and she noted the smal signs of relaxation: the softening of Nicholas' lips; the way Masha held her spoon, picking at the paste; Dwight's easy pose; Liz's nails, sheathed in transparent coating...</p><p>manicured nails. Something new.</p><p>\"Good morning, Captain,\" Liz murmured. Slight, with thin blond hair cut short, she seemed washed out, her skin nearly transparent, her hair almost colorless.</p><p>Claire envied her. Of the five of them, Liz was the youngest, barely seventeen. She stil had some impulse, some spark of life. She'd joined the unit last year, and since then keeping her alive during the missions proved to be a ful -time job. It was a job the rest of them shared, but Claire shouldered the lion's share of it.</p><p>Liz's brain activity spiked, her thought tentatively brushing against Claire's mind. Claire accepted the communication, opening the link between them.</p><p>\"I was wondering if I could get a plant,\" Liz said. \"For my room. I was wondering if you knew where I could get one.\"</p><p>\"It will be confiscated,\" Claire responded.</p><p>\"Why?\"</p><p>\"Because a plant requires nutrients, light, and water.</p><p>It will be tagged as inappropriate expenditure of resources.\"</p><p>The younger woman recoiled.</p><p>\"I'm sorry,\" Claire told her aloud.</p><p>Liz ducked her head. \"Thank you, Captain.\"</p><p>A vague feeling of alarm tugged on Claire. The other psychers sensed it as well and the five of them turned in unison toward the incoming threat.</p><p>Major Courtney Rome was making his way through the mess hal toward them. His psych-blocker implant was on, smudging his mind. Smudging but not obscuring. No psych blocker could lock out a psycher of her level completely.</p><p>Her team's minds dimmed around her, as her soldiers snapped their mental shields in place. Courtney couldn't read their minds: they simply reacted to a perceived threat on instinct.</p><p>Courtney halted a few feet from them. She liked cal ing him by his first name in her mind. If he ever found it, he would take it as an insult, which it was. Trim and middle-aged, Courtney wore a flat expression. She looked past the blocker into his brain and saw anxiety churning. He came to deliver unpleasant news. He never brought any other kind.</p><p>She rose and the rest of her team stood up.</p><p>\"Captain Shannon, join me for a private consultation.\"</p><p>She fol owed him to one of the booths lining the wal .</p><p>They sat. A transparent disruptor wal slid from the slit in the wal , sealing the booth from the rest of the dining hal with a sound-proof translucent barrier.</p><p>\"Your latest psychological evaluation showed abnormalities.\" Courtney said. \"We are no longer confident that you are giving your all to the war effort.\"</p><p>\"Has my performance been lacking?\" she asked.</p><p>\"No. Your performance is exemplary. That's why we're having this conversation.\"</p><p>Claire saw it in his mind: Courtney believed she should be decommissioned, but she was too valuable. Kinsmen like her, with psychic power, came along about one in every six mil ion, and the decision to keep her breathing was made above his pay grade. She could crush his mind like a bug, psych blocker or no.</p><p>Claire leaned back, putting one leg over another.</p><p>\"When we're done here,\" she said, not sure what possessed her to continue speaking, \"you will return to your office where you will read reports and push pseudo paper.</p><p>It's your job. I will go to my job, where I'll have to murder people.\"</p><p>Courtney studied her. \"They are the enemy.\"</p><p>\"These people I kil , they have children, loved ones, parents. Each of them exists within a network of human emotion. They love, they are loved, they worry. When I sear their minds, all of that ends. They have no choice about engaging in a fight with me, just as I have no choice in being here. For doing this, I am praised and rewarded.\"</p><p>\"Your point?\"</p><p>\"There is something wrong with a system that glorifies a person for the kil ing of other human beings.\"</p><p>\"They will kil you if you don't kil them first. They won't hesitate.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She sighed. \"What are we fighting for, Major?\"</p><p>\"We're fighting for the control of the planet. The winner will get to keep Uley, of course.\"</p><p>\"Have you looked outside, Major? I mean real y looked? Keeping Uley isn't a victory; it's a punishment.\"</p> <p>Courtney leaned on the table. \"I've been doing this a long time, Captain. You are not the first to crack - you won't be the last. Not everyone has the resolve to keep up the fight. But you can be sure that when your time comes, you won't simply be decommissioned. If I were you, I'd keep it together as long as possible, because I am always watching and when you stumble, I will be there.\"</p><p>She had gone too far to care about a threat. \"I was taken from my mother when I was fourteen years old,\" she told him. \"She was sick when I left. I wasn't all owed to look after her. The Building Association had to take care of her.\"</p><p>\"That's what the Building Associations are for,\"</p><p>Courtney said. \"They're there to shoulder the responsibility for the residents of the building, so people like us can fight.</p><p>Everyone must do their part.\"</p> <p>\"My mother died when I was twenty-two. In those eight years I was permitted to see her three times. There is a child sitting at the psycher table now, Major. She was taken away from the family when she was twelve. It's getting worse. When will it end?\"</p><p>\"When Melko surrenders.\" He slid a datacard across the table. \"Your mission for today, Captain. Penetrate the secure block of the Melko bionet, burn the data, and get out with your minds intact. Brodwyn expended too many resources on your training to lose you.\"</p><p>Claire Shannon dashed through the woods. Tal trees thrust to the distant skies on both sides of her. Their dark limbs scratched at each other, their jagged branches thrusting out like talons ready for the kil . Behind her, the team sprinted, single-file. Lean, furry, they surged through the woods on all fours, their clawed paws digging into the forest floor as they ran. She saw them as beasts with glowing eyes. No doubt they saw themselves as something else.</p><p>Many years ago the need for faster data processing forced larger corporations and governments to implement biological computer systems that seamlessly integrated with the inorganic computers. It was discovered that only psychers could connect directly to the bionet and that the connection overwhelmed their minds. The human brain couldn't cope with the tremendous influx of information, and it deluded itself by turning code and synthetic neurosignals into a dream, interpreting the streaming data as a familiar environment, knitted from the individual psycher's memories and imagination.</p><p>Every psycher perceived the bionet differently. For Nicholas it was hel with molten lava and fire-belching dragons; for Liz it was a mountain pass strewn with snow, where avalanches and snow creatures waited on every turn.</p><p>Claire saw a forest. Code became trees, secure data turned into fortified castles, and enemy psychers turned into monsters. If it looked scary, it was a threat.</p> <p>A hint of movement made her spin in mid-step. A large red-eyed bird with wicked dinosaur jaws instead of a beak raised its wings, preparing to dive at her from a tree branch.</p><p>Claire leaped.</p><p>The bird swooped down, talons out, teeth-studded jaws opened wide. Claire turned her head, throwing her body right. The jaws missed her by a fraction of an inch.</p><p>Her silvery fangs closed on the bird's long neck, piercing flesh. The pressure of her jaws crushed the vertebrae, the synthetic neurosignals conjuring the taste of blood in her mouth. They dropped to the ground, the bird flailing under her.</p><p>The rest of the team dashed past them.</p><p>Claire planted a clawed paw on the bird's head and ripped, tearing the neck in two.</p><p>The bird stopped moving.</p><p>Threat neutralized. An enemy psycher was dead.</p> <p>Claire sprinted after the line of beasts, caught up, and sped by them, resuming her place at the head of the pack.</p><p>She always took the point. She was the strongest psycher and it was her duty as an officer to protect the rest of her team.</p><p>The bird's dimming eyes lingered in her memory. She had terminated a human mind. She would have to kil others before the mission ended. She would do it today to keep Liz and the rest alive, but eventual y the Intel igence would send her on a solo mission, and she wasn't sure what the outcome of it would be.</p><p>Claire scanned her environment. The woods before them were clear. Deserted. Anxiety pul ed at her mind.</p><p>Where were the enemy psychers? She had just kil ed one -</p><p>usual y that meant a concentrated assault. The branches should be teeming with them.</p><p>She twisted to glance back. Only one beast fol owed her - Nicholas, his coat a pale grey. He took another step and exploded into a hundred tiny dark ribbons, melting into nothing.</p><p>The shock punched her.</p><p>Claire shot out of the bionet and out of her chair, her vision stil a blur. A blink and she saw the room: gun-grey wal s, a long console, five chairs by it, one empty - hers, and four others supporting prone bodies, her teammates, her soldiers, each with a gaping hole in the back of the head. In the split second she saw it all : the jagged edges of the head wounds, the red blood dripping on the floor from Liz's blond hair, and Major Courtney Rome, a smoking gun in his fingers, his pale grey Intel igence uniform splattered with crimson spray and brain matter. Courtney's face was slack. His mouth drooped down. His eyes stared at her, hol ow.</p><p>She grasped his mind in a steel fist, ripping through the feeble protection of the psych blocker like it was tissue paper. He cried out and dropped the gun. She forced his brain to haul him upright, every muscle painful y rigid, his body barely balanced on his toes.</p><p>They were dead. This morning all of them had eaten a spare breakfast in the commissary. They shared coffee. Liz hid her new nails. Now they were dead. She had protected them for so long and he'd put a gun to their heads and murdered them one by one.</p><p>\"Why?\" she snarled.</p><p>\"The war is over,\" Courtney whispered. \"We lost.\"</p><p>\"What?\"</p><p>\"We lost,\" he repeated, his voice a hoarse squeak.</p><p>\"The Headquarters sent out an emergency bul etin five minutes ago. Melko is occupying our continent. The surrender security protocol was initiated. I have to terminate you. You know too much.\"</p><p>She seared his mind. Death was instant. He didn't have the time to scream.</p><p>As his lifeless body dropped to floor, Claire turned and pushed the dimmer switch on the console. The room turned dark. Her fingers flew over the keypad.</p><p>The opaque window in the wal before her faded, revealing the interior of the Intel igence compound below.</p><p>People dashed back and forth across the floor.</p><p>She pushed a key, letting the audio feed filter into the room. Gunfire punched the silence. Massive shredders whined, crunching electronics and slicing pseudopaper into atomic dust. Chaos reigned.</p><p>The war was over.</p><p>Her heart hammered in her chest. Her pulse pounded through her head, too loud in her ears. Claire stared at the four corpses in their chairs. She wanted to hug Liz and cry.</p><p>She couldn't give in to panic and shock. She had to think.</p><p>She was a Type A Psycher. An imminent threat. If Melko Corporation found her, she would be kil ed immediately. When you lost a war, you didn't get to keep your guns. She was infinitely more dangerous than a loaded gun.</p><p>Claire shut off the audio feed and dimmed the windows. She checked the door. Courtney had engaged the electronic lock. Not enough. A heavy life support unit sat in the corner, for the times when psychers suffered an attack but held on to life. She put her shoulder into it, pushed it across the doorway, barring the door from the inside, and walked past four heads dripping blood back to her seat.</p><p>She had to log into the bionet for the last time to erase herself from Brodwyn data systems.</p><p>\"Step onto the platform,\" a Melko soldier ordered.</p><p>Claire obeyed, stepping onto the raised circle in the middle of the room. Six high-caliber gun turrets swiveled on their mounts, locking onto her. To the right and left, two Melko soldiers took aim at her head. Across the room an older woman behind a crescent metal console studied the digital screen.</p><p>Three weeks ago she had escaped the Intel igence building and returned to her mother's apartment. It was vacant, like many others, and during her last foray into the Brodwyn bionet, Claire had assigned it to herself. She had resurrected her mother's data and took on her identity, keeping only her name and her date of birth intact. Only her neighbors could have betrayed her. This morning she was arrested with the rest of the residents of the building and marched down to this depot. Nobody spoke out against her.</p><p>The older woman peered at her.</p><p>\"Name?\"</p><p>\"Claire Shannon.\"</p><p>\"Occupation?\"</p><p>\"Secretary.\"</p><p>\"Do you have any implants, modification, or kinsmen abilities to declare?\"</p><p>\"No.\"</p><p>Claire's mind was hidden behind four layers of solid mental shields, enclosed in a hard outer shel , accreted over the period of the last four weeks as a result of constant mental strain. Her surface thoughts coated this shel , as if it were a mirror. Her defenses would withstand a concentrated probe from an adept. To the outside world, her mind appeared very much alive, but completely inert psychical y. Precisely the way she liked it.</p><p>\"Place your hands on the rail in front of you.\"</p><p>Claire locked her fingers on the metal rail.</p><p>Pale green light slid over her. Two dozen scanners recorded her temperature, pulse, and chemical emissions, assessed the composition of the sweat and oil on her fingertips, and probed her body for combat implants.</p><p>A cold male voice announced with robotic precision.</p><p>\"Implant scan, class A through E, negative. Biological modification negative.\"</p><p>\"Initiating psycher pressure probe,\" the woman said.</p><p>Beneath her mental core, fear washed over Claire.</p><p>Pressure Probe, PPP, meant pain to a psychic mind. The stronger the psycher, the worse the agony. She had to bear it. Her pulse couldn't speed up. She couldn't wince.</p><p>It began as a soft buzz in the back of her skul . The buzz built, ratcheting up to deafening intensity, louder, louder, LOUDER. Pain pierced her mind, as if a dril had carved through the bone, grinding, widening the hole with each rotation, turning her neurons into mess of human meat. The world dissolved in agony. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She was gone, drowning in pain. Her reason melted.</p><p>Her mind dissolved.</p><p>She gave herself away.</p> <p>It was over.</p><p>The pain vanished, suddenly, as if sliced by a knife.</p><p>\"PPP negative,\" the male voice announced.</p><p>\"Subject cleared the security evaluation,\" the woman said.</p><p>She passed. Somehow she had passed.</p> <p>The soldiers lowered their weapons.</p><p>The woman faced Claire. \"You are being deported.\"</p><p>\"I'm sorry?\"</p><p>\"We don't want your kind on our planet.\" The woman grimaced. \"You cost us bil ions and forced us into a three-hundred-year war. If things were fair, we'd line the lot of you up and put you out of your misery, except that the Interplanetary Right to Life Act gets in the way.\"</p><p>That's right, flashed in Claire's mind. She was a civilian and under the protection of the Right to Life Act. Breaking it meant instant trade embargo. For a planet like Uley that imported most of its food, it would mean a slow death sentence. The Melko retainers couldn't kil her or any of the Brodwyn civilians. They couldn't load them into spaceships and kick them off planet without a definite destination either.</p><p>\"Melko Corporation made arrangements with other planets to deport you,\" the woman said. \"In your case, you're going to Rada to some kind of flower province. It's one of the merchant planets. Many kinsmen families all competing for their territories. They are cut-throat on Rada and they're only taking the duds like you, no kinsmen all owed. I don't except you'l last there long, which is just as well. Exit through that door.\"</p> <p>Chapter Two</p><p>\"PPP Negative,\" the computer announced.</p><p>Claire held onto the rail of the platform. She was swimming up a deep well fil ed with blinding pain. Negative.</p><p>Negative. She had passed through the screening again.</p><p>Please, please let it be for the last time.</p><p>\"You may leave the platform,\" Rada's Immigration Officer invited.</p><p>She kept swimming. Almost there. Final y she surfaced and her vision returned in a rush. Claire stepped off the platform. The Immigration Officer took her measure. He was lean, dark-haired, and older, his skin either natural y olive or tanned by the sun.</p><p>\"Come on,\" he said. \"Let me give you your orientation.\"</p> <p>She fol owed him to a smal office and sat in the cream-colored chair he indicated. The officer took his place behind a light glass table. A narrow crystal vase sat on the edge of his table. Inside it flowers bloomed, whirl upon whirl of bright petals, some blood red, some yel ow, some deep purple near the root of the petal and white at its end. So vivid, almost painful.</p><p>\"Dahlias,\" the Immigration officer said.</p><p>\"I'm sorry?\"</p><p>\"The flowers. They are cal ed dahlias. You are assigned to the city of New Delphi.\" Behind him the digital screen displayed the city perched at the top of a tal plateau, its sides a sheer cliff of red rock. Elegant skyscrapers of pale white stone, buildings of glass and steel, wider houses with balconies... There was no rhyme or reason to it. Trees grew here and there, bright spots of green. Claire stared.</p><p>\"New Delphi is the commercial center of the south,\"</p><p>the officer said, \"but the city itself is located in the Province of Dahlia, hence the flowers. There are other provinces as well. Large urban centers are rare. It's mostly gardens, orchards, family estates. When you hear people speak 'of the provinces,' they are being nostalgic about a less hectic way of life.\"</p><p>The image of the city turned, presenting her with seven long platforms thrusting from the side of the cliff, one above the other, like mushroom ridges on a tree. Tunnels carved into the rock led to the Terraces probably from somewhere within the city.</p><p>\"These are the Terraces. This is where you'l find most 'provincial' style restaurants and shops. They are pricier than places in the city but you pay extra for authentic taste.</p><p>Your apartment is right here.\"</p><p>The image slid down, the buildings rol ing by. The picture zoomed in , and she saw a ten-story structure of pale yel ow stone. Balconies lined its sides.</p><p>\"The neighbors from your building are also being placed in this general area. You aren't housed together, because we want you to be assimilated into our culture as soon as possible. But you will see familiar faces. Your apartment is yours for the next three months. That's how long your probation period is. After three months, you must assume the mortgage payments, which means you must find employment.\"</p><p>The image zoomed out before she could catch any more details.</p><p>\"The city is divided into territories between kinsmen families,\" the officer continued. \"A lot of kinsmen keep private security forces, and a lot of these private soldiers have combat implants. The dominant kinsmen families have vast commercial interests and they often clash, sometimes violently, in an attempt to expand their influence.</p><p>Duels and assassination attempts are not uncommon. If you see something like that in progress, try to step to the side, out of their way.\"</p><p>\"Your people kil each other in the streets?\"</p><p>Unthinkable. How could this be all owed?</p><p>\"Sometimes. Most kinsmen are so enhanced, the fights rarely last for longer than thirty seconds. Don't worry.</p><p>They almost never injure bystanders. It would be very rude.\"</p><p>\"Rude?\" This whole planet was insane.</p><p>\"Of course. With all of the targeting implants and inborn abilities, they are so fast, you would have to actively work to get in their way. Kil ing a civilian would be sloppy and the height of bad manners. Our crime rate is low compared to equivalent cities from other planets, and aside from kinsmen settling their affairs, New Delphi's security force has very little tolerance for foolishness. Assaults are rare, crimes like theft and burglary are more frequent. When a criminal commits an il egal act in New Delphi, chances are he's committing it in a territory of some kinsmen family, who will deal with the matter accordingly. Which isn't to say you should go alone into dangerous areas of the city at night or leave your door unlocked.\"</p><p>The officer looked at the screen in front of him. \"Your first priority is finding a job. You will receive job recommendations from this office. You must fol ow these recommendations. Failure to comply will result in deportation to Uley.\"</p><p>\"So they aren't real y recommendations, are they?\"</p><p>Claire asked.</p><p>\"No. They are not.\"</p><p>\"I see.\"</p><p>\"If you fail to obtain a job after five recommendations, you will be downgraded to Class B and recommendations will no longer be provided to you. If you fail to obtain employment within your three-month probation period, you will be deported. If you engage in any criminal activity during your probation period, you will be...\"</p><p>\"...Deported?\" Deportation would mean death. Melko Corporation would kil her if she returned. They made it abundantly clear before she boarded the spacecraft.</p><p>\"We understand each other.\" The officer nodded again. \"Your first job interview is in one hour. When you walk out of this building, you will see a row of aerials. Your aerial is number 57/78. The course is already programmed into it. It will take you to your job interview and then to your apartment. Should you obtain employment, the aerial will return for you in the morning. If you like it, you may choose to assume payments for it at the end of your probation.</p><p>Here are the particulars.\" The Immigration Officer slid a data card across the table.</p><p>Claire slid it into the tablet she had been issued. The tablet's screen blinked and pale words emerged from the background:</p><p>Guardian,</p><p>Inc.: Extrasensory Security</p><p>Protocols and Biocybernetic Safety.</p><p>Her hands went cold. \"I'm not a psycher,\" she managed.</p><p>\"We know. You show no psychic activity at all.\" The Immigration officer nodded for emphasis. \"The Escana kinsmen family has all the psychers they could want. What they need is support staff with quiet brains, so they can work without interference. They have an Admin Specialist opening and you will apply for it.\" He peered at her. \"Unless there is a problem?\"</p><p>Passing PPP was one thing. PPP was simply a painful pulse generated by a computer. Walking into a building fil ed with psychers, whose job it was to find and eradicate psychically active intruders... Declining the recommendation would instantly arouse suspicion. \"No problem,\" Claire said.</p><p>\"You sure?\"</p><p>\"Yes.\" Unless one counted certain death as a problem.</p><p>\"I just didn't want to fail before I started.\"</p><p>\"Don't worry,\" the officer said. \"You will make an excel ent drone.\"</p><p>\"May I have your name?\" The dark-haired receptionist smiled from behind the counter.</p><p>\"Claire Shannon,\" Claire said. The smiles looked odd to her. The aerial had touched down in a parking lot and she had to walk two blocks to the Guardian building. In the five minutes she spent outside, she realized that people of New Delhi spent their lives baring their teeth. They smiled when they opened the door, they smiled when they bought groceries, they smiled if you accidental y happened to meet their gaze on the street. It was deeply unnerving.</p><p>\"May I ask the purpose of your visit?\" the receptionist asked. Behind her on a white stone wal , elegant pale gold letters spel ed Guardian, Inc . Under it smal er letters read: Your thoughts are safe with us.</p><p>Claire made an effort to smile back. \"I'm here to apply for the position of the Administrative Specialist.\"</p><p>A faint touch swept over Claire's mental shield. She held her smile, fighting doubts with logic. She had spent the entire two-week flight reinforcing the shel over her mind and thickening the surface layer. Her mind was well -hidden.</p><p>Too well , as the interview with the Immigration officer had proved.</p><p>\"Take the elevator to the fifteenth floor, then fol ow the hal way,\" the receptionist said. \"You will be met. Good luck!\"</p><p>\"Thank you.\"</p><p>Claire crossed the lobby to the glass elevator, her heels making quiet clicks on the pale granite floor. The presence stayed with her, hovering in the background, scanning her mind, lightly but attentively. Standard practice. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>People tended to guard themselves during live encounters, such as being questioned by receptionist. Once past a check point, the body and mind relaxed, and hidden thoughts strayed to surface. If she was guilty of anything, her relief at having made it this far would be apparent.</p><p>She had to appear normal. Most people would be slightly nervous before a job interview and Claire all owed herself some mild anxiety. Nothing out of the ordinary.</p><p>The elevator door slid open. Claire stepped inside.</p> <p>The door closed and the aerodynamic cabin accelerated upward.</p><p>Shaped like an elongated flower bud, the Guardian Building contained an inner core of offices and working spaces, up the side of which the elevator now climbed. This inner core sat within an outer shel of twisting steel beams forming a diagonal grid, the outer surface of the bud. Solar glass panels sheathed the diagonal spaces between the twisting beams, flooding the inside of the building with a warm golden light that set the polished granite floor of the enormous lobby aglow. The diagrid must've been enormously heavy, but bathed in the sunlight, it seemed ethereal, almost weightless. It was so beautiful, it felt magic.</p><p>Her memory served up the recol ection of her home world, spare boxes of skyscrapers, canyon streets, her grey apartment, the steel and worn plastic of the spartan spaceship she'd boarded two weeks ago... She couldn't decide if those memories were a nightmare or if this airy building with its bright colors and smiling people in vivid clothes was a lovely delusional dream.</p><p>Deep inside, beneath her shields, anxiety churned.</p><p>Making it to this planet had been a miracle. If her shields failed, she faced immediate deportation. She couldn't go back. Not after seeing this. Besides, if she was deported back to Uley, she'd never make it out of spaceport. There would be a death squad waiting for her at the spacecraft's door.</p> <p>Below her people moved through the lobby. The men wore formfitting black and grey, the women chose flowing dresses and bright colors. What must it be like to come to work here every day? Did they ever become immune to this beauty?</p><p>The elevator stopped. Claire sighed, loathe to leave the view behind, turned and exited into a narrow hal way, its indigo, almost black, wal s reflective like a dark mirror.</p><p>Above her, long ribbons of dark blue luminescent plastic, set on their edge, ran paral el to each other, curving and twisting like three-dimensional current of a river. The transparent floor reflected it, and as she walked down the hal way, Claire had an absurd feeling she was swimming.</p><p>The hal way opened into a wide chamber, the transparent floor replaced by grey marble. Pale blue and grey couches lined the wal s. Two men and three women sat on the couch cushions. Her shield didn't permit her to actively scan their minds, but it didn't prevent her from listening to their psychic emissions. She was open to any signal, like a satel ite dish.</p><p>The woman on the right, with purple streaks in her black hair, had a loud mind, powerful, but untrained. all her thoughts floated around her like noise above a spaceport.</p><p>An easy target. The woman on the left was more restrained, but weak. Of the three men, two were trained psychers, but both were mediocre. She had more training by the time she was fifteen. The final man showed no psychic activity at all , his mind practical y invisible. On Uley, he would be a dud.</p> <p>Here the term was drone, apparently.</p><p>A tal middle-aged woman in an artful y draped, deep red dress stepped through the arched doorway at the end of the room. She was carrying a tablet. The woman looked her over, her gaze precise like the beam of a bio scanner.</p><p>\"Claire Shannon?\"</p><p>\"Yes.\"</p><p>The woman stared at her with brown eyes. Her mind sliced through Claire's surface thoughts with a laser precision and fell short of the shel . That was the beauty of mirroring surface thoughts over the shel - nobody realized the shields were there.</p><p>\"Take this,\" the woman said, handing her the tablet.</p><p>\"There are three tests loaded on the tablet. Sit down and complete them. You will be cal ed.\"</p><p>Inwardly Claire exhaled.</p> <p>\"Rokero Grenali,\" the woman said.</p><p>The older of the men rose and approached her. They disappeared through the doorway.</p><p>Claire sat. The polished wal presented her with her own reflection: a severe grey skirt that clasped her narrow waist, a conservative pale blouse, dul brownish hair pul ed away from her face. Of the three changes of clothes she was permitted to bring, this was the best, most feminine outfit she owned. She could count on her fingers occasions when she had worn civilian clothes in the last year.</p><p>The other two women were looking at her. One wore a slick silvery business suit, the other a vivid red and orange dress. Their minds betrayed their reactions: pity tinged with superiority. They felt prettier. They were bright dahlia blossoms, and she was a drab mouse. They dismissed her.</p><p>It hurt. It hurt and stung her pride. The emotions boiled inside and bounced off her inner shields. Her face, reflected in the polished wal , was calm. The outer surface of her mind was col ected. Nothing showed except for the mild anxiety, typical to any job applicant. She had too much discipline to let any emotion seep through.</p><p>She shouldn't have been this unsettled. First the anxiety from the landing, then tests, the echoes of PPP stil humming through her skul , and now the realization that she stood out after a lifetime of being told to how important it was to perfectly fit in. She attracted too much attention. all those factors shredded her normal poise to tatters. It's the sensory overload, she told herself. It will be fine. She had over eight hundred combat missions behind her. This was just one more.</p><p>Claire slid a stylus from its holder on the side of the tablet and scanned the tests. A written and mathematical proficiency, a psychological questionnaire, and a card test.</p><p>The virtual deck contained fifty-two cards in two sets, one red, one black. Each card bore a single symbol: a circle, a triangle, a diamond, or a long narrow rectangle. The program dealt cards face down and the user had to indicate color and shape. It was the simplest of psychic tests.</p><p>She had to make sure she failed it.</p><p>\"Shannon,\" the woman cal ed.</p><p>Claire stood up and crossed the now empty hal to the woman in red. She was the last applicant of the day. Her chances of being hired had shrunk to miniscule.</p><p>\"My name is Lienne,\" the woman informed her. \"Fol ow me.\"</p><p>They crossed through another dark hal . Claire braced herself. Whoever waited for her would scour her mind. Her shields had to hold.</p><p>They entered a large room. To the left, a floor to ceiling window showed the view of the diagrid envelope, the light streaming through the solar panels now the deep honey of late afternoon. Three plush crescent-shaped couches formed a ring in the middle of the room with a cream-colored coffee table made of reflective plasti-glass in the center. Further, a crescent desk of the same material curved from the wal , on which a large screen hung, streaming some sort of data. A tal blond man stood with his back to her. He turned at their approach and Claire almost stumbled.</p><p>He had a strong, masculine face, with a square clean-shaven jaw. On Uley, blond people had a washed out, sickly look, their skin too white, their hair verging on transparent.</p><p>His skin was flawless bronze, his hair a pale, almost white gold. His broad shoulders strained the fabric of his tailored light-grey summer doublet, the outline of muscle on his chest and arms plainly visible under the thin fabric.</p><p>Everything about him, from the way he turned, graceful and perfectly balanced, to the way he held himself now, communicated health, strength, and power. He was sun-kissed, golden, overwhelming.</p><p>His dark green eyes focused on her, reflecting a sharp, perceptive intel ect. The eyes of a man who could be either very generous or completely ruthless. The man smiled, at once charming and reassuring, and she felt the power of his mind. It was like a typhoon held back, enclosed in a self-imposed cage.</p><p>It was too much. Every coping mechanism that let her make it this far col apsed. She stared with no idea how to respond.</p><p>He was larger than life.</p><p>Lienne cleared her throat.</p><p>The sound shattered her trance. Claire closed her mouth.</p><p>\"You're Claire,\" the man said, his voice resonant, communicating strength as much as his body did.</p><p>\"Yes?\" she answered, reeling from the shock.</p><p>\"My name is Venturo Escana,\" he said.</p><p>The Escana kinsman family, a distant part of her mind informed her. They owned Guardian, Inc., and Venturo Escana led the family. She was facing the god of this beautiful building.</p><p>\"This is my aunt Lienne Escana; she is my second in command. Please sit down,\" he invited her to the couch.</p><p>She sat on autopilot, smoothing her skirt over her legs.</p><p>She felt so out of place here, in this office. Venturo sat across from her. Lienne sat on the same couch as he, leaving several feet between them.</p><p>\"You're a refugee,\" he said.</p><p>She couldn't sit there, mute, and simply stare. Claire forced herself to formulate words. \"Yes.\"</p><p>\"As I understand, our planet made an arrangement with your home world. We agreed to accept a certain number of refugees in return for the use of Uley's interstel ar bases as refuel points. I understand your home world made these arrangements with a number of other planets.\"</p><p>\"That's correct,\" she said. He was keeping his mind firmly away from hers. It was an exquisitely polite gesture.</p><p>She had expected him to batter her the moment she entered the room.</p><p>\"It must've been very difficult to leave your world.\"</p><p>He had no idea. \"I've been very fortunate to arrive here.\"</p><p>\"Do you like it here?\" he asked with genuine interest.</p><p>\"It's very beautiful,\" she said. \"Very bright.\" Too bright.</p><p>Too vivid. Too many smiles. Men that were... that were...</p><p>\"We try to live life to its ful est,\" he said.</p><p>He didn't intend anything sexual by it, but inside her shields, his words triggered an image of him naked. It flashed before her, stunning in its shamelessness. She wanted to touch him.</p><p>I'm losing my mind.</p><p>\"I suppose we have to begin the interview now,\" he said, almost apologetic. \"It's important that you answer with complete honesty. Lienne and I are monitoring your thoughts. We will be able to detect a lie.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His mind touched hers, very gently. She held absolutely stil , terrified that any of her runaway emotions would break out of her shields.</p><p>\"Don't be nervous,\" he told her. \"It will be fine, I promise.\"</p><p>She concentrated on the table in front of her, crushing her sexual impulses and painting calm over her emotions.</p> <p>\"What did you do on your home world?\" he asked.</p><p>\"I was a secretary at a munitions factory,\" she lied.</p><p>\"We manufactured parts for the long range coastal guns.\" It was her cover. When asked what she did outside of the Psych Corps, she was supposed to respond with this line.</p><p>\"What made you decide to apply to become retainer of the Escana family?\" he asked.</p><p>\"It was recommended to me by the Immigration Service,\" she said, relieved to be honest. \"As a condition of my deportation, I'm required to fol ow the employment recommendation.\" Even when it's cosmic irony.</p> <p>\"Your anxiety level is rising,\" Venturo said. \"Why?\"</p><p>Claire swal owed. Complete honesty. \"I'm afraid.\"</p><p>\"What scares you?\" he asked.</p><p>\"I'm afraid I will be deported if I fail the interview.\" It was the truth.</p><p>\"As a refugee, you have five chances to obtain employment, before you will face the possibility of deportation,\" Lienne said, her voice crisp.</p><p>\"It's not a completely rational fear,\" Claire said.</p> <p>\"Why did the Immigration Service recommended Guardian, Inc. as a prospective employer?\" Venturo asked.</p><p>\"I was tested and it was determined that I have no psychic ability whatsoever. The Immigration officer said that your company prefers to employ non-psychics for its support staff to lessen the telepathic interference. He said that I would make an excel ent drone.\"</p><p>A shadow darkened Venturo's eyes. His mind shifted subtly, and she glimpsed the hint of steel will that drove it.</p><p>All of his pleasant demeanor aside, Venturo Eskala would make a terrifying enemy.</p><p>\"That's not a word we favor,\" he said.</p><p>\"My apologies.\"</p><p>\"Not your fault.\" Venturo held out his hand and Lienne put a tablet into his fingers. \"What was it you say you did?\"</p><p>He remembered perfectly well what she told him. She aligned her thoughts. \"I was an administrative assistant. I answered phones...\" She recal ed answering a phone at a desk and projected it onto the surface of her mind.</p> <p>\"...I took messages...\"</p><p>A memory of writing things down.</p><p>\"...I prepared reports...\"</p><p>Memory of sitting before a screen fil ing out a long form.</p><p>She had served as a secretary a week out of the year specifical y to be able to recal these memories if questioned.</p><p>\"You are an admin,\" Venturo said. \"Your boss is out of touch. A customer cal s. He is angry. There was a mistake in his bil . Your move.\"</p><p>\"Ask the customer to tel me in detail about the problem, taking notes along the way. Assure the customer that I will do everything in my power to resolve the issue and promise to let him know as soon as the solution is found.</p><p>Follow the company protocol to initiate an inquiry into the case.\"</p><p>\"Why not just transfer him to Bil ing?\" Venturo asked.</p><p>\"It's their mistake.\"</p><p>\"Or wait for the return of your employer,\" Lienne said.</p><p>\"An irate customer wants someone to listen to him,\"</p><p>Claire said. \"If his grievances are heard, the conflict is defused. Once I transfer him to Bil ing, I lose control of the situation. I have no way of knowing how Bil ing will treat him.</p><p>And while I will inform my employer of the situation, if the situation can be resolved without his direct involvement, why not resolve it?\"</p><p>Venturo and Lienne shared a look.</p><p>\"Your employer's wife enters your office, demanding to see him. She is visibly angry,\" Lienne said. \"Your employer is in a meeting.\"</p><p>\"Request security assistance via silent alarm.</p><p>Ascertain that no life-threatening emergency is in progress and attempt to defuse the situation. If the spouse proves uncooperative, let security escort her out.\"</p><p>\"But she is your employer's wife,\" Lienne said.</p><p>\"My job is to make sure my employer can function at a maximum capacity. The presence of his angry wife would hinder the operation of the company.\"</p><p>\"So you automatical y assume the worst and push the alarm?\" Venturo asked.</p><p>She had a feeling she wasn't giving them the answer they were looking for. \"I must anticipate what an angry spouse could do rather than what she is likely to do. She may be simply angry, or she might have a weapon in her purse. If I can convince the spouse to leave the premises peaceful y, the security would have wasted a few minutes of their time. But if the spouse becomes unreasonable or violent, and I fail to anticipate it, people might become injured.\"</p><p>\"An employee cal s you in a panic to tel you there is a fire on the floor below,\" Venturo said.</p><p>\"Alert authorities and initiate immediate evacuation,\"</p><p>Claire said.</p><p>Venturo frowned.</p><p>She scrutinized her answer, wishing she could touch his mind and try to figure out what she had done wrong. It was the obvious answer. She could think of no alternative.</p><p>Venturo leaned back, frowning. A focused thought dashed from him toward Lienne, and Claire caught it. His mind was like the beam of a lighthouse.</p><p>\"Opinion?\"</p><p>\"She would make a terrible admin,\" Lienne answered.</p><p>\"Her thought patterns are consistent with that of an executive. She accepts personal responsibility for every issue. Her answers to the questionnaire demonstrate the same thing.\"</p><p>Inwardly Claire clenched. She'd stumbled. The military conditioning final y betrayed her.</p><p>\"You're looking at the product of a seventy-year war,\"</p><p>Venturo's mind said. \"She evaluates her environment for threats and defuses them. It's a useful quality.\"</p><p>Lienne sighed mental y. \"Oh no. Ven, please don't tell me you found another lost puppy?\"</p><p>Claire studied her hands. Lost puppy...</p><p>\"What if the next firm she goes to reject her as well?</p><p>Eventually she will be deported. Have you seen the images of that place? It's hell.\"</p><p>\"I've read the coverage, too. Chemical warfare, casualties in thousands, and everyone with a drop of kinsmen blood turned into a killer. We have no way of verifying who she is or what she is capable of besides what the Immigration tells us. This is a terrible idea.\"</p><p>\"No kill nsman would have made it through the immigration screening. Her mind is completely inert.</p><p>What harm can she do? Look at it as a good deed for the day.\"</p><p>In her mind Lienne smiled. \"Are you sure you're hiring her because you're buying her hard luck story and not because she looks at you as if you're made of gold?\"</p><p>They knew. They both realized her reaction to him. It must've been so apparent, a blind man could've seen it.</p><p>How embarrassing.</p><p>\"Hire her,\" Venturo's thought communicated. \"I can make a difference in her life today and I intend to do so.\"</p><p>\"Then let me put her as one of the junior assistants.</p><p>As your admin, she would be representing the company. I mean, look at her, Venturo. She looks like a beggar. That hair... The woman obviously has never been inside a salon in her entire life...\"</p><p>Deep inside her shel Claire pictured slapping Lienne's mind. The older woman was powerful, but not powerful enough. One slap and Lienne would wake up on the floor an hour or so later, unsure how she got there.</p><p>Venturo's mind focused on his aunt. It wasn't a gesture designed to intimidate; he simply \"stared\" at her, but the force of that mental \"look\" was nearly overwhelming. Like standing in the path of an avalanche.</p><p>Mental y Lienne bowed her head. \"As you wish.\"</p><p>Venturo held his aunt in the sniper scope of his mental stare for another long second and glanced back at her.</p><p>\"Claire, how much do you know about extrasensory security?\"</p><p>\"Nothing.\" Everything.</p><p>\"Most of the computers we use are simply a col ection of mechanical parts,\" he said. \"However, certain corporations and government systems require higher level of data processing. They run on biological networks. These networks are vulnerable to psychic attacks. We provide security for these systems. If you choose to work here, you will have to sign a confidentiality agreement. You cannot discuss the nature of your work with anyone. will that be an issue for your family?\"</p><p>\"I have no family.\"</p><p>\"You do have a place to stay?\" he asked.</p><p>\"Yes. The Immigration provided me with an apartment.\"</p><p>\"Good,\" he said. \"You're hired. Lienne will take care of the details.\"</p><p>\"Thank you,\" she whispered.</p><p>\"You're welcome.\" He rose and walked away to his desk. Lienne stood up and gave her a pointed glance.</p><p>Claire fol owed her outside through the hal way into the outer office. Lienne tapped her tablet and held her hand to the slit in the recessed wal to their right. The wal spat a narrow ring of deep red into her palm.</p><p>\"Hand,\" the woman ordered.</p><p>Claire held out her hand and Lienne slid the ring on her right middle finger. \"Two weeks advance. It will be recouped gradual y from your pay. Squeeze the sides to view the balance.\" The older woman examined her critical y. \"New wardrobe. Nothing too provocative, nothing too drab. Nothing like this.\" She indicated Claire's clothes with the sweep of her hand.</p><p>It wasn't an insult, but it felt like a slap. \"Thank you,\"</p><p>Claire said.</p><p>\"You will be replacing Olemi, Venturo's personal admin. If it was up to me, I would place you in a position of lesser responsibility, but he insisted. He will see every mistake you will make and I have no doubt he will overlook some of them, because he is a kind man. But his patience isn't infinite.\" Steel laced Lienne's gaze. \"Make no mistake, Claire. If you betray our family, he will kil you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I understand.\" He would find her a surprisingly difficult target.</p><p>\"This tablet contains the work manuals that explain your duties and company procedures. Ven feels sorry for you. Going through life relying on the sympathy of strangers is no way to live. I suggest you memorize these manuals over the weekend, so you can earn your keep with something more than your sad story.\" Lienne pursed her lips. \"Do you have any questions?\"</p><p>\"Would it be a problem if I dyed my hair?\"</p><p>Lienne arched her eyebrows. \"Dictating the color of your hair would violate Employee Rights. I can tel you what clothes to wear, but clothes can be removed at the end of the work day. Hair cannot. You may dye it whatever shade you wish, although I would hope that it will be something tasteful. Working here is a privilege even for the most qualified applicants. You're been given a gift. Don't waste it.\"</p> <p>Claire slid into the seat of the aerial. She felt lost, as if her very being unraveled at the seams and the tatters of her psyche swirled around her, lifted by the breeze.</p><p>\"Destination?\" an automated male voice asked.</p><p>\"Find a salon frequented by businesswomen.\"</p><p>\"The closest location is all ure. Eighty-six percent of users provided four star or above rating. Estimated time of travel: ten minutes. Permission to book an appointment?\"</p><p>\"Book it.\"</p> <p>The aerial hummed and took to the air. Claire slumped on the seat. A lost puppy. She was Venturo Escana's rescued mongrel. The handsome golden man felt sorry for her. He knew that he stunned her and he felt pity for her. Her pride didn't just sting, it twisted in contortions. She wanted to crack her shel open, show him the ful power of her mind, and scream, \"Look at me!\"</p><p>They would throw her off planet so fast, she wouldn't have a chance to blink.</p><p>Fatigue flowed over her in a heavy wave.</p><p>She had a job. She had an apartment. No matter how bad it was, it had to be better than the concrete box on Uley.</p><p>She tapped the tablet and pul ed up the employee manual. Bionet protocols. Basic security. Data compilation.</p><p>She could do this job in her sleep. She had done it sixteen years ago - that's how all psychers started.</p> <p>She would have to make sure that she made smal insignificant mistakes to avoid cal ing attention to her sudden expertise.</p><p>\"You have reached your destination,\" the aerial announced. They landed. She stepped out of the vehicle. In front of her, a building rose, shaped like an ancient ivory hand fan, complete with lace carved in wide panes. The sign above the rectangular doorway proclaimed all ure.</p><p>Claire walked inside. The glass doors hissed open at her approach. At the receptionist desk a man with lemony yel ow hair glanced at her.</p><p>I have an appointment,\" she said.</p><p>\"Claire?\"</p><p>\"Yes.\" She could see her own reflection in the mirror behind him: pale brown hair of interminable shade, pul ed back from her face into a braid, generously streaked with premature gray and tinted with slight orange.</p><p>\"What will it be?\"</p><p>She pointed to her hair. \"Fix this.\"</p> <p>Thirty seconds later she sat in a chair. A woman approached her. \"Good afternoon, my name is Belina and what will we... oh my. Horatio?\"</p><p>A slight, effeminate man approached, wiping his hands with a towel. \"Take the braid out.\"</p><p>Belina unwound the braid and her hair fell around Claire's face in a dense wave.</p><p>\"Better already.\" Horatio leaned next to her, looking in the mirror at her reflection. \"Why is it stained with orange?\" he asked softly.</p><p>\"Chemical deposits in the water,\" she said.</p><p>\"I see. What will you let us do?\"</p><p>\"I've been hired as an admin by the Escana family,\" she said. \"You may do anything that won't get me fired.\"</p><p>Two hours later Claire looked in the mirror. The woman who looked back was about five years younger. A cloud of copper red hair fell on her shoulders in artful cascade, glinting with splashes of gold and deep red, softening her features and bringing out her grey eyes. She turned her head, and the hair moved, shimmering and light. Claire studied the woman's face. It didn't belong to her.</p><p>\"Gorgeous,\" Horatio said as she settled the bil and she smiled back at him without forcing it.</p><p>\"Where do business women shop?\" she asked him.</p><p>\"How much money do you have?\"</p><p>She squeezed the ring, checking. \"Two thousand credits.\"</p><p>He borrowed her tablet and scribbled the address with a stylus. \"Ask for Sophia. And use the shampoo I gave you. Red fades fast.\"</p><p>By the time the aerial final y landed in front of her apartment, the sky had grown dark. Claire ducked into the entrance and walked up the stairs to the fourth floor. She pressed her thumb to the keypad. The lock clicked open, and she stepped inside.</p><p>Walls of warm inviting yel ow greeted her. The floor was textured tile in a dozen shades of pale green, brown, and beige. Soft green couches waited to be sat on to her right. A curved coffee table carved from some reddish rock rested between them, and on it in a wide glass dish floated burgundy-red dahlia blossoms. Ahead, double doors framed by diaphanous curtains led to a balcony.</p><p>Claire dropped her bags.</p><p>The apartment was completely quiet. She walked across the floor to the door and slid it open. A smal balcony presented her with a view of the sunset: above her the cosmos was deep purple and far ahead, at the horizon, where the setting sun rol ed behind the distant mountains, the sky glowed with bright vivid red. Wind fanned her, bringing with it a scent of some flower she didn't know.</p><p>She sat down on the floor of the balcony, behind the trel ised rail, and cried.</p><p>Chapter Three</p><p>Claire opened her eyes. The ceiling above her was cream, painted with yel ow stripes from the rays of the morning sun filtering through the window.</p><p>She rol ed out of bed and walked out onto the balcony.</p><p>Outside New Delphi buzzed with life. In the sky, crisscrossing currents of aerials flowed one above the other, sliding toward the distant buildings of the business sector. Below a wide street led into the distance, framed by buildings in every color, shape, and size. People strol ed on the sidewalk. Claire watched a young woman leading two little girls walk down the street. Both children wore flowing white dresses and straw hats with smal flowers in the brim.</p><p>Their little sandals made loud slapping sounds on the sidewalk: flop, flop, flop. The woman stopped at a smal stal , offering buckets of fruit under a bright green awning.</p><p>The vendor offered the little girls a cup of some sort of round red berries.</p><p>Suddenly she was starving.</p><p>Claire rummaged through the new clothes she'd hung up in the closet, found a simple pale blue dress, slipped it on, and ran out the door.</p><p>The street vendor was old, his hair almost completely grey, his nose large with a bump, like a beak of some bird.</p><p>He squinted at her with dark eyes as she looked at the fruit.</p><p>\"What's this one?\" she pointed to a bulbous green fruit.</p><p>\"Pears,\" he said.</p><p>\"And this one?\" She pointed at the big sphere of yel ow blushing with red on one side.</p><p>\"Dahlia peaches.\"</p><p>Claire picked up a peach and smel ed. The delicate, sweet aroma teased her.</p><p>\"You're from Uley?\" he asked.</p><p>She nodded.</p><p>\"I've seen a few of you in the neighborhood,\" he said.</p><p>\"You're braver than most. Usual y it takes your people ten minutes to decide to talk to me.\" He pointed to boxes one by one. \"This one is sweet but firm, this one is sweet and soft, this one is tart...\"</p><p>\"One of each,\" she said and held her ring to the scanner mounted on the stal 's support.</p><p>\"We can do that.\"</p><p>The vendor took a satchel from a stack and fil ed it with fruit, sliding it careful y into the bag one by one.</p><p>A brush of a familiar mind made Claire turn. A woman approached, her dark hair pul ed back into a bun. She wore a familiar grey tunic of simple cut over the plain trousers.</p><p>Tonya Damon, Claire remembered. She lived across her mother's apartment.</p><p>Tonya saw her and halted, awkward. The look of worry in the woman's eyes stabbed at Claire. She'd seen this reaction before: she was a psycher, an officer, and a kil er and Tonya was afraid.</p><p>\"Are you here for the fruit?\" Claire asked, forcing a smile.</p><p>\"Yes. No. I was just looking.\"</p><p>Claire took the satchel from the vendor's hand and pul ed out a pear. \"Would you like to try one?\"</p><p>Tonya looked at the pear.</p><p>\"I got carried away and bought a whole bag,\" Claire said.</p><p>\"She did,\" the vendor confirmed.</p><p>Tonya swal owed.</p><p>\"I can't possibly eat it all by myself. It would be a waste.\"</p><p>She'd said the magic word. Tonya reached out for the pear and took it. \"Thank you.\"</p><p>\"You're welcome.\"</p><p>Tonya hesitated.</p><p>Claire waited, the smile in place.</p><p>\"When did you arrive?\" Tonya said final y.</p><p>\"Yesterday. You?\"</p><p>\"A week ago.\" The woman blinked. \"I found a job. I work for a chemical laboratory. That's what I did on Uley, so it worked out.\"</p><p>\"That's great,\" Claire told her. \"I found a job, too, as an admin.\"</p><p>\"That's nice.\" Tonya smiled.</p><p>What was her husband's name... \"How's Mark?\"</p><p>\"Mark died,\" Tonya said. \"Kil ed on the front line two years ago.\"</p><p>\"I'm so sorry.\"</p><p>\"That's alright. It was nice to see you.\"</p><p>\"Nice to see you as well. I live in that building over there.\" Claire nodded at the apartment. \"Fourth floor. If you need anything...\"</p><p>\"I'm down the street. I better go. Thank you for talking to me.\"</p><p>\"Thank you.\"</p><p>Tonya turned, took a few hurried steps, turned and came closer. She licked her lips, unsure, leaned closer and said, her voice barely above a whisper. \"Your hair is too bright.\"</p><p>She ducked her head and hurried on, the pear in her hand.</p><p>\"What was that all about?\" the vendor asked. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's a kindness,\" Claire said. \"She was trying to save me from embarrassment, because my hair draws attention.\"</p><p>\"Don't listen to her. I like your hair,\" the vendor said.</p><p>\"It's sunny.\"</p> <p>\"I like my hair too. Thank you for the fruit.\" She took the satchel and went to her apartment.</p><p>Claire washed the fruit, arranged it on a plastic cutting board she'd found in the kitchen and took it and a knife to the coffee table. She cut the fruit into slices, put it into a bowl and took it to the couch. She linked her tablet to the larger digital screen on the wal and pul ed up the work manuals. The Guardian procedure differed slightly from Uley's military protocols but the basic methods were the same. She'd finished with them and looked at the screen.</p><p>She stil had a lot of fruit and nothing to do.</p><p>\"Net search: Venturo Escana.\"</p><p>\"Venturo Escana,\" the AI announced in a pleasant male voice. \"Son of Haldor Madsen and Malvina Escana.</p> <p>Founder and joint owner of Guardian, Inc. Personal net worth estimated at seven mil ion credits -\"</p><p>\"No audio,\" she said. \"I want to read it.\"</p><p>The digital screen flashed, opening various news articles. She scooted deeper into the couch and reached for a piece of some green fruit shaped like an ancient hour-glass.</p><p>She sifted through press releases, financial statements, and tabloid gossip. There wasn't much.</p><p>Guardian, Inc., seemed to have a stel ar reputation. In the eight years of its existence, the firm had grown from a smal start-up to the third largest provider of the bionet security in the southern hemisphere. Its chief competitors, Apex and DDS, both had decades of experience and a lot of family capital backing them up.</p><p>The entire Escana family preferred to fly under the radar. all she found were random images of Venturo in a formal setting in a company of New Delphi Elite, usual y escorting a beautiful woman. She tried to narrow down his type. He seemed to show no preference. The only common ground between his dates consisted of expensive tastes, beauty, and superior grooming.</p> <p>Studying the New Delphi's movers and shakers proved highly educational. There was no color too bright or inappropriate for clothes or hair. She ended up laughing at the ridiculous dresses and insane shoes. It was the best time she ever had in the last decade.</p><p>A smal link popped up on the screen in the corner.</p><p>She fol owed it to an eighteen-year-old news item. \"Rumors of Engagement between de Solis and Escana.\"</p><p>Hmm. Now that was interesting, provided that de Solis owned DDS.</p><p>\"The persistent rumors of a union between de Solis and Escana kinsmen families can be put to rest. When asked for comment, Castilla de Solis debunked all speculation of the proposed engagement between herself and Venturo Escana. It seems the de Solis heiress holds the rising star of the Escana clan in low regard. Had the rumors proven true, the struggling Escana Family would have reaped great financial benefits...\"</p><p>\"Castil a de Solis, image,\" Claire said.</p><p>A picture of a woman fil ed the screen. Tal , slender, athletic, she leaned back, laughing, the bright lavender dress fal ing off her shoulders, held up seemingly by her breasts alone. Jet black hair spil ed down her back in a glossy wave.</p><p>No way to gauge her psycher capacity.</p> <p>If that was Venturo's type, she'd chosen the wrong hair color. She should've dyed her hair black.</p><p>Claire leaned back. \"Delete.\"</p><p>Castil a disappeared, replaced by an image of Venturo: golden, muscular, his green eyes sharp with intel ect. Her body tightened in response, eager for contact.</p><p>She imagined sliding her hands along those carved arms...</p><p>Claire exhaled slowly. There was no rational explanation why when she looked at him, she thought of sex. It was an involuntary response, completely at odds with her personality and training.</p><p>Sex was a means of relief. On Uley, it was an understood fact that one engaged in it, but it was rarely discussed. She had a sexual partner once. His name was Dominic. She was eighteen, he was twenty-two. She had just made lieutenant and he was in line for the captain promotion. They had three months together and in those three months she had something to look forward to when she returned to her apartment. She could stil recal the feel of his hands on her, the way he said her name, the way he felt inside her.</p><p>The Intel igence had transferred him across the city.</p><p>They had no warning. One day he was simply gone. It didn't take her long to put it together: she was a rising star and he was perceived as a distraction. He didn't try to look for her.</p><p>He didn't put up a fight. Since then, she'd kept her sexual impulses under lock and key. Masturbation brought her the same relief, and while it came with no intimacy, it didn't carry a burden of disappointment either. In her last weeks on Uley she hadn't even felt the need for it.</p><p>She looked at Venturo Escana on the screen. It was as if some vital part of her, the one that was female and craved male contact, sex, and love, had withered. Somehow this man managed to resuscitate it without doing anything at all.</p><p>And he felt nothing except pity for her. The irony made her laugh.</p><p>She would see him again on Monday. She had to make sure to not make a fool of herself.</p><p>Her supervisor was a woman three years her junior.</p><p>Her name was Renata, her hair was dark brown, her nails bright yel ow, and when she was surprised, she opened her brown eyes so wide, she looked slightly deranged.</p><p>\"How did you get through these so fast?\"</p><p>\"I'm motivated.\" Claire smiled.</p><p>Renata scrol ed through the bionet activity reports with rows of tabled data. \"Hang on, I have to find something to gripe about.\" She kept scrol ing. \"Oh. Here, look, the Radon sector heading should be in blue and you have it in grey.\"</p><p>Her fingers flew over her keyboard. \"Fix, fix, fix! Fixed.\"</p><p>Claire studied Renata out of the corner of her eye. Her mannerisms were so... carefree. Not exactly childlike but completely devoid of the somber poise common to Uley. If you had dropped Renata, the big smile, wide eyes, and purple dress in the middle of an Uley's skyscraper, people would pretend she wasn't there. They'd just refuse to see her. Maybe some well -meaning soul would walk up to her and confidential y inform her that her hair was too bright and she was making a fool of herself...</p><p>A mental tug interrupted Claire's musings. Venturo Escana, approaching fast. A walking mental firestorm of a mind behind an invisible wal of a steel will .</p><p>\"Al set.\" Renata raised her hands from the keys. \"Did you review the Sangori file?\"</p><p>\"Yes.\" Venturo's mind was coming closer.</p><p>\"And the recommendations?</p><p>\"Yes.\"</p><p>\"Good! Be ready to spit it all back at Ven when he comes by. He has a meeting with them later this afternoon and he prefers the spoken summary. But don't worry, he knows most of the file already. He just needs a refresher course.\"</p><p>He had a heightened auditory focus - his mind processed sound better than visual cues. Although for most people the theory of learning styles had long been debunked, for psychers it remained true: some were visual learners, some listened, and others had to write every scrap of information down. She'd worked with auditory psychers like that before. There was a trick to it - the combination of the correct intonation, vocabulary, and the information presented in a logical manner.</p><p>Renata's eyes widened. \"Speak of the devil.\"</p><p>Venturo had turned the corner. Claire braced herself and turned to look, slowly.</p><p>The amicable man she saw yesterday was gone. He wore a black shirt that clung to him like paint, focusing attention on every contoured muscle. A fine mesh of hair-thin fibers snaked its way through the fabric, widening into oblong scales on his chest and the larger muscles of his shoulders. He looked as if he wore armor, if armor could be flexible and formfitting. His eyes were dark, and his mind churned - something occupied his attention. He moved with a purpose, striding straight down the hal way with a kind of fierce masculine determination. People moved out of his way.</p><p>\"What is he wearing?\" Claire murmured.</p><p>\"What is he wearing?\" Claire murmured.</p><p>\"A bionet suit. When psychers log into the net, their bodies don't move at all. A human body isn't designed to be completely immobile unless it floats,\" Renata said. \"The suits start pulsing after a while, exercising the muscles and making sure lymph keeps moving.\"</p><p>A bionet suit. Claire recal ed waking up cramped up after hours in bionet and wincing as the medic massaged her limbs back into life.</p><p>\"Someone's smitten,\" Renata said.</p><p>Claire glanced at her. \"Is it that obvious?\"</p><p>\"Yes. Very.\" Renata paused. \"Claire, you do know what psychers do, don't you?\"</p><p>She needed to give a general answer. \"Provide security?\"</p><p>\"If they catch hackers on the bionet, they kil them.\"</p><p>Renata leaned closer. \"Venturo's death count is in dozens.</p><p>You can't keep doing that sort of work and not be affected.\"</p><p>You don't say.</p><p>\"He looks delicious and golden, but his head is a dark place. He was attacked in front of our building once - four people - and he drove each of them to impale themselves onto an iron fence, one by one. You don't need to tangle with that kind of mind. Trust me on this.\"</p><p>\"I understand,\" Claire said.</p><p>\"There is a reason why psychers in Guardian Inc. aren't permitted to read our minds. Sometimes a two-way connection happens and you see things in their heads.</p><p>Dark things. He's a kinsman - all they care about is power and influence. Not to mention that nothing serious could ever come from it. Psychers love other psychers.</p><p>Something about joining of the minds, and all that.\"</p><p>Venturo saw them. His steps sped up a fraction.</p><p>Renata fell silent.</p><p>Claire looked down at her tablet.</p><p>Venturo stopped by them. \"Renata, where is the new hire? The refugee?\"</p><p>Claire glanced up. Renata cleared her throat and pointed at Claire with her stylus. Venturo turned. His eyes narrowed.</p><p>For a brief, tiny second the two of them were alone in the Universe, and then he nodded. \"Love the hair. I need the summary of the Sangori file.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He turned and stalked into his office.</p><p>Renata jerked her head in the direction of his retreating back and mouthed, \"Go.\"</p><p>Claire smiled inwardly and fol owed.</p> <p>Venturo landed in his chair, his face dark, and leaned back, hands on the arm rest. The door slid shut, sealing them from the rest of the offices. Claire sat.</p><p>\"Sangori File,\" Claire began, enunciating clearly to let him tag it in his head. \"Principals: Savien Sangori, head of the family, sixty-two years old, grey hair, stocky build, tendency to lick his lips when he is nervous.\"</p><p>\"Was this in the file?\" he asked.</p><p>\"This was in the news footage which I watched this morning. It was recorded when he was interviewed last year in connection with insider trading.\"</p><p>He nodded. \"Continue.\"</p> <p>\"Maureen Sangori, wife of Savien, fifty-seven years old, dark hair, lean, Combat implant of at least B level.</p><p>Prefers knives. Quick to anger. Likes the color white: white dress, white flowers, white aerial...\"</p><p>It took her about an hour to recite the Sangori file.</p><p>Sangori Finances, the investment concern with net worth of one point two bil ion credits, had grown too large for the common computing solutions. The firm prepared to switch to bionet by launching the new incarnation of the management system that all owed their clients instant access to their portfolio. They were in desperate need of a bionet safety solution and Guardian Inc. was happy to provide them with one.</p><p>Venturo listened with his eyes closed without interruptions. There was always a chance that she miscalculated, but most psychers perceived and processed the information similarly. She had presented it the way her own mind analyzed it, except she preferred her cues to be visual.</p><p>\"End file,\" she said.</p> <p>Venturo opened his eyes.</p><p>A digital screen chimed. \"Sangori appointment in twenty minutes, Red Conference Room.\"</p><p>Ven stood up, went to the door, and paused by Renata's desk. \"Take her off routine processing.\"</p><p>\"For how long?\" Renata asked.</p><p>\"Until further notice.\" Ven started down the hal way and turned, walking backward. \"Come on.\"</p><p>Claire pointed at herself. \"Me?\"</p><p>\"Who else?\"</p><p>She caught up with him. \"Where are we going?\"</p> <p>\"To my Sangori appointment. I may need another point of view.\"</p><p>She hid a grin and fol owed him into the elevator.</p><p>Chapter Four</p><p>Claire strode down the hal way, her heels clicking lightly on the transparent floor, her tablet in her hand. She wore a pale green dress that set off her hair and her new tan. The day was winding down, and the week with it.</p><p>The hal way brought her to thirty-three twelve, a wide room nicknamed the Wheel. The Wheel consisted of a round common area from which a dozen office rooms branched in a circle. From above it looked like a flower with a circular middle and elongated petals.</p><p>People emerged from the offices at her approach.</p><p>Hands held out pseudopapers and data strips. She was a link to Ven and everyone wanted to get their bit in before the Friday rol ed to a close.</p><p>\"Earnings projections for the next twin-week!\"</p><p>\"What do you want me to do about Vinogradov case?\"</p><p>Marto asked.</p><p>\"He will look at it this afternoon,\" she replied.</p><p>\"What about Hawk Corp.?\" Liana asked.</p><p>\"Monday.\" Claire smiled.</p><p>\"Here's the Bodia summary.\"</p><p>When she made it to the lift, her hands were ful . No matter how well Venturo treated his employees and how ethical he was in keeping his mind to himself, the non-psychers never could get read of a nagging suspicion that he might be scanning their thoughts. She'd been on the receiving end of these suspicions before: people who went out of their way to avoid her, never discourteous but always cautious. It made her isolated. Psychers stuck together, because the rest of the world was rarely welcoming.</p><p>Claire turned and watched the sun shine through the solar panels, as the elevator moved upward. In the month she had spent as Venturo's assistant, she managed to become an indispensable link between him and the support staff. They saw her as safe, a buffer between them and Venturo's lethal brain. It was at once so much more than she thought she would achieve and so much less than she was capable off.</p><p>The doors whispered open, and she exited the elevator, heading for Venturo's office. It was Friday. The weekend was just around the corner.</p><p>Having two days off after the lifetime of weekend consisting of half-days on Sunday seemed like a decadent luxury. The first three weekends she slept, tried take-out from the neighboring restaurants, and watched broadcasts, soaking up information about the Province of Dahlia like a sponge. She'd final y decided she had enough understanding of the customs and planned to venture to the Terraces this weekend.</p><p>She saw him through the translucent door at the end of the hal way: he stood by his desk, his wide back to her, talking to a digital screen, the line of his shoulders tense.</p><p>Something unpleasant.</p><p>Things with Venturo had become progressively complicated. She no longer stared in stunned silence when she saw him, but as they worked together, the facets of his personality became apparent. Venturo had a fierce intel ect and relentless drive to succeed, knitted together by a kind of arrogance evolved from understanding your own power.</p><p>Venturo had definite ideas about how things had to be and he held himself to these strict standards. In the month she acted as his personal aide, she had seen him furious over a stupid mistake an employee made, yet when the same employee meekly came to the slaughter, Venturo treated him with tact and flawless politeness. On two occasions, Ven ran around the building, trying to hide from his aunt and an invitation to some family function, until Lienne lost her patience and turned her mind into a glowing beacon of light, mind-scanning the place for him, but in their interactions he would be respectful to her without fail.</p><p>It was this control that drew her in. The more she learned about him, the more she was drawn to him. That and the smal , seemingly insignificant things he did for her.</p><p>He opened the door for her. She had discovered that the drink machine in the Wheel dispensed tea in thirty different flavors, and after a hard day of work, when Ven would make his evening pilgrimage to get himself a coffee, he would bring her a cup of hot tea. He sought her opinion, and he would ask her seemingly random things. Did she have a chance to go the Botanical Gardens? Has she been to the Terraces?</p><p>He must've been something else on the bionet. She would never know. He would never see her on the bionet either.</p><p>Lucky for her, her ability to control her emotions was never in question. She was never less than professional in their interactions.</p><p>The office door slid open. Claire stepped inside.</p><p>Venturo turned. She read fury in his eyes. His mind churned and broiled. \"We're about to lose the Sangori account.\"</p><p>What? \"To whom?\" she asked.</p><p>\"De Solis Security.\"</p><p>DSS. The Guardian's biggest rival.</p><p>Claire reviewed the facts. Bionet safety consisted of two phases: the establishment and the maintenance. The establishment meant instal ation of static security mechanisms and structuring the bionet in the way that would lead an intruder into these defenses The maintenance consisted of responding to active threats. Of the two, the establishment phase was the most costly and the most labor-intensive. Because of the danger involved, the maintenance brought in a larger amount of money but required fewer man-hours.</p><p>Venturo had given Sangori a very good deal on the establishment to entice them into employing Guardian, Inc.</p><p>He had been planning to recoup his costs on the maintenance fees.</p><p>The contract had been signed. They'd been working on the establishment phase for the past three weeks and it was completed this morning. Giving it up would mean DSS would reap all of the benefits of their groundwork.</p><p>A clause in the contract gave Sangori legal means to terminate it after the establishment. The clause was standard, but in every meeting Venturo and Savien had, the head of Sangori family had asserted his intention to continue with the maintenance phase. He broke his word.</p><p>The anger in Ven's mind told her they had no legal recourse.</p><p>\"How much do we stand to lose?\" she asked.</p><p>\"Two mil ion credits,\" he said. \"It's not the money.\"</p><p>\"I don't understand,\" she said.</p><p>\"Savien Sangori doesn't have the expertise to engineer this scheme on his own. He knows money; he doesn't understand bionet. This took a psycher, someone who had looked at the amount of work involved and quoted him exact numbers prior to him ever walking into my building. DDS had conspired with him. They must've offered him monthly maintenance at a lower price if he managed to get the establishment out of me. They set us up.\"</p><p>Now she understood. \"It's about pride then.\"</p><p>He faced her. \"Yes. More, it's about business. I've been double-crossed. Suckered like a fool. I provide security. Would you want a gul ible fool to protect your data?\"</p><p>\"A psycher's gul ibility has no bearing on the destructive potential of his mind.\" She almost bit the last word. She shouldn't have said this.</p><p>Ven looked at her, his mind focusing on hers. If he looked too closely, she would be outed.</p><p>\"Forgive me,\" Claire said. \"I've been trying to read some research in my spare time. I may have misunderstood.\"</p><p>He considered it for a long second and let it go.</p><p>\"You understand perfectly,\" he said. \"But not many other people do.\"</p><p>He pul ed his doublet off the back of his chair.</p><p>\"Where are you going?\"</p><p>\"To have a conversation with Savien Sangori. I'm going to attempt to explain the facts of life to him.\"</p><p>\"Those facts being?\" she asked.</p><p>\"I make a dangerous enemy,\" he said, \"and Sangori is an old provincial family. They had never before betrayed the integrity of their family name to make a credit. I'm curious why they decided to start now.\"</p><p>\"What if he refuses to talk to you?\"</p><p>\"I'm not planning on giving him a chance to decline.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alarm dashed through her. She set her pseudopapers in the chair and plucked her tablet out from the bottom of the stack.</p><p>\"What are you doing?\" he asked.</p><p>\"I'm coming with you.\"</p> <p>\"Why?\"</p><p>\"Because you shouldn't go alone.\"</p><p>He peered at her incredulous. \"And you're planning to come as my bodyguard?\"</p><p>\"I am.\"</p><p>It would take her at least three minutes to break through the shel over her mind, bringing her to combat readiness. It would be an eternity in a psycher fight, where death was instant. Stil , she couldn't let him go alone and she didn't need to listen to his mind to realize he wouldn't take anyone he considered capable of delivering damage to watch his back. Venturo Escana, arrogant beast that he was, would consider backup beneath him.</p> <p>\"Just out of purely academic curiosity, how exactly are you planning to defend me?\" Ven asked. \"You have no weapons, no combat enhancements, and your mind is inert.</p><p>Are you planning on beating Sangori's assassins off with that tablet or were you thinking of a more theoretical approach? Should I look forward to you giving me a detailed analysis of a knife sticking out of my back? If I happen to die, will you deliver a slide point presentation describing my valor at my funeral?\"</p><p>\"Are you finished?\"</p><p>\"Possibly.\"</p><p>\"Very well.\" She raised her chin. \"I'm ready when you are.\"</p><p>\"You do realize that this is foolish?\"</p> <p>She simply looked at him, loading her gaze with as much scorn and sarcasm as she could manage.</p><p>As they were walking down the hal way, Ven leaned to her. \"Thank you.\"</p><p>\"You're welcome. I hope you don't get us kil ed.\"</p><p>\"They wouldn't dare touch you,\" he said. \"You're a noncombatant.\"</p><p>They stepped into the elevator.</p><p>\"Can you kil outside of bionet?\" she asked.</p><p>\"If the Sangori are smart, you will never have to find out,\" he said.</p><p>Ven marched into the lobby of Sangori Investments.</p> <p>Claire fol owed him, a step behind. Inside, white columns rose up, five stories tal and lit from the inside with a warm yel ow light. An ornate lacy relief of vines and flowers sheathed the columns, blocking the il umination, so the spaces between leaves and flowers glowed with white.</p><p>Delicate golden chairs sat in groups by ornate tables, so airy they might have been spun by spiders. People occupying the chairs chatted in quiet voices.</p><p>In the back of the lobby, a reception area waited, flanked by shorter columns that supported white statues of men on some sort of mounts. Bright green silk draped the reception counter, spil ing from it in pleated waves.</p><p>She had never seen so much opulence in her entire life.</p><p>Ven strode to the reception area across the polished floor inlaid with a green and gold mosaic. A man with a practiced smile greeted him.</p><p>\"Venturo Escana to see Savien Sangori,\" Ven said.</p><p>\"I'll show myself up.\"</p><p>Heads turned. Suddenly they were the focus of attention.</p><p>She felt the sharp points of psycher minds approaching from the left, where a gilded elevator slowly descended along the wal . Ven had felt them too, and moved to stand in front of her.</p><p>The elevator doors opened and Castil a de Solis walked out onto the floor. Her mind blazed like a luminescent supernova. In the split second, Claire assessed it. Castil a had power. The question was, did she have the skil to go along with it?</p><p>Behind her two men stepped out, one tal , older, with a square jaw, a walking brick. His mind glowed, not as bright as Castil a's, but strong enough. The man on his left was a leaner, faster, younger version of him, his blue-black hair fal ing in a long waterfal down his shoulders. His mind rivaled Castil a's but there was an odd brittle edge to it.</p><p>\"Venturo,\" Castil a's eyes opened wide in mock surprise.</p><p>\"Did you enjoy yourself?\" Scorn dripped from Venturo's voice.</p><p>The lean psycher's gaze met Claire's. The irises of his eyes were so light, they nearly glowed.</p><p>\"Yes. Yes, I did.\"</p><p>\"Was it worth starting a war?\"</p><p>\"Are we at war, Venturo?\" Castil a raised her eyebrows.</p><p>\"We are now.\"</p><p>\"Then I'll start with your pretty little drone.\"</p><p>The lean psycher's mind caught Claire's in a fiery hot grip. Her body locked, her spine bending under unnatural angle. Her throat constricted, cutting the oxygen flow to a mere trickle, letting in just enough air to retain consciousness. She began to dismantle the shel from within.</p><p>The lean psycher's eyes widened, puzzled.</p><p>\"She isn't screaming.\" Castil a blinked, feigning surprise. \"Do you restrain your drone often, Ven? Perhaps she likes it?\"</p><p>Venturo moved. The force of his mind shot out like a blow of an enormous club. The older man went flying across the lobby, his heavy body knocking the golden chairs into the air. Venturo spun, too fast, and then Castil a was locked in the cage of his arms, her back to his chest, his hand holding a red monomolecule blade a mil imeter away from her jugular.</p><p>\"Attacking a civilian is a new low for you,\" he said, his voice calm, almost conversational. \"Shal I tel your parents about it?\"</p><p>She trembled, rage shivering in the curl of her upper lip. \"Kil him!\"</p><p>The older man slowly picked himself up off the floor.</p><p>His nose, mouth, and eyes bled. The lean psycher stared at Ven.</p><p>\"Kill him!\"</p><p>\"They can't, dear,\" Ven told her, his lips a few centimeters from her ear. \"You can't fight me with your mind. We've tried that, remember? If your cousins attack me, they'l have to spend time breaking through my outer shield. My blade will end your life in half a second. And then I'll kil both of them, and if I don't, your father will .\"</p><p>Castil a growled, a purely animal sound suffused with helpless fury.</p><p>\"So sweet and refined,\" Ven said. \"As always, a true blossom of the Provinces.\"</p><p>\"Fuck you!\"</p><p>\"Perhaps later, if I decide to go slumming.\" Ven nodded at the lean psycher. \"Pelori, let her go. Now.\"</p><p>The hold on Claire's mind vanished. Her heels touched the ground. \"Thank you,\" she said to Ven. \"Shal I alert the authorities?\"</p><p>\"There is no need. We're finished here.\" Ven let go of Castil a and the woman shoved away from him.</p><p>\"You'l regret this,\" she snarled.</p><p>\"I had to touch you - I'm regretting it already.\"</p><p>Castil a spun and walked out of the lobby. The older man fol owed. The lean psycher lingered, looking her over, and walked away.</p><p>\"Are you alright?\" Ven asked, his mind probing hers gently, searching for damage.</p><p>\"I'm fine.\" She forced calm to flow through her outer thoughts. \"Shal we go up?\"</p><p>\"No. I've changed my mind.\" He leaned closer. \"We won't get to Sangori now. He had too much time to prepare.\" Aloud he said, \"Wil you join me for dinner instead?\"</p><p>\"Of course.\"</p><p>\"Excel ent.\"</p><p>They walked out. The moment they boarded Venturo's sleek silver aerial, the force of his mind flowed over hers, like a shield. \"Wil you let me scan your mind for injuries?\"</p><p>\"I would rather not.\"</p><p>\"Why?\"</p><p>\"We're not that close,\" she told him. \"I like to keep my thoughts private. I ask you to respect this boundary.\"</p><p>\"Very well.\" Ven punched the code into the aerial's console, pul ing his mind back. \"Where would you like to eat?\"</p><p>Claire considered it. She could tel him to take her home. In all likelihood, he simply wanted to observe her to see if her mind unraveled. But he was right here, next to her, and he was offering her an evening of his undivided attention. It wasn't in her power to turn it down.</p><p>I'm so pathetic.</p><p>If she was going to do this, she would make the best of it.</p><p>\"Somewhere private,\" she said. \"I think I've had enough excitement for today.\"</p><p>The aerial's engine hummed as they rose into the air. \"I know just the place,\" he said.</p><p>Claire had no idea that the top floors of the Guardian Building housed a garden. In this part of the structure the outer exoskeleton of plasti-steel beams sloped, forming the upper curve of the flower bud, and the space between the diagrid and the inner core of the building was only about twenty-five meters. Those twenty-five meters were occupied by a tiled deck. Ornamental shrubs and flowers formed green barriers, slicing the deck into smal private sections. Ven brought her to the larger of these sections.</p><p>Three comfortable wicker chairs with burgundy-red cushions waited in the center of the deck, each with its own side table, arranged around a large metal brazier. Past the chairs, the solar panels of the sloping diagrid had turned transparent, reacting to encroaching darkness. The sky spread before her, vast, endless, tinted with purple and blue, the stars distant points of light. Little white flowers bloomed in the flower beds, fil ing the air with a refined perfume reminiscent of peaches.</p><p>Venturo took an ornate bin behind one of the chairs, dumped a smal heap of uniform black stones out of it into the brazier and added wood chips.</p><p>\"What's this?\"</p><p>\"Charcoal.\"</p><p>\"Fossil fuels? Real y?\" How quaint.</p><p>\"It's a provincial tradition.\" He drenched the coals in some fluid and lit it with a flick of a spark stick. The coals ignited. A wave of heat washed over Claire. She smel ed smoke. It wasn't an unpleasant scent.</p><p>To their right, the glass doors opened and a smiling man came forward, fol owed by an computerized trol ey.</p><p>\"Ah. Here comes our food. Thank you, Ertez.\"</p><p>\"You're welcome. Enjoy.\"</p><p>The man departed. The top of the trol ey opened like a flower, revealing half a dozen larger dishes, each supporting long skewers threaded with vegetables and meat.</p><p>\"Pick one.\"</p><p>She puzzled over the choices and chose a skewer at random. \"This one.\"</p><p>Ven lowered the skewer into the openings cut in the rim of the brazier, picked out his own skewer, and placed it next to hers. Flames licked the meat. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Do you feel lightheaded at all ?\" he asked casual y, plucking a bottle painted with icy lace of frost from the trol ey. \"Any strange vision problems, like tiny glowing threads flying about?\"</p><p>He was trying to check if she suffered any mind lesions. Claire smiled. \"I'm fine.\"</p><p>Ven opened the bottle and poured shimmering pink liquid into two glasses. \"I'm sorry. I should have never put you into that position.\"</p> <p>Ven would have never attacked a civilian. In his mind, that sort of action was filed under It's Just Not Done. His mind-shields were down - probably so he could scan her mind at the first sign of trouble - and his emotions leaked out. He was intensely worried about her well -being.</p><p>Claire smiled.</p><p>\"Am I funny?\"</p><p>\"No.\"</p><p>\"Then why are you smiling?\"</p> <p>\"I find your customs - Dahlia customs - antiquated.</p><p>Charming, but antiquated.\"</p><p>\"We're a very violent society,\" he said, turning the skewers. \"We have to have customs and ceremonies, otherwise we'd constantly offend each other and soon none of us would be left. Some things are not done. Attacking a civilian is one of them.\"</p><p>\"Were you worried?\" She sipped the pink drink. It was sweet, tart, and refreshing, with a trace of alcohol. She realized it must be wine.</p><p>\"Yes,\" Ven said. \"I was worried. I didn't want you to be hurt because I was caught off-guard.\"</p><p>\"I wasn't worried,\" she told him.</p> <p>\"I noticed. You handled the whole situation with the poise of a seasoned kinsman.\" He laughed. \"A violent psycher paralyzes your mind, and when he lets you go, you calmly ask if you should alert the authorities. You kil me, Claire.\"</p><p>Kil . A dangerous word. \"I considered screaming in blind panic, but I didn't want to break your concentration.\"</p><p>\"Was that a joke?\"</p><p>\"Possibly.\"</p><p>He raised his glass. \"Congratulations.\"</p><p>\"Thank you.\" She grinned and drank her wine.</p><p>Ven frowned. \"I don't know what Castil a has on Sangori, but I cal ed a friend of mine in the Provinces, Celino Carvanna. The man is a financial shark, so if something is going on with Sangori, I will soon know about it.\"</p><p>Ven took a plate from the trol ey, used a fork to slide the meat and vegetables off the skewer onto it, and passed it to her. Claire took a bite. The meat tasted smoky and tender and completely delicious.</p> <p>\"This is great.\"</p><p>\"There is something about food cooked over the open flame,\" he said. \"I don't know if it's a racial memory from the time we huddled around the fire in animal skins, but there are few things as flavorful.\"</p><p>He raised his glass. She raised hers and he clinked it against hers. \"Do you like the wine?\"</p><p>\"I love it. This is my first taste.\"</p><p>\"No wine on Uley?\" he asked.</p><p>\"No. Occasional y we would be issued grain alcohol, but no wine.\" She bit the meat and chewed, savoring the taste. \"Do you and Castil a have some sort of prior history?\"</p><p>Ven sighed. \"Yes. Yes, we do. My father was an off-worlder. He came to Rada with nothing except the clothes on his back, but he was a very powerful psycher and my mother's family took him in. He became a client It's the next step up from the retainer. When you're a client, you are almost family. My father fell in love with my mother and she fell in love with him. They married. He took the Escana name, because our family had status and name recognition, while his surname meant nothing. They were both older at the time, so it was a surprise when I came along.\"</p><p>\"Were they happy you were born?\"</p><p>He nodded. \"Yes. I had a happy childhood. The money was tight, but tight by kinsmen standards. We had a nice house. During summers, we'd go to the coast to swim in the ocean. It was beautiful. Endless water, bril iant blue, as far as you can see and under the surface fish in every color.</p><p>The mountains thrust right out of the water, and I'd sit on the rocks and watch the shark dolphins play...\"</p><p>She almost said, \"You see the bionet as the ocean, don't you, Ven?\" but caught herself. Claire Shannon, the secretary, wouldn't know that.</p><p>\"My parents loved it so much, they live there now. I always wanted to live on the coast.\" Ven smiled.</p><p>\"So why don't you?\"</p><p>\"There are very few businesses on the coast. The ocean storms six months out of the year, so little shipping is done by water. The ports are mostly for tourists. Besides, most of the family is here. Our business interests are here.</p><p>My father and mother have little concern for Guardian.</p><p>Neither one of them is real y the business type. They have the ability, but not the ambition required to grow a business.\"</p><p>Ven shrugged, leaning back. His face seemed almost melancholic, and then he shook it off.</p><p>\"Anyway, back to Castil a. As I grew up, the family realized that I was their most valuable asset. I'm a stronger psycher than my father, but we had very few resources to make use of my talents. De Solis is an old family. A lot of money, a lot of connections, and decades in the bionet business. So, my parents approached the de Solis with a marriage proposal. De Solis would get a powerful psycher and Escana's financial issues would be resolved through the all iance.\"</p><p>He seemed unperturbed by the idea of his family sel ing him. \"How did you feel about it?\"</p><p>Ven drank his wine. \"Imagine that you're eighteen years old. On this world eighteen means you are a man, expected to support yourself and your family. You're the golden child; your family expects you to lift them out of misery and solve all their financial problems, and you have no idea how to do that. You have a lot of anxiety about it.</p><p>Then your father comes to you and says, 'You don't have to go to col ege and you don't have to worry about finding a job. all you have to do is marry this beautiful girl, make her happy, and work for her family business. They'l train you, they'l teach you to develop your talents, and one day you'l inherit the whole enterprise. You'l never have to worry about a thing.'\"</p><p>\"Sounds great,\" she said.</p><p>\"I was all about it,\" Ven said. \"Ask any eighteen-year-old boy and he will tel you he'd jump on the chance. And Castil a was gorgeous. She had breasts the size of grapefruits.\"</p><p>Claire blinked.</p><p>\"I'm trying to give you my eighteen-year-old perspective.\"</p><p>\"So her breasts were a large factor in your calculations?\"</p><p>\"Yes. Sex with a beautiful girl on regular basis, I wasn't going to pass that up.\" Ven shook his head with self-mocking expression.</p><p>She laughed.</p><p>Ven refil ed their glasses.</p><p>\"What happened?\" Claire asked.</p><p>\"It turns out that I knew about the negotiations, but nobody bothered to tel Castil a. She was sixteen at the time and she was a kinsmen princess: expensive clothes, pricy jewelry, endless parties... Anything daddy's money could buy, she bought. She set the scene. She had a crowd of flunkies fol owing her around, egging her on.\" Ven stirred the coals with a metal poker and set a few more skewers over the fire. \"Somehow the rumors of the possible engagement leaked and one of the tabloids cornered her.</p><p>She was at a party at the time, surrounded by her hangers-on. They asked her what she thought about the engagement.\"</p><p>He fell silent.</p><p>\"What did she say?\"</p><p>\"She said, 'Wel , of course every beggar boy wants to marry a princess, but princesses don't dream of marrying into panhandler families.'\"</p><p>Even with her minimal knowledge of Rada, Claire knew the insult to the Escana family was monumental.</p><p>\"The tabloid had her on vid, and they ran with it. Her father tried to quash it, but it was too late. The engagement was impossible after that. Castil a's parents were furious with her.\"</p><p>\"Because of the insult to you?\"</p><p>\"That, but mostly because her conduct was vulgar. It made her seem stupid and spoiled and it was unbecoming of her family name. Kinsmen mothers would play the vid for their children as a demonstration of how not to behave in public. De Solis had been above reproach and now they were deeply shamed. Her father told her, 'You think you're a princess? Let's see how you will do without my money.'</p><p>Everything stopped, all her parties, all her shopping sprees, all of it went away. Her crowd dumped her. She worked for the family company and was given just enough money to live on. To this day her spending is tightly control ed. She live on. To this day her spending is tightly control ed. She hates me. You saw her today, she was practical y frothing at the mouth.\"</p><p>\"You hate her, too.\"</p><p>Venturo stirred the coals again, the light of the fire playing on his face. \"It took me eight years to scrape together enough funds to start Guardian. I took every job I could find. I remember two months after Guardian opened, a contract fell through. We couldn't pay the power bil . We got one terminal working, because we had to log in and patrol for our monthly maintenance. We had it running off the aerial's generator. I'd drained it dead. When I think where I could've been if we had married... She set me back about fifteen years.\"</p><p>Fourteen years ago the Intel igence soldiers had led her away from her mother's apartment.</p><p>\"Do you regret it?\" Claire asked.</p><p>\"No. If I went down that road, I wouldn't be the person I'm today. I'm not indebted to anyone. I own my business, I own this building, many people feed their families because I provide them with jobs. I got there on my own. Nobody tel s me what to do.\"</p><p>\"Except Lienne.\"</p><p>Ven grinned. \"Except her. She never lets me forget that I have family obligations. The other day she actual y sent a pulse through the building looking for me. It's a kind of psycher wake-up cal .\"</p><p>Yes, I know, it gave me a headache. Claire bit her tongue.</p><p>\"Besides, I'd have to be married to Castil a.\" He grimaced.</p><p>Claire sipped her wine, feeling the pleasant heat slide down her throat. \"Why aren't you married, Ven?\"</p><p>He shrugged. \"I work. A lot. Psychers aren't exactly a commo n kinsman variant and dating non-psychers is difficult.\" His face slid into a suave expression. \"Hel o there,\" he said in a smooth bedroom voice. \"My name is Venturo Escana. I can read your mind!\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Claire laughed.</p><p>\"I can tel when you're lying and I can discover all your secrets. I'll know when you fake it in bed, I'll know when you cheat, I'll know when you spend too much. I'll know what you real y think about me. Don't you want to marry me?\"</p><p>She finished off her glass and squinted at him from above the rim. \"Would you read your wife's mind? You don't read our minds at work.\"</p> <p>\"Probably not,\" he said. \"But there is always the possibility that I could and that's enough. Your turn to tel me about yourself.\"</p><p>\"It's not that interesting,\" she said.</p><p>\"I'm interested. I'm dying to know how you ended up on that planet.\"</p><p>She sighed. \"Very well. Melko and Brodwyn are actual y large mining conglomerates. Both of them owned mining fleets and they strip-mined asteroids for years. It takes a lot of skil ed workers to run mining operations on that scale. Mining fleets always attract weird people, individuals who don't fit anywhere else, and the employees of both conglomerates had pretty varied histories.</p><p>\"Then Brodwyn scouts discovered Uley, which is basical y a mineral treasure trove covered with a thin layer of rock. The scouts came back but somehow Melko found out about the find. The official Brodwyn version is that one of the scouts was captured and Melko tortured the information out of her, but official versions are usual y untrustworthy. The Melko fleet was more mobile at the time, so they wrapped up their operation and landed on Uley, on the Eastern Continent. It took Brodwyn almost three years to untangle themselves from their trade agreements and then they landed on the Western Continent.\"</p> <p>\"And the arms race began,\" Ven said.</p><p>She nodded. \"The resources were severely limited so both Melko and Brodwyn adopted no-waste policies and encouraged population growth to build their armies. There was only one city on each continent and they looked exactly the same: picture a hive of uniform rectangular buildings about half-kilometer tal . The buildings were so large, each one was like a vil age ran by a Building Association. You would be born, live, work, and die in the same building sometimes.\"</p><p>\"It sounds bleak.\"</p><p>\"It was. On most worlds when a war breaks out, both sides have access to prior culture, to art, to pre-war luxuries such as gardens, clothes, entertainment. We didn't. Most clothes were standard issue and un-dyed. We had one solid meal a day, usual y a meat block and some sort of grain, the rest of the time we had nutrient paste.\" Claire hesitated, not sure how much to share. \"When I fourteen, I was taken away from my mother.\"</p><p>\"What do you mean, taken away?\" He refil ed her glass and emptied the rest of the wine into his.</p><p>\"It was decided that I should become a part of the military support staff, so some soldiers came and took me away from my mother. I was given new rooms in a Military building and I had to live there. My father had died years ago, and my mother was sick with Meteor Shower Virus. A lot of mining people get it - it looks like black burn marks on your skin. Nobody knows why it flares up, but the outbreaks will spark and die out on their own. The MSV is incurable. It attacks the nervous system and it's a very slow kil er. The victim becomes weaker and weaker, until they lose the ability to walk and then fade into death. all you can do is make the person comfortable.\"</p> <p>She took a swal ow of her wine.</p><p>\"Normal y a child of my age would be working and would be expected to take care of their parent, but I wasn't all owed to do that. The Building Association stepped forward. The Elder, Doreem Nagi, apparently said that nobody in his building would die a slow death alone. The Elder has the legal powers of magistrate: he can marry people, divorce them, he acts as civil judge and so when he made that decision, people listened, and the building col ectively took care of her. There were about three thousand people signed in the building, but toward the end with the war and all only about seven hundred residents remained and every day someone watched my mother and made sure that she had food, was clean, and took her pain kil ers. I owe them a debt I may never get an opportunity to repay.\"</p><p>\"I take back my sad story,\" Ven said. \"Yours is worse.\"</p><p>She shrugged. \"There isn't much more to tel . I would wake up, go to work, come home, fal asleep. I did this for fourteen years. And then suddenly the war was over. We didn't even know. They told us we were winning until the very end.\"</p><p>She sensed discomfort emanating from him. Her story affected him, but he wasn't sure how to respond without offending her. Mighty Venturo Escana, lost for words.</p><p>\"Well, that part of my life is over. Now I'm here,\" Claire said. \"Drinking pink wine and enjoying good company.</p><p>\"And eating meat cooked by a barbaric user of fossil fuels,\" Ven said.</p><p>\"I love the food here,\" she confessed. \"I don't know what most of things are, so I just order at random.\"</p> <p>\"New Delphi is the culinary capital of the South. Or it claims to be. Truth is, everyone in the Provinces is expected to learn to cook whether we like it or not.\"</p><p>\"Oh?\"</p><p>\"Oh yes. In the Provinces, if a woman is a bad cook, people make jokes.\" He leaned closer. \"Mina, Lienne's daughter? Can't cook at all. Everything she makes tastes awful.\"</p><p>Claire smiled. \"I'm sure anything I made would be awful as well. Sometimes when I taste food, my mouth feels overwhelmed. This whole planet is overwhelming: the clothes, the colors, the people...\"</p><p>He leaned toward her. \"You're the most disciplined, grounded person I know, Claire. I've never seen anyone hit the ground running the way you did. Nothing rattles you. If you had a psycher mind, you would be something else on the bionet.\"</p><p>She could tel him. He wouldn't betray her. She could \"I feel at ease with you,\" he said. \"Your mind is so calm.</p><p>Every day I deal with people whose minds are a source of constant noise. When we work together, I can final y relax.\"</p><p>She almost screamed in frustration.</p><p>\"You understand the way I think. I want you to know that I value that greatly. I promise, I won't put you into a harm's way again. It took courage to handle it the way you've done.</p><p>You stood by me. Not many employees would in your place.</p><p>I won't ever forget that.\"</p><p>Employee... That's what she was, an employee. She shouldn't have deluded herself.</p><p>\"Did I say something unpleasant?\" he asked.</p><p>\"Not at all. I just realized it's late. I should be getting home.\" He would never see her anything else. She was Claire with a quiet mind. That was her value to him. She had mistaken his friendliness and concern for something deeper.</p><p>\"I'll walk you to the ground floor.\"</p><p>She rose. \"It's alright. I know the way.\"</p><p>Ven got up. \"Let me walk you down.\"</p><p>She turned and looked at him, keeping her voice flat.</p><p>\"It's not necessary. Thank you for the meal.\"</p><p>Claire turned and walked away.</p><p>Chapter Five</p><p>\"One blue pepper, cut into strips,\" the Artificial Intel igence announced.</p><p>Claire surveyed the smal heap of ingredients on her kitchen island. \"Define blue pepper.\"</p><p>\"Blue pepper: pungent fruit of a Moloccy species rich in lycopene and Vitamin C. Flavor: sweet, slightly bitter.</p><p>Appearance: dark blue, cylindrical shape tapering toward the tip.\"</p><p>The picture of a blue pepper ignited on the kitchen's digital screen. Claire plucked the pepper from the bunch and placed it on her cutting board. \"Demonstrate.\"</p><p>The AI opened a frame showing a woman deftly chopping the pepper into five mil imeter wide rings.</p><p>Claire watched it for a few seconds, picked up the knife, and chopped the pepper.</p><p>It was Saturday morning and she had woken up with a sudden need to prove to herself that she could cook.</p><p>Immigration had ful y stocked her refrigerator with raw ingredients, so she set them out on the counter and had the AI run a comprehensive analysis finding a combination that would result in a beginner-level recipe.</p><p>\"One peeled compa, cut into strips.\"</p><p>\"Define compa.\"</p><p>\"Compa: fleshy fruit of Karlovskaya species, rich in Vitamin A. Flavor: sour, with sweet aftertaste. Appearance: red tetrahedron with rounded corners.\"</p><p>Claire picked out a rough pyramid-looking red fruit.</p><p>\"Demonstrate peeling.\"</p><p>The woman on the screen scraped the compa with some sort of implement that did not look like a knife. Claire pul ed open the kitchen drawers, rummaging through until she found a similar looking tool.</p><p>A soft chime rang through her apartment.</p><p>\"You have visitors,\" the AI announced dutiful y.</p><p>Venturo. Her heart hammered. Her mouth went dry.</p><p>\"Visual,\" she said.</p><p>The screen ignited. Claire's heart sank. Tonya stood at the door, accompanied by an old man and another that looked in his early forties.</p><p>She clenched her teeth, furious with herself. This obsession with Ven had to end. It was turning her into an nervous wreck, catapulting her from one emotional extreme to the next. Enough was enough. Claire exhaled, finding calm.</p><p>\"Open,\" she said.</p><p>The door swung open, and Tonya and the man in his forties bowed, letting the older one through the door first.</p><p>Claire wiped her hands on the kitchen towel and walked up to greet them.</p><p>The older man examined her, taking her measure. Age whitened his hair, and he walked leaning on a cane, by the eyes that looked at her from under the thick eyebrows remained sharp. He was carrying a satchel. The other man hovered protectively over him. She didn't recognize either of them.</p><p>Tonya approached. \"Retainer Shannon, we are sorry to cal on you so early in the morning, but our need is great.</p><p>This is Doreem Nagi, our Building Elder, and Charles Monn.\"</p><p>Claire inclined her head, touching her forehead in a sign of respect. \"Thank you for looking after my mother.\"</p><p>Doreem nodded to her.</p><p>\"We seek your help,\" Tonya said.</p><p>\"Please sit down.\" Claire led them to the couches.</p><p>Everyone took a seat. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Charles reached into his shirt and pul ed out a smal tablet. On it an image of a blond teenage boy glowed. The boy's face wore the familiar Uley expression: a flat mask, betraying nothing.</p><p>\"This is Edu,\" Charles said. \"He's fourteen.\"</p><p>The image slid, turning into a portrait of a teenage girl.</p> <p>\"Lada.\"</p><p>Another image, another child. \"Karim.\"</p><p>\"They are children from our building, refugees like us,\"</p><p>Tonya said.</p><p>\"They got into a fight at school,\" Charles said. \"With some local kids. One of the local boys involved claimed that his dagger was stolen in the commotion. The dagger was found on the boy's desk the next day with a broken blade.</p> <p>The dagger is a family heirloom. The school is will ing to overlook the fight, but the child's family is upset.\"</p><p>\"The security forces took the dagger,\" Tonya added.</p><p>\"For trace testing.\"</p><p>\"The children were questioned,\" Charles said. \"None of the three is admitting to theft and neither are they denying it. They aren't speaking to authorities.\"</p><p>It was a familiar tactic: when in trouble, say nothing. \"I see.\"</p><p>\"If traces of their DNA are found on the dagger, they will be charged with theft and destruction of property. The charge violates their probation. The children will be taken from their families and deported,\" Charles said.</p> <p>\"Did they steal the dagger?\" Claire asked.</p><p>\"Yes,\" Doreem said. \"Edu took it to punish the other child. Edu is my grandson. Karim and Lada helped.\"</p><p>\"I see.\"</p><p>\"We've offered to make reparation to the boy's family,\"</p><p>Charles said. \"In exchange for dropping the inquest. They declined.\"</p><p>\"We ask you to...\" Tonya fell silent and glanced at Charles. They looked at their hands, uncomfortable.</p><p>\"We need your help,\" he said. \"The results of the testing must be negative.\"</p><p>\"You want me to log into the bionet and alter the trace analysis?\"</p> <p>\"Yes.\" Tonya exhaled.</p><p>Claire leaned back. The Security Forces Database would be under a layered protection protocol of at least level three or higher. Cutting into it would be a nightmare.</p><p>\"You are asking me to break into a security instal ation.</p><p>It will be very well protected. There are defenses to be overcome. The precise manipulation of data will require time. It's a lot harder to alter data than to erase it.\"</p><p>\"We've col ected credits,\" Charles said. \"From the families. We will gladly pay -\"</p><p>He saw the look on her face and clamped his mouth shut.</p><p>\"We have insulted you,\" Doreem said. His sharp eyes stabbed at her. \"We ask forgiveness.\"</p><p>\"Apologies,\" Charles bowed his head.</p><p>They thought that because she had left the building, she wouldn't understand. They thought she only cared about money. She understood. Every refugee from the building had conspired to save the children. That's what a community did in times of trouble.</p><p>\"Please continue,\" Charles asked.</p><p>\"Think of the data as being guarded by a pack of dogs,\" Claire said. \"The AI defenses. If the pack sees me, they will attack and bark all together, making a lot of noise.</p><p>This noise will bring men with guns, the actual psychers. To be able to do what you ask me to do, I will need help. I will need decoys that will draw the pack away from me.\"</p><p>\"We have people,\" Charles said. \"They are not combat-grade, but they can move through the bionet.\"</p><p>\"They are utility repair people.\" Tonya said. \"They used to check the bionet instal ations for the failing sectors.\"</p><p>Low-level psychers, with the mental talent too slight to be affected by the PPP. She'd encountered their type on the bionet before: they could move through it but they had never fought on it.</p><p>Claire sighed. \"If we're discovered, every person involved will be deported. The children may survive. We will not. Melko will murder all of us.\"</p><p>\"We understand,\" Charles said. \"I'm one of those who will be going in with you. We can't do anything more than run, but we'l risk ourselves for the children. We will do everything we can to help you. If you choose to do this.\"</p><p>In her mind Claire was back in her mother's apartment, sitting by the bed, holding her mother's hand. The medic had given her less than twenty-four hours, and Intel igence permitted her this last visitation. She remembered everything in crystal clear detail. The dark spray of black marks on her mother's face. The smile on her mother's lips.</p><p>Her mother's hair, clean and braided away from her face.</p><p>Her mother's voice. \"I'm content, sweetheart. I'm tired, and it's time to go. Don't cry. I didn't suffer. They say the passing will be peaceful.\"</p><p>Logging into bionet meant risking everything. Her job.</p><p>Her life. Other lives she took with her.</p><p>The debt had to be repaid. If she succeeded, she would give three children another chance at life. If she failed...</p><p>She had to succeed.</p><p>\"When was the dagger taken for testing?\"</p><p>\"Last night,\" Charles answered.</p><p>\"What time last night?\"</p><p>\"At the end of the school day,\" Tonya said.</p><p>\"Take the credits you gathered and rent a large hotel room in the largest hotel you can find,\" she said. \"If asked, tel them you are having a meeting to welcome new refugees in the community. If not asked, say nothing. Pick someone who can pass for a native and have them purchase a portable liquid interface hub, Grade Five or higher. We will need the bionet cognizance units as well. If asked why, say that you are planning a game party on the bionet. We will need a medic and we will need protection for our bodies while we're logged in. Don't involve anyone who can't be trusted to stay quiet. This needs to be done tonight, before the lab personnel return to work on Monday.\"</p><p>Claire walked down the polished tile of Hotel Aldebaran's sixteenth floor hal way. Charles had chosen well - the three towers of Aldebaran catered to businessmen and families. People strol ed back and forth, parents with children heading toward the hotel's pools, tourists going out to explore the city. Nobody paid her any mind.</p><p>She approached the door marked 1672 and rapped her knuckles on the plasti-steel. It swung open and Charles let her inside. The suite's main room was wide and devoid of furniture. A three-foot tal hub sat in the middle of the room, an ornate metal pedestal in a shape of three nude women, each supporting the container of dark-grey liquid interface with her left hand and fondling herself with the right.</p><p>Claire raised her eyebrows.</p><p>\"It was on sale,\" Charles said.</p><p>Doreem sat in the lone chair in the corner. He nodded to her. To the left of him stood a young man with a strong resemblance to Karim, one of the children in trouble.</p><p>\"Kosta,\" Charles said. \"He's Karim's brother and one of your team.\"</p><p>Kosta looked barely eighteen.</p><p>\"This is Zinaida,\" Charles said, bowing slightly to an older woman with startling blue eyes. She nodded back.</p><p>\"Nonna.\" A young nervous woman with pale brown hair.</p><p>\"Saim.\" Charles pointed at a thin dark-skinned man in his early twenties.</p><p>\"Mittali.\" A young woman with very dark hair and light olive skin.</p><p>\"This is our medic.\" A blond man in his mid-thirties raised his hand from the portable medi-bot. \"Tonya will be assisting him.\"</p><p>Tonya inclined her head.</p><p>\"Thomas, Sergei, and Helen will watch over us while we're under.\"</p><p>The two men and a woman raised their hands.</p><p>They had brought everything she'd asked for. Claire took the bag off her shoulder, removed her sandals, and sat on the rug before the hub. \"Join me.\"</p><p>The five members of her team sat in a circle around the hub.</p><p>\"How many times have you connected?\" she asked.</p><p>\"Seventeen,\" Charles said.</p><p>\"Twenty-two,\" Zinaida said.</p><p>\"Eight,\" Saim said.</p><p>\"Eight also,\" Mittali added.</p><p>\"Four,\" Nonna said.</p><p>\"Twice,\" Kosta said.</p><p>\"Any connections in the hostile environment?\"</p><p>No answer. She had expected as much.</p><p>\"Bionet can be overwhelming,\" Claire said. \"However, our minds do their best to cope by transforming it into a familiar environment. Our mind interprets things for us and you must listen to your instincts. If something gives you a bad feeling, it's likely a trap. If you see a monster, it's likely an AI defense or an enemy psycher. You will see strange things on the bionet. Creatures that grow blades. Plants that shoot lightning. You must remember to trust your instincts. If something feels dangerous, it is. Be afraid and be cautious, and you will survive.\"</p><p>\"But how do we fight?\" Kosta asked.</p><p>\"You don't. I will take care of the fighting.\" Claire smiled gently. \"Your mission is different. There are two types of threats on bionet: passive and active. Passive threats are the AI defenses. They remain dormant until an intruder appears. Active threats are psychers like us, humans who patrol the bionet. They are the greatest danger. You will know them because they may look very frightening or appear out of place. For example, if you perceive bionet as a grassy plain and you see a medium-size predator running at you, it's likely an AI defense. If you see a bovine the size of a house that's sprouting tentacles and tusks, it's likely an psycher.\"</p><p>Claire paused to make sure she had their attention. \"If you see a psycher, do not engage. He will kil you. If you see one, and he gives chase, you must run away as fast as you can and disconnect as soon as you are able.</p><p>Remember, you can only disconnect within a short distance of the hub. Don't be afraid to lead a psycher to the hub. We will destroy it after the mission. Do you understand?\"</p><p>Heads nodded.</p><p>\"It's highly likely that you may see me as something terrifying as well. During the mission, I may change my shape in reaction to threats. Don't be alarmed.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Wil you grow tentacles and tusks?\" Saim asked, with a hint of humor in his eyes.</p><p>\"If I have to. We will be going into a secure sector; however, a security forces laboratory is unlikely to have an active defense. It doesn't contain any of the financial or valuable data hacker psychers usual y want, so there is no need for a psycher to actively control it. The laboratory will have passive defenses instead. There are three types.</p><p>First, the loop traps. These are bionet connections designed to lock a mind into a loop in an effort to keep it from reaching its destination. People typical y see these as quick sand, swamp, iced over water, and so on. If you are caught in a loop, do not panic. Clear your mind and imagine yourself escaping. If that doesn't work, picture fal ing through the trap and landing by the hub. That usual y initiates the expel ing protocol. You will land by the hub and will have to log off.</p> <p>\"The second type of trap is the damage events. Fal ing rocks, geysers of molten lava, mud slides, and so on.</p><p>These are the coded defenses. They will activate when triggered but they have a limited range. If you are caught in one of these, you will take damage. Sometimes severe damage. Your mind may develop lesions or become 'bruised.' You may see something that looks like a glowing worm or a tangle of luminescent threads. Sometimes the world will abruptly darken or become too bright to see the objects. If you experience visual anomalies after a damage event, you must tel me immediately. Remember that your range is shorter than mine. I can broadcast my thoughts from a large distance, which means you will hear me but I may not hear you. If you take damage and I do not respond, you must log off as soon as possible.\"</p><p>She waited for everyone to nod.</p><p>\"The third type of traps are the chasers. The chasers are the defense entities produced by the AI. They are usual y perceived as something alive: dogs, insects, sharks. The chasers will actively pursue you. If a large number of the chasers are destroyed, the AI will sound the perimeter alarm, which will bring a living psycher responsible for the security of the sector on our heads. This is something we want to avoid at all costs.\"</p><p>\"Why?\" Saim asked. \"I mean can't you just fight him or her off?\"</p> <p>\"Right now all of us are guilty of conspiring to alter data. It is a non-violent offense,\" Claire said. \"If we confront a psycher, I may have to kil her. Terminating a human mind of a Rada citizen is a death sentence for everyone in this room.\"</p><p>Sudden silence claimed the room.</p><p>Claire was the first to break it. \"This is why I need you.</p><p>Your purpose is to fol ow me until we encounter chasers. As soon as chasers find us, each of you must engage one of them and lead them away. You must scatter and take them with you to keep the AI from sounding the alarm. You don't have to fight. You just have to run and keep them occupied to let me accomplish my task without having to destroy them. Even if all you do is make circles around the hub, as long as they are fol owing you, I will be able to do everything I need to do.\"</p><p>\"How will we know when you're done and it's safe to log off?\" Charles asked.</p><p>\"You will hear a signal. If you don't hear anything or if you become lost, don't worry, I will come and get you. One more thing: don't get bitten. We'l be facing Security Force chasers. Their bite will leave a mark on your mind.</p> <p>Eventual y it will dissipate - usual y in a few weeks - but until then if you log into the bionet, anyone there with you will instantly know that you've tried to break the law. If you are unsure, now is the time to take a step back.\"</p><p>Nonna swal owed and got up. \"I'm sorry. I can't. I just can't.\"</p><p>\"It's alright,\" Claire told her. \"Nobody here will judge you. It's fine.\"</p><p>The young woman backed out of the circle and went into the other room.</p><p>\"Anyone else?\"</p><p>Nobody moved.</p><p>\"We're ready,\" Charles said.</p><p>Claire took a deep breath and began to dismantle the shel over her mind.</p> <p>Five minutes later the last vestiges of the shel crumbled in her mind. It felt unbelievable. It felt as if she had been carrying a heavy burden, and chained to it for so long, she had forgotten it was there. Now it was gone. Claire felt light, so indescribably light.... Her mind soared like a bird, stretching, touching her team's minds, establishing a link.</p><p>The five stared at her.</p><p>\"Wow,\" Kosta whispered.</p><p>Claire sent a focused thought. \"Lay down and try to relax.\"</p><p>\"I've heard that before,\" Mittali murmured.</p><p>Saim laughed nervously.</p><p>They lay on their backs, their heads toward the hub.</p><p>Tonya approached, carrying bionet cognizance units, half-bands of ornate, inert plastic, each sealed in its own transparent wrapper. Claire rose and approached Charles.</p><p>\"Are you ready?\"</p><p>He swallowed. \"Yes.\"</p><p>Claire took the first unit, tore the plastic sleeve, and pul ed it out. The steel-colored half-band had three holes: a large oval space on the left and two oblong narrow openings on the right. A thin sheet of disposable plastic sheathed the inner side of the unit. Claire peeled it off, revealing adhesive underneath, careful y positioned the unit over the right half of Charles's forehead, just above the eye, and pressed it down. The plastic adhered to the skin.</p><p>Charles clenched his teeth.</p><p>\"Relax.\" Claire dipped her fingers into the basin of liquid interface in the hub. The mix of metal and synthetic neurons nipped at her skin with sharp electric teeth.</p><p>\"Once you are in, don't move. Wait for me.\"</p><p>She pul ed the interface away from the hub. It stretched in spider-thin strands from her hand. Claire touched Charles's skin, letting the interface drip into the first opening of the unit. The dark-grey liquid fil ed the hole in the plastic, forging connections through the skin. Claire touched the left opening, letting it fil , then the right. Charles blinked. The band ensured that connections were made to the right areas of the brain. The filaments of the interface thickened, as more liquid flowed from the hub, reinforcing the connection.</p><p>Charles closed his eyes. His body straightened, aligning, and relaxed. He was in.</p><p>Claire moved on to Zinaida.</p><p>\"Am I doing it right?\" Tonya murmured.</p><p>\"You're fine,\" Claire said, feeling the prickling of the liquid interface at it fil ed the last opening in the cognizance unit. \"Thank you.\"</p><p>She closed her eyes. Darkness flowed over her, as the synthetic neurons made connections with her mind. She lunged down a dark circular tunnel, faster and faster. She had done this thousands of times over the years and she knew what awaited her on the other end - sometimes it was a bleak cliff or severe steppe, but in the past two years it had been the dark forest, uniform tree trunks and pale green leaves. green leaves.</p><p>She welcomed it. She yearned for it. She missed the chase, the thril of the battle, the infinite possibilities the bionet offered. It probably said volumes about the hypocrisy of her morals, but in this moment Claire didn't care.</p><p>Light exploded and she landed, fal ing into a practiced crouch.</p><p>The ground under her was intense, shocking green.</p><p>Bright yel ow flowers, their petals thin and long, all but glowed in the silky grass. Claire raised her head.</p><p>Jungle breathed at her. Tal grasses with blade-shaped silvery leaves surrounded dark bushes, their foliage splaying out in wide rosettes. A patch of hair-thin stalks tipped by lavender crests of petals thrust through the spaces between wide oyster-shel plants, the inside of their leaves a blinding turquoise. Massive trees, a dozen meters wide, thrust to the sky, spreading their crown so high above, looking at them made her dizzy. Vines dripped from their branches in thick ropes, bearing large blossoms with triangular petals of deepest crimson. Ferns coiled by the thick roots. Emerald green moss cushioned the bark, interrupted by bubbles of some orange-red plants and ridges of lemon-yel ow mushrooms.</p><p>Claire stared, shocked.</p><p>Creatures crouched around her, a pale blue bul with six horns; a gazel e with golden hooves and wide antlers; a fox with three tails, her bright orange fur rippling with flashes of yel ow; a flightless bird on two sturdy legs with blue and green plumage; a slick lupine beast with black fur and six legs; and a bearded ape, fast and agile, his chocolate fur legs; and a bearded ape, fast and agile, his chocolate fur stained by rings of beige.</p><p>\"Oh my god, oh my god, oh my god,\" the ape whispered and she recognized Kosta's voice.</p><p>Behind her the sound of fal ing water marked the hub: what was once a three-foot-tal metal sculpture turned into a ten-foot-tal stone fountain. Water spil ed from the top in clear sheets and fell into a mirrored basin at the feet of the three women.</p><p>Claire looked into the basin and saw herself in its depths. A giant panther stared at her. Her fur was blood-red, striped with slashes of silver. Her eyes glowed with bril iant gold. A mane of pale red streamed from the back of her head, flaring around two pairs of her long black horns that thrust up and to the sides behind the bright tuffs of her ears. Her wide paws bore black claws the size of swords.</p><p>She flicked her tail and saw it was tipped with long tuft of pale red fur, hiding a wicked black spike. Claire smiled and saw the sabers of silver fangs in her powerful mouth.</p><p>Sensory overload. She had suffered a culture shock after the planetfal . The province of Dahlia bloomed in her mind with all its colors, scents, and flavors and it reshaped the bionet. What once was a grim forest evolved into a lush jungle.</p><p>Claire bowed her head. \"Is everyone with me?\"</p><p>Voices chorused back in agreement.</p><p>\"We go,\" she said.</p><p>They began their run through the jungle, leaping over the fal en trees and dashing past exotic flowers. She kept the pace brisk, but not tiring. They'd have to save their the pace brisk, but not tiring. They'd have to save their strength for later.</p><p>The path curled and they shot out onto a cliff. Far to the right an enormous tree rose, its branches glowing with bright purple lanterns.</p><p>\"A castle,\" Saim-Wolf whispered.</p><p>Mittali-Bird laughed. \"A spaceport!\"</p><p>\"That's where we're going,\" Claire said. \"Fol ow closely, and remember the way. You will be retracing your steps on your way back.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They fol owed the path down the side of the mountain.</p><p>Half-way down a low rumble under her paws told Claire a trap had been set off. She felt the terrestrial shock rush upward, above them.</p><p>\"Run!\"</p> <p>They dashed left and down, angling away from the slope. Above them enormous rocks shot out, spinning, and chased them down the slope. The boulders slammed into the side of the mountain with loud thuds.</p><p>\"Faster!\"</p><p>They gal oped ahead off her.</p><p>A boulder landed inches from her tail.</p><p>Zinaida-Fox stumbled and fell . A rock tumbled from above, threatening to crush her. There was no way to avoid it. Claire lunged, shielding the Fox with her shoulder and snarled. The jungle shook. The blast of sound slammed into the boulder, knocking it aside, but not far enough. It slammed into her. The impact resonated through her powerful frame. Claire turned, scooped Zinaida into her mouth, and ran.</p> <p>Five seconds later the animals col apsed on the grass on the side of the mountain, while the rocks continued to rol behind them. Claire careful y set Zinaida-Fox onto the ground.</p><p>\"Thank you,\" the older woman whispered.</p><p>Kosta-Ape rol ed on his back and laughed in labored heavy gasps. \"Let's do that again!\"</p><p>\"Why are we so tired?\" Charles-Bul breathed. \"Al this, it doesn't exist. We didn't real y run...\"</p><p>\"You've forced your brain to make connections at maximum speed,\" Claire said. \"The mind can't do this indefinitely. It becomes fatigued just as your bodies do.</p><p>Come, we have to keep moving.\"</p> <p>They continued through the jungle. Carnivorous plants snapped at their feet. Nooses disguised as vines reached for their necks. Leaves hid pits with spikes. Saim had fal en into a fissure fil ed with angry bees and Claire had to jump in after him and fry the insects with a focused mental blast.</p><p>Finally, scratched, bruised, and tired, they emerged from the jungle to the edge of another cliff, this time much lower. They lay down, hiding in the twilight behind the twisted network of roots clenching the mountain.</p><p>Directly in front of them the ground dropped down. Far, far below silvery waters of an ocean lay placid, tinted light pink and the yel ow to the left, where a golden globe of the sun set, cushioned in soft clouds. Above the clouds, the cosmos spread, vast and glorious, with bright stars melting into the glow of nebulas and distant galaxies.</p><p>To the right, past the gulf of the ocean, another cliff rose, naked rock wal topped by a lush jungle. Twin rivers spil ed from the cliff, wrapped in feathery mist. Between them the massive tree waited. The purple lanterns glowed, beckoning her.</p><p>Claire squinted. A narrow rock spire, like a finger of basalt about a hundred yards wide at the top, thrust from the water between them and the other cliff. A little to the left of their hiding place, a wide stone bridge led to the spire.</p><p>On the other side of the spire, a thick rope woven of lianas, sturdy, woody vines, stretched to the other cliff. Thick enough for her to cross, if she used her claws and paid attention.</p><p>Kosta-Ape climbed the tree to her left and leaned to her ear. \"There are mutants on the smal mountain,\" he said.</p><p>She saw them too: lean, muscled beasts with the body of a fast hound and the jaws of a crocodile. One, two, three... seven. On Uley, the warning cal to a psycher would occur if three or more were kil ed. Sometimes it only took two.</p> <p>They could've used Nonna.</p><p>Well, no use regretting what she couldn't fix. She would have to take the chance.</p><p>\"We should go now,\" Charles-Bul said. \"Remember, we're here to save the children. We do this so they can have a life.\"</p><p>The beasts murmured.</p><p>\"Thank you,\" she told them. \"Stay safe. Don't fal into the water.\"</p><p>Charles bowed his head to her.</p><p>Claire bowed back.</p><p>One by one they disappeared into the jungle. She lay by the roots of the tree and waited.</p><p>A shril screech announced Mittali. The bird ran onto the bridge, feathers fluffed out, and shook her butt at the dog beasts. The hounds snarled, showing sharp fangs.</p><p>Yellow frothy spit bubbled up on their lips. They looked rabid.</p><p>The bird shook her feathers. \"Come on! Come on!\"</p><p>A single dog peeled off from the pack and charged after her. Mittali lingered on the bridge for a long moment and dashed away. The creature gave chase.</p><p>She watched the three others grab their AI beasts one by one. Kosta was last. He scooted midway up the bridge and bounced up and down, hooting. The three remaining creatures snarled in unison.</p><p>Kosta jumped, flipping in mid-air.</p><p>Showoff.</p><p>A dog padded forward.</p><p>Kosta jumped again, oblivious.</p><p>The AI hound stalked closer. Closer.</p><p>The wicked jaws opened.</p><p>Kosta jerked back and the dog's teeth snapped together. Kosta's hand snaked out, quick, and slapped the furry muzzle. He hooted and took off, the enraged AI dog at his heels.</p><p>Young fool. Claire smiled into her whiskers and slunk into the jungle.</p><p>A narrow path led to the bridge. Claire stepped onto it and padded forward on silent paws. A moment and she emerged onto the bridge. The grey stone seemed ancient, cracked and weathered. It was only a mind trick, indicating old frayed code. She pictured the stone fracturing under her weight and wished she hadn't.</p><p>The twin dogs raised their ears.</p><p>Fal ing into the water wasn't an option. She would survive the fal , but it would take her a while to climb back up. Every moment she delayed her team ran the risk of being bitten. Time was short.</p><p>Two hounds. The question was, could they swim?</p><p>The AI creatures charged together, furry bodies flexing with coiled muscle.</p><p>She waited.</p><p>The dogs leaped together, ruby eyes burning with bloodlust.</p><p>Claire jumped. She sailed above them, landed, and whipped her tail. It slammed into the hound on the right like a battering ram. The furry body flew into the air with a startled yelp and plummeted down into the water of the ocean below. If she was lucky, it wouldn't die.</p><p>The last dog attacked. She sent it over the side with a swipe of her paw and sprinted across the rocky spire. The liana bridge waited. Claire put one foot on it, sinking the claws into the woody vine.</p><p>So narrow.</p><p>Phantom wind pressed at her, pushing at her, trying to knock her off into the water below. Claire crouched, digging her claws into the knotted lianas. She needed to redistribute her mass to reduce angular acceleration. Her body flowed, obeying her mental command. Two sets of whiskers, wide like four stiff ribbons sprouted from her shoulders, stabilizing her the way a pole stabilized the tightrope walker. She could've sprouted wings, but they would do her no good. Bionet didn't support flying. Even the birds did little more than leap and glide.</p><p>Claire ran along the liana bridge, one paw after another, claws over claws. The vines trembled under her weight. The other end of the bridge was affixed to a point slightly higher than the spire. She was crawling across and up. Coming back would be hel .</p><p>Just keep moving.</p><p>Keep moving.</p><p>The cliff was almost there. She stretched her left front paw and touched it. Solid ground. One leap... and she'd plummet down into the ocean.</p><p>Claire forced herself to slow down, careful y sliding her weight onto the damp soil of the cliff. One paw, two paws, three... and she landed. The enormous tree rose before her. She sat, studying the lanterns, her ribbons-whiskers snaking out to lick one.</p><p>\"Search: Alacasto Middle Academy.\"</p><p>The lanterns spun, sliding along the branches, as if riding an invisible carousel. A brightly shaped lantern stopped before her, the lavender flame inside glowing brightly. Claire's whiskers touched it, forging a link.</p><p>\"Laboratory traces analysis: Romulus Rekanta,</p><p>\"Laboratory traces analysis: Romulus Rekanta, 99.9959% match; Edu Nagi, 99.97890% match; Lada Miller, 98.87682% match; Karim Jahar, 96.48991% match.\"</p><p>She reshaped the data. New set of figures flowed into the lantern: Edu Nagi, 29.97890% match; Lada Miller, 28.87682% match; Karim Jahar, 16.48991% match.\"</p><p>Wiping the molecular analysis to zero would have set off the red flags, but all people swam in the same genetic pool. Anything below 70% would be marked as inconclusive.</p><p>The lantern looked exactly the same. She'd altered the data with a psycher's precision.</p><p>Claire spun the lanterns, pul ing up searches at random, confusing the access protocol until the children's lantern was safely mixed with the others. Her job was done.</p><p>Claire spun and dashed back to the vine bridge. Once again the lianas shuddered under her weight, only this time she was crawling head down. She wished there was another way back.</p><p>She was ten meters from the rock spire when she heard the bushes rustle near the base of the stone bridge.</p><p>Claire conquered the last few meters and moved onto the solid ground of the spire.</p><p>A beast shot out of the jungle and landed midway on the stone bridge. Huge paws hit the ancient stones, each as big as her head and tipped with thick triangular claws, razor sharp and glowing like backlit amber. A bronze beast rose, towering over her by at least a meter. Thick muscle slabbed his monstrous forelegs and colossal chest. His hind quarters dipped lower than his shoulders, his back legs bent slightly and bulging with steel-hard muscle. His fur was bronze, painted with faint rosettes of russet, same as the mane that trailed his spine and slid over his shoulder and down each leg almost to the paws.</p><p>The beast opened his giant mouth, snarling, showing her bril iant white fangs. His torso resembled an enormous dog, but his head was almost feline. The jaws looked powerful enough to bite through her bones like they were soft candy.</p><p>A psycher. A Grade A psycher.</p><p>Damn it all.</p><p>The beast roared, whipping his triple tail. The blast of sound hit her and Claire snarled back. Her roar rol ed, promising pain and blood.</p><p>The beast dipped his head to stare at her. She looked into his eyes and saw the familiar intel ect glaring back.</p><p>Venturo.</p><p>No. No, this couldn't be.</p><p>The beast leaped.</p><p>Claire ducked left, her instincts taking over. A clawed paw came down a hair from her shoulder and she struck with her talons , slicing the bronze fur. The triple tail whipped around, catching her flank. Pain stung her, fol owed by sharp spike of heat. Poison. Nice. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Claire shot to the side, rol ing out of the claws' way, and strained. Bloody spray shot out of wounds on her side, expel ing the poison with it. She sealed the wound.</p><p>The beast turned his head and stalked after her, the huge paws raising tiny puffs of dust from the rocky surface of the spire.</p><p>They leaped at once, flying at each other. His claws raked her side in a searing rush of pain. She bit his neck, ripping through the coils of tight muscle, but his flesh was too thick to reach bone and she withdrew.</p> <p>Venturo's blood burned on her tongue.</p><p>She had to make it to the bridge. It was her only chance. She couldn't bring herself to kil him.</p><p>Dark blood poured from the wound on Venturo's neck, wetting the bronze fur. He took a precious second to seal the gash.</p><p>Claire concentrated. She shuddered and split herself, throwing four copies of herself three to the right and one to the left. Five identical scarlet cats snarled in unison.</p><p>Venturo took a step back.</p> <p>Her copies rushed him and Claire jumped over him, throwing all her speed into a desperate leap.</p><p>The triple tail whipped around her, squeezing her like a noose. He'd seen through the phantoms.</p><p>She shot her back whiskers into his ribcage, turning them into hard spears in mid-strike. He snarled in pain and she slapped her own tail to slice at his face, trying to skewer him with the spike. He hurled her back. She flew through the air and smashed into the jutting rock wal . Her ribs cracked. The impact shook her vision into a haze.</p><p>Claire jumped to her feet and leaped right, left, jumping like a lunatic rabbit to avoid being hit. Her vision cleared and she saw his gaping maw diving down. Claire slapped his face with her paw, her claws raking four deep gouges on his cheek. The blow knocked him aside. He jerked back and they snarled at each other, face to face.</p><p>Fire shot from Venturo's eyes, dashed down his fur, and he stood before her engulfed in flames.</p><p>The Element Weaponry. The pinnacle of the psycher bionet training. If she had time, she would have bowed in appreciation.</p> <p>He advanced toward her, menacing, flames swirling around him. She feigned fear and backed away.</p><p>A step.</p><p>Another.</p><p>She would not get another chance. This was her very last one.</p><p>Her hind paw found air. She was to the edge of the spire.</p><p>Venturo leaned forward, the fire roaring around him.</p><p>If he was fire, she would be ice.</p><p>Glacial mist shot from her. Claire charged into the depth of the inferno. His fire licked her ice barrier.</p> <p>They col ided.</p><p>Claire let go, emptying every last reserve. Spears of ice shot from her, locking him into blocks of ice. She saw his enraged eyes before the ice swal owed him whole.</p><p>Claire ran. She ran like she had never before ran in her life, swal owing distance in hungry gulps. She tore through jungle, ignoring branches and thorns tearing at her hide.</p><p>Her mind fired brisk, calm commands, sending the signals down the established links to her team.</p><p>\"Disconnect. Mission complete. Disconnect now.\"</p><p>A roar of pure rage shook the jungle. Ven had broken through the ice. Mere five seconds, maybe less. It had to be some sort of a record.</p><p>She had no way of knowing if her team made the hub, so she just kept broadcasting. \"Mission complete.</p><p>Incoming threat. Disconnect.\"</p><p>Her mind shuddered under the strain. Her legs began to cramp. Every breath was a fire exploding in her lungs. Up the mountain, up, up, up.</p><p>She whirled at the mountain top and dared a single look back. A fiery glow was making its way through the canopy below. He was close. Claire ran.</p><p>The world began to fade. Darkness encroached. She was running too fast.</p><p>Venturo's furious growl shook the leaves behind her.</p><p>Claire burst into the hub clearing. Charles-Bul ran in a circle around the hub fountain, chased by an AI dog.</p><p>\"I'm the last!\" he cried out.</p><p>\"Disconnect,\" she commanded.</p><p>The AI beast leaped at her, and she crushed its spine with one impatient snap of her teeth.</p><p>The bul vanished, exploding into dark ribbons.</p><p>Venturo shot into the clearing.</p><p>She let go of the bionet, hurling up the tunnel into the hotel room. A long shuddering moan ripped from her lips, and Claire took her first breath.</p><p>The reality of the hotel room slammed into her. She sat up and pul ed the unit off her head.</p><p>Mittali lay on her back next to her, wincing as Tonya rubbed her feet. Charles was breathing hard, as if he'd carried a sack of rocks up a mountain. Zinaida smiled at her. Saim waved. In the corner Kosta sat in a clump, dark head hung down.</p><p>Everyone got out alive.</p><p>The medic stood by the hub, a glass vial in his hand.</p><p>Acid, she guessed. \"Dump it.\"</p><p>The medic poured the acid into the liquid interface.</p><p>The liquid hissed as synthetic neurons boiled into nothing.</p><p>\"Are you alright, Kosta?\" she asked him.</p><p>\"He got careless,\" Saim said. \"He was bitten.\"</p><p>\"May I?\"</p><p>Kosta nodded.</p><p>Claire swept over his mind. The lesion was smal , but his mind glowed with the imprint of the AI's teeth.</p><p>\"It will be alright,\" she said. \"Just stay off the bionet for about a month.\"</p><p>He nodded.</p><p>\"I saw him,\" Charles said, his voice fil ed with wonder.</p><p>\"I saw him. Was that a psycher?\"</p><p>\"Yes,\" she told him.</p><p>\"It's a miracle we're alive,\" he said. \"You are that miracle.\"</p><p>She shook her head. \"You've had no experience and no weapons. You've made it possible.\"</p><p>\"We should drink,\" Saim said.</p><p>\"Yes. Yes, that's a great idea,\" Mittali rol ed to her feet.</p><p>\"Ow. As soon as I can walk.\"</p><p>\"Don't worry,\" Saim told her. \"Tel me what you want, and I'll bring it to you.\"</p><p>Doreem Nagi rose off his chair and walked over to Claire.</p><p>\"It is done,\" she told him softly. \"Your grandson should be safe.\"</p><p>The old man bowed to her.</p><p>Chapter Six</p><p>Claire walked down the hal way toward Venturo's office. The shel over her mind was paper-thin. Accreting it took time, and she barely had thirty-six hours to recuperate.</p><p>Saturday night, after she'd returned to her apartment, she pul ed the ingredients out of the refrigerator and continued her aborted cooking attempt, convinced that every moment Security Forces led by Venturo Eskala would barge through her door. She'd finished the Dahlia Three-Color Stir-Fry and ate it. It wasn't as good as she had hoped, but it wasn't at all bad. Considering the bland food on which she grew up, her taste buds probably needed a lot of education to fine tune her palate. Or perhaps the anxiety that made her jump at every stray noise interfered with her ability to enjoy the meal.</p><p>Claire had taken a long, luxurious bath and, exhausted, fell asleep in the bathtub. She dreamed of Venturo, of his green eyes, of his bronze skin, of wanting to kiss him. Her dream-addled imagination conjured the taste of his mouth, the feel of his hands on her body as he stroked her, the weight of his muscular body pressing on top off her. She awoke to a cold bath.</p><p>He was as powerful as she had expected and more.</p><p>When she thought about their fight, the tiny hairs on the back of her neck stood up.</p><p>When she final y crawled into bed, she realized that she had gotten away with it.</p><p>He would never find out who she truly was. She curled into a tight bal and lay there for hours, her thoughts too loud, the phantom images of Venturo sliding back and forth across her memory.</p><p>Now it was Monday. She was once again the calm, col ected Claire. She walked to her office, a comfortable nook on the side of Venturo's glass cage. Today the glass was opaque, frosted with white by a privacy switch. Ven didn't want to be disturbed. Just as well.</p><p>She barely had a chance to put down her bag, when Lienne approached the office, marching down the hal way.</p><p>The older woman nodded at her. \"Claire, about the Berruto analysis. I know it was last minute, so if you want to take a few days, it will be fine.\"</p><p>Claire flicked the stylus across the digital screen projected onto her desk and smiled. \"It's in your inbox.\"</p><p>Lienne glanced at her tablet. \"So it is. Thank you.\"</p><p>\"You're welcome.\"</p><p>The older woman regarded her for a long second and rapped her knuckles on opaque door. The frost melted from the glass. Ven sat inside. He was wearing a bionet suit.</p><p>Dark circles clutched at his eyes.</p><p>Claire forced herself to sit down at her desk and look busy.</p><p>Lienne stepped inside the office and crossed her arms. Her mind sent a focused thought.</p><p>\"Rolando said you and Claire had an intimate dinner in the Roof Garden on Friday.\"</p><p>Ven grimaced. \"Rolando needs to keep his mouth shut.\"</p><p>\"I've warned you about this, Ven.\"</p><p>His face looked grim.</p><p>\"I'd gone to see Sangori. Claire insisted on coming with me, because apparently I 'shouldn't go alone.'\"</p><p>\"You shouldn't have.\"</p><p>\"I ran into Castil a, Lim, and Pelori. Pelori locked Claire in front of a lobby ful of witnesses. She didn't scream. Didn't panic. When I forced him to let go, she landed on her feet and asked if she should alert the authorities. No shaking in the voice. Nothing. She made us look strong and competent. She singlehandedly restored my standing in the community and she doesn't even realize it.\"</p><p>\"I know all that.\" Lienne waved her hand. \"The story is making the rounds.\"</p><p>Ven looked up and his eyes betrayed anger. \"Then why in the world are you badgering me about serving her dinner? Should I have sent her home and then be notified that her mind developed a lesion and her brains leaked out of her ears?\"</p><p>Lienne leaned forward, resting her knuckles on his desk. \"That's not what that dinner was and you know it. You cooked for her, Ven. You served her pink wine. You were up there for two hours. The only thing missing from this romantic rendezvous were the passion cones and only because the kitchen didn't have any.\"</p><p>Ven leaned back in his chair and sighed.</p><p>\"There are things that aren't appropriate between the owner of a business and an employee.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Don't lecture me,\" he warned.</p><p>\"I will lecture you. Has it crossed your mind that she may feel obligated to accept your advances?\"</p><p>\"What advances? Nothing happened.\"</p> <p>\"She can't decline your invitations. In her mind, you're putting her into a position where she must accept your overtures or risk being sent back to a hel ish planet where she might be put to death on arrival. You're putting her into a very difficult position.\"</p><p>He waved his hand at her. \"Nothing. Happened. It wasn't that kind of dinner.\"</p><p>\"Oh? What did you talk about?\"</p><p>\"Nothing. She asked about Castil a and then I asked her about her childhood.\"</p><p>\"Venturo! Do you not see the writing on this wal ? She is a talented girl, smart, efficient, and conscientious. If you keep pushing this, she may quit to escape. Do you have any idea how difficult it is to find an admin who can actual y tolerate you, Ven?\"</p> <p>He stared at her, incredulous. \"You didn't even want to hire her! I hired her.\"</p><p>\"However she came to work here, she is here now, she is doing exceptional y well , and I don't cherish the prospect of having to replace her.\"</p><p>Venturo raised his hand. \"Enough.\"</p><p>\"It's not fair to her, it's not -\"</p><p>\"I said, enough!\"</p><p>The force of Ven's mind tore out. Lienne fell silent.</p> <p>They looked at each other.</p><p>\"Why are you wearing a biosuit at this hour?\" she asked.</p><p>He rubbed his face.</p><p>Lienne checked her tablet. \"The log says you've been logged into the bionet for the last thirty-five hours.\"</p><p>\"I've met a psycher,\" he said. \"Young. Female. Grade A.\"</p><p>\"And?\"</p><p>\"She was powerful.\"</p><p>\"How powerful?\"</p> <p>Ven met her gaze. \"She iced me.\"</p><p>\"Don't be ridiculous. Nobody has been able to ice you since you were sixteen years old...\"</p><p>He just looked at her.</p><p>Lienne fell silent. \"For how long?\" she asked final y.</p><p>\"Six seconds.\"</p><p>Lienne dropped into a chair.</p><p>\"Was she DDS?\"</p><p>He shook his head. \"She iced me and took off. I traced her to a portable hub and the connection went dead.\"</p><p>\"You have to find her, Ven. If DDS gets a hold of a psycher who can ice you, Castil a will kil you.\"</p><p>\"Yes, who would you berate then?\" He grimaced.</p><p>\"Don't be ridiculous,\" Lienne's tone was soft. \"Find her.\"</p><p>\"I will .\"</p><p>Lienne rose. \"And Ven...\"</p><p>\"What?\"</p><p>\"About our previous conversation: there are ways to go about those things. Your mother knew this and so did your father.\"</p><p>Venturo blinked.</p><p>\"It's a bit extreme, but who will tel you no?\" Lienne shrugged and left the office.</p><p>Claire kept her haze firmly on her desk. Lienne's worries were misplaced. She could've told her that. The end of the conversation made no sense at all.</p><p>Ven stepped out of the office. \"Claire?\"</p><p>\"Yes?\" She forced a smile.</p><p>\"Clear my schedule for the rest of the week. Split my shift between Victorio, Rukah, and Daneb. I'm not available for anyone for anything unless it's an emergency.\"</p><p>\"I'll take care of it.\"</p><p>He nodded, looked like he was going to say something else, and returned to his office instead.</p><p>Claire sipped her tea. It was Friday, and she sat in a soft blue chair of the fourteenth floor recreation room. The room, shaped like a horseshoe, was positioned so the straight wal faced the diagrid. The wal was glass and sometimes Claire stood next to it, looking down the long sheer drop to the lobby. She liked to watch people, knowing that she was all but invisible.</p><p>Today she just wanted solitude. She'd dimmed the glass wal to near darkness, shutting off the bright light of the afternoon streaming in through the solar panels of the diagrid until only the pale purple and blue mood lighting remained. Her head hummed. Being a replacement Venturo Escana was a tiring business.</p><p>Claire took another sip of tea and checked the tab.</p><p>Passion raspberry. Hmm. Delicious.</p><p>It was thirty minutes past five. The building was mostly empty. The support personnel had gone home, eager to escape and start their weekend, with the exception of the psycher assistance unit. Both Rukah and Angelia were logged in, although Rukah was coming to the end of his shift and Angelia was just beginning hers.</p><p>In the past week Claire had made more executive decisions than she cared to admit. Venturo spent every waking hour logged into the bionet. Attempting to reach him proved futile. He simply brushed her off. Lienne carried her own workload and the couple of times Claire consulted her, the older woman defaulted to \"Ask Venturo.\"</p><p>In the end she resolved most of the problems herself, under the banner of Ven's authority. If Lienne or he ever realized who had handled most of the arising problems, she would be fired on the spot for overstepping. Claire smiled to herself. Right now getting fired didn't seem overly tragic. Sure, she would have to find a new job, and her probation period had shrunk to mere six weeks instead of twelve, but it might be worth it.</p><p>It would be worth it to be free of Ven. To be free of the fantasy that would never come to pass. She was too proud to spend the entirety of her life as his silent shadow, while he imagined her beating off the prospective assassins with her tablet.</p><p>Ven's mind approached.</p><p>Claire sipped her tea.</p><p>He emerged from the shadowy hal way, the bionet suit adhering to him like second skin. She ogled him quietly, looking through her eyelashes while pretending to drink from her cup.</p><p>Ven dropped a stack of pseudo paper next to her and landed on the couch. \"I found you.\"</p><p>She almost panicked, but her shel was firmly in place and thick enough to withstand a probe. \"I wasn't hiding.\"</p><p>\"Yes, you were. Lights are off, your desk is organized, as if you've left. If it wasn't for your bag, I wouldn't know you were in the building.\"</p><p>\"My desk is always organized.\"</p><p>He looked exhausted. The laugh lines around his eyes seemed more pronounced. His cheeks were withdrawn.</p><p>And yet he radiated a kind of magnetic sexual energy that made her watch him. Being in his presence was like having sex without ever approaching orgasm - she could watch and imagine, but he would never be hers and he would never want her the way she wanted him.</p><p>He sprawled on the couch, resting his head on the padded arm rest, straightened his legs, and winced.</p><p>Cramped. Clocking nearly eighty hours in the bionet in one week will do it to you. She'd done it before and it was unpleasant.</p><p>Ven nodded at the pseudopaper. \"I found these.\"</p><p>Claire glanced at the sheets. The Quattrone Family quote.</p><p>\"I know Lienne didn't approve this. Nor did she compile the data for the quote.\"</p><p>She didn't feel like lying. \"How?\"</p><p>\"Lienne has a best friend, Fotina Heleni. When they were both sixteen, Deo Quattrone stood her up. They were at a party together, and he saw his ex-girlfriend in the crowd with another kid and made a giant scene. It got ugly. Lienne despises him and the whole family. If her hate were a plasma converter, she could launch a thousand spaceships into orbit.\"</p><p>Claire laughed. \"Are you trying to hint that your aunt holds grudges?\"</p><p>\"I'm not hinting. I am saying it. So who helped you with these?\"</p><p>She sighed. \"Would it be so terrible if I had done them myself?\"</p><p>\"The quote shows a detailed knowledge of the bionet,\" he said. \"Who is the co-conspirator, Claire? I promise I won't punish anyone. In fact, I may give this person a raise and unload the rest of the quotes on them. Although that would be a punishment in itself, I suppose.\"</p><p>Frustration boiled up in her. \"You're right, Ven. A drone like me couldn't possibly understand the expense involved in structuring the spiral cel protection.\"</p><p>He focused on her. \"You are not a drone. We've discussed that.\"</p><p>\"And you never like to repeat yourself.\" She had to stop talking.</p><p>Ven sat up, propping himself on the armrest. \"Why are you upset with me?\"</p><p>Say nothing. Say nothing. Claire forced her voice to sound even. \"I am not upset. I'm just tired.\"</p><p>\"I get it,\" he said. \"Unloading all of my work on your shoulders wasn't fair. But I have no choice. You can keep your helper a secret, if you wish. I'll find out eventual y anyway.\"</p><p>No, you won't. You can't find someone who doesn't exist.</p><p>\"You're stil looking for your mystery woman?\" she asked.</p><p>He nodded.</p><p>I'm sitting right here. \"What's so important about her?\"</p><p>He sat up. \"Have you ever seen a silver shark?\"</p><p>\"No.\"</p><p>Ven reached for her tablet and pul ed up the console.</p><p>His fingers flew over the keys. A large digital screen ignited in the opposite wal . It was intense, deep blue, suffused with rays of pale green light, and she realized she was looking at the depths of the ocean.</p><p>Something stirred far in the distance. A hint of movement shifted the water.</p><p>A pale silver star winked in the distance.</p><p>Another ignited close by it.</p><p>Claire leaned forward.</p><p>More stars ignited and shimmered with nacre fire, shifting through the entire rainbow spectrum. A serpentine shape swam to her, graceful, beautiful, sheathed with silver scales and rippling with color. The sleek creature paused in front of the camera and coiled, displaying a multitude of wide fins bristling with spikes. There was something hypnotic in the way its body moved, sliding its coils through the water.</p><p>\"This is what she was...?\" Claire asked.</p><p>\"Yes. It's a silver shark serpent off the Coral Coast.</p><p>Except she was more like this.\" Venturo tapped the tablet.</p><p>The sea serpent grew, swel ing, fil ing the screen. Her head sprouted ivory horns, tinted with intense electric azure. A mane of silver and blue sheathed her spine, flaring around her head. Some of her fins widened, turning into razor-sharp blades, others grew into wide wheels, rippling with iridescent rainbows. A line of pale blue lights ignited along the serpent's body. She gathered herself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The lights pulsed.</p><p>Sharp blades of ice exploded from the creature, freezing the screen.</p><p>That's how he saw her... \"How did you get this image?\"</p> <p>Claire said, her voice barely above whisper.</p><p>\"I drew it with imagining software,\" he said. \"From memory. It doesn't do her justice. She was incredible. I wish you could've seen her, Claire.\"</p><p>The admiration vibrated in his voice and suddenly she was intensely jealous of herself.</p><p>\"I've never seen anyone like her,\" Ven said. \"Every psycher sees the bionet in his own way. I see it as shal ow ocean with islands. I was patrol ing when I got a ping from one of the Security Forces instal ations.\"</p><p>\"I didn't know Guardian had any Security Force contracts.\"</p> <p>\"It's not a fact they want us to advertise,\" he said.</p><p>\"Anyway, I swam that way and saw her. She had accessed a coral tree - the instal ation's data banks - and was coming back. She had to slither down a spike-studded channel barely wide enough to hold her. Thirty centimeters in either direction and she'd be skewered. It was insane.\"</p><p>He sounded obsessed.</p><p>\"How do you even know it was a woman?\" Claire murmured.</p><p>\"A feeling I got. I brushed past her mind and it seemed familiar somehow. I've met her before. I've been breaking my brain trying to recal where and nothing.\" He rubbed his face.</p><p>She couldn't help herself. \"May be she came to apply for a job.\"</p> <p>\"No. I would've remembered.\"</p><p>Oh you idiot.</p><p>\"And I would've hired her.\" Ven sighed.</p><p>Claire set her now empty teacup on the table. \"Just out of pure academic curiosity, what are you planning to do if you find her?\"</p><p>\"I'll drop to my knees and propose marriage on the spot.\"</p><p>What?</p><p>He leaned back and laughed. \"You should've seen your face. I final y managed to rattle the imperturbable Claire Shannon.\"</p><p>She almost hit him. \"Al this time in the bionet clearly altered your thinking patterns.\"</p> <p>\"If I see her, I'll try to buy her,\" he said. \"Or kil her. I haven't decided.\"</p><p>\"That's a bit extreme.\"</p><p>\"If DDS finds her, they will do the same,\" he said. \"Not only is she Grade A psychic, she's been trained. She has the kind of combat expertise that takes years to master.</p><p>During our fight she cloned herself. She actual y made copies of herself and they moved independently of her.</p><p>They lasted only a second or two, but it would be very useful in a fight. I've been trying to figure out how she did it.\"</p><p>It's not that difficult really. You shed copies of your outer thoughts within milliseconds of each other. Same process that produces your shadow. Claire clamped down on that thought before it turned into words.</p><p>\"Well, good luck in your quest,\" she said. \"I think I'll go home now. I've spent too much time in this building this week.\"</p><p>\"That's an excel ent idea.\" He rol ed off the couch and stood next to her. He was half a foot tal er and he was standing too close. If she raised her hand, she could touch his face. \"Come on a trip with me.\"</p><p>What? \"Where?\" she asked calmly.</p><p>\"To the provinces. I need to see a friend of mine anyway, so we can pretend it's a business trip.\"</p><p>\"And what would it be real y, if not a business trip?\" she asked.</p><p>He leaned toward her a fraction of an inch. His eyes laughed. \"It would be me and you getting away from this building.\"</p><p>What did that mean, exactly? \"Your aunt wouldn't approve,\" she said.</p><p>\"I can go whole days without giving a damn about what my aunt thinks. Weeks even. Come with me, Claire. You've never been to the provinces and Celino's wife is a fantastic cook.\"</p><p>She hesitated, stil not sure if the offer was genuine or if there was some hidden catch.</p><p>\"It's not an order,\" Ven said. \"Just an invitation from a friend. Whether you accept it or decline will have no bearing on your position with this company. I don't want you to feel obligated.\"</p><p>\"I don't,\" she said. \"How far is it?\"</p><p>\"About an hour by aerial at top speed. I promise to have you home before midnight.\"</p><p>\"Why midnight?\"</p><p>\"When you take a young girl out with her parents' permission, it's understood that you must return by midnight.\" He shook his head. \"It's just an expression.</p><p>Forget it. Come with me.\"</p><p>\"Are you sure your friends won't mind my presence?\"</p><p>\"I'm sure,\" he said.</p><p>\"I need to get my bag.\"</p><p>\"I need to shower. Tenth floor deck in fifteen minutes?\"</p><p>Fourteen minutes later she climbed into his aerial. Ven grinned at her. He wore civilian clothes: a dark pair of pants and a light grey shirt that molded to his chest and arms. His hair was stil wet from the shower and she smel ed a faint hint of his soap. She didn't know the name of the scent, but it made her want to kiss him and see if she could taste it.</p><p>\"I'm glad you decided to join me,\" he said.</p><p>\"Me too.\" She just hoped she wouldn't regret it later.</p><p>The aerial shot into orange light of the afternoon.</p><p>Ven pushed the com and typed in the number. A man's face appeared on the screen: masculine, intense, with harsh grey eyes. His hair was almost blue black.</p><p>Recognition flooded the man's eyes. He smiled and became a different person - warm, welcoming. \"There you are. We expected you earlier.\"</p><p>\"I'm on the way to you,\" Ven said. \"Celino, I'm bringing a guest.\"</p><p>\"What kind of a guest?\" a female voice cal ed off screen.</p><p>\"A young female one,\" Celino said. \"She is a co-worker.\"</p><p>\"Oh!\" the woman off-screen said. \"I better make desert.\"</p><p>Celino and Imelda Carvanna lived in a beautiful two-story structure with cream wal s and a wrap-around balcony shielded by a green roof. Surrounded by orchards and trees, the house drowned in a vast garden, and as Claire walked next to Ven down the twisted path from the aerial landing pad, a sea of dahlias bloomed on both sides of her: peach, orange, yel ow, blood-red, deep purple, blue fringed with white, some large, some smal , some with wide petals, some with narrow frayed florets, others a mere single ring of petals around a flat disk in the center. It was as if someone had taken a rainbow, put it into a blender, and tossed the result out.</p><p>\"Anemone,\" Ven pointed out different varieties.</p><p>\"Waterlily. Bal . Starburst.\"</p><p>\"I didn't know you were a botanist,\" she said.</p><p>\"I'm not. Growing dahlias is like a national sport. I remember one year a neighbor somehow bred one that was indigo and wouldn't let anyone have any tubers. Almost started a feud. I think someone got stabbed over it.\"</p><p>Claire laughed.</p><p>\"It's not funny,\" Ven said, smiling. \"Dahlias are serious business.\"</p><p>Celino and Imelda waited for them on the porch of their house. On the ride over Ven had told her most of the details. Celino's family and his had been neighbors. Celino was twelve years older than Ven, forty-five to Ven's thirty-three, and the two of them didn't pay much attention to each other until Celino, who had become a financial shark and accumulated a huge fortune, decided to retire. He required bionet protection for his rather large fortune and business interests, and so he looked up an old neighbor. They soon became close friends.</p><p>Looking at Celino Carvanna now, Claire could barely see the traces of the ruthless financial magnate. He seemed perfectly amicable. Charming even.</p><p>\"This is Claire,\" Ven said. \"She works with me. Claire, this is Celino and that's Meli.\"</p><p>Celino smiled wide and nodded to her. \"Welcome!\"</p><p>\"Thank you.\"</p><p>Celino slapped Ven's shoulder. \"I have news for you. Come.\"</p><p>They went into the house.</p><p>Meli Carvanna smiled at her. She was short, dark-haired, with a big breasts and wide hips, and beautiful brown eyes on a tan face. She looked as if she belonged on the porch of this house, in the garden of dahlias, on this planet. This is what the women Ven grew up with looked like, Claire realized. Standing next to her, she felt at once awkward and inadequate. She would never be like this.</p><p>She shouldn't have come.</p><p>\"No matter how much time Celino spent in the city, he's stil a man of the provinces,\" Meli said. \"Men retire to discuss Important Business, and we women are expected to entertain ourselves by cooking. Since I already finished dinner, I say we revolt and drink wine on the balcony instead.\"</p><p>\"Very well.\"</p><p>Claire fol owed Meli through the house to the balcony, where they sat in the padded chairs, a smal table with two glasses and a bottle of wine between them. Meli poured the wine into two glasses. The golden liquid fil ed the glasses.</p><p>\"You must excuse them,\" Meli said. \"Knowing Ven, the Sangori problem is driving him up the wal . There is nothing he hates more than being made to look foolish. He detests it. Always did, since he was a child.\"</p><p>\"You knew him when you were children?\" Claire kept her face careful y neutral.</p><p>Meli nodded. \"We all grew up in the same area. Ven's cousin dated my youngest brother. Did I say something unpleasant?\"</p><p>Claire looked at her. She was sure none of her emotions had reflected on her face.</p><p>\"I'm trained to assess minute facial expression,\" Meli said. \"Yours was one of distaste.\"</p><p>\"Why would one require such a training?\" Claire said.</p><p>\"I'm an assassin,\" Meli said. \"Or I was, rather. For many years. It's considered prudent to rapidly identify emotions in my line of work.\" She smiled. \"It keeps you breathing longer. So why distaste?\"</p><p>Claire looked at the flowers. \"You reminded me that I am an outsider.\"</p><p>\"Oh? Where are you from?\"</p><p>\"Uley.\"</p><p>\"So how did you and Ven meet?\"</p><p>\"He hired me.\" Claire closed her mouth, hoping to leave it at that, but the older woman watched her with a rapt expression. Silence stretched. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It started with the war ending,\" Claire said. \"I worked as a secretary, so I was viewed as civilian...\"</p><p>Twenty minutes later, when she was done explaining, Meli smiled. \"I'm glad you and Ven found each other. Celino and I married late by kinsmen standards and Ven is almost as old as Celino was when we married. .\"</p><p>Claire looked into her empty wine glass. \"I think you might have an incorrect impression. Ven and I are not a couple. I'm his admin.\"</p> <p>Meli sipped her wine. \"I see. There go my hopes. It's impolite to listen in on a conversation that doesn't concern you.\"</p><p>Claire drew back. Something rustled in the garden below. A smal tan hand clasped one of the wooden columns supporting the roof. The second hand joined the first and a child pul ed himself up on the balcony rail. He was tan, with Celino's grey eyes and Meli's chocolate brown hair. A streak of dried blood marked his temple and his left forearm sported a long knife cut.</p><p>\"How did it go?\" Meli asked.</p><p>The boy raised his face. \"I kicked his ass.\"</p><p>\"Good. Go wash up. Your father will expect ful account at dinner.\"</p> <p>The boy ducked inside.</p><p>\"Neighbor kid problems,\" Meli said.</p><p>\"Yours is a strange culture,\" Claire said. \"Beautiful, vibrant, and passionate, but also savage.\"</p><p>Meli stretched \"It's the planet. It heats our blood and makes us do crazy things. Resistance is futile, Claire. It will claim you as its own sooner or later.\"</p><p>The bionet jungle flashed in Claire's mind. \"I think it already has.\"</p><p>When Celino and Ven emerged from the study, they moved to the dining room. They had dinner, a delicious parade of perfectly seasoned dishes, during which the ten-year-old Ramiro Carvanna had to describe in excruciating detail every moment of his fight with twelve-year-old Soldano Chel ini. The Sangori problem was discussed briefly - the always prosperous family had made a number of costly investments that failed. The firm was teetering on the brink of col apse and the establishment of the bionet servers was Savien's desperate attempt to project an image of thriving success and drum up more business.</p> <p>Celino pounced on the opportunity as if he'd smel ed blood in the water. She couldn't quite fol ow the intricacies of their conversation, but if everything went their way, Carvanna and Escana would own most of Sangori by the quarter's end.</p><p>Ven and Carvanna caught up on the latest gossip.</p><p>Someone married someone else. Someone's sister left the planet. Someone had engineered a short-life, weapon-grade plant virus and nuked the rival's garden with it.</p><p>Names floated by her. She could've used her training to memorize them, but she didn't bother. What was the point?</p><p>They were too vivid and too bright, too familiar with each other, and she simply faded in the background.</p><p>Later Claire found herself back on the balcony, standing at the rail, watching the last splashes of sunset as the star rol ed behind the gardens. Ven came looking for her. At first, she ignored his approaching mind, then she ignored his footsteps, then he leaned on the rail next to her, and she couldn't ignore him any longer.</p><p>\"Do you like them?\" he asked.</p><p>\"They are very pretty,\" she said, surveying the flowers.</p> <p>\"I meant Celino and Imelda.\"</p><p>Why did it matter if she liked them? If she said no, what would it change? \"They are wonderful hosts.\"</p><p>He leaned closer, searching her face for something.</p><p>\"Did you not like being here? You didn't say more than two words at dinner.\"</p><p>She wanted to grab him and shake him. Why? Why would he bring her here to this little paradise and show her what she could never have? Why introduce her to a perfect woman she could never be? It was cruel. \"I'm just a little tired,\" she said with a smal smile.</p><p>Ven turned, leaning with his back on the rail. \"Was someone rude to you?\"</p><p>\"Not at all. Your friends were perfectly courteous.\"</p><p>\"Then what is it?\"</p><p>\"It's nothing, Venturo. I am just a little tired.\"</p><p>He exhaled. \"This would be so much easier if you were a psycher.\"</p><p>She pushed from the rail. \"Wel , I am not.\" And even if I was, I would lock you out of my mind.</p><p>His mind reached out, hovering next to her.</p><p>\"No,\" she said sharply. Now wasn't the time for mind scans. If he discovered her shel , he would put two and two together. He stil didn't know if he wanted to hire or to kil the mysterious psycher. Venturo was proud. If he realized how thoroughly she tricked him, he would feel extremely foolish.</p><p>The choice between kil and hire wouldn't be so difficult then. If he fought with her, one of them would not survive.</p><p>She didn't want to die and she didn't want to hurt him.</p><p>Venturo peered at her. \"How did you know I wanted to scan your mind?\"</p><p>She gave him a cold look. \"I guessed. You have difficulty taking no for an answer.\"</p><p>\"Does this mean you didn't real y want to come with me?\"</p><p>\"That's not what I meant.\"</p><p>\"Claire, I told you, you didn't have to accept my invitation if you didn't want to.\"</p><p>\"I wanted to come,\" she said.</p><p>She could tel by the look on his face that he didn't believe her. \"I think it's better I take you home,\" he said.</p><p>\"After all , I promised to return you to your life at midnight.\"</p><p>He strode back inside the house. She wanted to scream, but venting her frustration in a loud shriek was out of the question, so she clenched her fist and smashed it into the rail.</p><p>Chapter Seven</p><p>Claire awoke instantly. Someone's mind had brushed against hers. She could stil feel the traces of the foreign presence.</p><p>Claire rol ed out of bed. The owner of the mind waited outside. It wasn't Venturo. His mind felt differently. Besides, after their silence-fil ed flight back to the city, a visit from him was highly unlikely.</p><p>She pul ed a pair of pants over her underwear and stepped out onto the balcony.</p><p>The light-eyed DDS psycher stood on the ground below her windows. His name surfaced from her memory: Pelori.</p><p>He tossed back his long hair, jumped, and scrambled up the wal , swinging himself up to crouch on the rail of her balcony. A combat agility implant. Nice.</p><p>A thought zinged to her. \"I know you are not what you seem.\"</p><p>She'd thought as much. He had touched her mind and sensed the shel .</p><p>\"Escana doesn't deserve you. He doesn't even know and he is too blind to see it.\"</p><p>Ven would know, but he was too polite to go ruffling through her thoughts. It was a courtesy she treasured.</p><p>\"Join us. We will give you things. Money. Prestige.</p><p>Respect. Safety. Better house.\"</p><p>\"You're wasting your time,\" she said aloud.</p><p>\"Why do you stay with him? What has he done that we can't duplicate?\"</p><p>\"He brings me tea.\"</p><p>\"What?\"</p><p>\"When I hit rock bottom and needed help, he gave it to me expecting nothing in return. He takes interest in me. He cares about my welfare. He is kind to me.\"</p><p>Pelori turned his head, like a bird examining an interesting time. \"Castilla will give you enough money to buy all the kindness you want.\"</p><p>\"No.\"</p><p>\"What if I make you come with me?\"</p><p>Claire laughed. \"If you touch me, I will take your mind apart.\"</p><p>\"You don't have the power.\"</p><p>\"Try me.\"</p><p>He pondered it for a long moment. He had no way of gauging her power or guessing at how fast she could dismantle the shel .</p><p>Pelori dropped off the balcony, landing in an easy crouch. \"I will return.\"</p><p>Claire went inside. She was watched. She wasn't sure if he had contacted Castil a or if his visit was an independent effort. Either way, it would end badly.</p><p>Her magic dream of happy life was beginning to unravel at the seams. If she let herself get caught up in mourning the unfairness of it, she would fail to hold it together. The mere possibility of losing everything fil ed her with fear.</p><p>Claire crossed her arms. She had to keep it together.</p><p>She had to function and she would fight for her dream.</p><p>Monday came too fast. She had arrived at her regular time and sank into work, refusing to permit any distractions, including Ven's mind in the nearby office.</p><p>The digital screen in her desk chimed, sending a glowing pulse of pale blue through her screen. She checked the origin. Calena, Building Security. Now what?</p><p>She took the cal . Calena's face fil ed the screen.</p><p>\"Claire, there are people here to see you,\" she said. \"They say it's an emergency. They seem agitated.\"</p><p>Calena panned the camera to the side. Tonya, Charles, and Doreem Nagi leaning on a teenager who had to be Edu for support. Her stomach lurched. Something bad had happened. \"I'm coming down.\"</p><p>Claire hurried to the elevator, her heels clicking on the transparent floor. A few seconds later the elevator spat her into the lobby. She crossed the tiled space.</p><p>Tonya saw her and would've ran forward if Charles hadn't caught her. Doreem's face looked grey. Edu stared at her, wide-eyed.</p><p>\"What happened?\"</p><p>\"They arrested Kosta!\" Tonya breathed.</p><p>\"What?\"</p><p>\"He got a recommendation for a job,\" Charles said, his face pale. \"They looked at his job history and made him log into the bionet. He had no choice.\"</p><p>And the moment he logged in, his mind lit up with an AI's mark.</p><p>Her mind slipped into battle calm. \"Where is he now?\"</p><p>\"The Security Forces took him away,\" Tonya said.</p><p>He was in physical custody. There was nothing she could do through the bionet or out of it.</p><p>\"They're going to deport him. Melko will kil him,\" Tonya moaned.</p><p>Melko would definitely kil him.</p><p>Doreem Nagi pushed away from his grandson. His knees began to bend. \"Please save my grandson...\"</p><p>She caught him before he knelt. \"Don't kneel. Please.\"</p><p>Charles helped him back up.</p><p>There was only one solution. \"Come with me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They fol owed her to the elevator. She brought them to fifteenth floor and led them to the conference room only a few feet from hal way leading to Venturo's office. It was the same room she'd sat in six weeks ago, waiting for her interview. The irony.</p><p>\"Please rest here,\" Claire told them. \"Bathroom is on your left. Wait for me. Don't go anywhere and don't speak to anyone. Refer anyone who asks why you are here to me.\"</p><p>Charles and Edu gently lowered Doreem on the couch.</p> <p>Claire turned and strode down the hal way.</p><p>Ven's office wal s were transparent. She saw him behind her desk, watching her as she walked.</p><p>She had no idea what she would say.</p><p>Claire stopped before the door and rapped her knuckles on it. The glass slid aside and she entered the office.</p><p>\"Sit down,\" Ven said.</p> <p>She saw the set line of his jaw. His face was grim, but whether it was anger or determination, she couldn't tel .</p><p>\"I need help,\" she said.</p><p>He leaned back. \"I'm listening.\"</p><p>\"A young man from my building on Uley is in trouble.\"</p><p>\"How bad?\"</p><p>\"He logged into the bionet where he was bitten by an AI defensive protocol. The protocol belonged to a security forces instal ation. He has been arrested. If he is deported, he will be kil ed on arrival to Uley.\"</p> <p>\"Would they real y kil him?\" Ven asked.</p><p>\"Yes. They informed us that anyone who returned to the planet would be terminated.\" She leaned forward. \"He is a child, Ven. Barely eighteen. He has his whole life ahead of him.\"</p><p>\"And this is important to you?\"</p><p>\"Yes. His grandfather made sure that my mother didn't die alone in poverty.\"</p><p>Venturo's eyes were stil dark. \"I can't cal to the security forces and demand they let him go. I need a reason. Can you claim that the boy is your relative?\"</p><p>She was an orphan, and Doreem would do anything to save his grandson. \"Yes.\"</p><p>\"Then there is a way we can quash the deportation.</p><p>You would have to become a client of the Escana family.\"</p> <p>She blinked.</p><p>\"As a client, you become an honorary kinsman and can't be deported. Neither can your family. As your patron, I would be expected to make the cal to security forces and demand the boy's release.\" Venturo leaned forward, his arms on the desk. \"The relationship between patron and client is complicated. The client serves the patron's family with devotion and loyalty. If the patron gives an order to the client, that order can't be refused, even if it costs the client his life. However, the patron, in turn, is obligated to use his influence and resources to take care of his client and assumes responsibility for the client's actions. Being a client is an honor. You're worth it.\"</p><p>He fell silent.</p><p>Claire waited. There was more coming, she could feel it.</p><p>\"I dreamed about you last night,\" he said. \"When I woke up, I had a moment of clarity. I realized why I've been trying to include you in things I like and hoping you might like them as well. I need to know where we stand. As a client, you can't be fired. You're not real y an employee - you receive a stipend from the family. You can't be deported. It would make certain things a lot easier. For example, if you want to reject an invitation from me, you could do so without...\"</p><p>\"Venturo,\" she said softly.</p><p>\"Yes?\"</p><p>\"What do I have to do to become a client?\"</p><p>\"You would have to swear an oath linking you to the Escana family. And, of course, there is a mind link.\"</p><p>A wave of ice-cold fear washed over her. \"A mind link?\"</p><p>\"Becoming a client requires a demonstration of absolute trust and submission,\" Ven said. \"A sacrifice must be made. If you were a fighter with combat enhancements becoming a member of a warrior family, you would submit to a thorough background check and then you would walk up to your patron, hand him a blade, and all ow him to stab you. You would do so without any move to defend yourself.</p><p>We're psychers. We don't stab and we don't need background checks. We enter your mind and read it like an open book.\"</p><p>He would see. He would see everything.</p><p>Claire sat stil , paralyzed.</p><p>She had to act. Kosta could be loaded on a spaceship by now. He would not betray her. He would trust her to stand by him. She was his officer. She had taken him on that mission. She had a duty to him.</p><p>\"I understand that it's a huge commitment,\" Venturo said.</p><p>\"I want immunity.\"</p><p>\"I'm sorry?\" His eyes narrowed.</p><p>\"I want immunity,\" she repeated, her voice hoarse. \"I don't want to be prosecuted for things you may see in my mind.\"</p><p>He grimaced. \"In light of your exemplary service, I'm sure we can overlook the occasional theft of tea and cookies from the office. Everyone steals office supplies now and then.\"</p><p>\"Venturo!\"</p><p>He looked at her.</p><p>\"I want immunity.\"</p><p>Ven growled under his breath. \"You drive me crazy, Claire. I take you to the house of my best friend, and you get upset. I offer you the highest honor a kinsman family can bestow on an outsider and you haggle with me like I'm trying to sel you apples at the market. Just what is it you're hiding in your mind?\"</p><p>\"You will find out if you give me immunity.\"</p><p>He stared at her. Silence stretched.</p><p>\"Fuck it. I have to know now. You have your immunity.\"</p><p>She rose. \"Come with me.\"</p><p>He fol owed her. They almost col ided with Lienne, as she opened the door of the office. Perfect.</p><p>\"Fol ow me, please,\" Claire said.</p><p>Lienne arched her eyebrows. \"What's going on?\"</p><p>\"I have no clue,\" Ven said. \"Just play along.\"</p><p>Claire led them down the hal way to the conference room. Charles and Tonya scrambled up at their approach.</p><p>Doreem struggled to rise. Claire crouched by him. \"Do you want to save your grandson?\"</p><p>\"Yes,\" the old man breathed.</p><p>\"Then you must adopt me. Write me into the building rol . Right now.\"</p><p>Charles lifted Doreem to his feet. The Building Manager took his scrol -tablet from his bag and handed it to Tonya. She held it up. Claire knelt. Doreem placed his hand onto Claire's hair. \"By the power invested in my by War Council, I formal y adopt Claire Shannon, Rank Captain, birth date of...\"</p><p>\"... Two thousand seven hundred and twenty six standard,\" Claire murmured.</p><p>\"... two thousand seven hundred and twenty six standard into Nagi family as witnessed by these five witnesses.\"</p><p>Doreem pul ed the stylus out and careful y wrote her name into the Nagi family and passed the tablet to Charles.</p><p>Charles signed, gave it to Tonya, then the tablet made the rounds to Lienne, Venturo, and final y Edu.</p><p>Doreem examined signatures. \"So witnessed. Rise, my daughter.\"</p><p>\"Thank you.\" Claire rose and faced Ven. \"Kosta is my nephew. Please make the cal , patron.\"</p><p>Lienne's eyes widened. \"Patron... Patron? \"</p><p>\"I will explain later.\" Ven took Claire by the hand.</p><p>\"Come on. You four go down to the security forces station to col ect the boy.\"</p><p>\"Venturo!\" Lienne yelled.</p><p>\"Later.\" Ven kept a firm grip on her fingers and led her to his office. They stepped inside. He touched his desk.</p><p>The glass wal s turned opaque, and the faint whoosh announced the activation of the sound barrier.</p><p>Ven dialed the number on the digital projection on his desk. \"Captain Alvarra.\"</p><p>A long moment dripped by.</p><p>\"Kinsman Escana,\" a male voice said. \"What may I do for you?\"</p><p>\"You've apprehended a boy, Kosta Nagi. He is a</p><p>\"You've apprehended a boy, Kosta Nagi. He is a nephew of my client, Claire Shannon Nagi.\"</p><p>\"My apologies, kinsman. The boy bears our AI mark.\"</p><p>\"He was playing on the bionet and stumbled into the wrong sector. I will be happy to pay the fine.\"</p><p>A number ignited in the corner of the screen. Fourteen thousand credits. More than a quarter of her yearly salary.</p><p>Venturo flicked a stylus.</p><p>\"Thank you, kinsman. Shal I deliver the boy to his home address?\"</p><p>\"No need. His grandfather is coming to pick him up.</p><p>Thank you for your assistance. You have been most helpful.\"</p><p>\"My honor, kinsman.\"</p><p>The screen went dark.</p><p>So easy. It was so easy for him.</p><p>Venturo looked at her. \"Feel better?\"</p><p>\"Yes.\"</p><p>\"Rank Captain,\" he said.</p><p>\"Everyone must have a rank of some sort.\" Claire desperately wanted to run away. The door was locked. She wouldn't get far in any case. Besides, she gave her word.</p><p>\"I will initiate the mind link now,\" he said. \"I'll do all of the work. all you have to is relax.\"</p><p>\"Can I have a minute?\" She began dismantling the shel from the inside.</p><p>\"I'm afraid not.\" His mind enveloped hers, slicing through her surface thoughts.</p><p>Venturo's eyes widened. \"What is this?\"</p><p>She put more pressure on the shel .</p><p>\"Open your mind, Claire.\"</p><p>\"I'm trying. It takes time.\"</p><p>\"I'm afraid I must insist.\"</p><p>His mind smashed into her shel . It cracked, caught between the pressure of their two minds. He pushed harder. The shel broke. Her mind soared free and she felt him surge through it, finding all of her secrets. He felt the raw grief of her team's death and the pain of the PPP. He saw the bionet, he saw the red cat, he saw himself as the beast on fire. He saw everything. She desperately tried to hide one tiny secret bit of self, the one fil ed with fantasies of him, with images of both of them, touching, kissing, making love, but he found it in a fraction of a second.</p><p>They sat across from each other, her mind glowing, completely revealed.</p><p>His jaw tightened. His mind was like a supernova, churning with anger and surprise.</p><p>Venturo rose from behind his desk and walked out.</p><p>Chapter Eight</p><p>Claire went home. There was nothing else left to do. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She walked into her apartment and sank on the couch.</p><p>She felt exhausted, drained, as if nothing of her remained except for a thin shadow.</p><p>She should have felt relief. Final y Venturo knew. She wouldn't have to lie anymore. Her position as a client meant she would be safe from deportation. None of it mattered next to the look on his face. He looked betrayed.</p> <p>She did betray him, his trust, all while she had fantasized about him. She felt smal , shamed, and pathetic.</p><p>She would cry, except she had no tears, so she curled into a bal hugging her knees.</p><p>A knock sounded through the door. Claire's mind soared, checking.</p><p>Venturo.</p><p>She pul ed her knees tighter to her. No.</p> <p>\"Open the door, Claire.\"</p><p>No.</p><p>\"Open the door.\"</p><p>She closed her eyes and will ed him to go away.</p><p>An image blossomed in her mind: Venturo, nude, golden, his big body bracing hers. She was shameless and naked. His lips trailed the line of her neck.</p><p>Her whole body shivered in excitement, conjuring a physical response to the fantasy.</p> <p>Claire tried to scrounge a mental shield.</p><p>In her mind Venturo flipped her, caressing her back, sliding his hands around her to cup her breasts, his fingers teasing her nipples, sending tiny electric shocks through her. A hungry yearning began to build inside her, a kind of emptiness that insisted to be fil ed. She felt the steel ridges of his stomach against her back and the thick length of his cock against her butt. Her head swam, as if she were drunk on pink wine.</p><p>His hard thigh nudged her legs open...</p><p>\"Stop!\"</p><p>\"Why?\" Venturo's thoughts rol ed through her mind.</p><p>\"I'm only showing you what I found in your head.\"</p><p>\"You were never meant to see it.\"</p><p>\"Why not? I'm the object of your fantasies. I should be able to see them.\"</p> <p>In her mind Venturo nuzzled her neck, stroking her breasts. The air turned too hot. Every nerve inside her hummed with pleasure. She felt the heat drain down, focusing between her legs, building into a thril ing ache. His right hand grasped her hip, his fingers hot on her skin. He pul ed her closer and she felt him between her legs, stopping just short of thrusting into her.</p><p>\"Stop...\"</p><p>\"You don't tell me you are a psycher. You meet me on the bionet and then you let me look for you for days like a complete idiot. You fantasize about me, but you don't let me know. You're terrible at sharing.\"</p><p>She had survived over eight hundred combat missions, yet she was terrified to open that door.</p><p>\"Did you touch yourself while you thought of me, Claire?\"</p><p>In her mind his hand slipped down, over her hip, tracing the sensitive curve of her stomach, down, lower, slipping between her lips. His fingers dipped into her, into the center of the ache, and came away slick with moisture.</p><p>He flicked his fingertips against the sensitive bud of her clitoris.</p><p>Pleasure shot through her. She cried out.</p><p>\"What's the matter? Am I not doing it right? Open the door and show me.\"</p><p>In her mind, the phantom Venturo leaned to her ear and said a single word. \"Coward.\"</p><p>If she didn't let him in, she would regret it for the rest of her life. \"Open,\" she said.</p><p>The door slid aside, and he came through, pul ing off his shirt as he walked, revealing the bronze skin of his muscled chest. He kicked off his shoes. His pants fol owed.</p><p>She just watched, unable to move.</p><p>He stepped toward her. His arms caught her, pul ing her to him. She saw his green eyes, dark with need, and he kissed her. She tasted him - the slight saltiness and spice - and smel ed the exhilarating scent of his sweat mixing with a hint of his cologne.</p><p>His tongue slid into her mouth and found hers. Desire swept through her, melting the last remnants of inhibitions.</p><p>His tongue licked hers, and in her mind, she was picturing him thrusting inside her. Their thoughts tangled in a glowing whirlpool and she saw herself in hismind, golden and beautiful, moaning in pleasure.</p><p>\"I want you,\" he said, his voice ragged. \"Do you want me?\"</p><p>\"Yes,\" she whispered. \" Yes,\" her mind sang, \" Yes, yes, yes...\"</p><p>He unzipped her dress, slipped it off her shoulders, and it fell down. His hands eased her out of her bra. Her panties fol owed. She wound her arms around him. Her fingers touched the hard muscle of his back. She had wanted this for so long. She caressed him, no longer caring about being ashamed. She slipped her hand lower, stroking the smooth skin of his shaft, squeezing, sliding, wanting.</p><p>He made a deep male noise and kissed her neck, turning her around. She put her hands against the wal .</p><p>He thrust into her, straight into the center of the aching pressure. She gasped, and he kept thrusting, each stroke sending quakes of pleasure through their bodies and their minds. He kept pumping, moving in a steady powerful rhythm. The happy quakes col ided inside her, building stronger and stronger, until her muscles contracted and the ache inside her broke into intense shudders of pure bliss.</p><p>She cried out and sagged against him, supported by his arm around her waist.</p><p>\"Did you like that?\" He grinned, masculine and possessive, and very happy with himself.</p><p>\"Yes,\" she told him.</p><p>\"Good. Now we reenact mine.\" He picked her up and carried her to the bed.</p><p>\"That was a very elaborate dream you had,\" Claire murmured. She lay with her head on Ven's biceps, exhausted, spent, and euphoric.</p><p>\"I have a creative subconscious.\"</p><p>She smiled.</p><p>\"What was the deal with visit to the Carvannas?\"</p><p>She sighed.</p><p>\"Out with it,\" he said.</p><p>\"Ven, you took me to the this garden paradise, which I could never have, and introduced me to a woman who was more than me in every way. She is beautiful, warm, she can cook like a chef, and then the lot of you sat around and discussed people you've known since childhood.\"</p><p>\"I wanted you to like each other,\" he said.</p><p>\"I like them. It just... I can't even cook. I mean, I try, but it tastes odd.\"</p><p>He laughed at her.</p><p>\"I will never be Imelda Carvanna,\" she said.</p><p>\"If I wanted someone like Meli, I would have married a long time ago. I want you. My beautiful, lethal, precise ice dragon. One of a kind.\"</p><p>\"That's a terrible pet name,\" she said. \"Ice dragon?\"</p><p>\"Silver Shark? Captain Lethal? Slaughter Maiden?\"</p><p>\"Venturo!\"</p><p>\"Seriously, how many hours have you logged in?\"</p><p>She shrugged. \"Eight hundred and forty two combat missions; with training, a little over forty thousand hours.\"</p><p>\"I have fifty thousand hours and I've been logging in since I was six. This is kind of embarrassing.\"</p><p>\"You logged in because it was fun and you loved it. I logged in because it was my duty to contribute to the war effort. Eight hours, almost every day. There were times when we'd get stuck, and I'd be in for forty hours at a time.</p><p>I'd wake up with an IV in my arm and have to relearn how to walk.\" She shivered.</p><p>\"But do you like it? The bionet?\"</p><p>She nodded. \"It's what I do. It's what I am.\"</p><p>\"I'm glad,\" he said. \"I like it too.\"</p><p>\"I had a squad working with me. Grade B and C psychers. That's where the precision comes from - I had to protect them and I couldn't shield all of them at once, so my only choice was to attack and kil with one or two blows before they attacked my guys.\"</p><p>\"You didn't hit anything vital on the bridge,\" he told her quietly.</p><p>She sat up and faced him. \"I knew in the sheer power contest you would crush me. You are strong, Ven, stronger than me. Less precise, but stronger. I didn't want to hurt you and I didn't want to die. I had only one chance - to run.\"</p><p>She told him about the school and the dagger and the five repair techs.</p><p>\"And the kid I sprung free today was helping, I'm guessing?\" he said.</p><p>\"Yes. We did the basic DAD - draw away and distract - on the AI protocol. You should've seen him. He was bouncing about sniffing flowers. His eyes were this big.\"</p><p>She opened her hands wide and held them by her eyes. \"It was all , 'Kosta! Don't touch that, it will eat you. No, don't touch that either. Don't pet that giant monster... Like trying to walk a kitten on a leash.\"</p><p>Venturo laughed and then the laugh died. \"Why didn't you tel me?\"</p><p>\"I almost did, up in the roof garden. And then you went on about how I had a nice quiet mind.\"</p><p>He groaned. \"I was trying to pay you a compliment.\"</p><p>She mimicked him. \"'You have a such a quiet mind, Claire. I deal all day with people whose brains are noisy.'</p><p>Was I supposed to come back with, by the way, I can kil you with my brain and I indulge in dirty fantasies about you in my spare time?\"</p><p>He grabbed her and pinned her down. \"I like your dirty fantasies.\"</p><p>She laughed.</p><p>\"And I like when you laugh.\" He kissed her. \"Mmm.\"</p><p>She untangled herself from him and rol ed off the bed.</p><p>\"Come on. I'll show you the split.\"</p><p>\"Oh, I'd love to see that.\" His grin was carnal.</p><p>\"No, you fool, the cloning technique. Come on.\"</p><p>He got off the bed.</p><p>\"Bionet hub,\" she ordered. A section of the wal split, and a smal liquid interface terminal emerged, the lid sealed.</p><p>\"Still sealed,\" Ven said.</p><p>\"I was too afraid to log in. Besides the shel takes a week to rebuild. I didn't want to chance it.\" She took out two cognizance units from the shelf and tore the plastic.</p><p>Ven twisted the lid, breaking the seal. \"Some people open wine. We open the hub.\"</p><p>She fitted the unit on him and waited as he fit one on her. It felt oddly symbolic.</p><p>The dark tunnel swal owed her, and a moment later she landed next to him into the soft grass. They sat in a jungle clearing, wild bright flowers blooming all around them.</p><p>The enormous beast that was Ven stretched, raking the ground with his massive claws. Claire rol ed, batting her red paws at the sun rays puncturing the jungle canopy in narrow spears of light. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A deep underground roar made her jump up.</p><p>The jungle fell apart, melting. The ground underneath them surged up, the wind pressing on them like a massive hand. Suddenly the movement stopped.</p><p>Behind them the ground dropped off in a sheer cliff.</p> <p>They stood on the edge of a wide grassy plateau. A low sound of a gong rang through the world. In the distance a bright star winked, then another, and another. Psychers logging in.</p><p>\"Cute,\" Venturo said.</p><p>The realization washed over her. \"DDS. Pelori came to see me two days ago, trying to buy me. He had sensed the shel on my mind. They must've put a code trap on my access line.\"</p><p>Across the plateau dust rose. Something massive was moving toward them at top speed.</p><p>\"Figured,\" Ven said. \"Attacking Guardian was too risky. Castil a must've decided that sooner or later you would log in and alone you'd be the perfect target.\"</p> <p>\"We can grow wings and glide down off the cliff,\"</p><p>Claire said.</p><p>He shook his enormous head. \"No. I am going to finish this once and for all. But you want to go -\"</p><p>\"Are you joking? You couldn't drag me away.\"</p><p>The cloud of dust parted and she saw them: an enormous elephantine monster, fol owed by a huge canine and a flightless bird with a fiery plumage. Lim, Pelori, and Castil a.</p><p>Claire grinned, displaying her fangs. Fire sheathed Ven.</p> <p>The monsters were almost upon them.</p><p>\"Hey,\" Ven said to her. \"Watch this.\"</p><p>Epilogue</p><p>From: Lienne Escana</p><p>To: Malvina Escana</p><p>Malvi, I know you won't believe it, but your son final y found someone. Smart girl, Grade A psycher, perfect manners, you'l love her. Apparently Castil a had the stupidity to attack the two of them in the bionet, and they ended up rampaging through DDS. It was brutal. DDS is stil recovering and their stock has fal en 32%. I'd give you the details, but they refuse to talk about it during the work day and at night they hole up in his apartment, drink pink wine, and have sex like two rabid monkeys.</p><p>Anyway, if you want Venturo to marry, now is your chance. I've got a scheduling conference set up on Monday, and if we ambush them there with combined forces, I'm sure we can get them to commit to a date. I suggest you make your husband warm up the aerial as soon as you get this.</p><p>Your Loving Sister,</p> <p>Lienne </p> </body></html>"]