["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>One</p><p>Richmond, Virginia</p><p>\"Be kind to dragons, for thou art crunchy when roasted and taste good with ketchup.\"</p><p>Dr. Channon MacRae paused in her note-taking and arched a brow at the peculiar comment. She'd been staring at the famous Dragon Tapestry for hours, trying to deci­pher the Old English symbolism, and in all this time no one had disturbed her.</p> <p>Not until now.</p><p>With her most irritated look, she pulled her pen away from her notepad and turned.</p><p>Then she gaped.</p><p>No annoying, irreverent little man here. He was a tall, mind-blowingly sexy god who dominated the small mu­seum room with a presence so powerful that she wondered how on earth he had entered the building without shaking it to its foundations.</p><p>Never in her life had she beheld anything like him or the seductive smile he flashed at her.</p> <p>Good grief, she couldn't take her eyes off him.</p><p>Standing at least six feet five, he towered over her av­erage height. His long black hair was pulled back into a sleek ponytail, and he wore an expensively tailored black suit and overcoat that seemed at odds with his unorthodox hair yet perfectly fitting with his regal aura.</p><p>But the most peculiar thing of all was the tattoo cov­ering the left half of his face. A faded dark green, it spi-raled and curled from his hairline to his chin like some ancient symbol.</p><p>On anyone else such a mark would be freakish or strange, but this man wore it with dignity and presence— like a proud birthright.</p><p>Yet it was his eyes that captivated her most. A rich, deep, greenish-gold, they were filled with such warm in­telligence and vitality that it left her completely breathless.</p><p>His grin was both boyish and roguish and framed by inviting dimples that enchanted her. \"Rendered you speechless, eh?\"</p> <p>She loved the sound of his voice, which was laced with an accent she couldn't quite place. It seemed a unique blending of the British and Greek. Not to mention, deep and provocative.</p><p>\"Not quite speechless,\" she said, resisting the urge to smile back at him. \"I'm just wondering why you would say such a thing.\"</p><p>He shrugged his broad shoulders nonchalantly as his golden gaze dropped to her lips, making her want to lick them. Worse, his prolonged stare sent a rush of desire coiling though her.</p><p>Suddenly, it was so extremely warm in this little glass room that she half expected the gallery windows to fog up.</p><p>He folded his hands casually behind his back, yet he seemed coiled for action, as if he were ready and alert to take on anyone who threatened him.</p><p>What a strange image to have ...</p><p>When he spoke again, his deep voice was even more seductive and enticing than it had been before, almost as if it were weaving some kind of magical spell around her. \"You had such a serious frown while you were staring at the tapestry that it made me wonder what you would look like with a smile in its place.\"</p><p>Oh, the man was beguiling. And just a little too cock­sure of his appeal, judging by his arrogant stance. No doubt he could get any woman who caught his eye.</p> <p>Channon swallowed at the thought as she glanced down at her tan corduroy jumper and her hips, which were not the fashionable, narrow kind. She'd never been the type of woman who drew the notice of a man like this. She'd been lucky if her average looks ever garnered her a second glance at all.</p><p>Mr. Do-Me-Right-Now must have lost a bet or some­thing. Why else would he be speaking to her?</p><p>Still, there was an air of danger, intrigue, and power about him. But none of deceit. He appeared honest and, strangely enough, interested in her.</p><p>How could that be?</p><p>\"Yes, well,\" she said, taking a step to her left as she closed her pad and slid her pen down the spiral coil, \"I don't make it my habit to converse with strangers, so if you'll excuse me...\"</p><p>\"Sebastian.\"</p><p>Startled by his response, she paused and looked up. \"What?\"</p><p>\"My name is Sebastian.\" He held his hand out to her. \"Sebastian Kattalakis. And you are?\"</p><p>Completely stunned and amazed that you 're talking to me.</p><p>She blinked the thought away. \"Channon,\" she said be­fore she could stop herself. \"Shannon with a C\"</p><p>His gaze burned her while a small smile hovered at the edges of those well-shaped lips and he flashed the tiniest</p><p>bit of his dimples. There was an indescribable masculine aura about him that seemed to say he would be far more at home on some ancient battlefield than locked inside this museum.</p><p>He took her cold hand into his large, warm one. \"So very pleased to meet you, Shannon with a C.\"</p><p>He kissed her knuckles like some gallant knight of long ago. Her heart pounded at the feel of his hot breath against her skin, of his warm lips on her flesh. It was all she could do not to moan from the sheer pleasure of it.</p><p>No man had ever treated her this way—like some treas­ured lady to be quested for.</p><p>She felt oddly beautiful around him. Desirable.</p><p>\"Tell me, Channon,\" he said, releasing her hand and glancing from her to the tapestry. \"What has you so in­terested in this?\"</p><p>Channon looked back at it and the intricate embroidery that covered the yellowed linen. Honestly, she didn't know. Since she'd first seen it as a little girl, she'd been in love with this ancient masterpiece. She'd spent years studying the detailed dragon fable that started with the birth of a male infant and a dragon and moved forward through ten feet of fabric.</p><p>Scholars had written countless papers on their theories of its origin. She, herself, had done her dissertation on it, trying to link it to the tales of King Arthur or to Celtic tradition.</p><p>No one knew where the tapestry had come from or even what story it related to. For that matter, no one knew who had won the fight between the dragon and the warrior.</p><p>That was what intrigued her most of all.</p><p>\"I wish I knew how it ended.\"</p><p>He flexed his jaw. 'The story has no ending. The battle between the dragon and the man lives on unto today.\"</p><p>She frowned at him. He appeared serious. \"You think so?\"</p><p>\"What?\" he asked good-naturedly. \"You don't believe me?\"</p><p>\"Let's just say I have a hefty dose of doubt.\"</p><p>He took a step forward, and again his fierce, manly presence overwhelmed her and sent a jolt of desire through her. \"Hmmm, a hefty dose of doubt,\" he said, his voice barely more than a low, deep growl. \"I wonder what I could do to make you believe?\"</p><p>She should step back, she knew it. Yet she couldn't make her feet cooperate. His clean, spicy scent invaded her head and weakened her knees.</p><p>What was it about this man that made her want to stand here talking to him?</p><p>Oh, to heck with that. What she really wanted to do was jump his delectable bones. To cup that handsome face of his in her hands and kiss his lips until she was drunk from his taste.</p><p>There was something seriously wrong here.</p><p>Mayday. Mayday.</p><p>\"Why are you here?\" she asked, trying to keep her lech­erous thoughts at bay. \"You hardly look like the type to study medieval relics.\"</p><p>A wicked gleam came into his eyes. \"I'm here to steal it.\"</p><p>She scoffed at the idea, even though something inside her said it wouldn't be too much of a stretch to buy that explanation. \"Are you really?\"</p><p>\"Of course. Why else would I be here?\"</p><p>\"Why else, indeed?\"</p><p>Sebastian didn't know what it was about this woman that drew him so powerfully. He was involved in grave matters that required his full attention, yet for the life of him, he couldn't take his gaze from her.</p><p>She wore her honey-brown hair swept up so that it cas­caded in riotous waves from a silver clip of old Welsh design. Several strands of it had come free of the clip to</p><p>dangle haphazardly around her face as if the strands had a life of their own.</p><p>How he longed to set free that hair and feel it sliding through his fingers and brushing against his naked chest.</p><p>He dropped his gaze down over her lush, full body and stifled his smile. Her dark blue shirt wasn't buttoned prop­erly and her socks didn't match.</p><p>Still, she drove him crazy with desire.</p><p>She wasn't the kind of woman who normally drew his interest, and yet...</p><p>He was beguiled by her and her crystal blue gaze that glowed with warm curiosity and intelligence. He longed to sample her full, moist lips, to bury his face in the hol­low of her throat where he could drink in her scent.</p><p>Gods, how he yearned for her. It was a need borne of such desperation that he wondered what kept him from taking her into his arms right now and satisfying his cu­riosity.</p><p>He'd never been the kind of man to deny himself carnal pleasures—especially not when the beast inside him was stirred. And this woman stirred that deadly part of him to a dangerous level.</p><p>Sebastian had only come into the museum to get the lay of it for tonight and to find out where they housed the tapestry. He hadn't been looking for a woman to pass the lonely night with until he could return home where he would be ... well, lonely again.</p><p>However, he still had hours before he could leave. Hours that he would much rather spend gazing into her eyes than waiting in his hotel room.</p><p>\"Would you care to join me for a drink?\" he asked.</p><p>She looked startled by his question. But then he seemed to have that effect on her. She was nervous around him, a bit jumpy, and he longed to set her at ease.</p><p>\"I don't go out with men I don't know.\"</p><p>\"How can you get to know me unless you ...\"</p><p>\"Really, Mr. Kat—\"</p><p>\"Sebastian.\"</p><p>She shook her head at him. \"You are persistent, aren't you?\"</p><p>She had no idea.</p><p>Suppressing the predator inside him, Sebastian put his hands in his pockets to keep from reaching out to her and scaring her off. \"I'm afraid it's ingrained in me. When I see something I want, I go after it.\"</p><p>She arched a brow at that and gave him a suspicious look. \"Why on earth would you want to talk to me?\"</p><p>He was aghast at her question. \"My lady, do you not own a mirror?\"</p><p>\"Yes, but it's not an enchanted one.\" She turned away from him and started away.</p><p>Moving with the incredible speed of his kind, Sebastian pulled her to a stop.</p><p>\"Look, Channon,\" he said gently. \"I fear I have bungled this. I just...\" He stopped and tried to think of the best way to keep her with him for a while longer.</p><p>She looked to his hand, which still gripped her elbow. He reluctantly let go, even though every part of his soul screamed for him to hold her by his side, regardless of the consequences. She was a woman with her own mind. And the first law of his people ran through his head: Noth­ing a woman gives is worth having unless she gives it of her own free will.</p><p>It was the one law not even he would break.</p><p>\"You what?\" she asked softly.</p><p>Sebastian drew a deep breath as he fought down the animal part of himself that wanted her regardless of right or laws, the part of him that snarled with a need so fierce that it scared him.</p><p>He forced a charming smile to his lips. \"You seem like a very nice person, and there are so few of you in this world that I would like to spend a few minutes with you. Maybe some of it might rub off.\"</p><p>Channon laughed in spite of herself.</p><p>\"Ah,\" he teased, \"so you can smile.\"</p><p>\"I can smile.\"</p><p>\"Will you join me?\" he asked. \"There's a restaurant on the corner. We can walk there, in plain sight of the world. I promise, I won't bite unless you ask me to.\"</p><p>Channon frowned lightly at him and his quirky humor. What was it about him that made him so irresistible? It was unnatural. \"I don't know about this.\"</p><p>\"Look, I promise I'm not psychotic. Eccentric and id­iosyncratic, but not psychotic.\"</p><p>She still wasn't completely sure about that. \"I'll bet the prisons are full of men who have told women that.\"</p><p>\"I would never hurt a woman, least of all you.\"</p><p>There was such sincerity in his voice that she believed him. Even more convincing, she didn't feel any inner warnings, no little voice in her head telling her to run.</p><p>Instead, she was drawn to him and felt a most peculiar kind of serenity in his presence, almost as if she were supposed to be with him. \"Down the street?\"</p><p>\"Yes.\" He offered her his arm. \"C'mon. I promise I'll keep my fangs hidden and my mind control to myself.\"</p><p>Channon had never done anything like this in her life. She was a woman who had to know a guy for a long time before she'd even consider a date.</p><p>Yet she found herself pulling on her coat and placing her hand in the crook of his arm, where she felt a muscle so taut and well formed that it sent a jolt through her.</p><p>By the feel of that arm, she could tell his fashionable black suit and overcoat hid one incredible body.</p><p>\"You seem so different,\" she said as he walked her out of the room. \"Something about you is very Old World.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He opened the glass door that led to the museum's foyer. \"Old being the operative word.\"</p><p>\"And yet you're very modern.\"</p><p>\"A Renaissance man trapped between cultures.\"</p> <p>\"Is that what you are?\"</p><p>He cast a playful sideways look to her. \"Honestly?\"</p><p>\"Yes.\"</p><p>\"I'm a dragon slayer.\"</p><p>She laughed out loud.</p> <p>He scoffed. \"Again you don't believe me.\"</p><p>\"Let's just say it's no wonder you said you wanted to steal the tapestry. I suppose there's not much call for slay­ing a mythological beast, especially in this day and age.\"</p><p>Those greenish-gold eyes teased her unmercifully. \"You don't believe in dragons?\"</p><p>\"No, of course not.\"</p><p>He tsked at her. \"You are so skeptical.\"</p><p>\"I'm practical.\"</p> <p>Sebastian ran his tongue over his teeth as a sly half-smile curved his lips. A practical woman who didn't be­lieve in dragons yet studied dragon tapestries and wore a misbuttoned shirt. Surely there wasn't another soul like her in any time or place. And she had the strangest effect on his body.</p><p>He was already hard for her, and they were barely touching. Her grip on his arm was light and delicate, as if she was ready to flee him at any moment.</p><p>That was the last thing he wanted, and that surprised him most of all.</p><p>A reclusive person, he only interacted with others when his physical needs overrode his desire for solitude. Even then, those encounters were brief and limited. He took his lovers for one night, making sure they were as well sated as he, then he quickly returned to his solitary world.</p><p>He'd never dawdled with idle conversation. Never really cared to get to know more about a woman than her name and the way she liked to be touched.</p><p>But Channon was different. He liked the cadence of her voice and the way her eyes sparkled when she talked. Most of all, he liked the way her smile lit up her entire face when she looked at him.</p><p>And the sound of her laughter... He doubted if the angels in heaven could make a more precious melody.</p><p>Sebastian opened the door to the dark restaurant and held it for her while she entered. As she swept past him, he let his gaze travel down the back of her body. He hardened even more.</p> <p>What he wouldn't give to have her warm and naked in his arms so that he could run his hands down her full curves, nibble the flesh of her neck, and hold her to him as he slowly slid himself deep inside her while she writhed to his touch.</p><p>Sebastian forced himself to look away from Channon and to speak to the hostess. He sent a mental command to the unknown woman to sit them in a secluded corner. He wanted privacy with Channon.</p><p>How he wished he'd met her sooner. He'd been in this cursed city for well over a week, waiting for the oppor­tunity to go home, where if not the comfort of warmth, he at least had the comfort of familiarity. He'd spent his nights in this city alone, prowling the streets restlessly as he bided his time.</p><p>At dawn, he would have to leave. But until then, he intended to spend as much time with Channon as he could, letting her company ease the loneliness inside him, ease the pain in his heart that had burned him for most of his life.</p><p>Channon followed the hostess through the restaurant, but all the while she was aware of Sebastian behind her— aware of his hot, predatorial gaze on her body and the way he seemed to want to devour her.</p><p>But even more unbelievable was the fact that she wanted to devour him. No man had ever made her feel so much like a woman or made her want to spend hours exploring his body with her hands and mouth.</p><p>\"You're nervous again,\" he said after they were seated in a dark corner in the back of the pub.</p><p>She glanced up from the menu to catch sight of those greenish-gold eyes that reminded her of some feral beast. \"You are incredibly perceptive.\"</p><p>He inclined his head toward her. \"I've been accused of worse.\"</p><p>\"I'll bet you have,\" she teased back. Indeed, he had the presence of an outlaw. Dangerous, dark, seductive. \"Axe you really a thief?\"</p><p>\"Define the term thief.\"</p><p>She laughed even though she wasn't quite sure if he was joking or serious.</p><p>\"So tell me,\" he said as the waitress brought their drinks, \"what do you do for a living, Shannon with a C?\"</p><p>She thanked the waitress for her Coke, then looked to Sebastian to see how he would deal with her occupation. Most men were a bit intimidated by her job, though she'd never been able to figure out why. \"I'm a history professor at the University of Virginia.\"</p><p>\"Impressive,\" he said, his face genuinely interested. \"What cultures and times do you specialize in?\"</p><p>She was amazed he knew anything about her job. \"Mostly preNorman Britain.\"</p><p>\"Ah. Hwaet we Gar-Dena in gear-dagum peod-cyninga prym gefrunon, hu da aephelingas ellen fremedon.\"</p><p>Channon was floored by his Old English. He spoke it as if he'd been born to it. Imagine a man so handsome knowing a subject so dear to her heart.</p><p>She offered him the translation. \"So. The Spear-Danes in days gone by and the kings who ruled them had cour­age and greatness. We have heard of those princes' heroic campaigns.\"</p><p>His inclined his head to her. \"You know your Beowulf well.\"</p><p>\"I've studied Old English extensively, which, given my job, makes sense. But you don't strike me as a historian.\"</p><p>\"I'm not. Rather, I'm a sort of reenactor.\"</p><p>That explained the way he looked. Now his presence in the museum and knightly air of authority made sense to her.</p><p>\"Is your study of the Middle Ages what had you in the museum today?\" he asked.</p><p>She nodded. \"I've studied the tapestry for years. I want to be the person who finally unravels the mystery behind it.\"</p><p>\"What would you like to know?\"</p><p>\"Who made it and why? Where the story of it comes from. For that matter, I would love to know how the mu­seum got it. They have no record of when they acquired it or from whom it was purchased.\"</p><p>His automatic answers surprised her. \"They bought it in 1926 from an anonymous collector for fifty thousand dollars. As for the rest, it was made by a woman named Antiphone back in seventh-century Britain. It's the story of her grandfather and his brother and their eternal strug­gle between good and evil.\"</p><p>His gaze was so sincere that she could almost believe him. In a strange way, it made sense, since the tapestry had no ending.</p><p>But she knew better. \"Antiphone, huh?\"</p><p>He shook his head. \"You just don't believe anything I tell you, do you?\"</p><p>\"Why, kind sir,\" she said impishly with a mock English accent. \" 'Tis not that I don't believe you, but as a his­torian I must align myself with fact. Have you any proof of this Antiphone or transaction?\"</p><p>\"I do, but I somehow doubt you would appreciate my showing it to you.\"</p><p>\"And why is that?\"</p><p>\"It would scare the life out of you.\"</p><p>Channon sat back at that, unsure of how to take it. She didn't really know what to make of the man sitting across from her. He kept her on edge all the while he lured her toward his danger. Lured her against all her reason.</p><p>They remained quiet as their food was placed on the table.</p><p>While they ate, Channon studied him. The candlelight in the pub danced in his eyes, making them glow like a cat's. His hands were strong and callused—the hands of a man who was used to hard work—yet he had the air of wealth and privilege, the air of a powerful man who made his own rules.</p><p>He was a total enigma, a walking dichotomy who made her feel both safe and threatened.</p><p>'Tell me, Channon,\" he said suddenly, \"do you like teaching?\"</p><p>\"Some days. But it's the research I like best. I love digging through old manuscripts and trying to piece to­gether the past.\"</p><p>He gave a short half laugh. \"No offense, but that sounds incredibly boring.\"</p><p>\"I imagine dragon-slaying is much more action-oriented.\"</p><p>\"Yes, it is. Every moment is completely unpredictable.\"</p><p>She wiped her mouth as she watched him eat with per­fect European table manners. He was definitely cultured, yet he seemed oddly barbaric. \"So, how do you kill a dragon?\"</p><p>\"With a very sharp sword.\"</p><p>She shook her head at him. \"Yes, but do you call him out? Do you go to him ... ?\"</p><p>\"The easiest way is to sneak up on him.\"</p><p>\"And pray he doesn't wake up?\"</p><p>\"Well, it makes it more challenging if he does.\"</p><p>Channon smiled. She was so drawn to that infectious wit of his. Especially since he didn't seem to notice the women around them who were ogling him while they ate. It was as if he could only see her.</p><p>As a rule, she stunk at this whole male-female thing. Her last boyfriend, a D.C. correspondent, had educated her well on every personal and physical flaw she pos­sessed. The last thing she was looking for was another</p><p>relationship in which she wasn't on equal terms with the man.</p><p>For her next love interest, she wanted someone just like her—a historian of average looks whose life revolved around research. Two comfortable peas in a pod.</p><p>She wasn't looking for some hot, mysterious stranger who made her blood burn with desire.</p><p>Channon, would you listen to yourself and what you 're saying! You are insane not to want this man!</p><p>Perhaps. But things like this never happened to her.</p><p>\"You know,\" she said to him, \"I keep having this really weird feeling that you're going to take me someplace later and tie me up naked so that your friends can come laugh at me.\"</p><p>He arched a brow at her. \"Does that happen to you often?\"</p><p>\"No, never, but this night has the makings for a Twi­light Zone episode.\"</p><p>\"I promise no Rod Serling voice-overs. You're safe with me.\"</p><p>And for some reason that made absolutely no sense whatsoever, she believed him.</p><p>Channon spent the next few hours having the dinner and conversation of her life. Sebastian was incredibly easy to talk to. Worse, he set her hormones on fire.</p><p>The longer they were together and the more laughs they shared, and the more incredible he seemed.</p><p>She glanced at her watch and gasped. \"Did you know it's almost midnight?\"</p><p>He checked his watch.</p><p>\"I hate to cut this short,\" she said, placing her napkin on the table and sliding her chair back, \"but I have to go or I'll never get a taxi out of here.\"</p><p>He placed his hand lightly on her arm to keep her at the table. \"Why don't you let me drive you home?\"</p><p>Channon started to protest, but something inside her refused. After the evening they had spent together, she</p><p>felt oddly at ease with him. There was an aura about him that was so comforting, so open and welcoming.</p><p>He was like a long lost friend.</p><p>\"Okay,\" she said, relaxing.</p><p>He paid for their food. Then he helped her up and into her coat and led her from the restaurant.</p><p>Channon didn't speak as they made their way toward his car down the street, but she felt his magnetic, mas­culine presence with every single cell of her body.</p><p>Though not a social butterfly by any account, she'd had plenty of dates in her life. She'd had a number of boy­friends and even a fiance, but none of them had ever made her feel the way this stranger did.</p><p>Like he fit some missing part of her soul.</p><p>Girl, you are crazy.</p><p>She must be.</p><p>Channon paused as they neared his sporty gray Lexus. \"Someone travels in style.\"</p><p>Winking devilishly at her, Sebastian opened the car door. \"Well, I would turn into a dragon and fly you home, but something tells me you would protest.\"</p><p>\"No doubt. I imagine the scales would also chafe my skin.\"</p><p>'True. Not to mention, I once learned the hard way that they really do call the military out on you. You know, fighter jets are hard to dodge when you have a forty-foot wingspan.\" He closed her door and walked to his side of the car.</p><p>She laughed yet again, but then she'd been doing that most of the night. Goodness, she really liked this man.</p><p>Sebastian got into the car and felt his body jerk the instant they were locked inside together. Her feminine scent permeated his head. She was so close to him now that he could almost taste her.</p><p>All night long he had listened to the dulcet sound of her smooth Southern drawl, watched her tongue and lips move as he imagined what they would feel like on his</p><p>body, imagined her in his arms while he made love to her until she cried out from pleasure.</p><p>His attraction to her stunned him. Why did he have to feel this now, when he couldn't afford to stay in her time and explore more of her?</p><p>Cursed Fates. How they loved to tamper in mortal lives.</p><p>Pushing the thought out of his mind, he drove her to the hotel where she was staying. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"You don't live here?\" he asked as he parked in the lot.</p><p>\"Just here for the weekend to study the tapestry.\" She unbuckled her seat belt.</p><p>Sebastian got out and opened her door, then walked her to her room.</p> <p>Channon hesitated at the door as she looked up at him and the searing heat in his captivating eyes. The man was so hot and sexy in the most dangerous of ways.</p><p>She wondered if she would ever see him again. He hadn't asked for her number. Not even her email.</p><p>Damn.</p><p>\"Thank you,\" she said. \"I had a really good time to­night.\"</p><p>\"I did, too. Thanks for joining me.\"</p> <p>Kiss me. The words rushed across her mind unexpect­edly. She really wanted to know what this man felt like against her.</p><p>To her amazement, she found out as he pulled her into his arms and covered her lips with his.</p><p>Sebastian growled at the feel of her as he fisted his hands against her back. He clutched her to him as every fiber of his body burned and ached to possess her. Her tongue swept against his, teasing him, tormenting him.</p><p>She brushed her hand against the nape of his neck, sending chills all over his body, making him so hard for her that he throbbed painfully. He closed his eyes while he let all of his senses experience her. Her mouth tasted of honey, and her hands were soft and warm against his</p><p>skin. She smelled of woman and flowers, and he thrilled at the sound of her ragged breathing as she answered his passion with her own.</p><p>Take her. The animal inside him stirred with a fierce snarl. It snapped and clawed at the human part of him, demanding he cede his humanity to it. It wanted her.</p> <p>He was almost powerless against the onslaught, and his hands trembled from the force of holding himself back. He growled from the effort of it.</p><p>Channon moaned at the fierce feel of his powerful arms locked around her. She was pressed so tight against his chest that she could feel his heart pounding against her breasts.</p><p>His intensity surrounded her, filled her, made her burn with volcanic need. All she could think of was stripping his clothes off him and seeing if his body really was as spectacular as it felt.</p><p>He pressed her back against her door, pinning her to it as he deepened his kiss. His warm, masculine scent filled her senses, overwhelming her.</p><p>He kissed his way from her lips and down across her cheek, then he buried his lips against her neck. \"Let me make love to you, Channon,\" he breathed in her ear. \"I want to feel your warm, soft body against mine. Feel your breath on my naked skin.\"</p><p>She should be offended by his suggestion. They barely knew each other. Yet no matter how hard she tried to talk herself out of this, she couldn't.</p><p>Deep inside, she wanted the same thing.</p><p>Against all reason—all sanity—she ached for him.</p> <p>Never in her life had she done anything like this. Not once. Yet she found herself opening the door to her room and letting him in.</p><p>Sebastian breathed deeply in relief as he struggled for control. He'd never come so close to using his powers on a woman. It was forbidden for his kind to interfere with human freewill unless it was in defense of their lives or</p><p>someone else's. He'd bent that rule a time or two to serve his purposes.</p><p>Tonight, had she refused him, he held no doubt he would have broken it.</p><p>But she hadn't refused him. Thank the gods for small favors.</p><p>He watched her as she set her key card on the dresser. She hesitated and he felt her nervousness.</p><p>\"I won't hurt you, Channon.\"</p><p>She offered him a tentative smile. \"I know.\"</p><p>He cupped her face in his hands and stared into those celestial blue eyes. \"You are so beautiful.\"</p><p>Channon held her breath as he pulled her to him and recaptured her lips. None of this night made sense to her. None of her feelings. She clung to Sebastian as she sought for an explanation why she had let him into her room.</p><p>Why she was going to make love to him. A stranger. A man she knew nothing about. A man she would like as not never see again.</p><p>Yet none of that mattered. All that mattered was this moment in time—holding him close to her and keeping him here in her room for as long as she could.</p><p>She felt his hands free her hair to cascade down her back. He slid her coat from her shoulders, and she let it fall to the floor. Running his hands up her arms, he pulled back to stare down at her with hungry eyes. No man had ever given her such a look. One of fierce longing, of total possession.</p><p>Scared and excited, she helped him from his overcoat. His eyes dark with unsated passion, he removed his jacket and tossed it aside without care that it would be wrinkled later. So much for his impeccable suit. It thrilled her that she meant more to him than that.</p><p>He loosened his tie and pulled it over his head.</p><p>His eyes softened as she moved to unbutton his shirt. He caught her right hand in his and nibbled her fingertips, sending ribbons of pleasure through her, then he led her</p><p>hand to his buttons and watched her intently.</p><p>Hot and aching for him, Channon worked the buttons through the buttonholes of his shirt. She trailed her gaze after her hands, watching as she bared his skin inch by slow, studied inch. Oh, good heaven, the man had a body that had been ripped from her dreams. His muscles were tight and perfect and covered by the most luscious tawny skin she'd ever seen. Dark hairs dusted his skin, making him seem even more like a predator, even more dangerous and manly.</p><p>Channon paused at the hard abs that held several scars. She traced her hand over them, feeling his sharp intake of breath as her fingers brushed the raised, lighter skin. \"What happened?\"</p><p>\"Dragons have sharp talons,\" he whispered. \"Some­times I don't get out of the way quickly enough.\"</p><p>She placed her hand over one really nasty-looking scar by his hipbone. \"Maybe you should fight smaller drag­ons.\"</p><p>\"That wouldn't be very sporting of me.\"</p><p>She swallowed as he removed his shirt and she saw his unadorned chest for the first time. He was scrumptious. She ran her palm over his taut, hard pecs, delighting in the way they felt under her hands. She ran her fingers up his chest and across his lean, hard shoulder, which was tattooed with a dragon. \"You do like dragons, don't you?\"</p><p>He laughed. \"Yes, I do.\"</p><p>Sebastian was doing his best to be patient, to let her get used to him. But it was hard when all he really wanted to do was lay her down on the bed and relieve the fierce ache in his loins.</p><p>He nibbled at her neck as he unfastened the buttons on her jumper and let it fall to the floor. She stood before him wearing nothing but her shoes and her misbuttoned shirt. It was the sexiest thing he'd ever seen in his four hundred years of living. \"Do you always button your shirts like this?\"</p><p>She looked down and gasped. \"Oh, good grief. I was in a hurry this morning and—\"</p><p>He stopped her words with a kiss. \"Don't apologize,\" he whispered against her lips. \"I like it.\"</p><p>\"You're a very strange man.\"</p><p>\"And you are a goddess.\"</p><p>Channon shook her head at him as he picked her up in his arms and moved with her toward the bed. She placed her hands over his muscles, which were taut from his strain. The feel of them made her mouth water. He laid her gently on the mattress, then ran his hands down her legs to her feet so he could remove her shoes and socks and toss them over his shoulder.</p><p>Her heart pounding, Channon watched as he nibbled his way over her hip to her stomach. He moved his hands to her shirt and slowly unbuttoned it, kissing and licking every piece of her skin that he bared.</p><p>She moaned at the sight and feel of his mouth on her, at the way he seemed to savor her body. Spikes of plea­sure pierced her stomach as her body throbbed and ached for him to fill her.</p><p>She wanted him inside her so much that she feared she might burst into flames from the fire tearing through her body.</p><p>Sebastian felt her wetness on his skin as he slid himself against her. His body screamed for hers, but he wasn't through with her yet. He wanted to savor her, to commit every inch of her lush body to his memory.</p><p>What he felt for her amazed him. It was unlike anything he'd ever experienced. On some strange level she gave him peace, sanctuary. She filled the loneliness in his bat­tered heart.</p><p>He buried his face in her neck while her hardened nip­ples teased the flesh of his chest and her hands roamed over his back. \"You feel so good under me,\" he whispered as he soaked her essence into him.</p><p>Channon took a deep, ragged breath. His words de­lighted her.</p><p>He nuzzled her neck, his whiskers softly teasing her flesh while his hand skimmed over her body to touch the burning ache between her legs. She hissed at the pleasure of his fingers toying with her and arched her back against him as he slowly dragged his mouth from her neck to her breast. His tongue swept against the hardened tip, making her tingle and throb.</p><p>She bit her lip as a wave of fear went through her. \"I want you to know that I don't normally do this sort of thing.\"</p><p>He lifted himself up on his arms to look down at her. He pressed his hips between her legs so that she could feel the large bulge of him while his expensive wool pants slightly chafed her inner thighs. The hot feel of him there was enough to drive her wild with need.</p><p>\"If I thought you did, my lady, I wouldn't be here with you now.\" His gaze intensified, holding her enthralled. \"I see you, Channon. You and the barriers you have around you that keep everyone at a distance.\"</p><p>\"And yet you're here.\"</p><p>\"I'm here because I know the sadness inside you. I know what it feels like to wake in the morning, lost and lonely and aching for someone to be there with me.\"</p><p>Her heart clenched as he spoke the very things that really were a part of her. \"Why are you alone? I can't imagine a man so handsome without a line of willing women fighting behind him.\"</p><p>\"Looks aren't all there is in this world, my lady. They are certainly no protection against being alone. Hearts never see through the eyes.\"</p><p>Channon swallowed at his words. Did he mean them? Or was this all some lie he was telling her to make her feel better about what she was doing with him? She didn't know.</p><p>But she wanted to believe him. She wanted to comfort the torment she saw in his hungry eyes.</p><p>He pulled away from her and removed his shoes and pants. Channon trembled as she finally saw him com­pletely naked. Like a dangerous, dark beast moving sin­uously in the moonlight, he was incredible. Absolutely stunning.</p><p>Every inch of him was muscled and toned and covered by the most scrumptious tanned skin she'd ever beheld. The only flaws on his perfect body were the scars marking his back, hips, and legs. They really did look like claw and bite marks from some ferocious beast.</p><p>When he rejoined her on the bed, she pulled the tie from his hair, letting it fall forward to surround his sin­fully handsome face.</p><p>\"You look like some barbaric chieftain,\" she said, run­ning her hand through the silkiness of his unbound hair. She traced the intricate lines of the tattoo on his face.</p><p>\"Mmm,\" he breathed, taking her breast in his mouth.</p><p>Channon held his head to her as his tongue teased her. Ripples of pleasure tore through her.</p><p>She ran her hands down his muscled ribs, then along his arms and shoulders as she drifted through a strange hazy fog of pleasure. Something strange was happening to her. With every breath he expelled, it was like his touch intensified. Multiplied. Instead of one tongue stroking her, she swore she could feel a hundred of them. It was as if her skin was alive and being massaged all over at once.</p><p>Sebastian hissed as his powers ran through him. Sex always heightened the senses of his breed. The intensity of physical pleasure was highly sought by his people for the elevation it gave them and their magic. The beauty of it was that the surge of power usually lasted a full day, and in the case of truly great sex, two days.</p><p>Channon was definitely a two-day high.</p><p>He looked into her eyes to see her gaze unfocused and wild. His powers were affecting her, too. The physical</p><p>stimulation to a human was even greater than it was to his breed.</p><p>He knew the moment she lost herself to the ecstasy of his sorcerer's touch. Her barriers and inhibitions gone, she threw her head back and cried out as an orgasm tore through her. \"That's it,\" he whispered in her ear. \"Don't fight it.\"</p><p>She didn't. Instead, she turned toward him and grabbed feverishly at his body. Sebastian groaned as he obliged her eagerness.</p><p>She sought out every inch of his flesh with her hands and mouth. He rolled over and pulled her on top of him, where she straddled his waist, letting him feel her wetness on the hollow of his stomach. He knew she was past the ability to speak now and a part of him regretted that. She was all need. All hot, demanding sex.</p><p>Her eyes wild and hungry, she took his hands in hers and led them to her breasts as she slid herself against his swollen shaft. She leaned forward to drag her tongue along the edge of his jaw as she nibbled her way to his lips. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She kissed him passionately, then pulled back. \"What have you done to me?\" she asked hoarsely, her words surprising him.</p><p>\"It's not exactly me,\" he said honestly. \"It's something I can't help.\"</p><p>She moaned and writhed against him, making his body burn even more. \"I need you inside me, Sebastian. Please.\"</p> <p>He wasted no time obliging her. Rolling her over, he curled his body around hers as they lay with her back to his front. He draped her leg over his waist.</p><p>He tucked her head beneath his chin and held her close as he drove himself deep inside her sleek wetness. He growled at the warm, wet feel of her while she leaned her head back into his shoulder and cried out.</p><p>Channon had never felt anything like this. No man had</p><p>ever made love to her in such a manner. Her right hip was braced against his inner thigh while he used his left knee to hold her left leg up so that he had access to her body from behind her. She didn't know how he managed it, but his strokes were deep and even, and they tore through her with the most intense pleasure she had ever known. He was so hard inside her, so thick and warm.</p><p>And she wanted more of his touch. More of his power.</p> <p>He slid his hand down over her stomach, then lower until he touched her between her legs. She hissed and writhed as pleasure tore through her while his fingers rubbed her in time to his strokes. And still it felt as if a thousand hands caressed her, as if she were being bathed all over by his touch, his scent.</p><p>Out of her mind with ecstasy, she met him lush stroke for lush stroke. Her body felt as if it held a life of its own, as if the pleasure of her was its own entity. She needed even more of him.</p><p>Sebastian was awed by her response to him. No human woman had ever been like this. If he didn't know better, he'd swear she was part Drakos. She dug her nails into the flesh of the arms he had wrapped around her, and when she came again she screamed out so loudly, he had to quickly put a dampening spell around them to keep others from hearing her.</p><p>His powers surging, he smiled wickedly at that. He loved satisfying his partner, and with Channon he took even more delight than normal.</p><p>She rolled slightly in his arms, capturing his lips in a frenzied kiss.</p><p>Sebastian cupped her face as he quickened his strokes and buried himself even deeper in her body. She felt so incredibly good to him. So warm and welcoming. So per­fect.</p> <p>He held her close against him as his heart pounded and his groin tightened even more. The feel of her, the taste of her, cascaded through his senses, making him reel,</p><p>making him ache, yet at the same time soothing him.</p><p>The beast in him roared and snapped in satisfaction while the man buried himself deep in her and shook from the force of his orgasm. With the two parts of him sated and united, it was the most incredible moment of his en­tire life.</p><p>Channon groaned as she felt his release inside her. Still wrapped around her, he pulled her even closer to his chest. She heard his ragged breathing and felt his heart pounding against her shoulder blade. The manly scent of him filled her head and her heart, making her want to stay cocooned by his body forever.</p><p>Slowly, the throbbing pleasure faded from her and left her weak and drained from the intensity of their love-making.</p><p>When he withdrew from her, she felt a tremendous sense of loss.</p><p>\"What did you do to me?\" she asked, turning onto her back to look at him.</p><p>He kissed his way across her collarbone to her lips. \"I did nothing, ma petite. It was all you.\"</p> <p>'Trust me, I've never done that before.\"</p><p>He laughed softly in her ear.</p><p>She smiled at him and dropped her gaze to the small gold medallion he wore around his neck. Odd, she hadn't noticed it before.</p><p>She traced the chain with her fingers, then took it into her hand. It was obviously quite old. Ancient Greek if she didn't miss her guess. The gold held a relief of a dragon coiled around a shield. \"This is beautiful,\" she breathed.</p><p>Sebastian looked down at her hand and covered her fingers with his. \"It belonged to my mother,\" he said, wondering why he spoke of it. It was something he'd never shared with anyone else. \"I don't really remember her, but my brother said she told him to give it to me so that I would know how much she loved me.\"</p><p>\"She died?\"</p><p>He nodded. \"I was barely six when...\" His voice trailed off as his memories of that night scorched him. Inside his head he could still hear the screams of the dying and smell the fires. He remembered the terror and the arms of his brother, Theren, pulling him to safety.</p><p>He'd always lived with the horrors of that night close to his heart. Tonight, with Channon, it didn't seem to hurt quite so much.</p><p>She ran her hand over the markings on his face. \"I'm sorry,\" she whispered, and inside his heart, he could feel her sincerity. \"I was nine when my mother died of cancer. And there's always this little piece of me that wishes I could hear the sound of her voice just one more time.\"</p><p>\"You're without family?\"</p><p>She nodded. \"I grew up with my aunt, who died two years ago.\"</p><p>He felt her ache inside his own heart and it surprised him. He hated that she was alone in the world. Like him. It was a hard way to be.</p><p>Tightening his arms, he let his body comfort her.</p><p>Channon closed her eyes as he ran his tongue around and into her ear, sending chills over her. She leaned into his arms and pulled him close for another scorching kiss. A tiny part of her wanted to beg him not to leave her in the morning. But she refused to embarrass herself.</p><p>She'd known going into this that tonight would be all they would ever have. Yet the thought of not seeing him again hurt her more than she could fathom. She literally felt that losing him would be like losing a vital part of herself.</p><p>Sebastian knew he should leave now, but something inside him rebelled.</p><p>It wasn't much longer until dawn. He still had to re­trieve the tapestry and return home.</p><p>But right now, all he wanted was to spend a little more time holding this woman, keeping her in the warm shelter of his arms.</p><p>\"Sleep, Channon,\" he whispered as he sent a small sleeping spell to her. If she were awake and looking at him, he would never be able to let her go.</p><p>Immediately, she went limp in his arms.</p><p>Sebastian ran his fingers over the delicate curve of her cheek as he watched her. She was so beautiful by his side.</p><p>He clenched his hand against her silken curls and took a deep breath in her hair. Her floral scent reminded him of warm summer days of shared laughter and friendship. Her bare hips were nestled perfectly against his groin, her lower back against his stomach. Her smooth legs were entwined with his masculine ones. Gods, how he ached to keep her here like this.</p><p>He felt himself stirring again. He felt the need within him to take her one more time before he upheld his ob­ligation.</p><p>You must go.</p><p>As much as he hated to, he knew he had no choice.</p><p>Sighing in regret, he withdrew from the warmth of her and crept from the bed, still amazed by the night they had shared. He would never forget her. And for the first time in his life, he actually considered coming back here for a while.</p><p>But that was impossible.</p><p>His kind didn't do well in the modern world, where they were easily hunted and found. He needed wide-open spaces and a simpler world where he could have the free­dom and solitude he needed.</p><p>Clenching his teeth against the pain of necessity, he dressed silently in the dark.</p><p>Sebastian stepped away from the bed, then paused.</p><p>He couldn't leave like this, as if the night had meant nothing to him.</p><p>Pulling his mother's medallion from his neck, he placed it around Channon's and kissed her parted lips.</p><p>\"Sleep, little one,\" he whispered. \"May the Fates be kind to you. Always.\"</p><p>Then, he shimmered from her room and out into the dark night. Alone. He was always alone.</p><p>He'd long ago accepted that fact. It was what had to be.</p><p>But tonight he felt that loneliness more profoundly than he had ever felt it before.</p><p>As he rounded the hotel's building and headed toward his car, he collided with a middle-aged woman who was walking, huddled from the cold, in a worn jacket. She wore the faded uniform of a waitress and the old shoes of a woman who had no choice but to be practical.</p><p>\"Hey,\" he said as she started past him. \"Do you have a car?\"</p><p>She shook her head no.</p><p>\"You do now.\" He handed her the keys to his Lexus and pointed it out to her. \"You'll find the registration in the glove box. Just fill it out and it's yours.\"</p><p>She blinked at him. \"Yeah, right.\"</p><p>Sebastian offered her a genuine smile. He'd only bought the car to use while he'd been trapped in this time period. Where he was going, there was no need for it.</p><p>\"I'm serious,\" he said, nudging her toward it. \"No strings attached. I took a vow of poverty about fifteen minutes ago, and it's all yours.\"</p><p>She laughed incredulously. \"I have no idea who you are, but thank you.\"</p><p>Sebastian inclined his head and waited until the woman had driven off.</p><p>Cautiously, he stepped into the alley and looked around to make sure there were no witnesses. He called forth the powers of Night to shield him from anyone who might happen by, then he shifted into his alternate form. The power of the Drakos rushed through him like fire as the ions in the air around him were charged with electrical energy—electrical energy that allowed him to shed one form and shift into another.</p><p>In his case, his alternate form was that of a dragon.</p><p>Spreading his bloodred wings out to their full forty-foot span, he launched himself from his hind legs and flew into the sky, careful to stay below radar level this time.</p><p>Sebastian had one last thing to do before he could re­turn to his time. Yet even as he headed back to the mu­seum, he couldn't shake the image of Channon from his mind.</p><p>He could still see her asleep in the bed, her hair spread out around her shoulders. He could still feel the texture of the honey-laced strands in his palm.</p><p>His dragon form burned with need, and he yearned to return to her.</p><p>Not that he could. One-night stands with humans were all he dared. The risk of exposure was too great.</p><p>Sebastian crossed town in a matter of minutes and landed on the roof of the museum. He summoned the electrical field that allowed the molecules of his body to transform from animal to human and flashed back into his man form.</p><p>With a flick of his hand, he dressed himself all in black, then shimmered from the roof into the room that held the tapestry.</p><p>\"There you are,\" he said as he saw Antiphone's work again. Sadness, guilt, and grief tore through him as he recalled his baby sister's gentle face.</p><p>After he'd sold this tapestry, he had never wanted to see it again.</p><p>But now he had to have it. It was the only way to save his brother's life. Not that he should care. Damos had never given a damn about him.</p><p>After all the things Damos had done to break him, Se­bastian still couldn't turn his back on his brother and let the man die. Not when he could help it.</p><p>\"I'm a bloody fool,\" he said disgustedly.</p><p>He willed the tapestry from the museum case into his hand. Then he folded and tucked it carefully into a black leather bag to protect it.</p><p>As he began to shimmer from the room back to the roof, an odd burning started in the palm of his left hand.</p><p>\"What the... ?\"</p><p>Hissing from the pain, he dropped the case and pulled off his glove. Sebastian blew cool air across his hot skin and frowned as a round geometric design appeared in his palm.</p><p>\"No,\" he breathed in disbelief as he stared at it.</p><p>This wasn't possible, yet there was no denying what he saw and felt. Worse, there was a presence inside him, a tickling in the depth of his heart that made him curse even louder.</p><p>Against his will, he was mated.</p><p>This was a nightmare. The absolute worst kind of night­mare.</p><p>It was wrong. It had to be.</p><p>Sebastian left the museum immediately, all the while debating his next step. On the building's roof, he paused. He needed to take the tapestry back to Britain of a thou­sand years earlier. He was sworn to it. He'd destroyed Antiphone's future, and now the fate of his brother was in his hands.</p><p>But the mark ...</p><p>He couldn't leave his mate here while he went home. Nor could he stay in this time period where the danger of being inadvertently struck by an electrical charge was so strong—that was his one Achilles' heel.</p><p>Because he relied on electrical impulses to change forms, any kind of outside electrical jolt could involun­tarily transform him. It was why his kind avoided any</p><p>time period after Benjamin Franklin, the so-called Satan of his people.</p><p>But Arcadian law demanded he protect his mate.</p><p>At any cost.</p><p>Centuries of war had left the Drakos branch of the Ar­cadians virtually extinct. And since Sebastian hunted down and executed the evil animal Drakos, their kind would make it a point to track and kill his mate should they ever learn of Channon's existence. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She would be dead and it would be all his fault.</p><p>Should she die, he would never mate again.</p><p>\"Mate, my bloody hell,\" he muttered. He looked up at the clear, full moon above. \"Damn you, Fates. What were you thinking?\"</p> <p>To mate a human to an Arcadian was cruel. It happened only rarely, so rarely that he'd never even considered the possibility of it. So why did it have to happen now?</p><p>Leave her.</p><p>He should. Yet if he did, he would leave behind his only chance for a family. Unlike a human male, he was only given one shot at this. If he failed to claim Channon, he would spend the rest of his exceptionally long life. alone.</p><p>Completely alone.</p><p>No other woman would ever again appeal to him.</p> <p>He would be doomed to celibacy.</p><p>Oh bloody, damned hell with that.</p><p>There was no choice. At the end of three weeks, the mark on her human hand would fade and she would forget he'd ever existed. The mark on his Arcadian hand was eternal, and he would mourn her for the rest of his life. Even if he went back for her later, it would be too late. After the mark faded, his chance was over.</p><p>It was now or never.</p><p>Not to mention the small fact that during the three weeks she was marked by his sign, Channon would be a magnet to the Katagaria Draki who wanted him dead.</p><p>For centuries, he and the animal Katagaria had played a deadly game of cat and mouse. The Katagaria routinely sent out mental feelers for him, just as he did for them. Their psychic sonar would easily pick up his mark on Channon's body, allowing them to hone in on her.</p> <p>And if one of them were to find his mate alone without a protector ...</p><p>He flinched at the image in his mind.</p><p>No, he had to protect her. That was all there was to it.</p><p>Closing his eyes, Sebastian transformed himself into the dragon and went back to Channon's hotel, where he shifted forms again and entered her room as a man.</p><p>He was about to break nine kinds of laws.</p><p>He laughed bitterly. So what else was new? And why should he care? His people had banished him long ago. He was dead to them. Why should he abide by their laws?</p><p>He didn't care about them.</p><p>He cared for nothing. For no one.</p> <p>Yet as he stared at Channon lying asleep in the moon­light, something peculiar happened to him. A feeling of possessive need tore through him. She was his mate. His only salvation.</p><p>For whatever twisted reason, the Fates had joined them. To leave Channon here unprotected would be wrong. She had no idea the kind of enemies who would do anything to have him, enemies who wouldn't hesitate to hurt her because she was his.</p><p>Sebastian lay down by her side and gathered her into his arms. She murmured in her sleep, then snuggled into him. His heart pounded at the sensation of her breath against his neck.</p><p>He looked down and saw her right palm, which bore the same mark as his left hand, laying upright by her cheek. He'd waited an eternity for her.</p><p>After all these centuries of empty loneliness, dare he even dream of having a home again? A family?</p><p>Then again, dare he not?</p><p>\"Channon?\" he whispered softly, trying to wake her. \"I need to ask you something.\"</p><p>\"Hmm?\" she murmured in her sleep.</p><p>\"I can't remove you from your time period unless you agree to it. I need you to come with me. Will you?\"</p><p>She blinked open her eyes and looked up at him with a sleepy frown. \"Where are you taking me?\"</p><p>\"I want to take you home with me.\"</p><p>She smiled up at him like an angel, then sighed. \"Sure.\"</p><p>Sebastian tightened his arms around her as she fell back to sleep. She'd said yes. Joy ripped through him. Maybe he had done his penance after all.</p><p>Maybe, for once, he could have his one moment of respite from the past.</p><p>Holding her close, Sebastian stared out the window and waited for the first rays of dawn so that he could pulse them out of her world and into one beyond her wildest imagination.</p><p>Channon felt a strange tugging in her stomach that settled into a terrible queasiness. What on earth?</p><p>She opened her eyes to see Sebastian staring down at her. He wore an intriguing mask of black and red feathers that made the gold of his eyes stand out even more prom­inently. It reminded her of a Phantom of the Opera mask as it only covered his forehead and the left side of his face where his tattoo was.</p><p>She'd never considered masks sexy before, but on him, mmm, baby.</p><p>Even more inviting than that, he wore black leather armor over a chain mail shirt—black leather armor cov­ered in silver rings and studs that was laced down the front. The laces had come untied, leaving an enticing gap where she could see his tanned skin peeping through.</p><p>Ummm, hmmm.</p><p>Smiling, she started to speak until she realized she was</p><p>on the back of a horse. A really, really big horse.</p><p>Even more peculiar, she was dressed in a dark green gown with wide sleeves that flowed around her like some fairy-tale princess garment.</p><p>\"Okay,\" she breathed, running her hand along the in­tricate gold embroidery on her sleeve. \"It's a dream. I can cope with a dream where I'm Sleeping Beauty or some­thing.\"</p><p>\"It's not a dream,\" he said quietly.</p><p>Channon laughed nervously as she sat up in his lap and glanced around. The sun was high above as if it were well into the afternoon, and they were traveling on an old dirt road that ran perpendicular to a thick, prehistoric-looking forest.</p><p>Something was wrong. She could feel it in her bones, and she could tell by the stiffness of his body and his guarded look. He was hiding something. \"Where are we?\"</p><p>'The where of it,\" he said slowly, refusing to meet her gaze, \"isn't nearly as interesting as the when part.\"</p><p>\"Excuse me?\"</p><p>She watched the emotions flicker in his eyes, but the most peculiar one was a fleeting look of panic, as if he were nervous about answering her question. \"Do you re­member last night when I asked if I could take you home with me and you said sure?\"</p><p>Channon frowned. \"Vaguely, yes.\"</p><p>\"Well, honey, I'm home.\"</p><p>An ache started in her head. What was he talking about? \"Home? Where?\"</p><p>He cleared his throat and still refused to meet her gaze. The man was definitely hedging. But why?</p><p>\"You said you like research, right?\" he asked.</p><p>Her stomach knotted even more. \"Yes.\"</p><p>\"Consider this a unique research venture then.\"</p><p>\"Meaning what?\"</p><p>His jaw flexed. \"Haven't you ever wished you could</p><p>go back to Saxon England and find out what it was really like before the Normans invaded?\"</p><p>\"Of course.\"</p><p>\"Well, your wish is granted.\" He looked at her and flashed an insincere smile.</p><p>Okay, the guy was not Robin Williams, and unless she was missing something really important from last night, she didn't conjure him from a bottle. If he wasn't a genie...</p><p>She laughed nervously. \"What are you saying?\"</p><p>\"We're in England. Or rather we're in what will one day soon become England. Right now, this kingdom is called Lindsey.\"</p><p>Channon went completely still. She knew all about the medieval Saxon kingdom, and this ... this was not pos­sible. No, there was no way she could be here. \"You're joking with me again, aren't you?\"</p><p>He shook his head.</p><p>Channon rubbed her forehead as she tried to make sense of all this. \"Okay, you have slipped me a mickey. Great. When I sober up from this you do realize I will call the cops.\"</p><p>\"Well, it'll be about nine hundred years before there are cops to call, about a hundred more years after that before you have a phone. But I'm willing to wait if you are.\"</p><p>Channon clenched her eyes shut as she tried to think past the throbbing ache in her skull. \"So you're telling me that I'm not dreaming and I'm not drugged.\"</p><p>\"Correct on both accounts.\"</p><p>\"But I'm in Saxon England?\"</p><p>He nodded.</p><p>\"And you're a dragon slayer?\"</p><p>\"Ah, so you remember that part.\"</p><p>\"Yes,\" she said reasonably, but with every word she spoke after that, her voice crescendoed into mild hysteria.</p><p>\"What I don't remember is how the hell I got here!\" she shouted, sending several birds into flight.</p><p>Sebastian winced.</p><p>She glared at him. \"You told me there wouldn't be any Rod Serling voice-overs, yet here I am in the middle of a Twilight Zone episode. Oh, and let me guess the title of it, Night of the Terminally Stupid!\"</p><p>\"It's not as bad as all that,\" Sebastian said, trying to decide the best way to explain this to her. He didn't blame her for being angry. In fact, she was taking all this a lot better than he had dared hope. \"I know this is hard for you.\"</p><p>\"Hard for me? I don't even know where to begin. I did something I've never done in my life and then I wake up and you tell me you have supposedly time-warped me into the past, and I'm not sure if I'm insane or delusional or what. Why am I here?\"</p><p>\"I...\" Sebastian wasn't sure what to answer. The truth was pretty much out of the question. Channon, I practi­cally kidnapped you because you are my mate and I don't want to be alone for the next three to four hundred years of my life.</p><p>No, definitely not something a man told a woman on their first date. He would have to woo her. Quickly. And win her over to wanting to stay here with him.</p><p>Preferably before a dragon ate one of them.</p><p>\"Look, why don't you just think of this as a great ad­venture. Instead of reading about the history you teach, you can live it for a couple weeks.\"</p><p>\"What are you? Disney World?\" she asked. \"And I can't stay here for a couple weeks. I have a life in the twenty-first century. I will be fired from my job. I will lose my car and my apartment. Good grief, who will pick up my laundry?\"</p><p>\"If you stayed here with me, it wouldn't be a problem. You'd never have to worry about any of that again.\"</p><p>Channon was aghast at him. Oh, God, please let this</p><p>be some bizarre nightmare. She had to wake up. This could not possibly be real.</p><p>\"No,\" she said to him, \"you're right. I wouldn't have to worry about any of that in Saxon England. I'd only have to worry about the lack of hygiene, lack of plumbing, Vi­king invasions, being burned at the stake, lack of mod­ern conveniences, and nasty diseases with no antibiotics. Good grief, I can't even get a Midol. Not to mention, I'll never find out what happens next week on Buffy!\"</p><p>Sebastian let out an elongated, patient breath and gave her an apologetic look that somehow succeeded in quell­ing a good deal of her anger.</p><p>\"Look,\" he said quietly, \"I'll make a deal with you. Spend a few weeks with me here, and if you really can't stand it, I'll take you home as close to the departure time as I can manage. Okay?\"</p><p>Channon still had a hard time grasping all this. \"Do you swear you're not playing some weird mind game with me? I really am here, in Saxon England?\"</p><p>\"I swear it on my mother's soul. You are in Saxon England, and I can take you back home. And no, I'm not playing mind games with you.\"</p><p>Channon accepted that, even though she couldn't imag­ine why. It was just a feeling she had that he would never swear on his mother's soul unless he meant it.</p><p>\"Can you really take me back to the precise moment I left?\"</p><p>\"Probably not the precise moment, but I can try.\"</p><p>\"What do you mean, try?\"</p><p>He flashed his dimples, then turned serious. \"Time-walking isn't an exact science. You can only move through the time fields when the dawn meets the night, and only under the power of a full moon. The problem is on the arrival end. You can try to get someplace specific, but you have only about a ninety-five percent chance of success. I might get you back that day, but it could also be a week or two after.\"</p><p>\"And that's the best you can do?\"</p><p>\"Hey, just be grateful I'm old. When an Arcadian first starts time-walking, we only have about a three percent chance of success. I once ended up on Pluto.\"</p><p>She laughed in spite of herself. \"Are you serious?\"</p><p>He nodded. \"They're not kidding about it being the coldest planet.\"</p><p>Channon took a deep breath as she digested everything he'd told her. Was any of this real? She didn't know, any more than she knew whether or not he was being honest about returning her. He was still very guarded. \"Okay, so I'm stuck here until the next full moon?\"</p><p>\"Yes.\"</p><p>Oh, good grief, no. Had she been the kind of woman to whine, she'd probably be whining. But Channon was always practical. \"All right. I can handle this,\" she said, more for her benefit than his. \"I'll just pretend I'm a Saxon chick and you...\" Her voice trailed off as she recalled what he'd said about time-traveling. \"Just how old are you?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"My people don't age quite the same way humans do. Since we can time-walk, we have a much slower biolog­ical clock.\"</p><p>Oh, she really didn't like the way he said humans, and if he turned fangy on her, she was going to stake him right through the heart. But she would get back to that in a minute. First, she wanted to understand the age thing. \"So you age like dog years?\"</p><p>Sebastian laughed. \"Something like that. By human age, I would be four hundred sixty-three years old.\"</p> <p>Channon sat flabbergasted as she looked over his lean, hard body. He appeared to be in his early thirties, not his late four hundreds. \"You're not joking with me at all, are you?\"</p><p>\"Not even a little. Everything I have told you since the moment I met you has been the honest truth.\"</p><p>\"Oh, God,\" she said, breathing in slowly and carefully</p><p>to calm the panic that was again trying to surface. She knew it was real, yet she had a hard time believing it. It boggled her mind that people could walk through time and that she could really be in the Dark Ages.</p><p>Surely, it couldn't be this easy.</p> <p>\"I know there has to be more of a downside to all this. And I'm pretty sure here's where I find out you're some kind of vampire or something.\"</p><p>\"No,\" he said quickly. \"I'm not a vampire. I don't suck blood, and I don't do anything weird to sustain my life. I was born from my mother, just as you were. I feel the same emotions. I bleed red blood. And just like you, I will die at some unknown date in the future. I just come equipped with a few extra powers.\"</p><p>\"I see. I'm a Toyota. You're a Lambourghini, and you can have really awesome sex.\"</p><p>He chuckled. \"That's a good summation.\"</p><p>Summation, hell. This was unbelievable. Inconceivable. How had she gotten mixed up with something like this?</p><p>But as she looked up at him, she knew. He was com­pelling. That deadly air and animal magnetism—how could she have even hoped to resist him?</p> <p>And she wondered if there were more men out there like him. Men of power and magic. Men who were so incredibly sexy that to look at them was to burn for them. \"Are there more of you?\"</p><p>\"Yes.\"</p><p>She smiled evilly at the thought. \"A lot more?\"</p><p>He frowned before he answered. 'There used to be a lot more of us, but times change.\"</p><p>Channon saw the sadness in his eyes, the pain that he kept inside. It made her hurt for him.</p><p>He looked down at her. \"That tapestry you love so much is the story of our beginning.\"</p><p>\"The birth of the dragon and the man?\"</p><p>He nodded. \"About five thousand years before you were born, my grandfather, Lycaon, fell in love with a</p> <p>woman he thought was a human. She wasn't. She was born to a race that had been cursed by the Greek gods. She never told him who and what she really was, and in time she bore him two sons.\"</p><p>Channon remembered seeing that birth scene embroi­dered on the upper left edge of the tapestry.</p><p>\"On her twenty-seventh birthday,\" he continued, \"she died horribly just as all the members of her race die. And when my grandfather saw it, he knew his children were destined for the same fate. Angry and grief-stricken, he sought unnatural means to keep his children alive.\"</p><p>Sebastian was tense as he spoke. \"Crazed from his grief and fear, he started capturing as many of my grand­mother's people as he could and began experimenting with them—combining their life forces with those of an­imals. He wanted to make a hybrid creature that wasn't cursed.\"</p><p>\"It worked?\" she asked.</p><p>\"Better than he had hoped. Not only did his sorcery give them the animal's strength and powers, it gave them a life span ten times longer than that of a human.\"</p><p>She arched a brow at that. \"So you're telling me that you're a werewolf who lives seven or eight hundred years?\"</p><p>\"Yes on the age, but I'm not a Lykos. I'm a Drakos.\"</p><p>\"You say that as if I have a clue about what you mean.\"</p><p>\"Lycaon used his magic to 'half his children. Instead of two sons, he made four.\"</p><p>\"What are you saying?\" she asked. \"He sliced them down the middle?\"</p><p>\"Yes and no. There was a byproduct of the magic I don't think my grandfather was prepared for. When he combined a human and an animal, he expected his magic would create only one being. Instead, it made two of them. One person who held the heart of a human, and a separate creature whose heart was that of the animal.</p><p>\"Those who have human hearts are called Arcadians. We are able to suppress the animal side of our nature. To</p><p>control it. Because we have human hearts, we have com­passion and higher reasoning.\"</p><p>\"And the ones with animal hearts?\"</p><p>\"They are called Katagaria, meaning miscreant or rogue. Because of their animal hearts, they lack human compassion and are ruled by their baser instincts. Like their human brethren, they hold the same psychic abilities and shape-shifting, time-bending powers, but not the self-control.\"</p><p>That didn't sound good to her. \"And the other people who were experimented on? Were there two of them, too?\"</p><p>\"Yes. And we formed the basis of two societies: the Arcadians and the Katagaria. As with nature, like went with like, and we created groups or patrias based on our animals. Wolf lives with wolf, hawk with hawk, dragon with dragon. We use Greek terms to differentiate between them. Therefore dragon is drakos, wolf is lykos, etcetera.\"</p><p>That made sense to her. \"And all the while the Arca­dians stayed with the Arcadians and Katagaria with Ka­tagaria?\"</p><p>\"For the most part, yes.\"</p><p>\"But I take it from the sound of your voice that no one lived happily-ever-after.\"</p><p>\"No. The Fates were furious that Lycaon dared thwart them. To punish him, they ordered him to kill the creature-based children. He refused. So, the gods cursed us all.\"</p><p>\"Cursed you how?\"</p><p>A tic started in his jaw, and she saw the deep-seated agony in his eyes. \"For one thing, we don't hit puberty until our mid-twenties. Because it is delayed, when it hits, it hits us hard. Many of us are driven to madness, and if we don't find a way to control and channel our powers we can become Slayers.\"</p><p>\"I take it you don't mean the good vampire slayer kind of slayer that kills evil things.\"</p><p>\"No. These are creatures that are bent on absolute de­struction. They kill without remorse and with total bar­barism.\"</p><p>\"How awful,\" she breathed.</p><p>He agreed. \"Until puberty, our children are either hu­man or animal, depending on the parents' base-forms.\"</p><p>\"Base-forms? What are those?\"</p><p>\"Arcadians are human so their base-forms are human. The Katagaria have a base-form of whatever animal part they are related to. An Ursulan would be a bear, a Ger-akian would be a hawk.\"</p><p>\"A Drakos would be a dragon.\"</p><p>He nodded. \"A child has no powers at all, but with the onset of puberty, all the powers come in. We try to con­tain those who are going through it and teach them how to harness their powers. Most of the time we succeed as Arcadians, but with the Katagaria this isn't true. They encourage their children to destroy both humans and Ar­cadians.\"</p><p>\"Because we have vowed to stop them and their Slay­ers, they hate us and have sworn to kill us and our fam­ilies. In short, we are at war with one another.\"</p><p>Channon sat quietly as she absorbed that last bit. So that was the eternal struggle he'd mentioned yesterday. \"Is that why you are here?\"</p><p>This time the anguish in his eyes was so severe that she winced from it. \"No. I'm here because I made a prom­ise.\"</p><p>\"About what?\"</p><p>He didn't answer, but she felt the rigidness return to his body. He was a man in pain, and she wondered why.</p><p>But then she figured it out. \"The Katagaria destroyed your family, didn't they?\"</p><p>\"They took everything from me.\" The agony in his voice was so raw, so savage.</p><p>Never in her life had she heard anything like it.</p><p>Channon wanted to soothe him in a way she'd never</p><p>wanted to soothe anyone else. She wished she could erase the past and return his family to him.</p><p>Seeking to distract him, she went back to the prior topic. \"If you're at war with each other, do you have armies?\"</p><p>He shook his head. \"Not really. We have Sentinels, who are stronger and faster than the rest of our species. They are the designated protectors of both man and were-kind.\"</p><p>Reaching up, she touched his mask that covered the tattoo on his face. \"Do all Arcadians have your mark­ings?\"</p><p>Sebastian looked away. \"No. Only Sentinels have them.\"</p><p>She smiled at the knowledge. \"You're a Sentinel.\"</p><p>\"I was a Sentinel.\"</p><p>The stress on the past tense told her much. \"What hap­pened?\"</p><p>\"It was a long time ago, and I'd rather not talk about it.\"</p><p>She could respect that, especially since he'd already answered so much. But her curiosity about it was almost more than she could bear. Still, she wouldn't pry. \"Okay, but can I ask one more thing?\"</p><p>\"Sure.\"</p><p>\"When you say long ago, I have a feeling that takes on a whole new meaning. Was it a decade or two, or—\"</p><p>'Two hundred fifty-four years ago.\"</p><p>Her jaw dropped. \"Have you been alone all this time?\"</p><p>He nodded.</p><p>Her chest drew tight at that. Two hundred years alone. She couldn't imagine it. \"And you have no one?\"</p><p>Sebastian fell silent as old memories surged. He did his best not to remember his role of Sentinel. His family.</p><p>He'd been raised to hold honor next to his heart, and with one fatal mistake, he had lost everything he'd ever cared for. Everything he'd once been.</p><p>\"I was ... banished,\" he said, the word sticking in his throat. He'd never once in all this time uttered the word aloud. \"No Arcadian is allowed to associate with me.\"</p><p>\"Why would they banish you?\"</p><p>He didn't answer.</p><p>Instead, he pointed in front of them. \"Look up, Chan-non. I think there's something over there you'll find far more interesting than me.\"</p><p>Seriously doubting that, Channon turned her head, then gaped. On the hill far above was a large wooden hall surrounded by a group of buildings. Even from this dis­tance, she could make out people and animals moving about.</p><p>She blinked, unable to believe her eyes. \"Oh my God,\" she breathed. \"It's a real Saxon village!\"</p><p>\"Complete with bad hygiene and no plumbing.\"</p><p>Her heart hammered as they approached the hill at a slow and steady speed. \"Can't you make this thing move any faster?\" she asked, eager to get a closer view.</p><p>\"I can, but they will view it as a sign of aggression and might decide to shoot a few arrows into us.\"</p><p>\"Oh. Then I can wait. I don't want to be a pincushion.\"</p><p>Sebastian remained silent and watched her as she strained to see more of the town. He smiled at her exu­berance as she twisted in the saddle, her hips brushing painfully against his swollen groin.</p><p>After the night they had shared, it amazed him just how much he longed to possess her again, how much his body craved hers.</p><p>He still couldn't believe he'd told her as much as he had about his past and people, yet as his mate, she had a right to know all about him.</p><p>If she would be his mate.</p><p>He still hadn't really made up his mind about that.</p><p>The kindest thing would be to return her and let her go. But he didn't want to. He missed having someone to care for and someone who cared for him.</p><p>How many times had he lain awake at night aching for a family again? Wishing for the comfort of a soothing touch? Missing the sound of laughter and the warmth of friendship?</p><p>For centuries, his solitude had been his hell.</p><p>And this woman sitting in his lap would be his only salvation.</p><p>If he dared ...</p><p>Channon bit her lip as they entered the bailey and she saw real, live Saxon people at work in the village. There were men laying stone, rebuilding a portion of the gate. Women with laundry and foodstuffs walking around, talk­ing amongst themselves. And children! Lots of Saxon children were running around, laughing and playing games with each other.</p><p>Better still, there were merchants and music, acrobats, and jongleurs. \"Is there a festival going on?\"</p><p>He nodded. \"The harvest is in and there's a celebration all week long to mark it.\"</p><p>She struggled to understand what the crowd around them said.</p><p>It was incredible! They were speaking Old English!</p><p>\"Oh, Sebastian,\" she cried, throwing her arms around him and holding him close. \"Thank you for this! Thank you!\"</p><p>Sebastian clenched his teeth at the sensation of her breasts flattened against him. Of her breath tickling his neck. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His groin tightened even more, and it took all his hu­man powers to leash the beast within. He felt the ripping inside as he set the two halves of him against each other.</p><p>It was a dangerous thing he did, but for both their sakes, it was a necessary action. Especially since both halves of him wanted the same thing—they wanted the Claiming where Channon would entrust herself to him, the cere­mony that would bind them together for eternity. It wasn't something to be taken lightly. She would have to give up</p><p>everything to be with him. Everything. And he wasn't sure if he could ask that of her.</p> <p>It would be unfair to her, and he definitely wasn't worth such a sacrifice.</p><p>He saw the happiness in Channon's eyes and smiled at her.</p><p>But his smile faded as he looked around the town and saw all the innocent lives that would end if something went wrong.</p><p>Bracis had shown a rare streak of intelligence when he had set up this exchange. Sebastian was forbidden by his Sentinel oath to transform into his dragon form or to use his powers in any way that could betray his heritage to the humans. To the innocent, he must always appear hu­man.</p><p>Bracis had sworn that the Katagaria would come in as humans to make the exchange and then leave peacefully. Unfortunately, Sebastian had no choice except to trust them.</p> <p>Of course, Bracis knew the extent of Sebastian's pow­ers, and the Katagari male would be an absolute idiot to cross him. And though the beast could be stupid, Bracis wasn't that stupid.</p><p>As soon as they reached the stable, Sebastian helped Channon down, then dismounted behind her. He pulled his hauberk lower so that no one could see just how much he craved the woman before him.</p><p>Channon watched as Sebastian removed his huge broadsword from his horse and fastened it to the baldric at his waist. She had to admit the man looked delectable like that, so manly and virile.</p><p>The chain mail sleeves fell from the shoulders of the leather armor, clinking ever so slightly with his move­ments. The laces of the hauberk were open, showing a hint of the hairs on his chest, and all too well she remem­bered her hours of running her fingers and mouth over that lush skin.</p><p>And as she stared at the small scar on his neck, she ached to trace it with her tongue. This man had a body and aura that should be cloned and made standard equip­ment for all men. Prideful and dangerous, it made every female part of her sit up and pant.</p><p>Stop that! she snapped at herself. They were in the mid­dle of town and ...</p> <p>And she had other people to study.</p><p>Yeah right. Like they were really more interesting than Sebastian.</p><p>He adjusted his sword so that the hilt came forward and the blade trailed down his leg, then pulled a leather bag from the saddle. A youth ran up to take his mount.</p><p>\"What day is today?\" he asked the boy in Old English.</p><p>\"It be Tuesday, sir.\"</p><p>Sebastian thanked him and gave him two coins before relinquishing his horse to the boy's care.</p><p>He turned toward her. \"You ready?\"</p><p>\"Absolutely. I've dreamed of this my whole life.\"</p> <p>Channon held her breath as he led her through the bus­tling village.</p><p>Sebastian looked behind him to see Channon as she tried to watch everything at once. She was so happy to be here.</p><p>Maybe there was hope for them after all. Maybe bring­ing her here hadn't been a mistake.</p><p>\"Tell me, Channon, have you ever eaten Saxon bread?\"</p><p>\"Is it good?\"</p><p>\"The best.\" Taking her hand, he pulled her into a shop across the dirt road.</p><p>Channon breathed in the sweet smell of baking bread as they entered the bakery. Bread was lined up on the wooden counter and in baskets on tables all over the room. An older, heavyset woman stood to the side, trying to move a large sack across the floor.</p><p>\"Here,\" Sebastian said, rushing to her side. \"Let me get that.\"</p><p>Straightening up, she smiled in gratitude. \"Thank you. I need it over there by my workbench.\"</p><p>Sebastian hefted the heavy sack onto his shoulder.</p><p>Channon watched, her mouth watering as his hauberk lifted and gave her a flash of his hard, tanned abs. His broad shoulders and toned biceps flexed from the strain. And when he placed the sack on the floor by the bench, she was gifted with a nice view of his rear covered by his black leather pants.</p><p>Oh yeah, she'd love a bite of that.</p><p>\"Now what can I do for you gentle folks?\" the woman asked.</p><p>\"What looks good to you, Channon?\"</p><p>Was that a trick question or what?</p><p>Forcing herself to look at something other than Sebas­tian, she attempted to find a substitute to sink her teeth into. \"What do you recommend?\" she asked, trying out her Old English. She'd never used it before in conversa­tion.</p><p>To her amazement, the woman understood her. \"If you're in the mind for something sweet, I just pulled a honey loaf from the oven.\"</p><p>\"That would be wonderful,\" Channon said.</p><p>The woman left them alone. Sebastian stood back while she examined the different kinds of bread in the shop.</p><p>\"So what's in the bag?\" she asked, indicating the black one Sebastian had removed from his horse.</p><p>\"It's just something I need to take care of. Later.\"</p><p>Again with the hedging. \"Is that why you came back here?\"</p><p>He nodded, but there was something very guarded in his look, one that warned her this topic was quite closed.</p><p>The woman returned with the bread and sliced it for them. While Channon ate the warm, delicious slice, the woman asked Sebastian if he would help her move some boxes from a cart outside into the back of her shop.</p><p>He left his bag with Channon, then went to help.</p><p>Channon listened to them in the other room while she ate the bread and drank the cider the woman had also given her. Her gaze fell to the black bag and curiosity got the better of her. Leaning over, she opened it to see what it contained. Her breath left her body as she saw the tap­estry inside.</p><p>He really had stolen it. But why?</p><p>The old woman came in, brushing her hands on her apron. \"That's a good man you got there, my lady.\"</p><p>Blushing at being caught in her snooping, Channon straightened up. At the moment, she wasn't so sure about that. \"Is he still unloading the cart?\"</p><p>The woman motioned her to the back, then took her to look out the door. In the alley behind the shops, she saw Sebastian playing a game with two boys who were wield­ing wooden swords and shields against him while pre­tending to be warriors fighting a dragon. The irony of their game wasn't lost on her.</p><p>She took a minute to watch him laughing and teasing them. The sight warmed her heart.</p><p>The Sebastian she had come to know was a man of many facets. Caring, compassionate, and tender in a way she'd never known before. Yet there was a savage un­dercurrent to him, one that let her know he wasn't a man to be taken lightly.</p><p>And as she watched him playing with the children, something strange happened to her. She wondered what he would look like playing with his own children.</p><p>With their children ...</p><p>She could see the image so plainly that it scared her.</p><p>\"Why do you wear a mask?\" one of the boys asked him.</p><p>\"Because I'm not as pretty as you,\" Sebastian teased.</p><p>\"I'm not pretty,\" the little boy said indignantly. \"I'm a handsome boy.\"</p><p>\"Handsome you are, Aubrey,\" a middle-aged man said as he moved a keg through the back door of the building across the way. The man looked to Sebastian.</p><p>He gaped widely, then wiped his hand on his shirt and moved to shake Sebastian's arm. \"It's been a long time since I seen one of you. It's an honor to shake your arm, sir.\"</p><p>The boys paused in their play. \"Who is he, grandfa­ther?\"</p><p>\"He's a dragon slayer, Aubrey, like the ones I tell you about at night when you go to sleep.\" The man indicated Sebastian's mask and sword. \"I was just your age when they came to Lindsey and slew the Megalos.\"</p><p>She wondered if Sebastian was one of the ones who had come that day.</p><p>As if sensing her, Sebastian turned his head to see her in the doorway. \"If you'll excuse me,\" he said to the man and boys, then made his way toward her.</p><p>Sebastian could tell by Channon's face that something was troubling her. \"Is something wrong?\"</p><p>\"Were you one of the ones who fought the Megalos?\"</p><p>He shook his head as pain sliced through him. If not for his banishment, he would have been here that day. Unlike the other Sentinels, he had to fight the Katagaria alone. \"No.\"</p><p>\"Oh.\"</p><p>\"Is something else wrong? You still don't look happy.\"</p><p>She met his gaze levelly. \"You stole the tapestry from the museum,\" she said in modern English so no one else would understand her. \"I want to know why.\"</p><p>\"I had to get it back here.\"</p><p>\"Why?\"</p><p>\"Because it's the ransom for another Sentinel. If I don't give them the tapestry on Friday, they will kill him.\"</p><p>Channon scowled at that. \"Why do they want the tap­estry?\"</p><p>\"I have no idea. But since a man's life was at stake, I didn't bother to ask.\"</p><p>Suddenly, she remembered what he'd said last night about the tapestry. \"It was made by a woman named An-tiphone back in seventh-century Britain. It's the story of her grandfather and his brother and their eternal struggle between good and evil.\"</p><p>On their way into town, he'd said it was the story of his grandfather.</p><p>\"Antiphone is your sister?\"</p><p>\"Was my sister. She died a long time ago.\"</p><p>By the look on his face she could tell the loss was still with him.</p><p>\"Why was her tapestry in the museum?\"</p><p>\"Because...\" He took a deep breath to stave off the agony inside him, agony so severe that it made his entire being hurt.</p><p>He felt the tic working in his jaw as he forced himself to answer her question. \"The tapestry was with her when she died. I tried to return it to my family, but they wanted nothing to do with me. I couldn't stand having it around me, so I took it into the future where I knew someone would preserve it and make sure it was honored and pro­tected as she should have been.\"</p><p>\"You plan on taking it back after all this is over with, don't you?\"</p><p>He frowned at her astuteness. \"How did you know?\"</p><p>\"I would say I'm psychic, but I'm not. I just figured a man with a heart as big as yours wouldn't just steal some­thing without making amends.\"</p><p>\"You don't know me that well.\"</p><p>\"I think I do.\"</p><p>Sebastian clenched his teeth. No, she didn't know. He wasn't a good man. He was fool.</p><p>If not for him, Antiphone would have lived. Her death had been all his fault. It was a guilt that he lived with constantly. One that would never cease, never heal.</p><p>And in that moment he realized something. He had to let Channon go. There was no way he could keep her. There was no way he could share his life with her.</p><p>If anything should ever happen to her ...</p><p>It would be his fault, too. As his mate, she would be prime Katagari bait. Even though he was banished, he was still a Sentinel, and his job was to seek and destroy every Slayer he could find.</p><p>Alone he could fight them. But without his patria to guard Channon while he fulfilled his ancient oath, there was always a chance she would end up as Antiphone had.</p><p>He would sooner spend the rest of his life celibate than let that happen.</p><p>Celibate! No!</p><p>He squelched the rebellious scream of the inner Drakos. For the next three weeks, he would guard her life with his own, and once his mark was gone from her, he would take her home.</p><p>It was what had to be done.</p><p>After they left the bakery, they spent the afternoon brows­ing the stalls and sampling the food and drink.</p><p>Channon couldn't believe this day. It was the best one of her entire life. And it wasn't just because she was in Saxon Britain, it was because she had Sebastian by her side. His light teasing and easy-going manner wrapped around her heart and made her ache to keep him.</p><p>\"Beg pardon, my lord?\"</p><p>They turned to find a man standing behind them while they were watching an acrobat.</p><p>\"Aye?\" Sebastian asked.</p><p>\"I was told by His Majesty, King Henfrith, to come and ask for the honor of your company tonight. He wishes to extend his full and most cordial hospitality to you and to your lady.\"</p><p>Channon felt giddy. \"I get to meet a king?\"</p><p>Sebastian nodded. \"Tell His Majesty that it would be my honor to meet with him. We shall be along shortly.\"</p><p>The messenger left.</p><p>Channon breathed nervously. \"I don't know about this. Am I dressed appropriately?\"</p><p>\"Yes, you are. I assure you, you will be the most beau­tiful woman there.\" Then, her gallant champion offered her his arm. Taking it, she let him lead her through town to the large hall. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As they drew near the hall's door, she could hear the music and laughter from inside as the people ate their supper. Sebastian opened the door and allowed her to en­ter first.</p><p>Channon hesitated in the doorway as she looked around in awe. It was more splendid than anything she'd ever imagined.</p><p>A lord's table was set apart from the others, and there were three women and four men seated there. The man with the crown she assumed was the king, the lady at his right, his queen, and the others must be the daughters and sons or some other dignitaries perhaps.</p> <p>Servants bustled around with food while dogs milled about, catching scraps from the diners. The music was sublime.</p><p>\"Nervous?\" Sebastian asked her in modern English.</p><p>\"A little. I have no idea what Saxon etiquette is.\"</p><p>He lifted her hand to his lips and kissed her fingers, causing a warm chill to sweep through her. \"Follow my lead, and I will show you everything you need to know to live in my world.\"</p><p>She cocked her brow at his words. There was some­thing hidden in that. She was sure of it. \"You are going to take me home at the next full moon, right?\"</p> <p>\"I gave you my word, my lady. That is the one thing I have never broken, and I most assuredly would not break my oath to you.\"</p><p>\"Just checking.\"</p><p>A hush fell over the crowd as they crossed the room and neared the lord's table.</p><p>Channon swallowed nervously. But she was there with the most handsome man in the kingdom. Dressed in his black armor and mask, Sebastian was a spectacularly mas­culine sight. The man had a regal presence that promised strength, speed, and deadly precision.</p><p>He stopped before the table and gave a low, courtly bow. Channon gave what she hoped was an acceptable curtsy.</p><p>\"Greetings, Your Majesty,\" Sebastian said, straighten­ing. \"I am Sebastian Kattalakis, a Prince of Arcadia.\"</p> <p>Channon's jaw went slack with that declaration. A prince? Was he for real or was it another joke?</p><p>He turned to her, his features guarded. \"My lady, Chan­non.\"</p><p>The king rose to his feet and bowed to them. \"Your Highness, it has been a long time since I've had the priv­ilege of a dragon slayer's company. I owe your house more than I can ever repay. Please, come and be seated in honor. You and your lady-wife are welcomed here for as long as you wish to stay.\"</p><p>Sebastian led Channon to the table and sat her to his right, beside a man who introduced himself as the king's son-in-law.</p><p>\"Are you really a prince?\" she whispered to Sebastian.</p><p>\"A most disinherited one, but yes. My grandfather, Ly-caon, was the King of Arcadia.\"</p><p>\"Oh my God,\" Channon said as pieces of history came together in her mind. \"The king cursed by Zeus?\"</p><p>\"And the Fates.\"</p> <p>Lycanthrope, the Greek word for werewolves, vam­pires, and shape-shifters, was taken from Lycaon, the King of Arcadia. Stunned, she wondered what other so-called myths and legends were actually real.</p><p>\"You know, you are better than the Rosetta stone to a historian.\"</p><p>Sebastian laughed. \"Glad to know 1 have some use to you.\"</p><p>More than he knew—and it wasn't just the knowledge he held. Today was the only day she could recall in an exceptionally long time when she hadn't been lonely. Not once. She'd enjoyed every minute of this day and didn't really want it to end.</p><p>She looked forward to spending the next few weeks with Sebastian in his world. And deep inside where she best not investigate was a part of her that wondered if, when the time came, she'd be able to leave him.</p><p>How could a woman give up a man who made her feel the way Sebastian did every time he looked at her?</p><p>She wasn't sure it was possible.</p><p>Sebastian cut and served her from the roast of some­thing she couldn't quite identify. Thinking it best not to ask, she took a bite and discovered it was quite good.</p><p>They ate in silence while others finished their meals and started dancing.</p><p>After a time, Channon glanced to Sebastian and noticed his eyes seemed troubled. \"Are you all right?\" she asked.</p><p>Sebastian ran his hand over the uncovered portion of his face. He felt ill inside. The harmony between his two halves had been disrupted by his inner fighting over Chan­non, and the pain of it was almost more than he could stand.</p><p>The Drakos wanted her regardless, but the man in him refused to see her endangered. The struggle between the two sides was so severe that he wondered how he was going to make it for the next three weeks without doing permanent damage to one or the other of his halves.</p><p>It was this kind of internal struggle that caused the mad­ness in their youth. And if he didn't restore the balance soon, his powers would be permanently scarred.</p><p>\"Jet lag from the time-jump,\" he said.</p><p>Forcing the dragon back into submission, he didn't speak to Channon while she ate. He allowed her the time</p><p>to experience the life and beauty of this time without in­truding on her.</p><p>Gods, how he ached to make her stay here. He could take her right now and bind her to him for the rest of his life. It was fully within his power.</p><p>But he couldn't do that to her. The man in him refused to claim her against her will. It had to be her choice. He would never accept anything less than that.</p><p>Channon frowned as she noted the seriousness in Se­bastian's eyes. \"Are you sure you're all right?\" she asked.</p><p>\"I'm fine. Really.\"</p><p>She still didn't buy that. The musicians paused and the crowd clapped for them. As she applauded the musicians and dancers, Channon became aware of something on her hand. Frowning, she studied her palm. \"What in the world?\"</p><p>Sebastian swallowed. Up until now he'd used his pow­ers to shield her from the marking. But his powers were weakening...</p><p>She tried to rub it off. \"What is this?\"</p><p>He started to tell her the truth, but it wedged in his throat. She didn't need to know that. Not right now. He didn't want to destroy the fun she was having by inter­jecting such a serious topic. \"It's from the time-jump,\" he lied. \"It's nothing major.\"</p><p>\"Oh,\" Channon said, dropping her hand. \"Okay.\"</p><p>The musicians started up again. Sebastian excused him­self from her.</p><p>Channon frowned. Something in his demeanor con­cerned her.</p><p>He walked too deliberately with his spine rigid and his shoulders back.</p><p>Following after him, she watched as he left the hall and went outside. He rounded the side of the hall and headed toward a small well.</p><p>Channon stayed back while he pulled water from the</p><p>well, then removed his mask and splashed the water over his face.</p><p>\"Sebastian?\" she asked softly, moving to his side. 'Tell me what's wrong with you.\"</p><p>Sebastian raked his gloved hands through his hair, dampening it. \"I'm okay, really.\"</p><p>\"You keep saying that, but...\"</p><p>She placed her hand on his arm. The sensation of her touch rocked him so fiercely that he wanted to growl from it. His body reacted viciously as desire tore through him.</p><p>The dragon snarled and circled, demanding her. Take her. Take her. Take her.</p><p>No! He would not cost her her life. He would not en­danger her.</p><p>\"I shouldn't have brought you here, Channon,\" he said as he turned his powers inward to harness the Drakos. \"I'm sorry.\"</p><p>She smiled at him. \"Don't be. It's not turning out so badly. It's actually kind of nice here.\"</p><p>He shut his eyes and turned away. He had to. The beast inside was snarling again. Salivating.</p><p>Claim her.</p><p>It wanted total possession.</p><p>And so did the man.</p><p>His groin tightened even more, and he wondered how much longer he could keep that part of him leashed.</p><p>Channon saw the feral look in his eyes as he raked a ravenous look over her. Her body reacted to it with a desire so powerful that it stunned and scared her. She wanted him to look at her like that. Forever.</p><p>His breathing ragged, he cupped her face in his hands and pulled her close for a fierce kiss. Channon moaned at the raw passion she tasted as she surrendered her weight to him.</p><p>She wrapped her arms around his neck and felt his mus­cles bunch and flex. Images of last night tore through her. Again she could see his naked body moving in the moon-</p><p>light and feel him deep and hard inside her.</p><p>Sebastian growled at the taste of her, at the feel of her tongue sweeping against his. Out of his mind with the passion, he pinned her against the wall of the gate.</p><p>He wanted her no matter the consequences, no matter the time or place.</p><p>Channon felt his erection as he held her between him and the wall. As if magnetized, her hips brushed against him. She wanted to feel him inside her again. She wanted nothing between them except bare skin.</p><p>\"What is it you do to me?\" she breathed.</p><p>Sebastian pulled back as her words penetrated the haz­iness of his mind. Still, all he could smell was Channon. Her scent spun around his head, making him even dizzier. He dipped his head for her lips, then barely caught him­self.</p><p>Hissing, he forced himself to release her. If he kissed her again, he would take her here in the yard like an animal, without regard to her humanity, without regard for her choice.</p><p>Claiming was a special moment, and he refused to sully it like the Katagari. No, he wouldn't take her like this. Not out here where anyone could see them. He would not let the Drakos win.</p><p>\"Channon,\" he whispered. \"Please, go back inside.\"</p><p>Channon started to refuse, but the steeliness in his body kept her from it. \"Okay,\" she said.</p><p>She paused at the corner of the hall and looked back at him. He was now leaning over the well with his head hung low. She didn't know what was wrong, but she was sure it wasn't good.</p><p>\"Ha, take that!\"</p><p>Channon turned at the sound of a child laughing. She saw the two boys with wooden swords who had been fighting Sebastian earlier. They ran across the yard.</p><p>\"I will kill you, nasty dragon,\" one boy cried as they ran into a forge where the blacksmith cursed and chased</p><p>them out, telling the tallest that he should be home eating. She shook her head. Some things never changed, no matter the time period. Curious about what else reminded her of home, she crossed the yard.</p><p>Sebastian breathed deeply, trying to summon his powers back to him. This was not good. If he stayed around Chan-non, by the time Friday arrived, he wouldn't be able to face the Katagaria trio.</p><p>He had to have his powers back, intact and strong, which meant that he would either have to claim her or find some place safe for her to stay so that he could get distance from her.</p><p>Because if he didn't, they would both die.</p><p>\"Bas?\"</p><p>Sebastian looked around the yard, trying to find the source of that whispered call. It was a nickname no one had used in centuries.</p><p>Gold flashed to his right. To his shock, Damos ap­peared, then collapsed on the ground. Like a wounded animal, his brother held himself on all fours with his head hung low.</p><p>Unable to believe his eyes, Sebastian went to him. \"Da­mos?\"</p><p>Damos lifted his head to look at him. Instead of the hatred and disgust he expected to see, Sebastian saw only pain and guilt. \"Did you get the tapestry?\"</p><p>Sebastian couldn't answer as he saw his brother's face again. The two of them were almost identical in build and looks. The only real difference was in their hair color. Sebastian's hair was black while Damos's was a dark reddish-brown.</p><p>And as Sebastian looked into those eyes that were the same color as his own, the past flashed through his mind.</p><p>\"You're nothing but a cowardly traitor. You've never been worth anything. I wish it had been you they tore</p><p>apart. If there were any justice, it would be you lying in the grave and not Antiphone.\" The cruel words echoed in his head, and even now he could feel the bite of the whip as they delivered the two hundred lashes to his back.</p><p>Battered and bloody, Sebastian had been dumped in a cesspit and left there to die or survive as he saw fit.</p><p>He'd crawled from the pit and somehow found his way into the woods, where he'd lain for days floating in and out of consciousness. To this day, he wasn't sure how he'd survived it.</p><p>\"Bas!\" Damos snapped, wincing from the effort as he pushed himself slowly to his feet. He staggered, and against his will, Sebastian found himself helping his brother to the well where he propped him.</p><p>Damos's long reddish-brown hair was lank and clotted with blood and snarls. His face was battered and his clothes torn. \"You look like hell.\"</p><p>\"Yeah, well, it's hard to look good when you're being tortured.\"</p><p>Sebastian knew that firsthand. \"You escaped?\"</p><p>He nodded. \"Where's the tapestry?\"</p><p>\"It's safe.\"</p><p>Damos locked gazes with him. \"Were you really going to trade it for me?\"</p><p>\"I brought it here, didn't I?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tears gathered in Damos's eyes as he looked at him. \"I am so sorry for what I did to you.\"</p><p>Sebastian was stunned. So, Damos did know what an apology was.</p><p>\"The Katagaria told me what happened that day, how they tricked you.\" Damos placed his hand against the scar on Sebastian's neck that Sebastian had received while try­ing to save Antiphone's life. \"I can't believe you survived them. And I can't believe you did this for me.\"</p> <p>\"Not like I had anything better to do.\"</p><p>Damos hissed and placed his hand to his eyes. \"Those damned feelers. They're trying to find me.\"</p><p>Sebastian went cold. Without his powers, he couldn't sense the feelers, but if they were sending them out for Damos, then they would find...</p><p>Channon!</p><p>His heart pounding, he ran for the hall.</p> <p>Channon wished she had her notepad to take notes on everything she saw. This was just incredible!</p><p>Enchanted, she walked idly past the stalls and huts, looking inside to see families eating and spending the eve­ning together.</p><p>\"You look lost.\"</p><p>She turned at the voice behind her. There were three men there, handsome all and quite tall. \"Not lost,\" she offered. \"Just out for a bit of fresh air.\"</p><p>The blond man appeared to be the leader of the small group. \"You know, that can be quite dangerous for a woman alone.\"</p><p>Channon frowned as a wave of panic washed over her. \"I beg your pardon?\"</p> <p>\"Tell me, Acmenes.\" The blonde spoke to the tall bru­nette beside him. \"Why do you think an Arcadian would bring a human woman through time?\"</p><p>Panic gone, sheer terror set in, especially since the man was speaking in modern English.</p><p>She tried to head back to Sebastian, but of the third man caught her. He grabbed her right hand and showed it to his friends. \"Because she's his mate.\"</p><p>The one called Acmenes laughed. \"How precious is this? An Arcadian with a human dragonswan.\"</p><p>\"No,\" the brunette said, \"it's better. A lone Sentinel with a human mate.\"</p><p>They laughed cruelly.</p><p>Channon glared. She might look harmless, but she'd been on her own for quite some time, and as a woman alone, she'd learned a few things.</p><p>Tae Kwon Do was one of them. She caught the man holding her with her elbow and twisted out of his grasp. Before the others could reach her, she ran for the hall.</p> <p>Unfortunately, the Katagaria moved a lot faster than she did and they grabbed her before she could reach it.</p><p>\"Let her go.\" Sebastian's voice rolled across the yard like dangerous thunder as he unsheathed his sword.</p><p>\"Oh no,\" Acmenes said sarcastically. \"This is the best of all. A Sentinel who has lost his powers.\"</p><p>Channon's heart clenched at their words.</p><p>Sebastian's smile was taunting, wicked. \"I don't need my powers to defeat you.\"</p><p>Before she could blink, the Katagaria attacked Sebas­tian.</p><p>\"Run, Channon,\" Sebastian said as he delivered a stag­gering blow to the first one who reached him.</p><p>Channon didn't go far. She couldn't leave him to fight the men alone. Not that he appeared to need any help. She watched as they attacked him at once and he deftly knocked them back.</p><p>\"Um, Acmenes,\" the youngest Katagari said as he picked himself up from the ground and panted. \"He's kicking our butts.\"</p><p>Acmenes laughed. \"Only in human form.\"</p><p>In a brilliant flash, Acmenes transformed into a dragon. The crowd that had gathered at the start of the fight shrieked and ran chaotically for shelter.</p><p>Channon stumbled back.</p><p>Standing at least twenty feet high, Acmenes was a ter­rifying sight. His green and orange scales shimmered in the fading daylight while his blue wings flapped. He slung his spiked tail around, but Sebastian flipped out of the way.</p><p>The other two flashed into dragon form.</p><p>Sebastian held his sword tightly in his hands as he faced them. Even if he still held his powers unsevered, he wouldn't have been able to transform. Not while in the middle of a human village. It was forbidden.</p><p>Damn you, Fates.</p><p>\"What's the matter, Kattalakis?\" Acmenes asked. \"Won't you breech your oath to protect your humans?\"</p><p>Bracis laughed. \"He can't, brother, his powers are too fragmented. He's powerless to stop us.\"</p><p>Acmenes shook his large, scaled head and sighed. \"This is so anticlimactic. All these years you've chased us, and now...\" He tsked. \"To comfort you as you die, Sebas­tian, know that your dragonswan will be as well used by all of us as your sister was.\"</p><p>Raw agony ripped through Sebastian.</p><p>Over and over, he saw his sister's face and felt her blood on his skin as he held her lifeless body in his arms and wept.</p><p>\"Kill him,\" Acmenes said. Then he turned toward Channon.</p><p>The dragon beast inside Sebastian roared with needful vengeance. He'd been unable to save Antiphone, but he would never let Channon die. Not like that.</p><p>Ceding his humanity, he let loose his shields. His change came so swiftly that he didn't even feel it. All he felt was the love in his heart for his mate, the animal desperation to keep her safe regardless of law or sense.</p><p>Channon froze at the sight of Sebastian's dragon form. The same height as Acmenes, his scales were bloodred and black. He looked like some fierce, terrifying menace, and she searched for something to remind her of the man he'd been two seconds ago.</p><p>She found none of him.</p><p>What she did see terrified her.</p><p>Acmenes swung about to face Sebastian as he savagely attacked the other two dragons. Fire shot through the vil­lage as they fought like the primeval beasts they were.</p><p>Then, to her horror, she saw Sebastian kill the dragon on his left with one sharp bite. The one on his right stum­bled away from him in wounded pain, then took to the skies.</p><p>Acmenes reached for her, but Sebastian tackled him. The force of them hitting the ground shook it. They fought like men, slugging at each other, and yet like dragons, as their tails coiled and moved trying to sting one another.</p><p>She cringed as both dragons were wounded countless times by their fighting, but neither would pull back. She'd never seen anything like it. They were locked in the throes of a blood feud.</p><p>Acmenes hefted his body and threw Sebastian over his head, then rolled to his monstrous feet. He stumbled as he tried to reach the sky, but before he could leap, Se­bastian caught him through the heart with his tail.</p><p>\"Dragon!\"</p><p>Now armed and prepared, the men of the village came running back to do damage to the creatures who had in­vaded them.</p><p>At first Channon thought they came to help Sebastian, until she realized that they intended to attack him.</p><p>Without thought, she went to him. \"Run, Sebastian,\" she said.</p><p>He didn't. He turned on her with frightening eyes, and in that moment she realized the man she knew was not in that body.</p><p>The dragon snarled at her as the crowd attacked him. Throwing his head back, he shrieked.</p><p>To her shock, he didn't attack the people.</p><p>Instead, he grabbed her in his massive claw and took flight.</p><p>Channon screamed as she watched the ground drift far away from her. She had no idea where he was taking her, but she didn't like this. Not even a little bit.</p><p>\"Sebastian?\"</p><p>Sebastian heard Channon's voice. But it came from a distance. He could only vaguely remember her.</p><p>Vaguely recall...</p><p>He shrieked as something flew past his head. Looking behind him, he saw Bracis coming for them.</p><p>And with the sight, his human memories came flooding back.</p><p>\"Sebastian, help us. We 're trapped by the Slayers.\"</p><p>\"I can't, Percy. I can't leave Antiphone.\"</p><p>\"She's safe in the hills. We are in the open, unpro­tected. Please, Sebastian. I'm too young to die. Please don't let them kill me. I know you can beat them. Please, please help me.\"</p><p>And so he had heeded the mental distress call and gone to protect his young cousin and brother, never knowing Percy's cry for help had been a trick, never knowing that Percy had deliberately summoned him from the cave.</p><p>He'd found his cousin barely alive and learned too late they had forced Percy to call for him.</p><p>By the time he'd returned to the cave where he'd left his sister hiding, the Slayers were gone.</p><p>And so was his sister's life.</p><p>Devastated on a level he'd never known existed, he'd refused to speak up in his own defense when his people had banished him.</p><p>He'd offered no argument at all against Damos's in­sults.</p><p>He should never have left Antiphone unprotected.</p><p>Now he looked at the woman he held cradled in his palm.</p><p>Channon.</p><p>The Fates had entrusted this woman to him, just as his brother had entrusted Antiphone to him.</p><p>He would not let Bracis have her. This time, he would see her safe. No matter what it cost him, she would live.</p><p>Sebastian headed for the forest.</p><p>Channon held her breath as they landed on the ground in a small clearing.</p><p>\"Hide.\" The word seemed to sizzle out of Sebastian's dragon mouth.</p><p>She went without question, running into the trees and underbrush, looking for someplace safe. The forest was</p><p>so thick that she quickly lost sight of the dragons. But she could hear them as they fought. She could feel the ground under her shake.</p><p>Grateful for the green dress, she found a clump of bushes and crawled into them to wait and to pray.</p><p>Sebastian circled around Bracis, enjoying the moment, en-joying the feel of the dragon blood coursing through his veins. For two hundred and fifty years he had dreamed of this moment. He had dreamed of drinking from the fount of vengeance.</p><p>Now the moment was upon him.</p><p>Bracis was the last of the Slayers left from that day. One by one, Sebastian had hunted them all down. He had hunted them through time and even space itself.</p><p>\"Are you ready to die?\" Sebastian asked his opponent.</p><p>Bracis attacked. Sebastian caught him with his teeth and clamped down on the Katagari's shoulder. He tasted the blood of the beast as Bracis shredded at his back with his claws.</p><p>Sebastian barely felt it. But what he did feel was the fear inside Bracis. It swelled up with a pungent odor so foul that it made Sebastian laugh.</p><p>\"You may kill me,\" Bracis rasped. \"But I'm taking you with me.\"</p><p>Something stung Sebastian's shoulder. Snarling, he jerked his head around to see the dagger protruding from his back. But it wasn't the steel that stung; it was the poison that coated the blade. Dragon's Bane.</p><p>Roaring from the pain of it, he turned back and finished Bracis off quickly by breaking his long, scaled neck.</p><p>He stood over the body of his enemy, staring at it blankly. After all this time, he'd wanted more out of the kill. He'd expected it to release the agony in his heart, to relieve his guilt.</p><p>It didn't.</p><p>He felt nothing except disappointed by it. Cheated.</p><p>No. In two hundred and fifty years only one thing had ever given him a moment's worth of peace.</p><p>Suddenly, a scream tore through the woods.</p><p>Channon.</p><p>Sebastian reared up to his full twenty foot height, searching for her through the trees with his dragon sight and senses.</p><p>He heard nothing more. His heart pounding, he ran for the woods where she'd vanished. With every step that closed the distance between them, all his feelings rushed through him. He relived every moment of Antiphone's death.</p><p>The guilt, the fear, the raw agony.</p><p>Under the onslaught of his human feelings, the dragon inside him receded again, leaving only the man. The man who had been crushed that day. The man who had sworn over his sister's grave to never let another person into his heart.</p><p>The same man who had looked into a pair of crystal blue eyes over dinner one night and had seen a future inside them that he wanted to live. A future with laughter and love. One spent in quiet serenity with a woman stand­ing beside him to keep him strong and grounded.</p><p>Leaves and brambles tore at his flesh, but he paid no attention to them.</p><p>Like Antiphone, he'd left Channon alone to face an untold nightmare.</p><p>Left her to face ...</p><p>He came to a stop as he caught sight of her.</p><p>Frowning, Sebastian struggled to breathe. His vision was so blurry from the poison that he wasn't sure he could trust it.</p><p>He blinked and blinked again. And still it stayed before his eyes. Channon stood with a sword in her hand, and it was angled at Damos's throat.</p><p>\"Bas, would you please tell her I'm not a Katagari.\"</p><p>Channon glanced over her shoulder to see Sebastian standing naked in the woods. Human once more, he was pale and covered in sweat.</p><p>\"Let him go.\"</p><p>By the sound of Sebastian's voice, she knew the man she held hadn't been lying to her. He was one of the good guys.</p><p>The instant she saw Sebastian stumble, she dropped the sword she'd taken from this stranger. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Channon ran to his side. \"Sebastian?\"</p><p>He was shaking in her arms. Together, they sank to the ground and she held his head in her lap.</p><p>\"I thought you were dead,\" he whispered, running his hand over her forearms. \"I heard you scream.\"</p> <p>The man she'd cornered knelt beside them. \"I startled her. I was trying to help you with Bracis. I sent out a feeler for your essence and it led me to her. You didn't tell me you were mated.\"</p><p>Channon ignored the man as Sebastian's body temper­ature dropped alarmingly.</p><p>Why was Sebastian trembling so? His wounds didn't look that severe. \"Sebastian, what's wrong with you?</p><p>\"Dragon's Bane.\"</p><p>Channon frowned as the man cursed. What was Dragon's Bane?</p> <p>\"Sebastian,\" he said forcefully, taking Sebastian's face in his hands and forcing him to look up at him. \"Don't you dare die on me. Damn you, fight this.\"</p><p>\"I'm already dead to you, Damos,\" he said, his voice ragged as he turned away from him. \"You told me to die painfully.\"</p><p>Sebastian closed his eyes.</p><p>Channon saw the grief in Damos's eyes as her own tore through her. This couldn't be happening. She wanted to wake up.</p><p>But it wasn't a nightmare, it was real.</p><p>Damos looked at her, his greenish-gold eyes searing her</p> <p>with power and emotion. \"He's going to die unless you help him.\"</p><p>\"What can I do?\"</p><p>\"Give him a reason to live.\"</p><p>Her hand started to tingle where the mark was. Chan-non scowled as it began to fade. \"What the ... ?\"</p><p>\"We're losing him. When he dies, your mark will be gone, too.\"</p><p>The reality of the moment hit her ferociously. Sebastian was going to die?</p><p>No, it couldn't be.</p><p>\"Sebastian?\" she said, shaking him. \"Can you hear me?\"</p> <p>He shifted ever so slightly in her arms.</p><p>She wouldn't let him go like this. She couldn't. Though they had only known each other one day, it felt as if they'd been together an eternity. The thought of losing him crippled her.</p><p>\"Sebastian, do you remember what you said to me in the hotel room? You said, 'I'm here because I know the sadness inside you. I know what it feels like to wake in the morning, lost and lonely and aching for someone to be there with me.' \"</p><p>She pressed her lips against his cheek and wept. \"I don't want to be alone anymore, Sebastian. I want to wake up with you like I did this morning. I want to feel your arms around me, your hand in my hair.\"</p><p>He went limp in her arms.</p><p>\"No!\" Channon cried, holding him close to her heart. \"Don't you do this to me, Sebastian Kattalakis. Don't you dare make me believe in knights in shining armor, in men who are good and decent, and then leave me alone again. Damn it, Sebastian. You promised to take me home. You promised not to leave me.\"</p><p>The mark faded from her palm.</p><p>Channon wept as her heart splintered. Until that mo­ment, she hadn't realized that against all known odds,</p><p>against all known reason, she loved this man.</p><p>And she didn't want to lose him.</p><p>She pressed her wet cheek to his lips. \"I love you, Se­bastian. I just wished you'd lived long enough for us to see what could become of us.\"</p><p>Suddenly, she felt another tingle in her palm. It grew to a burning itch. It was followed by a slow, tiny stirring of air against her cheek.</p><p>Damos expelled a deep breath. \"That's it, little brother. Fight for your mate. Fight for your dragonswan.\"</p><p>Channon looked up as Damos doffed his cloak, then wrapped it around Sebastian's body.</p><p>\"Is he going to live?\"</p><p>\"I don't know, but he's trying to. The Fates willing, he will.\"</p><p>Three</p><p>Channon bathed Sebastian's fevered brow while she prayed for his survival and whispered for him to come back to her.</p><p>After they had stabilized Sebastian, Damos had taken them to a small village in Sussex where humans and Ar­cadians lived and worked together. She learned that though Arcadians could only time-jump during a full moon, they could use their magic to make lateral jumps from one place to another in the same time frame any time they wanted to.</p><p>It didn't really make sense to her, but she didn't care. At the moment, all that mattered to her was the fact that Sebastian was still fighting his way back from death.</p><p>It was long after midnight now. They were alone in a large room where the only light came from three candles set in an iron fixture against the wall. Sebastian lay draped in a sheet on an ornate bed that bore the images of dragons and wheat and was shielded from drafts by shimmery white drapes.</p><p>The sounds of the night drifted in from the open win­dow while she waited for some sign that he would wake up.</p><p>None came.</p><p>At some point before dawn, exhaustion overtook her and she curled up by his side and went to sleep.</p><p>\"Channon?\"</p><p>Channon felt as if she were floating, as if she had no real form at all.</p><p>Suddenly, she stood in a summer field with wildflowers all around her. She was dressed in a sheer, white gown that left her all but bare. There was a medieval castle in the distance, highlighted against the horizon. It reminded her of one of the manuscript pages she studied.</p><p>None of it seemed real until she felt strong arms wrap around her.</p><p>Glancing over her shoulder, she looked up to find Se­bastian behind her. Like her, he was practically naked, dressed only in a pair of thin white pants. The breeze stirred his dark hair around his handsome face, and he flashed those killer dimples. Her heart soaring, she turned in his arms, reached up, and placed her marked palm over his Sentinel tattoo. \"Am I dreaming?\"</p><p>\"Yes. This was the only way I could reach you.\"</p><p>She frowned. \"I don't understand.\"</p><p>\"I'm dying.\"</p><p>\"No,\" she said emphatically, \"you're still alive. You came back to me.\"</p><p>The tenderness on his face as he looked at her made her heart pound. \"In part, but I still lack the strength I need to wake.\"</p><p>He sat down on the ground and pulled her down with him. \"I missed you today.\"</p><p>So had she, in a way that made no sense whatsoever to her, but then feelings seldom do. The entire time he'd been unconscious, she had felt as if a vital part of her was gone.</p><p>Now, in the circle of his arms, leaning back against him, she felt right again. She felt whole and warm.</p><p>Sebastian took her hand into his and used his thumb to toy gently with her fingers.</p><p>\"I can't lose you,\" she whispered. \"I've spent hours thinking of my life at home. It was lonely and empty. I had no one to laugh with.\"</p><p>He placed his lips against her temple and kissed her tenderly. Then he cupped her head in his hands and leaned his forehead against her. \"I know, love. I've spent my life alone in caves, my only company the sound of the wind outside. But the only way I can fight my way back to you is to regain my powers.\"</p><p>\"Regain them how? How did you lose them?\"</p><p>She felt his lips moving against her skin as he whis­pered the words while he nuzzled her. It was wonderful to have him holding her again. \"I was using them against myself. I set the dragon and the human inside me at odds.\"</p><p>His touch burned through her. She didn't want to live another day without feeling him by her side, without see­ing that devilish smile and those deep dimples.</p><p>In short, she needed this man.</p><p>\"Why did you do that?\" she asked.</p><p>He pulled back and kissed her fingertips. \"To protect you.\"</p><p>\"From what?\"</p><p>\"Me,\" he said simply.</p><p>Channon stared up at him, baffled by his words. He would never hurt her. She knew that. Even in his true dragon form he had done nothing but protect her. \"I don't understand.\"</p><p>He ran his thumb over her palm, tracing the lines of her mark. Chills swept up her arm, tightening her breasts as she watched him.</p><p>When he met her gaze, she saw his sorrow. \"I lied to you when you asked me about the mark on your hand. Part of the curse of my people is that we are only des-</p><p>ignated one mate for our entire existence, a mate we don't choose.\"</p><p>Channon frowned. Damos had refused to speak to her when she asked him what he meant when he had called her Sebastian's mate. He'd told her it was for Sebastian to do.</p><p>Sebastian kissed her marked palm. \"The moment we Arcadians and Katagaria are born, the Fates choose a mate for us. We spend the rest of our lives trying to find our other half. Unlike humans, we can't have a family or chil­dren with anyone other than our mate. If we fail to find our other half, we are doomed to live out our lives alone.</p><p>\"As a human, you have the freewill to love anyone. You can love more than once. But I can't. You, Channon, are the only woman in any time or place who I can love. The only woman I can ever have a family with. The only woman I will ever desire.\"</p><p>She remembered Plato's theory about the human race being two halves of the same person—the male and fe­male who were separated by the gods. Now she realized Plato's theory was based on the reality of Sebastian's peo­ple, not hers.</p><p>\"So what do you need to regain your powers?\"</p><p>He fingered her lips and stared at her with desperate need. She knew he was still holding himself back, still keeping himself from kissing her.</p><p>\"You have to claim me as your mate,\" he said quietly. \"Sex regenerates our powers. It heightens them. I was trying so hard to keep from forcing you into the Claiming that I buried them too deeply. There is a delicate balance in all Arcadians and Katagaria between the human and animal half. I was fighting myself so hard to protect you that I ruptured the balance.\"</p><p>\"It can only be repaired by Claiming me?\"</p><p>He nodded.</p><p>\"And this Claiming, what is it exactly?\"</p><p>He traced the line of her jaw, making her burn from the inside out. \"When you Claim me, you acknowledge me as your soulmate. The ceremony is really quite simple. You place your marked palm over mine and then you take me into your body. You hold me there and say, 'I accept you as you are, and I will always hold you close to my heart. I will walk beside you forever.' \"</p><p>\"And then?\"</p><p>\"I repeat the words back to you.\"</p><p>That seemed just a little too easy to her. If that was all there was to it, why had he fought it so hard? \"That's it?\"</p><p>He hesitated.</p><p>Inwardly, she groaned. \"I know that look,\" she said, pulling back slightly from him. \"Any time you're not tell­ing me the whole truth you get that look.\"</p><p>He smiled at her and planted a chaste kiss on her cheek. \"All right, there is something more. When we join, my natural instinct will be to bond you to me.\"</p><p>That still didn't sound so bad. \"Bond me how?\"</p><p>\"With blood.\"</p><p>\"Okay, I don't like this part. What do you mean with blood?\"</p><p>He dropped his hands and leaned back on them to watch her. \"You know how humans will bind themselves together as blood brothers?\"</p><p>\"Yes.\"</p><p>\"It's basically the same thing—but with one major dif­ference. If you take my blood into you, our mortal lives are completely conjoined.\"</p><p>\"Meaning we will become one person?\" she asked.</p><p>\"No, nothing like that. Do you remember your Greek myths at all?\"</p><p>\"Some of them.\"</p><p>\"Do you remember who Atropos is?\"</p><p>She shook her head. \"Nope, not a clue.\"</p><p>\"She is one of the Moirae, the Fates. She's the one who assigns our mates to us at birth, and if we chose to bond</p><p>with that mate, her sister Clotho, who is the spinner of our lives, combines our life-threads together. At the end of a normal life Atropos will cut the thread and cause a death. But if we are bonded together and our threads are one, then she can't cut one without the other.\"</p><p>\"We die together.\"</p><p>\"Exactly.\"</p><p>Wow, that was a big commitment. Especially for him. \"So you will have a human life span.\"</p><p>\"No. My thread is stronger. You will have an Arcadian life span.\"</p><p>She blinked at that. \"Are you saying I could live several hundred years?\"</p><p>He nodded. \"Or we could both die tomorrow.\"</p><p>\"Whoa. Is there anything else?\" she asked, curiously. \"Will I also get some of your powers? Mind control? Time-walking?\"</p><p>He laughed at her. \"No. Sorry. My powers are tied to my birth and my destiny. Bonding only extends to our life-threads.\"</p><p>Channon smiled as she rose up on her knees, between his legs. She crouched over him, forcing him to lean back farther on his arms as she hovered over him. She bit her lip as she stared at his handsome face, at those lips she was dying to taste.</p><p>\"So, what you're offering me is a gorgeous, incredibly sexy man who is completely devoted to me for the next few centuries?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Yes.\"</p><p>She smiled even wider. \"One who can never stray?\"</p><p>\"Never.\"</p> <p>She forced him to lie back on the ground as she strad­dled his waist and leaned forward on her arms so that her face was just a few inches above his. She felt his hard erection through his pants, pressing against her core. How she wanted him. But first she wanted to make sure she understood all the consequences.</p><p>\"You know,\" she said, \"it's real hard to say no to this. What downside could there possibly be?\"</p><p>He shifted his hips under hers, making her burn for him as he tucked a stray piece of her hair back behind her ear. Still, he didn't touch her, and she knew he was leaving it all up to her now.</p><p>\"The Katagaria who want me dead,\" he said seriously. \"They will never cease coming for us, and because I am banished, it will only be the two of us to fight them off. Our children will be Arcadian and not human, and they, too, will have to battle the Katagaria. But most important, you will have to remain here in the Middle Ages.\"</p><p>\"Why?\"</p> <p>\"Because of the electricity in your time period. Arca­dians who are natural animals such as hawks, panthers, wolves, bears, and such can live in your world. If they are accidentally changed, their animal forms are small or normal enough to hide from humans.\"</p><p>\"But if you become a dragon, then we have a Godzilla movie.\"</p><p>\"Exactly. And in your time period, there are plenty of tasers and electrical devices that can completely incapac­itate me. No offense, but I don't relish being someone's science experiment. Been there, done that, and sold the T-shirt for profit.\"</p><p>She sat up straight, still straddling him, as she digested all of this.</p><p>The man offered her the deal of a lifetime.</p><p>Sebastian watched her carefully. It was taking all his restraint to keep his hands off her when all he wanted to do was make love to her. He'd told her everything. Now it was up to her, and he trembled with the fear that she would leave him.</p> <p>She took his hands in hers and held them to her waist. \"Our babies will be normal, right?\"</p><p>\"Perfectly normal. They will age like human children</p><p>with the only exception being that they won't be teenagers until their twenties.\"</p><p>\"And that's a drawback?\"</p><p>He laughed.</p><p>\"Oh, by the way, you're no longer banished.\"</p><p>Sebastian scowled. \"What?\"</p><p>\"While they were torturing Damos, the Katagaria ad­mitted that they had tricked you so they could get the tapestry from Antiphone. But she refused to let them have it.\"</p> <p>\"Why? What was so important about it?\"</p><p>\"Unfortunately nothing, but they believed that it con­tained the secret for immortality. It seems Katagaria leg­end had it that the granddaughter of their creator had placed his secrets into the work she'd created to honor him. They captured Damos, thinking he had it, and when they found out you alone knew where it was, they ar­ranged the bargain with you.\"</p><p>\"My sister died for no reason?\"</p><p>\"Sh,\" she said, placing her hand over his lips. \"Just be glad the truth is out and the tapestry is safe. Damos wants to make the past up to you.\"</p><p>Sebastian couldn't believe it. After all this time, his banishment was lifted?</p><p>That meant a real home for Channon where she would be safe. A home where their children would be safe.</p><p>Channon laid her body down over his and breathed him in. \"Which means you're no longer alone, Sebastian. You don't really need me.\"</p><p>\"That's not true. I need you more than I've ever needed anything else. My heart was dead until I looked into your eyes.\"</p><p>He cupped her face in his hands. \"I want you to Claim me, Channon,\" he said fiercely. \"I want to spend the rest of my life waking up with you in my arms and feeling your hair in my palm.\"</p><p>She choked as he used her words. He'd heard her. \"I want you, too.\"</p><p>Laughing, he rolled over with her, pinning her to the ground and letting her feel every hard, wonderful inch of his body.</p><p>They kissed each other in a frenzied hurry as they helped one another out of their clothes.</p><p>Channon pulled back as their naked bodies slid against each other. \"Does it count if we do this in a dream?\"</p><p>\"This isn't really a dream. It's an alternate place.\"</p><p>\"You know, you scare me when you talk like that.\"</p><p>He smiled at her. \"I have much to teach you about my world.\"</p><p>\"And I am willing to learn it all.\" Channon kissed those delectable lips as she wrapped her bare legs around his. She felt his erection against her hip, and it made her burn with need.</p><p>\"Axe you sure about this?\" he asked, nibbling his way along her jaw. \"You'll be giving up all your future Buffy episodes.\"</p><p>She drew her breath in sharply between her teeth as she thought it over. \"I have to tell you, it's a hard decision to make. Watching Spike prance around and be all Spikey, versus a couple hundred years of making love to a Greek god.\" She clucked her tongue. \"What is a woman to do?\"</p><p>She moaned as he ran his tongue around her ear and whispered, \"What can I do to sway your verdict?\"</p><p>\"That's a real good start right there.\" She sighed as her body erupted into chills and he dipped his head to torment her breast with his hot mouth. \"I guess I'll just have to find another pastime to television watching.\"</p><p>\"I think I can help you with that.\" He rolled over again to place her on top of him.</p><p>The intensity of his stare scalded her.</p><p>'Tradition demands you be in charge of this, my lady. The whole idea behind the Claiming is that the woman places her life and her trust into the hands of her mate.</p><p>Once you accept me, the animal inside me will do what­ever it takes to keep you safe.\"</p><p>\"Like when you turned into a dragon in front of all those people?\"</p><p>He nodded.</p><p>She smiled. \"You know it's a pity I didn't know you in third grade. There was this bully—\"</p><p>He cut her words off with a kiss.</p><p>\"Mmm,\" she breathed. \"I like that. Now, where were we?\"</p><p>She nibbled her way down his chin to his chest.</p><p>Sebastian growled as she found his nipple and teased it with her tongue and lips. He felt his powers surging again, felt the air around them charging with the force of it.</p><p>Channon felt it, too. She moaned as the energy moved around her body, caressing her.</p><p>Sebastian held his left hand up. The mark in his palm glowed and shimmered. Looking into his eyes, Channon covered his mark with hers and laced her fingers with his.</p><p>Heat engulfed her entire body as she felt something hot and demanding rush through her. She saw the beast in his eyes and the man as he breathed raggedly.</p><p>It was the sexiest thing she'd ever beheld.</p><p>Arching her back, she lifted her hips and took him deep into her body.</p><p>They moaned in unison.</p><p>She watched Sebastian's face as she slowly ground her­self against him. \"Urn, I forgot the words.\"</p><p>He laughed as he lifted his hips, driving himself so deep into her that she groaned. \"I accept you as you are.\"</p><p>\"Oh,\" she breathed, then remembering what she was doing, she repeated his words. \"I accept you as you are.\"</p><p>\"And I will always hold you close to my heart.\"</p><p>\"Umm, hmmm. I will most definitely hold you close to my heart.\"</p><p>\"I will walk beside you forever.\"</p><p>She placed her hand on his chest, over his heart. \"I will walk beside you forever.\"</p><p>His eyes turned eerily dark. He reached up with his free hand and cupped her cheek. His voice was a deep, low growl, a cross between the voice of the dragon and the voice of the man. \"I accept you as you are, and I will always hold you close to my heart. I will walk beside you forever.\"</p><p>He'd barely finished the words before his teeth grew long and sharp and his eyes darkened to the color of ob­sidian.</p><p>\"Sebastian?\"</p><p>\"Don't be afraid,\" he said as he bared his fangs. \"It's the dragon wanting to bond with you, but I have control of it.\"</p><p>\"And if I want to bond with you?\"</p><p>He hesitated. \"Do you understand what you're doing?\"</p><p>Channon paused with him inside her and locked gazes with him. \"I've lived alone all my life, Sebastian. I don't want to do it another day.\"</p><p>He sat up, keeping them joined.</p><p>Channon hissed at how good he felt as she wrapped her free arm around his waist and he pulled her against him with his.</p><p>She lifted her hips, then dropped herself down on him.</p><p>\"That's it, love, claim me as yours.\" Sebastian let her ride him slowly as he waited for more of his powers to return. He needed to be in total control for this.</p><p>Their marked hands still joined, he held her close to him so that he could feel her heart beating in rapid time to his.</p><p>When he was certain his powers were perfectly aligned, he leaned his head forward and sank his teeth gently into her neck.</p><p>Channon shivered at the feeling of his hot breath and teeth on her, but oddly enough, there was no pain at all. Instead, it was an erotic pleasure so intense that her entire</p><p>body exploded into a sensation of colors and sound. Her head fell back as she felt the strength of him moving through her, the smell of him engulfing her. It was elec­trifying and terrifying.</p><p>Her sight grew sharper and clearer, and she felt her teeth elongate.</p><p>Growling, she knew instinctively what she was sup­posed to do. She clutched feverishly at his shoulders, pull­ing herself up in his arms. Then she leaned forward and sank her teeth into his shoulder.</p><p>For an instant, time stood still with them locked to­gether. Channon couldn't breathe as her body and mind joined his in a place she'd never known existed. It was just the two of them. Just their hearts beating, their bodies joining.</p><p>Sebastian hissed as he felt their bonding. The air around them sizzled and spun as they came together in an orgasm so intense, so powerful, that they cried out in unison.</p><p>Panting and weak from it, he kissed her lips, holding her to him as he felt her teeth recede.</p><p>\"That was incredible,\" she said, still clutching him to her.</p><p>He smiled. 'Too bad it's a one-time thing.\"</p><p>\"Really?\"</p><p>He nodded. \"You're fully human again. Except you have a long life ahead of you.\"</p><p>She bit her lip and gave him a hot, promising look. \"And my own pet dragon.\"</p><p>\"Aye, my lady. And you can pet him any time you want.\"</p><p>She laughed at him. \"You know, since the moment I saw you, I keep having this strange feeling that all of this is just some weird dream.\"</p><p>\"Well, if it is, I don't want to wake up.\"</p><p>\"Neither do I, my love. Neither do I.\"</p><p>Two years later</p><p>Channon left the podium, her heart pounding in triumph. Every historian in the room had been left completely speechless by the paper and research she had just deliv­ered to them. She'd done the one thing she'd always wanted to do.</p><p>She'd solved the mystery of the tapestry, which now hung back in the museum.</p><p>\"Brilliant research, Dr. Kattalakis,\" Dr. Lazarus said, shaking her hand as she left the podium. \"Completely ground-breaking. This takes us into a whole new area.\"</p><p>\"Thank you.\"</p><p>She tried to step past him, but he cut her off.</p><p>\"How ever did you find those answers? I mean that Book of Dragons, you said it was from the Library of Alexandria. How did you ever find it?\"</p><p>She looked past his shoulder to see Sebastian leaning</p><p>against the wall with his arms folded across his chest, waiting patiently for her. Dressed all in black, he cut a fearsome pose.</p><p>Still, she missed seeing him in his armor. Something about the mail over those luscious muscles ...</p><p>She needed to get back home. Real soon.</p><p>She returned her attention to Dr. Lazarus and his ques­tions.</p><p>The Book of Dragons had been her birthday present from Sebastian last year. He said he'd swiped it the day before the fire that burned the ancient library. With that book and Antiphone's tapestry, she had been able to con­coct an entire mythology based on his people that was guaranteed to keep any \"experts\" from ever discovering the truth of the Draki people.</p><p>The Arcadian Draki were safe from human curiosity.</p><p>'The book was found in an estate sale. I've handed it over to the Richmond Museum.\" She patted his arm. \"Now, if you'll please excuse me?\"</p><p>She sidestepped him.</p><p>But before she could reach Sebastian, Dr. Herter stopped her. \"Have you reconsidered coming back to work?\"</p><p>She shook her head. \"No, sir. I told you, I'm retired.\"</p><p>\"But after that paper you just delivered—\"</p><p>\"I'm going home.\" She handed him the pages in her hand. \"Publish it and be happy.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Dr. Herter shook his gray head at her. \"The Myth of the Dragon. It's a brilliant piece of fiction.\"</p><p>She smiled. \"Yes, it is.\"</p><p>As soon as she reached her soulmate, Sebastian wrapped his arms around her and drew her close. \"I don't know if you helped us or hurt us with that.\"</p> <p>\"We can't let the humans know of you. This way, no one will question the tapestry anymore. It's preserved as you originally wanted, and the academic community can stop nosing around for the truth.\"</p><p>She looked up and saw him staring at the tapestry on the museum's wall. Anytime he thought of his sister, he always looked so incredibly sad. \"It's a pity the Fates won't let you guys change the past.\"</p><p>He sighed. \"I know. But if we try, they make us pay for it tenfold.\"</p><p>She hugged him tightly, then pulled back so they could leave.</p><p>\"Well,\" he said, draping his arm over her shoulders as he walked her out of the museum, \"tonight's the full moon. Are you ready to go home?\"</p> <p>\"Absolutely, Sir Dragon-Knight. But first...\"</p><p>\"I know,\" he said with a long-suffering sigh, \"it's the Buffy marathon torture that you always put me through whenever we visit here.\"</p><p>She laughed. He'd been very patient with her on their infrequent visits to her time period, where she caught up on all her favorite shows. \"Actually, I was thinking there is one thing I do miss most when we're in Sussex.\"</p><p>\"And that is?\"</p><p>\"Whipped cream loincloths.\"</p><p>He arched a brow at that, then smiled a wicked smile that flashed his dimples. \"Mmm, my lady, I definitely like the way your mind works.\"</p> <p>\"Glad to hear it, because you know what they say?\"</p><p>\"What's that?\" he asked as he opened the door for her.</p><p>\"Be kind to dragonswans, for thou art gorgeous when naked and taste good with Cool Whip.\" </p> </body></html>"]