["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was two weeks yet to Hallowe’en, but the gremlins were already at work.</p><p>Jerry MacKenzie turned Dolly II onto the runway full throttle, shoulder hunched, blood thumping, already halfway up Green leader’s arse—pulled back on the stick and got a choking shudder instead of the giddy lift of takeoff. Alarmed, he eased back, but before he could try again, there was a bang that made him jerk by reflex, smacking his head against the Perspex. It hadn’t been a bullet, though; the off tyre had blown, and a sickening tilt looped them off the runway, bumping and jolting into the grass.</p><p>There was a strong smell of petrol, and Jerry popped the Spitfire’s hood and hopped out in panic, envisioning imminent incineration, just as the last plane of Green flight roared past him and took wing, its engine fading to a buzz within seconds.</p><p>A mechanic was pelting down from the hangar to see what the trouble was, but Jerry’d already opened Dolly’s belly and the trouble was plain: the fuel line was punctured. Well, thank Christ he hadn’t got into the air with it, that was one thing, but he grabbed the line to see how bad the puncture was, and it came apart in his hands and soaked his sleeve nearly to the shoulder with high-test petrol. Good job the mechanic hadn’t come loping up with a lit cigarette in his mouth.</p> <p>He rolled out from under the plane, sneezing, and Gregory the mechanic stepped over him.</p><p>‘Not flying her today, mate,’ Greg said, squatting down to look up into the engine, and shaking his head at what he saw.</p><p>‘Aye, tell me something I don’t know.’ He held his soaked sleeve gingerly away from his body. ‘How long to fix her?’</p><p>Greg shrugged, eyes squinted against the cold wind as he surveyed Dolly’s guts.</p><p>‘Half an hour for the tyre. You’ll maybe have her back up tomorrow, if the fuel line’s the only engine trouble. Anything else we should be looking at?’</p> <p>‘Aye, the left wing-gun trigger sticks sometimes. Gie’ us a bit o’ grease, maybe?’</p><p>‘I’ll see what the canteen’s got in the way of leftover dripping. You best hit the showers, Mac. You’re turning blue.’</p><p>He was shivering, right enough, the rapidly evaporating petrol wicking his body heat away like candlesmoke. Still, he lingered for a moment, watching as the mechanic poked and prodded, whistling through his teeth.</p><p>‘Go on, then,’ Greg said in feigned exasperation, backing out of the engine and seeing Jerry still there. ‘I’ll take good care of her.’</p><p>‘Aye, I know. I just—aye, thanks.’ Adrenaline from the aborted flight was still surging through him, thwarted reflexes making him twitch. He walked away, suppressing the urge to look back over his shoulder at his wounded plane.</p><p>Jerry came out of the pilots’ WC half an hour later, eyes stinging with soap and petrol, backbone knotted. Half his mind was on Dolly, the other half with his mates. Blue and Green were up this morning, Red and Yellow resting. Green flight would be out over Flamborough Head by now, hunting.</p> <p>He swallowed, still restless, dry-mouthed by proxy, and went to fetch a cup of tea from the canteen. That was a mistake; he heard the gremlins laughing as soon as he walked in and saw Sailor Malan.</p><p>Malan was Group Captain and a decent bloke overall. South African, a great tactician—and the most ferocious, most persistent air fighter Jerry’d seen yet. Rat terriers weren’t in it. Which was why he felt a beetle skitter briefly down his spine when Malan’s deep-set eyes fixed on him.</p><p>‘Lieutenant!’ Malan rose from his seat, smiling. ‘The very man I had in mind!’</p><p>The Devil he had, Jerry thought, arranging his face into a look of respectful expectancy. Malan couldn’t have heard about Dolly’s spot of bother yet, and without that, Jerry would have scrambled with A squadron on their way to hunt 109s over Flamborough Head. Malan hadn’t been looking for Jerry; he just thought he’d do, for whatever job was up. And the fact that the Group Captain had called him by his rank, rather than his name, meant it probably wasn’t a job anyone would volunteer for.</p><p>He didn’t have time to worry about what that might be, though; Malan was introducing the other man, a tallish chap in army uniform with dark hair and a pleasant, if sharp, look about him. Eyes like a good sheepdog’s, he thought, nodding in reply to Captain Randall’s greeting. Kindly, maybe, but he won’t miss much.</p><p>‘Randall’s come over from Ops at Ealing,’ Sailor was saying over his shoulder. He hadn’t waited for them to exchange polite chat, but was already leading them out across the tarmac, heading for the Flight Command offices. Jerry grimaced and followed, casting a longing glance downfield at Dolly, who was being towed ignominiously into the hangar. The rag doll painted on her nose was blurred, the black curls partially dissolved by weather and spilled petrol. Well, he’d touch it up later, when he’d heard the details of whatever horrible job the stranger had brought.</p><p>His gaze rested resentfully on Randall’s neck, and the man turned suddenly, glancing back over his shoulder as though he’d felt the stress of Jerry’s regard. Jerry felt a qualm in the pit of his stomach, as half-recognised observations—the lack of insignia on the uniform, that air of confidence peculiar to men who kept secrets—gelled with the look in the stranger’s eye.</p><p>Ops at Ealing, my Aunt Fanny, he thought. He wasn’t even surprised, as Sailor waved Randall through the door, to hear the Group Captain lean close and murmur in his ear, ‘Careful—he’s a funny bugger.’</p> <p>Jerry nodded, stomach tightening. Malan didn’t mean Captain Randall was either humorous or a Freemason. ‘Funny bugger’ in this context meant only one thing. MI6.</p><p>Captain Randall was from the secret arm of British Intelligence. He made no bones about it, once Malan had deposited them in a vacant office and left them to it.</p><p>‘We’re wanting a pilot—a good pilot,’ he added with a faint smile, ‘to fly solo reconnaissance. A new project. Very special.’</p><p>‘Solo? Where?’ Jerry asked warily. Spitfires normally flew in four-plane flights, or in larger configurations, all the way up to an entire squadron, sixteen planes. In formation, they could cover one another to some extent against the heavier Heinkels and Messerschmitts. But they seldom flew alone by choice.</p><p>‘I’ll tell you that a bit later. First—are you fit, do you think?’</p><p>Jerry reared back a bit at that, stung. What did this bloody boffin think he—Then he caught a glance at his reflection in the windowpane. Eyes red as a mad boar’s, his wet hair sticking up in spikes, a fresh red bruise spreading on his forehead, and his blouson stuck to him in damp patches where he hadn’t bothered to dry off before dressing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>‘Extremely fit,’ he snapped. ‘Sir.’</p><p>Randall lifted a hand half an inch, dismissing the need for sirs.</p><p>‘I meant your knee,’ he said mildly.</p><p>‘Oh,’ Jerry said, disconcerted. ‘That. Aye, it’s fine.’</p> <p>He’d taken two bullets through his right knee a year before, when he’d dived after a 109 and neglected to see another one that popped out of nowhere behind him and peppered his arse.</p><p>On fire, but terrified of bailing out into a sky filled with smoke, bullets, and random explosions, he’d ridden his burning plane down, both of them screaming as they fell out of the sky, Dolly I’s metal skin so hot it had seared his left forearm through his jacket, his right foot squelching in the blood that filled his boot as he stamped the pedal. Made it, though, and had been on the sick-and-hurt list for two months. He still limped very noticeably, but he didn’t regret his smashed patella; he’d had his second month’s sick leave at home—and wee Roger had come along nine months later.</p><p>He smiled broadly at the thought of his lad, and Randall smiled back in involuntary response.</p><p>‘Good,’ he said. ‘You’re all right to fly a long mission, then?’</p><p>Jerry shrugged. ‘How long can it be in a Spitfire? Unless you’ve thought up a way to refuel in the air.’ He’d meant that as a joke, and was further disconcerted to see Randall’s lips purse a little, as though thinking whether to tell him they had.</p> <p>‘It is a Spitfire ye mean me to fly?’ he asked, suddenly uncertain. Christ, what if it was one of the experimental birds they heard about now and again? His skin prickled with a combination of fear and excitement. But Randall nodded.</p><p>‘Oh, yes, certainly. Nothing else is manoeuvrable enough, and there may be a good bit of ducking and dodging. What we’ve done is to take a Spitfire II, remove one pair of wing guns, and refit it with a pair of cameras.’</p><p>‘One pair?’</p><p>Again, that slight pursing of lips before Randall replied.</p><p>‘You might need the second pair of guns.’</p><p>‘Oh. Aye. Well, then ...’</p> <p>The immediate notion, as Randall explained it, was for Jerry to go to Northumberland, where he’d spend two weeks being trained in the use of the wing cameras, taking pictures of selected bits of landscape at different altitudes. And where he’d work with a support team who were meant to be trained in keeping the cameras functioning in bad weather. They’d teach him how to get the film out without ruining it, just in case he had to. After which ...</p><p>‘I can’t tell you yet exactly where you’ll be going,’ Randall said. His manner through the conversation had been intent, but friendly, joking now and then. Now all trace of joviality had vanished; he was dead serious. ‘Eastern Europe is all I can say just now.’</p><p>Jerry felt his inside hollow out a little and took a deep breath to fill the empty space. He could say no. But he’d signed up to be an RAF flier, and that’s what he was.</p><p>‘Aye, right. Will I—maybe see my wife once, before I go, then?’</p><p>Randall’s face softened a little at that, and Jerry saw the Captain’s thumb touch his own gold wedding ring in reflex.</p><p>‘I think that can be arranged.’</p><p>Marjorie MacKenzie—Dolly, to her husband—opened the blackout curtains. No more than an inch ... well, two inches. It wouldn’t matter; the inside of the little flat was dark as the inside of a coal scuttle. London outside was equally dark; she knew the curtains were open only because she felt the cold glass of the window through the narrow crack. She leaned close, breathing on the glass, and felt the moisture of her breath condense, cool near her face. Couldn’t see the mist, but felt the squeak of her fingertip on the glass as she quickly drew a small heart there, the letter J inside.</p><p>It faded at once, of course, but that didn’t matter; the charm would be there when the light came in, invisible but there, standing between her husband and the sky.</p> <p>When the light came, it would fall just so, across his pillow. She’d see his sleeping face in the light: the jackstraw hair, the fading bruise on his temple, the deep-set eyes, closed in innocence. He looked so young, asleep. Almost as young as he really was. Only twenty-two; too young to have such lines in his face. She touched the corner of her mouth but couldn’t feel the crease the mirror showed her—her mouth was swollen, tender, and the ball of her thumb ran across her lower lip, lightly, to and fro.</p><p>What else, what else? What more could she do for him? He’d left her with something of himself. Perhaps there would be another baby—something he gave her, but something she gave him, as well. Another baby. Another child to raise alone?</p><p>‘Even so,’ she whispered, her mouth tightening, face raw from hours of stubbled kissing; neither of them had been able to wait for him to shave. ‘Even so.’</p><p>At least he’d got to see Roger. Hold his little boy—and have said little boy sick up milk all down the back of his shirt. Jerry’d yelped in surprise, but hadn’t let her take Roger back; he’d held his son and petted him until the wee mannie fell asleep, only then laying him down in his basket and stripping off the stained shirt before coming to her.</p><p>It was cold in the room, and she hugged herself. She was wearing nothing but Jerry’s string vest—he thought she looked erotic in it, ‘lewd,’ he said, approving, his Highland accent making the word sound really dirty—and the thought made her smile. The thin cotton clung to her br**sts, true enough, and her ni**les poked out something scandalous, if only from the chill.</p><p>She wanted to go crawl in next to him, longing for his warmth, longing to keep touching him for as long as they had. He’d need to go at eight, to catch the train back; it would barely be light then. Some puritanical impulse of denial kept her hovering there, though, cold and wakeful in the dark. She felt as though if she denied herself, her desire, offered that denial as sacrifice, it would strengthen the magic, help to keep him safe and bring him back. God knew what a minister would say to that bit of superstition, and her tingling mouth twisted in self-mockery. And doubt.</p><p>Still, she sat in the dark, waiting for the cold blue light of the dawn that would take him.</p><p>Baby Roger put an end to her dithering, though; babies did. He rustled in his basket, making the little waking-up grunts that presaged an outraged roar at the discovery of a wet nappy and an empty stomach, and she hurried across the tiny room to his basket, br**sts swinging heavy, already letting down her milk. She wanted to keep him from waking Jerry, but stubbed her toe on the spindly chair, and sent it over with a bang. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There was an explosion of bedclothes as Jerry sprang up with a loud ‘FUCK!’ that drowned her own muffled ‘Damn!’ and Roger topped them both with a shriek like an air-raid siren. Like clockwork, old Mrs Munns in the next flat thumped indignantly on the thin wall.</p><p>Jerry’s naked shape crossed the room in a bound. He pounded furiously on the partition with his fist, making the wallboard quiver and boom like a drum. He paused, fist still raised, waiting. Roger had stopped screeching, impressed by the racket.</p><p>Dead silence from the other side of the wall, and Marjorie pressed her mouth against Roger’s round little head to muffle her giggling. He smelled of baby scent and fresh pee, and she cuddled him like a large hot-water bottle, his immediate warmth and need making her notions of watching over her men in the lonely cold seem silly.</p><p>Jerry gave a satisfied grunt and came across to her.</p> <p>‘Ha,’ he said, and kissed her.</p><p>‘What d’ye think you are?’ she whispered, leaning into him. ‘A gorilla?’</p><p>‘Yeah,’ he whispered back, taking her hand and pressing it against him. ‘Want to see my banana?’</p><p>‘Dzie dobry.’</p><p>Jerry halted in the act of lowering himself into a chair, and stared at a smiling Frank Randall.</p> <p>‘Oh, aye,’ he said. ‘Like that, is it? Niech sie pan odpierdoli.’ It meant, ‘Fuck off, sir,’ in formal Polish, and Randall, taken by surprise, broke out laughing.</p><p>‘Like that,’ he agreed. He had a wodge of papers with him, official forms, all sorts, the bumf, as the pilots called it—Jerry recognised the one you signed that named who your pension went to, and the one about what to do with your body if there was one and anyone had time to bother. He’d done all that when he signed up, but they made you do it again, if you went on special service. He ignored the forms, though, eyes fixed instead on the maps Randall had brought.</p><p>‘And here’s me thinkin’ you and Malan picked me for my bonny face,’ he drawled, exaggerating his accent. He sat and leaned back, affecting casualness. ‘It is Poland, then?’ So it hadn’t been coincidence, after all—or only the coincidence of Dolly’s mishap sending him into the building early. In a way, that was comforting; it wasn’t the bloody Hand of Fate tapping him on the shoulder by puncturing the fuel line. The Hand of Fate had been in it a good bit earlier, putting him in Green flight with Andrej Kolodziewicz.</p><p>Andrej was a real guid yin, a good friend. He’d copped it a month before, spiralling up away from a Messerschmitt. Maybe he’d been blinded by the sun, maybe just looking over the wrong shoulder. Left wing shot to hell, and he’d spiralled right back down and into the ground. Jerry hadn’t seen the crash, but he’d heard about it. And got drunk on vodka with Andrej’s brother after.</p><p>‘Poland,’ Randall agreed. ‘Malan says you can carry on a conversation in Polish. That true?’</p><p>‘I can order a drink, start a fight, or ask directions. Any of that of use?’</p> <p>‘The last one might be,’ Randall said, very dry. ‘But we’ll hope it doesn’t come to that.’</p><p>The MI6 agent had pushed aside the forms and unrolled the maps. Despite himself, Jerry leaned forward, drawn as by a magnet. They were official maps, but with markings made by hand—circles, X’s.</p><p>‘It’s like this,’ Randall said, flattening the maps with both hands. ‘The Nazis have had labour camps in Poland for the last two years, but it’s not common knowledge among the public, either home or abroad. It would be very helpful to the war effort if it were common knowledge. Not just the camps’ existence, but the kind of thing that goes on there.’ A shadow crossed the dark, lean face—anger, Jerry thought, intrigued. Apparently, Mr. MI6 knew what kind of thing went on there, and he wondered how.</p><p>‘If we want it widely known and widely talked about—and we do—we need documentary evidence,’ Randall said matter-of-factly. ‘Photographs.’</p><p>There’d be four of them, he said, four Spitfire pilots. A flight—but they wouldn’t fly together. Each one of them would have a specific target, geographically separate, but all to be hit on the same day.</p><p>‘The camps are guarded, but not with anti-aircraft ordnance. There are towers, though; machine-guns.’ And Jerry didn’t need telling that a machine-gun was just as effective in someone’s hands as it was from an enemy plane. To take the sort of pictures Randall wanted would mean coming in low—low enough to risk being shot from the towers. His only advantage would be the benefit of surprise; the guards might spot him, but they wouldn’t be expecting him to come diving out of the sky for a low pass just above the camp.</p><p>‘Don’t try for more than one pass, unless the cameras malfunction. Better to have fewer pictures than none at all.’</p><p>‘Yes, sir.’ He’d reverted to ‘sir,’ as Group Captain Malan was present at the meeting, silent but listening intently. Got to keep up appearances.</p> <p>‘Here’s the list of the targets you’ll practise on in Northumberland. Get as close as you think reasonable, without risking—’ Randall’s face did change at that, breaking into a wry smile. ‘Get as close as you can manage with a chance of coming back, all right? The cameras may be worth even more than you are.’</p><p>That got a faint chuckle from Malan. Pilots—especially trained pilots—were valuable. The RAF had plenty of planes now, but nowhere near enough pilots to fly them.</p><p>He’d be taught to use the wing cameras and to unload the film safely. If he was shot down but was still alive and the plane didn’t burn, he was to get the film out and try to get it back over the border.</p><p>‘Hence the Polish.’ Randall ran a hand through his hair, and gave Jerry a crooked smile. ‘If you have to walk out, you may need to ask directions.’ They had two Polish-speaking pilots, he said—one Pole and a Hungarian who’d volunteered, and an Englishman with a few words of the language, like Jerry.</p><p>‘And it is a volunteer mission, let me reiterate.’</p><p>‘Aye, I know,’ Jerry said irritably. ‘Said I’d go, didn’t I? Sir.’</p><p>‘You did.’ Randall looked at him for a moment, dark eyes unreadable, then lowered his gaze to the maps again. ‘Thanks,’ he said softly.</p><p>The canopy snicked shut over his head. It was a dank, damp Northumberland day, and his breath condensed on the inside of the Perspex hood within seconds. He leaned forward to wipe it away, emitting a sharp yelp as several strands of his hair were ripped out. He’d forgotten to duck. Again. He shoved the canopy release with a muttered oath and the light brown strands that had caught in the seam where the Perspex closed flew away, caughtup by the wind. He closed the canopy again, crouching, and waiting for the signal for takeoff. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The signalman wig-wagged him, and he turned up the throttle, feeling the plane begin to move.</p><p>He touched his pocket automatically, whispering, ‘Love you, Dolly,’ under his breath. Everyone had his little rituals, those last few moments before takeoff. For Jerry MacKenzie, it was his wife’s face and his lucky stone that usually settled the worms in his belly. She’d found it in a rocky hill on the Isle of Lewis, where they’d spent their brief honeymoon—a rough sapphire, she said, very rare.</p><p>‘Like you,’ he’d said, and kissed her.</p><p>No need for worms just the now, but it wasn’t a ritual if you only did it sometimes, was it? And even if it wasn’t going to be combat today, he’d need to be paying attention.</p> <p>He went up in slow circles, getting the feel of the new plane, sniffing to get her scent. He wished they’d let him fly Dolly II, her seat stained with his sweat, the familiar dent in the console where he’d slammed his fist in exultation at a kill—but they’d already modified this one with the wing cameras and the latest thing in night sights. It didn’t do to get attached to the planes, anyway; they were almost as fragile as the men flying them, though the parts could be reused.</p><p>No matter; he’d sneaked out to the hangar the evening before and done a quick rag doll on the nose to make it his. He’d know Dolly III well enough by the time they went into Poland.</p><p>He dived, pulled up sharp, and did Dutch rolls for a bit, wig-wagging through the cloud layer, then complete rolls and Immelmanns, all the while reciting Malan’s Rules to focus his mind and keep from getting airsick.</p><p>The Rules were posted in every RAF barracks now: the Ten Commandments, the fliers called them—and not as a joke.</p><p>TEN OF MY RULES FOR AIR FIGHTING, the poster said in bold black type. Jerry knew them by heart.</p> <p>‘Wait until you see the whites of his eyes,’ he chanted under his breath. ‘Fire short bursts of one to two seconds only when your sights are definitely “ON.” ’ He glanced at his sights, suffering a moment’s disorientation. The camera wizard had relocated them. Shite.</p><p>‘Whilst shooting, think of nothing else, brace the whole of your body: have both hands on the stick: concentrate on your ring sight.’ Well, away to f**k, then. The buttons that operated the camera weren’t on the stick; they were on a box connected to a wire that ran out the window; the box itself was strapped to his knee. He’d be bloody looking out the window anyway, not using sights—unless things went wrong and he had to use the guns. In which case ...</p><p>‘Always keep a sharp lookout. “Keep your finger out.” ’ Aye, right, that one was still good.</p><p>‘Height gives you the initiative.’ Not in this case. He’d be flying low, under the radar, and not be looking for a fight. Always the chance one might find him, though. If any German craft found him flying solo in Poland, his best chance was likely to head straight for the sun and fall in. That thought made him smile.</p><p>‘Always turn and face the attack.’ He snorted and flexed his bad knee, which ached with the cold. Aye, if you saw it coming in time.</p><p>‘Make your decisions promptly. It is better to act quickly even though your tactics are not the best.’ He’d learnt that one fast. His body often was moving before his brain had even notified his consciousness that he’d seen something. Nothing to see just now, nor did he expect to, but he kept looking by reflex.</p> <p>‘Never fly straight and level for more than thirty seconds in the combat area.’ Definitely out. Straight and level was just what he was going to have to do. And slowly.</p><p>‘When diving to attack, always leave a proportion of your formation above to act as a top guard.’ Irrelevant; he wouldn’t have a formation—and that was a thought that gave him the cold grue. He’d be completely alone, no help coming if he got into bother.</p><p>‘INITIATIVE, AGGRESSION, AIR DISCIPLINE, and TEAM WORK are words that MEAN something in Air Fighting.’ Yeah, they did. What meant something in reconnaissance? Stealth, Speed, and Bloody Good Luck, more like. He took a deep breath, and dived, shouting the last of the Ten Commandments so it echoed in his Perspex shell.</p><p>‘Go in quickly—Punch hard—GET OUT!’</p><p>Rubbernecking, they called it, but Jerry usually ended a day’s flying feeling as though he’d been cast in concrete from the shoulder blades up. He bent his head forward now, ferociously massaging the base of his skull to ease the growing ache. He’d been practising since dawn, and it was nearly teatime. Ball bearings, set, for the use of pilots, one, he thought. Ought to add that to the standard equipment list. He shook his head like a wet dog, hunched his shoulders, groaning, then resumed the sector-by-sector scan of the sky around him that every pilot did religiously, three hundred and sixty degrees, every moment in the air. All the live ones, anyway.</p><p>Dolly’d given him a white silk scarf as a parting present. He didn’t know how she’d managed the money for it and she wouldn’t let him ask, just settled it round his neck inside his flight jacket. Somebody’d told her the Spitfire pilots all wore them, to save the constant collar chafing, and she meant him to have one. It felt nice, he’d admit that. Made him think of her touch when she’d put it on him. He pushed the thought hastily aside; the last thing he could afford to do was start thinking about his wife, if he ever hoped to get back to her. And he did mean to get back to her.</p><p>Where was that bugger? Had he given up?</p><p>No, he’d not; a dark spot popped out from behind a bank of cloud just over his left shoulder and dived for his tail. Jerry turned, a hard, high spiral, up and into the same clouds, the other after him like stink on shite. They played at dodgem for a few moments, in and out of the drifting clouds—he had the advantage in altitude, could play the coming-out-of-the-sun trick, if there was any sun, but it was autumn in Northumberland and there hadn’t been any sun in days ...</p> <p>Gone. He heard the buzzing of the other plane, faintly, for a moment—or thought he had. Hard to tell above the dull roar of his own engine. Gone, though; he wasn’t where Jerry’d expected him to be.</p><p>‘Oh, like that, is it?’ He kept on looking, ten degrees of sky every second; it was the only way to be sure you didn’t miss any—A glimpse of something dark, and his heart jerked along with his hand. Up and away. It was gone then, the black speck, but he went on climbing, slowly now, looking. Wouldn’t do to get too low, and he wanted to keep the altitude ... </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The cloud was thin here, drifting waves of mist, but getting thicker. He saw a solid-looking bank of cloud moving slowly in from the west, but still a good distance away. It was cold, too; his face was chilled. He might be picking up ice if he went too hi—There.</p><p>The other plane, closer and higher than he’d expected. The other pilot spotted him at the same moment and came roaring down on him, too close to avoid. He didn’t try.</p><p>‘Aye, wait for it, ye wee bugger,’ he murmured, hand tight on the stick. One second, two, almost on him—and he buried the stick in his balls, jerked it hard left, turned neatly over, and went off in a long, looping series of barrel rolls that put him right away out of range.</p><p>His radio crackled and he heard Paul Rakoczy chortling through his hairy nose.</p> <p>‘Kurwa twoja mac! Where you learn that, you Scotch f**ker?’</p><p>‘At my mammy’s tit, dupek,’ he replied, grinning. ‘Buy me a drink, and I’ll teach it to ye.’</p><p>A burst of static obscured the end of an obscene Polish remark, and Rakoczy flew off with a wig-wag of farewell. Ah, well. Enough skylarking, then; back to the f**king cameras.</p><p>Jerry rolled his head, worked his shoulders and stretched as well as could be managed in the confines of a II’s cockpit—it had minor improvements over the Spitfire I, but roominess wasn’t one of them—had a glance at the wings for ice—no, that was all right—and turned farther inland.</p><p>It was too soon to worry over it, but his right hand found the trigger that operated the cameras. His fingers twiddled anxiously over the buttons, checking, rechecking. He was getting used to them, but they didn’t work like the gun triggers; he didn’t have them wired in to his reflexes yet. Didn’t like the feeling, either. Tiny things, like typewriter keys, not the snug feel of the gun triggers.</p> <p>He’d had the left-handed ones only since yesterday; before that, he’d been flying a plane with the buttons on the right. Much discussion with Flight and the MI6 button-boffin, whether it was better to stay with the right, as he’d had practice already, or change for the sake of his cack-handedness. When they’d finally got round to asking him which he wanted, it had been too late in the day to fix it straight off. So he’d been given a couple of hours’ extra flying time today, to mess about with the new fix-up.</p><p>Right, there it was. The bumpy grey line that cut through the yellowing fields of Northumberland like a perforation, same as you might tear the countryside along it, separating north from south as neat as tearing a piece of paper. Bet the emperor Hadrian wished it was that easy, he thought, grinning, as he swooped down along the line of the ancient wall.</p><p>The cameras made a loud clunk-clunk noise when they fired. Clunk-clunk, clunk-clunk! Okay, sashay out, bank over, come down ... clunk-clunk, clunk-clunk ... He didn’t like the noise, not the same satisfaction as the vicious short Brrpt! of his wing guns. Made him feel wrong, like something gone with the engine ... Aye, there it was coming up, his goal for the moment.</p><p>Mile-castle 37.</p><p>A stone rectangle, attached to Hadrian’s Wall like a snail on a leaf. The old Roman legions had made these small, neat forts to house the garrisons that guarded the wall. Nothing left now but the outline of the foundation, but it made a good target.</p><p>He circled once, calculating, then dived and roared over it at an altitude of maybe fifty feet, cameras clunking like an army of stampeding robots. Pulled up sharp and hared off, circling high and fast, pulling out to run for the imagined border, circling up again ... and all the time his heart thumped and the sweat ran down his sides, imagining what it would be like when the real day came.</p> <p>Mid-afternoon, it would be, like this. The winter light just going, but still enough to see clearly. He’d circle, find an angle that would let him cross the whole camp and please God, one that would let him come out of the sun. And then he’d go in.</p><p>One pass, Randall had said. Don’t risk more than one, unless the cameras malfunction.</p><p>The bloody things did malfunction, roughly every third pass. The buttons were slippery under his fingers. Sometimes they worked on the next try; sometimes they didn’t.</p><p>If they didn’t work on the first pass over the camp, or didn’t work often enough, he’d have to try again.</p><p>‘Niech to szlag,’ he muttered, Fuck the Devil, and pressed the buttons again, one-two, one-two. ‘Gentle but firm, like you’d do it to a lady’s privates,’ the boffin had told him, illustrating a brisk twiddle. He’d never thought of doing that ... Would Dolly like it? he wondered. And where exactly did you do it? Aye, well, women did come with a button, maybe that was it—but then, two fingers? ... Clunk-clunk. Clunk-clunk. Crunch.</p><p>He reverted to English profanity, and smashed both buttons with his fist. One camera answered with a startled clunk! but the other was silent.</p><p>He poked the button again and again, to no effect. ‘Bloody f**king arse-buggering ...’ He thought vaguely that he’d have to stop swearing once this was over and he was home again—bad example for the lad.</p><p>‘FUCK!’ he bellowed, and ripping the strap free of his leg, he picked up the box and hammered it on the edge of the seat, then slammed it back onto his thigh—visibly dented, he saw with grim satisfaction—and pressed the balky button.</p> <p>Clunk, the camera answered meekly.</p><p>‘Aye, well, then, just you remember that!’ he said, and, puffing in righteous indignation, gave the buttons a good jabbing.</p><p>He’d not been paying attention during this small temper-tantrum, but had been circling upward—standard default for a Spitfire flier. He started back down for a fresh pass at the mile-castle, but within a minute or two, began to hear a knocking sound from the engine.</p><p>‘No!’ he said, and gave it more throttle. The knocking got louder; he could feel it vibrating through the fuselage. Then there was a loud clang! from the engine compartment right by his knee, and with horror he saw tiny droplets of oil spatter on the Perspex in front of his face. The engine stopped.</p><p>‘Bloody, bloody ...’ He was too busy to find another word. His lovely agile fighter had suddenly become a very clumsy glider. He was going down and the only question was whether he’d find a relatively flat spot to crash in.</p><p>His hand groped automatically for the landing gear but then drew back—no time, belly landing, where was the bottom? Jesus, he’d been distracted, hadn’t seen that solid bank of cloud move in; it must have come faster than he ... Thoughts flitted through his mind, too fast for words. He glanced at the altimeter, but what it told him was of limited use, because he didn’t know what the ground under him was like: crags, flat meadow, water? He hoped and prayed for a road, a grassy flat spot, anything short of—God, he was at five hundred feet and still in cloud! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>‘Christ!’</p><p>The ground appeared in a sudden burst of yellow and brown. He jerked the nose up, saw the rocks of a crag dead ahead, swerved, stalled, nose-dived, pulled back, pulled back, not enough, Oh, God—</p><p>His first conscious thought was that he should have radioed base when the engine went.</p><p>‘Stupid f**ker,’ he mumbled. ‘Make your decisions promptly. It is better to act quickly even though your tactics are not the best. Clot-heid.’</p> <p>He seemed to be lying on his side. That didn’t seem right. He felt cautiously with one hand—grass and mud. What, had he been thrown clear of the plane?</p><p>He had. His head hurt badly, his knee much worse. He had to sit down on the matted wet grass for a bit, unable to think through the waves of pain that squeezed his head with each heartbeat.</p><p>It was nearly dark, and rising mist surrounded him. He breathed deep, sniffing the dank, cold air. It smelt of rot and old mangelwurzels—but what it didn’t smell of was petrol and burning fuselage.</p><p>Right. Maybe she hadn’t caught fire when she crashed, then. If not, and if her radio was still working ...</p><p>He staggered to his feet, nearly losing his balance from a sudden attack of vertigo, and turned in a slow circle, peering into the mist. There was nothing but mist to his left and behind him, but to his right, he made out two or three large, bulky shapes, standing upright.</p> <p>Making his way slowly across the lumpy ground, he found that they were stones. Remnants of one of those prehistoric sites that littered the ground in northern Britain. Only three of the big stones were still standing, but he could see a few more, fallen or pushed over, lying like bodies in the darkening fog. He paused to vomit, holding on to one of the stones. Christ, his head was like to split! And he had a terrible buzzing in his ears ... He pawed vaguely at his ear, thinking somehow he’d left his headset on, but felt nothing but a cold, wet ear.</p><p>He closed his eyes again, breathing hard, and leaned against the stone for support. The static in his ears was getting worse, accompanied by a sort of whine. Had he burst an eardrum? He forced himself to open his eyes, and was rewarded with the sight of a large, dark irregular shape, well beyond the remains of the stone circle. Dolly!</p><p>The plane was barely visible, fading into the swirling dark, but that’s what it had to be. Mostly intact, it looked like, though very much nose-down with her tail in the air—she must have ploughed into the earth. He staggered on the rock-strewn ground, feeling the vertigo set in again, with a vengeance. He waved his arms, trying to keep his balance, but his head spun, and Christ, the bloody noise in his head ... He couldn’t think, oh, Jesus, he felt as if his bones were dissolv—</p><p>It was full dark when he came to himself, but the clouds had broken and a three-quarter moon shone in the deep black of a country sky. He moved, and groaned. Every bone in his body hurt—but none was broken. That was something, he told himself. His clothes were sodden with damp, he was starving, and his knee was so stiff he couldn’t straighten his right leg all the way, but that was all right; he thought he could make shift to hobble as far as a road.</p><p>Oh, wait. Radio. Yes, he’d forgotten. If Dolly’s radio were intact, he could ...</p><p>He stared blankly at the open ground before him. He’d have sworn it was—but he must have got turned round in the dark and fog—no.</p> <p>He turned quite round, three times, before he stopped, afraid of becoming dizzy again. The plane was gone.</p><p>It was gone. He was sure it had lain about fifty feet beyond that one stone, the tallest one; he’d taken note of it as a marker, to keep his bearings. He walked out to the spot where he was sure Dolly had come down, walked slowly round the stones in a wide circle, glancing to one side and then the other in growing confusion.</p><p>Not only was the plane gone, it didn’t seem ever to have been there. There was no trace, no furrow in the thick meadow grass, let alone the kind of gouge in the earth that such a crash would have made. Had he been imagining its presence? Wishful thinking?</p><p>He shook his head to clear it—but in fact, it was clear. The buzzing and whining in his ears had stopped, and while he still had bruises and a mild headache, he was feeling much better. He walked slowly back around the stones, still looking, a growing sense of deep cold curling through his wame. It wasn’t f**king there.</p><p>He woke in the morning without the slightest notion where he was. He was curled up on grass; that much came dimly to him—he could smell it. Grass that cattle had been grazing, because there was a large cow pat just by him, and fresh enough to smell that, too. He stretched out a leg, cautious. Then an arm. Rolled onto his back, and felt a hair better for having something solid under him, though the sky overhead was a dizzy void.</p><p>It was a soft, pale blue void, too. Not a trace of cloud.</p><p>How long ...? A jolt of alarm brought him up onto his knees, but a bright yellow stab of pain behind his eyes sat him down again, moaning and cursing breathlessly.</p><p>Once more. He waited ’til his breath was coming steady, then risked cracking one eye open.</p> <p>Well, it was certainly still Northumbria, the northern part, where England’s billowing fields crash onto the inhospitable rocks of Scotland. He recognised the rolling hills, covered with sere grass and punctuated by towering rocks that shot straight up into sudden toothy crags. He swallowed, and rubbed both hands hard over his head and face, assuring himself he was still real. He didn’t feel real. Even after he’d taken a careful count of fingers, toes, and private bits—counting the last twice, just in case—he still felt that something important had been misplaced, torn off somehow, and left behind.</p><p>His ears still rang, rather like they did after an especially active trip. Why, though? What had he heard?</p><p>He found that he could move a little more easily now, and managed to look all round the sky, sector by sector. Nothing up there. No memory of anything up there. And yet the inside of his head buzzed and jangled, and the flesh on his body rippled with agitation. He chafed his arms, hard, to make it go.</p><p>Horripilation. That’s the proper word for gooseflesh; Dolly’d told him that. She kept a little notebook and wrote down words she came across in her reading; she was a great one for the reading. She’d already got wee Roger sitting in her lap to be read to after tea, round-eyed as Bonzo at the coloured pictures in his rag book.</p><p>Thought of his family got him up onto his feet, swaying, but all right now, better, yes, definitely better, though he still felt as though his skin didn’t quite fit. The plane, where was that? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He looked round him. No plane was visible. Anywhere. Then it came back to him, with a lurch of the stomach. Real, it was real. He’d been sure in the night that he was dreaming or hallucinating, had lain down to recover himself, and must have fallen asleep. But he was awake now, no mistake; there was a bug of some kind down his back, and he slapped viciously to try to squash it.</p><p>His heart was pounding unpleasantly and his palms were sweating. He wiped them on his trousers and scanned the landscape. It wasn’t flat, but neither did it offer much concealment. No trees, no bosky dells. There was a small lake off in the distance—he caught the shine of water—but if he’d ditched in water, surely to God he’d be wet?</p><p>Maybe he’d been unconscious long enough to dry out, he thought. Maybe he’d imagined that he’d seen the plane near the stones. Surely he couldn’t have walked this far from the lake and forgotten it? He’d started walking toward the lake, out of sheer inability to think of anything more useful to do. Clearly time had passed; the sky had cleared like magic. Well, they’d have little trouble finding him, at least; they knew he was near the wall. A truck should be along soon; he couldn’t be more than two hours from the airfield.</p><p>‘And a good thing, too,’ he muttered. He’d picked an especially godforsaken spot to crash—there wasn’t a farmhouse or a paddock anywhere in sight, not so much as a sniff of chimney smoke.</p> <p>His head was becoming clearer now. He’d circle the lake—just in case—then head for the road. Might meet the support crew coming in.</p><p>‘And tell them I’ve lost the bloody plane?’ he asked himself aloud. ‘Aye, right. Come on, ye wee idjit, think! Now, where did ye see it last?’</p><p>He walked for a long time. Slowly, because of the knee, but that began to feel easier after a while. His mind was not feeling easier. There was something wrong with the countryside. Granted, Northumbria was a ragged sort of place, but not this ragged. He’d found a road—but it wasn’t the B road he’d seen from the air. It was a dirt track, pocked with stones and showing signs of being much travelled by hooved animals with a heavily fibrous diet.</p><p>Wished he hadn’t thought of diet. His wame was flapping against his backbone. Thinking about breakfast was better than thinking about other things, though, and for a time, he amused himself by envisioning the powdered eggs and soggy toast he’d have got in the mess, then going on to the lavish breakfasts of his youth in the Highlands: huge bowls of steaming parritch, slices of black pudding fried in lard, bannocks with marmalade, gallons of hot, strong tea ...</p><p>An hour later, he found Hadrian’s Wall. Hard to miss, even grown over with grass and all-sorts like it was. It marched stolidly along, just like the Roman legions who’d built it, stubbornly workmanlike, a grey seam stitching its way up hill and down dale, dividing the peaceful fields to the south from those marauding buggers up north. He grinned at the thought and sat down on the wall—it was less than a yard high, just here—to massage his knee.</p> <p>He hadn’t found the plane, or anything else, and was beginning to doubt his own sense of reality. He’d seen a fox, any number of rabbits, and a pheasant that’d nearly given him heart failure by bursting out from right under his feet. No people at all, though, and that was giving him a queer feeling in his water.</p><p>Aye, there was a war on, right enough, and many of the menfolk were gone, but the farmhouses hadn’t been sacrificed to the war effort, had they? The women were running the farms, feeding the nation, all that—he’d heard the PM on the radio praising them for it only last week. So where the bloody hell was everybody?</p><p>The sun was getting low in the sky when at last he saw a house. It was flush against the wall, and struck him as somehow familiar, though he knew he’d never seen it before. Stone-built and squat, but quite large, with a ratty-looking thatch. There was smoke coming from the chimney, though, and he limped toward it as fast as he could go.</p><p>There was a person outside—a woman in a ratty long dress and an apron, feeding chickens. He shouted, and she looked up, her mouth falling open at the sight of him.</p><p>‘Hey,’ he said, breathless from hurry. ‘I’ve had a crash. I need help. Are ye on the phone, maybe?’</p><p>She didn’t answer. She dropped the basket of chicken feed and ran right away, round the corner of the house. He sighed in exasperation. Well, maybe she’d gone to fetch her husband. He didn’t see any sign of a vehicle, not so much as a tractor, but maybe the man was—</p> <p>The man was tall, stringy, bearded, and snaggletoothed. He was also dressed in a dirty shirt and baggy short pants that showed his hairy legs and bare feet—and accompanied by two other men in similar comic attire. Jerry instantly interpreted the looks on their faces, and didn’t stay to laugh.</p><p>‘Hey, nay problem, mate,’ he said, backing up, hands out. ‘I’m off, right?’</p><p>They kept coming, slowly, spreading out to surround him. He hadn’t liked the looks of them to start with, and was liking them less by the second. Hungry, they looked, with a speculative glitter in their eyes.</p><p>One of them said something to him, a question of some kind, but the Northumbrian accent was too thick for him to catch more than a word. ‘Who’ was the word, and he hastily pulled his dog tags from the neck of his blouson, waving the red and green disks at them. One of the men smiled, but not in a nice way.</p><p>‘Look,’ he said, still backing up. ‘I didna mean to—’</p><p>The man in the lead reached out a horny hand and took hold of Jerry’s forearm. He jerked back, but the man, instead of letting go, punched him in the belly.</p><p>He could feel his mouth opening and shutting like a fish’s, but no air came in. He flailed wildly, but they all were on him then. They were calling out to each other, and he didn’t understand a word, but the intent was plain as the nose he managed to butt with his head.</p><p>It was the only blow he landed. Within two minutes, he’d been efficiently beaten into pudding, had his pockets rifled, been stripped of his jacket and dog tags, been frog-marched down the road and heaved bodily down a steep, rocky slope.</p> <p>He rolled, bouncing from one outcrop to the next, until he managed to fling out an arm and grab on to a scrubby thornbush. He came to a scraping halt and lay with his face in a clump of heather, panting and thinking incongruously of taking Dolly to the pictures, just before he’d joined up. They’d seen The Wizard of Oz, and he was beginning to feel creepily like the lass in that film—maybe it was the resemblance of the Northumbrians to scarecrows and lions. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>‘At least the f**king lion spoke English,’ he muttered, sitting up. ‘Jesus, now what?’</p><p>It occurred to him that it might be a good time to stop cursing and start praying.</p><p>London, two years later</p><p>She’d been home from her work no more than five minutes. Just time to meet Roger’s mad charge across the floor, shrieking ‘MUMMY!,’ she pretending to be staggered by his impact—not so much a pretence; he was getting big. Just time to call out to her own mum, hear the muffled reply from the kitchen, sniff hopefully for the comforting smell of tea, and catch a tantalising whiff of tinned sardines that made her mouth water—a rare treat.</p> <p>Just time to sit down for what seemed the first time in days, and take off her high-heeled shoes, relief washing over her feet like seawater when the tide comes in. She noticed with dismay the hole in the heel of her stocking, though. Her last pair, too. She was just undoing her garter, thinking that she’d have to start using leg-tan like Maisie, drawing a careful seam up the back of each leg with an eyebrow pencil, when there came a knock at the door.</p><p>‘Mrs MacKenzie?’ The man who stood at the door of her mother’s flat was tall, a dark silhouette in the dimness of the hall, but she knew at once he was a soldier.</p><p>‘Yes?’ She couldn’t help the leap of her heart, the clench of her stomach. She tried frantically to damp it down, deny it, the hope that had sprung up like a struck match. A mistake. There’d been a mistake. He hadn’t been killed, he’d been lost somehow, maybe captured, and now they’d found hi—Then she saw the small box in the soldier’s hand and her legs gave way under her.</p><p>Her vision sparkled at the edges, and the stranger’s face swam above her, blurred with concern. She could hear, though—hear her mum rush through from the kitchen, slippers slapping in her haste, voice raised in agitation. Heard the man’s name, Captain Randall, Frank Randall. Hear Roger’s small, husky voice warm in her ear, saying ‘Mummy? Mummy?’ in confusion.</p><p>Then she was on the swaybacked davenport, holding a cup of hot water that smelt of tea—they could change the tea leaves only once a week, and this was Friday, she thought irrelevantly. He should have come on Sunday, her mum was saying, they could have given him a decent cuppa. But perhaps he didn’t work on Sundays?</p> <p>Her mum had put Captain Randall in the best chair, near the electric fire, and had switched on two bars as a sign of hospitality. Her mother was chatting with the Captain, holding Roger in her lap. Her son was more interested in the little box sitting on the tiny piecrust table; he kept reaching for it, but his grandmother wouldn’t let him have it. Marjorie recognised the intent look on his face. He wouldn’t throw a fit—he hardly ever did—but he wouldn’t give up, either.</p><p>He didn’t look a lot like his father, save when he wanted something badly. She pulled herself up a bit, shaking her head to clear the dizziness, and Roger looked up at her, distracted by her movement. For an instant, she saw Jerry look out of his eyes, and the world swam afresh. She closed her own, though, and gulped her tea, scalding as it was.</p><p>Mum and Captain Randall had been talking politely, giving her time to recover herself. Did he have children of his own? Mum asked.</p><p>‘No,’ he said, with what might have been a wistful look at wee Roger. ‘Not yet. I haven’t seen my wife in two years.’</p><p>‘Better late than never,’ said a sharp voice, and she was surprised to discover that it was hers. She put down the cup, pulled up the loose stocking that had puddled round her ankle, and fixed Captain Randall with a look. ‘What have you brought me?’ she said, trying for a tone of calm dignity. Didn’t work; she sounded brittle as broken glass, even to her own ears.</p><p>Captain Randall eyed her cautiously, but took up the little box and held it out to her.</p> <p>‘It’s Lieutenant MacKenzie’s,’ he said. ‘An MID oakleaf cluster. Awarded posthumously for—’</p><p>With an effort, she pushed herself away, back into the cushions, shaking her head.</p><p>‘I don’t want it.’</p><p>‘Really, Marjorie!’ Her mother was shocked.</p><p>‘And I don’t like that word. Pos— posth— don’t say it.’</p><p>She couldn’t overcome the notion that Jerry was somehow inside the box—a notion that seemed dreadful at one moment, comforting the next. Captain Randall set it down, very slowly, as though it might blow up.</p><p>‘I won’t say it,’ he said gently. ‘May I say, though ... I knew him. Your husband. Very briefly, but I did know him. I came myself, because I wanted to say to you how very brave he was.’</p><p>‘Brave.’ The word was like a pebble in her mouth. She wished she could spit it at him.</p> <p>‘Of course he was,’ her mother said firmly. ‘Hear that, Roger? Your dad was a good man, and he was a brave one. You won’t forget that.’</p><p>Roger was paying no attention, struggling to get down. His gran set him reluctantly on the floor and he lurched over to Captain Randall, taking a firm grip on the Captain’s freshly creased trousers with both hands—hands greasy, she saw, with sardine oil and toast crumbs. The Captain’s lips twitched, but he didn’t try to detach Roger, just patted his head.</p><p>‘Who’s a good boy, then?’ he asked.</p><p>‘Fith,’ Roger said firmly. ‘Fith!’</p><p>Marjorie felt an incongruous impulse to laugh at the Captain’s puzzled expression, though it didn’t touch the stone in her heart.</p><p>‘It’s his new word,’ she said. ‘ “Fish.” He can’t say “sardine.” ’</p><p>‘Thar ... DEEM!’ Roger said, glaring at her. ‘Fitttthhhhh!’</p><p>The Captain laughed out loud, and pulling out a handkerchief, carefully wiped the spittle off Roger’s face, casually going on to wipe the grubby little paws as well.</p><p>‘Of course it’s a fish,’ he assured Roger. ‘You’re a clever lad. And a big help to your mummy, I’m sure. Here, I’ve brought you something for your tea.’ He groped in the pocket of his coat and pulled out a small pot of jam. Strawberry jam. Marjorie’s salivary glands contracted painfully. With the sugar rationing, she hadn’t tasted jam in ...</p><p>‘He’s a great help,’ her mother put in stoutly, determined to keep the conversation on a proper plane despite her daughter’s peculiar behaviour. She avoided Marjorie’s eyes. ‘A lovely boy. His name’s Roger.’ </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>‘Yes, I know.’ He glanced at Marjorie, who’d made a brief movement. ‘Your husband told me. He was—’</p><p>‘Brave. You told me.’ Suddenly something snapped. It was her half-hooked garter, but the pop of it made her sit up straight, fists clenched in the thin fabric of her skirt. ‘Brave,’ she repeated. ‘They’re all brave, aren’t they? Every single one. Even you—or are you?’</p><p>She heard her mother’s gasp, but went on anyway, reckless.</p><p>‘You all have to be brave and noble and—and—perfect, don’t you? Because if you were weak, if there were any cracks, if anyone looked like being not quite the thing, you know—well, it might all fall apart, mightn’t it? So none of you will, will you? Or if somebody did, the rest of you would cover it up. You won’t ever not do something, no matter what it is, because you can’t not do it; all the other chaps would think the worse of you, wouldn’t they, and we can’t have that, oh, no, we can’t have that!’</p> <p>Captain Randall was looking at her intently, his eyes dark with concern. Probably thought she was a nutter—probably she was, but what did it matter?</p><p>‘Marjie, Marjie, love,’ her mother was murmuring, horribly embarrassed. ‘You oughtn’t to say such things to—’</p><p>‘You made him do it, didn’t you?’ She was on her feet now, looming over the Captain, making him look up at her. ‘He told me. He told me about you. You came and asked him to do—whatever it was that got him killed. Oh, don’t trouble yourself, he didn’t tell me your bloody precious secrets—not him, he wouldn’t do that. He was a flier.’ She was panting with rage and had to stop to draw breath. Roger, she saw dimly, had shrunk into himself and was clinging to the Captain’s leg; Randall put an arm about the boy automatically, as though to shelter him from his mother’s wrath. With an effort she made herself stop shouting, and, to her horror, felt tears begin to course down her face.</p><p>‘And now you come and bring me—and bring me ...’</p><p>‘Marjie.’ Her mother came up close beside her, her body warm and soft and comforting in her worn old pinny. She thrust a tea towel into Marjorie’s hands, then moved between her daughter and the enemy, solid as a battleship.</p> <p>‘It’s kind of you to’ve brought us this, Captain,’ Marjorie heard her saying, and felt her move away, bending to pick up the little box. Marjorie sat down blindly, pressing the tea towel to her face, hiding.</p><p>‘Here, Roger, look. See how it opens? See how pretty? It’s called—what did you say it was again, Captain? Oh, oakleaf cluster. Yes, that’s right. Can you say “medal,” Roger? Mehdul. This is your dad’s medal.’</p><p>Roger didn’t say anything. Probably scared stiff, poor little chap. She had to pull herself together. But she’d gone too far. She couldn’t stop.</p><p>‘He cried when he left me.’ She muttered the secret into the folds of the tea towel. ‘He didn’t want to go.’ Her shoulders heaved with a convulsive, unexpected sob, and she pressed the towel hard against her eyes, whispering to herself, ‘You said you’d come back, Jerry, you said you’d come back.’</p><p>She stayed hidden behind her flour-sacking fortress, while renewed offers of tea were made and, to her vague surprise, accepted. She’d thought Captain Randall would seize the chance of her retreat to make his own. But he stayed, chatting calmly with her mother, talking slowly to Roger while her mother fetched the tea, ignoring her embarrassing performance entirely, keeping up a quiet, companionable presence in the shabby room.</p><p>The rattle and bustle of the tea tray’s arrival gave her the opportunity to drop her cloth façade, and she meekly accepted a slice of toast spread with a thin scrape of margarine and a delectable spoonful of the strawberry jam.</p> <p>‘There, now,’ her mother said, looking on with approval. ‘You’ll not have eaten anything since breakfast, I daresay. Enough to give anyone the wambles.’</p><p>Marjorie shot her mother a look, but in fact it was true; she hadn’t had any luncheon because Maisie was off with ‘female trouble’—a condition that afflicted her roughly every other week—and she’d had to mind the shop all day.</p><p>Conversation flowed comfortably around her, a soothing stream past an immoveable rock. Even Roger relaxed with the introduction of jam. He’d never tasted any before, and sniffed it curiously, took a cautious lick—and then took an enormous bite that left a red smear on his nose, his moss-green eyes round with wonder and delight. The little box, now open, sat on the piecrust table, but no one spoke of it or looked in that direction.</p><p>After a decent interval, Captain Randall got up to go, giving Roger a shiny sixpence in parting. Feeling it the least she could do, Marjorie got up to see him out. Her stockings spiralled down her legs, and she kicked them off with contempt, walking bare-legged to the door. She heard her mother sigh behind her.</p><p>‘Thank you,’ she said, opening the door for him. ‘I ... appreciate—’</p><p>To her surprise, he stopped her, putting a hand on her arm.</p><p>‘I’ve no particular right to say this to you—but I will,’ he said, low-voiced. ‘You’re right; they’re not all brave. Most of them—of us—we’re just ... there, and we do our best. Most of the time,’ he added, and the corner of his mouth lifted slightly, though she couldn’t tell whether it was in humour or bitterness.</p><p>‘But your husband—’ He closed his eyes for a moment and said, ‘The bravest are surely those who have the clearest vision of what is before them, glory and danger alike, and yet notwithstanding, go out to meet it.’ He did that, every day, for a long time.’</p> <p>‘You sent him, though,’ she said, her voice as low as his. ‘You did.’</p><p>His smile was bleak.</p><p>‘I’ve done such things every day ... for a long time.’</p><p>The door closed quietly behind him, and she stood there swaying, eyes closed, feeling the draft come under it, chilling her bare feet. It was well into the autumn now, and the dark was smudging the windows, though it was just past teatime.</p><p>I’ve done what I do every day for a long time, too, she thought. But they don’t call it brave when you don’t have a choice.</p><p>Her mother was moving through the flat, muttering to herself as she closed the curtains. Or not so much to herself.</p><p>‘He liked her. Anyone could see that. So kind, coming himself to bring the medal and all. And how does she act? Like a cat that’s had its tail stepped on, all claws and caterwauling, that’s how. How does she ever expect a man to—’ </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>‘I don’t want a man,’ Marjorie said loudly. Her mother turned round, squat, solid, implacable.</p><p>‘You need a man, Marjorie. And little Rog needs a father.’</p><p>‘He has a father,’ she said through her teeth. ‘Captain Randall has a wife. And I don’t need anyone.’</p><p>Anyone but Jerry.</p> <p>Northumbria</p><p>He licked his lips at the smell. Hot pastry, steaming, juicy meat. There was a row of fat little pasties ranged along the sill, covered with a clean cloth in case of birds, but showing plump and rounded through it, the odd spot of gravy soaking through the napkin.</p><p>His mouth watered so fiercely that his salivary glands ached and he had to massage the underside of his jaw to ease the pain.</p><p>It was the first house he’d seen in two days. Once he’d got out of the ravine, he’d circled well away from the mile-castle and eventually struck a small cluster of cottages, where the people were no more understandable, but did give him some food. That had lasted him a little while; beyond that, he’d been surviving on what he could glean from hedges and the odd vegetable patch. He’d found another hamlet, but the folk there had driven him away.</p><p>Once he’d got enough of a grip of himself to think clearly, it became obvious that he needed to go back to the standing stones. Whatever had happened to him had happened there, and if he really was somewhere in the past—and hard as he’d tried to find some alternative explanation, none was forthcoming—then his only chance of getting back where he belonged seemed to lie there, too.</p> <p>He’d come well away from the drover’s track, though, seeking food, and as the few people he met didn’t understand him any more than he understood them, he’d had some difficulty in finding his way back to the wall. He thought he was quite close, now, though—the ragged country was beginning to seem familiar, though perhaps that was only delusion.</p><p>Everything else had faded into unimportance, though, when he smelt food.</p><p>He circled the house at a cautious distance, checking for dogs. No dog. Aye, fine, then. He chose an approach from the side, out of view of any of the few windows. Darted swiftly from bush to ploughshare to midden to house, and plastered himself against the grey stone wall, breathing hard—and breathing in that delicious, savoury aroma. Shite, he was drooling. He wiped his sleeve hastily across his mouth, slithered round the corner, and reached out a hand.</p><p>As it happened, the farmstead did boast a dog, which had been attending its absent master in the barn. Both these worthies returning unexpectedly at this point, the dog at once spotted what it assumed to be jiggery-pokery taking place, and gave tongue in an altogether proper manner. Alerted in turn to felonious activity on his premises, the householder instantly joined the affray, armed with a wooden spade, with which he batted Jerry over the head.</p><p>As he staggered back against the wall of the house, he had just wit enough left to notice that the farmwife—now sticking out of her window and shrieking like the Glasgow Express—had knocked one of the pasties to the ground, where it was being devoured by the dog, who wore an expression of piety and rewarded virtue that Jerry found really offensive.</p><p>Then the farmer hit him again, and he stopped being offended.</p> <p>It was a well-built byre, the stones fitted carefully and mortared. He wore himself out with shouting and kicking at the door until his gammy leg gave way and he collapsed onto the earthen floor.</p><p>‘Now bloody what?’ he muttered. He was damp with sweat from his effort, but it was cold in the byre, with that penetrating damp cold peculiar to the British Isles, that seeps into your bones and makes the joints ache. His knee would give him fits in the morning. The air was saturated with the scent of manure and chilled urine. ‘Why would the bloody Jerries want the damn place?’ he said, and, sitting up, huddled into his shirt. It was going to be a frigging long night.</p><p>He got up onto his hands and knees and felt carefully round inside the byre, but there was nothing even faintly edible—only a scurf of mouldy hay. Not even the rats would have that; the inside of the place was empty as a drum and silent as a church.</p><p>What had happened to the cows? he wondered. Dead of a plague, eaten, sold? Or maybe just not yet back from the summer pastures—though it was late in the year for that, surely.</p><p>He sat down again, back against the door, as the wood was marginally less cold than the stone walls. He’d thought about being captured in battle, made prisoner by the Germans—they all had, now and then, though chaps mostly didn’t talk about it. He thought about POW camps, and those camps in Poland, the ones he’d been meant to photograph. Were they as bleak as this? Stupid thing to think of, really.</p><p>But he’d got to pass the time ’til morning one way or another, and there were lots of things he’d rather not think about just now. Like what would happen once morning came. He didn’t think breakfast in bed was going to be part of it.</p><p>The wind was rising. Whining past the corners of the cow byre with a keening noise that set his teeth on edge. He still had his silk scarf; it had slipped down inside his shirt when the bandits in the mile-castle had attacked him. He fished it out now and wrapped it round his neck, for comfort, if not warmth.</p><p>He’d brought Dolly breakfast in bed now and then. She woke up slow and sleepy, and he loved the way she scooped her tangled curly black hair off her face, peering out slit-eyed, like a small, sweet mole blinking in the light. He’d sit her up and put the tray on the table beside her, and then he’d shuck his own clothes and crawl in bed, too, cuddling close to her soft, warm skin. Sometimes sliding down in the bed, and her pretending not to notice, sipping tea or putting marmite on her toast while he burrowed under the covers and found his way up through the cottony layers of sheets and nightie. He loved the smell of her, always, but especially when he’d made love to her the night before, and she bore the strong, musky scent of him between her legs.</p> <p>He shifted a little, roused by the memory, but the subsequent thought—that he might never see her again—quelled him at once.</p><p>Still thinking of Dolly, though, he put his hand automatically to his pocket, and was alarmed to find no lump there. He slapped at his thigh, but failed to find the small, hard bulge of the sapphire. Could he have put it in the other pocket by mistake? He delved urgently, shoving both hands deep into his pockets. No stone—but there was something in his right-hand pocket. Something powdery, almost greasy ... what the devil?</p><p>He brought his fingers out, peering as closely at them as he could, but it was too dark to see more than a vague outline of his hand, let alone anything on it. He rubbed his fingers gingerly together; it felt something like the thick soot that builds up inside a chimney. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>‘Jesus,’ he whispered, and put his fingers to his nose. There was a distinct smell of combustion. Not petrolish at all, but a scent of burning so intense he could taste it on the back of his tongue. Like something out of a volcano. What in the name of God Almighty could burn a rock and leave the man who carried it alive?</p><p>The sort of thing he’d met among the standing stones, that was what.</p><p>He’d been doing all right with the not feeling too afraid until now, but ... he swallowed hard, and sat down again, quietly.</p><p>‘Now I lay me down to sleep,’ he whispered to the knees of his trousers. ‘I pray the Lord my soul to keep ...’</p> <p>He did in fact sleep eventually, in spite of the cold, from simple exhaustion. He was dreaming about wee Roger, who for some reason was a grown man now, but still holding his tiny blue bear, minuscule in a broad-palmed grasp. His son was speaking to him in Gaelic, saying something urgent that he couldn’t understand, and he was growing frustrated, telling Roger over and over for Christ’s sake to speak English, couldn’t he?</p><p>Then he heard another voice through the fog of sleep and realised that someone was in fact talking somewhere close by.</p><p>He jerked awake, struggling to grasp what was being said and failing utterly. It took him several seconds to realise that whoever was speaking—there seemed to be two voices, hissing and muttering in argument—really was speaking in Gaelic.</p><p>He had only a smattering of it himself; his mother had had it, but—he was moving before he could complete the thought, panicked at the notion that potential assistance might get away.</p><p>‘Hoy!’ he bellowed, scrambling—or trying to scramble—to his feet. His much-abused knee wasn’t having any, though, and gave way the instant he put weight on it, catapulting him face-first toward the door.</p> <p>He twisted as he fell and hit it with his shoulder. The booming thud put paid to the argument; the voices fell silent at once.</p><p>‘Help! Help me!’ he shouted, pounding on the door. ‘Help!’</p><p>‘Will ye for God’s sake hush your noise?’ said a low, annoyed voice on the other side of the door. ‘Ye want to have them all down on us? Here, then, bring the light closer.’</p><p>This last seemed to be addressed to the voice’s companion, for a faint glow shone through the gap at the bottom of the door. There was a scraping noise as the bolt was drawn, and a faint grunt of effort, then a thunk! as the bolt was set down against the wall. The door swung open, and Jerry blinked in a sudden shaft of light as the slide of a lantern grated open.</p><p>He turned his head aside and closed his eyes for an instant, deliberate, as he would if flying at night and momentarily blinded by a flare or by the glow of his own exhaust. When he opened them again, the two men were in the cow byre with him, looking him over with open curiosity.</p><p>Biggish buggers, both of them, taller and broader than he was. One fair, one black-haired as Lucifer. They didn’t look much alike, and yet he had the feeling that they might be related—some fleeting glimpse of bone, a similarity of expression, maybe.</p> <p>‘What’s your name, mate?’ said the dark chap, softly. Jerry felt the nip of wariness at his nape, even as he felt a thrill in the pit of his stomach. It was regular speech, perfectly understandable. A Scots accent, but—</p><p>‘MacKenzie, J. W.,’ he said, straightening up to attention. ‘Lieutenant, Royal Air Force. Service number—’</p><p>An indescribable expression flitted across the dark bloke’s face. An urge to laugh, of all bloody things, and a flare of excitement in his eyes—really striking eyes, a vivid green that flashed suddenly in the light. None of that mattered to Jerry; what was important was that the man plainly knew. He knew.</p><p>‘Who are you?’ he asked, urgent. ‘Where d’ye come from?’</p><p>The two exchanged an unfathomable glance, and the other answered.</p><p>‘Inverness.’</p><p>‘Ye know what I mean!’ He took a deep breath. ‘When?’</p><p>The two strangers were much of an age, but the fair one had plainly had a harder life; his face was deeply weathered and lined.</p> <p>‘A lang way from you,’ he said quietly, and, despite his own agitation, Jerry heard the note of desolation in his voice. ‘From now. Lost.’</p><p>Lost. Oh, God. But still—</p><p>‘Jesus. And where are we now? Wh-when?’</p><p>‘Northumbria,’ the dark man answered briefly, ‘and I don’t bloody know for sure. Look, there’s no time. If anyone hears us—’</p><p>‘Aye, right. Let’s go, then.’</p><p>The air outside was wonderful after the smells of the cow byre, cold and full of dying heather and turned earth. He thought he could even smell the moon, a faint green sickle above the horizon; he tasted cheese at the thought, and his mouth watered. He wiped a trickle of saliva away and hurried after his rescuers, hobbling as fast as he could.</p><p>The farmhouse was black, a squatty black blot on the landscape. The dark bloke grabbed him by the arm as he was about to go past it, quickly licked a finger, and held it up to test the wind.</p><p>‘The dogs,’ he explained in a whisper. ‘This way.’</p><p>They circled the farmhouse at a cautious distance, and found themselves stumbling through a ploughed field. Clods burst under Jerry’s boots as he hurried to keep up, lurching on his bad knee with every step.</p><p>‘Where we going?’ he panted, when he thought it safe to speak.</p><p>‘We’re taking ye back to the stones near the lake,’ the dark man said tersely. ‘That has to be where ye came through.’ The fair one just snorted, as though this wasn’t his notion—but he didn’t argue.</p><p>Hope flared up in Jerry like a bonfire. They knew what the stones were, how it worked. They’d show him how to get back!</p><p>‘How—how did ye find me?’ He could hardly breathe, such a pace they kept up, but he had to know. The lantern was shut and he couldn’t see their faces, but the dark man made a muffled sound that might have been a laugh.</p><p>‘I met an auld wifie wearing your dog tags. Very proud of them, she was.’</p><p>‘Ye’ve got them?’ Jerry gasped.</p><p>‘Nay, she wouldna give them up.’ It was the fair man, sounding definitely amused. ‘Told us where she’d got them, though, and we followed your trail backward. Hey!’ He caught Jerry’s elbow, just as his foot twisted out from under him. The sound of a barking dog broke the night—some way away, but distinct. The fair man’s hand clenched tight on his arm. ‘Come on, then—hurry!’ </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jerry had a bad stitch in his side, and his knee was all but useless by the time the little group of stones came in sight, a pale huddle in the light of the waning moon. Still, he was surprised at how near the stones were to the farmhouse; he must have circled round more than he thought in his wanderings.</p><p>‘Right,’ said the dark man, coming to an abrupt halt. ‘This is where we leave you.’</p><p>‘Ye do?’ Jerry panted. ‘But—but you—’</p><p>‘When ye came ... through. Did ye have anything on you? A gemstone, any jewellery?’</p> <p>‘Aye,’ Jerry said, bewildered. ‘I had a raw sapphire in my pocket. But it’s gone. It’s like it—’</p><p>‘Like it burnt up,’ the blond man finished for him, grim-voiced. ‘Aye. Well, so?’ This last was clearly addressed to the dark man, who hesitated. Jerry couldn’t see his face, but his whole body spoke of indecision. He wasn’t one to dither, though—he stuck a hand into the leather pouch at his waist, pulled something out, and pressed it into Jerry’s hand. It was faintly warm from the man’s body, and hard in his palm. A small stone of some kind. Faceted, like the stone in a ring.</p><p>‘Take this; it’s a good one. When ye go through,’ the dark man was speaking urgently to him, ‘think about your wife, about Marjorie. Think hard; see her in your mind’s eye, and walk straight through. Whatever the hell ye do, though, don’t think about your son. Just your wife.’</p><p>‘What?’ Jerry was gob-smacked. ‘How the bloody hell do you know my wife’s name? And where’ve ye heard about my son?’</p><p>‘It doesn’t matter,’ the man said, and Jerry saw the motion as he turned his head to look back over his shoulder.</p> <p>‘Damn,’ said the fair one, softly. ‘They’re coming. There’s a light.’</p><p>There was: a single light, bobbing evenly over the ground, as it would if someone carried it. But look as he might, Jerry could see no one behind it, and a violent shiver ran over him.</p><p>‘Tannasg,’ said the other man under his breath. Jerry knew that word well enough—spirit, it meant. And usually an ill-disposed one. A haunt.</p><p>‘Aye, maybe.’ The dark man’s voice was calm. ‘And maybe not. It’s near Samhain, after all. Either way, ye need to go, man, and now. Remember, think of your wife.’</p><p>Jerry swallowed, his hand closing tight around the stone.</p><p>‘Aye. Aye ... right. Thanks, then,’ he added awkwardly, and heard the breath of a rueful laugh from the dark man.</p> <p>‘Nay bother, mate,’ he said. And with that, they were both off, making their way across the stubbled meadow, two lumbering shapes in the moonlight.</p><p>Heart thumping in his ears, Jerry turned toward the stones. They looked just like they’d looked before. Just stones. But the echo of what he’d heard in there ... He swallowed. It wasn’t like there was much choice.</p><p>‘Dolly,’ he whispered, trying to summon up a vision of his wife. ‘Dolly. Dolly, help me!’</p><p>He took a hesitant step towards the stones. Another. One more. Then nearly bit his tongue off as a hand clamped down on his shoulder. He whirled, fist up, but the dark man’s other hand seized his wrist.</p><p>‘I love you,’ the dark man said, his voice fierce. Then he was gone again, with the shoof-shoof sounds of boots in dry grass, leaving Jerry with his mouth agape.</p><p>He caught the other man’s voice from the darkness, irritated, half-amused. He spoke differently from the dark man, a much thicker accent, but Jerry understood him without difficulty.</p><p>‘Why did ye tell him a daft thing like that?’</p><p>And the dark one’s reply, soft-spoken, in a tone that terrified him more than anything had so far.</p> <p>‘Because he isn’t going to make it back. It’s the only chance I’ll ever have. Come on.’</p><p>The day was dawning when he came to himself again, and the world was quiet. No birds sang, and the air was cold with the chill of November and winter coming on. When he could stand up, he went to look, shaky as a newborn lamb.</p><p>The plane wasn’t there, but there was still a deep gouge in the earth where it had been. Not raw earth, though; furred over with grass and meadow plants—not just furred, he saw, limping over to have a closer look. Matted. Dead stalks from earlier years’ growth.</p><p>If he’d been where he thought he’d been, if he’d truly gone ... back ... then he’d come forward again, but not to the same place he’d left. How long? A year, two? He sat down on the grass, too drained to stand up any longer. He felt as though he’d walked every second of the time between then and now.</p><p>He’d done what the green-eyed stranger had said. Concentrated fiercely on Dolly. But he hadn’t been able to keep from thinking of wee Roger, not altogether. How could he? The picture he had most vividly of Dolly was her holding the lad, close against her breast; that’s what he’d seen. And yet he’d made it. He thought he’d made it. Maybe.</p><p>What might have happened? he wondered. There hadn’t been time to ask. There’d been no time to hesitate, either; more lights had come bobbing across the dark, with uncouth Northumbrian shouts behind them, hunting him, and he’d hurled himself into the midst of the standing stones and things went pear-shaped again, even worse. He hoped the strangers who’d rescued him had got away.</p><p>Lost, the fair man had said, and even now, the word went through him like a bit of jagged metal. He swallowed.</p><p>He thought he wasn’t where he had been, but was he still lost, himself? Where was he now? Or rather, when?</p><p>He stayed for a bit, gathering his strength. In a few minutes, though, he heard a familiar sound—the low growl of engines, and the swish of tyres on asphalt. He swallowed hard, and, standing up, turned away from the stones, toward the road.</p><p>He was lucky—for once, he thought wryly. There was a line of troop transports passing, and he swung aboard one without difficulty. The soldiers looked startled at his appearance—he was rumpled and stained, bruised and torn about and with a two-week beard—but they instantly assumed he’d been off on a tear and was now trying to sneak back to his base without being detected. They laughed and nudged him knowingly, but were sympathetic, and when he confessed he was skint, they had a quick whip-round for enough cash to buy a train ticket from Salisbury, where the transport was headed.</p><p>He did his best to smile and go along with the ragging, but soon enough they tired of him and turned to their own conversations, and he was allowed to sit, swaying on the bench, feeling the thrum of the engine through his legs, surrounded by the comfortable presence of comrades. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>‘Hey, mate,’ he said casually to the young soldier beside him. ‘What year is it?’</p><p>The boy—he couldn’t be more than seventeen, and Jerry felt the weight of the five years between them as though they were fifty—looked at him wide-eyed, then whooped with laughter.</p><p>‘What’ve you been having to drink, Dad? Bring any away with you?’</p><p>That led to more ragging, and he didn’t try asking again.</p> <p>Did it matter?</p><p>He remembered almost nothing of the journey from Salisbury to London. People looked at him oddly, but no one tried to stop him. It didn’t matter; nothing mattered but getting to Dolly. Everything else could wait.</p><p>London was a shock. There was bomb damage everywhere. Streets were scattered with shattered glass from shop windows, glinting in the pale sun, other streets blocked off by barriers. Here and there a stark black notice: Do Not Enter—UNEXPLODED BOMB.</p><p>He made his way from Saint Pancras on foot, needing to see, his heart rising into his throat fit to choke him as he did see what had been done. After a while, he stopped seeing the details, perceiving bomb craters and debris only as blocks to his progress, things stopping him from reaching home.</p><p>And then he did reach home.</p> <p>The rubble had been pushed off the street into a heap, but not taken away. Great blackened lumps of shattered stone and concrete lay like a cairn where Montrose Terrace had once stood.</p><p>All the blood in his heart stopped dead, congealed by the sight. He groped, pawing mindlessly for the wrought-iron railing to keep himself from falling, but it wasn’t there.</p><p>Of course not, his mind said, quite calmly. It’s gone for the war, hasn’t it? Melted down, made into planes. Bombs.</p><p>His knee gave way without warning, and he fell, landing hard on both knees, not feeling the impact, the crunch of pain from his badly mended kneecap quite drowned out by the blunt, small voice inside his head.</p><p>Too late. Ye went too far.</p><p>‘Mr MacKenzie, Mr MacKenzie!’ He blinked at the blurred thing above him, not understanding what it was. Something tugged at him, though, and he breathed, the rush of air in his chest ragged and strange.</p> <p>‘Sit up, Mr MacKenzie, do.’ The anxious voice was still there, and hands—yes, it was hands—tugging at his arm. He shook his head, screwed his eyes shut hard, then opened them again, and the round thing became the houndlike face of old Mr Wardlaw, who kept the corner shop.</p><p>‘Ah, there you are.’ The old man’s voice was relieved, and the wrinkles in his baggy old face relaxed their anxious lines. ‘Had a bad turn, did you?’</p><p>‘I—’ Speech was beyond him, but he flapped his hand at the wreckage. He didn’t think he was crying, but his face was wet. The wrinkles in Wardlaw’s face creased deeper in concern, then the old grocer realised what he meant, and his face lit up.</p><p>‘Oh, dear!’ he said. ‘Oh, no! No, no, no—they’re all right, sir, your family’s all right! Did you hear me?’ he asked anxiously. ‘Can you breathe? Had I best fetch you some salts, do you think?’</p><p>It took Jerry several tries to make it to his feet, hampered both by his knee and by Mr Wardlaw’s fumbling attempts to help him, but by the time he’d got all the way up, he’d regained the power of speech.</p><p>‘Where?’ he gasped. ‘Where are they?’</p><p>‘Why—your missus took the little boy and went to stay with her mother, sometime after you left. I don’t recall quite where she said ...’ Mr Wardlaw turned, gesturing vaguely in the direction of the river. ‘Camberwell, was it?’</p><p>‘Bethnal Green.’ Jerry’s mind had come back, though it felt still as though it was a pebble rolling round the rim of some bottomless abyss, its balance uncertain. He tried to dust himself off, but his hands were shaking. ‘She lives in Bethnal Green. You’re sure—you’re sure, man?’</p> <p>‘Yes, yes.’ The grocer was altogether relieved, smiling and nodding so hard that his jowls trembled. ‘She left—must be more than a year ago, soon after she—soon after she ...’ The old man’s smile faded abruptly and his mouth slowly opened, a flabby dark hole of horror.</p><p>‘But you’re dead, Mr MacKenzie,’ he whispered, backing away, hands held up before him. ‘Oh, God. You’re dead.’</p><p>‘The f**k I am, the f**k I am, the f**k I am!’ He caught sight of a woman’s startled face and stopped abruptly, gulping air like a landed fish. He’d been weaving down the shattered street, fists pumping, limping and staggering, muttering his private motto under his breath like the Hail Marys of a rosary. Maybe not as far under his breath as he’d thought.</p><p>He stopped, leaning against the marble front of the Bank of England, panting. He was streaming with sweat and the right leg of his trousers was heavily streaked with dried blood from the fall. His knee was throbbing in time with his heart, his face, his hands, his thoughts. They’re alive. So am I.</p><p>The woman he’d startled was down the street, talking to a policeman; she turned, pointing at him. He straightened up at once, squaring his shoulders. Braced his knee and gritted his teeth, forcing it to bear his weight as he strode down the street, officerlike. The very last thing he wanted just now was to be taken up as drunk.</p><p>He marched past the policeman, nodding politely, touching his forehead in lieu of cap. The policeman looked taken aback, made to speak but couldn’t quite decide what to say, and a moment later, Jerry was round the corner and away.</p><p>It was getting dark. There weren’t many cabs in this area at the best of times—none at all, now, and he hadn’t any money, anyway. The Tube. If the lines were open, it was the fastest way to Bethnal Green. And surely he could cadge the fare from someone. Somehow. He went back to limping, grimly determined. He had to reach Bethnal Green by dark.</p><p>It was so much changed. Like the rest of London. Houses damaged, halfway repaired, abandoned, others no more than a blackened depression or a heap of rubble. The air was thick with cold dust, stone dust, and the smells of paraffin and cooking grease, the brutal, acrid smell of cordite.</p><p>Half the streets had no signs, and he wasn’t so familiar with Bethnal Green to begin with. He’d visited Dolly’s mother just twice, once when they went to tell her they’d run off and got married—she hadn’t been best pleased, Mrs Wakefield, but she’d put a good face on it, even if the face had a lemon-sucking look to it.</p><p>The second time had been when he signed up with the RAF; he’d gone alone to tell her, to ask her to look after Dolly while he was gone. Dolly’s mother had gone white. She knew as well as he did what the life expectancy was for fliers. But she’d told him she was proud of him, and held his hand tight for a long moment before she let him leave, saying only, ‘Come back, Jeremiah. She needs you.’ </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He soldiered on, skirting craters in the street, asking his way. It was nearly full dark, now; he couldn’t be on the streets much longer. His anxiety began to ease a little as he started to see things he knew, though. Close, he was getting close.</p><p>And then the sirens began, and people began to pour out of the houses.</p><p>He was being buffeted by the crowd, borne down the street as much by their barely controlled panic as by their physical impact. There was shouting, people calling for separated family members, wardens bellowing directions, waving their torches, their flat, white helmets pale as mushrooms in the gloom. Above it, through it, the air-raid siren pierced him like a sharpened wire, thrust him down the street on its spike, ramming him into others likewise skewered by fright.</p><p>The tide of it swept round the next corner, and he saw the red circle with its blue line over the entrance to the Tube station, lit up by a warden’s flashlight. He was sucked in, propelled through sudden bright lights, hurtling down the stair, the next, onto a platform, deep into the earth, into safety. And all the time the whoop and moan of the sirens still filling the air, barely muffled by the dirt above.</p> <p>There were wardens moving among the crowd, pushing people back against the walls, into the tunnels, away from the edge of the track. He brushed up against a woman with two toddlers, picked one—a little girl with round eyes and a blue teddy bear—out of her arms and turned his shoulder into the crowd, making a way for them. He found a small space in a tunnel-mouth, pushed the woman into it, and gave her back the little girl. Her mouth moved in thanks, but he couldn’t hear her above the noise of the crowd, the sirens, the creaking, the—</p><p>A sudden monstrous thud from above shook the station, and the whole crowd was struck silent, every eye on the high arched ceiling above them.</p><p>The tiles were white, and as they looked, a dark crack appeared suddenly between two rows of them. A gasp rose from the crowd, louder than the sirens. The crack seemed to stop, to hesitate—and then it zigzagged suddenly, parting the tiles, in different directions.</p><p>He looked down from the growing crack, to see who was below it—the people still on the stair. The crowd at the bottom was too thick to move, everyone stopped still by horror. And then he saw her, partway up the stair.</p><p>Dolly. She’s cut her hair, he thought. It was short and curly, black as soot—black as the hair of the little boy she held in her arms, close against her, sheltering him. Her face was set, jaw clenched. And then she turned a bit, and saw him.</p> <p>Her face went blank for an instant and then flared like a lit match, with a radiant joy that struck him in the heart and flamed through his being.</p><p>There was a much louder thud! from above, and a scream of terror rose from the crowd, louder, much louder than the sirens. Despite the shrieking, he could hear the fine rattle, like rain, as dirt began to pour from the crack above. He shoved with all his might, but couldn’t get past, couldn’t reach them. Dolly looked up, and he saw her jaw set hard again, her eyes ablaze with determination. She shoved the man in front of her, who stumbled and fell down a step, squashing into the people in front of him. She swung Roger down into the little space she’d made, and with a twist of her shoulders and the heave of her whole body, hurled the little boy up, over the rail—toward Jerry.</p><p>He saw what she was doing and was already leaning, pushing forward, straining to reach ... The boy struck him high in the chest like a lump of concrete, little head smashing painfully into Jerry’s face, knocking his head back. He had one arm round the child, falling back on the people behind him, struggling to find his footing, get a firmer hold—and then something gave way in the crowd around him, he staggered into an open space, and then his knee gave way and he plunged over the lip of the track.</p><p>He didn’t hear the crack of his head against the rail or the screams of the people above; it was all lost in a roar like the end of the world as the roof over the stair fell in.</p><p>The little boy was still as death, but he wasn’t dead; Jerry could feel his heartbeat, thumping fast against his own chest. It was all he could feel. Poor little bugger must have had his wind knocked out.</p><p>People had stopped screaming, but there was still shouting, calling out. There was a strange silence underneath all the racket. His blood had stopped pounding through his head, his own heart no longer hammering. Perhaps that was it.</p> <p>The silence underneath felt alive, somehow. Peaceful, but like sunlight on water, moving, glittering. He could still hear the noises above the silence, feet running, anxious voices, bangs and creakings—but he was sinking gently into the silence; the noises grew distant, though he could still hear voices.</p><p>‘Is that one—?’</p><p>‘Nay, he’s gone—look at his head, poor chap, caved in something horrid. The boy’s well enough, I think, just bumps and scratches. Here, lad, come up ... no, no, let go, now. It’s all right, just let go. Let me pick you up, yes, that’s good, it’s all right now, hush, hush, there’s a good boy ...’</p><p>‘What a look on that bloke’s face. I never saw anything like—’</p><p>‘Here, take the little chap. I’ll see if the bloke’s got any identification.’</p><p>‘Come on, big man, yeah, that’s it, that’s it, come with me. Hush, now, it’s all right, it’s all right ... is that your daddy, then?’</p><p>‘No tags, no service book. Funny, that. He’s RAF, though, isn’t he? AWOL, d’ye think?’</p><p>He could hear Dolly laughing at that, felt her hand stroke his hair. He smiled and turned his head to see her smiling back, the radiant joy spreading round her like rings in shining water ...</p> <p>‘Rafe! The rest of it’s going! Run! Run!</p><p>To the RAF flyers: “Never have so many owed so much to so few.”</p>  </body></html>"]