["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>MONSTER LOVE</p><p>(c) MaryJanice Davidson, 2002</p><p>Prologue</p><p>From the private papers of Richard Will, Ten Beacon Hill, Boston, Massachusetts.</p> <p>\"Becoming a vampire was the best thing that ever happened to me. The very, very best. Which is why I don't understand all the literature, how the vampires are usually these moody fellows who rue the day they ever got bitten, who pray for some illiterate European to plant a stake through their ribs. Rue the day? If the mob hadn't torched my killer the next night, I'd have kissed his feet. I'd even have kissed his behind!</p><p>\"After all, what else was there for me? Take over the farm when my father died?</p><p>No, thank you. Farming is back-breaking work for very little reward, and even less respect. And I could hardly endure being in the same room with my father, much less work for him the rest of my life. (Punch first and punch second, that was my dear departed papa's motto.)</p><p>\"Lie about my age to join the army, and get my head blown off? (All so sixty years later we can ignore the Holocaust and pretend the Germans are good guys?) But back then, if you didn't fight you were a coward. Of course, two wars later the young men were encouraged to go to Canada, to avoid responsibilities to their country. If they fought, and lived, their reward was to be spit upon at the airport. It just goes to prove, nothing changes faster than the mind of an American.</p><p>\"No, life wasn't exactly a bowl of fresh peaches. I was in a box, and each side of the box was equally insurmountable. I wasn't the only one, but I was the only one who noticed the shape and size of the prison. I was always different from my chums. At least, I think I was...it was a long time ago, and don't we always think we're different?</p> <p>\"So when Darak-that was his name, or at least the name he gave me-bought me a drink, then two, then ten, I didn't turn him down. What did I care if a stranger wanted to help me forget about the box? I was big-twenty-three years working on a farm made for a big boy-and if he wanted to get inappropriate, I was sure I could handle it.</p><p>\"Yes, there was homosexuality in the forties. People like to pretend it's a modern invention, which always makes me laugh. Anyway, I figured Darak wanted to see what I had inside my drawers, but I had no intention of showing him-what men did with other men was none of my concern. Of course, my drawers weren't what held his interest at all.</p><p>\"I'd been supremely confident I could toss Darak through a window if I needed to, which just goes to show I was something of a na?ve moron when I was a boy. Darak took what he needed from me, and never mind pretty words or even asking permission.</p><p>He stopped my heart and left me on a filthy floor to breathe my last. The last thing I remember was a rat scampering across my face, how the tail felt, dragging across my mouth.</p><p>\"I woke up two nights later. It was dark and close, but in a stroke of luck I hadn't been buried yet. I didn't know it then, but the town's only mill had blown up, and there were forty bodies to be interred. Plus they'd cornered Darak and set him on fire. Yes, things had been positively hopping in the small town of Millidgeville, pop. 232 (actually 191 now). They were in no rush to get me in the ground. They had more important things to worry about.</p><p>\"I was thirstier than I had ever been in my life. And strong...I meant only to pop open the door to the coffin, and ended up ripping it off the hinges. I lurched out of the coffin and realized instantly where I was. And I knew what Darak was...I'd read Bram Stoker as a teenager. But even through the mad haze of my unnatural-or so it seemed to me then-thirst and the disbelief of my death, the main thing I remember is the relief. I was dead. I was free. I silently blessed Darak, and went to find someone to eat.</p> <p>\"Being a vampire is wonderful. The strength, the speed, the liquid diet...all solidly in the plus column. The minuses-no sunbathing (so?), sensitivity to light (sunglasses fixed that nicely), no real relationships other than those of a transitory nature (callgirls!)-are bearable.</p><p>\"I miss women, though. That's probably the worst of it. No more sunsets? Phaugh. I saw plenty of them on the farm. But I haven't had a girlfriend since...er...what year is it? Never mind.</p><p>\"I can't be with a mortal woman, for obvious reasons. She'd never understand what I was, what I needed. I'd constantly fear hurting her-I can lift a car over my head, so being with a mortal woman is not unlike being with a china doll. And being dead hasn't affected my sex drive one bit. I was a young man of lusty appetite, and while I still look young, my appetite has increased exponentially with my age.</p><p>\"I've only met six other vampires in my life. Of the six, four were women, and let me tell you, they were complete and unrepentant monsters. They ate children. Children!</p><p>I killed two, but the other two got away. I could have gone after them, but I had to get the child to a hospital and-well, I wouldn't have wished their company on my fiercest enemy, much less welcomed them to the marriage bed.</p><p>\"Yes, I'm lonely. Another price to pay for the eternal life and the liquid diet. But I'm young for a vampire-not even close to a hundred yet. Things are bound to look up.</p><p>And even if they don't, my patience-like my thirst-is infinite.\"</p><p>Chapter One</p> <p>A monkey. A fucking monkey!</p><p>Janet Lupo practically threw her invitation at the goon guarding the doors to the reception hall. Bad enough that one of the most eligible werewolves in the packthe world!-was now off the market, but he'd taken a pure human to mate. Not that there was anything wrong with that. Humans were okay. If you liked sloths.</p><p>She stomped toward her table, noticing with bitter satisfaction the way people jumped out of her path. Pack members walked clear when she was in a good mood.</p><p>Which, at the moment, she was not.</p><p>Bad enough to be outnumbered a thousand to one by the humans, but to marry one? And fuck one and get it pregnant and join the PTA and...</p><p>The mind reeled.</p><p>Janet had nothing against humans as a species. In fact, she greatly admired their rapaciousness. Homo sapiens never passed up prey, not even if they were stuffed-not even if they didn't eat meat! They'd kill each other over shoes, for God's sake. They had fought wars over shiny metals and rocks. Janet had never understood why a diamond was worth killing over, but a pink topaz was hardly worth sweating about. Humans had fought wars over the possession of gold, but iron ferrite, which looked exactly the same, was worthless.</p><p>And when humans started killing, watch out. Whether it was \"Free the Holy Land from the infidels!\" or \"Cotton and Slave's Rights!\" or \"Down with Capitalism!\" or whatever was worth mass genocide, when humans went to war, your only chance was to get out of the way and keep your head down.</p><p>But marry one? Marry someone slower and weaker? Much, much weaker?</p><p>Someone with no pack instincts, someone who only lived for themself? It'd be-it'd be like a human marrying a bear. A small, sleepy bear who hardly ever moved. Fucking creepy, is what it was.</p><p>And there was Alec, sitting at the head table and smirking like he'd won the lottery!</p><p>And his mate-uh, wife-sitting next to him. She was cute enough if you liked chubby, which the boys in the pack did. A bony wife wasn't such a great mother when food was scarce. Not that food was scarce these days, but thousands of years of genetic conditioning died hard. Besides, who wanted to squash their body down onto a bundle of sticks?</p><p>Okay, there wasn't anything wrong with her looks. Her looks were fine. So was her smell-like peaches packed in fresh snow. And the bimbo knew what she was getting into-her old lady had worked for Old Man Wyndham, way back in the day-so the whole family had experience keeping secrets. But to call a sloth a sloth, the new Mrs.</p><p>Kilcurt was not pack. Wasn't family. And would never be, no matter how many cubs Alec got on her.</p><p>Jesus! First the pack leader-Michael-knocked up a human, and now Alec Kilcurt.</p><p>Didn't any of her fellow werewolves marry werewolves anymore?</p><p>\"Dance, Jane?\"</p><p>\"I'd rather eat my own eyeballs,\" she said moodily, not even looking to see who asked. Why was she going to her table, anyway? The reception wasn't mandatory.</p><p>Neither was the wedding. She'd just gone to be polite. And the time for that was done.</p><p>She turned on her heel and marched out. The goon at the door obligingly held it open. Which was just as well, 'cuz otherwise she'd have kicked it down.</p><p>Janet vastly preferred Boston in the spring, and as cities went, Boston was not awful. Parts of it-the harbor, the aquarium-were actually kind of cool.</p><p>Thinking of the New England Aquarium-all those fish, lobsters, squid, and sharks-made her stomach growl. She'd been too annoyed to eat lunch, and when she had walked out of the reception, she had also walked out on her supper.</p><p>She turned onto a side street, taking a short-cut to Legal Sea Foods, a restaurant that did not suck. She'd have a big bowl of clam chowder, and some raw oysters, and a steak, and a lobster. And maybe something for dessert. And a drink. Maybe three.</p><p>A scent caught her attention, forcing a split-second decision. She turned onto another street, one much less crowded, curious to see if the men were going to keep following her.</p><p>They were. She hadn't seen their faces, just caught their scents as they swung around to follow her on Park Street. They smelled like desperation and stale coffee grounds. She was well dressed, and probably looked prosperous to them. Prime pickings.</p><p>She turned again, this time down a deserted alley. If the two would-be robbers thought they were keeping her from supper, they were out of their teeny, tiny minds.</p><p>She could easily outrun them, but that would mean kicking off her high heels. The stupid pinchy shoes cost almost thirty bucks! She wasn't leaving them in a Boston alley.</p><p>If push came to shove, she'd bounce her stalkers off the bricks. Possibly more than once, the mood she was in.</p><p>\"Halt, gentlemen.\"</p><p>Janet jumped. There was a man standing at the end of the alley, and she hadn't known he was there until he spoke up. She hadn't smelled him, even though he was upwind. When was the last time that had happened?</p><p>He was tall-over six feet-and well built, for someone who wasn't pack. His shoulders were broad and he definitely had the look of a man used to working with his hands. He had blond hair the color of wheat, and his eyes-even from fifteen feet away she could see their vivid color-were Mediterranean blue. He was wearing all blackdress slacks, a shirt open at the throat, a duster that went almost all the way to his heels. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And-what's this now? He was squinting in the poor light of the alley, and slipping on a pair of sunglasses. Sunglasses-how weird was that, at ten-thirty at night?</p><p>\"I have business with the young lady,\" Weirdo continued, walking toward them. His hands were open, relaxed. She knew he wasn't carrying a weapon. He moved with the grace of a dancer; if she hadn't been so fucking hungry she might have liked to watch him prance around. \"Much kinder business, I think, than you two. So be on your way, all right?\" Then, in a lower voice, \"Don't be afraid, miss. I won't hurt you. Hardly at all.\"</p><p>\"Stand aside, four eyes,\" she snapped, and with barely a glance, she stiff-armed him into the side of the building and hurried past. She had no time for would-be muggers, and less for Mr. Sunglasses-At-Night. Let the three of them fight it out. She had a date with a dead lobster.</p> <p>Behind her, Sunglasses yelped in surprise. There was a flat smack as he hit the wall, then slid down. She'd tossed him a little harder than she meant-oopsie-and then the other two jumped him, and she was out of the alley.</p><p>She could see the restaurant up ahead. Just a few more steps and she could order. Just a few more...</p><p>She stopped.</p><p>Don't you dare!</p><p>Turned.</p> <p>C'mon, enough already! They're human...it's none of your business.</p><p>She started back toward the alley. Sunglasses was a weirdo, but he was vulnerable to attack because of what she had done. Yeah, they were human, but it was one thing to mind your own business, and another to turn your back on a mess you helped make.</p><p>You moron! Who knows when you'll get to eat now?</p><p>\"Fuck off, inner voice,\" she said aloud. People thought the outer Janet was a bitch; God forbid they should ever meet the inner Janet.</p><p>She stepped into the alley to help, and was just in time to see the second mugger crumple to the filthy street. The first was half in and half out of the dumpster.</p><p>And Sunglasses was hurrying, hurrying toward her, licking the blood off his knuckles.</p> <p>\"As I was saying before you tossed me against the wall, I have business with you, miss. And where on earth do you work out?\"</p><p>She was so surprised she let him put his hands on her shoulders, let him draw her close. He smiled at her and even in the poorly lit alley she could see the light gleaming on his teeth. His very long canines. His fangs, to be perfectly blunt. He had fangs, and it wasn't even close to the full moon.</p><p>\"What the hell are you?\" She put a hand to his chest to keep him from pulling her closer. His heart beat once. Then nothing.</p><p>He blinked at her. \"What? Usually the lady in question is halfway to fainting by now. To answer your question, I'm the son of a farmer. That's all.\"</p><p>\"My ass,\" she said rudely. \"I came back to give you a hand-\"</p><p>\"How sweet.\"</p><p>\"-but you're fine, and I'm hungry.\"</p><p>\"What a coincidence,\" he murmured. He tapped a sharp canine with his tongue.</p> <p>Beneath her palm, his heart beat again. \"My, you're exceedingly beautiful. I suppose your beaux tell you that all the time.\"</p><p>\"Beaux? Who the hell talks like that? And you're full of shit,\" she informed him.</p><p>Beautiful? Shyeah. She wasn't petite and she wasn't tall-just somewhere in the middle.</p><p>Average height, average weight, average hair color-not quite blonde and not quite brown-average nose, mouth, chin. She could see her average eyes reflected in his sunglasses. \"And you'd better let go before I hit you so hard, you'll spend the rest of the night throwing up your teeth.\"</p><p>He blinked again, then smiled. \"Forgive the obvious question, but aren't you a little nervous? It's dark...and you're quite alone with me. Why, I might do anything to you.\" He licked his lower lip thoughtfully. \"Anything at all.\"</p><p>\"This is really, really boring, fuck-o,\" she informed him. \"Leggo.\"</p><p>\"I decline.\"</p><p>She brought her foot down on his, felt his toes squish through the dress shoe.</p><p>Then she knocked him away from her with a right cross. This time, when he went down, he stayed down.</p><p>Twenty minutes later, she was happily slurping the first of a dozen oysters on ice.</p><p>Chapter Two</p><p>He knew he was lurking like a villain in a bad melodrama, but he couldn't help it. He had to catch her when she came out of the restaurant. So he was reduced to watching her through the restaurant window from across the street.</p><p>Richard rubbed his jaw thoughtfully. It didn't hurt anymore, but if he'd been mortal, it likely would have shattered from the force of the woman's punch. She hit like a Teamster. And swore like one, too.</p><p>She was stunning, really very stunning with those cider-colored eyes and that unique hair. Her crowning glory was shoulder length and wavy, and made up of several colors: gold, auburn, chestnut...even a few strands of silver. The silky strands gleamed beneath the streetlight and made him itch to touch them, to see if they were as soft as they looked.</p><p>She had been fearless in the near dark of the alley, and he'd become utterly besotted. He had to see her again, take her in his arms again, hear her say \"fuck\" again.</p><p>Ah! After a five-course meal, here she came. And look! She had spotted him instantly, and was now stomping across the street toward him. Her small hands were balled into fists and her lush mouth was curled in a snarl.</p><p>\"Fuck-o, you don't learn too quick, do you?\"</p><p>\"You're marvelous,\" he said, smiling at her. There were few people on the street at this hour, but the ones who were around caught the tension in the air, and did a quick fade. Most mortals had zero protective coloring, but something about the proximity of a vampire put their wind up, even if they weren't consciously aware of it. \"Just charming, really.\"</p><p>She snorted delicately. \"I see you're heavily medicated, on top of everything else.</p><p>Get lost, before I belt you in the chops again.\"</p><p>\"You came all the way over here to tell me to go away?\"</p><p>A frown wrinkle appeared on her perfect, creamy forehead. \"Yeah, I did. Don't read anything into it. So blow, okay?\"</p><p>\"Richard Will.\"</p><p>\"What?\"</p><p>\"My name is Richard Will.\" He held out his hand, hoping she wouldn't be startled by his long fingers. Most people-women-were.</p><p>\"Yeah? Well, Dick, I don't trust people with two first names.\" She stared at his outstretched hand, then crossed her arms over her chest.</p><p>He let his hand drop. \"And you are...?\"</p><p>\"Tired of this conversation.\"</p><p>\"Is that your first name or your last?\"</p><p>Her lips curled into an unwitting smile. \"Very funny. You never answered my question.\"</p><p>\"Which one?\"</p><p>\"What are you? Your heart...\" She started to reach for him, then let her hand drop.</p><p>\"Let's just say you should get your ass to a doctor, pronto.\"</p><p>\"You know what I am.\" He bent toward her, and was thrilled when she didn't back off. \"In your heart, you know.\"</p><p>\"Dick, as my family will tell you, I don't have a heart.\"</p><p>He rested his palm against her chest, feeling the rapid beat. \"Such a lie, dearest.\"</p><p>She knocked his hand away, and sounded gratifyingly breathless when she said,</p><p>\"Don't call me that.\"</p><p>\"I have no choice, dearest, as you never told me your name.\"</p><p>\"It's Janet.\"</p><p>\"Janet...?\"</p><p>\"Smith,\" she said rudely, and he chuckled. Then laughed, a full-blown guffaw that sent more stragglers hurrying away. \"What the hell's so funny?\"</p><p>\"Don't you see? We simply must get married. Richard and Janet...Dick and Jane!\"</p><p>She gaped at him for a long moment and then, reluctantly, joined him in laughter.</p><p>* * * *</p><p>\"So you don't like the new wife?\"</p><p>Janet moodily stirred her coffee. It was after midnight, and they were the only couple in the coffee shop. \"It's not that I have a personal problem with her, she's just...not our kind, is all.\"</p><p>\"She's Polish?\"</p><p>She snorted a laugh through her nose. \"Nothing like that...I'm not that big a bitch. It's hard to explain. And you wouldn't believe me anyway.\"</p><p>He grinned, flashing his fangs. \"Try me.\"</p><p>\"No way, José. I want to hear about you. I didn't know there were such things as vampires. Assuming you're not some pathetic schmuck who filed his teeth to get the girls.\"</p><p>He considered lifting her, in her chair, over his head, but decided against it.</p><p>Among other things, it was unnecessary. She knew what he was, oh yes. She had felt his heart. And he had felt hers. \"I didn't know there were such things either, until I woke up dead.\"</p><p>She leaned forward, which gave him an excellent view of creamy cleavage in her wine-colored dress. \"How old are you?\"</p><p>\"Not so old, for a vampire. Not even a hundred yet. And as it's not polite to ask a lady her age-\"</p><p>\"Thirty-six.\"</p><p>Perfect. Giggling girlhood was left behind, she was closing in on her sexual peak, and the best was still ahead. He tried very hard not to drool.</p><p>\"I'm the old maid of the family,\" she was saying. \"Most of my friends have teenagers already.\"</p><p>\"You have plenty of time.\"</p><p>She brightened. \"See, that's what I always say! Just because we're trapped in this damned youth-obsessed society doesn't mean we have to do everything in our twenties. What's the fucking rush?\"</p><p>\"Exactly. That's what I-\"</p><p>\"Except my family thinks totally differently,\" she said, her shoulders slumping.</p><p>\"They're very in-the-now, if you know what I mean. Sometimes there's...there's fights and stuff and you never know if today's your last day on earth. There's lots of pressure to make every single day count, to cram everything you can, as often as you can. Nobody really stops and smells the fuckin' roses where I come from, you know?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"That's fairly typical of...of people.\" He'd almost said 'of mortals', but no need to push things. As it was, he had a hard time believing this conversation was taking place. She'd insulted him, pounded him, knew what he was, and was now having coffee with him. Amazing! \"If your life span is so brief-what? Seventy years or so? Well, of course you want to make every minute count.\"</p><p>\"My family's lifespan is even shorter,\" she said moodily.</p><p>\"Ah. Dangerous neighborhood?\"</p> <p>\"To put it mildly. Although it's better since...well, it's better now, and I just hope it lasts.\"</p><p>\"Which is why you can take care of yourself so well.\"</p><p>She cracked her knuckles, which made the lone counterman cringe. \"Bet your ass.\"</p><p>\"Indeed I would not.\" He stirred his coffee. He could drink it, though all it would do was make him thirstier. Instead he played with it; he enjoyed the ritual of cream and sugar. \"How long are you in town?\"</p><p>She shrugged. \"Long as I want. The wedding's over, so we'll probably hang out for a couple days, then head back to our homes.\"</p> <p>\"And home for you is...?\"</p><p>\"None of your fucking business. Don't get me wrong, Dick, you seem pleasant enough for a blood-sucking fiend of the undead...\"</p><p>\"Thank you.\"</p><p>\"...but I'm not opening up to you with all my vitals, no matter how goodlooking and charming you are.\"</p><p>\"So my powers of attraction aren't completely lost on you,\" he teased.</p><p>She ignored the interruption. \"And if you don't like it, you can stop dicking around with your coffee and get the hell gone.\"</p> <p>\"I cannot decide,\" he said after a long pause, during which he guiltily put his spoon down, \"if you're the most refreshing person I've ever met, or the most irritating.\"</p><p>\"Go with irritating,\" she suggested. \"That's what my family does.\" She glanced at her watch, a cheap thing that probably told time about as well as a carrot. \"I gotta go.</p><p>It's really late, even for me.\" She laughed at that, for some reason.</p><p>He leaned forward and picked up her warm little hand. The palm was chubby, with a strong life line. Her nails were brutally short, and unpolished. \"I must see youagain. Actually, I would prefer to spirit you away to my-\"</p><p>\"Creaky, musty, damp castle?\"</p><p>\"-condo on Beacon Hill, but you're quite a strong young lady and I seriously doubt I could do so without attracting attention. So I must persuade you.\"</p><p>\"Damned right, chum.\" She jerked her hand out of his grasp. \"Try anything, and-\"</p><p>\"I'll vomit my teeth, or be split down the middle, or my head will be twisted around so far I'll be able to see my own backside-\" She giggled. \"-yes, yes, I quite understand. Have dinner with me tomorrow night.\"</p> <p>\"Don't you mean 'let me watch you eat while I play with my drink'?\"</p><p>\"Something like that, yes.\"</p><p>\"Why?\" she asked suspiciously.</p><p>\"Because,\" he said simply, \"I've decided. You're refreshing because you're irritating. Do you know how long it's been since I've had a nice conversation with a lady?\"</p><p>She stared at him. \"You think this has been a nice conversation?\"</p><p>\"Nicer than 'Help, eeeeeek, stay away you horrible thing, no, no, noooooooooo, oh, God, please don't kill me!' I can't tell you how many times I've had that conversation.\"</p><p>\"Serves you right for being a walking wood tick,\" she said. \"Dinner, huh? On you?\"</p><p>\"Of course.\" Possibly on you, he thought, suddenly dizzy with a vision of licking red wine off her stomach.</p><p>\"Mmmm. All right. I'll admit, it's nice to be myself with a guy and not have him be such a fucking Nancy boy whenever I say something the least bit-\"</p><p>\"Fucking obscene?\"</p><p>She giggled again. \"But you gotta tell me all about waking up dead, and what it's like to be on a liquid diet. And how come my family didn't know about you and your kind?\"</p><p>\"Why would your family know about my kind?\"</p><p>\"We're pretty far-flung. There's not much going on the planet we don't know. So you'll feed me, and we'll talk. Deal, Dick?\"</p><p>\"Deal...Jane.\"</p><p>\"I find out you've got a dog named Spot, dinner's off,\" she warned.</p><p>Chapter Three</p><p>The phone rang, that shrill \"pay attention to me!\" sound she hated. She groaned, rolled over, groped for the phone, and knocked it off the hook. She relaxed into the blessed silence, which was broken by a tinny sound.</p><p>\"Hello? Jane?\"</p><p>She burrowed under the covers.</p><p>\"Jane? Are you there? Janet. Hello??\"</p><p>She cursed her werewolf hearing. Tinny and faint the voice might be, but it was also unmistakable. \"What.\"</p><p>\"Pick up the phone,\" the telephone receiver squawked. \"I want to make sure you're getting all this.\"</p><p>\"Can't. Too tired.\"</p><p>\"It's six o'clock at night, for God's sake. Pick up the phone!\"</p><p>She muttered something foul, and obeyed the caller. \"Whoever the hell this is, you'd better be on fire.\"</p><p>\"It's Moira, and I practically am...the high today was eighty-two. In May!\"</p><p>\"Moira.\"</p><p>\"You should see what the humidity did to my hair.\"</p><p>\"Moira.\"</p><p>\"I look like a blonde cotton swab.\"</p><p>\"Moira! This is fascinating, but you sure as shit better not be calling me to babble about your for-Christ's-sake hair. What do you want?\"</p><p>\"It's not what I want,\" Moira went on in her irritatingly cheerful voice. \"It's Michael. The big boss wants to see you on the Cape, pronto.\"</p><p>Finally, the silly bitch had Jane's attention. Her eyes opened wide and she sat straight up in bed. \"Michael Wyndham? Wants to see me? How come?\" And on the heels of that, a panicked thought: What'd I do? And resentment. Come, girl, good dog, here's a treat for the good doggie.</p><p>\"Mine is not to reason why, girly...and neither is yours. I suggest you get your ass out here yesterday.\"</p><p>Jane groaned. \"Aw, fuck a duck!\"</p><p>\"I'll pass.\"</p><p>\"I've got a date. Today.\" She squinted at her watch. \"Tonight, I mean.\"</p><p>\"You do?\" Moira sounded-rightfully so-completely astonished. She modified her tone, too late. \"I mean, of course you do. Sure. It's only natural, a...a lively and...er...opinionated young lady like yourself. With a date on a Saturday night. Yep.\"</p><p>\"Cut the shit, you're embarrassing both of us.\" Young lady. Right. Moira was at least ten years younger. Half Jane's size (and weight). Twice the brains. Calling Moira a silly bitch was only half right. \"Fuck! I don't need this now. You don't have any idea what it's about?\"</p><p>\"Um...\"</p><p>\"Come on, Moira, you and the boss are practically litter-mates. Spill.\"</p><p>\"Let's just say that in his newfound happiness with mate and cub, our fearless leader thinks it's high time you settled down-\"</p><p>\"No, no, no!\"</p><p>\"-and he's met just the right fella for you,\" she continued brightly. \"He's sure you'll hit it off.\"</p><p>\"Doesn't the head of the pack have anything better to do than fix me up on yet another stupid blind date?\" She could hear plastic cracking, and forced her fingers to loosen around the receiver.</p><p>\"Apparently not. Now tell the truth; the last one wasn't so bad.\"</p><p>\"He cried like a third grade girl when I beat him to the kill.\"</p><p>\"Well, you did hog all the rabbits yourself. Tsk, tsk.\"</p><p>\"Figures,\" Jane grumbled, swinging her legs over and resting her feet on the floor. \"The first halfway decent guy I meet in forever, and the boss wants me to blow him off to meet some new dildo.\"</p><p>\"Sorry,\" Moira said, sounding anything but. \"I'll leave the dildo part out when I tell Michael you're on the way. And now, having imparted my message, I'd say something like 'have a nice day', except I know you-\"</p><p>\"Hate that shit. Bye.\" She hung up and resisted the urge to throw the phone against the wall. Fuck. Fuck fuck!</p><p>She'd been so excited about dinner with Dick, she'd had a hard time getting to sleep. She'd finally dozed off near dawn...and slept the entire day away. Now she had to beat feet for the Cape, of all places...fuck!</p><p>She did throw the phone. But it didn't make her feel any better, not even when it shattered spectacularly against the wall.</p><p>* * * *</p><p>She was tapping her foot on the curb, waiting for the sloth-like doorman to hail her a cab. She could hail her own damned cab, thanks very much, but when in Rome, do what the sheep do. Or something like that.</p><p>She'd packed like a madwoman and it showed-she could see the corner of her dress sticking out of the suitcase. Aarrggh! Fifty-nine ninety-nine at Sears, and she'd probably never get to wear it again. Like clothes shopping wasn't an unending horror anyway-now she'd have to go again.</p><p>And Dick. She felt really bad about up and leaving town. He'd think she stood him up. Like that would happen. He was ridiculously good-looking but, even more important, she could talk to him. Not be herself-not completely-but close.</p><p>Shit, she couldn't even be herself with the pack; they'd written her off as an old maid a decade ago. Pack members mated young, dropped kids young, and died young.</p><p>And she didn't want kids, which, among her people, made her El Freako Supremo.</p><p>Getting knocked up-assuming your mate could get you pregnant without getting his bad self hurt-was one thing, but then you were a slumlord to a fetus for ten endless months. At least the humans only had to suffer for nine. Even worse, you puffed up like a blowfish and ate everything in sight, then squeezed out a kid during hours of blood and pain...blurgh. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And afterwards! Just the thought of having to tote around a l'il nose-miner who cried and screamed and puked and shit-and that was just the first week!-was enough to curl her hair. She hadn't liked kids even when she was one. The feeling had been mutually-and heartily-returned. She'd felt that way at eighteen, twenty-three, thirty, thirty-four. Sure, kids were necessary-for other people. Janet preferred to sleep late, and wear clothes that hadn't been puked on, and not watch her language.</p><p>\"Where to, ma'am?\" the doorman asked, breaking her anti-infant reverie. He was ineffectually flapping a hand at the occasional cab. She could have hailed four on her own by now. Shit, she could have jogged to the airport by now.</p><p>\"Logan,\" she practically snapped. It wasn't Door Boy's fault she'd been ordered to leave town, but the big boss wasn't here for her to take her anger out on him. \"Quick as you can.\"</p> <p>She thought about leaving a note for Dick, and reluctantly decided against it...better find out what Boss Man Michael wanted, first. And if it wasn't life and death, she'd let him have it, and who gave a rat's ass if he was the pack leader? She had a life.</p><p>Well, before yesterday she really hadn't, but he didn't know that. It was his privilege to snap his fingers and have any one of them come at a dead run, but it was hers not to like it. observed the doorman shivering and realized the sun had nearly set, and the temperature had dropped a good ten degrees. Still, it wasn't that cold. And why did the kid look like he was ready to drop a steaming load into his trousers? She was irritated, but not at him...surely he knew that.</p><p>God, the reek the kid was giving off! Like mothballs dipped in gasoline. His fearhis terror-burned her nose. It put her wind up and she cupped her elbows, shivering.</p><p>From grumpy to edgy in less than five seconds...a new record!</p><p>The ball dropped and she understood a half second too late. She was spun around and had time to take in burning blue eyes before there was a walloping pain in her jaw and Dick turned off the lights. And everything else.</p> <p>Chapter Four</p><p>He didn't care. He really didn't. She was fine, and if she wasn't, who cared? He hadn't hurt her. Not really.</p><p>He checked on her for the eleventh time in sixty minutes, and was relieved to see the bruise on the underside of her jaw had faded to a mere shadow. Guilt rolled off his shoulders like a boulder.</p><p>To save time and steps-if he left he'd just be in here five minutes later-he sat down in the chair beside the bed. He cupped his chin in his hand, leaned forward, and watched her sleep.</p><p>Jane scowled, even in the throes of unconsciousness. It would have made him smile, if he hadn't felt so angry and betrayed.</p><p>Betrayed? All right, tell the truth and shame the devil...yes. Betrayed! And angry and sick at heart and furious with the little twit tied to his bed. Most of his anger was directed at himself, it was true, but he had a nice helping saved for Miss Jane.</p> <p>She'd fooled him; that was all. A simple thing, but unforgivable. She made him believe she accepted the monster, when in fact she most assuredly had not. The duplicitous wretch agreed to join him for dinner to placate him, then made arrangements to slink out of town like a thief. If he hadn't shown up early to escort her to dinner, she would have disappeared and he might never have known what had become of her. Would have wasted years of his life worrying about her fate.</p><p>Instead, he'd taken in the situation at a glance, and acted accordingly. Well, all right, that was a rather large lie. He had panicked-all he could think of was to get her home, stop her from leaving him. Leaving town, rather. And in his panic, he'd smacked her when he only meant to tap her. The one bit of luck was that it had happened too quickly for the lone witness-the doorman-to see much more than a swirl of cloth.</p><p>Dusk and speed were his friends, even if Jane was not.</p><p>And that was the rub of it. He'd allowed himself to forget, for one evening, that he was the monster in the fairy tales. He had forgotten there could be no relationship with a woman other than the most carnal type. He wouldn't have vampire women, and mortal women wouldn't have him. Well, that was fine. That was just fine.</p><p>He was a monster, and was done pretending otherwise.</p><p>But Jane would pay for making him forget. She'd pay for making him think, however briefly, that he was a man first and a beast second.</p><p>Chapter Five</p><p>Jane groaned and tried to roll over. The phone was ringing. It would be Moira, telling her to get her ass to the Cape. She couldn't see Dick tonight. She had to answer the phone and tell Moira to go fuck herself, and then-</p> <p>Wait.</p><p>That had already happened. So why was she still in bed?</p><p>She opened her eyes and tried to sit up. Three alarming facts registered immediately on her brain: a) she couldn't sit up, and b) she was tied to a bed. She was, in fact, c) tied down in the same room with an annoyed vampire. And not a prayer of room service.</p><p>\"Ohhhhhh, you idiot!\" she howled. If she could have slapped her hand over her eyes, she would have. If she could have slapped him, she would have. As it was, her ankles and arms were spread wide and tied to each poster of the bed. \"Do you have any idea of the trouble you've landed me in, numb nuts?\"</p><p>Dick, sitting in the chair next to the bed, blinked at her. He did that a lot...a long, slow, thoughtful blink when he was taken by surprise. It was like a stall for time, or something. She used to think it was kind of cute. \"I shouldn't have expected maidenly protestations,\" he said after a long pause.</p><p>\"You should expect a fractured skull, you undead idiot! What the fuck am I doing tied to your bed? Is it your bed? It damn well better be your bed! If I'm in some strange dead guy's bed your ass is grass!\"</p><p>He brought a hand up to his chin...then got up and abruptly left. She used the chance to yank at her bonds-no good. They were soft, like cloth, but amazingly strong.</p><p>Were her bonds lined with bubble gum, or what?</p><p>She strained to hear, and, very faintly, could hear muffled laughter coming from about thirty feet away. Dick had trotted out to the hall to have a giggle at her expense-fucking great.</p><p>The door was thrown open a moment later, and when Dick returned, he was stone-faced. \"Sorry about that. I thought I left something on the stove. Now where were we?\"</p><p>She kicked out at him. The bonds let her leg leave the bed, but not by much.</p><p>\"We were talking about how you're going to die a painful and horrible death-again!</p><p>What the hell have you trussed me up with?\"</p><p>The left side of his mouth twitched. \"It's elastic lined with titanium wire. It won't hurt you if you pull on it, but it's impossible to break. Even I have trouble breaking it, and I'm quite a bit stronger than you are.\"</p><p>Wanna bet, Dead Man Walking? \"Do you have any idea-aarrgh! I'm supposed to be meeting my boss right this minute! What time is it?\"</p><p>\"About two a.m.\"</p><p>\"Aaaarrrgggghhh! Jerk! I'm five hours late!\"</p><p>\"Another date?\" he asked silkily.</p><p>\"No, Deaf and Undead, I told you. My boss called-well, he didn't call, one of his lackeys did-and told me to get to the office, pronto. And when he says jump, we leap, dude. I didn't have time to leave you a note, but I would have come back!\"</p><p>\"Sure you would have.\"</p><p>Jane was so annoyed, she felt like biting herself. Instead, she yanked impotently on her bonds again. \"Yes I would have, dill-hole!\"</p><p>\"Your boss calls you on a weekend, and you must drop everything and race to his side? Really, Janet. I was expecting a better story than that.\"</p><p>She snarled at him. If he made her much madder, she'd start barking at the goddamned ceiling. \"Jesus, to think I was actually looking forward to seeing you! And this is how you take rejection...pervert!\"</p><p>Something flashed in his eyes then. Way down deep. She was suddenly reminded of the lake back home she used to do laps in. The blue water was pretty and inviting, but the lake was spring-fed, and freezing cold, even in July. You didn't know how cold it was until you committed yourself and jumped. Then you were stuck, and you got moving or you froze.</p><p>\"So you admit you rejected me?\"</p><p>\"No, doorknob! I told you the truth. You can believe it or you can go fuck yourself.\"</p><p>\"Is there a third choice?\"</p><p>\"Yes...untie me so I can make a phone call!\"</p><p>\"I decline.\"</p><p>\"You can't just keep me here like a...a...\" She practically spat the word. \"...pet or something.\"</p><p>\"Can't I?\"</p><p>Suddenly he was standing over her, casually unbuttoning his shirt and sliding it off his shoulders. Her eyes widened until they felt like they were practically bulging. \"What the hell are you doing?\"</p><p>\"You're a bright girl. You'll figure it out in a minute.\"</p><p>\"Don't you dare!\"</p><p>\"I dare much, now that my heart-\" He cut himself off abruptly, and she heard the click of his teeth coming together. What the hell was going on with this guy?</p><p>Off came the trousers, the socks, the underwear. Nude, Dick was exceedingly yummy...long legs, broad shoulders, and a tasty flat stomach that made her think about hot fudge sauce and whipped cream. His chest was lightly furred with blond hair two shades darker than the hair on his head. His muscle definition was excellent and she had a sudden, maddening urge to touch him, see if his skin was as smooth as it looked.</p><p>It would be, she thought, like velvet encased in steel. Or marble...he was quite pale.</p><p>He reached out and flipped off the light...click. She consciously dilated her pupils and could see him again, a pale blur in the dark. A blur with glittering blue eyes.</p><p>She felt his cool hand on her thigh, then his fingers were nimbly unbuttoning her dress. She kicked out again, to no avail. He popped open the clasp on her bra-stupid front clasps!-and with odd care, gently tore her panties down the middle. She hissed at him. Twelve bucks at Victoria's Secret! The bitch's secret was that she marked up her underwear by 600%!</p><p>\"You are an asshole,\" she said clearly.</p><p>\"True enough.\" He pulled her panties free and spread her dress wide, then pushed her bra out of the way. \"Umm. Very nice.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Go fuck yourself, perv.\"</p><p>\"I'd rather not...besides, you're here, so why should I have to? We have hours until sunrise.\" He chuckled. It sounded like cold water flowing over black rocks. \"And Jane...I'm sooooo hungry. I've been waiting and waiting for you to wake up.\"</p><p>\"I hope I poison you. I hope you choke until your lungs explode. I hope my blood burns your windpipe. I hope-\"</p> <p>\"I get the gist. I hope that the next time you agree to spend the evening with me, you keep your word.\" Then he was on her so suddenly she didn't have time to pull in air for a gasp. She braced herself as best she could for his brutal entry, for teeth and blood and pain. Oh, when I get out of here I'm going to use your vertebrae for dice. See if I don't. And I won't cry, either. So there.</p><p>His mouth skimmed her jaw, and she felt him lick her jugular and nibble gently at the tender flesh. His cool hand closed over her breast, pressed against her warm flesh, and she felt her nipple harden against his palm. Then he was kissing her throat, the middle of her chest, and her stomach. She felt his thumbs on her cunt, spreading her wide, and she felt his tongue snake inside her. The shock of it nearly bent her up off the bed. His mouth was cool, but quickly warmed, and she flinched back, thinking of his sharp canines.</p><p>But there was nothing to fear-or there was, but she quickly forgot it as waves of heat started from her crotch and radiated upward. His tongue was flicking in and out of her little tunnel, stabbing her clit, and then he pulled back and licked...excruciatingly slow licks that made her shake. She gritted her teeth as hard as she could and locked away the sounds she wanted to make. So he wasn't being a hard guy-fine. This still wasn't her idea. It still wasn't any different than smacking her around or shoving her up against a dirty alley wall or-or-</p><p>He stopped. He pulled back. She started to relax, then felt the sharp sting as he teeth broke the skin over her femoral artery. She gasped-she couldn't help it-and tried to jerk away, but his hands held her fast.</p><p>His fingers smoothed the soft pelt between her thighs, and then he was parting her lips again, and stroking her throbbing clit. One of his fingers dipped inside her while his thumb pressed gentle circles around her increasingly slick flesh. Meanwhile, his mouth was busy on her inner thigh, and she could hear soft sucking.</p> <p>This went on, and on...she quickly lost track of time. She was screaming inside.</p><p>Whenever she started to get close, he somehow knew, and his fingers would still, or pull away entirely. His mouth never stopped. Then he'd resume again, careful not to push her over the edge. After a while she still wasn't making any sounds, but the bed shook with her trembling.</p><p>At last he was sated. He pulled back, then bent to her and gave her a long, leisurely lick. \"Ummm. You're so wet. I love that. And you taste soooo good. Everywhere, it seems. Your blood is really rich. What on earth have you been eating?\"</p><p>She ground her teeth at him for answer. She felt his pelvis settle over hers, heard him chuckle. \"Your rage could set the room on fire-better than being cold, I think?\"</p><p>She didn't dignify that with an answer. Besides, if she opened her mouth-what might she say? She was horribly afraid she might ask-beg-to be fucked. Hard. For a long, long time. Her cunt throbbed. Her thigh throbbed. It wasn't pain, it was sheer yearning. She had never needed to come so badly.</p><p>When she felt him start to enter her, it took every ounce, every drop of her willpower not to strain to meet him. She resisted by listing his many odious offenses inside her head.</p> <p>That part of him was warm. And hard, and huge. His cock was parting her slowly and gently, and she had a quick thought: He has to be gentle...he wasn't, a few times before, and he hurt his partner. That's how he knows to tongue fuck, first. But that thought spiraled away into confusion as he shoved, and she felt him slam into her. She made a sound, some small sound, and his mouth was instantly on hers. She could taste her lust, and her blood, and then he was whispering into her mouth, \"I couldn't help that, I'm sorry-am I hurting you?\" His hands were fisting in her hair and now he was groaning and thrusting, and her breath was coming in harsh gasps.</p><p>\"Please,\" she groaned. \"Please-\" Don't stop. Don't ever stop. Harder. More. Faster.</p><p>Please. Please. Please.</p><p>He groaned, too. \"I wanted to hurt you but not like...I'll make it up to you, my own-\" She heard him grind his teeth...and then he stopped so suddenly he was rigid with the strain of it. She was afraid to move, to breathe, but it didn't matter, he did the unthinkable anyway-slowly pulled out of her. She closed her eyes and whimpered as he went, hating herself for it even as she knew she could have done nothing to quell the sound.</p><p>\"Jane. Tell the truth, love. Am I hurting you?\" She felt his hand caress her cheek and opened her eyes. His teeth were set so hard his jaw trembled. Here was a perfect opportunity for revenge. And she couldn't do it.</p><p>\"Twice,\" she whispered.</p><p>He bent closer, dropped a kiss to her shoulder. \"What?\"</p><p>\"Twice. This is my second time. Ever. In my life.\"</p> <p>\"You-what?\" She could have laughed at his horrified expression, if she hadn't been ready to claw his eyes out for not letting her come. \"Oh, Christ! I had no-I thought you-you seemed so tough I was sure-\"</p><p>Tough? Sure. Real tough. She'd grown a shell around her soul the night she lost her virginity. The night she, in her ardor, broke her lover's back. It had happened on the last day of her freshmen year in college, and her then-boyfriend, as far as she knew, was still in a wheelchair. It was the first and last time she'd chosen someone who wasn't pack. It was, in fact, the last time she'd chosen anyone, until tonight. And she hasn't exactly chosen this, had she?</p><p>\"You can't say Christ,\" she whispered. \"You're a vampire.\"</p><p>\"One of the many myths,\" he whispered back. He stroked her hair. She could feel his cock on her leg, throbbing impatiently. It didn't give a fuck if she was hurt or not. It had business to get back to. And so did she. \"Jane, why did you try to run away from me?\"</p><p>\"I didn't, dimwad. I told you the truth.\"</p><p>\"Hmm.\"</p><p>\"Now will you please finish and untie me?\"</p><p>\"Pick one.\"</p><p>She nearly screamed. \"What?\"</p><p>\"Pick one.\" He tapped her clit with a teasing finger. \"And I'll do it.\" He kissed her again. He ducked down and licked her nipple, then sucked, hard. In their bonds, her hands curled into fists. \"Whichever one. I'll do it. Thoroughly.\"</p><p>\"I hate you,\" she nearly sobbed.</p><p>\"I know.\"</p><p>\"Finish.\"</p><p>\"Oh, thank God.\" In an instant he was pushing his way inside her again, and for a half second she understood why he had been concerned-the friction was delightful, so delightful it was just this side of pain. Then he was pumping his hips against hers and it became more than delightful; it was exquisite.</p><p>\"Kiss me back,\" he said into her mouth. \"Give me your tongue.\"</p><p>Half-blind from the swamping pleasure, she did so. He sucked on it in time with his thrusts and she could hear someone making high, whimpering noises, and realized with amazement it was her making those silly bitch sounds. The bed thumped in time with their fucking, and then he tore his mouth from hers. \"Now,\" he hissed in her ear, \"come now.\" Then he pinched her nipple, hard, and that spun her into the most powerful orgasm of her life. She could actually feel the spasms ripple through her uterus, and the world got dark and fuzzy around the edges for a few moments. Above her he stiffened and for a moment his grip was painful. \"God, my God, Jane!\" Then he shuddered all over, and he relaxed as she felt him spurt deeply inside her.</p><p>She dozed for a few minutes-it had been a stressful few days. She came all the way awake when she realized he was stroking her lower lip with his thumb. \"Get the fuck off me now.\"</p><p>\"Ah, you're back. I thought you were being uncharacteristically quiet.\"</p><p>\"Off. Now. Hate you. Kill you.\"</p><p>He burst out laughing, which did nothing for her temper. She strained mightily and managed to roll him off her. \"I'm sorry, love, it's rude to laugh. But most women in your position would be fetal with shock, sobbing into the bedspread. All you can think about is how to get your teeth into me.\"</p><p>\"And how you might taste,\" she added silkily.</p><p>\"Umm...well, there are ways to answer that question...\"</p><p>\"Anything you put in my mouth, you're gonna lose.\"</p><p>He sighed. \"I suppose it was too good to last. Pity we're only compatible in bed.\"</p><p>\"Compatible in-you raped me, asswipe! Do you have any idea what my family is going to do to you? What I'm going to do to you?\"</p><p>\"I did rape you.\" He tweaked one of her nipples. \"At first.\"</p><p>She blushed with shame. He saw it, and it moved him whereas her death threats did not. \"No, you're right-I forced you. None of this was your idea. You're still tied up, for heaven's sake. You don't have anything to feel guilty about.\"</p><p>She was, absurdly, grateful for the lie. Not that she had any intention of showing it.</p><p>\"I feel very guilty that I didn't break your neck in that alley when I had the chance now let me go!\"</p><p>\"Sorry, Jane. You had your chance to be free, and you chose to stay.\"</p><p>\"I did not-\"</p><p>\"So stay you will, and just like this, until...\"</p><p>\"Oh, what, what? Christ, you're driving me crazy!\"</p><p>\"...until you agree to be my wife.\"</p><p>Long silence, broken by, \"You're on drugs.\"</p><p>\"Only if you are. Is that why your blood is so rich? God, it was like wine. I don't think I've ever felt better,\" he said giddily. \"I had planned to fuck you and eat you and turn you out into the street in the wee hours of the morning without so much as an 'I'll call you', but now I'll never, never let you go. You're a rare jewel, Jane. An emerald, a ruby.\"</p><p>\"I'm tied to the bed next to a crazy person,\" she mused aloud. Thinking, Never drank from a werewolf before, eh, buddy? Interesting. If you become addicted to me, that could be useful. \"And as far as being your wife-you've probably heard this from all your other rape victims, but I'd rather be dead.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Undead,\" he said brightly. \"Well, we've got time for that. You're still in your prime.</p><p>Although I have no intention of becoming a widower in forty or fifty years.\"</p><p>\"What?\"</p> <p>\"Oh, I won't insist upon it right away, but probably within the next ten years or so, I'll definitely have to turn you into a vampire.\"</p><p>An undead werewolf? What's next, Frankenstein's Monster coming over for dinner?</p><p>\"You're out of your fucking mind.\"</p><p>\"Apparently so,\" he said cheerfully, and kissed her, and left her.</p><p>Chapter Six</p> <p>Richard knocked modestly-absurd, given what he had just done to her-and opened the door. She was staring at the ceiling, and didn't look at him when he came in.</p><p>He nibbled his lower lip and tried to distract himself from the sight of the lovely Janet, spread-eagled on his bed. It was amazing-he'd just spent over an hour with her, but he could have taken her right this minute. And again. And then again.</p><p>He was carrying a tray full of savories. She smelled it and sat up as much as her bonds would allow. \"Feeding time at the zoo,\" Jane said moodily. The spot on her thigh where he'd fed from her was purpling. He stifled an urge to kiss it, and beg her forgiveness. She lied, he reminded himself. And you're the monster.</p><p>\"Oh, hush. No one in a zoo eats so well. See? Lobster bisque and biscuits and a steak and milk and if you eat everything, chocolate ice cream.\"</p><p>\"That's a ridiculous amount of food,\" she said, staring at the tray.</p><p>\"I've seen you eat, my love. I'm going to let you out of your bonds, but before you hit me over the head with the tray and flee for the hills, I should explain that there are no fewer than three bolted doors-all English oak-between you and the street. You'd never get through them all before being caught. And you must be starving. Surely it's more prudent to eat and plot revenge, right?\"</p> <p>She drummed her fingers on the bedspread and stared up at him. Her eyes went narrow and flinty, but at last she said, \"I'm starving.\"</p><p>\"Eat, and then a hot bath...sound good?\"</p><p>\"And then what?\"</p><p>\"And then agree to be my wife.\"</p><p>\"Don't,\" she practically snarled, \"start with that again, dicklick.\"</p><p>\"Ah, a blushingly modest bride, how refreshing. I can see you're contemplating homicide-try not to spill the soup.\"</p><p>He set the tray down on the table, and unsnapped her ankle bonds. Then he seized the footboard and tugged the bed away from the wall. She could have done the same thing herself, but couldn't help but be impressed-not bad for an undead monkey. He walked to the headboard, reached behind it, and in a few seconds had her wrists freed.</p><p>She was off the bed in a bound, pulled the shreds of her clothes off and let them flutter to the floor, then made a beeline for the tray.</p> <p>\"I brought you a robe-\"</p><p>\"Who cares?\" she said with a mouthful of biscuit. \"You've already seen me naked.\"</p><p>\"Uh-\" You're gorgeous. You're distracting. If you prance around in that sweet little body you'll have your hands full. You have soup on your chin. \"As you wish.\"</p><p>He sat down across from her and watched her eat. She ate like a machine, seeming to take no enjoyment from the meal. Refueling, the better to kick my ass. Well, so be it. He deserved that, and more. And he was a fast healer. Let her do her worst. \"Why did you break our date?\" he asked abruptly, and surprised even himself-he had no idea he was going to say such a thing until it was done.</p><p>She grunted irritably. \"We've been over this.\"</p><p>\"Jane...\" Again, he had no idea what would come out of his mouth, but plunged ahead anyway. \"Jane, if you tell the truth, I'll unlock those three doors and will walk you back to your hotel. Just admit that you were afraid of me, that you were only pretending to accept what I am, and-\"</p><p>Her gaze locked on his like a laser. \"My name is Janet Lupo,\" she said coldly. \"I'm not afraid of any man. And. I. Don't. Lie.\"</p><p>He actually felt the chill coming off her. Absurd! She was half his size, even if she had twice the mouth. Her gaze was odd, almost hypnotic. With difficulty he broke her challenging stare. \"Well,\" he said at last, \"perhaps you can understand why I have difficulty believing that your 'boss' would insist on your free time, and why you would have to drop everything and rush to meet him at a moment's notice.\"</p><p>\"Pack rules.\"</p><p>\"Beg pardon?\"</p><p>\"Pack...rules...dumb...fuck. Am I stuttering? I'm a werewolf. My boss is the head werewolf.\"</p><p>He laughed, then ducked as her soup bowl sailed over his head. \"Oh, come now, Janet! Because you know I am a vampire, you've decided I'll believe that you're a werewolf? I'm that gullible? There's no such thing, and you know it well.\"</p><p>\"Says the bloodsucker!\"</p><p>He was still chuckling. \"Nice try.\"</p><p>\"If you could think about something besides your dick for five seconds, you'd see it makes sense. My strength, my speed...\"</p><p>\"All well within the range for homo sapien...albeit the high end.\"</p><p>\"You've been dead too long, Dick. The average homo loser can barely lift the remote control. My rich blood? That's from a diet high in protein. Raw protein, during the full moon.\"</p><p>\"Ah, the full moon. It's a few days away, but I suppose I had better take care when-\"</p><p>She slammed her fork down; the table trembled, then was still. \"The full moon is eight days away. And when it comes, you're going to get a big fucking surprise. Your little oak doors won't hold me then. I'll be out of here-possibly eating your head on my way out the door-and you'll realize you fucked up, bad. You'll know I was telling the truth the whole time, but you couldn't see past your stupid injured male pride. I'll be gone forever, and you'll have the next hundred years to realize what an asshole you were.\"</p><p>This was so convincing, he actually panicked for a moment. To add drama to her little speech, she stopped eating, walked to the bed, got under the covers, and faced away from him the rest of the night. She never said another word, or looked at him, not even when he tempted her with a brimming bowl of frozen custard.</p><p>Chapter Seven</p><p>He was right. The doors-this one, anyway-were oak. Thick and heavy, with the hinges on the outside where she couldn't get at them. She threw her shoulder a few times-okay, thirty-into the door, but it barely rocked in its frame. \"Fucking Brit wood,\" she mumbled, rubbing her aching shoulder.</p><p>She'd prowled around her cage for the last couple of hours. It was a gorgeous room with plush wine-colored carpet, a soft queen-sized bed with about a zillion pillows, and a truly glorious attached bathroom (free of all razors and other sharp things, she was sorry to note). But as far as Janet was concerned, if you couldn't leave, it might as well have a cement floor and bars on the window.</p><p>She went through the bureau and found several robes in her size, in various materials. No real clothes. No television, either, but several books. She saw some classics-Shakespeare, Mark Twain, and Tolstoy-as well as-too funny!-the entire collected works of Stephen King. She supposed she might stand half a chance if she threw Hamlet at Dick as hard as she could. She'd gotten the drop on him before, in the alley, but wondered if it was possible now. He didn't believe she was a werewolf, the stupid dickhead, but he'd be careful. He thought she was one of the monkeys, but he respected her anyway. If he wasn't such a fuckstick, she could have really liked him.</p><p>She wondered what the pack was thinking-what boss-man Michael was thinking. Probably that she'd been run over by a train or something. Death was about the only acceptable reason for skipping a meeting with the big dog. Interestingly, that thought-she'd unwillingly disobeyed a command from her pack leader-brought no anxiety. In fact, it was kind of nice, knowing Michael wanted her on the Cape, and here she was, still in Boston.</p><p>If only Dick hadn't been such a beast. If only he hadn't been so nice about being such a beast-he might have wanted to really hurt her, but he sucked at it. She remembered him pulling out of her when he thought he was too big for her...remembered the excellent food, and the large quantities of it. The absurd marriage proposal. Absurd because...well, just because.</p><p>If he wasn't such a dick, she could start to like him. But nobody-fucking nobody-snatched Janet Lupo from the street, tied her down like a dog, and did whatever he wanted. He'd pay. She would have to wait for her chance, but it would eventually present itself. And then he'd better watch out for his guts, because she meant to have them on the floor.</p><p>* * * *</p><p>The smell of eggs basted in butter woke her up. Before she could open her eyes, she realized Dick was under the blankets with her. Then she felt his mouth on her neck, felt brief pain as his fangs broke the skin. She tried to push him away, but he pinned her down and held her to the bed while he drank. She had no leverage and could only lie beneath him while he took from her.</p><p>\"You piece of shit,\" she said directly into his ear.</p><p>He laughed against her throat. \"That's the problem, Jane m'love. If you screamed or fainted or cried, I'd have no interest in you-I'd want to be rid of you as quickly as possible. But you're fearless, and furious, and it works on me like an aphrodisiac. Which is why you have to be my wife.\"</p><p>\"I'd rather eat my own heart.\"</p><p>He licked the bite mark on her neck, then nuzzled the tender spot. \"That's a rather disturbing visual. Did you sleep well? I admit I was astonished you weren't lying in wait ready to strangle me with the sash from one of your robes.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'd rather wait until you dropped your guard. Then you'll be sorry.\" She said this with total confidence.</p><p>He rested his forehead against hers. \"God, you're delightful.\"</p><p>\"I'm going to skin you alive, you fucking undead monkey. Then I'm going to set your skin on fire. Then I'm going to roast your skinless body over the fire I made with your skin.\"</p> <p>\"And so ladylike, too! Umm...\" His cool mouth closed over one of her nipples, and she brought her fist down on top of his head, hard. Then yelped when he bit her.</p><p>\"Sorry,\" he said, rubbing the top of his head. \"That was you, not me. You hit me so hard my teeth nearly clacked together.\"</p><p>\"Just you wait,\" she said ominously.</p><p>He kissed her wrist, her pulse point, and then the crook of her elbow. She balled a fist and got ready to sock him again.</p><p>\"Jane, as delightful as last night was-for me, anyway-I'd rather not tie you up again.\" She punched him square in the face, a poor blow with her lack of leverage, but his head rocked back, which was gratifying. He went on as if nothing had happened.</p> <p>\"So let's make a deal, you and I. I won't tie you up, and you won't fight me. As of now,\" he amended.</p><p>\"You won't tie me up?\" she asked suspiciously. \"But I have to let you fuck me?\"</p><p>He looked pained. \"Yes, you have to let me fuck you.\"</p><p>She pretended to think it over, but it was an easy decision. She could stand almost anything but being tied down. It went against her very nature, made her want to bite somebody. \"Okay. I won't punch, and you won't get out the elastic bubble gum.\"</p><p>\"And you'll kiss me back.\"</p><p>\"Forget it.\"</p> <p>\"All right, then, I will do all the kissing for both of us.\" He smiled at her, put a hand on the back of her neck, and pulled her to him.</p><p>\"What, I can't eat first? This deal blows.\"</p><p>\"Later, Jane. I'm begging you.\" His mouth was slightly warm, and his tongue slipped past her teeth to stroke her own tongue. She felt his hand cup one of her breasts, testing the weight of it, and then his thumb was rubbing her nipple.</p><p>She wriggled, pushing more of her breast into his palm. \"So, the quicker you get off, the quicker I can have eggs?\"</p><p>He sighed. \"You're really killing the mood here.\"</p><p>\"What mood? I'm a prisoner, for fuck's sake. And I'm hungry,\" she whined.</p><p>\"Oh, for-\" But he let go of her and she bounded off the bed. She wolfed down her breakfast-eggs, six strips of bacon, four pieces of toast, and two glasses of milk-in five minutes while he laid on the bed and watched her with his fingers laced behind his head and a mildly disbelieving look on his face. She got up, wiped her mouth with a napkin, tossed it over her shoulder, and climbed back into bed.</p><p>\"All right, then,\" she said, infinitely more cheerful.</p> <p>He smiled at her. \"All right, then.\" He reached out, took her hand, and led her to the bathroom.</p><p>Ten minutes later, they were in his giant bathtub and the floor was soaked. Her legs were spread wide and resting on each rim of the tub, and she was gripping the sides so tightly her knuckles ached. Richard was beneath the water, nuzzling and tonguing and fingering her cunt. He'd been down there for five minutes, and she was about ready to lose her fucking mind.</p><p>Now his tongue was inside her, and one of his fingers was worming into her ass.</p><p>She'd never been interested in assplay-the idea had always grossed her out-but the sensation of his long finger sliding up inside her while his tongue darted and stabbed and licked her cunt made her throb. She had no control over her reflexes, she simply started to thrust her hips at his face. Her muffled groans (for her teeth were tightly clenched) bounced off the bathroom tile.</p><p>He rose, water dripping down his marble-white skin, and grinned at her. He pulled her up to him and growled, \"Now you'll kiss me.\"</p><p>She did, without hesitation. He sucked her tongue into his mouth as he pushed her thighs wide, as he took himself in hand and rubbed his cock against her sopping cunt.</p><p>She moaned into his mouth and strained toward him. He tore his mouth from hers, sought her neck, and she felt him bite her just as his cock thrust inside. The combination of sensations-slight pain, swamping pleasure-made her come so hard she bucked against him, and another gallon of water sloshed over the side of the tub.</p><p>\"Ummmm,\" he said against her throat. \"Oh, that's very good. I could do this all day.\"</p><p>\"Better...not...\" she managed. \"It'll kill me.\"</p><p>He laughed and leaned back. She was still spread up against the sloping end of the tub; they were connected only by his cock. He ran his hands over her soapy breasts, smiling as she groaned again. \"Oh, you are going to marry me,\" he said huskily. \"Believe it.\"</p><p>\"Why don't you...stop talking...and finish fucking?\"</p><p>He grinned, flashing fangs, and obliged. When he finished she was indecently satisfied, and there was only a few inches of water left in the tub.</p><p>* * * *</p><p>Later, he brought a second breakfast. \"After that half an hour,\" he explained,</p><p>\"even I could eat a few more eggs.\"</p><p>\"Not bad for a dead guy,\" she said casually, pretending she wasn't still throbbing. The man had a fiendish touch between the sheets-or in the tub-and that was a fact. \"I'm sure the ladies like you all right, when you're not being such a jerkoff.\"</p><p>He didn't answer, just sat down across from her and watched her eat. After a few minutes, he started drumming his fingers on the table.</p><p>\"Yeah, that's not gonna get annoying. The kidnapping and the fucking I can take, but not the nervous tics. Cut it out.\"</p><p>\"Why only twice?\"</p><p>\"What?\"</p><p>He was nibbling thoughtfully on his lower lip and watching her. \"Why was last night only your second time? You're in your thirties. You should have had hundreds of experiences by now. It can't be a dislike for the act itself-you're sexy, responsive, and open to new experiences. So what's the explanation?\"</p><p>Her mouth was suddenly dry-weird!-and she gulped some juice. \"None of your goddamned business.\"</p><p>\"Did he hurt you? Because if he did, I'd be delighted to track him down for you and teach him a richly deserved-\"</p><p>\"Am I speaking a language you don't know? I said it was none of your business.\" Her hand was shaking. She put the juice glass down with a bang and hid her hands under the table. \"And even if it was, I don't want to talk about it. Especially with you.\"</p><p>His eyes were narrow, thoughtful. \"Ah...you hurt him. And felt needless guilt ever since-Jane, for heaven's sake. Whatever you did, it was an accident. You didn't mean it.\"</p><p>\"Are you deaf? I said I don't want to talk about it!\" The glass zoomed at his head; he ducked and it slammed into the far wall. Orange juice and broken glass sprayed everywhere.</p><p>\"All right,\" he said calmly. \"We won't talk about it.\"</p><p>Her hands weren't the only thing shaking. She grabbed her elbows and squeezed; clenched her teeth to stop them from chattering. She was morbidly afraid she might puke, and soon.</p><p>He got up from his chair, came to her, and scooped her up as if she was a child.</p><p>For a wonder, she didn't try to pull his eyeballs out of his head. \"You're tired,\" he soothed. \"You've had a rotten week. Why don't you take a nap?\"</p><p>\"Why don't you go fuck yourself?\"</p><p>\"Can't we do both?\"</p><p>She chuckled unwillingly.</p><p>Chapter Eight</p><p>Two nights before the full moon, and she was actually torn.</p><p>Torn! It was almost like she was dreading her impending escape. Which only proved a steady diet of rich food and amazing sex lowered I.Q. points.</p><p>Every day, he asked her to tell him the truth, promising to let her go if she did.</p><p>And every day, she told him the truth...a lie would have choked her. She hadn't broken their date by choice. She had wanted to see him again. And she almost didn't hate him.</p><p>That one she kept to herself.</p><p>He hadn't tied her up since that first night. And she hadn't tried to attack him.</p><p>Another example of her quickly-lowering I.Q. When they were between the sheets (or in the bathtub, or on the floor in front of the fireplace), the last thing on her mind was leaving. But far more disturbing, when they weren't between the sheets, the last thing on her mind was leaving.</p><p>And it wasn't that she was thinking with her pussy instead of her brain. Well, it wasn't just that. Because to be perfectly honest, what, exactly, was she going back to? To be at Mikey's beck and call? To hang out with a group of people who disapproved of her, then go home to her lonely bed? The pack didn't much want her, and she sure as shit didn't want someone who wasn't pack, someone who was fragile-who would break if she really let loose.</p><p>Dick fit the bill admirably, and he approved of her-to the hilt! He thought everything she did and said was swell. She could have farted on him and he would have rhapsodized about it. In fact, she did...after a particularly strenuous sexual marathon and when she was relaxing in his embrace. Relaxing a little too well, in factshe really cut one. Quick as thought, she pulled the blankets over Dick's head, trapping him with the noxious odor. Cursing, he finally freed himself, and then they both laughed until they cried.</p><p>She rolled over on her back and stared at the ceiling. It was getting rapidly dark in the bedroom; the sun would be down in a few more minutes. She'd adjusted nicely to his schedule, and now slept her days away. Frankly, she preferred his schedule-she'd never been much of an early riser.</p><p>He'd be here any minute. Any minute. She felt a tightening in her stomach and was disgusted with herself. Just thinking about him-about his long fingers and his mouth and his tongue and his cock-was making her wet. Some prisoner. Now she had Stockholm Syndrome. Except it was more like Bimbo Hypnotized By Bad Guy's Huge Cock Syndrome. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And then later he would bring amazing food, and they'd talk about everything and anything. And he'd read to her-they were halfway through Salem's Lot, which he seemed to think was a comedy-while she paced. She liked books but couldn't stand to sit still for the hours and hours required to read one. Or they'd wrestle, and once she'd thrown the leftover apple pie at him and they'd had a food fight that ruined the drapes.</p><p>Jane sighed. If it was just his dick, it wouldn't be so bad. She could always buy a vibrator. No, it was Dick. She really, really liked him. More than any guy she'd ever known, and she knew a lot of fellas. And she was having a helluva time remembering she was a prisoner. In fact, she didn't think Dick remembered much, either.</p><p>* * * *</p> <p>Her vision doubled, trebled...then her knees buckled. Luckily she was bent over the footboard, so she had some support.</p><p>Dick let go of her waist and pulled her back onto the bed. \"That was...sweaty.\"</p><p>Panting lightly, he flopped over on the pillows. \"Jane, your stamina knows no bounds.</p><p>Look at me; I'm actually out of breath. And I don't even need to breathe.\"</p><p>\"My stamina? Look who's talking. We've been at it since-holy shit, the sun's gonna be up in another hour. You'd better beat feet back to the coffin, old man.\"</p> <p>He snorted. \"It's a bed, not a coffin. It's one of the guest beds, in fact. You're in my coffin, so to speak.\"</p><p>\"So why don't you sleep here?\"</p><p>\"I've been thinking about it.\" He propped himself up on one elbow, bent to kiss her shoulder, then said, \"More and more, actually. In the beginning I dared not leave myself at your mercy, but now I wonder.\"</p><p>\"What the hell are you talking about? You take longer to say something than anyone I've ever met.\"</p><p>He didn't smile at her bitching, like he usually did. \"I'd be quite helpless, Janet. If you, ah, decided to be angry, there's nothing I could do until the sun went down. And the tables in here are all made out of wood...so are the chairs. It wouldn't be difficult for someone with your determination to fashion a rudimentary stake.\"</p><p>She'd never thought of that. She couldn't believe she'd never thought of that. \"Oh.\"</p> <p>She mulled it over for a minute, then said, \"Well, I don't especially want to stake you in the guts.\"</p><p>\"The guts I wouldn't mind so much. How about the heart?\"</p><p>She rolled over and rested her chin on his chest. \"There either. I dunno, you're okay.</p><p>When you're not being a total shit. Stay, go, I don't give a fuck.\"</p><p>\"Well, I can hardly turn down such a warm invitation.\" Still, he glanced nervously at the table in the corner before climbing under the covers. \"Ah, well, here goes nothing.</p><p>Climb in next to me.\"</p><p>\"I have chicken grease under my nails,\" she pointed out.</p><p>\"So, we'll take a nice hot shower together later tonight.\"</p> <p>\"Sounds like a date.\" She snuggled in next to him and rested her head on his shoulder. His body was still slightly warm from their earlier exertions and, as she pressed closer to him, remained that way.</p><p>\"Ahhhhh,\" he sighed. \"You're better than my electric blanket.\"</p><p>\"That's the nicest thing anyone's ever said to me. You should write for fuckin' soap operas,\" she grumbled, but inside she was glowing. He was trusting her with his life.</p><p>He knew he was easy prey, and he was going to sleep anyway. It spoke volumes about his true feelings for her...and her status as his \"prisoner\".</p><p>Well, shit, she thought, drifting into sleep. Her palm rested over his heart, which beat once or twice every minute. Maybe there's hope for us after all.</p><p>Chapter Nine</p><p>Richard woke, as he had for the last several decades, just as the sun slipped past the horizon line. He felt Jane's head resting on his shoulder and smiled. A wonderful way to start the evening. And he was warm, so delightfully warm. She was better than a hot tub. He'd have to do something really nice for her for not killing him. Like...let her go?</p><p>He couldn't. He knew it was the right thing to do, knew he had no business keeping her as a sort of mid-sized boy toy, but every time he thought of his condo emptied of her refreshing presence, he wanted to shiver. Hell, he wanted to go for a walk in the sunshine.</p><p>He couldn't even pretend it was about revenge anymore. Even if she had lied, they were square after that first night. No, he was keeping her because he was a selfish monster and he couldn't bear to let her go. To be brutally honest, he was thrilled she was sticking to her story, because it gave him the perfect excuse to keep her.</p><p>The fact that he wasn't pinned to the bed via a table leg through his rib cage spoke well of her feelings for him. He was as hopeful as he'd been in-what year was it? She had her chance for vengeance, and hadn't taken it. And he doubted his lovely Jane was in the habit of passing up a chance to avenge herself. Was it possible she'd forgiven him? That was too unrealistic to believe, but perhaps there was hope. Perhaps-</p><p>\"No! No, God, no...aw, jeez, Bobby!\"</p><p>She was screaming. Screaming in her sleep. He was so startled he nearly jumped off the bed. Never had he heard his Janet so terrified, and so young. She sounded like a teenager.</p><p>\"I didn't-Bobby, don't move, I'll get an ambulance, oh, God, don't die, please don't die!\"</p><p>She was clawing at him in her sleep. He caught her hands and squeezed. \"Jane, love. It's a dream. It's not real.\" Anymore, he added silently. His chest and throat felt tight. Whatever had happened, it had been horrible. Awful enough to scare her away from lovemaking for years and years.</p><p>Her eyes flew open. He was shocked to see them filling, and then her tears spilled over and ran down her cheeks. \"I didn't mean to,\" she sobbed.</p><p>\"Of course you didn't.\"</p><p>\"They told me it wasn't a good idea-that monkeys are fragile-I didn't listen.\" She made a small fist and thumped it against his chest. \"Why didn't I listen? Oh, we were having such fun-it didn't even hurt, and I thought it was supposed to hurt the first time. And then I started to come and I wrapped my legs around his waist and squeezed and-and-\"</p><p>\"Janet, it was an accident.\" Monkeys? Odd slang-he had never been able to keep up with it. Had she broken the boy's ribs? Had they been in a precarious position, and had fallen, and perhaps the boy had...? Well. Whatever had happened, he was thoroughly certain of one thing. \"You didn't mean to hurt him, Jane. You never would have hurt him. You've got to let this go.\" He was stroking her back while he soothed her and she finally relaxed against him. He added jokingly, hoping to see a scowl, \"Besides, you don't need to worry about such things with me. You could set me on fire while you were having your way with me, and I'd be fine the next day. Before you ask, though, I'm really not into that.\"</p><p>She jerked up on one elbow and stared at him. Her eyes were smudged with tears, bloodshot, and enormous. He thought she'd never looked so pretty. \"That's right,\" she said slowly. \"I was thinking about that last night and you...I can't hurt you. You can take whatever I dish out.\"</p><p>\"And have been,\" he added, \"for several days now. See, look!\" He showed her his arm where, in her agitation, she'd clawed off ribbons of skin. It was nearly healed.</p><p>Oddly, she was still staring at him as if she'd never seen him before. \"I don't know why I didn't think of it before, Dick.\"</p><p>\"You've had other things on your mind. Now, that's enough crying over a fifteen year-old accident you couldn't help,\" he said briskly, hoping she agreed. He couldn't bear to see her cry. He rolled out of bed and stood up, casting about for a way to distract her. \"How about sushi and maybe some vegetable tempura for breakfast?\"</p><p>She perked up immediately. \"I like raw fish,\" she said. \"I like steak tartare, too, but I like it better with steak, not hamburger.\"</p><p>\"Sounds like we have lunch figured out, too, m'love.\"</p><p>\"But first we have to shower,\" she said, almost shyly.</p><p>He laughed, bent to her, picked her up, and kissed her. \"Yes indeed. You are filthy.</p><p>And so am I. I foresee lots of scrubbing in our future.\"</p><p>\"Fucking pervert,\" she snorted, and he cheered inwardly, knowing she was back to herself.</p><p>* * * *</p><p>For the second night in a row, Richard woke up warm and content. He had made up his mind as dawn broke in the wee hours of the morning, as Janet cuddled up to him and snored softly in his ear. Today they would go out. He'd take her shopping and buy her a ridiculous amount of clothes. Clothes, lingerie, priceless paintings, pounds of steak tartare-whatever she wanted. He knew in his heart she wouldn't run away from him, and it was past time he let her out of his bedroom. She had been admirably patient, and it was time for a reward.</p><p>He stretched. He didn't really need to-he always woke energized and hungry and raring to go-but enjoyed the sensation. Yes, they would go shopping and she would bully the sales clerks and it would be delightful. Then back to his place for a light lunch and some energetic lovemaking, and possibly a nap, or more of Salem's Lot. Yes, it was all- </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Where the hell was Janet?</p><p>He'd been groping absently for her while he'd been thinking, but she wasn't in his bed, and the bathroom light was off. He could hear her on the floor, gasping in-pain?</p><p>Was that pain?</p> <p>In the second before he looked, it seemed like every malady mortals were prone to raced through his brain. She had appendicitis. He'd knocked her up (it was supposed to be impossible, but who really knew?) and she was having a miscarriage. She was having a heart attack. A brain embolism. A kidney shutdown. God help him, he was as afraid to look as he was afraid not to.</p><p>He looked. Janet was on her knees beside the bed, panting harshly, and her back-it almost looked like the knobs of her spine were moving. Her hair was hanging in her face in sweaty tangles, and her nails were sunk into the carpet. His feet hit the floor with a double thud and he reached for her. \"Janet, I'm getting a doctor. I'll be right-\"</p><p>A low, ripping growl froze his hand in mid-reach. And then-so fast, it was so quick, he blinked and it was done-she sprouted hair and her nose turned into a long snout and her eyes went wild and she was leaping for the door.</p><p>She bounced off it, but he was alarmed to see it actually shudder in its frame. She coiled and leapt again. And again. He remained sitting on the bed-he was afraid if he stood he would fall-and stared at her. Janet was a dun-colored wolf with silver streaks running down her back. Her eyes were the same color as when she was a biped, but now they were glittery and homicidal. He remembered how she paced when he read, how she couldn't seem to sit still for long, and realized that in this form she was claustrophobic.</p><p>Chunks of the door were leaping off the frame and falling to the carpet each time her body hit the door, but at this rate it would take at least ten minutes and she was likely to damage herself. He got up and walked to the door on legs stiff with shock, fumbled with the lock, dropped his key twice (all the while dodging her small wolf's body-she never stopped, she completely ignored him, he doubted he was even a cipher to her now), and finally swung the door open.</p> <p>He ran after her to do it again, and again. Then she spotted the bank of windows facing west and lunged toward them. He dived, and managed to catch her back left leg just as she was coiling for a leap that would take her through the window. She spun and he had a dizzying glimpse of what looked like a thousand sharp teeth as she growled.</p><p>\"We're three stories up,\" he panted, clutching her while at the same time trying not to break her leg. \"You'll never survive the fall. Well, you might but-Janet, don't go!\"</p><p>She snapped at his fingers. Wrathful growls bubbled up out of her without pause, or breath.</p><p>\"Please don't leave! I was wrong and you were right-God, you were so right, I was a blind fool not to see it. Please don't leave me.\"</p><p>She snapped again, her jaws closing about a centimeter from his flesh. A warning.</p><p>Probably her last warning.</p> <p>\"I can't bear it without you. I swear I can't. I thought I was content before but it was a lie, everything was a lie, even why I was keeping you was a lie...\"</p><p>His grip was slipping. He talked faster.</p><p>\"...but you were right, and you never lied, not once, not even to get away, and Janet, I will spend the rest of your life making it up to you...\"</p><p>She was almost free, and he was afraid if he let go to get a better grip, he wouldn't be fast enough.</p><p>\"...but please...don't...go!\"</p><p>She went.</p><p>He lay on the floor in his study a very long time. It seemed too much work to get up, find the broom, and start sweeping up the broken glass. He owned the building anyway, so who cared? Who cared about anything?</p><p>He couldn't believe she was gone. He couldn't believe he-who prided himself on possessing at least a modicum of intelligence-had let this happen.</p> <p>My name is Janet Lupo.</p><p>Had done such things, and to such a woman.</p><p>I'm not afraid of any man, and I don't lie.</p><p>What had he been thinking?</p><p>My name is Janet Lupo.</p><p>How could he have been so blind?</p><p>My name is Janet Lupo.</p><p>So stupid and arrogant?</p><p>The full moon is eight days away. And when it comes, you're going to get a big fucking surprise.</p><p>Oh, if there was a God this was a fine joke indeed. He had finally found the one woman he could spend eternity with...</p><p>Your little oak doors won't hold me then.</p><p>...and he had kidnapped her and raped her and kept her and ignored her when she spoke the truth.</p><p>You'll realize you fucked up, bad.</p><p>He'd demanded she admit to being afraid of him, and when she wouldn't, he assumed it was a lie.</p><p>You'll know I was telling the truth the whole time, but you couldn't see past your stupid injured male pride.</p><p>His stupid injured male pride.</p><p>I'll be gone forever, and you'll have the next hundred years to realize what an asshole you were.</p><p>He would have cried, but he had no tears.</p><p>Chapter Ten</p><p>Three days later</p><p>Jane rolled over and stretched. Then shrieked in anger as she fell three feet and hit the cement with a smack. She'd curled up on the base of the statue in Park Square, promptly gone to sleep, then forgotten about the drop when she woke up. Why don't I ever remember this shit until it's too late? she thought, rubbing her skinned elbow.</p><p>She was pleasantly tired, and would be for the next couple of days. It was always like that when she chased the moon. She also felt very new, almost husked out.</p><p>Purified. Whatever.</p><p>She stood, and shivered. Step one: find clothes. Spring in Boston was like spring in Siberia.</p><p>She marched up to an early-morning commuter, a businessman obviously cutting through the park to get to the subway. He stared at her appreciatively as she approached, but she had eyes only for his cashmere topcoat. \"How-\" was all he had time for before she belted him in the jaw and mugged him.</p><p>She had made her choice as a wolf, and would carry it out as a woman. She didn't have to wake up in the park, naked and alone. Or yesterday, in an alley. Or the night before that, beneath the docks by the harbor-ugh. She didn't think she'd ever get the smell out of her hair.</p><p>There were only a hundred safe-houses in Boston, as well as acres and acres of woods owned by pack members. She could have romped there and woken to clean clothes and a hearty breakfast. But as a wolf she had avoided all those places and her kind. The beast knew what she wanted. Now it was time to get it.</p><p>Of course, she didn't know where Dick lived, exactly. It's not like she scribbled down the address with her paw on her way out the window. Luckily, there were ways and ways. She might not have a super nose like some of her kind, but the day she couldn't sniff up her own backtrail to a den was the day she'd jump off a fucking bridge.</p><p>It didn't take long, but her feet were freezing by the time she got there. Dick lived in a dignified brownstone condo that was probably built the year the Mayflower landed.</p><p>She shifted her weight back and forth, stuck her hands in her stolen pockets, and looked up at his window. The glass hadn't been replaced; there was a large piece of cardboard taped into the frame instead. Guess it took time to order that fancy old-fashioned stuff.</p><p>Except for the rumble of an early morning delivery truck, the street was quiet.</p><p>\"'Scuse me. D'you live here?\"</p><p>She looked. The delivery boy was holding three brimming grocery bags, and looking glum. \"Yeah. Why?\"</p><p>\"Well, thank God. 'Cause I've been making deliveries for two weeks, but the last couple days nobody ever takes the food in, and it goes bad or gets swiped, and it's just a waste, is all.\"</p><p>Ah, so that's where all the sumptuous feasts came from! Dick had the food delivered, and cooked the meals for her. Yum. \"I was gone for a while,\" she told him,</p><p>\"but now I'm back.\"</p><p>\"Who are you?\"</p><p>\"I'm the owner's fiancée.\" She shook her head. It sounded just as weird out loud as it did in her head. \"Do I have to sign something?\"</p><p>\"No. He's got an account with us.\"</p><p>\"Then get lost.\"</p><p>\"Nice!\" But he set the bags down, slouched back to his truck, and pulled into traffic without looking, in typical Boston fashion. Which was good, because it wouldn't do for him to watch her break into the house.</p><p>\"Well, shit.\" That had been considerably easier said than done! Dick's front door wouldn't budge, and she was reluctant to break more of that expensive glass. He might not be so thrilled she came back. She had a vague memory of him grabbing her and begging her not to go, but it was more like a dream. She didn't trust her wolf-brain to factually interpret human emotions.</p><p>She smacked herself on the forehead. Dummy! Why was she trying to see him in the daytime? Even if she got in, he wouldn't exactly be a thrilling conversationalist. He'd be holed up in his bedroom, dead to the world-literally. Until then, she might as well chat with a rock. Still, it would have been nice to swipe some clothes.</p><p>Oh, well. The coat was plenty warm enough, and she didn't give a fuck how many people stared at her feet. At least she was in a big city, instead of some rinky-dinky small town...the yokels always loved something new to gawp at. She just had to kill another ten hours until the sun set. Thank God for the Barnes &amp; Noble café.</p><p>Chapter Eleven</p><p>Richard slumped in the chair beside the fireplace. He'd been sitting in this room every evening since Jane had left. It had been the last place he'd seen her.</p><p>He was starving, and didn't care. He deserved to go hungry. And the thought of leaving-of perhaps missing her if she came back-was unbearable. What if she was hurt? What if she needed something and he was out assuaging his thirst?</p><p>Who are you kidding? She's gone, fool. You did everything but toss her out the window yourself.</p><p>True enough. Still, he waited. It was the only thing he could do. He'd never insult her by trying to find her and convince her to return. Return to what? An unnatural existence with a monster? And what in the world could he ever say to her? \"Janet, dear, sorry about kidnapping you and raping you and keeping you and all but calling you a liar to your face, kiss-kiss, let's go home.\" As the lady herself might say, \"In a fuckin' pig's eye.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Dick! Stop with the fucking sulking and open the front door!\"</p><p>Oh, Christ, now his inner voice sounded like her. Bad enough he was starving, but it appeared he was slowly going insane as well.</p><p>\"You son of a bitch! You piece of shit! I trot my ass all the way back down heretwice!-and you keep me standing out here on this freezing sidewalk?\"</p> <p>He buried his face in his hands. How he missed her!</p><p>\"I am going to rip your heart out and pin it to the bedroom wall with a swizzle stick! I'm going to yank the fixtures out of that stupid bathroom you're so proud of and shove them up your ass!\" Wham! Wham! Wham! \"Now let me in before I lose my temper!\"</p><p>That's no inner voice, Richard. I ought to know...I'm your inner voice.</p><p>He jumped up so quickly his head actually banged into the ceiling. He barely felt it.</p><p>He clawed for the doorway, raced through it and down the hall, down three flights of stairs, fumbled for the bolts and locks, and flung the door open.</p> <p>Janet stood on his front step, flushed and out of breath. Her little fists were red from the cold, and from banging his door. She was wearing a man's overcoat roughly six sizes too big for her, and three large grocery bags were at her feet. She was scowling.</p><p>\"Well, finally. Don't sulk on my time, all right, pal?\" She stomped past him.</p><p>Like a zombie, he picked up the groceries, then slowly turned and followed her. She shrugged out of the coat and headed straight for their-for his room. He watched her naked form sway back and forth as she went up the stairs like she owned them. \"Food,\" she said over her shoulder on her way up. \"I could eat a cow. In fact, I think I did, night before last.\"</p><p>By the time he brought her tray to the bedroom, she had showered and toweled off.</p><p>She strolled out of the bathroom and sniffed appreciatively. \"Oooh, yeah, that's the stuff. I could eat two steaks.\"</p><p>\"They're both for you,\" he said automatically. \"Why...how...why...?\"</p> <p>\"You sounded a lot brighter when you thought I was a liar.\" She brushed past him and jumped for the bed, landing in the middle, lolling like a queen, and favoring him with a smirk. \"Ah, the mileage I'm gonna get out of this. Let's start with your whole smug speech about how just because you're a vampire, there's no such thing as werewolves. That sound like a good place to you?\"</p><p>\"Janet-\"</p><p>\"Or we could touch on why it's not a good idea to kidnap people when they're on their way to an important meeting.\"</p><p>\"Janet-\"</p><p>\"Or we could go into all the times you asked me to tell the truth, and I did, and then you didn't believe me, and then you-\"</p><p>He fell to his knees beside the bed. He had to grit his teeth for a few seconds to keep his jaw from trembling. \"Janet, why are you here? Why aren't you with your family?\"</p><p>His voice was rising, but he was helpless to stop it. \"Why didn't you head for the road and keep going? Why are you back?\"</p><p>She frowned. \"You're taking the fun all out of this. I've been looking forward to it for days. I need to see some major-ass groveling, pal.\"</p> <p>He didn't speak.</p><p>She sighed. \"What, I gotta get out the hand puppets? You haven't figured it out?</p><p>Dick, you're my family now. I never want to go back there. Cape Cod in the summeryech! Tourists cluttering up the roads, the beaches, and the mall-and you get in trouble if you eat them. Can't even take a little bite to discourage them from coming back...\"</p><p>\"Janet.\"</p><p>\"I'm serious! Anyway, if I stay with you, I don't have to go back. I didn't realize how unhappy I was with them until I fell in with you. I'm not pack anymore, I'm yours. I mean-if you want.\"</p><p>\"Is this a joke?\" he almost whispered. \"Is it a trick to get even? Because while I wouldn't blame you-\"</p><p>\"Oh, hey, I'm a bitch, but I'm not, like, a sociopath! That'd be a rotten thing to do. I love you, you stupid fuck. I'm not going anywhere. Except, of course, for a few days a month. Think you can put up with that, you undead dope?\"</p><p>\"I've been waiting almost a hundred years to hear those words. Well, not those exact words.\" He reached out and pulled her down onto his lap. They sat on the floor while she cuddled into him like a bad-tempered doll. \"Oh, Janet. I missed you so much.</p><p>And I was such a fool.\"</p><p>\"Yeah, a real arrogant asshole.\"</p><p>\"Yes.\"</p><p>\"Completely unreasonable and jerkish.\"</p><p>\"And then some.\"</p><p>\"And you're really, really sorry.\"</p><p>\"So unbelievably sorry.\"</p><p>\"And totally unworthy of me.\"</p><p>\"In a thousand ways.\"</p><p>\"And you're gonna buy lots of food and get a house in the country so I don't have to hunt in the city.\"</p><p>\"The refrigerator is full and I already have a house in the Berkshires.\"</p><p>\"Then that's all right,\" she said, sounding quite satisfied. She stretched her legs out and wiggled her toes. \"Um...the steaks are getting cold.\"</p><p>\"So am I.\"</p><p>She giggled and turned so she was straddling him, then hooked her ankles behind his waist and kissed him on the mouth. Slowly, she cupped the back of his neck and brought his mouth to her throat. \"Hungry?\" she purred.</p><p>He thought he would have a seizure. She had come back-she loved him-she would stay-and now she was freely offering him blood. Soon the Palestinians and the Israelis would make peace, and Janet would willingly enroll in charm school.</p><p>He sank his fangs into her throat without hesitation-he couldn't have held back if he tried. He could feel her breasts pressing against his chest while her blood warmed him from the inside out. She was wriggling against him-now her fingers were at his zipper-now her warm little hand was inside his trousers, clasping him, stroking him.</p><p>He groaned against her throat.</p><p>\"You did miss me!\" She shoved him back and he was happy enough to lie down for her. He stopped feeding and licked the bite mark. Her glorious breasts were jiggling in his face and he couldn't recall ever being happier, not once in his long, long life.</p><p>She seized his cock with delightful firmness and raised herself above him. His arms went around her waist as he guided her to him.</p><p>Entering her was like slipping into luxurious oil. Her head tipped back and she said</p><p>\"Ummmmm...that's good, I missed that,\" to the ceiling.</p><p>He stroked her breasts, running his fingers over her firm nipples, marveling at the softness of her skin in contrast with her strength and stamina. She'd jumped three stories and there wasn't a mark on her-and he was certainly looking! Not a bruise, not a scratch. She healed almost as quickly as he did.</p><p>\"You're gorgeous,\" he said.</p><p>\"You're just saying that to get laid,\" she teased.</p><p>\"In case you haven't noticed, I am getting laid.\"</p><p>She snorted, then began to rock back and forth. He noticed an odd, sudden reticence about her and wondered about it-then suddenly realized she had likely been on top when she crippled her first lover.</p><p>\"For heaven's sakes,\" he said with mock disgust, \"can't you go any faster than that?</p><p>Any harder? I'm about to fall asleep down here.\"</p><p>She was so astonished she nearly fell off him. Then she made the connection and smirked. \"Okey-dokey, dead guy. Here we go.\"</p><p>They ruined the carpet. They didn't care. Toward the end, she was screaming at the ceiling and he could feel his spine cracking-and didn't care. Her legs were around his waist in a crushing grip, her arms around his neck, cutting off his air-and he wanted more. He told her so, insisted on it, demanded it, then bit her ear. He could actually feel the temperature change within her as she reached orgasm, felt her uterus tightening around his shaft. That was enough to tip him dizzily over the edge.</p><p>They weren't able to speak for several minutes, until Janet finally managed, \"Oh, cripes, I think that should be against the law.\"</p><p>\"It probably is, in at least three states.\"</p><p>\"My supper's cold,\" she complained, making no move to stand up and get the tray.</p><p>\"So, I've got a microwave. Why did I even cook it? I doubt you'd have minded it raw. A werewolf,\" he mused, stroking her thigh. \"Even after I saw the truth with my own eyes, I could hardly believe it.\"</p><p>\"That's because you're kind of a dumb-ass sometimes.\"</p><p>\"I have to take this from a foul-mouthed tart like you?\"</p><p>She pounced on him, nibbled his throat. \"I'm your foul-mouthed tart, so there.\"</p><p>\"Excellent.\" He kissed her nose. \"So...how do you feel about being an undead werewolf?\"</p><p>She groaned. \"Let's talk about it in ten years, all right? Let me get used to the idea of not being pack anymore first.\"</p><p>\"It's a date. Will they come after you?\"</p><p>\"I have no idea. No one's ever voluntarily left before. I doubt the boss would really mind-he's softened up since he got hitched-but I s'pose I should tell them I'm not dead.\"</p><p>\"Tomorrow.\"</p><p>\"Yeah. Tomorrow.\"</p><p>\"We've made our own pack, Jane. We're two monsters who do as they like, when they like. Everyone else had best stay out of our way.\"</p><p>\"Ooooh, God, I love it when you talk like that...\"</p><p>\"How about when I do this?\" He leaned down and nibbled on her impudent nipple, running his tongue over the velvety bumps of her areola.</p><p>\"Oh, God.\"</p><p>\"Or this?\" He sucked hard, and nipped her very, very lightly.</p><p>\"Ummmmm...\"</p><p>\"I love you.\"</p><p>\"Ummmm. Me too. Don't stop.\"</p><p>He laughed and bent to her warm, lush flesh. \"Not for a hundred years, at least.\"</p><p>\"We'll figure something out.\"</p><p>Epilogue</p><p>From the private papers of Richard Will, Ten Beacon Hill, Boston, Massachusetts.</p><p>\"I'm in love! No entries of late-too busy. Too much to do just to keep up with my lovely monster. She's everything I ever wanted and, even better, I appear to be everything she ever wanted. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"No more time to write today-we're breaking in a new chef. He's used to catering large office functions, so he should be able to keep Janet satisfied.</p><p>\"I suppose I'll give up this journal very soon. I realize now I wrote in it as a way to stave off my loneliness. No need for such distracting tricks any longer.</p><p>\"Must go-my bride has just playfully tossed a marble bust at my head to get my attention. I think I'll chase her down and spank her.\"</p> <p>There’s No Such Thing As A Werewolf</p><p>By MaryJanice Davidson</p><p>CHAPTER ONE</p><p>As any werewolf knows, smells and emotions and even raised voices have colors and texture. And as any blind werewolf knows—not that there were any besides him, to the best of his knowledge—you could take those smells, emotions, and conversations and do a pretty good job of seeing. Not a great job, comparably speaking, but enough to get around. Enough to have a solid sense of the world.</p><p>“But I can’t be pregnant,” Mrs. Dane was saying. “There’s just no way.”</p> <p>“There’s at least one way.”</p><p>“But I’m infertile! The clinic said!”</p><p>“Accidents happen,” he said cheerfully. He knew she was stunned, but pleased. And as soon as the shock wore off, she’d be ecstatic. He could have told her that her fallopian tubes had managed to unblock themselves over the years, but that would raise awkward questions. After all, he was just her G.P. He wasn’t treating her for infertility.</p><p>“I’d say you’re...” Thirty-nine and a half days along “...about six weeks pregnant. I’m going to write you a scrip for some pre-natal vitamins, and I want you to take two a day. And the usual blandishments, of course, ease off on alcohol, don’t smoke, blah-blah-blah. You know all this.” Mrs. Dane was an OB nurse.</p><p>“Yeah, but...I never thought I’d need it.”</p><p>He heard her weight shift as she slid off the table, and thus was ready for it when she flung her chubby arms around him in a strangler’s grip. “Thanks so much!” she whispered fiercely. “Thank you!”</p> <p>“Mrs. Dane, I didn’t do anything.” He gently extricated himself from her grip. “Go home and thank your husband.”</p><p>“Oh, I’m sorry.” Now she was brighter in his mind’s eye, glowing with embarrassment. “I read somewhere that blind people don’t like it when their balance is thrown off.”</p><p>“Don’t worry about it. You couldn’t throw off my balance.” Not without a truck. “Don’t forget to fill this on the way home,” he added. He could write perfectly well, which was to say his prescriptions didn’t look any less legible than a seeing doctor’s.</p><p>“Right. Right!” She darted around him, nearly careened into the closed door, and left without her clothes. The gown flapped once as the door closed behind her.</p><p>“I don’t think they’ll let you in the pharmacy dressed like that,” he called after her.</p><p>“I’m just saying you should think about it,” his nurse, Barb Robinson, argued. “I hate the thought of you going home to an empty house every night. And it would—you know. Be helpful.”</p><p>“Put a harness around a dog and expect it to lead me around all day?” He tried not to sound as aghast as he felt. “That’s awful!”</p><p>“Drake, be reasonable. You get around fine, but you’re not a kid anymore.”</p> <p>“Meaning, since I’m looking at the big four-oh, it’s time to check out nursing home brochures?”</p><p>Barb’s scent shifted—it had been lemony and intense before, because while she was embarrassed to broach the subject, she was also determined. Now, as she got annoyed, it intensified until she damned near smelled like mouthwash.</p><p>“Very funny,” she snapped. “Pride’s one thing. Your safety is another. For crying out loud, you don’t even use your cane most of the time.”</p><p>“Will it get you off my back if I start lugging the stick around?”</p><p>“Yes,” she said promptly.</p><p>Oh, for God’s sake . “Fine. You may now refer to me as Dr. Stick.”</p><p>“It’s just that I don’t want you to get hurt, is all,” she persisted. “You bugged me about moving to a safer neighborhood.”</p><p>“Repeatedly?”</p><p>“Oh, hush up. And you’d better get going—isn’t tonight another one of your big nights out?”</p><p>You could say that. “It is indeed.”</p><p>“Well...maybe you should take it easy. You look kind of worn out today.”</p><p>“I was up late,” he said shortly. “Give me the damned cane.”</p><p>He heard her rummaging around beneath the counter, and then she tapped the floor in front of him. He snatched it out of her hand. “There, satisfied?”</p><p>“For now.”</p><p>“Also, you’re fired.”</p><p>“Ha!”</p><p>“Maybe next time.” He obediently started tapping his way to the front door, though he knew perfectly well it was eight feet, nine inches away. “See you Monday.”</p><p>“And think about the dog!” she yelled after him.</p><p>“Not likely,” he muttered under his breath.</p><p>CHAPTER TWO</p><p>The small gang—two boys and one girl, not one of them out of their teens— followed him off the subway. Typical thugs; they needed reinforcements to rob a blind man. He led them down Milk Street and let them get close.</p><p>“Just so you know,” he said, turning, “in about half an hour the moon will be up. So this is a very, very bad idea. I mean—” They rushed him, and his stick caught the first one in the throat. “—it’s a bad idea in general. There are only about a thousand—” His elbow clocked down on the skull of the second. “— more respectable ways to make a living.”</p><p>He hesitated with the girl, and nearly got his cheek sliced open for his trouble. He pulled his head back, heard the whisper of steel slide past his face, then grabbed her wrist and pulled, checking his force at the last moment. She flew past him and smacked into the brick wall, then flopped to the ground like a puppet with her strings cut. “Seriously,” he told the dazed, semi-conscious youths. “You should think about it. And what are you up to?”</p><p>“Nothing,” the other werewolf said cheerfully. “Just came down to see if you needed a hand. Christ, when was the last time these three had a bath?”</p><p>“About two weeks ago.”</p><p>“How’s it going, Drake?”</p><p>“It’s going like it always does,” he said carefully. He had known Wade when they were younger, but it paid to be careful around Pack.</p><p>He held out his hand and felt it engulfed by the younger man, who smelled like wood smoke and fried trout. Drake was a large man, but Wade had three inches and twenty pounds on him. If he wasn’t such a pussycat, he’d be terrifying. “Still keeping to your place in the country?”</p><p>“Sure. This city is fucking rank, man. I only came in to stock up. The day got away from me.”</p><p>“Try not to eat any of the populace.”</p><p>“Yuck! Have you seen what they eat? I wouldn’t chew a monkey on a bet.”</p><p>“That’s not nice,” Drake said mildly.</p><p>“Yeah, yeah, pardon my un-fucking PC behavior. Humans, okay, and never mind what they originated from. No, really! They should be proud to be shaved apes.”</p><p>“Tsk.”</p><p>“Hey, I’m glad I ran into you. You should head out to the Cape, say hi to the boss and Moira and those guys. Did you hear Moira got hitched?”</p><p>“I did, yes. To a monkey, right?”</p><p>“Yeah, well...” Wade stretched; Drake could hear his tendons creaking and lengthening. Their change was very close. Luckily, adolescence was far behind them both; they would stay well in control. “The new alpha gal, Jeannie, she heard about...uh...she noticed that none of the Pack...uh...”</p><p>“Was cursed with a devastating handicap?” he asked pleasantly. He tapped his cane for emphasis.</p><p>Wade coughed. “Anyway, she hit the fucking roof when Michael told her the score, and they pissed and moaned about it for, like, a damn month, during which time our fearless leader was so not getting laid, and finally Michael said it wasn’t an automatic, it would be up to the parents, and they both had to agree.”</p><p>Drake was silent. For the Pack, this was forward thinking indeed. Handicaps were so rare they were nearly unheard of, and when a Pack member was born blind, or deaf, or whatever, it had been tradition since time out of mind that the sire killed the cub. The dam was usually too weak from whelping, but was almost always in agreement.</p><p>His</p><p>sire, however, had died in Challenge before his birth, and his mother had wanted him. Had hidden him away at the time so the well-meaning Pack leader, Michael’s father, couldn’t find him and kill him. Had raised him defiantly and heartlessly—absolutely no quarter given, or asked.</p><p>Drake had eventually left the Pack on his own, made his way to Boston, made a life among humans. Here, at least, he could hold his own. Humans didn’t care about Challenges. They didn’t even know about them.</p><p>“Well, maybe I will pay them a visit,” he lied. “It’s been a long time.” Michael hadn’t even been pack leader when he’d left...Moira had been a precocious brat, one of the few who’d tried to talk him out of leaving.</p><p>No. Done was done.</p><p>“A long time?” Wade was saying. “Yeah, like about twenty years. It’s a little different now. Michael’s a modern dude. No one will fuck with you.”</p><p>“Thanks for passing on the news. But I didn’t leave because I was afraid of</p><p>being fucked with.”</p><p>“You did win all your Challenges,” Wade admitted.</p><p>“I left because I was never allowed to be myself.”</p><p>“You think you’re allowed that here? In Monkey Central?”</p><p>He shrugged. Loneliness was such a central factor of his life, he barely </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>recognized it anymore. “It doesn’t matter.”</p><p>“Well, think it over. I know Jeannie’d like to meet you. If nothing else, to be proved right. She lives for that shit.” This was said in a tone of grudging admiration.</p><p>“We’ll see.”</p> <p>Drake heard Wade inhale, and stretch again. “Fine, be a stubborn ass, I don’t care. Better beat feet out of here. Gonna be a long one. Last night of the full</p><p>moon.”</p><p>“Happy trails,” he said dryly. “Again, try not to eat anyone.”</p><p>“Again,” the larger man said, loping off, “don’t make me puke. Company</p><p>coming.”</p> <p>“Yes, I—” He nearly fell down, right there in the alley. “I know.”</p><p>“Jeez,” the girl said, coming closer. She glanced over her shoulder at the rapidly retreating Wade, then turned and glared at the unconscious gang. “You gigantic losers!”</p><p>Everything was suddenly very bright, very sharp. The exhalations of the would-be attackers, Wade’s retreating footsteps, the girl’s perfume—L’Occitane Green Tea.</p><p>He could see her.</p><p>Not sense her, not get an idea of where she was and how she felt by her voice. See her. Everything around her was shades of gray, but she stood out like a beacon.</p><p>She was short—her head stopped right around the middle of his chest. And her hair was that light, sunny color he assumed people meant when they said blonde. Her eyes were an odd color...not blue like ice was blue, and not purple like people had described irises...somewhere in between.</p> <p>Her hair was brutally short and so were her nails. She was wearing six earrings in her left ear, and eight in her right. She had a nose ring, a hoop through her left eyebrow, and her shirt was short enough to show off the bellybutton ring. Her stomach was sweetly rounded, and she was wearing shorts so brief they were practically denim panties. Her black tights were strategically ripped, showing flashes of creamy skin. Her tennis shoes (what color was that? Red? Orange?) were loosely tied with laces that weren’t any color at all.</p><p>“Are you all right, guy? I’m really sorry if they tried anything. I told them to cut the shit. I didn’t think they, y’know, meant it.”</p><p>He gaped at her.</p><p>“Oh, sorry,” she said, glancing at the cane. “I didn’t realize. Do you need me</p><p>to walk you somewhere? Did they hurt you?”</p><p>“I can see you!”</p><p>“Ooooookey-dokey.” She took a cautious step backward. “Listen, I’ve got</p><p>stuff to do tonight—last chance. D’you need me to call you a cab or something?”</p> <p>“Holy Mary Mother of God!”</p><p>“So, no. Well, ‘bye.” She turned, and, frozen, he watched her walk away. Her butt was flat, and she hitched up her shorts, which gaped around her waist. He couldn’t begin to imagine her age—twenty-two? Twenty-five? He had at least fifteen years on her.</p><p>He heard a crack, and dropped the cane—he’d been gripping it too hard, and it had split down the middle. Why could he see her? Why now? Was it a function of the full moon? If so, why hadn’t it ever happened before? Who was she? And where was she going in such a hurry?</p><p>The clouds scudded past the moon, and suddenly he had twice as many teeth.</p><p>CHAPTER THREE</p><p>Crescent stood on the rooftop and stared down at the street. It wasn’t so far. One measly story. Shoot, people fell that far all the time and survived...mostly...and besides, she wasn’t a regular person. Probably.</p><p>If she was ever going to fly, now was the time.</p><p>She put her hands on the ledge and started to boost herself up, when she felt a sharp tug on the seat of her shorts and went flying backward. She hit the gravel rooftop and all the breath whooshed out of her lungs. So she lay there and gasped like a fish out of water, and when she was able, rolled over on her knees.</p><p>The largest wolf she had ever seen was sitting three feet away. She was too startled to be frightened. And he wasn’t growling or biting, just staring at her in the moonlight.</p><p>A dog she could almost understand, even here, in the middle of the city. But a wolf? Where had it come from? Did it escape from a zoo? And how did it get up on the roof? Could wolves climb fire escapes? Was there a fire escape?</p><p>If she spread her fingers as wide as she could, its paws were just about that size. And its head was almost twice as wide as hers, with deep, almost intelligent brown eyes. His fur was a rich, chocolate brown shot with silver strands, and when the breeze ruffled its pelt, the wolf looked noble...almost kingly.</p><p>“What’d you do that for?” she asked the wolf. “If I want an animal biting my butt, I’ll start dating again.”</p><p>It stared at her. She supposed she should have been scared, but had no sense of menace from it.</p><p>“All the better to see you with, my dear,” she muttered. “Now you stay here. I have to do something.” She got up, brushed the dust off her knees, and started for the ledge. She got about a step and a half when she heard a warning growl behind her. She threw up her hands and spun around. “Jeez, what are you? Why are you picking on me? And why do you care? Look, I won’t get hurt. I can fly. I mean, I’m pretty sure. And if I’m wrong—but I don’t think I am—it’s only one</p><p>story.”</p><p>Nope. The wolf wasn’t buying it.</p><p>“Well, hell,” she said, and sat down cross-legged.</p><p>It had been a long day, and a longer night. Almost before she knew it, she</p><p>was tipping sideways. The gravel was probably cutting her cheek, but it felt like the softest of down pillows.</p><p>She slept.</p><p>CHAPTER FOUR</p><p>She was stiff, and freezing, and someone was shaking her by the shoulder. What the hell had happened to her cot?</p><p>She opened her eyes to see a man down on one knee beside her. And, hello! Not bad for an old guy. He looked to be in his mid-thirties, and had great dark eyes, brown hair touched with gray, and smile lines bracketing his mouth. His shoulders, in the dark suit and greatcoat he wore, were impossibly broad. His thighs were almost as big around as her waist, and he was crouching over her like a dark angel. It was a little disturbing, but kind of cool.</p><p>“Good morning.” His voice was deep, pleasant. He probably worked in radio. “Are you all right?”</p><p>“Sure,” she said, but she groaned when she sat up. “I can’t believe I fell asleep up here.” She brushed gravel off her cheek and looked around. The wolf was gone, thank goodness. “Oh, shit! I never got to—never mind.”</p><p>“What are you doing up here?”</p><p>“Mind your own beeswax,” she said. “You can go now.”</p><p>“You don’t seem suicidal,” he commented.</p><p>“I’m not!”</p><p>“Then why are you up on a roof?”</p><p>“You’ll laugh at me.”</p><p>“Doubtful.”</p><p>“Also, it’s none of your business.”</p><p>“Well,” he said pleasantly, “I’m not leaving you up here by yourself. So you might as well tell me.” “Dammit!” What was going on? First the gang decided to be dumb (dumber than usual, anyway,) then a weird-ass giant wolf tormented her, and now this guy. God hated her is what it was. “Fine, I’ll tell. I’m pretty sure I can fly. I’ve felt I could all my life. It sort of—runs in my family. Except my family’s all dead, so I never really knew for sure for sure, y’know? So, anyway, last night I finally screwed up the courage to try, but I couldn’t because—never mind, you’ll think I’m a nut-job. More so than now, I mean. Anyway, that’s why I’m up here. Not to die. To fly.” “Mmmm.” He put a big hand on her face and peered at her pupils. “Well, you’re not on drugs. That’s something.”</p><p>“I quit doing drugs when I was seventeen,” she snapped, and batted his hand away. “I’ve been clean for ages.”</p><p>“And you’re not terminally ill,” he finished.</p><p>“How d’you know that?”</p><p>“I’m a doctor, it’s my job to know.”</p><p>“What, did you do a blood test in my sleep?”</p><p>He ignored that. “What’s your name?”</p><p>“Why do you care?”</p><p>He looked at her soberly. “I care.”</p><p>Weird. But cool. Okay, fine. “It’s Crescent.”</p><p>“That’s it?”</p><p>“No, I have a last name, but I’m not telling.”</p><p>“Why? Are you a fugitive?”</p><p>“I wish. It’s just that everybody laughs. You’ll laugh.”</p><p>He raised his hand, palm out. “I promise I won’t laugh.”</p><p>“It’s Muhn.”</p><p>“Crescent Moon?”</p><p>“The h,” she said with as much dignity as she could, “is silent.”</p><p>“That’s all right,” he told her. “My last name is Dragon.”</p><p>“Doctor Dragon?”</p><p>“Doctor Drake Dragon.”</p><p>“Oh dear.” She giggled. “We’re both cartoons.”</p><p>“You realize, of course, that we must get married.” He said this with a perfectly straight face, which made her laugh harder.</p><p>“It’s just too good a story to tell our grandchildren,” she agreed. “But first I have to do this. So, good-bye.”</p><p>“Come down and have breakfast with me instead,” he coaxed.</p><p>Interestingly, she was tempted. He really was a stone fox. And she hadn’t been on a date in... Let’s see, she had been able to legally drink for three years, and there was that guy who took her to the rave right after...</p><p>Wait a minute.</p><p>“Wait a minute!” God, she was slow this morning. “You’re the blind guy from the alley!” Except he didn’t seem blind. He’d checked her pupils, for crying</p><p>out loud.</p><p>“Yes,” he confirmed.</p><p>“You don’t seem very blind.”</p><p>He hesitated, then said again, “Have breakfast with me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why?”</p><p>“You might as well. I’m not going to let you jump.”</p><p>She sighed. “Well. I am hungry.” And I can ditch this guy after I cadge a free meal off him. “Okay. Lead on, MacDuff.”</p> <p>CHAPTER FIVE</p><p>He offered her his arm when they were at street level, and her smell shifted to amusement—ripe oranges. After a moment, she grasped it.</p><p>“Cripes, I can’t even get my fingers around your bicep. D’you work out, like, nine times a day?”</p><p>“No. But I like to keep in shape.”</p><p>“Y’know, we don’t have to go anywhere fancy,” she said. “We could just get a cup of coffee.”</p> <p>“You’re underweight for your height. We’ll get a proper meal.”</p><p>“Bossy,” she coughed into her fist.</p><p>He smiled. “Yes.” It was all he could do not to gape at her like a schoolboy. He had no idea why he could see her, but the effect hadn’t worn off with daylight...she was like a flame in a street of shadows. “I’m afraid it runs in my family.”</p><p>“Can I ask you something? How come you don’t use a dog? And where’s your cane? Didn’t you have one last night?”</p><p>“I get around pretty well,” he said, avoiding her question. “I’ve been blind all my life. It’s all I know.”</p><p>“Oh. Well, like I said, you don’t seem blind.”</p> <p>He shrugged. Humans always told him that.</p><p>Over a breakfast of three pancakes, six pieces of toast, and two cups of coffee (hers), and a bowl of oatmeal (his), they talked.</p><p>“Don’t you want some ham or bacon? Please, order whatever you like. I can assure you I’m good for it.”</p><p>She shuddered. “No, thanks. I’m a vegetarian.”</p><p>“Oh.” Hmm. That could be interesting. “You know, that’s really not the best diet for an omnivore.”</p><p>“Dude, I’m not chomping on dead flesh, and that’s the end of it.”</p><p>“Drake,” he corrected.</p><p>She mopped up syrup with the last pancake. “Yeah, whatever. Can I get more coffee?”</p> <p>“Of course.” He signaled the waitress, then asked, “Why are you so thin?”</p><p>“Why do you ask so many questions?”</p><p>“I’m interested in you,” he said simply.</p><p>“Uh-huh. Dude, you’re, like, twice my age.”</p><p>Yes, that was annoying. But it couldn’t be helped . “Stop calling me dude. And it’s probably not twice. I’ll be forty this year.”</p><p>“Oh.” She seemed surprised. “You look younger. I’m twenty-four.”</p><p>“You look younger, too. If I may ask, where are you staying?”</p><p>“There’s a shelter on Beacon Street,” she said without a trace of</p><p>embarrassment. “I lost my job—the economy, you know—and couldn’t make rent, so I’ve been bouncing around a bit.”</p><p>“Is that how you fell in with the little gang who attacked me?”</p><p>“I didn’t know they were going to do that,” she said earnestly. “I thought it was just talk.”</p><p>“I believe you. What about your family?”</p><p>“Don’t have one.”</p><p>“I’m sorry.”</p><p>“It’s all right. I never really knew them. Like you—I guess—being by myself, it’s all I know.”</p><p>“Why don’t you stay with me for a while? I have a big house in Cambridge, and there’s plenty of room for a guest.”</p><p>She snorted into her coffee cup. “Right. Go home with the strange guy who showed up out of nowhere, who says he’s blind but doesn’t trip over anything. Not too creepy.”</p><p>“What’s the worst that could happen?”</p><p>“You could kill me in my sleep.”</p><p>He tried not to show offense. “That’s ridiculous. In your sleep? I would never.”</p><p>She laughed at him. “Oh, okay, so, we’ve established you won’t kill me in</p><p>my sleep. That’s promising.”</p><p>“The homeless shelter is preferable to my home?”</p><p>“Well...no offense, dude...Drake, I mean...but put yourself in my shoes.”</p><p>“I understand. But consider this, you could have pancakes every morning,”</p><p>he coaxed, “and all the coffee you could drink. Until you get back on your feet.”</p><p>She shook her head, but looked tempted. “Jeez, I can’t believe I’m even considering this. If this was a horror movie, I’d be yelling at the screen. ‘Don’t do it, you dumb bitch!’”</p><p>“That’s nice. I would really enjoy your company. I live a...solitary life. It would be nice to have a...a friend over.”</p><p>She stared at him for a long moment. “Well. I have to admit it’s the nicest offer I’ve gotten all year. But here’s the thing. I’m getting these ‘take-the-poor-waif-home-and- take-care-of-her’ vibes from you, but I’m not sure you get it. My family died when I was a toddler, and I left the foster home when I was ten. I’ve been on my own a long time. I can take care of myself.”</p><p>“Of course.”</p><p>“And the thing is, there’s nothing I’ll...uh...do for you. You know. In order to stay at your house.”</p><p>“No, I wouldn’t expect you to.” And, fortunately, she was a good two weeks from ovulation. He’d be nowhere near his change then. It could be problematic when a roommate’s cycle coincided with a male werewolf’s, but he didn’t have to worry about that, at least. “There aren’t any strings, Crescent.”</p><p>“Well.” She finished her coffee. “I can’t believe I’m saying this. But we’ll try it. For a while.”</p><p>“All right, then.” He smiled at her, and she smiled back. He’d never seen a smile before. Hers made him dizzy.</p><p>CHAPTER SIX</p><p>They walked in and she was instantly dazzled. Like the big colonial house hadn’t been impressive enough on the outside. “Wow! How many windows do you have?”</p><p>“I have no idea.”</p><p>“Right. Sorry. It’s so bright in here!” She was staring; she couldn’t help it. Her first, jumbled impression was lots of light, a soaring living room ceiling, a loft, and lots of hardwood flooring. “You don’t even need to turn any lights on during the day. Not that you would.”</p><p>He was hanging his greatcoat in the closet. “I like to feel the sun on my face,”</p><p>he said simply.</p><p>“Did anyone ever tell you, you live in a pink house?”</p><p>“A few have mentioned it.” He shrugged. “What do I care?”</p><p>She laughed. “I s’pose. It’s just sort of funny. I mean, you’re this big, supermasculine guy, and your house is the color of a faded pink sweatshirt. It’s a little weird.”</p><p>He smiled. It was disconcerting—like he was looking right at her. But of course he wasn’t. He probably knew she was standing by the door because of her voice. “Super masculine?”</p><p>“Dude, you’re about the biggest, boldest guy I’ve ever met.”</p><p>“Thank you. And stop calling me dude.”</p><p>He was the sharpest “handicapped” person she’d ever seen. He paid for breakfast with cash...and she noticed the twenty-dollar bills were folded into triangles, and the ten was a rectangle. Of course...it made perfect sense. He couldn’t see the denominations, and the bills would all feel the same. Did he get them that way from the bank? Or did he have a helper to fold his money? Maybe she could fold his dough, earn her keep...</p><p>But it was just so weird, because he always seemed to know where she was—he caught her before she started to trip on the curb, for God’s sake.</p><p>“Why don’t I show you to your room?”</p><p>“Yeah,” she said, kicking off her sneakers and following him. “Why don’t you?”</p><p>She expected a simple guest room with a utilitarian twin bed and an empty bureau. Instead, he escorted her to paradise. The bed, a mahogany four-poster, was against the window, and sunlight was splashed all over the Shaker quilt.</p><p>Through the open door on the opposite side of the room she could see a gleaming bathroom with tiles the color of the sea, and the bureau beside her was almost as tall as she was.</p><p>“Uh...you sure you don’t have a cot in the basement or something?” she asked nervously. The room was so clean, so beautiful, she was afraid to move, lest she destroy it all. “Or maybe a blanket I could spread out on the kitchen floor?”</p><p>“Nonsense. This is your room now, for as long as you like. I’ll leave you to get settled.” And, abruptly, he was gone.</p><p>“Get settled?” she asked the empty room. “How?” She hadn’t wanted him to see the shelter, so she had no extra clothes. Well, she’d sneak out tonight and go get them. And she’d find Moran and his little gang of retards, and give them a piece of her mind. Imagine, trying to rob a blind guy.</p><p>She wandered back out to the living room and eyed the loft.</p><p>Hmmm...</p><p>She noiselessly climbed the stairs, and had time to notice the loft was actually an office—desk, computer with big-ass speakers, bookshelves—before she clambered up onto the railing. This would be even easier—this was only one story. Less, actually. Just a few feet. Piece of cake. If she couldn’t fly here, she couldn’t fly anywhere.</p><p>“Something for lunch?” Drake called from the kitchen. Good, he was a couple of rooms away.</p><p>“I’m still stuffed from breakfast,” she called back, and dived off the railing.</p><p>She flopped over in mid-air, and had time to notice the living room doing a one-eighty around her, and then she fell into Drake’s arms.</p><p>“Wow!” she gasped. “How’d you do that? You were, like, fifty feet away!”</p><p>“Will you stop that?” he snapped. “Stop climbing things and leaping off of them, before you give me a heart attack.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“But how’d you know I—?”</p><p>“Promise, Crescent. As long as you’re in this house, no more crazy jumps.”</p><p>“But I won’t be hurt,” she explained earnestly, resisting the urge to snuggle into his arms. He was holding her like she weighed as much as a bag of feathers, like it was nothing. And the way he was scowling down at her—it should have been scary, but instead, she wanted to smooth out the frown lines with her fingertips. “Really! I’m sure I can do it.”</p> <p>“Not in my house,” he said firmly. “Now promise.”</p><p>“Or what?” She wasn’t being sarcastic. She was curious.</p><p>“Or I won’t put you down.”</p><p>Now she did smooth out the frown line over his eyebrow. Weirdly—but nicely—he leaned down and nuzzled her nose. She felt her nipples tighten and fought the urge to squirm in his arms.</p><p>“You’re just going to carry me around all day?” she teased.</p> <p>He smiled down at her. “It wouldn’t be much of a hardship.”</p><p>“Okay, okay. I promise. No more jumping off stuff in your house.” But I can’t promise I won’t jump anywhere else...</p><p>“All right, then.” He set her on her feet, gave her a warning smack on the ass which stung like hell— “Hey!” —and walked back to the kitchen.</p><p>CHAPTER SEVEN</p><p>He heard her as she tiptoed past his room. Actually, he heard her when she opened her eyes and sat up in bed. He knew from her smell she hadn’t slept, and made sure he didn’t either.</p><p>When she stole out of his house like a thief in reverse, he was right behind her.</p> <p>Bags were always in short supply at the shelter, so she just gathered a few changes of clothes to her chest and stole back outside. Unfortunately, she caught Maria’s eye on the way out. Well, it couldn’t be helped. The woman gobbled speed like it was Tic-Tacs, and she never slept.</p><p>Crescent crept down the alley behind the shelter, thinking she still had time to catch the Red Line back to the bus stop near Drake’s house, when she heard running footsteps and turned to see the Asshole Brigade.</p><p>“New crib?” Maria asked. She was one of those women who always smiled—who smiled when you knew they were screaming inside. “New man?”</p><p>“Yes, and no, and mind your own business.”</p><p>“Hold up, Cress.” That was Nick Moran, the leader of the incredibly lame group. “You got something for us?”</p><p>“It’s Cress-ent, and no, I sure don’t. What’s wrong with you?” She shifted her weight and clutched her clothes a little tighter. She did not want to let these three put her in the middle of their nasty little circle. Her gut almost always led her right—why else was she staying with a stranger?—and maybe it did this time, too. Maybe when she fell in with these idiots, they didn’t really know how bad it could get. Her gut was good, but it couldn’t foresee the future. “Robbing a blind guy? Trying to, anyway. You couldn’t even pull that off.”</p><p>“Shut up,” Nick said roughly. He was a tall, cadaverously thin man with the bare beginnings of a mustache, and a scar that bisected his left cheek. “We had it under control.”</p><p>“Sure you did. ‘Bye.”</p> <p>Jimmy, the other schmuck, clawed at her elbow and managed to grab it. “Whyn’t you take us to his place?” he asked. His tone was reasonable, but she wasn’t fooled. “Cute piece of ass like you, bet you’ve already got a key.”</p><p>As a matter of fact, she did. As a further matter of fact, she certainly wasn’t going to let them have it. “Forget it,” she said, trying to pull away. “Fuck off, you three, before I lose my temper. I can’t believe I ever felt sorry for you.”</p><p>“Sorry for us?” Nick echoed, expression darkening. “Be sorry for you. Because when we get done, you won’t be so pretty no more.”</p><p>“It’s any more. For God’s sake, Nick, you went to private school before your folks kicked you out.”</p><p>Nick blushed—he hated being reminded he hadn’t been born to the streets— but Marie’s smile widened, if that was possible. Crescent observed that the woman had a nodding acquaintance at best with toothpaste. “We can do this the easy way—” she began.</p><p>“Oh, spare me your thug clichés.” Crescent was more annoyed than frightened, which she supposed was something. She’d been a moron to come back here by herself—and for what? So Drake wouldn’t see the shelter? Who cared what he thought? Big overprotective dope. And she wasn’t going to be winning any College Bowls, either, unless she starting relying a little more heavily on instinct and less on pride.</p><p>Jimmy’s other hand—the one not squeezing her elbow—darted forward like a pale spider and grabbed her nipple. Then he started to pinch. Hard. Crescent could drop her clothes all over the filthy alley floor, or she could stand there.</p><p>She stood there. Never in a thousand years would she show these three how much he was hurting her. “Cut the shit,” she said through gritted teeth. “You think acting like bullying assholes is going to change my mind about you?” She looked at Nick, waiting for him to call off his dog.</p><p>Jimmy was giggling and Maria was grinning, and Crescent’s eyes were watering, and she had just decided to drop her clothes and kick Jim in the ‘nads when Jim was flying away from her, literally flying. He sailed through the air and crumpled to the street a good ten feet away.</p><p>She had a glimpse of big hands cupping the curve of Maria’s skull, and Nick’s, and then there was a klonk as their heads banged together. It sounded awfully like the time she dropped a cantaloupe on the floor.</p><p>And then Drake was towering over her. Scowling, as usual.</p><p>“Have I mentioned,” she said, gaping up at him, “that for a blind guy, you get around pretty good?”</p><p>“Once or twice.” He pushed her crossed arms down, and carefully raised her T-shirt, then eased her bra cup down so he could examine her nipple. This was startling, and quite nice. She reminded herself that he was a doctor, and hers was probably one of about six thousand nipples he saw in a year.</p><p>“It’s pretty red,” he said after a long moment. He was leaning so close, she could feel his breath on the swollen peak, and shifted her weight again.</p><p>Suddenly her shorts felt too tight, in a pleasantly irritating way. “But I don’t think it’ll bruise.”</p><p>“How—” Her mouth was suddenly very dry, and she coughed. “How do you know it’s red?”</p><p>He didn’t answer her. Instead, he smoothed her hair away from her eyes. “If you steal out of my house in the middle of the night again,” he said, quite pleasantly, “I’ll beat you.”</p><p>“No you won’t.”</p><p>He sighed. “No. I won’t.”</p><p>“Drake, seriously. Why d’you care?”</p><p>He sighed again. “I care.” Then he pulled her up on her tiptoes and kissed her with bruising strength.</p><p>She dropped her clothes. Fuckit.</p><p>Kissing Drake—well, being kissed by Drake—was an entirely novel experience. For one thing, the man didn’t have an ounce of flab anywhere. For another, she had the distinct impression he could snap her spine like kindling. But this thought was as exciting as it was slightly scary.</p><p>He pulled away and she stumbled forward. “Oh, no, don’t stop,” she gasped. “Kiss me some more—I’m not dizzy enough.”</p><p>“I can’t,” he said, and she was delighted to see his breaths, too, were coming hard. “I don’t want to take you in the alley like a—come on.”</p><p>He grabbed her hand, hauled her out until they were under the streetlights, and flagged a cab. He practically threw her inside, then slammed the door and tersely told the driver his address.</p><p>“My clothes,” she said, staring out the back window. “And after all the stupid trouble I went to...”</p><p>“I’ll buy you a Gap store,” he replied, and didn’t let go of her hand until the cab pulled into his driveway.</p><p>Drake fumbled for his wallet, then grabbed a bunch of cash and threw it at the driver, dragging her out in the same instant. She heard the driver’s gasp of surprise and appreciation, and then he was pulling out of the driveway and, in typical Boston driver fashion, pulling into traffic without looking.</p><p>She jumped into Drake’s arms. He held her easily, his hands cupping her bottom, and she nibbled his lower lip. “I think you tipped him ‘bout a thousand percent,” she teased.</p><p>“Ask me if I give a fuck,” he growled back. He shifted his grip, reached, and tore her shirt from the neck down.</p><p>CHAPTER EIGHT</p><p>They didn’t make it to the bedroom. They didn’t even make it to the front steps. Instead, he took her in the lilac bushes, and to the end of her days she would associate that scent with Drake’s urgency.</p><p>“This is insane,” she panted, helping him tear out of his coat, his shirt, his pants. “We don’t even know each other.”</p><p>“I know you.”</p><p>“Yeah, yeah, that’s what they all say.” Except she felt as if she knew him, too. Independent and proud and kind and gentle, but a hard man when he had to be. A velvet fist when circumstances demanded it.</p><p>He tore her panties off and then gently parted her. She was slippery and he groaned when his fingers slid through her, into her, and while his fingers were busy stroking and parting the slick folds between her legs, his thumb was on her clit, gently rubbing, and his lips were on her sore nipple, licking and kissing.</p><p>“Later,” she groaned. Oh, Christ, had she ever wanted anyone this badly? Had anyone? “Later for that stuff. Fuck me, before I go out of my mind.”</p><p>He left her nipple after one last kiss, then caught her hand, brought it between them, and let her fingers curl around his enormous length. He throbbed beneath her touch and she could feel his slippery tip. She ran her thumb over it and he shuddered in her arms.</p><p>“Now?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes.”</p><p>“You’re so small, I don’t want to—”</p><p>“Yes.” She wriggled beneath him and licked her lower lip. “I’m small and you’re big, and it’s going to hurt just right. Now stop talking and...fuck...me.”</p> <p>He obliged, parting her and surging forward, filling her up, forcing her to open for him, and still he came forward, pushing, thrusting, until she thought she would soon feel him in the back of her throat.</p><p>He withdrew, and in the waning light of the moon she could see the sweat on his brow, the way his eyes were shining, almost glinting, and then he surged forward, shoved forward, and she wrapped her legs around his waist and shrieked into the night air.</p><p>They rocked together in the grass, and when she put her hands on his taut butt, she could feel the muscles flexing as he worked over her, as he thrust and withdrew and pushed and surged. She opened her mouth for another yell—it</p><p>was too sweetly divine to keep quiet—when his hand clamped over her mouth. She writhed in silence beneath him and, several seconds later, heard the couple walk by on the sidewalk a bare ten yards away.</p><p>“They’ll hear you,” he murmured in her ear, his voice so thick it was nearly unrecognizable. “They’ll come over her and see me fucking you in my side yard.”</p> <p>The thought was so blatantly exciting she came at once, actually felt herself get wetter. He groaned in her ear, then bit her earlobe.</p><p>It went on like that for some time—she would never be able to guess how long they went at each other in the lilac bushes. Every once in a while his phenomenal hearing would pick up something and he’d cover her mouth again, without missing a stroke. But when he finally came, his shout was a roar that made her ears ring.</p><p>“Oh, Christ,” he gasped, collapsing over her.</p><p>“If anybody heard that, you’ll have some explaining to do, Doctor.” She tried to sound saucy, but mostly, she just wheezed.</p><p>“Umm.” He was kissing the side of her neck, wet snuffly kisses that made her shiver and press closer to him. “Don’t leave in the middle of the night anymore.”</p><p>“All right, then. Think we can make it inside without showing the neighbors our bare butts?”</p> <p>“We’re about to find out.”</p><p>CHAPTER NINE</p><p>“I think I got something caught on your bellybutton ring,” he said later, simply because it was much too soon to ask her to be his mate, and he had to say something.</p><p>“What can I say? Life with me is a constant adventure.” She yawned and flopped over on her back. “And, may I add, not bad for an old guy. Seriously. You must take, like, super Geritol, because...”</p><p>“Thank you so much,” he said wryly. They were in his bed, watching the stars through the skylight. “I was just about to compliment you on being adequate in bed despite an obvious lack of experience.”</p><p>She smacked him on the bicep. “Hey! And...ow...that was like slapping a rock. FYI, dude, I’ve got gobs of experience. There was that time in the movie theater...um...and once during a snowball fight a boy fell down on top of me...”</p><p>“Stop it, you’re embarrassing yourself.”</p><p>“Drake, what is it with you?” she asked abruptly. Her scent shift warned him—from playful soap bubbles to fresh green leaves—even if her tone hadn’t. “Seriously. I mean, you swoop down on me all Knight in Shining Armani, which is nice, if weird, and you don’t ask for anything at all, and you’re super nice, but</p> <p>you must want something.”</p><p>“Well,” he said, sliding his hand up her thigh.</p><p>“Oh, spare me. Like you were going to kick me out for not putting</p><p>out...don’t think so. I mean, here we are, and frankly, most men—”</p><p>“Spare me your knowledge of most men.”</p><p>“Okay, okay. But seriously. What’s your deal?”</p><p>“It’s a double deal,” he said after a long pause. “And either one will, as you might say, freak you out in the extreme.”</p><p>“Oh, dude, I’d never say anything so lame...well, why don’t you try one, see how that goes.”</p><p>“Uh...”</p><p>“Come on, come on! Then I’ll tell you something about me. Something</p><p>nobody else knows.”</p><p>“You mean besides the fact that you have smelly feet?”</p><p>“Draaaaaaaaaaaake!”</p><p>“All right, don’t yowl. Okay. Well. Here it is, then.”</p><p>She propped her chin up on her fist and waited.</p><p>He coughed.</p><p>She kept waiting.</p><p>“Well. Ah. You see, it’s difficult to just—you know—blurt it out like this—”</p><p>“Are you hoping I’ll die of old age so you won’t have to say it?”</p><p>“Fine, fine,” he practically snapped. “I’m a werewolf.”</p><p>Silence.</p><p>“I know,” he continued, emboldened when she didn’t run screaming from the room. He patted her thigh tentatively. “It’s startling, but you don’t have to be afraid, because I’d never hurt you or eat you—ah, that is to say, outside the bedroom I would never eat you, and—”</p><p>“Oh, Christ! That!” She batted his hand away. “I knew about that! You were supposed to tell me something I didn’t know.”</p><p>He actually shook his head to check his hearing. No, there was her heartbeat, lub-dub, lub-dub, and her breaths, and the hum of electricity, and the cool clink of the freezer making an ice cube...everything was working fine. “What?”</p><p>She lunged upward, hopped off the bed, and started pacing back and forth. Moonlight splashed her as she stomped; an enraged goddess etched in cream. “Well, what else would it be? You’re super-strong, super-fast, you’re blind but you get around better than I do...plus, you’re a doctor, for God’s sake. How could you be such a good doctor without, I dunno, super everything else? It was either that or I figured you were an alien. But after just now—the bushes, you know—I figured you probably weren’t an alien. Besides, this wolf stops me from throwing myself off the roof, and then you just happen to show up a few hours later?”</p><p>He blinked at her. “Oh. I must say this is very anticlimactic.”</p><p>“Serves you right for assuming I was a dumb-ass.”</p><p>“I did not! No one’s ever guessed before. And I’ve had...ah...lady friends who have hung around quite a bit longer than you have.”</p><p>“Oh, that.” She waved ‘lady friends who have hung around’ away. “Well, that’s the thing about me—the secret thing—I was gonna tell you. I can tell things about people. That’s why I came home with you. I didn’t just think you wouldn’t hurt me, I knew you wouldn’t. It’s like I can get into a person’s head and tell exactly what they’re feeling.”</p><p>“Empathic, hmm? That’s interesting. Well, Crescent, for heaven’s sakes, why do you keep giving that gang of yours a second chance?”</p><p>“I think they might be a little crazy,” she replied matter-of-factly. “When we meet up, they never feel like they’re going to hurt me. Then they get mad, and...anyway, obviously my radar isn’t 100% right all the time. Close enough for jazz, though.”</p><p>“And this fixation with flying?”</p><p>“Dude, I totally can! I know it! You just have to stop getting in the way when I jump off of things.”</p><p>Empathy...flight fixation...and her build, small and speedy...but surprisingly heavy for her height...could it be? He had assumed they were legend. Rather like werewolves.</p><p>“Crescent,” he said abruptly, “have you ever had an X-ray?”</p><p>Startled by the abrupt subject change, she blinked at him like a blonde doe. “Uh...not in the last few hours.”</p><p>“And you never knew your family?”</p><p>“Nope.”</p><p>“Hmmm.”</p><p>“Have I mentioned you’re sexy when you go all ‘pondering physicianesque’?”</p><p>“No,” he said, pouncing on her and bearing her back on the bed like a cat with a new toy. “You haven’t. Please elaborate.”</p><p>“Nah...I’ve had enough of talking.” She grabbed his ears and pulled him down for a kiss. He could feel her tongue dancing in his mouth and suddenly everything was much louder, much clearer. It was amazing to make love with a woman and be able to see her, really see her. He couldn’t get enough.</p><p>He broke the kiss, having forgotten about her origins and regained new interest in her breasts, which were small, like winter apples. He sucked a nipple into his mouth and tongued it gently. She squirmed beside him and wriggled closer. He slipped his hand between her thighs and slid his fingers through her curls, still damp from their lovemaking. In fact, she was deliciously hot and sticky down there.</p><p>He slid his fingers through her slick folds, found her clit, pressed lightly, then rubbed the tender area around it, and dipped a finger inside her. He licked her cleavage, tasting her sweat and trying to resist the urge to give her a good nip, a mark that would last for days. His mark.</p><p>“Oh, Christ,” she gasped. “How do you do that? I thought we were done, but I could fuck you to death right now.”</p><p>“There are worse ways to go,” he teased, but his tongue felt too thick in his mouth, and now there were two fingers inside her.</p><p>Quick as a fish, she slid away from him, shoved him over on his back, and straddled him. “Stop me if you’ve heard this, like, a hundred times before, but you’re really good—”</p><p>“I’ve heard it be—ouch!” She’d reached back to cup his testicles, and her grip had tightened. “Never mind.”</p><p>“Good dog.” She giggled.</p><p>“I really don’t think you should mock my origins,” he said, but talking was getting much harder, as she had wrapped her fingers around his cock and was squeezing, then releasing, then squeezing. “After all, you—uh—what were we talking about?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Now her hand was sliding up and down with delicious, if agonizing, slowness. “Origins,” she prompted helpfully.</p><p>“Right. You descended from apes. And that’s—actually—that’s quite fine— really—ah—you’re not going to stop, are you?”</p><p>“‘Fraid so, big guy.” She must have taken pity at his horrified expression, because she shifted her hips and then he was sliding up inside her. “Why should you have all the—all the—fun?” She’d been riding him while talking, lifting up and then slamming back down. Now she was just as breathless as he, thank goodness, and oh Christ, she was so sweet and it felt so good, it felt amazing. Her hands were clutching his shoulders as she pumped and pumped, and he grabbed her knees and spread her thighs wider on the down stroke. Her eyes rolled up in her head and he felt her uterus contracting around his cock as she came.</p> <p>“Oh, God!” she cried at the ceiling.</p><p>“Too bad,” he panted. He grabbed her hips and lifted, released, lifted, released. She shuddered all over and he felt her clench again. “It’s going to be a while for me, dear. That whole middle-aged thing, you know. Hope you’ve buckled in for a long ride.”</p><p>She wriggled, trying to lift herself off him, but he held on because he needed her right where she was, and because he knew she wasn’t truly worried. He used her roughly, because he knew she wanted him to do so, but also because he needed to be a little rough—needed to make an impression on her mind, if not her body. He wasn’t sure if that was a werewolf thing, or strictly a male prerogative.</p><p>When she was clawing at his shoulders and begging him, when she was very nearly sore from coming, he finally let himself go. Shooting off inside her was like a dream, the best he ever had.</p><p>She collapsed over him, panting. He stroked her back, savoring the fine sheen of sweat he found there.</p> <p>“Oh, dude,” she said at last. “A girl could fall in love.”</p><p>He snorted, and then they laughed together, like mates.</p><p>CHAPTER TEN</p><p>“Drake. Seriously. How many T-shirts do you think I need?”</p><p>“But they’re so versatile,” the Gap saleswoman piped up.</p><p>“Not to mention fragile,” Drake whispered in her ear, and was gratified to see her blush.</p> <p>“You go away,” she ordered the woman, smiling. “You’re helping him spend way too much money as it is. And you—put that down. Khaki—yech.”</p><p>“But this is the Gap,” the saleswoman said (“Ask me how to save 15%” was</p><p>emblazoned in hysterical red ink on her lapel button), obediently retreating.</p><p>“What, so I have to wear the uniform, too? Keep going.”</p><p>“I’m offering you any woman’s dream,” he said, “and you’re still making</p><p>mischief.” “A) Chauvinist much? Any woman’s dream? Shopping at Faneuil Hall? And</p><p>B) put those down. I already picked out pants.”</p><p>“You’ll need more than two pairs.”</p> <p>“Not according to some,” she said, arching an eyebrow.</p><p>“Hmm,” he said, advancing on her, momentarily slowed by a whirl of khaki</p><p>as she threw the pants at him.</p><p>“Forget it, pal. Neither the time nor the place. Excuse me,” she added, bumping into a silver, headless mannequin. “Oh, gross! I hate when I think</p><p>they’re people.”</p><p>“That’s some empathy you’ve got at work there,” he commented.</p><p>“Off my case, Dr. Furball. What, you never ever made a mistake?”</p><p>He thought hard. “Nothing springs to mind.”</p><p>She let out a yelp of anger and he could tell she was sorry she had nothing in her arms to toss at him any longer. “Dude, I hate to point this out, but you can’t see. You must have screwed up something. Clashing tie, maybe?”</p><p>He tossed her a blouse the color of her eyes and said in a low voice, although the saleswoman was across the store, “Homo saps are more handicapped than I, dear.”</p><p>“Oh, sure, the one-eyed man in the country of the blind, and all that.”</p><p>“Essentially.”</p><p>“We’re not that bad.”</p><p>He shrugged. “I can smell an iron deficiency. I can hear a heart murmur without a stethoscope.”</p><p>“Well, I can tell this blouse doesn’t go with those pants, so put it right back on the rack, pal. God, aren’t you bored? These are all for me and I’m just about bored out of my tits.”</p><p>He grinned. “Thanks for the visual. I’ll make a note to catalog order for you from now on.”</p><p>“Well, thank you. Not that you need to keep buying me clothes.”</p><p>Want to bet ? “I suppose taking you to Anne Klein to look at dresses would be a complete waste of time?”</p><p>“Barf out! Jeez, look how late it’s getting! The sun’s actually gone down. God, how long have we been doing this?”</p><p>“Since supper. Stop complaining, we’re almost done.”</p><p>“Well, I’d like to see you make me,” she said pertly.</p><p>“Done and done. If you’re quite—” He paused suddenly. Was that a whiff of Pack? It sure was. Hmm, two in one week. It wasn’t often he ran into one a year. That was interesting. Now what to do about it?</p><p>“Dick, I swear to fucking God, if you don’t stop bitching I’m going to pull out your eyeballs and shove them down your pants.” The voice was strident, loud, and female.</p><p>“That could be fun,” a low-pitched male voice he didn’t recognize said cheerfully. “And who’s bitching? I just got up. What are we doing here? I didn’t know you liked the Gap, m’dear.”</p><p>“I fucking well hate it and you damn know it. But they’re having a sale and I can stock up. I fucking hate shopping!”</p><p>“A woman after my own heart,” Crescent muttered, holding up a sleeveless sweater. It was touching her, so he could see it was the color of mucous. Everything else was the usual gray blur...but that scent...he knew that scent...</p><p>Drake moved to get a closer look. It couldn’t be. And with a man? No. It had been too many years; he was mistaken. Still, no one else he knew packed that many ‘fucks’ into everyday language.</p><p>He stepped around the stack of red miniskirts, nostrils flared. Yes. It was she. “Janet Lupo?”</p><p>He heard her drop the pile of clothing, and could smell her shock. Despite her completely flabbergasted expression, he could tell by her scent that she was looking good—great, in fact. Very healthy, with a vitality about her that had been lacking in the girl he’d once known.</p><p>Interestingly, he had no sense of the man with her except as a bundle of formidable power. No real scent at all, but tall. Very strange.</p><p>“Fuck a duck,” Janet said.</p><p>“Hello, Janet. It’s nice to—”</p><p>Drake had an impression of blurred motion, and then he went sailing through the window front and bounced onto the cobblestones. Broken glass rained down everywhere.</p><p>CHAPTER ELEVEN</p><p>Crescent worked very hard on not shrieking. It wasn’t easy. There they’d been, minding their own business, when this bitch came out of nowhere and threw Drake through a window—through the damn window!—and now the two of them were rolling in the street like a couple of alley cats—or wolves, probably; wolves would be more accurate, and the place was emptying pretty quick as the stampede started, and Drake was down, was on his back, and—</p><p>“Get off!” Crescent leapt forward, but a brick fell on her shoulder and yanked her back.</p><p>“I wouldn’t,” the blonde hottie said mildly. He was a yummy one, all right, and towered over her almost as much as Drake did. Skinny drink of water, though. She observed that the brick was his hand. Strong drink of water, too. “I think it’s a family thing. Better let them—ow.”</p><p>She’d never hit anyone in the face before, and was disappointed. Blondie just sort of shook it off and rubbed his jaw. “Now don’t you start. There’s only one woman permitted to smack me around, and she’s currently rolling in a mud puddle with your friend.”</p><p>Show him your necklace.</p><p>Obeying the inner voice that was never, ever wrong—but which didn’t speak up nearly often enough—she fumbled for one of the three necklaces around her neck, broke the chain, and thrust it at him. To her amazement, he stumbled backward and threw a hand over his face. Just like in the movies!</p><p>“Now you’re just being mean,” he said reprovingly, groping for her. “Put that cross away before you hurt someone. Like me!”</p><p>She ignored him, turned her back, stuffed the cross in her pocket, grabbed the cow around the waist, and pulled. “Get off,” she huffed. Grabbing her lover’s attacker was not unlike trying to stop an army tank—the woman absolutely did not budge. But she shrugged—nearly dislodging Crescent—and punched Drake</p><p>in the eye for good measure.</p><p>“Your monkey’s bothering me,” she told him, and punched him again.</p><p>“Crescent, don’t,” Drake said sharply. There was a rill of blood trickling down his chin, but other than that he looked unharmed. Anybody else would be spurting blood from about six different arteries after sailing through a plate glass window—thank goodness for werewolf constitution! “Get back. Get out of the way. Don’t worry about me.”</p><p>“Yeah, short stuff.” Bam! Another punch. “He’ll be just fine. Why don’t you go get a Frappuccino?”</p><p>She ignored them, and stubbornly tugged again.</p><p>“Crescent, get away from here. In a minute I’m going to forget to be a gentlemen—Goddammit, Janet, if you hit my jaw again I’ll put you over my knee!”</p><p>“It’s a date, gorgeous.”</p><p>“Oh no you don’t!” Crescent tried a new grip and pulled harder. “Nobody’s getting spanked but me.”</p><p>“Really?” Hottie said from behind her.</p><p>“I said get off him!” She suddenly felt her forearm clutched in an unbelievably strong grip, and then she was sailing over the woman’s head, only to hit the sidewalk ass-first. The shock went all the way up her spine and she yelped. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Unwise,” Drake said, shrugging out of his coat.</p><p>“Oh, please. Nothing personal, Blind Man’s Bluff, but you’re fucked. Can’t have anybody ratting me out to Mikey Boss Man, so sorry, sit still and die now,</p><p>okay?”</p> <p>“I’ll pass. And I have no idea what you’re talking about.”</p><p>“Really, Janet. Can’t you two solve this a little more amicably than</p><p>introducing death into the equation?”</p><p>“Pipe down, Dick, no one hit your buzzer.”</p><p>Crescent bounced up from the pavement. All three of them looked surprised to see her still in the game. “I said,” she growled, “keep your hands off my man, bitch!” Then she punched the cow in the jaw.</p> <p>This was infinitely more gratifying than when she’d hit El Hottie. The woman rolled away from Drake like a bowling ball and slammed up against the Gap’s front door, cupping her hands beneath her chin to catch the blood, and Crescent felt the shock of the blow race all the way up to her shoulder.</p><p>The woman spit a tooth into her palm. “Hey, that actually hurt, you little cunt!”</p><p>“Now that’s interesting,” El Hottie said approvingly. He was the most detached man she’d ever met. What a weirdo! “You don’t smell like a meateater.”</p><p>“Crescent!” Drake was utterly shocked. It was almost worth getting jumped, just to see the look on his face. “How did you manage that?”</p><p>“Do we have to talk about it now? Or do I have to keep kicking the shit out of what’s-her-cow?”</p><p>“Hey, hey,” what’s-her-cow said warningly. “Watch the language.”</p> <p>“You have a problem with cow? You put your hands on him again, I’ll kick your ass up so high people will think you have a second head. Cow.”</p><p>“Says the midget.” But the woman’s lips were twitching—like Drake’s did when he was amused, and trying not to show it.</p><p>“You know what they say. All cow and no cow makes cow a cow-cow.”</p><p>The woman reddened...then laughed reluctantly.</p><p>“For heaven’s sake, Janet,” Drake was saying, limping over to her and helping her out of the dirt. “What’s the problem? I haven’t seen you in—what? Fifteen years? And you attack me?”</p><p>“I don’t suppose we could talk about this over a drink,” Hottie commented. He grinned, and Crescent nearly screamed. He had about a thousand teeth, and they all looked very sharp. “So to speak.”</p><p>“—so now we’re sort of...uh...in love and stuff. And I’m not going back,” Janet added defiantly.</p><p>“You don’t have to sell me on the advantages of going rogue,” Drake said.</p> <p>“What, so, you’d get in trouble with your boss? The—what d’you call him? Pack Leader?” Crescent dumped a third packet of sugar into her coffee. “What’s he care?”</p><p>“He probably wouldn’t,” Janet replied after a long pause. “But it’s not worth it to me. The risk, I mean. He could order me to stay on the Cape and I—I would have to obey, or disobey.”</p><p>They were sitting in the corner of the Starbuck’s on Park Street, speaking in low voices. Although Crescent wasn’t sure why they bothered. This was Boston, after all. Nobody gave a shit.</p><p>“Well, you don’t have to worry about me. You’re only the second Pack member I’ve run into in the last year,” Drake said. “And even if I were to run into Michael—which isn’t likely—I certainly wouldn’t mention you.”</p><p>“Well, thanks. I guess I shouldn’t have... Uh.” Janet coughed. “You know. Kicked the shit out of you without asking questions first.”</p><p>“That’s all right,” he said kindly, ignoring Crescent and Richard’s snickers.</p><p>“You might think about moving,” Crescent suggested. “If your boss and all his lackey werewolves live on the Cape. I mean, you’re only ninety miles away. If you lived in—I dunno, Argentina? That would be better.”</p><p>“Our home is here,” Janet said stubbornly. “Besides, we’re all over the world. Might as well stake out a small claim and defend it here as well as anywhere else.”</p><p>Crescent noticed the hottie—Richard—hadn’t touched his frozen coffee. “Aren’t you thirsty?”</p><p>“Yes.”</p><p>“Well, why aren’t you—”</p><p>“So what’s your story, blondie?” Janet asked. “Getting smacked by you was like getting smacked by a two-by-four. What do you have for bone marrow, steel ball bearings?”</p><p>Crescent blinked at the interruption. “Well, I think I—”</p><p>“—might be part fey.” Drake finished for her.</p><p>Richard’s eyebrows arched. “Really? I thought your kind died out years ago.”</p><p>“It’s fairy, not fey, and most of us have—at least, I’ve never been able to find anybody else like me. And Drake, how the hell did you know that? I never got around to telling you!”</p><p>“I guessed yesterday,” he explained, “and when you smacked Janet I knew for sure.”</p><p>“Whoa, back up.” Janet put her palms out like a traffic cop. “You’re a fairy?</p><p>Like Tinkerbelle? With wings and shit?”</p><p>“Do you see any wings?” she snapped.</p><p>“Jeez, nobody told me fairies had such rotten tempers,” Janet muttered.</p><p>“She’s just mad because I figured it out,” Drake said with annoying</p><p>smugness. “She was saving it for a surprise.”</p><p>“You’re so insufferable!”</p><p>“Yes.”</p><p>“It runs in the family,” Janet added with a grin. “The men especially. So</p><p>annoying.”</p><p>“Oh, yes,” Richard said. “Male werewolves are the annoying ones.”</p><p>“You shut up. Listen, I always heard fairies were these little delicate things.</p><p>You hit like a bulldozer. I’m gonna have to wait for that tooth to grow back, which sucks.”</p><p>“Dense bones,” Drake said.</p><p>“Difficult to break,” Richard added. “I ran into one of your kind about seventy years ago, and he nearly killed me. He was quite old even then, dear, so don’t get your hopes up. I’m sure he’s dust by now.”</p><p>“Oh,” Crescent said faintly.</p><p>“Don’t sound so disappointed. He was a nasty old man.”</p><p>“This explains your fixation with flying,” Drake said, thinking out loud.</p><p>“Dense bones, and she can fly?” Janet snorted into her Caramel Mocha Frappucchino. “Yeah, that makes sense.”</p><p>“You ever see an airplane take off?” Crescent asked. “You look at it and wonder how something that heavy can ever get off the earth...and then it goes...and you’re left on the ground.”</p><p>“Well, of course you can’t fly with all those accessories.” Whip-quick, Richard flicked his spoon at his whipped cream, and a dollop appeared as if by magic on the end of Janet’s nose. “But you knew that.”</p><p>“What?”</p><p>“Dammit, Dick! Quit throwing whipped cream on me; you know I hate it.”</p><p>“What?” Crescent nearly yelled.</p><p>Richard looked startled. “All your piercings. You probably set off metal</p><p>detectors in airports. And of course your kind can’t tolerate certain metals.”</p><p>Drake’s eyes nearly bulged out of his head. Crescent knew exactly how he felt. How had she never thought of this before?</p><p>“What are you guys talking about?” Janet had finally gotten the last of the</p><p>whipped cream off her nose. “Drake, you look like you just crapped your pants.”</p><p>“I—um—I want to fly, but I can’t. But I never made the connection—”</p><p>“What are you guys talking about?” Janet practically yelled.</p><p>“Fairies have a legendary fear of metal, especially iron,” Richard explained.</p><p>“In Crescent’s case, I would guess that translates into being unable to get off the—what are you doing?”</p><p>Tearing out all her goddamned earrings and rings, that’s what she was doing. Between her ears, nose, and belly button, she had over a dozen.</p><p>“I guess we’re done talking,” Janet commented when Crescent stood up so quickly, her chair fell over.</p><p>“There’s a back door behind the second coffee machine,” Drake said, “but I’m not sure now is the appropriate—Crescent?”</p><p>She ran for the door and it was right where he told her it would be. She was through it in a flash and bounding up one, two, three flights of stairs, and praise all the gods, the door to the roof was propped open and then she was out in the open.</p><p>She dove off the roof. At the last moment, she closed her eyes—she’d been disappointed too many times not to feel a twinge of anxiety. She knew she wouldn’t break any bones, but landing hurt, all the same.</p><p>Except she wasn’t landing.</p><p>She cracked open one eye and saw Janet, Richard, and Drake standing on the roof, looking at her. Except they were upside down.</p><p>Correction: she was upside down. In mid-air.</p><p>“There we go,” Richard said cheerfully. “Problem solved.”</p><p>“Uh.” She could feel the grin split her face. “Can somebody reach my foot? I have no idea how to get down.”</p><p>CHAPTER TWELVE</p><p>“Now, it’s none of my business,” Janet began with, for her, heartening tentativeness.</p><p>“Oh, here we go.”</p><p>“She’s a little young for you, don’t you think?”</p><p>“I have to take relationship advice from a woman who hangs out with a dead guy?”</p><p>“Figured it out, did you?”</p><p>“Took me a while. He doesn’t really have a scent, you know? In fact, he smells more like you than anything else.”</p><p>They were back at Drake’s house, and the sun would be up soon. Crescent’s feet hadn’t touched the ground in three hours. Richard was amusing himself by bouncing her off the roof, seeing how high she would go. His personal best was sixteen feet. Drake and Janet were sitting cross-legged near the edge of the roof, watching. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“She’s one of a kind.”</p><p>“No shit. But she’s a little—uh—that is to say—you think she’s in it for the long haul?”</p><p>Crescent shrieked with joy as Richard bounced her on the balls of her feet</p> <p>and she shot into the air again.</p><p>“I have no idea,” he said.</p><p>“It’s just—you know, I didn’t really know what I was missing until Dick</p><p>kidnapped me—”</p><p>“What?”</p> <p>“Long story. Anyway, you’re a pretty good guy. I mean, I always liked you.</p><p>It’d be nice if you could finally settle down.”</p><p>“Why, Janet, I never dreamed this tender side of you existed.”</p><p>“Shut the fuck up.”</p><p>“And it’s kind of you not to mention my grossly debilitating handicap.”</p><p>“What? Oh, that. I’m not being nice. I just keep forgetting. I mean, you don’t</p> <p>act like a blind guy.”</p><p>“How exactly does a blind guy act?”</p><p>“How the hell should I know? So anyway, back to Blondie. You just, like,</p><p>saw her and knew? Well, I know you didn’t see her...”</p><p>“Actually,” he said suddenly, “I did. See her, I mean. I can.”</p><p>“For real? Not just make a picture from how she smells?”</p><p>“For real. I can see her perfectly. But only her. Everything else is the same. For example, I know your height and weight from your voice, and how you sound when you walk, but I don’t know what color your eyes are. Hers are beautiful,” he added dreamily.</p><p>“Wow. That’s the weirdest shit I ever heard. And I live with a vampire.” Janet rested her chin on her knees for a moment. “I don’t know dick about fairies. Except I remember this story from when I was a kid—you remember Sarah Storyteller? Michael’s grandma?”</p> <p>“Sure. She used to read to all of us on the grounds, under those trees by the pond.”</p><p>“Right. Well, there was this one story—about fairies? They were little and invisible. They’d only appear if you caught them. And if you caught them, they’d grant wishes. So maybe Crescent appeared to you. You know, maybe that’s why you can see her.”</p><p>“Or maybe,” he said slowly, “she granted my wish.”</p><p>“You wished you could see? Not that I could blame you, you poor handicapped freak of—”</p><p>“Oh, quit that. No, I never really minded not seeing, but I always wondered what my mate’s face would look like. What her hair would look like, the color of her eyes...like that.”</p><p>“Hum. Well. You can see her. Only her. So...maybe she is in it for the long haul.”</p><p>“There’s that tender side again. My, Richard has been quite the good</p><p>influence.”</p><p>“Oh, shut up. So, what are you going to do?”</p><p>He sighed and shifted his weight. “Hope she flies back to me, I suppose.”</p><p>“Lame.”</p><p>“Mature.”</p><p>“I kicked your ass all over Faneuil Hall, you know.”</p><p>“Then my girl kicked your ass.”</p><p>“Oh, shut up.”</p><p>Janet and Richard left, but Crescent refused. He’d tried to explain why she should go, but she wasn’t having it. “What, is this that dumb ‘if-you-love-something-let-it-go-if-it-comes-back-blah-blah-blah’ thing? Because that sucks. You said I could stay as long as I wanted, you welsher.”</p><p>He tried to disguise his joy. “Crescent, there’s something you should know— ”</p><p>“Later. God, I’m starving. Listen, I’m going to run up ahead and see if those guys are serving breakfast yet.”</p><p>“It’s four o’clock in the morning.”</p><p>“I know, that’s why I want to check. Be right back.”</p><p>He shook his head as she hurried away, then realized they were quite close to the shelter where she’d been living. Foolish to be concerned—she was a tough one to hurt, after all—but he decided to catch up with her anyway.</p><p>That was the last rational thought he had for a while. Stupid, really—the punk shaking Crescent like a maraca looked far worse for the wear. An obvious beta type—he needed to be led. And, in abandonment, couldn’t take care of himself. He certainly wasn’t worth getting worked up over. He supposed Nick and what’s-her-name had gone on to greener pastures...or easier marks.</p><p>“Jimmy, you idiot,” Crescent was saying, prying his fingers off her arm, “will you give it up? Grabbing me is not going to fix your life. Now buzz off.”</p><p>“It’s all your fault,” Jimmy was insisting. “Nick and Maria took off because of you.”</p><p>“My ass! They took off because you can’t walk ten feet down here anymore without tripping over a cop. Too bad they didn’t bring you with, huh, Jimbo?”</p><p>Jimmy’s eyes flashed murky murder and Drake moved quickly, spinning him away from Crescent. “Just once I’d like to take a walk with you without your being assaulted,” he muttered, carefully examining her arm.</p><p>“What can I say, I’ve got a dark past. He’s harmless. Let’s go eat.”</p><p>He ignored her. Then he whirled and grabbed Jimmy by the throat, lifting him in the air as easily as a mother picked up her toddler.</p><p>“Did you really,” he began. He was so angry it was hard to talk. He wanted to growl and bite. “Did you really think you could put your hands on my mate and live to see the sun come up?”</p><p>“Whoa!” Crescent said, tugging on his arm. Before them, the punk squeaked and kicked, his face turning an interesting shade of purple. “Let go, Drake. He’s just an asshole.”</p><p>He was shaking the man—really just an overgrown boy, but surely old enough to know better—like a dog shakes a rag doll. “Did you really?” he said</p><p>again. “Did you?”</p><p>“Drake! You are freaking me out, dude!”</p><p>You’re a doctor.</p><p>She’ll have bruises. He actually marked her—marked her with his filthy</p><p>hands!</p><p>But you’re a doctor. “Drake, will you put him down already? He’s passed out, for Christ’s sake. And I really don’t want to finish the day at the Cop Shop.” He growled, then flung the man away. They both watched the unconscious tough sail through the air and then hit the street like a sack of sand. Jimmy groaned, but didn’t regain consciousness. “Jeez, overprotective much?” But she was smiling. “Remind me to never tell</p><p>you about my years on the streets.” “You will tell me.” “Later. When that vein in your forehead isn’t throbbing. Yuck, by the way.” “He touched you. He should never have done that.” “Yes, and I think he gets that now! Your mate?” she added, teasing. “Is that</p><p>what I am?” He put his arms around her. “Yes. That’s what you are.” “Well, all right. Let’s go eat.” “If I have to look at another pancake, I may well vomit.” “Dude, it’s fine. I’ll get waffles,” she added with a wicked grin, and stretched</p><p>up, and kissed him. “I have to tell you something. No waffles. I’ve put this off long enough—” “What, no waffles, like, ever?” “Crescent...this may be hard to believe...” She kissed him again. “Your intolerance of starchy foods?” “Be serious. I’m talking about—” “The fact that you can see me?” He blinked. “Well...yes. You’re not surprised.” “Of course not.” She smiled at him and he swore he could almost see her</p><p>glowing. “I granted your wish. Apparently it’s what we do.” “News to me! What exactly did I wish for? To have you in my life, or to see</p><p>you?” “I don’t know, but it’s kind of nice that you got it all in one package, isn’t it?” He supposed it was.</p><p>THE END</p><p>A Fiend in Need</p><p>Author’s Note</p><p>The events of this story take place in February of 2006, following the events of Undead and Unreturnable.</p><p>Also, I have changed Chicago’s Chinatown to suit my needs. It’s a wonderful city, but I just couldn’t leave it alone. That’s a failing in me, not the city of Chicago.</p><p>I did the same thing, again, with Summit Avenue in St. Paul. A lovely city. Just couldn’t leave it be. Sorry. “We shall find no fiend in hell can match the fury of a disappointed woman.”</p><p>—Colley Cibber, Love’s Last Shift, Act 2</p><p>“Like a fiend in a cloud</p><p>With howling woe, After night I do crowd, And with night will go.“</p><p>—William Blake, from Poetical Sketches</p><p>“Don’t threaten me with love, baby. Let’s just go walking in the rain.”</p><p>—Billie Holiday</p><p>Prologue</p><p>Bev Jones took a deep breath and stepped out onto the roof. She’d snuck to Chicago’s Chinatown on her lunch break because she wanted to die with the smell of fresh potstickers in her nose.</p><p>She walked slowly to the edge of the roof and peeked over. The winter wind ruffled her short, dark hair, but for a miracle, it was almost a nice day—nice for Chicago, anyway.</p><p>It was a typically busy Friday afternoon... the Friday before Valentine’s Day, in fact. And if she had to spend one more Valentine’s Day alone—or worse, with only the company of her psychiatrist—she would kill herself.</p><p>People said that a lot, but Bev never said anything she didn’t mean. And so here she was.</p><p>She put her hands flat on the ledge and got ready to boost herself up. Given that she was wearing snow pants and a down-stuffed parka, it might take a while—say, her entire lunch break. Ah, well. If nothing else, she was mildly curious to find out if there was an afterlife. Would there be potstickers and noodle nests in the afterlife? She didn’t—</p><p>“Bev! Hey! Wait up!”</p><p>She started—the last thing she’d expected on a rooftop was to hear someone calling her name—and turned around. And instantly assumed she’d gone crazy: there was a woman running toward her, a woman who—whoop!—just jumped over the Chinese arch separating the two buildings. And now—was she?—she was! She was hurrying right over to Bev. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Thanks for waiting,” the strange woman who could jump like a grasshopper said. “I was running a little behind this morning and was worried I’d miss you.”</p><p>“Miss me?” Bev gasped. Holy crow, it was like Touched by an Angel! “You mean you’re here to—to save me?”</p><p>The woman—a tall, lean brunette with striking dark eyes and the palest, softest-looking skin—blinked in surprise. Bev had never seen such skin before; maybe the grasshopper/angel was also an Irish milkmaid.</p> <p>Then she laughed. It wasn’t, Bev thought a little sullenly, a very nice laugh.</p><p>“Save you? Save you?” Again, the laugh. The woman actually leaned on the ledge so she wouldn’t fall down. “Honey, you’re such a dope you actually showed up for work the day you planned to kill yourself.”</p><p>“How did you—?”</p><p>“I mean, of all days to call in sick to your dreary, hated job, don’t you think today’s the day? And you know damn well the fall won’t kill you. What is it, like two stories? If you really wanted to ice yourself, why not use the shotgun you keep in your closet? Or one of those Japanese sushi knifes you saved up six months for, really do the job right?”</p><p>“I—I—”</p> <p>“No, you have this stupid idea in your head that swarms of people will gather on the street below, and some good-looking Chicago P.D. monkey will coax you down and fall in love with you. Among other things, you watch too much television.”</p><p>Bev stared. She was mad, and getting madder, but the grasshopper/angel/demon had said nothing that wasn’t true. Hearing it out loud made her feel like a real pigeon turd. It was more than attention, right? Wasn’t it?</p><p>“Save you! You don’t want to be saved! You want a date for next week! Ha!”</p><p>“That’s it,” Bev snapped. “I’m jumping.”</p><p>“Oh, stop it, you are not.” The brunette pulled her away from the edge with a casual strength that nearly sent Bev sprawling onto the blacktop.</p><p>“I am, too!” She managed to wrench her arm free, nearly dislocated her own shoulder in the process. The stranger was fiendishly strong. “I—I’m clinically depressed, and I can’t take it anymore.”</p> <p>“You’re mad about not getting the promotion, not having a date, and your mom forgetting your birthday.”</p><p>“Who are you?”</p><p>“My name’s Antonia. And the reason I’m here is to tell you the fall won’t kill you. In fact, it’ll break your neck and you’ll be a quad in a monkey hospital for the rest of your life. It’ll wreck your mom—her insurance company won’t cover you because you’ve been out of the house too long, and your insurance sucks. She’ll spend the rest of her life in debt and visiting you, and you think you’ll be able to get a date from a Shriner’s bed? Bottom line, you think your life is in the shitter now? Go ahead and jump. You’ll see the shit fly.”</p><p>“But how do you know?” Not, “that isn’t true” or “you’re on drugs.” Antonia had the creepy ring of truth in everything she said. Even weirder, Bev had never met someone as obnoxious as she was beautiful. She was like the swimsuit ad model from the ninth gate of hell. “How did you know to come here?”</p><p>“I just did.”</p><p>“And why do you keep saying ‘monkey’?”</p><p>“Because,” Antonia sniffed, “you’re descended from apes.”</p><p>“Well, you are, too!”</p> <p>“No, I’m descended from canis lupus. A much more impressive mammal to have in your family tree, in case you didn’t know. Which none of you seem to.”</p><p>“But you’re not here to save me?” Bev was having a little trouble following the conversation. She tried to give herself some credit; it had been a surreal five minutes.</p><p>“Shit, no! What do I care if another monkey offs herself? There’s too many of you anyway. Go ahead and jump, ruin your mother’s life, I don’t give a shit.”</p><p>“Then why were you running across rooftops to stop me?”</p><p>“None of your damned business,” she snapped.</p><p>“There has to be a reason.”</p><p>“Look, are you going to jump or not?”</p><p>“That depends. Are you going to tell me why you came?”</p><p>The brunette rubbed her temples. “Okay, okay. Anything to shorten this conversation. I see the future, all right?”</p><p>“Like a psychic?” Bev gasped.</p><p>“Nothing that lame. I see what’s going to happen. And, file this away, I’m never wrong. But the thing is, when people don’t do what I tell them, when they ignore my advice and sort of plunge ahead on their own, I get the worst migraines.”</p><p>“So you’re here... to stop yourself from getting a headache.”</p><p>“Hey,” Antonia said defensively. “They’re really bad headaches.”</p><p>“And you’re descended from canis—from wolves?”</p><p>“Duh, yes! Do we have to have this talk all over again?”</p><p>“So you’re, like—” It was stupid, but Bev made herself say it anyway. “A werewolf?”</p><p>“You’ve heard this before, right? ”Duh, yes.“ ”</p><p>“But—but you just sort of blurted it out! You can’t go around just telling monk—people that you’re a werewolf.”</p><p>“Why not?”</p><p>“Well—you just can’t is why not.”</p><p>She shrugged. “Who are you going to tell? Who’d even believe you?”</p><p>Bev pictured herself explaining that she didn’t jump because a woman claiming to be a werewolf told her the future (after jumping over a roof) and saw Antonia had a point.</p><p>“Nobody’d believe me, either,” she added, almost as if (ludicrous thought!) she was trying to make Bev feel better.</p><p>“Why’s that?”</p><p>“I don’t Change.”</p><p>“You mean you don’t—” Bev groped in the air, trying to find the words. “You don’t get furry and howl at the moon and steal babies?”</p><p>“Babies! Monkey babies? Ugh! Do you have any idea how awful you guys taste? I’d rather eat shit than an omnivore.”</p><p>Bev, stuck in a job she hated, was nevertheless finding her background in social work quite handy about now. There was a pattern to Antonia’s outbursts. In fact, the snarkier and louder she got, the more painful the subject under discussion was.</p><p>She tried again. “So what you’re saying is, you never turn into a wolf. Never. But you’re a werewolf.”</p><p>Antonia’s lips nearly disappeared, she was pressing them together so tightly. “Yss,” she mumbled. “Tht’s trr.”</p><p>“But then... how do you know you’re—”</p><p>“Because my mom’s a werewolf, okay? And her dam, and her dam, and her dam, going back about eighty generations, okay? I’m a right line descendant of the She Wolf Rayet, and my dad being a monkey doesn’t change that. I am so a werewolf, I am, I am, I am!” She smacked her fist on the ledge for emphasis, and Bev was astounded to see a chunk of concrete fly off in the distance.</p><p>“Well, okay,” she said, trying to soothe the younger woman. “Nobody said you weren’t, all right?”</p><p>“You did,” she sniffled.</p><p>“No, I just questioned the logic of running around blurting it out to monkeys. Dammit! Now you’ve got me using that odious word.”</p><p>“Sorry,” she said, but she seemed to be cheering up. “It’s a sore spot, I admit. There are lots of hybrids in the pack—my alpha sired one, for Rayet’s sake. They can all Change. Everybody can Change but me. And monkeys.”</p><p>“So did they—did your friends kick—ask you to leave? Because you don’t, uh, do the Change?”</p><p>“You mean, did my pack boot my ass because I’m a freak?” She smiled a little. “No. I came west because I—I saw something.”</p><p>“Was it me?” Bev asked eagerly.</p><p>“No, it wasn’t you, greedy monkey. The whole world doesn’t revolve around you. Giving you the 4-1-1 was sort of a side trip. I’m really on my way to Minneapolis.”</p><p>“What’s in Minneapolis?”</p><p>“That’s enough sharing with strangers for one day,” she said, kindly enough. “Because we both know you aren’t going to jump, why don’t you come down?”</p><p>“I’ll come down after you tell me why we’re going to Minneapolis.”</p><p>“We’re?”</p><p>“Sure! I’ll be your cool sidekick. We’ll have adventures and—”</p><p>“Stop. Go ahead and jump.”</p><p>“Awwwww, come on, Antonia,” she whined. “It’s just the thing I need.”</p><p>“It’s the last thing I need. And I don’t bargain with monkeys on Chicago rooftops, okay?”</p><p>“Okay, okay, calm down. Just tell me why you’re going and then I’ll climb down. Otherwise, if you leave, you don’t know if I’ll jump or not.”</p><p>“You won’t—”</p><p>“Just think, you could be minding your own business—”</p><p>“It’s what I should have done this morning, by Rayet!”</p><p>“—when bam! Giant killer migraine. All because you didn’t hang around and finish a conversation.” Bev slowly shook her head. “Tsk, tsk.”</p><p>Antonia scowled down at her. Bev pushed her reddish blond bangs out of her eyes so she could see if the woman was going to dart off over the rooftops to avoid communicating.</p><p>“Okay,” she said at last. “I’ll tell you why I’m going and then you climb down and go back to your life and stop with the goofing around on rooftops.”</p><p>“Deal,” she said promptly. “So why are you going to Minnesota?”</p><p>“Well... the pack lets me hang around because I’m full of useful little tidbits, you know?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I can imagine,” Bev said, impressed.</p><p>“But the problem is, I think some of them are, um, scared of me. And the ones who aren’t scared don’t like me.”</p><p>“I can imag—uh, go on.”</p><p>“So there’s the mate thing.”</p> <p>“You mean, finding a husband?”</p><p>“Yeah. It’s a real drive among us, because compared to you guys, there aren’t hardly any of us. And the thing is, nobody wants to be my mate. They don’t know if their children will, um, be like me. And it’s not like I haven’t tried to be nice to guys, right? Even though, if I fooled a guy into mating with me I wouldn’t have much respect for him. But still. It doesn’t matter if I’m nice or awful. Nobody wants to take a chance on a deformed cub.”</p><p>“Oh.” Bev’s heart broke a little for the beautiful woman leaning against the ledge. If someone that thin and that pretty can’t get married, there’s no hope for the rest of us, she thought grimly. “So maybe you’ll meet someone in Minneapolis?”</p><p>“Well, all my—my visions, I guess you’d call them. All my pictures of the future—and it really is like there’s some sort of divine camera in my head, and the pictures she takes are never wrong—anyway, they were always about somebody else. Michael, your future wife is going to be on the third floor of your building on such and such a day. Derik, you have to go save the world. Mom, if you go out driving in this weather you won’t come back. But they’re never about me, you know?”</p><p>“Sure.”</p> <p>“So, I’m twenty-five, right? That’s old to be an unmated female. And there isn’t a werewolf in Massachusetts—maybe the whole world—who wants me to bear his cubs. So I sat down last week and thought and thought. I was trying to make a vision happen, which I’d never tried before.”</p><p>“And it worked?”</p><p>“Duh, it worked. I’m here, aren’t I?”</p><p>“Oh, you’re back,” Bev said. “Good; it’s harder when I feel sorry for you.”</p><p>“Save your pity, monkey. Anyway, this thought pops into my head: If you help the queen, you’ll get what you need.”</p><p>“And?”</p> <p>“And that’s it. Well, almost it... an address popped into my head right after. So off I go.”</p><p>“To help the queen and get what you need,” Bev repeated thoughtfully.</p><p>“Yup.”</p><p>“Why aren’t you flying? Or is it so you can occasionally stop and help a monkey stop doing something silly?”</p><p>“Don’t flatter yourself. Fly? Stick myself in a tin can that hurtles through space at a zillion miles an hour, a thousand miles up on the air? Breathing recycled monkey farts and choking down peanuts?” Antonia shuddered. “No no no no no no no.”</p><p>“Werewolves are claustrophic?” Bev guessed.</p><p>“And the monkey gets a prize!” Antonia patted her, mussing her short red curls. “Good, good monkey!”</p><p>Bev knocked her hand away. “Stop that. I can’t help not being as evolved as you are.”</p> <p>“That’s true,” Antonia said cheerfully. “You can’t.”</p><p>“Is that your big problem with humans? We can’t leap tall buildings in a single bound?”</p><p>“Not hardly. Although, that’s a good one.”</p><p>“So what else?”</p><p>“This wasn’t part of our deal.”</p><p>“Yes, but...” Bev smiled at her, and Antonia actually blanched. “You’re dying to tell me. You can’t wait to tell me. So... tell me.”</p><p>“Okay, you asked for it. Not only are you not evolved— which, granted, you can’t help—but you’re the most rapacious, bloodthirsty species the planet has ever seen. You go to war over money, religion, land, and drugs. If there isn’t a war on, you make up a reason to have one. You kill when you’re not hungry, and you kill when you’re fat and don’t need it. And you stink.”</p><p>“We stink?”</p><p>“You reek. It’s awful! You don’t take enough showers, and when you do shower, you slop nine kinds of perfumed soap, body powders, scented shampoos, and aftershave or perfume all over yourselves. I had to take the subway once in Boston— never again! I had to get off after one stop—after I threw up.”</p><p>“I don’t think all of us stink,” Bev said carefully. “I think your sense of smell is developed to such a high degree that it seems like—”</p><p>“No. You all stink.”</p><p>“Oh. Well, sorry about that. Thanks for answering my questions.”</p><p>“Thanks for not jumping—I’m almost out of Advil.”</p><p>“It was nice meeting you.” Bev stuck out her hand. After an awkward moment, Antonia shook it, and Bev tried not to wince at the bone-crushing power in the woman’s grip. “Good luck with the queen.”</p><p>“Good luck with your life. You might try ratting your boss out to the IRS. He hasn’t paid taxes in five years. That could put a little excitement in your life—he’s a big fish and the feds would love to get him on that, if nothing else.”</p><p>Her boss? Which boss? She couldn’t mean... not the big guy. He had fingers in too many pies for her to count. Besides, she was just a worker bee in one of many hives.</p><p>“This is Chicago,” she explained to the werewolf. “Things are different here.”</p><p>“But you could change that,” Antonia said, climbing up on the ledge. She balanced easily for a moment, her long coat flapping in the wind. “And they have programs, the police do. They could give you a new name, a new life. Something more interesting than contemplating rooftops, anyway.”</p><p>“Yes,” she said dryly, “but there’s always the chance that he could have me killed.”</p><p>“Sounds exciting, doesn’t it?” Antonia said, and jumped. She landed on her feet in a perfect little crouch; Bev was instantly jealous. More than jealous. Sure, it was easy for the gorgeous werewolf to give career advice. It was slightly more difficult for the little people, thanks very much.</p><p>But the niggling thought</p><p>(sounds exciting, doesn’t it?)</p><p>wouldn’t go away.</p><p>Chapter 1</p><p>Antonia paused and then knocked at the door of 607 Summit Avenue. Mansions, of course, were nothing she wasn’t used to, but she had never seen an entire street of them. And this one—across from the governor’s mansion, no less—was nearly the grandest of them all.</p><p>It was white, except for enormous black shutters. Three floors that she could see from the front. Wraparound porch deep enough for couches and several rocking chairs. A detached garage as big as most people’s starter homes.</p><p>Well, a queen lives here, she reminded herself. Of course it’s going to be grand. What did you expect, a tent?</p><p>Still, it was weird. She had no idea American monkeys had started electing royals.</p><p>She didn’t bother to knock again; she could hear someone coming. The door was pulled open—the small, skinny woman had to struggle with it—and then Antonia was face-to-face with a beautiful woman (yawn... they were a dime a dozen on the Cape) with skin the color of good coffee. Her eyes were also dark and tip-tilted at the ends, giving her a regal (daresay queenlike?) air. She had cheekbones you could cut yourself on.</p><p>“Are you the queen?” Antonia asked. Dumb question; of course she was the queen, who else could be? The woman was born to be on the one dollar bill.</p><p>At least this one didn’t stink too badly—she’d had a shower that night and, even better, hadn’t drowned herself in nine kinds of powders, soaps, perfumes, and deodorants.</p><p>“I’m here to help you,” she continued when the woman didn’t say anything. “I’m Antonia Wolfton, from the Cape Cod Pack.”</p><p>The queen blinked at her, a slow-lidded, thoughtful blink, and then said, “You’d better come with me.” She turned, and Antonia followed her through an enormous entryway, down several hallways (the place smelled strongly of old wood, old wool, and Pledge), and into the largest kitchen she’d ever seen. Several people were sitting on stools, which were grouped around a long, industrial counter, bar-style.</p><p>“Guys,” the queen announced, “this is Antonia Wolfton, from the Cape Cod Pack. Hold onto your panties: She’s here to help us.”</p><p>One of them, a leggy blonde dressed in linen pants and a sleeveless white blouse, looked up from her tea. Actually, they all looked up. But it was the blonde Antonia couldn’t look away from.</p><p>And there was something going on here, wasn’t there? It wasn’t just the group, almost unnaturally still. And it wasn’t their smell—though they’d obviously gone easy on the fake scents and heavy on good, old-fashioned showers—their scents, that was it, she almost had it, could almost taste the problem, the—</p><p>She heard someone coming down the stairs and then the door about fifteen feet away swung open and a man walked in.</p><p>Well. Not walked. Loped, really. He was tall and lean, with a swimmer’s build—narrow hips and broad shoulders. Shirtless, with a fine fuzz of dark hair starting at the top of his ribs and disappearing into his jeans. He had shoulder-length, golden brown hair—sunny hair, as her pack leader’s daughter would have said—and mud-colored eyes. When he looked at her with those eyes, she had the distinct sensation of falling.</p><p>“Oh, it’s you,” she said faintly. Those eyes... they weren’t intelligent. They were just this side of savage. Oh, she liked those eyes. She just needed to fatten him up some; he was far too thin. “How’s it going, Garrett?”</p><p>“What?” the blonde said, spilling her tea. “What did you say?”</p><p>“Garrett Shea, right?” Antonia asked. “I—saw a picture of you.”</p><p>“What?” someone else said, someone with a profound bass voice, someone not to be ignored, but she couldn’t stop looking at Garrett.</p><p>Which was a good thing, because Garrett Shea picked that moment to leap at her. Really leap, too. He covered the distance between them in half a heartbeat, tackling her so hard she slammed back into the wall. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He was sitting on her chest, ignoring the pandemonium that had just erupted. His long hair swung down into his face, almost touching hers. His hands were on her shoulders.</p><p>And... he didn’t smell! He had no scent at all. Not “he recently showered and took it easy on the Mennen”—no scent. Zero scent. He smelled like a piece of paper. She had never, in her quarter-century of life, ever smelled a person who—</p><p>That’s how he got the drop on her! He could get the drop on any werewolf, and what the hell was he, anyway?</p> <p>“You’re not pack,” she told him, trying to get a breath.</p><p>“Garrett Shea?” he asked.</p><p>“Right,” she groaned. “Get off.” He was leaning in, his upper lip curling back from his teeth, and she didn’t know whether to be alarmed, afraid, pissed, or aroused. It was so damned confusing she just laid on the tile like a squashed bug.</p><p>“Shea?” he said again, almost into her neck.</p><p>“Now. Get off now.”</p> <p>“George!” someone shrieked, a drilling sound like a bad visit to the dentist. “Get the hell off her right this minute!”</p><p>“—swear I didn’t know, she just said she was here to help and I thought you guys would get a kick out of—”</p><p>“Sir, if you’ll grab a hand, and I’ll grab a hand—”</p><p>“We’ll be too slow.”</p><p>“Shea?” Garrett asked her again. His befuddled expression had entirely disappeared, leaving a look of sharp concern in its place.</p><p>Too bad; she had her legs up now, her feet resting on his belly, and she kicked out, hard, and was extremely satisfied to see him sail over the counter and crash into the tiles behind it.</p> <p>She flipped to her feet, making the dark-skinned woman flinch, and grinned as Shea slowly pulled himself up behind the counter.</p><p>“Are we going to do this now, or should we put it on our schedules for later? Because either way works for me. Actually, right now works for me.”</p><p>“Jesus,” the blonde said, making everyone but the dark-skinned woman flinch. “How many teeth do you have?”</p><p>Oh. Her smile. Monkey etiquette, monkey etiquette! Her palm shot up, covering her mouth. “Enough to get the job done, I’s‘pose. Who are you?”</p><p>“Introductions,” the bass voice said, and it belonged to a terrifying-looking man, tall and dark, a man who did not suffer fools lightly, a man who would just as soon eat you as listen to you whine. Oh, she could like this man. “They are long overdue.”</p><p>Chapter 2</p><p>The tall dark man was the king of the vampires: Sinclair. The tall blond woman was the queen: Betsy (har!). The black woman was their monkey-servant/friend/ watcher-type: Jessica. Garrett was a “Fiend” named “George.” The shorter brunette woman was an ordinary vampire, their servant, like a beta werewolf back home: Tina. They all lived together along with a monkey named Marc, who was currently “on shift.” It made much sense to Antonia; Michael and Jean-nie, her alphas, surrounded themselves with betas. They lived together like a family.</p><p>One in which she had no part.</p> <p>She shoved that thought away and it went, as she was practiced at ridding herself of that particular thought. Instead, she pondered the most fascinating thing about these oddballs: The king, the queen, and Garrett had no scent at all.</p><p>She had heard of vampires, of course, but she had never seen one. Nor did she know anyone who had ever met one—or, at least, who admitted to it. According to lore, vampires were territorial to a degree that they had convinced themselves werewolves didn’t exist. Which was perfectly fine with the werewolves.</p><p>“Well, here I am, then,” Antonia said, feeling peevish that she’d assumed the servant was the mistress. “Put me to work.”</p><p>“If you’ll give us a moment, Antonia,” the king said pleasantly, in the way leaders pretended like they were asking. “We need to ‘catch up,” as it were. You say you’re a werewolf?“</p><p>“Yes.”</p><p>“Mm-hmm. And you left your pack to serve our queen? The queen of the vampires?”</p><p>“I didn’t know she was the queen of the vampires,” Antonia explained. “That part wasn’t in the picture.”</p><p>“But you believe us? That we’re vampires?” the queen asked.</p><p>Antonia shrugged. “Sure.”</p><p>Sinclair continued. “And you get these, ah, pictures of the future? Do you have a camera of sorts?”</p><p>“Yes, my brain,” she snapped. “Which is overtaxed right now having to go through this again.”</p><p>“Do not speak that way to the king,” the tiny brunette, Tina, warned her.</p><p>“Why not? He’s not my king.”</p><p>“This is how you serve the queen?” Sinclair asked silkily. Antonia, who hardly ever noticed such things, noticed his suit: black, immaculate, and obviously made for him.</p><p>“I’m here to help the queen, not kiss your ass. I think ‘serve’ might be an exaggeration. I’m not a walking TGI Friday’s.”</p><p>The queen burst into helpless laughter, which almost made Antonia smile. Certainly, everyone else in the room was looking sour.</p><p>“That’s great,” the queen said between giggles, “but I already have more help than I can shake a stick at. I mean... well, look.” She gestured to the kitchen. “I’ve been trying to get rid of some of these bums for almost a year.”</p><p>“Some of us,” Jessica piped up, “her whole life.”</p><p>“Well, too bad. I have to help you to—to get something I want, so here I am.”</p><p>Tina leaned over and murmured something in the king’s ear. Idiots. When she said she was a werewolf, did she say she was hard of hearing, too?</p><p>“I don’t know who Dr. Spangler is, but don’t call him. There’s too many people for me to deal with as it is.”</p><p>Tina looked startled, and Jessica, who had only seen Tina’s lips move, jumped, and then said, “Well, uh, I think—we think—you might be. Uh. Crazy.”</p><p>“No no no,” Sinclair said smoothly. “That’s a harsh word, I think.”</p><p>“Confused,” Tina suggested.</p><p>“Oh, come on,” the queen said. “Give her a break. She came all the way from Maryland—”</p><p>“Massachusetts.”</p><p>“—right. And she knew George’s real name! I mean, hel-looooooo? Am I the only one who thinks that’s a really good trick? So why can’t you give her a break on this?”</p><p>“Because werewolves don’t exist,” Sinclair explained.</p><p>A short silence followed that and then Jessica said cautiously, “But you’re a vampire.”</p><p>“The existence of one does not ensure the existence of the other,” the king almost snapped. “And I can assure you, in all my long life, I’ve never seen one.”</p><p>Antonia snickered. “So that’s why we don’t exist? Because you’ve never seen one? Too bad; I thought you were smart.”</p><p>He blinked and said nothing.</p><p>“Well,” the queen said, and Antonia almost—almost— liked her. The woman was obviously pulling for her. She must be used to strangers popping up out of nowhere and making declarations. “When’s the full moon? She can, you know, get furry and make believers out of us.”</p><p>“It’s in six days,” Antonia said with a sinking feeling. “But the thing is, I can’t Change. Into a wolf, I mean.”</p><p>“Oh?” Sinclair asked with a truly diabolical smile.</p><p>“Yeah, yeah, I know how it sounds. My father was a— anyway, the pack thinks that instead of Changing, I get visions. All the disadvantages of being a werewolf, and none of the advantages,” she joked. “I might as well be a m—be a regular person.”</p><p>“Boy oh boy, you’re not making it easy for me to stick up for you,” the queen commented.</p><p>“Sorry,” Antonia said, and almost meant it.</p><p>“She isn’t,” Garrett said from his corner, and they all jumped.</p><p>“Cripes, George! I forgot you were there, you were so quiet.”</p><p>“Why are you calling him George?”</p><p>“Well, he doesn’t—uh, didn’t—talk, and ‘hey you’ got old.”</p><p>“His name’s really Garrett Shea?” Jessica asked, leaning forward. “How did you know that?”</p><p>Antonia shrugged. She wasn’t about to go into the whole “sometimes in addition to pictures, a whole fact will appear in my head, indistinguishable from something I read” thing.</p><p>As it was, they were probably about ready to toss her on her finely toned ass. She was pretty sure. It was so hard to read them! Except for Jessica, who smelled hopeful and interested, an altogether pleasing scent. But the others... nothing. It was maddening, and cool.</p><p>“Garrett,” Garrett said, nodding.</p><p>Tina and Sinclair looked at each other and then back at Antonia. “We really aren’t in the habit of letting strangers just, ah, insinuate themselves into our lives...”</p><p>The queen buried her face in her hands. She’d painted her claws lavender, a monkey habit Antonia found completely ridiculous. At least she didn’t bite them. “Oh my God, I can’t believe you’ve even got the nerve to say that.”</p><p>“That was entirely different, my love. As I was saying, this is not our normal habit, but you seem to possess information we can find useful.”</p><p>“Aw,” Antonia said. “Stop it or I’m gonna cry.”</p><p>They all looked at Jessica, for some reason, who said, “Hey, there’s plenty of room for her and then some. She’s welcome to hang.”</p><p>“Jessica owns the house,” the queen explained.</p><p>“Oh,” Antonia replied, mystified.</p><p>“And I’m sorry, you probably said your name earlier, but I didn’t catch it.”</p><p>“It’s Antonia Wolfton.”</p><p>For some reason, this made the queen blanch. “No. That’s not really your name, is it? Antonia?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What the hell’s wrong with you? If possible, you just went pale.” The woman did look ghastly... practically unattractive, which was a good trick for a good-looking, green-eyed leggy blonde.</p><p>“Nothing. Uh, nothing.”</p><p>“I mean, you’re the queen, your name is Betsy, and you’ve got a problem with my name?”</p> <p>“No, not at all, it’s a great name. Um, can I call you Toni?”</p><p>“No,” Antonia said. “You can’t.”</p><p>Chapter 3</p><p>Okay, so here’s your room while you want to stay with us, and the bathroom’s right here...“ The queen stepped back out through the doorway, pointed to her left, and then stepped back into the room, a largish bedroom with green and gold-flecked wallpaper. Antonia liked it at once; the walls were the color of the forest in mid-afternoon. ”Sorry it’s not attached, but it’s your own private bathroom so you won’t have to share it with anybody. And, uh, I guess that’s it. Agh!“</p><p>Antonia spun around. Garrett had followed them up. “That’s going to get real fucking annoying,” she warned him.</p> <p>He smiled at her in response.</p><p>“Bad George! How many times do I have to tell you not to creep around like that? You’ll give everybody heart attacks. Bad, bad Fiend!”</p><p>“Why are you talking to him like a dog that pissed on the rug?” she demanded.</p><p>“Uh...” Betsy (the queen... har!) looked flustered. “You’re right, I’m sorry. It’s just that we’re so used to him being more like an animal than a person. Up until a couple months ago, he never talked at all. Not a single word, nothing. Heck, he didn’t even walk! Then he said something—”</p><p>“What?”</p><p>“ ‘Red, please.” He’s into crafts. Long story. Actually, it’s a short story: He likes to knit and crochet, and he was out of yarn. So anyway, he says this, right, and we all freak out. Right? Then, nothing. Then you show up, and you’re all, hidey ho, how’s it hanging, Garrett? And he freaks out and jumps you! You gotta understand, in addition to not talking, he’s never done that before, either, unless he was bringing down prey or protecting me. He’s like a lion with a gazelle when it comes to rapists. I dunno, it’s weird. Anyway—“</p> <p>“Not having to take a breath,” Antonia commented, “must come in really handy for you.”</p><p>“Like you wouldn’t believe. Anyway, you can understand why we’re all a little freaked out.”</p><p>“Sure, I guess.” She was still mystified. At home, when a stranger showed up, you let them stay as long as they liked, no questions asked. She reminded herself that vampires and monkeys were different. Duh. And Garrett, even for a vampire, was the most different of all. Interesting.</p><p>“Antonia,” Garrett said. They both waited, but that was apparently all he had on his mind. She took another look at him. Brought down rapists, did he? Not much of a talker?</p><p>Mmmmm.</p><p>“You’ve got great hair,” she told him. “A girl could fall in love.”</p><p>He smiled at her again.</p><p>“Agh, don’t do that,” Betsy said. “I swear, his grin is as creepy as yours.”</p> <p>“He’s got a nice smile,” Antonia said defensively. “It’s just right: friendly, but not aggressive.”</p><p>“Uh-huh, sure. Well, I’ll let you get settled, and—”</p><p>“I don’t need to get settled. I need to help you. What are you doing now?”</p><p>Betsy looked startled. “Now now?”</p><p>“Yeah, now now. Because I’m stuck to you like a squashed bug until—until whenever.”</p><p>She shrugged. “You know, a year ago, this would have seemed incredibly bizarre to me, but no longer. Now I take it all in stride, bay-bee! You want to help? Come on. Not you, Geor—Garrett. You’ll just make a mess of things.”</p><p>Garrett ignored her, which Antonia thought was just adorable.</p><p>Chapter 4</p><p>Oh no no no,“ Antonia groaned. ”Isn’t there a bullet I can take for you or a knife in the ribs or something?“</p><p>“Hey, you wanted to help, so you’re helping.”</p><p>“I don’t think so,” Jessica said, looking her up and down critically. “The blue makes her look washed out. Which, we can all agree, is not a problem I myself have. But it’s not so good on your model.”</p><p>“Go back and change into the yellow one,” Betsy said.</p><p>“Fuck this shit,” Antonia snapped. “I seriously doubt this is what the gods or whoever had in mind when they sent me a vision of helping you.”</p><p>“Sez you. Go change.”</p><p>She stomped back into the small sitting room, ripped the ice blue bridesmaid gown off, and struggled into the piss-yellow one. This, this was her punishment for every bad thought, word, and deed she had ever thought, said, and committed. Fucking bridesmaid gowns!</p><p>She slouched out into the larger room, and both women immediately said, “No.”</p><p>“Why’d they even send that one over, anyway?” Betsy asked. “It’s awful. Nobody can wear that color.”</p><p>“Because they want a big fat commission, so better to send too many instead of not enough. Why don’t you try the black one?” Jessica suggested.</p><p>“Why don’t I make a rope out of this one and hang myself?”</p><p>“Quit bitching,” the queen ordered, “and go change. And hurry it up; we don’t have all night.”</p><p>Jessica laughed. “Actually, we do.”</p><p>“Well, that’s true, but never mind. Change, please.” At Antonia’s poisonous glare, she added, “I meant dresses. That wasn’t some kind of werewolf put-down.”</p><p>“Better not have been,” she muttered and stomped back to the sitting room.</p><p>“So, uh.” Jessica was speaking with forced casualness, which smelled like oranges on fire. “When did you figure out that you weren’t, uh, going to turn into a wolf ever? I mean, you’re pretty young.”</p><p>She had to laugh at that one. “I’m old for an unmated werewolf.”</p><p>“Oh. Because I was thinking, maybe you just haven’t had a, uh, chance to, you know. Change.”</p><p>“It happens with puberty.”</p><p>“Puberty?” Betsy echoed.</p><p>Antonia was wrestling with the zipper. “Yeah, you know. Hair in new places, things get bigger, and suddenly you’re thinking about boys. Don’t worry, it’ll happen for you soon.”</p><p>“Okay, okay, you don’t have to be a jerk about it.”</p><p>“Yes she does,” Jessica whispered, having no idea that Antonia could hear her perfectly well.</p><p>“So you were a teenager and you never Changed?”</p><p>“Not once.” At last! The thing was on. Hmm, not to bad. She studied herself in the mirror; she looked like one of those old pictures of a Greek stature. The dress was simple; no ruffles or fluffs. Straight across the boobs, falling to her hips, and then falling to the floor. And the deepest black, so black it made her skin glow.</p><p>“This one isn’t horrible,” she said, stepping out.</p><p>“No!” Betsy cried. “Black bridesmaid dresses at a vampire wedding? How cliched can you get? I mean, it looks great on you, Toni—”</p><p>“Stop trying that, it won’t work. An-TONE-ee-uh.”</p><p>“—but I just can’t do it.”</p><p>“Why are you even getting married? You’re already the king and queen, right?”</p><p>“It’s a long, horrible story,” Betsy said, “and I don’t have any alcohol, so I’m not telling it.”</p><p>“Maybe that dress in a different color?” Jessica suggested.</p><p>“Maybe.” Betsy got up and started circling Antonia, which she thought (but didn’t say) was extremely rude in her culture. “It does look great on her. And it helps, frankly, that all my bridesmaids are fabulous-looking.”</p><p>“Well, that’s true,” Jessica said modestly. “But Tina and I are short.”</p><p>“Andrea’s tall, though.”</p><p>“Yeah, but still. Tina and I won’t look as, uh, what’s the word? Stately. With this cut of gown, I mean.”</p><p>“I don’t know,” Betsy said, prowling around Antonia like a panther. “It’s a great dress. Good cut, good lines. Probably look good on everybody.”</p><p>“I thought we agreed that no dress looks good on everybody. You’ve got a short skinny black gal, a short brunette, and a tall blonde walking down the aisle in front of you.”</p><p>“You are really thin,” Antonia informed her. “Where I’m from, they’d hunt for you and be sure you ate everything brought to you.”</p><p>“Thanks for that,” Jessica snapped. “I can’t help my metabolism any more than Oprah can help hers, so hush up.”</p><p>“Hey, I was being nice!”</p><p>“That’s nice for you? Jesus.”</p><p>“What colors do you think we should try the dress in?” Betsy said, jumping in. Too bad. Antonia was hungry for a fight, but a catfight would have been a fine substitute. “Emerald green? Royal blue? Red? No, that’s another cliche. I have to say, Antonia,” she added, looking her up and down, “you’re one of the most gorgeous women I’ve ever seen. And that’s saying something around here.”</p><p>She shrugged. This was nothing new, and it was inevitably followed by “too bad you’re such a grump” or “it’s so unfortunate you’re not a complete woman” or “at least you’ve got your looks.”</p><p>“Too bad you’re such a grouch,” Jessica added.</p><p>Antonia rolled her eyes. “Can I get dressed now?”</p><p>“Yeah, I think we’re done.”</p><p>“Don’t tease,” she warned.</p><p>“What a baby!” Jessica hooted. “We’ve been at this barely two hours.”</p><p>“We’ve? You haven’t done shit, just stood around running your gums. I’ve been doing all the work.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“In return for free room and board, which is not such a bad deal, I might add.”</p><p>Antonia snorted but had no comeback for that, so instead she said, “We’re really done? You’re not just yanking my chain?”</p><p>The queen looked shocked. “Not about wedding matters. Never!”</p> <p>When she went back to the sitting room, Garrett was waiting for her.</p><p>Chapter 5</p><p>She blinked at him. There was one door to the sitting d^^?i^ room, and he would have had to get past the three of them to get in. She had no idea how he’d slipped by. That lack of scent was maddening, not to mention a real asset.</p><p>“Antonia,” he said.</p><p>“Shhhh,” she said, jerking a thumb over her shoulder. “They’re right in the next room, I’m sorry to say.” She started wriggling out of the dress. “This is so completely not what I had in mind by helping the queen, I can tell you that right fucking now. I assumed she’d be attacked and I’d save her with my superior—” She realized she was standing in her underwear and he was staring at her.</p> <p>Stupid monkey customs! Apparently it even bothered dead monkeys, the whole no-clothes thing. Although, strange, she hadn’t thought of Garrett as a monkey before. But of course he was. Right? A dead monkey was still—</p><p>Well, that wasn’t true at all, and she knew it well. He was stronger, faster, quicker. He didn’t babble until she felt like ripping out her own throat, he didn’t fret, he didn’t want to talk about her feelings, he didn’t make war to get more money and then pretend it was to help people. He was just... Garrett.</p><p>“I’m sorry,” she whispered, reaching for her shirt. “I forgot that—look, where I come from—which admittedly isn’t here— nobody really cares about nudity. But I’ll try to remember in the future—”</p><p>“Pretty,” Garrett said and grabbed her arm, which startled her into dropping her shirt. She hadn’t even seen him start to move. Now, why was that thrilling instead of frightening?</p><p>“Thanks,” she said, “but really, I get that all the time.”</p><p>“So?” he asked and pulled again. Now she was in his arms, and his cool mouth was on hers, and his hands were moving in her hair, restlessly, almost tugging.</p> <p>“Yeah,” she said into his mouth. “That’ll work.”</p><p>“What’s taking so long in there?” Betsy hollered.</p><p>“And when you’re done kissing me,” she said, pulling back and looking into his eyes, which struck her now as more chocolate-colored than mud-colored,“could you drive that hanger into my ear until I can’t hear her anymore?”</p><p>“No,” he said and kissed her again. Which she privately thought made the whole stupid trip worthwhile.</p><p>Chapter 6</p><p>There was a polite rap at the door; she could smell a</p><p>single youngish man, blood, and vomit. It was six</p><p>o’clock in the morning; everyone had gone to bed (to coffin?)</p> <p>but her. Jessica, she had since learned, adjusted her sleeping</p><p>schedule to the vampires‘, and Betsy usually went to bed early.</p><p>With her charge out of commission until dawn, Antonia found herself putzing about in her room with absolutely nothing to do. She cursed herself for not stocking up on magazines before she came to the house.</p><p>There was another knock, interrupting her thoughts. “Come,” she called.</p><p>The door swung open, and a twenty-something dark-haired man of average height (wasn’t Minnesota supposed to be the land of blondes? What was with all the brunettes?), wearing pea-green hospital scrubs and scuffed tennis shoes, stood framed in the doorway. Interestingly, his stethoscope was still around his neck.</p><p>“You smell like puke,” she informed him.</p><p>“You must be Antonia,” he replied, grinning. He held out his hand, and she reluctantly shook it. “I’m Marc Spangler. Dr. Spangler, which is why I reek. I swear, I thought the nurse was going to grab the emesis basin in time, but, as so often in my life, I was sadly wrong.”</p><p>She laughed in spite of herself. “That’s too bad. So you spend your days getting puked on?”</p><p>“And peed on, and shat on, and bled on,” he said cheerfully. “But hey, the pay sucks and the hours are horrible, so it all works out. Luckily, my rent is low.”</p><p>She laughed again. “What can I do for you, doctor?”</p><p>“Oooooh, almost polite and everything! That’s funny, I was warned about you.”</p><p>“Pussies,” she scoffed.</p><p>“Mmm. Well, today I gotta earn my keep—Sinclair asked me to take a look at you. So if you don’t mind.” He didn’t trail off, as people usually did when they said such a thing. And she realized that, in his laid-back way, he wasn’t really asking.</p><p>“I’m not crazy,” she said. “And you’re not a shrink, I bet.”</p><p>“No, just a garden-variety E.R. rez. But what the hell, it’ll make the big guy feel better, right?”</p><p>She rolled her eyes. “Right. Get on with it.”</p><p>He took her pulse and blood pressure and listened to her heart and lungs. He chatted with her about this and that, and she wasn’t supposed to notice that he was checking for depression, schizophrenia, paranoia, or delusional thinking.</p><p>“Look, I’m flunking your little mental health checklist,” she told him, rolling her sleeve back down, “because I do believe things most people don’t, I do think people are out to get me, and I’m really bummed about my life, which is why I’m here.”</p><p>“Yeah, but on the bright side, your vitals are all textbook perfect. You’ve got the heart and lungs of a track star.”</p><p>“Well,” she said, shrugging modestly. “Superior life form and all that.”</p><p>“Descended from wolves, is that right?”</p><p>She rolled her eyes and didn’t answer.</p><p>“Uh-huh. But of all the werewolves—and there aren’t very many—but of all of them, only you don’t turn into a wolf during the full moon. Instead, you can see the future.”</p><p>She sighed. “I know how it sounds.”</p><p>“It sounds like you’re loony tunes,” he told her gleefully, “but who am I to judge? I live with vampires.”</p><p>She smiled at him. She liked him, and on short acquaintance, too! Unheard of. “That’s true,” she replied. “So what are you telling the king?”</p><p>“That you’re the picture of health, but I have no idea if you’re crazy or not. For what it’s worth, you don’t seem like a drooling psychopath.”</p><p>“Aw.”</p><p>“Time will tell,” he went on perkily. “Just when I thought it was getting dull around here, too. I mean, how many times can Betsy obsess over her bouquet?”</p><p>She didn’t answer him; she was looking at the picture that had popped into her head. “Dr. Spangler,” she said after a few seconds.</p><p>“Hon, call me Marc. Dr. Spangler is—no one I know, actually, but it’s weird, anyway.”</p><p>She reached out and touched his arm, gently, she thought, but he ow’ed and pulled away. “Youch! Hon, you don’t know your own strength.”</p><p>“Call security before you treat your first patient. Have them check his coat pockets. Understand? Because if you don’t...” She was rubbing her temples in anticipation of the headache to follow if he ignored her, not to mention the aggravation of funeral arrangements and Betsy’s hysterics. “If you don’t, your first patient will be your last—stop that!”</p><p>He had whipped the stethoscope out and was listening to her heart. She pulled away. “Did you hear what I said?”</p><p>“Yup. Did you know your pulse goes way, way up when you’re having one of those visions or whatever?”</p><p>“Yes,” she said and escorted him out. “Remember what I said!” she yelled at him and shut the door before he could bug her with more questions.</p><p>Chapter 7</p><p>And the guy had not one, ladies and gents, but two guns on him! And every other word was the ‘MF’ word. It was like a bad episode of Deadwood.“</p><p>It was the wee hours of the next morning, an hour or so away from dawn. Jessica and Betsy were listening, slack-jawed. Tina and Sinclair were hiding their emotions a little better but couldn’t conceal their interest. Antonia yawned, bored.</p><p>“A thirty-eight and a forty-five, for the love of Pete! And I’ll tell you what, the minute I’dve tried to Foley him, he would have blown my brains all over the wall. Which would have improved the color scheme, but that’s about it.”</p><p>“And Antonia told you this would happen?” Sinclair asked carefully.</p><p>“Yes!”</p><p>“No,” Antonia said. “I told you to have security check your first patient’s coat. That’s what I saw: them checking his coat. For all I knew, they would have found a pack of Chiclets.”</p><p>“You saved him,” Betsy breathed.</p><p>“They were only guns.” Oh, wait. Guns were taken a little more seriously by the regulars. “Hmm, maybe I did.” She waited. They all waited. Finally, she said, “But I don’t feel any better. I mean, I don’t feel like I got what I wanted.”</p><p>“Is it an instant kind of thing?” Betsy wondered. “Boom, you’re satisfied and you go home?”</p><p>“What do you want?” Tina asked.</p><p>She shrugged, partly because she wasn’t one hundred percent certain, partly because it was nobody’s damned business, and partly because the truth—if it was the truth—was embarrassing. How do you tell strangers you want to belong, you want friends and a family who weren’t afraid of you?</p><p>“Well, saving Marc certainly helped me out,” Betsy said. “Thanks.”</p><p>“No,” Sinclair said.</p><p>“Oh, that’s nice,” Marc sniped.</p><p>“Don’t misunderstand, Dr. Spangler, but I fail to see how saving your life directly helps Elizabeth.”</p><p>“That’s a lot better,” Antonia told her. “You should use that instead of Betsy. Betsy’s lame.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh, shut up,” Betsy told her. “And Sinclair, what are you talking about?”</p><p>“I guess he’s right,” Marc said reluctantly. “Me being dead might have bummed you out, but you would have gone on.”</p><p>“And on, and on, and on,” Betsy said glumly.</p> <p>“So saving Marc was a bonus? You’re really here to do something else?” Jessica asked.</p><p>Antonia shrugged.</p><p>“Fascinating,” Sinclair commented.</p><p>“Honey, as soon as the bars open tonight, I’m buying.”</p><p>“I don’t drink,” Antonia told him. “And you’re nuts if you do. You do know alcohol is a poison, right? Aren’t you supposed to be a physician?”</p> <p>“Oh, good,” Jessica said. “A sanctimonious soothsayer. Those are the best kind.”</p><p>“See if I ever warn you of mortal danger.”</p><p>“You do know I’m the only thing between you and another gown fitting, right, Fuzzy?”</p><p>She smiled; she couldn’t help it. It was the first time she could recall joking about not warning someone about impending doom, and the someone in question taking it the way she meant it: as a joke.</p><p>The pack honestly worried she would see someone’s death and not warn them out of spite. This both puzzled and upset her—she might not be Little Miss Sunshine, but she would never, ever keep such an awful secret. How could her own pack so misunderstand her motives and actions? She’d grown up with them. And what could she do about it? She was too old to</p><p>Change.</p> <p>“Fine,” Marc was saying. “Virgin daiquiris all around.” “Strawberry?” Sinclair asked hopefully, and Betsy laughed</p><p>and got up and brought out multiple blenders.</p><p>Chapter 8</p><p>You make him sleep in the basement?“ Antonia practically roared.</p><p>“We don’t make him do anything,” Betsy explained patiently. “He’s definitely his own Fiend. Guy. Whatever.”</p><p>“Oh.” Slightly mollified, Antonia calmed down.</p><p>“Besides, if he’s out and about when the sun comes up... poof. At least in the basement, I don’t have to worry that he’s lost track of time. I mean, does he even tell time?”</p><p>“Try giving him a watch.”</p> <p>“I guess. In the past, he’d nibble on whatever we gave him... books, magazines, clothes. He’s way ahead of the other Fiends now, though.”</p><p>“What is a Fiend?”</p><p>They were strolling along Hennepin Avenue in Minneapolis, as far away from the police station as they could get and still be in the neighborhood. Bait. The queen of the vampires, interestingly, had a thing about drinking blood: she only did it in response to attempted assault.</p><p>“Well, the guy in charge before Sinclair and I took over was a real psycho.” Betsy was tripping along daintily in ludicrous shoes for city-walking: buttercup yellow pumps with black stripes along the sides. “And he was into experimenting on his subjects, like any psycho. And apparently how you make a Fiend is—it’s so awful that I know this—you take a newly risen vampire, and you don’t let them feed for a few years. And—and they go crazy, I guess. They turn feral. Forget how to walk, forget how to talk—”</p><p>Antonia wrinkled her nose; the three punks following them had too much garlic on their pizza. And their guns hadn’t been cleaned in forever; they stank of old oil and powder. “But George can talk and walk. Well, he talks a little.”</p><p>“Yeah, now. See, for whatever reason, George wouldn’t stay with the other Fiends. We had them sort of penned up on Nostro’s grounds.”</p><p>“He agreed to this when you took over?” she asked, startled. Vampires were weird!</p><p>“He didn’t agree to shit; he’s dead.”</p><p>“Oh.” Appeased, Antonia hurried her gait, pretending to be nervous. The jerks quickened their pace, whispering to each other. “So Garrett wouldn’t stay with the other Fiends... ?”</p><p>“Right, he kept getting off the grounds. And one night he followed me home. And I let him feed off me—yuck!”</p><p>“Yuck,” she mused.</p><p>“And he started to get better. And then my sister Laura let him feed off her, and he got really better—that’s when he talked.”</p><p>“Oh, your sister’s a vampire?”</p><p>“No,” Betsy said shortly, and Antonia knew that was all to be said on that subject. “Anyway, he was always different from the others. And now he’s really really different. And then you came.”</p><p>“And then I came.” She whirled, picked up one of the thugs, and tossed him. He skidded to an abrupt halt, courtesy of the unlit streetlight.</p><p>“Antonia!” Betsy shrilled. “You’re supposed to wait until he attacks us!”</p><p>“He was just about to,” she said defensively. She smacked the gun out of the other’s hand, almost smiling when she heard the metacarpals break.</p><p>The third, predictably, took to his heels.</p><p>“Well, there you go,” she said, gesturing to the two moaning, crying attackers. “Take your pick.”</p><p>“I don’t think this is how you’re supposed to help me, either,” Betsy snapped, mincing over to the one by the streetlight.</p><p>“You’re right, this was a freebie. Bon appetit.”</p><p>“Go over there,” she grumbled.</p><p>“You mean in the corner that smells like piss?”</p><p>“I can’t do it in front of you,” the queen of the vampires whined.</p><p>“Are you kidding me? You’re kidding me, right?” Antonia paused. “You’re not kidding.”</p><p>Betsy pointed. “The quicker you go over there and don’t look, the quicker we can get out of here.”</p><p>“I think it’s fair to say nobody’s ever sent me to the corner before.”</p><p>Betsy snickered. “Nobody puts Baby in a corner.”</p><p>“What?”</p><p>“Nothing. Monkey culture.”</p><p>The guy by the streetlight groaned and flopped over like a landed trout. The one with the broken hand had passed out from the pain. “I guess I’ll be in the corner, then.”</p><p>“This is quite a life I’ve made for myself,” Betsy muttered and stomped over to the streetlight.</p><p>Antonia yawned and ignored the groans and slurping. When the queen was finished, Antonia walked back to her. “Ready to go?”</p><p>Interestingly, Betsy looked... what was it? Mortified. “I’m sorry you had to see that.”</p><p>“You sent me to the corner,” she reminded her. “I only heard.”</p><p>“Yeah, but... it’s gross. It’s so, so gross.” She covered her eyes for a moment and then looked up. “Except...”</p><p>“When it’s with Sinclair,” she guessed.</p><p>“Yeah. Yeah! How’d you know?”</p><p>Antonia tapped the side of her nose.</p><p>“Yuck. I mean, great! Wait a minute. I thought you couldn’t smell us.”</p><p>“I can just barely smell your blood. Which was on him, last night. Don’t worry. What do I care? You’re vampires, for crying out loud, why wouldn’t you share blood?”</p><p>“We’re not going to talk about this,” Betsy declared and went clicking off down the street in her silly shoes.</p><p>Antonia hurried to catch up. “You don’t have to be embarrassed. It’s your nature now. I mean, I like my steaks raw, and you don’t see me apologizing.”</p><p>“Different thing.”</p><p>“Totally the same thing.”</p><p>“And already, you’ve been hanging around me too long. You said totally!”</p><p>“I totally did not.” She reached out and touched Betsy’s chin. “You missed a spot.”</p><p>Betsy flinched back, newly self-conscious, and then forced a smile. “Thanks.”</p><p>They walked in silence for a minute and then Betsy asked, “You really weren’t grossed out?”</p><p>“Are you kidding? My high school graduation was gorier than that.”</p><p>Antonia was amused to see Betsy could skip in high heels.</p><p>Chapter 9</p><p>They returned a couple hours before dawn, about the time Jessica brought out a large bag full of yarn skeins.</p><p>“I’ll take them down,” Antonia offered.</p><p>“That’s all right, I’ll do it.”</p><p>She yanked the bag out of Jessica’s hands, nearly sending the smaller woman sprawling. “I insist. Besides, it’s another way to earn my keep.”</p><p>“Yeah, whatever,” Jessica grumped, rubbing her elbow. “I hope you trip on the stairs and die.”</p><p>“Thanks for that.”</p><p>The funny thing was, she was in such a hurry to get to the basement and see Garrett, she almost did trip.</p><p>For nothing: He wasn’t there.</p><p>She looked everywhere, listening as hard as she could, frustrated because her sense of smell was useless. It was a big basement—it ran the length of the house and had lots of little rooms and nooks and crannies—and searching it took a long time.</p><p>Finally, she gave up, left the yarn bag on one of the tables, and trudged up to her room.</p><p>To find Garrett crouched on her desk, his toes on the very edge, perfectly balanced like a vulture, his arms clasped across his knees, his gaze nailed to the doorway.</p><p>“There,” he said comfortably, as she shut the door and tried not to wet her pants in surprise.</p><p>“I’ve been looking everywhere for you, dope! If they knew you were out of your little basement cell, they would fucking freak out, get me?”</p><p>“Get you,” he said and soared off the desk at her. She ducked, and he slammed into the door and slid to the carpet.</p><p>“Ha!” she crowed, slipping out of her coat and dancing around his prone form. “I’m not that kind of girl. Serves you right.”</p><p>He bounded to his feet in one smooth motion and pounced on her again. Shrieking with laughter, she let herself be borne back on the bed. “Oh, what the hell,” she said, putting her arms around him. “I am that kind of girl.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He nuzzled her neck and, though she was expecting it, she was still surprised when he bit her. She was also surprised at how terrific it felt. Always before she’d had contempt for prey, for bottoms, for victims. But letting herself be taken, letting him get what he needed from her—it was exciting in a completely different way. Always before she’d been the wolf; now she was the rabbit, and it was very fine.</p><p>She buried her fingers in his long hair, marveling at the feel of it, the silky texture, and he snuggled her closer to him. His teeth were sharp, but his arms around her were gentle, almost careful.</p><p>“Wait,” she said, but he ignored her and kept drinking.</p> <p>“Okay,” she said, “but I have a limited number of underpants, so don’t—shit!” She heard the tell-tale rrrrrrip and, out of spite (and, okay, some lust... okay, a lot of lust) ripped through his blue jeans in exactly the same way. “If you have any money at all,” she informed him, wriggling beneath him so they could match up, “you’re buying me new clothes.”</p><p>She reached down and felt him, cool and hard, which was startling and sexy at the same time. He hummed against her neck, and his grip shifted, from gentle to urgent, and then he was pushing against her, shoving, and she wrapped her legs around his waist to help him, to help herself. They groaned in unison and then she felt him slide all the way home, and that was worth the stupid trip, too.</p><p>He arched above her, her blood running down his chin, and she jerked his head down, licked it away, and met him thrust for thrust. He kissed her bite mark, and she heard him mutter, “Pretty.”</p><p>“Back atcha,” she gasped back, her orgasm very close, shockingly close, and then she was clutching at him so hard she heard something snap and realized with dim horror that she’d dislocated his shoulder. Then she realized that he hadn’t noticed, or cared, because his thrusts had sped up and his hands were hurting her, bruising her, and she didn’t much care, either. Then they were arching together and shuddering at the same moment, and then they were done.</p><p>After a minute in which she caught her breath and he popped his shoulder back in without so much as a change of expression, she groaned, “I’m so sorry about that.”</p> <p>“Why?”</p><p>“I didn’t mean to hurt you. That badly, I mean.”</p><p>“So?”</p><p>She looked at him, and he looked back at her, two night creatures who could see each other perfectly well in the dark.</p><p>She smiled. “Boy, you’re just the perfect man, aren’t you?”</p><p>“Yes.”</p> <p>“And so modest!”</p><p>“No.”</p><p>“Want to go again?”</p><p>“Yes.”</p><p>She grinned. “I’ll bet. Listen, Betsy said you followed her home... you saved her a couple times. It’s no big deal, I’m just curious...”</p><p>“Lie.”</p><p>“Okay, okay, don’t nag. Yes, it’s a big deal. Do you love her?”</p><p>“Yes.”</p> <p>So. That was that. The perfect man was in love with someone else. Of course. And the queen, of course, thought of him as a highly evolved dog. Of course. And she... she was fucked.</p><p>Chapter 10</p><p>They spent the night together, trying to hurt each other in various ways, to the extreme satisfaction of both. Antonia, who had been warned again and again</p><p>(never with monkeys; they’re fragile)</p><p>found vampires to be fragile, but they healed so quickly it hardly mattered.</p><p>And just when she was wondering what to do about the filmy curtains on her east-facing windows, Garrett yawned, showing long, catlike fangs, and crawled beneath her bed.</p><p>“I guess that’s that,” she said. “Hey—there really is a monster under the bed!”</p><p>There was no answer, so she got up, showered, dressed in her last outfit (she’d have to shop today—ugh—or borrow something), and went downstairs.</p><p>Sinclair was still up, reading the Wall Street Journal of all the tremendously dull things. She’d read a shampoo bottle before she’d even look at that paper.</p><p>“Good morning, Antonia.”</p><p>“Hey.” She fixed herself a glass of chocolate milk, stirred through the other papers on the counter, and finally picked the Minneapolis Star Tribune.</p><p>He said, without looking at her, “That’s a nasty bite.”</p><p>“MYOB, king who isn’t my king.”</p><p>“It was just an observation,” he said mildly. “But you should know, Tina isn’t in, ah, things for the, ah, long haul.”</p><p>“What?”</p><p>“You are a stunning woman, but the very fact that your presence here is a temporary one would be, ah, attractive to her. I hope my candor hasn’t offended you.”</p><p>She sipped her milk dispassionately and thought about what fun could be had if she let him keep his silly idea. Then she compared it to the fun of telling him the truth.</p><p>“I didn’t spend the night with Tina, numb nuts. I spent it with Garrett. That’s all so fascinating about Tina not being able to commit, Mr. Nosy, but I don’t swing that way.”</p><p>“Oh.” The paper rattled. Score! He hadn’t seen that one coming at all. Har! “Well. That’s. Well.”</p><p>“Not that it’s any of your business.”</p><p>“Right.”</p><p>“Because it’s not.”</p><p>“Yes.”</p><p>“The only reason I’m even telling you is because you were nice enough to give me some advice. Totally unasked for advice, but never mind.”</p><p>He looked started. “Did you just say totally?”</p><p>“No.”</p><p>They sat in silence for a while, Antonia wondering about blood sharing and the nature of Fiends. If Betsy’s blood had helped him, and Laura—whoever she was—had helped him, what might werewolf blood do? Anything? Nothing?</p><p>She jumped when Sinclair broke the silence. “To answer your question—”</p><p>“I didn’t say anything,” she said, startled.</p><p>“—I have no idea what your blood would do to Garrett. Or not do.”</p><p>“That’s really annoying,” she snapped. “I wasn’t talking to you. I was just sitting here minding my own business. Your problem is, everybody’s so busy kissing your ass, they don’t tell you to cut the shit.”</p><p>“On the contrary,” he said, completely unruffled—dammit! She was longing for a fight. “My charming bride-to-be tells me to cut the shit on a near-constant basis. My question for you, Antonia, is why you’re even wondering about it.”</p><p>“Why?” She was startled and then angry she didn’t see the question coming. “Why? Well, I don’t know... as long as I’m in town, you know. Couldn’t hurt, right?”</p><p>He smiled at her. It was a perfectly nice smile, not at all the rich promise of lust he’d given Betsy the night before, but she still felt a stab. Lower. “Do unto others, as we monkeys like to say?”</p><p>“You’re not monkeys,” she said, shocked. “Well. Jessica and Marc—I mean, I’m sorry.” She was flustered, and even a little shamed... she had obviously been overusing the rude word. “I don’t even think of you as—look, can we get off this? If I offended you, I’m sorry.”</p><p>“You’re clueless,” he said, picking up the paper with a rattle, “not sorry. You poor thing.”</p><p>She fumed through the rest of her breakfast and bolted as soon as she could.</p><p>Chapter 11</p><p>“Stop staring.”</p><p>“I wasn’t,” Jessica whined.</p><p>“Yes, you were.”</p><p>“Well, I heard you had a bite mark. But I don’t see a thing.” “Superior life form,” she reminded them. “It’s long gone.” It was the next night, and they were going through Betsy’s</p><p>closet, looking for clothes Antonia might borrow. It was all so</p><p>girlfriend-ish she thought she might puke. But the alternative—</p><p>shopping—was ever so much worse.</p><p>“This is the most ridiculous thing I’ve ever seen,” she said,</p><p>peering into Betsy’s closet and counting at least a hundred pairs of shoes. “Those look expensive. You walk through dog shit in those things?”</p><p>“Why do you think she needs so many of them?” Jess asked brightly. She put a rainbow-colored stack of T-shirts on the bed. “Those should work.”</p><p>“I’ve got a bunch of leggings and stuff you can borrow, too,” Betsy said, muffled from the closet, “but I draw the line at lending you my panties.”</p><p>“I’ll go to Wal-Mart or something later.”</p><p>Jessica, who was both rich and a snob, was unable to conceal her shudder.</p><p>“Knock it off, Jessica. You’re in no position to look down on anybody. Not if you can’t run a mile in less than a minute.”</p><p>“I could if I wanted,” Betsy bragged from the closet. “I just don’t want to.”</p><p>“You can’t do shit in those shoes,” Antonia snapped back.</p><p>“Hey, there’s a perfectly nice Super 8 over on Grand, if ever you feel the need to, you know, get the hell out.”</p><p>“Would that I could,” she grumped, but she was secretly pleased. It was like—like they were friends or something. They were grateful she’d helped Marc. They didn’t pry (much) into her sex life. Nobody was worried about her having a defective cub. Nobody cared that she was running out of clothes and needed to borrow. It was—er, what was the word? Nice.</p><p>“There’s something I’ve been meaning to ask,” Jessica said. “Let me see if I’ve got this straight, calling one of us a ‘monkey’ is like using the ‘N’ word?”</p><p>“Sure,” Antonia said. “Another way to look at it is, if I’m doing it, chances are, it’s socially unacceptable. Seriously. I am not the role model for any of you.”</p><p>“The ‘N’ word, huh?” Jessica mused.</p><p>“I don’t think we should be talking about this,” Betsy said nervously, emerging from the closet with an armful of slacks on hangers. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Relax, white girl. I’m curious, is all.”</p><p>“Look, it’s really really rude, and I’m trying to cut down, okay?”</p><p>Betsy was too curious to drop the subject. “So compared to you guys, we’re slow, and not too bright, and we can’t smell at all, and we stink, and we’re really wimpy.”</p> <p>Antonia noticed Betsy said “you guys” in reference to herself as well. Interesting. “Well... yeah. But, uh, we know you guys can’t help it.”</p><p>“So it’s like being born blind?” Jessica asked dryly. “Poor things, blah-blah, better luck next life?”</p><p>“Pretty much.”</p><p>“But where do you fit in? A werewolf who’s never a wolf?”</p><p>“I don’t know,” Antonia said and then shocked herself as much as anyone when she burst into tears.</p> <p>“Oh my God!” Betsy almost screamed. “I’m so sorry! Don’t cry. Please please don’t cry.”</p><p>“I’m not crying,” Antonia sobbed. “I never cry.”</p><p>Jessica leaned across the bed and awkwardly patted her on the back. “There, there, honey. It’s gonna be fine.”</p><p>“Totally fine!” Betsy endorsed. “Totally, totally! Please don’t do that!”</p><p>“I’m not,” she said, crying harder.</p><p>“Okay, so you’re not crying.” Jessica held up a navy blue tank top. “What do you think of this one?”</p> <p>“I hate it,” she sobbed.</p><p>“Not into blue, eh?”</p><p>“Jessica, can’t you see she’s really upset?”</p><p>“Can’t you see she doesn’t want to talk about it?”</p><p>“Why did he have to fall in love with you?”</p><p>“What?” the women said in unison.</p><p>“I said, why did you have to show me anything blue?”</p><p>“Well, jeez, we didn’t think you’d get so upset,” Betsy said. “A tough honey like you?”</p> <p>“Did George hurt you? Is that why you’re mad?”</p><p>“Of course he hurt me. We hurt each other. That’s what— never mind.”</p><p>“Oh, sorry.” Jessica looked away. “It’s none of our business.”</p><p>“I don’t have human hang-ups about fucking,” she reminded them. “I’ll draw sketches, if you like. It’s not that. It’s something else.”</p><p>“Do you want to talk about it?”</p><p>“No.”</p><p>And that was that.</p><p>Chapter 12</p><p>Then they came back down to the kitchen, to her surprise, Garrett was sitting at the counter with a weirded-out Sinclair. Waiting.</p><p>For her, she was surprised to see. He came to her at once, nuzzled her neck, and then retreated to his stool.</p><p>“You forgot your yarn,” Jessica said after a long moment in which it appeared someone had to break the silence.</p><p>“Not in the mood,” he replied.</p><p>Betsy started poking through the mail, squealing with glee when she saw the red Netflix envelopes. She ripped them open, and Jessica groaned when she showed them the discs.</p><p>“Why did you get Cone With the Wind again, dumb-ass? You own the damned movie!”</p><p>“Yes, but this is the new special edition with two new deleted scenes.”</p><p>“There’s one born every minute,” Sinclair commented.</p><p>“You hush up. Where’s Tina? She might want to watch it with me.”</p><p>“She’s out.”</p><p>“Oh.”</p><p>“Don’t you have to do some hunting, too?” Antonia asked her.</p><p>“No.”</p><p>“Elizabeth is unique among us.” Sinclair was giving the queen a look that was positively sappy. “Among other things, she doesn’t have to feed as often.”</p><p>“Like you,” Betsy told her. “Unique among the fuzzies.”</p><p>Antonia groaned. “Please don’t call us that.”</p><p>Jessica had been looking at Garrett during most of the conversation, then back at Antonia, then at Garrett. Antonia could smell the woman was stressed and waited for her to say something.</p><p>Finally: “Garrett, do you remember, uh, how you became a vampire?”</p><p>“Yes.”</p><p>They all waited. Betsy, also obviously curious, asked, “Do you mind telling us how?”</p><p>Garrett shrugged.</p><p>Antonia said sharply, “He doesn’t want to talk about it.”</p><p>“I don’t think he cares either way,” Sinclair replied, looking Garrett up and down with a critical eye.</p><p>“Forget it, Garr. You don’t have to say shit.”</p><p>Sinclair raised a knowing eyebrow. “Protective little thing, aren’t you?”</p><p>“You wanna go, king of the dead guys? Because we’ll go.”</p><p>“Don’t fight,” Betsy snapped. “Let’s just drop the whole—”</p><p>“I was acting. An actor. For Tarzan.”</p><p>An enthralled silence, broken by Jessica’s breathless “ Annnnnnnd? ”</p><p>Garrett tugged his long hair. “Grew it out. For Tarzan. Picture folded. Felt bad.”</p><p>“So you got fired, okay, and then what?”</p><p>“Producer tried to cheer me up. Had to get haircut... couldn’t walk around like that.”</p><p>“With long hair?” Antonia asked, mystified.</p><p>“Took me to barber. Late. After sets closed. Producer was Nostro. Had barber cut my throat and drank.”</p><p>“Jesus Christ!” Betsy practically screamed.</p><p>Antonia was on her feet. She didn’t remember getting up from the stool, and who cared? “Where’s the barber? Is he around here? I’m going to pull his lungs out and eat them while he watches.”</p><p>“Who was making the movie?” Sinclair asked sharply.</p><p>Garrett pointed to the Gone With the Wind disc.</p><p>“You mean... Warner Brothers?”</p><p>Antonia had an awful thought, so awful she could hardly get it out; it was clogging her throat like vomit. “That’s—that’s an old movie.”</p><p>“Nineteen thirty-nine,” Betsy said quietly.</p><p>“Tarzan lost funding,” Garrett confirmed. “Made that movie instead.”</p><p>Betsy shrieked again and kicked over her stool. The thing flew across the kitchen and crunched into the wall; plaster rained down on the (previously) spotless floor. “You’ve been a vampire for almost seventy years?”</p><p>Garrett shrugged.</p><p>“What a pity,” Sinclair commented, “that we already killed Nostro.” But he was looking at Garrett in a new way: intrigued and even a little alarmed. Antonia wondered how old Sinclair was.</p><p>“Sing it, sweetheart! God, what I wouldn’t give to have him in this kitchen right now. Torturing poor George and the others for more than half a century, that piece of shit! That son of a bitch!”</p><p>“Garrett,” Garrett corrected her.</p><p>“Right, right, sorry.”</p><p>Of all of them, Antonia noticed, Garrett seemed the least upset. She asked him about it, and he shrugged.</p><p>“Long time ago.”</p><p>“I guess that’s one way of looking at it,” she said doubtfully.</p><p>“Things are different now.”</p><p>Yeah, she thought bitterly. You’ve been redeemed by love. Loving someone else, that is. Fuck.</p><p>Chapter 13</p><p>I’m glad you didn’t cut it,“ she said later, after making love. She stroked the long, silky strands. ”I like it long.“</p><p>“Now, yes. Then, no.”</p><p>“I suppose. That’ll teach you to conform to society,” she teased.</p><p>He made a sound like gravel rolling down a hill, and after a minute, she realized he was laughing.</p><p>She supposed she should tell him; he might wonder, tomorrow night, where she had gone. “Just a heads up, I’m leaving tomorrow.”</p><p>“Why?”</p><p>“Because... because I haven’t been able to figure out how to help the queen. And I can’t stay here while you—I can’t stick around, let’s just leave it like that.”</p><p>“But if you don’t help... you don’t get what you want.”</p><p>“So I don’t get what I want. My life will remain completely unchanged.” She thought she said it with no bitterness. And dammit all, she was about to cry again. But not in front of Garrett. No way.</p><p>“Don’t go,” he said.</p><p>Okay, now she was crying. “Well, I am, so shut up about it. What do you care? You love Betsy, don’t you?”</p><p>“Yes.”</p><p>“So that’s all you need.”</p><p>“No.”</p><p>“What’s the matter with you? Why do you even care? You’ve got everything you need right here.”</p><p>“Now.”</p><p>“Look, Garrett. I guess... you don’t really love me.”</p><p>“Wrong.”</p><p>“What?” Outraged, she sat up. “You just said you loved Betsy.”</p><p>He yanked her back down. “Love Betsy... like the sun. Powerful, can’t control it. Don’t know what will happen.”</p><p>“Yeah, that sounds about right.”</p><p>“Love you like... air. Need it. Betsy is queen... belongs to everybody. Like money. You... belong to me. You’re... only for me.”</p><p>She went still as stone for a long time, wondering if her ears were defective, wondering if she dared believe what he’d said. But why not believe him? When had he lied?</p><p>“If this is your way of trying out telling jokes,” she said through a shuddering breath, “I will dislocate both your shoulders, and your legs.”</p><p>“Doit, if you’ll stay.”</p><p>“I’ll stay.”</p><p>“Then okay,” he said comfortably.</p><p>“I’m not sleeping in the basement, though.”</p><p>“Okay.”</p><p>“They can give us good curtains, or we can board up the windows in this room.”</p><p>“Okay.”</p><p>“I love you, jerk.”</p><p>He looked surprised. “Of course.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She groaned and punched him, which led to other things. Nicer things.</p><p>Chapter 14</p><p>“You’re moving in?”</p> <p>Antonia nodded with a mouthful of breakfast. “As of right now,” she added, spraying the queen with scrambled eggs.</p><p>“Oh. Okay. You’re moving in? Okay. I thought you were going to leave. We all—I mean, we didn’t want you to go but didn’t feel like we could make you stay. Ugh, don’t smile like that! Especially not with your mouth full.”</p><p>She swallowed but couldn’t help grinning. “Better get used to it.” They had wanted her to stay? Had talked about convincing her? How charming!</p><p>She scooped more eggs onto her plate. Damn, that Sinclair could cook! Where’d he gotten to, anyway? Oh, who cared?</p><p>“Don’t you have to call your boss, or leader, or whatever?” Betsy asked, sitting across from her and picking eggs out of her hair.</p> <p>“Did it last night.”</p><p>“So it’s all taken care of.”</p><p>“Umm-hmm.” Michael had sounded almost insultingly relieved at the news that she wasn’t coming back. If she hadn’t had Garrett, she might have been devastated. But as it was...</p><p>“I have a new family now. Don’t look scared, I’m only going to get sentimental for a minute.”</p><p>“I wasn’t scared,” Betsy said defensively. “Just surprised, is all. You have to admit, you kind of pulled a one-eighty in the last twenty-four hours.”</p><p>“Yeah, well, this is where I’m supposed to be. My lover’s here, he lets me be as rough as I want—”</p> <p>Betsy put her hands over her ears. “Overshare!”</p><p>“—you guys don’t seem to care if I can see the future or shit nickels.”</p><p>“I think I liked the gruff, unsentimental side of you a lot better.”</p><p>“So I’m staying.”</p><p>“Well, that’s great. A werewolf who can see the future will probably come in handy.” She gestured to the cavernous kitchen. “And it’s not like we don’t have the room.”</p><p>“Yeah, having me around all the time will be a help, get it?”</p><p>“Uh, no.”</p><p>“And by hanging out here, I get what I want.” Lover. Love. Family. Acceptance.</p> <p>“Oh! So—”</p><p>“I switched it around by accident. Or maybe I just wasn’t paying attention. Bottom line: I get what I want. Then I help you by moving in. Or I move in with you. Then I get what I want. Either way, I was right. Again. I just don’t have enough faith in myself, that’s the problem.”</p><p>“Yeah, that’s the problem.” Betsy looked mystified. “I don’t get it.”</p><p>“If you were as smart as me,” Antonia assured her, “you would.”</p><p>“Oh, goody. Someone else who has zero respect for me. Because there aren’t enough of them hanging out in this mausoleum.”</p><p>Garrett picked that moment to bound in, give Antonia’s hair a friendly yank, and bound back out.</p><p>Betsy watched him go. “How, uh, sweet.”</p><p>“Wow! I didn’t even hear him come in that time! God, what a man.” Antonia sighed and shoveled more eggs in her mouth. “Isn’t that just the sexiest, coolest thing you’ve ever seen?”</p><p>“Urn. Let me get you a napkin. Possibly five.”</p><p>“Bitch.”</p><p>The queen laughed at her. “See you.” </p> </body></html>"]