["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>Goodness. Just look at it. Thick as my ankle.</p><p>Diana Highwood took her glove and worked it like a fan, chasing the flush from her throat. She was a gentlewoman, born and raised in genteel comfort, if not opulent luxury. From an early age, she’d been marked as the hope of the family. Destined, her mother vowed, to catch a nobleman’s eye.</p><p>But here, in the smithy with Aaron Dawes, all her delicate breeding disintegrated.</p> <p>How could she help staring? The man had wrists as thick as her ankle.</p><p>As always, he wore his sleeves rolled to the elbow, exposing forearms roped with muscle. He pumped the bellows, commanding the flames to dance.</p><p>Broad shoulders stretched his homespun shirt, and a leather apron hung low on his hips. As he removed the glowing bit of metal from the fire and placed it on his anvil, his open collar gaped.</p><p>Diana averted her gaze—but not fast enough. She caught a moment’s glimpse of pure, superheated virility. Sculpted chest muscles, bronzed skin, dark hair . . .</p><p>“Behave yourself,” he said.</p> <p>The words startled her breathless.</p><p>He knows. He knows. He’s realized that refined, perfect, gently bred Miss Highwood comes to the smithy to gawp at his brute manliness. Behave yourself, indeed.</p><p>She felt ridiculous. Ashamed. Exposed.</p><p>And then—suddenly—relieved.</p><p>He wasn’t speaking to her. He was speaking to his work.</p><p>“That’s it.” Perspiration glistened on his brow. With a steady hand and a low, rich baritone, he finessed the broken clasp. “Be good for me now.”</p> <p>Diana turned her gaze downward, focusing on the floor. Neatly swept and fitted stones paved her half of the smithy, where visitors waited for their work. The ground around the forge was packed with black, smudgy cinders. And the border between the two could not have been more stark, or more meaningful.</p><p>Here was the division between customer and smith. The line between the world of a gentlewoman and a working man’s domain.</p><p>“There we are,” he said. “That’s the way.”</p><p>Oh, goodness. She could look away from his thick forearms and his muscled chest. But that voice.</p><p>She gave herself a brisk shake. Time to put a stop to this silliness. She was a grown woman, turning four-and-twenty this year. It was surely no sin to admire Mr. Dawes. He was an admirable man. However, she ought to concentrate on the many reasons that had nothing to do with carnality.</p><p>The Highwoods had come to this seaside village for Diana’s health, but she’d come to think of Spindle Cove as home. During their stay, she’d learned a great deal about rural life. She knew a good village smith was indispensable. He shoed the farmers’ draft horses, and he mended the oarlocks on the fishermen’s boats. When neighbors were ailing, he pulled teeth and set broken bones. The nails struck on his anvil held the whole village together.</p><p>This forge was the glowing, iron heart of Spindle Cove, and Aaron Dawes was its pulse. Strong. Steady. Vital.</p><p>She watched him striking off beats with his hammer. Clang. Clang. Clang.</p> <p>Now her eyes were fused to that forearm again.</p><p>“This weather,” she said, trying to change the subject. “It’s been a dreadful March, hasn’t it?”</p><p>He grunted in agreement. “Near a fortnight now without sun.”</p><p>He plunged the heated metal into a waiting bucket. A cloud of steam rose and filled the smithy, curling the short hairs at the nape of her neck.</p><p>“That should do,” he said, examining the cooled clasp of her necklace. He polished it with a scrap of cloth. “Let’s hope it lasts this time.”</p><p>Diana gave him a nervous smile. “I do seem to have bad luck with it, don’t I?”</p><p>“This is the third time it’s broken this year, by my count. You must think my craftsmanship is faulty.”</p><p>“No,” she hastened to assure him. “Not at all. You do very good work, Mr. Dawes. I’m just careless, that’s all.”</p><p>“Careless? You?” His gaze locked with hers from across the smithy, dark and intense.</p><p>She caught him looking at her like this sometimes. In church, around the village. She didn’t know what to make of her reaction, but she couldn’t deny it was a thrilling sort of confusion.</p><p>He mopped his brow and neck with a damp cloth, then wiped his hands clean. “It’s a curious thing, Miss Highwood. You don’t strike me as the clumsy sort.”</p><p>She shifted on her seat, uneasy.</p><p>“And of all things,” he said, “I’d think you’d be careful with this.”</p><p>She watched as he threaded the tiny vial back on its chain. In the vial was a tincture of shrubby horsetail. She kept a dose with her at all times, in case of a breathing crisis.</p><p>“You’re right.” Despite her accelerating pulse, she forced an easy smile. “I should be more cautious. I will be, in the future.”</p><p>He looked up at her. “Are you well?”</p><p>“Quite.”</p><p>“You look flushed.”</p><p>“Oh. Er . . .”</p><p>He walked behind her and placed the chain about her neck, standing close to do the clasp. If she’d been flushed already, now she was enflamed. It was as though he’d soaked all the heat up from the fire, and now he gave it to her. Soothing and melting all her knotted places. Like the heated brick she took to bed when she had her courses.</p><p>Oh, Lord. The last thing she needed right now was thoughts of bed. Much less this big, solid brick of masculinity sharing it.</p><p>“Still don’t know how you managed to smash it like that,” he said.</p><p>By slamming it in a drawer. And finishing the deed with a rock.</p><p>“I don’t know, either,” she prevaricated. Her heart thumped wildly in her chest.</p><p>“I could almost believe someone did it on purpose. I know accidents happen. But they don’t usually happen the same way twice.”</p><p>As he fastened the necklace, his fingertips brushed her neck.</p><p>Diana sucked in her breath. She wanted to pretend the touch was an accident. As he’d said, accidents happen.</p><p>But they didn’t happen the same way twice.</p><p>He caressed her neck a second time, his roughened thumb sliding down the soft skin at her nape.</p><p>“Why are you here?” he asked.</p><p>She couldn’t answer. She couldn’t move, couldn’t think.</p><p>“I wonder about it. Why you come so often. Why every metal latch and clasp and rivet you possess seems to need mending of late.” His voice grew deeper, almost dreamy. “I’ve told myself you’re just bored with this village. With this weather, there’s little else to do.”</p><p>He circled her, running his finger beneath that chain. Branding her with a necklace of his touch.</p><p>“Other times”—she caught a wry note in his voice—“I decide you’ve been sent by the devil to torment me for my sins.”</p><p>He came to stand before her, holding that vial that dangled from her necklace. He pulled gently, and she swayed toward him. Just an inch.</p><p>“And then sometimes I think maybe . . . just maybe . . . you’re hoping for something to happen. Something like this.”</p><p>She swallowed hard, staring straight into the notch above his sternum. That shamelessly sensual crossroads of bone and muscle and sinew and skin.</p><p>The heat of him swamped her. She felt . . . It was so very odd, but she felt ticklish. As though every inch of her was exquisitely attuned, anticipating his touch.</p><p>Perhaps he was right.</p><p>Perhaps she had been wanting this.</p><p>He released her necklace. “Well?”</p><p>She gathered her courage and looked up at him. Outside of social calls and dinner parties, Diana had little experience with men. But if there was one thing her genteel upbringing had taught her, it was how to read an invitation.</p><p>If she gave Mr. Dawes the slightest encouragement . . .</p><p>Oh, heavens. He would kiss her. Those strong, sensual lips would be on hers, and his powerful arms would hold her tight, and there would be no taking the moment back. She would leave with a changed understanding of herself and smears of soot on her best blue frock. In the eyes of the world, she’d be soiled.</p><p>Dirty.</p><p>“I should go.” The words erupted from her throat, like a geyser of panic. “I should go.”</p><p>He nodded and stepped back at once. “You should go.”</p><p>She hopped down from the stool and reached for her cloak. The cloak didn’t seem as eager to leave as she was. She wrestled with it, cursing the tangled laces.</p><p>“I’m not sure the smithy’s the safest place for you, Miss Highwood.” His manner was easy as he returned to the forge and pumped the bellows. “Lots of smoke and steam. Sparks have a tendency to fly.”</p><p>“Perhaps you’re right.”</p><p>“Next time you have something what needs mending, just send it over with one of the rooming house maids.”</p><p>“I’ll do that.” She made a desperate grab for the door, pulling it open. “Good day, Mr. Dawes.”</p><p>“Good day, Miss Highwood.”</p><p>She made it a respectable distance down the lane before stopping to press her hand to her chest. Closing her eyes, she inhaled a deep, steady breath.</p><p>Oh, Lord. What a fool she was.</p><p>Damn. Aaron felt like an idiot.</p><p>No, no. Idiot was too kind a word. Idiots were innocent of their mistakes. Aaron knew better. He was a coarse, mutton-brained lout.</p><p>What the devil had he been thinking? He didn’t know what had made him do it. Only that she’d been wearing that china-blue frock with lacy edges—the one that made him want to carry her into a field of wildflowers, lay her down like a picnic blanket, and feast.</p><p>Perhaps it was best this way. She wouldn’t come around to tempt him again—that much was certain.</p><p>Too much of the day remained, and he was too restless for leisure. Lacking an urgent project, he pulled out some thin iron stock and decided to bang out nails. A smith could never have too many nails.</p><p>Again and again, he heated the rod to a glowing yellow, braced it on his anvil, and pounded one end to a tapered point. With an ease born of years of practice, he severed the length in one blow, crushed the flat end to a blunt button, and plunged the finished nail in a waiting bucket of water.</p><p>Then he began again.</p><p>Several hours of mindless, sweaty pounding later, he had a pile of nails large enough to rebuild the village should a mammoth wave wash it all out to sea. And he still hadn’t driven the feel of her skin from his mind.</p><p>So soft. So warm. Scented with dusting powder and her natural sweetness.</p><p>Damn his eyes. Damn all his senses.</p><p>Aaron banked the fire in the forge. He put all his tools away, washed at the pump, and saddled his mare for a ride into the village. He wasn’t usually a hard-drinking man, but tonight he needed a pint or three.</p><p>After tethering his horse on the village green, he made his way through the familiar red-painted door of the Bull and Blossom. He hunkered down on a stool in the nearly empty tavern, stacking his fists on the bar.</p><p>“Be right with you, Mr. Dawes,” the serving girl sang out to him from the kitchen.</p><p>“Take your time,” he answered.</p><p>He had all night. No one was waiting for him. No one.</p><p>He lowered his head and banged his brow against the anvil of his stacked fists. Coarse. Mutton-brained. Lout.</p><p>“Dawes, you need a woman.”</p><p>Aaron’s head whipped up. “What?”</p><p>Fosbury, the tavern keeper, plunked a tankard of ale on the counter. “I hate to say it. Unhappy bachelors are better for my profits. But you need a woman.”</p><p>“Tonight, a woman is not what I need.” He took a long draught of ale.</p><p>“She came around the forge today, didn’t she?”</p><p>Aaron lifted the tankard for another sip. “Who did?”</p><p>“Miss Highwood.”</p><p>Aaron choked on his ale.</p><p>“It’s no secret.” Fosbury wiped down the counter. “Ever since she showed up in this village, you’ve had eyes for her. Not surprising. You’re a man in your prime, and she’s the prettiest thing to grace Spindle Cove in some time.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Aaron scrubbed his face with both hands. Curse him, Fosbury had too many things right.</p><p>From the first sight of her, he’d been utterly smitten. He had a weakness for finely wrought things, and by God, Diana Highwood was just so . . . perfect. In any other village, men might sit on these barstools and debate which woman deserved the honor of most comely in town. In this tavern, that debate would begin and end over a single sip of ale. Diana Highwood took the honors, without question. She had the face of an angel. Delicate and beautiful.</p><p>But though her fair looks might have caught his eye, other qualities had snared his heart.</p> <p>It had all started the night they’d spent struggling to save Finn Bright’s life. The youth had lost his foot in an explosion, and he’d been brought to the forge for surgery. Miss Highwood wasn’t a healer or a nurse, but she’d insisted on staying to help. Bringing water, mopping blood, dabbing the sweat of delirium from Finn’s brow.</p><p>That was the night Aaron had learned the truth of Diana Highwood. That her delicacy was only skin deep—but the beauty went all the way through.</p><p>The longer she lived in this village, the more he found in her to admire. She wasn’t only beautiful; she was brave as well. Then determined, intelligent, charitable. By now, she was some sort of paragon in his mind, and Aaron worried that long after she left, he’d be comparing every woman he ever met to her.</p><p>And they’d all fall short.</p><p>He stretched his hand, regarding it in the dim light. The pad of his thumb still burned where he’d brushed a lock of hair from her neck. It felt singed, cinder-kissed. He pressed it against the cool tankard, but it still throbbed, hot and achy.</p> <p>Damn, he was hot and achy everywhere. He’d let this attraction get away from him, and now she was deep under his skin. In his blood, it seemed.</p><p>“She’s not for you,” Fosbury said.</p><p>“I know it. I know it well.” And if he’d been harboring any other thoughts, her frantic escape today would have driven them out of his head.</p><p>“She’s not the only woman in this village.”</p><p>“I know that, too. It’s just . . . so long as she’s living here, I can’t seem to take an interest in anyone else.”</p><p>Fosbury leaned close over the counter and lowered his voice. “The answer could be right under your nose. You don’t have to look far.”</p> <p>The tavern keeper tilted his head in the direction of the serving girl, who’d emerged from the kitchen with a rag to wipe the tables clean. She cast a friendly smile in Aaron’s direction, and he returned the greeting with a nod.</p><p>When she was out of earshot, Aaron muttered, “You want me to court Pauline Simms?”</p><p>“She’d make you a good wife. Hardworking, clever with sums. She’s grown up well, too.” Fosbury rapped the countertop with his knuckles, then drifted away. “Think about it.”</p><p>Under the guise of stretching his neck, Aaron had another look at the girl.</p><p>He thought about it.</p><p>Fosbury was right. Pauline Simms was the sort of woman he ought to set his sights on. She was one of his kind. Working class, the daughter of a farmer. As Fosbury said, she was quick with her hands and her wits. She’d be a help to any man with a trade. Admittedly, she had a few rough edges, but nothing some care and time wouldn’t smooth.</p><p>As he watched, she tipped over a decorative plate, muttering, “Bollocks.”</p><p>He smiled. But even though they were only four years apart in age, and even though she’d long grown into a woman—a pretty one, at that—Aaron couldn’t look at Pauline Simms without seeing the gap-toothed, freckled girl who’d grown up a year behind his own sister.</p> <p>That was the problem with a village this small. Every available woman felt like a sister to him. Or maybe it was his own circumstances that had permanently cast him in the big-brother role.</p><p>When his father had died ten years ago, slumped over the anvil from a heart attack, it didn’t matter that Aaron was barely seventeen. He’d needed to become the man of the family, and quick. He’d taken over the forge, working hard to support his mother and sisters.</p><p>When Spindle Cove became a retreat for well-bred young ladies, some of the other men had groused about the village being overrun . . . but it suited Aaron fine. By then, both his sisters had married, and they and his mother had moved away. So he liked having the visiting young ladies around. He mended their locks and buckles; they purchased the silver and copper trinkets he made in his spare time. It was like having a flock of little sisters to replace the ones he so sorely missed.</p><p>Except for Diana Highwood.</p><p>He’d never felt brotherly toward her.</p><p>He drained his ale. It wasn’t strong enough. “Pauline?”</p><p>She looked up from mopping a table clean. “Yes, Mr. Dawes? Anythin’ else you need?”</p><p>“Bring me a whiskey, will you?”</p><p>CHAPTER 2</p><p>As was their habit, all the ladies residing in the Queen’s Ruby rooming house gathered in the parlor after dinner. A roaring fire kept the chill at bay.</p><p>Even now, hours after leaving the forge, Diana was still out-of-sorts. The bit of needlework she’d been working on wouldn’t come out right, and she’d lost patience with it.</p><p>She’d lost patience with herself.</p><p>She’d spent the better part of two years girlishly infatuated with Aaron Dawes, all the while trusting nothing could come of it. He’d mended every scrap of metal she possessed—sometimes two or three times—showing her nothing but neighborly patience.</p><p>Until today. Today, he’d shown her something much more.</p><p>And she’d panicked and fled. Not even politely, but as if he were an ogre. She was certain he’d been wounded by her hasty retreat.</p><p>Now she’d have to avoid him for as long as she remained in the village. How unbearably awkward.</p><p>She gave up on stitching and cast a glance out the window. Through the dark and wet, she saw a familiar black mare grazing on the village green.</p><p>He must be at the tavern tonight.</p><p>“This dratted rain,” her sister Charlotte moaned. “It’s setting us all on edge. Two weeks now with no country walks, no gardening, no romps through the castle ruins. No amusement at all.”</p><p>“I don’t mind rain.” This came from Miss Bertram, a young lady new in Spindle Cove this spring. “I always loved spending rainy days with Mr. Evermoore.”</p><p>Charlotte stifled a giggle.</p><p>Diana gave her sister a pleading look. Don’t. Don’t make fun.</p><p>Spindle Cove was a haven for odd, unconventional, and misunderstood young ladies. But even among misfits, Miss Bertram didn’t quite mix. She was hard to know—mostly because she had nothing to say that didn’t involve her relationship with this mysterious rogue, Mr. Evermoore.</p><p>“My parents didn’t approve of Mr. Evermoore,” Miss Bertram went on. Her dark eyebrows stood out like bold punctuation on an otherwise unremarkable face. “They don’t understand our attachment. That’s why I’m here, you know.”</p><p>Charlotte giggled again.</p><p>Miss Bertram’s dark eyebrows gathered in a wounded line. “No one understands. No one.” She lifted her book before her face and turned a page with a snap.</p><p>Charlotte buried her face in her hands and convulsed with silent laughter.</p><p>“Stop,” Diana whispered. “You shouldn’t poke fun.”</p><p>“Who needs to poke it? She offers it up so readily.” Charlotte mimicked in a high whisper, “Oh, Mr. Evermoore. No one understands our love.”</p><p>“She’s hardly the first young woman to lose her head over an unsuitable man.”</p><p>“What about an imaginary one? I’d wager anything that Mr. Evermoore is Mr. Never-Was. She just wants to impress us.”</p><p>“All the more reason to show her kindness.”</p><p>Charlotte said lightly, “That’s the lovely thing about being your sister, Diana. You’re kind enough for us both.”</p><p>Diana felt a twinge of guilt. She hadn’t treated Mr. Dawes very kindly today. In her agitation, she jabbed at the fabric and pricked her finger. “Drat.”</p><p>She scouted her immediate surroundings for her thimble. It wasn’t in her sewing basket, nor caught in the folds of her skirt. “Have you seen my thimble, Charlotte?”</p><p>“No. When did you have it last?”</p><p>“This afternoon, I think. When we went to the Bull and Blossom for tea. I’m sure it was in my kit, but I can’t find it now.”</p><p>Before they could expand their search, the door creaked open, admitting a sharp blast of icy wind. Their visitor appeared in the entry, throwing back her hood to reveal a shock of white-blond hair.</p><p>Sally Bright shook off her damp cloak and hung it on a hook. Her cheeks were pink. “I brought over the post. It was dreadful late today on account of the muddy roads, and I couldn’t wait for you ladies to come collect it tomorrow.”</p><p>Diana smiled to herself. Together with her brothers, Sally kept the All Things shop, and she was the biggest gossip in the village. If she’d taken the trouble to bring over the post, that must mean there was something of interest in it.</p><p>Something she couldn’t steam open, read, and reseal with no one the wiser.</p><p>Sure enough, Sally held out a packet tied with string. “Look. It’s a lovely great package from our dear Mrs. Thorne. And it’s addressed to all of you.”</p><p>“Something from Kate?” Charlotte leaped to take the packet and wrestle with the strings. “Oh, how wonderful.”</p><p>Kate Taylor had been the village music tutor until last summer, when she’d married Corporal Thorne—now Captain Thorne—and moved away to follow his rising career. Though everyone in Spindle Cove was happy for them, Kate’s lively spirit and melodies were sorely missed.</p><p>“There’s a packet of handwritten booklets,” Charlotte said, sorting the contents. “And a letter. I suppose I should read it first.”</p><p>“Aloud, if you will,” said Sally.</p><p>All the ladies gathered close.</p><p>Charlotte’s eyes widened as she scanned the page. “She sends us all greetings from Ambervale.”</p><p>This news was met with a general murmur of excitement.</p><p>Ambervale was the estate of the eccentric Gramercy family, headed by the Marquess of Drewe. Kate was the Gramercys’ cousin by some tenuous, and rather scandalous, connection. Nevertheless, they’d welcomed her to the fold . . . and now into their house, which was situated just a few hours away.</p><p>“I hope this means she’s coming to visit,” Diana said.</p><p>“Even better,” said Charlotte. “Lord Drewe is inviting us to visit them. All of us.”</p><p>“A ball!” Mama cried. “Oh, I knew it. I knew Lord Drewe would want another chance at you, Diana.”</p><p>“Mama, I’m sure this means nothing of the sort.”</p><p>“Of course it does! Such a handsome, elegant man. The two of you made a striking couple. Everyone could see it.”</p><p>Not again. When the Gramercys had been in Spindle Cove last summer, Mama had made the most embarrassing remarks to poor Lord Drewe, always angling for a match between him and Diana.</p><p>Charlotte gave them all a superior look. “Shall I read the letter, or would you prefer to spend the evening guessing at its contents?”</p><p>Mama closed her mouth and sat quietly.</p><p>“She writes, ‘Captain Thorne and I are guests at Ambervale for the month. Thus far, it has rained every day. I can only imagine that you are enduring the same tiresome weather in Spindle Cove. My dear cousins, Lady Harriet and Lady Lark, have concocted the enclosed scheme.’ ”</p><p>“A scheme?” Mama echoed. “What sort of invitation is this?”</p><p>“ ‘Since Lord Drewe decided dancing and cards would be poor form during Lent, the ladies devised a theatrical.’ ”</p><p>Miss Bertram perked with interest. “Mr. Evermoore is very fond of the theater.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Charlotte read on, summarizing for the group. “It’s a command performance, and we are the players. On Thursday next, Lord Drewe will send his carriages to convey the Spindle Cove ladies to Ambervale. We must arrive prepared to present the enclosed play, which Lady Harriet believes will have unique devotional meaning for the season.”</p><p>Diana reached for one of the booklets, reading the title aloud. “ ’Doomed by Virtue: The life and death of St. Ursula.’ ”</p><p>Mama clucked her tongue. “That Lady Harriet is very strange.”</p> <p>“She’s brilliant,” Charlotte said. “What other play is going to have a dozen female parts? All those handmaidens. And no one can complain that such an amusement is improper. Our cathedral is named for St. Ursula, after all.”</p><p>“You’ll need to be busy with costumes and such,” Sally said, happy at the prospect of imminent sales. “I’ll open the shop early tomorrow.”</p><p>The mood in the room brightened as copies of the play were passed around and plans for rehearsals, costumes, and props volleyed back and forth.</p><p>Diana had to agree with her sister. Lady Harriet was brilliant. This was what they all needed—a source of excitement for the coming week, and an outing to look forward to. A diversion. Perhaps it would take her mind off Mr. Dawes.</p><p>“Of course, Diana must be Ursula.”</p> <p>Diana startled. “Why must I be Ursula?” She had been hoping for the most minor of the handmaiden roles.</p><p>Sally lifted one shoulder in an isn’t-it-obvious shrug. “Pure. Beautiful. Saintly. That’s you, Miss Highwood, isn’t it?”</p><p>No, Diana wanted to object. No, it isn’t. You’re looking at a woman who ogled a man’s brawny forearms this afternoon. And ran from his kiss out of cowardice, not virtue.</p><p>For the first time since the announcement of this theatrical scheme, her mother showed genuine enthusiasm. “Yes, Diana must be Ursula. With Lord Drewe playing the role of her bridegroom. It’s perfect.”</p><p>Diana pinched the bridge of her nose. “Mama, you do understand how this story ends? How Ursula achieved her sainthood? She is beheaded by Huns and dies a virgin.”</p><p>“True.” Charlotte leafed through the play. “But then, so do her handmaidens. They all die virgins.”</p> <p>“There, see? At least you’ll be the leading virgin,” Mama said. “And you’ll have the best costume. A bridal costume. That will set Drewe’s mind turning.”</p><p>“I tell you, it won’t.” In an attempt to end the conversation, Diana renewed her search for her thimble. Where could it have gone?</p><p>With a smug harrumph, Mama propped her feet on a low stool and settled her petticoats. “You are meant to be a nobleman’s wife, Diana. I have always known it. My intuition—”</p><p>“Forgive me, but your intuition must be flawed,” Diana replied, peering under a chair. “You’ve been predicting my lofty match for years. During that time, no fewer than three unmarried noblemen have resided in this village. None of them expressed the slightest desire to wed me.”</p><p>“Because you did not encourage them! If you fancy a gentleman, you must let him know. Not in words, of course, but in the language of female subtleties.”</p><p>Female subtleties? Mama possessed all the subtleties of an elephant on parade. She brazenly thrust Diana into the path of every available gentleman.</p><p>Meanwhile, the one man Diana found attractive wasn’t a gentleman at all but the village blacksmith. And apparently subtleties weren’t her strong point, because he’d seen right through her.</p><p>Aaron Dawes could tell her thoughts weren’t saintly.</p> <p>But he’d wanted to kiss her anyway.</p><p>She glanced out the window again. His mare was still outside the tavern.</p><p>“I’m not unfeeling, Mama. Merely careful. You know I’ve had to be.”</p><p>She touched a hand to the chain around her neck and the small bottle of tincture hanging there. It was her talisman. The medicine inside was meant to help her in a breathing crisis. She’d suffered from asthma ever since she was a small girl.</p><p>For most young people, tantrums and tears and wild whoops of joy were all normal parts of childhood. Not so in Diana’s case. Not only had she been kept inside, prevented from running and playing and stomping through the snow, but she’d also been schooled to temper her feelings. No outbursts of any kind.</p><p>Emotions were too dangerous.</p><p>Charlotte settled next to her, crushing into the same chair and fondly stroking Diana’s shoulder. She murmured, “You know how I hate to agree with Mama, but I don’t think she’s entirely wrong. You should be Ursula. And flirt with Lord Drewe if you feel like it. This is your time to take the lead.”</p><p>“My time to be a martyred medieval virgin?”</p><p>“Your time to do whatever you please. You know what Susanna said last year about your asthma. It isn’t coming back. And if you don’t need to worry about dying any longer . . . don’t you want to start living?”</p><p>She pushed a copy of the play into Diana’s hand. “Here. Take whatever role you choose. Except Cordula. I want to be Cordula. She gets the most gory execution.”</p><p>Diana stared at the play for a moment. Then she handed the folio back at her sister. “Not now. I . . . I think I’ve remembered where I left my thimble.” She rose from the chair.</p><p>“Really? Where?”</p><p>Diana went to fetch her cloak from a peg by the door. “At the Bull and Blossom. I’ll just run over to get it.”</p><p>“But the rain!” her mother called.</p><p>Diana closed the door on her mother’s objection and dashed outside.</p><p>Charlotte was right. Now that her health had mended, Diana needn’t fear her own emotions any longer.</p><p>She did want to start living. And she was going to start tonight.</p><p>Aaron told himself his second drink would be the last.</p><p>And then he ordered one more.</p><p>Fosbury had already sent Pauline home for the evening, and the tavern keeper yawned as he slid the refilled tumbler across the bar.</p><p>“I should go,” Aaron said. “It’s late.”</p><p>“No, take your time with it.” Fosbury knotted his apron at the waist. “I’ve some yeast dough to start for tomorrow’s bread. Give a shout if you need anything.”</p><p>He disappeared into the kitchen, whistling as he went.</p><p>Aaron had just grown accustomed to his comfortable pocket of quiet when the creak of the door ripped it open again. He turned his head, expecting to see one of the fishermen or farmers come in for a late pint.</p><p>What he saw nearly knocked him off his stool.</p><p>Diana Highwood.</p><p>She rushed through the door, slammed it closed, then stopped dead in her paces. Staring at him.</p><p>Aaron didn’t know what to say, but it seemed she was waiting to hear something. He finally settled on “Good evening.”</p><p>“Good evening.”</p><p>Another long, uncomfortable pause.</p><p>She looked at the empty stool beside his. “Might I join you?”</p><p>Bemused, he waved a hand in invitation.</p><p>She approached the bar and settled on the seat, daintily arranging her skirts.</p><p>Aaron lifted his drink, stealing glimpses at her out of the corner of his eye. He’d spent a great many stolen moments admiring her, but tonight something was different.</p><p>She was different. He couldn’t look at her tonight and see a paragon up on a pedestal. She was a disheveled girl sitting on a barstool. Damp from the rain, cheeks flushed, wisps of flaxen hair matted to her brow. She looked impulsive. Sensual.</p><p>More beautiful than ever.</p><p>Between her intoxicating looks and the fact that he was on his third whiskey, he was addled. He didn’t know what she was doing here, but so long as she was sitting next to him, he was going to stare. He propped his elbow on the bar and drank in every detail of her rain-misted face, savoring.</p><p>Her gaze fell to his tumbler of whiskey. “You’re having a drink?”</p><p>“Yes.”</p><p>She picked up the tumbler and stared into it. “Is it brandy?”</p><p>“Actually, it’s—”</p><p>Before he could get the words out, she’d lifted the glass to her lips and tossed back half the contents in one swallow.</p><p>“ . . . whiskey.”</p><p>She set it down. Stared at it, wide-eyed. Coughed. “Oh. So it is. Goodness.”</p><p>After a moment’s pause, she lifted the tumbler again.</p><p>This time, he acted. He grasped her slender wrist, cutting her draught short. “Miss Highwood, you shouldn’t.”</p><p>“Oh, I think I should. I think this is exactly what I need.”</p><p>“But your health.”</p><p>“You mean my asthma?” She set the tumbler down, and he released her wrist. “My asthma hasn’t troubled me in years.”</p><p>“Of course it has. That’s why you’re here in Spindle Cove.”</p><p>She shook her head slowly. “I haven’t had a breathing crisis since the one you witnessed here in this tavern. That was two summers ago. Susanna consulted with physicians in London, and she thinks I’ve outgrown it. People do, she said. Apparently, I’m . . . I’m cured.”</p><p>She was cured? Aaron was confused. This didn’t make any sense. Her breathing troubles were the reason the Highwoods had moved to this village—the sea air was beneficial to her lungs.</p><p>She fidgeted with the necklace he’d mended just that day—the one with the vial of precious tincture dangling from the chain. “I don’t even need it anymore. I know in my soul, I don’t. I only wear it out of habit.” Her blue eyes met his. “And because you made it.”</p><p>Her confession was like a punch to the jaw. It came out of nowhere and set his head spinning.</p><p>The whiskey was starting to hit her, too. He could tell from the glassy sheen in her eyes and the unsteady motions of her hands. But mostly, by the ridiculous words spouting from her lips.</p><p>He tossed a few coins on the bar and stood, putting a hand under her elbow to help her to her feet, too. “Come. I’ll walk you back to the rooming house.”</p><p>He didn’t give her a chance to object, tucking her arm through his in a way that he hoped wouldn’t look improper to anyone who might happen to see.</p><p>“You were right today,” she confessed. “I’m not clumsy.”</p><p>No sooner had she said it than she stumbled over the doorstep.</p><p>“Not usually.” She giggled.</p><p>Giggled? He didn’t remember ever hearing Diana Highwood giggle.</p><p>“I broke the necklace on purpose, just so you’d have to mend it. So I could watch you mend it.” She shook her head. “That’s dishonest of me, isn’t it? Why would I do that? Lie to you, lie to myself.”</p><p>He herded her across the lane and onto the village green. It was muddy, but the shortest route. Getting her home as quickly as possible seemed his best strategy.</p><p>“Miss Highwood, you need to rest.”</p><p>“I don’t need to rest. I’m cured. I’m perfectly well.”</p><p>“Nevertheless, it’s late. And wet. You need to be getting back to the rooming house before your mother and sister worry.”</p><p>“No.” She lifted a hand to her temple. “No, I don’t want to go back to the rooming house. I want . . .” Her face scrunched up, and her speech gained in rapidity what it lost in coherence. “Oh, I don’t know what I want. That’s the problem. All my life, I’ve been discouraged from wanting anything. I couldn’t risk Minerva’s love of debate, or Charlotte’s exuberance, or even Mama’s nerves. I had to be calm. Delicate, cool, serene Diana. That’s been me, always. No wild passions. No adventurous dreams. It seemed silly to plan for the future. For all I knew, I wouldn’t live to see it.”</p><p>He didn’t like this talk of her dying. “But you said you’re cured now.”</p><p>“And then tonight . . .” Her voice broke as she gestured at the Queen’s Ruby. “Tonight, my sister asked me, Don’t I want to start living? And I realized I don’t even know what I want from life. I know what my mother wants for me. I know what everyone else expects. But what do I truly desire?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Excellent question. Aaron waited for the answer.</p><p>Her hand pressed to her chest. “Do I want to have a season in London and marry a lord? Do I want to stay here in the village and become a permanent spinster? Do I want to join a circus? I don’t know, Mr. Dawes. I don’t know, and it terrifies me. All those years of setting aside my emotions. My lungs are healed, but at what cost? I am a stranger to my own heart.”</p><p>Raindrops spotted her face, like dew on petals. Damn, this was torture. He wanted to comfort or guard her, but he didn’t know how. She wasn’t his to tend.</p> <p>He pulled her under the branches of a chestnut tree. The least he could do was shield her from the rain.</p><p>“There’s only one thing I feel absolutely certain of,” she said.</p><p>“Tell me.”</p><p>Whatever it was, he vowed that she would have it.</p><p>At last she’d shaken off the manacles clapped on her—the restraints of illness and her mother’s expectations. Good. Good for her. She deserved to have the things she desired.</p> <p>“This afternoon.” She drew close. “I wanted you to kiss me. I wanted it more than I can remember wanting anything in my life.”</p><p>With that, she tilted her face to his.</p><p>And closed her eyes.</p><p>Aaron stared down at her, watching the white puffs of her breath as it left her lips. He could taste them. Little clouds of whiskey.</p><p>Her eyes fluttered open. “Didn’t . . . didn’t you want to kiss me, too?”</p><p>“I did.”</p> <p>“Then why don’t you? We’re alone. No one ever has to know.”</p><p>He snorted at that last. “It’s impossible to keep a secret in this village.”</p><p>“No, it’s not. I’ve been keeping all sorts of secrets for years. For example, sometimes I think, very hard, about how you’d look without your shirt. You never would have guessed that, would you? No one would.”</p><p>He couldn’t help his startled laugh.</p><p>“And I gaze at your hair.” She lifted a hand, and her ungloved fingers caught a lock of his hair. “It gets long sometimes, all the way to your collar. And then one day, it will be short again. I always wonder who you’ve been to see.”</p><p>She was half drunk, more than a little overwrought . . . but her words tapped a deep well of curiosity. He’d always known there was more to her than the pretty face everyone admired. He’d known her to possess courage and a good heart. But now, he caught glimmers of other qualities. Sensuality. Jealousy. A sly sense of humor.</p><p>This was an entirely new Diana Highwood. A real one. And she was with him, right now, in the rain and dark.</p><p>“Won’t you kiss me?” she whispered, sidling close. “Just the once?”</p> <p>“The thing is, Miss Highwood, I’m not interested in kissing you just the once.”</p><p>“Oh.” Her face fell.</p><p>He propped one finger under her chin, tilting her face back up. “If I were to kiss you, once wouldn’t be enough. I’d want to kiss you many times. In lots of places.”</p><p>Her eyes flew wide. “Oh. I . . . I see.”</p><p>He doubted she did see. She couldn’t even imagine. A few fingers of whiskey couldn’t provide that much education. The carnal images in his mind could shock the silk from her stockings.</p><p>“Listen,” he said, “I know you’ve been living in some sort of cage. And tonight, it seems you learned you’ve been holding the key all along. You deserve a bit of rebellion, but I can’t be it. I can’t be the man you wake up regretting.”</p><p>“Then make the kiss good. So I won’t have regrets.” Smiling, she slid her arms around his neck. Her weight pitched forward.</p><p>Jesus. She could barely stay on her feet. Which, of course, meant her body was all pressed up against his. Fortunately, her woolen cloak was as thick as a horse blanket.</p><p>“Miss Highwood . . .”</p><p>“Call me Diana.” She let her head fall forward, nestling into his coat.</p><p>“Diana.” Until he spoke the name aloud, he hadn’t known how deeply he’d wanted to call her that. Diana, Diana.</p><p>“You’re so strong,” she murmured. “And warm. You smell like soap.”</p><p>“Diana, I know you. We’ve lived in the same small village for almost two years, and we’ve come through a few trials together. Let’s just say I’ve paid attention. I won’t deny I’ve wanted this, but not this way. You’re confused, upset, and more than a little drunk. This”—he put an arm about her, steadying her—“can’t happen tonight.”</p><p>She clung to him, her face stubbornly buried in his coat. He embraced her, trying to keep out the chill. Not entirely selfless valiance on his part. He loved the feel of her in his arms.</p><p>He bent his head and murmured in her ear. “I’ll take you home now.”</p><p>She made a whimper of protest.</p><p>“No, Diana. It has to be now. Else I’ll be tempted to bring you home with me instead, and then you’d be stuck. All those choices you’ve glimpsed tonight would disappear. Ruined, and forced to marry a craftsman? You don’t want that.”</p><p>She didn’t answer. Just hugged him tight.</p><p>“You don’t want that,” he repeated more firmly.</p><p>Or did she?</p><p>She was silent for a few moments, which his heart stretched into hopeful lifetimes.</p><p>And then she gave her answer—a soft, unmistakable snore.</p><p>CHAPTER 3</p><p>The next morning, Diana woke with all sorts of regrets. They were stabbing her straight through the eyes, those regrets. Her pounding head felt like . . .</p><p>Like a blacksmith’s anvil.</p><p>She groaned, putting a hand to her eyes. She had a hazy memory of coming in through the rooming house door, waving a brief good night to her mother and sister, then stumbling up to her bed. Unfortunately, her memories of throwing herself at Aaron Dawes were all too clear.</p><p>Oh, the humiliation. What he must think of her.</p><p>She pulled the coverlet up over her head, turning to bury her face in the pillow. A mistake. She couldn’t hide from the memory here. As she pressed her face to the mattress, recollections of last night’s embrace assailed her. His warmth, his solid strength. His honorable treatment of her when she’d cast all her good breeding in the mud at his feet.</p><p>Her head throbbed. The rest of her ached with a fierce, hopeless yearning.</p><p>“Diana?” Charlotte rapped on the door. “Are you well?”</p><p>No. No, I’m not well. I am very poorly in the head. And in the heart. Kindly go away.</p><p>“The rain’s let up,” Charlotte said, opening the door a crack. “Mama wants to pay a call at Summerfield. Will you join us?”</p><p>Diana was tempted to stay abed and plead headache. She wouldn’t even need to exaggerate. But if there was one thing she was proud of doing last night, it was deciding that she wouldn’t be defined by “delicate health” any longer.</p><p>She threw back the coverlet. “I’ll join you.”</p><p>She rose from bed, dressed, choked down a bit of tea and toast, and donned her sturdiest shoes. Perhaps if she walked far enough, she would leave this feeling of mortification behind.</p><p>The walk to Summerfield did loosen some of the knots in her stomach. And they all enjoyed their brief visit with Sir Lewis Finch, who told them the latest news of his granddaughter. By the time they began their walk home, the sky had lightened noticeably. Diana could almost forget the embarrassment of last night.</p><p>Almost.</p><p>“How did it go last night?” Charlotte asked.</p><p>Diana stumbled over a rock. “What do you mean?”</p><p>“Your thimble. Did you find it at the Bull and Blossom?”</p><p>The thimble. Diana shook her head. “It wasn’t there.”</p><p>“That’s so odd.”</p><p>“Not really. It’s just a thimble. Thimbles go missing.”</p><p>“But just this morning, Mrs. Nichols was missing her ink bottle, too. It’s a mystery.”</p><p>Diana smiled. Charlotte’s imagination always led her to see more excitement than was truly there. “I’m sure it’s a coincidence.”</p><p>“It’s a tragedy,” Mama exclaimed, stopping in the lane. “Oh, this cannot be borne.”</p><p>“The disappearance of my thimble, a tragedy? I think I can survive it.”</p><p>“No, look.” Mama gestured toward the sky, where the thick blanket of clouds had parted to reveal a patch of blue—and within it, the bright, cheery face of the sun. “The sun is out. Oh, this is dreadful.”</p><p>“Dreadful?” Charlotte laughed. “It’s our first sunshine in a fortnight. It’s marvelous.”</p><p>“It is dreadful. Because your sister left the rooming house with only her cloak and no proper bonnet.” She hurried to Diana’s side. “Ten minutes of this, and she will freckle. Oh, and less than a week before our invitation to Ambervale. What will Lord Drewe think?”</p><p>“If he notices—which I doubt he will—he will think I’ve been in the sun.”</p><p>“Exactly!” She tugged at the hood of Diana’s cloak, drawing it up as far as it would go. “Keep your head down, Diana. Just look at your feet.”</p><p>Diana lifted her head, letting her hood fall back. “But then how will I see where I’m going? I might fall on my face. I should think Lord Drewe would take more notice of bruises than he would freckles.”</p><p>“Head down, I say.” Mama yanked the hood up again.</p><p>“No.” Diana thrust it back. “Mama, you’re being ridiculous. This is a beautiful morning. I mean to enjoy it.”</p><p>She braced herself for another round of Tug-o’-Hood, but Mama didn’t care to play. She was distracted by the sounds of hoofbeats and carriage wheels and turned to peer down the lane.</p><p>“There is Mr. Keane with his curricle. He will save you.”</p><p>“Save me? I survived years of asthma. I don’t believe freckles are a terminal condition.”</p><p>“Head down,” she snapped. As the curricle drew near, she lifted one arm and waved to him with her handkerchief, like a drowning sailor in need of a rope. “Mr. Keane! Oh, Mr. Keane, do help!”</p><p>“Please don’t trouble him.”</p><p>“He is the vicar. He ought to do a good deed.”</p><p>The curricle rolled to a halt in the lane. What with the strong sun and the harsh shadows, it was hard to peer into the covered bench seat—but the driver didn’t seem to be the vicar. This man was rather . . . larger.</p><p>“Is there some problem?” he asked in a dark, all-too-familiar baritone.</p><p>Oh no. No. It couldn’t be.</p><p>What wretched luck. Diana took her mother’s advice. She drew her hood up and stared at her boots.</p><p>“Why, Mr. Dawes,” her mother said, her tone wary. “What are you doing with Mr. Keane’s curricle?”</p><p>“Mama,” Diana hissed. Good Lord, she made it sound as if he’d stolen the thing.</p><p>“And good morning to you, Mrs. Highwood,” Mr. Dawes answered patiently. Out of the corner of her eye, Diana saw him tip his cap. “Miss Charlotte. Miss Highwood.”</p><p>She felt his gaze on her. Now it didn’t matter if she stayed out of the sun. A blush this furious would surely stain her cheeks for a month.</p><p>“Mr. Keane asked me to mend the axle,” he explained. “I’m out for a short drive to test the repair before I return it. Is something wrong?”</p><p>As she listened to her mother carry on about the tragedy of sunshine and the need to keep her daughter’s complexion unmarred for Lord Drewe, Diana squirmed with shame.</p><p>“Surely you can drive her back to the rooming house,” Mama said. “I know it’s a liberty, as you are a hired man. But I daresay I can grant permission in Mr. Keane’s stead. It’s what he would do, as a gentleman.”</p><p>Mother!</p><p>In how many ways could she insult him? Mr. Dawes was not a “hired man.” He was a skilled craftsman and artisan, and everyone in the village—Mr. Keane included—respected him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Diana had to look up now. “Please don’t let us trouble you, Mr. Dawes. I’m perfectly fine walking.”</p><p>“Perfectly fine!” her mother squawked. “You’ll be perfectly crisped.”</p><p>She caught his gaze and tried to send an apologetic look. Forgive her. And me.</p> <p>His expression was impossible to read. “I’d be glad to give Miss Highwood a ride into the village. I’m going there anyway.”</p><p>“That is very good of you,” her mother said. “When I see him, I will be sure to speak highly of your service to Mr. Keane. Perhaps there will be a shilling in it for you.”</p><p>“Very kind of you, ma’am.”</p><p>Mr. Dawes alighted from the curricle, adjusted the folding hood for maximum shade, then offered his hand to help Diana. Despite the awkwardness of the situation, she took a thrill from the feel of his hand dwarfing hers and the easy strength with which he boosted her onto the seat.</p><p>When he joined her, she pressed herself all the way to the opposite side.</p> <p>“We’ll see you back at the Queen’s Ruby,” Mother said. “Don’t fret about me walking. I will be fine. Even at my age.”</p><p>“I’m sure you will be,” Diana muttered.</p><p>As Mr. Dawes flicked the reins and set the curricle in motion, Diana slunk down in her corner of the seat.</p><p>She learned something new as they rattled down the lane.</p><p>Awkwardness wasn’t characterized by silence. Oh, no—awkwardness had a symphony all its own. The thump of an erratic heartbeat, contrasting with the steady squelch of hooves on packed mud. The roar of a thousand unspoken words piled up in one’s throat, all clamoring to get loose. The sound of fence posts whooshing past—each one brought them closer to the village, and each one felt like a stinging lash of rebuke. Another opportunity missed.</p><p>Frantic emotion built in her chest. She couldn’t stay quiet any longer.</p> <p>“Mr. Dawes. Please let me apologize. For my mother just now. And for my behavior last night. And yesterday afternoon. I don’t know what—”</p><p>He held up a hand, gently shushing her.</p><p>“Truly. You must think me the most presumptuous—”</p><p>“Nothing of the sort,” he said, keeping his eyes on the road. “I’m just trying to listen for the axle. I think I heard it creak.”</p><p>“Oh. I’m sorry.” She bit her lip, hard. Stop talking, ninny.</p><p>“Have these for a moment.” He passed her the reins, then bent and twisted away from her, looking over the curricle’s side to observe the axle in motion.</p><p>Diana stared down at the leather braids in her hands. Then she looked at the trotting horses and the muddy road flying by beneath them.</p><p>“Mr. Dawes,” she whispered, hoarse with fear. “Mr. Dawes, I’ve never—”</p> <p>He held up that hand again, requesting silence. “Just a moment.”</p><p>This couldn’t wait a moment.</p><p>“Mr. Dawes.”</p><p>He straightened and turned to her. “What’s the matter?”</p><p>“Kindly take the reins,” she begged. “I don’t know how to drive.”</p><p>“You seem to be driving right now.”</p><p>“But what if we have to turn? Or slow down? Or stop?” She tightened her grip. “Oh dear. Now they’re going faster.”</p><p>He eased closer to her on the seat. His arm pressed against hers. “You’re doing fine. It’s not a busy road, and the horses know their way.” He put his hands over her wrists, shaking lightly. “Just lift the reins a bit and loosen your grip. These are good horses. They’re trained to a soft touch.”</p><p>He helped her position the reins, sliding them between her fingers.</p><p>“Like this?” she asked, sitting straight.</p><p>“That’s just it. You’re doing well.”</p><p>His low, gentle voice entranced her and gave her confidence.</p><p>He showed her the commands for right and left; how to urge the horses faster and draw them to a halt. The lesson made for welcome distraction. At least they had something to discuss other than the mortifying events of yesterday.</p><p>“Every woman should learn to drive,” he said. “I taught my own sisters when they were old enough. I never understood why the Spindle Cove ladies spend all those mornings shooting pistols and muskets, yet never have driving or riding lessons.”</p><p>“I suppose the shooting lessons make us feel strong. In control of ourselves and our lives.” At least, that’s what the ladies’ weekly target practice did for Diana.</p><p>He shrugged. “I’m not saying it’s bad. But there’s feeling powerful, and then there’s actually taking the reins. They are a great many situations a woman might do well to drive away from. Very few where it’s advisable to shoot her way out.”</p><p>He was right, Diana thought. Loading and shooting a pistol might give a lady a rush of exhilaration, but this was true power. The freedom to choose her own direction, and harnessing the power to take her there.</p><p>“There, now you know how to drive.” He moved back to his side of the seat. “Where do you want to go?”</p><p>Diana pulled on the reins, drawing the horses to a lurching halt in the middle of the empty lane. “I want to stop right here and apologize to you. I know you don’t wish to speak of yesterday, but I cannot be easy until I say this. You were very kind to me, and I can’t . . . I heard the way my mother spoke to you just now, and I need you to know I don’t think of you that way. When I came to the tavern last night, I wasn’t just seeking a moment of rebellion. I . . .”</p><p>She’d been staring at her hands all this time, but she forced herself to look up. At him.</p><p>His handsome features were a mask of confusion. Oh, she was making a hash of this.</p><p>“May I be honest with you?” she asked. “I think that’s the best strategy. I’ll just say everything I’ve been keeping to myself. And when it’s out, it will surely sound ridiculous. We’ll have a good laugh, and that will be the end of things. Can you bear it?”</p><p>His wide mouth crooked in a smile. “I can bear far worse.”</p><p>“I . . .” Out with it. “I’ve been infatuated with you for quite some time. It’s terrible.”</p><p>“Terrible,” he echoed.</p><p>“Not that you’re terrible, of course. That ‘s not what I mean. I think you’re remarkable. I’m the terrible one. It all started that night of Finn’s accident. You were so confident and so strong. Just did what needed to be done, and no wavering.”</p><p>“That night? Believe me, I was wavering. On the inside, I was wavering.”</p><p>“I never would have known it.” She laughed a little. “Of all the places to develop an infatuation. Making eyes at a man over an amputation table. It’s embarrassing, isn’t it?”</p><p>“Rather.”</p><p>“Hardly a story a woman wants to tell her grandchildren someday.”</p><p>“No, I don’t suppose it would be.”</p><p>She felt lighter already. “See, I told you this would all sound ridiculous. Oh, and there’s so much more. You already know that I purposely broke things just to have excuses to come by the smithy. When did you start to realize the truth?”</p><p>“Just recently.” His mouth tugged in a self-effacing grimace. “I’m not too sharp.”</p><p>She waved off his words. “That’s not true. You’re so perceptive. It’s evident in your finer work. I’ve spent hours poring over your jewelry pieces in the All Things shop. I’ve bought five of them.”</p><p>“Five?”</p><p>“Yes. Five.” She cringed. “I told Sally I was sending them to friends as gifts. A small taste of Spindle Cove, I said. But I never meant to give any of them away. I kept them all for myself. It was so stupid of me, because once I’d said they were gifts, I couldn’t be seen wearing them. And if I kept them in my jewelry box, Charlotte would find them—she’s always going through my things without permission. So I resorted to keeping them in the chest with my trousseau. They’re wrapped up in a tablecloth.”</p><p>“You have five of my pieces in your trousseau?”</p><p>“Well, only four.”</p><p>“Where’s the other one?” he asked.</p><p>She shook her head and pressed a hand to her cheek. “Oh, this is where it gets truly mortifying. There was one I couldn’t bear to put away. But I couldn’t gather the courage to wear it, either. So I took it off its chain and sewed little pockets into my frocks. Every morning, I slip it in as I’m dressing, and at night, I tuck it . . .” She buried her face in her hands.</p><p>“Where?” He sounded as if he was enjoying this now.</p><p>“Under my pillow,” she moaned into her hands, knowing he’d laugh. “As if I’m a girl of fourteen.”</p><p>He did laugh, but he did it good-naturedly.</p><p>“I admire all your work, but that one is my favorite. From the moment I saw it in Sally’s display case, I knew I had to have it. It just . . .” She’d come this far. No turning back now. “It seemed made for me.”</p><p>He was quiet for a moment. “Was it a little silver pendant with a quatrefoil design?”</p><p>She nodded. “Yes.”</p><p>“Then you had it right,” he said. “So long as we’re being honest. It was made with you in mind.”</p><p>Her heart turned over in her chest. “Oh.”</p><p>“I do all my best work with you in mind. I never questioned why you came by the forge because I was just pleased you came. I didn’t want you to stop. And that night with Finn? That’s when it started for me, too.”</p><p>They stared at each other. His dark eyes held her rapt.</p><p>“I find you terribly handsome,” she blurted out. Because it was the only thing left unsaid.</p><p>He rubbed the back of his neck. “I would tell you you’re the kind of lovely that’s unfair to roses and sunsets. But I don’t think this honest conversation is working the way you hoped.”</p><p>“No. It’s not. We were meant to be laughing, but none of this seems ridiculous. In fact, it feels more serious by the moment.”</p><p>To know that her attraction hadn’t been one-sided—that she’d been right about those long, searching looks he’d given her now and then . . . The vindication buoyed her spirits, and a delicious tingle ran from her scalp to her toes. But from there, she didn’t know what happened next.</p><p>Evidently, he had some ideas.</p><p>He took the reins from her hands and secured them on the dash rail. Then he gathered her in his arms and drew her close.</p><p>Her heart stuttered. This was really going to happen.</p><p>She’d run from his kiss the first time.</p><p>The second time, she’d begged him for it.</p><p>This time, she’d learned her lesson. She did nothing but remain absolutely, perfectly still.</p><p>And it worked.</p><p>His lips touched hers, imparting that unique blend of strength and tenderness she was coming to treasure. To crave.</p><p>But all too soon, he lifted his head. “Have you been kissed before?”</p><p>“I don’t know whether to say yes or no. Which answer will make you do it again?”</p><p>“Oh, I’m going to do it again.” His thumb stroked her cheek. “Just wanted to know how slow to take things.”</p><p>“A little faster would be fine.” She’d been waiting twenty-three years, after all.</p><p>His answer was a thrilling, sensual growl. “As you like.”</p><p>He renewed the kiss with a series of rough presses of his mouth to hers. Warm friction teased her lips apart, and his tongue swept between them.</p><p>The invasion was startling. She felt as though the ground had gone to liquid beneath her, and now she was adrift on unfamiliar seas. Far outside the boundaries of her experience.</p><p>As if he sensed her uncertainty, his arms flexed tight, drawing her flush with his chest. Her head naturally tilted back. She was vulnerable beneath him now, and he took control, deepening the kiss. His tongue stroked hers. The grain of his whiskers rasped at the edges of her lips. Intriguing and so essentially male. She wanted to touch him, slide her fingertips down the edge of his jaw. But she lost her courage, afraid to make a mistake and bring an end to everything. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She wanted this to last and last.</p><p>When he did pull away, he made no effort to hide that he was affected, too. It was all there, in his eyes. The deep wellspring of mutual desire and need they’d barely tapped.</p><p>“Mr. Dawes,” she sighed. “What do we do?”</p> <p>“First, you start calling me Aaron.”</p><p>She tested it. “Aaron. What do we do?”</p><p>He put space between them. “I suppose this is where I should revise the speech I started last night. Remind you that you’re a gentlewoman and I’m a craftsman, and nothing can come of this. And tell you we should just go back to trading longing glances across the green and never speak of this again. But the thing is, I don’t feel like giving that speech this morning.”</p><p>“Oh, good,” she said, relieved. “Because I’m not at all in the mood to hear it.”</p><p>“We’re both sober. It’s a fine, clear day. You’re a grown woman, and a clever one. I believe you understand the situation. And I’m going to trust that you know your own mind.”</p> <p>Her heart swelled. What a lovely, lovely gift. No one else had ever done the same.</p><p>He put one hand over hers. “We have something, the two of us. I don’t think we could name it quite yet, much less decide what we’d do to keep it. But if you like, we can spend more time together and puzzle it out.”</p><p>“I would like that. Very much.”</p><p>Goodness. It was settled, then. She had a proper suitor for the first time in her life—and he was a blacksmith. If her mother learned of this, she would be taken with fits.</p><p>She added, “But we should probably be discreet. At least for now.”</p><p>Something flashed in his eyes, and she was worried she’d offended him. It wasn’t that she was ashamed, of course. Just careful.</p> <p>She fingered the vial of tincture hanging around her neck. Old habits were difficult to break.</p><p>He reached to untie the reins. “I’d best be getting you back to the rooming house. I did promise your mother you wouldn’t freckle.” He gave her a wry wink. “I hear there may be a shilling in it for me.”</p><p>“Wait,” she said.</p><p>Before he could set the team in motion, she rose up on the curricle seat, turned, and forced down the collapsible cover so that sunlight splashed them both.</p><p>“There.” She removed her cloak and settled beside him, putting her arm through his. “Now we can go.”</p><p>CHAPTER 4</p><p>“I’ve assigned all the parts,” Charlotte said, handing copies of the play to the assembled ladies in the Queen’s Ruby. “We’ll read through it once this morning.”</p><p>“Heaven knows, there’s nothing else to do,” lamented Miss Price, looking out the window at another rainy day.</p> <p>Diana looked down at her copy with URSULA labeled at the top. “Really, I didn’t think this was settled. Why am I playing Ursula?”</p><p>Charlotte said, “It’s the easiest role in the play, I promise you. The rest of us will be running about screaming and pleading for our lives, and you just stand there and look pure.”</p><p>Diana lifted a brow. Pure? Would they still find her the ideal person for this role if they knew she’d been kissing Mr. Dawes in the vicar’s curricle yesterday?</p><p>No, not kissing Mr. Dawes. Kissing Aaron.</p><p>Aaron, Aaron, Aaron.</p><p>“Diana.”</p><p>She shook herself. “I’m sorry, what?”</p><p>“It’s your line.”</p><p>She scanned the first page and found her part, then read aloud in an even voice. “Oh, wreck and woe. My father hath betrothed me to the son of a heathen king. I should sooner die than be so defiled.”</p><p>“Do speak up, Diana,” her mother chided from across the room. “No one can hear you. Imagine Lord Drewe is standing just offstage, waiting for his cue.”</p><p>“And put emotion into it,” Charlotte added. She stood and flung one arm to the side, pressing the other wrist to her brow. “Oh, wreck and WOE. I should sooner DIE.”</p><p>Diana sighed. “I don’t think I possess the dramatic talent for this.”</p><p>“Of course you do.”</p><p>“Well, perhaps I just don’t feel equal to it today.”</p><p>“Are you ill?” Mama asked sharply.</p><p>Diana paused. She’d promised herself she wouldn’t hide behind this excuse any longer. But she didn’t want to be sitting here in the rooming house when she could be with Aaron.</p><p>Kissing Aaron. Touching Aaron. Embracing Aaron and feeling surrounded by his big, strong arms.</p><p>She had no heart to play the martyred virgin right now.</p><p>“I knew it,” Mama wailed. “Oh, I knew that sun would do you an ill turn. No more rehearsal for you today. Go straight upstairs and rest. I will not have you falling ill when it’s time for our outing to Ambervale. Do you have any more of that infusion from Lady Rycliff?”</p><p>“I’m sure I don’t need an infusion, Mama. But perhaps I will go.” She turned to Miss Bertram. “Would you be so kind as to read my part for today?”</p><p>Miss Bertram’s eyebrows rose in alarm. “Oh, I . . . I don’t know.”</p><p>“I think you would make a marvelous Ursula. And you would be doing me a great favor.”</p><p>The girl took the booklet from Diana’s hand, smiling shyly. “Well, Mr. Evermoore does love my reading voice.”</p><p>“I’m sure he does.”</p><p>Diana tried to soothe her conscience as she left the room. She hadn’t lied. Mama had merely assumed, wrongly, that she felt ill. Just like she assumed, wrongly, that Diana would follow her instructions to go upstairs and rest.</p><p>But she didn’t.</p><p>Instead, she gathered her cloak and slipped out the rear door.</p><p>As she neared the smithy, a giddy flutter rose in her chest. No horses or wagons in the front meant she’d likely caught him alone. A sheen of perspiration rose on her brow even before she entered the steamy, spark-filled forge.</p><p>She entered to find Aaron not pounding at the anvil but hunched over a bit of fine metalwork at his worktable.</p><p>“Good morning,” she said, swaying her skirts a bit.</p><p>He looked up only briefly and gave her a curt “Good morning” before returning his concentration to his task. “Sorry you’ve caught me in a busy moment. I can’t leave this, or it will cool unfinished.”</p><p>“Of course. Should I come back another time?”</p><p>A furrow formed in his heavy brow. “No, don’t go. Unless you want to.”</p><p>“I’d like to stay.” She settled on her usual stool. “If I won’t be troubling you.”</p><p>Now he looked up, and his dark eyes caught hers. “You could never be any kind of trouble.”</p><p>Never mind the roaring forge, that look sent heat rushing through her. Oh, dear. And here she was, caught without her fan.</p><p>He returned to his labor, and she sat quiet and still. She did love watching him at his work. This was different from his display of brawn and sweat she’d admired the other day. When he worked with fine metal, all that power was pushed through a narrow funnel of concentration.</p><p>The result was passion. He had an artist’s passion for his creations. She touched the quatrefoil pendant in her pocket.</p><p>“There.”</p><p>He set the piece aside and wiped his brow with his shirtsleeve. He left a black smudge of soot on his temple, and she found it strangely enticing. A mark of that passion, emblazoned on his skin. It spoke of virility in a primal way.</p><p>“What are you making?” she asked.</p><p>He showed her a silver bracelet, formed of two twining vines. “It’s a special order for a jeweler in Hastings.”</p><p>“You’ve been selling your work in Hastings?”</p><p>He nodded. “Rye and Eastbourne, too. I’m hoping to expand to Brighton soon.”</p><p>“And London after that?”</p><p>He shrugged. “Perhaps. But there’s only one of me. There’s a limit to how much I can do on my own.”</p><p>“Have you thought about taking on an apprentice?”</p><p>“It’s not working the forge that I need help with, so much as everything else. Fosbury says what I really need is a wi—”</p><p>He cut off the word, but Diana completed it in her mind.</p><p>What I really need is a wife.</p><p>It made sense. Marriage was a partnership in any social class. Among gentry, the lady’s contribution was a dowry or well-placed connections. As a craftsman, Aaron would do well to marry a woman with practical skills to help him manage his household and his business.</p><p>Skills women like Diana didn’t possess.</p><p>They traded awkward glances, and they both seemed to be thinking the same thing. What were they doing here? He wasn’t the kind of suitor her mother would accept, and she couldn’t be the wife he needed. If marriage was impossible, they were only flirting with heartbreak and scandal.</p><p>Still, she couldn’t bring herself to leave.</p><p>We have something, he’d said yesterday, and he was right. Diana wasn’t ready to give up on it yet.</p><p>He went back to his work, raking the fire and pumping the bellows that fueled the forge. “Much as I’d like to take the day off and spend it with you, I have to finish this piece. I’ve promised to deliver it tomorrow.”</p><p>“I understand. Is there any way I can help?”</p><p>“That’s kind of you to offer, but I’m not going to have you hauling wood and water.”</p><p>“Why not? I helped with such things the night Finn was hurt.”</p><p>“Aye, but that was an emergency. If I hadn’t been so preoccupied, I never would have allowed it.”</p><p>“If you’d tried to send me away, I wouldn’t have listened.” She had a tenacious streak. There had to be something she could do. “Have you eaten your noon meal?”</p><p>He shook his head.</p><p>“Then that’s what I’ll do. While you finish that piece, I’ll prepare a meal. Then we’ll sit down to eat and have time to talk, but I won’t feel I’ve distracted you from your work.”</p><p>He looked uncertain.</p><p>“Aaron, please. Let me do this. You did say you’d trust that I know my own mind.”</p><p>“So I did.” He blew out his breath and wiped his hands on a rag. “Very well, then.”</p><p>He turned to the hearth and scooped some red-hot embers with a tiny shovel, then handed the shovel out to her.</p><p>She moved to take it, though she wasn’t sure what she was supposed to do with it next.</p><p>“For the fire,” he explained.</p><p>“Yes, of course.” Of course. How could anyone cook without a fire?</p><p>“One of the fishermen brought me something fresh from the catch this morning, and there’s fresh butter and cream, as well. Potatoes and onions in the bin. Poke about the cabinets, and I’m sure you’ll find whatever else you need.”</p><p>“I could do with a kiss. Will I find one of those in the cabinets?”</p><p>“That I have right here.” He tilted his head and gave her a brief, yet exhilarating, kiss.</p><p>She clutched the scoop of glowing coals. “I’ll be just fine, you’ll see. Now back to work with you.”</p><p>She turned and headed toward the rear door of the forge. Beyond it, a narrow yard separated the smithy from his cottage.</p><p>“Diana?”</p><p>At the sound of her Christian name spoken in that intimate, low baritone, a thrill went through her. She nearly spilled the coals. “Yes?”</p><p>“If you need anything, you will ask?”</p><p>“Oh, of course I will,” she assured him. “Don’t look so worried. It’s not as though I’ve never done this before.”</p><p>Diana had never done this before.</p><p>Any of it.</p><p>Not light a fire, not clean a fish . . . and most certainly not cook a meal. But she was going to do all this today, and she was going to do it well.</p><p>She entered the cottage kitchen. It was a sparely furnished room, but orderly and clean. There was no denying it could do with a woman’s touch—the curtains hanging in the window were recently laundered, but faded. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>In a covered basin on the table lay, she assumed, the fish. Most likely sole or plaice, she imagined. A flat, muddy footprint of a fish that Diana would somehow need to behead. And gut. And scale and fillet and . . .</p><p>She swallowed hard.</p><p>That part could wait. She’d pare the vegetables first.</p> <p>The fire, she suddenly realized. Goodness. She couldn’t cook anything without a fire.</p><p>By habit, she’d never strayed too near a fireplace or stove—not only because her mother had insisted gentlewomen didn’t dirty their hands with such tasks but also because Diana had feared that inhaling smoke or ash could trigger a breathing crisis.</p><p>Those worries were in the past now. She faced a different challenge today.</p><p>She cautiously carried the scoop of glowing coals to the kitchen hearth. A nearby box held some straws and dried moss. Crouching on the hearthstones, she heaped the tinder in the grate, then lifted the scoop and gently sifted a few embers atop it.</p><p>A fizzling curl of smoke rose up.</p> <p>And promptly died, taking all her excitement with it.</p><p>What was she doing wrong? She thought of Aaron stoking the fire in the smithy, raking and turning the coals . . . pumping the bellows.</p><p>The bellows. That was it. A fire needed air.</p><p>She scattered another few embers over the tinder, then lowered herself almost to her belly, pursed her lips, and blew. A flurry of sparks resulted. Encouraged, she inhaled slowly, then exhaled again, careful not to overtax her lungs. This time, the little sparks swelled and caught the tinder, resulting in a few lapping tongues of flame.</p><p>Diana rose to her knees and cheered—quietly—while brushing the dust from her hands and skirts. A small triumph, perhaps, but a promising start.</p><p>Her sense of triumph quickly dampened, however, when the tinder began to flame out and she realized she had no split logs to keep the fire going. She looked around. Nothing, to either side of the hearth. Then she recalled the well-stocked woodpile outside the smithy, under the overhang.</p> <p>After another slow, loving exhalation to nourish her small flames, she rose and dashed outside, gathering an armful of splits from the pile before hurrying back, all the while praying the fire wouldn’t die in her absence.</p><p>She knelt before the hearth—no more care for her skirts this time—and placed the thinnest of the logs atop the burning tinder.</p><p>The flames were immediately smothered, dying in a thin plume of white, elegiac smoke.</p><p>“No,” she cried. “No, no, no.”</p><p>She flattened herself to the hearthstones and huffed desperately, trying to rekindle the flame.</p><p>She couldn’t go back to Aaron and ask for more coals. He would know she’d failed before she’d even begun, and that she couldn’t perform the most basic of household tasks. What use could she ever be to him? It wasn’t as though they’d talked about marriage, but she wasn’t ready to foreclose the possibility.</p><p>“Please,” she begged. “Please, please. Don’t go out.”</p><p>And as if some pagan god of fire heard her petition, a small flame caught a notch on the underside of the wood. The fire began to gnaw at it, dripping morsels of ash.</p> <p>Hosanna.</p><p>She fed the fire carefully, not daring to stray a pace from the hearth until she had a tall, respectable blaze.</p><p>When she felt it safe to rise, she gave the basin on the table a wary glance. She wasn’t ready for that fish just yet.</p><p>Instead, she found a knife and set about paring vegetables and adding them to a kettle of salted water. She managed three potatoes, two carrots, and an onion with only one slice to her finger. She bound her wound with a strip of linen torn from her handkerchief. The onion made a useful scapegoat for her silly tears.</p><p>After hanging the kettle on a hook and swiveling it over the fire to boil, she could no longer postpone the inevitable.</p><p>Time to gut the fish.</p><p>She went to the table and lifted the cover from the basin.</p><p>“Ah!” With a muted shriek, she dropped the cover. It felt back with a bang.</p><p>Oh Lord, oh Lord.</p><p>Several moments passed before she could bear to lift the cover again and peer inside. She hoped to see something different this time. But no.</p><p>There it was.</p><p>It wasn’t a fish.</p><p>It was an eel.</p><p>And it was still alive. Just angrily alive and now agitated, weaving slick, dark-green figure eights in its basin of murky water.</p><p>With a shudder, Diana covered it again. Then she drew out a chair and decided to sit and think for a while, about just how much she truly wanted this.</p><p>She closed her eyes and thought of Aaron’s kiss. The strength of his arms around her. The heat of his body, and the tender mastery of his tongue coaxing hers. She remembered their driving lesson. The joy of racing down a country lane, as fast as the spring mud would allow, with the top of the curricle down.</p><p>Then she pictured that eel, filling the basin with its writhing, slippery will to live.</p><p>She just couldn’t. Could she?</p><p>Diana opened her eyes and steeled her resolve. Some days, she decided, freedom meant the wind in your hair and the sun on your face and lips swollen with forbidden kisses.</p><p>And other days, freedom meant killing an eel.</p><p>She found the largest cleaver in the kitchen and gripped it in her right hand. With the left, she lifted the cover from the basin.</p><p>“I have nothing against you,” she told the eel. “I’m sure you’re a perfectly fine creature. But Aaron and I have something. And I’m not going to let anything stand . . . or slither . . . in the way of it.”</p><p>And just as she reached in to grab the thing . . .</p><p>It jumped.</p><p>It jumped clear out of the basin and—to Diana’s gasping horror—landed directly on her chest.</p><p>CHAPTER 5</p><p>Once Diana disappeared into the cottage, Aaron quickly lost himself in his work. He needed to get this piece right. If the jeweler was satisfied, it would mean a tidy sum in Aaron’s pocket—and more commissions in the future.</p><p>He did this finer work because he enjoyed it; the profit had always been secondary. He lived simply, and village smithing gave him more than sufficient income to meet his needs. But he was thinking about the future now.</p><p>Thinking hard.</p><p>He didn’t even realize how much time had passed until he looked up from the finished bracelet and saw it was midafternoon. Damn it. He’d left her waiting for hours.</p><p>He banked the fire, removed his apron, put away his tools, and locked the finished bracelet in his strongbox. Then he took a few minutes to wash at the pump before going inside. Wouldn’t do to go in all sweaty and covered in soot.</p><p>As he worked a soapy lather over his hands and forearms, his anticipation grew. This was like a dream come true. A day’s honest work at the forge, a well-made result, and Diana Highwood waiting for him at home, ready with a warm smile and a hot meal.</p><p>He ran his hands through his dampened hair to tame it, then entered the cottage through the kitchen door.</p><p>He found the place in shambles.</p><p>The room was cold. Every dish, pot, and spoon he owned had been turned out of the cupboards, it seemed. Peelings littered the floor. The acrid stench of burned potatoes hung in the air.</p><p>And Diana sat at his table, sobbing noisily, her head buried in her stacked arms.</p><p>“My God, what’s happened?” He crossed to her at once and knelt at her side. “What is it? Tell me.”</p><p>“It’s ruined,” she cried.</p><p>“What’s ruined?”</p><p>“Everything. Your meal. My life. Our chances.” She hiccupped. “The eel.”</p><p>“The eel?” He made attempts to soothe her, stroking her hair and back. “What happened to the eel?”</p><p>“It . . .” She squeaked out a little sob. “It got away.” A fresh burst of tears muffled the remainder of her reply.</p><p>“It got away?” He struggled manfully to contain his laughter.</p><p>“I had the knife . . . and it . . . it jumped. I didn’t know they could jump. Do you know they can jump?” She gestured wildly about her neck and head. “On my chest . . . in my hair . . . I couldn’t . . .” She coughed out an indelicate sob. “I flung it off me. It landed out the window, and then it got away.”</p><p>He glanced out the window she’d indicated. The weather had left the ground sufficiently wet and muddy that he could imagine an eel finding its way into a wheel rut and traveling a fair distance. It wouldn’t likely get far, but it could get away.</p><p>He laughed again. “I’d say that eel earned its pardon, then.”</p><p>“And then the vegetables boiled over, and the overflowed water put out the fire, and I . . . when I went to stoke it, a cinder caught me on the cheek. I’m sure it left a mark.” She lowered her head to her arms again. “Everything’s ruined. The meal is ruined, I am ruined. I’m too useless to be a working man’s wife, and”—her shoulders quaked with another sob—“and now I’m disfigured, so no gentleman will want me. I’m going to die an old maid.”</p><p>As she spoke, her voice tweaked higher and higher. Until her last word was no more than a plaintive squeak.</p><p>“An old maid?” he echoed. “Because of one meal that went awry? Diana, I don’t know what to say. Other than to offer my congratulations.”</p><p>“Congratulations?”</p><p>He patted her shoulder, chuckling. “I grew up with a mother and two sisters, and all of them like to talk. And that is, undoubtedly, the most feminine progression of thought I’ve ever heard voiced aloud. One escaped eel, make you a spinster?”</p><p>She sniffled.</p><p>He pulled up a chair next to hers and reached to touch her cheek. “Let me see the burn.”</p><p>With reluctance, she offered her face for his view. “Is it very hideous?”</p><p>What a question. As if she could—ever—be anything less than beautiful in his eyes.</p><p>“This?” He pressed his thumb to the tiny red scorch mark on the gentle sweep of her cheekbone. “This is nothing. Barely noticeable, and it will fade in no time. I’ve had countless such burns myself.”</p><p>“And you’re still exceedingly handsome. So that’s some comfort.” She wiped her eyes with a shredded handkerchief. “You must think me ridiculous. I am ridiculous.”</p><p>“No, you’re not ridiculous. I understand.”</p><p>“How? Do you worry about being an old maid, too?”</p><p>He smiled. “I know we come from different backgrounds. But we’ve more in common than you’d think. I was the oldest child, too. And when my father died, I had a mother and two younger sisters to look after.”</p><p>“How old were you when he passed away?” she asked.</p><p>“Seventeen.”</p><p>“I’m sorry. That’s very young to be the man of the family.”</p><p>“I was old enough to take his place at the forge, thankfully. I threw myself into the trade, because I knew it was how I could keep my family safe. Spent so much time at that anvil, when I went to bed I pounded iron in my sleep. Then one day, I was shoeing a horse and put my hand in the wrong place at the wrong time. The horse caught my thumb and bit it, hard.” He lifted his hand to demonstrate. “My thumb was all black and swollen. I spent a week not knowing if the bone was crushed, too. Next to losing my father, it was the worst time of my life. I thought I wouldn’t be able to work. The family would starve . . .”</p><p>“Everything would be ruined.”</p><p>“Exactly.”</p><p>She nodded. “I see what you’re saying. You’re right, we are much the same. It’s not my vanity that’s pained, it’s just . . . I was always raised to believe the family depended on me. That my prospects—and to put it bluntly, my face—were our security.”</p><p>“So when your mind leaps from a scorched cheek to permanent spinsterhood, it’s understandable. But that doesn’t make it reasonable. You must realize you’re not responsible for your family anymore. Not since your sister married Lord Payne.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I know.” She dried her eyes and drew in a breath. “I don’t know why I’m sitting here weeping. I just wanted so badly for this meal to come out right.”</p><p>Aaron put a roughened hand over her delicate one, touched by the implication of her words. She wanted more than just the meal to come out right. She wanted this to work between them, and so did he. But it wouldn’t be easy.</p><p>“There’s hope yet.” With a fond squeeze to her hand, he stood. “Let’s clean this up and make something to eat.”</p> <p>They worked together. While Aaron rebuilt the fire, Diana wiped the table and swept the floor—and then she ducked outside for a moment to wash her face and tame her frazzled hair. She did have some vanity.</p><p>She returned to find Aaron taking eggs and hard cheese from the larder.</p><p>“I hope omelette will do,” he said. “I don’t know any fancy cuisine, but I’ve become quite accomplished in bachelor cooking. Once my mother and sisters moved away, it was that or starve.”</p><p>“Omelette sounds wonderful.” She marveled at the way he could carry four eggs in one hand, holding them each separate with his big fingers. “Where did they move to? Your mother and sisters, I mean.”</p><p>“They both married sailors. One married a navy man, and she moved to Portsmouth. Mum went with her to help while he’s at sea. The other lives over near Hastings. Her husband’s a merchant sailor.”</p> <p>“Do you have nieces and nephews?”</p><p>“Five so far,” he said proudly. He broke the last egg and added it to the bowl. “If you want to help, you could pare some shavings of that cheese.”</p><p>She gathered a board and a small knife, then set about slicing the cheese as thinly as she could. Simple as the task was, she still had a near miss with the blade. His forearms were every bit as distracting in the kitchen as they were in the forge. She was entranced, watching him whisk the eggs with a long-handled fork.</p><p>He was so good with his hands in every situation. It was hard not to imagine the wonders those hands could work on her.</p><p>She ducked her head and finished paring the cheese.</p><p>He took a skillet from a hook and cut a lump of butter into it before carrying it over to the fire.</p> <p>While he cooked the omelette, Diana sliced a loaf of bread and set the table for two. A burst of whimsy led her to gather two china candlesticks from a high shelf, dust them, and fit them with tapers.</p><p>He smiled when he saw them. “That’s nice. Those don’t get used often.”</p><p>As they sat down to eat, she felt like she’d finally done something right.</p><p>“I’ve been wondering.” He jabbed at his food, gathering a man-sized forkful of eggs. “So you’re named Diana, for the Roman goddess of hunting.”</p><p>“And virginity.” Her lips quirked.</p><p>“Right.” He wolfed down another bite of eggs. “And then your next sister is Minerva.”</p><p>“Roman goddess of knowledge.”</p><p>“So where does ‘Charlotte ’come in? Shouldn’t she be a goddess, too?”</p> <p>“She was meant to be. Those classical names were all the fashion in my mother’s day, and you know my mother is always concerned with the latest fashion.” She pushed the eggs around her plate. “She had the idea to name all her daughters after deities. I think Charlotte was supposed to be Venus. No, no. Vesta.”</p><p>He choked on his food. “Either is cruel.”</p><p>“I know, I know. My father’s name was Charles, and they’d been waiting to name a son for him. But he fell ill while my mother was pregnant the third time. I think my mother knew there wouldn’t be a fourth child, or any son at all. So that’s how Charlotte was named Charlotte and spared the cruelty of Vesta.”</p><p>He put down his fork. “I’m sure she’d rather have the cruel name if it meant having her father. I shouldn’t have joked.”</p><p>“Don’t be sorry. Nearly everything my mother does is ripe for ridicule. But occasionally she does mean well.”</p><p>They finished their simple meal all too quickly.</p><p>“Look at that,” he said. “The sun’s come out. Just in time to disappear again.”</p><p>“I really ought to be going back to the Queen’s Ruby. If I’m not there when dinner’s called, they’ll be worried.”</p><p>He walked her outside and they stood there, side by side, watching the sun sink toward the horizon. A fiery red ball, painting the clouds with vibrant shades of pink and orange.</p><p>“It’s beautiful,” she said.</p><p>“My father used to say, Christ might be a carpenter, but the Heavenly Father is a blacksmith. He melts the sun down every night and forges it again the next morning.”</p><p>Diana smiled. “What a lovely thought.”</p><p>“No, it’s rubbish. At least that’s what I decided after he died. If a good man slumps over his anvil at the age of two-and-forty, his Creator is no kind of craftsman. I inherited his forge, not his faith.” His chest rose and fell in a thoughtful sigh. “But then, every once in a while, I see something so finely made, so exquisitely wrought”—he turned to her—“I can’t help but wonder. Maybe he was right.”</p><p>He brushed a light touch down her cheek. “Only a divine hand could make something this lovely. Christ, you’re perfect.”</p><p>She laughed a little. Partly because she was amused by his blend of reverent wonder and shameless blasphemy. And partly because it made her uncomfortable.</p><p>“I’m not perfect,” she said. “Not inside, not out.”</p><p>“You’re a terrible cook. That I’ll grant you. You can’t hold your liquor, either. And you have questionable taste in men. So no, you’re not perfect.” His voice sank to a husky whisper, and his gaze dropped to her mouth. “But you’re close. Close enough to restore a man’s faith in miracles.”</p><p>Her heart fluttered as he leaned in for a kiss.</p><p>“Dawes!” The call came from around the other side of the smithy. “Dawes, are you here?”</p><p>Diana jumped back, worried they’d been seen. And then she worried she’d offended Aaron with her swift recoil. Again.</p><p>“It’s fine,” he murmured.</p><p>She didn’t know which of her concerns he meant to allay.</p><p>For his part, he didn’t show any unease. He walked out around the smithy and greeted the man. Evidently a horse needed shoeing.</p><p>She heard Aaron speak to him. “Walk him around, and I’ll be right along. Just have to fetch something from the house for Miss Highwood.”</p><p>Diana patted her hands down her front. Gloves, cloak, reticule. She had everything she’d come with, but she followed him anyway.</p><p>“What was it you needed to give me?”</p><p>“This.”</p><p>He lashed an arm about her waist, pressing her up against the wall and claiming her mouth in a passionate kiss. No time for preliminaries today. He took what he wanted, thrusting his tongue deep and putting his hands in places that were just this side of scandalous. The light boning of her corset pressed into her torso—the one thing holding her together, while the rest of her seemed to dissolve.</p><p>“Right,” she breathed a few moments later. “I’m glad you didn’t let me leave without that.”</p><p>He trailed kisses toward her ear. His whiskered jaw scraped deliciously against her cheek. “I’m taking my work to Hastings tomorrow,” he murmured. “Invent some reason you need to go along. Shopping. Someone to visit. Anything.”</p><p>“I . . . I could do that. So long as Charlotte comes with us.”</p><p>“Good.” After one last kiss to her lips, he pulled away. “I’ll come for you at the rooming house, first light.”</p><p>He left her there, slumped breathless against the wall. Her head whirled, and God only knew where her knees had disappeared to.</p><p>She smiled weakly to herself. “I’ll be waiting.”</p><p>CHAPTER 6</p><p>“Why, Mr. Dawes,” Charlotte said. “I almost didn’t recognize you, you look so smart this morning.”</p><p>Aaron pulled a face of male modesty.</p><p>“Doesn’t he look smart, Diana?”</p><p>Diana smiled. “Mr. Dawes looks quite fine.”</p><p>“I’m on business today,” he said, tugging down the brim of his hat. “Best to look the part.”</p><p>He did look splendid, Diana had to agree. He was dressed in a rich brown topcoat that made her think of melted chocolate. His freshly starched neckcloth made a delicious contrast with his bronzed skin and dark hair.</p><p>That hair was still a touch too long, curling in dark waves at his collar. Staring at it made her wistful.</p><p>They didn’t have Mr. Keane’s curricle today—just Aaron’s own wagon. The seat was wide enough to fit three, and Diana took the middle. The morning was brisk, and he tucked a rug over their laps.</p><p>Hastings was almost two hours’ distance away, and they passed the first hour or so in near silence. Which was not to say that no communication was happening. One side of Diana’s body—the side pressed against him—had developed a manner of speaking all its own. They were having a whole conversation in subtle exchanges of heat and pressure and “accidental” brushes of arm against arm, knee against knee. Each touch electrified her. She had to ration her glances in his direction so as not to give Charlotte any idea.</p><p>The secret pleasure of their flirtation made her giddy. They weren’t even halfway to their destination, and already this was her favorite outing in years.</p><p>“Lud, you two are silent,” Charlotte finally declared. “We must talk about something.”</p><p>“I’m glad we’ve had this break in the rain,” Diana said.</p><p>“And not the weather!” Charlotte complained. “I’m exhausted of everyone discussing the weather.”</p><p>“What is it you’ll be needing in town?” Aaron asked. “Where can I drop you when we reach Hastings?”</p><p>“We must visit the draper’s first,” Charlotte answered. “That’s our main errand. We need yards and yards of white for Diana’s costume, and there wasn’t enough in the All Things shop.”</p><p>“Miss Highwood’s wearing a costume?”</p><p>Diana forgot she hadn’t told him about the theatrical. Whenever they’d been alone together, there had been too many other things to discuss. And too many kisses to share.</p><p>“Yes, that’s why we’re going to Ambervale on Thursday,” Charlotte explained. “We’re presenting a theatrical. A pantomime on the life and death of Saint Ursula. I’m playing Cordula, and Diana is playing the lead.”</p><p>“Oh, is she?” Aaron slid her an amused look. “Now that would be something to see.”</p><p>“You should come,” Charlotte said eagerly. “Everyone’s coming. Captain Thorne will be there, of course. And I just received a letter from Minerva yesterday. She and Lord Payne will be coming down from London to attend.”</p><p>“I might like to see them. What do you think, Miss Highwood?” he asked. “Would I be welcome?”</p><p>“I suppose. So long as you promise not to laugh.”</p><p>When they reached Hastings, Aaron saw them to the draper’s before taking his wagon to the mews and completing his business. Diana and Charlotte spent the next hour debating sateen versus crepe, then purchasing great spools of ribbon and gold braid to make headdresses for each of Ursula’s eleven handmaidens.</p><p>“When he’s playing Prince Meriadoc, do you think Lord Drewe will wear a codpiece?” Charlotte whispered.</p><p>“What a question! I’m sure I don’t want to notice it if he does.”</p><p>“Well, he’s going to notice you.” Charlotte draped a length of white brocade over Diana’s shoulder. “You’ll be stunning.”</p><p>Uncomfortable with that line of conversation, Diana took the fabric and folded it away. She moved on to the display cases. “I must find a new lorgnette for Mama. Hers has disappeared.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her sister clucked her tongue. “I tell you, something strange is going on at the rooming house. I think we have a thief in the Queen’s Ruby.”</p><p>“I think you just enjoy believing so.”</p><p>“I have my eye on Miss Bertram. She’s such an odd duck.”</p> <p>“Well. Mr. Evermoore must like odd ducks.”</p><p>Charlotte just laughed. “Speaking of birds, I’m going to have a look at the plumes.”</p><p>Her sister drifted away, and Diana concentrated on the display of lorgnettes. They didn’t have any that matched the style of Mama’s missing one, so she was left to choose the next best. She was just about to ask the shopgirl to bring out two for comparison when a man clad in dark chocolate brown approached her and interrupted in a deep voice.</p><p>“I beg your pardon, miss.”</p><p>Her heart skipped a beat.</p> <p>Aaron.</p><p>She turned to him, taking his cue and playing as though they were strangers. “Yes, sir?”</p><p>“Might I ask your opinion, as a lady?”</p><p>She looked him down, then up. “I should be glad to help if I can be of service.”</p><p>He drew to the side, motioning for her to follow. He paused over a case filled with beaded reticules and lace gloves and tooled ivory fans.</p><p>“I’d like to buy a gift for my sweetheart,” he said. “And I’m not sure what she’d like. I thought perhaps you might be so good as to help me choose.”</p> <p>A helpless smile tugged at her lips. He didn’t need to buy her anything, but she couldn’t deny the thought made her dizzy with joy.</p><p>Until Charlotte popped between them. “Mr. Dawes, you have a sweetheart? Who is it? Who?”</p><p>Aaron watched as Diana’s cheeks paled. She gave him a look of pure panic.</p><p>“Do tell, do tell.” Miss Charlotte bounced on her toes. “Who is your sweetheart, Mr. Dawes?”</p><p>“I . . .”</p><p>He didn’t know what to say. He didn’t want to lie, but clearly Diana hadn’t told her sister anything about the two of them. That struck him as a mite strange—his own sisters had told one another everything about their romances. But they were closer in age than the eldest and youngest Highwoods were. And more to the point, they’d never gone courting with young men from a different social class.</p><p>“Charlotte, don’t harass him so,” Diana chided. “Is your business complete, Mr. Dawes?” She was clearly anxious to change the subject.</p><p>“Yes, thank you. And your shopping?”</p> <p>“Nearly done.” She called to the shopgirl and asked her to wrap up one of the lorgnettes.</p><p>“We have some time before we need to start back,” Aaron said. “I thought perhaps the three of us could take some luncheon at—”</p><p>“But you haven’t purchased your sweetheart’s gift yet,” Charlotte said.</p><p>God, the girl was like a bulldog with a bone.</p><p>“Do tell us who it is, and we’ll help you choose. Is it Sally? Pauline? Oh! I know. Gertrude, the upstairs maid from Summerfield.”</p><p>Aaron shook his head. “None of those.”</p><p>Charlotte snapped her fingers. “One of the Willett girls. Or that miller’s daughter from the next parish. What’s her name again? Betsy?”</p><p>He shook his head.</p><p>“Do we know her?” she asked.</p><p>“I . . . I’m fairly certain you do.”</p><p>Diana gathered her purchase from the shopgirl and thumped her sister with it. “Charlotte, stop. You’re embarrassing him.”</p><p>Embarrassing her, too, Aaron would warrant.</p><p>“We’d be glad to take some luncheon,” she went on. “Thank you very much for the suggestion, Mr. Dawes.”</p><p>He was quiet over their meal of pigeon pie. He didn’t know what to make of her reluctance to tell the truth. She wasn’t ready to tell anyone, obviously. He supposed it was understandable, this soon. But would she ever be ready? That was the larger question.</p><p>Perhaps she didn’t see matters going that far.</p><p>Aaron surreptitiously touched the packet buried deep in his breast pocket—the small quantity of gold and gemstones he’d accepted in payment from the jeweler. He’d requested compensation in materials rather than coin, thinking he’d make something special with it.</p><p>Like maybe a ring.</p><p>But now he was feeling like a fool. If Diana didn’t even feel ready to tell her own sister about them, Aaron was getting too far ahead of himself.</p><p>He lifted his ale and regarded her over it. Like she did so often, she fidgeted with the slender chain always about her neck and the vial of tincture at the end of it.</p><p>Except . . .</p><p>He blinked and looked closer.</p><p>She wasn’t wearing the vial on her chain today. Instead, he saw his pendant. The quatrefoil one he’d made for her. The one she’d been hiding in pockets and under pillows for months. Until today.</p><p>It wasn’t a public confession. But it was something, that.</p><p>He drained his ale and thumped the tankard on the table. “If you don’t mind,” he announced, “I’ve an errand on our way back to Spindle Cove. Someone I promised I’d call on today.”</p><p>Charlotte perked with interest. “Is it your sweetheart?” And close on the heels of her question, “Ow!”</p><p>He was certain Diana had kicked her under the table.</p><p>“No, Miss Charlotte, it’s not my sweetheart. It’s my sister.”</p><p>CHAPTER 7</p><p>“Aaron Jacob Dawes, what are you doing?” Jemma chased him around the kitchen, flogging him with a damp rag and scolding him in shouted whispers. “I could have your hide, bringing such ladies around to my house with no notice.”</p><p>He held up his hands in innocence. “Don’t be angry. They’re fine.”</p><p>His sister peered through the doorway into the small sitting room, where Diana and Charlotte were sitting with Jemma’s three small children and a tray of tea biscuits.</p><p>“You’re lucky I baked this morning. That’s all I can say.” Jemma gave him the sharp side-eye that all the Dawes women used.</p><p>“You know why I’m here.” He plucked a set of shears from a drawer and handed it to her. “Let’s go outside and have this done.”</p><p>Aaron removed his coat and cravat, then assumed his usual seat on a stump in the back garden. The air smelled damp and green. A few early daffodils were poking through the ground.</p><p>Jemma set about clipping his hair. Several moments passed in quiet, save for the snipping of scissors. Jemma was a stubborn woman—always had been—but insatiably curious as well. He sensed a battle going on between her desire to know and her unwillingness to ask. But if he kept silent long enough, he knew which side would win.</p><p>“So,” she said finally.</p><p>He smiled at the clump of toadstools near his boot. “So.”</p><p>“What exactly are you doing with this Miss High-and-Mighty-Wood?”</p><p>“She’s not high and mighty.”</p><p>“No, no. She’s quite nice, I’m sure. And beautiful as anything. I just don’t know what she’s doing with you.”</p><p>“She’s catching a ride to and from Hastings. That’s what she’s doing.”</p><p>“Aaron. You cannot expect me to believe that. You brought her here. I’m cutting your hair.”</p><p>The violence of her snipping began to alarm him. He was afraid he’d lose the top of an ear.</p><p>He said, “Stop clucking over me like a mother hen. I’m a grown man. I’m entitled to my privacy.”</p><p>She snorted. “After all the headaches you gave my Dennis, I think I’ve earned my turn.” Her voice softened as she set the scissors aside and ran her fingers through his trimmed hair. “I just don’t want to see you hurt.”</p><p>He stood, turned, and looked down at her from his full height, as if to say, You’re worried about this getting hurt?</p><p>She brushed the clipped hair from his shoulder. “Yes, you’re big. Yes, you’re strong. Big and strong don’t add up to invincible. I remember too well what happened with that schoolteacher.”</p><p>He sighed with annoyance. “That was ages in the past. And Miss Highwood isn’t anything like that.”</p><p>Years ago, Aaron had taken a liking to a schoolteacher from a nearby village. They’d done some courting; he’d made some plans. Only to learn that she’d never been interested in a future with him. She’d just been hoping to make a certain bank clerk jealous—and she’d dropped Aaron like a hot brick the moment her ploy had worked. She was married to that clerk now. They lived in Lewes, in a house with glazed windows.</p><p>“I’ve known Miss Highwood for nearly two years, Jemma. She’s a fine person.”</p><p>“Mm-hm. Fine indeed. Too fine for you. That’s a lady what could marry into a fortune. A grand house. Fine carriage. Dozens of servants.”</p><p>“You’re not helping,” he grumbled.</p><p>“Yes, I am. The best way I know how.” Her brown eyes held his. “Let this one go, Aaron.”</p><p>He thought of that pendant hanging about Diana’s neck. The tears she’d shed at his kitchen table because she’d let his dinner escape. The sweetness of her kiss.</p><p>“I can’t let her go. We have something.”</p><p>Jemma huffed out her breath. “Well, whatever your ‘something’ is . . . I hope you’re prepared to fight for it.”</p><p>I am, he thought to himself.</p><p>She crossed her arms and peeked into the house again. “I’ll say this for her. She’s been in there counting jacks with Billy for near a quarter hour. No one would put up with that child’s games unless she were related to him, or hoping to be.”</p><p>Her grudging approval made him smile. It was what he’d come for, after all.</p><p>“Billy’s a good boy. He has a good mum.” He gave his sister a fond rub on the top of the head, just as he’d done when she was a girl. “I’ll stock up your woodpile before I go.”</p><p>An hour later, Diana thanked her kind—but notably wary—hostess for the tea and biscuits and expressed a wish to have a wander in the garden.</p><p>She rounded the side of the house, only to narrowly miss a collision—</p><p>With Aaron.</p><p>He had shorter hair. And three children clinging to him—a giggling niece attached to either leg, and Billy hanging from his neck. She’d obviously caught them in the middle of a favorite game.</p><p>Aaron froze, a helpless expression on his face.</p><p>“You . . .” Diana cleared her throat and said in a low, solemn voice, “Mr. Dawes, you have a little something.” She motioned discreetly toward her body, indicating the position of Billy’s stranglehold on his neck. “Just here.”</p><p>“Oh. Do I really?”</p><p>She nodded.</p><p>“Hm.” He shook his whole body, as if he were a dog just come out of a lake. All three children clung tight and laughed.</p><p>“Did that take care of it?” he asked.</p><p>“I’m afraid not.”</p><p>He shook again, and the children laughed harder.</p><p>“How about now?”</p><p>“Still there.”</p><p>“Well, then.” He frowned in exaggerated concentration. “Perhaps I need a good dousing in the stream.”</p><p>At that, the children squealed, released him, and ran away shrieking. Diana laughed, too.</p><p>He stood tall and straightened his clothing. “Sorry to have taken so long.”</p><p>“Not at all. Please don’t apologize.”</p><p>“Jemma’s husband is at sea for months at a time. I try to come by every so often to keep the woodpile stocked, fix the leaks and sticking doors . . .”</p><p>“Chase the children around the garden,” she finished for him.</p><p>His wide mouth tipped in a lazy, devastating smile. “That, too.”</p><p>Diana could have sworn she felt her womb shiver. What an excellent husband and father he’d make. Protective, affectionate, devoted. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And here, so far from Spindle Cove and her ambitious mother, almost anything seemed possible.</p><p>But then he looked at the sky. “We’d best be on our way home.”</p><p>On the way home, Charlotte declared herself exhausted. She made a bed for herself in the back of the wagon.</p> <p>Diana sat on the driver’s box beside Aaron. They talked of nothings for the first hour or so, while the sun sank lower in the sky.</p><p>Finally, Diana chanced a quick look over her shoulder at the wagon bed. “I think she’s asleep.”</p><p>“Thank God.” Aaron transferred the reins to one hand, then used his free arm to draw her close. He tucked her head against his shoulder. “You can rest, too, if you like.”</p><p>“And waste this precious time with you? Never.” She looked up at him. “I liked your sister very much.”</p><p>“She liked you.”</p> <p>Diana laughed a little. “No, she didn’t. She was kind and hospitable, but terribly suspicious of me.”</p><p>He shook his head in denial.</p><p>“Yes, she was. She was suspicious of me because she cares about you. And that’s why I liked her.” She reached up and touched his newly cropped hair. “I’m glad you have someone looking out for you.”</p><p>His hand stroked up and down her arm.</p><p>“I hope you weren’t offended that I didn’t tell my own sister the truth.”</p><p>His hand stopped stroking. “No, I understood it.”</p> <p>“Did you? Perhaps you can explain it to me, then.”</p><p>She felt him shrug. “No reason to have your family in a lather until you’re sure about a thing.”</p><p>“I suppose you’re right.”</p><p>“There’s no rush. We’re just getting to know one another.”</p><p>Were they, really? Diana was so confused. This was more than a casual acquaintance. She was coming to care for him. In truth, she’d begun to care for him some time ago, but every hour they spent together strengthened the attraction.</p><p>He wasn’t just a well-built body, a handsome face, and a talented kisser. He was a good man, and he deserved to be with someone who could love him unreservedly. He was offering her patience, but she knew she owed it to him to make up her mind. Either accept him for the man he was, or let him find someone else.</p><p>It was as though he heard her thoughts.</p><p>He glanced at her. “I won’t think less of you.”</p> <p>“I’d think less of me.”</p><p>He put space between them, and his voice grew stern. “Don’t do this to prove something about yourself, Diana. Not to me, or to your mother, or to anyone. There’s no shame in honesty. And there’s no romance in glossing over the realities. We could both cite several reasons to let this go.”</p><p>“You mean realities such as . . . you need a wife who can cook?”</p><p>“Or that you need a husband who can move in society.”</p><p>“Your sister might never accept me,” she said.</p><p>He nodded and said, in a perfectly serious tone, “Your mother might implode.”</p><p>She laughed, then laid her head on his shoulder. “Honestly, it’s Charlotte. The effect on Charlotte is my greatest concern.”</p><p>“And that’s not something to be brushed aside. If my own sister’s future were at risk, I’d be thinking long and hard about it, too.”</p><p>As they crested another of Sussex’s rolling hills, she wondered if she’d ever meet another man who made her feel so free to be honest. And she had the awful, sinking feeling that with all their honesty, they’d just talked themselves out of a future together.</p><p>“Aaron, I know it’s unrealistic to say the differences won’t matter. To say ‘Love conquers all.’ But if you—”</p><p>He shushed her.</p><p>Oh, drat. She’d used the word love. She’d broken the cardinal rule of female subtleties, as her mother described them. She’d spoken That Word aloud, and he wasn’t ready for it.</p><p>And now it truly was over.</p><p>CHAPTER 8</p><p>Aaron had never been more reluctant to interrupt a lady, but in this instance, he had no choice.</p><p>He slowed the horses to a walk and explained, “There’s someone in the road ahead. Stay calm, and let me do the talking.”</p><p>To the side of the road, a donkey cart appeared to have lost its wheel. The driver of the cart stood in the center of the lane, wearing a patched coat and waving his hat in a plea for assistance.</p><p>“Does he need help?” Diana whispered.</p><p>“He might be looking for help.” Or he might be looking for trouble.</p><p>Aaron stopped a fair distance from the cart. He reached under the driver’s box and retrieved the pistol he kept there. He’d loaded the weapon before setting off from Hastings, and now he was glad of it. This man looked honest enough at a glance—but it never hurt to be cautious.</p><p>Patched Coat jammed his hat back on his head and approached their wagon. “Good afternoon, sir. My cartwheel’s gone off its axle, and I can’t repair it on my own. As you can see, the missus is in a delicate state.”</p><p>He nodded toward the cart, and behind it Aaron could make out the shadowy form of a woman great with child.</p><p>“Can I ask for a moment’s assistance, sir? With the two of us, we should have it mended in a trice.”</p><p>Aaron hesitated. There was a canny glint in the man’s eyes and an oily quality in his smile. He didn’t like this.</p><p>But Diana dug her elbow into his ribs. “She’s pregnant. Night will fall before long. We have to help them.”</p><p>That settled matters. Aaron was obligated now. He couldn’t look like a callous, unsympathetic monster in front of the woman who had, just two minutes ago, danced on the verge of professing to love him.</p><p>“I’ll be right there,” he told the man, and he directed the horses as they pulled the wagon aside.</p><p>“You stay here,” he told Diana in a firm, low voice. He put the pistol in her lap and the reins in her hands. “Chances are, I’ll be back in two minutes. But if anything untoward happens, you drive away. If I call to you to drive, you drive away. Do you understand? If there’s trouble, I can handle myself. But I can’t handle myself and protect you and Charlotte.”</p><p>She nodded. “I understand.”</p><p>Aaron jumped down from the wagon, and his boots landed in the mud with a squelch. He rued wearing his finest coat now, having stupidly donned it just to impress Diana. The later the hour, the greater the dangers of highway travel grew. Any appearance of riches could put her at risk.</p><p>“I do appreciate your help,” Patched Coat said, walking him over to the disabled cart. “This will take no time at all. Big fellow like you? You can lift, and I’ll replace the wheel.”</p><p>Aaron ducked and took a quick peek under the cart. Though the wheel was off the axle, he saw nothing broken or damaged. In fact, the dried mud on the wheel rims suggested this cart hadn’t moved in several hours.</p><p>“You’ll want to remove your coat,” the man said. “My missus would be glad to hold it for you.”</p><p>Of course she would. And she’d be glad to strip the contents from every pocket while she was at it.</p><p>Aaron saw exactly what was happening now. This couple had probably been sitting by the road all afternoon, taking that cartwheel off and then flagging down passersby for assistance in “repairing” it. While the unsuspecting travelers performed a good deed, the “missus” would relieve them of their coin.</p><p>At least these were petty swindlers, not violent highwaymen. Aaron could get out of this easily enough.</p><p>He played along to a point, dutifully lifting the cart so that Patched Coat could fit the wheel back on the axle. Just as he’d probably done four times already today.</p><p>Aaron tipped his hat to Mrs. Patched Coat—whose pregnant belly looked a great deal lumpier than any he’d ever seen—and took his leave. “Best of luck to you both.”</p><p>Find some other unsuspecting fool to gull.</p><p>Damn it, the bastard followed him. “Say, I wonder if you could spare a blanket or—”</p><p>Aaron stopped in his paces and wheeled on him. “Not another step.”</p><p>“Why, I didn’t mean any—”</p><p>Aaron lowered his voice to a threat and loomed over the man. “You will not come one step nearer my wagon. I’ve helped you with your cart. If you know what’s good for you, turn around and walk back.”</p><p>“Aaron?” Diana called from the wagon. “Is everything all right?”</p><p>He lifted his eyebrows at Patched Coat. You tell me. Are you going to be sensible and turn around, slink back to your donkey cart? Or is this going to get ugly?</p><p>It got ugly. The man pulled a knife.</p><p>Aaron took a quick step back, putting himself out of reach.</p><p>“That’s a fine lady you have there,” the man said, gesturing with the gleaming point of his blade. “I’d imagine you work to keep her happy. Surely there’s something in your wagon my missus would enjoy.”</p><p>Without turning his gaze, Aaron lifted his voice. “Diana, drive on. Now.”</p><p>“I can’t,” she replied. “I’m not going to leave you here.”</p><p>“Drive. Now.”</p><p>When several seconds passed and Diana failed to obey his command, a smile spread across Patched Coat’s face. He swiveled the blade back and forth, taunting. “I think she likes me.”</p><p>Aaron swung on instinct, wanting to knock that smile straight off the bastard’s face and grind his nose into the gravel. His punch connected—but so did Patched Coat’s blade, slashing through the wool of Aaron’s coat sleeve.</p><p>They reeled apart from each other and prepared to clash again.</p><p>On some level, Aaron registered the fact that he’d been cut. But his mind took the pain and stashed it away for later. He could weather far worse—and he would. He was the human equivalent of an oak tree. If this bastard wanted to bring him down with that puny blade, he’d have to hack at Aaron all night long.</p><p>“Diana,” he said, keeping his eyes on that glittering, twisting blade. “For the last time, go.”</p><p>Patched Coat began to chuckle. “See now, my missus always listens to me.” He lifted his voice and called to his wife. “Search the wagon while I hold him here.”</p><p>A sound stopped them all cold.</p><p>The click of a pistol being cocked.</p><p>“I don’t think so.” Diana’s voice, as cool and calm as he’d ever heard it. “Step away from him,” she told Patched Coat. “Or I will shoot.”</p><p>Aaron cringed. Damn it all. Why had she refused to drive away? This couldn’t end well. If she lost her nerve, she could lose her life. And if she did shoot . . . He knew Diana. Taking a life would weigh heavy on her, even if the act was justified.</p><p>“Step away from him now,” she repeated, “or I will shoot.”</p><p>She didn’t give a third warning.</p><p>Bang.</p><p>As the smoke cleared, Patched Coat let out a howl of pain, clutching his right hand in his left. The hand didn’t appear to be bleeding, but the knife was gone.</p><p>Good Lord. Aaron realized what had happened. She’d shot the thing clean out of his hand. And the force of the weapon ripping free must have hurt—perhaps broken some of his fingers or his wrist.</p><p>Good.</p><p>“Jesus,” the man whimpered, doubling over and nursing his wounded hand. “That sodding bitch.”</p><p>Aaron had spent a lifetime staring into red-hot flames. And in that moment, he saw shades of red he’d never dreamed existed. He whipped a back-handed blow across the man’s face. Then he grabbed that patched overcoat by the lapels and held the despicable knave close.</p><p>“I will rip out your tongue,” he growled, “and feed it back to you.”</p><p>He drove his knee into the blackguard’s gut.</p><p>He wanted to follow with a crushing punch to the jaw. Then a kick to the ribs. He could have pummeled the bastard into the mud and left him for the carrion birds. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But Diana’s voice called to him, dragging him back from the edge of further violence. “Aaron, please. Please, you’re bleeding. Let’s just go.”</p><p>Diana knew she’d look back on this half hour and wonder how she’d held herself together. But what mattered now was that she did. Her body and emotions went numb. Some stronger force in her had taken over the moment she’d raised that pistol. All those years of staying calm paid their dividends today. She didn’t fret, didn’t cry. Her breathing never faltered. She simply did what needed to be done.</p><p>She drove the horses a few miles down the road, until they reached a safe place to draw the wagon aside. If she waited any longer, they’d lose all daylight.</p> <p>She helped Aaron out of his coat and ripped his sleeve apart to expose his wound. Unable to see it well, she took water from their drinking supply and washed the blood away.</p><p>A narrow, clean cut, some two inches long. Unless it festered, it wasn’t a life-threatening wound—the wool of his coat had served as weak armor—but it was significantly more than a scratch.</p><p>“It will need to be stitched,” she said dispassionately.</p><p>She washed it again, making sure no fibers from his shirt and coat were caught in the wound. Then she rummaged through the goods they’d purchased at the draper’s until she found a needle and strong thread.</p><p>She was halfway through her third stitch when she thought she felt a drop of rain land on her head. Looking up, she realized it wasn’t rain at all but a drop of Aaron’s sweat. The poor man. He was shaking, slick with cold perspiration. And here she hadn’t offered him anything to help with the pain—not even a scrap of leather to bite down on.</p> <p>“Go on,” he said through gritted teeth. “Finish it.”</p><p>After three more stitches, she was able to tie the knot off with her teeth. She wrapped a length of white, gauzy fabric about his arm.</p><p>“It’s a fortunate thing we came from the draper’s today and not the millinery,” she said dryly.</p><p>He stared down at the makeshift bandage. “I’m sorry. This was meant for your costume.”</p><p>“Never mind the silly play. There’s plenty of surplus, anyhow. I’m just glad I chose to buy needle and thread today, too.”</p><p>Now that the bandaging was finished, he mopped his face and composed himself. Then asked the question she’d been dreading.</p> <p>“Why’d you do that? I told you to drive. You were supposed to drive away. Like you promised me.”</p><p>“I know. But . . .”</p><p>“But what?” Oh, he was angry now. His voice shook with emotion, and his hands clenched in iron grips. “You put your life at risk, and Charlotte’s, too.”</p><p>“Aaron, I just couldn’t leave you. It was all my fault you stopped to help them. I couldn’t simply drive away.”</p><p>“It’s a damned lucky thing you’re such a good shot. That was a risky trick, aiming for that knife. If you’d missed . . .”</p><p>“I did miss.” And now the emotion came. Her eyes teared up, and she began to tremble. “I did miss, curse you. My hand was unsteady, and I wasn’t braced for the recoil. I wasn’t aiming for the stupid knife. I was aiming for him.”</p><p>He touched her face. “Oh, love.”</p><p>She made an impatient swipe at her eyes. “And just think—the other day I was debating whether I could kill an eel to keep you. Tonight, when I saw that man lunge with his knife? There was no hesitation. I would have done anything, Aaron. Anything but leave you there alone.”</p> <p>He was silent for a moment. Then he seized her by the arms. His grip was tight, and his voice was all rough edges.</p><p>“I need to know,” he said. “I need to know, right now, if you’re mine. I’ve been patient for years, and if need be, I can wait years more. I’ll do anything in my power to win you, to keep you. But I need to know, this moment, if you’ll be mine in the end.” His hands moved to bracket her face, uncomfortably tight. His gaze burned into hers. “Tell me.”</p><p>With every wild beat, her heart thumped against his pendant.</p><p>If she was looking for answers, she didn’t need to search any further than that.</p><p>“Yes,” she breathed. “Y—”</p><p>Before she could say it twice, his lips were on hers.</p><p>And then his hands were everywhere. He thrust them under her cloak, making contact with her shivering body. He cupped her breasts through her frock, slid his hands downward to explore her hips and thighs. The bold possession of his touch stirred her blood. There was nothing of finesse or seduction in his touch. Only claiming. Raw, primal need.</p><p>As he ran his tongue along her neck and caught her earlobe in his teeth, he swept one hand down her leg and tossed up the edge of her skirts.</p><p>She was visited again by that dizzy, arousing thought from the time before she knew anything of him. From before any of this was possible.</p><p>His wrist is as big as my ankle.</p><p>Indeed, his fingers encircled her stockinged ankle easily, and she could visualize the corded tendons of his forearm flexing as he stroked higher, higher. Up to her knee, and higher still.</p><p>Between her legs, her pulse beat as a sweet, hollow ache.</p><p>“Diana,” he groaned. “I want to be in you. Deep in the heart of you.”</p><p>This was madness. It could not happen. Not here, not now. But she wanted it, too, and the all-consuming nature of her desire was a revelation. What a joy to want. To want so fiercely, with all her being, without moderation or reserve.</p><p>She was new to this, and the sort of coarse, thrilling words he whispered did not come easily to her lips.</p><p>“Yes.” At least she could manage that much. “Yes, yes.”</p><p>He slid his hand higher, over her garter and up. His touch was a brand against her bare, shivering thigh.</p><p>She clutched his neck, urging him further. “Yes.”</p><p>Until Charlotte moaned and stirred in the wagon bed, and they jolted apart.</p><p>Her whole body mourned the loss. Her nipples, tight and achy, strained toward him.</p><p>“I’d forgotten her.” She clapped a hand to her brow.</p><p>Aaron chuckled between ragged breaths. “I can’t believe she slept through everything.”</p><p>“She’s always been that way. Slept like a stone, ever since she was a baby. I’ll be hard-pressed to make her believe any of this tomorrow.”</p><p>“Then don’t try. I think you’d do better to keep it between us.”</p><p>“But Aaron . . .”</p><p>She didn’t want to tell Charlotte about the swindler or the fight, but they wouldn’t be able to hide their relationship much longer.</p><p>“Wait until Thursday,” he said. “I want to talk with Lord Payne before we make any plans. I’ve had my differences with the man, and I didn’t care for the way he behaved when he eloped with your sister . . . but I’m determined to do better myself. He’s your brother-in-law and the man of the family. I don’t need his permission, but I want to speak with him about this—about us—and hear what he has to say. All right?”</p><p>She nodded. “All right.”</p><p>He pressed his brow to hers and caressed her lips with a tender kiss. “There’s my girl.”</p><p>As they kissed, her muzzy thoughts swarmed in two opposite directions, one sublime and one utterly mundane.</p><p>The sublime: She was his girl. His girl. His girl.</p><p>The mundane: Now she really had to practice that ridiculous play.</p><p>CHAPTER 9</p><p>“Ursula was simply too missish to live.” The next day, in the parlor of the Queen’s Ruby, Charlotte flipped through the booklet and made a face. “It’s a miracle no one beheaded her earlier.”</p><p>“According to the vicar,” Diana replied, “even the Church now believes her story is a myth. But I still think we should show some respect.”</p><p>“Show respect for my nerves,” Mama interjected. “Charlotte, pass me the vinaigrette.”</p><p>“I can’t, Mama. It’s missing.” Charlotte arched a brow at Diana, then slid a glance toward Miss Bertram. “I told you there’s a pattern,” she whispered.</p><p>“Missing? Nonsense. It must be here somewhere.” Mama rose and began to poke about the room.</p><p>“The play,” Diana said. “You’re supposed to be helping me learn my lines.”</p><p>Now that Aaron would be in attendance, she actually wanted to do well. Of course, Mama had completely misinterpreted her intentions.</p><p>“I’m so glad you’re finally making an effort, Diana. Lord Drewe cannot fail to be impressed.”</p><p>Diana bit back an objection. These few remaining days before Thursday would be her mother’s final days to believe she had an obedient, well-intentioned daughter with excellent prospects. She wasn’t looking forward to the aftermath, when Mama learned the truth.</p><p>Diana opened her booklet to the first page. “Oh, wreck and WOE. My father hath betrothed me to the son of a pagan king. I would sooner DIE than be so defiled.”</p><p>Charlotte didn’t read her part. “I’m finding it hard to sympathize with my role as Cordula,” she complained. “If I were friends with this Ursula, I would have shaken some sense into her. I mean, really. So her parents betrothed her to a pagan prince, and she doesn’t want to marry him. But instead of just saying she doesn’t wish to marry him, she asks for a delay and sets sail with eleven thousand of her closest virgin friends, floating about on the ocean for three years.”</p><p>Diana shrugged. “It sounds rather like a seafaring version of Spindle Cove. Perhaps they amused themselves with theatricals.”</p><p>“They didn’t study celestial navigation, I know that much. Because after three years of drifting, she lands a scant hundred miles away on the shores of France.”</p><p>Miss Bertram spoke up. “Mr. Evermoore and I have dreamed of taking the Grand Tour. Now that the war’s over.”</p><p>“Oh, of course you have.” Charlotte rolled her eyes.</p><p>“Go on with Saint Ursula,” Diana prompted, anxious for Miss Bertram’s feelings.</p><p>“This is the best part. Where her army of virgins . . .” Charlotte giggled. “I mean, really. Can you imagine eleven thousand virgins, swarming en masse over the fields of Gaul? They must have been like a plague of locusts, stripping the fields bare and sucking the rivers dry as they went.”</p><p>“I suppose that’s why it’s a myth.”</p><p>“Right. So the Mythical Virgin Swarm makes it as far as Cologne before running straight into a wall of marauding Huns. Naturally, Ursula refuses to see them as husband material. But does she put up any fight? No. Just . . .”</p><p>Charlotte drew her finger across her neck and made a grisly slicing sound. “Too missish to live. If she did truly live at all—which history, the Church, and common sense seem to suggest she didn’t.”</p><p>“That doesn’t mean we can’t learn from her,” Diana said.</p><p>Exhausted by her fruitless search for the vinaigrette, Mama sank into the nearest chair and snapped open her fan. “You’re right, Diana. The moral of the play is clear. Ursula should have married as her parents wished. I’m sure they had good reasons for choosing Meriadoc. He was a prince, and probably quite wealthy.”</p><p>“No, no. ” Charlotte strangled the air in a gesture of frustration. “That’s not the moral at all. What Ursula ought to have done was stand up for herself. If she’d had one good foot-stamping row with her parents and said, ‘I’m not going to marry your filthy heathen prince, so there,’ she would have saved herself—and her eleven thousand friends—a great deal of trouble.”</p><p>She fixed Diana with a pointed gaze.</p><p>Diana wasn’t sure what her sister was getting at. But it made her uncomfortable. Had Charlotte somehow guessed at her relationship with Aaron?</p><p>“You are right, Miss Charlotte.” Miss Bertram shot to her feet. “I’m going to write to my parents this instant and tell them I cannot be parted from Mr. Evermoore. No matter how they disapprove.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As Miss Bertram stormed from the room, Charlotte grumbled, “At least someone is convinced.”</p><p>“Can we just rehearse?” Diana asked.</p><p>“Yes, indeed!” Mama said. “Diana must learn her lines by heart. You can be assured that Lord Drewe will know his. How many scenes do you have with him, Diana? Is there a kiss?”</p> <p>Diana threw down the booklet in exasperation. “Ursula dies a virgin, Mother. It’s the whole point of the play. There is no marriage. No kiss.”</p><p>What would Mama say if she knew Diana had kissed Aaron three times now?</p><p>Charlotte was right. Diana wanted to respect Aaron’s wishes about speaking with her brother-in-law first, but that didn’t mean she had to keep up this farce regarding Lord Drewe.</p><p>“Mama, I am not going to marry Lord Drewe. He hasn’t asked. He isn’t likely to ask. And even if he did ask, I would refuse him.”</p><p>Charlotte pumped her fists in a silent cheer.</p> <p>Her mother pressed a hand to her heart. She blinked rapidly. Diana began to wonder if she should have saved this speech until after they’d located the missing vinaigrette.</p><p>When at last Mama spoke, it was quietly. “I am so proud of you, Diana.”</p><p>“You . . . you are?”</p><p>“Yes. I am proud of you, my dear. And I have felt the same in my own heart, but been reluctant to say it. As long as you’ve waited to marry, there should be no compromise.”</p><p>Diana was stunned speechless. If she’d known it would be this easy, she would have initiated this discussion years ago.</p><p>“You are right,” Mama went on. “You cannot marry the Marquess of Drewe. We must hold out for a duke.”</p> <p>Oh, Lord.</p><p>Across from her, Charlotte made the throat-slicing slash and collapsed on the divan.</p><p>Since the sky’s war on Spindle Cove seemed to be in a temporary cease-fire, Aaron found himself inordinately busy at the forge. Farmers were making use of the break in the rain to shoe their horses and get their hoes, harrows, and plowshares in working order.</p><p>Of course, this flurry of business would happen on precisely the few days Aaron wished to have the smithy to himself. He was finding it difficult to steal daylight to work on Diana’s ring. Instead, he worked at the mold by night, lighting unprecedented numbers of candles at his kitchen table.</p><p>At last he was finished, and he managed to scrape up an hour to cast the thing. He heated the gold in a crucible and poured it into the mold. When it cooled, he held it up for inspection.</p><p>Not bad. But not good enough. He’d tweak the mold and melt it down again.</p><p>As he lowered the ring, he caught a flash of golden-blond hair headed straight up his lane. At any other time, he would have been thrilled to see her, but now?</p><p>Devil. Blast. Shite.</p> <p>Hastily, he shoved the unfinished ring and all accompanying evidence aside, tossing a rag over the lot of it just as she entered the forge.</p><p>And after all that effort—the golden-blond hair didn’t belong to Diana at all.</p><p>“Miss Charlotte,” he said, wiping the sweat from his brow. “This is a surprise. What can I do for you?”</p><p>She made herself at home, settling on a stool. “We’ve had a mysterious rash of thefts at the Queen’s Ruby. Diana’s thimble. Mrs. Nichols’s ink bottle. Mama’s lorgnette, my vinaigrette, and sundry loose coins.”</p><p>“That wouldn’t seem to add up to much.”</p><p>“It adds up to a pattern,” she said. “A mystery. I’ve appointed myself investigator, and I’m making interviews. Do you mind if I ask you a few questions?”</p><p>“Not at all.”</p><p>She took out a notebook and pencil. “Now, then. Mr. Dawes, do you have any idea who might have taken the missing objects?”</p><p>“I can’t say that I do, Miss Charlotte.”</p><p>“Has anyone brought any suspicious items to the forge?”</p><p>“No.”</p><p>“Very good. Just one last question.” She lowered her notebook. “Do you mean to marry my sister?”</p><p>Aaron looked up at her, startled. “What does that have to do with missing trinkets?”</p><p>“Nothing.” Miss Charlotte shrugged. “I’m just proving my powers of deduction, that’s all. I may not know who’s been filching things around the rooming house—yet—but I know there’s something between you and Diana.”</p><p>“Did she tell you?”</p><p>“No.”</p><p>“Then when . . . ?” God. He hoped she hadn’t witnessed them on the way home from Hastings.</p><p>“I’ve known for more than a year! After I missed the signs when Minerva eloped, I made a commitment to observation. I’ve long known she fancied you.” Her head tilted. “If you do mean to propose, you will have to confront my mother.”</p><p>“I . . .” Aaron didn’t know how to refute the idea. So he didn’t. “I know I will.”</p><p>“Do you have a plan of attack?”</p><p>“Attack?”</p><p>Charlotte’s bow-shaped mouth quirked. “This is my mother you’re dealing with. She’s a dragon. Arm yourself. Gird your loins. Gather your courage and your best steel. And yes, formulate a plan of attack.”</p><p>Aaron just shook his head. He knew the matron would be surprised and displeased, to say the least, but he didn’t want to see Mrs. Highwood as an enemy. He was usually good with mothers and sisters.</p><p>Miss Charlotte brought out a fan from her reticule, snapped it open, and began to work it vigorously. “Here. Let’s play a scene.”</p><p>“I know you ladies enjoy your theatricals, but I don’t count acting among my talents.”</p><p>“But you don’t have to act. You’re you. And I’m my mother.” She adopted a high, screeching tone. “My Diana, marry a blacksmith? Of all the horrid, unthinkable notions. She will marry a lord. If not a duke! She is the beauty of the family, as everyone knows.”</p><p>Aaron sighed under his breath. He tried to exercise patience with the matriarch of the Highwood family, knowing most of her excesses were born out of a desire for her daughters’ well-being. But he heartily disliked the way she compared the Highwood sisters against each other.</p><p>“Miss Charlotte, you are a very pretty girl. Well on the way to becoming a beauty in your own right.”</p><p>She made a face. “I wasn’t fishing for compliments. I’m pretty enough, but Diana is the beauty of the family. Just like Minerva’s the brains of the family.”</p><p>“And what are you?”</p><p>She smiled proudly. “The spirit, of course. Now come along.” She fluttered the fan. “Argue back.”</p><p>Aaron wiped his hands on a rag and sat down across from her. “Here’s the thing of it, Miss Charlotte. If your sister married me, it would affect your whole family.”</p><p>“Naturally. Diana will live here, and Min and I should always have a reason to visit Spindle Cove. That will make all three of us happy.”</p><p>“You know that’s not what I mean. Your own prospects. You’re going to have your season in London soon. And I suspect you want that excitement, even if it didn’t suit your sisters. If Miss Diana marries this far beneath her station”—he quelled Charlotte’s objection with a hand gesture—“there’s bound to be gossip. Fewer invitations, fewer suitors . . .”</p><p>He could tell his words were sinking in. She shifted uncomfortably on her stool.</p><p>“Listen, Mr. Dawes. I don’t think you’ve understood. I’m meant to be my mother in this scene we’re playing, and you’re stealing all her lines.”</p><p>He chuckled. “Let’s just say I’ve realized something. If there’s a member of the Highwood family I must approach for permission, it’s not your mother. It’s you.”</p><p>She sat tall. “Well. Don’t I feel important.”</p><p>“You are important. I know Diana wouldn’t like to see you hurt.”</p><p>“I don’t like to see Diana hurt, either, Mr. Dawes. And yet I’ve watched her hurting ever since I could remember. I’ve held her hand through horrid, endless minutes when she struggled to simply breathe. While I would run and climb and play, she was always kept indoors. I was young then, but I’ve grown up now. I won’t have her penned up for another two years just so I can dance and make merry in Town.” Her gaze lifted to his. “I want, very much, to see my sister happy. If it’s my blessing you need, you have it.”</p><p>He nodded slowly. “Very well, then. But you may regret this when the London bucks come chasing after you and your brother-in-law threatens them with a red-hot poker.”</p><p>She laughed. “You wouldn’t.”</p><p>“I would. Ask my own sisters.” He rubbed his face. “But I’m getting ahead of myself. I haven’t properly proposed.”</p><p>Charlotte hopped down from the stool and reached for her cloak. “That’s one answer you needn’t worry about.”</p><p>CHAPTER 10</p><p>On Thursday, Aaron took his time getting ready.</p><p>After a thorough dousing at the pump, he shaved as close as he could manage. Tonight had to be perfect. He thought of the women making ready at the Queen’s Ruby. All the ladies flitting and hurrying about in their underthings, trading ribbons and hairpins.</p><p>Diana, rolling a pale silk stocking up her leg.</p><p>That mental picture earned him a nick beneath his jaw. He examined the red line in the tiny looking glass and swore. So much for perfect.</p><p>He donned a new starched shirt, holding the collar as wide as possible so as not to spot the thing with blood. As he wrestled with his cuffs, he tried not to remind himself that a proper gentleman would have a valet to help him with these things. Last came his cleaned and mended brown coat—still the best he had, even after the roadside brawl.</p><p>Good thing he didn’t possess a full-length mirror, or it surely would have reflected a picture of discouragement.</p><p>What sort of miracle was he trying to work, anyhow? She knew him. It wasn’t as though he could fool her into thinking he was something loftier than a village blacksmith.</p><p>He started out the door and was halfway through saddling his horse when he stopped short.</p><p>In his agitation, he’d nearly forgotten the ring. Of all the things to forget. It was the one item he had to recommend him, after all.</p><p>He opened the small lockbox in his bedchamber and pulled it out, letting it glitter on the palm of his hand. He’d used gold—it suited her golden hair, and it was the finest. The band was adorned with leaves, with a small center ruby set amid diamond petals. Even if she wouldn’t marry him, he wanted her to have this. It was the best of him, and the best he knew how to offer.</p><p>His guts were in knots. This was absurd.</p><p>He was who he was. She would have him, or she wouldn’t. After tonight, he’d know.</p><p>“Mr. Dawes!” The voice came from the smithy. “Mr. Dawes!”</p><p>Aaron slipped the ring in his breast pocket before walking out and around to the front. He found Cora Maidstone, the daughter of one of the local farmers. From the state of her flushed cheeks and muddied hem, he surmised she’d run all the way here.</p><p>“What is it?” he asked.</p><p>“It’s my father,” she said, breathless. “Our mare’s been tetchy lately, and she rolled him. Broke his leg. Bad.”</p><p>Aaron passed a hand over his face. The Maidstone family, like so many of the farming families, lived year to year. This was planting season, and his sons weren’t old enough yet to take on the plowing. If that leg didn’t heal properly—or didn’t heal at all—the whole family could starve.</p><p>“Please,” she said. “He’s hurting something fierce.”</p><p>“Of course. Give me a moment.”</p><p>He strode back into his cottage, shrugged out of his coat, and slung it on a hook. He gathered an apron and the kit of laudanum, bandages, and such that Lady Rycliff had given him to keep on hand for bonesettings. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Last, he put that gold and ruby ring back into the lockbox and shut it tight. There’d be no theatricals or parties for him today. He had work to do, and there was no way around it.</p><p>He was who he was.</p><p>As for whether Diana would have him—he could only pray she’d give him another chance to ask.</p> <p>Several fatiguing, bloody hours later, Aaron rode through the village on his way back. It was out of his way, but something wouldn’t let him go home until he passed by the cheerful façade of the Queen’s Ruby, with its begonia-stuffed window boxes and green shutters.</p><p>He stared up at the window he knew to be hers. Dark, like all the others. Ambervale was a few hours’ distance, and it would likely be almost dawn before the ladies returned home. Aaron hated to imagine what Diana would think of him, promising to attend and then failing to appear. He should have thought to send word at least, but there hadn’t been time.</p><p>Well, there was nothing for it but to apologize tomorrow.</p><p>He nudged his horse and turned down the lane that led home. As he neared the cottage, he saw a weak light burning from within. Strange. In his hurry, he must have neglected to extinguish his lamp before leaving.</p><p>He took his time putting up the horse, making sure the mare had water, feed, and a good brushing down. Then Aaron had a glance at himself and grimaced. The fresh new shirt he’d worn for the occasion was spattered with blood. He gave a grim chuckle, thinking of how he’d been so careful not to mar it with the smallest drop from his shaving accident.</p> <p>Right there by the pump, he yanked the shirt loose of his waistband, pulled it over his head, and cast it into a bucket of water to soak. No use bringing the thing inside. Then he doused his own head, torso, and hands, washing away all the evidence of that evening’s miserable, bloody work. Finally, he stood erect, pushed the water from his face and hair, and went into the cottage.</p><p>She was there. Sitting at his table, head rested on her stacked arms.</p><p>“Diana?”</p><p>She woke with a start, her eyes wide and unfocused until they settled on him. “Aaron. You’re here.”</p><p>“I’m here. And you’re here. What about Ambervale?”</p><p>“I told everyone I had a miserable headache and begged Miss Bertram to read my part. I didn’t go.”</p> <p>“Why not?”</p><p>“We heard from one of the inn’s girls about Mr. Maidstone’s accident. And I knew you’d be called to help. How is he?”</p><p>Aaron sighed and rubbed his jaw. “He’ll live. His leg’s set as best I could manage. It was a bad break, and it will take months to heal. But if he gives it time, it should heal cleanly.”</p><p>“That’s a relief.”</p><p>“Seeing your face is a relief. I worried what you’d think when I didn’t come.”</p><p>“I wanted to come help you, but I decided I’d only be in the way. But I knew you’d be famished once it was over. And perhaps needing some company, too.” She averted her gaze, and her eyelashes fluttered.</p><p>It suddenly occurred to him that he was standing before her shirtless. And that she’d noticed. Her wide-eyed, sleepy gaze wandered over every damp contour of his arms and chest. But she sat between him and the bedchamber, where all his other clothing hung. Improper as it was for her to see him half dressed, he couldn’t clothe himself without drawing imprudently near . . . so he simply did nothing at all.</p><p>Well, he did clear his throat.</p> <p>Her gaze snapped up to his face.</p><p>She pushed to her feet. “I brought over some dinner.” As she indicated the covered dishes on the table, her mouth pulled to the side in a self-deprecating smile. “Don’t worry, I didn’t cook it myself. It’s just odds and ends from the Queen’s Ruby kitchen.”</p><p>He didn’t know what to say—the fact that she’d known, that she’d given up the evening’s amusement to be with him. Her thoughtfulness wasn’t any sort of surprise, but still . . . His heart insisted it meant so much more.</p><p>And she was so damned beautiful. Whatever gown or costume she’d been meant to wear for the theatrical, it had been hung away again. She wore one of her simplest, everyday frocks. But her hair was still put up in careful coils and ringlets, like an artifact of the revelry she’d forfeited tonight.</p><p>He drew close and caught a lock of that lovely golden hair, wrapping it around his finger. “I’m sorry you missed the outing.”</p><p>“I’m not sorry.” She swallowed hard. “I mean, it couldn’t be helped.”</p><p>“Of course it could. You needn’t have stayed home. I know you were looking forward to seeing your sister and your friends.”</p><p>“I was mostly looking forward to you.”</p><p>He skimmed a touch down her cheek, overwhelmed—and at a loss to imagine what he’d ever done to deserve those words. To deserve this woman.</p><p>“Are you hungry?” she asked.</p><p>He nodded. “Yes.”</p><p>“Well, then. Perhaps I should get some plates and—“</p><p>He pulled her into a kiss.</p><p>He was hungry, yes. Hungry for her. His soul was starved for just this.</p><p>He’d been returning to this house, to this very room, every night of his life. But this was the first time in a long time it felt like truly coming home.</p><p>She was soft and welcoming. She smelled so damned good.</p><p>He cinched an arm tight about her slender waist, trapping her arms against his bare chest. Her fingertips explored, stroked, caressed. And then slowly slid upward, until she wreathed her arms about his neck and held him tight.</p><p>They kissed and touched. He put a hand to her breast, kneading and shaping. She sighed, arching into his caress. Begging for more. He pulled her up against him, insinuating one thigh between her legs. She rewarded him with a husky moan and a deep, demanding kiss.</p><p>It was night. They were alone, and no one was going to interrupt them. In the other room, a bed beckoned. He was already half undressed. It didn’t take a fortune-teller to see where this was going.</p><p>He murmured, “If you don’t want this . . .”</p><p>He couldn’t even complete the sentence. Want this, he silently pleaded. Want this—want me, want this life we could share—as much as I want you.</p><p>“I want this,” she whispered. Her hips rolled against the firm slope of his thigh, sending streaks of raw lust through him. “Aaron, I . . . I want it so much.”</p><p>“I had a question I meant to ask you tonight.”</p><p>“I know.” Her blue eyes tipped up, meeting his gaze directly. “I came here to say yes.”</p><p>He didn’t even make a reply.</p><p>Because there was nothing left to say. If she wanted him, he was hers. Tonight, tomorrow, always.</p><p>He swept her off her feet and into his arms. Her little shriek of laughter delighted him. He’d been wanting to do that since the first.</p><p>As he laid her down, he wished he had a better bed. A plusher mattress on a hardwood frame. Softer linens and quilts. But none of these misgivings were enough to dampen his lust. Not in the least. As he slid a hand under her skirts, his cock felt like a rod of steel in his trousers. He hadn’t known this pitch of erotic desperation since he was a youth of sixteen.</p><p>Nevertheless, he resolved to take things slowly. He knew her pleasure must come first, or it wasn’t likely to happen at all.</p><p>As he fumbled with the hooks down the back of her frock, nerves swarmed him like agitated bees. He hoped to God he could make this good for her. He’d never bedded a virgin. Hell, he hadn’t been with any woman in quite some time.</p><p>He’d spent his youth working too hard to chase after girls. Eventually, a friendly widow in the next village had taken him in hand—and taken him in plenty of other ways, teaching him the lay of the female landscape. They’d had an easy friendship, but he’d broken it off when he’d started courting the schoolteacher. And after the schoolteacher had dropped him, he’d wasted a few evenings carousing in town to soothe his wounded pride.</p><p>And that was the sum of it.</p><p>Here he was, a virile, red-blooded man of seven-and-twenty, and he could count his lovers on one hand. His hand, of course, being the most familiar lover of all.</p><p>Diana’s hands were a welcome improvement. They were soft. So soft, and so wonderfully curious. As he tugged down the bodice of her frock, she skimmed inquisitive touches up his arms, across his shoulders, down the planes of his chest. Awakening his every nerve and whipping his heartbeat to a gallop.</p><p>He removed her frock and carefully laid it aside, leaving her clad in a sweet, simple chemise and stockings. Silk stockings, from the feel of them. He ran a hand up her calf, imagining the feel of her legs locked around his waist. Just the thought made him groan with anticipated pleasure.</p><p>“You like them?” she asked. “They’re my best.”</p><p>“I’m surprised you didn’t change when you decided to stay home.” He touched the edge of her ribbon garter, but he didn’t untie it.</p><p>She gave him a kittenish smile. “Oh, I did change. I put these on for you.”</p><p>Lust streaked through him, nearly cleaving him in half. Neither of them were even naked yet, and he was already primed to spill.</p><p>“God, I love you.” It wasn’t the eloquent confession she deserved. But something in him had to erupt, and words seemed the safest quantity.</p><p>She laughed and kissed him. As their tongues danced, he sent his fingers to undo the tiny buttons queued down the front of her shift. There were hundreds, it seemed.</p><p>At last he’d loosened enough of those buttons to draw the edges apart and slide his hand inside.</p><p>Sweet heaven.</p><p>He was a smith. He worked with hard, solid, unforgiving materials all day long. But this . . . Ah, this was softness.</p><p>Nothing could compare to the sensation of her breast filling his hand. Nothing. He stroked, lifted, kneaded, teased. He couldn’t get enough of touching her.</p><p>He dropped his head, trailing kisses down her neck and breastbone, wrenching the edges of her shift aside until the rest of the buttons popped free. He paused just long enough to register the color of her nipple—a pale, tawny pink—before taking it in his mouth.</p><p>She gasped and sighed. Her fingers wove tight in his hair.</p><p>With one hand, he raised the hem of her shift, taking time to savor the glide of silk before seeking the delicate folds of her sex. She parted her thighs with an eager innocence, but from there progress slowed.</p><p>She was so small, so tight. Just working a single finger into her sheath took ages. And as men went, Aaron knew he was on the larger side. His past lovers had been glad of it. But in this situation . . .</p><p>Gathering all of his patience, he stroked that single finger in and out, all the while suckling her breasts and rubbing the heel of his palm against her pearl. Her erotic, breathy moans encouraged him, as did the increasing heat.</p><p>But when he tried to add a second finger, she tensed all over.</p><p>He withdrew his touch at once, cursing his rough workman’s hands. He drew her shift down, covering her to the knees.</p><p>“I don’t want you to fear this. And I can’t bear to cause you any pain.” The words were hell to get out, but he knew he must. “Perhaps we should wait.”</p><p>Her blue eyes glistened with emotion. Her kiss-swollen lips parted, spilling the most un-Diana-Highwood words he’d ever heard her speak.</p><p>“Like the devil we should.”</p><p>Diana savored his blank look of surprise.</p><p>He wasn’t accustomed to such language from her. She wasn’t accustomed to using such language. But on this point, propriety could go hang. She wouldn’t leave any room for ambiguity.</p><p>This needed to happen. Tonight.</p><p>She struggled up on her elbow, turning onto her side so that they faced one another on the bed. “Aaron, I was attracted to you from our first acquaintance. Infatuated with you not long after. But I fell in love with you because you put the reins in my hands. You trusted me to know my own mind, and you gave me the courage to follow my heart. That’s the reason I’m here tonight.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He stroked her arm. “If you tell me you’re certain . . .”</p><p>“I’m certain. All my life I’ve kept a safe distance from my own emotions. No longer. If fear is part of this, then I want to feel fear. Pain, as well. And joy and anxiousness and need and pleasure and . . . and everything, all at once. I want to experience all of it, and I want it with you.”</p><p>A finality settled on his features. “Then you’ll have it.”</p> <p>Yes. Feeling triumphant, Diana relaxed back onto the bed, stretching her limbs in a sinuous plea for his touch.</p><p>He caressed her with his eyes first, sweeping a determined gaze over her body.</p><p>“Do you understand pleasure?” His hand eased between her thighs, cupping her sex through her shift. “This will go much easier if you reach climax first.”</p><p>He asked her the question so baldly. Even hopefully. She answered with the truth. “Yes.”</p><p>“Good.” His voice was a low, dark thrum. “Good.”</p> <p>She arched her back, pushing into his touch.</p><p>“Yes,” he said. “Show me what pleases you.”</p><p>Her boldness faltered. There was admission, and then there was demonstration. But she pressed her eyes closed, gathered her courage, and reached down to cover his hand with her own. She didn’t guide him under her shift but pressed his fingers to her flesh through the muslin, working the smooth, strong friction in just the right place.</p><p>Once he’d established a rhythm, she relaxed her grip and melted against the mattress. He kissed her breasts, her ears, her neck. His skillful touch and talented mouth were arousing sensations different from any she’d ever experienced. This wasn’t a moment’s gratification in the bathing tub. This was an ocean. A vast sea of pleasure, swirling around her, lifting and tossing her in ways she couldn’t control.</p><p>The only course was surrender.</p><p>Her breath grew ragged, and she writhed, uneasy, on the bed. He fitted his mouth over her nipple and drew hard, teasing the tip with wicked lashings of his tongue. The joy was so acute. A delicious urgency bloomed and spread through her whole body. She dug her heel into the mattress, rolling her hips to meet his touch.</p> <p>“Yes,” he whispered, abandoning one nipple just long enough to catch the other. “That’s it.”</p><p>He removed his hand from between her legs. She whimpered at the deprivation, until he moved to cover her with the full length of his body. He still wore his trousers, but the sheer heat and weight of him were sensual gifts. The hair on his chest teased her sensitized nipples. His hips nudged her thighs wide, and then the smooth, thick column of his trapped erection settled snug in her cleft.</p><p>Yes. This. The firm, perfect pressure was just what she’d needed. He moved against her in a slow, tantalizing rhythm, and she rode his motions.</p><p>“Aaron.” She clutched at his shoulders and neck, holding on for her life as the pleasure tugged her in ten different directions.</p><p>And then it all came together in one brilliant, shattering wave of joy.</p><p>No sooner had her climax ebbed than he was backing away, yanking at the buttons on his trousers and cursing his boots as he stripped to his skin. He pushed her shift to the waist, gazing boldly on her most intimate places. But before she could think to squirm or shy from him, he’d settled atop her again.</p><p>His thighs were hard against hers, and covered with hair, much like his chest. The smooth, broad crown of his manhood prodded at her core.</p><p>He groaned. “I . . . I don’t know that I can wait much longer.”</p> <p>“I think we’ve both waited long enough.”</p><p>His hips flexed, and he pushed forward.</p><p>Inside her.</p><p>She buried her face in his neck, determined not to cry out.</p><p>He cursed. “It will be better next time. I promise.”</p><p>It hurt. It hurt fiercely—so much that only the tang of blood made her aware that she’d bitten her lip.</p><p>It will be better next time, she consoled herself as a series of slow, persistent thrusts took him deeper. Brought them closer. It will be better next time.</p><p>But once she’d reconciled herself to the promise of Next time. . .</p><p>This time started to feel rather good.</p><p>She wouldn’t climax again. That wasn’t even a question. But the sublime feeling of being needed, desired, loved with such vigor and passion . . . this was a new, intoxicating pleasure all its own. She held him tight, loving the feel of his flexing, straining muscles as he buried his length deep at the heart of her, then strove to go deeper still.</p><p>His motions quickened, grew less elegant and controlled. Her breathing was labored in a way that would have alarmed her in her youth.</p><p>Not anymore.</p><p>He kept his weight balanced on his elbows, and she curled her neck to kiss him on the chest, the neck . . . anywhere she could reach. She ran her tongue along his collarbone, feeling brazen and seductive.</p><p>With a strangled groan, he slid one hand to her backside, holding her tight for a final barrage of thrusts. His face twisted into a mask of torturous pleasure.</p><p>At last, he slumped atop her, growling and shuddering with the force of completion. Filling her deep.</p><p>He remained inside her, slowly softening as his labored breath caressed her neck.</p><p>He was quiet and still for a long, long time. Because they’d earned this, too—this refuge in each other. In all her life, she’d never felt so perfectly loved and safe.</p><p>“You can’t know,” he finally whispered into her hair. “You can’t know how long I’ve wanted this.”</p><p>She turned her head, seeking his kiss. “I think I have some idea.”</p><p>CHAPTER 11</p><p>Diana slept late the next morning. She assumed everyone in the Queen’s Ruby would.</p><p>She’d been back safe in her own bed for less than an hour before the carriages had rattled into the village center. The girls had come tromping up the stairs, giggling and whispering to one another. It would seem they’d managed to have their fun without Diana’s help. She was glad of it. Part of her had been tempted to come out of her room and ask for all the details. She wanted to hear all the news of Kate and Minerva.</p><p>But she’d decided there would be time enough for those questions in the morning. Her night with Aaron had left her blissfully sapped of strength, and she was supposed to be ill.</p><p>So when Charlotte had opened her door a crack and whispered a cautious “Diana?”she hadn’t answered but pretended to be asleep. And then she’d fallen asleep in truth.</p><p>She slept hard. Her body had earned it.</p><p>When she woke, she could hear the sounds of breakfast. Her chamber was situated directly above the dining room, and she knew well that distant murmur of porcelain and cutlery, delivered on air scented of buttered toast.</p><p>She rose, washed, and dressed in her favorite frock, then clattered down the stairs.</p><p>No, not clattered.</p><p>She floated down the stairs.</p><p>She was in love. She was getting married. She would have a sweet little cottage in this village she’d come to think of as home, and she and Aaron would build a life and a family together. It might not be the future her mother had planned, but it was more happiness than Diana had ever dreamed she’d grasp.</p><p>And by the end of today, everyone would know the truth.</p><p>In the corridor, she slowed, intrigued by the sounds coming from the dining room.</p><p>“She’s coming,” someone whispered.</p><p>A roar of shushing ensued. There was a rattle of panicked flatware.</p><p>Then Diana turned the corner and entered the dining room, and everyone fell completely, eerily silent.</p><p>“My goodness,” she said. “What is it? What’s wrong?”</p><p>One of the girls set down her spoon. “See, I told you she’d know nothing about it. It couldn’t have been her.”</p><p>“Hush, Fanny.” Miss Price cleared her throat and looked Diana over. “You look quite well this morning, Miss Highwood. One would never know you were ill last night.”</p><p>“Thank you.” Diana spoke slowly, not liking the suspicious tone in Miss Price’s voice. “I am feeling much improved.”</p><p>All of the ladies regarded her warily, even as they sent speaking glances to each other.</p><p>Diana’s heart began to pound.</p><p>Oh, Lord. They knew. They all knew. Someone had noticed her sneaking out to see Aaron. Or sneaking back in afterward.</p><p>“I don’t believe it of her,” one girl whispered.</p><p>“But it couldn’t have been anyone else,” another replied.</p><p>“It’s probably a compulsion. I’ve heard of it happening with some girls. They know it’s wrong, but they can’t help themselves.”</p><p>A compulsion?</p><p>No, no, no. Diana wasn’t suffering any compulsion. She was in love. She was floating. That’s what she’d wanted everyone to see today. Not sordidness.</p><p>Instead, they all looked at her sideways and whispered behind their hands.</p><p>This was ruination, she realized. Her twenty-three years of delicate refinement didn’t matter anymore. Everyone stared at her with revulsion and fear in their eyes. As though her pretty blue frock had been soiled with soot—and if they came too close, it might stain them, too.</p><p>She felt truly ill now. What would they think of her? What would this mean for Charlotte?</p><p>One thing was certain—their image of the perfect Miss Highwood was now irretrievably shattered.</p><p>Miss Price elbowed her neighbor. “Do it. Someone has to ask.”</p><p>“I’ll do it. I’m the landlady. It should be me.” Dear old Mrs. Nichols rose from her seat and clasped her hands together in an attitude of prayer. “Diana, dear,” she began gently. “Did you have anything to tell us? Anything at all, about last night?”</p><p>The rain was back. With a vengeance.</p><p>Aaron didn’t know what to do with himself. All the Queen’s Ruby ladies would surely be sleeping in today, Diana included. He couldn’t go call on her until late afternoon, and there wasn’t much sense braving this downpour to go anywhere else. He’d looked in on Mr. Maidstone early that morning, after walking Diana back to the rooming house.</p><p>He decided to start on a wrought-iron gate for the front garden. He’d long been planning to replace the humble wooden one. He’d just never found the time.</p><p>Today, he had all the time he wished.</p><p>He built a roaring fire in the forge and took out a length of squared stock. To make spiraling balusters for the gate, he needed to heat the iron to a glowing yellow, crank furiously to secure it in a table vise, grasp the end of the rod with tongs, then twist the metal in as many rotations as he could manage before it cooled.</p><p>Then repeat the whole business again. And again.</p><p>It was hard, sweaty work—and just the distraction he needed today.</p><p>He’d been at it for an hour or two when he saw a figure hurrying up the lane. Who would come out in this weather? He hoped it wasn’t the Maidstone girl again, come to tell him her father had taken a turn for the worse.</p><p>But when the door burst open, in came Diana.</p><p>She removed her cloak and hung it on a peg near the door, then played stork by standing on one foot, then the other, tugging off the canvas gaiters covering her shoes.</p><p>Aaron merely stood and stared, letting his rod of twisted iron go cool in the vise. “You shouldn’t be out in this weather. You’ll catch cold.”</p><p>Perhaps he should have greeted her with Good day, or What a pleasant surprise, or Did I tell you last night that I love you to the depths of my soul? But he couldn’t be bothered with pleasantries now. She’d pledged herself to him, always. He wanted “always” to be a long, long time.</p><p>“I just needed to see you. To talk to you. It couldn’t wait.” She hurried toward him.</p><p>“Stop,” he said.</p><p>She stopped, taken aback.</p><p>He cursed his thoughtlessness again. “Sorry. I didn’t mean to bark at you. But have a care for your hem and slippers.”</p><p>He nodded at the ground.</p><p>She’d crossed from the paved half of the smithy and trod straight onto the cinders, dragging her damp flounce through the packed soot. That sort of soil was near impossible to clean. Anyone who saw it would know where she’d been. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It doesn’t matter,” she said. “I’m cold. I want to be nearer the fire. And you.”</p><p>“Then put your hands on my shoulders.” When she complied, he slid a forearm under her hips and lifted, boosting her to sit on the anvil. He kept his hand clenched and out of the way, to keep from mussing her frock.</p><p>But once he had here there, sitting sweetly on his anvil . . .</p> <p>By God, he wanted to muss her all over.</p><p>Five minutes ago, he would have sworn there was no sight on earth more enticing than Miss Diana Highwood in her china-blue frock.</p><p>But he was wrong.</p><p>There was a sight more enticing. It was Miss Diana Highwood in her china-blue frock, damp with rain.</p><p>The cloak had protected her from the worst of it, but enough of the weather had seeped through that her bodice might as well have been a coat of paint. Her nipples were hard and perfectly outlined.</p> <p>Her legs dangled above the cinder floor. He caught a glimpse of her white-clad ankles. No silk stockings today, just sensible wool. He still found them arousing as hell.</p><p>“I wasn’t expecting you.” He wiped his brow with his sleeve, then showed her his blackened hands. “Sit here by the forge. I’ll go wash up, find a fresh shirt, build a fire in the cottage. Then I can warm you properly.”</p><p>She reached for him. “No, stay. Stay with me.”</p><p>“If you like.”</p><p>Frowning, he studied her, trying to decide whether her shivering was due to the damp weather or a fragile emotional state. Either way, he didn’t like feeling unable to help her.</p><p>He couldn’t warm her with his hands. But hands weren’t the only parts he had.</p> <p>“Your fingers must be freezing,” he said, glancing down at her balled fists.</p><p>She nodded.</p><p>She wore those knitted handwarmers that seemed popular with all the ladies this spring. Fingerless gloves, he’d heard them called. In weather like this, “fingerless” struck him as tantamount to “useless,” but he didn’t pretend to understand ladies’ fashions.</p><p>He untied his leather apron and cast it aside. Then he jerked his homespun shirt free of his waistband and lifted it in invitation. “Put them here.”</p><p>She pressed her chilled hands flat to his torso. Their coolness gave him a jolt.</p><p>“Goodness,” she said. “You’re like a furnace.”</p><p>Love, you have no idea.</p><p>To be sure, her hands were cold. But her cold fingertips had less chance of dampening his lust than ten snowflakes falling on a bonfire.</p> <p>His whole body was aflame with desire for her. Had been since long before she’d burst through the door. All he’d been able to think of since last night was her naked body under his. Her sweet touch against his bared skin.</p><p>Bending his head, he kissed the pink back to her lips, then her cheeks. He nuzzled the frosty snub of her nose. Licked a stray raindrop from her brow.</p><p>“That’s better,” she said.</p><p>“I’m just getting started.” He pressed a kiss to her neck. “But you had something to talk about?”</p><p>“It can wait.”</p><p>“Good.” He trailed kisses lower. “Good.”</p><p>Her fingers slid around his rib cage, spreading over the planes of his back, drawing him close. Instinctively, he moved to reciprocate and embrace her, too—but he remembered himself just in time to keep from smearing her frock with soot. Instead, he let his hands drop, and he gripped either end of the anvil.</p><p>Her neckline thwarted him. When damp, the muslin had no give. So he dropped his head lower, nuzzling her breasts through her bodice.</p><p>She sighed and moved against him, seeking more contact.</p><p>He knew she wanted more. Needed more. And he knew how to give it to her, too. He just wasn’t sure she was ready to receive it.</p><p>No way to find out but to try.</p><p>He sank to his knees, ducked his head, and burrowed under her skirts.</p><p>She went completely still. Not a muscle moved, but he could hear her breathing. Her breath came from a low place, deep in her belly. Husky and yearning.</p><p>She didn’t tell him to stop.</p><p>He nibbled his way up the stocking-clad slope of her calf and knee, nosing his way through the tunnel of petticoats. When he reached her ribbon garter, he knew paradise was close. He laid his tongue to the bare silk of her inner thigh, then swept boldly upward. As he moved higher, his broad shoulders pushed her legs apart.</p><p>Her thigh gave a sweet quiver against his mouth.</p><p>He found her center, nestled close, and parted her with his tongue.</p><p>She sucked in her breath.</p><p>He paused, giving her time to adjust or object if she wished—and he drew a deep inhalation of his own. He breathed the scents of spring rain, and muslin pressed with a hot iron, and her intoxicating feminine essence. So pure, so sensual. It made him wild.</p><p>He lapped at her, thirsty for more.</p><p>It wasn’t long before she surrendered to the pleasure, relaxing into his kiss. He explored gently, tenderly, learning what pleased her and what didn’t. He would have loved to bring her to climax this way. But when she tugged at his shoulders in a silent plea for him to rise, he couldn’t find any strength to object.</p><p>With his teeth, he dragged her skirts to her waist, and he wedged his hips between her spread legs, grinding his buckskin-trapped erection against her aroused flesh.</p><p>This was so good.</p><p>And so wrong.</p><p>A flicker of doubt chased down his spine. It was the middle of the day. Pouring rain outside, yes, but someone could come in at any moment. Someone from the rooming house might be looking for her.</p><p>Were they really going to do this?</p><p>Her slender legs locked around his waist. The heel of her slipper dug into his flank—like a spur, prodding his inner beast.</p><p>Oh, yes. They were going to do this.</p><p>He tightened his grip on the pointed ends of the anvil, bracketing her hips. “You’ll have to take it from here.”</p><p>She reached between them and worked the closures of his trousers, slipping each button free with small, sure fingers. Then those same fingers reached inside and found his straining cock, drawing him out and guiding him to her core.</p><p>She was wet and ready. A low groan eased from his chest as he slid deep.</p><p>Sweet . . . holy . . . damn.</p><p>How many nights had he taken himself in hand and imagined just this scene? Perfect, refined, delicate Diana Highwood propped on his anvil, milk-white thighs spread wide. Panting for him. Her back arched in pleasure, her breasts overflowing her bodice as he took her, pounding a forged-iron erection into her willing heat, again and again and again. She’d always been his favorite erotic fantasy.</p><p>But the reality? The reality surpassed his every imagining.</p><p>He could never have pictured it like this. The sounds of rain sheeting down, battering the smithy roof. The small, private clouds of their mingled breath. The scent of laundered muslin mingling with raw, animal lust. And God, the feel of her. Her velvet heat hugging his cock. So tight. The sweet vise of her legs locked over his hips. The delicious bite of her fingernails on his neck.</p><p>I want this, too, her body told him. I want this, I want you. I want more, more, more.</p><p>With a low growl, he tightened his grip on the anvil and redoubled his pace. He would give her more. He would give her everything.</p><p>“Aaron.” Her hands fisted in the fabric of his shirt. “Aaron, wait.”</p><p>He froze, breath heaving in his chest. Damn. She’d come to her senses, realized she was a gentlewoman being crudely tupped on the anvil in a village smithy. Bloody hell. He was a rutting bastard.</p><p>Maybe he could apologize. Make it up to her by carrying her to the cottage and his bed.</p><p>Or maybe she’d just leave. Forever.</p><p>“I . . .” He didn’t know what to say or do. He just hoped she didn’t weep.</p><p>She looked up at him with sultry, heavy-lidded eyes. “Touch me,” she said huskily. “Get me dirty. I don’t mind.”</p><p>Sweet . . . holy . . . damn.</p><p>Outside of muttering his way through Sunday service, Aaron had not voiced a conscious prayer in more than ten years. He supposed it wouldn’t help his chances in the hereafter if he returned to the fold with Saints preserve me from premature ejaculation. No matter how sincerely uttered.</p><p>Instead, he gritted his teeth and slowed his thrusts to a languid roll. She held fast to his neck but relaxed her arms, so that she hung pendulous beneath him, affording them both the space to watch.</p><p>She looked on, wide-eyed and breathless, as he slid one hand to cup her breast. Her body arched into his touch. His thumb made a dark, rude streak over the pale muslin. Marking her.</p><p>She gave a sharp cry of pleasure, and her intimate muscles clenched around him.</p><p>Tight.</p><p>That cry she gave . . . it was a cry of relief, born of keen anticipation. As if his rude, gritty touch was what she’d been waiting for all this time.</p><p>Touch me. Get me dirty. I don’t mind.</p><p>“I’ll be damned.” He blinked away a trickling bead of sweat. “You’ve been wanting this, too.”</p><p>She bit her lip and blushed. Her lashes fluttered coyly. “I . . . I don’t know what you mean.”</p><p>Aaron chuckled low, dragging his caress from one breast to the other. Of course she wouldn’t admit it so easily. That would spoil the fun for them both.</p><p>But he knew the truth now. She’d pictured this. Dreamed of this. Perhaps even sent her hand beneath the coverlet and touched herself while imagining just exactly this.</p><p>Damn, he loved her.</p><p>And he was going to make this good.</p><p>He made his voice low and smug as he thumbed her hardened nipple. Smearing soot in a lewd circle. “Don’t play innocent, Miss Highwood. You’ve been wanting this. A hard, sweaty pounding from the village smith. These strong, dirty hands all over your body. You’ve been wanting it, haven’t you?”</p><p>“I . . .”</p><p>He withdrew halfway, then slid deep. “Haven’t you?”</p><p>As he moved in and out, her head bobbed in a subtle nod.</p><p>“Say it.” He thrust hard.</p><p>She gasped. “Yes.”</p><p>A thrill of triumph buzzed through his whole body—then settled, tense and eager, in the base of his spine.</p><p>“Show me, love. Show me how bad you wanted it.”</p><p>She kissed him deeply, hungrily, catching his tongue and suckling it hard. As they kissed, she made soft, needy whimpers in the back of her throat.</p><p>“Take me,” she whispered. “Mark me as yours. I want everyone to see.”</p><p>Her words shredded his restraint, but he fought the urge to pump hard and fast, remaining faithful to the slow, steady grind that made her writhe and moan.</p><p>Made her tense and grip tight.</p><p>And then at long, merciful last—made her shudder and keen in sweet release.</p><p>Thank God.</p><p>When she’d recovered from her crisis, he gathered her tight in his arms. Then he stood, lifting her off the anvil entirely and settling her weight against his chest.</p><p>“Hold tight,” he grunted. “Hold tight to me.”</p><p>She obeyed, lashing her arms around his neck and legs about his waist.</p><p>She wanted a tupping from a coarse, common brute? That’s what she’d get. Ten years at this forge had changed him, raised him from a youth to a man. He’d learned patience, attention to detail, restraint—everything he needed to be slow and steady for her pleasure.</p><p>But it had also made him strong as an ox. And now it was his turn.</p><p>Bracing his feet shoulder-width apart, he tensed his thighs until they were solid as tree trunks. He used every bit of the hard-earned strength in his arms and shoulders, sliding her up and down his length. Using her shamelessly, clutching her bottom with his sooty hands and working her hard.</p><p>It wasn’t a feat he could have kept up all night, but that didn’t matter. His lust had reached such a desperate pitch that a minute or two was all it would take.</p><p>If that.</p><p>He wanted to keep his eyes open. This was his dream, his fantasy come to life. She was in his arms, all lacy and perfect and dirty and wet. He meant to watch her, keep his gaze on her flushed, glistening cleavage as he came. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But when the pleasure ripped through him, his eyes squeezed shut of their own accord. The fierce jolts of ecstasy sent him someplace dark, and then someplace bright . . .</p><p>And then somewhere utterly blank.</p><p>Her sweet embrace brought him back. That, and the relentless drumming of the rain.</p> <p>Somehow he managed to carry her to the table and set her down on the planked surface. He pulled up his trousers and slumped next to her, weak all over.</p><p>No more work was getting done on that gate today.</p><p>“Oh, Aaron. I’m in such trouble.”</p><p>Shaking off the postcoital lethargy, he turned and met her gaze. “If you don’t . . . I . . .”</p><p>“No,” she jumped to assure him. “I didn’t mean that way. I have no regrets about today. Or last night. None at all.”</p> <p>He exhaled with relief. “Whatever the problem, I’ll mend it. That’s what I do. I mend things.”</p><p>“This isn’t as simple as a broken latch.”</p><p>“Whatever it is, whatever it takes, I will mend it. If you don’t know it by now . . .” He drew a sooty line down her cheek. “Diana, I love you more than my life.”</p><p>She bit her lip. “That’s just it. My life’s at stake. I may be charged with a felony.”</p><p>CHAPTER 12</p><p>Diana waited, breathless, for his reaction.</p> <p>After long, tense moments, he finally gave her one.</p><p>He laughed.</p><p>She only wished this were a laughing matter. “It’s not a joke, I’m afraid. I’m under quite serious suspicion.”</p><p>“Of what?”</p><p>She sat tall on the table, letting her legs dangle over the edge. “When I came down from my chamber this morning, all the ladies were in the dining room. They were whispering about me among themselves. I thought they must have found out about us, about last night. But that wasn’t it. Mrs. Nichols accused me of something entirely different. They think I’ve been stealing.”</p><p>“Stealing?” He frowned, all amusement gone from his eyes. “You?”</p><p>“There’s been a rash of small things gone missing from the rooming house.”</p><p>He nodded. “Charlotte told me about that.”</p> <p>“She did? When?”</p><p>He waved off the question. “Not important now. Go on.”</p><p>As she spoke, she tugged at her soiled bodice, pulling it straight. “Last night, while all the ladies were gone to Ambervale, several more items disappeared. This time, some were valuable. Miss Price is missing a gold brooch, and a guinea was stolen from Mrs. Nichols’s own desk. And since I was the only lady who stayed home . . .”</p><p>“You couldn’t have been the only one there. What about the maids?”</p><p>She shook her head. “Only Matilda was there, and she slept in the same room as Mrs. Nichols. If she’d stirred, the landlady would have noticed. In their eyes, I’m the only one who could have taken the things.”</p><p>“But you didn’t.”</p><p>“Of course I didn’t,” she said. “I’ve never stolen in my life. It’s clear no one wants to believe it was me, but it seems the only logical explanation. They think I’ve developed a compulsion of some kind. Some sort of illness that drives me to steal.”</p><p>She exhaled heavily and wove her hands into a tight lattice of interlaced fingers. “Miss Price has requested a magistrate. I have no choice but to tell them the truth. I’ll tell them it couldn’t have been me, because I was here with you, all night long.”</p><p>His eyes flared. “What? Diana, you can’t tell them that.”</p><p>The vehemence of his reply took her by surprise. He pushed off the table and went to the forge, raking the coals of the dying fire and feeding it new splits of wood.</p><p>“I don’t think I have a choice,” she said. “It is the truth.”</p><p>“Yes. And if you tell them, you will be ruined. In truth.”</p><p>“Better to be a ruined woman than a suspected thief. Don’t you agree?”</p><p>He didn’t agree, nor give any response at all.</p><p>“That missing brooch is gold, Aaron. It’s worth a great deal. Thieves are hanged for stealing less.”</p><p>“No one’s going to hang you. You’re not a thief. The items will turn up, or someone else will confess. They have no evidence, only suspicion.” He approached her and put his hands on her shoulders. Their weight settled, heavy as a yoke. “Why tell everyone about last night and invite uncharitable gossip?”</p><p>She shrugged. “Perhaps I don’t care about the gossip.”</p><p>“I don’t believe that.”</p><p>“Then try a little harder.” Diana was frustrated now. Hadn’t he promised to trust that she knew her own mind?</p><p>She tried to explain. “When I came downstairs this morning and saw them all staring at me, I thought we were found out. For a moment, I was stricken by sheer terror. I was certain I’d be ruined. But then something changed. Once I’d resigned myself to the inevitability . . . I felt strangely free. Unashamed, excited. Aaron, I want people to know.”</p><p>“Well, I don’t. Not like this.” He released her and began pacing the smithy.</p><p>She watched him, perplexed. “I don’t understand. Aren’t we planning to marry?”</p><p>“Aye, but I wanted to wed you in a respectable fashion. If they hear about this, people will think we only married because I seduced you and you had no choice.”</p><p>“So this is about your pride,” she said. “Your reputation, not mine.”</p><p>“It’s both, Diana. But yes, I have a reputation, too. People respect me in this village. This is my home.”</p><p>“I hope it will be my home, as well.”</p><p>“Then think this through. What if word gets around London that you were defiled by a local craftsman? Good families might stop sending their young ladies to Spindle Cove. The whole village would suffer, and it would be my fault. I might not be able to support you then.”</p><p>This probably wasn’t the time to remind him that her dowry, while modest by aristocratic standards, could keep them comfortable for decades. He would only receive it as another insult.</p><p>“Aaron, I don’t know what to say. Except that perhaps you should have thought about all this before you carried me to your bed last night.”</p><p>He rubbed his mouth. “I wasn’t thinking last night. Obviously.”</p><p>Diana struggled to not take offense. She tried, very hard, to interpret his words in the kindest possible light.</p><p>When she’d come to his cottage last night, she’d done so with forethought and a full knowledge of the risks. However, he’d been taken by surprise to find her there. And he’d been in a vulnerable state, after a long day spent grappling with mortality and fatigue. Perhaps if he’d had time to think it all through, he would have sent her home and not made love to her.</p><p>But even so . . . How could he regret it now? What they’d shared had been so wonderful. At least, it had been wonderful for her. She felt ready to be with him, marry him, pledge her life to him.</p><p>Maybe he didn’t feel as ready as she did.</p><p>“Aaron, I understand if you’re afraid. I’m frightened, too. We knew it wouldn’t be easy to announce our plans, even under the best of circumstances. But I don’t see a way around telling the truth.”</p><p>“It’s easy,” he said. “We wait. In a day or two, this theft business is sure to be resolved. Then I’ll propose to you properly.”</p><p>“What if this theft business isn’t resolved? If I’m asked to explain myself, I’m stuck. My choices are between ‘suspected thief’ and ‘known fornicator.’ No matter what, I’m never going to be ‘Perfect Miss Highwood’ again. And it may seem strange, but I’m happy about that. I’m ready to just be me.” She looked him in the eye. “So there’s the question, I suppose. Do you love me? Or just some precious, perfect idea of me?”</p><p>His fingers tamed a stray lock of her hair. “Of course I love you. Perfect or not, I think the world of you, Diana. That’s why I can’t bear for our friends and neighbors to think something less.” He swept a gesture down her soiled frock. “I don’t want them believing you’re this kind of girl.”</p><p>She flung her arms wide. “Apparently, I am this kind of girl. And you didn’t seem to mind ten minutes ago.”</p><p>“That’s different. You know it’s different. There’s what happens between the two of us, and then there’s parading it for public view. We know how we feel, but to anyone else . . .” He cringed at his dark handprint sprawled lewdly over her breast. “You look like a lightskirt who’s entertained a gang of colliers.”</p><p>She recoiled, stung. “And yet I didn’t feel truly dirty until just this moment.”</p><p>“I didn’t mean it that way.”</p><p>“I know exactly what you mean. You want a lightskirt in your bed at night, and by day you want a perfect virgin.” She pressed a hand to her heart. “But I need a man who knows me. Who wants me. And who isn’t afraid or ashamed for the world to see it.”</p><p>“So now I’m ashamed?” His gesture was impatient. “Diana, our night together wouldn’t be such a scandal if anyone—your friends, family, neighbors—suspected that you care for me. But they haven’t seen the slightest evidence of that. Have they?”</p><p>The edge of accusation in his voice cut her deeply. He was right, she supposed. If she had been more forthright about her feelings for Aaron, the truth of last night wouldn’t come as such a surprise. For that matter, she wouldn’t have needed to lie about a headache in the first place.</p><p>“I . . . I’m not a woman who bares her feelings easily.” Out of habit, she reached for the vial hanging about her neck. It wasn’t there. Her fingers closed on air, and she felt bereft with nothing to cling to. “I’ve always been reserved.”</p><p>“Reserved,” he echoed. “Until this past week, you barely acknowledged me when we crossed paths in the lane. I’ve never taken offense. But now you call me ashamed? You know that’s not fair.”</p><p>All Diana knew was that she had to leave.</p><p>With shaking fingers, she put her clothing to rights as best she could and headed for the door. If he would abandon her to face false accusations of thievery before admitting to his own true actions, there seemed nothing more to discuss. She was on her own.</p><p>“Don’t go away angry,” he said, his tone gentler than before. “We’ll reside in this village for the rest of our lives, God willing. In a week, any absurd accusations of theft will be forgotten. But if you tell everyone about last night, the gossip will linger for years. I just want to be careful, that’s all.”</p><p>“I’ll be careful. I have a great deal of practice being careful. Don’t worry, Aaron.” She whirled her cloak about her shoulders and secured it tight in front. “I’ll make it home with these stains unseen. No one needs to know about us. Ever.”</p><p>She slammed the door, and Aaron’s ribs rattled with the force of the crash.</p><p>Damn. He hadn’t handled that well.</p><p>With two sisters in his care, Aaron had been on the receiving end of some feminine fury in his life. But Diana’s was a first-rate exit. One that begged, Chase after me. Grovel and plead and promise to give me anything I ask, everything I need.</p><p>He had every intention of doing just that.</p><p>Curse it, he never should have made that remark about lightskirts. He’d sounded disgusted by her, when in reality he was only disgusted with himself.</p><p>This entire situation was his fault. He never should have allowed her to stay last night. If another man had treated Diana—or any woman, for that matter—this way, Aaron would have raised hell. And the entire village knew it. He was the resident big brother. He protected the female contingent of Spindle Cove. But he’d failed to look out for the woman he loved. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He would go to her. Just as soon as he could manage it. First he needed to bathe, change, shave. He’d put on his best coat, gather up a spring flower or two. He supposed he hadn’t the time to learn any poetry—but he would bring the ring.</p><p>This was their first proper argument, and Aaron didn’t dare skimp on the reconciliation. When he did chase after her to fall at her feet and make promises . . . there could be no half measures.</p><p>He had to do this with his whole heart—even if it meant risking all.</p> <p>CHAPTER 13</p><p>By the time Diana arrived back in the village center, her hem and slippers were dredged in mud, and the rain had made a proper mop of her hair. With her cloak wrapped tight about her torso, no one could have guessed at the smudges on her frock beneath.</p><p>Her swollen eyes and red, sniffling nose could easily be explained away—just products of the damp weather.</p><p>She sighed. As always, her delicate health made such a convenient excuse. No one ever had to know if she didn’t wish them to.</p><p>As it turned out, she didn’t need excuses just yet. Other concerns had occupied the Queen’s Ruby residents. As the rooming house came into view, Diana saw all the young ladies milling about the front stoop, huddled under the overhang like a clutch of monks in hooded cloaks.</p> <p>“Oh, there she is.” Charlotte ran to Diana’s side. “Where have you been?”</p><p>“I went for a walk.”</p><p>“In this?” Her sister tilted her face to the rain, then slid Diana a suspicious look.</p><p>“Never mind me. What’s going on here?”</p><p>“We’re just about to go over to the Bull and Blossom, all of us.” Charlotte threaded her arm through Diana’s. “Miss Price has insisted they clear the place out and search the rooms. She’s in a tizzy about that brooch. Says it was an heirloom.”</p><p>“They’re searching the rooms?”</p> <p>Mama joined them. Billowing along in her massive black cloak, she looked like a vengeful raven.</p><p>“This is an outrage,” she said bitterly. “After two years of living in this rooming house, we are made to endure such suspicion? I gave them leave to search your chamber, Diana.”</p><p>“What?”</p><p>“There didn’t seem any reason not to. You have nothing to hide. Once that horrid Miss Price is satisfied of the fact, we can put all this absurdity behind us.” She made a noise of disgust. “And all this for that ugly, outmoded brooch. She ought to thank the soul who relieved her of it.”</p><p>While Mrs. Nichols and Matilda made a search of the rooming house, all the ladies made the trudge across the village green to the Bull and Blossom, where they settled at every available table. Mama ordered hot tea. Diana wished she dared ask Mr. Fosbury to doctor hers with whiskey. She despised the way all the ladies were staring at her.</p><p>She made herself small in her chair and wrapped her cloak tight about her body, praying this would all be over soon.</p><p>“Perhaps it’s time we left Spindle Cove,” she said quietly.</p><p>Her mother seized her arm with excitement. “Oh, Diana. If that is the happy result of this debacle, then I wish you’d been accused of thievery a year ago. We can go to Town at once. Minerva and Lord Payne will welcome us with open arms.”</p> <p>Diana doubted that “open arms” bit, but she didn’t suppose they would be turned away.</p><p>“At last you can start moving in the best circles. Where you belong. We will make the acquaintance of so many fine gentlemen. Men of wealth and culture and excellent manners.”</p><p>Diana wanted to weep. She didn’t want men of wealth and culture. She wanted Aaron, with his small, homely cottage and his dedication to his craft. Ironically, after all Diana’s fears about her mother and society’s disapproval, he wasn’t willing to brave a little gossip for her.</p><p>“This is ridiculous,” Charlotte declared, standing and addressing the unspoken accusation in the room. “The thief wasn’t Diana. I know it wasn’t.” She turned a keen gaze on Miss Bertram, who sat huddled in her cloak in the corner of the room. “You’re very quiet.”</p><p>“What do you mean?” Miss Bertram said, shifting evasively. “I was at Ambervale last night, with everyone else. Everyone except Miss Highwood.”</p><p>The silence fractured into a flurry of whispered suppositions.</p><p>Mr. Fosbury, bless him, played peacemaker. He emerged from the kitchen, bearing a tray of teacakes to pass around. “Now, now. I’m sure this is all a misunderstanding. No one who knows Miss Highwood could believe this of her.”</p><p>Miss Price clucked her tongue. “No one who’s lived with her for the past week could deny she’s been acting strangely. Disappearing at mealtime, keeping to herself.” She confronted Diana directly. “You told everyone you were ill last night. But then you seemed right as roses this morning.”</p><p>“Yes,” Diana said. “Yes, I lied about being ill last night.”</p><p>This was it. She was going to tell the truth. Even if she had to give up her dreams of being a blacksmith’s wife, she refused to surrender her hard-won sense of freedom.</p><p>Another of the girls looked perplexed. “Why would you do that, Miss Highwood? Weren’t you looking forward to visiting Ambervale?”</p><p>“I should think the reason is obvious,” Miss Price declared. “She stayed behind so she could make free with our possessions.”</p><p>“No.” Diana pulled her spine straight. “I feigned illness for the same reason I’ve been feigning ill health for years now. Habit. And fear.” She turned to her mother, steeling her resolve. “My asthma hasn’t bothered me in years, Mama. I’ve been told I’m cured. But I’ve clung to the appearance of delicate health because . . . because it’s easier to claim a false malady than endure the real headache of arguing with you.”</p><p>A hush fell over the room. She could feel everyone staring at her.</p><p>“I’m sorry, Mama. I should have been honest and told you I didn’t wish to go.”</p><p>“Why would you not wish to go?” her mother cried. “You had the lead in the theatrical. And I know we agreed on Lord Drewe’s unsuitability, but Lord Payne was attending as well. One of them might have invited a highly placed friend.”</p><p>“I don’t care about Lord Drewe,” she exclaimed. “Nor his friends. I don’t want the same things you want, Mama. Marrying me off to a duke is your dream, not mine.”</p><p>Pursing her mouth in displeasure, Mama flicked open her fan. “I think you are ill. I’m sure I’ve never heard you speak in such a fashion.”</p><p>“Well, I suggest you get used to it.” Diana rose and confronted the room of shocked faces. “I am guilty of falsehood. It was wrong of me to lie. Not only wrong but cowardly as well. I am sorry for it. But I swear to you, I did not steal. They won’t find anything in my room.”</p><p>Matilda came bursting through the door, closely followed by Mrs. Nichols. “We found something in Miss Highwood’s room.”</p><p>“What?” Charlotte cried. “Impossible.”</p><p>“Is it my brooch?” asked Miss Price.</p><p>“Not the brooch,” Mrs. Nichols said, giving Diana an apologetic look. “But we did find these.”</p><p>The old woman unrolled a linen handkerchief to reveal a collection of shiny metallic objects.</p><p>Oh, no. They were Aaron’s pieces. The ones she’d kept hidden at the bottom of her trousseau.</p><p>Diana went dizzy. She sat down again. “I didn’t steal those. You can ask Sally Bright.”</p><p>“Ask me what?” Sally asked, having just popped through the door. She flashed a cheeky smile. “You don’t really think I’d miss a scene like this, do you?”</p><p>Wonderful. Now the whole village was assembled to witness Diana’s humiliation. All the ladies of the Queen’s Ruby, Mr. Fosbury and his serving girl, assorted tavern patrons, and now Sally Bright—who would share the tale with the few remaining people in the parish who’d missed it.</p><p>“Those pieces Mrs. Nichols is holding. I purchased them from the All Things shop, didn’t I?”</p><p>“Oh, yes,” Sally said, peering at the handful of silver. “Last year, I think. You told me they were going to be Christmas gifts.”</p><p>“Then why were they buried at the bottom of her trunk?” Matilda asked. “All secret-like.”</p><p>“It’s plain to see what’s been going on,” Miss Price said. “The pressure of being the perfect daughter has worn on Miss Highwood, and she’s developed this compulsion to collect shiny things. At first she bought them, but now she’s resorted to stealing. I want to call for a magistrate.”</p><p>“But she doesn’t have your brooch,” Charlotte argued.</p><p>“Doesn’t she? She probably hid it elsewhere.” Miss Price ticked off the “evidence” on her fingers. “She lied about being ill. She was the only one with a chance to steal it. She disappeared again this morning, and now we find this cache of trinkets.”</p><p>“Those are not trinkets,” Diana argued. “They’re art. They’re precious.”</p><p>“Precious?” Miss Price turned to Mrs. Nichols and raised her eyebrows in a way that said, See what I mean?</p><p>“I’m sure there’s another explanation,” Mrs. Nichols said. “Miss Highwood, if you were at the rooming house last night, did you hear anyone come in or go out?”</p><p>“No,” Diana said. “I couldn’t have heard.”</p><p>“Why not?”</p><p>“Because I wasn’t there.”</p><p>A ripple of murmurs passed through the tavern.</p><p>Mama snorted. “Of course you were there. Charlotte looked in on you when we returned.”</p><p>“Yes, I know. I was awake. I’d just come back in.”</p><p>“From where?” Miss Price asked.</p><p>Diana buried her face in her hands and rubbed her temples. This was madness. Even if she told the truth, she wasn’t sure anyone would believe her. She was about to publicly ruin herself and lose Aaron forever.</p><p>“She was with me.”</p><p>Her head and heart lifted at the sound of that familiar baritone.</p><p>Aaron.</p><p>He stood silhouetted in the door. His hair was damp, plastered to his brow. His boots were caked with mud. He wore the same chocolate-brown coat she’d stitched together minutes after stitching his arm.</p><p>And no man had ever looked so handsome.</p><p>“She was with me,” he repeated, walking into the tavern. “All night long.”</p><p>Diana wanted to cheer. Charlotte actually did cheer, albeit quietly.</p><p>“But of course!” Mama exclaimed with evident relief. “This explains everything.”</p><p>What? Diana hadn’t been expecting her mother to take this so well.</p><p>She looked around the tavern. Everyone seemed to be taking this well.</p><p>“Oh, yes,” said Mrs. Nichols, catching on to the conclusion that was seemingly obvious to all but Diana. “We all know about Mr. Maidstone’s accident yesterday.”</p><p>Everyone in the tavern nodded and murmured in agreement.</p><p>“Mr. Dawes was called away to set a bone. Miss Diana must have heard the news. She was helping nurse an injured man, just like she helped with Finn’s surgery.”</p><p>“That is so like my daughter,” Mama crowed. “Always kind to the less fortunate.”</p><p>Oh, for heaven’s sake.</p><p>This was ridiculous. Diana couldn’t ruin herself when she tried.</p><p>She caught Aaron’s gaze. She knew they were sharing the same thought. They could let the mistaken assumption stand. Everything could be settled without any scandal at all.</p><p>But I don’t want to hide it, she told him with her eyes.</p><p>He nodded in agreement. “It’s all right. Tell the truth.”</p><p>Her heart beat faster. “You’re wrong, Mother. I went to Mr. Dawes’s cottage after he was finished tending to Mr. Maidstone. I . . . I spent the night there.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her mother laughed, incredulous. “Well, whyever would you do that?”</p><p>Diana smacked a palm to her forehead. Did she have to draw every conclusion with pen and ink? “We were making love!”</p><p>Now the tavern went stone silent.</p> <p>Mama snorted. “I’m sure I don’t believe that. I’d sooner believe you were a thief.”</p><p>“It’s the truth, Mrs. Highwood,” Aaron said. “Whether you believe it or not. And I’m here to ask Miss Highwood to marry me.”</p><p>From his breast pocket he removed a ring and laid it on the table. A gold band shaped like two entwined vines, with golden leaves bracketing a ruby-and-diamond bloom.</p><p>She pressed a hand to her heart. Oh, it was lovely. His best work yet. How he must have slaved over the design.</p><p>“Miss Highwood.” Aaron cleared his throat and moved as though he would kneel. “Diana, I—”</p> <p>“Stop!” Mama cried.</p><p>Aaron froze in an awkward half crouch.</p><p>“How can you expect me to allow this?” Mama glared at him. “How dare you impugn my Diana’s honor in this fashion! Grasping, awful man. Of course you’d leap at the opportunity to rescue her from these silly thieving suspicions, hoping she’ll marry you in gratitude. It’s not as though a man like you would have a chance at her otherwise. But I tell you, your scheme won’t work.”</p><p>“It’s not a scheme,” Diana said. “And he has more than ‘a chance’ with me, Mama. I love Aaron. And I am going to marry him.”</p><p>Diana reached for the ring he’d laid on the table.</p><p>Her mother smacked her hand away. Smacked it, as though Diana were a three-year-old child.</p> <p>Diana simmered with anger. She was not a child. She was all grown up, and her mother was about to learn the truth of it.</p><p>“Mama,” she said coolly, “listen to me closely. I am in love with Mr. Dawes. I have been for some time. I collected his pieces from the All Things shop because I admired him. We shared our first kiss in the vicar’s curricle. He introduced me to his sister on our excursion to Hastings. I tried to kill an eel for him. I shot at a robber who threatened him. And last night . . . ?” She lifted her voice. “We. Were. Making. Love. In a bed. All night long. It was hot and sweaty and glorious. I left scratches on his back. He has a freckle just to the right of his navel. And if you don’t believe all that . . .”</p><p>She ripped her cloak open and threw it aside, exposing Aaron’s black, sooty handprint on her breast. “Here. See for yourself.”</p><p>Several moments passed, during which the only sound was the mad thump of her heartbeat in her ears.</p><p>Then someone shrieked.</p><p>Strange. Diana had expected a measure of shock at her revelations, but that seemed a bit extreme, shrieking.</p><p>Now another girl screamed.</p><p>And another. “It’s a rat!”</p> <p>A rat?</p><p>Oh, God. It was a rat. A long-tailed, bewhiskered rat, big as a bread loaf, with a pink, twitching nose. The creature scampered onto the table—and absconded with the ring.</p><p>Her ring.</p><p>Aaron cursed and lunged to get it back.</p><p>“Mr. Evermoore!” Miss Bertram leaped to her feet. “Mr. Evermoore, no! You come back here right now.”</p><p>In an instant, the tavern was in upheaval. Some of the ladies jumped on chairs and tables. Others reached for any makeshift truncheon close at hand. Pots, pans, stray copies of Mrs. Worthington’s Wisdom.</p><p>“I knew it!” Charlotte cried in vindication. “I knew all along the thief had to be Miss Bertram.”</p><p>“I don’t think it was her,” Diana said. “I mean, obviously it was her . . . her pet. She must have left the rat behind last night while everyone went to Ambervale.”</p><p>“The little bastard’s over here,” Mr. Fosbury shouted. “In the kitchen.”</p><p>There was a crash of glass. Followed by an explosion of flour.</p><p>Mama crumpled into the nearest chair, her eyes rolling back in a dead faint. Just as well.</p><p>“Oh, please don’t kill him!” Miss Bertram sobbed. “He can’t help taking things. But he’s so intelligent. You don’t understand. Oh, Mr. Evermoore.”</p><p>Diana cringed at her sister. “ ‘No one understands our attachment.’ Isn’t that what she always said?”</p><p>Charlotte shuddered. “I don’t understand it, either. I don’t want to.”</p><p>The two of them laughed uneasily.</p><p>Of all the potential scandals that could have lessened Diana’s sordid revelation . . . this one would serve. Yes, she’d given her heart and her virtue to the local blacksmith. At least she wasn’t in love with a rat.</p><p>“Found it.” Aaron’s dark head popped up from the other side of the bar. He called to her. “I found the ring.”</p><p>Diana pushed through the crowd to meet him at the bar. But she couldn’t bear to remain separated from him, so she scrambled atop the counter on hands and knees.</p><p>He did the same.</p><p>They sat together, cross-legged atop the lacquered surface, while the wild rat hunt proceeded all around them.</p><p>Aaron huffed his breath, blowing a bit of flour off the jeweled setting. He shined the band with his sleeve. “I’d make a speech, but—”</p><p>She laughed and flicked a glance at the ongoing melee. “Just put it on, and quick.”</p><p>She offered her hand. He slid the ring on her finger.</p><p>“Oh, Aaron.” Emotion frayed her voice. “It’s beautiful.”</p><p>“Not as beautiful as you.”</p><p>He cupped her cheek in one of his strong workman’s hands and tilted her face to his.</p><p>And when he kissed her, the world went away.</p><p>“Wh- . . . Oh, where am I? Oh, my nerves.”</p><p>Diana winced, suddenly conscious of their surroundings. Her mother had revived just in time to see them embracing atop the bar counter, coated in flour and mud and soot, and locked in a deep, passionate kiss.</p><p>“Wonderful news, Mama.” Diana held up her left hand and waggled her ring finger. “I’m finally engaged.”</p><p>Her mother blinked at the ring. Blinked at Aaron.</p><p>And promptly fainted once again.</p><p>A few weeks later</p><p>“Are you very sure, my dear? It’s not too late to change your mind.”</p><p>Diana shook her head.</p><p>From the vestibule, she stood on tiptoe and peered down the long aisle of St. Ursula’s, festooned with bunting and posies of daffodils. All their family, friends, and neighbors sat crowding the pews in anticipation.</p><p>“Mama, the wedding will begin any moment. And it can’t start soon enough for me. I’m not going to change my mind.”</p><p>“I had to ask.” Her mother twisted a lace handkerchief in her hand. “I know you girls think me a silly, overwrought creature who thinks of nothing but marrying you to rich gentlemen. But it’s only because I love you so.”</p><p>Diana softened. “I know, Mama.”</p><p>“After we lost your father, I was anxious every moment. How would we live? Where would we go? How could I provide the best for you?” She dabbed at her eyes. “I only wanted to spare you girls the same nervousness.”</p><p>Diana’s heart twisted in her chest. “I understand. I do, and I love you for it. Please be happy for me today. I promise, you will never need to worry for me again. With Aaron, I will be loved and safe and protected. Always.”</p><p>“I suppose that is all I can ask.” Mama noisily blew her nose into the handkerchief. “Oh, but I had such dreams for you. My intuition insisted that one day a handsome duke would roll into this village in a splendid carriage, ready to choose his bride. But I suppose it’s not likely to happen.”</p><p>“I suppose not,” Diana said. “And even if it did, I would still marry Aaron.”</p><p>Mama grasped her hand and squeezed it fondly. “Mr. Dawes may not be a gentleman, but your ring is nicer than Minerva’s. There is that.”</p><p>Diana smiled. Some things never changed.</p><p>“Are we ready?” Colin Sandhurst, Lord Payne, appeared in the vestibule, looking as handsomely attired as always and quite ready to have this done.</p><p>He offered an arm to Mama and walked her down the aisle. Charlotte followed, fizzing with joy for her role as bridesmaid—or at least, for the new frock it occasioned.</p><p>Diana brought up the end of the procession.</p><p>As she walked down the grand, carpeted aisle, moving ever closer to the handsome, broad-shouldered figure at the front of the church, she saw their whole future painted for them in rich, stained-glass hues. They would marry here. They would make Christmas and Easter memories here. They would christen their children here.</p><p>If her arithmetic was correct, they could be doing that christening part in a little less than nine months. She hadn’t given Aaron any idea—it was too early yet to be sure. But she thought he might have formed his own suspicions.</p><p>As the organist played the last verse of the hymn, he drifted close. His strong arm brushed hers, and a shiver of delight passed through her. Strangely enough, she couldn’t gather the courage to look up at his face. Her whole heart would be in her eyes, she knew. And though her heart would be forever his by the end of this ceremony, she wanted to guard it just a few moments more.</p><p>“You are radiant,” he murmured. “And you look like a woman with a secret.”</p><p>“Just a little wedding present for you,” she whispered. “You’ll find out later.”</p><p>“Good. Because I have a present for us both.”</p><p>“Oh?”</p><p>He leaned and spoke in her ear. “I hired a cook.”</p><p>She had to clap her hand over her mouth to keep from laughing aloud. Oh, she loved him so.</p><p>“Who gives this woman to be married to this man?” The vicar looked to Lord Payne, who was standing in the first row.</p><p>Luckily, her brother-in-law remained enough of a scoundrel to be easily corrupted. As she’d asked of him, he remained silent.</p><p>“I do.” Diana looked up at Aaron and smiled. “I give myself.” </p> </body></html>"]