["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>“That’s grandpa’s sweet baby girl,” Joseph whispered as he nuzzled his only granddaughter, Jasmine. She coo’d up at him, while gripping his finger and tugging at his heart.</p><p>“Now that grandpa got your daddy and mommy married and gave grandpa you as an added bonus for Christmas last year, we have to start working on getting Uncle Alex a wife,” he continued talking, while tickling her tummy.</p><p>“I love you to pieces, Princess and I want a lot of cousins for you running around the house.” He continued talking to her as if she understood each and every word he was saying.</p> <p>“I sure didn’t get any thanks from your mom and dad for their marriage but of course I’m not looking for a bunch of praise. My boys finding good women and giving me many grandkids to spoil is thanks enough,” he said. He smiled with pure joy while looking at Jasmine.</p><p>“Of course, a little thank you wouldn’t be so bad,” he muttered quietly.</p><p>“Well, I guess I’m going a bit off course here, aren’t I? I’ve found the perfect bride for your Uncle Alex and I have a feeling we’ll see a cousin for you in a year or so.” He chuckled as he pictured Alex and Jessica together.</p><p>Joseph had known Jessica since she was a newborn. He knew she and Alex would be perfect together. It was simply a matter of getting them in the same room so nature could take its course.</p><p>Joseph thought about Alex’s playboy lifestyle. It was time that boy settled down and got married.</p> <p>Joseph loved his first granddaughter so much. His heart felt like it would burst when she was in his arms. He wanted that feeling with many, many more grandchildren.</p><p>“Joseph, did I just hear you plotting with your granddaughter about meddling in our son’s life?” Katherine said from outside the room, catching him off guard. He could hear the clear disapproval in her tone and knew he’d been caught.</p><p>“No, not at all dear,” Joseph said, as innocently as he could. “Jasmine and I were just discussing what a blessing she is in our lives,” he finished.</p><p>Katherine shook her head at her husband as she reached down to take their granddaughter into her arms. “Joseph, Jasmine is only three months old and isn’t discussing anything with you. She’s just happy to hear the sound of your voice, no matter what nonsense you’re spouting.” All sternness fell from her voice as she held the precious bundle close to her.</p><p>Katherine didn’t approve of her husband interfering in their children’s lives but she had to admit the end result of Lucas and Amy getting married and having precious little Jasmine was worth the troubles.</p><p>Joseph sighed at the sight of his beautiful wife holding their granddaughter. Life was certainly good. “Lucas will be back in a few minutes so help me get the baby changed,” Katherine said as she walked from the room.</p> <p>Joseph stood and looked at the picture on his wall. “Alex my boy, you are in for a surprise,” Joseph whispered to the frame so his wife wouldn’t overhear. He quietly chuckled to himself as he walked out of the door.</p><p>Chapter one</p><p>“Alex, good to see you,” Joseph said. He wrapped his arm around his son’s shoulders while leading him into the den.</p><p>“Hi Dad, sorry I haven’t made it home in a while. That contract in Spain took a lot longer than I thought. Of course, I’m not complaining because those beaches are hot and the women are even hotter,” he said with a laugh.</p><p>“Now son, there’s more to life than going out all the time and picking up pretty ladies who don’t have a lick of brains or an ounce of heart,” Joseph admonished.</p><p>Alex gave a hearty laugh. He knew his father wanted him and his brothers all married. He was more than a little suspicious Joseph had something to do with Lucas’s recent marriage. Lucas wasn’t complaining though. His wife, Amy was a true gem and their precious daughter was about the cutest thing there ever was.</p><p>“Dad, you know I’m far too young to tie the knot. I don’t need some woman in my life telling me what to do. I like having a lot of ladies to wine and dine. You don’t want to break the hearts of all the single ladies in Seattle, now do you,” Alex asked with far too much confidence, in his father’s opinion?</p><p>Joseph knew it would take a very strong woman to bring his middle child to his knees. Luckily, he figured, the right woman wasn’t far away.</p> <p>“Okay, I get it, you like the single life but you should know you’re breaking your mother’s heart. She wants many grandkids running through these cold hallways but children never think of their poor parents. After all, parents only sacrifice everything to raise their kids and bandage their wounds and love them unconditionally. There wouldn’t be any reason to want to give back to them, I guess,” Joseph said with a dramatic sigh.</p><p>Alex smiled at his father’s antics. He and his brothers were used to the whole guilt trip charade since Joseph had perfected it. “You know I appreciate everything you and mom do for me. That doesn’t mean I’m going to let you guilt me into getting married. I’m smarter than Lucas,” he said with a wink.</p><p>Joseph chuckled to himself. The harder they fought, the more satisfying it was when they fell, he figured.</p><p>“All right then, enough of this marriage talk,” Joseph conceded. “We have that fundraiser banquet this weekend and I need you to attend. Both of your brothers can’t because of previous engagements and it would look really bad for the company if at least one of my sons didn’t show up to our own fundraiser,” Joseph said, while acting like a martyr.</p><p>Alex hated going to those things. The people were boring with a capital B and it was all about being seen. He wished they could just give the money away without having to go through all the motions of a fundraiser. But he also knew millions of dollars could be raised in one night because the rich liked to be seen giving their money away. It made them feel self-important, he supposed.</p><p>“Just let me know when and where. You know I’ll go.” He sounded more like he was headed to the guillotine, instead of an evening with great food and dancing. On a positive note, he would most likely take a lady home for a steamy night of lovemaking. That was something to look forward too.</p><p>“It’s being held at the Fairmont Olympic Hotel on Friday night, starting at nine,” Joseph told him.</p><p>“Well, at least if I have to go out and act like I actually care about the newest and greatest fashions, I’ll be in a great place,” Alex said.</p><p>The Fairmont was spectacular inside and out. It was listed on the National Register of Historical Places and they’d done a fantastic job of bringing in the new designs without taking away from the old history. Alex enjoyed doing business there and he knew the food was going to be top quality. His mouth started watering a bit at the thought of having some Cedar Plank Smoked Salmon, one of their specialties.</p><p>“Oh, and keep an eye out for Jessica Sanders. She’s the daughter of my dear business associate John Sanders and she’s going to be there alone, as her father’s out of town.”</p><p>“Dad, what have I told you about matchmaking? I can choose my own dates,” Alex said, losing some of his patience. He didn’t want to be set up. Marriage was simply not in the cards for him and in no way did he want kids. He idolized his gorgeous niece but the family thing was for Lucas, not him. He was still young at thirty-two years old and he wasn’t ready to trade in the Lamborghini for a mini-van. He shuddered at the thought.</p><p>“I’m not trying to be a matchmaker. I didn’t ask you to take her to the fundraiser. I simply asked you to keep an eye on her and say hello; maybe ask her for a dance. She’s not from around here and her father said she isn’t used to huge events. She normally avoids them at all costs but this fundraiser is something very important to her. She’s always wanted to spend an evening at the Fairmont. Here’s a couple of pictures so you can recognize her,” Joseph said while holding them out.</p><p>Alex reached for the photos, just for the sake of curiosity. He looked down and was surprised at how attractive she was. She wasn’t the typical socialite he was used to. Her features seemed softer, more inviting. One of the pictures was her and her father. She had her head thrown back in laughter, while her eyes were rounded, causing a sparkle to shine through the still shot.</p><p>Alex may have to change his mind and at least meet the woman but he was sure she’d turn out to be just as fake as the rest of them. A picture may be able to capture an unguarded moment but from his experience, all women had an agenda. He didn’t see how she could be any different from the rest.</p><p>Jessica walked down the wide staircase, admiring the beautiful golden railing with its intricate design. She had a mixture of feelings running through her. She hated parties that masqueraded themselves as fundraisers. They were only an excuse for the rich to rub elbows and talk about who had the most money. On the other hand, she’d always wanted to come to the Fairmont.</p><p>It was steeped in history and there were so many areas to explore. The room she’d rented had a spectacular view of the gardens. It was decorated to look more like a guest room in a distinguished home.</p><p>She’d walked into the suite to the smell of fresh cut flowers and the sight of a bowl overflowing with fruit. Alongside that had been a bottle of champagne chilling in a bucket of ice. The bed was beautifully made with a note from the staff, welcoming her and offering any assistance.</p><p>Jessica was used to the red carpet treatment, which wasn’t always as great as people seemed to believe it was. When your father was a millionaire, you never knew who liked you for you or who liked you for what they could get out of your father. Every place she went people would do all they could to accommodate her but it was usually a double edged sword.</p><p>After her last tragic break-up she’d decided to forgo relationships altogether. She was tired of her heart being broken. Her last boyfriend had seemed like the perfect man. Thinking about him was a painful experience but she couldn’t seem to stop herself.</p><p>He’d ridden into her life like a knight in shining armor and she’d fallen for him hard and fast. When he spoke, he said all the right things. He also romanced her unlike any other man she’d known. She’d been relieved he was wealthy because she didn’t think he was gaining anything by being with her. To her, the love seemed genuine. She couldn’t have been more wrong.</p><p>He courted her because his company was going under from the millions he’d gambled and lost. He figured if he snatched her up, he could go into business with her father and save himself. His plan would’ve worked too, as she was blinded by his games. She would’ve remained blind if she hadn’t gotten home early from a trip to find him in bed with the maid.</p><p>When she walked into her bedroom and saw the two of them wrapped in each other’s arms, on her bed, she quickly shut the door and walked out of the house. She thought he respected and loved her enough to wait to have sex until their wedding day. He never desired her in the first place and the waiting had turned out to be a blessing in disguise for him, as the ‘maid’ he’d hired was really his long-time girlfriend.</p><p>Jessica snapped back to the present and walked into the ballroom. She wasn’t easily impressed but tonight was an exception. Every detail of the room was exquisite. There were several chandeliers hanging at least three feet down and almost equally as wide. The crystals dripping from them were shooting off prisms of light in every direction. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The linen covered tables held only the finest dinnerware and the candles were creating a soft glow from the centerpieces. The room had the added appeal of strategically placed tall shrubs, offering privacy if a couple chose to sneak behind one.</p><p>Jessica was feeling more positive about the evening ahead. It was a beautiful night and the organization she often donated to, the National Center for Missing &amp; Exploited Children (NCMEC), was going to receive a substantial amount of money. She’d already decided to enjoy herself. Later she could return to her boring life.</p><p>She sat down at one of the tables and before she knew it, her dinner was finished and she found she was having a delightful time speaking with a few of the other guests. When an older gentleman asked her to dance she gladly accepted. They weren’t on the dance floor for long when they were interrupted.</p><p>“May I cut in?”</p> <p>Even though the words came out a question, Jessica had no doubt they were a command. The gentleman she was dancing with heard it as well and stepped aside without a word. Jessica didn’t like men who were so overconfident that they felt they deserved anything they wanted. She wouldn’t cause a scene though. Besides, the man was intriguing, so she allowed him to take her into his arms.</p><p>As she placed one of her hands in his and the other on his shoulder, she could feel the raw power of his hold. He had the most piercing beautiful blue eyes she’d ever seen. They were the kind of eyes that could penetrate straight into your soul. She would have to be on her guard with him.</p><p>Suddenly it clicked who the man was; Alex Anderson. Their fathers did a lot of business together. This man with the entrancing eyes, kissable mouth and sexy body, was a playboy unlike any other.</p><p>He was known to be ‘uncatchable’, as the single ladies put it. He dated many women but made it clear he wouldn’t settle down. His grin had graced hundreds of magazine covers, making women both young and old, lose a bit of sleep at night over erotic thoughts of him.</p><p>Her heart was racing as they played a game of cat and mouse. He kept attempting to pull her body intimately into his, while she was concentrating on keeping the proper amount of distance between them. If she wasn’t on a self-imposed leave of men she could easily consider a night of flirting with him. She shook her head to clear it and decided to just get through the dance so she could move on as quickly as possible.</p> <p>His smoldering blue eyes flashed into hers, as his perfectly sculpted lips turned up into a sexy as sin smile. He knew he was hard to resist and he seemed to be treating her to his full arsenal of charms.</p><p>He slowly brought her fingers to his mouth and ran his lips across her knuckles. She felt a shudder ripple through her body. He then flicked his tongue across the same spot and desire pooled deep inside of her. “I’m Alex Anderson, and you’re intriguing,” he finally whispered to her.</p><p>“Jessica Sanders but I’m assuming you already know that,” she replied.</p><p>The hotel was everything she could’ve ever imagined but it dimmed in comparison to the man holding her. While she was in his arms, the rest of the people and even the room itself seemed to disappear. She knew he was dangerous and she was playing a game with him she couldn’t possibly win but for some reason she wasn’t able to pull away.</p><p>The man was intoxicating. As he spun her around the barely lit dance floor, she was sinking further into his spell. She could feel the solid muscles beneath her fingertips and his scent was spell-binding. It was a combination of his masculinity, enhanced by expensive cologne.</p><p>“I haven’t had someone cut in on a dance since I was in high school. Don’t you see that as a little overzealous?” she asked, raising her brow. “Perhaps I didn’t wish to dance with you but didn’t want to cause a scene,” she added sweetly.</p> <p>“Not at all,” he answered.</p><p>Jessica raised her eyebrows at him questioningly and waited.</p><p>“I don’t think it was at all presumptuous to cut in on the dance. You were barely keeping your eyes open; the boredom of your partner was so overwhelming. So you see, I should be thanked for saving you from the tediousness of a boring partner,” Alex said with a grin, which left her speechless.</p><p>He spun her around the dance floor, undressing her with his eyes. She was shouting to herself to end the dance but she couldn’t seem to pull away from him. He was too compelling. Besides, she thought to herself, they were in a room full of people. What could possibly happen? She decided to enjoy the flirtation.</p><p>“You’re so unbelievably stunning. We can leave this dance now and head up to my suite,” he offered with the confidence of a man used to being told yes.</p><p>She laughed nervously before replying, “I don’t think so.”</p><p>He rubbed his hand from the center of her back, dangerously low, then back up again, causing a rush of heat to flash through the center of her body. He was challenging her to take a chance, from the brush of his hands, to the look in his eyes. She was surprised by how badly she wanted to take him up on the offer. If nothing else, she was enjoying the sexual play.</p><p>“I think we should end this dance now,” she stated a bit breathlessly. She didn’t know how much more she could take before caving in to him.</p> <p>“But our song hasn’t ended yet,” he said as he pushed the small of her back, bringing her hips into contact with his obvious arousal. He then brought his head down to the exposed skin of her neck, running kisses, along with some gentle nips, across her pounding pulse.</p><p>If he hadn’t been holding her so closely, her knees would’ve buckled, melting her into a pool at his feet. He moved his mouth over her ear and whispered, “When you’re lying beneath me, I’ll have you trembling as my hands and mouth turn your body into liquid fire. You’ll be calling out my name, begging me to finish this.”</p><p>Jessica gasped, as his words made her tremble uncontrollably. She’d never been seduced like this before, let alone in a crowded room. If they’d been alone, she would’ve let him take her right then and there, giving up on her vow of waiting until marriage. She tried to gather her wits about her.</p><p>“Have you been told before how arrogant you are?” she tried to make her voice stern but was bellied by the fact that it was choked with arousal.</p><p>“No, just how good I am,” Alex answered, with that same arrogance.</p><p>The comment was able to bring her a little closer to reality. “You need to stop this. People are beginning to stare at us,” she whispered self-consciously.</p><p>“Let them stare. They’re only wishing they could trade places with me,” he said, while running his lips back up her neck and across her cheek, to the corner of her mouth, where he flicked his tongue out along her bottom lip.</p><p>She allowed herself to run her fingers through his hair, neck and finally shoulder, before she took a step back. “Thank you for the dance Mr. Anderson,” she said politely, as if they hadn’t almost been making love on the dance floor in front of a crowd.</p><p>“The pleasure was all mine Jessica and after what we just shared don’t you think it’s a little formal to be calling me by my last name,” he said with mockery.</p><p>“Mr. Anderson,” she emphasized, “there are plenty of women here who would be more than willing to play a game or two with you tonight. I’m not one of them.” She turned and walked away, though it took all of her will-power not to glance back around to drink him in one last time.</p><p>Alex stood there, enjoying the sway of her hips as she walked away. Damn she was hot and he wouldn’t mind a night with her. Her body had responded eagerly to his touches and he knew she was just as bothered as him. He wasn’t done with Jessica Sanders; she just didn’t realize yet when he decided he wanted something, he always got it. Her denial was like a red flag to a bull. By the end of the evening she would be in his bed. He needed a drink right then though, or the entire room would know how badly he wanted her.</p><p>Jessica ordered a martini and guzzled it down, trying desperately to calm her nerves. The man should have a danger sign attached to him. Her legs were still weak with arousal and her breathing still hadn’t normalized. She was getting out of there as soon as it was politely acceptable.</p><p>She stepped out from the patio doors and was almost lifted up by the strong wind. It was blowing so hard it actually took her breath away. She stood there for a few minutes and watched as lightening slashed across the sky.</p><p>She loved adverse weather. Her family thought she was crazy because as everyone else was running for cover, she would grab a chair to watch the show. She delighted in the smells, sights, sounds and excitement of a great storm.</p><p>After a few minutes, the wind got even stronger and she decided she’d better head in before she looked like she’d taken a ride in a tornado. She stepped back through the doors, unaware Alex had watched both her exit and return.</p><p>If she hadn’t come in when she did, he would’ve gone out after her. When she walked through the doors, he had eyes for her alone. She looked more gorgeous than ever before. Some of her hair had escaped the tight confines of her bun and her cheeks were flushed red. She looked as if she’d just crawled out of his bed after a night of lovemaking.</p><p>He tried not to think about her or look for her but his gaze kept seeking her out. He rejected several women, who made it more than clear they’d be willing to warm his bed that night. He only wanted one woman to do that and the rest of the women in the room paled in comparison to her.</p><p>Jessica made small talk with several people, only half listening, for the next couple of hours. Her head was starting to get fuzzy from the number of drinks she was consuming. She normally only had one or two at most. She didn’t like to alter her reality but tonight was different and she needed some liquid courage to make it through the evening.</p><p>Alex seemed to find her no matter where she was and their eyes connected throughout the evening. She noticed many women trying to gain his attention but he brushed them off, one after the other. Finally with about a half hour to go, he took a woman out on the dance floor and then stayed with her. Jessica was surprised by the slight jealousy she felt as the other woman tossed her head back in laughter.</p><p>Jessica tried to tell herself it was a good thing. She wasn’t into one night stands and Alex wasn’t the type to enter into a long term commitment. She wasn’t looking for that anyway. Someday she would settle down but it would be a battle to find someone who wanted her and not what her father could give him.</p><p>She finally had enough and decided to head for her room. She headed towards the elevators. It was time to sleep the night off and then get out of the hotel and as far from Alex Anderson as she possibly could.</p><p>The doors on the elevator were just about to shut. She picked up her pace and called, “please hold the doors.” She was relieved to see a hand stop them from shutting.</p><p>“Thank you,” she said a bit breathlessly.</p><p>She slipped inside, looking towards the ground so she wouldn’t trip on her long dress. When the doors closed, she finally looked up, noticing who the other occupant was.</p><p>She moved away from him quickly, into the furthest corner of the elevator. The ride would only last a moment and then she’d be blessedly alone in her room. He kept his eyes on her, making her start to feel uncomfortably aware they were alone in a very small space. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She stared anywhere she could but at him, knowing that his eyes were still focused on her. She figured she must be a mess; she’d consumed way too much alcohol and the wind had blown her hair loose with several strands refusing to cooperate, repeatedly falling across her face.</p><p>Just when she didn’t think the silence could become any more awkward, there was a flickering of the lights, followed by darkness. There was nothing. No music coming through the speakers, no light whatsoever, not even from the buttons.</p><p>Jessica could feel her heart pounding so hard she was sure the noise of it hitting her ribs could be heard by Alex.</p><p>“Jessica, are you alright?” he asked her. “You aren’t claustrophobic, are you?”</p> <p>She took a couple of deep breaths before she said, “I’m not afraid of small places but I’m not a huge fan of the dark.” She was trying to stay brave but the seconds were ticking by and the pure blackness felt like it was closing in on her.</p><p>She wouldn’t panic. The lights would flash back on at any moment and the elevator would continue going up, getting her out of the blackout. She started counting in her head. She reached twenty when she felt Alex’s hand on her arm.</p><p>She jumped at his touch. She was trying so hard not to be frightened but the darkness was all consuming.</p><p>“Everything will be okay. This will all be over in a moment. Buildings have contingency plans for when this kind of thing happens,” he tried to reassure her.</p><p>“I don’t understand why there isn’t any noise at all,” she said as her voice shook.</p> <p>“We’re most likely around the fourth floor so there wouldn’t be any noise from the lobby,” he reasoned. “I wonder what happened.”</p><p>“I went out earlier in the evening and there was a pretty spectacular storm outside. A power line most likely got knocked over,” she said. Talking to him was making a little of her fear subside and his touch on her arm let her know she wasn’t alone.</p><p>“I’m going to feel around for the phone and see if I can get someone on the line. They need to know we’re in here and I can find out what’s happening,” he explained before releasing her arm. She had to fight herself so she wouldn’t reach out and grab him.</p><p>She sunk to the floor and hugged her knees to her chest. She was grateful now she’d had a few extra drinks because it was the only thing calming her nerves.</p><p>“The phone isn’t picking up.” Alex’s voice startled her. “We’re going to have to wait this out but don’t worry, elevators are extremely secure and it won’t take them long to get us out.”</p><p>His voice drew closer and then his foot kicked her in the ribs. She let out a whoosh of breath. “I’m sorry, are you okay?” he dropped to his knees and began running his hands from her legs up to her side. Her lungs exploded in a gasp, as heat pooled in her core.</p> <p>“I’m fine, really, you barely touched me at all,” she said huskily. He seemed to realize what he was doing because his hands stilled suddenly and then they were gone. She breathed another sigh, not sure if it was relief or disappointment.</p><p>Alex could hear the huskiness in her voice and it sent a kick right to his gut. He wanted her badly and now they were alone...in the dark...for who knew how long. If he didn’t keep his distance he wouldn’t be responsible for what happened next.</p><p>“How long do you think it’ll take for them to get us out?” she asked, trying to fill the silence.</p><p>“It won’t take long. Did you enjoy yourself this evening? I think half a million was raised by the time I left,” he said, seeming to know she needed the comfort of words to fill the void.</p><p>She didn’t speak for several moments and he started to wonder if she was having a panic attack. He really hoped not. He didn’t know how to deal with hysterical women.</p><p>“You know, we really are safe Jessica. These things don’t just plunge through the shaft and explode on the bottom, like in the movies. That’s just Hollywood’s way of making things exciting,” he said in an attempt to comfort her.</p><p>When she still didn’t speak, he moved next to her again and let his leg rest against hers. Her body seemed to relax and he heard her breath escape in a sigh.</p><p>“Sorry. I just really don’t like the dark,” she finally said to him. “What do you do in your free time?” she asked, needing to hear the sound of his voice.</p> <p>“I like to travel. I handle most of our international business, because my older brother has so much work to do here and Mark would choose to never fly if he could get away with it. I, on the other hand, am happy to be in a different country each month. My father usually has to drag me home,” he said with a chuckle.</p><p>He was noticing lately though he was staying home more often. He’d started to really miss his family. He was even finding himself enjoying the time spent on his brother’s ranch, herding cattle.</p><p>Many things that had once excited him were starting to lose their appeal. He figured he was just getting older. Of course he was only thirty-two and shouldn’t be thinking of himself as aging. “What about you? What makes Jessica happy?”</p><p>“I used to travel a lot with my father but I grew bored of it. I’m really more of a homebody now. I do a lot of volunteer work which keeps me plenty busy. I’ve been taking some courses at the college, nothing major, just some fun art, cooking and photography classes. I have a Masters degree in Business because my father wanted me to go into the family corporation but I can’t stand sitting behind a desk all day,” she trailed off.</p><p>Alex was surprised she’d gone so far in school. Most of the ladies he knew, with her amount of money at their disposal, didn’t feel a need to go to school. They just lived on their parents’ money and name until they snagged themselves a rich husband.</p><p>Jessica sat there, extremely aware of Alex’s leg pressed up against hers. She was incredibly attracted to him but it didn’t matter because men like him didn’t give her the time of day except for a quick trip to bed. He was far too sexy and masculine for her. They always went after the ditzy blondes with huge breasts and no brains. The kind of woman like the bleach-blonde she’d seen him dancing with earlier that evening. The kind of woman who they considered a trophy for their arms.</p><p>She wouldn’t reveal to him how her heart ached to be loved for herself and not her money. She wanted to be desired and to be the only thing on a man’s mind. More silence engulfed them, making her hyper aware of his scent. It would be so easy to lean into him and find some comfort.</p><p>The elevator made a groaning sound and jerked slightly. Jessica let out a gasp and then she locked her arms around Alex, shaking in fear. She was going to die in the dark, tiny box.</p><p>“It’s okay Jessica, the elevator’s just settling a bit. I promise you it won’t fall. There are several back-up safety features for all emergencies. Even if it did fall, which I guarantee you it won’t, we’d get a little bruised up in the worst case scenario. You have nothing to worry about.” He pulled her onto his lap and wrapped his arms around her trembling body.</p><p>He kept speaking in a soothing whisper and stroked her from the small of her spine, up to her neck and back down again. She didn’t know if it was his words or the touch of his hands but soon she wasn’t so afraid.</p><p>“I really am sorry Alex. I’ve just always had a fear of the dark. Believe it or not, I still have a small light on at my place. I know logically that nothing is going to come and get me from the dark but I think I watched far too many Stephen King movies as a child and they stuck with me,” she said with a little self depreciating laugh.</p><p>They began talking about different topics, just passing the time. He didn’t push her aside and she didn’t offer to move from his lap. She knew she probably should but she felt so much comfort sitting there she couldn’t will herself to move.</p><p>After more time passed the rubbing stopped comforting her and started making heat pool inside her stomach. His hands were traveling lower with each pass and more wide spread. She could feel him touching the sides of her breasts, stomach and hips. She started breathing heavier and could feel her body becoming more aroused.</p><p>She felt his hand run up her neck and grip the back of her head. He turned her and then his lips were finally pressed against hers. She would’ve thought the heat from their lips colliding would’ve been enough to sear the walls.</p><p>His tongue slipped inside her mouth and her body exploded with pleasure. She’d never been kissed so hungrily. The passion in his kiss left no doubts he would be a fantastic lover. She knew she needed to stop them from continuing. She was trying to gain the will-power to pull away when his hand slid up under her skirt and skimmed her bare hip. The only thing between his hands and her heated core was a wisp of fabric, which she was surprised hadn’t melted away from the burning of her body.</p><p>Without breaking the kiss he shifted her body so she was straddling his lap, allowing his hands more access to explore her. His hands roamed all over, making her arch into him. She could feel his desire pressing against her aching heat and she damned the clothes keeping them apart.</p><p>She gave into her own internal battle and let herself feel everything he was doing to her. He ran his tongue from her mouth to her neck, gently biting at her pounding pulse point. She wiggled against him while he slowly slid the thin strap of her dress down her shoulder, with his lips following its process.</p><p>She felt the cool air touch her aching nipples only seconds before his mouth was lavishing the hardened peaks. She threw her head back and groaned as rolling waves of sensation washed through her. He thoroughly loved her tender breasts before his mouth licked and kissed its way back up her neck and then fastened onto her lips once more.</p><p>While he continued kissing her she felt him shifting their clothing around. Finally, there was nothing between them and he was enclosed within her in one swift thrust. She gasped out loud at the unbelievable pleasure of their joined bodies. He gripped her hips, leading her up and down on his large erection. She quickly took over and started moving, encouraged by his quickly accelerated breathing. He held her head with one hand, pulling her closer, sealing their mouths, mimicking the movements of their bodies with his tongue. He brought his other hand to her swollen womanhood and flicked it, sending her over the edge in an explosion of pleasure.</p><p>She began shaking around him, gripping him even tighter into her pulsating body. He grabbed her lower back and thrust up into her one final time, letting out a groan of pleasure as he spilled his seed deep inside of her.</p><p>Jessica collapsed against him as they both tried to regain their breath. They were still connected together. She was so satisfied she wanted nothing more than to lay her head against his chest and fall asleep in his arms.</p><p>There was another jerk of the elevator and then the lights flickered. She jumped off him in a panic, quickly straightening out her clothing. Luckily, he’d only taken the time to move her clothes instead of removing them. She backed away until she felt the wall behind her. She prayed he was putting his clothes back into place too.</p><p>Suddenly the lights turned back on and stayed on. Jessica was happy to see him standing there, fully clothed. He had a look of guilt and regret on his face. The elevator started to move downward. It must be standard procedure to return to the lobby after a power failure. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Look, Jessica...” he began when the door whisked open. She didn’t want to hear him make excuses about how sorry he was and how he wouldn’t be calling her. She couldn’t take that kind of rejection. What had been amazing and wonderful for her had most likely been a disappointment for him. She couldn’t listen to him try and downplay what had happened.</p><p>Jessica jumped out of the elevator into the crowd milling around the lobby and quickly was lost from Alex’s sight. He thought about chasing her down but decided to let her go. He’d never felt more excitement in the arms of a woman. It had been passionate and thrilling and he wanted to do it all over again.</p><p>It was obvious she already regretted what had taken place so it was better to try and forget all about the incident and move on. He quickly cut through the crowd and headed up to his room where he fell into a deep sleep.</p><p>The next morning Alex grabbed his things and checked out, thinking his time in the elevator with Jessica wouldn’t be something he’d forget about anytime soon. He knew that she’d been scared and if he tried to chase her she’d run away even faster.</p> <p>Chapter Two</p><p>One Year Later</p><p>Joseph was meeting his good friend John for lunch. It’d been far too long since they’d gotten together. “Joseph, so good to see you,” John said as he grasped his friends hand.</p><p>“Great to see you too. Tell me how things have been.”</p><p>“Everything is great. I have a new grandson who’s the light of my world. Here, I brought some pictures. Look how handsome he is,” the proud grandfather said as he handed over several photos.</p> <p>“Congratulations, he’s a mighty fine looking boy. Did Jessica get married?” Joseph asked, knowing he hadn’t heard of any nuptials but it could’ve been done privately. Joseph was still upset that she and Alex hadn’t ended up together. He’d been so sure they were a perfect match.</p><p>“No, she won’t discuss the father. I’ve tried on several occasions to ask her about it and she closes right up. She said it was a one-time thing. The father didn’t know and she was keeping it that way. I tried to bribe her, threaten her and beg her, all to no avail. She’s being tight lipped about the whole incident,” John said with frustration.</p><p>“Was she seeing anyone around the time of her pregnancy that you could possibly question?” Joseph asked with sympathy towards his friend. He knew that if one of his sons got a lady pregnant he’d expect them to do the right thing. Hell, he hoped he’d raised them well enough that they’d do the right thing because it was what you did, not because it was expected from you.</p><p>“She hasn’t been in a relationship for a few years that I know of. She’s been hurt pretty badly. Her last serious relationship ended when she found the guy with another woman. She found out he’d been like many others before him and only after money,” he said with pain. John loved his daughter and it killed him to see her hurting.</p><p>“How old is the baby? Maybe somehow I can help you figure this out,” Joseph offered, although he didn’t have a lot of confidence in the plan.</p><p>“Jacob is three months and father or no father, he’s amazing. I’m so grateful he’s been given to us. Jessica adores him. She loves being a mother and it’s lifted her out of the depression she was in for so long,” John said, instantly brightening up.</p> <p>“She was in a depression?”</p><p>“It all started after that big fundraiser dinner last year at the Fairmont. She came home for a while and was so sad. I was actually a little relieved when she announced her pregnancy because she started taking better care of herself,” John said with a sigh.</p><p>Joseph sat up, on instant alert. “Can I see those pictures again John?”</p><p>John was more than willing to share the pictures as many times as they were requested. This time when Joseph examined the photos before him he looked closely at the features. There was a real possibility that he was Alex’s son.</p><p>“John, has she given you any clues about the father?”</p><p>John was picking up on Joseph’s changed demeanor. “Do you think it could be one of your boys?” he asked with hope. John knew if it was either Alex or Mark, they’d step up and do the honorable thing.</p><p>“I think there’s a chance that he could be Alex’s. He was at that fundraiser and I’d asked him to look after Jessica since she was there alone. After the event, he came home and wasn’t himself not even going out. Then after a couple of months he went completely the opposite way and it seemed like he couldn’t get far enough away, like he was trying to outrun some demons or something,” Joseph finished softly.</p><p>“The only time she ever let something slip was to say that it was only one night and the guy hadn’t mistreated her in any way. She told me she’d made a mistake and wouldn’t make him sacrifice his life due to her indiscretion. I told her the father at least had the right to know and he certainly should own up to his responsibilities but she closed down after that and wouldn’t make any more comments on the subject.”</p> <p>“I think we can get the answer of whether it’s Alex’s or not if I can see her and the child. I think we’ll be able to tell, from her reaction alone,” Joseph said with excitement. The possibility of having another grandchild was exhilarating.</p><p>“She’s coming over to dinner tonight. Why don’t you and Katherine join us?” John spoke with eager excitement.</p><p>“It’s a plan. John, if Alex is the father please don’t say anything tonight. Let me tell my son. I know he’ll do the right thing and I don’t want Jessica to think you or I forced him into it,” Joseph asked of his longtime friend.</p><p>“I can respect that and honor your wishes. I have no doubts Alex will take responsibility for any child of his,” John said with sincerity. “Joseph, I’m really sorry if he’s the father and she didn’t say anything. I’m sure she believed she was doing the right thing,” John finished sadly.</p><p>“I’ve known Jessica since she was a little girl John and I know that she would’ve had valid reasons for keeping this to herself. She most likely thought she was doing Alex a favor, since he hasn’t exactly portrayed himself as the stay-at-home with babies’ kind of guy,” Joseph admitted. “But I know if he’s a father, he’ll make a good one. I have to admit I’m really hoping the baby is his son because that means I have my first grandson,” he said with a smile.</p><p>They finished their lunch and went their separate ways, both anticipating the evening ahead. They’d receive answers to questions too long unanswered.</p><p>Joseph made sure to arrive before Jessica. When she walked into the dining room and saw Katherine and him sitting there, her face gave her away. She only took about two seconds to compose her features again and then greet his wife and him but in that unguarded moment, John and Joseph both had their answer.</p><p>Joseph and Katherine both admired the baby, taking turns holding him. Katherine didn’t know what was going on but she was drawn to the boy. She was reluctant to release Jacob at the end of the evening.</p><p>Jessica had a few tears in her eyes as she collected her son and left the house. She’d made a joke about post pardon blues. Joseph figured she was feeling some guilt about keeping the baby away. He knew if they all stood back and waited she’d come around on her own. She was simply too kind a person to keep her child away from grandparents that would love him.</p><p>Neither Joseph nor John were patient though and they weren’t going to wait for her to come around. Alex was going to find out he was a father as soon as Joseph summoned him home.</p><p>Joseph had been hopeful last year Alex and Jessica would have an instant connection. He’d been disappointed when his son came home and didn’t say one word about her.</p><p>He’d then gotten his hopes up once more as he’d watched his son moping about and not in a hurry to travel off to faraway places. But after a month Alex started disappearing again and seemed to return to normal.</p><p>After lunch with John, Joseph knew why his son had been so down and out. Alex still had that void look about him but that was about to change. Alex walked in the door, not looking pleased that Joseph had asked him to rush home.</p><p>“You better sit down Alex. I have some news that’s about to change your life,” Joseph informed him. He wanted to get right to the point and didn’t try to ease into things by making small talk.</p><p>“Just spit it out dad. I had a twenty-hour flight and didn’t get any sleep. I want a hot meal and to fall face first into bed,” Alex spoke wearily.</p><p>“You’re a father,” Joseph stated without adding anything else.</p><p>Alex stared at his dad, waiting for the punch line. They stayed there; eyes locked together, neither speaking for a full minute.</p><p>“Do you care to elaborate?” Alex finally asked.</p><p>“I met your child a couple days ago. You have a three month old son,” was the only elaboration he gave.</p><p>“That’s impossible...” he began, when he suddenly stopped. Joseph could see the wheels turning in his head.</p><p>Alex started thinking back to his night in the elevator with Jessica. He’d only had unprotected sex one time in his life. He began doing math in his head and the time-line fit.</p><p>Alex’s legs could no longer support him. He sank into the chair that was mercifully behind him. “Why...why wouldn’t she tell me?” he managed to squeeze out of his constricted throat.</p><p>“I don’t know the why or how’s. All I know is I met your son and I knew. Would you like to see a picture?”</p><p>“Please.”</p><p>Joseph passed the pictures John had given him, without saying another word. Alex stared down at them and when he finally looked back up there were tears in his eyes. “He really is mine. I’m a father.” He placed his head in his hands and let it all sink in.</p><p>It didn’t take Alex long to go from shock to anger. How dare Jessica keep his son from him? He hadn’t mistreated her in any way and she had no right to keep something this big from him. She would explain herself and he wouldn’t miss out on any more of his son’s life. He couldn’t believe he’d be holding him in just a few minutes. The miles stretched on, as he weaved through traffic on the way to her apartment.</p><p>She was living in a secure complex. It didn’t take him long to get clearance to head up to her door though. When you were as well known as his family, you knew just about everyone. He took a few deep breaths to calm himself. He then knocked on her door and waited as the seconds ticked by, seeming more like hours. Finally she was standing in front of him, her eyes wide with shock and fear.</p><p>“Where’s my son?” Alex had already missed out on too much time and he wasn’t going to mince words.</p><p>There was no hello, it’s been so long. How are you? He wasn’t beating around the bush. He was tired and angry. He couldn’t believe she would dare to keep his child from him. Sure, he hadn’t bothered to call her but he had reasons for that.</p><p>She’d affected him unlike any other woman before her and he hadn’t trusted himself around her. Even with anger coursing through him she was the most beautiful sight he’d ever witnessed. Her hair was longer and thrown into a messy bun with several pieces cascading down her face and neck. She didn’t have a single trace of make-up on and there were smudges under her eyes from lack of sleep. She also had a glow about her that was beautiful. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jessica was petrified. How had he found out? She’d been terrified the other night when she saw Joseph and Katherine but they hadn’t seemed to know the baby was their grandson. She couldn’t figure out how Alex knew.</p><p>He looked more incredible than ever. He seemed tired and his dark hair was mussed. It looked as if he’d run his hands through it a dozen times. His face had a sexy five o’ clock shadow, making him seem more touchable. His scent was invading her and she realized she’d missed him far more than she should. She thought about him often. Of course, how could she now when she looked at her son daily? He looked so much like his father, especially in the eyes.</p><p>“Alex, what are you doing here?” she finally asked, trying to sound neutral.</p><p>He chose to ignore her question and repeated his, “I asked you, where is my son?” He wasn’t known for having a great deal of patience. He wasn’t going to stand in the doorway and miss another moment of his son’s life.</p> <p>Before she was able to say anything more he heard a cry from inside the apartment. His eyes rounded with wonder at the first sound he heard from his son. He was done standing in the doorway. He grabbed Jessica by the waist and physically removed her from his path.</p><p>Jessica let out a shocked gasp and then chased after him as he followed the sound of his son’s cry. “Alex, I did have a son but he isn’t yours,” she tried to lie. He’d reached the swing his son was in by that moment, staring in fascination at the tiny human.</p><p>The baby was wide awake and staring at his father, momentarily distracted from his angry howls at being left alone. At her words Alex whipped his head around to glare at her. She took a step backwards at the violence in his expression.</p><p>“Don’t lie to me for one more second. You’ve already stolen three months of my son’s life from me. You won’t deceive me anymore,” he spat.</p><p>She knew to try and deny it again would only unleash more of his anger so she sank to the couch as her knees would no longer hold her up. She said nothing else, just watched as he stared at his son. The baby finally got tired of the staring game and let out a cry of displeasure. He wanted to be picked up.</p> <p>Jessica started to rise but Alex was already taking care of it. “Hey little guy, you want your daddy to pick you up?” he lovingly spoke to his son. The adoration in Alex’s voice brought tears to her eyes. He unlatched the safety belt and gently pulled Jacob from the seat.</p><p>Alex cuddled Jacob close to his chest, staring into his face. He was amazed at the love flowing through him. How could something so small fully claim his soul in the space of a single heart beat? He had no doubts that this was his boy. He looked like an Anderson. Jessica had a lot to answer for.</p><p>He sat down on the other end of the couch and softly spoke to his son. The baby looked up at him and cooed for a while, before his face scrunched up and he let out another full-fledged roar of displeasure. Alex turned to Jessica with a worried look on his face. “What is it?” he asked with concern.</p><p>“He’s hungry. Give him to me and I’ll take care of his dinner,” she said, reaching her arms out. She could feel the milk dropping in her breasts and she needed to feed him as much as he wanted food. She was going to embarrass herself at any moment by leaking through her thin shirt.</p><p>“I’ll feed him. Just grab me a bottle,” Alex said, not wanting to release his son.</p><p>Jessica looked uncomfortable and then Alex noticed the wetness on her shirt. His groin tightened as the thin fabric wasn’t hiding anything from his view. Her wet nipples were clearly showing through. He didn’t say another word. He handed the baby over to her, then got up and walked out of the room giving her privacy.</p> <p>Jessica was relieved when he left. She quickly quieted the baby and it brought a smile to her face. Her son took no time latching on and he always let out a little growl that seemed to say, finally mom, I was so hungry. Jacob was so much like his father. He had little patience when he wanted something.</p><p>She enjoyed these moments, brushing her precious son’s head while he filled up. He closed his eyes in concentration and made little gulping noises. She leaned her head back against the couch and sighed. She tried to convince herself she’d imagined that look of instant lust in Alex’s eyes but she’d felt the same sensation.</p><p>Even in his anger towards her, which she knew he was feeling, he’d still felt desire and that reminded her how lonely she’d been herself. As much as she loved her son, it would’ve been nice to have someone to share those precious moments. She shook herself out of those kind of thoughts and focused on Jacob.</p><p>Alex wandered into his son’s nursery. She’d done a beautiful job of decorating it. There were hand painted stencils on the walls of various teddy bears in all kinds of pastel colors. He walked over to the crib and ran his hand along the quilt his son slept under every night. He looked at the wall and the breath rushed out of his lungs.</p><p>There on the wall, visible to his son was a frame with several pictures of him in it. He knew the baby was too young to recognize people but it filled his heart with joy that she’d thought to let his son know who he was. Some of his anger slipped away.</p><p>He couldn’t stand to stay away any longer. He quietly walked out of the nursery. He stepped into the living room in time to hear Jacob let out a loud burp, which Jessica praised. Then she cradled him back into her arms and he watched as he latched onto her breast.</p><p>Alex felt like an intruder, spying on the intimate moment between mother and son but he couldn’t turn away. It was obvious they had a strong bond together. He was feeling a bit jealous he couldn’t be a part of the ritual. He would love to be able to cradle her in his arms while she cradled their son.</p><p>Once the baby latched on she leaned her head against the couch and closed her eyes. He finally walked into the room and sat next to them. She jerked her head up and stared at him. Jacob, seeming to feel her tension, let out a small protest.</p> <p>She forced herself to relax, which wasn’t easy, considering Alex was there, next to her, with her body exposed. “Can you please hand me that blanket?” she asked, trying not to sound as nervous as she felt.</p><p>He handed it to her and she covered herself up. He was disappointed to lose sight of his son but relieved to have her cover herself. She’d grown curvier since he’d been with her. He smiled inwardly, thinking there was a positive to pregnancy. He was surprised he could think such a thought with what she’d put him through.</p><p>Jacob apparently had enough. She started fumbling underneath the blanket, then she switched him to her shoulder and started patting him on the back. After a few minutes he let out another burp and then started cooing at his mother.</p><p>“That’s my big boy. Good job,” she praised Jacob. He rewarded her by talking more gibberish.</p><p>“Can I hold him again?” Alex asked.</p><p>Jessica reluctantly handed her son over. She wasn’t used to having anyone interrupt their normal routine. She was having a difficult time watching father and son together. It made her somehow feel like she wasn’t needed in the perfect picture they made.</p><p>“Why did you place pictures of me by the crib?”</p><p>“I wanted him to know his father.”</p><p>“He could’ve known his father in person had you just told me I was going to be one.”</p><p>“Alex, we both know you’re not the type of man to settle down. I wasn’t going to trap you into instant fatherhood because we had a one night stand in a dark elevator. I would’ve eventually told you about Jacob but I didn’t feel it was the right time.” She still stood by her decision.</p><p>“We’ll marry in three days. My father’s making all the arrangements. I spoke to your father on the way over here and he agrees with me. I won’t miss out on my son’s life.” He spoke the words matter-of-factly. He said them as if the deal was done and she had no say in it.</p><p>“I won’t marry you Alex. My son won’t be raised in a home with parents trapped into getting married. I’ve seen far too many lives destroyed by making decisions like that. If you really want to be part of Jacob’s life then we’ll set up visitation arrangements.”</p><p>Alex simply smiled at her. He’d made a decision and as far he was concerned there was no need to discuss the matter.</p><p>“Do you really want to have our son labeled a bastard?”</p><p>She was seething with rage. “How dare you?” she spat at him. “You won’t try and use my son to get what you want,” she finished.</p><p>“Jessica, we will marry. My son will have my name. I have the full support of both of our families. We would both lose all of their respect if we did anything other than marry. I want my son in my life full-time. I don’t want to be a weekend father. You owe me for keeping him from me and your parents fully agree that we should wed right away. You’re dishonoring both of our families by not doing the right thing,” he finished. His voice was far more frightening to her because he wasn’t getting angry or threatening. He was talking as if he was simply stating facts.</p><p>Jessica sat their seething for a few moments, glaring at him. She finally got up and left the room. She walked into her office to make a phone call to her father.</p><p>John answered on the second ring, “hello.”</p><p>“Dad, what did you and Alex talk about?” she asked, not even bothering with any pleasantries.</p><p>“How are you doing?” he asked, ignoring her question completely.</p><p>“Dad, I asked you a question,” she said, in no mood to play games.</p><p>“We talked about your upcoming nuptials. When he found out he was a father he told me he wanted to do the right thing. He wanted to marry you and be a full-time father to his son. I support him Jessica. I know you had your reasons for not telling him but you don’t keep a father away from his child. You did him wrong by not telling him,” he said to her, with disapproval in his voice.</p><p>Jessica hung her head, not liking to disappoint her father but not ready to give up the fight. “Dad, I had my reasons. I won’t get married because everyone’s telling me what I should do,” she said, begging him to understand.</p><p>“Jessica, Alex wants to marry you and do the right thing for your child. He’s a good man. Are you willing to bring shame on Joseph by having people think his son would get you pregnant and then walk away?” he asked, knowing by her silence she was conceding defeat. She loved her family and had a lot of respect for Joseph and Katherine. She would never want to bring shame on their family.</p><p>They talked for a few more minutes and then Jessica hung up the phone slowly, feeling as if her world had been upended. She took her time walking back out to the living room. When she entered she felt a tear slip down her face when she saw Alex sleeping on the couch with Jacob held securely in his arms.</p><p>She picked the baby up, which jerked Alex awake. “I’ve got him...” he started to say.</p><p>“He’s ready for bed,” she quietly stated, then turned and walked toward the nursery. She felt Alex right behind her as she gently tucked her son underneath his blanket. She said nothing else as she walked to the kitchen with him following closely behind. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She prepared two cups of coffee and then sat down at the table. They both sat silently for a few moments, sipping from the steaming mugs.</p><p>“Jessica, we didn’t get off to a great start but I hope by now you understand what needs to be done,” Alex said in what he hopped was his most reasonable tone.</p><p>She held her head high and he knew he’d won the battle. She had defiance in her eyes, with a hint of defeat. He was overwhelmed with gratitude. He didn’t want to be away from his son for any length of time.</p><p>“Okay Alex, it looks like you’ve won this round. I’ll go ahead with this farce of a marriage but I’m telling you it’s not a real one. I’ll let you protect your family name and when the time is appropriate I’ll file for divorce,” she said with a strength that impressed him.</p> <p>“There will be no divorce,” he stated. “We’ll make it work out because I don’t want to be away from my son. I never planned on marrying anyway so it’s not like I’m missing out on something else by being with you,” he added.</p><p>His words made her wince. He was basically telling her he could stand to be married to her because marriage meant nothing to him. She didn’t feel the same way. She’d always wanted to get married but had given up because all the men she’d dated had been willing to marry her only to access her money.</p><p>She knew Alex in no way needed her money. However, he still needed her for something other than herself. She guessed she was bound to end up in a loveless union. It would tear her apart but as a mother sacrifices were expected of you.</p><p>There was nothing she wouldn’t do for her son. Her only regret was their union wouldn’t be real and she wouldn’t be giving Jacob any siblings. She’d been an only child and had always wanted to have many kids when she was in her own relationship. She loved her son so much and the thought of never having that feeling of carrying a child inside of her again, of looking at her newborn for the first time, was almost enough to bring her to her knees with the pain coursing through body.</p><p>“Alex, I’m exhausted. Can you come back tomorrow and we will figure out all the details. Jacob is still waking up a couple of times each night and I wasn’t able to take a nap this afternoon.”</p> <p>“I’ll sleep in the spare room. I want to be here when Jacob wakes up,” he said, once again with that voice of authority.</p><p>Jessica was far too tired to argue with him any further. The thought of him sleeping only one wall away from her, was enough to cause her stomach to tighten. She figured she would need to get used to it as they would reside in the same house soon. She knew he wouldn’t go for her staying where she was now. The entire reason he wanted them married was so he could be with his son and protect his family name.</p><p>“I’m going to bed,” was all she said, as she left the table.</p><p>Alex stayed where he was for several minutes after she left. He was barely able to stay awake himself but the thought of her in bed just down the hall was playing havoc with his senses. Their one time together had been in a dark elevator and over far too quickly. He would be able to bring them both so much more pleasure in a comfortable bed.</p><p>His groin strained against the zipper of his jeans. He groaned aloud and then headed towards her bathroom for a cold shower. He wouldn’t be taking them nightly. Once they were married, they wouldn’t be sleeping in separate rooms. That was the only thought keeping him from entering her room.</p><p>Alex was awakened by the whimpering sound of his son. He looked at the clock, noticing it was three in the morning. He was instantly alert. He walked into Jacob’s room and gazed down at him in the crib. He was so tiny and fragile. Jacob started kicking his legs in excitement as soon as he spotted Alex, which filled him with warmth.</p> <p>Alex picked him up, feeling he had a full diaper. He was grateful for the days he’d babysat his beautiful niece. He’d learned how to change her so he knew what to do with his son. “You ready to get out of that yucky diaper?” he cooed to his son.</p><p>Jacob answered him with a giggle and kicked his legs some more. Alex changed him, then moved to the rocking chair and cuddled him for a while. Jacob’s temperament changed after about ten minutes though and he looked as if he was going to start throwing a fit again. Even after only a day with him, Alex knew his son wanted to be fed.</p><p>“Let’s go wake your mom. I certainly can’t feed you,” Alex said to Jacob with a little chuckle. He stepped into her room with the light softly shining in from the hallway. His breath was taken away by her unguarded, peaceful expression. In sleep she seemed so young and innocent. She didn’t look like she could possibly be old enough to be a mother.</p><p>Jacob started wiggling in his arms, reminding him that it was time to eat. That snapped Alex out of his trance. He walked over to the bed and sat down. The movement woke Jessica and she sat upright. “What’s wrong?” she asked in a panic, getting ready to jump up.</p><p>“It’s okay,” Alex said, while placing a hand on her shoulder in reassurance. “Jacob woke up and he’s hungry. I already changed him, so if you feed him, then I will burp him and put him back to bed,” he explained.</p><p>Jessica was still disoriented but held her arms out for her child. “You don’t need to stay. We do this every night,” she pled. She really didn’t want him there with her body exposed. In the middle of the night it would be so much harder to not throw herself at Alex. She didn’t need to show him how much he still affected her.</p><p>“I want to be with him. If you got some of that bottle stuff then I could take over the night feedings,” he said hopefully. Jessica had to smile a bit at his lack of knowledge over the name, formula.</p><p>“No, I like our nighttimes,” she said simply. She figured it was dark enough she could feed her baby without having to cover him up. She liked to watch his precious face as he ate. She could gently caress his head and sooth him. He liked it too and would fall asleep quickly after he burped. When Jacob made a little growling noise followed by gulping sounds, Alex let out a quiet laugh, making Jacob jump. Surprisingly he stayed latched on and slurped away.</p> <p>“My son likes his food,” Alex stated proudly.</p><p>Jessica smiled at Alex for the first time in the dim room. Her face had lost the guarded expression. He couldn’t help himself; he needed to have physical contact with both her and his son. He scooted a little closer on the bed so his shoulder was pressing against hers, then reached his hand up and brushed the soft strands of hair on his son’s head.</p><p>Their eyes were still locked together and he couldn’t resist reaching towards her. He gently touched his lips to hers. Her taste was exquisite and pleasure shot all through his overheated body. He wanted her so badly. He most likely would’ve taken her if his son wouldn’t have been attached to her.</p><p>She pulled back, her breathing uneven and looked down at Jacob’s head. His hand was still resting there and the edge of his thumb was touching her breast. She sucked in another sharp intake of air and twisted, so his hand would have to drop.</p><p>She pulled Jacob to her shoulder and quickly covered herself as she started to burp him. “Let me do that,” he said, while he gently took Jacob and placed him over his own shoulder. Jacob gave a loud burp and started rooting at his shoulder, looking for more food.</p><p>Alex knew there wasn’t any way he could sit and watch her feed his son. He wanted her far too much to sit next to her in the bed any longer. “I’ll let you finish up,” he muttered as he left the room. Two more nights, he told himself as he prepared for a restless night. He would be lucky to get even another few minutes of sleep with the way his body was on fire.</p><p>Jessica breathed a sigh of relief as she watched Alex leave the room. She still had tingles zipping through her body where he’d pressed up against her. She knew he was simply trying to be a part of everything but she didn’t think she had the willpower to resist him. She’d been so lonely and so in need of affection.</p><p>She would be glad when the newness of the baby wore off and he backed off a bit. If he kept coming into her room in the middle of the night she would end up grabbing him and having a repeat performance of their night in the elevator.</p><p>How could one night with a man imprint him so deeply into her soul? She looked at their son and sighed. But Jessica had to be honest with herself and knew it was about so much more than just their son. Alex was dynamic in a way no other man even came close to being. He was intriguing and gorgeous beyond what any man should be gifted. He’d made her laugh and burn in only a few hours’ time.</p><p>She finished feeding Jacob, placed him in bed and fell into a much needed deep sleep.</p><p>Chapter Three</p><p>Jessica was exhausted. Alex had been back for three days and he refused to leave the house. He’d been amazing with their son though, so she had to give him credit for that. He’d even gotten up in the middle of the night so he could change and burp Jacob once she was done feeding him.</p><p>After the first night he’d maintained his distance, thankfully because she didn’t think she could handle anymore late night touching. Every time she was within breathing distance of Alex, her insides twisted into knots and all she wanted to do was reach out to him. She fully blamed the post partum baby hormones.</p><p>Today was the day of her wedding and she felt like she was going to have a panic attack. She had to keep telling herself it would all work out for the best. She went through her morning routine with Jacob, then she was whisked away to the wedding site.</p><p>“I’ll take Jacob for you so your mother can help you finish getting ready,” Joseph offered her.</p><p>Jessica jumped at the sound of Joseph’s voice. She hadn’t heard him walk up. The man sure moved quietly for a guy his size, she thought.</p><p>“I would appreciate that, Joseph. He’s had his breakfast so he should be in a good mood for a while,” she said.</p><p>“You look beautiful,” Joseph told her and then bent down and placed a kiss on her cheek before heading out of the room.</p><p>Jessica’s mother came in and put the finishing touches on her before they got into position. The walk down the aisle went by in a blur and the next thing she knew the preacher was speaking.</p><p>She was standing at the altar, next to a man she barely knew and was closer to having a panic attack than she’d ever been in her life. He looked so handsome and yet so aloof. She was wishing for some divine intervention to stop the whole circus. Maybe he’d come to his senses and tell her he couldn’t go through with it, or maybe her father would stand up and free her of the obligation.</p><p>None of that happened. Suddenly, the preacher was pronouncing them man and wife. Alex then took her into his arms. The rest of the world disappeared as his mouth fastened onto hers. She’d expected a chaste kiss but she was wrong. He coaxed her mouth open and then slipped his tongue inside.</p><p>Her knees went to jelly and she would’ve slid to the floor if it hadn’t been for his arms supporting her. When there was laughter from the guests and a lot of throat clearing he finally pulled away and she was left to stand with one of his arms around her, staring blankly at the mass of people.</p><p>“You have plenty of time for the honeymoon later,” she heard someone call out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Share that pretty bride of yours. I’m calling the first dance after my brother,” another voice hollered with a chuckle.</p><p>“You can back off and find your own wife Mark,” Alex said, with jealousy in his tone.</p><p>“Doesn’t feel so good to be on this side of the ribbing, huh little brother,” Lucas said and then thumped him on the back.</p><p>Alex knew he deserved the teasing. He’d given Lucas hell, not that long ago when his big brother started dating Amy. Lucas had been trying to fight his attraction towards Amy, so Mark and he had decided to push their brother’s buttons. They’d both planted a kiss on her in front of Lucas and flirted. She’d known they were kidding, trying to get a rise out of their brother but now Alex felt bad for what he’d put Lucas through because he sure as hell wanted to punch out Mark at that moment.</p> <p>A shudder ran through Jessica’s body as she watched the interplay between the brothers. They were all so virile and appealing. She only had eyes for Alex though. He was the sexiest man she’d ever been around and in any other circumstance she would’ve been swooning to be held and kissed by him.</p><p>Jessica glanced over to where her father was laughing at something Joseph said. She tried to stay mad at both men for manipulating the whole situation but she really did love them. She knew they only wanted what they deemed best for her and her son. She just didn’t like the methods they took to get their own way.</p><p>As if the men knew she was thinking about them, they both turned and gave her a smile. She was too frazzled at the moment to even pretend to smile back so she turned away and let her thoughts continue to run.</p><p>Things could be a lot worse, she decided. Alex was a sexy, incredible man and it was obvious he was already in love with his son. She could’ve been forced into a marriage where the man not only resented her but her son as well. She knew no matter how Alex felt about her, he would always love Jacob.</p><p>“Time for photographs,” she heard a voice call. She grimaced until Alex looked at her, with their precious son resting in his arms. For one moment they shared a real smile. Her mask fell away. The love she had for her son and the love starting to grow for Alex was shining through her expression. His breath seemed to catch and he was about to say something, when the camera flash snapped them both out of the moment.</p> <p>He turned from her and spoke so no one else could here. “Let’s get these pictures over with. We don’t need to announce to everyone in the room this is a shot gun wedding.” He placed her arm through his and headed towards the rest of the family.</p><p>“Come on Alex, everyone here knows why we did this so I don’t see why we need to have this huge masquerade. We could’ve just as easily taken care of our marriage in a courthouse and not put on a big show.”</p><p>“There’s no way my father would ever allow one of his sons to get married that way and I’m sure your father feels the same. Jessica, this marriage may be happening because of our son but we’re married now. It needed to be started this way. Something about our relationship needed to be done correctly,” he finished.</p><p>Jessica gave in without any more protest and allowed the photographer to place her in many different poses with Alex and her family members. She felt as if her cheeks were going to crack, she’d been holding the same expression so long. All she had to do though was look at her son and she was able to continue.</p><p>Jacob may have been an unexpected surprise she didn’t even know she wanted but she couldn’t imagine her life without him. There was nothing she wouldn’t sacrifice for him. She would give up her entire world to make his better. She could live in a loveless marriage because that meant her son was with his father and would be loved, cherished and spoiled.</p><p>The photographer was finally happy with the shots he’d captured and Jessica was able to step away and gain control of herself once more. She heard a hearty laugh and glanced up to see Alex slapping his brother on the back, as his features lit with mirth. She sucked in a breath at the beauty of the man.</p> <p>Alex was the most handsome man she’d ever known. From his dark, silky hair, piercing blue eyes and devastating smile, to his rock hard stomach and sculpted arms. When you added in the confidence, which was as second nature to the man as breathing, he was every woman’s dream come true.</p><p>She knew there were plenty of women who would love to be in her place. They wouldn’t have even cared if Alex loved them or not. They would just love to have him on their arm. He was a trophy for sure. The thought caused a small giggle to bubble up inside of her. She’d heard of all the men with their trophy wives. Well, it looked like she’d snagged herself a trophy husband.</p><p>“It’s time to head out back for the reception,” Joseph said in his booming voice, which could be heard by everyone. The announcement made Jessica’s head snap up to attention. She thought this was the reception. Why did the wedding keep getting bigger and bigger?</p><p>She saw Alex hand their son over to his mother, then he was at her side. “I know you’re tired but in a few more hours we can get out of here and rest,” he reassured her.</p><p>They walked through the huge Anderson mansion and as they crossed through the patio doors, her breath was once again taken away. The backyard had been transformed into a fairytale. She looked around in awe. She’d grown up wealthy but what the Anderson’s had made her family look like middle class.</p><p>There was a white carpet laid out from the back door to a group of tents. Thousands of cascading lights looked like diamonds raining from the sky. Tables were set up with beautiful settings and waiters were at the ready, loaded down with trays of champagne and appetizers.</p><p>A small orchestra was playing in the center of the whole affair, with a beautiful dance floor waiting for people to occupy its space. As they walked out she noticed more people were at the reception than had attended the wedding. She knew some but not all of them.</p><p>“Do you like everything?” Joseph asked, seeming to appear from nowhere.</p> <p>“It’s amazing but you really didn’t need to go to this much trouble. Some cake and champagne would’ve been fine,” she said.</p><p>Joseph let out a hearty laugh and then leaned down to kiss her cheek. “Only the best for my boys and the beautiful women they choose to marry,” he said before he walked away to visit with some of the guests in attendance.</p><p>“Try not to feel too overwhelmed. I got really flustered when I walked out these same doors on my wedding day but now I will cherish those memories forever,” Amy said. Jessica was surprised to see Lucas’s wife standing there with her</p><p>Jessica knew the story of Lucas and Amy’s rocky start. Amy had been working for him and found herself pregnant with Lucas’s child. They’d married for the sake of the unborn baby but things had seemed to work out great for them. It was obvious to anyone around them they loved one another. It also seemed Alex was following in his brother’s footsteps and getting married due to an unplanned pregnancy.</p><p>They had one daughter who was over a year old and obviously loved. Amy was also looking very pregnant with baby number two on the way. Their marriage had ended up working out perfectly, which sent a bout of sadness through her. She didn’t see how her and Alex could end up with the happily ever after Amy had gotten.</p><p>“You startled me,” Jessica finally managed to say. “This whole thing is a little bit overwhelming.”</p><p>“I know how you feel and it doesn’t seem like it right now but you will appreciate all of this someday. You’ll have the pictures to pour over and the memories of the perfect wedding to tell your children,” Amy said comfortingly.</p><p>Jessica didn’t think she would ever be appreciative of the wedding but she wasn’t going to voice that to her new sister-in-law so she decided to change the subject.</p><p>“How far along are you?” Jessica asked.</p><p>“Six months now,” Amy said, beaming. “I couldn’t be happier. I love Lucas, Jasmine and this entire family so much. I was in a similar circumstance as you, not that long ago but it worked out so much better than I could’ve ever imagined. This family loves big and I’ve seen the way Alex looks at you. I know you’re scared now but know I’ll be there for you if ever you need a woman to talk to. Things do get better,” she finished and then gave Jessica a hug before joining her husband.</p><p>Jessica watched as the other couple embraced like they’d been apart for months instead of mere minutes. She felt slight jealousy at the obvious love radiating from the happy couple. She didn’t expect to ever have Alex look at her the way Lucas was looking at Amy. She shook herself out of the mood and decided to enjoy her evening, since she wouldn’t be able to get out of it.</p><p>Once Jessica decided to let go of her worries she found herself enjoying the reception. The cake was incredible. It had five layers with water cascading down the center. There were tiny flowers and butterflies created from frosting and she was almost afraid to cut it and ruin the great work of art.</p><p>Alex swiped a piece of the frosting and stuck his finger in his mouth, making her stomach churn with desire. How watching a man lick a bit of frosting off his finger could be so dang sexy, she’d never know?</p><p>When Alex’s hand fit gently over hers, they cut the cake and her worries fell away. Whenever he touched her, the rest of the world could tumble down and she wouldn’t notice. She looked up into his eyes and forgot what they were doing. He leaned down and kissed her intimately, to the delight of the crowd. His mouth tasted sweet from the frosting and she could feel shivers running down her spine.</p><p>The laughter pulled Jessica from her thoughts. She gently fed him and the look of lust in his eyes as her fingers grazed his mouth made her knees go weak. She started to tremble, praying the rest of the audience didn’t notice. Then he fed her a small piece of cake and heat shot throughout her body. She sucked his finger into her mouth and the lust instantly in his eyes was enough to drop her to her knees.</p><p>When he wiped a piece of frosting from her lips and then licked the tip of his finger, she actually swooned. She thought swooning was just a Hollywood movie moment but if he hadn’t been there to pull her close she would’ve fallen into the table.</p><p>His eyes smoldered to a dangerous level and he pulled her close, kissing her with far less restraint than he’d exhibited earlier. She wrapped her arms around his neck and gave into the passion she’d been feeling since he’d first stepped through her door.</p><p>“Well, I guess that’s some great cake,” she heard the chuckling voice of her father.</p><p>Jessica’s head snapped back and she stared at her husband with horror. She couldn’t believe she’d kissed him like that in front of so many people. He smiled down at her and turned toward the guests.</p><p>“We need to get this over with. I want my wife to myself,” he said with laughter.</p><p>“Here, here,” she heard Lucas shout, as he lifted his glass to toast the couple.</p><p>Jessica heard the sound of Jacob letting his mom know it was time for his own dinner and was relieved to get a few minutes of privacy, as she took him into the house to eat. As she rocked Jacob, she reflected on the overwhelming day. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She’d watched Alex with her son and wanted to think he was only marrying her because he was trapped into it. But she knew he genuinely loved Jacob. She knew he was happy to be a father. It wasn’t what either one of them had expected but he’d quickly taken to his role as father and he was doing an amazing job.</p><p>She wasn’t anxious to get back out to the reception. She knew most of the people out there had to be talking about how poor Alex had to marry to make his son legitimate. It made her very uncomfortable. Even though no one had treated her badly or said anything negative, they had to be thinking she’d trapped him. Even though she had plenty of her own money, Alex Anderson was a real catch. He could literally choose any bride he wanted but the choice had been stolen from him the minute he found out he was a father.</p><p>As Jessica took a few moments longer rocking Jacob, she heard footsteps enter the softly lit den. “I’m glad to have a few moments to speak with you alone,” Joseph said softly. “I know all of this has been a little overwhelming for you and I just wanted to let you know how happy I am you’re a part of our family,” he continued, as he sat down next to her.</p><p>“I’m very pleased to join your family, Joseph. This is all quite overwhelming though,” she finished speaking with a nervous laugh.</p> <p>“I understand how you feel Jessica but know you have a lot of people to turn to for support. Also remember that lasting marriages have started with less going for them that what you and Alex have. I think your union is off to a great start. You have this beautiful baby boy and it’s obvious to anyone who watches, you and Alex have chemistry. I can understand if you’re afraid to admit love yet but I see the way you look at my boy and it fills my heart with joy,” he finished.</p><p>Jessica didn’t know what to say. She didn’t want to admit her growing love for Alex but she couldn’t tell his father a lie either so she thought it best to simply keep silent.</p><p>“Let me take that amazing grandson of mine and lay him down so you can get back out to the party,” Joseph offered. She was reluctant to hand Jacob over but knew she was just being silly.</p><p>“Thank you,” was her only reply and then empty handed again, she had no choice but to head back outdoors.</p><p>“It’s time for our first dance as a married couple,” Alex said to her, taking her hand and pulling her onto the dance floor. All her worries washed away again as he pulled her close into his arms. Dancing intimately with him was a prelude to sex. The way he moved his hips against hers and rubbed on her lower back had her insides burning.</p> <p>When he bent down and kissed her on the neck, goose bumps appeared and a light shiver spread throughout her middle. He gazed into her eyes and neither of them needed to say a word. Her breathing increased as he whirled her around the floor and she breathed a sigh of relief as the song came to an end.</p><p>She didn’t think she would’ve been able to remain in his arms much longer without beginning to undress him. She’d never been such a wanton woman before she’d met Alex.</p><p>The next half hour passed slowly as she was passed from one person to the next on the dance floor. She enjoyed her father-daughter dance and a few tears fell as he told her how much he would miss his little girl being only his.</p><p>She laughed with both Lucas and Mark, genuinely enjoying Alex’s brothers. She couldn’t understand how Mark hadn’t been snatched up yet. Of course, from her understanding, all the Anderson males held onto their bachelorhood like a rancher held onto his prize bull.</p><p>After being whisked around, she was once again in Alex’s arms and it felt like coming home. “Are you ready to get out of here,” he whispered in her ear. Before she had a chance to reply, the music stopped.</p><p>“I hope everyone is having a great time,” Joseph spoke into the microphone. There was an outbreak of applause at his words.</p> <p>“Good, good. Now I would like to make a toast for my son and beautiful daughter-in-law. I couldn’t be happier to have you join our family, Jessica. You are a true blessing and a perfect match for our stubborn son, who we happen to think is just about perfect. Although, we were worried no woman would ever put up with him.” The crowd erupted with laughter.</p><p>“All joking aside, we’re grateful for this union and the blessing of our first grandson. Katherine and I both wish you the best and hope your marriage will be filled with laughter, joy and surprises. And best of all, remember a little fight now and again makes life exciting and gives you a chance to make up,” he said with a wink.</p><p>“Katherine and I have a wedding gift for you we couldn’t quite gift wrap,” he said with a chuckle. “A new family needs a real home and not to be living in some apartment in the city. We got you a place about a mile down the road from here. It’s all set up for a nice honeymoon since Jessica doesn’t want to leave somewhere without the baby. We do insist on babysitting so you two can get some alone time together though,” he finished.</p><p>Jessica gasped at his words. She couldn’t believe Joseph and Katherine had bought them a house. What if this all fell apart within a week, or even a month? So many people were already involved in their union and now they would have a home, which she would get attached to. She watched as Alex strode over to his father and gave him a huge hug, then did the same for his mom.</p><p>She didn’t realize tears were falling down her cheeks until Alex came back and gently wiped them away. “If you don’t like the place, we can find something different,” he said, mistaking her anxiety.</p><p>“No, it’s just we aren’t in a real marriage. This is all too much.” She couldn’t say anymore and quickly hugged Joseph and Katherine and then excused herself to check on the baby.</p><p>Alex stood there, shocked for a few moments and then he was angry. He’d been enjoying the wedding and his bride and then she had to remind him it was a forced marriage. He knew she was having a hard time with the whole situation but a lot of people had gone the extra mile to make it enjoyable for her. He needed to keep his guard up around her or he could see himself getting hurt deeply.</p><p>The party finally slowed down and they were able to make their escape. Jessica gathered up Jacob, while Alex grabbed their bags and they ran through the throng of people to the awaiting limo.</p> <p>Birdseed flew at them and cameras snapped and they were both more than grateful to be inside the safe confines of the limo. They didn’t have a very far drive, thanks to the generosity of his parents.</p><p>Jessica was exhausted and more nervous than ever being alone with her husband. Was he going to expect her to sleep with him, or would she be allowed her own room? Did she even want her own room? The thought of sharing a house with the virile, masculine Alex and not sleeping with him seemed worse.</p><p>She was going to have to wait and see what happened.</p><p>They arrived at the gated driveway within a few minutes. Jessica rolled her window down to look out. The driveway seemed endless and was flanked by huge pine trees on either side, giving privacy to the house still hidden from view. When they turned another corner, the driveway opened up to a huge circular turn-around done in colored bricks. In the center was an enormous water fountain with angels dancing in the center, looking as if they were splashing each other.</p><p>Jessica didn’t know what to say. The home was a smaller version of the Anderson Mansion. There were three stories with wrap around balconies on each level. There were five huge columns across the front, giving the home a southern plantation look. She was immediately in love with the place. She was afraid to step inside because the minute she did she knew she’d be even more in love and never want to leave. She had plenty of her own money. When things in the marriage failed, as she knew they would, maybe he would allow her to buy the place and stay there. She was tired of apartment living anyway.</p><p>The driver opened her door and she reached in for Jacob but Alex had him already. “I can take him,” she said, not liking him taking control all of the time.</p><p>“I’ve got him. Go ahead and check out the house. I’ll come back for the bags in a few minutes.”</p><p>She wanted to argue with his high-handedness but decided it wasn’t worth the hassle. He would win once again but she was exhausted. The door opened, which surprised her, as she didn’t know anyone was there.</p><p>“Hello, Mr. and Mrs. Anderson. I have a snack prepared for you in the kitchen and your room has been prepared. Would you like me to lay down the baby so you can look around?”</p><p>Alex handed Jacob over to the woman, which Jessica immediately was going to protest. She wasn’t going to let him hand her child over to a stranger. “Jessica, this is Tina, our cook. She’s worked for my family for over twenty years and is one hundred percent trustworthy,” he said, noticing her concern.</p><p>Jessica still wanted to rip her baby away from the stranger but knew she would look bad in doing so. “I will walk with you to the nursery so I know where Jacob is. Are baby monitors set up so I’ll be able to hear him in other parts of the house?” Jessica asked with concern.</p><p>“Yes, and you can carry around portable listening and video devices so you know your precious one is safe at all times,” Tina reassured Jessica, as they walked up the grand staircase.</p><p>They reached the second story and walked down a well lit hallway. “This is the master bedroom, here to the right and the baby’s room is right here across the hall. Mr. Anderson said you’d want the baby close by.” Tina pointed out a few more doorways and then led Jessica into a lovely baby’s room. The walls were identical to what she’d done at her old place. Alex must have taken pictures and had someone reproduce her artwork. All her nursery items were there, along with many new things. She noticed the camera angled in the corner and felt some relief.</p><p>Tina laid Jacob in his crib and Jessica bent down to kiss his soft cheek and cover him up. She could stand there all day and night watching him sleep.</p><p>“Here’s the monitor, Mrs. Anderson,” Tina said, handing over a small device. Jessica looked at it and not only were their voices coming through but there was a small screen showing her son sleeping in his crib.</p><p>“Thank you so much Tina,” Jessica said with real gratitude. The home was very large and she would feel comforted being able to keep an eye on her son no matter where she was.</p><p>Jessica turned to find Alex right behind her. “I tried to match Jacob’s old room as much as possible,” he said in explanation of the decorations. “My father bought this home a while ago waiting for the day one of us would choose to settle down,” That explained how he’d been able to have the nursery prepared.</p><p>“It’s lovely, thank you. It has a lot more room than his old one,” she said honestly. She really did like the room. She liked everything about the home.</p><p>“This door over here leads to the nanny’s room...Now before you protest, we’ll hire one together and I’m not expecting you to not take care of our son. It’s simply a good idea to have a nanny here to help you. That way you can have some free time to do whatever it is you want or need to do.”</p><p>“I, in no way need a nanny.” She wasn’t happy about him thinking he could control everything. She’d been doing fine taking care of her son on her own. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Your father told me you had a passion for writing but hadn’t been able to do any the last few months because you were either too exhausted or taking care of our son. I just want to give you a chance to be able to do what you need to do. You can still be with him full time. The nanny can be more of a helper for when you need her,” he spoke reasonably.</p><p>“I’ll think about it,” was all she said. The thought of writing again was tempting but she would feel like such a bad parent, passing her child off to a stranger. She would at least consider the possibility.</p><p>Alex took her around the rest of the home. The home was decorated in a way she would’ve done herself. Some of the rooms reminded her of her childhood home. She loved everything about it. They arrived in the kitchen, where two other staff members were waiting for them.</p><p>“This is Edward, our gardener. He’s married to Tina. They live in the cottage on the back of the property. This is Maria, our housekeeper. They’ve all been with the family as long as Tina, which is why I wanted them here.”</p> <p>“It’s really great to meet all of you,” Jessica said, while shaking their hands. The staff left them to eat the food and then an uncomfortable silence fell between them. Tina had said master bedroom. She wasn’t ready to share a room with her husband nightly. She needed more time to protect herself, to keep her heart out of it.</p><p>She would keep her things in that room but sleep in the nanny’s room for now. When the silence seemed to stretch on forever, Jacob’s cry came over the baby monitor. She jumped up in relief to get away from Alex and take care of her son.</p><p>Jessica changed Jacob, then fed him and was laying him down when Alex walked into the room. “Hold on, I want to kiss him goodnight,” he said, before gently kissing Jacob’s head. She had a very difficult time staying angry with Alex when he was always so loving towards their son.</p><p>They both stood over the crib for a few moments, both of them content watching him sleep peacefully. “Let me show you to your room,” he said.</p><p>Jessica breathed a sigh of relief, although she also felt a tiny twinge of disappointment at the same time. This is what she wanted, she had to remind herself. She didn’t want to share his bed, yet she felt bad he didn’t seem to want her at all. She was a little curvier since she’d had the baby. Maybe he was turned off by her new body.</p> <p>Alex led her into the master bedroom. There was enough space for an entire apartment to fit into the huge room. The master closet was the size of her old bedroom. She stepped into the bathroom and was immediately in love. She didn’t say another word to Alex. She shut the bathroom door and started filling up the huge tub.</p><p>Jessica had to chuckle to herself at the size of the tub. It was large enough for a few people to have a hot tub party in it. After adding some soap from a bowl on the side of the tub, she placed her hair in a bun and stepped into the hot water. As she sank down to her chin and the bubbles surrounded her, a sigh of ecstasy escaped her lips.</p><p>Jessica finally relaxed and let the scents take her stress and worries away. She stayed in for over an hour, then finally managed to pull herself out of the cooled water. She wrapped herself in one of the luxurious, oversized towels and stepped through the doorway.</p><p>She wanted nothing more than to crawl into the huge four-post bed. She started to pull the towel away and noticed Alex sitting on the bed in nothing but a pair of pajama pants. She sucked in her breath at the raw power rolling off of him. He had to be the sexiest guy she’d ever seen. With clothes on he was enough to accelerate your heart, with them off he could cause cardiac arrest.</p><p>“Wh...what are you doing here?” she stuttered. She was praying he wouldn’t come towards her because if he took her into his arm she would cave quickly. She couldn’t seem to say no to him.</p><p>“I’ve been waiting for you. How was your bath? I was beginning to get worried, you took so long,” he said casually.</p> <p>Jessica braced her shoulders. She knew she had to get all of her words out quickly or she’d lose her courage to do so. “Alex, I know we’re married but I’m not sharing a room with you. I can use the one next to our son’s,” she finished weakly.</p><p>Alex’s eyes went from casual to smoldering in one second flat. He slowly stood up and walked towards her. He was like a panther, stalking his prey. Her stomach felt like it was crawling up into her throat, she was so tense.</p><p>She wanted to be in his arms and knew it would be fantastic but she needed to protect herself. It wouldn’t take much to fall head over heels in love with him. She took an involuntary step back and then another, as he got closer to her.</p><p>He slowly looked at her from her head to her toes and back up again, without saying a word. When he finally reached her eyes again, they were both breathing heavily. He placed one hand behind her neck and the other at the small of her back and jerked her into his body.</p><p>“Alex, this isn’t a good id...” she tried to tell him but he swallowed her words as his lips took possession of hers. He kissed her with anger, passion and need. She tried not to respond but after a few seconds she was giving just as good as she got.</p><p>Her hands wrapped around the back of his head to pull him even closer. He was pressing her stomach into his obvious arousal. Knowing he wanted her was like throwing a lit match into a puddle of gasoline.</p><p>His hand slid down past the bottom of the towel and began touching the bare skin at the top of her thighs. She pressed even closer and a moan escaped her lips. He pulled back and turned away from her.</p><p>They both stood there, trying to catch their breaths. Alex cursed himself. He hadn’t meant for the kiss to go that far. She had a way of blocking out every thought in his head except for his desire to take her.</p> <p>He finally gained control over his raging body and turned to face her again. Her breasts were still heaving with the deep breaths she was taking in. He could tell she was trying to gain control and not doing a very good job of it. He almost lost his will to turn away from her, at the look of desire in her eyes. He had to prove a point though. He knew later when he was standing in a cold shower he’d have to try very hard to remember what that point was.</p><p>“You’re my wife. You will be sharing my bed and you will be my wife in every way that matters. I will not disgrace my son, or my family, by having affairs and in case you haven’t noticed, I’m a man with needs. This marriage is for better or worse and we’ll make the best of the situation.” He said all of this in a smooth, calm voice making her temper was rise.</p><p>How dare he tell her what she would and wouldn’t do! He wasn’t her boss. Yes, he’d strong-armed her into a marriage for the sake of their son and their families but she wouldn’t be at his beck and call.</p><p>Alex was enjoying the light of temper entering her passionate eyes. She was so easy to read and he could see she was ready to explode. The desire in him was growing. It was going to take all he had to walk from the room. He didn’t want to take her in anger. He respected her far too much for that.</p><p>Jessica walked up to him and slapped him hard across the face. He stood there, too stunned to move for a moment. When she saw the anger light his face, she backed up quickly, realizing she most likely had made a huge mistake.</p><p>He caught her arm and whipped her back around to face him, “if you slap me again, you will feel my wrath,” he snarled.</p><p>“You will not tell me what to do or how to be a wife. Our marriage doesn’t give you power over me. It doesn’t mean I will be sharing your bed. I make my own choices and decisions. No one makes them for me,” she said, with far more bravado than she actually felt.</p><p>Alex smiled at her with his normal confidence. “You want me just as badly as I want you. I won’t make you have sex with me, you’ll be begging me for it.” He then kissed her quickly and walked to the door. “I’ll give you tonight, alone, so you can miss me. Tomorrow and every night after, we’ll sleep in the same bed. The sex will be entirely up to you.”</p><p>With those words he walked out the door, leaving Jessica standing there, angry because she feared he was right. He barely left and she wanted to call him back to her. She sighed, knowing it was going to be a long night alone in the empty bed.</p><p>Chapter Four</p><p>Jessica walked down the stairs with Jacob in her arms. She was cranky and exhausted. Sleep had been elusive the previous night and it showed. After the parting kiss from Alex, she’d stirred in bed thinking about him, with her body on fire. To top that off, when she’d finally started to drift into a restless sleep Jacob woke and decided after he ate he wanted to stay awake for a while and play.</p><p>Alex stayed away from her for the night like he’d promised. By the second hour she’d walked the floors with Jacob she was thinking her decision for him to stay away may have been made a bit too hastily.</p><p>She knew she had circles under her eyes. She didn’t bother with any make-up and was wearing old sweats and a baggy t-shirt. She didn’t even care if she looked like something the cat had drug in. She just wanted some hot coffee and about twelve hours of uninterrupted sleep.</p><p>“Good morning Mrs. Anderson. Would you like me to take Jacob so you can eat some breakfast,” asked Tina, while she placed a cup of wonderful smelling coffee in front of her?</p><p>Jessica almost replied no, as she was so used to taking care of her son on her own but the aromas coming from the kitchen had her changing her mind. “That would be wonderful, if you don’t mind,” she finally replied.</p><p>“My husband Edward and I, weren’t blessed with children of our own. I will really enjoy having a baby in the house. I’m looking forward to spoiling him rotten,” Tina said with a wink and a smile. Tina took Jacob in her arms and when he smiled at her she laughed with real joy, making him smile even more.</p><p>Jessica relaxed, knowing her son was in good hands. “I will have Maria bring your breakfast out. Enjoy your meal,” Tina said, then walked into the kitchen with Jacob in her arms. Jessica ate her meal in silence and felt her eyes start to droop.</p><p>She couldn’t believe how tired she was all the time. She would really like to sleep for eight full hours straight, a luxury every new mother wanted. It was worth more than any amount of money in the world.</p><p>“Good morning, I hope you slept well,” said Alex, sounding far too happy. Jessica snapped fully awake at once. He didn’t look as if he’d lost any sleep, she thought accusingly. In fact, he looked as if he’d never lost a night of sleep in his life. She was a little envious of him right then.</p><p>“I slept great,” she lied. She refused to look up and make eye contact with him.</p><p>Alex sat down across from her and Maria placed his coffee and food in front of him. “Thank you Maria,” he said. The conversation halted, while he dug into his breakfast.</p><p>Alex was surprised by the punch of lust he was feeling. Jessica looked exhausted, obviously she hadn’t slept well. For that matter, he hadn’t slept well either. He was just hiding it a lot better than her. Even with circles under her eyes and dressed in such baggy clothes, she looked far sexier than any woman he’d ever seen. She had a natural appeal about her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alex leaned over her to grab the salt and saw her eyes widen. Jessica almost gasped out loud. She wasn’t happy when she saw the knowing look come into his eyes. He knew how he affected her and he was already far too full of himself. She wouldn’t stroke his ego even more by letting him know how deeply he affected her.</p><p>They ate in an awkward silence, while Jessica tried to regain her composure. She didn’t like how her world always seemed to stop turning whenever he was around her. She would bet objects would just naturally fall from the sky and land at his feet, if he commanded them to do so.</p><p>“I have some work to do here in the home office. If you need anything, you can come and get me,” he finally spoke after several moments.</p><p>Jessica simply nodded her head. She then rose from the table and headed toward the kitchen. There was a basinet off in the corner and her son was sleeping soundly. She smiled down at her precious baby.</p> <p>“Mrs. Anderson, if you’d like to lie down for a while, I would be more than happy to keep an eye on Jacob. You have several bottles already pumped if he wakes up hungry,” Tina said kindly.</p><p>Jessica’s initial reaction was to refuse. But she wouldn’t be any good to him if she didn’t get some rest. There was a houseful of people more than willing and happy to help her. It wasn’t selfish to get a bit more rest.</p><p>“Thank you Tina, I’ll take you up on your offer. Please wake me if you need anything.” Jessica placed a kiss on her son’s head and then headed back up the stairs. She climbed into bed and quickly fell into an exhausted sleep. She didn’t stir for four hours.</p><p>When she woke, she felt disoriented. She wasn’t used to taking long naps and she panicked for a moment when she noticed the time. She quickly relaxed, knowing if there’d been any problems someone would’ve woken her.</p><p>She climbed into the shower and washed the sleep away. Taking long showers was another luxury new mothers had to give up. She was always so paranoid Jacob would need her while she was showering and wouldn’t hear him. This was actually absurd, considering she knew how loud her son could get when unhappy about something.</p> <p>She got dressed and headed back down the stairs. She found Jacob in the living room with Alex. Her son was wide awake, making little grumbling noises at his father. Alex seemed to be transfixed. She watched them for a few minutes. The unguarded way her husband interacted with his son was something special to see. She knew she’d made the right choice in marrying him. He obviously loved Jacob immensely.</p><p>She made a noise and he looked up to see her standing in the doorway. He quickly guarded his expression and she felt a bit let down. Their relationship wasn’t going to get any easier, anytime soon.</p><p>“You have great timing,” Alex began, “our son was just telling me he wanted some food.” He smiled, as his eyes once again went to their son. Jessica walked closer to them and when Jacob noticed her, his noises escalated and his legs kicked out. He knew food was nearby and he was letting his mom know he wanted it.</p><p>Jessica smiled, while bending down to pick Jacob up. Her hand brushed against Alex’s lap and their eyes locked for a moment. He quickly inhaled and his eyes darkened in desire. He needed his wife and the sooner he had her, the better.</p><p>Jessica quickly gathered the baby and sat down on the far end of the couch. Her fingertips were tingling, where they’d brushed him. She had no idea how she was supposed to continue to fight the desire she had for the man. He was potent. She wanted him far more than she’d ever wanted another man. She hadn’t been with anyone since her night with him in the elevator and her body was aching to be taken.</p><p>“I’m going to feed him here,” she finally said to him. He usually left her in privacy to feed their son but apparently he wasn’t willing to this time.</p> <p>“Go ahead, I’m going to catch the end of the game,” he replied.</p><p>There were no blankets nearby and Jacob was getting ready to throw a full blown fit any minute, as he started rooting around on the outside of her blouse. Jessica turned slightly away from Alex, trying to give herself some semblance of privacy and quickly latched her son on. He greedily started to eat and Jessica relaxed and watched the game with Alex, without saying anything else.</p><p>Alex sat on the couch, a few short feet away from Jessica. He knew he should give her the privacy she wanted but he simply didn’t want to leave the two of them. He liked them being in the room with him. He’d been giving her some distance and finally decided, enough with the space. He wanted them to be right next to him and he was going to have that.</p><p>He got up and sat down right beside Jessica, so their legs, hips and shoulders were touching. He then flung his arm over the back of the couch so her back was pressed up against his chest. He felt her tense at the close proximity but she kept silent. He said nothing, just continued to watch the game, although there was no way he could’ve told anyone what the score was, or even who was playing. He could only think of her.</p><p>She finished feeding their son and quickly covered up, then transferred him to her shoulder and began burping him. Jacob’s big eyes looked up at his father sleepily and Alex couldn’t resist rubbing his bald head.</p><p>“Did you get enough to eat?” Jacob’s responses to his father’s words were some coos. Alex chuckled and sat there, enjoying Jessica pressed up closely to him, as well as their son in her arms. He could definitely get used to the marriage thing and wouldn’t mind having a few more kids running around in front of him. The thought sobered him. He’d never pictured himself as the settle down kind of guy but the more time he spent with Jessica and their son, the more married life appealed to him.</p><p>They sat there for a while, Jessica finally allowing herself to enjoy the two men in her life. She would try to keep her distance but it was becoming harder with every passing moment. Alex’s scent was enveloping her and she was hard pressed to keep him at an emotional distance. Even though she’d just slept for four hours, before she knew it she felt her eyes begin to drift shut. Oh well, she thought, she would just close them for a few moments and rest.</p><p>Jessica woke to find herself wrapped tightly against Alex. His arms were locked around her and they were lying down, with a cover over them, on the over-sized couch. “Where’s Jacob?” she asked in panic.</p> <p>“Tina took him a while ago,” Alex replied sleepily.</p><p>Their faces were inches apart and without another word, he closed the gap between them and kissed her with all of his pent up need. She responded without thought. He turned their bodies and was suddenly on top of her, pressing her down into the couch. His hands were roving over her, while his mouth worked magic on her body. He broke contact with her lips and ran his tongue over her throat, causing a moan to escape her lips.</p><p>When his hand ran up from her hip to cup her breast, she throbbed with pleasure. She wanted him so badly and her body was responding to each movement he made. He began unbuttoning her blouse and trailing his lips down her neck, toward her barely covered breasts. She grabbed his head, pulling him back to her lips. She needed to feel his mouth pressed against hers.</p><p>She pressed her hips into his arousal, making him groan with pleasure. He fastened his lips back on hers and was close to taking her right there in the living room where anyone could walk in at any moment. She finally came to her senses and pushed him away.</p><p>“Alex, someone could walk in,” she said, panting.</p><p>He wanted to ignore her words and continue with the seduction but she was right. There were too many people in the house and he wanted to take his time loving his wife without interruption. She would be his again later that night.</p><p>He sat up and she quickly got to her feet. He walked over to the bar and poured himself a shot of bourbon, downing it in one gulp, then decided it wasn’t enough and decided to take one more. The burning liquid down his throat did its job and his hormones calmed down somewhat. His desire was banked down but the flame was still burning. His body wasn’t going to simmer down until he took her again. Finally it wouldn’t be in an elevator a couch. It would be in their bed where he could love her all night long.</p><p>“Would you like a glass of wine?” He finally asked her.</p><p>“Yes please but only half a glass. I’m still nursing and can’t consume more than that,” she replied. She normally didn’t even have that much but her nerves were frayed.</p><p>He poured her a half glass, then walked over to the fireplace to stoke the flames and add some more wood. He was giving them both the needed time to breath. They were seriously both ready to explode from the passion waiting to be ignited fully and then sated.</p><p>“We have a few nannies coming in today for interviews,” he finally said after she’d taken a few sips. She immediately tensed up again. “I’ve already told you if you don’t like any of the candidates we won’t hire them,” he added, defensively.</p><p>“Fine,” she replied and then left the room to check on her son. He was fine, of course so she had some lunch, then went out to the pool to enjoy some sun.</p><p>About an hour passed before Tina stepped outside. “Mrs. Anderson, you have a guest in the living room waiting for you,” she said.</p><p>“Thank you Tina. I’ll be right in.”</p><p>Jessica reluctantly dragged herself back inside the house and found Alex sitting in the living room with a pleasant looking woman. She appeared to be in her fifties, with eyes that sparkled and had laugh lines around them. Jessica didn’t want to like the woman. She didn’t want to admit the need for a nanny.</p><p>“You must be Mrs. Anderson. I’m Julia Scott. I’m hoping to help you take care of your precious son.” The woman stood up and shook Jessica’s hand.</p><p>“It’s great to meet you, Julia. I’m sure Alex told you I’m still unsure if I want to hire a nanny.” She felt obliged to be fully honest to the woman.</p><p>“I understand it’s a scary thing to leave your child in the care of a stranger. Why don’t we just get to know each other a bit and go from there,” the woman replied kindly.</p><p>The three of them spoke for a while, then Jacob woke up from his nap. Jessica fed him before handing him to Julia. Julia had worked for the same family for fifteen years until all the kids grew up. She was now looking for a new family. Jessica could find nothing wrong with her and the thought of someone helping out with the baby was beginning to look more appealing.</p><p>“Your son is very beautiful,” Julia said after a little while. Jacob was sitting on her lap playing with one of his teething rings.</p><p>“We sure think so,” Alex stated proudly.</p><p>“I think all children are a gift and precious of course but Jacob is very mild mannered. Is this unusual or is he a happy baby for the most part?” Julia questioned.</p><p>“He’s an exceptionally good baby. I’ve heard horror stories of babies staying up all night and having colic, crying for hours and hours on end. I’ve had none of those problems so far with Jacob. He wakes every few hours, which is normal but he’s never had any problems. The only time he fusses is when he’s hungry,” Jessica said fondly.</p><p>“It wouldn’t matter to me either way,” Julia said. “If a baby is crying there’s a reason for it. He’s either hungry, needs changed, needs some extra love, or is hurting and trying to tell you about it. One of my previous kids was very colicky. We would walk the floors for hours on end. It was just an excuse for me to get to cuddle with him longer,” she remembered fondly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jessica could tell she was telling the truth. The woman seemed to have unending patience, which was definitely a must for a child care provider. She was shocked to find she did like the woman.</p><p>“As much as I hate to leave this precious little one, I will get going and let you both get back to your day,” Julia said and then handed Jacob back to Jessica.</p><p>“We’ll discuss things and get back to you within the next couple of days. I have all your information. We really appreciate you coming by and spending so much time with us today,” Alex said, as he led Julia from the room.</p><p>“Thank you both very much. You have a beautiful family and I would love to be a part of it,” Julia replied, then left.</p> <p>“What do you think?” Alex asked her.</p><p>“I think she seemed pretty great. I guess the idea of a nanny wouldn’t be all bad. It was nice to be able to take a nap today,” Jessica conceded. Her face turned a shade of red, as she was picturing the way she’d woken up from her second nap that afternoon.</p><p>Alex’s eyes darkened, also remembering the pleasant way they’d awoken. His hands itched to grab her and pull her close.</p><p>“I’ve already run the background check and verified her references. Her last family couldn’t say enough great things about her. The kids all remain in contact with her and consider her an honorary aunt. They adore her and the family begged her to stay on with them, even after the kids had grown but she told them she needed to continue to be a nanny. She loves young ones far too much to give that up.”</p><p>“I guess there’d be nothing wrong with trying it out,” Jessica conceded. “Just make sure to tell her we aren’t sure if it will be a permanent situation,” she added, not sure if she wanted to commit to a nanny long term.</p> <p>“I’ll give her a call. She already told me she could begin tomorrow.” He left the room and Jessica was a little nervous with how quickly things were moving along.</p><p>The rest of the afternoon and evening flew by. Alex spent most of his time in his home office and Jacob was fussy, requiring all of Jessica’s attention. She was grateful to have gotten the nap in, because she had a feeling it was going to be a very long night.</p><p>Alex helped her walk Jacob around during the evening. She was trying to stay unattached but he made it very difficult when he was amazing.</p><p>Around nine that evening Jacob’s fever broke and he finally fell asleep. Both Alex and Jessica were happy he was feeling better and breathed sighs of relief as they stared down at their sleeping child.</p><p>The crying didn’t bother either of them. They just felt powerless with their son not feeling good and not being able to do more than walk him.</p><p>“He’s cutting his first tooth and it’s hard on him. I think the worst of it’s over now,” she said, in explanation of Jacob’s illness.</p> <p>“I wish there was more I could do,” Alex replied.</p><p>“I know. But the best thing to do is cuddle him and walk around. He enjoys the motion and I think getting to look around helps him to not feel the pain.”</p><p>“Let’s go to bed. I’m exhausted,” Alex said, while he turned towards their bedroom.</p><p>Jessica hesitated. Alex had said he wouldn’t push her into anything but she knew he didn’t really have to push. She wasn’t sure if she was ready yet to share a bed with him. She’d already involved her feelings way too much into the marriage and was afraid to hand over her entire heart.</p><p>“Jessica, we aren’t going to do anything you don’t want to. Let’s just go to bed,” he repeated to her. She could see the irritation in his eyes and hear it in his voice. She knew he didn’t like that he had to push his wife into sleeping with him.</p><p>“Fine Alex, I agreed to this marriage so I’ll share the bed. I’m sorry if I misled you on the couch today but I don’t want to have sex.” She finished talking and stepped ahead of him into the room. She grabbed her favorite pajamas and went to the bathroom to change.</p><p>“You can try to run but you want this just as much as I do,” Alex whispered, far too quietly for Jessica to hear. He knew it was going to be a long night. He was determined to have her come to him though. He knew it wouldn’t take long.</p><p>Alex climbed into bed, wearing nothing but boxer shorts. He only kept those on out of deference to her. He preferred to sleep in the nude. He was lying on his back, with his hands under his head and the covers were only pulled up to his waist.</p> <p>Jessica took a deep breath at the sight of him when she walked out of the bathroom. He was unbelievably sexy. He had the perfect amount of muscles, rippling with each movement he made. His stomach was hard and defined and the trail of hair on his lower stomach disappeared under the blanket, causing her mouth to water. She wanted to trail her fingers over him, finding all his favorite spots. Even as exhausted as she was feeling, she knew she’d be lucky to get any sleep lying there next to him.</p><p>He said nothing to her but followed her every move as she slowly walked to her side of the bed. She quickly jumped under the covers, turning away from him, hugging the edge of the bed like it was a lifeboat. She pulled the covers up to her chin and started counting sheep. He flicked off the bedside lamp and before she knew it, exhaustion took her into blissful nothingness.</p><p>Alex lay there, hard and aching. He knew if he reached out and pulled her close, she would easily succumb to him. But he didn’t want to coerce her. He wanted her to come to him willingly. If that meant he needed to take a few cold showers while he waited then that’s what he’d do. He finally drifted into a restless sleep.</p><p>Alex woke up with Jessica pressed up against him. He was lying on his back with her facing him. Her leg was wrapped over both of his and her arm was around his lower stomach. Her head was resting on his shoulder, placing her mouth mere inches away from his own.</p><p>He glanced at the clock, noticing it was midnight. They’d been in bed only a couple of hours. She must’ve drifted over to him in her sleep. He was too tired and far too turned on to play the gentleman.</p><p>She started to stir and wiggled against him, causing his body to physically jerk in the air. He could feel himself begin to pulse. He wanted to bury himself deep inside of her and damn the consequences.</p><p>He turned so they were facing each other and his hands started roaming over her body. She pushed into him, letting out a moan of pleasure, starting to wake up. Her leg was still wrapped over him, though when he turned it caused his erection to be centered on her core. Only a wisp of fabric separating the two of them.</p><p>He ran his tongue over her bottom lip and her eyes parted slightly, at the same time another moan escaped her lips. He then gripped the back of her head and kissed her passionately. She woke up fully and kissed him back just as urgently.</p><p>His hands began to explore her once again and he stopped the kiss long enough to pull her nightgown over her head. He then resumed the kiss, pulling her so tightly against him, not a wisp of air could’ve gotten through. Her hips were moving against his erection and he was afraid their lovemaking would end far too soon.</p><p>He flipped her onto her back and moved his mouth down to her full breasts. She arched her back as his tongue ran over her budded nipple. He licked and caressed the fullness of her breasts, making her jerk upward, seeking more. He wanted to give them far more attention but was conscious of her nursing and knew too much play would cause problems. Instead he ran his tongue down the center of them and then nibbled his way across her stomach.</p><p>She was pleading with him to take her. He was close to doing just that but he would make sure their time together was good for her too. The only other time they’d made love, in the elevator, had ended far too quickly.</p><p>He ripped the last barrier between them away from her body and then his mouth was kissing her in the most intimate way possible. She jerked her hips in the air as pleasure washed over her. “Alex please...” she cried out.</p><p>He couldn’t take any more, as he quickly shed his own shorts and then poised over her. “You’re so beautiful,” he gasped, as he looked down into her flushed face.</p><p>He thrust his tongue into her mouth at the same time he finally gave them both what they wanted and submerged his engorged shaft deep within her folds. She jerked her hips upward, wanting him even deeper. He gladly obliged her unspoken request.</p><p>He could no longer hold anything back. He pushed into her fast and she matched him thrust for thrust. She was panting and then suddenly cried out. He felt her pulsing around him and he lost all control. He pushed in one final time and then spilled deep inside of her.</p><p>With his last ounce of energy he turned onto his back, while pulling her up close to his side. He wasn’t letting her pull away from him again. He’d broken his rule of making the first move but she hadn’t offered any form of resistance and they weren’t taking steps back.</p><p>Neither of them said anything but after their breathing returned to normal, he felt her trying to pull away. He just tightened his arms around her. “Go back to sleep Jessica,” he commanded. She gave up the fight soon drifting off. He quickly followed her.</p><p>Chapter five</p><p>Jessica woke up and turned over. Ouch! She was sore. She sat up, realizing she was alone in the very large bed. Her hands flew to her face as she replayed the previous night in her mind. She and Alex had made love, not only once but twice. The first time, when she’d woken up plastered against him and the second time, after feeding Jacob and laying back down.</p><p>There’d been no hesitation on her part. He’d reached for her and she’d fallen instantly into his arms. How was she supposed to keep her distance from the man when the second he touched her she melted? She was relieved and saddened at the same time to find herself alone.</p><p>She quickly got up and checked on Jacob, who fortunately was still sleeping. She had time to shower and work out her stiff muscles. She hadn’t done anything that physical in too long to remember.</p><p>She finally dressed, gathered Jacob and headed down the stairs. “Good morning, Mrs. Anderson. I hope you slept well,” Tina greeted her.</p><p>“I did. Thank you,” she automatically replied.</p><p>“Mr. Anderson asked me to tell you he had to run into the office today and would be gone all afternoon. He said the new nanny would arrive around eight,” she said, before placing Jessica’s breakfast before her.</p><p>“Thank you.”</p><p>Jessica fed Jacob while eating her own breakfast, then settled down in the den to wait for Julia, her new nanny.</p><p>Julia arrived early and got her room organized in no time. Jessica, Julia and Jacob spent the day together around the house. Jessica couldn’t find any faults with Julia and had to admit it was very nice to have an extra pair of hands to help with the baby. She eventually even went to spend some time in the garden, without fear of not hearing Jacob.</p><p>Jessica decided if her marriage ended up not working she was going to keep Julia with her. She was enjoying the help and could see Julia loved children.</p><p>As Jessica sat in the garden, she tried to figure out how she really felt about her husband. They did enjoy each other’s company, she was definitely attracted to him and they shared a child together. He was unlike any man she’d ever known before. She would have to do some real soul searching, because she was terrified to let her guard down and let him in. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jessica didn’t know how long she sat in the garden daydreaming but soon Julia was walking towards her with a fussy Jacob in her arms. “Your son’s ready for his lunch,” Julia said with a smile.</p><p>“I’m so sorry, I didn’t realize how long I’d been sitting out here,” Jessica quickly said. She immediately got up and headed towards Julia and her son.</p><p>“You deserve some time to yourself. Don’t feel guilty for enjoying a few moments of peace in an otherwise hectic day,” Julia chastised her gently. “Your son can wait long enough for you to clean up,” she added.</p><p>Jessica looked down at her hands and noticed they were covered with dirt. She looked up and smiled sheepishly. “I guess I should wash my hands before taking him,” she replied. She bent down and kissed Jacob’s soft head before they headed inside.</p> <p>Jessica cleaned up and took Jacob. It was really nice to have Julia’s help but holding her son was the most relaxing thing in the world to her.</p><p>“Tell me about your last family,” Jessica asked once her son was settled down and eating.</p><p>“They’re a wonderful family. I worked for them for twenty years. I was there for the births of the youngest two children and their oldest child Justin was only a year old. Their mom was a lot like you. She wanted to do everything on her own but found having some help gave her the extra energy to be a great mother,” Julia replied.</p><p>“It’s really nice to have someone around. I’ve always thought doing things on my own was the only way to do something but my mother’s told me many times it’s okay to ask for help,” Jessica said.</p><p>“I couldn’t imagine my life any other way. I wasn’t blessed to have a family of my own. I do appreciate you sharing the joy of being there for Jacob with me,” she said with sincerity.</p> <p>Jessica knew they were going to have a great relationship. “We’re really glad you’ve come into our lives,” she said.</p><p>They both chatted while Jacob ate, then Jessica excused herself and took him to bed. She was comfortable enough in her home to take another nap, knowing everything would be okay. She felt at peace in her home.</p><p>The next couple of months flew by in a blur. With Julia there to help Jessica she was able to focus on her writing and felt like she was accomplishing something. She still spent most of her time home but when she ran errands or worked on her book she didn’t feel like Jacob was being neglected.</p><p>Her nights were regularly filled with passion. She and Alex didn’t spend much time together during the days, with him gone for work. But when they climbed into bed together it was like they were there for the first time, every time. It was magical and she knew if it were to end suddenly her world would be destroyed. She was too dependent on Alex’s attention.</p><p>Jessica started to become restless around the big house. There didn’t seem to be a lot for her to do. When she received a call from an old college friend, informing her about a part-time job at the local newspaper for a writer she jumped at the chance. She’d already been weaning Jacob and it would be great to get out of the house.</p><p>She was so afraid of losing her sense of self and she could work part-time without guilt. Her child was in more than capable hands and the staff ran the house. It would be good for her to do something simply about her.</p> <p>“Now Jessica, I want to remind you this isn’t exciting news. It will be covering city meetings and school events but it’s still an important part of the paper.” Jessica was in Marcia’s office, her editor, discussing her new job details.</p><p>“I understand Marcia. I’m not out to change the world. It’ll be nice to be writing and get out of the house,” Jessica reassured her new boss.</p><p>“Good. I’m glad we’re on the same page. Your first assignment is at the city hall. They have a meeting this afternoon at two. Do a short article on the topics of discussion and of any issues that arise.”</p><p>“I’ll be there. Thank you for this opportunity Marcia. I really appreciate it.”</p><p>“I have to admit I was a little surprised you wanted to work a job like this. You have a very impressive resume and could work for any major publication you wanted,” Marcia stated.</p><p>“I’m a full time mother now and the kind of careers I’m qualified for require sixty plus hours a week. I’m not willing to be away from my son too much. I plan on eventually writing novels but would like to stay out in the workforce as well.” Many people assumed just because Jessica had access to money beyond what most people ever dreamed of having she’d be a spoiled heiress. It never took her long to prove herself though and she knew she would gain the respect of her co-workers at the paper.</p><p>“Well, we’re happy to have you join our team. The article is due by noon tomorrow. I’ll see you then.” Marcia went back to work and Jessica headed outside to her car. She had about an hour to kill before the city hall meeting so she headed to the mall for a smoothie and some light shopping.</p><p>The meeting was a bore, as she knew it would be. It was difficult but she managed to place a good spin on the article and her editor was more than happy with her work. She found it amusing she was taking so much pride in her small job but she felt useful and good about herself. It was the first time in a while she felt needed.</p> <p>She drove home, still feeling great. When she stepped through the doors, she could smell the wonderful aroma of dinner cooking and hear Jacob giggling somewhere. She followed the sound.</p><p>She stepped into the den and found Alex on his back, with Jacob balancing on his knees like he was flying through the air. He let out another giggle. Jacob spotted his mom and started wiggling to be let down.</p><p>Alex looked up to see what caught his son’s attention, then gave Jessica one of his killer smiles. Setting Jacob on the floor, the baby crawled as fast as his chubby legs would allow to his mother.</p><p>Jessica scooped him up in her arms. “How’s my handsome young man?” she spoke to her son, as she nuzzled his neck, causing more giggles.</p><p>“He’s doing great. How was your first day at work?” Alex seemed genuinely interested, which surprised Jessica.</p><p>“It was actually great. I know it’s not a big time paper and my name isn’t going to go up in lights or anything but I like the people down there and it’s nice to be working again,” Jessica said, almost defensively.</p><p>“Hey, I’m not judging you,” Alex said, while holding his hands out. “Seriously, I really want to know how your day went and what you did,” he finished.</p><p>Jessica eyed him suspiciously for a few moments and then decided to tell him about her article and the people she’d met.</p><p>“I need to go in tomorrow for a couple of hours and then I thought I would go to the salon. I haven’t had my hair or nails done since before Jacob was born and it would feel heavenly,” she said with a little guilt for leaving her son while she pampered herself.</p><p>“You deserve to take some time for yourself. You have nothing to feel guilty about. Jacob is fine. He knows you love him and he won’t be scarred for life because his mother got her nails done. Stop being so hard on yourself,” he stated, as if he could read her mind.</p><p>“I know you’re right but I promised myself I wouldn’t be one of those mothers who left her child in someone else’s care while she ran all over the place. It feels wrong, especially with him still being a baby.” She headed over to the bar and poured herself a half glass of wine.</p><p>Jacob was happily playing with some of his toys on the floor. Jessica and Alex sat on the couch and watched him amuse himself.</p><p>“You’re a great mother. If you take care of your own need as well as his, you’ll always be a great mother. Women who sacrifice everything for their husbands or children end up resentful. You don’t want that to happen do you?”</p><p>Jessica looked at Alex, slightly puzzled. This was one of the most real conversations they’d ever had. It was nice to come home and voice her concerns with the man she loved. Her world stopped as she realized she really did love Alex. She’d tried to avoid it but she loved her time with him. She loved how he was with their son and she loved what he stood for.</p><p>She was so afraid her face would somehow show her newfound feelings so she stood up, under the pretense of checking a toy Jacob was playing with. She composed her features, then turned back towards Alex.</p><p>“Thanks Alex. I needed to hear that. I’ll take a little me time and not feel guilty about it. I’m going to wash up and change for dinner.” She didn’t give him time to answer her. She quickly slipped from the room and headed to her shower, where she could wash her worries away.</p><p>By the time Jessica came back downstairs, dinner was ready and Jacob was seated in his high chair. He was happily stuffing creamed food into his own mouth. More food was on him than in him but he enjoyed himself so it was okay.</p><p>“I hope you had a great first day at work,” Julia said.</p><p>“It was very nice. How did the day go with Jacob?”</p><p>“He was his usual happy self. He took only a short nap this afternoon though, so I think he’ll be ready for bed early tonight. He’s almost finished with his supper so I’ll take him up for a bath while you eat.” Jessica was happy they’d found Julia. She knew Julia loved Jacob as much as Alex and she did. She was certainly an invaluable member of their family now.</p><p>“Thank you Julia. I know I don’t say it enough but I’m grateful you’re a part of our family. I could’ve never spent the afternoon away from my son if I wasn’t one hundred percent sure he was in capable hands.” Jessica got up and gave Julia a hug.</p><p>“The honor’s all mine. You have a beautiful family and I’m very happy to be a part of it,” Julia said before heading off to bathe Jacob.</p><p>Alex and Jessica finished their supper in an almost uncomfortable silence. When they were talking about Jacob or making love they were in perfect harmony. In any other situation the silence was awkward.</p><p>“I’ll be going to my brother’s ranch tomorrow,” Alex finally broke the silence.</p><p>“That’s good. You haven’t taken a day off in a while,” Jessica replied.</p><p>“He has a roundup that needs done and then we’re all going to meet for a barbeque afterwards,” he continued.</p><p>Jessica was nervous. She hadn’t been around his family since the wedding. Joseph and Katherine came over regularly to play with Jacob and Alex had taken the baby over to his siblings a couple of times but there hadn’t been any family gatherings. She was nervous to face them all as a group.</p><p>It was especially nerve wracking to be around Lucas and Amy. They were so obviously in love with each other and she herself felt like such a fraud. Jessica knew each day she spent with Alex she fell a little bit more in love but she also knew he didn’t return the feelings. If they didn’t have Jacob together they wouldn’t have a marriage at all.</p><p>“I’m not sure if I’ll be able to attend tomorrow but if you want to have your parents stop by and grab Jacob that would be okay,” she tried to say nonchalantly.</p><p>Alex stared at her for a few moments before responding. “Look Jessica, I understand my family can be overwhelming and you’re still trying to get used to everything but they would be hurt if you didn’t come. Your parents will even be there. Can you please just forget about everything else going on for one day and come enjoy yourself?” he asked, while never breaking eye contact. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jessica knew once again she’d been defeated. Her parents would drag her there anyway if they saw she didn’t show up. She could try and fake an illness but her mother knew her more than anyone. She would take one look at her and it would be over.</p><p>“I just had to work on an article I was writing but I’ll do it the next day,” she finally conceded, hoping he bought her story. She didn’t want him to know she was really just a coward.</p><p>Alex continued to look at her for a while before he nodded. She knew he didn’t buy her story but thankfully he was man enough to not call her on her lies.</p><p>“I’m going to head up to bed and read for a while,” Jessica finally said, having lost all of her appetite.</p> <p>“I have some work to finish up. I’ll join you in a while,” Alex replied before getting up and heading out of the room.</p><p>Jessica wanted to talk to him about her feelings and try and make the marriage about more than just their son and sex but she didn’t know how to bridge the gap. She was afraid if she brought anything real up, he would run from her.</p><p>Chapter Six</p><p>“Surprised you could climb out of the newlywed bed long enough to join us,” Mark took a shot at his brother, while punching his arm. “Heck we didn’t see Lucas for at least six months,” he continued.</p><p>“You’re lucky you’re seeing me now. Amy’s about to have the baby,” Lucas said, while looking down at his phone for the hundredth time.</p> <p>“Trust me; your ringer is working just fine. If anything happens you will be the first one who knows about it,” Mark laughed.</p><p>“I know. I know. I worry so much about her being so pregnant. I know she’s with mom and dad but man, it’s hard to be away from her right now,” he smiled sheepishly.</p><p>“Thank the lord I’m still single. You two are just a little too gushy for my tastes,” Mark sighed before jumping the fence.</p><p>Lucas and Alex were right behind him. “You’ll be next you know. We both thought we would hold out and look at us. Not only are we married but fathers as well. Your day is coming,” Alex grinned at his younger brother.</p><p>“No way man, I’m a confirmed bachelor and that’s how I would like to keep it. I have my hands full with all of these animals. I don’t have any time for women or babies in my life,” he added.</p><p>Lucas and Alex just looked at each other and smiled. They knew their younger brother would fall and it would be their pleasure to watch it happen. “I thought you said there was some work to be done,” Alex goaded him.</p> <p>“You’ll be begging me to stop by the end of the day. I bet you fall over and embarrass yourself in front of your bride,” he said with a hopeful wink.</p><p>“Bring it on little brother,” Alex replied, accepting the challenge.</p><p>If an outsider was looking at the trio of men they’d think they belonged on a ranch. No one would be able to tell Lucas and Alex both worked in offices and flew around the world on Jets. Mark, of course was a full time rancher but it was by choice. He’d decided early on in his life office work wasn’t what he wanted to do.</p><p>Their father, Joseph loved his boys intensely and supported their decisions. When Mark decided to ranch he supported him one hundred percent.</p><p>Lucas, Alex and Mark looked dashing in their worn Stetson hats and boots and painted on jeans. They rode the horses around like rodeo champions and literally stopped women in their tracks when they went by.</p><p>The brothers spent the afternoon bringing the cattle in and branding them. Mid afternoon they stopped by the lake for some lunch and basked in the summer heat.</p><p>“Any time you boys are ready to trade in your suits and run the ranch with me, you know you’re welcome,” Mark said with a cheeky grin.</p><p>“You know I love the land and helping you out here is a little slice of heaven but it wouldn’t take long before the appeal of travel and a nice clean suit would be calling my name,” Alex said.</p> <p>“You know dad would lasso you up for trying to take me away from the office. He’s retired and doesn’t want to go back,” Lucas added.</p><p>“I’m just saying...” Mark left the sentence unfinished.</p><p>Lucas and Alex both sighed in unison.</p><p>“Ok last one in has to do the grilling,” Mark said while stripping down to his boxers in record time and diving into the lake.</p><p>“Ah crap,” Alex yelled while trying to yank his boots off. He glanced over and saw Lucas had the lead. Lucas dived in about two seconds before he did.</p><p>“I think you guys cheated again,” Alex laughed. “You know you just want me grilling because I’m the best one at it. You guys always burn that beautiful Angus Meat,” he added.</p><p>“Hey, when you’re right, you’re right,” Mark said before sending a slew of water right into Alex’s face.</p><p>“Now the war’s on,” Alex stated before a massive water fight erupted. When the brothers all got together, it was like they were teenagers once again. They had a bond stronger than most siblings and all three of them would take a bullet for one another. They knew they were so close due to being raised by phenomenal parents.</p><p>“Ok, ok, I call a truce,” Lucas finally said, while dragging himself out of the water. Mark and Alex followed. The three of them settled down on the soft grass and enjoyed the sounds of nature all around them.</p><p>“So how are things with your wife and amazing son going?” Lucas asked Alex.</p><p>“Things are great. Jacob is growing like a weed. I can’t believe how important he is to me. I can even imagine having about ten more of him running around,” Alex said with true fondness for his son.</p><p>“And what about Jessica?” Mark asked.</p><p>Alex hesitated for a moment. He didn’t really know how to describe his relationship with his wife. He knew if he told his brothers it was none of their business they’d back off and leave him alone but it would feel good to talk about his conflicted emotions.</p><p>“Honestly, it’s really complicated. We married because basically I didn’t give her any choice. She had my son, which she kept from me,” he said with an edge to his voice. He was still unhappy she hadn’t told him about the pregnancy. “Somewhere along the line though, in the last few months I’ve found I’m excited to see her. I look forward to coming home, knowing she’ll be there.” He didn’t add anything else. He didn’t want to even mention the Love word.</p><p>Neither brother spoke for a few moments. They seemed to understand he was trying to figure things out in his own head.</p><p>“You know things didn’t start out so well for Amy and me either, little brother,” Lucas finally said. “I fought hard against my attraction to her. I, in no way wanted to be in a relationship. On the other hand I’d never wanted a woman like I wanted her. She would walk into the room and I was on instant alert. I tried to tell myself it was just some weird hormonal imbalance but even though I was fighting it I knew it was a losing battle,” he finished.</p><p>“Everyone can see you and Amy were meant to be together. Things may have started out rocky for you but you’re disgustingly in love now. There isn’t a woman out there who could love you like she does. It’s the only reason she puts up with your ugly hide,” Alex finished and punched Lucas in the arm.</p><p>“Yeah, it sounds to me as if the both of you are just love sick. Thank the Lord it will never happen to me,” Mark added with a cocky smile.</p><p>Lucas and Alex looked at each other and smiled. They knew their brother would go down kicking and screaming but they knew he would go down. It would be immensely pleasurable for them both to watch.</p><p>“I may not be in love like Lucas but it’s nice to have something to come home too,” Alex said. He felt a twinge of pain as he said the words. He figured he was lying to himself, saying he wasn’t in love but it was better than the alternative of being vulnerable.</p><p>“Yeah, I think you’re fooling yourself little bro. I’ve seen the way you look at Jessica. It’s more than just lust. You look at her the way I look at Amy. The sooner you accept that fact and enjoy being married, the sooner you can stop hurting all the time. Man, when I finally just let myself open up, my whole world changed. Seriously, if something were to ever happen to Amy, I couldn’t survive it,” Lucas finished.</p><p>He then pulled his phone out for the millionth and one time to see if he’d missed a call from his very pregnant wife.</p><p>“Give it a break bro; your wife will call you if she goes into labor. Your phone will not miraculously miss a call and if one or either of these things did happen, someone would come running to find you and rush you into the hospital,” Mark said.</p><p>“I know, I know but wait until you’re the one in my position. There’s nothing greater than your wife giving birth. It’s amazing and beautiful and at the same time terrifying. I’d gladly take her every pain if I could. It kills me to just stand by, only holding her hand. But then there’s this beautiful child resting in her arms and she’s smiling at you with this radiant joy showing on her face. There’s nothing like it in the world,” Lucas finished.</p><p>Alex sat there quietly, listening to Lucas talk. He was jealous of his brother, which was very unusual. He wished so much he could’ve been there for the birth of his son. He was still angry Jessica had taken that from him. He should’ve been there for his son’s first cry. He should’ve been there to be able to protect them both.</p><p>“That sounds like heartache I don’t want to deal with,” Mark laughed. The joke brought Alex back to the present. He laughed but it was forced. Thankfully his brothers let it go.</p><p>“Well, we better get back to work. Everyone should be here in a couple of hours. We don’t want them to realize we play out here more than we work,” Lucas said. He got up and headed over to get back on his horse.</p><p>They all finished up with the cows and headed into the barn to brush down their horses.</p><p>“It’s about time you boys quit playing around and got back here,” came the booming voice of their father, Joseph.</p><p>“Hey Dad,” all three boys said in unison and then went up and gave their father a big hug.</p><p>“You have a house full of people all waiting on you three,” he said good naturedly.</p><p>“Well, that’s because they all know I’m doing the grilling,” Alex smiled.</p><p>“I think it’s because they know your mama and your beautiful brides have been busy making everything else,” Joseph answered back.</p><p>“Mmm, I hope Mom made her famous chicken salad,” Lucas said.</p><p>“Well you should know your mom still spoils you boys rotten. I try and tell her you’re all grown up and don’t need her spoiling but she won’t listen to me,” Joseph said. The three boys looked at each other and rolled their eyes. They knew their father was the biggest softie of them all.</p><p>“Sure Dad, Mom’s the only one who spoils us,” Mark said, while smacking his dad on the back. “Let’s head on in so we can get some of Mom’s salad and Alex can get those steaks on the grill,” he continued. His mouth was starting to water just thinking about it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Did you lose again,” Joseph turned his attention towards Alex.</p><p>“Ah Dad, you know they cheated because I’m the only one who can cook worth a lick,” Alex said.</p><p>They had a laugh and walked comfortably up towards the house. They could hear people laughing and talking, even from the barn. Mark loved having his family and friends at the ranch. He was a lucky man. There was no need for a woman in his life, he thought. He was surprised by the slight pang that struck his gut. He decided to push it right out of his mind.</p><p>“So Mark, when are you gonna settle down like your brothers and give your poor mama some grandbabies. You know she’s not getting any younger and she cries at night from the heartbreak of a son intent on living alone,” Joseph said.</p> <p>Mark sighed before he spoke. “You know none of that’s true, Dad. You’re the one who wants all those grandbabies running around. I think Lucas and Alex are doing just fine at giving you a bunch of little Andersons,” he said. “And if Mom heard you say she was old, you’d be in for a world of hurt,” he added with a wicked grin.</p><p>“Now don’t talk back boy. Of course it’s your mama who’s worried about you,” he repeated. “And if you dare tell your mom what I said, you’ll be the one in a world of hurt,” he threatened.</p><p>“Ok Dad, you can let her know I’m staying a confirmed bachelor. There are far too many hearts that would be broken if I decided to tie the knot. I don’t want to be responsible for all that heartbreak,” he said with a chuckle.</p><p>“You know he’ll fall just like we did,” Lucas added his two cents.</p><p>“You stay out of this Lucas,” Mark said with a bit of a grumble.</p> <p>“Don’t worry about it bro, married life isn’t all that bad and its way cool to be a father. Speaking of fatherhood, where’s my boy?” Alex asked his dad.</p><p>“He was playing with his cousin when I headed down here,” Joseph smiled fondly, while speaking about his grandkids.</p><p>Alex and Lucas both picked up their pace so they could see their kids. Mark shook his head, thinking his brothers had it bad. At least he liked their wives and those kids were pretty dang adorable.</p><p>Jessica stalled at the sight of Alex walking around the corner of the house. The man was stunning every day but in skin tight wranglers, boots and a worn hat he was the sexiest thing she’d every laid eyes on.</p><p>As if Alex felt her eyes on him, he looked up and they stared across the yard at each other. She forgot there was anyone else even there as he neared her. He smelled like a hard working man and she was practically drooling.</p><p>Without saying a word, he pulled her into his arms and crushed her lips to his. Her arms wrapped around his neck to pull him even closer. Her heart was racing and fireworks were shooting off, all over her body. His hands started rubbing up and down her back and she was ready to start taking off his clothes.</p> <p>“Uh um, Alex those steaks should get started,” Mark interrupted them.</p><p>Jessica jumped back like lightening had just struck them both. She’d been so focused on Alex she’d forgotten anyone else was there. She could feel her face turning many dark shades of red.</p><p>Alex looked at Mark and growled. Jessica did a double take at her husband. She couldn’t believe he’d actually growled. Her mouth was gaping open in shock.</p><p>Mark laughed and pulled Alex away. “Come on bro, you have all night to be with your beautiful bride,” he said. Mark turned and gave Jessica a wink, which made her blush even more.</p><p>“Woo girl, that was enough steam I’m surprised my water didn’t burst right then.” Amy was laughing as she walked up to Jessica.</p><p>Unbelievably Jessica’s blush deepened even more. “I’m a bit mortified right now,” she managed to say.</p><p>“Don’t ever be embarrassed for desiring your husband. He’s a sexy, vibrant man and you guys are newlyweds. I can’t wait for this beautiful baby to make his entrance into the world so I can rub up against my husband again. Right now he has to try and make his way around my whale like body,” she smiled sheepishly.</p><p>“You’re the most beautiful pregnant woman I’ve ever been around,” Jessica said, meaning what she spoke.</p> <p>“Thank you but I feel like I not only swallowed one watermelon but about ten of them.” She spoke the words, while rubbing her stomach. There was real pride in her eyes and voice. She may have been complaining about her baby bump but she obviously already loved her unborn child.</p><p>“I know I did a lot of moaning and groaning in the last month of my pregnancy but all the bloating and aching was well worth it when I held my baby boy in my arms. I don’t get to hold him much when this family is around though. He’s definitely a celebrity here,” she finished with a smile.</p><p>“It’s the same way with Jasmine. They adore her. I love how much this family values each of their own. I also love how much they love the adopted family members like you and I. Once you’re a part of this family, it’s for life,” Amy added with a smile.</p><p>“I’m so nervous around everyone though,” Jessica admitted. “You and Lucas obviously love each other with such a deep passion. Alex was forced to marry me because of Jacob,” she said with a sad quiver at those last words.</p><p>Amy immediately wrapped an arm around Jessica. “I love Lucas heart and soul but trust me when I say it didn’t start out strong. We seemed to have an instant dislike for each other. I wasn’t willing to marry him. I felt how you do. I felt like I was trapping him. I’d wanted a baby so badly for so long and I’d wanted to belong to a real family and I felt like I’d somehow made the pregnancy happen. We were both fighting our attraction like crazy. I thought I wasn’t good enough for him.” She said with tears in her eyes.</p><p>“I was so, so very wrong. I want to really emphasize that point to you. We fought our attraction, which was stupid, because I see that now as wasted time. We love each other and it only grows stronger. This family loves me and my daughter with a passion as well. They love you too and so do I. You will one day wake up and wonder what took you so long to see how much you’re meant to be together,” she finished.</p><p>The two women finished by giving each other a hug, even though it was a little bit difficult with Amy’s belly protruding between the two of them. Amy giggled, “See I told you this thing is always in the way.”</p><p>“Well, I repeat you’re absolutely beautiful,” Jessica said.</p><p>“There’s my pregnant wife. How are you feeling? Shouldn’t you be sitting down? Can I get you anything?” Lucas walked up, fired a bunch of questions at his wife and then placed his arm around her like he was going to pick her up and carry her off to bed.</p><p>Amy laughed at her worried husband and reached up to place her hand on his face. It was such an intimate moment Jessica felt like an intruder.</p><p>“I’m fine, hunny. You need to quit worrying so much. I told you if there was anything at all wrong, you’d be the first to know,” she reassured him. Lucas then bent down and kissed Amy with such a tender passion, it brought tears to Jessica’s eyes. She wanted that same love with Alex. She knew her heart was going to get broken into a million pieces because she fell for him more each day.</p><p>They finally broke apart and now Amy’s face was the one flushed instead of Jessica’s. “Now you go and help your brother cook while I waddle over to that comfy lounge chair and continue chatting with my favorite sister-in-law. No wait, scratch that, just my sister,” she finished smiling fondly at Jessica.</p><p>The words choked Jessica up even more. She was grateful she’d decided to put her worries aside and join the family gathering. Her son was getting all kinds of love and she knew she and Amy were going to be true friends. She needed one in her life.</p><p>“I would listen to her Lucas; pregnant women tend to change moods faster than a speeding bullet.” Both girls giggled and then Amy took Jessica’s arm and they walked towards the lounge chairs and warm fire.</p><p>“But Alex lost fair and square, which means I can hang with you,” Lucas said, sounding like a little boy. Amy gave him a look and he conceded defeat.</p><p>Lucas walked up to his brother, offering his help. “Ha, looks like you were annoying your wife as much as you were annoying us today with all your worrying,” Alex goaded him.</p><p>“I wasn’t annoying her, she was just having girl talk with your wife about you,” Lucas said with a wicked smile.</p><p>Alex’s head whipped around, as his confident smirk fell. “What were they saying?” he asked.</p><p>“You know, its girl talk. No boys allowed in that conversation,” he said, liking having the upper hand again. His smirk faded though as he sought out his wife. He wanted to take her home and keep her safe. He was worried with all the walking she was doing. He wouldn’t survive it if something happened to her or the baby.</p><p>“Yeah kinda sucks being over here huh?” Alex mocked him good naturedly as he noticed his brother staring at his wife.</p><p>“I love her so much Alex. I really can’t remember life without her,” he said with real passion. “I know you love Jessica and I know you’re confused right now and I know things aren’t perfect but they didn’t start perfect for us either. I promise you it will get better,” he finished with sincerity.</p><p>“It’s all good. Why don’t you quit talking like a girl and help me grill,” Alex said, changing the subject.</p><p>“Okay, I don’t want you running to Amy and telling her you did all the work. Then I’ll get in trouble,” he said as he grabbed some tongs and started flipping the juicy steaks over. The smell reminded him he hadn’t eaten in hours and he’d worked his butt off all day. “Let’s get this done before I die of hunger. Man, Mark worked us hard today.”</p><p>“No kidding. I think little brother was trying to kill us,” Alex laughed.</p><p>“Did I just hear you tough boys whining?” Mark suddenly popped through the doorway.</p><p>“Not whining Mark, just discussing how sore I’m going to be tomorrow,” Alex said with a chuckle. “I guess I should try and get out here a little more often. I’m getting a little too used to that desk,” He finished.</p><p>“Hey, speak for yourself. I chase around an almost two year old daily. Let me tell you it’s a workout that rivals rustling up cows.” Lucas immediately looked around until he spotted his daughter. She was, of course, being coddled by her grandfather.</p><p>“Notice how Dad’s always telling us we need to give Mom grandkids but he’s the one who’s hogging them,” Lucas said.</p><p>“I know. Dad’s all bark and no bite. We all know he wants those grandkids for himself but man, have you noticed how good he looks. I’m really glad he has those two babies in his life. It’s brought a whole new youthfulness to his entire appearance,” Alex said.</p><p>Mark stood beside his brothers feeling a bit left out. He hadn’t felt that way since they were all young kids and they would sometimes run off ahead of him. He’d been too young to keep up but they’d eventually always come back for him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well I think I’ll just enjoy being a favorite uncle,” he finally spoke up. As if Jasmine had heard him, she looked up from where she was with her grandpa and spotted her dad and uncles. She started toddling over towards them as fast as her chubby little legs would carry her.</p><p>“Unca Mar, unca Mar,” she demanded as she held out her arms towards him. Her words were getting so much better but Mark wished she would keep the sweet baby talk forever.</p><p>“How’s my beautiful princess,” he asked, while he swung her up into his arms and blew raspberries on her tummy.</p><p>“Hungy,” she said and pointed to the steaks. “That’s Uncle’s good girl. Let’s get you some dinner. You can be my beautiful date. I will most definitely have the prettiest one here,” he said with total adoration in his eyes and voice.</p> <p>“Yeah,” Jasmine replied as she clapped her hands together, then grabbed Mark’s face and gave him a sloppy kiss, which he loved.</p><p>“Looks like this is ready,” Alex said. He motioned for the staff to come and gather up everything and stepped down with his brothers to be with the rest of their family.</p><p>They all had an amazing dinner. Everyone was enjoying themselves. It was hard to get two words in with all the laughter and stories being passed around the large picnic tables set up on the massive lawn.</p><p>Jessica finally allowed herself to relax and found she having a great time. She loved to watch Alex interact with his brothers. They all acted like little boys, as they were trying to best each other and telling many embarrassing stories about one another.</p><p>“...Seriously, you should’ve seen him standing there with his pants around his ankles...” Jessica heard Mark saying as she tuned back into the conversation. She’d have to ask Alex about that later. It sounded like she’d missed out on a great story.</p> <p>“Okay everyone ignore my brother. I think he’s had one too many if you know what I mean,” Alex said, as he motioned in the air like he was tipping a bottle up to his mouth.</p><p>“You’re just upset because you’re usually the one who ends up at the losing end of all these childhood stories,” Mark said as he lightly punched his brother in the arm.</p><p>Alex shrugged at the good natured teasing. He turned towards Jessica and gave her a smile. “I like the stories,” she said somewhat shyly.</p><p>Alex couldn’t help himself. He leaned down towards his wife and brushed his lips against hers in a soft kiss. It brought tears to her eyes and she quickly looked away and forced a bite of food down.</p><p>“Are you okay?” he asked her quietly.</p><p>“Yes, of course.”</p> <p>He continued to stare at her for a moment, making her want to squirm in her chair. Then someone else asked him a question, which gave her some time to compose herself. She was praying no one had noticed. She missed the knowing look on Joseph’s face. He was feeling pretty smug as he watched the love growing between his son and daughter-in-law.</p><p>Jacob gave a little giggle from his high chair, sitting right next to his grandpa.</p><p>“They are pretty silly, aren’t they?” Joseph said to his grandson, which made everyone laugh.</p><p>Suddenly there was a commotion at the other end of the table. Lucas was jumping up and looking around in all directions, like danger was approaching and he was going to take on an entire army.</p><p>“What are you jumping all around for boy?” Joseph asked with concern.</p><p>Lucas looked at his father with panic in his eyes. “It’s time Dad. Amy’s water just broke,” he said like he was a lost little boy.</p><p>“Well, why didn’t you say so,” Joseph stated with some panic in his own voice.</p><p>“Boys, would you please calm down. Child birth is natural and nothing to panic about,” Katherine said to her husband and son. “How far apart are your contractions?” she asked Amy.</p> <p>“About two minutes,” Amy said, a little bit short of breath.</p><p>“Well then, we’d better get you to the hospital.”</p><p>“Let’s go,” Lucas almost shouted.</p><p>“I’ll drive her Lucas. You’re far too freaked out to be driving anybody,” Katherine told him.</p><p>“Okay Mom.” He would never argue with his mother. He’d been raised too well to do something that foolish.</p><p>“Thank you to everyone who came out and spent this evening with us. You’re all so special to us,” Katherine stated to the large group consisting of family and friends. “We’ll keep you all updated on this beautiful new addition to our family and please keep Amy, Lucas and Jasmine in your prayers as they bring this new baby into the world,” she finished.</p><p>Everyone applauded, then got up to leave so the family could be together during their special time.</p><p>“Mark, you ride to the hospital with Alex and Jessica. The babies are getting tired and Julia can take them both back to Alex’s house if that’s okay with you,” Joseph said. Everyone nodded without even thinking of questioning him.</p><p>“Well good, that’s settled, let’s get going and wait for the newest member of our family to come into this world,” Joseph said excitedly.</p><p>Chapter Seven</p><p>“It’s a boy,” Lucas came bursting through the hospital doors. He was immediately engulfed in hugs and many congratulations from his family.</p><p>“Mom, Dad, Amy wants you both,” he said through the tears of joy rolling down his cheeks. Neither of them had to be told twice. They were immediately through the doors and off towards Amy and their newest grandson.</p><p>Jessica watched the happiness all around her with a mixture of happiness for her newfound sister and sadness for what she wanted in her life so badly. The thought of having another child, one that was planned with a husband who loved her was something she was afraid to even wish for.</p><p>“The rest of the family can come see Amy and the baby now,” a nurse said from the doorway.</p><p>“I can’t wait to see my new nephew,” Mark replied, before being the first one through the doorway.</p><p>The rest of the family followed. “He’s so beautiful Amy,” Jessica said.</p><p>“You may get a chance to hold him if his grandpa ever lets him go,” she teased.</p><p>“I have to make sure the little tyke is doing okay,” Joseph said, not even bothering to look up from his grandson.</p><p>“What are you going to name him?” Alex asked.</p><p>“We decided on Isaiah Allen after my grandfather,” Lucas said.</p><p>“That’s a real fine name son,” Joseph said, with some tears of his own in his eyes. He then quickly turned away while he tried to control his emotions.</p><p>“Ah Dad, we all know you’re a big softie. You don’t have to pretend to be some tough old guy,” Alex said.</p><p>“Now boy, you’re not too old for me to take you out behind the woodshed,” Joseph said but there was obviously no oomph behind his words.</p><p>“Hey now, there’s no bickering in my recovery room,” Amy said. She really was happy to have her family there to share in their joy.</p><p>The baby started to fuss and Joseph handed him over to his mother with much reluctance.</p><p>“Amy needs to feed him now. Why don’t you all go home and get some rest and then come over tomorrow for Isaiah’s homecoming,” Lucas asked.</p><p>Everyone said their goodbye’s and headed out. Jessica was filled with many different emotions. She was truly happy for her sister-in-law but envious as well. She wanted a big family so badly. She’d been raised as an only child and even though her parents were phenomenal, she got very lonely at times. She didn’t want her son to grow up without siblings. Maybe Alex wouldn’t mind having another child. Even if their marriage wasn’t one about love, they would stay together for the sake of Jacob, so why not have a sibling for him?</p><p>Alex took her hand as they walked towards their vehicle. “He sure was cute. I wish so much I would’ve been there for Jacob when he was born,” he said.</p><p>Jessica automatically tensed up, thinking they were going to have another fight and really too tired for it. “I’m really sorry about that. I thought I was doing the right thing,” she said.</p><p>“I know,” he said. She was so surprised; she didn’t know what else to say. He didn’t sound angry, or even hurt. He just sounded a little bit down. “I hadn’t exactly led a life that would’ve made you believe I would be ready or willing to settle down. I understand now that I know you better. You thought you were doing the right thing in not telling me. I hope you realize I would’ve been there for you the moment you found out. I don’t shrink from my responsibilities,” he finished.</p><p>Even though Alex was saying he would’ve been there for her, Jessica’s heart was feeling like it would break in two. He thought of her as just another one of his responsibilities and not his wife. He was doing the right thing as he’d been taught to do. She wanted him to be with her because he loved her, not because he’d messed up and now had to pay the price.</p><p>“I know you would’ve done the right thing from the beginning,” she said in what she hoped was a normal tone of voice.</p><p>Jessica pulled her hand from his as they approached their vehicle. She couldn’t maintain the contact any longer. It was killing her slowly. Suddenly he pushed her up against the car and kissed her deeply. All heartbreak washed away as his hands rubbed down her sides, then reached up to hold her head as he deepened the kiss.</p><p>He was making her insides melt and she was forgetting about everything around her when he finally broke away. “Let’s go on vacation. We didn’t get a honeymoon and I have a trip over to the Virgin Islands this week. Come with me. Jacob will be fine for a few days. I will hurry to get you home, I promise,” he finished.</p><p>He was looking deep into her eyes and she found she couldn’t say no. She couldn’t even find her voice. She finally nodded her head yes.</p><p>He lifted her up into his arms, gave her another quick kiss and then helped her into the car. “We’ll have a great time. I have meetings in the mornings but then we’ll have all day to play on the water and dance all night,” he said, sounding like an excited teenager getting ready for summer.</p><p>“It sounds like a very nice time,” she finally managed to say.</p><p>Jessica was nervous. She’d never liked large crowds and prayed his dancing wasn’t going to be in the middle of a crowded club.</p><p>“Pack up tomorrow. We leave in two days. We can let Julia know tonight and you can get all your time in with Jacob so you won’t feel guilty.”</p><p>She looked ahead at the road. She hated he knew her so well. She did feel guilty about leaving their son at home but at the same time if she ever hoped to make her marriage a real one, this was the time to do it. They were going to be in a romantic hotel completely alone. She had a few days to let her defenses down and see if it made a difference.</p><p>“It sounds great. I know Jacob will be fine but I’m glad I’ll have tomorrow.” she admitted.</p><p>They rode in a comfortable silence the rest of the way home. She was planning what needed to get done before they left. There was much to do.</p><p>Alex was extremely happy Jessica was going with him. He wanted to be with her. He felt better when she was near. He didn’t want to even admit to himself how much she mattered to him but it was impossible to push away all his feelings. He told himself he would simply take it one day at a time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“We have to leave, Jessica,” Alex said for the tenth time.</p><p>“I know, I know, it’s just so hard,” Jessica said as she kissed Jacob for about the hundredth time. “I love you sweetie. Mama will be home in a few days. Julia is going to take really good care of you, I promise,” she said.</p><p>They headed to the awaiting limo and Jessica smiled as she climbed inside. He had champagne chilling, a vase with two dozen roses, chocolates and a wrapped package all sitting there.</p><p>“What is this?” she asked.</p> <p>“I didn’t give you a honeymoon, so even though this is a business trip, I plan on doing minimal business and giving you a romantic honeymoon the rest of the time. I wanted to start things out right,” he said with a little shrug.</p><p>Jessica was so choked up at his thoughtfulness she couldn’t speak for several moments. “Thank you,” she finally managed to get out.</p><p>“Here, open your gift,” he said with a sparkle in his eyes.</p><p>She took the package from him slowly unwrapping the gift. When she opened the jewelry box, she couldn’t take her eyes off the exquisite ruby necklace inside.</p><p>“It’s beautiful.”</p> <p>“Turn around and I’ll put it on for you. I thought it would match your favorite dress and knew I had to get it for you,” he said while clasping it. His fingers trailed down her neck, when he was finished latching the necklace and she shivered in need.</p><p>He slowly turned her around and kissed her with such tenderness, she felt like her whole body was going to melt. She loved the unending passion they had but this tenderness he was showing was sure to be her complete undoing.</p><p>“You look beautiful,” he whispered to her, as he trailed his lips down the side of her neck. Her body shivered again and she reached for him, needing his lips on hers.</p><p>Jessica hadn’t realized how much time passed when the voice came over the intercom, “we will be arriving at the airport in five minutes.”</p><p>She jumped like she’d been caught necking with her boyfriend behind the bleachers, then chuckled. There was nothing wrong with kissing your husband in the back of a limo. “I’m glad you decided to come on the trip,” Alex said as he helped her out of the car.</p><p>“Me too,” she replied, really meaning it.</p> <p>“I promise not to work too much,” he added.</p><p>“I will hold you to that promise.”</p><p>They boarded the company jet, which was luxurious even beyond what she was used to. She sat down and the perky flight attendant served them drinks and let them know dinner would be served once they were in the air. Jessica looked forward to a few days of really getting to know the man she’d married.</p><p>After they ate, her exhaustion finally took over and she slept the rest of the flight.</p><p>“Wake up, were here,” Alex’s voice stirred her from her sleep.</p><p>“Already?” she managed to mumble.</p><p>“You slept the whole trip,” he said with a little laugh. “I’m glad because now you will have a lot of energy for our night out.”</p><p>They stepped out of the jet and she breathed in the beauty of the island. It was so warm, with a nice breeze gently blowing. They climbed in the waiting car.</p> <p>“I have some business to take care of right away. Why don’t you get settled in the room and then relax on the beach for a while. Be ready by six tonight for dinner and dancing. Wear a dress,” he added.</p><p>“That sounds great. I haven’t laid on the beach in forever. Seattle isn’t exactly lounging around weather,” she said with a smile.</p><p>Alex left her at the hotel, where she quickly changed clothing and headed to the semi-private beach. There were several people from the hotel but it was mostly couples and everyone seemed to be enjoying the beauty around them.</p><p>She jumped into the warm ocean and swam around until she was tired, then found a covered lounge area and pulled out her favorite romance book. She was reading about the hero and heroine and thinking her life was so much better, when she drifted off into another nap.</p><p>When Jessica woke, she glanced quickly at her watch and gave a little squeak as she realized it was four-thirty. She gathered her things quickly and headed back to the room to get ready for her date.</p><p>There was a message waiting, asking her to meet Alex in the bar, as he was running a little bit late. She jumped in the shower and then took her time getting ready, making sure she looked perfect.</p><p>She’d purchased a dress she normally would’ve never worn but she’d wanted to let loose on vacation. It dipped far lower in front than she’d ever worn before, showing a generous amount of her cleavage. The back of the dress dipped down to the small of her back and the hem reached mid-thigh. It hugged her hips tightly then the skirt flared out in a flirty style.</p><p>She’d even purchased new undergarments for the outfit and was wearing sexy panties and a garter belt. She wanted to incite passion in her husband and with the outfit she was wearing, she was hoping he had an uncomfortable evening.</p><p>As Jessica looked in the full length mirror at her image, she was a little shocked by her own boldness. She turned to look from all angles and smiled to herself. She almost didn’t recognize the woman staring back at her. Since she’d become a mother, she’d taken too little time with her own self. She wore sweats far too often and hardly ever applied make-up. Alex hadn’t seemed to mind but she liked feeling like a woman and vowed to take more time to pamper herself from then on.</p><p>Jessica made her way to the hotel lobby and stepped into the bar. She spotted Alex right away. He was so handsome, he took her breath away. When he turned towards her and his glance slid by and then whipped back to her, she smiled with triumph.</p><p>Alex just about slid out of his seat when he spotted his wife. She was always beautiful but he’d never seen her in anything like the dress she was wearing. He could feel the instant reaction his body was having, making his pants far too tight. He got up and walked towards her, almost as if he was in a trance.</p><p>“You’re the most ravishing woman I have ever met,” he said to her, before pulling her into his arms and taking her lips with his.</p><p>“Thank you, you are looking very dashing yourself,” she said.</p><p>“I’m going to have to fight off every man in this place,” he said while glaring slightly at a guy who was practically drooling over her.</p><p>He wrapped his arm possessively around her and led her to the outside restaurant. They had a wonderful dinner, filled with laughter and excellent food. Soon he was calling a cab and leading her to a different part of town.</p><p>They stepped up to a place she was shocked he would even know about. She could hear the music from the street and the neighborhood didn’t look to be the safest.</p><p>“Are you sure this is a safe spot?” she asked.</p><p>Alex threw back his head and laughed. “Don’t worry my love, I’ll protect you from any dangers,” he said while leading her through the open doorway.</p><p>Jessica caught her breath at his words. Did he know how badly she wanted his love? All thoughts fled as they stepped through the doorway.</p><p>The club was very dimly lit, making it hard to see anything. A steamy song was loudly playing and people were mashed together all throughout the club. Most of the couples looked more like they were about to drop to the floor and have sex, than like they were dancing.</p><p>Her eyes were drawn to the couple in front of them. Her stomach tightened and she told herself she should look away. The moment seemed so intimate between the two people, she felt like a peeping tom.</p><p>The woman’s head was thrown back and her lips were open, in what Jessica was sure was a moan escaping. The man had her plastered against him, with his hands running up and down her back and thighs, while his mouth was moving over her neck and breasts. Jessica finally managed to turn away and felt like running out of the club.</p><p>“Let’s dance,” Alex whispered in her ear. His voice sounded deep and husky, which made her stomach tighten even more. She nodded, knowing it was impossible for any words to escape her at that moment.</p><p>Alex pulled her into his arms, reminding her of their first dance together. He’d been so flirty and cocky. Dancing in his arms at that moment she couldn’t understand why she would’ve ever felt the need to fight him in any way.</p><p>“I want you so badly. You look amazing in this dress. I could take you right here,” he whispered to her. A shiver passed all the way down her spine and she could feel the heat, where she wanted his touch so badly.</p><p>Words still couldn’t escape Jessica’s tightened throat. Alex kissed her with passion and heat making her forget the room around them. His lips moved from her lips to her neck and down the plunging neckline of her dress.</p><p>His hands stroked up and down her back, getting lower and lower with each pass he made. They were barely moving to the music. He slowly started walking her backwards until she felt the hardness of a wall behind her back.</p><p>His hands were now running along the side of her body, touching the sides of her aching breasts and tender stomach. He began moving them down her hips until he finally found the bottom of her dress. They ran up under the hem and cupped her bare bottom. She let out a moan of pleasure as he caressed her skin.</p><p>He pulled her roughly into his obvious arousal and his lips once again connected with hers. It was pure seduction and she didn’t care they were in the middle of a club. She was ready for him to take her.</p><p>She lifted her hands up, to begin unbuttoning his shirt, when he suddenly stopped and pulled back. “We have to get out of here now,” he said through clenched teeth. Without saying anymore, he grabbed her hand and led her from the club. He pulled her quickly down the walk and hailed them a cab.</p><p>Jessica was beginning to think she’d done something wrong, because he was sitting several feet away from her in the cab and not uttering a word. They reached the hotel and he helped her out. He then pulled her around the building and they walked out onto the beach and took a secluded path.</p><p>She was just working up the courage to ask him what was wrong when he pulled her back into his arms and kissed her again with all the force he’d shown her at the club. She forgot all about her worries as her arms came up around his neck and she gave him full access.</p><p>Alex threw his jacket down on the ground and lowered her gently to the grass covered mound in the middle of a deserted trail. The silver moon cast a soft glow, providing only enough light to barely see him, leaving everything around him in shadows. He stripped her dress off in one movement, leaving her exposed and vulnerable.</p><p>He was awed by the sight she made, wearing only a piece of black lace barely hiding her from him, the garter and red heals. She was bathed in the moonlight, giving her a surreal look. He wanted nothing more than to bury himself deep inside of her but he wasn’t a selfish lover and he would make sure of her pleasure before his own.</p><p>He quickly stripped away his clothes and then brought their bodies back into intimate contact. He took her lips in his again, making her cry out her pleasure, as his hands explored every inch of her skin. His lips caressed her neck and the tops of her breasts.</p><p>She could barely breathe, the pressure was so great. She wanted to cry out her love for him but held back, barely. When his lips finally took her hardened peak into his mouth and he sucked her aching nipple, her whole back arched off the ground. When he gently nipped the sensitized skin she almost came undone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Please,” she begged. She didn’t know whether she was begging him to continue on or to join them.</p><p>He kissed his way down her smooth stomach, making it tighten even more. His tongue dipped into her belly button and she moaned at the intense sensations he was bringing her. He finally moved to kiss and caress her thighs, making them open to his administering. When his mouth finally touched her burning heat, she thought she would explode.</p><p>Her body wouldn’t stay still. He deepened the intimate kiss and she could feel her body begging for release. When he dipped his fingers inside her, she couldn’t hold back any longer. She cried out and finally let go, waves of pleasure washing over her.</p><p>He slowly kissed his way back up her body, starting to stir her heat once again. She didn’t understand how he could make her want him so much. He’d just pleasured her beyond what any one person should ever receive and she greedily wanted more.</p> <p>He brought his lips back to hers and the taste of their passion on his tongue fully brought the fire back to her body. “Please,” she begged again. She wanted him deep inside of her.</p><p>“Please what?” he asked, knowing the answer.</p><p>“Please love me,” she gasped. She silently added to love her both emotionally and physically.</p><p>He said nothing more, just slipped inside her heat in one sure thrust. He threw back his head and moaned out loud. He didn’t move, as if he was trying to calm himself. She jerked her hips up, needing him to move inside of her.</p><p>That little movement was all it took. He grabbed her backside and thrust hard in and out of her. His lips latched back onto hers and he loved her with a passion that should have set the grass around them on fire.</p> <p>She felt the heat building up inside her again, even stronger than before and suddenly her body jerked with a pleasure so intense, it bordered on pain. Her tightening heat around him sent him over the edge and with a final thrust deep inside her, he let go and cried out in his own pleasure.</p><p>His body was covered in a fine sheen of sweat, glistening in the moonlight. He collapsed on top of her but quickly shifted them both, bringing her on top. They were still connected together, which felt right.</p><p>He was rubbing her naked back and she was so content, her guard was down and she finally whispered the words she’d wanted to say for so long, “I love you, Alex.”</p><p>She felt him stiffen, which told her more than words ever could have. He didn’t want her love. He wanted the passion and he even wanted companionship but he didn’t want love.</p><p>She was close to tears as he pulled their bodies apart and started to get dressed. “We better get out of here before some unsuspecting tourist happens to walk by,” he said in an almost cold tone.</p><p>Jessica’s heart was breaking into a million pieces. What had started as the perfect day was ending with devastation. The hurt was unlike anything she’d ever experienced before. She loved him so much. Why couldn’t he feel the same way about her? She thought she felt love when he held her in his arms. It seemed like he loved her but maybe to him sex and love were two completely different things.</p> <p>She quickly dressed herself and then walked slowly back to the hotel with Alex. It was like walking with a stranger, he was so distant. “I know I told you I wouldn’t be working much but something came up and I will be busy all day tomorrow,” he said as they entered the suite.</p><p>“I understand,” Jessica replied.</p><p>“I need to finish some work tonight,” he said as he headed to the office. She didn’t even reply. She just headed off to take a shower and then to bed, where she could cry herself to sleep.</p><p>The next two days and nights of her honeymoon were miserable. Alex was gone all day, returning too late for them to go out. She spent her time on the beach and shopping all alone. They did make love in the evenings but it was different. She could feel he was holding something back and when they were done, he turned away from her, seeming to fall asleep quickly.</p><p>Jessica was relieved on the third day when he said everything was finished up and they could head back home. She didn’t know what to expect when they got back. She was sure things would go back to her barely seeing him and her love for him aching to be set free. She had to make a decision of what to do, sooner rather than later.</p><p>“I was a compete ass,” Alex said to his older brother Lucas. “I knew she was falling in love with me but selfishly I wanted her to keep it to herself and not bring it out in the open. I don’t have the time or energy for that kind of relationship but I’ve really shut her out and don’t know how to make things go back to the way they were,” he finished.</p><p>“What’s so wrong with your wife loving you and you her?” Lucas asked, sounding stunned.</p><p>“There’s nothing wrong with it when you have a relationship like you and Amy. Jessica and I have an understanding. We have Jacob to think about and if we get all these emotions mixed up then we’re jeopardizing the whole thing.”</p> <p>He knew even as he said it, how wrong it sounded. They had a child together, so how could love mess that up? Well, besides his parents and now Lucas and Amy, Alex hadn’t seen a lot of good marriages. They all ended in divorce with bitter custody battles. Alex figured if he kept love out of the equation, he’d never have to worry about divorce. The thought of Jessica and Jacob not being there with him every day tore his heart to pieces.</p><p>“I think you’re in a whole hell of a lot of denial, little brother. You have an amazing wife, who obviously loves you and you know what? I think it’s pretty obvious you love her too. Why not quit fighting it and just enjoy being with your family,” Lucas stated.</p><p>“Yeah, whatever. I have to get going. I’ll be gone all week and I’m sure everything will be normal when I return home,” he said, praying it was true.</p><p>“Good luck,” Lucas said before Alex departed.</p><p>“How are you doing? You look like you don’t feel too well,” Amy said. She and Jessica met for a girl’s day out. They were sitting at the salon having their nails done when Amy questioned her.</p><p>“I have a nasty flu that’s been going around but I’ll be fine,” she replied, hoping to feel better sooner rather than later.</p><p>“If you need to rest up we can reschedule our day out,” Amy offered.</p><p>“No, I’ve been looking forward to this all week. Alex has been gone for a few days and even before he left I’ve hardly saw him. I need some good old fashioned girl talk. How is everything going with you?” she asked. She was desperately trying to push away the queasiness.</p><p>“I’m doing so much better. Can you believe Isaiah is already two weeks old? He’s such a great baby too. He actually lets me get four hours of sleep in a row. I’m really glad I hired the nanny, too. It’s been such a great help having her around. Jasmine absolutely adores her and I’ve been able to get plenty of naps in. Plus I feel safe stepping out for the afternoon with you,” she said with enthusiasm.</p><p>“I know how quickly time flies. I can’t believe Jacob is almost a year old. I want to go back to the beginning, though the full nights rest part is pretty nice,” she added.</p><p>“I think I would be happy having about ten more kids. Don’t look at me so horrified. I love being a mother and Lucas is about the best husband in the world. Plus, I think Joseph would think he’d died and gone to heaven having that many grandkids surrounding him. I really love this family so much,” she gushed.</p><p>Jessica sat for a few moments without saying anything. She wanted more kids so badly but if things didn’t change with her husband she didn’t see that happening. He was content just having Jacob. She wondered what he would say if she told him she wanted to have another baby. She didn’t really want to think about his reaction. He most likely would shut her out more.</p><p>“I’ve always wanted to have a large family. I love my parents beyond anything but it was lonely growing up as an only child. I’ve never wanted that for Jacob,” Jessica finally responded.</p><p>“Are you guys planning on another little one anytime soon?” she asked with a wink. “The trying part is so much fun,” she added with a giggle.</p><p>“We haven’t talked about it,” was all Jessica said. She was having a really hard time fighting off the tears. She wasn’t normally so emotional but she figured being so lonely lately was most likely contributing to that.</p><p>“Alex adores Jacob so much. I’m sure he’d like to have a few more running around. Talk to him about it. You know grandpa is going to be expecting another one soon,” Amy said.</p><p>“Joseph is about the greatest man there is. I can’t believe how lucky Jacob is to have such an amazing grandfather. Plus Katherine is a dream grandmother. I love the quilt she made for Jacob. She comes over and visits all the time. I really regret them not getting those first three months with their grandson,” Jessica said with some sadness.</p><p>“They completely understand though. You were unsure about the relationship and thought you were doing the right thing. What matters most is you’re all together now. I know things can be really tough sometimes but hang in there,” Amy said.</p><p>Jessica didn’t want to talk about the tension between her and Alex, so she decided it was a great time to change the subject. “I’ve been dying to try the new Thai place a few blocks away. Do you want to go there for lunch?” she asked.</p><p>Amy took the hint and they discussed lunch and the kids and just about everything else except husbands. Jessica felt herself relaxing and really enjoyed the rest of the day. She really did have an amazing sister-in-law. By the time they got back to the house, she was more relaxed than she’d been before her impromptu honeymoon.</p><p>She would have to wait and see how things would work out. She couldn’t leave Alex. She loved him too much and he was an amazing father, so maybe she would simply have to hold her heartache in and live with things the way they were. That thought wasn’t very appealing but what else could she do?</p><p>Chapter Eight</p><p>The months slowly passed since the honeymoon. Alex was finally staying home much more often and they were back to making love almost nightly and to an outsider everything would look normal. Everything would look like they were a perfect family.</p><p>Jessica hadn’t repeated her vows of love to her husband and he’d started to relax. She didn’t want to break the truce they’d established.</p><p>Jacob was turning a year old that afternoon and they had a huge party planned, with both of their families there. She loved when the family got together, more than anything. She couldn’t believe there was ever a time she’d feared them.</p><p>Jessica stole Isaiah away every chance she could get but when Joseph was around it was more difficult. He would hold all three of his grandkids on his knees and was like a papa bear when someone tried to take one of them away.</p><p>The kids adored their grandfather just as much. The second he would walk in the door Jasmine and Jacob would run to him with their arms out and the baby would coo at him. Joseph was in baby heaven.</p><p>Jessica finished getting ready for the party, knowing Julia was dressing Jacob at the same time. There was a sweet bond between the Julia and Jacob. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Mama, someone is looking for you,” Alex’s voice came around the corner about a second before he stepped through the doorway.</p><p>Jessica gulped in her handsome husband and son. “Mama, hold,” Jacob demanded of her, as he reached out to her from his father’s arms.</p><p>“Of course, my sweet boy. I can’t believe you’re a year old today. Is it your birthday?” she asked him before tickling his belly.</p><p>“My day,” he said in his sweet baby voice.</p> <p>“Yes it is and you have grandpa and grandma and your aunts and uncles coming to see you,” she said.</p><p>“Gampa, yeah,” he said and started looking around.</p><p>“He’s not here yet,” she said with a smile. She loved how bonded her son was with both his grandfathers.</p><p>“I wan gampa,” he demanded with a little scowl between his brows, reminding her so much of her husband.</p><p>“I like how he knows what he wants and isn’t afraid to demand it,” Alex stated proudly. “Come on Jacob, I think I hear grandpa in the hall,” he said as Jacob eagerly leapt back into his father’s arms.</p> <p>Alex laughed and bent down kissing her quickly before leaving the room. She slowly followed her two favorite men.</p><p>“About time you brought my grandson down here. I have been waiting about five minutes now,” came Joseph’s booming voice.</p><p>Alex chuckled, as Jacob practically flew into his grandpa’s arms.</p><p>Jacob patted Joseph’s face to get his attention, “my day gampa,” he said with a cheeky smile.</p><p>“Yes it is your birthday Jacob. Let’s go sneak into some candy,” he whispered, although everyone in the room could hear him.</p><p>“Dad, don’t give him a bunch of junk food or he’ll get cranky,” Alex said, although he knew his words were falling on deaf ears. As he figured, Joseph acted like he hadn’t heard a word. Jessica had to laugh. When Joseph wanted to spoil his grandkids, there was nothing anyone could do to stop him.</p> <p>“I forgot to tell you how beautiful you look today,” Alex said to her and then took her into his arms and kissed her softly. She immediately melted as he deepened the kiss. He was getting ready to take her back upstairs.</p><p>They’d been together for almost a year and she still had the ability to tighten his stomach. He wanted her every second of the day. She was beautiful and passionate.</p><p>Hell, he thought the party could wait on them. “You guys want to go upstairs for a while. I will cover for you,” said the laughing voice of Mark.</p><p>Jessica jumped out of Alex’s arms and could feel her face getting hot. She hated how easily she blushed. She couldn’t believe she’d been caught necking in the hallway like she was some undersexed teenager.</p><p>Alex glared at his brother. “You could’ve just gone out back with the rest of the family and not so rudely interrupted,” he said far too meanly in Jessica’s opinion. He did look even sexier when he was in a temper, which he clearly was.</p><p>“Oh quit being a stick in the mud, you have all night to continue kissing. Now be a good brother and get me a beer,” he said and practically dragged Alex from the room.</p><p>Jessica took a few moments to compose herself before heading in the direction of the party. She stared at the large group of family and friends on her back deck and smiled. Her son was so lucky to have so many people who adored him.</p><p>Whenever she began to think she couldn’t stay another day in the house with a man who didn’t love her, she would be at a family gathering and her resolve would deepen. She loved this group of people so much and the thought of not having them in her life was unbearable.</p> <p>It wasn’t like Alex was cruel to her in any way. He was simply honest, saying he couldn’t love her. He wanted her which was obvious. Their passion burned greatly. She was coming to believe he just didn’t want to be in love with anyone and it wasn’t personal.</p><p>Jessica snapped back to reality and looked around the crowded yard once again. Her smile was genuine as she spotted her beautiful child and her niece and nephew.</p><p>Jasmine and Jacob were in the swings, with grandpa pushing them both. “Higher gampa,” Jasmine yelled and then squealed with delight when grandpa accommodated her.</p><p>“How are you doing dear?” Katherine asked, as she walked up to Jessica.</p><p>“I’m great, thanks Mom,” she replied. Katherine was such a quiet person, sometimes she got engulfed from her huge force of a husband. All the kids knew grandma was the real source of magic in the family though.</p><p>She had an amazing heart and more love to give than any other person Jessica knew. Jessica was glad her family meshed so well with the Anderson family. They’d all become one instead of two.</p><p>“I can’t believe Jacob is a year old already. The time simply goes by far too quickly, in my opinion,” Katherine said with some sadness.</p><p>“I agree, it seems like just yesterday I was bringing him home from the hospital. He will be off to college before I have a chance to blink,” she said with some panic.</p><p>“It doesn’t happen quite that quickly but it sure seems like it. I’m grateful my boys decided to live close to home. When Mark graduated and moved out a piece of my heart broke. Letting go of any of your children is hard but the youngest one is the final piece and it feels like a piece of you leaves with them. I’m also grateful they’re finally marrying and giving me grandkids. It helps ease the heartache a little,” she added.</p><p>Jessica looked guiltily down at her feet for a moment. She knew her father and Alex’s parents were hoping to have many more grandkids but Jessica was so afraid to even bring it up with Alex. She was afraid he would say no and she would have to finally accept they couldn’t stay together.</p><p>“Three grandkids in just under three years is pretty good,” Jessica said instead.</p><p>“Yes, they really are a blessing. Joseph has been mumbling now about Mark settling down. I’ve told him time and again to leave the boy alone. He’ll have kids when he’s ready for it but you know Joseph, he’s stubborn. He thinks he fools me but I’ve been married to the man for far too many years for him to get away with much,” she said with a wink.</p><p>“He’s definitely stubborn. His sons and grandsons have inherited that trait,” Jessica said with a fond smile.</p><p>“I’m going to steal that new grandson of mine before Joseph gets his hands on him,” Katherine said. She kissed Jessica’s cheek and then headed over to Amy, who had just walked around the corner.</p><p>Amy walked over to Jessica, now that her arms were empty. “I barely get to see my kids when we are around this group,” Amy complained but the twinkle in her eyes took away any bite in the words.</p><p>“I know how you feel,” Jessica agreed with her sister-in-law.</p><p>“I really couldn’t imagine being a part of one of those families who never speak to one another. It breaks my heart now to think about that,” Amy said with true knowledge.</p><p>Jessica knew Amy had grown up with an addicted mother until the day she went into the foster care system. She’d worked her way through college and then met Lucas while working for the Anderson Corporation.</p><p>Having a close family was something Jessica had always taken for granted, whereas Amy had never known such a loving group of people. Jessica reached over and gave Amy a big hug. “I’m so glad you are my sister Amy. I’m glad you were able to find the family you were meant to have,” Jessica said.</p><p>Amy had to wipe away a few tears, “now look what you made me do,” she said with a sniffle. “I’m so glad to have you, too,” she added.</p><p>“What’s wrong Amy,” Lucas came running up, as if he had radar built in. He was gathering Amy in his arms while scoping the yard to make sure his children and the rest of the family were all okay. He couldn’t seem to find any danger and that led to his brow furrowing even more.</p><p>“Everything is just perfect, that’s why I’m crying,” she said with a sniffle.</p><p>Lucas looked at her like she’d lost her mind for a moment and that set both women off in a round of giggles. “Lucas, you have to understand we cry when we are happy and sad. It’s just one of those mysterious things about women,” Jessica finally managed to get out between giggles.</p><p>“Is everything okay,” Alex asked as he looked from his brother to the two laughing women. Lucas gave him a look that seemed to say, you figure them out, which sent the girls off on another round of laughter. They were both holding their stomachs and tears were streaming down their faces they were laughing so hard.</p><p>“You’ve got to stop talking or I’m going to get a major cramp,” Amy finally managed to get out between bits of laughter.</p><p>“Agreed,” Jessica said.</p><p>Both guys threw up their hands and by mutual consent edged away from the girls. “We better go finish the grilling,” Lucas said.</p><p>“Yeah, I’ll help you,” Alex eagerly took the cue and they fled.</p><p>After a few minutes Jessica and Amy were able to quit laughing. “I love doing that to him,” Amy said mischievously.</p><p>“That was quite fun,” Jessica agreed.</p><p>“Let’s go get something to drink. All this laughter is great but man my stomach hurts now,” Amy said. “Plus I have got to get off these feet; I swear they are still swollen and acting like I’m pregnant.”</p><p>“I could use a drink myself. I’ve been fighting the flu and having a hard time keeping things down, so don’t bring the baby to close to me. I would never forgive myself if I got my nephew sick,” Jessica said.</p><p>The girls joined the rest of the party, stealing two very comfortable chairs for themselves. The food was excellent and Jessica was relaxed and calm.</p><p>“It’s time to sing happy birthday,” Alex shouted above the voices as he came walking out of the house with a large chocolate cake and a single candle burning in the center.</p><p>Jacob blew out his candle with the help of his father and then clapped his hands with everyone else. Everybody roared with laughter when Jacob stuck his little hand into the cake and smeared it all over himself, saying yummy over and over again.</p><p>Jessica’s eyes filled with tears as she watched Alex stick his face into the cake with their son. She loved how much they were bonded. “Daddy likes cake too,” Jacob squealed and then giggled.</p><p>“So does grandpa,” Joseph said and took a big handful for himself.</p><p>“I think I’ll pass on the cake,” Jessica said with affection, while staring at her chocolate covered men.</p><p>“I will second that,” Amy added.</p><p>“You don’t know what you’re missing,” Alex said. Before she could stop him, Alex took a chocolate smeared finger and rubbed it down her nose. She stood there in shock for a moment and then fast as lightening scooped up a small piece of the cake and chucked it at her husband.</p><p>She saw the light of mischief come into his eyes and decided it was a great time to retreat. She took off running but Alex caught her in no time. He gently tackled her to the ground and rubbed his chocolate covered face against hers.</p><p>Jessica was laughing so hard she could barely speak. “Okay, okay I call truce,” she finally managed to get out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There are no truces in a food war,” he said and rubbed against her some more. Suddenly he seemed to realize he was stretched out on top of her. He had her hands pinned above her head and she was completely at his mercy.</p><p>Alex forgot their yard was filled with people. No one else seemed visible to him except his beautiful, chocolate covered wife. He bent his head down and instead of rubbing more chocolate on her, his lips met hers and he kissed her with an intenseness that wiped away all laughter.</p><p>Alex released her hands and they immediately wrapped around his neck so she could pull him tighter to her body.</p><p>“Um guys, I hate to interrupt you twice in one evening but this is a G-rated party,” came the laughing voice of Mark once again.</p> <p>Alex pulled apart from her reluctantly and growled at his brother. Jessica looked at her husband in shock. She then looked around her in embarrassment and was extremely grateful no one was paying the least bit of attention to them.</p><p>Alex finally got up and pulled Jessica to her feet. “This party can end anytime now,” he said, with promise of completion to come. “As a matter of fact, no one would probably even notice if we disappeared for a little while,” he offered her.</p><p>She was getting ready to agree with him and sneak off upstairs when Joseph walked up to them.</p><p>“Now that Jacob is a year old, when are you planning on giving him a sibling?” Joseph asked Alex. “You know a boy needs to have some younger sibling to harass,” he added and looked pointedly at Mark.</p><p>Jessica was the only one who noticed the shutters lock into place on her husband’s face. Her heart broke a little bit more. He’d gone from passionate lover, to closed off in about two seconds.</p> <p>“Dad, you already have three grandkids, quit being so greedy,” Alex finally managed to say in a stilted voice.</p><p>“Now son, you’re not getting any younger. You better get working on things,” Joseph continued, not noticing the sudden tension in his son. He winked at Alex and Jessica both, which made her blush again.</p><p>“Yeah, yeah, just enjoy the cake,” Alex said and then quickly changed the subject. Jessica had her answer she hadn’t wanted to face. Her husband definitely didn’t plan on having more children with her. How could a night so full of promise just a moment ago have suddenly gone so dark?</p><p>The party went on even after Jacob finally succumbed to his exhaustion and went to bed. Jessica loved to watch the brothers laugh together and act like they were teenagers. She was putting on a fake mask the rest of the night though, because all she really wanted to do was crawl in bed and have herself a really good cry. She and Amy sat back and visited while the rest of the guests slowly started to depart.</p><p>She managed to maintain her composure the rest of the night. She could go curl up in bed and think about what she was going to do about her future really soon. She knew she couldn’t stay in the marriage if Alex didn’t want to be a real family but she didn’t want to think about it.</p><p>“We need to have another girl day, how about Friday?” Amy asked.</p> <p>“That sounds great,” Jessica said before hugging her goodbye. She was almost sad to see the rest of the guests go but at the same time she really needed to be alone for a while.</p><p>“I have some work to finish up. I’ll be up later,” Alex said before quickly turning and heading to his office.</p><p>Jessica climbed the stairs to their room and curled up in bed, where she cried herself to sleep. Alex must’ve stayed in the office far later than normal because he wasn’t there when she finally managed to fall into an exhausted sleep.</p><p>The next month passed by with more and more heartache for Jessica. Alex was home more often than not but if Jacob wasn’t there as a buffer between them he would lock himself up in his office.</p><p>They did a lot of family activities together but he seemed to make sure they were never alone otherwise. They still made love in the night but even that had changed. It was still amazing and he was still a fantastic lover but he no longer held her tightly afterwards.</p><p>She knew she was going to have to confront him but she also knew how the conversation would go.</p><p>“I thought we could go out on the lake this weekend, if you’d like,” Alex asked her at dinner one night.</p><p>“That sounds great,” Jessica said with enthusiasm.</p> <p>“I think Jacob will like the boat. There’s nothing like the wind blowing through your hair as you navigate the water.”</p><p>“Well, your son doesn’t have much hair,” she smiled at him.</p><p>“That’s very true. The sun will be good for all of us. It’s supposed to be a really nice weekend and those are few and far between,” he said with a genuine smile.</p><p>She hated she responded to him so quickly when he gave her the least bit of himself.</p><p>The weekend came and Jacob had a cold so they went out on the boat alone. She was afraid he would cancel but he was in a good mood so they left the house early in the morning.</p><p>“I thought we’d do some crabbing while we’re out,” he said.</p><p>“That sounds great. Amy said she and Lucas did that a couple weeks ago and had a good time.”</p><p>“Yeah, I got the idea from Lucas. He enjoyed himself,” he told her.</p><p>The drive to the coast was gorgeous and they talked more than they had in months. For the first time in too long to remember Jessica was feeling some hope.</p><p>They arrived at the marina and boarded the boat and she was having a great time. Once the temperature warmed up, she stripped down to her bikini and lay out on the deck. The hot sun and cool breeze felt phenomenal against her skin. Her worries seemed to float away on the gentle breeze.</p><p>It was taking every bit of Alex’s will power not to find a secluded cove to park the boat and ravish his wife. She had no idea the power she held over him.</p><p>As he steered the boat further into the water, his eyes were continually drawn back to Jessica, lying out there on the deck, just a few short feet away from him.</p><p>Since the night she’d told him she loved him he’d backed off dramatically. He knew he was hurting her but he also knew she would be better off in the long run if he gave her some space. She needed to realize she wasn’t in love with him. He knew she was more in love with the idea of love and marriage than the actual reality of it.</p><p>His dad had freaked him out when he’d brought up having more children. What scared him the most was how much he wanted her to become pregnant again. He could visualize a bunch of miniature Jessica’s running through the house. He couldn’t figure out what he was doing anymore.</p><p>“It’s so warm out here,” Jessica said, while turning towards him suddenly. “Can we stop somewhere so I can take a swim?” she asked.</p><p>“I can see a cove over here,” he said and steered the boat towards the secluded beach. He was clenching his teeth because everything in him told him he needed to head back towards the docks.</p><p>“Oh, it’s so perfect,” she gasped at the little piece of heaven of a beach. As soon as he got the anchor down on the boat she dove into the water. He was impressed with her form. He was feeling way to hot himself so he stripped down and jumped in after her.</p><p>They both swam around in a comfortable silence for a while, when suddenly she cried out. Alex immediately swam towards her and sucked in his breath as he noticed blood coming to the surface of the water.</p><p>“What happened? What’s wrong?” he fired off at her, while at the same time he was pulling her close and leading her back to the boat.</p><p>“I don’t know,” she cried out. “It’s my leg. I think I cut it on something,” she whimpered.</p><p>Alex couldn’t see anything, so he towed her back to the boat, praying it was nothing to bad. He lifted her up into his arms and climbed aboard.</p><p>He laid her gently down and then went and got the first aid kit. When he returned, he was shocked by the amount of blood.</p><p>“It looks worse than it is,” she finally said. “I was looking at it and it looks like I scratched it on a rock or something. It just seems to be bleeding a lot. If you clean it out and wrap it I’ll be fine.”</p><p>“First take this Advil, then I’ll start cleaning and assess for myself how bad it is,” he said in his commanding voice.</p><p>Even though Jessica was hurting, she had to smile at the command in his voice. She loved it when he got all determined and acted like the world should bow to his feet.</p><p>She flinched when he cleaned the wound with the alcohol but she was right, it wasn’t as bad as he thought it was. He was surprised by the amount of blood that had escaped the small wound.</p><p>The Advil kicked in and the pain subsided greatly once the wound was cleaned up. “I’m fine now,” she reassured him.</p><p>“We can head on home,” he offered.</p><p>“I’m fine. As a matter of fact I’m feeling very hungry,” she said. She really didn’t want to head back to the house right away, knowing he would disappear into his office.</p><p>He couldn’t handle being all alone with her any longer, so he headed the boat back towards the shore and placed a call to his brother. If they had company for dinner, he wouldn’t have to try and answer the questions he saw coming from her eyes.</p><p>“Jessica wake up, we are back at the docks. I called Lucas and he and Amy are going to meet us in a half hour at this great seafood place,” Alex said while gently shaking Jessica awake.</p><p>“What?” she stuttered, struggling to wake up. “I’m so sorry; I didn’t even realize I was so tired. I didn’t mean to fall asleep on you,” she said when she finally woke up fully.</p><p>“Hey, no problem. I really enjoy the water and having the soothing silence,” he responded before securing the boat.</p><p>Jessica felt a little bit like she’d been slapped. She felt he was basically telling her he’d enjoyed his day much more because she wasn’t there to talk in his ear. Well fine, she thought, if he wanted silence, then silence would be what he got.</p><p>She quickly got dressed and limped up the dock with him toward their car. She kept silent the entire ride to the restaurant and he said nothing as well. Jessica was wishing to get home so the awkward afternoon could end.</p><p>“Jessica, I’m so glad you guys called,” Amy came walking up and put her arm through Jessica’s, while chattering away. “It’s so nice to get out of the house for some adult conversation. Don’t get me wrong, I adore my kids but they do lack certain communication skills,” she finished with a laugh.</p><p>“I don’t know. I think Jasmine communicates very well and for that matter, Isaiah has no trouble at all letting everyone around him know when something isn’t going his way,” Jessica joked right back.</p><p>“You have that right,” Lucas added.</p><p>“I guess I’m the only one with a perfect child,” Alex said.</p><p>“Ha,” everyone else said in unison, which brought on more good natured laughter.</p><p>“Okay, kids can be quite demanding when they want something but even though I didn’t know I would love fatherhood so much I seriously couldn’t imagine my life without Jacob in it. He’s just so amazing,” Alex said in awe.</p><p>“Agreed little bro,” Lucas said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“This is a grown up night. No more talk of our kids. I get one glass of wine and anything at all I want to eat. If it causes problems with Isaiah’s tummy later, well that’s okay because it’s daddy’s turn to get up with him,” Amy said with a wicked smile.</p><p>“You deserve whatever you want Babe,” Lucas said.</p><p>The evening progressed and Jessica relaxed. She absolutely loved Lucas and Amy and it helped to mask the tension between her and Alex. She knew at some point they were going to have to face things but she got so tired of being stressed all the time. It was nice to have a worry free evening.</p><p>When it came time to say goodnight, she was sad to watch the other couple leave. She hugged Amy tightly and promised to have a girl day later that week. She then rode home in complete silence with her husband.</p> <p>When they walked inside they both went to Jacob’s room to check on him. It was well past midnight and Julia had long ago retired. Jessica wished she was still up so she could tell her how Jacob’s day had been.</p><p>“I think he’s back to normal,” Jessica whispered.</p><p>“He was pretty much better by the time we left. I just didn’t want to expose him to the water so soon after his cold,” Alex said.</p><p>“I agree,” she said.</p><p>“You’re a great mother, never doubt that,” Alex said tenderly. “Don’t feel guilty about taking a day out without him. It’s good for you and him. My parents had many vacations with just the two of them and my brothers and I are fine. They were with us more than away and we always knew how much they loved us,” he finished.</p> <p>“It was the same at my home. I knew my parents always loved me. I would have traded a little bit of that to have a sibling though. I got really lonely sometimes,” she admitted.</p><p>He knew she was implying she would like to have another child. As much as he would love to have another one they didn’t have that kind of marriage.</p><p>“I should get some work done,” he said, deciding to avoid the subject. “I’m going to change,” he added, before walking to their bedroom.</p><p>Jessica would normally have let him leave but she decided to give her marriage everything she had. While he was changing in the bathroom she stripped off her clothes and lay down in their bed, with the soft lighting showing everything.</p><p>Alex stepped out of the bathroom, planning on heading straight out of the room but one look at his wife and his plans changed. He walked to the bed, like he was a puppet on a string. He stripped out of the clothes he’d just put on and climbed in the bed beside her without a single word.</p><p>She wrapped her arms around him and when their lips met a fire exploded throughout her entire body. When he rubbed her from breast to hip and back up again it was like a trail of lava was searing her. She couldn’t stop the sounds of pleasure escaping her lips.</p> <p>She took control back from him before she was unable to think. She pushed him over on his back and climbed on top of him continuing the passionate kiss. She finally released his lips and trailed hers down the side of his neck.</p><p>She was encouraged by the shivers racking his body and the gasp that escaped his lips as her hands trailed lower and lower on his body.</p><p>She continued kissing him down the column of his throat, over his smooth pecks and lower, to his rock hard abs. She ran her tongue in swirls over the small trail of hair leading her to his engorged manhood.</p><p>He tried to pull her back up to him. “No, it’s my turn,” she simply said and he lay back down and let her please him. It took his full willpower not to flip her over and plunge inside of her quivering body.</p><p>“Jessica,” he moaned out loud, when she licked the top of his thigh. He really couldn’t take much more.</p><p>She took a second to look up at him seductively, before she finally ran her tongue up and down the full length of him. His whole body shook from the pleasure she was giving him.</p><p>“Please,” he begged. He didn’t know whether he was begging her to continue or to stop.</p><p>She didn’t say a word as she finally took him deep into her mouth and his whole body arched off the bed. She moved her head up and down his shaft, while gripping him and mimicking the movement with her hand.</p> <p>She swirled her tongue around his head and he jerked up. “Enough,” he growled as he grabbed her in a lightening quick movement and flipped her under him.</p><p>“I will finish inside of you, with you quivering around me in pleasure,” he said between clinched teeth.</p><p>She jerked her hips upward towards him. She could feel him right there at her entrance but he wouldn’t push inside her.</p><p>Now she was the one to beg, “Please Alex,” she moaned.</p><p>“Just a minute. I don’t want this to end before it even begins.” He groaned as she rubbed against him again.</p><p>He took her hands and placed them over her head and then brought his lips to hers again. He kissed her with all the pent up passion of a man drowning. He was drowning in her.</p><p>“Please Alex,” she begged him again.</p><p>He couldn’t take anymore and with one thrust he was buried deep inside her. They both moaned in pleasure at the fulfillment of their joined bodies.</p><p>He started moving and the waiting ended. He thrust quickly in and out of her, as their panting both escalated. “Alex,” she shouted as her body started convulsing around him. He thrust inside of her and groaned out loud at his own release.</p><p>They both lay there, motionless. Her hands were rubbing up and down, from his shoulder blades to his lower back and then up again. He finally got off her and she moaned her displeasure at the separation.</p><p>“Shh, I’m too heavy for you,” he said. She thought he would get up and leave but he held her close to him and after he covered them both he rubbed her back until sleep overtook them.</p><p>Alex lay there for a long time, still stroking her back and thinking their love making was so much more than sex. He knew he should’ve walked away and let them both think clearly but there was no way he could. When he’d come out of the bathroom and saw her beautiful body glowing under the soft light of the lamp, he was drawn to her</p><p>He finally got out of the bed, when he knew she was sound asleep. She moaned and reached for him. When she found only empty space, her brow furrowed but she didn’t wake up.</p><p>Alex headed to the bathroom and took a long shower. He let the spray try and wash away the tension that seemed to be ever present in his shoulders. It didn’t do any good. He finally gave up and decided to go back to bed. He would try and get some sleep and figure things out later.</p><p>As soon as he climbed back into the bed she immediately snuggled up to him. Even in her sleep she was drawn to him. He gave up for the night trying to create distance and held her, quickly falling into a deep sleep. An earthquake couldn’t have roused him.</p><p>The next morning, he woke before Jessica and got up and left. He avoided her the rest of the afternoon and even though he caught her shooting sad looks at him whenever they passed each other he knew it was better to create some distance.</p><p>Alex sat in his office and rubbed his pounding temples. He knew he’d been avoiding Jessica far too much and he wanted to just go back to the way things had been.</p><p>Everything that had happened over the last several months seemed to keep pulling them further and further apart. He was trying to keep distance between them to prevent the very problems he seemed to have created.</p><p>That night at dinner she’d barely touched her food and she seemed to have so much sadness about her and he knew he could fix it. He didn’t know how to make their problems fade away without giving her his heart.</p><p>She was a reasonable person. If he explained they were doing what was best for their son, she’d understand a marriage didn’t have to be filled with romance and love. It needed to be filled with an understanding that two people did the best they could in order to be great parents.</p><p>Even as the thoughts were flitting through his head he knew they sounded wrong but he was convincing himself everything was fine. He once again stayed in the office far too late, making sure she was asleep before he entered their bedroom.</p><p>Chapter Nine</p><p>Jessica made a decision. She was head over heels in love with her husband and he’d seemed to pull further and further away from her. She’d been hopeful during those months when he’d seemed to open up to her and their marriage had seemed real. She couldn’t live half-way in the marriage and half-way out.</p><p>There were times when everything was perfect and then he would seem to notice he was too relaxed and once again pull away from her. The hot and cold was almost worse than if he was just cold all the time. When he was open with her, it gave her hope they could be a real couple.</p><p>She slowly gained her courage and walked down the stairs to her husband’s home office. She took another deep breath outside his door and then stepped in, with her head held high.</p><p>“Is everything okay?” Alex asked with concern. She normally didn’t disturb him in the office, with one exception when they’d ended up making love in front of the fireplace.</p><p>His eyes were automatically drawn to that spot and he could feel his body’s response. He quickly squelched it and turned back to Jessica.</p><p>She was standing there before him and he was thinking he could take her right there on top of his desk. Her eyes held a determination within them that let him know she needed to talk. Seriously, he had to stop his thoughts.</p><p>“I don’t know if things are okay,” she began.</p><p>Alex was getting really concerned. “Jacob...” he began. He started getting up, ready to charge up the stairs to his son.</p><p>“Jacob’s fine. This has to do with us. I need to talk to you about our relationship.” Jessica felt her heart breaking in half as she watched the shutters quickly close into place on her husband’s face.</p><p>“Our relationship is fine.” He didn’t elaborate, just looked back down at his computer screen, as if the discussion was over and there was no need to interrupt his work any longer.</p><p>He absolutely didn’t want to have the conversation. He knew it had been coming for quite a long time. He didn’t want to hurt her but he couldn’t lose her either. He was feeling more stress than he ever had in his life.</p><p>“The thing is, our relationship isn’t okay for me anymore,” she stressed. “Alex, I love you. I have been in love with you for a while now and I can’t live in this marriage, loving you with all my heart, while wondering when you’re going to walk out the door.” She finished, as a tear slipped down her cheek.</p><p>His heart warmed for a moment as she once again told him she loved him. He refused to allow the warmth though and blocked his emotions. He would reason with her, he would make things okay for them.</p><p>She’d been hopeful to get through the conversation with no tears. She didn’t want to appear weak and she didn’t want him feeling sorry for her. She wanted his love or nothing at all.</p><p>He looked at her with the same shuttered expression, although she’d thought for a moment, he’d shown some warmth. She’d most likely imagined it because he had a guarded look that wasn’t going to change anytime soon. He sat back in his chair for a full two minutes before finally speaking.</p><p>“Jessica, I care for you greatly. You are an incredible mother and a great wife. I’m comfortable with the way things are. I never wanted to marry, because other than my parents and my brother, I haven’t exactly seen a lot of shining examples of lasting love. I know you want me to say, ‘I love you,’ but I can’t. It’s just not who I am. I’m giving you everything I’m capable of.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His words were like knives stabbing her again and again. She didn’t know how it was possible to still be standing there. She pressed her hand against her heart, pressing in. The pain was so deep; it felt as if there was a gaping hole in her chest. She really thought her heart may explode from the intensity of the pain coursing through her.</p><p>“I understand Alex but then I can no longer stay married to you. You are an amazing father and I would never keep Jacob from you again. We’ll have to work out all the details but I just can’t do this. I’m so sorry.” She turned and walked from the room. She was choking on the sobs that wanted to rip from her body but she managed somehow to hold them back.</p><p>Jessica didn’t know how she arrived in the bedroom she’d shared with Alex for almost a year. Their nights had been amazing. That was the only time he’d completely let down his guard. When he’d looked into her eyes, she’d convinced herself it was love shining through their blue depths.</p><p>She turned away from the bed. She couldn’t look at it. She walked across the hall and checked in on Jacob. He was sound asleep in his crib and looked so peaceful. He’d grown so much his first year of life. She was amazed how beautiful he was.</p> <p>She loved how much he resembled his father. She rubbed his small, mostly bald head. He didn’t wake up. He was content in his crib. She wouldn’t disturb him right then. She would pick him up the next day.</p><p>She knocked on Julia’s door and it was quickly answered. “Hi Jessica, is everything okay?” she asked with real concern. Obviously, Jessica thought, she wasn’t doing a very good job of hiding her emotions.</p><p>“Everything is fine. I just wanted to let you know I’ll be gone this evening. You have my number if Jacob wakes and there are any problems.”</p><p>“I’m sure things will be fine. Are you sure you’re okay?” Julia asked again.</p><p>“Yes, thanks, I will see you in the morning.” With that Jessica turned and walked back into her bedroom. There was no way she could sleep there that night. She would go find a hotel room and then look for something more permanent the next day. Her son would be fine overnight. She would make sure she was back before he woke up. She packed an overnight bag and slipped out of the house.</p> <p>As she climbed into her car she had to wait a few moments because she was crying so hard she couldn’t see to drive properly. When she finally pulled herself together and her vision cleared she turned away from the house. She watched it in her rearview mirror until the trees blocked her view.</p><p>Leaving was about the hardest thing she’d ever done. The further she got from the house, the more she was regretting the decision. She loved Alex so much and leaving him was even more painful than staying with him, even without his love.</p><p>She decided to turn around and head back towards the house, when her car was suddenly filled with bright lights. “What...” she began to say aloud, when there was a huge crashing sound and she blacked out.</p><p>Alex sat as his desk with his head in his hands. He was already regretting his words to Jessica. The longer he thought the more he realized she wasn’t demanding anything of him that he didn’t have to give.</p><p>All thoughts of work were gone. He was thinking back to his time with Jessica. He couldn’t wait to walk in the door each evening to see her. He noticed throughout his days, he would continually check the time, counting down the hours until he could return home. He’d done far more work from home, than he’d ever done in the past. Anything that didn’t require him to be in the office was done from home.</p><p>He was also delegating far more work than he’d ever done in the past. He just wanted to spend time with his son and his wife. Work was no longer the top priority to him it used to be.</p> <p>Their nights were unlike anything else he’d ever known. She was always eager to fall into his arms. She was the most beautiful creature he’d ever known. He could picture her pregnant with many more of his children. He couldn’t picture his life without her.</p><p>His heart seemed to grow too full for his chest, as the realization hit him. He did love her. “I love her,” he mumbled out loud, just to hear how it sounded and to know how it felt to say it. He felt his mouth lift up in a grin. He loved her. He wanted to shout it from the rooftops.</p><p>He knew he’d sat there to long but he needed to get control over his own emotions. He finally got up to go talk to Jessica. He hated the pain he’d caused her. He couldn’t believe he’d just sat there as the tears rolled down her cheeks and the pain flashed in her eyes. Well that would never happen again. He would make up for that and so much more.</p><p>He walked up to their bedroom and there was no sign of her. He went searching throughout the rest of the house, with no signs. He started to worry. He walked back to his son’s room and found Julia in there. “Do you know where Jessica is?” he asked.</p><p>“I thought you had both gone out. She came in about an hour ago, saying she would be out for the night,” she replied. Her eyes then narrowed slightly, as she looked at him. “She looked like something was really bothering her, although she was doing her best to cover it up,” she finished accusingly.</p><p>Alex headed over to his room, planning on calling her phone. His extension rang before he had a chance to make the call. He picked up on the first ring, “hello.”</p><p>“Is this Alex Anderson?” the stranger’s voice asked.</p><p>“Yes, can I help you?”</p> <p>“Sir, your wife has been in an auto accident. She’s at the Mercy West Hospital in surgery and you are listed as her emergency contact,” the stranger said with sympathy.</p><p>Alex dropped the phone without another word and ran for the door. He shouted out for Tina to notify his and Jessica’s families and then raced to his car. He couldn’t lose her. Please God, he prayed, don’t take her from me.</p><p>Alex made it to the hospital in record time. He couldn’t even remember the drive. One moment he hopped into his car and the next he was rushing in the emergency entrance doors. “I’m looking for my wife, Jessica Anderson!” He was practically shouting at the poor receptionist.</p><p>“One moment sir,” the efficient nurse looked at her computer for what seemed like hours. “She arrived about an hour ago and is still in surgery. I need you to fill out these papers please,” she requested, as she pulled out a packet of paperwork.</p><p>“To hell with the paperwork, I want to know what’s happening with my wife!” He shouted at the woman.</p><p>“Sir, I understand you’re upset right now but the doctor will be out shortly to inform you of your wife’s condition. We really do need these papers filled out,” she tried once again.</p><p>Alex was about to grab this insufferable woman by her shirt lapels and demand to be taken to Jessica, when a hand clasped his shoulder. “Come on son, let’s fill out this paperwork and wait to hear from the doctor.” Alex’s shoulders slumped in defeat. His father was there and he was right.</p><p>“Okay Dad,” he conceded in defeat.</p><p>“I know you’re worried, boy. We all are but your family is here now and we’ll wait together. Jessica is strong and I know she will pull through this.” Alex thanked God to have his family there with him. He couldn’t sit in the waiting room and maintain his composure without them.</p><p>A few minutes later his brothers, Lucas and Mark were there with him and then Jessica’s father, John. No one did any talking. They were there to be a support system. Lucas’s wife Amy came in with coffee and food for everyone and wrapped Alex in a hug. “It will all be okay. She’s strong,” she said, then kissed his cheek, before heading over to sit with her husband.</p><p>“Son, let’s take a walk,” Joseph said and lead Alex from the room.</p><p>“What if the doctor comes in, Dad?” Alex asked in a panic.</p><p>“We won’t go far and trust me, if the doctor does come in one of your brothers will get you right away,” Joseph reassured him.</p><p>“Okay,” Alex said, realizing he really did need some air to clear his head.</p><p>“Is everything going okay for you and Jessica?” Joseph asked. He was never one to mince words and got right to the heart of the matter.</p><p>“I haven’t been a great husband,” Alex said, fighting hard to hold back a sob. “She told me she loved me and I just freaked a bit. I was so afraid if I admitted to her how much I cared about her she would end up being disappointed in me and walking away. I’ve been a fool,” he finished.</p><p>“Well admitting that is the first step,” Joseph said with a small chuckle.</p><p>Alex didn’t find humor in his father’s words. “I do love her,” he finally said.</p><p>“Have you told her that?” his dad asked.</p><p>“I was going too but we kind of had a fight and that’s why she was out driving. This is all my fault and if anything has happened to her, I will never be able to forgive myself,” Alex whispered.</p><p>“She’ll be okay Alex and you’ll have the rest of your life to reassure her how much you truly love her. When two people are meant to be together, nothing can stop them except their own bullheadedness. I’m glad to see you waking up,” Joseph slightly lectured.</p><p>“Thanks Dad. I wonder where that stubbornness came from,” Alex added.</p><p>“Ah boy, your mamma has had to kick me in the butt a few times and I sure deserved it but you know I would walk on fire for that woman.”</p><p>“I didn’t think it was possible to have a love as great as yours and mom’s but now I know how wrong I have been. Knowing Jessica is hurt and not being able to do anything about it is like ripping a piece of my soul away from me. I need to make her better,” Alex pleaded.</p><p>“You’ve sure grown into a fine young man. You know I’m always here for you and we’ll get through this. Families always stick together. There’s no way Jessica will leave her son behind so have faith, say a lot of prayers and know everything will work out.”</p><p>“Thanks dad. I’ll feel better once the doctor lets me see her,” Alex said, glancing through the doors, into the waiting room.</p><p>“Let’s head back inside,” Joseph said and they walked back towards the family.</p><p>Alex paced the room for what seemed like the hundredth time when a doctor walked through the doors. The man headed towards the large group. “Alex Anderson?” he questioned.</p><p>“That’s me,” Alex answered quickly.</p><p>“Your wife is out of surgery. She’s in stable condition but the next twenty-four hours are critical. She’s in a coma right now but we have every confidence she’ll wake within the next few days. Her collar was broken and she had a large cut on her left leg. We’ve fixed both those things. Her head was hit pretty hard and that’s our main concern right now. We had to relieve the pressure built up and will have to keep an eye on her.” The doctor finally stopped speaking.</p><p>Alex stood digesting the words the doctor was saying to him feeling like he was being slapped. He was so worried about Jessica. “Can I please see her?” It took all of Alex’s control not to grab the doctor and demand to be taken to his wife. He wasn’t normally a man who would ask. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“She’s being moved into her room right now. The nurse will take you up in a few minutes,” the doctor replied and then left through the double doors.</p><p>“We’ll wait here, son,” Joseph said, while patting Alex’s arm.</p><p>A few minutes later a led Alex through some corridors into Jessica’s room. Alex gasped in shock as he saw Jessica lying in the large bed. Her face was bruised up and slightly swollen. He felt a tear slip down his cheek, as he realized how close he’d come to losing her.</p><p>He pulled the chair up next to her bed and gently placed her hand in his. “Jessica, I’m so sorry for everything I have put you through. We’ll be just fine. Please wake up, so we can be a family. I love you so much and can’t live without you,” he said to her, willing her to open her eyes and look at him.</p> <p>She didn’t stir. He sat with her the rest of the night. The nurse had come in and told him visiting hours were over but gave up after a few minutes, knowing she couldn’t budge the devoted husband.</p><p>The next day a doctor stepped into the room and was looking at some charts. “Well, we have some great news, Mr. Anderson. She’s healing nicely and should wake up anytime. It also looks like the baby wasn’t affected by the accident and her pregnancy is just fine,” he finished.</p><p>Alex sat in shock. He had a mixture of emotions running through him. Did she know she was pregnant? She would’ve told him. “How far along is she?” he finally choked out.</p><p>“I’m sorry, I assumed you already knew,” the doctor seemed to stumble over his words. He glanced back down at the chart. “She’s about twelve weeks along,” he finally said.</p><p>Alex’s face lit with joy. They were going to have another child. He loved his son so much and now they were going to have a sibling for him. Even better, he would be there for the entire pregnancy. He would see his child come into the world and he would be there every single day to enjoy the entire pregnancy.</p> <p>He sat there next to Jessica and thanked the heavens for the blessings in his life. His wife was going to be fine, although he’d feel much better once she finally opened her eyes. He was going to have another child to love. Jacob was the most perfect child in the universe. It only seemed right to bring more children into the world. He smiled to himself, thinking he sounded a bit prejudiced but that was alright too.</p><p>He vowed he would never let anything bad ever happen again to anyone in his family. He couldn’t stand to feel so helpless.</p><p>Later that afternoon both families came in to check on Jessica, bringing in more flowers and balloons. Her room looked like a floral shop from all the arrangements people dropped off wishing her better.</p><p>“We’re going to have another baby,” Alex excitedly stated to everyone in the room. He knew he should wait to tell everyone until Jessica was awake but he couldn’t help himself. He was too excited about it.</p><p>There was a moment of silence, before the room erupted in excited chatter. “Congratulations son,” Joseph nearly shouted before grabbing Alex up in a huge bear hug.</p><p>“That’s wonderful, just wonderful,” John added with tears in his eyes.</p> <p>His brothers each gave him a hard hug and Amy kissed him on the cheek. They were equally as excited as he was.</p><p>“I don’t know if Jessica even knows yet but I couldn’t wait to tell everyone,” Alex stated, sheepishly.</p><p>“Alex.” His head whipped around, as he heard the quiet whisper of his name spoken. Jessica’s eyes were cracked open in confusion and she was looking right at him.</p><p>“Baby, it’s so good to see you awake.” He settled down into the chair next to his wife and took her hand into his.</p><p>“Wh...What happened?” she finally managed to croak out. Her throat felt like sandpaper. The rest of the room went completely silent.</p><p>“You were in a terrible car accident but everything’s fine now. You should be able to return home in a few days,” he said.</p><p>“I don’t remember. I was driving and then everything went black,” she said, sounding scared.</p><p>“You have nothing to worry about. The doctor said you’re going to be fine,” he reassured her.</p> <p>“Jacob’s okay, right?” she asked. Her heart monitor started beating as she frantically looked around the room for her son.</p><p>“Jacob is fine. You need to relax, your heart rate is getting too high,” he said calmly and breathed a sigh of relief as the beeping slowed. “He’s home with Julia. She will be down here in about an hour with him,” he said and kissed her gently.</p><p>Jessica drank in Alex’s face. He looked like he was the one who had been in an accident. His eyes had dark circles and his face was unshaven. His clothes were in desperate need of changing. He’d never looked better to her.</p><p>“I’m sorry for the things I said. I do love you more than you could ever imagine. I was just scared. You’ve held my heart for so long and I was afraid if I told you how I felt you’d somehow hold control over me. I should’ve realized sooner it did not matter. When I thought I could lose you I went out of my mind. Please forgive me for being so stupid,” he pled to her.</p><p>Neither of them noticed their families quietly slipping out of the room, giving them much needed privacy. They didn’t notice the happy looks between Joseph and John, the two meddling fathers.</p><p>“Of course I forgive you Alex. I love you so much. I wanted to come home the minute I left. I was already thinking I’d rather live with you, without love than without you,” she replied.</p><p>“So we’re going to be alright?” He asked her.</p><p>“We’re going to be more than alright. I think we can finally be a real family,” she said.</p><p>“Speaking of families,” he began, “how do you feel about giving Jacob a new brother or sister?”</p><p>Jessica beamed at him. “Nothing would make me feel better than having a houseful of children running around, filling up the empty corners,” she beamed at him. “As soon as I get out of here, we’ll have to start working on that.”</p><p>Alex gave her a blinding smile. “I don’t mind practicing for baby number three but number two is already cooking,” he said.</p><p>Jessica looked at her husband in confusion for a few moments before she realized what he was saying. “Are we...” she began, when he nodded his head. “We’re really pregnant?” she asked with hope.</p><p>Alex nodded his head. He was so overcome with emotions he couldn’t speak for a moment. He found it amusing he was the one telling her they were pregnant as it was normally the other way around.</p><p>“I can’t believe it,” she gasped. “How do you know?”</p><p>“They ran all kinds of tests to make sure you were alright and found you were twelve weeks along. The baby’s fine. As a matter-of-fact, they are going to bring a monitor in this afternoon so we can have our first peak at the little one,” he said.</p><p>“I can’t believe I didn’t know I was pregnant. I just thought I had a touch of the flu. I guess even the flu can’t last that long,” she said feeling a little foolish.</p><p>“I should’ve noticed something was up myself. You have been sleeping a lot and hardly eating. We have to get you taken care of so you can properly take care of our baby,” he said and gently rubbed her belly, which had a small bump on it.</p><p>Jessica looked at his hand on her stomach and gave a small laugh, “I thought I was just putting on weight,” she said, turning a little pink.</p><p>“I would love you no matter what you looked like,” he said and she could see he really meant it.</p><p>Jessica was thrilled to be carrying another baby of Alex’s. “I never thought my life could be this perfect. I love you. Alex.”</p><p>“I love you to Jessica and I’ll spend the rest of my life showing you just how much,” he said as he gently kissed her.</p><p>Jessica shivered as the doctor applied the cold gel to her belly but soon all her pain seemed to fade away as she got her first look at their baby.</p><p>“Is that her?” Alex asked in awe, as a perfect little head came into view on the monitor. He was gripping Jessica’s hand in his as he got the first image of their child.</p><p>“How are you so sure our child is a girl?” Jessica asked with a proud smile. She too had a feeling the baby was a girl.</p><p>“Because this world won’t be complete without a mirror image of you in it,” he stated as fact.</p><p>Jessica’s eyes filled with tears once again. She couldn’t believe just a couple of short days ago she’d been filled with such despair. She felt like she would burst wide open from the joy she was feeling.</p><p>Her eyes returned to the monitor and she took in every detail of the three dimensional image of her child, whom was safe within her womb becoming stronger each day.</p><p>“Thank you for being a wonderful husband and father,” she said, barely able to get the words out of her tightened throat.</p><p>“No Jessica, it’s me who needs to thank you for having so much faith. I love you, Jacob and our daughter,” he said.</p><p>Jessica knew from that day forward her life would be a great adventure and even though there would be trials now and then, things would work out for them all. She looked from the monitor to her husband and then sent up a silent thank you to God for blessing her life with so much.</p><p>Epilogue</p><p>Joseph loved Thanksgiving. It was a time of gathering with his family, eating great food and reflecting back on another wonderful year with his dear family and friends. He had so much more to be thankful for this past year with the birth of another beautiful granddaughter and three other grandkids.</p><p>He cuddled Emily close to him and breathed in her magical scent. She was only one week old and he’d been overjoyed when she’d made her entrance into the world.</p><p>“You’re such a great gift to our family,” he whispered to her gently, while stroking her soft head.</p><p>Emily stared up at her grandfather, seeming to be mesmerized by his voice.</p><p>“Tell us another story gampa,” Jasmine demanded.</p><p>“Of course,” he replied to his eldest grandchild. “Twas the night before Christmas when all through the house...” he began and all four grandkids gave their full attention to their grandfather.</p><p>Just as Joseph was finishing his story, Emily started to fuss and Jessica walked into the warm den. “It sounds to me like Emily’s ready for her Thanksgiving dinner Dad,” she said to him, before bending down and giving him a kiss on the cheek.</p><p>Joseph reluctantly handed Emily over to her mother. She chuckled at him, “Don’t worry grandpa, you can have her back soon,” she said.</p><p>“I’ll take the kids out and let you have some privacy,” he replied gruffly before departing.</p><p>Jessica sat down in the comfortable rocker Joseph had purchased for her and Amy. She fed her child and felt so much contentment she could easily overflow.</p><p>“There you are. Dinner is being served. When you are done feeding her, I can burp her while you go sit down. You need to keep your energy up,” Alex said as he walked into the room.</p><p>“We’re almost done,” Jessica said quietly.</p><p>They sat there in a companionable silence while Emily finished eating. Jessica then handed her over to her father and sat with them as he gently burped her. “You can go eat,” he said with an affectionate smile. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I know but I’d rather wait. I still can’t get over how wonderful she looks in your arms. Your hands are bigger than her little body,” she replied.</p><p>Alex chuckled. He’d been so afraid to hold his tiny daughter the first time. She was so little, he felt as if he’d break her but once Jessica placed Emily in his arms he knew he could hold her twenty-four hours a day and it still wouldn’t be enough.</p><p>Alex finished burping her and she was sound asleep. He laid her down in her bassinet and then walked hand in hand towards the laughter coming from the dining room.</p><p>Joseph was out on the balcony saying a prayer. He was so thankful for his ever-growing family. He got a twinkle in his eyes as he thought about his youngest son. “Ah Mark, I’ve found you the perfect match,” he whispered into the night.</p> <p>Joseph chuckled to himself as he imagined his youngest son fighting to keep his bachelorhood. He would definitely fight it but the fall would be ever so sweet.</p><p>“Joseph, everyone’s waiting on you,” came the sweet sound of his Katherine’s voice.</p><p>“They can wait one more moment. Come here my beautiful wife,” he said, while holding his arm out towards her.</p><p>He pulled her into his arms and kissed her with a deep love that went beyond passion. She was a part of his soul. He’d been through the good and the bad with his wife and prayed each night they’d have many more years together.</p><p>“Okay my bride, let’s go have some dinner,” he finally said. They walked hand in hand into the dining room. Joseph looked around the large table, filled with laughter and a bit of chaos.</p> <p>Jacob was mashing his food all over his face and high chair. Jasmine was giggling about something her uncle Mark said to her and Isaiah was asleep in his father’s arms. Joseph looked towards the den and knew baby Emily was safe in her basinet.</p><p>He was so filled with love he had to sit there for a few moments before finally standing to make a toast. Everyone knew Thanksgiving dinner didn’t officially begin until he’d made a toast and each year the blessings became greater and greater, making him appreciate so much more.</p><p>“I would like to make a toast,” Joseph began in his normal booming voice. “I’m so thankful for the new additions to our family. Amy and Jessica, you have brought such light and joy to my sons and I will be grateful each and every day you somehow manage to tame these hooligans,” he said.</p><p>Everyone at the table laughed, while the happy couples moved just a little bit closer to each other.</p><p>“Of course the biggest blessing of all is to finally have the pattering of little feet running about. I love each of you beautiful babies,” he continued, as he looked at Jacob, Jasmine and Isaiah. “And what a blessing to have Emily born just one week before this most thankful of days,” he said and then gave a slight cough.</p><p>Everyone knew he was trying to contain his emotion, so they all pretended not to notice and gave him a moment to regain his composure.</p> <p>“I know this next year will be filled with many more blessings,” he said and looked over at Mark, his youngest son, who started to squirm a bit in his seat.</p><p>“Ha little brother, I think dad’s prophesying you’re going to be the next to give him a grandkid,” Lucas goaded his youngest brother.</p><p>“You know that’s not going to happen. I’m a confirmed bachelor,” he said on a laugh but there also seemed to be a longing in his eyes which both Jessica and Amy spotted. They looked at each other and smiled.</p><p>“Your brothers were too until they met the love of their lives. Now they’re far happier than they ever were before. We’re meant to have someone by our side,” he said. He then took his beautiful wife Katherine’s hand in his.</p><p>“I’m most grateful of all for every day I’m blessed enough to spend with you. You’re my light, my whole reason for being,” he said. Everyone was silent as they witnessed a love that couldn’t be matched.</p><p>“I love you too Joseph,” she replied, before discretely wiping a tear from her face.</p><p>“Now let’s eat this wonderful food that’s been prepared,” he said in a slightly cracked voice.</p><p>“Here, here,” everyone shouted. The rest of the night was filled with laughter and remembered times.</p>  </body></html>"]