["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As soon as Blake saw the men, he knew tonight would end with death. The problem was, Blake didn't think it would end with his death.</p><p>\"I don't want any trouble,\" he said, realizing the stupidity of those words. It was after midnight, he was in a derelict alley with three thousand dollars' worth of crack cocaine on him - and that was the good news.</p><p>\"You lost?\" one of the men asked, coming closer.</p><p>The other three from the opposite end of the alley drew closer, too. There was no way out. Blake could feel him rouse, sensing the danger. He didn't have much time.</p> <p>\"You need to leave,\" Blake said, fear setting in as he felt that familiar buzzing start in his head.</p><p>Another of them laughed. \"Give us those bags you just bought, bitch, and we'll leave.\" For a split second, Blake hesitated. He'd bought the crack with the last of his money, and he needed it.</p><p>Not because he was an addict; Blake had never touched drugs in his life. No, he'd intended his first use to be the last thing he ever did.</p><p>But that buzzing in his head was getting louder. No. Not yet. Not until I can get away from these people...</p><p>\"Take it and leave me alone,\" Blake ground out, yanking the bags from his coat.</p> <p>One of them took the bags, then shoved Blake. He staggered and fell, tasting blood as his mouth banged against a fire escape.</p><p>That rustling in his head got louder. It was too late.</p><p>\"Kill me,\" Blake gasped.</p><p>Confusion was stamped on the faces peering at him. \"He crazy,\" someone muttered.</p><p>Blake glanced around. No one had a gun or knife drawn. This was a dark, gang-infested alley in Columbia Heights, DC. Couldn't one of them stab him or shoot him?</p><p>Blake began to yell the most incendiary thing he could think of. \"What're you standing there looking at? You recognize me from last night, when I was fucking your mother?\"</p> <p>\"Oh, hell no,\" one of them said.</p><p>They surrounded Blake, kicking him. Blake twisted, making no move to defend himself. Instead, he arched toward the blows. Fear rose, but not of dying.</p><p>Break my neck, Blake thought savagely. Or take a pipe and smash my head open!</p><p>They didn't, though one of them did smash his foot into Blake's face, breaking his nose. Blake coughed up blood even as his whole body clenched. He was almost here. Blake tried to force him back, but he was too strong.</p><p>\"What's the matter with you?\" Blake roared with his last ounce of strength. \"Kill me!\" A hard kick snapped Blake's head back before his world went white. For a brief, blissful moment, Blake thought he'd finally gotten to die, and he felt overwhelming relief .</p><p>But when Blake came back to reality, there was blood everywhere. A few people were gathered at the end of the alley. Blake didn't know how long they'd been standing there, but their eyes were wild, faces chalky with shock. They'd probably never seen anything like this, even there, in one of the worst parts of the District.</p><p>Blake let out a howl of despair as he stared at the thick red blood coating his hands and the bodies around him. Damn you, he silently screamed at the monster inside him. Damn you to hell!</p><p>But that was the problem. Hell was where the devil inside Blake came from.</p> <p>Elise's living room began to shake, but she barely noticed it. She was so used to the vibrations every time a train zoomed by that it was more attention-grabbing when there were extended periods of calm.</p><p>The fifties song \"Jump, Jive and Wail\" played on her iPod, a recent gift from her sire, Mencheres. Elise would have continued to listen to music on her records, no matter how many times the trains made the needle jump and scratch them, but one of Mencheres's most common lectures was to embrace the changing world. Some vampires, as they got older, withdrew from society and became hermitlike, clinging to the things from their original time period. Eventually those vampires could become so disconnected that hatred for the ever-advancing world was a side effect.</p><p>Elise was already a loner. She lived under a metro tunnel, didn't socialize much with other vampires or humans, and far preferred big-band music to the noise on the radio these days. All things considered, Mencheres had reason to be concerned about her sliding down that hermit road, but she didn't hate the modern world or its changes. She was just happier by herself.</p><p>More shaking of the walls announced the arrival of the six-fifteen train. Elise put her book down with a sigh. Time to shower and eat, activities that required her to leave her comfortable home.</p><p>She put on a tank top and pants, adding a jacket over that in spite of the warm temperature outside.</p><p>Fewer clothes meant more attention, and Elise wanted to talk to as few people as possible. She pulled her hair into a ponytail, put on a baseball cap, and opened the creaking metal door.</p><p>A blast of smells hit her as she went into the tunnels that connected the defunct section where she lived to the operating metro tunnels above. At least she didn't need to breathe; the residual odors from the indigent who used these places as a temporary residence and bathroom, combined with the stench of rotted food, dead rats, or other animals - were bad enough.</p><p>The few homeless people who were in the tunnels at that hour didn't look at Elise as she walked by.</p><p>Every so often, a newcomer would approach her. One who hadn't been warned about her by the others, or who hadn't listened. Elise didn't feed from any curious newcomers - smelling them was bad enough</p><p>she just slammed them with the power in her gaze and compelled them to leave her alone. If one was stupid enough to attack her, well...that person didn't live long enough to regret it.</p><p>Tonight it was only the regulars, so Elise passed by without incident. She walked out of the tunnel and through the station platform, keeping her head down, not needing to look to know the way. It was so familiar to her, she could have made the trip in her sleep.</p><p>Once free of the closeted atmosphere, Elise's steps became longer and more relaxed. She even hummed as she made her way down Connecticut Avenue to the fitness club. The girl behind the counter barely glanced at Elise when she came inside, but a nod indicated that Elise didn't need to show her membership card. She was such a regular sight there, few employees asked to see it anymore.</p><p>Elise went upstairs to the multitude of exercise machines. Her size would never be any different than it was now, but the club employees asked too many questions if she didn't at least pretend to exercise.</p><p>After twenty minutes on the treadmill, Elise went to the locker room. She stripped and showered, then brushed her teeth with the toothbrush she kept with a few other items in a locker. After a quick blow-dry of her hair, she was ready to move on to the next item in her routine.</p><p>Some nights, when Elise was lucky, she fed from whoever was alone in the locker room. It only took a flash of her gaze for the woman to forget Elise had just cornered her and drunk her blood. But most evenings were busy at the gym. It was easier for Elise to walk the city, and find someone alone - or accompanied by fewer witnesses to brainwash.</p><p>Tonight, Elise found her meal along 7th Street, a young man who wandered away from his friends in the Sculpture Garden. She drank from him, closed the holes with a drop of her own blood, and sent him back to his companions inside of two minutes. He'd be sleepier from the pint she drained from him but otherwise unharmed. It was only in the movies that vampires needed to kill to feed, along with other falsehoods like wooden stakes and sunlight being harmful to them.</p><p>As a nod to her sire's admonishments to get out more, Elise then sat and read at a local coffee shop instead of just buying more books and going straight home. She even exchanged a comment about the weather with someone who sat across from her. There. No one could say she wasn't interacting with humans except to bite them.</p><p>When the coffee shop closed, however, Elise gratefully headed home. She walked through the Capital Lawn, taking comfort in the familiarity of the gleaming white buildings and older structures. Then she followed the line of the tracks through the city until she reached the station where the tunnels connected.</p><p>She'd made it past the few remaining travelers and into the inoperative tunnels when she smelled something unmistakable. Blood, seasoned with the distinctive tang of death. Elise quickened her pace, her sneakers making hardly any sound at all. There were very few homeless left in the tunnels at this hour, though their wariness was unfounded since Elise never killed one who hadn't attacked her first.</p><p>Still, those who guessed what she was didn't linger long after dark. Silly humans. Just because she preferred to go out at night didn't mean she was trapped inside during the day.</p><p>The smell became stronger the deeper Elise ventured inside the tunnel. Even over the sound of an approaching train, Elise could hear a heartbeat just ahead. Whoever it was had slunk back into one of the old maintenance alcoves but would soon find out that a sneak attack was a bad idea.</p><p>When the man stepped out onto the track with his back to her, she paused in surprise. Whoever this was didn't seem even to know she was there, let alone be lying in wait. That stench of blood and death came off the stranger, but even stronger was despair. He balanced on the edge of the track as if in indecision. The train would be here any second. The fool wouldn't try to cross the tracks now, would he?</p><p>The man clutched his head, muttering, \"No, not yet!\" several times. The tunnel vibrated as the train approached. With growing awareness, Elise saw that the man was going to jump right in front of it.</p><p>Even as she charged forward to snatch him back, something happened. The despairing scent pouring off him changed to the choking stench of sulfur. His mouth opened in an impossibly wide snarl as he whirled, gripping Elise with more strength than any human should have. Pinpoints of red shone in his eyes, like sparks before a fire, and before her gaze, his skin seemed to turn to a waxy ashen shade.</p><p>\"Vampire, \" he hissed, reaching for her throat.</p><p>Elise didn't pause to wonder what was going on. She punched him in the head, watching in relief as he collapsed to the tunnel floor. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blake's first thought on waking up and seeing duct tape around his hands instead of fresh blood was, Thank God. A year ago, the same sight would have shocked and terrified him. Now it was a better start than most days.</p><p>Then it occurred to him to wonder where he was. Or who the blond woman watching him with an unreadable expression was.</p><p>Blake glanced around, noting with relief that the room was empty of blood or bodies. It was also empty of windows, and it was shaking with a powerful vibration.</p><p>Was he still in the District? How long had the most recent episode lasted?</p> <p>\"You need to get away from me,\" were Blake's first words. He eyed his bound hands and feet. He would feel threatened as soon as this registered. Blake tensed, expecting that buzzing in his head to start up, but so far, there was silence. Still time for the woman to get away.</p><p>\"Why did you try to jump in front of the train?\" she asked.</p><p>Blake closed his eyes. That's right, the last thing he remembered was the train.</p><p>\"Did you stop me?\" he asked incredulously. \"Damn it, why?\" She raised a brow. \"You could say thank you.\"</p><p>Blake wanted to slap her. So close to being free, and she ruined it. \"You don't know what you've done, but you'll be making a bigger mistake if you don't leave right now.\" She gave a pointed look at his wrists and ankles. \"You think you can hurt me?\" The memory of being shoved in a police car, handcuffed, flashed through Blake's mind. He'd been fighting the encroaching noise in his head and hoping desperately that the cuffs and the reinforced backseat would hold.</p> <p>The next memory followed without pity. The crashed police car, kicked-in barrier between the front and back-seats, and the mangled remains of the two officers.</p><p>\"I'll kill you.\" Blake's voice was hoarse with self-loathing. \"Leave now, before it's too late!\"</p><p>\"You can't kill me,\" she said, a sort of detached amusement in her tone. \"I'm already dead.\" As Blake watched, her eyes changed. They became impossibly green and began to glow, bright as traffic lights. Her smile widened to show more of her teeth, where her front two incisors extended down to form sharp, pointed tips.</p><p>Blake found himself smiling. A vampire had kidnapped him. Today might be a good day after all.</p><p>Elise watched the man's reaction with interest as she revealed her inhuman nature. Surprisingly, he didn't look afraid. In fact, the strangest expression of relief crossed his face.</p><p>He tilted his head back. \"All right, then. Kill me.\"</p> <p>She wrinkled her nose. \"You think I'm going to bite you? Not with how you smell.\" He made an impatient noise. \"So plug your nose while you drink my blood. But hurry. I don't know how long it'll be before he takes me.\"</p><p>Elise considered him. She'd met suicidal people before but none who gave off the kind of vibes this man did. Considering what she'd seen after she grabbed him back from the oncoming train, Elise had a good idea about what was driving him to kill himself. She'd never personally come across someone in his condition before, but in her long life, she knew people who had.</p><p>\"You're possessed, aren't you?\"</p><p>Elise asked it matter-of-factly. His eyes widened as if he'd been struck.</p><p>\"Yes,\" he whispered. A spasm crossed his face, too raw to be labeled pain. \"For about six months now.\" He didn't look to be the type to play with a Ouija board. Maybe he was one of those foolish humans who trifled with spirits, seeking to tap into the dark power of the other side. \"How did it happen?\"</p><p>\"A car accident.\" Her brows went up, but he just sighed. \"I was driving home from work when this woman jumped in front of my car. I called 911, tried to help her, but she died in my arms. Witnesses cleared me of being at fault, and I thought it was just a terrible accident. About three weeks later, the blackouts started. I'd hear this buzzing in my head, then wake up in places I didn't remember going to, with no idea what I'd done. I thought I was crazy. Then - \" He stopped and swallowed hard, looking like he was about to throw up.</p><p>\"The demon started taunting me. Leaving notes in handwriting I didn't recognize, making videos of me doing things I couldn't even imagine, let alone remember...I can't live like this,\" he summarized, voice hardening. \"That demon's made me a murderer, a fucking monster! I tried seeing a priest, getting an exorcism - nothing's worked. It won't even let me kill myself. If you understand what's wrong with me, kill me now. You'll save lives if you do, believe me.\" Blue eyes stared intently at Elise from under black, scraggly hair. It was hard to tell what he really looked like under the dirt and grime that said he'd been living on the streets for a while. He looked to be in his midthirties, but what might have been an athletic, attractive physique was now hunched with guilt, fear, and despair.</p><p>Killing him would be an act of mercy, Elise reflected. It wouldn't be hard to do. Humans were so fragile; one flick of her wrist would snap his neck before he'd even realized she moved. After all, she'd killed before, and for less noble reasons than this.</p> <p>She'd almost decided to do it when Mencheres's face flashed in her mind. Was she becoming one of those vampires who forgot what it was like to be human? How precious those years were because they were so short?</p><p>\"What's your name?\" she asked, rising.</p><p>The hope on his face as she approached was heart-wrenching. \"Blake Turner. Will you...will you leave my body where it can be found? I still have family who might want to know what happened to me...\"</p><p>\"Blake Turner,\" Elise said slowly. \"I'm not going to kill you. I'm going to help you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blake looked around the tunnel. \"I'm not sure about this.\"</p><p>\"I need help to figure out whether you're salvageable or not,\" was Elise's curt response, as they continued down the passageway. \"Keeping you cooped up in my house isn't a workable solution.\"</p><p>\"Can't you just call someone?\" Blake asked, thinking house was a generous word to describe the place where she lived. Oversized coffin would be more appropriate, since it was tiny, underground, pitch-black aside from some sparse lighting, and lacked any kitchen, toilet, shower, or other amenities.</p><p>Still, it was a perfect place to keep Blake locked up and away from people, which was why leaving it didn't appeal to him. Who knew he'd be unable to convince a vampire to kill him? So much for the bloodthirstiness of their legend. Blake also couldn't understand why the demon hadn't taken over yet.</p> <p>Every other time Blake attempted to kill himself, the demon showed up and stopped him. Could it sense that the vampire wouldn't kill him? Was that why the demon was biding its time?</p><p>Or was it waiting for a better opportunity to appear? Like now, as they were heading toward the metro station and all the innocent people inside.</p><p>\"This isn't safe,\" Blake repeated for the dozenth time.</p><p>She kept walking, her grip on his hand like a cool vise. \"My sire will know what to do. I'll use the pay phone at the station to call him. It's safer if you come with me than to hope you'll still be at my house when I get back.\"</p><p>\"He's strong when he takes over,\" Blake said, almost spitting the words out. He hated what he'd been turned into - a host for the worst kind of evil. If death was the only way to stop the demon, Blake would gladly die. His life had been ruined beyond repair anyway.</p> <p>Just seven months ago, he'd been a successful stockbroker. He'd had a beautiful house, great friends, and was even on good terms with his ex-wife. Now he'd lost everything, was wanted for multiple murders, and the only way for him to stop the demon was to kill himself. It was a far, far cry from the days where his biggest concern had been the fluctuating market on Wall Street.</p><p>\"I'm stronger,\" Elise said.</p><p>Blake looked her over with doubt. Elise was about five-four, and if she topped a hundred pounds, it wasn't by much. Furthermore, she had an ethereal quality to her small-boned frame that hinted at fragility. Combined with her beautiful, pale face, Elise reminded Blake of one of those antique dolls his ex-wife used to collect. Elise was the type of woman men tripped over themselves to protect, not the type who could outwrestle a demon. Fangs could only reach so far, after all.</p><p>\"You said you've never encountered a demon before. How do you know you're stronger?\" Elise shot him a sideways glance. \"You talk so much,\" she muttered. \"It's tiring. Can you stop for a while?\"</p><p>Blake bit back an amazed snort. This was the woman who was supposed to stop the demon when it showed up? Some one who couldn't even carry on a brief conversation without getting tired?</p><p>\"I think we should go back,\" Blake said, as they rounded a corner and the metro station came into view.</p> <p>\"This isn't - \"</p><p>A roar of buzzing filled his mind all at once. Blake had only a second to clutch his head at the pain when his vision went white. He didn't even get a chance to warn Elise before the demon took him.</p><p>Elise was startled when Blake grabbed his head as if his brains had just exploded. His one hand was still in her grip; but just as she smelled the sulfur, he yanked it away. And then ran like a proverbial bat out of hell.</p><p>She cursed herself as she chased him. With the demon controlling him, Blake was quick, streaking up the tunnel and into the station in barely the amount of time it took to blink.</p><p>But Elise had superhuman abilities as well, so she stayed close behind him. The demon burst through the station, knocking over anyone in its way. At 5:00 A.M., there weren't many commuters, but enough to make exposing her real nature a risk. Elise kept her eyes and fangs under control, knowing her speed was bad enough, but at least that wouldn't announce \"vampire!\" to the general public. She plowed through the people just as roughly as the demon had, not letting it gain any ground. Keep running, she thought coolly. Once we're free of all these humans, I can quit playing nice.</p><p>The demon broke out of the metro station and darted onto the sidewalk, pumping Blake's legs like pistons. Elise kept it just ahead of her, letting it think she wasn't fast enough to over take it, until they reached a less-monitored part of the neighborhood. Then she sprang forward with all of her undead speed, tackling the demon from behind and bashing its head into the street.</p><p>Blake's body went limp, the sweet smell of fresh blood replacing the previous stench of sulfur. Elise flipped Blake around, giving his injury a quick evaluation. No skull fracture. The surface wound on his forehead can be healed - and his nose was broken before, anyway.</p><p>She opened one of Blake's eyes. No more swirling red. His skin lost that waxy-ashen look as well, and he didn't smell like anything except blood and unwashed human. The demon was gone. For the moment.</p> <p>Elise let her fangs out just enough to drag her thumb across one, welling up blood. Then Elise smeared her blood over the three-inch split in Blake's skin, watching with satisfaction as the wound slowly closed like a magic zipper had formed in his flesh.</p><p>It wouldn't do to feed Blake any of her blood. That would heal him more thoroughly, like getting rid of the concussion he no doubt had, but it would also make him stronger. The demon inside Blake was already pushing his body to limits no human should be able to sustain. Elise wasn't about to add to that.</p><p>But now, what to do with Blake? She couldn't just sling him over her shoulder and walk to the nearest pay phone; that would attract too much attention. Nor was she about to leave him there and risk the demon's coming back while she was gone. If only it was a little later in the morning, then she could grab the first person walking by with a cell phone and hypnotize them into compliance while she called Mencheres.</p><p>Creaking drew Elise's attention to the end of the street. A homeless woman slowly pushed a shopping cart overflowing with various items along the sidewalk. Elise smiled, then picked Blake up and tucked him under her arm like a football.</p><p>\"Good morning,\" she called out. \"How much do you want for that shopping cart?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blake awoke to a horrible smell. With that stink and everything being dark, for a moment, he thought he was in a garbage dump.</p><p>Then he heard her voice. \"Quit squirming, people will notice.\" It took a second for him to recognize who spoke. It was the vampire, Elise. Blake blinked, his vision clearing enough to realize it was dark because something was over his face. Something that reeked of body odor and things he didn't even want to name. Add that to a headache worse than he'd ever experienced, and Blake thought he might throw up.</p><p>But he was still with Elise, even after the demon had taken control of him.</p><p>\"Did anyone get killed? Hurt?\" Blake asked, dread spreading through him.</p> <p>\"No. Now quit talking.\"</p><p>At those words, Blake didn't care about her brusqueness, his cramped position with his knees mashed to his chest, the stink, or the throbbing in his head. The demon had taken control of him - but the vampire had kept it from harming anyone. For the first time in months, Blake felt a stirring of hope.</p><p>Whatever he was stuffed into vibrated. From the feel of it, Elise was pushing him along an uneven surface. It was hot, too, and with the reeking dark material covering him, hard to breathe.</p><p>Blake pulled the rancid material off him and looked around. They were in a cemetery, of all things, and from the looks of it, Elise had stuffed him into a shopping cart.</p><p>\"A shopping cart?\" Blake said. \"Whose stuff is piled on top of me?\"</p> <p>\"It belonged to a homeless woman, but don't worry, I paid for everything,\" Elise said, shrugging. \"It was a good way to transport you without drawing notice.\"</p><p>\"Why didn't you just...commandeer a car or something?\" Blake asked, getting out of the cart. His bones creaked once he was freed from that cramped position.</p><p>Another shrug. \"I don't know how to drive.\"</p><p>Blake looked at her with more shock than he'd shown when he found out she was a vampire. \"You don't know how to drive?\" he repeated.</p><p>Elise seemed amused at his disbelief. \"I never got around to learning.\" Waking up in a homeless person's shopping cart was still better than waking up to the sight of dead bodies. No matter his current circumstances, Blake was grateful for that. He still didn't know how Elise thought she could help him, but she could apparently keep him from killing when the demon possessed him. And since she was taking Blake to meet her sire, maybe that vampire would put him out of his misery even if Elise refused to. It was something to hope for.</p><p>It was ironic, Blake reflected. Before becoming possessed, he'd never thought much about death beyond having a life insurance policy and exercising to stay healthy. Now, Blake lusted after death as though it were a beautiful woman. Death meant he'd never hurt anyone again. Death meant his family would be safe. Death meant his remaining friends never had to open their doors and see a demon standing on the other side of it, concealed in Blake's skin. Death was Blake's only way of beating the thing inside him, and Blake wanted to beat it more than he wanted anything else.</p> <p>Elise's whistling shook Blake from his dark ponderings. She was whistling \"Beautiful Dreamer\" in a soft, melancholy way, the notes as perfect as if they were coming from a flute. Blake wondered how a vampire, who supposedly didn't breathe, could whistle. He wondered how Elise was out in the daylight without spontaneously combusting, or how it was that vampires even existed at all. So many things he hadn't thought were possible turned out to be true. Vampires? They existed. Demons? Real, too. If aliens landed at the Capitol tomorrow, he'd only be mildly intrigued.</p><p>\"If sunlight doesn't hurt you, why do you live underground in a tunnel?\" Elise kept whistling. Blake thought she'd decided to ignore him, but when the last strains of the song ended, she replied.</p><p>\"I don't do so well around people.\"</p><p>Her voice was soft, too. Filled with a sort of disconnected regret, as though her lack of social skills made her sorry, but she didn't understand why. She started to whistle that same song again. Blake sat down, leaning back against a tree, and closed his eyes. He could almost imagine he was somewhere else, listening to the sweet and haunting tune.</p><p>\"You won't let me hurt anyone, will you?\"</p><p>Elise paused. \"No.\" She continued whistling, the sound and her answer lulling him, making him feel almost...safe.</p><p>Blake did something he hadn't done willingly for weeks. He let himself fall asleep.</p><p>Elise listened as Blake's heartbeat and breathing became more relaxed with slumber. She kept whistling, even though she wasn't used to breathing this much. Still, the song seemed to soothe him, though why that mattered to her was a mystery. His being quiet will draw less attention, she told herself, knowing that was a lie. They were in Arlington National Cemetery. There weren't many people around to notice if Blake caused a stir, except perhaps the ghosts.</p> <p>It was so odd, this protective feeling. Once she'd made up her mind to help Blake, her long-dormant emotions awoke. Elise couldn't help but admire Blake's concern for other people, even over his own life. You won't let me hurt anyone, will you? It had been a long time since Elise had cared that much about other people, especially strangers.</p><p>When DC's homeless or criminal element attacked her - which happened every few months - she killed them. It didn't occur to her not to since she reasoned that by doing so, she was saving someone else from that person's future attack. Blake wasn't responsible for what the demon inside him did, but he was willing to die in order to prevent other people from getting harmed. His strength of character under these extreme circumstances held up a mirror to hers, and Elise didn't like what she saw reflected there. Mencheres is right, she realized. I've let myself slip away. How much of the person I was is still left? Can I salvage the remains before apathy eats away at the rest of me?</p><p>She'd start with Blake. Maybe by helping to save his soul, she'd earn a reprieve for her own. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A black Volvo approached, driving along an area where vehicles usually weren't allowed. Elise felt the encroaching power from inside the SUV.</p><p>\"Here they are,\" she told Blake, waking him.</p><p>The SUV stopped next to them, interrupting whatever Blake had been about to say. Two people got out, the man radiating a crackling power that announced him as a Master vampire, and a redheaded woman who seemed human.</p><p>\"Bones,\" Elise said, bowing her head in the deference he deserved as co-sire of Mencheres's line. Elise might have been out of touch with vampire society, but every undead person knew about Mencheres's merging lines with Bones several months ago.</p> <p>\"Elise,\" Bones replied, with a nod. \"This is my wife, Cat.\" Cat smiled and stuck out her hand. Elise shook it, thinking the famous half-breed didn't appear as she'd pictured her. With Cat's reputation and nickname of the Red Reaper, Elise had expected a more imposing presence, but Cat looked no more threatening than a Hollywood actress.</p><p>Blake looked at the two newcomers warily. \"Are they both vampires?\" he asked Elise.</p><p>\"He is,\" Elise replied, glancing at the redheaded half vampire again. \"She's more...complicated.\" Cat laughed. \"That's one way to put it.\" She extended her hand to Blake, but before he could even twitch, Bones batted it away.</p><p>\"Don't touch him, Kitten.\"</p><p>The cold menace in Bones's voice had Cat blinking in surprise even as Elise felt her anger flare.</p> <p>\"The demon doesn't have him now,\" Elise said. \"There's no need to act as if he's foul.\"</p><p>\"It's all right,\" Blake said, looking down at himself with sadness and disgust. \"I am foul. If I were he, I wouldn't want my wife touching me, either.\"</p><p>\"It's not your filthiness that concerns me, but she's half-human,\" Bones said, his hand still on Cat's arm. \"Demons can't possess vampires, but so little is known about half-breeds that I'm not risking the possibility.\"</p><p>\"Aren't you being a tad paranoid, Bones?\" Cat asked. \"You told me on the way over that the host had to die before a demon could jump. Well, he looks alive to me.\"</p><p>\"Heart attack, aneurism, blood clot, stroke.\" Bones ticked the items off his fingers. \"He's human, so he could drop dead in seconds just while he's standing there. This is why I didn't want you coming with me, Kitten.\"</p><p>Cat rolled her eyes, giving Elise a look that clearly conveyed her exasperation. \"Paranoid,\" she repeated. Then she turned her attention to Blake. \"Sorry to meet under these circumstances, but we're going to take you to Mencheres and hopefully he - \"</p> <p>\"No!\" Blake screamed, his hands flying to his head.</p><p>Elise knew what that meant by now. She flung herself onto Blake even as a blast of sulfur filled the air.</p><p>Bones also launched forward, wrapping one arm around Blake's throat and the other across the heaving man's chest. The fiery red lights were in Blake's gaze again, his skin turning sallower with each instant.</p><p>\"Let me go, \" the demon hissed in a voice that sounded nothing like Blake's. It was hoarse and sharp, like glass being ground together.</p><p>\"Kitten, start the car,\" Bones directed, not taking his attention off the demon.</p><p>Cat turned and walked to the car. The demon's eyes followed her, then it let out a laugh.</p><p>\"Catherine. \"</p><p>The redhead froze at the suddenly older, feminine voice coming from Blake's mouth. She turned around, eyes wide.</p> <p>\"Catherineeeeeee...\" the demon drew out in that same voice, but now with a pleading undertone.</p><p>\"Please don't leave. Help us. There were creatures at the door asking about you, Catherine. They're hurting us. Make them stop. No, don't, let my husband go! No, don't touch him, don't...NO! Joe, oh God, JOE!\"</p><p>\"Grandma,\" Cat whispered, tears in her eyes.</p><p>\"Bloody sod,\" Bones snarled, clapping his hand across the demon's - Blake's mouth. \"Don't listen to it, Kitten.\"</p><p>She still seemed shell-shocked. \"That was my grandmother's voice, Bones!\"</p><p>\"It's a trick,\" he said firmly. \"That's why the best thing to do is take this poor bastard out to the salt flats and kill him.\"</p><p>\"No one's killing him,\" Elise said at once.</p><p>Bones leveled her with a glare sizzling with green. His power expanded until it felt like it was burning her.</p><p>\"Don't be a fool.\" Each word was scalding. \"The only reason I'm not snapping this bloke's neck now is because there are too many living creatures around the demon could jump to. But his life will end on the salt flats. The only way to get rid of a demon is to kill the host.\" Elise was frail compared to the power emanating off Bones, and as her sire Mencheres's coruler, Bones was also in a position of authority over her. But that didn't mean she was giving up on Blake.</p><p>\"Mencheres told me I could bring Blake to him,\" she replied, her voice hard. \"So that's where we're going, not to any salt flats.\"</p><p>Bones's mouth curled. \"You were always stubborn.\"</p><p>Elise just stared at him. Y ou don't know me, she thought . And you might technically be my Master now, but you're not going to win this one.</p><p>\"Shouldn't we be going?\" Elise asked.</p><p>The demon's eyes locked onto hers. Evil. Knowing. Anticipating.</p><p>You're not going to win, either, Elise silently vowed. Determination welled up in her, stronger than any emotion she'd felt in decades. I won't let you. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Elise hadn't seen her sire in months. That wasn't unusual, except in this case, Mencheres had been the one to keep himself secluded away. One glance showed that the toll from the recent war that resulted in Mencheres's long-estranged wife being killed still hung over him. Physically, Mencheres looked the same. His waist-length black hair was just as lustrous, his creamy skin still held the amber tint of his Egyptian heritage, and his features were as handsome and regal as ever. But sadness clung to him in a tangible way, making the familiar lines around his mouth seem more likely to form a frown than a smile.</p><p>She hugged him, feeling none of her normal aversion to close contact. At the feel of his arms around her, the same peace washed over her that Mencheres always inspired. Father, I've missed you.</p><p>When he let her go, Elise touched his face. \"You look terrible.\" Mencheres gave her a strained smile. \"True, but I will be better in time.\" All things heal with time, he'd told her shortly after turning her into a vampire. Elise still wasn't sure she believed that, but things did numb with time, at least.</p><p>\"Tell me about the man,\" Mencheres said.</p> <p>Blake wasn't there; Bones had taken him directly to the basement, where the vampire cell was located.</p><p>Every permanent vampire residence had a reinforced room for confining new vampires while they fought to control the initial blood craze. If a new vampire couldn't break out of it, Bones had reasoned, neither could a demon.</p><p>\"He's back to himself now,\" Elise replied, shuddering at the memory of their hours-long car ride. The demon had continued to torment Cat by mimicking her grandparents' voices on what had - apparently</p><p>been the scene of their murder by vampires. Bones couldn't keep his hand over the demon's mouth the entire time, either. Not with the demon biting Bones and trying to drink vampire blood off the wounds. Or choking when Bones gagged him. Several times, Elise had worried that Bones's temper would snap, and he'd kill Blake, but they'd all made it in one piece, though Cat was still outside composing herself.</p><p>Mencheres studied Elise. She looked away from his probing gaze. Finally, a heavy sigh came from him.</p> <p>\"You've come to care for the human.\"</p><p>It wasn't Mencheres's mind-reading skills that betrayed her. Those only worked on humans, not other vampires. Mencheres just knew her too well.</p><p>\"It makes no sense,\" Elise admitted. \"He has no value in this world, no reason to go on. Plus, he wants to die. But I was like that, too, once. Maybe more than once.\" The silence stretched between them, filling with the unspoken memory of their history. Mencheres didn't need to be reminded that Elise had also been desperate to die when she was human. After all, it was how they'd met.</p><p>\"I will try,\" Mencheres said at last. \"But there may be nothing that can be done.\" Elise laid her hand on her his arm. \"Sire... father...thank you.\" Mencheres's dark gaze was bleak. \"You may not thank me when this is over.\" The metal clamps bit into Blake's wrists, ankles, and waist. Bones had shackled him to the wall in a way that let Blake know the vampire wasn't concerned whether he was bruised in the process. Add the green glinting in Bones's eyes and the fangs curving where normal teeth had been, and Blake knew he was staring death in the face.</p><p>\"No one's here,\" Blake said quietly. \"You could say it was an accident, that I tried to get away.\" Bones shot him a single glare. \"Mate, if killing you were an option, you'd have met your maker hours ago. But I'm not giving that foul beast inside you the satisfaction of freeing it. Not until there's nowhere for it to run.\"</p><p>Elise's entering the room with a tall, foreign-looking man stopped Blake's reply. She had her hand in the stranger's, and Blake wondered if this was her husband or boyfriend. Oddly, he didn't like either thought.</p> <p>\"You tried to control his mind?\" the stranger asked Bones, traces of an unfamiliar accent in his voice.</p><p>Bones grunted. \"Too right. Filthy get wouldn't shut up in the car, and for some reason, he kept after my wife the whole bloody trip.\"</p><p>The stranger looked thoughtful at this information. Blake winced.</p><p>\"I'm sorry.\"</p><p>The stranger moved to the side, and Blake saw he had a dog behind him, of all things. Elise shut the door. It was just the four of them and a mastiff in the room. What now? Blake wondered.</p><p>The stranger's eyes narrowed on Blake, then went green. So bright, like looking into the sun, but a different color. Staring into his eyes, Blake felt as if he were spinning, but that was impossible, since he was manacled to a wall. His heart began to pound, and a weird feeling of panic rose.</p><p>Elise moved to stand close to him, not touching, but her presence was soothing anyway.</p><p>\"This is my sire, Mencheres,\" she said softly. \"He's going to help you.\" No one can help me, Blake thought, then almost recoiled at the blast of invisible bands that gripped him. What the hell?</p> <p>\"Something's...squeezing me,\" he gasped out.</p><p>Mencheres kept staring at him with those hypnotic eyes. \"I am.\" The pressure increased until lights danced in his vision, and he could barely breathe. This is it, Blake realized. I'm dying.</p><p>\"Sire,\" he heard Elise say, sounding agitated.</p><p>Don't worry, Blake wanted to tell her, but didn't have enough air for the words. I'm not afraid. Thank you for everything you've done. It's not a bad way to go, actually, looking at your beautiful face...</p><p>\"What is your name?\" Mencheres asked. His voice sounded far off and echoing. Amidst the encroaching darkness, unable to breathe, Blake wondered how the guy expected him to answer.</p><p>\"What is your name?\" the question was repeated, with more emphasis. Mencheres's face filled Blake's vision, those ghastly glowing eyes boring into his. Get away, Blake thought. Let me see Elise again.</p><p>She's the only one in this room who gives a shit about me.</p><p>\"What is your name? \" With a harder squeeze. Everyone but Mencheres faded out of Blake's sight.</p><p>Blake's lungs were burning, his chest jerking in a vain attempt to coax air into it.</p><p>\"Xaphan,\" someone hissed. Surprisingly, the voice was clear to Blake. Should he be able to hear things while he was dying?</p><p>\"Xaphan,\" Mencheres repeated. More power slammed into Blake, until there was nothing in his vision but black, and he couldn't feel the pain in his lungs anymore. \"Leave him.\" An ugly laugh echoed across Blake's mind. \"No, little Menkaure. And you're not strong enough to force me.\"</p><p>Another squeeze. It seemed like so long since he'd breathed, Blake didn't know how he was still even alive to register the viselike grip.</p><p>\"Leave him.\"</p><p>That awful buzzing filled his head, indicating the demon was about to take over. Blake wanted to scream, but he couldn't move, couldn't see, couldn't talk. What if this was hell? Was he already dead and paying for all the things he'd done?</p><p>A string of words in a language Blake had never heard somehow penetrated his consciousness. The weirdest thing was, it was in a feminine voice, and it wasn't Elise.</p><p>Mencheres growled. That's how it sounded, anyway, and something so heavy and hard pressed against Blake that he prayed for mercy. Please, no. Too much. Stop. Stop!</p><p>\"Come out of him!\" It was a roar that Blake felt in his bones. Then he was falling, blinding lights streaking by. For a few incredible seconds, Blake felt free of everything. Even sound faded into silence, leaving blissful, peaceful, welcoming silence. At last...</p><p>Then feeling came back in a rush of pain as something pressed on his chest, and his lungs felt like he'd inhaled fire. This time, when he opened his eyes, he saw Elise's face over his. Her mouth came down, not in a kiss, but to blow air into him.</p><p>Blake coughed, tilting his head because all of a sudden, he needed to gulp in breaths. Her hands - pale, cool, soft - touched his forehead.</p><p>\"Are you all right?\"</p><p>Blake couldn't reply, too occupied with gulping oxygen to try to form words. A dark head leaned over him, black hair falling around his shoulders.</p><p>\"I can't save him,\" Mencheres stated flatly. \"The demon inside him is too strong.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sun had set an hour ago. Elise was tired, lack of sleep from this morning starting to catch up with her. Still, she didn't take Mencheres up on his offer to have someone else guard Blake while she rested.</p><p>It seemed too cruel to pass Blake off to a stranger just so she could sleep, especially since people were acting like Blake was already dead.</p><p>She took Blake to the kitchen, knowing there would be plenty for him to eat. The humans who lived with Mencheres as willing blood donors for him and his entourage meant that the kitchen was stocked.</p><p>Blake was ravenous, wolfing down three plates of food before looking embarrassed at his excess.</p> <p>Elise's stomach growled as well, but not for what Blake was eating. She pushed down her hunger with the same ruthlessness she'd used to forgo sleep. Blake didn't have long to live. The least Elise could do was to make these last days as comfortable as possible.</p><p>With that in mind, she'd refused to pack Blake up and start the journey to the salt flats tonight. There'd be time enough after Blake was fed and rested, she'd insisted to Mencheres, and he didn't argue. Bones was less agreeable, muttering that every minute they hesitated, the demon had a chance to possess someone else, continuing its carnage through a new person.</p><p>Elise could see Bones's logic. Even a couple days ago, she'd have agreed with it, but a lot had changed in the last twenty-four hours. Blake's first thought ever since she'd met him had been about what was best for other people. Well, Elise would be the one to think about what was best for him, and tonight, that wasn't loading him up in a car to drive to his death. Death would come soon enough for Blake, and that knowledge gnawed at Elise worse than her hunger or lack of sleep. It wasn't right. Long ago, Elise had been given a second chance. Why couldn't one be found for Blake?</p><p>Mencheres walked into the kitchen, silent as a shadow. Elise was sitting next to Blake on a barstool by the counter-top, close enough that she could feel and see Blake tense when he noticed the other vampire.</p><p>\"What did you do to me before, in the other room?\" Blake asked Mencheres, his voice almost casual.</p> <p>\"I suffocated you until you were between life and death. It was my hope that I could use your weakened condition to force the demon out and send it into the dog,\" was Mencheres's equally calm reply. \"It didn't work. I'm sorry\"</p><p>\"And you did all that without even touching me.\" Blake sounded bemused. \"You must be one powerful vampire.\"</p><p>For a second, Mencheres looked weary. \"Not powerful enough. The demon in you is ancient and strong. It will grow stronger with each person it destroys, so I can't let it go free.\"</p><p>\"No, you can't,\" Blake agreed, his jaw tightening. \"I know better than anyone about the horrible things it will do. This needs to end.\"</p><p>Mencheres stared at Blake. \"You're a very brave young man. I do regret what must be done.\" Elise glanced away. She felt a stinging in her eyes, even if it had been longer than she could remember since the last time that happened.</p><p>\"Mencheres, I need a razor,\" Elise said abruptly. \"After Blake showers, he can shave.\" Blake gave her a surprised look, but Mencheres's expression was grim.</p> <p>\"You can't leave him alone with the razor,\" Mencheres said. \"The demon will know what we've planned. Xaphan will try very hard to kill Blake, so he can escape into an unknown host before Blake reaches the salt flats.\"</p><p>Blake snorted. \"Before, the demon wouldn't let me kill myself. Now he wants to do the honors? And what are these salt flats I keep hearing about?\"</p><p>Mencheres opened his mouth, but Elise answered, unable to keep the huskiness from her voice.</p><p>\"Demons can jump into any living thing once their host dies, even an animal that's several miles away.</p><p>So when we...when you die, there can't be anything alive nearby for miles.\"</p><p>\"Wouldn't it be okay if the demon were to possess an animal?\" Blake asked. \"I mean, a possessed armadillo couldn't do much damage.\"</p><p>\"Animal possession is very temporary,\" Mencheres replied. \"The demon's goal is to get back into a person. It's easy to compel an animal to kill itself once people are around. Haven't you ever noticed that some animals seem to throw themselves into traffic? The driver of the first car to strike a possessed animal would, by virtue of closest contact, then become the next person the demon possessed.\" Blake sighed. \"It just keeps getting more twisted, doesn't it?\" \"There's only one type of place where it's safe to force out a demon,\" Mencheres went on, filling the loaded silence. \"The salt flats. Salt is a natural element for containing a demon. Once the host dies, the salt limits a demon's range to only a mile in every direction, and there are no humans or wildlife living on the salt flats.\" Elise wished she knew what Blake was thinking so she could...what? Tell him things would work out?</p><p>They wouldn't. There were so few things she could do to help him, and that knowledge made her feel worse than useless. Not only had she failed to save him, she'd be one of his executioners.</p> <p>\"Okay.\" Blake nodded briskly. \"That makes sense. I'm glad you guys know how to stop it. I wish I had found you sooner.\"</p><p>\"It seems like fate that you found us at all,\" Mencheres said, staring at Elise. \"Demons feed on rage, hatred, jealously - all our lesser emotions. Once they've consumed everything they can out of a person, they move on. Elise tells me you were possessed when a woman ran in front of your car several months ago. You understand now what happened. The demon used her up, then it let her kill herself to find a new body. It would have eventually done the same to you.\" Mencheres paused, his gaze flicking back to Blake. \"You must be very strong. As a rule, humans don't last long before the demon controls them completely. For you to still have periods of control against a demon of Xaphan's caliber - remarkable.\"</p><p>Blake shoved his plate away and held out his hands. \"Do you see the blood still staining these?\" he asked, intensity pouring off each syllable. \"There is nothing remarkable about being a murderer, and that's what this thing has made me.\"</p><p>Elise wanted to tell Blake that no, he wasn't the killer. He was the weapon, and weapons didn't have a choice. But even though she believed that, the words eluded her.</p><p>She stood. She might not be able to say anything to ease Blake's guilt, but she could still do something.</p><p>\"Let's clean the blood off you, for a start.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blake stood under the hot spray of the shower and closed his eyes. This felt good. Normal. It used to be his routine every morning and night. Now he couldn't remember the last time he'd had a hot shower.</p><p>The stall was big, too. One of those upscale versions where there were multiple heads and two entrances to it. These vampires sure lived in style.</p><p>He was lathering his hair for a second time when Elise stepped into the shower. Blake froze so completely that he didn't even wipe his eyes when the suds trickled down to them.</p><p>She was naked, her body slender and sleek and so unbelievably beautiful that Blake wondered for a moment if he were hallucinating. Elise took the shampoo off the alcove in a nonchalant fashion, pausing to let her gaze sweep over him.</p> <p>\"Without all that dirt, you're younger than I thought you were,\" she said, sounding faintly surprised.</p><p>Her hand swiped his face, brushing the soap from his eyes and flicking his sudsy hair back. \"You look completely different.\"</p><p>I could say the same thing about you, Blake thought, unable to tear his eyes away from her pale skin, long legs, petite round breasts, and tight cluster of hair between her thighs. His cock noticed, too, waking up and stretching as if to get a better look.</p><p>Blake spun around. Despite everything he'd been through, it looked like embarrassment wasn't beyond him after all.</p><p>\"Uh, Elise, I don't think you should be showering with me,\" Blake managed.</p> <p>He heard the water hit her as she moved closer. God, the thought of how Elise would look with rivers of water streaking down her skin made him harder. All at once, the shower stall felt far too small.</p><p>\"Why not? I have to keep watch over you, and I needed to shower. I left you alone to relieve your bodily functions, but it's more efficient for us to shower together.\" She sounded utterly clinical, as if discussing carpooling versus taking a bus. Obviously, being naked in the shower with him meant nothing to Elise. Was it the demon in him that made her consider him as less than a man? Or was it the fact that he was human, and she was a vampire?</p><p>Either way, Elise's complete dismissal made anger flare in Blake. He turned around, his erection jutting out and almost hitting her in the stomach.</p><p>\"As you can see,\" Blake began, \"there's a problem with your efficiency strategy.\" Startled, her gaze traveled over Blake in an entirely different manner than it had before, pausing at his chest and stomach before moving lower. With her mouth half-open and the water clinging to her just as sensuously as Blake had imagined, his cock jumped, like it was begging for her touch.</p><p>She turned and walked out of the shower without another word. Blake closed his eyes and let out a slow sigh. Then he began to attack his hair with the shampoo again.</p><p>Elise was shaken by her reaction to Blake in the shower. Seeing a naked man shouldn't have had any effect on her. Becoming a vampire tended to kill modesty along with a heartbeat, so the sight of bare flesh didn't hold the same provocative taboo that it did for humans. Plus, she was used to showering in front of strangers, considering she took the majority of her showers at the fitness club.</p> <p>So the wave of need that hit Elise when she saw Blake naked was a complete surprise. Blake was long-limbed and muscular, his thinness making his body look chiseled instead of gaunt. The dark, crisp hair that covered Blake's chest narrowed when it reached his stomach, then led in a trail to his groin before lightly dusting his thighs. Looking at Blake, Elise had been overwhelmed by an urge to touch him.</p><p>She'd stroked his face and flicked her fingers through his hair before she could even stop herself.</p><p>It never occurred to Elise that Blake would want her. She was a vampire, he was human. Plus, she was participating in his death, a fact Blake was well aware of. For all his agreement over why he had to die, still, Elise's position as one of his executioners would hardly warrant affectionate feelings.</p><p>Of course, maybe that desire was Blake's natural reaction to a naked woman - any woman, even her, cold lifeless thing that she was. The thought relieved and saddened Elise. Just stop, she told herself. It was one thing when you were forcing yourself to care about Blake to keep from killing him. Now you're caring too much. Why can't you feel things like a normal person, instead of it constantly being all or nothing?</p><p>Blake's coming out of the bathroom interrupted her mental chastisement. He had a towel around his hips, his black hair touching his shoulders and curling from moisture.</p><p>\"Sorry,\" he said, blue eyes steady. \"Maybe group showers are just what vampires do, but they're more than I can handle.\"</p><p>Elise had to look away. Blake's earnestness made her heart give an odd lurch, like something was yanking at it.</p><p>\"I'm the one who's sorry,\" she replied, fighting to keep her voice cool. \"It won't happen again.\" Blake cleared his throat like he was about to say something, then stopped. Elise glanced up, waiting, but his mouth was set in a tight line. Whatever it was he'd been about to say, he'd decided against it.</p> <p>\"Here.\" Elise indicated the chair across from her. \"Sit. I'll shave you.\" Mencheres had dropped off those essentials along with some clothes for Blake, since they were close to the same size. Blake didn't argue about shaving himself. He just sat in the chair and tilted his head back.</p><p>Elise approached, her gaze fastened on the long line of Blake's throat where his pulse throbbed so temptingly. She licked her lips. What would it be like to taste him?</p><p>Stop it, she rebuked herself at once. He needs your help, not your selfishness.</p><p>She lathered Blake's neck, working quickly with the razor so she didn't have to be so near to him.</p><p>Blake's scent was a mixture of nervousness, weariness, and something else. Something spicy Elise couldn't name since she hadn't been able to determine Blake's natural scent underneath the camouflaging odors of blood and death before. His pulse increased every time she made a stroke with the razor. Was he worried about a vampire holding a sharp object to his throat? Wondering whether she'd be overcome with bloodlust if she accidentally nicked his skin?</p><p>\"You're in no danger of my feeding from you,\" Elise told him after he twitched when she leaned in close to shave under his jaw. Even with the dabs of shaving cream clinging to his face, without his former shaggy beard, he was more handsome than Elise first realized.</p><p>\"Do I still smell too bad?\" he teased.</p><p>No. You smell wonderful, and I'd like to bury my fangs in your throat and hear you moan while I suck your blood.</p><p>\"I'm not, ah, hungry,\" Elise stuttered. Where had her icy aloofness gone? Why was he affecting her so much?</p><p>She finished with a last upward stroke of the razor, jumping back to gesture to the clothes on the bed.</p><p>\"These are for you. I'll leave while you change.\"</p><p>Elise almost ran from the room, slamming the door and leaning against it while clutching the razor in her hand. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The largest salt flats in the United States were in Utah. Flying would have been the quickest way to get there, but even though Mencheres had a private plane, he didn't choose that option. Maybe he was trying to give Blake a couple days to prepare for his death.</p><p>Driving was another possibility, but that came with its own set of difficulties, the least of which was comfort. Stuffing Blake into a backseat for over two days while driving him to his execution was cruel.</p><p>Also, the demon had a greater chance of causing an accident and killing Blake - with plenty of people around to jump into - if they were all crammed into a car.</p><p>Therefore, Elise was relieved when Mencheres said they'd take a train. It would just be the three of them. Bones had muttered something about it being too soon since the last train he'd taken, whatever that meant, and since he still held a grudge against the demon for its hours of tormenting Cat, Elise was glad Bones and Cat weren't going.</p> <p>Mencheres booked two bedroom cabins for the journey. It would take them almost three days to get to the Bonneville Salt Flats in Utah. Once they boarded at Union Station, Mencheres closed himself in the cabin with Blake and ordered Elise to sleep in the other one. She'd stayed awake during the night and through the morning to watch over Blake. The demon hadn't taken him again, however, and Blake had slept like he'd been drugged. It seemed with his fate sealed, he felt relieved, while Elise was the one struggling with anger and doubt.</p><p>Once alone in the cabin, Elise didn't think she'd be able to sleep, but her body had different ideas. The rocking of the train felt comfortingly familiar, lulling her to sleep even though her mind kept whirling.</p><p>When she woke up, the sky was turning dark shades of orange and blue. Almost dusk. She'd slept the rest of the day away.</p><p>Elise bolted out of the narrow pull-down bed, guilt filling her. There went six of the fifty-five hours remaining of Blake's life, and she'd spent it slumbering while Blake had been shut in a cabin with a vampire he barely knew. True, he barely knew her, either, but compared to the time Blake had spent with Mencheres, Elise was an old friend.</p><p>She was on her feet and whipping the door open to the neighboring cabin in the next second. Blake looked up in surprise to see her in the doorframe, but Mencheres just raised a brow.</p> <p>\"With your haste, one might think you were afraid I'd lost him.\" Blake was staring rather fixedly at her midsection. Elise glanced down and felt a spurt of embarrassment, of all things. Not at the fact that she was shy over only wearing her shirt and underwear, but at how that revealed her anxiousness to see him as soon as she'd woken.</p><p>\"I...thought I heard something,\" Elise lied.</p><p>Her sire gave her a look that said he knew better, but Blake seemed to buy it. He dragged his gaze away from her and coughed.</p><p>\"I was about to go to the dining cab and get dinner. Did you want to come with me?\"</p><p>\"Yes,\" Elise said at once.</p><p>A smile spread across Blake's mouth. It transformed his face into something dazzling, but it also looked so unfamiliar on him, Elise realized this might be the first time she'd seen him smile.</p> <p>\"You might want to put something else on.\"</p><p>\"Oh.\" There went that flash of embarrassment again, as if the clock had magically rewound, and she was a girl with her first beau. \"Of course. I'll be back soon.\" Elise returned to her cabin, shaking her head at the strange way she was acting - and feeling.</p><p>Blake leaned back in the chair across from Mencheres. There was a pull-down table between them that doubled as a chessboard. They'd played seven games, and the vampire had beaten him every time.</p><p>\"She likes you,\" Mencheres said quietly once Elise left the cabin.</p><p>A snort escaped Blake. I wish. \"She can hardly tolerate speaking to me for longer than five minutes, so you'll excuse me if I disagree.\"</p><p>\"Youth,\" Mencheres muttered. \"So blind. Speaking of that, checkmate.\" Blake looked at the board. How the hell? \"You tricky bastard,\" he said, seeing the trap he'd fallen into.</p><p>Mencheres gave Blake a tolerant look. \"I was alive before chess was even invented. If you could beat me, then I wouldn't have learned much in my years, would I?\" And Blake knew Mencheres had been around for a lot of years. Over four thousand, the vampire had stated casually, as if that wasn't a staggering number. He'd also told Blake about the history of vampires. How Cain had been the first after God cursed him with forever drinking blood as a reminder that he'd spilled his brother Abel's. That they lived in structured societies ruled by a head Master, and</p><p>contrary to Hollywood's frequent assertion - wood through the heart was ineffective in killing them.</p> <p>Blake didn't ask why Mencheres was so free in divulging this information. Who was Blake going to tell? He'd be dead soon.</p><p>Elise came back. Her hair was wet, making it appear a darker blond. Her cabin must have had a shower in it like this one did. She wore drawstring cotton pants, which seemed to be her norm, but instead of a zip-up hoodie over her tank top, her arms and shoulders were bare. Blake's gaze lingered over her pale, radiant skin, remembering what it looked like without clothes covering it.</p><p>Figures he'd meet a woman like Elise now, when he was at the lowest point of his soon-to-be-ended life. Blake wished he could have met her before the demon, when he'd be able to take Elise to a real dinner, not just a quick bite on the train's dining car. Or to a Broadway play, or hell, to a swanky blood bank, if that's what she liked. Elise had shown him more compassion than most of the humans he'd come across in the past several months. He only wished there was something he could do to thank her.</p><p>There wasn't, of course. All he could do to show his appreciation was to make the last chapter of his life as easy on her as possible. So few things were still within his control, but he could meet his end like a man. No whining or any of that bullshit. Plenty of people died before their time. Because of the demon in him, Blake had been responsible for some of those untimely deaths, in fact. Fair didn't count for a damn thing when it came to life - why should he cry about not getting fairness in death?</p><p>\"I'm ready,\" Elise said, holding open the sliding door.</p><p>Blake stood. \"So am I.\" And I'll prove that, Elise, when the time comes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Elise picked at her plate, eating a few bites just to look normal to the other humans in the dining car.</p><p>Blake had been intrigued that she could eat at all.</p><p>She was silent throughout most of dinner, struggling to think up something to say and failing. Blake didn't seem to expect her to chat, either. Elise felt frustrated. Couldn't she even make small talk to ease his evening? Was she so out of practice with how to act in a social setting that she'd been stricken mute? She was a vampire; she could lift the train car and carry it if she had a mind to! Yet she couldn't come up with a way to start a single, pleasant conversation. How humbling.</p><p>\"Things have been quiet for almost twenty-four hours,\" Blake said.</p> <p>Shame stung her, forcing out a blur of words. \"I'm sorry. It's just that I'm not very good at conversations. For years, I hardly talked to anyone aside from Mencheres, and he knows me so well, few words are needed. I would like to speak with you, Blake, but I find it extremely difficult coming up with the proper words to say.\"</p><p>He stared at her, his mouth quirking. \"I meant the demon had been quiet for almost twenty-four hours, but...you want to talk to me?\"</p><p>If Elise had still had blood pressure, she'd have blushed. Of course Blake had been referring to the demon. She was the only one focused on herself, narcissistic fool that she was.</p><p>\"Never mind,\" she murmured.</p><p>Blake's hand slid across the table, touching her arm. \"I'd like to talk to you, too,\" he said. That little quirk to his mouth faded, making his face very serious. \"If that's all right.\" His fingers were warm. Blake wore a white button-down shirt, the neck open, showing off his beautifully sculpted throat and collarbones. Black pants fit him well, emphasizing not only his leanness but also the strength in his legs.</p> <p>Elise downed her water in a gulp. This was bad. She hadn't felt this way about a man since - well. And that had ended horribly, too.</p><p>\"Elise?\" Blake was still staring at her. \"Is that all right?\" No. Because if I don't pull back now, if I don't distance myself from you this moment , I'm going to hurt like I haven't hurt in decades. My coldness and apathy are all that can save me.</p><p>But just as Blake was helpless over the fate that brought him ever closer to the salt flats and the end of his life, neither could Elise bring herself to turn her back on him. Some things had to be done, no matter their cost.</p><p>\"I'd love to talk to you,\" she said. \"Let's go back to the cabin.\" Mencheres wasn't in the cabin when Blake entered it. Elise didn't seem concerned about his absence, however, so Blake didn't question it. Maybe the vampire was getting some overdue sleep. Or finding his own dinner.</p><p>\"Here.\" Blake gestured to the bench across from him. \"It's comfortable, if you have a good imagination.\"</p><p>She smiled, showing pretty white teeth without that curve of fang he knew lurked in her mouth. Even though her hair was still damp, and she didn't wear a speck of makeup, Elise's beauty was obvious. She seemed unmindful of the looks she garnered, though. Hell, Blake had thought the train porter was about to ask her out when he dropped off the check.</p> <p>Was it real? he wondered. The movies hadn't been right about much concerning vampires thus far, but what if Elise's looks were some sort of illusion? A predator's mirage in order to lure her prey closer?</p><p>\"Is that your real face? Or do you look...\" Blake paused, trying to choose an inoffensive word,</p><p>\"different?\"</p><p>She frowned. \"I look different when I shed my human disguise, if that's what you mean.\"</p><p>\"Yes, that.\" So he'd been right about the glamour. What was under it? \"Can I see you? The real you?\" Elise's blue eyes began to swirl with green, growing brighter, until they were pure emerald and cast a glow in the small cabin. She opened her mouth enough so that Blake could see the tip of her tongue touch two white fangs that hadn't been there a moment ago.</p><p>\"This is me,\" she said, voice soft and almost hesitant.</p><p>Blake waited for more. When nothing happened, he was confused. \"I've already seen you like this, right after we first met, remember?\"</p><p>\"I remember.\" For a moment, she looked as confused as he'd felt. \"I thought you must have forgotten, since you asked to see the real me...\"</p> <p>Blake couldn't help himself. He laughed, which made her eyes glow an even more vibrant shade of green.</p><p>\"What's funny?\" She sounded pissed.</p><p>Blake waved a hand, controlling himself. \"I thought maybe you were using some sort of spell to look so goddamn beautiful, but it's just you. No wonder Mencheres changed you into a vampire. Who wouldn't want to keep you around forever if they could?\" Her mouth was still open, but now, it looked more like in disbelief. \"You think I'm beautiful like this?</p><p>But you're human!\"</p><p>She said it as if that was a logical reason he shouldn't. Blake sighed. \"Doesn't mean I'm blind.\" She seemed to shrink a little in her chair, and she looked away. \"I'm a vampire. I drink blood, I don't breathe, and my heart doesn't beat. Don't I scare you?\"</p><p>Blake thought of all the things he'd seen - and done, though thankfully he didn't remember those parts</p><p>the past several months. Elise, scary? She couldn't be less frightening to him.</p><p>\"You don't scare me.\" His voice was rough. \"In fact, I think you're the closest to an angel that I'll ever get.\"</p><p>Something glittered in her eyes, making them brighter. It wasn't until a pink tear slid down her face that he realized what it was.</p><p>\"Oh, God, Elise, don't cry,\" Blake said. He moved the short distance across the cabin to take her in his arms, half-worried she'd shove him away.</p><p>She didn't. Her arms wrapped around him, amazingly silky skin pressed against his cheek. Elise felt cooler than he did, but not in an icy, lifeless way. No, the supple, soft touch of her flesh felt as alive as his. If he hadn't known what she was, Blake might have thought the air-conditioning was just set a little low.</p><p>\"I'm sorry,\" she whispered. \"It's so wrong of me to burden you with my tears. Please, let me go.\" Blake didn't want to. Holding Elise felt more right than anything he'd done in well, he couldn't remember howlong. \"I need this, too,\" Blake said.</p><p>Once, he'd have been too guarded to admit to such vulnerability to a woman he didn't know very well, but now those games seemed like a waste of time. Time he didn't have.</p><p>She moved so he could sit on the narrow bench with her instead of balancing over her. Blake pulled Elise onto his lap, resting her head under his chin, and closed his eyes. In the quiet, pressed close to each other in their mutual need for solace, there was more honesty than Blake had experienced in all his other relationships. She's what I've been missing all my life, Blake realized, but not in remorse. It was in deep appreciation that he'd been allowed to meet her before it was too late.</p><p>\"I was engaged in the fifties.\" Elise's voice was barely audible over the rumblings of the train.</p><p>\"Edmond didn't know what I was. I'd told him I couldn't have children, but he said that didn't matter. I thought he'd accept the rest of me, too, if I could show him I truly loved him. Mencheres urged me to tell Edmond what I was, not to start our marriage with such a great deception between us. So, the night before our wedding, I showed Edmond my true nature.\"</p><p>She was trembling. Blake smoothed his hands down her back.</p><p>\"He was so horrified.\" It was a pain-filled whisper. \"He called me defiled, unclean, a hell-spawn. He wouldn't listen, no matter what I said. He ran off, but I thought with a little time, his fear would ease, and he would come back. He did come back, the very next morning. I woke up and Edmond was in the room with people I'd never seen before. They all had wooden stakes, one as long as a pole, and...\" Elise's voice broke. Blake's arms tightened around her.</p><p>\"Edmond had them hold me down. I didn't struggle, because I thought if Edmond saw I wasn't fighting them, he'd realize there was nothing to fear from me. I kept pleading with Edmond to stop, but...\" Elise's voice changed. Became flat and emotionless. \"Edmond shoved a stake through my heart. I stared into his eyes the whole time. He was furious when I didn't die - he kept stabbing more wood into my chest. I couldn't think through the pain, and at last I fought back. Edmond's neck snapped when he hit the wall. The others were injured, but they lived. They ran away, and I left my house to live below the train station in the tunnels. I've mostly avoided people ever since, because if I didn't care about anyone, then no one could hurt me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Elise waited for Blake's reaction. Only Mencheres knew this part of her life, but as a vampire and her sire, he was obviously biased when it came to his opinion of what she'd done. What would Blake think, knowing she'd killed her human fiance on their wedding day?</p><p>\"I can't believe he'd do that to you,\" Blake said. His hands never paused in their soothing path along her back. \"I understand why Edmond ran. Being afraid of what you don't know - yeah, I get that. But I will never understand why he tried to kill you when he came back. How could Edmond do that to you, no matter how shocked he was?\"</p><p>Something inside Elise burst. It must have been her last line of emotional defense, because the feelings running through her left her dizzy with their intensity. Who would have thought this virtual stranger's acceptance would be the grail of forgiveness she'd sought all these long, lonely decades? And why was it that she'd only found him now, just to have to lose him so cruelly in the next two days?</p><p>\"I lost someone I loved, too,\" Blake said. \"I married Gail right out of the army. We were both young, didn't have a clue how to make a marriage work. I got a job in commodities and worked my way up to being a pretty successful broker on Wall Street. Gail finished college and began teaching. She wanted to start a family; I wanted to wait so I could keep advancing in my career. I was so busy climbing the corporate ladder, I ignored what mattered to Gail. I don't blame her for divorcing me. Sometimes you have to lose everything to know what you had.\"</p> <p>Elise was familiar with that. She'd lost everything when she was human during the Great Depression, then again with Edmond, and now she had the feeling that when Blake died, she'd lose everything once more. Why couldn't there be another way to defeat the demon inside him, aside from killing him?</p><p>\"Elise.\" Blake drew away enough for her to look at him. \"Will you drink from me?\"</p><p>\"What?\" She couldn't have been more startled if the demon had suddenly appeared.</p><p>He sighed. \"I don't have much time, and that's all right. But I'd like to think something of me will last.</p><p>If my blood is inside you, then it'll live on for as long as you do...\" Fresh tears came to her eyes. How could she feel so much pain when just a few days ago, she'd been empty inside?</p> <p>\"...but only if you want to,\" Blake continued. \"I don't know if the demon in me makes it too disgusting to - \"</p><p>Elise sealed her mouth over his throat, the suddenness of her movement cutting his sentence off.</p><p>Blake's heart began to beat with an excited, increased pace that heightened her hunger. She let her tongue probe his neck, tasting his skin. Caressing his pulse. Deciding just where she'd penetrate with her fangs.</p><p>Blake's breathing accelerated, his chest rubbing hers with its rapid movement. His hands clenched on her back in the same rhythm that she flicked his neck with her tongue.</p><p>\"Is this, ahh, going to hurt?\" he asked, his voice catching when she pressed her fangs against his throat.</p><p>Elise smiled. \"You'll see.\"</p> <p>She let her fangs pierce him slowly, savoring the exquisite splitting of his skin and the hot, luscious blood that followed. Blake shuddered, a groan escaping him that she heard and felt against her mouth.</p><p>She waited, letting the euphoric venom from her fangs spread farther into his bloodstream, before drawing in a long, deep suction.</p><p>Blake's back arched and he gasped. Elise moaned at the slide of his blood down her throat, warming her. Igniting every preternatural sense in her. She took in another swallow, getting as much pleasure from the way Blake's hands gripped her as she did by the sweet taste of his blood. His breath came in gasps, the thundering of his pulse against her mouth mirrored by his heartbeat next to her breasts. The rich, spicy scent of him increased, wrapping around her. Intoxicating her. Urging her to take more.</p><p>\"God, yes,\" Blake moaned, his voice rising. Elise grabbed his head, arching his neck farther back, and bit into him again.</p><p>A hoarse cry came from him, like a lover might make. Even as Elise gave a last, longing swallow, savoring his blood, she drew her thumb across a fang and held the cut to the holes she'd made. They closed before the final sounds faded from Blake.</p><p>She leaned back to see his face. His eyes were closed, dark strands of hair tumbling over his forehead, and he had a sensual, lethargic - and surprised expression on his face.</p><p>His eyes opened in the next moment, coriander blue and beautiful. \"That didn't hurt at all,\" he said, a grin tugging at his mouth.</p><p>Elise laughed, bright and filled with the unexpected happiness inside her.</p> <p>The smell of sulfur woke her. Blake had fallen asleep in her arms, both of them reclining on the narrow pullout that masqueraded as a bed. Elise wasn't drowsy. She didn't want to miss a second of her remaining time with Blake.</p><p>When that awful, burning stench enveloped Blake, her arms hardened and rage filled her. She was prepared to keep the demon from harming Blake - or escaping - so she was taken aback when all the demon did was open his eyes.</p><p>\"You and I need to talk,\" Xaphan said in a low, gravelly voice.</p><p>Elise watched with loathing as Blake's skin turned that waxy, sallow color, and red replaced the lovely blue in his eyes.</p><p>\"I don't think so,\" Elise growled.</p><p>His lips curled back in a condescending sneer. \"Stupid little vampire, don't you see? I'm your only hope of saving this mortal.\"</p><p>Even though she knew better, hope sparked in her. \"How? You'll willingly leave him?\" That would mean the demon would get away, but then Blake would be free. God forgive her, she would be okay with that.</p><p>\"If I could do that, do you think I'd still be here, kept by two bloodsucking vermin? I'm too deeply buried inside this body to leave while he still has life, vampire. But I'll make a bargain with you.\" Don't listen. You can't bargain with evil. It will always win if you do.</p><p>\"What's your offer?\" Elise asked softly.</p><p>Those malevolent eyes glared into hers. \"I'll give you the rest of this mortal's natural life span if you get us away from the other vampire. When the mortal eventually dies, then I'll be free to find a better home.\"</p><p>\"Liar,\" Elise bit off. \"You'd try to kill Blake as soon as we got off this train.\" Xaphan sighed. The sulfur smell from his breath would have gagged Elise if she'd still been human.</p><p>\"The years this mortal has left are no more than a tick of the clock to me, but they mean something to you, don't they? This is a fair offer. If you refuse, try to force me onto the salt flats, all of you will die.</p><p>You can't hope to beat me; I am one of the first Fallen. I was around before Cain was even turned into a vampire.\"</p><p>Icy fear slid up Elise's spine as she stared into the demon's eyes. There was nothing left of Blake in them. They were ageless, evil, and swirling with red embers. It was as if she'd been afforded a glimpse into hell. How could she and Mencheres think to kill something as old, as powerful, as Xaphan? What if all of them did die on the salt flats, their bodies left to rot under the harsh sun, because she didn't take the only chance they had at surviving? Could she truly kill Blake anyway, after what he'd come to mean to her?</p><p>Elise thought of having Blake with her for forty, fifty, maybe even sixty years. That would be more happiness than she'd ever allowed herself to believe she'd find in all her undead lifetime. Xaphan might win anyway, if she persisted in taking Blake to the salt flats. Maybe if she took his deal now, in the future, they'd find another way to vanquish Xaphan without killing Blake or letting the demon possess someone else.</p><p>Really, wasn't this the only possible solution, even if it meant bargaining with a devil?</p><p>\"If you care at all for his life - or yours - you'll see this is the only choice...\" Xaphan drew out.</p><p>Blake's face flashed in her mind, looking completely different than it did now with the demon piloting him. I can't live like this, he'd said when they first met . Blake had proved countless times that he'd rather die than let the demon get away. In the end, this wasn't her decision. It was Blake's - and he'd already made it.</p><p>\"No deal,\" Elise said, hardening her resolve. \"If we all die sending you back to hell, then so be it.\" The demon howled, becoming a mass of livid movement and flinging both of them up to the ceiling of the cabin in a blur. Elise didn't let go, wrapping herself around him and letting their hate-filled gazes meet.</p><p>\"I'll kill you,\" Xaphan hissed.</p><p>Elise didn't blink. \"You will try.\"</p><p>All at once, the demon froze. Elise relaxed even though the new flood of oppressive power squeezed her. Mencheres came into the cabin.</p><p>\"You did the right thing, my child,\" he said to Elise.</p><p>She wasn't surprised that her sire had overheard the entire exchange. \"I had no choice.\" Mencheres came closer, forcing the demon back into the corner of the small room. \"Yes, you did. And you made the right one.\"</p><p>Elise wondered if she'd still think that later. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blake looked at the clock. Eight-thirty in the evening. He had less than twenty-four hours left to live.</p><p>Elise sat across from him, her tenseness palpable. Mencheres had forced her to leave this morning to get some sleep, but Elise had come back looking like she had spent the three hours in the other cabin wide-awake. Blake wanted to assure her once more that she'd done everything she could, but maybe talking about it would only make things worse.</p><p>Her blond hair was loose, falling just past her shoulders, and she wore another tank top with yoga-style pants. Blake had been studying her while she looked out the window, trying to memorize her features.</p><p>Small, straight nose. The mouth that looked more sensual than pouty. Those high cheekbones and smooth forehead. Her beautiful, mesmerizing, blue-green eyes.</p> <p>Yes, if there was an afterlife, Blake wanted to bring the memory of Elise with him.</p><p>\"Chess?\" he asked, gesturing to the board.</p><p>She glanced away from the window. \"I don't know how to play.\"</p><p>\"Hmm. You don't know how to drive or to play chess.</p><p>What have you been doing with all your time?\"</p> <p>His tone was teasing, but her face clouded. \"I listen to music,\" she said slowly. \"Read a lot of books.</p><p>When I get restless, I walk through the city. It's been sufficient.\" It didn't sound sufficient. It sounded lonely. Elise had said she'd been living like that since the fifties, but what had she been like before then? Blake knew she was much older than he, even though she looked to be in her early twenties. How much older? he wondered.</p><p>\"How old are you?\"</p><p>She appeared to think about it for a second. \"Altogether, including the years before I became a vampire?\"</p><p>Blake nodded.</p><p>\"Ninety-nine in September,\" Elise said.</p> <p>That number was so at odds with her lovely, youthful appearance, Blake had to smile. \"You don't look a day over ninety-two,\" he said with wry humor.</p><p>Elise shrugged. \"Some days, I feel even older.\"</p><p>Today was one of those days, if the stress on her face was any indicator. Blake sought to lighten her mood. There was no need for either of them to bemoan what was coming.</p><p>\"How about I teach you to play chess? It's not hard. By the time the train arrives in Salt Lake tomorrow morning, you'll be a pro.\"</p><p>\"I don't want to learn to play chess,\" Elise snapped, then she grabbed the edge of the built-in metal board and ripped it out of the cabin wall.</p><p>Blake stared at her. \"Don't do this.\"</p><p>Suddenly she was in front of him, kneeling in the empty space where the pull-down table had been.</p><p>\"You don't have to die.\" Her voice was ragged. \"I can take you with me and keep you safe. Keep the demon from hurting anyone else...\"</p> <p>Blake took her beautiful face in his hands. \"You can't watch over me every second of every day, and I won't let that thing get away to ruin more people's lives. Aside from you, the only thing that's made me happy these past few days is knowing that I've finally scared it for a change. That demon is going to regret what it did to me, because I'm the man who's going to bring it down. Don't try to take that away from me, Elise.\"</p><p>Her eyes were bright, pink tingeing the corners. Blake couldn't stop himself from what he did next. He kissed her, needing her taste like he was the vampire, and she was fresh blood. To his relief, her mouth opened at once, her tongue raking his while fangs sprang out of her upper teeth.</p><p>Blake didn't care about her fangs, even when those sharp tips scored his tongue. Elise sucked at the blood while kissing him, her raw need matching his and driving his passion to a fiery level. He pulled her up on his lap, groaning when she wrapped her legs around his waist.</p><p>His hands went under her tank top, tugging it up in impatience. Then he blinked when it was wadded on the floor with her bra in the next moment. Blake didn't bother to contemplate how fast Elise had taken it off, however. He cupped her breasts, tearing his mouth from hers to kiss them. Her flesh was soft and sleek, her nipples so hard by comparison. When he sucked and bit them gently, Elise moaned, ripping at his pants.</p><p>They split open, torn to the knee. Blake pulled them off, kicking the remains free. Her pants were gone in another blur, as was his shirt, until there was nothing separating her skin from his.</p><p>He grabbed her hips and arched forward, his mind exploding at the squeeze of her flesh as he thrust into her. Oh God, oh yes! He kissed her again, bracing his legs against the chair across from him, moving deep and fast within her. Elise rocked with him, gripping him so tightly it almost hurt - but he never wanted to end.</p><p>He held her, moving faster, knowing this would be the closest he ever came to heaven.</p><p>The whistle at the station sounded like a death knell to Elise. She gripped Blake's hand. If it were possible for vampires to throw up, she would have gotten sick as the train ground to a halt.</p><p>\"Salt Lake City,\" the attendant cheerfully called out.</p><p>Blake squeezed her hand. \"It's okay,\" he said, and squared his shoulders.</p><p>I won't cry, Elise promised herself. If he can be this brave, so can I.</p><p>She didn't feel brave, though. She felt like silver was spearing her through the heart. How she'd ever get through the day, she had no idea.</p><p>Last night, she'd cast about for any other option than Blake's death. Turning Blake into a vampire wouldn't work, Mencheres reminded her when she brought that up. Changing Blake into a vampire required that he be drained of blood until he was almost dead. Then, still clinging to life, Blake would drink Elise's blood, which would trigger his undeath. Since natural death didn't happen, becoming a vampire wouldn't force the demon out. No, it would mean Xaphan would have a back door into possessing a vampire instead. With Blake as a possessed vampire, who knew what new horrors Xaphan could wreak? They'd be handing the demon more power than he'd ever dreamed.</p><p>I won't let the demon free, he'd stated flatly. Mencheres had agreed that only human death, without any vampire blood in Blake, could force Xaphan out into the merciless trap of the salt flats.</p><p>But without any vampire blood in Blake, his death was irreversible.</p><p>They exited the train. Elise kept hold of Blake's hand because she couldn't stand not to touch him, but Mencheres's hand on Blake's shoulder was for a different reason - to restrain him in case the demon tried to make a run for it again. Xaphan had taken over Blake last night, going ballistic and trashing the interior of the cabin before Mencheres stilled him. Elise had to green-eye the train workers so they didn't call the police at the disturbance. You'll all die tomorrow, Xaphan had spat before crawling back into whatever hole he'd burrowed inside Blake. No, they hadn't heard the last from Xaphan.</p><p>Elise didn't know what the demon had in store for them, but she knew he wouldn't go gently into that good night. Still, Xaphan wasn't scaring her with his threats. He was just solidifying her resolve to do anything to make sure Blake had his victory over the demon. If Blake was willing to die for that, so was she.</p><p>Mencheres had two vehicles waiting for them in the parking garage. One was a regular four-door sedan, but the other was a large van. Elise's heart clenched at the thought of loading Blake's body into the van afterward. At least he wouldn't be stuffed into a trunk. That indignity she couldn't stand.</p><p>\"Wait a few days until you mail my letters,\" Blake said to her quietly. He'd written to his family, apologizing for what they thought he'd done and telling them he loved them.</p><p>\"All right.\"</p><p>She didn't tell Blake that she had no intention of mailing those letters. She'd deliver them in person and make sure, with all her inhuman power, that they didn't think less of the amazing man walking next to her.</p><p>Mencheres stopped by the van. \"I'll drive this one,\" he stated. \"You and Blake follow me in the car.\" Elise didn't move. No, no, was running through her mind in a roar. Blake leaned down and, very gently, kissed her cheek. \"Don't come apart on me now,\" he breathed.</p><p>She nodded and forced her legs to move, one step after the other. Somehow, she made it into the car, Blake in the driver's seat next to her. Mencheres started up the van, and Blake followed him out of the parking lot into the bright morning sunshine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blake glanced at the landscape zoom by along Interstate 80. This was the first he'd been to Utah. In fact, it was the first time he'd been out West. He'd stayed mostly on the East Coast during his thirty-seven years. Born in Massachusetts, enlisted in the army after high school, graduated from Penn State, married in New Jersey, divorced in New York City, possessed in New York City, met a vampire in DC, died in Utah, Blake reflected. There was so much he'd wanted to do with his life, but somehow, he'd let most of that be swallowed up under promises of \"later.\" Now that there was no more \"later,\" Blake couldn't help the sadness washing over him. He wished he'd spent more time with his family. Gotten to know his friends better. Let go of jealousies and resentments a lot quicker. All that time, so much of it wasted, Blake thought. What I wouldn't give to live it all over again, especially with Elise by me.</p><p>Even as the regret filled him, Blake pushed it back. He'd chosen his life, such as it was, and he'd been allowed to meet the most amazing person before the end of it. Plus, what he was doing now was the equivalent of jumping on a grenade to save dozens of people, if not more. Blake harnessed the same mentality that had seen him through a two-year stint in Iraq during the First Gulf War. Complete your mission. Don't fail your unit. Right now , Elise was his unit. He'd make her proud of him.</p><p>\"I don't want you going back to your home in the tunnels,\" Blake said.</p><p>She looked at him, her eyes wide. \"What?\"</p> <p>\"I don't want you going back to your home in the tunnels,\" he repeated, emphasizing each word. \"I don't want you spending the next fifty years like the last fifty. I know this is going to be hard on you, but don't let it push you back to how you were, avoiding everyone so you don't have to care for anyone. I can stand dying, Elise, but I can't stand the thought of that.\" Her jaw flexed, and she blinked a few times, but she didn't reply.</p><p>\"Promise me,\" Blake said, hardening his voice.</p><p>\"I promise.\"</p><p>Her words were choked. Blake looked back at the road, something tight inside him easing. Elise would go on. She'd live long enough for both of them, and one day, some lucky bastard would come along and make her happy.</p><p>And whoever he was, Blake hated him. Guess he wasn't finished being jealous after all.</p> <p>Blake started to whistle to distract himself from that line of thought. Oddly enough, he found himself whistling that same tune Elise had earlier in the week, \"Beautiful Dreamer.\" After a few minutes, some of the stiffness left her frame.</p><p>\"I love that song,\" she murmured. \"It was my favorite as a child.\"</p><p>\"It's been around that long?\" Blake asked, teasing.</p><p>She gave him a melancholy look. \"Longer. My mother used to sing it to me before I'd fall asleep.</p><p>Funny, I can't remember her face, but I remember her voice.\" Blake swallowed hard. In time, she'd forget his face, too.</p><p>\"How did you become a vampire?\"</p> <p>Elise fixed her gaze on Mencheres's van in front of them. \"I was twenty-one when the Great Depression began. My husband, Richard, lost his job that first year, along with so many other people.</p><p>After several months, we lost our house, too. My parents were dead, but his mother was alive, so we stayed with her for a while. I gave birth to my daughter, Evangeline, during that time. Two months after she was born, Richard's mother died. She'd been behind on her house payments, so the bank took it, and there was no life insurance, so we were turned out into the street. Some friends of Richard's lived in Hoovervilles in Central Park, so that's where we went.\"</p><p>\"What's a Hooverville?\" Blake asked.</p><p>\"It's what everyone called the tent villages, after that bastard, President Hoover. Richard scraped together enough cardboard, wood, and trash-can scraps to make a shelter. Every day, he looked for work, but there wasn't any. Winter came, and my baby got sick. I took her to the hospital, but they sent us home. She died three days later. Two weeks after that, Richard jumped off the Brooklyn Bridge.\"</p><p>\"Oh, God, I'm sorry,\" Blake said, imagining Elise as the young, grief-stricken woman she must have been.</p><p>She swiped at her eyes. \"I try never to think about that time.\" Her voice was amazingly steady. \"It hurts too much. It hurt too much then as well, which was why shortly after Richard's death, I jumped off the Brooklyn Bridge, too.\"</p><p>Blake gasped. \"What?\"</p><p>Elise nodded, a faraway look on her face. \"I don't remember hitting the water. I just remember the cold.</p> <p>There had been chunks of ice in the East River that day. I should have died; most people who jump off that bridge do, but Mencheres found me floating in the water and saved me...\" Her voice trailed off - and then she screamed, \"Stop!\"</p><p>Blake slammed on the brakes so hard, his head almost hit the steering wheel. He looked around, but there was nothing in the road or any other reason he could see for her reaction.</p><p>\"Jesus,\" he exclaimed. \"Don't do that again. If I hadn't been wearing a seat belt, I'd have gone straight through the windshield and made Xaphan's day!\"</p><p>Elise swung to look at him, her eyes blazing green and an expression he couldn't name on her face.</p><p>\"The river,\" she muttered. \"The ice. Of course. \" Blake felt like she was speaking an unfamiliar language. \"What are you talking about, Elise?\" In reply she kissed him. Then she shot out of the car, turning the ignition off and taking the keys with her.</p><p>Elise stood next to Mencheres. The two of them were outside by the car, close enough that they could quickly reach Blake if Xaphan took him over but far enough away that Blake couldn't hear what she was saying.</p><p>\"You told me when you first found me in the river, I didn't have a heartbeat,\" Elise said in a rush. \"For all intents and purposes, I was dead, but the river was so cold that day, it gave me hypothermia. My body slowed down to clinical death, but when you pulled me out of the river, you warmed me, gave me your blood, and brought me back. If we induce severe hypothermia with Blake, his heart will stop, as will his breathing. He'll be dead enough to force Xaphan out onto the salt flats. Then, once the demon is gone, we'll bring Blake back. It's a long shot, but it could work.\" Elise desperately wanted Mencheres to agree. But he'd had so much more experience with demons than she did; maybe there was something she was overlooking. What if it took too long from when Xaphan was expelled from Blake's body until his essence was destroyed? How many minutes could Blake be dead before there was no pulling him back from it?</p><p>\"Come with me,\" Mencheres said.</p><p>He led her around to the side of the van. Elise's heart sank. Was Mencheres taking her out of Blake's eyesight to tell her that this couldn't be done? Did he want to give her privacy while she broke into tears when he delivered that hammer of a verdict?</p><p>Mencheres opened the back of the van. Inside it was an oblong container several feet long, with various medical devices she didn't recognize stacked around it. But the generators and portable defibrillator she knew at a glance, and there was only one reason they'd be there.</p><p>\"You knew,\" she whispered. \"You knew all long that there was a chance Blake could be saved this way.</p><p>Why didn't you tell me?\"</p><p>\"Because you had to believe you would lose him in order to realize what he meant to you,\" Mencheres replied. \"It's been so long since you cared for anyone. I wanted that for you again.\" Elise looked once more at the items in the van. There were no guarantees that this would work, and she had a lot to learn in a short amount of time, but there was hope. At last, there was hope.</p><p>\"All right,\" Elise said. \"Let's get started.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The Bonneville Salt Flats looked like a white, desolate ocean. They stretched for miles in a peninsula that was bordered on the west by the mountains and on the south by the interstate. Mencheres drove by the sign at the end of the access road that told visitors to park and venture on foot into the tourist section. Blake knew why they weren't stopping at the tourist section; they were heading for the middle of the flats, where two and a half miles was the closest distance between him and the end of the salt barrier.</p><p>It was blazing hot outside, but in this case, that was a bonus. In the spring, Mencheres said, the salt would be turned to mush in places, making driving on it impossible - and they needed the van with its cache of equipment. But in the middle of the summer, the salt was hard, like crystallized gravel, allowing the van to ride easily over its flat, sparkling surface.</p><p>Blake sat between them in the front. There were too many instruments in the back that could be used to kill him, if and when Xaphan appeared. Blake had no doubt the demon would come forth at any second. In fact, he wondered what Xaphan was waiting for.</p><p>At last, Mencheres stopped. Blake glanced around. There was nothing to see except miles of white and the mountains to their left. Steeling himself, Blake took in a deep breath.</p> <p>\"Okay. I'm ready.\"</p><p>Despite Elise's optimism about being able to bring him back, Blake didn't think it would work.</p><p>Chances were, when he died, he'd stay dead. Successful resuscitation happened in less than half the cases, he knew that from his army days when they taught him field triage. Still, he didn't share his doubts with Elise. Let her think he died believing he'd be saved. Why make this harder on her?</p><p>Blake went into the back of the van. There wasn't much room with all the equipment around.</p><p>Mencheres opened the doors and set up the generators outside. No need to ruin even his slim chance with carbon-monoxide poisoning.</p> <p>Elise gestured to the large rectangular piece in the van, which looked to Blake like an elaborate, water-filled coffin.</p><p>\"It'll be easier if you take your clothes off...most of them, at least.\" She looked almost shy saying that, as if he'd take her suggestion as perverted voyeurism. Blake's heart squeezed. I'll miss you forever, he thought, staring into Elise's beautiful blue-green eyes.</p><p>He stripped to his boxers, then took her in his arms. She hugged him back tightly, her whole body shuddering like something inside her was trying to break out.</p><p>\"I know this makes no sense, since we've only known each other less than a week, but Blake...if I could spend the rest of my life with just one person, it would be you,\" she whispered.</p><p>Blake pulled away. Looked at her face and saw the naked vulnerability, emotion, and need there. He smiled, brushing back a strand of her blond hair.</p><p>\"No, Elise. We've known each other forever, because that's how long I'll love you.\" Then he kissed her, trying to imprint the feel of her on his mouth, hands, and body before death came to take him away.</p> <p>Elise knelt next to the hydro chamber. Blake had been immersed in the glacial water for over fifty minutes. His initial, massive shivering had slowed, as had his pulse and breathing. Confusion was starting to set in even as his eyes kept fluttering closed.</p><p>\"Where am I?\" he mumbled to Elise. \"Too warm. Need to get out.\"</p><p>\"He's entering the last stages of hypothermia,\" Mencheres said in a low voice. \"His body is past feeling cold and is suffused with a false sense of heat instead. It won't be long now.\" Elise touched his forehead, but Blake didn't seem to feel it. His face and neck were open to the air, but the rest of him was submerged in the freezing water. All the better to bring about hypothermic cardiac arrest.</p><p>If she could have traded places with Blake, she'd have done it a million times over. The past forty minutes had been hell, watching him suffer in the container. Her only comfort was knowing that Xaphan would suffer, too. He'd taken Blake over as soon as Blake lay down in the chamber. Xaphan had thrashed around, trying to break everything he could touch. Mencheres restrained him with his power, holding Blake's body immobile even though the demon writhed and fought inside him. Xaphan had been gone for the past thirty minutes. Elise figured the demon was resting up for one last stand.</p><p>Blake's heart skipped several beats. Elise tensed, meeting Mencheres's eyes. Soon. Very soon.</p><p>Panic made Elise want to snatch Blake out of the water and start to warm him up now. What if this didn't work? What if this was the last time she'd ever see Blake? Dear God, how could she stand her heart being demolished yet again?</p><p>Blake said something she couldn't understand. Elise bent closer until his mouth was almost next to her ear.</p><p>\"What is it, darling?\"</p> <p>\"Elise.\" Her name was garbled and breathy, like Blake had barely the strength to form it. \"Sing me to sleep.\"</p><p>Blake's eyes were closed, so Elise didn't have to worry about him seeing her tears. She started to sing, dipping her hand into the freezing water so she could hold his.</p><p>Blake's breathing became shallower, the intervals between his breaths extending longer and longer. His pulse was erratic, too, at times speeding up in bursts, then growing more and more sluggish. By the time Elise reached the last line of the song, Blake's heart had stopped completely.</p><p>She stared at him, feeling more frozen inside than the icy water that brought about his death. Blake's eyes were dilated, no spark of life in them. Just glassy, like a doll's eyes.</p><p>Elise thought she'd been prepared to see him this way. That she was strong enough to handle it, but something inside her shattered. She ripped off the cover of the chamber and grabbed Blake up in the next instant.</p><p>Mencheres's hands shot out, stopping her. Keeping her from lifting Blake all the way out of that awful, killing water.</p><p>\"Wait,\" he said.</p><p>\"No,\" Elise snarled. \"I have to bring him back!\"</p><p>Mencheres didn't loosen his grip, and she felt his hold on more than just her arms.</p><p>\"Not. Yet.\"</p><p>Elise would have fought him, her own sire, whom she trusted more than anyone in the world. But a blast of power in the air around them stopped her. Sulfur fumes seemed to crawl up her nose, and a howl of rage filled the van until it shook.</p><p>\"You fool,\" Xaphan hissed.</p><p>The words didn't come from Blake's mouth. They came from behind her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Elise didn't have time to turn around before the doors blew off the van, and Mencheres was sucked out into the sunshine. She dropped Blake, careful to make sure his head was hanging outside the chamber, and ran out of the van.</p><p>\"Mencheres!\" she screamed.</p><p>Nothing was around but miles of empty, ominous white salt. Where was Mencheres? Her sire was the most powerful vampire she'd ever met, how could he simply disappear?</p><p>Something slammed into her from behind. Elise fell, getting a face full of salt. Then she was propelled up and flung into the side of the van, hard enough to make it tilt on its tires.</p> <p>\"Bring him back,\" Xaphan growled near her ear.</p><p>Elise whirled, but there was no one there. Another blow knocked her into the van again. Then another and another, all made by someone she couldn't even see.</p><p>Elise tasted blood where her lip had split. The bright afternoon sunlight, naked of any cloud cover, felt like needles on her skin. Something seized Elise's hair, grinding her face into a ragged piece of metal from the dent her body had made.</p><p>\"Bring him back, \" Xaphan said again, and she was shoved into the van.</p><p>Blake was still slumped over the chamber, motionless. Elise pulled him all the way out of the water, laying him on the van's floor. He was as white as the salt outside, all the color gone from his skin, and his skin was cool enough to feel like he'd been carved out of ice.</p> <p>The van gave a violent rock that had equipment sliding into the corner.</p><p>\"Stop it!\" Elise snapped. \"If you break everything in here, I can't save him.\"</p><p>\"Do it now,\" that horrible, disembodied voice ordered.</p><p>Her hands trembled as she set the breather over Blake's mouth, turning on the machine that would pump warmed, humid air into Blake's lungs. We must reheat his core slowly, Mencheres had said. Too much artificial warmth to his extremities will make lethal gases fill Blake's bloodstream.</p><p>Therefore, Elise didn't use the hot packs with Blake yet. She covered him with blankets and set up the IV to fill an artery with heated blood. Another IV was inserted for a warmed saline solution. Then Elise began CPR, forcing Blake's stationary heart to pump.</p><p>An invisible hand slapped her across the mouth. \"Faster,\" Xaphan said.</p> <p>The demon's voice seemed to rise and fade at the same time. Elise took out a syringe with an elongated needle, punching that needle through Blake's breastbone to inject epinephrine directly into his heart.</p><p>Then she began compressions to his chest again.</p><p>\"Bring him back now, \" Xaphan roared. The van lifted off the ground a foot and smashed back down, shattering the windows.</p><p>Elise paused to take a long, poignant look at Blake's face. That demon is going to regret what it did to me, he'd told her. Don't try to take that away from me, Elise.</p><p>That was what she was doing right now, taking away his choice because it hurt her too much to honor it. Searing pain tore through Elise's heart. I can't do it. I love you too much to betray you like that.</p><p>She kissed Blake's cold lips, then sat back. \"It's over,\" she told the demon.</p><p>A viselike grip settled around her throat, lifting her until her head banged on the ceiling.</p><p>\"You will obey me,\" Xaphan said. Waves of sulfur curled around her, the odor so thick, it felt like it was slithering inside her.</p> <p>Elise could barely talk with the pressure on her throat, but she managed to force out her reply.</p><p>\"Go...to...hell.\"</p><p>The van shook, metal curling back from the frame, before it was lifted and slammed repeatedly to the ground. Elise used all of her strength to tear away from the force that held her. She crawled toward Blake, covering him with her body when she reached him. Shielding him from metal shards that sliced through the air, ripping into her flesh and gouging the equipment around them. For a few nightmarish minutes, it felt like the entire world was being shaken and ripped apart.</p><p>A piercing shriek scalded her ears, causing Elise to lift her head and look in its direction. In the open doorway of the ruined van, a cloud of black flame appeared. It stretched into the form of a man with long, smoke-tipped wings coming from his back.</p><p>\"Die,\" the demon hissed. That cloud of burning sulfur shot straight toward Elise and Blake.</p><p>Elise braced herself but didn't try to escape. She wouldn't leave Blake, even if it meant her death.</p><p>Mencheres suddenly appeared in front of her, his power crackling the air around him. The flames reached him - and stopped, dissolving into smoke mere inches from his body.</p><p>\"You're not strong enough anymore, Xaphan,\" Mencheres stated. \"Your time is up.\" Xaphan screamed, but even as that awful noise reverberated, the smoke from the tips of his wings spread. It engulfed his legs, dissolving them out from under him. Then his arms, his torso, and finally, his sneering face, until there was nothing left of Xaphan but the faint scent of sulfur in the wind.</p><p>Elise closed her eyes for a second. The demon was gone. He couldn't hurt Blake - or another innocent person - anymore.</p><p>Then her eyes snapped open. \"Help me,\" she said to Mencheres, scrambling to get the equipment set up again.</p><p>Mencheres moved quickly, gathering up the pieces of equipment that had been scattered around the van, but the outcome was soon obvious. Everything had been damaged. The generators weren't working, which meant no heated oxygen, blood, or saline, and most of the IV lines had been shredded.</p><p>Elise looked at the wreckage of their medical supplies with numbing panic. They'd never get Blake to a hospital in time, even if Mencheres flew him there, and they needed these things to bring him back to life.</p><p>Elise made her decision in the next moment, a steely determination filling her. I won't let you die. I won't.</p><p>She grabbed the nearest unbroken syringe she could find and rammed it into her throat, drawing out her blood. Then she plunged that same needle into Blake, injecting her blood into his artery.</p><p>\"Begin compressions,\" she directed Mencheres, blowing into Blake's mouth.</p><p>Mencheres gave her a look she couldn't read, but she didn't care, whatever it meant. She kept blowing air into Blake's lungs, pausing only to draw more blood from her to inject it into Blake. After five minutes, she had Mencheres stop, but Blake's heart was still silent.</p><p>\"Let's warm him up more,\" she said, and gathered everything that still held heat and piled it around Blake. All remaining warmed blood and saline bags were pressed to his armpits and groin, plus more blankets were piled on top of him. Elise even hauled the broken generators over to place Blake's body on top of them, since they were still warmed from their recent activity.</p><p>\"Again, more compressions,\" she said, and injected another syringe of her blood into Blake.</p><p>Mencheres complied, manipulating Blake's heart while she continued to blow air into his mouth. After another several minutes, Blake felt warmer. Elise's hopes leapt when his heart made a few faint, erratic beats, but then it fell silent again.</p><p>\"Come on,\" Elise shouted in fear and frustration. \"You're not ready to die yet!\"</p><p>\"Elise...\" Mencheres said.</p><p>\"No,\" she cut him off. \"I'm not giving up on him.\"</p><p>She looked at Blake - silent, pale, beautiful - and did the only thing she could think of. She bit into his neck, right at the jugular.</p><p>\"Begin compressions,\" she said to Mencheres. Her tone dared him to argue.</p><p>Mencheres pressed on Blake's chest in those measured, controlled pumps. Elise sucked, drawing Blake's blood into her with the help of Mencheres's actions. She drank deeply, chilled by the temperature of Blake's blood but not stopping until what she'd taken from him would have been lethal if he wasn't clinically dead.</p><p>\"Now,\" Elise said. \"We're going to transfuse my blood to Blake. All of it.\" Mencheres found a catheter that wasn't broken and set up the line in Elise's throat, positioning the other end of the IV in Blake's jugular. Once it was set, Elise closed her eyes, willing her blood out of her body and into that narrow plastic tube.</p><p>It took ten minutes for Elise to drain herself into Blake. When she was done, she felt light-headed, as if she hadn't fed in weeks. She found the portable defibrillator under the remains of the car seat and charged the electrodes, pausing only to send up a silent plea. Please. Don't take him from me.</p><p>Then she sent the volts into Blake's chest. His heart fluttered again for an extra few beats after the shock, but then stilled once more. Elise charged the defibrillator and hit him with another set of volts.</p><p>Blake's heart responded, beating on its own for a full minute, then it quieted again.</p><p>Mencheres touched her arm very lightly. \"You've done all you can. Even if this worked, Blake's heart won't restart enough for him to live as a human again. He will either rise as a vampire, or he will stay dead.\"</p><p>Elise put her arms around Blake. \"So now we wait?\"</p><p>Her sire nodded. \"Yes. We wait.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>Elise looked around at her home under the defunct train station in the District. In a lot of ways, she would miss this place. But a promise was a promise.</p><p>She hefted her books into a double-plied leaf and lawn bag, thinking she'd leave the bed and chair for another lost soul to make use of. Maybe her former home would provide the same kind of refuge to someone else that she'd needed these last few decades. The thought pleased her.</p><p>An arm slid around her waist, the muscled flesh the same temperature as her own. \"Ready to go?\" Elise smiled and turned into Blake's embrace. He was faintly flushed from a recent breakfast of plasma, but the new silky luminescence to his skin looked very different than when he'd been human.</p><p>\"I'm ready now.\"</p> <p>Elise was ready for a lot of things, the first of which was living with the man she loved. And maybe next was learning how to drive. Or how to play chess.</p><p>Now that she had Blake, the possibilities were suddenly endless - and wonderful. </p>  </body></html>"]