["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER ONE</p><p>FROM HIGH IN THE HEAVENS, Lysander spotted his prey. At last. Finally, I will end this. His jaw clenched and his skin pulled tight. With tension. With relief. Determined, he jumped from the cloud he stood upon, falling quickly...wind whipping through his hair...</p><p>When he neared ground, he allowed his wings, long and feathered and golden, to unfold from his back and catch in the current, slowing his progress.He was a soldier for the One True Deity. One of the Elite Seven, created before time itself. With as many millennia as he’d lived, he’d come to learn that each of the Elite Seven had one temptation. One potential downfall. Like Eve with her apple. When they found this...thing, this abomination, they happily destroyed it before it could destroy them.</p><p>Lysander had finally found his.</p> <p>Bianka Skyhawk.</p><p>She was the daughter of a Harpy and a phoenix shape-shifter. She was a thief, a liar and a killer who found joy in the vilest of tasks. Worse, the blood of Lucifer—his greatest enemy and the sire of most demon hordes—flowed through her veins. Which meant Bianka was his enemy.</p><p>He lived to destroy his enemies.</p><p>However, he could only act against them when they broke a heavenly law. For demons, that involved escaping their fiery prison to walk the earth. For Bianka, who had never been condemned to hell, that would have to involve something else. What, he didn’t know. All he knew was that he’d never experienced what mortals referred to as “desire.”</p><p>Until Bianka.</p> <p>And he didn’t like it.</p><p>He’d seen her for the first time several weeks ago, long black hair flowing down her back, amber eyes bright and lips bloodred. Watching her, unable to turn away, a single question had drifted through his mind: Was her pearl-like skin as soft as it appeared?</p><p>Forget desire. He’d never wondered such a thing about anyone before. He’d never cared. But the question was becoming an obsession, discovering the truth a need. And it had to end. Now. This day.</p><p>He landed just in front of her, but she couldn’t see him. No one could. He existed on another plane, invisible to mortal and immortal alike. He could scream, and she would not hear him. He could walk through her, and she would not feel him. For that matter, she would not smell or sense him in any way.</p><p>Until it was too late.</p><p>He could have formed a fiery sword from air and cleaved her head from her body, but didn’t. As he’d already realized and accepted, he could not kill her. Yet. But he could not allow her to roam unfettered, tempting him, a plague to his good sense, either. Which meant he would have to settle for imprisoning her in his home in the sky.</p> <p>That didn’t have to be a terrible ordeal for him, however. He could use their time together to show her the right way to live. And the right way was, of course, his way. What’s more, if she did not conform, if she did finally commit that unpardonable sin, he would be there, at last able to rid himself of her influence.</p><p>Do it. Take her.</p><p>He reached out. But just before he could wrap his arms around her and fly her away, he realized she was no longer alone. He scowled, his arms falling to his sides. He did not want a witness to his deeds.</p><p>“Best day ever,” Bianka shouted skyward, splaying her arms and twirling. Two champagne bottles were clutched in her hands and those bottles flew from her grip, slamming into the ice-mountains of Alaska surrounding her. She stopped, swayed, laughed. “Oopsie.”</p><p>His scowl deepened. A perfect opportunity lost, he realized. Clearly, she was intoxicated. She wouldn’t have fought him. Would have assumed he was a hallucination or that they were playing a game. Having watched her these past few weeks, he knew how much she liked to play games.</p><p>“Waster,” her sister, the intruder, grumbled. Though they were twins, Bianka and Kaia looked nothing alike. Kaia had red hair and gray eyes flecked with gold. She was shorter than Bianka, her beauty more delicate. “I had to stalk a collector for days—days!—to steal that. Seriously. You just busted Dom Pérignon White Gold Jeroboam.”</p><p>“I’ll make it up to you.” Mist wafted from Bianka’s mouth. “They sell Boone’s Farm in town.”</p><p>There was a pause, a sigh. “That’s only acceptable if you also steal me some cheese tots. I used to highjack them from Sabin every day, and now that we’ve left Budapest, I’m in withdrawal.”</p> <p>Lysander tried to pay attention to the conversation, he really did. But being this close to Bianka was, as always, ruining his concentration. Only her skin was similar to her sister’s, reflecting all the colors of a newly sprung rainbow. So why didn’t he wonder if Kaia’s skin was as soft as it appeared?</p><p>Because she is not your temptation. You know this.</p><p>There, atop a peak of Devil’s Thumb, he watched as Bianka plopped to her bottom. Frigid mist continued to waft around her, making her look as if she were part of a dream. Or an angel’s nightmare.</p><p>“But you know,” Kaia added, “stealing Boone’s Farm in town doesn’t help me now. I’m only partially buzzed and was hoping to be totally and completely smashed by the time the sun set.”</p><p>“You should be thanking me, then. You got smashed last night. And the night before. And the night before that.”</p><p>Kaia shrugged. “So?”</p><p>“So, your life is in a rut. You steal liquor, climb a mountain while drinking and dive off when drunk.”</p><p>“Well, then yours is in a rut, too, since you’ve been with me each of those nights.” The redhead frowned. “Still. Maybe you’re right. Maybe we need a change.” She gazed around the majestic summit. “So what new and exciting thing do you want to do now?”</p><p>“Complain. Can you believe Gwennie is getting married?” Bianka asked. “And to Sabin, keeper of the demon of Doubt, of all people. Or demons. Whatever.”</p><p>Gwennie. Gwendolyn. Their youngest sister.</p><p>“I know. It’s weird.” A still-frowning Kaia eased down beside her. “Would you rather be a bridesmaid or be hit by a bus?”</p><p>“The bus. No question. That, I’d recover from.”</p><p>“Agreed.”</p><p>Bianka did not like weddings? Odd. Most females craved them. Still. No need for the bus, Lysander wanted to tell her. You will not be attending your sister’s wedding.</p><p>“So which of us will be her maid of honor, do you think?” Kaia asked.</p><p>“Not it,” Bianka said, just as Kaia opened her mouth to say the same.</p><p>“Damn it!”</p><p>Bianka laughed with genuine amusement. “Your duties shouldn’t be too bad. Gwennie’s the nicest of the Skyhawks, after all.”</p><p>“Nice when she’s not protecting Sabin, that is.” Kaia shuddered. “I swear, threaten the man with a little bodily harm, and she’s ready to claw your eyes out.”</p><p>“Think we’ll ever fall in love like that?” As curious as Bianka sounded, there was also a hint of sadness in her voice.</p><p>Why sadness? Did she want to fall in love? Or was she thinking of a particular man she yearned for? Lysander had not yet seen her interact with a male she desired.</p><p>Kaia waved a deceptively delicate hand through the air. “We’ve been alive for centuries without falling. Clearly, it’s just not meant to be. But I, for one, am glad about that. Men become a liability when you try and make them permanent.”</p><p>“Yeah,” was the reply. “But a fun liability.”</p><p>“True. And I haven’t had fun in a long time,” Kaia said with a pout.</p><p>“Me, either. Except with myself, but I don’t suppose that counts.”</p><p>“It does the way I do it.”</p><p>They shared another laugh.</p><p>Fun. Sex, Lysander realized, now having no trouble keeping up with their conversation. They were discussing sex. Something he’d never tried. Not even with himself. He’d never wanted to try, either. Still didn’t. Not even with Bianka and her amazing (soft?) skin.</p><p>As long as he’d been alive—a span of time far greater than their few hundred years—he’d seen many humans caught up in the act. It looked...messy. As un-fun as something could be. Yet humans betrayed their friends and family to do it. They even willingly, happily gave up hard-earned money in exchange for it. When not taking part themselves, they became obsessed with it, watching others do it on a television or computer screen.</p><p>“We should have nailed one of the Lords when we were in Buda,” Kaia said thoughtfully. “Paris is hawt.”</p><p>She could only be referring to the Lords of the Underworld. Immortal warriors possessed by the demons once locked inside Pandora’s box. As Lysander had observed them throughout the centuries, ensuring they obeyed heavenly laws—since their demons had escaped hell before those laws were enacted, no one having thought escape possible, they had not been killed but thrust into that box first, and the Lords second—he knew that Paris was host to Promiscuity, forced to bed a new person every day or weaken and die.</p><p>“Paris is hot, yes, but I liked Amun.” Bianka stretched to her back, mist again whipping around her. “He doesn’t speak, which makes him the perfect man in my opinion.”</p><p>Amun, the host of the demon of Secrets. So. Bianka liked him, did she? Lysander pictured the warrior. Tall, though Lysander was taller. Muscled, though Lysander was more so. Dark where Lysander was light. He was actually relieved to know the Harpy preferred a different type of male than himself.</p><p>That wouldn’t change her fate, but it did lessen Lysander’s burden. He hadn’t been sure what he would have done if she’d asked him to touch her. That she wouldn’t was most definitely a relief.</p><p>“What about Aeron?” Kaia asked. “All those tattoos...” A moan slipped from her as she shivered. “I could trace every single one of them with my tongue.”</p><p>Aeron, host of Wrath. One of only two Lords with wings, Aeron’s were black and gossamer. He had tattoos all over his body, and looked every inch the demon he was. What’s more, he had recently broken a spiritual covenant. Therefore, Aeron would be dead before the upcoming nuptials.</p><p>Lysander’s charge, Olivia, had been ordered to slay the warrior. So far she had resisted the decree. The girl was too softhearted for her own good. Eventually, though, she would do her duty. Otherwise, she would be kicked to earth, immortal no longer, and that was not a fate Lysander would allow. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Of all the angels he’d trained, she was by far his favorite. As gentle as she was, a man couldn’t help but want to make her happy. She was trustworthy, loyal and all that was pure; she was the type of female who should have tempted him. A female he might have been able to accept in a romantic way. Wild Bianka...no. Never.</p><p>“However will I choose between my two favorite Lords, B?” Another sigh returned Lysander’s focus to the Harpies.</p><p>Bianka rolled her eyes. “Just sample them both. Not like you haven’t enjoyed a twofer before.”</p> <p>Kaia laughed, though the amusement didn’t quite reach her voice. Like Bianka, there was a twinge of sadness to the sound. “True.”</p><p>Lysander’s mouth curled in mild distaste. Two different partners in one day. Or at the same time. Had Bianka done that, too? Probably.</p><p>“What about you?” Kaia asked. “You gonna hook up with Amun at the wedding?”</p><p>There was a long, heavy pause. Then Bianka shrugged. “Maybe. Probably.”</p><p>He should leave and return when she was alone. The more he learned about her, the more he disliked her. Soon he would simply snatch her up, no matter who watched, revealing his presence, his intentions, just to save this world from her dark influence.</p> <p>He flapped his wings once, twice, lifting into the air.</p><p>“You know what I want more than anything else in the world?” she asked, rolling to her side and facing her sister. Facing Lysander directly, as well. Her eyes were wide, amber irises luminous. Beams of sunlight seemed to soak into that glorious skin, and he found himself pausing.</p><p>Kaia stretched out beside her. “To co-host Good Morning America?”</p><p>“Well, yeah, but that’s not what I meant.”</p><p>“Then I’m stumped.”</p><p>“Well...” Bianka nibbled on her bottom lip. Opened her mouth. Closed her mouth. Scowled. “I’ll tell you, but you can’t tell anyone.”</p> <p>The redhead pretended to twist a lock over her lips.</p><p>“I’m serious, K. Tell anyone, and I’ll deny it then hunt you down and chop off your head.”</p><p>Would she truly? Lysander wondered. Again, probably. He could not imagine hurting his Olivia, whom he loved like a sister. Maybe because she was not one of the Elite Seven, but was a joy-bringer, the weakest of the angels.</p><p>There were three angelic factions. The Elite Seven, the warriors and the joy-bringers. Their status was reflected in both their different duties and the color of their wings. Each of the Seven possessed golden wings, like his own. Warriors possessed white wings merely threaded with gold, and the joy-bringers’ white wings bore no gold at all.</p><p>Olivia had been a joy-bringer all the centuries of her existence. Something she was quite happy with. That was why everyone, including Olivia, had experienced such shock when golden down had begun to grow in her feathers.</p><p>Not Lysander, however. He’d petitioned the Angelic Council, and they’d agreed. It had needed to be done. She was too fascinated by the demon-possessed warrior Aeron. Too...infatuated. Ridding her of such an attraction was imperative. As he well knew.</p><p>His hand clenched into a fist. He blamed himself for Olivia’s circumstances. He had sent her to watch the Lords. To study them. He should have gone himself, but he’d hoped to avoid Bianka.</p><p>“Well, don’t just lie there. Tell me what you want to do more than anything else in the world,” Kaia exclaimed, once again drawing his attention.</p> <p>Bianka uttered another sigh. “I want to sleep with a man.”</p><p>Kaia’s brow scrunched in confusion. “Uh, hello. Wasn’t that what we were just discussing?”</p><p>“No, dummy. I mean, I want to sleep. As in, conk out. As in, snore my ass off.”</p><p>A moment passed in silence as Kaia absorbed the announcement. “What! That’s forbidden. Stupid. Dangerous.”</p><p>Harpies lived by two rules, he knew. They could only eat what they stole or earned, and they could not sleep in the presence of another. The first was because of a curse on all Harpy-kind, and the second because Harpies were suspicious and untrusting by nature.</p><p>Lysander’s head tilted to the side as he found himself imagining holding Bianka in his arms as she drifted into slumber. That fall of dark curls would tumble over his arm and chest. Her warmth would seep into his body. Her leg would rub over his.</p><p>He could never allow it, of course, but that didn’t diminish the power of the vision. To hold her, protect her, comfort her would be...nice.</p><p>Would her skin be as soft as it appeared?</p><p>His teeth ground together. There was that ridiculous question again. I do not care. It does not matter.</p><p>“Forget I said anything,” Bianka grumbled, once more flopping to her back and staring up at the bright sky.</p><p>“I can’t. Your words are singed into my ears. Do you know what happened to our ancestors when they were stupid enough to fall asl—”</p><p>“Yes, okay. Yes.” She pushed to her feet. The faux fur coat she wore was bloodred, same as her lips, and a vivid contrast to the white ice around her. Her boots were black and climbed to her knees. She wore skintight pants, also black. She looked wicked and beautiful.</p><p>Would her skin be as soft as it appeared?</p><p>Before he realized what he was doing, he was standing in front of her, reaching out, fingers tingling. What are you doing? Stop! He froze. Backed several steps away.</p><p>Sweet heaven. How close he’d come to giving in to the temptation of her.</p><p>He could not wait any longer. Could not wait until she was alone. He had to act now. His reaction to her was growing stronger. Any more, and he would touch her. And if he liked touching her, he might want to do more. That was how temptation worked. You gave in to one thing, then yearned for another. And another. Soon, you were lost.</p><p>“Enough heavy talk. Let’s get back to our boring routine and jump,” Bianka said, stalking to the edge of the peak. “You know the rules. Girl who breaks the least amount of bones wins. If you die, you lose. For, like, ever.” She gazed down.</p><p>So did Lysander. There were crests and dips along the way, ice bounders with sharp, deadly ridges and thousands of feet of air. Such a jump would have killed a mortal, no question. The Harpy merely joked about the possibility, as if it were of no consequence. Did she think herself invulnerable?</p><p>Kaia lumbered to her feet and swayed from the liquor still pouring through her. “Fine, but don’t think this is the last of our conversation about sleeping habits and stupid girls who—”</p><p>Bianka dove.</p><p>Lysander expected the action, but was still surprised by it. He followed her down. She spread her arms, closed her eyes, grinning foolishly. That grin...affected him. Clearly she reveled in the freedom of soaring. Something he often did, as well. But she would not have the end she desired.</p><p>Seconds before she slammed into a boulder, Lysander allowed himself to materialize in her plane. He grabbed her, arms catching under hers, wings unfolding, slowing them. Her legs slapped against him, jarring him, but he didn’t release his hold.</p><p>A gasp escaped her, and her eyelids popped open. When she spotted him, amber eyes clashing with the dark of his, that gasp became a growl.</p><p>Most would have asked who he was or demanded he go away. Not Bianka.</p><p>“Big mistake, Stranger Danger,” she snapped. “One you’ll pay for.”</p><p>As many battles as he’d fought over the years and as many opponents as he’d slain, he didn’t have to see to know she had just unsheathed a blade from a hidden slit in her coat. And he didn’t have to be a psychic to know she meant to stab him.</p><p>“It is you who made the mistake, Harpy. But do not worry. I have every intention of rectifying that.” Before she could ensure that her weapon met its intended target, he whisked her into another plane, into his home—where she would stay. Forever.</p><p>CHAPTER TWO</p><p>BIANKA SKYHAWK GAPED at her new surroundings. One moment she’d been tumbling toward an icy valley, intent on escaping her sister’s line of questioning, as well as winning their break-the-least-amount-of-bones game, and the next she’d been in the arms of a gorgeous blond. Which wasn’t necessarily a good thing. She’d tried to stab him, and he’d blocked her. Freaking blocked her. No one should be able to block a Harpy’s deathblow.</p><p>Now she was standing inside a cloud-slash-palace. A palace that was bigger than any home she’d ever seen. A palace that was warm and sweetly scented, with an almost tangible sense of peace wafting through the air.The walls were wisps of white and smoke, and as she watched, murals formed, seemingly alive, winged creatures, both angelic and demonic, soaring through a morning sky. They reminded her of Danika’s paintings. Danika—the All-Seeing Eye who watched both heaven and hell. The floors, though comprised of that same ethereal substance, allowing a view of the land and people below, were somehow solid.</p><p>Angelic. Cloud. Heaven? Dread flooded her as she spun to face the male who had grabbed her. “Angelic” described him perfectly. From the top of his pale head to the strength in that leanly muscled, sun-kissed body, to the golden wings stretching from his back. Even the white robe that fell to his ankles and the sandals wrapped around his feet gave him a saintly aura.</p><p>Was he an angel, then? Her heart skipped a beat. He wasn’t human, that was for sure. No human male could ever hope to compare to such blinding perfection. But damn, those eyes...they were dark and hard and almost, well, empty.</p><p>His eyes don’t matter. Angels were demon assassins, and she was as close to a demon as a girl could get. After all, her great-grandfather was Lucifer himself. Lucifer, who had spent a year on earth unfettered, pillaging and raping. Only a few females had conceived, but those that had soon gave birth to the first of the Harpies.</p><p>Unsure of what to do, Bianka strode around her blond; he remained in place, even when she was at his back, as if he had nothing to fear from her. Maybe he didn’t. Obviously he had powers. One, he’d blocked her—she just couldn’t get over that fact—and two, he’d somehow removed her coat and all her weapons without touching her.</p><p>“Are you an angel?” she asked when she was once again in front of him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes.” No hesitation. As if his heritage wasn’t something to be ashamed of.</p><p>Poor guy, she thought with a shudder. Clearly he had no idea the crappy hand he’d been dealt. If she had to choose between being an angel and a dog, she’d choose the dog. They, at least, were respectable.</p><p>She’d never been this close to an angel before. Seen one, yes. Or rather, seen what she’d thought was an angel but had later learned was a demon in disguise. Either way, she hadn’t liked the guy, her youngest sister’s father. He considered himself a god and everyone else beneath him.</p> <p>“Did you bring me here to kill me?” she asked. Not that he’d have any luck. He would find that she was not an easy target. Many immortals had tried to finish her off over the years, but none had succeeded. Obviously.</p><p>He sighed, warm breath trekking over her cheeks. She had accidentally-on-purpose closed some of the distance between them; he smelled of the icecaps she so loved. Fresh and crisp with just a hint of earthy spice.</p><p>When he realized that only a whisper separated them, his lips, too full for a man but somehow perfect for him, pressed into a mulish line. Though she didn’t see him move, he was suddenly a few more inches away from her. Huh. Interesting. Had he increased the distance on purpose?</p><p>Curious, she stepped toward him.</p><p>He backed away.</p> <p>He had. Why? Was he scared of her?</p><p>Just to be contrary, as she often was, she stepped toward him again. Again, he stepped away. So. The big, bad angel didn’t want to be within striking distance. She almost grinned.</p><p>“Well,” she prompted. “Did you?”</p><p>“No. I did not bring you here to kill you.” His voice was rich, sultry, a sin all its own. And yet, there was a layer of absolute truth to it, and she suspected she would have believed anything he said. As if whatever he said was simply fated, meant to be. Unchangeable. “I want you to emulate my life. I want you to learn from me.”</p><p>“Why?” What would he do if she touched him? The tiny gossamer wings on her own back fluttered at the thought. Her T-shirt was designed especially for her kind, the material loose to keep from pinning those wings as she jolted into super-speed. “Wait. Don’t answer. Let’s make out first.” A lie, but he didn’t need to know that.</p><p>“Bianka,” he said, his patience clearly waning. “This is not a game. Do not make me bind you to my bed.”</p> <p>“Ohh, now that I like. Sounds kinky.” She darted around him, running her fingertips over his cheek, his neck. “You’re as soft as a baby.”</p><p>He sucked in a breath, stiffened. “Bianka.”</p><p>“But better equipped.”</p><p>“Bianka!”</p><p>She patted his butt. “Yes?”</p><p>“You will cease that immediately!”</p><p>“Make me.” She laughed, the amused, carefree sound echoing between them.</p><p>Scowling, he reached out and latched on to her upper arm. There wasn’t time to evade him; shockingly, he was faster than she was. He jerked her in front of him, and dark, narrowed eyes stared down at her.</p> <p>“There will be no touching. Do you understand?”</p><p>“Do you?” Her gaze flicked to his hand, still clutching her arm. “At the moment, you’re the one touching me.”</p><p>Like hers, his gaze fell to where they were connected. He licked his lips, and his grip tightened just the way she liked. Then he released her as if she were on fire and once again increased the distance between them.</p><p>“Do you understand?” His tone was hard and flat.</p><p>What was the problem? He should be begging to touch her. She was a desirable Harpy, damn it. Her body was a work of art and her face total perfection. But for his benefit, she said, “Yeah, I understand. That doesn’t mean I’ll obey.” Her skin tingled, craving the return of his. Bad girl. Bad, bad girl. He’s a stupid angel and therefore not an appropriate plaything.</p><p>A moment passed as he absorbed her words. “Are you not frightened of me?” His wings folded into his back, arcing over his shoulders.</p><p>“No,” she said, raising a brow and doing her best to appear unaffected. “Should I be?”</p><p>“Yes.”</p><p>Well, then, he’d have to somehow grow the fiery claws of her father’s people. That was the only thing that scared her. Having been scratched as a child, having felt the acid-burn of fire spread through her entire body, having spent days writhing in agonizing, seemingly endless pain, she would do anything to avoid such an experience again.</p><p>“Well, I’m still not. And now you’re starting to bore me.” She anchored her hands on her hips, glaring up at him. “I asked you a question but you never answered it. Why do you want me to be like you? So much so, that you brought me into heaven, of all places?”</p><p>A muscle ticked below one of his eyes. “Because I am good and you are evil.”</p><p>Another laugh escaped her. He frowned, and her laughter increased until tears were running from her eyes. When she quieted, she said, “Good job. You staved off the boredom.”</p><p>His frown deepened. “I was not teasing you. I mean to keep you here forever and train you to be sinless.”</p><p>“Gods, how—oops, sorry. I mean, golly, how adorable are you? ‘I mean to keep you here forever and train you,’” she said in her best impersonation of him. There was no reason to fight about her eventual escape. She’d prove him wrong just as soon as she decided to leave. Right now, she was too intrigued. With her surroundings, she assured herself, and not the angel. Heaven was not a place she’d ever thought to visit.</p><p>His chin lifted a notch, but his eyes remained expressionless. “I am serious.”</p><p>“I’m sure you are. But you’ll find that you can’t keep me anywhere I don’t want to be. And me? Without sin? Funny!”</p><p>“We shall see.”</p><p>His confidence might have unnerved her had she been less confident in her own abilities. As a Harpy, she could lift a semi as if it were no more significant than a pebble, could move faster than the human eye could see and had no problem slaying an unwelcome host.</p><p>“Be honest,” she said. “You saw me and wanted a piece, right?”</p><p>For the briefest of moments, horror blanketed his face. “No,” he croaked out, then cleared his throat and said more smoothly, “No.”</p><p>Insulting bastard. Why such horror at the thought of being with her? She was the one who should be horrified. He was clearly a do-gooder, more so than she’d realized. I am good and you are evil, he’d said. Ugh.</p><p>“So tell me again why you want to change me. Didn’t anyone ever tell you that you shouldn’t mess with perfection?”</p><p>That muscle started ticking below his eye again. “You are a menace.”</p><p>“Whatever, dude.” She liked to steal—so what. She could kill without blinking—again, so what. It wasn’t like she worked for the IRS or anything. “Where’s my sister, Kaia? She’s as much a menace as I am, I’m sure. So why don’t you want to change her?”</p><p>“She is still in Alaska, wondering if you are buried inside an ice cave. And you are my only project at the moment.”</p><p>Project? Bastard. But she did like the thought of Kaia searching high and low but finding no sign of her, almost like they were playing a game of Hide and Seek. Bianka would totally, finally win.</p><p>“You appear...excited,” he said, head tilting to the side. “Why? Does her concern not disturb you?”</p><p>Yep. A certified do-gooder. “It’s not like I’ll be here long.” She peeked over his shoulder; more of that wisping white greeted her. “Got anything to drink here?”</p><p>“No.”</p><p>“Eat?”</p><p>“No.”</p><p>“Wear?”</p><p>“No.”</p><p>Slowly the corners of her lips lifted. “I guess that means you like to go naked. Awesome.”</p><p>His cheeks reddened. “Enough. You are trying to bait me and I do not like it.”</p><p>“Then you shouldn’t have brought me here.” Hey, wait a minute. He’d never really told her why he’d chosen her as his project, she realized. “Be honest. Do you need my help with something?” After all, she, like many of her fellow Harpies, was a mercenary, paid to find and retrieve. Her motto: if it’s unethical and illegal and you’ve got the cash, I’m your girl! “I mean, I know you didn’t just bring me here to save the world from my naughty influence. Otherwise, millions of other people would be here with me.”</p><p>He crossed his arms over his massive chest.</p><p>She sighed. Knowing men as she did, she knew he was done answering that type of question. Oh, well. She could have convinced him otherwise by annoying him until he caved, but she didn’t want to put the work in.</p><p>“So what do you do for fun around here?” she asked.</p><p>“I destroy demons.”</p><p>Like you, she finished for him. But he’d already said he had no intention of killing her, and she believed him—how could she not? That voice...“So you don’t want to hurt me, you don’t want to touch me, but you do want me to live here forever.”</p><p>“Yes.”</p><p>“I’d be an idiot to refuse such an offer.” That she sounded sincere was a miracle. “We’ll pretend to be married and spend the nights locked in each other’s arms, kissing and touching, our bodies—”</p><p>“Stop. Just stop.” And, drumroll please, that muscle began ticking under his eye again.</p><p>This time, there was no fighting her grin. It spread wide and proud. That tic was a sign of anger, surely. But what would it take to make that anger actually seep into his irises? What would it take to break even a fraction of his iron control?</p><p>“Show me around,” she said. “If I’m going to live here, I need to know where my walk-in closet is.” During the tour, she could accidentally-on-purpose brush against him. Over and over again. “Do we have cable?”</p><p>“No. And I cannot give you a tour. I have duties. Important duties.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah, you do. My pleasure. That should be priority one.”</p><p>Teeth grinding together, he turned on his heel and strode away. “You will find it difficult to get into trouble here, so I suggest you do not even try.” His voice echoed behind him.</p><p>Please. She could get into trouble with nothing but a toothpick and a spoon. “If you leave, I’ll rearrange everything.” Not that there was any furniture to be seen.</p> <p>Silence.</p><p>“I’ll get bored and take off.”</p><p>“Try.”</p><p>It was a response, at least. “So you’re seriously going to leave me? Just like that?” She snapped her fingers.</p><p>“Yes.” Another response, though he didn’t stop walking.</p> <p>“What about that bed you were going to chain me to? Where is it?”</p><p>Uh-oh, back to silence.</p><p>“You didn’t even tell me your name,” she called, irritated despite herself. How could he abandon her like that? He should hunger for more of her. “Well? I deserve to know the name of the man I’ll be cursing.”</p><p>Finally, he stopped. Still, a long while passed in silence and she thought he meant to ignore her. Again. Then he said, “My name is Lysander,” and stepped from the cloud, disappearing from view.</p><p>CHAPTER THREE</p><p>LYSANDER WATCHED AS TWO newly recruited warrior angels—angels under his training and command—finally subdued a demonic minion that had dug its way free from hell. The creature was scaled from head to hoof and little horns protruded from its shoulders and back. Its eyes were bright red, like crystallized blood.</p> <p>The fight had lasted half an hour, and both angels were now bleeding, panting. Demons were notorious for their biting and scratching.Lysander should have been able to critique the men and tell them what they had done wrong. That way, they would do a better job next time. But as they’d struggled with the fiend, his mind had drifted to Bianka. What was she doing? Was she resigned to her fate yet? He’d given her several days alone to calm and accept.</p><p>“What now?” one of his trainees asked. Beacon was his name.</p><p>“You letsss me go, you letsss me go,” the demon said pleadingly, its forked tongue giving it a lisp. “I behave. I return. Ssswear.”</p><p>Lies. As a minion, it was a servant to a demon High Lord—just as there were three factions of angels, there were three factions of demons. High Lords held the most power, followed by Lords, who were followed by the lowest of them all, minions. Despite this one’s lack of status, it could cause untold damage among humans. Not only because it was evil, but also because it was a minion of Strife and took its nourishment from the trouble it caused others.</p><p>By the time Lysander had sensed its presence on earth, it had already broken up two marriages and convinced one teenager to start smoking and another to kill himself.</p><p>“Execute it,” Lysander commanded. “It knew the consequences of breaking a heavenly law, yet it chose to escape from hell anyway.”</p><p>The minion began to struggle again. “You going to lisssten to him when you obviousssly ssstronger and better than him? He make you do all hard work. He do nothing hissself. Lazy, if you asssk me. Kill him.”</p><p>“We do not ask you,” Lysander said.</p> <p>Both angels raised their hands and fiery swords appeared.</p><p>“Pleassse,” the demon screeched. “No. Don’t do thisss.”</p><p>They didn’t hesitate. They struck.</p><p>The scaled head rolled, yet the angels did not dematerialize their swords. They kept the tips poised on the motionless body until it caught flame. When nothing but ash remained, they looked to Lysander for instruction.</p><p>“Excellent job.” He nodded in satisfaction. “You have improved since your last killing, and I am proud of you. But you will train with Raphael until further notice,” he said. Raphael was strong, intelligent and one of the best trackers in the heavens.</p><p>Raphael would not be distracted by a Harpy he had no hopes of possessing.</p><p>Possessing? Lysander’s jaw clenched tightly. He was not some vile demon. He possessed nothing. Ever. And when he finished with Bianka, she would be glad of that. There would be no more games, no more racing around him, caressing him and laughing. The clenching in his jaw stopped, but his shoulders sagged. In disappointment? Couldn’t be.</p><p>Perhaps he needed a few days to calm and accept.</p><p>HE’D LEFT HER ALONE for a week, the sun rising and setting beyond the clouds. And each day, Bianka grew madder—and madder. And madder. Worse, she grew weaker. Harpies could only eat what they stole (or earned, but there was no way to earn a single morsel here). And no, that wasn’t a rule she could overlook. It was a curse. A godly curse her people had endured for centuries. Reviled as Harpies were, the gods had banded together and decreed that no Harpy could enjoy a meal freely given or one they had prepared themselves. If they did, they sickened terribly. The gods’ hope? Destruction.</p><p>Instead, they’d merely ensured Harpies learned how to steal from birth. To survive, even an angel would sin.Lysander would learn that firsthand. She would make sure of it. Bastard.</p><p>Had he planned this to torture her?</p><p>In this palace, Bianka had only to speak of something and it would materialize before her. An apple—bright and red and juicy. Baked turkey—succulent and plump. But she couldn’t eat them, and it was killing her. Liter—fucking—ally.</p><p>At first, Bianka had tried to escape. Several times. Unlike Lysander the Cruel, she couldn’t jump from the clouds. The floor expanded wherever she stepped and remained as hard as marble. All she could do was move from ethereal room to ethereal room, watching the murals play out battle scenes. Once she’d thought she’d even spied Lysander.</p><p>Of course, she’d said, “Rock,” and a nice-size stone had appeared in her hand. She’d chucked it at him, but the stupid thing had fallen to earth rather than hit him.</p><p>Where was he? What was he doing? Did he mean to kill her like this, despite his earlier denial? Slowly and painfully? At least the hunger pains had finally left her. Now she was merely consumed by a sensation of trembling emptiness.</p><p>She wanted to stab him the moment she saw him. Then set him on fire. Then scatter his ashes in a pasture where lots of animals roamed. He deserved to be smothered by several nice steaming piles. Of course, if he waited much longer, she would be the one burned and scattered. She couldn’t even drink a glass of water.</p><p>Besides, fighting him wasn’t the way to punish him. That, she’d realized the first day here. He didn’t like to be touched. Therefore, touching him was the way to punish him. And touch him she would. Anywhere, everywhere. Until he begged her to stop. No. Until he begged her to continue.</p><p>She would make him like it, and then take it away.</p><p>If she lasted.</p><p>Right now, she could barely hold herself up. In fact, why was she even trying?</p><p>“Bed,” she muttered weakly, and a large four-poster appeared just in front of her. She hadn’t slept since she’d gotten here. Usually she crashed in trees, but she wouldn’t have had the strength to climb one even if the cloud had been filled with them. She collapsed on the plush mattress, velvet coverlet soft against her skin. Sleep. She’d sleep for a little while.</p><p>FINALLY LYSANDER COULD STAND it no more. Nine days. He’d lasted nine days. Nine days of thinking about the female constantly, wondering what she was doing, what she was thinking. If her skin was as soft as it looked.</p><p>He could tolerate it no longer. He would check on her, that was all, and see for himself how—and what—she was doing. Then he would leave her again. Until he got himself under control. Until he stopped thinking about her. Stopped wanting to be near her. Her training had to begin sometime.His wings glided up and down as he soared to his cloud. His heartbeat was a bit...odd. Faster than normal, even bumping against his ribs. Also, his blood was like fire in his veins. He didn’t know what was wrong. Angels only sickened when they were infected with demon poison, and as Lysander had not been bitten by a demon—had not even fought one in weeks—he knew that was not the problem.</p><p>Blame could probably be laid at Bianka’s door, he thought with a scowl.</p><p>First thing he noticed upon entering was the food littering the floor. From fruits to meats to bags of chips. All were uneaten, even unopened.</p><p>Scowl melting into a frown, he folded his wings into his back and stalked forward. He found Bianka inside one of the rooms, lying atop a bed. She wore the same clothing she’d been clad in when he’d first taken her—red shirt, tights that molded to her perfect curves—but had discarded her boots. Her hair was tangled around her, and her skin worryingly pale. There was no sparkle to it, no pearl-like gleam. Bruises now formed half-moons under her eyes.</p><p>Part of him had expected to find her fuming—and out for his head. The other part of him had hoped to find her compliant. Not once had he thought to find her like this.</p><p>She thrashed, the covers bunched around her. His frown deepened.</p><p>“Hamburger,” she croaked.</p><p>A juicy burger appeared on the floor a few inches from the bed, all the extras—lettuce, tomato slices, pickles and cheese—decorating the edges of the plate. The manifestation didn’t surprise him. That was the beauty of these angelic homes. Whatever was desired—within reason, of course—was provided.</p><p>All this food, and she hadn’t taken a single bite. Why would she request—It wasn’t stolen, he realized, and for the first time in his endless existence, he was angry with himself. And scared. For her. He hated the emotion, but there it was. She hadn’t eaten in these last nine days because she couldn’t. She was truly starving to death.</p><p>Though he wanted her out of his head, out of his life, he hadn’t wanted her to suffer. Yet suffer she had. Unbearably. Now she was too weak to steal anything. And if he force-fed her, she would vomit, hurting more than she already was. Suddenly he wanted to roar.</p><p>“Blade,” he said, and within a single blink, a sharp-tipped blade rested in his hand. He stalked to the side of the bed. He was trembling.</p><p>“Fries. Chocolate shake.” Her voice was soft, barely audible. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lysander slashed one of his wrists. Blood instantly spilled from the wound, and he stretched out his arm, forcing each drop to fall into her mouth. Blood was not food for Harpies; it was medicine. Therefore her body could accept it. He’d never freely given his blood to another living being and wasn’t sure he liked the thought of something of his flowing inside this woman’s veins. In fact, the thought actually caused his heartbeat to start slamming against his ribs again. But there was no other way.</p><p>At first, she didn’t act as if she noticed. Then her tongue emerged, licking at the liquid before it could reach her lips. Then her eyes opened, amber irises bright, and she grabbed on to his arm, jerking it to her mouth. Her sharp teeth sank into his skin as she sucked.</p><p>Another odd sensation, he thought. Having a woman drink from him. There was heat and wetness and a sting, yet it was not unpleasant. It actually lanced a pang of...something unnameable straight to his stomach and between his legs.</p> <p>“Drink all you need,” he told her. His body would not run out. Every drop was replaced the moment it left him.</p><p>Her gaze narrowed on him. The more she swallowed, the more fury he saw banked there. Soon her fingers were tightening around his wrist, her nails cutting deep. If she expected some sort of reaction from him, she would not get it. He’d been alive too long and endured far too many injuries to be affected by something so minor. Except for that pang between his legs...What was that?</p><p>Finally, though, she released him. He wasn’t sure if that gladdened him or filled him with disappointment.</p><p>Gladdened, of course, he told himself.</p><p>A trickle of red flowed from the corner of her mouth, and she licked it away. The sight of that pink tongue caused another lance to shoot through him.</p> <p>Definitely disap—uh, gladdened.</p><p>“You bastard,” she growled through her panting. “You sick, torturing bastard.”</p><p>He moved out of striking distance. Not to protect himself, but to protect her. If she were to attack him, he would have to subdue her. And if he subdued her, he might hurt her. And accidentally brush against her. Blood...heating...</p><p>“It was never my intent to harm you,” he said. And now, even his voice was trembling. Odd.</p><p>“And that makes what you did okay?” She jerked to a sitting position, all that dark hair spilling around her shoulders. The pearl-like sheen was slowly returning to her skin. “You left me here, unable to eat. Dying!”</p><p>“I know.” Was that skin as soft as it looked? He gulped. “And I am sorry.” Her anger should have overjoyed him. As he’d hoped, she would no longer laugh up at him, her face lit with the force of her amusement. She would no longer race around him, petting him. Yes, he should have been overjoyed. Instead, the disappointment he’d just denied experiencing raced through him. Disappointment mixed with shame.</p> <p>She was more a temptation than he had realized.</p><p>“You know?” she gasped out. “You know that I can only consume what I steal or earn and yet you failed to make arrangements for me?”</p><p>“Yes,” he admitted, hating himself for the first time in his existence.</p><p>“What’s more, you left me here. With no way home.”</p><p>His nod was stiff. “I have since made restitution by saving your life. But as I said, I am sorry.”</p><p>“Oh, well, you’re sorry,” she said, throwing up her arms. “That makes everything better. That makes almost dying acceptable.” She didn’t wait for his reply. She kicked her legs over the bed and stood. Her skin was at full glow now. “Now you listen up. First, you’re going to find a way to feed me. Then, you’re going to tell me how to get off this stupid cloud. Otherwise I will make your life a hell you’ve never experienced before. Actually, I will anyway. That way, you’ll never forget what happens when you mess with a Harpy.”</p><p>He believed her. Already she affected him more than anyone else ever had. That was hell enough. Proof: his mouth was actually watering to taste her, his hands itching to touch her. Rather than reveal these new developments, however, he said, “You are powerless here. How would you hurt me?”</p><p>“Powerless?” She laughed. “I don’t think so.” One step, two, she approached him.</p> <p>He held his ground. He would not retreat. Not this time. Assert your authority. “You cannot leave unless I allow it. The cloud belongs to me and places my will above yours. Therefore, there is no exit for you. You would be wise to curry my favor.”</p><p>She sucked in a breath, paused. “So you still mean to keep me here forever? Even though I have a wedding to attend?” She sounded surprised.</p><p>“When did I ever give you the impression that I meant otherwise? Besides, I heard you tell your sister you didn’t want to go to that wedding.”</p><p>“No, I said I didn’t want to be a bridesmaid. But I love my baby sis, so I’ll do it. With a smile.” Bianka ran her tongue over her straight, white teeth. “But let’s talk about you. You like to eavesdrop, huh? That sounds a little demonic for a goody-goody angel.”</p><p>Over the years he’d been called far worse than demonic. The goody-goody, though...Was that how she saw him? Rather than as the righteous soldier he was? “In war, I do what I must to win.”</p><p>“Let me get this straight.” Her eyes narrowed as she crossed her arms over her middle. Stubbornness radiated from her. “We were at war before I even met you?”</p><p>“Correct.” A war he would win. But what would he do if he failed to set her on the right path? He would have to destroy her, of course, but for him to legally be allowed to destroy her, he reminded himself, she would first have to commit an unpardonable sin. Though she’d lived a long time, she had never crossed that line. Which meant she would have to be encouraged to do so. But how? Here, away from civilization—both mortal and immortal—she couldn’t free a demon from hell. She couldn’t slay an angel. Besides him, but that would never happen. He was stronger than she was.</p><p>She could blaspheme, he supposed, but he would never—never!—encourage someone to do that, no matter the reason. Not even to save himself.</p><p>The only other possibility was for her to convince an angel to fall. As she was his temptation, and as he was the only angel of her acquaintance, he was the only one she could convince. And he wouldn’t. Again, not for any reason. He loved his life, his Deity, and was proud of his work and all he had accomplished.</p><p>Perhaps he would simply leave Bianka here, alone for the rest of eternity. That way, she could live but would be unable to cause trouble. He would visit her every few weeks—perhaps months—but never remain long enough for her to corrupt him.</p><p>A sudden blow to the cheek sent his head whipping to the side. He frowned, straightened and rubbed the now-stinging spot. Bianka was exactly as she’d been before, standing in front of him. Only now she was smiling.</p><p>“You hit me,” he said, his astonishment clear.</p><p>“How sweet of you to notice.”</p><p>“Why did you do that?” To be honest, he should not have been surprised. Harpies were as violent by nature as their inhuman counterparts the demons. Why couldn’t she have looked like a demon, though? Why did she have to be so lovely? “I saved you, gave you my blood. I even explained why you could not leave, just as you asked. I did not have to do any of those things.”</p><p>“Do I really need to repeat your crimes?”</p><p>“No.” They were not crimes! But perhaps it was best to change the subject. “Allow me to feed you,” he said. He walked to the plate holding the hamburger and picked it up. The scent of spiced meat wafted to his nose, and his mouth curled in distaste.</p><p>Though he didn’t want to, though his stomach rolled, he took a bite. He wanted to gag, but managed to swallow. Normally he only ate fruits, nuts and vegetables. “This,” he said with much disgust, “is mine.” Careful not to touch her, he placed the food in her hands. “You are not to eat it.”</p><p>By staking the verbal claim, the meal did indeed become his. He watched understanding light her eyes.</p><p>“Oh, cool.” She didn’t hesitate to rip into the burger, every crumb gone in seconds. Next he sipped the chocolate shake. The sugar was almost obscene in his mouth, and he did gag. “Mine,” he repeated faintly, giving it to her, as well. “But next time, please request a healthier meal.”</p><p>She flipped him off as she gulped back the ice cream. “More.”</p><p>He bypassed the French fries. No way was he going to defile his body with one of those greasy abominations. He found an apple, a pear, but had to request a stalk of broccoli himself. After claiming them, he took a bite of each and handed them over. Much better.</p><p>Bianka devoured them. Well, except for the broccoli. That, she threw at him. “I’m a carnivore, moron.”</p><p>She hardly had to remind him when the unpleasant taste of the burger lingered on his tongue. Still, he chose to overlook her mockery. “All of the food produced in this home is mine. Mine and mine alone. You are to leave it alone.”</p><p>“That’d be great if I were actually staying,” she muttered while stuffing the fries in her mouth.</p><p>He sighed. She would accept her fate soon enough. She would have to.</p><p>The more she ate, the more radiant her skin became. Magnificent, he thought, reaching out before he could stop himself.</p><p>She grabbed his fingers and twisted just before contact. “Nope. I don’t like you, so you don’t get to handle the goods.”</p><p>He experienced a sharp pain, but merely blinked over at her. “My apologies,” he said stiffly. Thank the One True Deity she’d stopped him. No telling what he would have done to her had he actually touched her. Behaved like a slobbering human? He shuddered.</p><p>She shrugged and released him. “Now for my second order. Let me go home.” As she spoke, she assumed a battle stance. Legs braced apart, hands fisted at her sides.</p><p>He mirrored her movements, refusing to admit, even to himself, that her bravery heated his traitorous blood another degree. “You cannot hurt me, Harpy. Fighting me would be pointless.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Slowly her lips curled into a devilish grin. “Who said I was going to try and hurt you?”</p><p>Before Lysander could blink, she closed the distance between them and pressed against him, arms winding around his neck and tugging his head down. Their lips met and her tongue thrust into his mouth. Automatically, he stiffened. He had seen humans kiss more times than he could count, but he’d never longed to try the act for himself.</p><p>Like sex, it seemed messy—in every way imaginable—and unnecessary. But as her tongue rolled against his, as her hands caressed a path down his spine, his body warmed—far more than it had when he’d simply thought of being here with her—and the tingle he’d noticed earlier bloomed once more. Only this time, that tingle grew and spread. Like the shaft between his legs. Rising...thickening...</p> <p>He’d wanted to taste her and now he was. She was delicious, like the apple she’d just eaten, only sweeter, headier, like his favorite wine. He should make her stop. This was too much. But the wetness of her mouth wasn’t messy in the least. It was electrifying.</p><p>More, a little voice said in his head.</p><p>“Yes,” she rasped, as if he’d spoken aloud.</p><p>When she rubbed her lower body against his, every sensation intensified. His hands fisted at his sides. He couldn’t touch her. Shouldn’t touch her. Should stop this as she’d stopped him, as he’d already tried to convince himself.</p><p>A moan escaped her. Her fingers tangled in his hair. His scalp, an area he’d never considered sensitive before, ached, soaking up every bit of attention. And when she rubbed against him again, he almost moaned.</p> <p>Her hands fell to his chest and a fingertip brushed one of his nipples. He did moan; he did grab her. His fingers gripped her hips, holding her still even though he wanted to force her to rub against him some more. The lack of motion didn’t slow her kiss. She continued to dance their tongues together, leisurely, as if she could drink from him forever. And wanted to.</p><p>He should stop this, he told himself yet again.</p><p>Yes. Yes, he would. He tried to push her tongue out of his mouth. The pressure created another sensation, this one new and stronger than any other. His entire body felt aflame. He started pushing at her tongue for an entirely different reason, twining them together, tasting her again, licking her, sucking her.</p><p>“Mmm, yeah. That’s the way,” she praised.</p><p>Her voice was a drug, luring him in deeper, making him crave more. More, more, more. The temptation was too much, and he had to—</p><p>Temptation.</p> <p>The word echoed through his mind, a sword sharp enough to cut bone. She was a temptation. She was his temptation. And he was allowing her to lead him astray.</p><p>He wrenched away from her, and his arms fell to his sides, heavy as boulders. He was panting, sweating, things he had not done even in the midst of battle. Angry as he was—at her, at himself—his gaze drank in the sight of her. Her skin was flushed, glowing more than ever. Her lips were red and swollen. And he had caused that reaction. Sparks of pride took him by surprise.</p><p>“You should not have done that,” he growled.</p><p>Slowly she grinned. “Well, you should have stopped me.”</p><p>“I wanted to stop you.”</p><p>“But you didn’t,” she said, that grin growing.</p><p>His teeth ground together. “Do not do it again.”</p><p>One of her brows arched in smug challenge. “Keep me here against my will, and I’ll do that and more. Much, much more. In fact...” She ripped her shirt over her head and tossed it aside, revealing breasts covered by pink lace.</p> <p>Breathing became impossible.</p><p>“Want to touch them?” she asked huskily, cupping them with her hands. “I’ll let you. I won’t even make you beg.”</p><p>Holy...Lord. They were lovely. Plump and mouthwatering. Lickable. And if he did lick them, would they taste as her mouth had? Like that heady wine? Blood...heating...again...</p><p>He didn’t care what kind of coward his next action made him. It was either jump from the cloud or replace her hands with his own.</p><p>He jumped.</p><p>CHAPTER FOUR</p><p>LYSANDER LEFT BIANKA alone for another week—bastard!—but she didn’t mind. Not this time. She had plenty to keep her occupied. Like her plan to drive him utterly insane with lust. So insane he’d regret bringing her here. Regret keeping her here. Regret even being alive.</p><p>That, or fall so in love with her that he yearned to grant her every desire. If that was the case—and it was a total possibility since she was insanely hot—she would convince him to take her home, and then she would finally get to stab him in the heart.Perfect. Easy. With her breasts, it was almost too easy, really.</p><p>To set the stage for his downfall, she decorated his home like a bordello. Red velvet lounges now waited next to every door—just in case he was too overcome with desire for her to make it to one of the beds now perched in every corner. Naked portraits—of her—hung on the misty walls. A decorating style she’d picked up from her friend Anya, who just happened to be the goddess of Anarchy.</p><p>As Lysander had promised, Bianka had only to speak what she wanted—within reason—to receive it. Apparently furniture and pretty pictures were within reason. She chuckled. She could hardly wait to see him again. To finally begin.</p><p>He wouldn’t stand a chance. Not just because of her (magnificent) breasts and hotness—hey, no reason to act as if she didn’t know—but because he had no experience. She had been his first kiss; she knew it beyond any doubt. He’d been stiff at first, unsure. Hesitant. At no point had he known what to do with his hands.</p><p>That hadn’t stopped her from enjoying herself, however. His taste...decadent. Sinful. Like crisp, clean skies mixed with turbulent night storms. And his body, oh, his body. Utter perfection with hard muscles she’d wanted to squeeze. And lick. She wasn’t picky.</p><p>His hair was so silky she could have run her fingers through it forever. His cock had been so long and thick she could have rubbed herself to orgasm. His skin was so warm and smooth she could have pressed against him and slept, just as she’d dreamed about doing before she’d met him. Even though sleeping with a man was a dangerous crime her race never committed.</p><p>Stupid girl! The angel wasn’t to be trusted, especially since he clearly had nefarious plans for her—though he still refused to tell her exactly what those plans were. Teaching her to act like him had to be a misdirection of the truth. It was just too silly to contemplate. But his plans didn’t matter, she supposed, since he would soon be at her mercy. Not that she had any.</p><p>Bianka strode to the closet she’d created and flipped through the lingerie hanging there. Blue, red, black. Lace, leather, satin. Several costumes: naughty nurse, corrupt policewoman, devil, angel. Which should she choose today?</p><p>He already thought her evil. Perhaps she should wear the see-through white lace. Like a horny virgin bride. Oh, yes. That was the one. She laughed as she dressed.</p><p>“Mirror, please,” she said, and a full-length mirror appeared in front of her. The gown fell to her ankles, but there was a slit between her legs. A slit that stopped at the apex of her thighs. Too bad she wasn’t wearing any panties.</p><p>Spaghetti straps held the material in place on her shoulders and dipped into a deep vee between her breasts. Her nipples, pink and hard, played peek-a-boo with the swooping make-me-a-woman pattern.</p><p>She left her hair loose, flowing like black velvet down her back. Her gold eyes sparkled, flecks of gray finally evident, like in Kaia’s. Her cheeks were flushed like a rose, her skin devoid of the makeup she usually wore to dull its shimmer.</p><p>Bianka traced her fingertips along her collarbone and chuckled again. She’d summoned a shower and washed off every trace of that makeup. If Lysander had found himself attracted to her before—and he had, the size of his hard-on was proof of that—he would be unable to resist her now. She was nothing short of radiant.</p><p>A Harpy’s skin was like a weapon. A sensual weapon. Its jewel-like sheen drew men in, made them slobbering, drooling fools. Touching it became all they could think about, all they lived for.</p><p>That got old after a while, though, which was why she’d begun wearing full body makeup. For Lysander, though, she would make an exception. He deserved what he got. After all, he wasn’t just making Bianka suffer. He was making her sisters suffer. Maybe.</p><p>Was Kaia still looking for her? Still worried or perhaps thinking this was a game as Bianka had first supposed? Had Kaia called their other sisters and were the girls now searching the world over for a sign of her, as they’d done when Gwennie went missing? Probably not, she thought with a sigh. They knew her, knew her strength and her determination. If they suspected she’d been taken, they would have confidence in her ability to free herself. Still.</p><p>Lysander was an ass.</p><p>And most likely a virgin. Eager, excited, she rubbed her hands together. Most men kissed the women they bedded. And if she had been his first kiss, well, it stood to reason he’d never bedded anyone. Her eagerness faded a bit. But that begged the question, why hadn’t he bedded anyone?</p><p>Was he a young immortal? Had he not found anyone he desired? Did angels not often experience sexual need? She didn’t know much about them. Fine, she didn’t know anything about them. Did they consider sex wrong? Maybe. That would explain why he hadn’t wanted to touch her, too.</p><p>Okay, so it made more sense that he simply hadn’t experienced sexual need before.</p><p>He’d definitely experienced it during their kiss, though. She went back to rubbing her hands together.</p><p>“What are you wearing? Or better yet, not wearing?”</p><p>Heart skidding to a stop, Bianka whipped around. As if her thoughts had summoned him, Lysander stood in the room’s doorway. Mist enveloped him and for a moment she feared he was nothing more than a fantasy.</p><p>“Well?” he demanded.</p><p>In her fantasies, he would not be angry. He would be overcome with desire. So...he was here, and he was real. And he was peering at her breasts in open-mouthed astonishment.</p><p>Astonishment was better than anger. She almost grinned. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Don’t you like it?” she asked, smoothing her palms over her hips. Let the games begin.</p><p>“I—I—”</p><p>Like it, she finished for him. With the amount of truth that always layered his voice, he probably couldn’t utter a single lie.</p> <p>“Your skin...it’s different. I mean, I saw the pearlesque tones before, but now...it’s...”</p><p>“Amazing.” She twirled, her gown dancing at her ankles. “I know.”</p><p>“You know?” His tongue traced his teeth as the anger she’d first suspected glazed his features. “Cover her,” he barked.</p><p>A moment later, a white robe draped her from shoulders to feet.</p><p>She scowled. “Return my teddy.” The robe disappeared, leaving her in the white lace. “Try that again,” she told him, “and I’ll just walk around naked. You know, like I am in the portraits.”</p> <p>“Portraits?” Brow furrowing, he gazed about the room. When he spotted one of the pictures of her, sans clothing, reclining against a giant silver boulder, he hissed in a breath.</p><p>Exactly the reaction she’d been hoping for. “I hope you don’t mind, but I turned this quaint little cloud into a love nest so I’d feel more at home. And again, if you remove anything, my redesign will be a thousand times worse.”</p><p>“What are you trying to do to me?” he growled, facing her. His eyes were narrowed, his lips thinned, his teeth bared.</p><p>She fluttered her lashes at him, all innocence. “I’m afraid I don’t know what you mean.”</p><p>“Bianka.”</p><p>It was a warning, she knew, but she didn’t heed it. “I think it’s my turn to ask the questions. So where do you go when you leave me?”</p> <p>“That is not your concern.”</p><p>Was he panting a little? “Let’s see if I can make it my concern, shall we?” She sauntered to the bed and eased onto the edge. Naughty, shameless girl that she was, she spread her legs, giving him the peek of a lifetime. “For every question you answer, I’ll put something on,” she said in a sing-song voice. “Deal?”</p><p>He spun, but not before she saw the shock and desire that played over his harshly gorgeous face. “I do my duty. Watch the gates to hell. Hunt and kill demons that have escaped. Deliver punishment to those in need. Guard humans. Now cover yourself.”</p><p>“I didn’t say what item of clothing I’d don, now did I?” She gave herself a once-over. “One shoe, please. White leather, high heel, open toe. Ties up the calf.” The shoe materialized on her foot, and she laughed. “Perfect.”</p><p>“A trickster,” Lysander muttered. “I should have known.”</p><p>“How did I trick you? Did you ask for specifics? No, because you were secretly hoping I wouldn’t cover myself at all.”</p><p>“That is not true,” he said, but for once, she did not hear that layer of honesty in his voice. Interesting. When he lied, or perhaps when he was unsure about what he was saying, his tone was as normal as hers.</p><p>That meant she would always know when he lied. Did things get any better than that?</p> <p>This was going to be even easier than she’d anticipated. “Next question. Do you think about me while you’re gone?”</p><p>Silence. Thick, heavy.</p><p>Wait. She could hear him breathing. In, out, harsh, shallow. He was panting.</p><p>“I’ll take that as a yes,” she said, grinning. “But since you really didn’t answer, I don’t have to add the other shoe.”</p><p>Again, he didn’t reply. Thankfully, he didn’t leave, either.</p><p>“Onward and upward. Are angels allowed to dally?”</p><p>“Yes, but they rarely want to,” he rasped.</p><p>So she’d been right. He didn’t have firsthand knowledge of desire. What he was now feeling had to be confusing him, then. Was that why he’d brought her here? Because he’d seen her and wanted her, but hadn’t known how to handle what he was feeling? The thought was almost...flattering. In a stalkerish kind of way, of course. That didn’t change her plans, however. She would seduce him—and then she would slice his heart in two. A symbolic gesture, really. An inside joke between them. Well, for herself. He might not get it.</p><p>Still, she couldn’t deny that she liked the idea of being his first. None of the women after her would compare, of course, and that—Hey, wait. Once he tasted the bliss of the flesh, he would want more. Bianka would have escaped him and stabbed him—and he would have recovered because he was an immortal—by then. He could go to any other female he desired.</p><p>He would kiss and touch that female.</p><p>“I’m waiting,” he snapped.</p><p>“For?” she snapped back. Her hands were clenched, her nails cutting her palms. He could be with anyone; it wouldn’t bother her. They were enemies. Someone else could deal with his Neanderthal tendencies. But gods, she might just kill the next woman who warmed his bed out of spite. Not jealousy.</p><p>“I answered one of your questions. You must add a garment to your body. Panties would be nice.”</p><p>She sighed. “I’d like the other shoe to appear, please.” A moment later, her other foot was covered. “Back to business. Did you return so that I’d kiss you again?”</p><p>“No!”</p><p>“Too bad. I wanted to taste you again. I wanted to touch you again. Maybe let you touch me this time. I’ve been aching since you left me. Had to bring myself to climax twice just to cool the fever. But don’t worry, I imagined it was you. I imagined stripping you, licking you, sucking you into my mouth. Mmm, I’m so—”</p><p>“Stop!” he croaked out, spinning to face her. “Stop.”</p><p>His eyes, which she’d once thought were black and emotionless, were now bright as a morning sky, his pupils blown with the intensity of his desire. But rather than stalk to her, grab her and smash his body into hers, he held out his hand, fingers splayed. A fiery sword formed from the air, yellow-gold flames flickering all around it.</p><p>“Stop,” he commanded again. “I do not want to hurt you, but I will if you persist with this foolishness.”</p><p>That layer of truth had returned to his voice.</p><p>Far from intimidating her, his forcefulness excited her. I thought you didn’t like his Neanderthal tendencies.</p><p>Oh, shut up.</p><p>Bianka leaned back, resting her weight against her elbows. “Does Lysandy like to play rough? Should I be wearing black leather? Or is this a game of bad cop, naughty criminal? Should I strip for my body-cavity search?”</p><p>He stalked to the edge of the bed, his thick legs encasing her smaller ones, pressing her knees together. He was hard as a rock, his robe jutting forward. Those golden flames still flickering around the sword both highlighted his face and cast shadows, giving him a menacing aura.</p><p>Just then, he was both angel and demon. A mix of good and evil. Savior and executioner.</p><p>Her wings fluttered frantically, readying for battle—even as her skin tingled for pleasure. She could be across the room before he moved even a fraction of an inch. Still. She had trouble catching her breath; it was like ice in her lungs. And yet her blood was hot as his sword. This mix of emotions was odd.</p><p>“You are worse than I anticipated,” he snarled.</p><p>If this progressed the way she hoped, he would be very happy about that one day. But she said, “Then let me go. You’ll never have to see me again.”</p><p>“And that will purge you from my mind? That will stop the wondering and the craving? No, it will only make them worse. You will give yourself to others, kiss them the way you kissed me, rub against them the way you rubbed against me, and I will want to kill them when they will have done nothing wrong.”</p><p>What a confession! And she’d thought her blood hot before...“Then take me,” she suggested huskily. She traced her tongue over her lips, slow and measured. His gaze followed. “It’ll feel sooo good, I promise.”</p><p>“And discover if you are as soft and wet as you appear? Spend the rest of eternity in bed with you, a slave to my body? No, that, too, will only make my cravings worse.”</p><p>Oh, angel. You shouldn’t have admitted that. A slave to his body? If that was his fear, he more than craved her. He was falling. Hard. And now that she knew how much he wanted her...he was as good as hers. “If you’re going to kill me,” she said, swirling a fingertip around her navel, “kill me with pleasure.”</p><p>He stopped breathing.</p><p>She sat up, closing the rest of the distance between them. Still he didn’t strike. She flattened her palms on his chest. His nipples were as beaded as hers. He closed his eyes, as if the sight of her, looking up at him through the thick shield of her lashes, was too much to bear.</p><p>“I’ll let you in on a little secret,” she whispered. “I’m softer and wetter than I appear.”</p><p>Was that a moan?</p><p>And if so, had it come from him? Or her? Touching him like this was affecting her, too. All this strength at her fingertips was heady. Knowing this gorgeous warrior wanted her—her, and no other—was even headier. But knowing she was the very first to tempt him, and so strongly, was the ultimate aphrodisiac.</p><p>“Bianka.” Oh, yes. A moan.</p><p>“But if you’d like, we can just lie next to each other.” Said the spider to the fly. “We don’t have to touch. We don’t have to kiss. We’ll lie there and think about all the things we dislike about each other and maybe build up an immunity. Maybe we’ll stop wanting to touch and to kiss.”</p><p>Never had she told such a blatant lie, and she’d told some big ones over the centuries. Part of her expected him to call her on it. The other part of her expected him to grasp on to the silly suggestion like a lifeline. Use it as an excuse to finally take what he wanted. Because if he did this, simply lay next to her, one temptation would lead to another. He wouldn’t be thinking about the things he disliked about her—he would be thinking about the things he could be doing to her body. He would feel her heat, smell her arousal. He’d want—need—more from her. And she’d be right there, ready and willing to give it to him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She fisted his robe and gently tugged him toward her. “It’s worth a try, don’t you think? Anything’s worth a try to make this madness stop.”</p><p>When they were nose to nose, his breath trickling over her face, his gaze fastened on her lips, she began to ease backward. He followed, offering no resistance.</p><p>“Want to know one of the things I dislike about you?” she asked softly. “You know, to help get us started.”</p> <p>He nodded, as if he were too entranced to speak.</p><p>She decided to push a little faster than anticipated. He already seemed ready for more. “That you’re not on top of me.” Just a little more persuasion, and that would be remedied. Just a little...“How amazing would it feel to be that close?”</p><p>“Lysander,” an unfamiliar female voice suddenly called. “Are you here?”</p><p>Who the hell? Bianka scowled.</p><p>Lysander straightened, jerking away from her as if she had just sprouted horns. He stepped back, disengaging from her completely. But he was trembling, and not from anger.</p> <p>“Ignore her,” she said. “We have important business to attend to.”</p><p>“Lysander?” the woman called again.</p><p>Damn her, whoever she was!</p><p>His expression cleared, melted to steel. “Not another word from you,” he barked, backing away. “You tried to lure me into bed with you. I don’t think you meant to make me dislike you at all. I think you meant to—” A low snarl erupted from his throat. “You are not to try such a thing with me again. If you do, I will finally cleave your head from your body.”</p><p>Well, this battle was clearly over. Not one to give up, however, she tried a different strategy. “So you’re going to leave again? Coward! Well, go ahead. Leave me helpless and bored. But you know what? When I’m bored, bad things happen. And next time you come back here, I just might throw myself at you. My hands will be all over you. You won’t be able to pry me off!”</p><p>“Lysander,” the girl called again.</p> <p>He ground his teeth. “Return to your cloud,” he threw over his shoulder. “I will meet you there.”</p><p>He was going to meet another girl? At her cloud? Alone, private? Oh, hell, no. Bianka hadn’t worked him into a frenzy so that someone else could reap the reward.</p><p>Before she could inform him of that, however, he said, “Give Bianka whatever she wants.” Talking to his own cloud, apparently. “Anything but escape and more of those...outfits.” His gaze intensified on her. “That should stave off the boredom. But I only agree to this on the condition that you vow to keep your hands to yourself.”</p><p>Anything she wanted? She didn’t allow herself to grin, the girl forgotten in the face of this victory. “Done.”</p><p>“And so it is,” he said, then spun and stalked from the room. His wings expanded in a rush, and he disappeared before she could follow. But then, there was no need to follow him. Not now.</p><p>He had no idea that he’d just ensured his own downfall. Whatever she wants, he’d said. She laughed. She didn’t need to touch him or wear lingerie to win their next battle. She just needed his return.</p><p>Because then, he would become her prisoner.</p><p>CHAPTER FIVE</p> <p>HE’D ALMOST GIVEN IN.</p><p>Lysander could not believe how quickly he’d almost given in to Bianka. One sultry glance from her, one invitation, and he’d forgotten his purpose. It was shameful. And yet, it was not shame that he felt. It was more of that strange disappointment—disappointment that he’d been interrupted!Standing before Bianka, breathing in her wicked scent, feeling the heat of her body, all he’d been able to recall was the decadent taste of her. He’d wanted more. Wanted to finally touch her skin. Skin that had glowed with health, reflecting all those rainbow shards. She’d wanted that, too, he was sure of it. The more aroused she’d become, the brighter those colors had glowed.</p><p>Unless that was a trick? What did he truly know of women and desire?</p><p>She was worse than a demon, he thought. She’d known exactly how to entrance him. Those naked photos had nearly dropped him to his knees. Never had he seen anything so lovely. Her breasts, high and plump. Her stomach, flat. Her navel, perfectly dipped. Her thighs, firm and smooth. Then, being asked to lie beside her and think of what he disliked about her...both had been temptations, and both had been irresistible.</p><p>He’d known his resolve was crumbling and had wanted to rebuild it. And how better to rebuild than to ponder all the things he disliked about the woman? But if he had lain next to her, he would not have thought of what he disliked—things he couldn’t seem to recall then or now. He might have even thought about what he liked about her.</p><p>She was brilliant. She’d had him.</p><p>He’d never desired a demon. Had never secretly liked bad behavior. Yet Bianka excited him in a way he could not have predicted. So, what did he like most about her at the moment? That she was willing to do anything, say anything, to tempt him. He liked that she had no inhibitions. He liked that she gazed up at him with longing in those beautiful eyes.</p><p>How would she look at him if he actually kissed her again? Kissed more than her mouth? How would she look at him if he actually touched her? Caressed that skin? He suddenly found himself wanting to watch mortals and immortals alike more intently, gauging their reactions to each other. Man and woman, desire to desire.</p><p>Just the thought of doing so caused his body to react the way it had done with Bianka. Hardening, tightening. Burning, craving. His eyes widened. That, too, had never happened before. He was letting her win, he realized, even though there was distance between them. He was letting his one temptation destroy him, bit by bit.</p><p>Something had to be done about Bianka, since his current plan was clearly failing.</p><p>“Lysander?”</p><p>His charge’s voice drew him from his dark musings. “Yes, sweet?”</p><p>Olivia’s head tilted to the side, her burnished curls bouncing. They stood inside her cloud, flowers of every kind scattered across the floor, on the walls, even dripping from the ceiling.</p><p>Her eyes, as blue as the sky, regarded him intently. “You haven’t been listening to me, have you?”</p><p>“No,” he admitted. Truth had always been his most cherished companion. That would not change now. “My apologies.”</p><p>“You are forgiven,” she said with a grin as sweet as her flowers.</p><p>With her, it was that easy. Always. No matter how big or small the crime, Olivia couldn’t hold a grudge. Perhaps that was why she was so treasured among their people. Everyone loved her.</p><p>What would other angels think of Bianka?</p><p>No doubt they would be horrified by her. He was horrified.</p><p>I thought you were not going to lie? Even to yourself. He scowled. Unlike the forgiving Olivia, he suspected Bianka would hold a grudge for a lifetime—and somehow take that grudge beyond the grave.</p><p>For some reason, his scowl faded and his lips twitched at the thought. Why would that amuse him? Grudges were born of anger, and anger was an ugly thing. Except, perhaps, on Bianka. Would she erupt with the same amount of unrelenting passion she brought to the bedroom? Probably. Would she want to be kissed from her anger, as well?</p><p>The thought of kissing her until she was happy again did not delight him.</p><p>Usually he dealt with other people’s anger the way he dealt with everything else. With total unconcern. It was not his job to make people feel a certain way. They were responsible for their own emotions, just as he was responsible for his. Not that he experienced many. Over the years, he’d simply seen too much to be bothered. Until Bianka.</p><p>“Lysander?”</p><p>Olivia’s voice once more jerked him from his mind. His hands fisted. He’d locked Bianka away, yet she was still managing to change him. Oh, yes. His current plan was failing.</p><p>Why couldn’t he have desired someone like sweet Olivia? It would have made his endless life much easier. As he’d told Bianka, desire wasn’t forbidden, but not many of their kind ever experienced it. Those that did only wanted other angels and often wed their chosen partner. Except in storybooks, he had never heard of an angel pairing with a different race—much less a demon.</p><p>“—you go again,” Olivia said.</p><p>He blinked, hands fisting all the tighter. “Again, I apologize. I will be more diligent the rest of our conversation.” He would make sure of it.</p><p>She offered him another grin, though this one lacked her usual ease. “I only asked what was bothering you.” She folded her wings around herself and plucked at the feathers, carefully avoiding the strands of gold. “You’re so unlike yourself.”</p><p>That made two of them. Something was troubling her; sadness had never layered her voice before, yet now it did. Determined to help her, he summoned two chairs, one for him and one for her, and they sat across from each other. Her robe plumed around her as she released her wings and twined her fingers together in her lap. Leaning forward, he rested his weight on his elbows.</p><p>“Let us talk about you first. How goes your mission?” he asked. Only that could be the cause. Olivia found joy in all things. That’s why she was so good at her job. Or rather, her former job. Because of him, she was now something she didn’t want to be. A warrior angel. But it was for the best, and he did not regret the decision to change her station. Like him, she’d become too fascinated with someone she shouldn’t.</p><p>Better to end that now, before the fascination ruined her.</p><p>She licked her lips and looked away from him. “That’s actually what I wanted to speak with you about.” A tremor shook her. “I don’t think I can do it, Lysander.” The words emerged as a tortured whisper. “I don’t think I can kill Aeron.”</p><p>“Why?” he asked, though he knew what she would say. But unlike Bianka, Aeron had broken a heavenly law, so there could be no locking him away and leading him to a righteous path.</p><p>If Olivia failed to destroy the demon-possessed male, another angel would be tasked with doing so—and Olivia would be punished for her refusal. She would be cast out of the heavens, her immortality stripped, her wings ripped from her back. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He hasn’t hurt anyone since his blood-curse was removed,” she said, and he heard the underlying beseeching.</p><p>“He helped one of Lucifer’s minions escape hell.”</p><p>“Her name is Legion. And yes, Aeron did that. But he ensures the little demon stays away from most humans. Those she does interact with, she treats with kindness. Well, her version of kindness.”</p> <p>“That doesn’t change the fact that Aeron helped the creature escape.”</p><p>Olivia’s shoulders sagged, though she in no way appeared defeated. Determination gleamed in her eyes. “I know. But he’s so...nice.”</p><p>Lysander barked out a laugh. He just couldn’t help himself. “We are speaking of a Lord of the Underworld, yes? The one whose entire body is tattooed with violent, bloody images no less? That is the male you call nice?”</p><p>“Not all of the etchings are violent,” she mumbled, offended for some reason. “Two are butterflies.”</p><p>For her to have found the butterflies amid the skeletal faces decorating the man’s body meant she’d studied him intently. Lysander sighed. “Have you...felt anything for him?” Physically?</p> <p>“What do you mean?” she asked, but rosy color bloomed on her cheeks.</p><p>She had, then. “Never mind.” He scrubbed a hand down his suddenly tired face. “Do you like your home, Olivia?”</p><p>She blanched at that, as if she knew the direction he was headed. “Of course.”</p><p>“Do you like your wings? Do you like your lack of pain, no matter the injury sustained? Do you like the robe you wear? A robe that cleans itself and you?”</p><p>“Yes,” she replied softly. She gazed down at her hands. “You know I do.”</p><p>“And you know that you will lose all of that and more if you fail to do your duty.” The words were harsh, meant for himself as much as for her.</p> <p>Tears sprang into her eyes. “I just hoped you could convince the council to rescind their order to execute him.”</p><p>“I will not even try.” Honest, he reminded himself. He had to be honest. Which he preferred. Or had. “Rules are put into place for a reason, whether we agree with those reasons or not. I have been around a long time, have seen the world—ours, theirs—plunged into darkness and chaos. And do you know what? That darkness and chaos always sprang from one broken rule. Just one. Because when one is broken, another soon follows. Then another. It becomes a vicious cycle.”</p><p>A moment passed as she absorbed his words. Then she sighed, nodded. “Very well.” Words of acceptance uttered in a tone that was anything but.</p><p>“You will do your duty?” What he was really asking: Will you slay Aeron, keeper of Wrath, whether you want to or not? Lysander wasn’t asking more of her than he had done himself. He wasn’t asking what he wouldn’t do himself.</p><p>Another nod. One of those tears slid down her cheek.</p><p>He reached out and captured the glistening drop with the tip of his finger. “Your compassion is admirable, but it will destroy you if you allow it so much power over you.”</p><p>She waved the prediction away. Perhaps because she did not believe it, or perhaps because she believed it but had no plans to change and therefore didn’t want to discuss it anymore. “So who was the woman in your home? The one in the portraits?”</p><p>He...blushed? Yes, that was the heat spreading over his cheeks. “My...” How should he explain Bianka? How could he, without lying?</p> <p>“Lover?” she finished for him.</p><p>His cheeks flushed with more of that heat. “No.” Maybe. No! “She is my captive.” There. Truthful without giving away any details. “And now,” he said, standing. If she could end a subject, so could he. “I must return to her before she causes any more trouble.” He must deal with her. Once and for all.</p><p>OLIVIA REMAINED IN PLACE long after Lysander left. Had that blushing, uncertain, distracted man truly been her mentor? She’d known him for centuries, and he’d always been unflappable. Even in the heat of battle.</p><p>The woman was responsible, she was sure. Lysander had never kept one in his cloud before. Did he feel for her what Olivia felt for Aeron?Aeron.</p><p>Just thinking his name sent a shiver down her spine, filling her with a need to see him. And just like that, she was on her feet, her wings outstretched.</p><p>“I wish to leave,” she said, and the floor softened, turning to mist. Down she fell, wings flapping gracefully. She was careful to avoid eye contact with the other angels flying through the sky as she headed into Budapest. They knew her destination; they even knew what she did there.</p><p>Some watched her with pity, some with concern—as Lysander had. Some watched her with antipathy. By avoiding their gazes, she ensured no one would stop her and try and talk sense into her. She ensured she wouldn’t have to lie. Something she hated to do. Lies tasted disgustingly bitter.</p><p>Long ago, during her training, Lysander had commanded her to tell a lie. She would never forget the vile flood of acid in her mouth the moment she’d obeyed. Never again did she wish to experience such a thing. But to be with Aeron...maybe.</p><p>His dark, menacing fortress was perched high on a mountain and finally came into view. Her heart rate increased exponentially. Because she existed on another plane, she was able to drift through the stone walls as if they were not even there. Soon she was standing inside Aeron’s bedroom.</p><p>He was polishing a gun. His little demon friend, Legion, the one he’d helped escape from hell, was darting and writhing around him, a pink boa twirling with her.</p><p>“Dance with me,” the creature beseeched.</p><p>That was dancing? That kind of heaving was what humans did as they were dying.</p><p>“I can’t. I’ve got to patrol the town tonight, searching for Hunters.”</p><p>Hunters, sworn enemy of the Lords. They hoped to find Pandora’s box and draw the demons out of the immortal warriors, killing each man. The Lords, in turn, hoped to find Pandora’s box and destroy it—the same way they hoped to destroy the Hunters.</p><p>“Me hate Huntersss,” Legion said, “but we needsss practice for Doubtie’sss wedding.”</p><p>“I won’t be dancing at Sabin’s wedding, therefore practice isn’t necessary.”</p><p>Legion stilled, frowned. “But we dance at the wedding. Like a couple.” Her thin lips curved downward. Was she...pouting? “Pleassse. We ssstill got time to practice. Dark not come for hoursss.”</p><p>“As soon as I finish cleaning my weapons, I have to run an errand for Paris.” Paris, Olivia knew, was keeper of Promiscuity and had to bed a new woman every day or he would weaken and die. But Paris was depressed and not taking proper care of himself, so Aeron, who felt responsible for the warrior, procured females for him. “We’ll dance another time, I promise.” Aeron didn’t glance up from his task. “But we’ll do it here, in the privacy of my room.”</p><p>I want to dance with him, too, Olivia thought. What was it like, pressing your body against someone else’s? Someone strong and hot and sinfully beautiful?</p><p>“But, Aeron...”</p><p>“I’m sorry, sweetheart. I do these things because they’re necessary to keep you safe.”</p><p>Olivia tucked her wings into her back. Aeron needed to take time for himself. He was always on the go, fighting Hunters, traveling the world in search of Pandora’s box and aiding his friends. As much as she watched him, she knew he rarely rested and never did anything simply for the joy of it.</p><p>She reached out, meaning to ghost a hand through Aeron’s hair. But suddenly the scaled, fanged creature screeched, “No, no, no,” clearly sensing Olivia’s presence. In a blink, Legion was gone.</p><p>Stiffening, Aeron growled low in his throat. “I told you not to return.”</p><p>Though he couldn’t see Olivia, he, too, always seemed to know when she arrived. And he hated her for scaring his friend away. But she couldn’t help it. Angels were demon assassins and the minion must sense the menace in her.</p><p>“Leave,” he commanded.</p><p>“No,” she replied, but he couldn’t hear her.</p><p>He returned the clip to his weapon and set it beside his bed. Scowling, he stood. His violet eyes narrowed as he searched the bedroom for any hint of her. Sadly, it was a hint he would never find.</p><p>Olivia studied him. His hair was cropped to his scalp, dark little spikes barely visible. He was so tall he dwarfed her, his shoulders so wide they could have enveloped her. With the tattoos decorating his skin, he was the fiercest creature she’d ever beheld. Maybe that was why he drew her so intensely. He was passion and danger, willing to do anything to save the ones he loved.</p><p>Most immortals put their own needs above everyone else’s. Aeron put everyone else’s above his own. That he did so never failed to shock her. And she was supposed to destroy him? She was supposed to end his life?</p><p>“I’m told you’re an angel,” he said.</p><p>How had he known what—the demon, she realized. Legion might not be able to see her, either, but as she’d already realized, the little demon knew danger when she encountered it. Plus, whenever Legion left him, she returned to hell. Fiery walls that could no longer confine her but could welcome her any time she wished. Olivia’s lack of success had to be a great source of amusement to that region’s inhabitants.</p><p>“If you are an angel, you should know that won’t stop me from cutting you down if you dare try and harm Legion.”</p><p>Once again, he was thinking of another’s welfare rather than his own. He didn’t know that Olivia didn’t need to bother with Legion. That once Aeron was dead, Legion’s bond to him would wither and she would again be chained to hell.</p><p>Olivia closed the distance between them, her steps tentative. She stopped only when she was a whisper away. His nostrils flared as if he knew what she’d done, but he didn’t move. Wishful thinking on her part, she knew. Unless she fell, he would never see her, never smell her, never hear her.</p><p>She reached up and cupped his jaw with her hands. How she wished she could feel him. Unlike Lysander, who was of the Elite, she could not materialize into this plane. Only her weapon would. A weapon she would forge from air, its heavenly flames far hotter than those in hell. A weapon that would remove Aeron’s head from his body in a mere blink of time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m told you’re female,” he added, his tone hard, harsh. As always. “But that won’t stop me from cutting you down, either. Because, and here’s something you need to know, when I want something, I don’t let anything stand in the way of my getting it.”</p><p>Olivia shivered, but not for the reasons Aeron probably hoped. Such determination...</p><p>I should leave before I aggravate him even more. With a sigh, she spread her wings and leapt, out of the fortress and into the sky.</p> <p>CHAPTER SIX</p><p>“YOU, CLOUD, BELONG TO ME,” Bianka said. That was not an attempt to escape, nor another sexy outfit, therefore it was acceptable. “Lysander gave you to me, so as long as I don’t touch him, I get what I want. And I want you. I want you to obey me, not him. Therefore, you have to heed my commands rather than his. If I tell you to do something and he tells you not to, you still have to do it. That’s what I want.”</p><p>And oh, baby, this was going to be fun.The more she thought about it, the happier she was that she couldn’t touch Lysander again. Really. Seducing—or rather, trying to seduce—him had been a mistake. She’d basically ended up seducing herself. His heat...his scent...his strength...Give. Me. More.</p><p>Now, all she could think about was getting his weight back on top of her. About how she wanted to teach him where she liked to be touched. Once he’d gotten the hang of kissing, he’d teased and tantalized her mouth with the skill of a master. It would be the same with lovemaking.</p><p>She would lick each and every one of his muscles. She would hear him moan over and over again as he licked her.</p> <p>How could she want those things from her enemy? How could she forget, even for a moment, how he’d locked her away? Maybe because he was a challenge. A sexy, tempting, frustrating challenge.</p><p>Didn’t matter, though. She was done playing the role of sweet, horny prisoner. She still couldn’t kill him; she’d be stuck here for eternity. Which meant she’d have to make him want to get rid of her. And now, as master of this cloud, she would have no problem doing so.</p><p>She could hardly wait to begin. If he stuck to past behavior, he’d be gone for a week. He’d return to “check on” her. Operation Cry Like A Baby could begin. Tomorrow she’d plan the specifics and set the stage. A few ideas were already percolating. Like tying him to a chair in front of a stripper pole. Like enforcing Naked Tuesdays.</p><p>Chuckling, she propped herself against the bed’s headboard, yawned and closed her eyes.</p><p>“I’d like to hold a bowl of Lysander’s grapes,” she said, and felt a cool porcelain bowl instantly press atop her stomach. Without opening her eyes, she popped one of the fruits into her mouth, chewed. Gods, she was tired. She hadn’t rested properly since she’d gotten here—or even before.</p><p>She couldn’t. There were no trees to climb, no leaves to hide in. And even if she summoned one, Lysander could easily find her if he returned early—</p> <p>Wait. No. No, he wouldn’t. Not if she summoned hundreds of them. And if he dismissed all the trees, she would fall, which would awaken her. He would not be able to take her unaware.</p><p>Chuckling again, Bianka pried her eyelids apart. She polished off the grapes, scooted from the bed and stood. “Replace the furniture with trees. Hundreds of big, thick, green trees.”</p><p>In the snap of her fingers, the cloud resembled a forest. Ivy twined around stumps and dew dripped from leaves. Flowers of every color bloomed, petals floating from them and dancing to the ground. She gaped at the beauty. Nothing on earth compared.</p><p>If only her sisters could see this.</p><p>Her sisters. Winning a game or not, she missed them more with every second that passed. Lysander would pay for that, too.</p><p>She yawned again. When she attempted to climb the nearest oak, her lingerie snagged on the bark. She straightened, scowled—reminded once again of the way her dark angel had stalked to her, leaned into her, hot breath trekking over her skin.</p><p>“I want to wear a camo tank and army fatigues.” The moment she was dressed, she scaled to the highest bough, fluttering wings giving her speed and agility, and reclined on a fat branch, peering up into a lovely star-sprinkled sky. “I’d like a bottle of Lysander’s wine, please.”</p><p>Her fingers were clutching a flagon of dry red a second later. She would have preferred a cheap white, but whatever. Hard times called for sacrifices, and she drained the bottle in record time.</p> <p>Just as she summoned a second, she heard Lysander shout, “Bianka!”</p><p>She blinked in confusion. Either she’d been up here longer than she’d thought or she was hallucinating.</p><p>Why couldn’t she have imagined a Lord of the Underworld? she wondered disgustedly. Oh, oh. How cool would it be if Lysander oil-wrestled a Lord? They’d be wearing loincloths, of course, and smiles. But nothing else.</p><p>And she could totally have that! This was her cloud, after all. She and Lysander were now playing by her rules. And, because she was in charge, he couldn’t rescind his command that she be obeyed without her permission.</p><p>At least, she prayed that was the way this would work.</p><p>“Remove the trees,” she heard him snap.</p><p>She waited, unable to breathe, but the trees remained. He couldn’t! Grinning, she jolted upright and clapped. She’d been right, then. This cloud belonged to her.</p><p>“Remove. The. Trees.”</p><p>Again, they remained.</p><p>“Bianka!” he snarled. “Show yourself.”</p><p>Anticipation flooded her as she jumped down. A quick scan of her surroundings revealed that he wasn’t nearby. “Take me to him.”</p><p>She blinked and found herself standing in front of him. He’d been shoving his way through the foliage and when he spotted her, he stopped. He clutched that sword of fire.</p><p>She backed away, remaining out of reach. No touching. She wouldn’t forget. “That for me?” she asked, motioning to the weapon with a tilt of her chin. She’d never been so excited in her life and even the sight of that weapon didn’t dampen the emotion.</p><p>A vein bulged in his temples.</p><p>She’d take that for a yes. “Naughty boy.” He’d come to kill her, she thought, swaying a little. That was something else to punish him for. “You’re back early.”</p><p>His gaze raked her newest outfit, his pupils dilated and his nostrils flared. His mouth, however, curled in distaste. “And you are drunk.”</p><p>“How dare you accuse me of such a thing!” She tried for a harsh expression, but ruined it when she laughed. “I’m just tipsy.”</p><p>“What did you do to my cloud?” He crossed his arms over his chest, the picture of stubborn male. “Why won’t the trees disappear?”</p><p>“First, you’re wrong. This is no longer your cloud. Second, the trees will only leave if I tell them to leave. Which I am. Leave, pretty trees, leave.” Another laugh. “Oh my gods. I said leave to a tree. I’m a poet and I didn’t know it.” Instantly, there was nothing surrounding her and Lysander but glorious white mist. “Third, you’re not going anywhere without my permission. Did you hear that, cloud? He stays. Fourth, you’re wearing too many clothes. I want you in a loincloth, minus the weapon.”</p><p>His sword was suddenly gone. His eyes widened as his robe disappeared and a flesh-colored loincloth appeared. Bianka tried not to gape. And she’d thought the forest gorgeous. Wow. Just...wow. His body was a work of art. He possessed more muscles than she’d realized. His biceps were perfectly proportioned. Rope after rope lined his stomach. And his thighs were ridged, his skin sun-kissed.</p><p>“This cloud is mine, and I demand the return of my robe.” His voice was so low, so harsh, it scraped against her eardrums.</p><p>The sweet sound of victory, she thought. He remained exactly as she’d requested. Laughing, she twirled, arms splayed wide. “Isn’t this fabulous?”</p><p>He stalked toward her, menace in every step.</p><p>“No, no, no.” She danced out of reach. “We can’t have that. I want you in a large tub of oil.”</p><p>And just like that, he was trapped inside a tub. Clear oil rose to his calves, and he stared down in horror.</p><p>“How do you like having your will overlooked?” she taunted.</p><p>His gaze lifted, met hers, narrowed. “I will not fight you in this.”</p><p>“Silly man. Of course you won’t. You’ll fight...” She tapped her chin with a fingernail. “Let’s see, let’s see. Amun? No. He won’t speak and I’d like to hear some cursing. Strider? As keeper of Defeat, he’d ensure you lost to prevent himself from feeling pain, but that would be an intense battle and I’m just wanting something to amuse me. You know, something light and sexy. I mean, since I can’t touch you, I want a Lord to do it for me.”</p><p>Lysander popped his jaw. “Do not do this, Bianka. You will not like the consequences.”</p><p>“Now that’s just sad,” she said. “I’ve been here two weeks, but you don’t know me at all. Of course I’ll like the consequences.” Torin, keeper of Disease? Watching him fight Torin would be fun, ’cause then he’d catch that black plague. Or would he? Could angels get sick? She sighed. “Paris will have to do, I guess. He’s handsy, so that works in my favor.”</p><p>“Don’t you dare—”</p><p>“Cloud, place Paris, keeper of Promiscuity, into the tub with Lysander.”</p><p>When Paris appeared a moment later, she clapped. Paris was tall and just as muscled as Lysander. Only he had black hair streaked with brown and gold, his eyes were electric blue and his face perfect enough to make her weep from its beauty. Too bad he didn’t stir her body the way Lysander did. Making out with him in front of the angel would have been fun.</p><p>“Bianka?” Paris looked from her to the angel, the angel to her. “Where am I? Is this some ambrosia-induced hallucination? What the hell is going on?”</p><p>“For one thing, you’re overdressed. You should only be wearing a loincloth like Lysander.”</p><p>His T-shirt and jeans were instantly replaced with said loincloth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Best. Day. Ever. “Paris, I’d like you to meet Lysander, the angel who abducted me and has been holding me prisoner up here in heaven.”</p><p>Instantly Paris morphed from confusion to fury. “Return my weapons and I’ll kill him for you.”</p><p>“You are such a sweetie,” she said, flattening a hand over her heart. “Why is it we haven’t slept together yet?”</p> <p>Lysander snarled low in his throat.</p><p>“What?” she asked him, all innocence. “He wants to save me. You want to subjugate me for the rest of my long life. But anyway, let me finish the introductions. Lysander, I’d like you to meet—”</p><p>“I know who he is. Promiscuity.” Disgust layered Lysander’s voice. “He must bed a new woman every day or he weakens.”</p><p>Another grin lifted the corners of her lips, this one smug. “Actually, he can bed men, too. His demon’s not picky. I do hope you’ll keep that in mind while you guys are rubbing up against each other.”</p><p>Lysander took a menacing step toward her.</p> <p>“What’s going on?” Paris demanded again, glowering now. Bianka knew he was picky even if his demon wasn’t.</p><p>“Oh, didn’t I tell you? Lysander gave me control of his home, so now I get whatever I want and I want you guys to wrestle. And when you’re done, you’ll find Kaia and tell her what’s happened, that I’m trapped with a stubborn angel and can’t leave. Well, I can’t leave until he gets so sick of me he allows the cloud to release me.”</p><p>“Or until I kill you,” he snapped.</p><p>She laughed. “Or until Paris kills you. But I hope you guys will play nice for a little while, at least. Do you have any idea how sexy you both are right now? And if you want to kiss or something while rolling around, don’t let me stop you.”</p><p>“Uh, Bianka,” Paris began, beginning to look uncomfortable. “Kaia’s in Budapest. She’s helping Gwen with the wedding, and thinks you’re hiding to get out of your maid of honor duties.”</p><p>“I am not maid of honor, damn it!” But at least Kaia wasn’t worried. The bitch, she thought with affection.</p> <p>“That’s not what she says. Anyway, I don’t mind fighting another dude to amuse you, but seriously, he’s an angel. I need to return to—”</p><p>“No need to thank me.” She held out her hands. “A bowl of Lysander’s popcorn, please.” The bowl appeared, the scent of butter wafting to her nose. “Now then. Let’s get this party started. Ding, ding,” she said, and settled down to watch the battle.</p><p>CHAPTER SEVEN</p><p>LYSANDER COULD NOT BELIEVE what he was being forced to do. He was angry, horrified and, yes, contrite. Hadn’t he done something similar to Bianka? Granted, he hadn’t stripped her down. Hadn’t pitted her against another female.</p><p>There was the tightening in his groin again.What was wrong with him?</p><p>“I will set you free,” he told Bianka. And sweet Holy Deity, she looked beautiful. More tempting than when she’d worn that little bit of nothing. Now she wore a green and black tank that bared her golden arms. Were those arms as soft as they appeared? Don’t think like that. Her shirt stopped just above her navel, making his mouth water, his tongue yearn to dip inside. What did I just say? Don’t think like that. Her pants were the same dark shades and hung low on her hips.</p><p>He’d come here to fight her, to finally force her hand, and judging by that outfit, she’d been ready for combat. That...excited him. Not because their bodies would have been in close proximity—really—and not because he could have finally gotten his hands on her—again, really—but because, if she injured him, he would have the right to end her life. Finally.</p><p>But he’d come here and she’d taught him a quick yet unforgettable lesson instead. He’d been wrong to whisk her to his home and hold her captive. Temptation or not. She might be his enemy in ways she didn’t understand, but he never should have put his will above hers. He should have allowed her to live her life as she saw fit.</p> <p>That’s why he existed in the first place. To protect free will.</p><p>When this wrestling match ended, he would free her as he’d promised. He would watch her, though. Closely. And when she made a mistake, he would strike her down. And she would. Make a mistake, that is. As a Harpy, she wouldn’t be able to help herself. He wished it hadn’t come to that. He wished she could have been happy here with him, learning his ways.</p><p>The thought of losing her did not sadden him. He would not miss her. She’d placed him in a vat of oil to wrestle with another man, for Lord’s sake.</p><p>There was suddenly a bitter taste in his mouth.</p><p>“Bianka,” he prompted. “Have you no response?”</p><p>“Yes, you will set me free,” she finally said with a radiant grin. She twirled a strand of that dark-as-night hair around her finger. “After. Now, I do believe I rang the starting bell.”</p><p>Her words were slightly slurred from the wine she’d consumed. A drunken menace, that’s what she was. And he would not miss her, he told himself again.</p><p>The bitterness intensified.</p><p>A hard weight slammed into him and sent him propelling to his back. His wings caught on the sides of the pool as oil washed over him from head to toe, weighing him down. He grunted, and some of the stuff—cherry-flavored—seeped into his mouth.</p><p>“Don’t forget to use tongue if you kiss,” Bianka called helpfully.</p><p>“You don’t lock women away,” Paris growled down at him, a flash of scales suddenly visible under his skin. Eyes red and bright. Demon eyes. “No matter how irritating they are.”</p><p>“Your friends did something similar to their women, did they not? Besides, the girl isn’t your concern.” Lysander shoved, sending the warrior hurtling to his back. He attempted to use his wings to lift himself, but their movements were slow and sluggish so all he could do was stand.</p><p>Oil dripped down his face, momentarily shielding his vision. Paris shot to his feet, as well, hands fisted, body glistening.</p><p>“So. Much. Fun,” Bianka sang happily.</p><p>“Enough,” Lysander told her. “This is unnecessary. You have made your point. I’m willing to set you free.”</p><p>“You’re right,” she said. “It’s unnecessary to fight without music!” Once again she tapped her chin with a nail, expression thoughtful. “I know! We need some Lady Gaga in this crib.”</p><p>A song Lysander had never heard before was playing through the cloud a second later. Like a siren rising from the sea, Bianka began swaying her hips seductively.</p><p>Lysander’s jaw clenched so painfully the bones would probably snap out of place at any moment. Clearly there would be no reasoning with Bianka. That meant he had to reason with Paris. But who would ever have thought he’d have to bargain with a demon?</p><p>“Paris,” he began—just as a fist connected with his face.</p><p>His head whipped back. His feet slipped on the slick floor and he tumbled to his side. More of the cherry flavor filled his mouth.</p><p>Paris straddled his shoulders, punched him again. Lysander’s lip split. Before a single drop of blood could form, however, the wound healed.</p><p>He frowned. He now had the right to slay the man, but he couldn’t bring himself to do it. He did not blame Paris for this battle; he blamed Bianka. She had forced them into this situation.</p><p>Another punch. “Are you the one who’s been watching Aeron?” Paris demanded.</p><p>“Hey, now,” Bianka called. No longer did she sound so carefree. “Paris, you are not to use your fists. That’s boxing, not wrestling.”</p><p>Lysander remained silent, not understanding the difference. A fight was a fight.</p><p>Another punch. “Are you?” Paris growled.</p><p>“Paris! Did you hear me?” Now she sounded angry. “Use your fists like that again and I’ll cut off your head.”</p><p>She’d do it, too, Lysander thought, and wondered why she was so upset. Could she, perhaps, care for his health? His eyes widened. Was that why she preferred the less intensive wrestling to the more violent boxing? Would she want to do the same to him if he were to punch the Lord? And what would it mean if she did?</p><p>How would he feel about that?</p><p>“Are you?” Paris repeated.</p><p>“No,” he finally said. “I’m not.” He worked his legs up, planted his feet on Paris’s chest and pressed. But rather than send the warrior flying, his foot slipped and connected with Paris’s jaw, then ear, knocking the man’s head back.</p><p>“Use your hands, angel,” Bianka suggested. “Choke him! He deserves it for breaking my rules.”</p><p>“Bianka,” Paris snapped. He lost his footing and tumbled to his butt. “I thought you wanted me to destroy him, not the other way around.”</p><p>She blinked over at them, brow furrowed. “I do. I just don’t want you to hurt him. That’s my job.”</p><p>Paris tangled a hand through his soaked hair. “Sorry, darling, but if this continues, I’m going to unleash a world of hurt on your frienemy. Nothing you say will be able to stop me. Clearly, he doesn’t have your best interests at heart.”</p><p>Darling? Had the demon-possessed immortal just called Bianka darling? Something dark and dangerous flooded Lysander—mine echoed through his head—and before he realized what he was doing, he was on top of the warrior, a sword of fire in his hand, raised, descending...about to meet flesh.</p><p>A firm hand around his wrist stopped him. Warm, smooth skin. His wild gaze whipped to the side. There was Bianka, inside the tub, oil glistening off her. How fast she’d moved.</p><p>“You can’t kill him,” she said determinedly.</p><p>“Because you want him, too,” he snarled. A statement, not a question. Rage, so much rage. He didn’t know where it was coming from or how to stop the flow.</p><p>She blinked again, as if the thought had never entered her mind, and that, miraculously, cooled his temper. “No. Because then you would be like me and therefore perfect,” she said. “That wouldn’t be fair to the world.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Stop talking and fight, damn you,” Paris commanded. A fist connected with Lysander’s jaw, tossing him to the side and out of Bianka’s reach. He maintained his grip on the sword and even when it dipped into the oil, it didn’t lose a single flame. In fact, the oil heated.</p><p>Great. Now he was hot-tubbing, as the humans would say.</p><p>“What’d you do that for, you big dummy?” Bianka didn’t wait for Paris’s reply but launched herself at him. Rather than scratch him or pull his hair, she punched him. Over and over again. “He wasn’t going to hurt you.”</p> <p>Paris took the beating without retaliating.</p><p>That saved his life.</p><p>Lysander grabbed the Harpy around the waist and hefted her into the hard line of his body. Soaked as they both were, he had a difficult time maintaining his grip. She was panting, arms flailing for the demon-possessed warrior, but she didn’t try to pull away.</p><p>“I’ll teach you to defy me, you rotten piece of shit,” she growled.</p><p>Paris rolled his eyes.</p> <p>“Send him away,” Lysander commanded.</p><p>“Not until after I—”</p><p>He splayed his fingers, spanning much of her waist. He both rejoiced and cursed that he couldn’t feel the texture of Bianka’s skin through the oil. “I want to be alone with you.”</p><p>“You—what?”</p><p>“Alone. With you.”</p><p>With no hesitation, she said, “Go home, Paris. Your work here is done. Thanks for trying to rescue me. That’s the only reason you’re still alive. Oh, and don’t forget to tell my sisters I’m fine.”</p> <p>The sputtering Lord disappeared.</p><p>Lysander released her, and she spun around to face him. She was now grinning.</p><p>“So you want to be alone with me, do you?”</p><p>He ran his tongue over his teeth. “Was that fun for you?”</p><p>“Yes.”</p><p>And she wasn’t ashamed to admit it, he realized. Captivating baggage. “Return the cloud to me and I will take you home.”</p><p>“Wait. What?” Her grin slowly faded. “I thought you wanted to be alone with me.”</p><p>“I do. So that we can conclude our business.”</p> <p>Disappointment, regret, anger and relief played over her features. One step, two, she closed the distance between them. “Well, I’m not giving you the cloud. That would be stupid.”</p><p>“You have my word that once you return it to me, I will take you home. I know you hear the truth in my claim.”</p><p>“Oh.” Her shoulders sagged a little. “So we really would be rid of each other. That’s great, then.”</p><p>Did she still not believe him? Or...No, surely not. “Do you want to stay here?”</p><p>“Of course not!” She sucked her bottom lip into her mouth, and her eyes closed for a moment, an expression of pleasure consuming her features. “Mmm, cherries.”</p><p>Blood...heating...</p><p>Her lashes lifted and her gaze locked on him. Determination replaced all the other emotions, yet her voice dipped sexily. “But I know something that tastes even better.”</p><p>So did he. Her. A tremor slid the length of his spine. “Do not do this, Bianka. You will fail.” He hoped.</p><p>“One kiss,” she beseeched, “and the cloud is yours.”</p><p>His eyes narrowed. Hot, so hot. “You cannot be trusted to keep your word.”</p><p>“That’s true. But I want out of this hellhole, so I’ll keep it this time. Promise.”</p><p>Hold your ground. But that was hard to do while his heart was pounding like a hammer against a nail. “If you wanted out, you would not insist on being kissed.”</p><p>Her gaze narrowed, as well. “It’s not like I’m asking for something you haven’t already given me.”</p><p>“Why do you want it?” He regretted the question immediately. He was prolonging the conversation rather than putting an end to it.</p><p>Her chin lifted. “It’s a goodbye kiss, moron, but never mind. The cloud is yours. I’ll go home and kiss Paris hello. That’ll be more fun, anyway.”</p><p>There would be no kissing Paris! Lysander had his tongue sliding into her mouth before he could convince himself otherwise. His arms even wound around her waist, pulling her closer to him—so close their chests rubbed each time they breathed. Her nipples were hard, deliciously abrading.</p><p>“Out of the oil,” she murmured. “Clean.”</p><p>He was still in the loincloth, but his skin was suddenly free of the oil, his feet on soft yet firm mist. The cloud might belong to him once more, but she could still make reasonable demands.</p><p>Bianka tilted her head and took his possession deeper. Their tongues dueled and rolled and their teeth scraped. Her hands were all over him, no part of him forbidden to her.</p><p>Goodbye, she had said.</p><p>This was it, then. His last chance to touch her skin. To finally know. Yes, he planned to see her again, to watch her from afar, to wait for his chance to rid himself of her permanently, but never again would he allow himself to get this close to her. And he had to know.</p><p>So he did it.</p><p>He glided his hands forward, tracing from her lower back to her stomach. There, he flattened his palms, and her muscles quivered. Dear Deity of Light and Love. She was softer than he’d realized. Softer than anything else he’d ever touched.</p><p>He moaned. Have to touch more. Up he lifted, remaining under her shirt. Warm, smooth, as he’d already known. Still soft, so sweetly soft. Her breasts overflowed, and his mouth watered for a taste of them. Soon, he told himself. Then shook his head. This was it; the last time they would be together. Goodbye, pretty breasts. He kneaded them.</p><p>More soft perfection.</p><p>Trembling now, he reached her collarbone. Her shoulders. She shivered. Still so wonderfully soft. More, more, more, he had to have more. Had to touch all of her.</p><p>“Lysander,” she gasped out. She dropped to her knees, working at the loincloth before he realized what she was doing.</p><p>His shaft sprang free, and his hands settled atop her shoulders to push her away. But once he touched that soft skin, he was once again lost to the sensation. Perfection, this was perfection.</p><p>“Going to kiss you now. A different kind of kiss.” Warm, wet heat settled over the hard length of him. Another moan escaped him. Up, down that wicked mouth rode him. The pleasure...it was too much, not enough, everything and nothing. In that moment, it was necessary to his survival. His every breath hinged on what she would do next. There would be no pushing her away.</p><p>She twirled her tongue over the plump head; her fingers played with his testicles. Soon he was arching his hips, thrusting deep into her mouth. He couldn’t stop moaning, groaning, the gasping breaths leaving him in a constant stream.</p><p>“Bianka,” he growled. “Bianka.”</p><p>“That’s the way, baby. Give Bianka everything.”</p><p>“Yes, yes.” Everything. He would give her everything.</p><p>The sensation was building, his skin tightening, his muscles locking down on his bones. And then something exploded inside him. Something hot and wanton. His entire body jerked. Seed jetted from him, and she swallowed every drop.</p><p>Finally she pulled away from him, but his body wouldn’t stop shaking. His knees were weak, his limbs nearly uncontrollable. That was pleasure, he realized, dazed. That was passion. That was what human men were willing to die to possess. That was what turned normally sane men into slaves. Like I am now. He was Bianka’s slave.</p><p>Fool! You knew this would happen. Fight. It was only as she stood and smiled at him tenderly—and he wanted to tug her into his arms and hold on forever—that a measure of sanity stole back into his mind. Yes. Fight. How could he have allowed her to do that?</p><p>How could he still want her?</p><p>How could he want to do that to her in return?</p><p>How could he ever let her go?</p><p>“Bianka,” he said. He needed a moment to catch his breath. No. He needed to think about what had happened and how they should proceed. No. He tangled a hand in his hair. What should he do?</p><p>“Don’t say anything.” Her smile disappeared as if it had never been. “The cloud is yours.” Her voice trembled with...fear? Couldn’t be. She hadn’t showed a moment of fear since he’d first abducted her. But she even backed away from him. “Now take me home. Please.”</p><p>He opened his mouth to reply. What he would say, he didn’t know. He only knew he did not like seeing her like that.</p><p>“Take me home,” she croaked.</p><p>He’d never gone back on his word, and he wouldn’t start now. He nodded stiffly, grabbed her hand, and flew her back to the ice mountain in Alaska, exactly as he’d found her. Red coat, tall boots. Sensual in a way he hadn’t understood then.</p><p>He maintained his grip on her until the last possible second—until she slipped away from him, taking her warmth and the sweet softness of her skin with her.</p><p>“I don’t want to see you again.” Mist wafted around her as she turned her back on him. “Okay?”</p><p>She...what? After what had happened between them, she was dismissing him? No, a voice roared inside his head. “Behave, and you will not,” he gritted out. A lie? The bitter taste in his mouth had returned.</p><p>“Good.” Without meeting his gaze, she twisted and blew him a kiss as if she hadn’t a care in the world. “I’d say you were an excellent host, but then, you don’t want me to lie, do you?” With that, she strolled away from him, dark hair blowing in the wind.</p><p>CHAPTER EIGHT</p><p>FIRST THING BIANKA DID after bathing, dressing, eating a bag of stolen chips she had hidden in her kitchen, painting her nails, listening to her iPod for half an hour and taking a nap in her secret basement was call Kaia. Not that she had dreaded the call and wanted to put it off or anything. All of those other activities had been necessary. Really.</p><p>Plus, it wasn’t like her sister was worried about her anymore. Paris would already have told her what was going on. But Bianka didn’t want to discuss Lysander. Didn’t even want to think about him and the havoc he was causing her emotions—and her body and her thoughts and her common sense.After making out with him a little, she’d wanted to freaking stay with him, curl up in his arms, make love and sleep. And that was unacceptable. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The moment her sister answered, she said, “No need to throw me a Welcome Home party. I’m not sticking around for long.” Do not ask me about the angel. Do not ask me about the angel.</p><p>“Bianka?” her twin asked groggily.</p><p>“You were expecting someone else to call in the middle of the night?” It was 6:00 a.m. here in Alaska. Having traveled between the two places multiple times since Gwen had gotten involved with Sabin, she knew that meant it was 3:00 a.m. there in Budapest.</p> <p>“Yeah,” Kaia said. “I was.”</p><p>Seriously? “Who?”</p><p>“Lots of people. Gwennie, who has become the ultimate bridezilla. Sabin, who is doing his best to soothe the beast but whines to me like I care.” She rambled on as if Bianka had never been abducted and she’d never been worried. Sure, she’d thought Bianka was merely shirking her duties, but was a little worry too much to ask for? “Anya, who has decided she deserves a wedding, too. Only bigger and better than Gwen’s. William, who wants to sleep with me and doesn’t know how to take no for an answer. He’s not possessed by a demon so he’s not my type. Shall I go on?”</p><p>“Yes.”</p><p>“Shut up.”</p> <p>She imagined Kaia high in a treetop, clutching her cell to her ear, grinning and trying not to fall. “So really, you were sleeping? While I was missing, my life in terrible danger? Some loving sister you are.”</p><p>“Please. You were on vacay, and we both know it. So don’t give me a hard time. I had an...exciting day.”</p><p>“Doing who?” she asked dryly. Only two weeks had passed since she’d last seen Kaia, but suddenly a wave of homesickness—or rather, sistersickness—flooded her. She loved this woman more than she loved herself. And that was a lot!</p><p>Kaia chuckled. “I wish it was because of a who. I’m waiting for two of the Lords to fight over me. Then I’ll comfort them both. So far, no luck.”</p><p>“Idiots.”</p><p>“I know! But I mentioned Gwen has become the bride from hell, right? They’re afraid I’ll act just like her, so no one’s willing to take a real chance on me.”</p> <p>“Bride from hell, how?”</p><p>“Her dress didn’t fit right. Her napkins weren’t the right color. No one has the flowers she wants. Whaa, whaa, whaa.”</p><p>That didn’t sound like the usually calm Gwen. “Distract her. Tell her the Hunters captured me and performed a handbotomy on me like they did on Gideon.” Gideon, keeper of Lies. A sexy warrior who dyed his hair as blue as his eyes and had a wicked sense of humor.</p><p>The thought of seducing him didn’t delight her as it once might have. Stupid angel. Do not think about him.</p><p>“She wouldn’t care if you were chopped up into little pieces. You’re too much like me and apparently we take nothing seriously so we deserve what we get,” Kaia said. “She’s driving me freaking insane! And to top off my mountain-o-crap, I was totally losing our game of Hide and Seek. So anyway, why’d you decide to rescue yourself? I’m telling you, you have a better chance of survival in the clouds than here with Gwen.”</p><p>“Survival schmival. It wasn’t fun anymore.” A lie. Things had just started to heat up the way she’d wanted. But how could she have known that would scare her so badly?</p><p>“Good going, by the way. Allowing yourself to be taken into the clouds where I couldn’t get to you. Brilliant.”</p><p>“I know, right?”</p> <p>“So was it terrible? Being spirited away by a sexy angel?”</p><p>She twirled a strand of hair around her finger and pictured Lysander’s glorious face. The desire he’d leveled at her while she’d sucked him dry had been miraculous. You don’t want to talk about him, remember? “Yes. It was terrible.” Terribly wonderful.</p><p>“You bringing him to Buda for the wedding?”</p><p>The words were sneered, clearly a joke, but Bianka found herself shouting, “No!” before she could stop herself. A Harpy dating an angel? Unacceptable!</p><p>And anyway, allowing the demon-possessed Lords of the Underworld to surround a warrior straight from heaven would be stupid. Not that she feared for Lysander. Guy could handle himself, no problem. The way he formed a sword of fire from nothing but air was proof of that. But if something were to happen to Gwennie’s precious Sabin, like, oh, decapitation, the festivities would be somewhat dimmed.</p><p>“I’ll be there, though,” she added in a calmer tone. “I kinda have to, you know. Since I’m the maid of honor and all.”</p><p>“Oh, hell, no. I am, remember?”</p><p>She grinned slowly. “You told me you’d rather be hit by a bus than be a bridesmaid.”</p><p>“Yeah, but I want to have a bigger part than you, so...here I am, in Budapest, helping little Gwennie plan the ceremony. Not that she’s taking my suggestions. Would it kill her to at least consider making everyone come naked?”</p><p>They shared a laugh.</p><p>“Well, you and I can attend naked,” Bianka said. “It’ll certainly liven things up.”</p><p>“Done!”</p><p>There was a pause.</p><p>Kaia pushed out a breath. “So you’re fine?” she asked, a twinge of concern finally appearing in her voice.</p><p>“Yeah.” And she was. Or would be. Soon, she hoped. All she had to do was figure out what to do about Lysander. Not that he’d tried to stick around, the jerk. He hadn’t been able to get away from her fast enough. Sure, she’d pushed him away. But dude could have fought for her attention after what she’d done for him.</p><p>“You’re gonna make the angel pay for taking you without permission, right? Who am I kidding? Of course you are. If you wait till after the wedding, I can help. Please, please let me help. I have a few ideas and I think you’ll like them. Picture this. It’s midnight, your angel is strapped to your bed, and we each rip off one of his wings.”</p><p>Nice. But because she didn’t know whether Lysander was watching and listening or not—was he? It was possible, and just the thought had her skin heating—she said, “Don’t worry about it. I’m done with him.”</p><p>“Wait, what?” Kaia gasped out. “You can’t be done with him. He abducted you. Held you prisoner. Yeah, he oil-wrestled Paris and I’m pissed I didn’t get to see, but that doesn’t excuse his behavior. If you let him off without punishment, he’ll think it’s okay. He’ll think you’re weak. He’ll come after you again.”</p><p>Yes. Yes, he would, she thought, suddenly trying not to grin. “No, he won’t,” she lied. Are you listening, Lysander, baby?</p><p>“Bianka, tell me you don’t like him. Tell me you aren’t lusting for an angel.”</p><p>Abruptly her smile faded. This was exactly the line of questioning she’d hoped to avoid. “I’m not lusting for an angel.” Another lie.</p><p>Another pause. “I don’t believe you.”</p><p>“Too bad.”</p><p>“Mom thought Gwen’s dad was an angel and she regretted sleeping with him all these years. They’re too good. Too...different from us. Angels and Harpies are not meant to mix. Tell me you know that.”</p><p>“Of course I know it. Now, I’ve gotta go. Tell the bridezilla to go easy on you. Love you and see you soon,” she replied and hung up before Kaia could say anything else.</p><p>Despite her fear of what Lysander made her feel, Bianka wasn’t done with him. Not even close. But she’d been on his turf before and therefore at a disadvantage. If he wasn’t here, she needed to get him here. Willingly.</p><p>She’d told him to leave her alone, she thought, and that could be a problem. Except...</p><p>With a whoop, she jumped up and spun around. That wouldn’t be a problem at all. That was actually a blessing and she was smarter than she’d realized. By telling him to stay away from her, she’d surely become the forbidden fruit. Of course he was here, watching her.</p><p>Men never could do what they were told. Not even angels.</p><p>So. Easy.</p><p>Even better, she’d given him a little taste of what it was like to be with her. He would crave more. But also, she hadn’t allowed him to pleasure her. His pride would not allow her to remain in this unsatisfied state for long, while he had enjoyed such sweet completion.</p><p>And if that wasn’t the case, he wasn’t the virile warrior she thought he was and he therefore wouldn’t deserve her.</p><p>How long till he made an actual appearance? They’d only been apart half a day, but she already missed him.</p><p>Missed him. Ugh. She’d never missed a man before. Especially one who wanted to change her. One who despised what she was. One who could only be labeled enemy.</p><p>You have to avoid him. You want to sleep in his arms. You were protective of him while he fought Paris. He angered you but you didn’t kill him. And now you’re missing him? You know what this means, don’t you?</p><p>Her eyes widened, and her excitement drained. Oh, gods. She should have realized...should at least have suspected. Especially when she’d protected him, defended him.</p><p>Lysander, a goody-goody angel, was her consort.</p><p>Her knees gave out and she flopped onto the floor. As long as she’d been alive, she’d never thought to find one. Because, well, a consort was a meant-to-be husband. Some nights she’d dreamed of finding hers, yes, but she hadn’t thought it would actually happen.</p><p>Her consort. Wow.</p><p>Her family was going to flip. Not because Lysander had abducted her—they’d come to respect that—but because of what he was. More than that, she didn’t trust Lysander, would never trust him, and so could never do any actual sleeping with him.</p><p>Sex, though, she could allow. Often. Yes, yes, she could make this work, she thought, brightening. She could lure him to the dark side without letting her family know she was spending time with him. Humiliation averted!</p><p>Decided, she nodded. Lysander would be hers. In secret. And there was no better time to begin. If he was watching as she suspected, there was only one way to get him to reveal himself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She dressed in a lacy red halter and her favorite skinny jeans and drove into town. Only reason she owned a car was because it made her appear more human. Flying kind of gave her away. Though her arms and navel were exposed, the frigid wind didn’t bother her. Chilled her, yes, but that she could deal with. She wanted Lysander to see as much of her as possible.</p><p>She parked in front of The Moose Lodge, a local diner, and strode to the front door. Because it was so early and so cold, no one was nearby. A few streetlamps illuminated her, but she wasn’t worried. She unlocked the door—she’d stolen the key from the owner months ago—and disabled the alarm.</p><p>Inside, she claimed a pecan pie from the glassed refrigerator, grabbed a fork and dug in while walking to her favorite booth. She’d done this a thousand times before.</p><p>Come out, come out, wherever you are. He wouldn’t have just left her to her evil ways without thinking to protect the world from her. Right? She wished she could feel him, at least sense him in some way. His scent perhaps, that wild, night sky scent. But as she breathed deeply, she smelled only pecans and sugar. Still. She hadn’t sensed him when he’d snatched her from mid-free fall, so it stood to reason she wouldn’t sense him now.</p> <p>Once the pie was polished off, the pan discarded and her fork licked clean, she filled a cup with Dr. Pepper. She placed a few quarters in the old jukebox and soon an erratic beat was echoing from the walls. Bianka danced around one of the tables, thrusting her hips forward and back, arching, sliding around, hands roving over her entire body.</p><p>For a moment, only a brief, sultry moment, she thought she felt hot hands replace her own, exploring her breasts, her stomach. Thought she felt soft feathered wings envelop her, closing her in. She stilled, heart drumming in her chest. So badly she wanted to say his name, but she didn’t want to scare him away. So...what should she do? How should she—</p><p>The feeling of being surrounded evaporated completely.</p><p>Damn him!</p><p>Teeth grinding, not knowing what else to do, she exited the diner the same way she’d entered. Through the front door, as if she hadn’t a care. That door slammed behind her, the force of it nearly shaking the walls.</p> <p>“You should lock up after yourself.”</p><p>He was here; he’d been watching. She’d known it! Trying not to grin, she spun around to face Lysander. The sight of him stole her breath. He was as beautiful as she remembered. His pale hair whipped in the wind, little snow crystals flying around him. His golden wings were extended and glowing. But his dark eyes were not blank, as when she’d first met him. They were as turbulent as an ocean—just as they’d been when she’d left him.</p><p>“I thought I told you to stay away from me,” she said, doing her best to sound angry rather than aroused.</p><p>He frowned. “And I told you to behave. Yet here you are, full of stolen pie.”</p><p>“What do you want me to do? Return it?”</p><p>“Don’t be crass. I want you to pay for it.”</p> <p>“Moment I do, I’ll start to vomit.” She crossed her arms over her middle. Close the distance. Kiss me. “That would ruin my lipstick, so I have to decline.”</p><p>He, too, crossed his arms over his middle. “You can also earn your food.”</p><p>“Yeah, but where’s the fun in that?”</p><p>A moment passed in silence. Then, “Do you have no morals?” he gritted out.</p><p>“No.” No sexual boundaries, either. So freaking kiss me already! “I don’t.”</p><p>He popped his jaw in frustration and disappeared.</p><p>Bianka’s arms dropped to her sides and she gazed around in astonishment. He’d left? Left? Without touching her? Without kissing her? Bastard! She stomped to her car.</p><p>LYSANDER WATCHED AS Bianka drove away. He was hard as a rock, had been that way since she’d paraded around her cabin naked, had lingered in a bubble bath and then changed into that wicked shirt. His shaft was desperate for her.</p> <p>Why couldn’t she be an angel? Why couldn’t she abhor sin? Why did she have to embrace it?And why was the fact that she did these things—steal, curse, lie—still exciting him?</p><p>Because that was the way of things, he supposed, and had been since the beginning of time. Temptation seeped past your defenses, changed you, made you long for things you shouldn’t.</p><p>There had to be a way to end this madness. He couldn’t destroy her, he’d already proven that. But what if he could change her? He hadn’t truly tried before, so it could work. And if she embraced his way of life, they could be together. He could have her. Have more of her kisses, touch more of her body.</p><p>Yes, he thought. Yes. He would help her become a woman he could be proud to walk beside. A woman he could happily claim as his own. A woman who would not be his downfall.</p><p>CHAPTER NINE</p><p>AS LYSANDER HAD NEVER had a...girlfriend, as the humans would say, he had no idea how to train one. He knew only how to train his soldiers. Without emotion, maintaining distance and taking nothing personally. His soldiers, however, wanted to learn. They were eager, his every word welcomed. Bianka would resist him at every turn. That much he knew.</p><p>So. The first day, he followed her, simply observing. Planning.She, of course, stole every meal, even snacks, drank too much at a bar, danced too closely with a man she obviously did not know, then broke that man’s nose when he cupped her bottom. Lysander wanted to do damage of his own, but restrained himself. Barely. At bedtime, Bianka merely paced the confines of her cabin, cursing his name. Not for a minute did she rest.</p><p>How lovely she was, dark hair streaming down her back. Red lips pursed. Skin glowing like a rainbow in the moonlight. So badly he wanted to touch her, to surround her with his wings, making them the only two people alive, and simply enjoy her.</p><p>Soon, he promised himself.</p><p>She’d given him release, yet he had not done the same for her. The more he thought about that—and think about it he did, all the time—the more that did not sit well with him. The more he thought about it, in fact, the more embarrassed he was.</p><p>He didn’t know how to touch her to bring her release, but he was willing to try, to learn. First, though, he had to train her as planned. How, though? he wondered again. She seemed to respond well to his kisses—his chest puffed up with pride at that. He’d never rewarded his soldiers for a job well done, but perhaps he could do so for Bianka. Reward her with a kiss every time she pleased him.</p><p>A failproof plan. He hoped.</p><p>The second day, he was practically humming with anticipation. When she entered a clothing store and stuffed a beaded scarf into her purse, he materialized in front of her, ready to begin.</p><p>She stilled, gaze lifting and meeting his. Rather than bow her head in contrition, she grinned. “Fancy meeting you here.”</p><p>“Put that back,” he told her. “You do not need to steal clothing to survive.”</p><p>She crossed her arms over her middle, a stubborn stance he knew well. “Yeah, but it’s fun.”</p><p>A human woman who stood off to the side eyed Bianka strangely. “Uh, can I help you?”</p><p>Bianka never looked away from him. “Nope. I’m fine.”</p><p>“She cannot see me,” Lysander told her. “Only you can.”</p><p>“So I look insane for talking with you?”</p><p>He nodded.</p><p>She laughed, surprising him. And even though her amusement was misplaced, he loved the sound of her laughter. It was magical, like the strum of a harp. He loved the way her mirth softened her expression and lit her magnificent skin.</p><p>Have to touch her, he thought, suddenly dazed. He took a step closer, intending to do just that. Have to experience that softness again. And in doing so, she could begin to know the delights of his rewards.</p><p>She gulped. “Wh-what are you—”</p><p>“Are you sure I can’t help you?” the woman asked, cutting her off.</p><p>Bianka remained in place, trembling, but tossed her a glare. “I’m sure. Now shut it before I sew your lips together.”</p><p>The woman backed away, spun and raced to help someone else.</p><p>Lysander froze.</p><p>“You may continue,” Bianka said to him.</p><p>How could he reward her for such rudeness? That would defeat the purpose of her training. “Do you not care what people think of you?” he asked, head tilting to the side.</p><p>Her eyes narrowed, and she stopped trembling. “No. Why should I? In a few years, these people will be dead but I’ll still be alive and kicking.” As she spoke, she stuffed another scarf in her purse.</p><p>Now she was simply taunting him. “Put it back, and I’ll give you a kiss,” he gritted out.</p><p>“Wh-what?”</p><p>Stuttering again. He was affecting her. “You heard me.” He would not repeat the words. Having said them, all he wanted to do was mesh their lips together, thrust his tongue into her mouth and taste her. Hear her moan. Feel her clutch at him.</p><p>“You would willingly kiss me?” she rasped.</p><p>Willingly. Desperately. He nodded.</p><p>She licked her lips, leaving a sheen of moisture behind. The sight of that pink tongue sent blood rushing into his shaft. His hands clenched at his sides. Anything to keep from grabbing her and jerking her against him.</p><p>“I—I—” She shook her head, as if clearing her thoughts. Her eyes narrowed again, those long, dark lashes fusing together. “Why would you do that? You, who have tried to resist me at every turn?”</p><p>“Because.”</p><p>“Why?”</p><p>“Just put the scarves back.” So the kissing can begin.</p><p>She arched a brow. “Are you trying to bribe me? Because you should know, that won’t work with me.”</p><p>Rather than answer—and lie—he remained silent, chin jutting in the air. Blood...heating.</p><p>Still watching him, she reached out, palmed a belt and stuffed it in her purse, as well. “So what do you plan to do to me if I keep stealing? Give me a severe tongue-lashing? Too bad. I don’t accept.”</p><p>Fire slid the length of his spine even as his anger spiked. He closed the distance until the warmth of her breath was fanning over his neck and chest. “You could not get enough of me in the heavens, yet now that you are here, you want nothing to do with me. Tell me. Was your every word and action up there a lie?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Of course my every word and action was a lie. That’s what I do. I thought you knew that.”</p><p>So...did she desire him or not? Two days ago she’d told her sister, Kaia, that she wanted nothing to do with him. At the time, he’d thought she was merely saying that for Kaia’s benefit. Now, he wasn’t so sure.</p><p>“You could be lying now,” he said. At least, that’s what he hoped. And who would have thought he’d ever wish for a lie?</p> <p>Excitement sparked in her eyes and spread to the rest of her features. She patted his cheek, then flattened her palm on his chest. “You’re learning, angel.”</p><p>He sucked in a breath. So hot. So soft.</p><p>“Here’s a proposition for you. Steal something from this store and I’ll kiss you.”</p><p>Wait. Her words from a moment ago drifted through his head. You’re learning, angel. He was learning? “No,” he croaked out. He would not do such a thing. Not even for her. “These people need the money their goods provide. Do you care nothing for their welfare?”</p><p>A flash of guilt joined the excitement. “No,” she said.</p> <p>Another lie? Probably. That guilt...it gave him hope. “Why do you need to steal like this, anyway?”</p><p>“Foreplay,” she said with a shrug.</p><p>Blood...heating...again.</p><p>“Ma’am, I need you to come with me.”</p><p>At the unexpected intrusion, they both stiffened. Bianka’s gaze pulled from his; together they eyed the policeman now standing beside her.</p><p>She frowned. “Can’t you see that I’m in the middle of a conversation?”</p> <p>“Doesn’t matter if you’re talking to God Himself.” The grim-faced officer latched on to her wrist. “I need you to come with me.”</p><p>“I don’t think so. Lysander,” she said, clearly expecting him to do something.</p><p>Instinct demanded he save her. He wanted her safe and happy, but this would be good for her. “I told you to put the items back.”</p><p>Her jaw dropped as the officer led her away. And, if Lysander wasn’t mistaken, there was pride in her gaze.</p><p>ARRESTED FOR SHOPLIFTING, Bianka thought with disgust. Again. Her third time that year. Lysander had watched the policeman usher her in back, empty her purse and cuff her. All without a word. His disapproval had said plenty, though.</p><p>She hadn’t let it upset her. He’d stood his ground, and she admired that. Was turned on by it. This wouldn’t be an easy victory, as she’d assumed. Besides, for the first time in their relationship, he’d offered to kiss her. Willingly kiss her.But only if she replaced her stolen goods, she reminded herself darkly. Didn’t take a genius to figure out that he wanted to change her. To condition her to his way of life.</p><p>It was exactly what she wanted to do to him. Which meant he wanted her as desperately as she wanted him.</p><p>It also meant it was time to take this game to the next level. She, however, would not be the one to cave. The six hours she’d spent behind bars had given her time to think. To form a strategy.</p> <p>She was whistling as she meandered down the station steps. Lysander had finally posted her bail, but he hadn’t hung around to speak with her. Well, he hadn’t needed to. She knew he was following her.</p><p>At home, she showered, lingering under the hot spray, soaping herself more slowly than necessary and caressing her breasts and playing between her legs. Unfortunately, he never appeared. But no matter.</p><p>Just in case her shower hadn’t gotten him in the mood, she read a few passages from her favorite romance novel. And just in case that hadn’t gotten him in the mood, she decorated her navel with her favorite dangling diamond, dressed in a skintight tank and skirt and knee-high boots, and drove to the closest strip club.</p><p>“I only have a few days left. Then I’m traveling to Budapest for Gwen’s wedding and you are not invited. Do you hear me? Try and come and I’ll make your life hell. So, if you want a go at me, now’s the time,” she said as she got out of the car.</p><p>Again, he didn’t appear.</p><p>She almost screeched in frustration. So far, her strategy sucked. What was he doing?</p><p>The night was cold yet the inside of the club was hot and stuffy, the seats packed with men. Onstage, a redhead—clearly not a natural redhead—swung around a pole. The lights were dimmed, and smoke clung to the air.</p><p>“You gonna dance, darling?” someone asked Bianka.</p><p>“Nope. Got better things to do.” She did, however, steal the stranger’s wallet, sneak a beer from the bar and settle into a table in the back corner. Alone. “Enjoy,” she whispered to Lysander, toasting him with the bottle.</p><p>“Have you no shame?” he suddenly growled from behind her.</p><p>Finally! Every muscle in her body relaxed, even as her blood heated with awareness. But she didn’t turn to face him. He would have seen the triumph in her eyes. “You have enough shame for both of us.”</p><p>He snorted. “That does not seem to be the case.”</p><p>“Really? Well, then, let’s loosen you up. Do you want a lap dance?” She held up the cash she’d taken. “I’m sure the redhead onstage would love to rub against you.”</p><p>His big hands settled on her shoulders, squeezing.</p><p>“Or maybe you’d like a beer?”</p><p>“I would indeed,” the stranger she’d stolen from said, now in front of her table. He reached into his back pocket. Frowned. “Hey, my wallet’s gone.” His gaze settled on the small brown leather case resting on her tabletop. His frown deepened. “That looks like mine.”</p><p>“How odd,” she said innocently. “So do you want me to buy you a beer or not?”</p><p>Lysander’s grip tightened. “Give him back his wallet and I’ll kiss you.”</p><p>Her breath caught in her throat. Gods, she wanted his kiss. More than she’d ever wanted anything. His lips were soft, his taste decadent. And if she allowed him to kiss her, well, she knew she could convince him to do other things.</p><p>But she said, “Steal his watch and I’ll kiss you.”</p><p>“What are you talking about?” the guy asked, brow furrowed. “Steal whose watch?”</p><p>She rolled her eyes, wishing she could shoo him away.</p><p>Lysander leaned down and cupped her breasts. A tremor moved through her, her nipples beading, reaching for him. Sweet heaven. Her stomach quivered, jealous of her breasts, wanting the touch lower.</p><p>“Give him back the wallet.”</p><p>Suddenly she wanted to do just that. Anything for more of Lysander and this sultry side of him. She didn’t need the money, anyway. Wait. What are you doing? Caving? She straightened her spine. “No, I—”</p><p>“I’ll kiss you all over your body,” Lysander added.</p><p>Oh...Hell. He’d decided to take their game to the next level, as well.</p><p>Damn, damn, damn. She couldn’t lose. If she did, he would control her with sex. He would expect her to be good like him. All the damn time. There would be no more stealing, no more cursing, no more fun. Well, except when they were in bed—but would he expect her to be good there, too?</p><p>Life would become boring and sinless, everything a Harpy was taught to fight against.</p><p>She stood to shaky legs and turned, finally facing him. His hands fell away from her. She tried not to moan in disappointment. His expression was blank.</p><p>She blanked hers, as well, reached out and cupped him. Though he showed no emotion, he couldn’t hide his hardness. “Steal something, anything at all, and I’ll kiss you all over.” Her voice dipped huskily. “Remember last time? You came in my mouth, and I loved every moment of it.”</p><p>His nostrils flared.</p><p>“Yes!” the guy behind her exclaimed. “Give me five minutes and I’ll have stolen something.”</p><p>“You aren’t trainable, are you?” Lysander asked stiffly.</p><p>“No,” she said, but suddenly she didn’t feel like smiling. There’d been resignation in his tone. Had she pushed him too far again? Was he going to leave her? Never return? “That doesn’t mean you should stop trying, though.”</p><p>“Wait. Trying what?” the stranger asked, confused.</p><p>Gods, when would he leave?</p><p>“Lysander,” she prompted.</p><p>“That’s not my name.”</p><p>“Get lost,” she growled.</p><p>Lysander’s gaze lifted, narrowed on the human. Then Bianka heard footsteps. Her angel hadn’t said anything, hadn’t revealed himself, but had somehow managed to make the human leave. He had powers she hadn’t known about, then. Why was that even more exciting?</p><p>“If you won’t give the wallet back and I won’t steal anything, where does that leave us?” he asked.</p><p>“At war. I don’t know about you, but I do my best fighting in bed,” she said, and then threw her arms around his neck.</p><p>CHAPTER TEN</p><p>WIND WHIPPED THROUGH Bianka’s hair, and she knew that Lysander was flying her somewhere with those majestic wings. She had her eyes closed, too busy enjoying him—finally!—to care where he took her. His tongue made love to hers. His hands clutched her hips, fingers digging sharply. Then she was tipping over, a cool, soft mattress pressing into her back. His weight pinned her deliciously.</p><p>And it shouldn’t have been delicious. This was not a position she allowed. Ever. It caged her wings, and her wings were the source of her strength. Without them, she was almost as weak as a human. But this was Lysander, honest to a fault, and she’d wanted him forever, it seemed. And as wary as he’d been about this sort of thing, she was afraid any type of rebuke would send him flying away.Besides, he could do anything he wanted to her like this...</p><p>“No one is to enter,” he said roughly.</p><p>Moaning, she wound her legs around his waist, tilted her head to receive his newest kiss and enjoyed a deeper thrust of his tongue. White lightning, the man was a fast learner. Very fast. He was now an expert at kissing. The best she’d ever had. By the time she finished with him, he’d be an expert at everything carnal.</p><p>His cock, hard and long and thick, rode the apex of her thighs. She could feel every inch of him through the softness of his robe. His arms enveloped her, and when she opened her eyes—they were inside his cloud, she realized—she saw his golden wings were spread, forming a blanket over them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She tangled her hands in his hair and pulled from the kiss. “Are you going to get into trouble for this?” she asked, panting. Wait. What? Where had that thought come from?</p><p>His eyes narrowed. “Do you care?”</p><p>“No,” she lied, forcing a grin. No, no, no. That wasn’t a lie. “But that adds a little extra danger, don’t you think?” There. Better. That was more like her normal self. She didn’t like his goodness, didn’t want to preserve it and keep him safe.</p> <p>Did she?</p><p>“Well, I will not get into trouble.” He flattened his palms at her temples, boxing her in and taking the bulk of his own weight. “If that is the only reason you are here, you can leave.”</p><p>How fierce he appeared. “So sensitive, angel.” She hooked her fingers at the neck of his robe and tugged. The material ripped easily. But as she held it, it began to weave itself back together. Frowning, she ripped again, harder this time, until there was a big enough gap to shove the clothing from his shoulders and off his arms. “I was only teasing.”</p><p>His chest was magnificent. A work of art. Muscled and sun-kissed and devoid of any hair. She lifted her head and licked the pulse at the base of his neck, then traced his collarbone, then circled one of his nipples. “Do you like?”</p><p>“Hot. Wet,” he rasped, lids squeezed tight.</p> <p>“Yeah, but do you like?”</p><p>“Yes.”</p><p>She sucked a peak until he gasped, then kissed away the sting. A tremor of pleasure rocked him, which caused a lance of pride to work through her. “Why do you desire me, angel? Why do you care if I’m good or not?”</p><p>A pause. A tortured, “Your skin...”</p><p>Every muscle in her body stiffened, and she glared up at him. “So any Harpy will do?” She tried to hide her insult, but didn’t quite manage it. The thought of another Harpy—hell, any other woman, immortal or not—enjoying him roused her most vicious instincts. Her nails lengthened, and her teeth sharpened. A red haze dotted her line of vision. Mine, she thought. She would kill anyone who touched him. “We all have this skin, you know?” The words were guttural, scraping her throat.</p><p>His lashes separated as his eyes opened. His pupils were dilated, his expression tightening with...an emotion she didn’t recognize. “Yes, but only yours tempts me. Why is that?”</p> <p>“Oh,” was all she could first think to say, her anger draining completely. But she needed to respond, had to think of something light, easy. “To answer your question, you want me because I’m made of awesome. And guess what? I will make you so happy you said that, warrior.”</p><p>Warrior, rather than angel. She’d never called him that before. Why? And why now?</p><p>“No. I will make you happy.” He ripped her shirt just as she had done his robe. She wasn’t wearing a bra, and her breasts sprang free. Another tremor moved through him as he lowered his head.</p><p>He licked and sucked one nipple, as she had done to him, then the other, feasting. Savoring. Soon she was arching and writhing against him, craving his mouth elsewhere. Her skin was sensitized, her body desperate for release. Yet she didn’t want to rush him. She was still afraid of scaring him away. But damn him, if he didn’t hurry, didn’t touch her between her legs, she was going to die.</p><p>“Lysander,” she said on a trembling breath.</p><p>His wings brushed both her arms, up and down, tickling, caressing, raising goosebumps on her flesh. Holy hell, that was good. So damn good.</p><p>He lifted from her completely.</p><p>“Wh-what are you doing? I wasn’t going to tell you to leave,” she screeched, bracing her weight on her elbows.</p> <p>“I do not want anything between us.” He shoved the robe down his legs until he was gloriously naked. Moisture gleamed at the head of his cock, and her mouth watered. Reaching out, he gripped her boots and tore them off. Her jeans quickly followed. She, of course, was not wearing any panties.</p><p>His gaze drank her in, and she knew what he saw. Her flushed, glowing skin. The aching juncture between her legs. Her rose-tinted nipples.</p><p>“I want to touch and taste every inch,” he said and just kind of fell on her, as if his will to resist had abandoned him completely.</p><p>“Touch and taste every inch next time.” Please let there be a next time. She tried to hook her legs around his waist again. “I need release now.”</p><p>He grabbed her by the knees and spread her. Her head fell back, her hair tangling around her, and he kissed a path to her breasts, then to her stomach. He lingered at her navel until she was moaning.</p><p>“Lysander,” she said again. Fine. She’d jump on this grenade if she had to; if he wanted to taste, he could taste. “More. I need more.”</p><p>Rather than give it to her, he stilled. “I...took care of myself before following you this day,” he admitted, cheeks pinkening. “I thought that would give me resistance against you.”</p><p>Her eyes widened, shock pouring through her. “You pleasured yourself?”</p><p>A stiff nod.</p><p>“Did you think of me?”</p><p>Another nod.</p><p>“Oh, baby. That’s good. I can picture it, and I love what I see.” His hand on his cock, stroking up and down, eyes closed, features tight with arousal, body straining toward release. Wings spread as he fell to his knees, the pleasure too much. Her, naked in his mind. “What did you think about doing?”</p><p>Another pause. A hesitant response. “Licking. Between your legs. Tasting you, as I said.”</p><p>She arched her back, hands skimming down her middle to her thighs. Although he already held her open, she pushed her legs farther apart. “Then do it. Lick me. I want it so bad. Want your tongue on me. See how wet I am?”</p><p>He hissed in a breath. “Yes. Yes.” Leaning down, he started at her ankles and kissed his way up, lingering at the back of her knees, at the crease of her legs.</p><p>“Please,” she said, so on edge she was ready to scream. “Please. Do it.”</p><p>“Yes,” he whispered again. “Yes.” Finally he settled over her, mouth poised, ready. His tongue flicked out. Then, sweet contact.</p><p>She expected the touch, but nothing could have prepared her for the perfection of it. She did scream, shivered. Begged for more. “Yes, yes, yes. Please, please, please.”</p><p>At first, he merely lapped at her, humming his approval at her taste. Thank the gods. Or God. Or whoever was responsible for this man. If he hadn’t liked her in that way, she wasn’t sure what she would have done. In that moment, she wanted—needed—to be everything he wanted—needed. She wanted him to crave every part of her, as she craved every part of him.</p><p>Even his goodness?</p><p>Yes, she thought, finally admitting it. Yes. Just then, she had no defenses; she’d been stripped to her soul. His goodness somehow balanced her out. She’d fought against it—and still had no plans to change—but they were two extremes and actually complemented each other, each giving the other what he or she lacked. In her case, the knowledge that some things were worth taking seriously. In his, that it wasn’t a crime to have fun.</p><p>“Bianka,” he moaned. “Tell me how...what...”</p><p>“More. Don’t stop.”</p><p>Soon his tongue was darting in and out of her, mimicking the act of sex. She grasped at the sheets, fisting them. She writhed, meeting his every thrust. She screamed again, moaned and begged some more.</p><p>Finally, she splintered apart. Bit down on her bottom lip until she tasted blood. White lights danced over her eyes—from her skin, she realized. Her skin was so bright it was almost blinding, glowing like a lamp, something that had never happened before.</p><p>Then Lysander was looming above her. “You are not fertile,” he rasped. Sweat beaded him.</p><p>That gave her fuzzy mind pause. “I know.” Her words were as labored as his. Harpies were only fertile once a year and this wasn’t her time. “But how do you know that?”</p><p>“Sense it. Always know that kind of thing. So...are you ready?” he asked, and she could hear the uncertainty in his voice.</p><p>He must not know proper etiquette, the darling virgin. He would learn. With her, there was no etiquette. Doing what felt good was the only thing that drove her.</p><p>“Not yet.” She flattened her hands on his shoulders and pushed him to his back, careful of his wings. He didn’t protest or fight her as she straddled his waist and gripped his cock by the base. Her wings fluttered in joy at their freedom. “Better?”</p><p>He licked his lips, nodded. His wings lifted, enveloped her, caressing her. Her head fell, the long length of her hair tickling his thighs. He trembled.</p><p>Would he regret this? she suddenly wondered. She didn’t want him to hate her for supposedly ruining him.</p><p>“Are you ready?” she asked. “There’s no taking it back once it’s done.” If he wasn’t ready, well, she would...wait, she realized. Yes, she would wait until he was ready. Only he would do. No other. Her body only wanted him.</p><p>“Do not stop,” he commanded, mimicking her.</p><p>A grin bloomed. “I’ll be careful with you,” she assured him. “I won’t hurt you.”</p><p>His fingers circled her hips and lifted her until she was poised at his tip. “The only thing that could hurt me is if you leave me like this.”</p><p>“No chance of that,” she said, and sank all the way to the hilt.</p><p>He arched up to meet her, feeding her his length, his eyes squeezing shut, his teeth nearly chewing their way through his bottom lip. He stretched her perfectly, hit her in just the right spot, and she found herself desperate for release once more. But she paused, his enjoyment more important than her own. For whatever reason.</p><p>“Tell me when you’re ready for me to—”</p><p>“Move!” he shouted, hips thrusting so high he raised her knees from the mattress.</p><p>Groaning at the pleasure, she moved, up and down, slipping and sliding over his erection. He was wild beneath her, as if he’d kept his passion bottled up all these years and it had suddenly exploded from him, unstoppable. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Soon, even that wasn’t enough for him. He began hammering inside her, and she loved it. Loved his intensity. All she could do was hold on for the ride, slamming down on him, gasping. Her nails dug into his chest, her moans blended with his. And when her second orgasm hit, Lysander was right there with her, roaring, muscles stiffening.</p><p>He grabbed her by the neck and jerked her down, meshing their lips together. Their teeth scraped as he primitively, savagely kissed her. It was a kiss that stripped her once more to her soul, left her raw, agonized. Reeling.</p><p>He was indeed her consort, she thought, dazed. There was no denying it now. He was it for her. Her one and only. Necessary. Angel or not. She laughed, and was surprised by how carefree it sounded. Tamed by great sex. It figured. After this, no other man would do. Ever. She knew it, sensed it.</p> <p>She collapsed atop him, panting, sweating. Scared. Suddenly vulnerable. How did he feel about her? He didn’t approve of her, yet he had gifted her with his virginity. Surely that meant he liked her, just as she was. Surely that meant he wanted her around.</p><p>His heart thundered in his chest, and she grinned. Surely.</p><p>“Bianka,” he said shakily.</p><p>She yawned, more replete than she’d ever been. My consort. Her eyelids closed, her lashes suddenly too heavy to hold up. Fatigue washed through her, so intense she couldn’t fight it.</p><p>“Talk...later,” she replied, and drifted into the most peaceful sleep of her life.</p> <p>CHAPTER ELEVEN</p><p>FOR HOURS LYSANDER HELD Bianka in the crook of his arm while she slept, marveling—this was what she’d craved most in the world and he had given it to her—and yet, he was also worrying. He knew what that meant, knew how difficult it was for a Harpy to let down her guard and sleep in front of another. It meant she trusted him to protect her, to keep her safe. And he was glad. He wanted to protect her. Even from herself.</p><p>But could he? He didn’t know. They were so different.Until they got into bed, that is.</p><p>He could not believe what had just happened. He had become a creature of sensation, his baser urges all that mattered. The pleasure...unlike anything he’d ever experienced. Her taste was like honey, her skin so soft he wanted it against him for the rest of eternity. Her breathy moans—even her screams—had been a caress inside his ears. He’d loved every moment of it.</p><p>Had he been called to battle, he wasn’t sure he would have been able to leave her.</p><p>Why her, though? Why had she been the one to captivate him?</p> <p>She lied to him at every opportunity. She embodied everything he despised. Yet he did not despise her. For every moment with her, he only wanted more. Everything she did excited him. The pleasure she’d found in his arms...she had been unashamed, uninhibited, demanding everything he had to give.</p><p>Would he have been as enthralled by her if she had led a blameless life? If she had been more demure? He didn’t think so. He liked her exactly as she was.</p><p>Why? he wondered again.</p><p>By the time she stretched lazily, sensually against him, he still did not have the answers. Nor did he know what to do with her. He’d already proven he could not leave her alone. And now that he knew all of her, she would be even more impossible to resist.</p><p>“Lysander,” she said, voice husky from her rest.</p><p>“I am here.”</p><p>She blinked open her eyes, jolted upright. “I fell asleep.”</p><p>“I know.”</p> <p>“Yeah, but I feel asleep.” She scrubbed a hand down her beautiful face, twisted and peered down at him with vulnerable astonishment. “I should be ashamed of myself, but I’m not. What’s wrong with me?”</p><p>He reached up and traced a fingertip over her swollen lips. How hard had he kissed her? “I’m...sorry,” he said. “I lost control for a moment. I shouldn’t have taken you so—”</p><p>She nipped at his finger, her self-recrimination seeming to melt away in favor of amusement. “Do you hear me complaining about that?”</p><p>He relaxed. No, he did not hear her complaining. In fact, she appeared utterly sated. And he had done that. He had given her pleasure. Pride filled him. Pride—a foolish emotion that often led to a man’s downfall. Was that how Bianka would make him fall? For as his temptation, she would make him fall.</p><p>With a sigh, she flopped back against him. “You turned serious all of the sudden. Want to talk about it?”</p><p>“No.”</p><p>“Do you want to talk about anything?”</p><p>“No.”</p><p>“Well, too bad,” she grumbled, but he heard a layer of satisfaction in her tone. Did she enjoy making him do things he didn’t want to do—or didn’t think he wanted to do? “Because you’re going to talk. A lot. You can start with why you first abducted me. I know you wanted to change me, but why me? I still don’t know.”</p><p>He shouldn’t tell her; she already had enough power over him, and knowing the truth would only increase that power. But he also wanted her to understand how desperate he’d been. Was. “At the heart of my duties, I am a peacekeeper, and as such, I must peek into the lives of the Lords of the Underworld every so often, making sure they are obeying heavenly laws. I...saw you with them. And as I have proven with my actions this day, I realized you are my one temptation. The one thing that can tear me from my righteous path.”</p><p>She sat up again, faced him again. Her eyes were wide with...pleasure? “Really? I alone can ruin you?”</p><p>He frowned. “That does not mean you should try and do so.”</p><p>Laughing, she leaned down and kissed him. Her breasts pressed against his chest, once again heating his blood in that way only she could do. But he was done fighting it, done resisting it. “That’s not what I meant. I just like being important to you, I guess.” Her cheeks suddenly bloomed with color. “Wait. That’s not what I meant, either. What I’m trying to say is that you’re forgiven for whisking me to your palace in the sky. I would have done the same thing to you had the situation been reversed.”</p><p>He had not expected forgiveness to come so easily. Not from her. Frown intensifying, he cupped her cheeks and forced her to meet his gaze. “Why were you with me? I know I am not what your kind views as acceptable.”</p><p>She shrugged, the action a little stiff. “I guess you’re my temptation.”</p><p>Now he understood why she’d grinned over his proclamation. He wanted to whoop with satisfied laughter.</p><p>“If we’re going to be together—” She stopped, waiting. When he nodded, she relaxed and continued, “Then I guess I could only steal from the wicked.”</p><p>It was a concession. A concession he’d never thought she would make. She truly must like him. Must want more time with him.</p><p>“So listen,” she said. “My sister is getting married in a week, as I told you before. Do you want to, like, come with me? As my guest? I know, I know. It’s short notice. But I didn’t intend to invite you. I mean, you’re an angel.” There was disgust in her voice. “But you make love like a demon so I guess I should, I don’t know, show you off or something.”</p><p>He opened his mouth to reply. What he would say, he didn’t know. They could not tell others of their relationship. Ever. But a voice stopped him.</p><p>“Lysander. Are you home?”</p><p>Lysander recognized the speaker immediately. Raphael, the warrior angel. Panic nearly choked him. He couldn’t let the man see him like this. Couldn’t let any of his kind see him with the Harpy.</p><p>“We must discuss Olivia,” Raphael called. “May I enter your abode? There is some sort of block preventing me from doing so.”</p><p>“Not yet,” he called. Was his panic in his voice? He’d never experienced it before, so didn’t know how to combat it. “Wait for me. I will emerge.” He sat up and slipped from the bed, from Bianka. He grabbed his robe, or rather, the pieces of it, from the floor and wrapped it around himself. Immediately it wove back together to fit his frame. The material even cleaned him, wiping away Bianka’s scent.</p><p>The latter, he inwardly cursed. For the best.</p><p>“Let him in,” Bianka said, fitting the sheet around her, oblivious. “I don’t mind.”</p><p>Lysander kept his back to her. “I do not want him to see you.”</p><p>“Don’t worry. I’ve covered my naughty nakedness.”</p><p>He gave no reply. Unlike her, he would not lie. And if he did not lie to her, he would hurt her. He did not want to do that either.</p><p>“So call him in already,” she said with a laugh. “I want to see if all angels look like sin but act like saints.”</p><p>“No. I don’t want him inside right now. I will go out to meet him. You will stay here,” he said. Still he couldn’t face her.</p><p>“Wait. Are you jealous?”</p><p>He gave no reply.</p><p>“Lysander?”</p><p>“Stay silent. Please. Cloud walls are thin.”</p><p>“Stay...silent?” A moment passed in the very silence he’d requested. Only, he didn’t like it. He heard the rustle of fabric, a sharp intake of breath. “You don’t want him to know I’m here, do you? You’re ashamed of me,” she said, clearly shocked. “You don’t want your friend to know you’ve been with me.”</p><p>“Bianka.”</p><p>“No. You don’t get to speak right now.” With every word, her voice rose. “I was willing to take you to my sister’s wedding. Even though I knew my family would laugh at me or view me with disgust. I was willing to give you a chance. Give us a chance. But not you. You were going to hide me away. As if I’m something shameful.”</p><p>He whirled on her, fury burning through him. At her, at himself. “You are something shameful. I kill beings like you. I do not fall in love with them.”</p><p>She didn’t say anything. Just looked up at him with wide, hurt-filled eyes. So much hurt he actually stumbled back. A sharp pain lanced his chest. But as he watched, her hurt mutated into a fury that far surpassed his.</p><p>“Kill me, then,” she growled.</p><p>“You know I will not.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why?”</p><p>“Because!”</p><p>“Let me guess. Because deep down you still think you can change me. You think that I will become the pure, virtuous woman you want me to be. Well, who are you to say what’s virtuous and what isn’t?”</p> <p>He merely arched a brow. The answer was obvious and didn’t need to be stated.</p><p>“I told you that from now on I’d only hurt the wicked, right? Well, surprise! That’s what I’ve done since the beginning. The pie you watched me eat? The owner of that restaurant cheats at cards, takes money that doesn’t belong to him. The wallet I stole? I took it from a man cheating on his wife.”</p><p>He blinked down at her, unsure he’d heard correctly. “Why would you have kept that from me?”</p><p>“Why should it change how you feel about me?” She tossed back the cover and stood, glorious in her nakedness. Her skin was still aglow, multihued light reflecting off it—he’d touched that skin. Dark hair cascaded around her—he’d fisted that hair.</p><p>“I want to be with you,” he said. “I do. But it has to be in secret.”</p> <p>“I thought the same. Until what we just did,” she said as she hastily dressed. Her clothes were not like his, did not repair on their own, and so that ripped shirt revealed more than it hid.</p><p>He tried again. Tried to make her understand. “You are everything my kind stands against, Bianka. I train warriors to hunt and kill demons. What would it say to them were I to take you as my companion?”</p><p>“Here’s a better question. What does it say to them that you hide your sin? Because that’s how you view me, isn’t it? Your sin. You are such a hypocrite.” She stormed past him, careful not to touch him. “And I will not be with a hypocrite. That’s worse than being an angel.”</p><p>He thought she meant to race to Raphael and flaunt her presence. Shockingly enough, she didn’t. And because he hadn’t commanded her to stay, when she said, “I want to leave,” the cloud opened up at her feet.</p><p>She disappeared, falling through the sky.</p><p>“Bianka,” he shouted. Lysander spread his wings and jumped after her. He passed Raphael, but at that point, he didn’t care. He only wanted Bianka safe—and that hurt and fury wiped away from her expression.</p> <p>She’d turned facedown to increase her momentum. He had to tuck his wings into his back to increase his own. Finally, he caught her halfway and wrapped his arms around her, her back pressed into his stomach. She didn’t flail, didn’t order him to release her, which he’d been prepared for.</p><p>When they reached her cabin, he straightened them, spread his wings and slowed. Snow still covered the ground and crunched when they landed. She didn’t pull away. Didn’t run. Something else he’d been prepared for.</p><p>Clearly he knew very little about her.</p><p>“It’s probably best this way, you know,” she said flatly, keeping her back to him. The wind slapped her hair against his cheeks. “That was my afterglow talking earlier, anyway. I never should have invited you to the wedding. We’re too different to make anything work.”</p><p>“I was willing to try,” he said through gritted teeth. Don’t do this, he projected. Don’t end us.</p><p>She laughed without humor, and he marveled at the difference between this laugh and the one she’d given inside his cloud. Marveled and mourned. “No, you were willing to hide me away.”</p><p>“Yes. Therefore I was trying to make something work. I want to be with you, Bianka. Otherwise I would not have followed you. I would have left you alone from the first. I would not have tried to show you the light.”</p><p>“You are such a pompous ass,” she spat. “Show me the light? Please! You want me to be perfect. Blameless. But what happens when I fail? And I will, you know? Perfection just isn’t in me. One day I will curse. Like now. Fuck you. One day I will take something just because it’s pretty and I want it. Would that ruin me in your eyes?”</p> <p>“It hasn’t so far,” he spat back.</p><p>She laughed again, this one bleaker, grim. “The scarves I took were made by child laborers. So I haven’t really done anything too terrible yet. But I will. And you know what? If you were to do something nauseatingly righteous, I wouldn’t have cared. I would still have wanted to take you to the wedding. That’s the difference between us. Evil or not, good or not, I wanted you.”</p><p>“I want you, too. But that was not always the case, and you know it. You would care.” He tightened his grip on her. “Bianka. We can work this out.”</p><p>“No, we can’t.” Finally, she twisted to face him. “That would require giving you a second chance, and I don’t do second chances.”</p><p>“I don’t need a second chance. I just need you to think about this. To realize our relationship must stay hidden.”</p><p>“I’m not going to be your secret shame, Lysander.”</p><p>His eyes narrowed. She was trying to force his hand, and he didn’t like it. “You steal in secret. You sleep in secret. Why not this?”</p><p>“That you don’t know the answer proves you aren’t the warrior I thought you were. Have a nice life, Lysander,” she said, jerking from his hold and walking away without a backward glance.</p><p>CHAPTER TWELVE</p><p>LYSANDER SAT IN THE BACK of the Budapest chapel, undetectable, watching Bianka help her sisters and their friends decorate for the wedding. She was currently hanging flowers from the vaulted ceiling. Without a ladder.</p><p>He’d been following her for days, unable to stay away. One thing he’d noticed: she talked and laughed as if she was fine, normal, but the sparkle was gone from her eyes, her skin.And he had done that to her. Worse, not once had she cursed, lied or stolen. Again, his fault. He’d told her she was unworthy of him. He’d been—was, right?—too embarrassed of her to tell his people about her.</p><p>But he couldn’t deny that he missed her. Missed everything about her. That much he knew. She excited him, challenged him, frustrated him, consumed him, drew him, made him feel. He did not want to be without her.</p><p>Something soft brushed his shoulder. He barely managed to tear his gaze from Bianka to turn and see that Olivia was now sitting beside him.</p><p>What was wrong with him? He hadn’t heard her arrive. Normally his senses were tuned, alert.</p><p>“Why did you summon me here?” she asked. She glanced around nervously. Her dark curls framed her face, rosebuds dripping from a few of the strands.</p><p>“To Budapest? Because you are always here anyway.”</p><p>“As are you these days,” she replied dryly.</p><p>He shrugged. “Did you just come from Aeron’s room?”</p><p>She gave a reluctant nod.</p><p>“Raphael came to me,” he said. The day he’d lost Bianka. The worst day of his existence.</p><p>“Those flowers aren’t centered, B,” the redheaded Kaia called, claiming his attention and stopping the rest of his speech to his charge. “Shift them a little to the left.”</p><p>Bianka expelled a frustrated sigh. “Like this?”</p><p>“No. My left, dummy.”</p><p>Grumbling, Bianka obeyed.</p><p>“Perfect.” Kaia beamed up at her.</p><p>Bianka flipped her off, and Lysander grinned. Thank the One True Deity he had not killed all of her spirit.</p><p>“I think they’re perfect, too,” her youngest sister, Gwendolyn, said.</p><p>Bianka released the ceiling panels and dropped to the floor. When she landed, she straightened as if the jolt had not affected her in any way. “Glad the princess is finally happy with something,” she muttered. Then, more loudly, “I don’t understand why you can’t get married in a tree like a civilized Harpy.”</p><p>Gwen anchored her hands on her fists. “Because my dream has always been to be wed in a chapel like any other normal person. Now, will someone please remove the naked portraits of Sabin from the walls? Please.”</p><p>“Why would you want to get rid of them when I just spent all that time hanging them?” Anya, goddess of Anarchy and companion to Lucien, keeper of Death, asked, clearly offended. “They add a little something extra to what would otherwise be very boring proceedings. My wedding will have strippers. Live ones.”</p><p>“Boring? Boring!” Fury passed over Gwen’s features, black bleeding into her eyes, her teeth sharpening.</p><p>Lysander had watched this same change overtake her multiple times already. In the past hour alone.</p><p>“It won’t be boring,” Ashlyn, companion to Maddox, the keeper of Violence, said soothingly. “It’ll be beautiful.”</p><p>The pregnant woman rubbed her rounded belly. That belly was larger than it should have been, given the early state of her pregnancy. No one seemed to realize it, though. They would soon enough, he supposed. He just hoped they were ready for what she carried.</p><p>What would a child of Bianka’s be like? he suddenly wondered. Harpy, like her? Angel, like him? Or a mix of both?</p><p>A pang took root and flourished in his chest.</p><p>“Boring?” Gwen snarled again, clearly not ready to let the insult slide.</p><p>“Great!” Bianka threw up her arms. “Someone get Sabin before Gwennie kills us all in a rage.”</p><p>A Harpy in a rage could hurt even other Harpies, Lysander knew. As Gwen’s consort, Sabin, keeper of Doubt, was the only one who could calm her.</p><p>With that thought, Lysander’s head tilted to the side. He had never seen Bianka erupt, he realized. She’d viewed everything as a game. Well, not true. Once, she had gotten mad. The time Paris had punched him. Lysander had been her enemy, but she’d still gotten mad over his mistreatment.</p><p>Lysander had calmed her.</p><p>The pang grew in intensity, and he rubbed his breastbone. Was he Bianka’s consort? Did he want to be?</p><p>“No need to search me out. I’m here.” Sabin strode through the double doors. “As if I’d be more than a few feet away when she’s so sensitiv—uh, just in case she needed my help. Gwen, baby.” There at the end, his tone had lowered, gentled. He reached her and pulled her into his arms; she snuggled against him. “The most important thing tomorrow is that we’ll be together. Right?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Lysander,” Olivia said, drawing his attention from the now-cooing couple. “The wait is difficult. Raphael came to you and...what?”</p><p>Lysander sighed, forcing himself to concentrate. “Answer a few questions for me first.”</p><p>“All right,” she said after a brief hesitation.</p> <p>“Why do you like Aeron when he is so different from you?”</p><p>She twisted the fabric of her robe. “I think I like him because he is so different from me. He has thrived amid darkness, managing to retain a spark of light in his soul. He is not perfect, is not blameless, but he could have given in to his demon long ago and yet still he fights. He protects those he loves. His passion for life is...” She shivered. “Amazing. And really, he only hurts people when his demon overtakes him—and only if they are wicked, at that. Innocents, he leaves alone.”</p><p>It was the same with Bianka. Yet Lysander had tried to make her ashamed of herself. Ashamed when she should only be proud of what she had accomplished, thriving amid darkness, as Olivia had said. “And you are not embarrassed for our kind to know of your affection for him?”</p><p>“Embarrassed of Aeron?” Olivia laughed. “When he is stronger, fiercer, more alive than anyone I know? Of course not. I would be proud to be called his woman. Not that it could ever happen,” she added sadly.</p><p>Proud. There was that word again. And this time, something clicked in his mind. I’m not going to be your secret shame, Lysander, Bianka had said. He’d reminded her that she committed all her other sins in secret. Why not him? She hadn’t told him the answer, but it came to him now. Because she’d been proud of him. Because she’d wanted to show him off.</p> <p>As he should have wanted to show her off.</p><p>Any other man would have been proud to stand beside her. She was beautiful, intelligent, witty, passionate and lived by her own moral code. Her laughter was more lovely than the song of a harp, her kiss as sweet as a prayer.</p><p>He’d considered her the spawn of Lucifer, yet she was a gift from the One True Deity. He was such a fool.</p><p>“Have I answered your questions sufficiently?” Olivia asked.</p><p>“Yes.” He was surprised by the rawness of his voice. Had he ruined things irreparably between them?</p><p>“So answer a few now for me.”</p> <p>Unable to find his voice, he nodded. He had to make this right. Had to try, at least.</p><p>“Bianka. The Harpy you watch. Do you love her?”</p><p>Love. He found her among the crowd and the pang in his chest grew unbearable. She was currently adding a magic marker mustache to one of Sabin’s portraits while Kaia added...other things down below. Kaia was giggling; Bianka looked like she was just going through the motions, taking no joy.</p><p>He wanted her happy. Wanted her the way she’d been.</p><p>“You think you are embarrassed of her,” Olivia continued when he gave no response.</p><p>“How do you know?” He forced the words to leave him.</p><p>“I am—or was—a joy-bringer, Lysander. It was my job to know what people were feeling and then help them see the truth. Because only in truth can one find real joy. You were never embarrassed of her. I know you. You are embarrassed by nothing. You were simply scared. Scared that you were not what she needs.”</p><p>His eyes widened. Could that be true? He’d tried to change her. Had tried to make her what he was so that she, in turn, would like what he was? Yes. Yes, that made sense, and for the second time in his existence, he hated himself.</p> <p>He had let Bianka get away from him. When he should have sung her praises to all of the heavens, he had cast her aside. No man was more foolish. Irreparable damage or not, he had to try and win her back.</p><p>He jumped to his feet. “I do,” he said. “I love her.” He wanted to throw his arms around her. Wanted to shout to all the world that she belonged to him. That she had chosen him as her man.</p><p>His shoulders slumped. Chosen. Key word. Past tense. She would not choose him again. She did not give second chances, she’d said.</p><p>She often lies...</p><p>For the first time, the thought that his woman liked to lie caused him to smile. Perhaps she had lied about that. Perhaps she would give him a second chance. A chance to prove his love.</p><p>If he had to grovel, he would. She was his temptation, but that did not have to be a bad thing. That could be his salvation. After all, his life would mean nothing without her. Same for her. She had told him that he was her own temptation. He could be her salvation.</p><p>“Thank you,” he told Olivia. “Thank you for showing me the truth.”</p><p>“Always my pleasure.”</p><p>How should he approach Bianka? When? Urgency flooded him. He wanted to do so now. As a warrior, though, he knew some battles required planning. And as this was the most important battle of his existence, plan his attack he would.</p><p>If she forgave him and decided to be with him, they would still have a tough road ahead. Where would they live? His duties were in the heavens. She thrived on earth, with her family nearby. Plus, Olivia was destined to kill Aeron, who would essentially be Bianka’s brother-in-law after tomorrow. And if Olivia decided not to, another angel would be chosen to do the job.</p><p>Most likely, that would be Lysander.</p><p>One thing his Deity had taught him, however, was that love truly could conquer all. Nothing was stronger. They could make this work.</p><p>“I’ve lost you again,” Olivia said with a laugh. “Before you rush off, you must tell me why you summoned me. What Raphael said to you.”</p><p>Some of his good mood evaporated. While Olivia had just given him hope and helped him find the right path, he was about to dash any hopes of a happily-ever-after for her.</p><p>“Raphael came to me,” he repeated. Just do it; just say it. “He told me of the council’s unhappiness with you. He told me they grow weary of your continued defiance.”</p><p>Her smile fell away. “I know,” she whispered. “I just...I haven’t been able to bring myself to hurt him. Watching him gives me joy. And I deserve to experience joy after so many centuries of devoted service, do I not?”</p><p>“Of course.”</p><p>“And if he is dead, I will never be able to do the things I now dream about.”</p><p>His brow furrowed. “What things?”</p><p>“Touching him. Curling into his arms.” A pause. “Kissing him.”</p><p>Dangerous desires indeed. Oh, did he know their power. “If you never experience them,” he offered, “they are easier to resist.” But he hated to think of this wonderful female being without something she wanted.</p><p>He could petition the council for Aeron’s forgiveness, but that would do no good. A decree was a decree. A law had been broken and someone had to pay. “Very soon, the council will be forced to offer you a choice. Your duty or your downfall.”</p><p>She gazed down at her hands, once again twisting the fabric of her robe. “I know. I don’t know why I hesitate. He would never desire me, anyway. The women here, they are exciting, dangerous. As fierce as he is. And I am—”</p><p>“Precious,” he said. “You are precious. Never think otherwise.”</p><p>She offered him a shaky smile.</p><p>“I have always loved you, Olivia. I would hate to see you give up everything you are for a man who has threatened to kill you. You do know what you would be losing, yes?”</p><p>That smile fell away as she nodded.</p><p>“You would fall straight into hell. The demons there will go for your wings. They always go for the wings first. No longer will you be impervious to pain. You will hurt, yet you will have to dig your way free of the underground—or die there. Your strength will be depleted. Your body will not regenerate on its own. You will be more fragile than a human because you were not raised among them.”</p><p>While he thought he could survive such a thing, he did not think Olivia would. She was too delicate. Too...sheltered. Until this point, every facet of her life had dealt with joy and happiness. She had known nothing else.</p><p>The demons of hell would be crueler to her than they would be even to him, the man they feared more than any other. She was all they despised. Wholly good. Destroying such innocence and purity would delight them.</p><p>“Why are you telling me this?” Her voice trembled. Tears streaked down her cheeks.</p><p>“Because I do not want you to make the wrong decision. Because I want you to know what you’re up against.”</p><p>A moment passed in silence, then she jumped up and threw her arms around his neck. “I love you, you know.”</p><p>He squeezed her tightly, sensing that this was her way of saying goodbye. Sensing that this would be the last time they were offered such a reprieve. But he would not stop her, whatever path she chose.</p><p>She pulled back and smoothed her trembling hands down her glistening white robe. “You have given me much to consider. So now I will leave you to your female. May love always follow you, Lysander.” As she spoke, her wings expanded. Up, up she flew, misting through the ceiling—and Bianka’s flowers—before disappearing.</p><p>He hoped she’d choose her faith, her immortality, over the keeper of Wrath, but feared she would not. His gaze strayed to Bianka, now walking down the aisle toward the exit. She paused at his row, frowned, before shaking her head and leaving. If he’d been forced to pick between her and his reputation and lifestyle, he would have picked her, he realized.</p><p>And now it was time to prove it to her.</p><p>CHAPTER THIRTEEN</p><p>I’VE GOT TO PULL MYSELF from this funk, Bianka thought. This was her youngest sister’s wedding day. She should be happy. Delighted. If she were honest, though, she was a tiny bit—aka a lot—jealous. Gwen’s man, a demon, loved her. Was proud of her.</p><p>Lysander considered Bianka unworthy.She’d thought about proving herself to him, but had quickly discarded the idea. Proving herself worthy—his idea of worthy, that is—would entail nothing more than a lie. And Lysander hated lies. So, according to him, she would never be good enough for him. Which meant he was stupid, and she didn’t date stupid men. Plus, he didn’t deserve her.</p><p>He deserved to rot in his unhappiness. And that’s what he’d be without her. Unhappy. Or so she hoped. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So much for our plan to go naked,” Kaia muttered beside her. “Gwen saw me leave my room that way and almost sliced my throat.”</p><p>“Did not,” the bride in question said from behind them.</p><p>They turned in unison. Bianka’s breath caught as it had every time she’d seen her youngest sister in her gown. It was a princess cut, which was fitting, the straps thin, the beautiful white lace cinching just under her breasts before flowing to her ankles. The material covering her legs was sheer, allowing glimpses of thigh and those gorgeous red heels.</p> <p>Her strawberry curls were half up, half down, diamonds glittering through the strands. There was so much love and excitement in her gold-gray eyes it was almost blinding.</p><p>“I almost pushed you out a window,” Gwen added.</p><p>They laughed. Even stoic Taliyah, their oldest sister, who had her arm wrapped through Gwen’s. Since it turned out Gwen’s father was the Lords’ greatest enemy, and Gwen’s mom had disowned her years ago, Taliyah was escorting Gwen down the aisle.</p><p>“Hence the reason I’m now wearing this.” Kaia motioned to her own gown, an exact match to Bianka’s. A buttercup yellow creation with more ribbons, bows and sequined rose appliqués than anyone should wear in an entire lifetime. They even wore hats with orange streamers.</p><p>Gwen shrugged, unrepentant. “I didn’t want you looking prettier than me, so sue me.”</p> <p>“Weddings suck,” Bianka said. “You should have just had Sabin tattoo your name on his ass and called it good.” That’s what she would have done. Not that Lysander ever would have agreed to such a thing. Whether they were together or not.</p><p>Which they never would be. Bastard.</p><p>“I did. Have him tattoo my name on his ass,” Gwen said. “And his arm. And his chest. And his back. But then I casually mentioned how much I’d always wanted a big wedding, and well, he told me I had four weeks to plan it or he’d take over and do it himself. And everyone knows men can’t plan shit. So...” She shrugged again, though the excitement and love on her face had intensified. “Are they ready for us yet?”</p><p>Bianka and Kaia turned back to the chapel, peeking through the crack in the closed doors.</p><p>“Not yet,” Bianka said. “Paris is missing.”</p><p>Paris, who had gotten ordained over the Internet, would be presiding over the nuptials.</p> <p>“He better hurry,” she added grumpily. “Or I’ll find a way to make him oil-wrestle again.”</p><p>“You’ve been so depressed lately. Missing your angel?” Kaia asked her, pinkie-waving to Amun, who stood in the line of groomsmen beside Sabin at the altar.</p><p>Amun shouldn’t have been able to see her, but somehow he did. He nodded, a smile twitching at the corners of his lips.</p><p>“Of course not. I hate him.” A lie. She hadn’t told her sisters why she and Lysander had parted, only that they had. Forever. If they knew the truth, they’d want to kill him. And as all but Gwen were paid killers, immensely good at their job, she’d find herself the proud owner of Lysander’s head.</p><p>Which she didn’t want.</p><p>She just wanted him. Stupid girl.</p><p>“I only would have teased you for a few years, you know,” Kaia said. “You should have kept him around. It might have been fun to corrupt him.”</p><p>He didn’t want to be corrupted any more than she wanted to be purified. They were too different. Could never make anything work. Their separation was for the best. So why couldn’t she get over it? Why did she feel his gaze on her, every minute of every day? Even now, when she looked like a Southern belle on crack?</p> <p>“So Sabin doesn’t have a last name,” she said to Gwen, drawing attention away from herself. “Are you going to call yourself Gwen Sabin?”</p><p>“No, nothing like that. I’m going to call myself Gwen Lord.”</p><p>“What’s Anya plan to call herself? Anya Underworld?” Kaia asked with a laugh.</p><p>“Knowing our goddess, she’ll demand Lucien take her last name. Trouble. Or is that her middle name?”</p><p>“I here, I here,” a voice suddenly screeched. Legion pushed her way in front of Bianka and Kaia. She was wearing a yellow dress, as well. Only hers had more ribbons, bows and sequins. A basket of flowers was clutched in her hands, her too-long nails curling around the handle. Best of all, she wore a tiara. Because she didn’t have hair, it had had to be glued to her scaled head. “We begin now.”</p><p>She didn’t wait for permission but shouldered her way through the door. The crowd—which consisted of the Lords of the Underworld, their companions and some gods and goddesses Anya knew—turned and gasped when they saw her. Well, except for Gideon. He’d recently been captured and tortured by Hunters, the Lords’ nemeses, and was currently missing his hands. (His feet weren’t in the best of shape, either.) Because of his injuries, he was beyond weak, so he lay in his gurney, barely conscious. He’d insisted on coming, though.</p><p>From his pew, Aeron smiled indulgently as Legion tossed pink petals in every direction. Just as she reached the front, Paris raced to the podium. He looked harried, pale, and Sabin punched him in the shoulder.</p><p>Sabin looked amazing. He wore a black tux, his hair slicked back, and when he turned to face the door, watching for Gwen, his entire face lit. With love. With pride. Bianka’s jealousy increased. She wanted that. Wanted her man to find her perfect in every way.</p><p>Was that too much to ask?</p><p>Apparently so. Stupid Lysander.</p><p>“Go, go, go,” Gwen ordered, giving them a little push.</p><p>Bianka kicked into motion, heading toward Strider, her appointed groomsman. He smiled at her when she reached him. He would be proud to call her his woman, she thought. She tried to make herself return the gesture, but her eyes were too busy filling with tears. She looked around, trying to distract herself.</p><p>The chapel really was beautiful. The glittery white flowers she’d hung from the ceiling were thick and lush and offered a canopy, a haven. They were the best part of the decor, if you asked her. Candles flickered with golden light, twining with shadows.</p><p>Kaia approached her side, and everyone except for Gideon stood. The music changed, slowing down to the bridal march. Gwen and Taliyah appeared. Sabin’s breath caught. Yes, that was the way a man should react to the sight of his woman.</p><p>What makes you think you were ever Lysander’s woman?</p><p>Because she was his one temptation. Because of the reverent way he had touched her. Because she liked how he made her feel. Because they balanced each other. Because he completed her in a way she hadn’t known she needed. He was the light to her darkness.</p><p>He was willing to show you that light. Over and over again.</p><p>Perhaps she should have fought for him. That’s what she was, after all. A fighter. Yet she’d given in as if he meant nothing to her when he had somehow become the most important thing in her life.</p><p>Bianka didn’t mean to, but she tuned out as Paris gave his speech and the happy couple recited their vows, her thoughts remaining focused on Lysander. Should she try and fight for him now? If so, how would she go about it?</p><p>Only when the crowd cheered did she snap out of her haze, watching as Sabin and Gwen kissed. Then they were marching down the aisle and out the doors together. The rest of the bridal party made their way out, as well.</p><p>“Shall we?” Strider asked, holding out his arm for her.</p><p>“She can’t.” Paris grabbed her arm. “You’re needed in that room.” With his free hand, he pointed.</p><p>“Why?” Was he planning revenge against her for forcing him to oil-wrestle Lysander? He hadn’t mentioned it in the days since her return to Buda, but he couldn’t be happy with her. He should be thanking her, for gods’ sake. He’d gotten to touch all of Lysander’s hawtness.</p><p>Paris rolled his eyes. “Just go before your boyfriend decides he’s tired of waiting and comes out here.”</p><p>Her boyfriend. Lysander? Couldn’t be. Could it? But why would he have come? Heart drumming in her chest, she walked forward. She didn’t allow herself to run, though she wanted to soooo badly. She reached the door. Her hand shook as she turned the knob.</p><p>Hinges creaked. Then she was staring into—an empty room. Her teeth ground together. Paris’s revenge, just as she’d figured. Of course. That rat bastard piece of shit was going to pay. She wasn’t just going to make him oil-wrestle. She was going to—</p><p>“Hello, Bianka.”</p><p>Lysander.</p><p>Gasping, she whipped around. Her eyes widened. In an instant, the chapel had been transformed. No longer were her sisters and friends inside. Lysander and his kind occupied every spare inch. Angels were everywhere, light surrounding them and putting Gwen’s candles to shame.</p><p>“What are you doing here?” she demanded, not daring to hope.</p><p>“I came to beg your forgiveness.” His arms spread. “I came to tell you that I am proud to be your man. I brought my friends and brethren to bear witness to my proclamation.”</p><p>She swallowed, still not letting hope take over. “But I’m evil and that’s not going to change. I’m your temptation. You could, I don’t know, lose everything by being with me.” The thought hit her, and she wanted to wilt. He could lose everything. No wonder he had wanted to destroy her. No wonder he had wanted to hide her.</p><p>“No, you are not evil. And I don’t want you to change. You are beautiful and intelligent and brave. But more than that, you are my everything. I am nothing without you. Not good, not right, not complete. And do not worry. I will not lose everything as you said. You have not committed an unpardonable sin.”</p><p>She gulped. “And if I do?”</p><p>“I will fall.”</p><p>Okay. A small kernel of hope managed to seep inside her. But no way would she let him fall. Ever. He loved being an angel. “What brought this on?”</p><p>“I finally pulled my head out of my ass,” he said dryly.</p><p>He’d said ass. Lysander had just said the word ass. More hope beat its way inside and she had to press her lips together to keep from smiling. And crying! Tears were springing in her eyes, burning. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Could they actually make their relationship work? Just a little bit ago, she’d been grateful—or pretending to be grateful—that they were apart, since so many obstacles existed.</p><p>“I only hope you can love so foolish a man. I am willing to live wherever you desire. I am willing to do anything you need to win you back.” He dropped to his knees. “I love you, Bianka Skyhawk. I would be proud to be yours.”</p><p>He was proud of her. He wanted her. He loved her. It was everything she’d secretly dreamed about this past week. Yes, they could make this work. They would be together, and that was the most important thing. But she told him none of that.</p> <p>“Now?” she screeched instead. “You decided to introduce me to your friends now? When I look like this?” Scowling, she peeked over his shoulder at them and saw their stunned expressions. “I usually look better than this, you know. You should have seen me the other day. When I was naked.”</p><p>Lysander stood. “That’s all you have to say to me?”</p><p>She focused back on him. His eyes were as wide as hers had been, his arms crossed over his middle. “No. There’s more,” she grumbled. “But I will never live this yellow gown thing down, you know.”</p><p>“Bianka.”</p><p>“Yes, I love you, too. But if you ever decide I’m unworthy again, I’ll show you just how demonic I can be.”</p> <p>“Deal. But you don’t have to worry, love,” he said, a slow smile lifting those delectable lips. “It is I who am unworthy. I only pray you never learn of this.”</p><p>“Oh, I know it already,” she said, and his grin spread. “Now c’mere, you.” She cupped the back of his neck and jerked him down for a kiss.</p><p>His arms banded around her, holding her close. She’d never thought to be paired with an angel, but she couldn’t regret it now. Not when Lysander was the angel in question.</p><p>“Are you sure you’re ready for me?” she asked him when they came up for air.</p><p>He nipped at her chin. “I’ve been ready for you my entire life. I just didn’t know it until now.”</p><p>“Good.” With a whoop, she jumped up and wound her legs around his waist. A wave of gasps circled the room. They were still here? “Ditch your friends, I’ll blow off my sister’s reception and we’ll go oil-wrestle.”</p> <p>“Funny,” he said, wings enveloping her as he flew her up, up and into his cloud. “That’s exactly what I was thinking.” </p> </body></html>"]