["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Rafe Steele gazed at his two older brothers and bit back his instinct to bolt. Of course, he held his ground like he protected his unit. Another lesson he learned from the cradle. When his brothers scented weakness, they attacked accordingly.</p><p>“You want me to what?” he asked again.</p><p>Odd how all of them seemed to belong to three different families. As the oldest, Rick always dominated both the conversation and the scene, and his resemblance to Thor, as his sister-in-law phrased it, didn’t hurt his image. Golden locks, tawny eyes, and a brutish build caused a person to look for his hammer. Of course, Rafe held that comment back. The last time he’d teased Rick about Thor-like powers, he almost caught a black eye. Definitely no sense of humor there.</p> <p>Rome acted just as bad. He belonged in the George Clooney camp, as his second sister-in-law confided, with his buzzed prematurely gray hair, blue eyes, and a confidence and charm that made females drop their panties. As one of the best dealers in Vegas, Rome consistently threatened Rick’s command. Of course, since he’d also recently fallen into the marriage entrapment, his domestic bliss softened him a bit. He seemed to completely agree with his brother, and that left Rafe as the focus of this intervention.</p><p>The other men exchanged knowing glances.</p><p>“We want you to book a date through Madame Eve’s service, 1Night Stand,” Rick said.</p><p>Rafe struggled to make sense of his words over the familiar casino noises of ringing slots, heavy drinking, and loud rivalry.</p><p>“The place you both ended up meeting your wives?”</p> <p>Rome nodded.</p><p>Rafe gave them a snort of laughter and ordered a shot of Jack Daniels. “You’re fucking nuts. Both of you. I have no intention or desire to get married.”</p><p>Rick huffed. “We’re not saying the date is going to get you married, bro. Yeah, we got lucky, but there’s no way even Madame Eve has those types of odds. Both of us agree you’ve been a bit out of it since you moved to Vegas. You keep to yourself, don’t date much anymore. Something’s up.”</p><p>He waved his brothers’ concern away and tossed back his shot in one stinging swallow. Surprised by their insight, he admitted he’d been restless and agitated since moving across the US to join them in their legacy of dealing cards. He’d tried living in Atlantic City when he returned back from Iraq, but the local newshounds battered him on a daily basis. When the women started camping out to make up ruses to bed a real-time hero, he packed up his belongings and moved on. He craved a clean slate and a place where he could get back to what he loved. Dealing cards. Alone. By choice.</p><p>His brothers thought he suffered from war stress—specifically post-traumatic stress disorder. Sure, he’d experienced some wicked nightmares, but his uneasiness and secrecy had nothing to do with his military past.</p><p>If only they knew the truth.</p> <p>An intriguing idea skipped through his mind with various scenarios. “So, let me get this straight. I can request a one-night stand through Madame Eve, and she’ll find a woman to meet all my requirements?”</p><p>Rick grinned. “You got it. One perfect night to release your tension. No worries about tomorrow. Any secret fantasy ready to come true.”</p><p>Rome elbowed him in the ribs. “Why do I think you have something wicked planned? Probably involving a pretty sub tied to the bed.”</p><p>“Like Sloane?” Rafe asked.</p><p>Immediately, Rome’s face darkened at the mention of his wife’s sex life. “Back off, bro.”</p><p>Rafe released a shout of laughter. “Priceless, man. I’m just joking around—you know I adore Sloane.” But Rome’s assumption that he practiced as a Dom punched his gut.</p><p>“Umm, is my list kept a secret? How reputable is Madame Eve?”</p><p>Rick and Rome shared a glance at the mention of the esteemed woman. “We trust her completely. Everything you ask for is confidential. Even from us.”</p> <p>He held back a chuckle and wondered why the utterance of her name caused them both to bow their heads in respect. Damn, this got more interesting by the moment. He’d get his brothers off his back, have a great night of sex, and be able to act out one of his secret sexual fantasies. And no one ever had to know.</p><p>“You paying for it?” he asked.</p><p>Rick shook his head and took another swig of beer. “Bastard.”</p><p>“Well, are you?”</p><p>“Yeah, we’re paying for it. Consider this our housewarming present a few months late.”</p><p>Rafe grinned. “Get me the papers to sign, boys. I’m ready.”</p><p>Summer Preston ordered a second shot of tequila and watched the show on stage at Strip It. The sexy lyrics of Prince’s Gett Off pounded through the air while the stripper gyrated her hips and ripped off her leather vest. Her naked breasts spilled out and the crowd screamed. Her skin glittered with silver sparkles, and she flung her whip toward her audience with a teasing flick that made them go wild. Summer narrowed her eyes thoughtfully on the instrument that provided both pleasure and pain. Hmm, would it be too much for the first night?</p><p>Yeah. She’d skip the whips and flogger. At least for tonight.</p><p>She scanned the entrance. Excitement jumped in her belly. They’d both agreed meeting in the suite would be postponed until they decided if they were compatible. She’d heard wonderful things about Madame Eve and her 1Night Stand company. Over the years, her luck with finding the correct match on her own proved...difficult. Most men switched from arousal to horror when they caught a glance of her leather catsuit and domineering growl. Pete had lunged for the door so fast he’d literally tripped on the rug and fell face first.</p><p>Awkward.</p><p>She shook her head at the memory. Nope, she’d suggested meeting at the strip club first to make sure they clicked. She’d been specific in her requirements, and thought of this as her first real learning experience in the BDSM world. Hell, maybe the reality wouldn’t even come close to her fantasies and she could go back to normal vanilla sex. After all, her reputation and her image fed the girl next door persona. Her few visits to a BDSM club scared the crap out of her, and her forays into toys and certain internet sites never snagged a willing partner. At least she learned the importance of safety and equipment, but never experienced her own personal sub for the night. She needed to face the truth: strong, dominant males attracted her in the real world, but she craved a man’s surrender in the bedroom. That combination rarely existed. The possibility of experiencing such a scene for one night tempted her. Pricey, but worth it.</p><p>If he showed.</p><p>She tapped a scarlet red fingernail on the bar.</p><p>And waited.</p><p>Rafe pushed his way into the club and took stock of the surroundings. Only a few months in Vegas proved the city boasted the best strip clubs in the country. The unique mix of class, club scene, and nakedness pulled in record crowds. The three main bars were strategically placed around the room. One snaked around the perimeter of the stage, and the others huddled in dark corners, which lent to the aura of sensuality and privacy. The catwalk glittered with vivid neon colors and sparkles, and flashed in time to whatever music currently played. Skimpily dressed waiters and waitresses balanced trays of cocktails, as they shifted around onlookers watching the trio of half-clothed women doing a mock up of the Flashdance skit. When water splashed the front rows, cheers rang through the air. Two dance floors on the second level looked over the stage, and catered to the club crowd.</p><p>Damn, he loved Vegas. He headed toward the bar in the far back, where they’d agreed to meet. He’d been impressed with her rendezvous choice, agreeing the suite was too personal for an introduction. A sensual feast of visual and physical stimuli, Strip It urged sexual explorations to the fullest. He hoped the scene proved a good precursor to his evening.</p><p>He only had a general description of his one-night stand, choosing to forego the photo as he wanted to be surprised. He relied on two factors only. She sat at the corner left barstool and had blonde hair. He expected a sexual vixen dressed in leather with a kick ass personality.</p><p>Instead, his gaze cut straight to an angel.</p><p>Crap.</p><p>She was all wrong.</p><p>The woman sat at the bar with a shot at her elbow, her jeans and simple white T-shirt fading into the crowd of peacocks mingling around her. His heart sank. A Dominatrix? Impossible. He’d eat her up in one bite and she’d be screaming for the door. Fighting his temper, he clenched his jaw. Attractive, yes. Her shimmering white-blonde hair gleamed like a halo in a ponytail. Big, china blue eyes dominated her softly curved face. A generous bow curved her lower lip and she had a killer body, evident in the perfect hour glass waist, small, high breasts with perky nipples, and a luscious ass sitting atop the red leather barstool. He studied her white Keds and almost groaned in defeat. Not even a spiked heel in sight. He was screwed.</p><p>And not in a good way.</p><p>Madame Eve had finally reached the end of her winning streak. With a deep, resigned breath, he closed the distance between them.</p><p>“Summer?” His tongue stumbled over her name, the image of a sweet, sunny girl next door-type adding to his disgust.</p><p>She stared up at him with frank appraisal. She didn’t answer for a while. Surprise coursed through him as the baby blues started at the top of his head, lowered to his chest, and scanned his arms. Then dropped.</p><p>He hardened when her hot gaze caressed him between the legs, and he shifted uneasily. Who the hell is this woman?</p><p>Completing her inspection, she nodded her approval. “Rafe, I assume?” Her voice was cool. “You’ll do fine.”</p><p>His mouth snapped closed. “Uh, glad to hear it.” A short silence settled between them and she made no move to speak. Just lifted the shot glass and tipped it, then slid her tongue over her plump lower lip to grab the last drop of liquid. He imagined the sting of the tequila hot down her throat, chased by the tart lime she sucked on. His cock strained to full attention. God, how firm would her lips grasp it? Sexual attraction jumped between them like a live wire. He just needed to confirm she was strong enough to handle him. He motioned toward the two empty shot glasses. “Potent stuff. Wouldn’t want you drunk on our first date.”</p><p>The wicked grin she shot him transformed her face from angel to Eve. “Don’t worry, I have a high tolerance.” His gaze roamed over her petite frame and he lifted a brow. She laughed. “Let’s share a drink and decide if we want to take this to the suite. Beer?”</p><p>“Jack Daniels.”</p><p>“Nice.” She lifted her arm for the bartender. He let her order the drinks, deciding to hold back further judgment until he got a better reading. So far, the woman fascinated the hell out of him. They clinked glasses. “To a memorable night,” she toasted. The shot disappeared down her throat without a flinch and she leaned forward. “What do you think?”</p><p>His lips quirked in amusement. “About what?”</p><p>“About me. About us. About tonight.”</p><p>He studied her from over his shot glass. “You’re not what I expected when I signed on for this.”</p><p>Instead of being offended, she nodded glumly. “You expected leather and heels, huh? I’m more like the wholesome girl next door. Is it the Keds?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He sputtered with laughter. “Yeah, the sneakers didn’t help. Look, this is new to me. I come from a background where I yell jump, and a bunch of men ask ‘how high.’ It won’t be easy for me to just snap to attention, and I don’t want to intimidate you.”</p><p>She raised her chin. Pure challenge sparked in her eyes. “I understand, and this is all new to me, too. That’s why I didn’t want to meet you at a club dressed to the nines. I can’t help that I look like this. This is who I am day to day. I like a man to buy me dinner and open the door. I love knowing he’s stronger than me, can kick some major ass, and won’t back down from a good, old-fashioned bar room fight. But in the bedroom, I want to be in charge. At least, I think I do.”</p><p>He sucked in a breath at her honesty. Hmmm, a bit of a spitfire in a nice, neat package. Isn’t that what he craved? A woman who wouldn’t be afraid to tell him what she wanted, and what she wanted him to do? He was sick to death of being a leader every waking moment. Domination came easily to him, always had. In school his classmates gravitated toward him for captain; he’d always been picked by his teachers to lead group discussions. When he joined the military, his natural confidence and quest for perfection pushed him to the head of the class. He’d risen quickly up the ranks, until he found himself in the scorching desert, leading a brigade of men in war. Every order equaled life or death, with no room for error.</p><p>His decision not to re-up changed the game. He went back to Atlantic City with an open mind, and enjoyed getting back to his main love—dealing cards. But when a long line of women with endless needs began draining his energy instead of fueling it, he knew something was wrong. His mind tired of doing all the work, and his body began to suffer. When a gorgeous woman who wanted to be subservient begged for his command and his cock never hardened, he’d gone into hibernation mode.</p><p>Maybe he needed Summer Preston.</p><p>Maybe.</p><p>He raked his gaze over her figure. Tipped back his glass and swallowed the burning liquid. “Let’s go.”</p><p>She shot to her feet and pressed a room key in his hands. “Castillo Resorts, the penthouse. Give me a fifteen-minute head start.”</p><p>He nodded and watched her disappear into the crowd.</p><p>Chapter Two</p><p>Summer paced the lushly carpeted suite and tried to ignore the flutter in her tummy. In a minute, she’d open her door to an overpowering, sexy male predator who she’d try to subjugate to her every sexual whim.</p><p>Yeah, right.</p><p>She pushed the doubt firmly out of her mind. Rafe Steele was unexpected. She’d always had a weakness for the tall, dark and handsome type, but the man put them all to shame. Sinfully inky eyes promised a quick trip to heaven, and dark curls begged a woman to thrust her fingers in deep and hang on. His face was all rough planes and angles—sharp cheekbones, a crooked nose, shaggy dark brows, an unshaven chin. His mouth held a sensual, almost cruel curve that stripped away any pretty boy looks and made a man look twice and a woman salivate.</p><p>His body appeared rock hard and unforgiving. Even in his black shirt and matching pants, the muscles rippled beneath the fabric. She guessed he topped six feet, but it was the sheer dominance of his presence that pressed upon her. An aura of command when he spoke. He struck her as a man used to being in charge.</p><p>She bet women lined up to do his bidding. Yet, he hadn’t backed off when she’d adopted a forceful tone in their conversation. In fact, his dark eyes flashed with a gleam of interest. And lust.</p><p>A knock sounded on the door.</p><p>Showtime.</p><p>She took a deep breath and let him in.</p><p>Her throat tightened. Dear God, the man practically exuded sex. Even his scent screamed animal mating, like smoke and musk and earth rolled together. He stalked into her room as though he owned it. He still wore his regulation uniform, pegging him as a dealer, but the silk surrendered to his carved chest and molded to his powerful thighs and ass.</p><p>His shocked stare told her she’d done her job well. Satisfaction flared, along with a hint of feminine power. The girl next door had turned into a vixen, and she relished every moment of enveloping sexual authority. The skin tight leather cat suit with heels transformed her from sweet teacher to badass.</p><p>She pursed her lips and studied him, making a circling motion with her finger.</p><p>“Turn around.”</p><p>One brow shot up. His face tightened with a mingling of emotions. Arrogance. Denial.</p> <p>Excitement.</p><p>Yes, he loved taking orders from a woman, as much as she loved giving them. The problem centered on his acceptance and trust of her as a mistress. She ached to give him what he craved, but first he’d have to submit to his own dark desires. A man used to control and leadership in all other areas of his world would be hard pressed to easily accept such a switch of power even if he wanted to.</p><p>“What?”</p><p>He looked as if he didn’t recognize her from the strip club and had entered the Twilight Zone. Satisfaction coursed through her at his response. “Tonight you will address me as Summer. I have not earned your trust yet to be called Mistress. The rules are simple. You obey my every order without question. If you refuse, you will be punished. Your body belongs to me until dawn breaks. Are we clear?”</p><p>He nodded.</p><p>Her voice snapped like a whiplash. “I didn’t hear you.”</p><p>“Yes. Summer.” His instant response surged heat through her veins. A tight ache settled between her thighs.</p><p>“Very good. You will need a safe word. Think of one you’ll easily remember. If you use your safe word, the scene will immediately stop. We will decide if the evening can continue afterward. What is your word?”</p><p>“Blackjack.”</p><p>“Blackjack, it is. Now, turn around in a full circle. Slowly.”</p><p>The simple test confirmed her assumptions. He obeyed, his muscles tight with tension. He shot her a look hinting he’d do what she said, but she also knew restraints would definitely be needed for the night.</p><p>“Your body is incredible. I can’t wait until you’re able to pleasure me. But we’re not ready for that yet. Strip.”</p><p>He blinked. Refused to move. She closed the distance between them with two long strides and met his gaze head on. “I don’t like to repeat myself.” Her voice was icy. “Take off your clothes so I can see every gorgeous inch that belongs to me. Hesitate again and you’ll be punished.”</p><p>He jolted as if awakening from a dream, and removed his clothes.</p><p>She caught her breath. Wide shoulders. Carved muscles, broad chest. Cut abs. The line of a wicked scar ran down his ribs and disappeared into a swirl of dark hair. A heavy erection jutted forward and strained against his black boxers. His thumbs hooked on the elastic and paused. She narrowed her eyes in warning. Then he pushed the fabric down his thighs and stepped out of his underwear.</p><p>He stood with his feet apart, hands on hips. She took in the raw male glory. His cock rose to full attention. Her mouth watered and she ached to dip her head and suck on the long, thick length. Her hot gaze traveled over every inch of his body and she nodded in approval then ran her tongue along her lower lip. His cock twitched in response to the gesture.</p><p>“Beautiful.” She walked around him for a full inspection. Her fingers clenched at the sight of his tight ass, imagining how he’d jerk in response to a paddling. Pressing her breasts against his back, she placed her hands on his shoulders and stroked him. His muscles jumped under her touch. “I’m already wet,” she whispered in his ear. Her teeth nipped at his earlobe. “Would you like a taste?”</p><p>“Yes, Summer.”</p><p>His voice hissed and she gave a low laugh. Running her hands down his arms, she squeezed his biceps. Her hips pushed against his ass. “Not yet. I want to play with your body for a while. You are not to touch me until I give you permission. Do you understand?”</p><p>“Yes.”</p><p>“Very good.” She slid her arms around his waist and splayed her palms over his chest. His heart thundered against her hand, and a fine sheen of sweat beaded his skin. Oh, yeah. He liked her attention, but how would he handle not being in charge? She dug her nails into his abs and kicked his feet apart with one black heel until his legs spread wide. He locked down his body to avoid moving and his breath came in heavy gasps. Murmuring approval, she drifted her palms downward and played with the nest of hair at the base of his cock, running one finger down the ridged length, up and down, never applying more than a hint of pressure.</p><p>He bit back a groan.</p><p>Her fingers circled the tip, spreading around the bead of moisture that dripped. Slowly, she cupped and stroked his balls.</p><p>His temper exploded.</p><p>With a curse, he spun and pulled her into his arms. His mouth lowered to take hers, but she took a quick step back, and grabbed his balls in a merciless grip. She allowed her face to reflect her cold displeasure. Shock blazed back at her and his cock jumped in response.</p><p>“Remove your hands.” His arms dropped to his side. She shook her head in mockery. “Not enough control, I see. The rules are simple. Your body is mine for my pleasure. You obey my commands, and you don’t touch me unless I give permission. Since you can’t listen on your own, I’ll need to give you a little help.” A slight twist of her hand exerted more pressure and he winced. “Don’t move.” Releasing him, she walked to the small bureau and pulled out a pair of leather handcuffs from the top drawer.</p><p>“No fucking way.”</p><p>Her brow arched. “Yes fucking way. You proved you can’t be trusted on your own. This will make sure you keep your hands to yourself.”</p><p>“I’ll obey next time.”</p><p>“Yes, you will,” she said. “Because I’ll make sure of it. Follow me.”</p><p>With his feet rooted to the ground, they’d reached a turning point. He’d either take the leap and put himself in her hands, or stalk out the door with his pride intact. Of course, pride made a cold bed partner and ranked unnecessary in the pursuit of pleasure. Conflict flickered in his dark eyes as he processed his options. Summer gave him the only gift she owned. Her truth.</p><p>“Aren’t you as tired of running as I am?” she asked softly. She extended her hand and waited.</p><p>He stiffened and glared at the handcuffs before slowly sauntering over to grasp her hand. Heat and comfort radiated from his fingers straight to her heart. An age old connection sizzled and settled between them in a steady hum. She led him to the bedroom where she’d already had certain equipment installed at her request. Both Madame Eve and Castillo Resorts were quite accommodating.</p><p>She moved him to the far wall of the suite. The bedroom boasted a Tuscan feel, with rich gold, browns and burgundy. The bed held piles of pillows against an ornate oak headboard. The cream satin sheets beckoned and glistened under the last rays of the dying sun that sneaked through the Venetian blinds. With one last moment of hesitation, he surrendered his hands. She fastened the handcuffs, checking the fit and his comfort. She grabbed the chain from the drawer, attached it to the hook that hung discreetly from the ceiling, and connected the cuffs. He sucked in his breath, but she never glanced at him or hesitated, just pulled the chain up and connected it so his hands stretched over his head. She released some slack inch by inch until satisfied. “How does that feel?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A beat passed. “Uncomfortable.”</p><p>“Painful?”</p><p>“No.”</p><p>“Good.” She’d targeted enough discomfort to allow him the opportunity to concentrate on his body, and not what he should be doing or thinking. She reached under the bed, took out a foot spreader, and positioned it between his legs. After a quick check of the equipment, she stood back to admire the naked man in front of her.</p> <p>A slow, satisfied smile curved her lips. “Perfect. Let’s begin.”</p><p>Holy shit.</p><p>In a matter of minutes, he found himself naked, spread eagle, and tied up before a female he’d never met before tonight. I’ve lost my freaking mind.</p><p>The last incident in Iraq flashed before his vision. Their transporter had been attacked. As bullets rained over them and he’d shot back, sweat dripping in his eyes, adrenalin pumping, sand bursting up in clouds so he didn’t know what the hell he aimed at, he’d reached a turning point. When Ben got cut down, his leg shot to pieces, Rafe had needed to make a life-changing decision in a moment. He’d dived into the danger zone to bring his friend back to safety and hoped life without a limb wouldn’t be as bad as dying.</p><p>Right now, right here, with this woman before him, he hit another turning point.</p> <p>He craved a bit of secret Domme/sub play, but never believed he’d experience a full blown episode. His senses buzzed in vivid neon colors, riding the edge of pain and pleasure. Since coming back from the war, he’d never felt so completely alive. In touch with his body and completely present. Focused only on the woman before him who was about to rock his world.</p><p>Jesus, she looked like a different woman. Her face still held the appeal of the girl-next-door, but now she emanated a seductive power that gripped him by the balls and squeezed him as hard as her fingers had. High, perfectly formed breasts played a game of hide and seek behind tight leather. Her nipples grazed the edge of the corset, about to pop out with her next deep breath. Skin tight pants left nothing to the imagination and cupped her ass, clearly outlining the delta between her thighs. Each time she took a step, the heels forced her to balance, pushing her hips forward and back in a feminine swing Eve couldn’t have perfected better. Each thrust beckoned with a promise. If he hung on.</p><p>He’d figured she’d call it quits the moment he fought her. He hadn’t expected her to twist his balls, or the crazy pain/pleasure that stiffened his dick at her complete demand of submission. His mind emptied of all other thoughts than getting to touch her, thrust inside of her, see her completely naked. He figured he’d take anything she gave if she’d allow him just a taste.</p><p>“Hmm, very nice.” She grasped his cock and slid down from tip to the base. He shuddered and pulled on the cuffs, but the movement cramped and burned his shoulders and neck. He raised almost on tiptoe and stretched his body. Her touch skittered over his skin and twisted the discomfort into excitement. “I want to know more about you,” she purred like Catwoman. “We’re going to play one of my favorite games. I’ll ask you something and you answer as honestly as possible. If you give me the truth, I’ll give you a present. Lie to me, and you’ll be punished. Do you understand?”</p><p>“Yes, Summer.”</p><p>“Very good.” She continued touching him with light strokes—his hip, his stomach, his nipple. Each teasing flutter fisted his gut with anticipation, until he worried he’d spurt all over her like a freaking horn dog teenager. He used all of his military training to lock down his brain and control his body. No way in hell he’d explode before he pushed inside of her. She picked the wrong man to play that game with.</p> <p>As if she sensed his thoughts, she lifted one of her hands and he held his breath as her pink tongue licked her palm. She grasped his erection. And squeezed. He bucked at the damp heat.</p><p>“Stop thinking,” she commanded. “You’ll do what I ask, not what you think you have to. How long were you in the military?”</p><p>“Eight years. Joined at eighteen.”</p><p>She rubbed both hands up and down his cock, her thumb massaging the tip, keeping him distracted. “Where were you stationed?”</p><p>“Iraq.”</p><p>“Tell me about it.”</p><p>He blinked, reaching for some answer to her strange question, but she continued stroking. “Uh, what do you want to know?”</p><p>“Describe how it felt.”</p> <p>He groaned when she scratched his sensitive balls with her fingernails. “Hot. Dusty. Had sand in my ass from the first day, and the grit doesn’t wash off your skin no matter how much you bathe. You learn not to trust anyone but your team since any resident can turn on you in a heartbeat. Children included.”</p><p>She released him and disappeared behind him. He tensed. Her breath ran hot over his back and one sharp nail traced the line of his spine to stop at the base before tracing the line of his ass cheeks. He closed his eyes and pulled at the chains, wanting out of there, yet he had nowhere to go.</p><p>“Tell me your worst memory in Iraq.”</p><p>Her finger teased the tight hole between his cheeks. He concentrated on keeping his breathing steady, his heartbeat under control and played his usual game that kept him grounded. Start with one thousand and count backward, slow and steady. No way in hell he’d share secrets with a one-night stand. No way in hell she’d make him.</p><p>“Nothing stands out. One crappy day was the same as the rest.”</p><p>A sharp slap rang through the air. His left ass cheek tightened and heat burned his skin, but before he recovered, she bit down and the other cheek stung like a son of a bitch. Her hand slid around and grasped his cock, pumping up and down in a steady rhythm and the dual shock of pain melded to pleasure. Her tongue soothed the sting on his ass. With his head swimming, he tried to keep his brain sharp in order to dodge her questions, but his body didn’t give a shit. He cursed viciously.</p><p>“Don’t lie to me, it’ll piss me off. Let’s backtrack. Were you in charge of anyone?”</p><p>“Yes, five men.”</p><p>“Were they close friends?”</p><p>“Yes.”</p><p>“Did everyone get out alive?”</p><p>The repetitive questions came fast. His mind throbbed in time with the demands of his body to come. “No.”</p><p>He descended into his own personal hell, fighting with lust and need and crappy memories he didn’t want to emerge. Then she appeared in front of him. She’d loosened her corset and bared her breasts. Two ruby red nipples poked out and begged for his mouth.</p><p>“Who died?”</p><p>He gritted his teeth. She reached out and slapped his cock. A few drops of cum moistened the tip and he groaned. “Ben.”</p><p>“How did he die?”</p><p>“Fuck you.”</p><p>The last ditch effort at sanity broke from his lips. She smiled and knelt before him. Her hands rubbed her nipples and he stared helplessly at the luscious fruit a few inches away, yet unable to touch. The final threads of control frayed.</p><p>“I’m going to take your cock into my mouth and suck. You are not allowed to come. Do you understand me?”</p><p>“Yes.”</p><p>She opened her lips and slid her tongue up and over him. His heart stopped, sputtered, and pounded so hard the sound roared in his ears. She rolled the tip of her tongue round and round, licking with delicate motions. He jerked in the heavenly wet heat and yanked at his restraints. His knees shook. The numbers swam foggily in his vision but he fought for composure and tried to count again.</p><p>She pulled her mouth away with a slight popping noise. “How did Ben die?”</p><p>“Ambushed. We took cover but he got hit and his leg was blown off.”</p><p>“What did you do?”</p><p>“Nothing.”</p><p>The witch actually smiled. She bathed her index finger with her tongue. Her hot breath blew on his throbbing cock, and she trailed the same finger slowly between his cheeks, teasing the opening of his anus. Horror and a raging arousal licked him like fire. “Liar,” she said softly. One finger thrust into his ass.</p><p>“Fuck!” The delicious pressure shoved him toward the edge of orgasm. She worked the finger like a magician until his body practically wept for more.</p><p>“What happened when Ben got hit?”</p><p>“I asked Tim to cover me and I went to get him. Dragged him out of the scene.” He panted. With her other hand, she lifted his erection, swirling her fingers under the sensitive base, around his balls, spreading the moisture of her mouth.</p><p>“Did you get shot?” she asked.</p><p>“No. Everyone said it was a miracle.”</p><p>Pain and desire melded until one became indistinct from the other. The agony of the memory pierced him clear and sharp, when before it had always been a dull throbbing that never seemed to go away. She battered him with questions, and still she worked him, never easing the pressure of her finger in his ass, or her tongue and lips on his cock.</p><p>“Did you save him?”</p><p>“That day I did. He died at the hospital later. The whole thing was a waste. Just another day of waste.”</p><p>“Was that your worst memory?”</p><p>Her gaze delved deep and grabbed him by the throat. An endless depth of blue churned with emotion and demanded his truth. The walls he’d built trembled and broke in a pile of rubble around him. His body screamed and shook for release, for her permission to come. He dug in and gave it to her. “No, my worst memory was the day I got that fucking medal. The Silver Star. For being a damned hero.” He waited for her revulsion and anger and resentment. Instead, he only met her understanding and empathy. And want.</p><p>“Very good. Now, you may come in my mouth.”</p><p>Her head dipped and she took him deep to the back of her throat in one swift gulp. She sucked hard, her tongue swirling around with the perfect pressure. A cry ripped from his lips. Her teeth gently scraped the underside of his dick; she thrust a second finger in his anus, and he let go.</p><p>The climax ripped through him and he screamed her name, bucking and coming in her slick, satin heat. His toes arched and his head exploded in sensory overload as every muscle released tension. Mini convulsions wracked him from side to side, and she took all of him, massaging, then crooning to him softly. Drained emotionally and physically, he slumped against the handcuffs and heard her murmur his name. Time slowed and blurred. He caught the sweet scent of soap on her damp hands as she freed him from his restraints and rubbed his sore muscles. Settling him on the bed, she pressed kisses to his forehead as he lay against the cool sheets and let her bathe him with a damp washcloth. He basked in a cocoon of warmth and safety he’d never experienced before, after the most powerful orgasm of his life. In the comforting darkness, he surrendered while held within strong, feminine arms.</p><p>Chapter Three</p><p>Summer blinked away the tears that threatened and she bit her lip to ground herself. The man beside her roused. How would he react after the depth of their emotional scene? In a matter of hours, Rafe Steele had given her more intimacy and passion than she’d ever experienced. His strength humbled her. She shook with the need to belong to him completely, to have him fill her aching pussy.</p><p>Dear God, how can I ever go back to my old life? He’d wrecked her for all others—wrecked her for the normal vanilla sex with its nice boundaries and neat actions that barely scratched the surface of deep emotion. By giving in to his needs, his want, he’d given her a priceless gift. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She smoothed back a loose dark curl from his brow with a shaky hand. Would he hate her? Would he blame her for forcing him to tell his most private secrets? And could she blame him? She’d played hard ball and reached for things that most women didn’t try to accomplish for months. Vulnerability turned a man vicious, and she might fall victim.</p><p>His eyes opened.</p><p>She sucked in a breath at the swirl of emotion in his gaze. Recognition. Lust. Anger. Knowledge. The clock ticked. Her heart squeezed with terror at the idea of him walking away before dawn.</p><p>“Summer?”</p> <p>“Yes?”</p><p>“Why are you still wearing clothes?”</p><p>She looked down at her half naked body and burst out laughing. “I got distracted.” Warmth pumped through her veins and flooded to the center of her thighs. Her nipples swelled to full attention. “Besides, I want you to take them off.”</p><p>He sat up, gloriously naked and tousled. “Thank God. That outfit is driving me fucking nuts.”</p><p>Still grinning, she slid off the bed in one quick motion. “In a moment. I want you to drink some water.”</p> <p>“Anything stronger?”</p><p>“Water first.”</p><p>“Yes, ma’am.” Her fingers itched to smack his ass, but she loved the dual edge of dominance and subjugation he teetered on. He’d never take a backseat in life or in public. The idea he’d do it in the privacy of the bedroom cranked her lust to a whole new level.</p><p>She brought over two glasses of ice water and watched him drink. Satisfied he was properly hydrated, she poured two fingers of Jack Daniels for both of them and settled on the bed. The scent of man, musk, and arousal rose to her nostrils She studied his face carefully, but no resentment or embarrassment glimmered. “How do you feel?”</p><p>“Like I had the best orgasm of my life.” His eyes darkened further. “Like I want to do it again, but this time thrusting between your thighs instead of your mouth.”</p><p>She smiled. Damn, his sense of humor and honesty blew her away. “Me, too.” He shook his head as if refusing to utter more thoughts. “Tell me what you’re thinking.”</p> <p>“I can’t believe I shared all that crap with you,” he muttered. “Even my brothers don’t know.”</p><p>“I’m not surprised. Men don’t spend too much time analyzing their emotions. Women wallow, and men push it aside and get on with their life. The problem is when the stuff begins to blister.”</p><p>“Are you a shrink?” he asked suspiciously.</p><p>She laughed. “No. I’m an elementary school teacher.”</p><p>“I knew it. Pegged you for a teacher or a librarian from the first.” Questions whirled in his eyes and she waited for him to ask. “So, how does this work? Do I get to ask questions or is this just a one-man show?”</p><p>She raised a brow at his tone, secretly enjoying his masculine edge. “I have nothing to hide. If I insist on your honesty at all times, I’m certainly not holding back with you. I’ll answer any questions you have.”</p><p>“How did a nice elementary school teacher get hooked up with a one-night stand?”</p><p>She sighed. “I’ve always craved dominance in the bedroom. I was raised to believe women took a backseat to men. You know, allow them their full right to be in charge at all times. My mom spent many lessons teaching me to trick my boyfriends into getting what I want using my feminine wiles.” The memories cut deep as she remembered her parents’ own marriage. When her father asked his wife to jump, she asked how high. Summer would have been fine if he’d made her mother happy, but only rage and resentment filled the woman up, pushing away everything good. Including love for her only daughter. “My parents insisted I live up to certain ideals. Church on Sundays. Volunteer programs on weekends. I pursued a teaching degree under their watchful eye, and they even set me up with the man they expected me to marry. They were concerned I grow up with old-fashioned virtue and not become a slut of society.”</p> <p>He shook his head in amazement. “Hardcore. Why can’t I imagine you just going along with their plan?”</p><p>“They were my parents. I assumed I needed to do what I was told. Most of the time I enjoyed my life, but not when they focused on Andrew, the local pastor. It was the first time I disagreed with them.”</p><p>“What happened?”</p><p>“Let’s just say they weren’t thrilled when I informed them their precious Andrew couldn’t get it up in the bedroom.”</p><p>He winced. “Ouch.”</p><p>“Yep. They threw me out of the house and called me a whore.” She shrugged. “I crashed at a friend’s house and built my own life. A life I wanted, including sex.”</p><p>“Do you ever talk to your parents?”</p><p>Sadness leaked through her. She refused to hide behind the wall, and allowed him to see it all. “I call them on a regular basis. Sometimes they talk to me. Once I even visited, but they only wanted to show off Andrew’s new wife and baby boy. I didn’t stay too long. Somehow, they’re the only ones in my life who can make me feel dirty.”</p><p>“I’m sorry.” Rafe’s words reached out in warm comfort, his husky voice washing over her in a healing massage.</p><p>“Thanks. So, back to the original question, I did some experimenting with different types of men but always left unsatisfied. Each time I tried to dominate a scene, they’d freak out. My last ex called me a head case and told me I needed therapy.”</p><p>“He was an asshole. Probably afraid to listen to what you needed. Did you ever try out any BDSM clubs?”</p><p>“I went once for an orientation and learned some basics. I practiced safety with my sub and learned simple equipment. But I made no connections there, and the public scene was too much for me. At least for now. I wanted to explore in a private setting, with someone I can trust. I found out about Madame Eve and grabbed the opportunity. I could get matched with someone and have a night of experimentation on my own terms.”</p><p>“And here we are.”</p><p>She grinned at his bad boy wink. “Yes, here we are.” Her fingers clenched. “What about you? What are you looking for?”</p><p>She gave him credit. He only looked uncomfortable for a moment, then pushed past and told her the truth. “I’ve always felt different. I grew up with two older brothers who were pretty dominant, so I never questioned that was the route for me. But I felt strangled. They already had my future mapped out—finish college, go to dealer school, and join them in Atlantic City with my pop. Poker’s in the blood. But I was sick of being in their shadow and craved to make my own way. So, when I turned eighteen I joined the military. I went overseas pretty quickly because of the war. Really pissed off my family.”</p><p>“Did they end up supporting your decision?”</p><p>“Yes. Once they understood I’d made up my mind, they backed me all the way. I’ve never regretted joining. Hell, basic training alone kicked my ass. I challenged myself, and I made friends I’ll never forget.” Pain ravaged his face. “Other than Ben, everyone else got out alive, but the transition is freaking crazy. Nightmares. Wondering why I’m spending time deciding on lunch when people were dying. A tire blew out on the highway once and I almost flew off the road to dive for cover. Messes with your head. I never spoke about it, and my family never asked. Eventually, I did go to dealer school and began my career. On my terms.”</p><p>“When did you realize you have sub tendencies?”</p><p>He gave a short laugh. “When the best sex I had came from a woman I dated who got pissed. She started getting physical, ordering me around, and I became hard as a rock. I wanted more. Unfortunately, it never went much further after that.”</p><p>“You never tried to experiment? Talk to anyone?”</p><p>He snorted. “Honey, my brothers would eat me up alive if they even guessed. Most women fall at my feet, ready to roll over when I ask, all because I received a fucking medal for leadership I didn’t deserve. If it got out I showed up at a club as a sub, I’d be done. I consider tonight a present to myself. Get it out of my system.”</p><p>She arched a brow at his terminology of his sexual preferences as an it. Yes, she knew what he meant. But she craved a mate who could satisfy her in the bedroom. Who cared anymore about her reputation or what society considered abnormal or normal? She wanted a man to take care of—to command and give everything she was—for his complete trust. No more hiding. When dawn rose, he’d go back to his life with its rigid rules, and maybe someday strangle under its chokehold. Not her. First her parents, then society chose her path. Now, she’d choose on her own, but in the light of day, on her own terms.</p><p>He’d forced her to admit what she really needed, and she’d never deny herself again. If she needed to find the proper club, she would. If she needed to reach out for contacts and people involved in this lifestyle, she’d find them.</p><p>She looked at the man on the bed and a strange sadness and longing rose in her throat. Already, a strong bond had been formed, emotionally and physically. She ached to learn more, to strip him bare and give him the most immense pleasure of his life. But he wasn’t ready.</p><p>She only had him until dawn.</p><p>“Must be nice to have everything under control.” He shuddered and she caught the gleam of arousal in his eyes. “Let’s see how well you do with some boundaries.” She licked her lips as she noted his instant hard on. “But first, a kiss. Show me how much you want me. You’re only allowed to touch my lips. Keep your hands to your sides.”</p><p>Eagerness leapt in his gaze. He leaned forward and twisted his hands in the tangled sheets in an effort to keep still, but he did as told and carefully fit his mouth over hers.</p><p>A sluggish heat pierced her with sweet longing as his taste swamped her—stinging liquor and hot male need. As if treasuring every moment, he sipped from her lips, nibbling on the lower one in a strong measure of control, teasing the seam with his tongue. Slowly, she opened to him, and he pushed through.</p><p>Mine.</p><p>The word pounded in her head like a mantra. She fought her need to possess and allowed him full access, as his tongue explored every dark hidden cave, and plunged in over and over, fucking her mouth in perfect rhythm. The earthy scent of him filled her head, and her control slipped under her lust for more. She shuddered for his touch. Pulling away, she stared into his eyes. In a ragged, husky voice, she said, “Very good. You may touch my breasts. But not with your mouth.”</p><p>“Thank you, Summer.”</p><p>His words pleased her, and his big hands cupped her breasts, massaging in rough circles. Her flesh swelled to meet him and her nipples tightened. She loved the contrast between her fair skin and his olive tones. He used his thumbs to roughly tweak her nipples, scraping a nail over one tight bud. Heat lanced straight down her belly and pulsed between her thighs. God help her, she wasn’t as in control as she hoped. She craved release just from his hands on her naked skin. At that rate, he’d own all the control.</p><p>An idea nibbled on the fringe of her mind. He needed another lesson in discipline. Perhaps her orgasm could introduce him to a whole new pleasure? “You’ve been very good,” she said. “I’d like you to kneel in the middle of the bedroom for me now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What?”</p><p>His obvious confusion cleared her head and she drew her brows together in warning. “Not another word. Don’t question me or I won’t let you come. Do you understand?”</p><p>Pure mutiny carved lines on his face. A beat passed and she waited. “Yes, I understand.” He rose from the bed and knelt on the mocha-colored carpet.</p><p>She squirmed at the sight of the rippling muscles in his upper thighs and ass. God, she wanted him. “Very nice. Spread your legs wider. Now lock your hands behind your back. Beautiful. You may watch as I undress.”</p><p>Heat sizzled in his gaze. She peeled off her thigh high boots, unzipped the leather pants, and wriggled them down over her hips to stand naked in front of him. Her bare pussy leaked with her arousal. She heard the quick intake of his breath, and gloried in the fact that she pleased him. Carefully, she slipped her boots back on. The soft leather caressed the sensitive flesh of her inner thighs. A few drops of pre-cum glistened on the tip of his cock, and he leaned forward to rub it against the carpet, moaning under the friction.</p><p>She lifted one spiked heel and dug it into his upper thigh. He hissed at the sharp pain, but when his gaze flicked to her open folds in full view, his muscles locked down. “Straighten up and link your hands behind your back,” she said. “You will sit there while I pleasure myself. You are not to move.”</p><p>“Please, let me do it. I promise to make you feel so good.”</p><p>She gave a low laugh. “Yes, I’m sure you will. But I want you to understand I control your orgasms. I control how I climax. If you are very good, and if you don’t move, I may let you pleasure me.”</p><p>His jaw clenched. He seemed to battle his lust for fulfillment against his usual routine of being in charge. His true nature won, and she caught all the signs of excitement shudder through his body at the thought of letting her lead. “Yes, Summer.”</p><p>“Very nice.”</p><p>She eased over the carved wooden footboard, a perfect prop for her thighs. Slowly, she spread her legs, her shaved pussy open to his gaze. “You’ve made me very wet, Rafe.” Resting her fingers on the swollen lips, she coated her juices over her hardened clit. “I can only imagine how your hot, wet tongue would feel rubbing over my clit, thrusting inside.” She pushed a finger in her slit and moaned. Her other hand worked her breast, rolling and pinching a tight nipple in rhythm with her finger. “Do you want to know how I feel?”</p><p>“Yes.” His voice was ragged.</p><p>“Slick and hot and juicy. Oh, that feels so good, hmm, I need more.” She added another finger and built up her speed, her knuckle rubbing over the nub pounding for release. She threw her head back on the bed and brought her knees up, spreading wider.</p><p>“Summer, please! Let me come to you.”</p><p>“Not yet. I’m hot and tight, just begging for your cock and your fingers and your mouth to take me. Oh, I’m so close, I feel it, so good, ahh!” She came in a rush, her pussy clamping down on emptiness as shudders shook her. Knowing he watched every movement and saw all of her secrets intensified the pleasure. Spasms wracked her. She moaned in satisfaction then rose from the bed.</p><p>He knelt in perfect submission on the carpet. Sweat dripped from his brow and his skin gleamed to a high sheen He fought for control as his rock hard thighs trembled with exertion, and every muscle shuddered. Her heart soared at his ravaged features. Satisfaction pounded through her and lit her heart. My God, he is perfect. The masculine beauty of a man holding himself back, of submitting to such a deep need to release on her terms, was the most incredible gift. As if he were unable to speak coherently, a groan escaped.</p><p>She purred and stroked his damp hair, pushing the curls away from his brow. “Poor baby, you’ve been so good. I think you need a present. Tell me what you would like.”</p><p>He struggled for words, to put his fantasy into reality. Asking for what he wanted was a big step in the path of submission. “I want to lick your pussy.”</p><p>“Yes, baby, I think you deserve that. I’d like to come again. Stay exactly where you are. You are not to rub your cock against anything while you pleasure me. You are not allowed to come, do you understand?”</p><p>“Yes, Summer.” She positioned herself on the floor in front of him, propping one spiked heel on each of his shoulders. She opened her legs wide and spread out before him like a present.</p><p>“Oh, God, you’re so beautiful.”</p><p>“Show me how much you want me.”</p><p>He bent his head. Her hips arched at the first lick over her wet slit. His hot mouth opened slow and easy, stroking her swollen folds, teasing her clit, giving her just a tiny taste of what she really needed. She rolled her head back and forth and pushed her pussy higher. “More, give me more.” He obediently plunged his tongue into her dripping heat. Over and over he thrust, using his finger to rotate and massage her clit. The edge hovered in front of her, blurry and beckoning. She neared the peak and cried out, “Now, make me come now!”</p> <p>He sucked on her clit and sank his fingers deep inside. She screamed as the orgasm ripped through her, shredding her with sheer pleasure. He gave a hoarse shout and milked her climax to the last shudder, then lapped up her juices and pressed kisses to her trembling thighs.</p><p>She practically purred in satisfaction at the deep-seated orgasm. “Very nice.” Slowly, she rose to her feet. “I’m going to pour myself a glass of wine, baby. Would you like something?”</p><p>His face reflected raw anger and naked need. He growled low in his throat, shaking with need. “Are you kidding me? What the hell game do you think you’re playing?”</p><p>Her voice slapped like a whip. “What did you just say to me?”</p><p>He jerked back but gritted his teeth in determination. “I’m dying here. I need to come.”</p><p>“Oh, you need to come, do you?” She walked over and lifted his chin, towering over him. “You’ll come when I tell you to.”</p><p>“I can’t last any longer.” The agony of holding back his orgasm etched his face. “Please, Summer.”</p><p>She softened. “I know it hurts, baby. But if you hang on, I promise you the best orgasm you ever had in your life. Do you trust me?”</p><p>“What?”</p><p>She cupped his face and gazed into his eyes. Their soulful depths pulled her in. Dear God, when he leaves, he’ll take a part of me. Could I have fallen in love after only a few hours? “Do you trust me? Do you trust me to take you to the extremes of pleasure and keep you safe?”</p><p>“Yes.”</p><p>His admission tore through her. She pressed a kiss to his lips, sliding her tongue over his carved mouth and dipping inside for a quick taste. “Thank you. Stay here a moment.” She walked over to the bedroom bureau, slid out a drawer, and came back with a large black ring and lube. “Stand, please.”</p><p>He rose to his feet. His erection pulsed in demand, but she concentrated on lubing up the ring, then rubbed the liquid on his cock. Slowly, she slid the ring up his length to the base, worked it over his testicles, and tested the position. He twitched in agony and shook his head. “What the hell is this? Oh, God, I can’t take it.”</p><p>“Yes, you can. It’s a cock ring. It will help you control your orgasm until I’m ready. The ring restrains your testicles so when you come, it will be much more intense. Unless you want to use your safe word?”</p><p>A flicker of temptation lit his eyes. Just as quickly, his head bowed in submission. His dark desires needed to be filled, and he understood she’d give him what he sought. “No, Summer.”</p><p>“Very good. Resume kneeling and I will bring us some wine and snacks.”</p><p>She left the bedroom.</p><p>Chapter Four</p><p>Rafe stared at the woman in front of him and wondered if he was in heaven or hell. Felt like both. His body didn’t belong to him any longer—every inch of skin and muscle belonged to her. Usually so sharp about the next maneuver to make a woman experience pleasure, instead his mind fogged. Every reaction was completely tied to her words, her commands, her praise. In a matter of one evening, all his military training and dominant mannerisms faded away under the sting of her voice or the sharp bite of her spiked heel.</p><p>What the hell happened to him? A pounding cadence enveloped his dick and wrecked his concentration. The cock ring tamped down the urgent need to spill his seed, but his swollen flesh ached with the need for release. The strange line of pain and pleasure caused him more arousal than ever imagined. He’d never wanted to come so badly in his life. Even worse, he’d do anything she commanded if she gave him release. By giving his trust, he bound this woman to take care of his needs. So far, he’d never experienced such soul-wracking pleasure by giving a woman an orgasm orally. Sure, he loved getting a woman off, but she took it to a whole new level. Her spicy taste drugged him, her slick heat clenching around his tongue in a fury that stripped away his barriers and any neat control he imagined he owned.</p><p>The cock ring kept him uncomfortably hard, but excitement slithered underneath the surface of his pain. A raw lust he needed to unearth. And the only way was through Summer’s commands.</p><p>“Tell me about your brothers,” she said. Her fingers stroked his hair and caressed the line of his jaw. Her soothing touch gentled the lunging beast of want threatening to overtake him.</p><p>“They’re both dealers like me. When I got out of the military, I stayed in Atlantic City for a while, but my brothers harassed me to move out to Vegas and join them. They got me a job with the Castillo Hotel, which I love. And, they both got married by meeting their wives through Madame Eve.”</p><p>She paused in feeding him a cracker smeared with brie. “What? They both met their wives through 1Night Stand?”</p><p>He chuckled at the look of surprise on her face. “Yep. Better watch out, baby, seems Madame Eve is magic when it comes to the Steele brothers.”</p><p>She smiled at him. The luminous light in her blue eyes squeezed his heart with longing. God, she was beautiful. Her angelic face expressed a pure openness he rarely glimpsed in a woman. She mirrored the perfect twist of naughty and nice that would make a man happy every morning he woke up in her bed. “I’m not afraid of commitment,” she said, softly. “I’m tired of hiding who I am anymore. I want a man to be my partner and friend in life. In public. And I want a man strong enough to submit in the bedroom.”</p><p>Her words shook him like an answering thunderstorm. What if she offered him the opportunity to be with her past dawn? He pushed the tempting thought aside. “Maybe you don’t have as much to lose,” he blurted. As his cock pulsed, he waited for the sting of punishment from his outburst, but she stared back, her face serious.</p><p>“I teach third grade,” she said softly. “I’m in the PTA, afterschool clubs, and tutor privately. I have a nice little house with a white picket fence and roses in the backyard. My best friends are married for years with babies and vanilla lifestyles. I don’t want to give any of that up, and I don’t intend to. But I need to be who I am, and if that consists of joining a private BDSM club, or finding a partner who isn’t afraid of experimentation, I’m going to follow it.” She paused and pressed her thumb against his lips. “What are you so afraid of? That your brothers would never forgive you? That you would be called less than a man? Or that you’ll finally find what you’ve been looking for?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He imagined Summer by his side, in public and private. Building a life. Free of restrictions, completely submitting to her every demand. To finally feel the freedom of pleasure on his own terms.</p><p>His cock throbbed and his heart wept.</p><p>The idea of his brothers staring in wide-eyed shock and horror flashed in his mind. Shame pulsed with the knowledge that a well known sergeant fell to his knees before a woman in leather, enjoying the sting of a slap in punishment. No. How could he be like this? Perhaps when he finally claimed her, finally climaxed, he’d experience a satisfying relief and could walk away.</p><p>A fleeting glimpse of recognition flickered in her eyes, as if she suspected his secret thoughts. She stepped back and put away the wine and snacks, then came back into the room with determination. “I seem to be craving your touch on my body,” she snapped. “You will leave your cock ring on. Stand.”</p> <p>He rose, his knees sore from kneeling in the same position, even with the thick carpet. Dear God, if I touch her for too long I’ll explode—with or without the damn ring. He dug deep and clawed for the control he’d need to make love to her without coming. She lay down on the bed, her gorgeous white blonde hair spread over the burgundy satin pillows. Then spread her legs. His mouth watered. Her breasts and nipples reminded him of cherries on whipped cream. Her abandon ratcheted his own desire, her pussy naked and open, ready for him to serve.</p><p>He settled on the bed, pressing on top of her. Licking and biting the sensitive curve of her neck, he plumped her breasts, drew a nipple into his mouth and sucked hard. She arched and he relished the quick flip of control. He feasted on her breasts, her belly, then dove between her thighs. Sucking and tonguing her to a sharp orgasm, he held her ride out the spasms, greedy for more. The need to thrust into her tight heat gripped him in a frenzy.</p><p>“Please, Summer, please.”</p><p>“Tell me what you want.” Her eyes glazed. “Tell me exactly.”</p><p>“I want to fuck you. Let me fuck you.”</p> <p>She smiled and licked her lips. “Yes, Rafe, you may fuck me.” The relief of freedom surged, victory finally close. She grabbed a condom from the table, ripped off the wrapper, and held it above him. “Remove the ring.”</p><p>He stripped the restriction from his cock. Blood surged through him and he gasped as he fought to hang on.</p><p>“Good.” She covered him in seconds, then flipped over and knelt on all fours. He almost exploded at the sight of her perfect ass held high in the air. Grasping her hips, he positioned her, then drove to the hilt in her heat.</p><p>Sparks shimmered behind his eyes at the sharp pierce of pleasure. Her pussy clenched on his cock like hungry, greedy fingers, her juices dripping around him. He cried out in ecstasy.</p><p>“You are not allowed to come.”</p><p>Her words shattered his sensual fog. “What? No, I can’t, please—”</p> <p>“No coming. Now fuck me.”</p><p>He moved, plunging in and out. His control slipped away with each thrust, the slow, steady rhythm ripping away his sanity and leaving a raw, bleeding need to be filled by her. Tears pricked the back of his lids. Her pussy clenched around him.</p><p>“Tell me what you want! Now.”</p><p>A sob caught in his throat. “I want to come, Summer. Fuck! Let me come inside you!”</p><p>“Very nice, baby. Come with me, now!”</p><p>He gave a guttural cry of victory and dove deep, his balls slapping against her ass. “Ah!” He shot hot cum, the orgasm gripping every muscle and hurled him over the edge. His toes curled into the mattress as he pumped furiously and released every last drop. The climax shimmered for what felt like endless minutes, going on and on, until he collapsed on the bed, completely spent. She whispered his name and cuddled into him, stroking his back and kissing his cheek. He floated in a strange space of complete peace and bliss he’d never known existed in this life plane. Stray tears clung to his cheeks but she licked them away, and he was too far gone to care.</p><p>Emotionally and physically wrecked, fucked out of his mind, he closed his eyes and surrendered to the nothingness.</p><p>Summer glanced at the clock by the bureau. Six AM. Dawn had broken beyond the bat cave blinds of the bedroom suite. He slept with a peaceful slumber that broke her heart. They’d woken up a few more times to make love and snuggle, but it had taken him a while to surface after diving into the sub space after his first orgasm.</p> <p>She took in his strong, muscled body, carved chest, olive skin. Dark curls tumbled over his forehead and her fingers itched to touch them. A rough five o’clock shadow stubbled his chin with a rough sexiness she craved on a full time basis. Oh yeah, I’m completely screwed. And not in a good way.</p><p>She’d fallen in love with Rafe Steele.</p><p>She sat up in bed. What had she done? How had he snuck past her defenses so quickly? When she’d visited that club for her orientation, she met many subs and not one had connected with her. Her experimentation with play called to her soul, but he’d ruined her for every man who might follow. Unless she asked him to stay.</p><p>As if reading her mind, he opened his eyes.</p><p>His smile lit up her insides with a glowing warmth. She wanted the time to treasure him, to show him the exotic world of submission that completed both of their souls. But he needed to have the courage to try and reach out for what he wanted.</p><p>He needed to take the dare.</p><p>He pulled her down for a kiss. His lips moved over hers with the knowledge of a lover, and she gave it all back to him before finally pulling away. “What’s wrong?” His voice was gritty and rough from sleep.</p><p>“It’s morning,” she said simply.</p><p>Recognition dawned. He sat up, the sheets twisted around his hips. A mix of trepidation and want filled his eyes. “Are you kicking me out of the bed?” He tried for humor, but it fell flat in the waiting silence.</p><p>She took a deep breath. She expected honesty from a sub, but that honesty began with her. “No. But are you ready to hear what I really want?”</p><p>He squeezed his eyes shut, as if preparing himself. “Yes.”</p><p>“I want you.” The words hung in the room like smoke after a gunfire. “I never expected to feel like this, but I want to see you again. You’re an incredible man, Rafe Steele. You have everything I’ve always needed in a mate, and after one night I don’t want to let you go. But if you don’t feel the same way about me, I release you. Our contract ended at dawn. I will thank you for the most incredible evening of my life, and move on. I will never contact you again, and everything that happened behind these doors will never be mentioned.”</p><p>Raw emotion glimmered in his eyes. His jaw clenched. Unclenched. Then the words spilled out of his mouth. “I don’t want to let you go. I’ve never felt like this before. But I don’t know if I can commit to this lifestyle.”</p><p>“I dare you.”</p><p>He sucked in his breath. “Dare me to what?”</p><p>“To be honest with what you want. I’m not asking you to admit the lifestyle to your brothers or in public. This is private, between us. But I need to know you’ll explore it with me. And give me everything I ask behind closed doors.”</p><p>He seemed to struggle between the lure of his fantasy and the fear of reality. Her heart pounded and the blood squeezed through her veins. He needed to make his own choice or they could never work.</p><p>“I can’t do it yet, Summer. I’m not ready.”</p><p>She acknowledged his limitation and a heavy grief pressed into her limbs. Perhaps he would never be ready, but she needed to move down her own path and find her own answers. Tears pricked her eyelids. She leaned forward, kissed him, and slid out of bed.</p><p>“I understand, I really do. But I can’t follow you right now. Thank you for everything you gave me, I won’t forget it.” She paused. “I won’t forget you.”</p><p>She gathered her clothes and closed the bedroom door behind her.</p><p>Epilogue</p><p>Two weeks later...</p><p>Rafe watched his brothers tear into a plate of nachos and wash them down with a pair of matching Coors Lite. His stomach twisted with tension, but he’d made his decision. He needed to tell his brothers the truth—then get Summer Preston back into his life and in his bed.</p><p>When she’d left, something within him shattered. He’d pushed past the pain and got back into his old life, but everything changed. Dealing cards, sharing a meal with his brothers, and dating a bunch of pretty, nameless women left him cold. His soul gaped open with an empty wound and nothing seemed to fill it. When he’d looked up private BDSM clubs on the internet and wondered if she had a new sub, the sick anger nearly tore him apart. He belonged to her, and she to him. One night proved she was the woman he wanted to explore that lifestyle with. He wanted her both in and out of the bedroom.</p><p>He decided his biggest barriers sat beside him in the cracked leather booth, chowing down on appetizers in ignorant bliss. He tipped back his beer bottle for one last swig and faced his brothers. “I need to tell you guys something. Something that’s been bothering me for a long time.”</p><p>They shared a look. Rick dropped the chip he held in his hand and leaned in. Rome nodded with encouragement. “Go ahead, bro. We’re listening.”</p><p>Their rock solid support surrounded him. He took a deep breath. “I’m a submissive.”</p><p>Rick raised one blond brow. “Get out.”</p><p>His stomach turned but he kept his chin high and met his brother’s stare head on. “Nope. I’ve known this for a while now, but I turned chickenshit and refused to admit it. I spent the night with a woman who gave me everything I needed. She wanted more than one night though, and I blew it. But I’m gonna get her back.” He pointed a finger at Rick. “I don’t need to take any of your shit about this.” Then he glared at Rome. “From either of you. Got it?”</p><p>Rome studied him in a thoughtful silence and he inwardly squirmed. His brother wiped his mouth with a napkin, then leaned back in the booth with a big ass grin. “Holy shit, I never even suspected. That’s some secret, bro. No wonder you’ve been torn up for the past few years. Denying who you are sucks the soul out of you.”</p><p>He blinked. “You understand?”</p><p>“I’m surprised, but of course I understand. Did you really think otherwise?” Rome cursed when he saw the truth on his face. “You actually thought I’d have a problem with you being a sub? When my own wife is one? And Rick’s?”</p><p>Rafe rubbed his face to hide the sudden heat of embarrassment. “Figured it’d be different when you heard a man was a sub. Kind of odd, don’t you think?”</p><p>Rick shook his head, his voice tinged with anger. “No, I don’t. I see it all the time. I may not swing that way, but I respect the hell out of a man who knows who he is and goes after it. Tara and Sloane are some of the strongest, kickass women we know. Just because they’re subs in the bedroom doesn’t mean they’re weak. It’s quite the opposite. That’s basic 101 in BDSM. Figured you’d know that already.”</p><p>Relief poured true and clear from the core of his body. He couldn’t help the silly grin spreading across his face as he looked at the two men he loved and respected the most in the world. “Thanks, guys. I appreciate the support.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Are you going after this woman? What’s her name?” Rick asked.</p><p>“Summer Preston. I needed this time to get my head screwed on straight. Now I have to find her.”</p><p>Rome nodded. “I’ll find her for you. Give me an hour and I’ll check the local clubs and find out if they’ve seen her. I have a few friends who owe me a favor.”</p><p>“Appreciate it.”</p> <p>“Umm, Rafe?”</p><p>“Yeah?”</p><p>“How strongly do you feel about this woman?”</p><p>Fierce emotion coursed through him at the image of her sweet face hiding a tigress’s soul. “I think I’m in love with her.”</p><p>Rome groaned and pounded his fists on the table. “This is freaking unbelievable. Madame Eve strikes again.”</p> <p>Rick laughed and held out his beer in a mocking salute. “To Madame Eve and 1Night Stand. She took on one Steele at a time and changed our lives.”</p><p>“Let’s just hope the odds are still in my favor. I have a lot of begging to do.” Rafe stood from the booth.</p><p>Rome winced. “Bet you’ll have a sore ass by the time she’s done punishing you for letting her walk in the first place. Glad I’m not you, bro. Let me start making calls.”</p><p>As his brother flipped out his cell phone, Rafe prepared to win the biggest dare of his life.</p><p>“Summer, the scene is ready for you. But I have a new sub out front who insists he needs to speak with you.”</p><p>Her brow wrinkled in confusion. “Okay. Give me two minutes and send him in.”</p> <p>She finished lacing her spiked boots and adjusted her corset. She may still be uncomfortable in bondage, but the club let her go slow, at her own pace, and gave her enough men to pick from to try different things. As she prepared for her first small, public scene, her heart mourned the only man she ached for. The one who’d left over two weeks ago.</p><p>Rafe Steele.</p><p>Agony speared her gut. She dreamt of him constantly, waking up with her hips bucking to empty air, and a wound in her soul that refused to heal. She understood his limits and respected his decision, but it didn’t help the longing that choked her when she stared at another man in handcuffs, waiting to obey her. Hopefully, she’d eventually meet someone she could share her days and nights with—a soul mate. But for now, she took it day by day with only one name hovering on the edge of her lips.</p><p>She shook her head to clear her thoughts and brought herself under control. She’d already decided on her choice for the display with a young man she felt she could help, but had no idea who’d want to see her so close to show time.</p><p>The door opened and she stared at the entrance with curiosity.</p><p>Her heart plummeted with wrenching speed. The image of her dreams stood before her, and she practically choked on her own saliva. His bare chest sported a swirl of dark hair over rich olive skin. He stood with his bare feet spread apart, a tiny black scrap of fabric covering his impressive cock. A raw, pulsing need flooded her and left her shaking. She swallowed hard, and raised her chin high. His dark gaze delved into hers with an intensity that ripped away her breath. She forced herself to speak, the words a husky whisper. “What are you doing here?”</p><p>“I’m here for you, Summer. I’m here to make things right.”</p><p>Hope rose, but she battled it back, afraid to get hurt again. “No, you weren’t ready for this.” She swept her hands in the air. “I can’t make you be someone you don’t want to be.”</p> <p>“The only man I want to be is the one who owns you just as much as you own me.”</p><p>“Rafe—”</p><p>“Permission to speak, Mistress.”</p><p>The title fell from his lips and she gasped. Her pussy clenched, and tears pricked her eyes. The strength and courage it took for him to find her and reveal himself deserved her full attention. “Permission granted,” she whispered.</p><p>He closed the distance between them and knelt before her. “This isn’t about getting attached to the first woman who introduced me to this lifestyle. This is about how I feel when I’m with you. One night and you wrecked my world. I tried to go back to what I considered normal, but I’m tired of being an empty shell. Give me another chance. I want to take you to dinner at my brother’s house. I want to court you with silly flowers, and take you to the movies and share popcorn. I want to hear your dreams and your nightmares, and submit to you in the bedroom. You took part of my soul, and I need it back.” His gaze glittered with fierceness. “I dare you, Mistress.”</p><p>“Dare me to what?”</p><p>He smiled. “Allow me to take the place of your submissive tonight in the public scene. To claim you as my Mistress.”</p><p>She closed her eyes against the tears and the joy, shuddering with want and need for the man who knelt by her feet. Pulling him upward, she drew his head down for a kiss.</p><p>His lips took hers, the musky, spicy flavor of male desire swamping her senses. His tongue slipped into her mouth and took everything she had. In that moment, she submitted to him as sweetly as he did to her.</p><p>“I accept your dare,” she murmured against his lips. “I missed you so much. Are you sure you’re ready for this?”</p><p>“I trust you’ll take care of me.”</p><p>“I will.” She nipped his lower lip playfully. “You do have a punishment due for allowing me to leave. This will be the perfect time to introduce you to the whip.”</p><p>He flinched, but she caught the wild excitement in his eyes. “That’s what my brother warned me about.”</p><p>“You told them everything?”</p><p>“Yes. I want you night and day, Summer Preston. No more secrets.”</p><p>She’d won the dare of a lifetime.</p><p>Love. </p> </body></html>"]