["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>“You got a tattoo?”</p><p>It’s the third time I’ve asked Holder the same question, but I just don’t believe it. It’s out of character for him. Especially since I’m not the one who encouraged it.</p><p>“Jesus, Daniel,” he groans on the other end of the line. “Stop. And stop asking me why.”</p> <p>“It’s just a weird thing to tattoo on yourself. Hopeless. It’s a very depressing term. But still, I’m impressed.”</p><p>“I gotta go. I’ll call you later this week.”</p><p>I sigh into the phone. “God, this sucks, man. The only good thing about this entire school since you moved is fifth period.”</p><p>“What’s fifth period?” Holder asks.</p><p>“Nothing. They forgot to assign me a class, so I hide out in this maintenance closet every day for an hour.”</p> <p>Holder laughs. I realize as I’m listening to it that it’s the first time I’ve heard him laugh since Les died two months ago. Maybe moving to Austin will actually be good for him.</p><p>The bell rings and I hold the phone with my shoulder and fold up my jacket, then drop it to the floor of the maintenance closet. I flip off the light. “I’ll talk to you later. Nap time.”</p><p>“Later,” Holder says.</p><p>I end the call and set my alarm for fifty minutes later, then place my phone on the counter. I lower myself to the floor and lie down. I close my eyes and think about how much this year sucks. I hate that Holder is going through what he’s having to go through and there isn’t a damn thing I can do about it. No one that close to me has ever died, much less someone as close as one of my sisters. A twin sister to be exact.</p><p>I don’t even try to offer him advice, but I think he likes that. I think he needs me to just continue being myself, because God knows everyone else in this whole damn school has no clue how to act around him. If they weren’t all such stupid assholes he’d probably still be here and school wouldn’t suck half as bad as it does.</p><p>But it does suck. Everyone in this place sucks and I hate them all. I hate everybody but Holder and they’re the reason he isn’t here anymore.</p> <p>I stretch my legs out in front of me and cross my ankles, then fold my arm over my eyes. At least I have fifth period.</p><p>Fifth period is nice.</p><p>My eyes flick open and I groan when something lands on me. I hear the sound of the door slam shut.</p><p>What the hell?</p><p>I place my hands on whatever just fell on me and begin to roll it off me when my hands graze a head full of soft hair.</p><p>It’s a human?</p><p>A girl?</p><p>A chick just fell on me. In the maintenance closet. And she’s crying.</p> <p>“Who the hell are you?” I ask cautiously. Whoever she is, she tries to push off me but we both seem to be taking turns moving in the same direction. I lift up and try to roll her to my side but our heads crash together.</p><p>“Shit,” she says.</p><p>I fall back onto my makeshift pillow and grab my forehead. “Sorry,” I mumble.</p><p>Neither one of us moves this time. I can hear her sniffling, trying not to cry. I can’t see two inches in front of me because the light is still out but I suddenly don’t mind that she’ s still on top of me because she smells incredible.</p><p>“I think I’m lost,” she says. “I thought I was walking into the bathroom.”</p><p>I shake my head, even though I know she can’t see it. “Not a bathroom,” I say. “But why are you crying? Did you hurt yourself when you fell?”</p><p>I feel her whole body sigh on top of me and even though I have no idea who she is or what she looks like, I can feel the sadness in her and it makes me a little sad in return. I’m not sure how it happens, but my arms go around her and her cheek falls against my chest. In the course of five seconds we go from extremely awkward to kind of comfortable, like we do this all the time.</p><p>It’s weird and normal and hot and sad and strange and I don’t really want to let go. It feels sort of euphoric, like we’re in some sort of fairytale. Like she’s Tinkerbell and I’m Peter Pan.</p><p>No, wait. I don’t want to be Peter Pan.</p><p>Maybe she can be like Cinderella and I’ll be her Prince Charming.</p><p>Yeah, I like that fantasy better. Cinderella’s hot when she’s all poor and sweaty and slaving over the stove. She also looks good in her ball gown. It also doesn’t hurt that we’re meeting in a broom closet. Very fitting.</p><p>I feel her pull a hand up to her face, more than likely wiping away a tear. “I hate them,” she says softly.</p><p>“Who?”</p><p>“Everybody,” she says. “I hate everybody.”</p><p>I close my eyes and lift my hand, then run it down her hair, doing my best to comfort her. Finally, someone who actually gets it. I’m not sure why she hates everybody but I have a feeling she’s got a pretty valid reason.</p><p>“I hate everybody too, Cinderella.”</p><p>She laughs softly, probably confused as to why I just referred to her as Cinderella. Whatever just made her laugh, at least it’s not more tears. Her laugh is intoxicating and I try to think of how I can get her to do it again. I’m trying to think of something funny to say when she lifts her face off my chest and I feel her scoot forward. Before I know it, I feel lips on mine and I’m not sure if I should shove her away or roll on top of her. I begin to lift my hands to her face, but she pulls back just as quick as she kissed me.</p><p>“Sorry,” she says. “I should go.” She places her palms beside me on the floor and starts to lift up, but I grab her face and pull her back down on top of me.</p><p>“No,” I say. I bring her mouth back to mine and I kiss her. I keep our lips pressed firmly together as I lower her to my side and pull her against me so that her head is resting on my jacket. Her breath tastes like starburst and it makes me want to keep kissing her until I can identify every single flavor.</p><p>Her hand touches my arm and she gives it a tight squeeze just as my tongue slips inside her mouth. That would be strawberry on the tip of her tongue.</p><p>She keeps her hand on my arm, periodically moving it to the back of my head, then returning it to my arm. I keep my hand on her waist, never once moving it to touch any other part of her. The only thing we explore is each other’s mouths. We kiss without making another sound. We kiss until the alarm sounds off on my phone. Despite the noise, neither of us stops kissing. We don’t even hesitate. We kiss for another solid minute until the bell rings in the hallway outside and suddenly lockers are slamming shut and people are talking and everything about our moment is stolen from us by all the inconvenient external factors of school.</p><p>I still my lips against hers, then slowly pull back.</p><p>“I have to get to class,” she whispers.</p><p>I nod, even though she can’t see me. “Me, too,” I reply.</p><p>She begins to scoot out from beneath me. When I roll onto my back, I feel her move closer to me. Her mouth briefly meets mine one more time, then she pulls away and stands up. The second she opens the door, the light from the hallway pours in and I squeeze my eyes shut, throwing my arm over my face.</p><p>I hear the door shut behind her and by the time I adjust to the brightness, the light is gone again.</p><p>I sigh heavily. I also remain on the floor until my physical reaction to her subsides. I don’t know who the hell she was or why the hell she ended up here, but I hope to God she comes back. I need a whole hell of a lot more of that.</p><p>She didn’t come back the next day. Or the day after that. In fact, today marks exactly a week since she literally fell into my arms, and I’ve convinced myself that maybe that whole day was a dream. I did stay up most of the night before watching zombie movies with Chunk, but even though I was going on two hours of sleep, I don’t know that I would have been able to imagine that. My fantasies aren’t that fun.</p><p>Whether she comes back or not, I still don’t have a fifth period and until someone calls me out on it, I’ll keep hiding out in here. I actually slept way too much last night, so I’m not tired. I pull my phone out to text Holder when the door to the closet begins to open.</p><p>“Are you in here, kid?” I hear her whisper.</p><p>My heart immediately picks up pace and I can’t tell if it’s that she came back or if it’s because the light is on and I’m not really sure I want to see what she looks like when she opens this door.</p><p>“I’m here,” I say.</p><p>The door is still barely cracked. She slips a hand inside and slides it around the wall until she finds the light, then she flicks it off. The door opens and she slips into the room, then quickly shuts it behind her.</p><p>“Can I hide with you?” she asks. Her voice sounds a little different than last time. It sounds happier.</p><p>“You’re not crying today,” I say.</p><p>I feel her make her way over to me. She grazes my leg and can feel that I’m seated on a countertop, so she feels around me until she finds a clear spot. She pushes herself up beside me and takes a seat next to me.</p><p>“I’m not sad today,” she says, her voice much closer this time.</p><p>“Good.” It’s quiet for several seconds, but it’s nice. I’m not sure why she came back or why it took her a week, but I’m glad she’s here.</p><p>“Why were you in here last week?” she asks. “And why are you in here now?”</p><p>“Schedule mishap. I was never assigned a fifth period, so I hide out and hope administration doesn’t notice.”</p><p>She laughs. “Smart.”</p><p>“Yep.”</p><p>It’s quiet again for a minute or so. Our hands are gripping the edge of the counter and every time she swings her legs, her fingers barely touch mine. I eventually just move my hand on top of hers and pull it onto my lap. It seems odd to just grab her hand like this, but we pretty much made out for fifteen minutes straight last week so holding hands is actually reversing a base.</p><p>She slides her fingers between mine and our palms meet, then I fold my fingers over hers. “This is nice,” she says. “I’ve never held anyone’s hand before.”</p><p>I freeze.</p><p>How the hell old is she?</p><p>“You’re not in junior high, are you?”</p><p>She laughs. “God no. I’ve just never held anyone’s hand before. The guys I’ve been with seem to forget this part. But it’s nice. I like it.”</p><p>“Yeah,” I agree. “It is nice.”</p><p>“Wait,” she says. “You aren’t in junior high, are you?”</p><p>“No. Not yet,” I say.</p><p>She swings her leg out to the side and kicks me, then we both laugh.</p><p>“This is kind of weird, isn’t it?” she asks.</p><p>“Elaborate. Lots of things could be considered weird, so I’m not sure what you’re referring to.”</p><p>I feel her shoulders shrug. “I don’t know. This. Us. Kissing and talking and holding hands and we don’t even know what each other looks like.”</p><p>“I’m really good looking,” I say.</p><p>She laughs.</p><p>“I’m serious. If you could see me right now, you’d be on your knees begging me to be your boyfriend so you could flaunt me around the school.”</p><p>“Highly unlikely,” she says. “I don’t do boyfriends. Overrated.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“If you don’t hold hands and you don’t do boyfriends, then what do you do?”</p><p>She sighs. “Pretty much everything else. I’ve got quite a reputation, you know. In fact, it’s possible the two of us may have had sex before and we don’t even realize it.”</p><p>“Not possible. You’d remember me.”</p><p>She laughs again and as much as I’m having fun talking to her, that laugh makes me want to drag her to the floor with me and do nothing but kiss her again.</p> <p>“Are you actually good looking?” she asks skeptically.</p><p>“Terribly good looking,” I reply.</p><p>“Let me guess. Dark hair, brown eyes, great abs, white teeth, Abercrombie &amp; Fitch.”</p><p>“Close,” I say. “Light brown hair, correct on the eyes, abs, and teeth, but American Eagle Outfitters all the way.”</p><p>“Impressive,” she says.</p> <p>“My turn,” I say. “Thick blonde hair, big blue eyes, an adorable little white dress with a matching hat, royal blue skin, and you’re about two feet tall.”</p><p>She laughs loudly. “You have a thing for Smurfette?”</p><p>“A guy can dream.”</p><p>She’s still laughing and the sound of her laughter actually makes my heart hurt. It hurts because I really want to know who this chick is but I know once I find out, I more than likely won’t want her like I want her right now.</p><p>She inhales a breath after her laughter subsides and then the room becomes quiet. So quiet, it’s almost uncomfortable.</p><p>“I’m not coming back in here after today,” she says softly.</p> <p>I squeeze her hand, surprised by the sadness I felt at that confession.</p><p>“I’m moving. Not right away, but soon. This summer. I just think it’d be silly if I came back here, because eventually we’ll have to turn on the light or we’ll slip up and say our names and I just don’t think I want to know who you are.”</p><p>I graze my thumb over her hand. “Why’d you come back today, then?”</p><p>She exhales a delicate breath. “I wanted to thank you.”</p><p>I laugh softly. “For what? Kissing you? That’s all I did.”</p><p>“Yeah,” she says, matter-of-fact. “Exactly. For kissing me. For just kissing me. Do you know how long it’s been since a guy has actually just kissed me? After I left last week I tried to remember, but I couldn’t. Every time a guy has ever kissed me, he’s always been in such a hurry to move on to what comes after the kisses that I don’t think anyone has ever taken the time to give me an honest to God, genuine kiss before.”</p><p>I shake my head. “That’s really depressing,” I say. “But don’t give me too much credit. I’ve been known to want to rush past that part in the past. I just didn’t really care to rush past it last week because you’re a pretty phenomenal kisser.”</p><p>“Yeah,” she says confidently. “I know. Imagine what making love to me could feel like.”</p> <p>I swallow the sudden lump in my throat. “Believe me, I have. For about seven days straight now.”</p><p>Her legs stop swinging next to me. I don’t know if I just made her uncomfortable with that comment.</p><p>“You know what else is sad?” she asks. “No one’s ever made love to me before.”</p><p>This conversation is headed in a weird direction. I can already tell.</p><p>“You’re young. Plenty of time for that. Virginity is actually a turn-on, so you have nothing to worry about.”</p><p>She laughs, but it’s a sad laugh this time.</p><p>Weird how I can already differentiate her laughs.</p><p>“I am so not a virgin,” she says. “That’s why it’s sad. I’m pretty skilled in the sex department, but looking back . . . I’ve never loved any of them. None of them have ever loved me, either. Sometimes I wonder if sex with someone who actually loves you is different. Better.”</p><p>I think about her question and realize that I don’t have an answer. I’ve never loved anyone, either. “Good question,” I say. “It’s kind of sad that we’ve both had sex, multiple times it sounds like, but neither of us has ever loved anyone we’ve done it with. Says a lot about our characters, don’t you think?”</p><p>“Yeah,” she says quietly. “Sure does. A lot of sad truth.”</p><p>It’s quiet for a while and I still have hold of her hand. I can’t stop thinking about the fact that no one’s ever held her hand before. It makes me wonder if I’ve ever held the hands of any of the girls I’ve had sex with. Not that there have been a ton, but enough that I should be able to recall holding one of their hands.</p><p>“I might be one of those guys,” I ashamedly admit. “I don’t know if I’ve ever held a girl’s hand before.”</p><p>“You’re holding mine,” she says.</p><p>I nod slowly. “So I am.”</p><p>A few more beats of silence pass before she speaks again.</p><p>“What if I leave here in forty-five minutes and never hold another guy’s hand again? What if I go through life like I am right now? What if guys continue to take me for granted and I do nothing to change it and I’ll have lots of sex, but never know what it’s like to make love?”</p><p>“So don’t do that. Find you a good guy and tie him down and make love to him every night.”</p><p>She groans. “That terrifies me. As curious as I am about the difference between making love and having sex . . . my stance on relationships makes it impossible to find out.”</p><p>I think about her comment for a while. It’s weird, because she sounds a little like the female version of me. I’m not sure I’m as opposed to relationships as she is, but I’ve definitely never told a girl I loved her and I really hope that doesn’t happen for a hell of a long time.</p><p>“You’re really never coming back?” I ask.</p><p>“I’m really not coming back,” she says.</p><p>I let go of her hand and press my palms onto the cabinet, then jump down. I move and stand in front of her, then place my hands on either side of her. “Let’s solve our dilemma right now.”</p><p>She leans back. “Which dilemma?”</p><p>I move my hands and place them on her hips, then pull her to me. “We have a good forty-five minutes to work with. I’m pretty sure I could make love to you in forty-five minutes. We can see what it’s like and if it’s even worth going through relationships in the future. That way when you leave here, you won’t worry about never knowing what it’s like.”</p><p>She laughs nervously, then leans toward me again. “How do you make love to someone you aren’t in love with?”</p><p>I lean forward until my mouth is next to her ear. “We pretend.”</p><p>I can hear the breath catch in her lungs. She turns her face slightly toward mine and I feel her lips graze my cheek. “What if we’re bad actors?” she whispers.</p><p>I close my eyes, because the possibility that I might actually be making love to this chick in a matter of minutes is almost too much to take in.</p><p>“You should audition for me,” she says. “If you’re convincing then I just might agree to this absurd idea of yours.”</p><p>“Deal,” I say.</p><p>I take a step back and remove my shirt, then lay it on the floor. I grab my jacket off the counter and unfold it, then lay it on the floor as well. I turn back to the counter, then scoop her up. She locks herself around me, burying her head in my neck.</p><p>“Where’s your shirt?” she asks, running her hands across my shoulder. I lower her to the floor, onto her back. I ease myself to her side and pull her against me.</p><p>“You’re lying on it,” I respond.</p><p>“Oh,” she says. “That was considerate of you.”</p><p>I bring my hand up to her cheek. “That’s what people do when they’re this in love.”</p><p>I feel her smile. “How in love are we?”</p><p>“All the way,” I say.</p><p>“Why? What is it about me you love so much?”</p><p>“Your laugh,” I say immediately, not sure how much of that is actually made up. “I love your humor. I also love the way you tuck your hair behind your ears when you’re reading. And I love how you hate to talk on the phone almost as much as I do. I really love that you leave me those little notes all the time in your adorable handwriting. And I love that you love my dog so much, because he really likes you. I also love taking showers with you. Those are always fun.”</p><p>I slide my hand from her cheek to the nape of her neck. I ease my mouth forward and rest my lips against hers.</p><p>“Wow,” she says against my mouth. “You’re really convincing.”</p><p>I smile and pull away. “Stop breaking character,” I tease. “Now it’s your turn. What do you love about me?”</p><p>“I do love your dog,” she says. “He’s a great dog. I also love how you open doors for me even though I’m supposed to want to open doors for myself. I love that you don’t try to pretend you like old black and white movies like everyone else does, because they bore the hell out of me. I also love it when I’m at your house and every time your parents turn the other way, you steal little kisses from me. My favorite part about you though is when I catch you staring at me. I love that you don’t look away and you stare unapologetically, like you aren’t ashamed that you can’t stop watching me. It’s all you want to do because you think I’m the most amazing thing you’ve ever laid eyes on. I love how much you love me.”</p><p>“You’re absolutely right,” I whisper. “I love staring at you.”</p><p>I kiss her mouth, then trail kisses across her cheek and up her jawline. I press my lips against her ear and even though I know we’re pretending, my mouth runs dry at the thought of the words about to pass my lips. I hesitate, almost deciding against it. But an even bigger part of me wants to say it. A huge part of me wishes I could mean it and a small part of me thinks I probably could.</p><p>I run my hands up and through her hair. “I love you,” I whisper.</p><p>The next breath she draws in is a deep one. My heart is hammering against my chest and I’m quiet, waiting on her next move. I have no idea what comes next. Then again, neither does she.</p><p>Her hands move from my shoulders and slowly make their way up to my neck. She tilts her head until her mouth is flush against my ear. “I love you more,” she whispers. I can feel the smile on her lips and I wonder if it matches the smile on my face. I don’t know why I’m suddenly enjoying this so much, but I am.</p><p>“You’re so beautiful,” I whisper, moving my lips closer to her mouth. “So damn beautiful. And every single one of those guys who somehow passed this up is a complete fool.”</p><p>She closes the gap between our lips and I kiss her, but this time the kiss seems so much more intimate. For a brief moment, I actually feel like I really do love all those things about her and she really does love all those things about me. We’re kissing and touching and pulling the rest of our clothes off in such a hurry, it feels as if we’re on a timer.</p><p>I guess we technically are.</p><p>I pull my wallet out of the pocket of my jeans and grab a condom, then ease myself back against her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You can change your mind,” I whisper, hoping to hell she doesn’t.</p><p>“So can you,” she says.</p><p>I laugh.</p><p>She laughs.</p> <p>Then we both shut the hell up and spend the rest of the hour proving exactly how much we love each other.</p><p>I’m on my knees now, quietly gathering our clothes. After I slip my shirt over my head, I pull her up and help her with her own shirt. I stand up and pull on my jeans, then help her to her feet. I rest my chin on top of her head and pull her against me, recognizing the perfect fit.</p><p>“I could turn on the light before you leave,” I say. “Aren’t you a little curious to see the face of the guy you’re madly in love with?”</p><p>She shakes her head against my chest with her laugh. “It’ll ruin everything,” she says. Her words are muffled by my shirt, so she lifts her head away from my chest and tilts her face up to mine. “Let’s not ruin it. Once we find out who each other is, we’ll find something we don’t like. Maybe lots of things we don’t like. Right now it’s perfect. We can always have this perfect memory of that one time we loved somebody.”</p><p>I kiss her again, but it doesn’t last long because the bell rings. She doesn’t release her hold from around my waist. She just presses her head against my chest again and squeezes me tighter. “I need to go,” she says.</p> <p>I close my eyes and nod. “I know.”</p><p>I’m surprised by just how much I don’t want her to go, knowing I’ll never see her again. I almost beg her to stay, but I also know she’s right. It only feels perfect because we’re pretending it’s perfect.</p><p>She begins to pull away from me, so I lift my hands to her cheeks one last time. “I love you, babe. Wait for me after school, okay? In our usual spot.”</p><p>“You know I’ll be there,” she says. “And I love you, too.” She stands on her tiptoes and presses her lips to mine; hard and desperate and sad. She pulls away and makes her way to the door. As soon as she begins to open it, I walk swiftly to her and push the door shut with my hand. I press my chest against her back and I lower my mouth to her ear.</p><p>“I wish it could be real,” I whisper. I put my hand on the doorknob and open it, then turn my head when she slips out the door.</p><p>I sigh and run my hands through my hair. I think I need a few minutes before I can leave this room. I’m not sure I want to forget the way she smells just yet. In fact, I stand here in the dark and try my hardest to commit every single thing about her to my memory, since that’s the only place I’ll ever see her again.</p> <p>Chapter One</p><p>One year later</p><p>“Oh, my God!” I say, frustrated. “Lighten up.” I crank the car just as Val climbs inside and slams her door in a huff, then pushes herself back against the seat.</p><p>As soon as she’s inside the car, the overwhelming amount of perfume she has on begins to suffocate me. I crack the window, but just enough that she won’t think I’m insulting her. She knows how much perfume bothers me, especially when chicks smell like they bathe in it, but she never seems to care what I think, because she continues to douse it on by the gallon.</p><p>“You’re so immature, Daniel,” she mutters. She flips the visor down and pulls her lipstick from her purse, then begins to reapply it. “I’m beginning to wonder if you’ll ever change.”</p><p>Change?</p><p>What the hell is that supposed to mean?</p><p>“Why would I change?” I ask, cocking my head out of curiosity.</p> <p>She sighs and drops her lipstick back into her purse, smacks her lips together, then turns toward me. “So you’re telling me you’re happy with the way you act?”</p><p>What?</p><p>With the way I act? Is she really commenting on the way I act? The same girl I’ve seen curse at waitresses for something as simple as too much ice in her glass is seriously commenting on the way I act?</p><p>I’ve been seeing her off and on for months now and I haven’t had a single clue that she was hoping I would eventually change. Hoping I’d become someone I’m not.</p><p>Come to think of it . . . I keep getting back together with her, thinking she’ll be the one to change. To be nice for once. In reality, people are who they are and they’ll never really change. So why the hell are Val and I even wasting our time on this exhausting relationship if we don’t even really like who each other is?</p><p>“I didn’t think so,” she says smugly, incorrectly assuming my silence was admission that I’m not happy with how I act. In actuality, my silence was the moment of clarity I’ve needed since the day I met her.</p><p>I remain silent until we pull into her driveway. I leave the car running, indicating that I have no plans on going inside with her tonight.</p><p>“You’re leaving?” she asks.</p><p>I nod and stare out the driver’s side window. I don’t want to look at her, because I’m a guy and she’s hot and I know if I look at her, then my moment of clarity regarding our relationship will become foggy and I’ll end up inside her house, making up with her on her bed like I always do.</p><p>“You aren’t the one who gets to be mad, Daniel. You acted ridiculous tonight. And in front of my parents, no less! How do you expect them to ever approve of you if you act the way you do?”</p><p>I have to exhale a slow, calming breath so that I don’t raise my voice like she’s doing right now. “How do I act, Val? Because I was myself at dinner tonight, just like I’m myself every other minute of the day.”</p><p>“Exactly!” she says. “There’s a time and a place for your stupid nicknames and immature antics and dinner with my parents isn’t the time or the place!”</p><p>I rub my hands over my face out of frustration, then I turn and look at her. “This is me,” I say, gesturing toward myself. “If you don’t like all of me, then we’ve got serious issues, Val. I’m not changing and honestly, it wouldn’t be fair of me to ask you to change, either. I would never ask you to pretend to be something you’re not, which is exactly what you’re asking of me right now. I’m not changing, I’ll never change and I would really like it if you would get the hell out of my car right now because your perfume is making me fucking nauseous.”</p><p>Her eyes narrow and she grabs her purse off the console and pulls it toward her. “Oh, that’s nice, Daniel. Insult my perfume to get back at me. See what I mean? You’re the epitome of immature.” She opens the car door and unbuckles her seatbelt.</p><p>“Well at least I’m not asking you to change your perfume,” I say mockingly.</p><p>She shakes her head. “I can’t do this anymore,” she says, getting out of the car. “We’re done, Daniel. For good this time.”</p><p>“Thank God,” I say loud enough for her to hear me. She slams her door and marches toward her house. I roll down her window to air out the perfume and I back out of the driveway.</p><p>Where the hell is Holder? If I don’t get to complain to someone about her, I’ll fucking scream.</p><p>I climb into Sky’s window and she’s sitting on the floor, rummaging through pictures. She looks up and smiles as I make my way into her room. “Hey, Daniel,” she says.</p><p>“Hey, Cheese Tits,” I say as I drop down onto her bed. “Where’s your hopeless boyfriend?”</p><p>She nudges her head toward her bedroom door. “They’re in the kitchen making ice cream. You want some?”</p><p>“Nah,” I say. “I’m too heartbroken to eat anything right now.”</p><p>She laughs. “Val having a bad day?”</p><p>“Val’s having a bad life,” I say. “And after tonight I’ve finally realized I don’t want to be a part of it.”</p><p>She raises her eyebrows. “Oh, yeah? Sounds serious this time.”</p><p>I shrug. “We broke up an hour ago. And who’s they?”</p><p>She shoots me a confused look, so I clarify my question. “You said they were in the kitchen making ice cream. Who’s they?”</p><p>Sky opens her mouth to answer me when her bedroom door swings open and Holder walks in with two bowls of ice cream in his hands. A girl is following behind him with her own bowl of ice cream and a spoon hanging out of her mouth. She pulls the spoon from her lips and kicks the bedroom door shut with her foot, then turns toward the bed and stops when she sees me.</p><p>She looks vaguely familiar, but I can’t place her. Which is odd because she’s cute as hell and I feel like I should probably know her name or remember where I’ve seen her, but I don’t.</p><p>She walks to the bed and sits down on the opposite end of it, eyeing me the whole time. She dips her spoon into her ice cream, then puts the spoon back in her mouth.</p><p>I can’t stop staring at that spoon. I think I love that spoon.</p><p>“What are you doing here?” Holder asks. I regretfully take my eyes off the Ice Cream Girl and watch as he takes a seat on the floor next to Sky and picks up a few of the pictures.</p><p>“I’m done with her, Holder,” I say, stretching my legs out in front of me on the bed. “For good. She’s fucking crazy.”</p><p>“But I thought that’s why you loved her,” he says mockingly.</p><p>I roll my eyes. “Thanks for the insight, Dr. Shitmitten.”</p><p>Sky takes one of the pictures out of Holder’s hands. “I think he’s actually serious this time,” she says to him. “No more Val.” Sky tries to look sad for my sake, but I know she’s relieved. Val never really fit in with the two of them. Now that I think about it, she never really fit in with me, either.</p><p>Holder looks up at me curiously. “Done for good? Really?” He sounds oddly impressed.</p><p>“Yeah, really, really.”</p><p>“Who’s Val?” Ice Cream Girl asks. “Or better yet, who are you?”</p><p>“Oh, my bad,” Sky interrupts. She points back and forth between Ice Cream Girl and me. “Six, this is Dean’s best friend, Daniel. Daniel, this is my best friend, Six.”</p><p>I’ll never get used to hearing Sky call him Dean, but her introduction gives me an excuse to look over at that spoon again. Six pulls it out of her mouth and points it at me. “Nice to meet you, Daniel,” she says.</p><p>How in the hell can I steal that spoon before she leaves?</p><p>“Why does your name sound familiar?” I ask her.</p><p>She shrugs. “I dunno. Maybe because six is a fairly common number? Either that or you’ve heard of what a raging whore I am.”</p><p>I laugh. I don’t know why I laugh, though, because her comment really wasn’t funny. It was actually a little disturbing. “No, that’s not it,” I say, still confused as to why her name sounds so familiar. I don’t think Sky has ever mentioned her in front of me before.</p><p>“The party last year,” Holder says, forcing me to look at him again. I’m pretty sure I roll my eyes when I have to look away from her, but I don’t mean to. I’d just much rather stare at her than at Holder. “Remember?” he says. “It was the week I got back from Austin and a few days before I met Sky. The night Grayson pummeled you on the floor for saying you took Sky’s virginity?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh, you mean the night you pulled me off of him before I even got the chance to kick his ass?” It still irritates me just thinking about it. I could have had him if Holder hadn’t stepped in.</p><p>“Yeah,” Holder confirms. “Jaxon mentioned something that night about Sky and Six, but I didn’t know who they were at the time. I think that’s where you heard her name.”</p><p>“Wait, wait, wait,” Sky says, waving her hands in the air and looking at me like I’m crazy. “What do you mean Grayson pummeled you because you said you took my virginity? What the hell, Daniel?”</p><p>Holder puts a reassuring hand on Sky’s lower back. “It’s cool, babe. He just said it to piss Grayson off because I was about to kick the idiot’s ass for the way he was talking about you.”</p> <p>Sky is shaking her head, still confused. “But you didn’t even know me. You just said it was a few days before you met me, so why would you be pissed that Grayson was talking shit about me?”</p><p>I stare at Holder, too, waiting for his answer. I never thought about it then, but that is odd that he was pissed over Grayson’s comments when he didn’t even know Sky at the time.</p><p>“I didn’t like how he was talking about you,” he says, leaning in to kiss Sky on the side of the head. “It made me think he probably talked about Les the same way and it pissed me off.”</p><p>Shit. Of course he would think that. Now I really wish he had let me kick Grayson’s ass that night.</p><p>“That’s sweet, Holder,” Six says. “You were protecting her before you even knew her.”</p> <p>Holder laughs. “Oh, you don’t know the half of it, Six.”</p><p>Sky looks up at him and they smile at each other, almost like they have some sort of secret, then they both turn their attention back to the pictures on the floor in front of them.</p><p>“What are those?” I ask, inquiring about the pictures they’re looking through.</p><p>“For the yearbook,” Six says, answering me. She sets the bowl of ice cream on the bed beside her, then pulls her feet up and sits cross-legged. “Apparently we’re supposed to submit pictures of ourselves as kids for the senior page, so Sky is going through the pics Karen gave her.”</p><p>“You go to the same school as us?” I ask, referring to the fact that she included herself in the explanation of the assignment. I know we go to a huge school, but I have a feeling I would remember her, especially if she’s Sky’s best friend.</p><p>“I haven’t been to that school since junior year,” she says. “But I’ll be there once Monday rolls around.” She says it like she’s not at all looking forward to it.</p> <p>I can’t help but smile at her reply, though. I wouldn’t mind having to see this girl on a recurring basis. “So does that mean you’ll be joining our lunchroom alliance?” I lean forward and grab the bowl of ice cream she didn’t finish and pull it to me, then take a bite.</p><p>She watches me as I close my lips around the spoon and pull it out of my mouth. She scrunches up her nose, staring at the spoon. “I could have herpes, you know,” she says.</p><p>I grin at her and wink. “You somehow just made herpes sound appealing.”</p><p>She laughs, but her bowl is suddenly ripped from my hands by Holder and he’s pulling me off the bed. My feet hit the floor and he shoves me toward the window. “Go home, Daniel,” he says, releasing his grip on my shirt as he lowers himself back to the floor next to Sky.</p><p>“What the hell, man?” I yell.</p><p>Seriously, though. What the hell?</p><p>“She’s Sky’s best friend,” he says, waving a hand in Six’s direction. “You’re not allowed to flirt with her. If the two of you mess around it’ll just cause tension and make things weird and I don’t want that. Now leave and don’t come back until you can be around her without having the perverted thoughts I know are going through your head right now.”</p><p>For the first time in my life, I think I’m actually speechless. Perhaps I should nod and agree with him, but the idiot just made the biggest mistake he could possibly make.</p> <p>“Shit, Holder,” I groan, running my palms down my face. “Why the hell did you have to go and do that? You just made her off-limits, man.” I begin to make my way back out the window. Once I’m outside, I stick my head back through and look at him. “You should have told me I should date her, then I more than likely wouldn’t have been interested. But you had to go and make her forbidden, didn’t you.”</p><p>“Gee, Daniel,” Six says, unenthusiastically. “Glad to know you think of me as a human being and not a challenge.” She looks at Holder as she stands up from the bed. “And I didn’t realize I had a fifth overprotective brother,” she says, making her way toward the window. “I’ll see you guys later. I probably need to go rummage through my own pictures before Monday, anyway.”</p><p>Holder glances back at me as I step aside and allow Six to climb out the window. He doesn’t say anything, but the look he gives me is a silent warning that Six is completely off-limits to me. I raise my hands in defense, then pull the window shut after Six is outside. She walks a few feet to the house next door and begins to climb through that window.</p><p>“Do you take short-cuts through windows all the time, or do you happen to live in that house?” I ask, walking toward her. Once she’s inside, she spins around and leans her head out. “This would be my window,” she says. “And don’t even think about following me inside. This window has been out of commission for almost a year and I have no plans to reopen for business.”</p><p>She tucks her shoulder-length blonde hair behind her ears and I take a step back, hoping a little distance will allow my heart to stop attacking the walls of my chest. But now that Holder has stupidly declared her off-limits, all I want to do is figure out a way to recommission her window.</p><p>“You really have four older brothers?”</p><p>She nods. I hate the fact that she has four older brothers, but only because it presents four more reasons why I shouldn’t date her. Add that to Holder making her off-limits and I know she’s the only thing I’ll be able to think about now.</p><p>Thanks, Holder. Thanks a lot.</p><p>She rests her chin in her hands and stares at me. It’s dark outside, but the moon overhead is casting a light right on her face and she looks like a fucking angel. I don’t even know if people should use the words fucking and angel in the same thought structure, but shit. She really looks like a fucking angel with her blonde hair and big eyes. I’m not even sure what color her eyes are because it’s dark and I didn’t really pay attention when we were in Sky’s bedroom, but whatever color they are, it’s my new favorite color.</p><p>“You’re very charismatic,” she says.</p><p>Jesus. Her voice completely slays me. “Thanks. You’re pretty cute yourself.”</p><p>She laughs. “I didn’t say you were cute, Daniel. I said you were charismatic. There’s a difference.”</p><p>“Not much of one,” I say. “You like Italian?”</p><p>She frowns and pulls back a few inches like I just insulted her. “Why would you ask me that?”</p><p>Her reaction confuses me. I have no idea how that comment could have offended her. “Uh . . . have you never been asked out on a date before?”</p><p>The scowl disappears from her face and she leans forward again. “Oh. You mean food. I’m sort of tired of Italian food, actually. Just got back from a seven-month exchange there. If you’re asking me out on a date, I’d rather have sushi.”</p><p>“I’ve never had sushi,” I admit, trying to process the fact that I’m pretty sure she just agreed to go out on a date with me.</p><p>“When?”</p><p>This was way too easy. I figured she’d put up a fight and make me beg a little like Val always does. I love that she isn’t playing games. She’s straightforward and I like that about her already.</p><p>“I can’t take you tonight,” I say. “I had my heart completely broken about an hour ago by a psychotic bitch and I need a little more time to recover from that relationship. How about tomorrow night?”</p><p>“Tomorrow is Sunday,” she says.</p><p>“Do you have an issue with Sundays?”</p><p>She laughs. “Not really, I guess. It just seems odd to go on a first date on a Sunday night. Meet me here at seven o’clock, then.”</p><p>“I’ll meet you at your front door,” I say. “And you might not want to tell Sky where you’re going unless you want to see me get my ass kicked.”</p><p>“What’s to tell?” she says sarcastically. “It’s not like we’re going on a random Sunday night date or anything.”</p><p>I smile and back away, slowly heading backward to my car. “It was nice to meet you, Six.”</p><p>She places her hand on her window to pull it down. “Likewise. I think.”</p><p>I laugh, then turn to head toward my car. I’m almost to the door when she calls my name. I spin back around and she’s leaning out her window.</p><p>“I’m sorry about your broken heart,” she whispers loudly. She ducks back into her bedroom and the window closes.</p><p>What broken heart? I’m pretty sure this is the first time my heart has actually felt any form of relief since the moment I started dating Val.</p><p>Chapter Two</p><p>“Does this look okay?” I ask Chunk when I make it into the kitchen. She turns and looks me up and down, then shrugs.</p><p>“I guess. Where ya going?”</p><p>I step in front of one of the mirrors lining the hallway and check my hair again. “A date.”</p><p>She groans, then turns back around to the table in front of her. “You’ve never cared before what you look like. You better not be proposing to her. I’ll divorce this family before I allow you to make her my sister.”</p><p>My mother walks past me and pats me on the shoulder. “You look great, honey. I wouldn’t wear those shoes, though.”</p><p>I look down at my shoes. “Why? What’s wrong with my shoes?”</p><p>She opens a cabinet, takes out a pan, then turns to face me. Her eyes fall to my shoes again. “They’re too bright.” She turns and walks to the stove. “Shoes should never be neon.”</p><p>“They’re yellow. Not neon.”</p><p>“Neon yellow,” Chunk says.</p><p>“Not saying I think they’re ugly,” my mother says. “I just know Val, and Val is more than likely going to hate your shoes.”</p><p>I walk to the kitchen counter and grab my keys, then put my cell phone in my pocket. “I don’t give a shit what Val thinks.”</p><p>My mother turns and looks at me curiously. “Well you’re asking your thirteen-year-old sister if you look good enough for your date, so I think you kind of do care what Val thinks.”</p><p>“I’m not going out with Val. I broke up with Val. I have a new date tonight.”</p><p>Chunk’s arms go up in the air and she looks up to the ceiling. “Thank the Lord!” she proclaims loudly.</p><p>My mother laughs and nods. “Yes. Thank the Lord,” she says, relieved. She turns back toward the stove and I can’t stop looking back and forth between the both of them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What? Neither of you like Val?” I know Val is a bitch, but my family seemed to like her. Especially my mom. I honestly thought she’d be upset we broke up.</p><p>“I hate Val,” Chunk says.</p><p>“God, me, too,” my mother groans.</p><p>“Me three,” my father says, walking past me.</p> <p>None of them are looking at me, but they’re all responding like this has been a previously discussed topic.</p><p>“You mean all of you hated Val?”</p><p>My father turns to face me. “Your mother and I are masters at reverse psychology, Danny-boy. Don’t act so surprised.”</p><p>Chunk raises her hand in the air toward my father. “Me, too, Dad. I reverse psychologized him, too.”</p><p>My dad reaches over and high-fives Chunk’s hand. “Well played, Chunk.”</p> <p>I lean against the frame of the door and stare at them. “You guys were just pretending to like Val? What the hell for?”</p><p>My dad sits at the table and picks up a newspaper. “Children are naturally inclined to make choices that will displease their parents. If we had told you how we really felt about Val, you probably would have ended up marrying her just to spite us. Which is why we pretended to love her.”</p><p>Assholes. All three of them. “You’re never meeting another one of my girlfriends again.”</p><p>My father laughs, but doesn’t seem at all disappointed.</p><p>“Who is she?” Chunk asks. “The girl you’re actually making an effort for.”</p><p>“None of your damn business,” I reply. “Now that I know how this family works, I’m never bringing her around any of you.”</p> <p>I turn to head out the door and my mother calls after me. “Well if it helps, we already love her, Daniel! She’s a sweetheart!”</p><p>“And beautiful,” my dad says. “She’s a keeper!”</p><p>I shake my head. “Y’all suck.”</p><p>“You’re late,” Six says when she appears at her front door. She walks out of her house with her back to me, inserting her key in the lock.</p><p>“You don’t want me to meet your parents?” I ask, wondering why she’s locking her door this early in the evening. She turns around and faces me.</p><p>“They’re old. They ate dinner like ten hours ago and went to bed at seven.”</p><p>Blue. Her eyes are blue.</p><p>Holy shit, she’s cute. Her hair is lighter than I thought it was last night in Sky’s room. Her skin is flawless. It’s like she’s the same girl from last night, only now she’s in HD. And I was right. She really does look like a fucking angel.</p> <p>She steps out of the way and I shut the screen door, still unable to take my eyes off her. “I actually got here early,” I say, finally replying to her first comment. “Holder was dropping Sky off at her house and I swear it took them half an hour to say their good-byes. I had to wait until the coast was clear.”</p><p>She slides her house key into her back pocket and nods. “Ready?”</p><p>I eye her up and down. “Did you forget your purse?”</p><p>She shakes her head. “Nope. I hate purses.” She pats her back pocket. “All I need is my house key. I didn’t bother bringing money since this date was your idea. You’re paying, right?”</p><p>Whoa.</p><p>Back up.</p><p>Let’s assess the last thirty seconds, shall we?</p><p>She hates purses. That means she didn’t bring makeup. Which means she won’t constantly be reapplying that shit like Val does. It also means she’s not hiding a gallon of perfume anywhere on her person. And it also means she had no plans at all to offer to pay for her half of dinner, which seems a little old-fashioned but for some reason I like it.</p><p>“I love that you don’t carry a purse,” I say.</p><p>“I love that you don’t carry one, either,” she says with a laugh.</p><p>“I do. It’s in my car,” I say, nudging my head toward my car.</p><p>She laughs again and begins walking toward the porch steps. I do the same until I see Sky standing just inside her room with her window wide open. I immediately grab Six by her shoulders and pull her until both of our backs are flat against the front door. “You can see Sky’s window from the front yard. She’ll see us.”</p><p>Six glances up at me. “You’re really taking this off-limits order seriously,” she says in a hushed voice.</p><p>“I have to,” I whisper. “Holder doesn’t kid around when he forbids me to date people.”</p><p>She arches a curious eyebrow. “Does Holder usually dictate who you can and can’t date?”</p><p>“No. You’re actually the first.”</p><p>She laughs. “Then how do you know he’ll actually get mad over it?”</p><p>I shrug. “I don’t, really. But the thought of hiding it from him just seems sort of fun. Is it not a little bit exciting for you, hiding this date from Sky?”</p><p>“Yeah,” she says with a shrug. “I guess it is.”</p><p>Our backs are still pressed against the door and for some reason, we’re still whispering. It’s not like Sky could hear us from here, but again, the whispering makes it more fun. And I really like the sound of Six’s voice when she whispers.</p><p>“How do you propose we get out of this situation, Six?”</p><p>“Well,” she says, pondering my question for a moment. “Normally when I’m attempting a risky, clandestine, secret date and I need to escape my house undetected, I ask myself, ‘What would MacGyver do?’”</p><p>Oh, my god, this chick just mentioned MacGyver?</p><p>Hell.</p><p>Yes.</p><p>I break my eyes away from hers long enough to hide the fact that I think I just fell for her and also to assess our escape route. I glance at the swing on the porch, then look back at Six when I’m sure the cheesy grin is gone from my face.</p><p>“I think MacGyver would take your porch swing and build an invisible force field out of grass and matches. Then he would attach a jet engine to it and fly it out of here undetected. Unfortunately I’m all out of matches.”</p><p>She laughs. “Hmmm,” she says, squinting her eyes like she’s coming up with some brilliant plan. “That’s an unfortunate inconvenience.” She glances to my car parked in her driveway, then back up to me. “We could just crawl to your car so she doesn’t see us.”</p><p>And a brilliant plan it would be if it didn’t involve a girl getting dirty. I’ve learned in my six months of on-again off-again with Val that girls don’t like to get dirty.</p><p>“You’ll get dirt on your hands,” I warn her. “I don’t think you can walk into a fancy sushi restaurant with dirty hands and jeans.”</p><p>She looks down at her jeans, then back up to me. “I know this great Bar-B-Q restaurant we could go to, instead. The floor is covered in discarded peanut shells. One time I saw this really fat guy eating at a booth and he wasn’t even wearing a shirt.”</p><p>I smile at the same time I fall a little harder for her. “Sounds perfect.”</p><p>We both drop to our hands and knees and crawl our way off her porch. She’s giggling and her laugh is just making me laugh. “Shh,” I whisper when we reach the bottom of the steps. We crawl across the yard in a hurry, both of us glancing toward Sky’s house every few feet. Once we reach the car, I reach up to my door handle. “Crawl through the driver’s side,” I say to her. “She’ll be less likely to see you.”</p><p>I open the door for her and she crawls into the front seat. Once she’s inside the car, I climb in after her and slide into my seat. We’re both crouched down, which is pointless if you think about it. If Sky were to look out her bedroom window, she’d see my car parked in Six’s driveway. It wouldn’t matter if she saw our heads or not.</p><p>Six wipes the dirt from her hands onto the legs of her jeans and it completely turns me on. She turns her head to face me and I’m still staring at the dirt smeared across the thighs of her jeans. I somehow tear my gaze away and look her in the eyes.</p><p>“You’ll have to disguise your car next time you come over,” she says. “This is way too risky.”</p><p>I like her comment a little too much.</p><p>“Confident there’ll be a next time already?” I ask, smirking at her. “The date just started.”</p><p>“Good point,” she says with a shrug. “I might hate you by the end of the date.”</p><p>“Or I might hate you,” I say.</p><p>“Impossible.” She props her foot up on the dash. “I’m unhateable.”</p><p>“Unhateable isn’t even a real word.”</p><p>She peers over her shoulder into the backseat, then faces forward again with a scowl. “Why does it smell like you had a harem of whores in here?” She pulls her shirt up over her nose to cover up the smell.</p><p>“Does it still smell like perfume?” I don’t even smell it anymore. It’s probably seeped into my pores and I’m now immune to it.</p><p>She nods. “It’s awful,” she says, her voice muffled by her shirt. “Roll down a window.” She makes a fake spitting sound like she’s trying to get the taste of it out of her mouth and it makes me laugh.</p><p>I crank the car, then put it in reverse and begin to back out.</p><p>“The wind will mess up your hair if I roll down the windows. You didn’t bring a purse, which means you didn’t bring a brush, which means you won’t be able to fix your hair when we get to the restaurant.”</p><p>She reaches to her door and presses the button to roll down her window. “I’m already dirty and I’d rather have messy hair than smell like a harem,” she says. She rolls the window down completely, then motions for me to roll mine down as well, so I do.</p><p>I put the car in drive and press on the gas. The car immediately fills with wind and fresh air and her hair begins flying around in all directions, but she just relaxes into the seat.</p><p>“Much better,” she says, grinning at me. She closes her eyes while inhaling a deep breath of the fresh air.</p><p>I try to pay attention to the road, but she makes it pretty damn hard.</p><p>“What are your brothers’ names?” I ask her. “Are they numbers, too?”</p><p>“Zachary, Michael, Aaron, and Evan. I’m ten years younger than the youngest.”</p><p>“Were you an accident?”</p><p>She nods. “The best kind. My mother was forty-two when she had me but they were excited when I came out a girl.”</p><p>“I’m glad you came out a girl.”</p><p>She laughs. “Me, too.”</p><p>“Why’d they name you Six if you were actually the fifth child?”</p><p>“Six isn’t my name,” she says. “Full name is Seven Marie Jacobs, but I got mad at them for moving me to Texas when I was fourteen so I started calling myself Six to piss them off. They didn’t really care, but I was stubborn and refused to give up. Now everyone calls me Six but them.”</p><p>I love that she gave herself a nickname. My kind of girl.</p><p>“Question still applies,” I say. “Why did they name you Seven if you were actually the fifth child?”</p><p>“No reason, really. My dad just liked the number.”</p><p>I nod, then take a bite of food, eyeing her carefully. I’m waiting for that moment. The one that always comes with girls, where the pedestal you place them on in the beginning gets kicked out from under them. It’s usually the moment they start talking about ex-boyfriends or mention how many kids they want or they do something really annoying, like apply lipstick in the middle of dinner. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I’ve been waiting patiently for Six’s flaws to stand out, but so far I can’t find any. Granted, we’ve only interacted with each other for a collective three or four hours now, so hers may just be buried deeper than other people’s.</p><p>“So you’re a middle child?” she asks. “Do you suffer from middle-child syndrome?”</p><p>I shake my head. “Probably about as much as you suffer from fifth-child syndrome. Besides, Hannah is four years older than me and Chunk is five years younger, so we have a nice spread.”</p><p>She chokes on her drink with her laugh. “Chunk? You call your little sister Chunk?”</p> <p>“We all call her Chunk. She was a fat baby.”</p><p>She laughs. “You have nicknames for everyone,” she says. “You call Sky Cheese Tits. You call Holder Hopeless. What do you call me when I’m not around?”</p><p>“If I give people nicknames, I do it to their faces,” I point out. “And I haven’t figured yours out yet.” I lean back in my seat and wonder myself why I haven’t given her one yet. The nicknames I give people are usually pretty instant.</p><p>“Is it a bad thing you haven’t nicknamed me yet?”</p><p>I shrug. “Not really. I’m just still trying to figure you out is all. You’re kind of contradictory.”</p> <p>She arches an eyebrow. “I’m contradictory? In what ways?”</p><p>“All of them. You’re cute as hell, but you don’t give a shit what you look like. You look sweet, but I have a feeling you’re just the right mix of good and evil. You seem really easygoing, like you aren’t the type to play games with guys, but you’re kind of a flirt. And I’m not judging at all by this next observation, but I’m aware of your reputation, yet you don’t seem like the type who needs a guy’s attention to stroke your self-esteem.”</p><p>Her expression is tight as she takes in everything I’ve just said. She reaches to her glass and takes a sip without breaking her stare. She finishes her drink, but holds the glass against her lips while she thinks. She eventually lowers it back to the table and looks down at her plate, picking up her fork.</p><p>“I’m not like that anymore,” she says softly, avoiding my gaze.</p><p>“Like what?” I hate the sadness in her voice now. Why do I always say stupid shit?</p><p>“I’m not how I used to be.”</p> <p>Way to go, Daniel. Dumbass.</p><p>“Well, I didn’t know you back then, so all I can do is judge the girl sitting in front of me right now. And so far, she’s been a pretty damn cool date.”</p><p>The smile spreads back to her lips. “That’s good,” she says, looking back up at me. “I wasn’t sure what type of date I’d be, considering this is the first one I’ve ever been on.”</p><p>I laugh. “No need to stroke my ego,” I say. “I can handle the fact that I’m not the first guy to ever express an interest in you.”</p><p>“I’m serious,” she says. “I’ve never been on a real date before. Guys tend to skip this whole part with me so they can just get to what they really want me for.”</p><p>My smile disappears. I can tell by the look on her face she’s being completely serious. I lean forward and look her hard in the eyes. “Those guys were all fucktards.”</p><p>She laughs, but I don’t.</p><p>“I’m serious, Six. Those guys all need a good kick to the clit, because dinner-talk is by far the best part of you.”</p> <p>When the sentence leaves my mouth, the smile leaves her face. She looks at me like no one’s ever given her a genuine compliment before. It pisses me off.</p><p>“How do you know this is the best part of me?” she asks, somehow finding that teasing, flirtatious tone in her voice again. “You haven’t had the pleasure of kissing me yet. I’m pretty sure that’s the best part of me, because I’m a phenomenal kisser.”</p><p>Jesus Christ. I don’t know if that was an invitation, but I want to send her my RSVP right this second. “I have no doubt being kissed by you would be fantastic, but if I had to choose, I’d take dinner-talk over a kiss any day.”</p><p>She narrows her eyes. “I call bullshit,” she says with a challenging glare. “There’s no way any guy would pick dinner-talk over a good make-out session.”</p><p>I attempt to return her challenging look, but she makes a good point.</p><p>“Okay,” I admit. “Maybe you’re right. But if I had my way, I’d pick kissing you during dinner-talk. Get the best of both worlds.”</p><p>She nods her head, impressed. “You’re good,” she says, leaning back in her seat. She folds her arms over her chest. “Where’d you learn those smooth moves?”</p><p>I wipe my mouth with my napkin, then set it on top of my plate. I lift my elbows until they’re resting on the back of the booth and I smile at her. “I don’t have smooth moves. I’m just charismatic . . . remember?”</p><p>Her mouth curls up into a grin and she shakes her head like she knows she’s in trouble. Her eyes are smiling at me and I realize I’ve never felt like this before with any other girl. Not that I have it in my head that we’re about to fall in love or we’re soulmates or some shit like that. I’ve just never been around a girl where being myself was actually a good thing. With Val, I was always trying my hardest not to piss her off. With past girlfriends, I always found myself holding back from all the shit I really wanted to say. I’ve always felt like being myself with a girl wasn’t necessarily a good thing because I’ll be the first to admit, I can be a little over the top.</p><p>It’s different with Six, though. Not only does she get my sense of humor and my personality, but I feel like she encourages it. I feel like the real me is what she likes the most and every time she laughs or smiles at the perfect moment, I want to fist bump her.</p><p>“You’re staring at me,” she says, breaking me out of my thoughts.</p><p>“So I am,” I say, not bothering to look away.</p><p>She stares right back at me but her demeanor and expression grow competitive as she narrows her eyes and leans forward. She’s silently challenging me to a staring contest.</p><p>“No blinking,” she says, confirming my thoughts.</p><p>“Or laughing,” I say.</p><p>And it’s on. We silently stare at each other for so long, my eyes begin to water and my grip tightens on the table. I try my hardest to keep my eyes locked on hers but they want to stare at every inch of her. I want to stare at her mouth and those full, pink lips and that soft, silky blonde hair. Not to mention her smile. I could stare at her smile all day.</p><p>In fact, I’m staring at it right now so I’m pretty sure that means I just lost the staring contest.</p><p>“I win,” she says, right before she takes another drink of her water.</p><p>“I want to kiss you,” I say bluntly. I’m a little shocked I said it, but not really. I’m pretty impatient and I really want to kiss her and I usually say whatever I’m thinking, so . . .</p><p>“Right now?” she asks, looking at me like I’m insane. She sets her glass back down on the table.</p><p>I nod. “Yep. Right now. I want to kiss you over dinner-talk so I can have the best of both worlds.”</p><p>“But I just ate onions,” she says.</p><p>“So did I.”</p><p>She’s working her jaw back and forth, actually contemplating an answer. “Okay,” she says with a shrug. “Why not?”</p><p>As soon as she gives me permission, I glance down at the table between us, wondering what the best way to do this would be. I could go sit with her on her side of the booth, but that might be invading her personal space too much. I reach in front of me and push my glass out of the way, then scoot hers to the left.</p><p>“Come here,” I say, placing my hands on top of the table as I lean toward her. She must have thought I was kidding by the way her eyes dart nervously around us, taking in the fact that we’re about to experience our first kiss in public.</p><p>“Daniel, this is awkward,” she says. “Do you really want our first kiss to be in the middle of a restaurant?”</p><p>I nod. “So what if it’s awkward? We’ll have a do-over later. People put way too much stock in first kisses, anyway.”</p><p>She tentatively places her palms facedown on the table, then pushes herself up and slowly leans in toward me. “Okay, then,” she says, following her words up with a sigh. “But it would be so much better if you wait until the end of our date when you walk me to my front door and it’ll be dark and we could be really nervous and you could accidentally touch my boob. That’s how first kisses are supposed to be.”</p><p>I laugh at her comment. We still aren’t close enough for me to kiss her yet, but we’re getting there. I lean forward a little more, but her eyes leave mine and focus on the table behind me.</p><p>“Daniel, there’s a woman in the booth behind you changing her baby’s diaper on the table. You’re about to kiss me and the last thing I’ll see before your lips touch mine is a woman wiping her infant’s ass.”</p><p>“Six. Look at me.” She brings her eyes back to mine and we’re finally close enough that I could reach her mouth. “Ignore the diaper,” I command. “And ignore the two men in the booth to our left who are swigging their beer and watching us like I’m about to bend you over this table.”</p><p>Her eyes dart to the left, so I catch her chin in my hand and force her attention back to me. “Ignore it all. I want to kiss you and I want you to want me to kiss you and I don’t really feel like waiting until I walk you to your porch tonight because I’ve never really wanted to kiss someone this much before.”</p><p>Her eyes drop to my mouth and I watch as everything around us disappears from her field of vision. Her tongue slips out of her mouth and glides nervously across her lips before it disappears again. I slide my hand from her chin to the nape of her neck and I pull her forward until our lips meet.</p><p>And holy shit, do they meet. Our mouths meld together like they used to be in love and they’re just now seeing each other for the first time in years. My stomach feels like it’s in the middle of a damn rave and my brain is trying to remember how to do this. It’s like I suddenly forgot how to kiss, even though it’s only been a day since I broke up with Val. I’m pretty sure I kissed Val yesterday, but for some reason my brain is acting like this is all new and it’s telling me I should be parting my lips or teasing her tongue, but the signals just aren’t making it to my mouth yet. Or my mouth is just ignoring me because it’s been paralyzed by the soft warmth pressed against it.</p><p>I don’t know what it is, but I’ve never held a girl’s lips between mine for this long without breathing or moving or taking the kiss as far as I can possibly take it.</p><p>I inhale, even though I haven’t taken a breath in almost a minute. I loosen my grip on the back of Six’s head and begin to slowly pull my lips from hers. I open my eyes and hers are still closed. Her lips haven’t moved and she’s taking in shallow, quiet breaths as I remain poised close to her face, watching her.</p><p>I don’t know if she expected more of a kiss. I don’t know if she’s ever had a peck last more than a minute before. I don’t know what she’s thinking, but I love the look on her face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Don’t open your eyes,” I whisper, still staring at her. “Give me ten more seconds to stare, because you look absolutely beautiful right now.”</p><p>She tucks her bottom lip in with her teeth to hide her smile, but she doesn’t move. My hand is still on the back of her head and I’m silently counting down from ten when I hear the waitress pause at our table.</p><p>“Y’all ready for your ticket?”</p><p>I hold up a finger, asking the waitress to give me a second. Well, five seconds to be exact. Six never moves a muscle, even after hearing the waitress speak. I count down silently until my ten seconds are up, then Six slowly opens her eyes and looks up at me.</p> <p>I back away from her, putting several inches of space between us. I keep my eyes locked with hers. “Yes, please,” I say, giving the waitress her answer. I hear her tear off the ticket and slap it down on the table. Six smiles, then begins laughing. She backs away from me and falls back down in her booth.</p><p>I breathe and it feels like the air is all brand new.</p><p>I slowly take my seat in the booth again, watching her laugh. She scoots the ticket toward me. “Your treat,” she says.</p><p>I reach into my pocket and pull out my wallet, then lay cash down on top of the ticket. I stand up and reach out for Six’s hand. She looks at it and smiles, then takes it. When she stands, I wrap my arm around her shoulder and pull her against me.</p><p>“Are you going to tell me how awesome that kiss was or are you going to ignore it?”</p> <p>She shakes her head and laughs at me. “That wasn’t even a real kiss,” she says. “You didn’t even try to put your tongue in my mouth.”</p><p>I push open the doors to walk outside, but step aside and let her out first.</p><p>“I didn’t have to put my tongue in your mouth,” I say. “My kisses are that intense. I don’t even really have to do anything. The only reason I pulled back was that I was sure we were about to experience a classic, ‘When Harry met Sally’ moment.”</p><p>She laughs again.</p><p>God, I love that she thinks I’m funny.</p><p>I open the passenger door for her and she pauses before climbing inside. She looks up at me. “You realize that classic scene is Sally proving a point about how easy it is for women to fake orgasms, right?”</p> <p>God, I love that I think she’s funny.</p><p>“Do I have to take you home yet?” I ask.</p><p>“Depends on what you have in mind next.”</p><p>“Nothing really,” I admit. “I just don’t want to take you home yet. We could go to the park next to my house. They have a jungle gym.”</p><p>She grins. “Let’s do it,” she says, holding up a tight fist in front of her.</p><p>I naturally bring my fist up and bump hers. She hops into the car and I shut her door, dumbfounded over the fact that she just fist bumped me.</p><p>The girl just fist bumped me and it was probably the hottest thing I’ve ever seen.</p><p>I walk to my side of the car and open the door, then take a seat. Before I crank the car I turn to look at her. “Are you really a guy?”</p> <p>She raises an eyebrow, then pulls the collar of her shirt out and takes a quick glance down at her chest. “Nope. Pretty damn girl,” she says.</p><p>“Are you dating someone?”</p><p>She shakes her head.</p><p>“Are you leaving the country tomorrow?”</p><p>“Nope,” she says, her face obviously confused by my line of questions.</p><p>“What’s your deal, then?”</p><p>“What do you mean?”</p><p>“Everyone has something and I can’t figure yours out. You know, that one thing about themselves that’s eventually a deal-breaker.” I crank the car and begin to back out. “I want to know what yours is right now. My heart can’t take another second of these tiny little things you do that drive me completely insane.”</p><p>Her smile changes. It grows from a genuine smile to a guarded one. “We all have deal-breakers, Daniel. Some of us just hope we can keep them hidden forever.”</p><p>She rolls down her window again and the noise makes it impossible to continue the conversation. I’m almost positive the overwhelming scent of perfume is gone, so I’m curious if her need for the noise is why she rolled down the window this time.</p><p>“Do you bring all your dates here?” she asks.</p><p>I think about her question for a minute before answering. “Pretty much,” I finally say after silently tallying the ends of all my dates. “I did take this chick out once in eleventh grade but I took her home during the middle of the date because she got a stomach virus. I think she’s the only one I never brought here.”</p><p>She digs her heels into the dirt and comes to a stop in the swing. I’m standing behind her, so she turns around and looks up at me. “Seriously? You’ve brought all but one girl here?”</p><p>I shrug. Then nod. “Yeah. But none of them has ever wanted to literally play before. We usually just make out.”</p><p>We’ve been here half an hour and already she’s made me watch her on the monkey bars, push her on the merry-go-round and now I’ve been pushing her while she swings for the last ten minutes. I’m not complaining, though. It’s nice. Really nice.</p><p>“Have you ever had sex out here?” she asks.</p><p>I’m not sure how to take her bluntness. I’ve never really met anyone who asks the same straightforward questions I would, so I’m beginning to feel a little sympathetic to the people I put on the spot like this. I glance around the park until I see the makeshift wooden castle. I point to it. “You see the castle?”</p><p>She turns her head to look at the castle. “You had sex in there?”</p><p>I drop my arm and slide both my hands into the back pockets of my jeans. “Yep.”</p><p>She stands and begins to walk in that direction.</p><p>“What are you doing?” I ask her. I’m not sure why she’s heading toward the castle, but I’m almost positive it’s not because she’s weird and wants to have sex in the same spot I had sex with Val two weeks ago.</p><p>Does she?</p><p>God I hope not.</p><p>“I want to see where you had sex,” she says, matter-of-fact. “Come show me.”</p><p>This girl confuses the hell out of me. What’s strange is how much I freaking love it. I begin jogging until I catch up with her. We walk until we reach the castle. She looks at me expectantly, so I point to the doorway. “Right in there,” I say.</p><p>She walks to the doorway and peeks inside. She looks around for a minute, then pulls back out. “Looks really uncomfortable,” she says.</p><p>“It was.”</p><p>She laughs. “If I tell you something will you promise not to judge me?”</p><p>I roll my eyes. “It’s human nature to judge.”</p><p>She inhales a breath, then releases it. “I’ve had sex with six different people.”</p><p>“At once?” I say.</p><p>She shoves my arm. “Stop. I’m trying to be honest with you here. I’m only eighteen and I lost my virginity when I was sixteen. Plus, I haven’t had sex in about a year, so if you add it up, that’s six people in just a little over fifteen months. That’s like a whole new person every two and a half months. Only sluts do that.”</p><p>“Why have you not had sex in over a year?”</p><p>She rolls her eyes and begins to walk past me. I follow her. When she reaches the swings, she takes her seat again. I sit in the swing beside her and twist my body until I’m facing her, but she faces forward.</p><p>“Why have you not had sex in over a year?” I say again. “You didn’t like any of the boys you met in Italy?”</p><p>I can’t see her face, but her body language reveals that this could be that one thing. The thing that changes it all for me.</p><p>“There was this one boy in Italy,” she says softly. “But I don’t want to talk about him. And yes, he’s why I haven’t had sex in over a year.” She looks back at me. “Look, I know my reputation precedes me and I don’t know if that’s why you brought me here or what you expect to happen at the end of this date, but I’m not that girl anymore.”</p><p>I lift my legs until my swing spins forward again. “The only thing I was hoping for at the end of this date was a kiss on your front porch,” I say. “And maybe an accidental boob grab.”</p><p>She doesn’t laugh. I suddenly hate that I brought her here.</p><p>“Six, I didn’t bring you here expecting anything. Yes, I’ve brought girls here in the past but that’s only because I live across the street and I come here a lot. And yes, maybe I brought all those other girls here to have a little privacy while we made out, but that’s only because I more than likely just wanted them to shut up and kiss me because they were getting on my everlasting nerves. But I only brought you here because I wasn’t ready to take you home yet. I don’t even really want to make out with you because I like talking to you too much.”</p><p>I close my eyes, wishing I hadn’t just said all that. I know girls like guys who play the uninterested asshole part. I’m usually pretty good at playing that part, but not with Six. Maybe because I usually am an uninterested asshole, but with her I’m as interested and curious and hopeful as I can possibly be.</p><p>“Which house is yours?” she asks.</p><p>I point across the street. “That one,” I say, pointing to the one with the living room light on.</p><p>“Really?” she asks, sounding genuinely interested. “Is your family home?”</p><p>I nod. “Yeah, but you aren’t meeting them. They’re evil liars and I already told them I was never bringing you home to meet them.”</p><p>I can feel her turn and look at me. “You told them you were never bringing me to meet them? So you already mentioned me?”</p><p>I meet her gaze. “Yes. I might have mentioned you.”</p><p>She smiles. “Which one is your bedroom?”</p><p>“First window on the left side of the house. Chunk’s bedroom is the window on the right. The one with the light on.”</p><p>She stands up again. “Is your window unlocked? I want to see what your bedroom looks like.”</p><p>Jesus, she’s nosey.</p><p>“I don’t want you to see my bedroom. I’m unprepared. It’s messy.”</p><p>She begins walking toward the street. “I’m going anyway.”</p><p>I lean my head back and groan, then stand up and follow her toward the house.</p><p>“You’re a piece of work,” I say as we reach my window. She presses her palms against the glass and pushes up. The window doesn’t budge, so I push her aside and open it for her. “I’ve never snuck into my own bedroom before,” I admit. “I’ve snuck out before, but never in.”</p><p>She begins to lift herself up over the ledge, so I grab her by the waist and assist her. She throws her leg over the edge of it and slips inside. I climb in behind her, then walk to the dresser and turn on my lamp. I make a scan of the room to ensure there isn’t anything I don’t want her to see. I kick a pair of underwear under the bed.</p><p>“I saw those,” she whispers. She walks to my bed and presses her palms into the mattress, then straightens back up. She scans the room slowly, taking in everything about me. It feels weird, like I’m being exposed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I like your room,” she says.</p><p>“It’s a room.”</p><p>She disagrees with a shake of her head. “No, it’s more than that. This is where you live. This is where you sleep. This is where you feel the most privacy in your whole entire life. This is more than just a room.”</p><p>“It doesn’t feel very private right now,” I say, watching as she skims her hand across every surface of my room. She turns and looks at me, then faces me full-on.</p> <p>“What’s the one thing in this room that tells the biggest secret about you?”</p><p>I laugh under my breath. “I’m not telling you that.”</p><p>She tilts her head. “So I’m right. You have secrets.”</p><p>“I never said I didn’t.”</p><p>“Give me one,” she asks. “Just one.”</p> <p>I’ll give them all to her if she keeps looking at me like this. She’s so damn adorable. I walk slowly toward her and she swallows a gulp of air. I stop when I’m several inches from her, then I nod my head down toward my mattress. “I’ve never kissed a girl on this bed,” I whisper.</p><p>She looks down at my mattress, then back up to me. “I hope you really don’t expect me to believe you’ve never made out with a girl in your room before.”</p><p>I laugh. “I didn’t say that. I stated I had never kissed a girl on this particular bed. I was being honest, because it’s a brand-new mattress. I just got it last week.”</p><p>I can see the change in her eyes. The heavy rise and fall of her chest. She likes that I’m so close to her and she likes that I’m insinuating I want to kiss her on my bed.</p><p>Her eyes fall to the bed. “Are you saying you want to kiss me on your bed?”</p><p>I lean in closer until my lips are right next to her ear. “Are you saying you would let me?”</p> <p>She sucks in a soft rush of air and I love that we’re both feeling this. I want to kiss her on my bed so damn bad. I want it more than I even wanted the damn bed. Hell, I don’t even care if it’s on the bed. I just want to kiss her. I don’t care where it is. I’ll kiss her anywhere she’ll allow me to kiss her.</p><p>I close the small gap between our bodies by resting my hands on her hips and pulling her to me. Her hands fly up to my forearms and she gasps. I dig my fingers into her hips and rest my cheek against hers. My mouth is still grazing her ear as I close my eyes, enjoying the feel of this.</p><p>I love the way she smells. I love the way she feels. And even though I haven’t really given her an honest to God kiss yet, I already love the way she kisses.</p><p>“Daniel,” she whispers. My name crashes against my shoulder when it rushes out of her mouth. “Will you take me home now?”</p><p>I wince at her words, immediately wondering what I just did wrong. I remain still for several long seconds, waiting until the feel of her against me no longer has me completely paralyzed.</p><p>“You didn’t do anything wrong,” she says, immediately easing the doubt building inside me. “I just think I should go home.”</p><p>Her voice is soft and sweet and I suddenly hate every single guy in her past who has ever failed to get to know this side of her.</p><p>I don’t release her immediately. I turn my head slightly until my forehead is touching the side of her head. “Did you love him?” I ask, allowing my brilliant brain to completely ruin this moment between us.</p> <p>“Who?”</p><p>“The guy in Italy,” I clarify. “The one who hurt you. Did you love him?”</p><p>Her forehead meets my shoulder and the way she fails to respond to that question reveals her answer, but it also fills me with so many more questions. I want to ask her if she still loves him. If she’s still with him. If they still talk.</p><p>I don’t say anything, though, because I have a feeling she wouldn’t be here with me right now if any of that were the case. I bring my hand up to the back of her head and I press my lips into her hair. “Let’s get you home,” I whisper.</p><p>“Thanks for buying me dinner,” she says when we reach her front door.</p><p>“You didn’t really give me a choice. You left your house without a penny and then you shoved the bill in my face.”</p><p>She laughs as she unlocks her front door, but doesn’t open it yet. She turns back around and lifts her eyes, looking at me through lashes so long and thick, I have to refrain from reaching out and touching them.</p><p>Kissing her at dinner was definitely spontaneous, but I was sure it would make this moment a breeze.</p><p>It hasn’t.</p><p>If anything, I feel even more pressure to kiss her because it’s already happened once tonight. And the fact that it’s already happened and I know how damn good it feels makes me want it even more, but now I’m scared I’ve built it up too much.</p><p>I begin to lean in toward her when her lips part.</p><p>“Are you gonna use tongue this time?” she whispers.</p><p>I squeeze my eyes shut and take a step back, completely thrown off by her comment. I rub my palms down my face and groan.</p><p>“Dammit, Six. I was already feeling inadequate. Now you’ve just put expectations on it.”</p><p>She’s smiling when I look at her again. “Oh, there are definitely expectations,” she says teasingly. “I expect this to be the most mind-blowing thing I’ve ever experienced, so you better deliver.”</p><p>I sigh, wondering if the moment can possibly be recovered. I doubt it. “I’m not kissing you now.”</p><p>She nods her head. “Yes you are.”</p><p>I fold my arms over my chest. “No. I’m not. You just gave me performance anxiety.”</p><p>She takes a step toward me and slides her hands between my folded arms, pushing against them until they unlock. “Daniel Wesley, you owe me a do-over since you made me kiss you in a crowded restaurant next to a dirty diaper.”</p><p>“It wasn’t crowded,” I interject.</p><p>She glares at me. “Put your hands on my face and push me against this wall and slip me some tongue! Now!”</p><p>Before she can laugh at herself, my hands are casing her face and her back is pressed against the wall of her house and my lips are on hers. It happens so fast, it catches her off guard and she gasps, which causes her lips to part farther than she probably meant for them to. As soon as I caress the tip of her tongue with mine, she’s clenching my shirt in two tight fists, pulling me closer. I tilt my head and take the kiss deeper, wanting to give her all the feels she can possibly get from a kiss and I want her to have them all at once.</p><p>My mouth isn’t having a problem remembering what to do this time. What it’s having a problem with is remembering how to slow down. Her hands are now in my hair and if she moans into my damn mouth one more time I’m afraid I might carry her to the backseat of my car and try to cheapen this date.</p><p>I can’t do that. I can’t, I can’t, I can’t. I like this girl too much already and I’ll be damned if this isn’t our first date and she already has me thinking about the next one. I brace my hands on the wall behind her head and I force myself to push off of her.</p><p>We’re both panting. Gasping for breath. I’m breathing heavier than any kiss has ever made me breathe before. Her eyes are closed and I absolutely love how she doesn’t immediately open them when I’m finished kissing her. I like that she seems to want to savor the way I make her feel, just like I want to savor her.</p><p>“Daniel,” she whispers.</p><p>I groan and drop my forehead to hers, touching her cheek with my hand. “You make me love my name so damn much.”</p><p>She opens her eyes and I pull back, looking down on her, still stroking her cheek. She’s looking at me the same way I’m looking at her. Like we can’t believe our luck.</p><p>“You better not turn out to be an asshole,” she says quietly.</p><p>“And you better be done with that guy in Italy,” I reply.</p><p>She nods. “I am,” she says, although her eyes seem to tell a different story. I try not to read into it because whatever it is, it doesn’t matter now. She’s here with me. And she’s happy about that. I can tell.</p><p>“You better not take back the girl who broke your heart last night,” she adds.</p><p>I shake my head. “Never. Not after this. Not after you.”</p><p>She seems relieved by my answer.</p><p>“This is scary,” she whispers. “I’ve never had a boyfriend before. I don’t know how this works. Do people become exclusive this fast? Are we supposed to pretend we’re not that interested for a few more dates?”</p><p>Oh, dear God.</p><p>I’ve never been turned on by a girl laying claim to me before. I usually run in the other direction. She’s obliterating every single thing I thought I knew about myself with every new sentence that passes those lips.</p><p>“I have no interest in faking disinterest,” I say. “If you want to call yourself my girlfriend half as much as I wish you would, then it would save me a whole lot of begging. Because I was literally about to drop to my knees and beg you.”</p><p>She squints her eyes playfully. “No begging. It screams desperation.”</p><p>“You make me desperate,” I say, pressing my lips to hers again. I choose to keep this kiss simple, even though I want to grab her face again and hold her against the wall. I pull away from her and we stare at each other. We stare at each other for so long I begin to worry that she’s put some kind of spell on me, because I’ve never wanted to just stare at a girl like I want to stare at her. Just looking at her causes my heart to burn and my chest to constrict and I’m sort of freaking out that I barely know her at all and we’ve just made ourselves exclusive.</p><p>“Are you a witch?” I ask.</p><p>Her laugh returns and I suddenly don’t care if she’s a witch. If this is some kind of spell she’s put on me, I hope it never breaks.</p><p>“I have no idea who you even are and now you’re my damn girlfriend. What the hell have you done to me?”</p><p>She holds her palms up defensively. “Hey, don’t blame me. I’ve gone eighteen years swearing off boyfriends and then you show up out of the blue with your vulgar mouth and terribly awkward first kisses and now look at me. I’m a hypocrite.”</p><p>“I don’t even know your phone number,” I say.</p><p>“I don’t even know your birthday,” she says.</p><p>“You’re the worst girlfriend I’ve ever had.”</p><p>She laughs and I kiss her again. I notice I have to kiss her every time she laughs and she laughs a lot. Which means I have to kiss her a lot. God, I hope she doesn’t laugh in front of Sky or Holder because it’s going to be so damn hard not to kiss her.</p><p>“You better not tell Sky about us,” I say. “I don’t want Holder to know yet.”</p><p>“What about school? I enroll tomorrow. You don’t think it’ll be obvious when we interact?”</p><p>“We’ll pretend we hate each other. It could be fun.”</p><p>She tilts her face up and finds my mouth again, giving me a light peck. “But how do you plan on keeping your hands off me?”</p><p>I slide my other hand to her waist. “I won’t keep my hands off you. I’ll just touch you when they aren’t looking.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“This is gonna be so much fun,” she whispers.</p><p>I smile and pull her against me again. “Damn right it is.” I dip my head and kiss her one last time. I release her, then reach behind her and turn the doorknob, pushing open her front door. “See you tomorrow.”</p><p>She backs up two steps until she’s in her doorway. “See you tomorrow.”</p><p>She begins to turn and head into her house, but I grab her wrist and pull her back out. I wrap an arm around her lower back and lean in until my lips touch hers. “I forgot to accidentally touch your boob.”</p> <p>I catch her laugh with my mouth and graze her breast with the palm of my hand, then I immediately pull away from her. “Oops. Sorry.”</p><p>She’s covering her laugh with her hand as she backs into her house. She closes the door and I immediately fall to my knees, then onto my back. I stare straight up at the roof of her porch, wondering what in the hell just happened to my heart.</p><p>The door slowly reopens and she looks down at me, sprawled across her front porch like an idiot.</p><p>“I just needed a minute to recover,” I say, smiling up at her. I’m not even excusing the fact that I’m shamelessly affected by her. She winks, then begins to close the door.</p><p>“Six, wait,” I say, pushing myself up. She opens the door again and I reach up and grab the doorframe, then lean in toward her. “I know I just broke up with someone last night, but I need you to know you aren’t a rebound. You know that, right?”</p> <p>She nods. “I know,” she says confidently. “Neither are you.”</p><p>With that, she steps back into her house and closes her door.</p><p>Christ.</p><p>Motherfucking angel.</p><p>Chapter Three</p><p>“Let’s go!” I tell her for the fifth time.</p> <p>She grabs her backpack and groans, then stands up and pushes her chair in. “What’s your freakin’ deal, Daniel? You’re never in a hurry to get to school.” She downs the rest of her orange juice. I’m standing at the door where I’ve been standing for five minutes, ready to leave. I hold open the front door and follow her outside.</p><p>Once we’re in the car I don’t even wait for her to shut her door before I’m putting it in reverse.</p><p>“Seriously, why are you in such a hurry?” she asks.</p><p>“I’m not in a hurry,” I say defensively. “You were just being really slow.”</p><p>The last thing she needs to know is how utterly pathetic I am. So pathetic I’ve been awake for two hours now, waiting until we could leave. I probably won’t even see Six until lunch if we don’t have classes together, so I really don’t know why I’m in a hurry.</p><p>I didn’t think about that. I hope we do have classes together.</p><p>“How was your date last night?” Chunk asks as she puts on her seatbelt.</p><p>“Good,” I say.</p> <p>“Did you kiss her?”</p><p>“Yep.”</p><p>“Do you like her?”</p><p>“Yep.”</p><p>“What’s her name?”</p><p>“Six.”</p><p>“No, really. What’s her name?”</p><p>“Six.”</p><p>“No, not whatever nickname you gave her. What does everyone else call her?”</p><p>I roll my head and look at her. “Six. They call her Six.”</p><p>Chunk scrunches up her nose. “Weird.”</p><p>“It fits her.”</p><p>“Do you love her?”</p><p>“Nope.”</p><p>“Do you want to?”</p><p>“Ye—”</p><p>Whoa.</p><p>Hold up.</p><p>Do I want to?</p><p>I don’t know. Maybe. Yes? Shit. I don’t know. How screwed up is it that I broke up with a girl two days ago and I’m already contemplating the possibility of loving someone else?</p><p>Well, technically, I don’t think I really loved Val. I sort of thought I did on occasion, but I think if a person is really, truly in love then it has to be unconditional. How I felt about Val was definitely not unconditional. I had conditions for every single feeling I had about her. Hell, the only reason I ever asked her out in the first place is that for about fifteen seconds, I thought she was Cinderella.</p><p>After that experience in the closet last year, that mystery girl was all I could think about. I looked for her everywhere, even though I had no idea what she looked like. I was pretty sure she had blonde hair, but it was dark, so I could have been wrong. I listened to every single girl’s voice I walked past to see if they sounded like her. The problem was, they all sounded like her. It’s hard to memorize a voice when you don’t have a face to back it up with, so I would always find small things that reminded me of her in every girl I spoke to.</p><p>With Val, I actually convinced myself she was Cinderella. I was walking past her in the hallway one afternoon on my way to History class. I’d seen her in the past but never paid much attention to her because she seemed a little high-maintenance for me. I accidentally bumped her shoulder when I passed her because my head was turned and I was talking to someone else. She called out after me, “Watch it, kid.”</p><p>I froze in my tracks. I was too scared to turn around because hearing her use the term “kid” had me convinced I was about to come face to face with the girl from the closet. When I finally gained the courage to turn around, I was floored by how hot she was. I always hoped if I ever found out who Cinderella was that I’d be attracted to her. But Val was way hotter than how I’d been fantasizing.</p><p>I walked back up to her and made her repeat what she said. She looked shocked, but she repeated it anyway. When the words fell from her mouth again, I immediately leaned forward and kissed her. As soon as I kissed her I knew she wasn’t Cinderella. Her mouth was different. Not bad different, just different. When I pulled back after realizing it wasn’t her, I was a little annoyed with myself for not just letting it go. I was never going to find out who the girl was, so there was no point in dwelling on it. Plus, Val really was hot. I forced myself to ask her out that day and thus began “the relationship.”</p><p>“You just passed my school,” Chunk says.</p><p>I slam on the brakes when I realize she’s right. I kick the car into reverse and back up, then pull over to let her out. She looks out the passenger window and sighs.</p><p>“Daniel, we’re so early there isn’t even anyone else here yet.”</p><p>I lean forward and look out her window, scanning the school. “Not true,” I say, pointing to someone pulling into a parking spot. “There’s someone.”</p><p>She shakes her head. “That’s the maintenance guy. I beat the freaking maintenance guy to school.” She opens her door and steps out, then turns and leans into the car before shutting her door. “Do I need to plan for you to be here to pick me up an hour early, too? Is your brain stuck in Eastern Time today?”</p><p>I ignore her comment and she shuts the door, then I hit the gas and drive toward the school.</p><p>I don’t know what kind of car she drives, so I pull into my usual spot and wait. There are a few other cars here, including Sky and Holder’s, but I know they’re at the track running like they do every morning.</p><p>I can’t believe I don’t know what kind of car she drives. I also still don’t know her phone number. Or her birthday. Or her favorite color or what she wants to be when she’s older or why the hell she chose Italy for her foreign exchange or what her parents’ names are or what kind of food she eats.</p><p>My palms begin to sweat, so I wipe them on my jeans, then grip my steering wheel. What if she’s really annoying around other people? What if she’s a junkie? What if . . .</p><p>“Hey.”</p><p>Her voice breaks me out of my near–panic attack. It also calms me the hell down because as soon as I see her sliding into the front seat of my car, my unjustified fears are replaced by pure relief.</p><p>“Hey.”</p><p>She shuts her door and pulls her leg up, turning to face me in the car. She smells so good. She doesn’t smell like perfume at all . . . she just smells good. Kind of fruity.</p><p>“Have you had your panic attack yet?” she asks.</p><p>Confusion clouds my face. I don’t have time to answer her before she begins talking again.</p><p>“I had one this morning,” she says, looking at everything else around us, unable to make eye contact with me. “I just keep thinking we’re idiots. Like maybe this connection we think we have is all in our heads and we didn’t really have as much fun as we thought we did last night. I don’t even know you, Daniel. I don’t know your birthday, your middle name, Chunk’s real name, if you have any pets, what your major will be in college. I know it’s not like we made this huge commitment or got married or had sex, but you have to understand that I have never thought the idea of having a boyfriend was even remotely appealing and maybe I still don’t think it’s all that appealing, but . . .”</p><p>She finally looks at me and makes eye contact. “But you’re so funny and this entire past year has been the worst year of my life and for some reason when I’m with you it feels good. Even though I hardly know you, the parts of you I do know I really, really like.” She leans her head into the headrest and sighs. “And you’re cute. Really cute. I like staring at you.”</p><p>I turn in my seat and mirror her position by resting my head against my own headrest. “Are you finished?”</p><p>She nods.</p><p>“I had my panic attack right before you got in the car just now. But when you opened your door and I heard your voice, it went away. I think I’m good now.”</p><p>She smiles. “That’s good.”</p><p>I smile back at her and we both just stare at each other for several seconds. I want to kiss her but I also kind of like just staring at her. I would hold her hand, but she’s running her fingers up and down the seam of the passenger seat and I like watching her do that.</p><p>“I should go inside and register for classes now,” she says.</p><p>“Make sure you get second lunch.”</p><p>She nods. “I can’t wait to pretend I hate you today.”</p><p>“I can’t wait to pretend I hate you more.”</p><p>I can tell she’s about to turn, so I lean forward and slip my hand behind her neck, then pull her to me. I kiss her good morning, hello and good-bye all at once. When I pull back, I glance over her shoulder and see Sky and Holder making their way off the track and toward the parking lot.</p><p>“Shit!” I push her head down between us. “They’re coming this way.”</p><p>“Crap,” she whispers.</p><p>She begins humming the theme to Mission Impossible and I start laughing. I start to crouch down with her, but if they reach my car they’ll see us whether our heads are down or not.</p><p>“I’ll get out of the car so they don’t come over here.”</p><p>“Good idea,” she says, her voice muffled by her arms. “I think you just gave me whiplash.”</p><p>I lean over and kiss the back of her head. “Sorry. I’ll see you later. Lock my doors when you get out.”</p><p>I open the car door just as Holder begins to head in my direction. I start walking their way to intercept them. “Good run?” I ask when I reach them.</p><p>They both nod, out of breath. “I need my change of clothes,” Sky says to Holder, pointing to her car. “Want me to grab yours?” Holder nods and she heads in that direction. Holder’s eyes move from hers over to mine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why are you here so early?” he asks. He doesn’t ask it like he’s accusing me of anything. He’s probably just making small talk but I already feel defensive.</p><p>“Chunk had to be at school early,” I say.</p><p>He nods and grabs the hem of his shirt, then wipes sweat off his forehead. “You still coming tonight?”</p><p>I think about his question. I think really hard, but I’m drawing a blank about what could be going on tonight that I would need to go to.</p> <p>“Daniel, do you even know what the hell I’m talking about?”</p><p>I shake my head. “No idea,” I admit.</p><p>“Dinner at Sky’s house. Karen invited you and Val? They’re having a big welcome-back thing for Sky’s best friend.”</p><p>That gets my attention. “Yeah, of course I’ll be there. Not bringing Val, though. We broke up, remember?”</p><p>“Yeah, but dinner is still ten hours away. You might love her again by then.”</p> <p>Sky walks up and hands Holder his bag. “Daniel, have you seen Six?”</p><p>“No,” I immediately blurt out.</p><p>Sky glances toward the school, not having noticed the defensiveness in my immediate response. “She must be registering for classes inside.” She turns to Holder. “I’m gonna go find her.” She reaches up and kisses him on the cheek, but Holder’s eyes remain on mine.</p><p>They’re narrowed.</p><p>This isn’t good.</p><p>Sky walks away and I begin to walk right behind her, toward the school. Holder’s hand lands on my shoulder when I pass him, so I pause. I turn around, but it takes me a few seconds to look him in the eyes. When I do, he doesn’t look happy.</p> <p>“Daniel?”</p><p>I raise an eyebrow to match his expression. “Holder?”</p><p>“What are you up to?”</p><p>“I do not know what you are talking about,” I reply innocently.</p><p>“You do know what I am talking about because when you are lying, you do not use contractions when you speak.”</p><p>I ponder his observation for a few seconds. Is that true?</p><p>Shit. It’s true.</p><p>I breathe out a heavy breath and do my best to look like I’m giving him a confession. “Fine,” I say, kicking at the dirt beneath my feet. “I had sex with Val just now. In my car. I didn’t want you to know because you and Sky seemed excited that we broke up.”</p> <p>Tension releases from Holder’s shoulders and he shakes his head. “Dude, I could care less who you date. You know that.” He begins walking toward the school, so I follow suit. “Unless it’s Six,” he adds. “You aren’t allowed to date Six.”</p><p>I keep walking forward, even though that comment makes me want to freeze. “I have no desire to date Six,” I say. “She’s not really that cute, anyway.”</p><p>He stops in his tracks and spins around to face me. He holds up a finger like he’s about to lecture me. “You’re not allowed to talk shit about her, either.”</p><p>Christ. Hiding our relationship from him may be more exhausting than it is fun. “No loving her, no hating her, no screwing her, no dating her. Got it. Anything else you want to add?”</p><p>He thinks for a second, then lowers his arm. “Nope. That covers it. See you at lunch.” He turns and walks inside. I glance back to the parking lot in time to see Six sneaking out of my car. She gives me a quick wave. I wave back, then turn and head inside.</p><p>I walk my tray toward the table and internally rejoice when I see the only available spot is right next to Six. She glances at me as I walk up and her eyes smile, but only briefly. I set my tray down across from Holder and find my way into the current conversation. Everyone is discussing the dinner at Sky’s house tonight, but I’ve had dinner there before. Karen doesn’t know what real food is. She’s vegan, so I normally turn down meals at their house. Not tonight, though.</p><p>“Will there be meat?” I ask.</p><p>Sky nods. “Yeah. Jack’s actually cooking, so the food should be good. I also baked a chocolate cake.”</p><p>I reach across the table for the salt, even though I don’t need it. It gives me an excuse to lean in ridiculously close to Six.</p><p>“So, Six. How do you like your classes?” I ask casually.</p><p>She shrugs. “They’re okay.”</p><p>“Let me see your schedule.”</p><p>She narrows her eyes like I’m doing something wrong. I give her a look to let her know she has nothing to worry about. Even if I wasn’t into her, I’m not an asshole. I’d still be making conversation with her.</p><p>“It sucks we don’t have any classes together,” Sky says. “Who do you have for History?”</p><p>Six pulls her schedule out of her pocket and hands it to me. I open it and make a quick scan of the classes, but none are the same as mine. “Carson for History,” I say, replying to Sky’s question. I hand Six back her schedule and give her a look to let her know we don’t have any classes together. She looks bummed, but says nothing.</p><p>“Can you speak Italian very well?” Breckin asks Six.</p><p>“Not well at all. I speak better Spanish than I do Italian. I chose Italy because I had enough funding and I’d rather have spent half a year there than in Mexico.”</p><p>“Good choice,” Breckin says. “The men are hotter in Italy.”</p><p>Six nods. “Yes they are,” she says appreciatively.</p><p>I immediately lose my appetite and drop my fork onto my plate. It makes a loud clanking noise, so naturally everyone turns to look at me. It’s quiet and awkward and everyone is still staring, so I say the first thing on my mind. “Italian men are too hairy.”</p><p>Sky and Breckin laugh, but Six purses her lips together and looks back down at her plate.</p><p>God, I suck at this.</p><p>Luckily, Val walks up and takes everyone’s attention off me.</p><p>Wait. Did I just say luckily? Because Val walking up is not a good thing.</p><p>“Can I talk to you?” she says, glaring down at me.</p><p>“Do I have a choice?”</p><p>“Hallway,” she says, spinning on her heels. She heads toward the exit to the cafeteria.</p><p>“Do us all a favor and go see what Val wants,” Sky says. “If you don’t meet her out there she’ll come back to the table.”</p><p>“Please,” Breckin mutters.</p><p>I’m watching all their reactions and I don’t know if they’ve always reacted this way when it comes to Val or if I’m only recognizing it for the first time because I finally have clarity.</p><p>“Why is everyone referring to Tessa Maynard as Val?” Six asks, confused.</p><p>Breckin points over his shoulder in the direction Val walked off in. “Tessa is Val. Val is Tessa. Daniel can’t seem to call anyone by their actual name, if you haven’t noticed.”</p><p>I watch as Six inhales a slow breath, then looks directly at me. She looks really disgusted. “Your girlfriend is Tessa Maynard? You have sex with Tessa Maynard?”</p><p>“Ex-girlfriend and had sex,” I clarify. “And yes. Probably coincided with the same time you were falling in love with a hairy Italian.”</p><p>Six’s eyes narrow, then she quickly looks away. I instantly feel bad for what I said, but I was only kidding. Sort of. We’re supposed to be mean to each other. I can’t tell if I really hurt her feelings or if she’s just a really good actress.</p><p>I sigh, then stand up and head toward the cafeteria doors in a hurry so I can get back to the table and somehow make sure Six really isn’t pissed at me.</p><p>I make it out to the hallway and Val is standing right outside the cafeteria doors. “I’ll take you back under one condition,” she says.</p><p>I’m curious what the condition is, but it doesn’t really matter at this point.</p><p>“Not interested.”</p><p>Her mouth literally drops open. It’s not even that cute a mouth now that I’m looking at it. I don’t know how I fell for it all those other times.</p><p>“I’m serious, Daniel,” she says firmly. “If you screw up one more time, I’m done.”</p><p>I let my head fall backward until I’m looking up at the ceiling. “Jesus, Tessa,” I say. She’s not really worthy of my nicknames anymore. I look her in the eyes again. “I don’t want you to take me back. I don’t want to date you. I don’t even want to make out with you. You’re mean.”</p><p>She scoffs, but stands frozen. “Are you serious?” she says, dumbfounded.</p><p>“Serious. Positive. Convinced. Enlightened. Take your pick.”</p><p>She throws her hands up in the air and spins around, then walks back into the cafeteria. I walk to the doors and open them. Six is staring at me from our table, so I make a quick glance around at the rest of the group. No one is paying attention, so I motion for her to come out into the hallway. She takes a quick drink of her water, then stands, making up an excuse to the rest of the table. I step out of view while she makes her way to the exit. When the doors open I immediately grab her by the wrist and pull her until we reach the lockers. I push her against them and crash my mouth to hers. Her hands immediately fly up to my hair and we rush our kisses like we might get caught.</p><p>And we really might.</p><p>After a good solid minute, she pushes lightly against my chest, so I pull away from her.</p><p>“Are you mad?” I ask her, almost blurting out the question between heavy breaths.</p><p>“No,” she says, shaking her head. “Why would I be mad?”</p><p>“Because Val is Tessa and you obviously don’t like Tessa very much and because I had a jealous moment and called Italian men hairy.”</p><p>She laughs. “We’re acting, Daniel. I was actually a little impressed. And kind of turned on when you got jealous. But highly unimpressed with the fact that Val is Tessa. I can’t believe you had sex with Tessa Maynard.”</p><p>“I can’t believe you had sex with pretty much everyone else,” I reply teasingly.</p><p>She grins. “You’re a jerk.”</p><p>“You’re a slut.”</p><p>“Will you be at my dinner tonight?” she asks.</p><p>“That’s a really dumb question.”</p><p>A smile spreads slowly across her face and it’s so damn sexy I have to kiss her again.</p><p>“I should get back,” she whispers when I pull away.</p><p>“Yes, you should. So should I.”</p><p>“You first. I’m supposed to be in the administration office clearing up an issue with my schedule.”</p><p>“Okay,” I say. “I’ll go first, but I’ll miss you until you get back to the table.”</p><p>“Don’t make me puke,” she says.</p><p>“I bet you’re adorable when you puke. I bet your actual puke is even adorable. It’s probably bubble-gum pink.”</p><p>“You’re seriously disgusting.” She laughs and reaches up to kiss me again. She pushes against my chest, then slips out from between me and the locker. She puts both of her hands on my back and pushes me toward the cafeteria doors. “Act natural.”</p><p>I turn and wink at her, then walk back through the doors. I casually make my way back to the table and take a seat.</p><p>“Where’s Six?” Breckin asks.</p><p>I shrug. “How should I know? I was busy making out with Val in the hallway.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sky shakes her head and lays her fork down. “I just lost my appetite, Daniel. Thanks.”</p><p>“You’ll have your appetite back by dinner tonight,” I say.</p><p>Sky shakes her head. “Not with you and Val there. You’ll probably be sucking face next to my food. If you drool on my chocolate cake you aren’t getting any.”</p><p>“Sorry, Cheese Tits,” I say. “But Val won’t be at your dinner tonight. I’ll be there, though.”</p><p>“I bet you will,” Breckin says under his breath.</p><p>I glance over at him and he looks at me challengingly.</p><p>“What’d you just mumble, Powder Puff?” He absolutely hates it when I call him Powder Puff, but he should know I only give nicknames to the people I like. I think he does know that, though, because he doesn’t really give me too much shit about it.</p><p>“I said I bet you will,” he repeats louder this time. He turns to Sky, who is seated right next to him. “Six, right?”</p><p>Sky nods. “Six or six-thirty.”</p><p>“I’ll be there at six,” Breckin says. He looks back at me and smirks. “I bet you’ll be there at six, too, right, Daniel? You like six? Is six good for you?”</p><p>He’s on to us. Fucker.</p><p>“Six is perfect,” I say, holding his stare. “My absolute favorite time of day.”</p><p>He smiles knowingly, but I’m not worried. I have a feeling he’s going to have just as much fun with this as I am.</p><p>“All cleared up?” Sky asks Six when she returns to the table. Six nods and takes her seat. Her hand brushes across my outer thigh when she adjusts herself. I press my knee against hers and we both pick our forks up at the same time and take a bite of food.</p><p>Having her here just inches from me and not being allowed to touch her is complete torture. I’m beginning to think I’d rather just lean over and kiss her and take Holder’s ass beating than have to pretend I don’t want her.</p><p>Since the moment she disappeared into her house last night I’ve felt more restless than I’ve ever felt before. I’ve been fidgeting all day. I can’t stop tapping my fingers and shaking my leg. It feels like I want to scratch at my skin when she’s not around, like I’m coming down from a high.</p><p>That’s exactly what this feels like. Like she’s a drug I’ve become immediately addicted to but I have none in supply. The only thing that satiates the craving is her laugh. Or her smile or her kiss or the feel of her pressed against me.</p><p>God, it’s so hard not to touch her. So hard.</p><p>She begins laughing loudly at something Sky said and the craving becomes almost intolerable because of the intense need I have to catch that sound with my mouth.</p><p>I drop my fork onto my plate and lower my head into my hands and groan. “Stop laughing,” I say quietly.</p><p>She’s obviously laughing too loud to hear me, so I turn toward her and say it again. “Six. Stop laughing. Please.”</p><p>Her jaw clamps shut and she turns to look at me. “Excuse me?”</p><p>About that same time, Holder kicks the shit out of my knee. I scoot back and immediately pull my leg up and rub the spot he kicked. “What the hell, man?”</p> <p>Holder looks at me like I’m clueless. “What the hell is wrong with you? I told you not to be mean to her.”</p><p>Ha. He thinks I’m being mean? If he only knew how nice I want to be to her right now.</p><p>“You don’t like my laugh?” Six says. I can tell in her voice she knows how much I like her laugh, but she’s enjoying the fact that Holder is clueless to what her laugh does to me.</p><p>“No,” I grumble, scooting back toward the table.</p><p>She laughs again and the sound of it causes me to wince.</p><p>“Are you always this grumpy?” she asks. “Do you want me to go get your girlfriend and bring her back to the table so she can put you in a better mood?”</p><p>“No!” Sky and Breckin yell in unison.</p><p>I look at Six. “You think my girlfriend could put me in a better mood?”</p><p>She grins. “I think your girlfriend is a pathetic idiot for agreeing to date you.”</p><p>I shake my head. “My girlfriend makes incredibly wise decisions. I can’t wait until tonight when I get to show her just how smart she was when she decided to lay claim to me.”</p><p>“I thought you said she wasn’t coming to dinner,” Sky says, disappointed.</p><p>Six’s hand slips under the table and she begins to gently rub at the spot on my knee that Holder just finished kicking.</p><p>“Jesus Christ,” I mutter, leaning forward. I put my elbows on the table and run my hands up and down my face, attempting to appear unaffected by the fact that it feels like Six just crawled her way inside my chest and is wrapping herself around my heart.</p><p>“Is lunch over yet?” I say to no one in particular. “I need to get out of here.”</p><p>Holder looks at his phone. “Five more minutes.” He looks back up at me. “Are you sick, Daniel? You’re not being yourself today. It’s starting to freak me out a little bit.”</p><p>Six’s hand is still on my knee. I casually lower my hand and slide it under the table, then place it over hers. She flips her hand over and I lace our fingers together and squeeze her hand.</p><p>“I know,” I say to Holder. “I’m just having a weird day. Girlfriends. They have that effect on you.”</p><p>He’s still looking at me suspiciously. “You seriously need to make up your mind when it comes to her. It’s past the point that any of us feel sorry for you, because now it’s just irritating.”</p><p>“Doesn’t help that she used to be a slut,” Six says.</p><p>“Six!” Sky says with a laugh. “That was so mean.”</p><p>Six shrugs. “It’s true. Daniel’s girlfriend used to be a big, fat slut. I heard she had sex with six different guys in just over a year.”</p><p>“Don’t talk about my girlfriend that way,” I say. “Who gives a shit what she did in the past? I sure as hell don’t.”</p><p>Six squeezes my hand, then pulls hers away and brings her hand back up to the table. “Sorry,” she says. “That wasn’t nice. If it helps, I heard she’s a good kisser.”</p><p>I grin. “Phenomenal kisser.”</p><p>The bell rings and everyone picks up their trays. I notice Six isn’t in any hurry, so I take my time as well. Sky kisses Holder on the cheek, then walks off with Breckin toward the exit. Holder picks up both their trays and lifts his eyes to mine. “I’ll see you tonight,” he says. “And I hope to hell the real Daniel shows up, because you aren’t making a whole lot of sense today.”</p><p>“I know,” I say, pointing briefly at my head. “She’s got me all screwed up in here, man. All screwed up. I’m losing my mind.”</p><p>Holder shakes his head. “That right there is exactly what I’m talking about. You seem more affected by Val today than you ever have. It’s just weird.” He walks off, still looking confused. I feel sort of bad for lying to him, but it’s his own fault. He shouldn’t try to tell me who I can date, then I wouldn’t have to hide it from him.</p><p>“That was fun,” Six says quietly. She begins to pick up her tray, but I intercept it. I take a step toward her and look her hard in the eyes.</p><p>“Don’t you ever insult my girlfriend again. You hear me?”</p><p>She tightens her lips to hide her smile. “Noted.”</p><p>“I want to walk you to your locker. Wait for me.”</p><p>Her smile becomes harder for her to hide as she nods her head. I take both of our trays and place them on the tray pile, then walk back to the table. I glance around us and don’t really see anyone paying attention, so I quickly lean in and kiss her briefly on the lips, then pull away.</p><p>“Daniel Wesley, you’re gonna get caught,” she says with a grin. She turns and begins walking toward the exit, so I discreetly place a hand on her lower back and walk next to her.</p><p>“God, I hope so,” I say. “If I have to sit through another lunch like that, I’ll lose my shit and you’ll end up on your back on top of the table.”</p><p>She laughs. “What a way with words you have.”</p><p>We exit the cafeteria and I walk her to her locker. It’s on the opposite hall from mine, which couldn’t be more inconvenient. We don’t have a single class together and I won’t even see her in the hallway while we’re at school. I know I haven’t even been dating her for an entire day, but I already miss her.</p><p>“Can I come over before dinner?” I ask her.</p><p>She shakes her head. “No, I’ll be helping Karen and Sky prep. I’m going over there right after school.”</p><p>“What about after dinner?”</p><p>She shakes her head again while she switches her books. “Sky crawls through my window every night. You can’t be in my room.”</p><p>“I thought your window was out of commission.”</p><p>“Only to people with penises.”</p><p>I laugh. “What if I told you I didn’t have a penis?”</p><p>She glances at me. “I would probably rejoice. My experiences with people who have penises never end well.”</p><p>I shake my head. “That’s not something my penis wants to hear you say. He has a very sensitive ego.”</p><p>She smiles and shuts her locker, then leans against it. “Well, maybe you should go home after school and stroke his ego a little bit until he feels better.”</p><p>I cock an eyebrow. “You just made a masturbation joke.”</p><p>She nods. “So I did.”</p><p>“I have the coolest girlfriend in the world.”</p><p>She nods again. “So you do.”</p><p>“I’ll see you at dinner.”</p><p>“So you will,” she says.</p><p>“Can we sneak off and make out while everyone’s eating?”</p><p>She squints her eyes as if she’s actually contemplating it. “Don’t know. We’ll play it by ear.”</p><p>I nod and lean my shoulder against the locker next to hers. We’re just a few inches apart and we’re staring at each other again. I love how she looks at me like she actually enjoys staring at me.</p><p>“Give me your phone number,” I say.</p><p>“As long as you aren’t planning to text me pics of your ego stroking after school.”</p><p>I laugh and clutch at my heart. “Dammit, Six. I love every single word that comes out of your mouth.”</p><p>“Cock,” she says dryly.</p><p>She’s evil.</p><p>“Except that word,” I say. “I don’t love cock.”</p><p>She laughs and opens her locker again. She takes out a pen, then turns and grabs my hand. She writes her phone number down, then puts the pen back in her locker. “I’ll see you tonight, Daniel.” She begins backing away. All I can do is nod, because I’m pretty sure her voice just hardcore made out with my ears. She turns and disappears down the hallway just as something appears in my line of sight.</p><p>I look to the eyes that are now glaring at me.</p><p>“What do you want, Powder Puff?” I ask him, pushing off the locker.</p><p>“You like her?”</p><p>“Who?” I ask, playing dumb. I don’t know why I’m trying to play dumb. We both know who he’s referring to. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I think it’s adorable,” he says. “She likes you, too. I can tell.”</p><p>“Really?”</p><p>He laughs. “You’re too easy. And yes, I don’t know how, but I can tell she likes you. Y’all are cute. Why are you hiding it? Or better yet, who are you hiding it from?”</p><p>“Holder. He says I can’t date her.” I begin walking toward class and Breckin falls into step with me.</p> <p>“Why not? Because you’re an asshole?”</p><p>I stop and look at him. “I’m an asshole?”</p><p>Breckin nods. “Yeah. I thought you knew that.”</p><p>I laugh, then start walking again. “He thinks it’ll screw everything up since we’re all best friends.”</p><p>“He’s right. It will.”</p> <p>I stop walking again. “Who’s to say things won’t work out with me and Six?”</p><p>“Didn’t you just meet her? Like two days ago?”</p><p>“Doesn’t matter,” I say defensively. “She’s different. I have a good feeling about her.”</p><p>Breckin studies me for a moment, then he smiles. “This should be fun. I’ll see you tonight.” He turns and walks in the opposite direction, but he stops and faces me again. “Call me Powder Puff again and your secret is out.”</p><p>“Okay, Powder Puff.”</p><p>He laughs and points at me. “See? Such an asshole.”</p> <p>He spins and heads toward his class. I pull my phone out of my pocket and open up Val’s contact information. I hit delete, then add Six’s number into my phone. I’ll wait until I make it to my classroom before I text her.</p><p>Don’t want to seem desperate.</p><p>Chapter Four</p><p>Me: Pretend you’re going to the bathroom or something.</p><p>I place my phone back down on the table and begin eating again. I’ve been here almost an hour and Six and I have barely had a chance to talk. I don’t know if I’ll even need Breckin to out us, because I’m about to lose my patience and do it myself.</p><p>I know everyone’s curious about her trip to Italy, but she seems uncomfortable talking about it. Her answers are short and clipped and I hate that I’m the only one who seems to notice how much she doesn’t want to bring up Italy. I also like that I’m the only one who notices, because it proves that whatever connection I feel with her is more than likely genuine. I feel like I know her better than anyone else here. Maybe even better than Sky knows her.</p><p>Although it’s absurd to feel that way, since I still don’t even know her birthday.</p><p>Six: There’s only one bathroom in the hallway. Even if I were to go there it would be obvious if you got up and followed me.</p> <p>I read her text and groan out loud.</p><p>“Everything okay?” Jack asks. He’s seated next to me at the table, which is fine any other time but I really wanted Six to be in his chair. I nod, then put my phone facedown on the table.</p><p>“Irritating girlfriend drama,” I say.</p><p>He laughs and turns back to Holder, continuing with their conversation. Six is involved in a discussion with Sky and Karen. Breckin ended up not being able to come, which was probably a good thing. Not sure I could have handled the fact that he knows.</p><p>Right now it’s just me and my impatience having a silent war at the dinner table.</p><p>“That reminds me,” Six says loudly. “I bought you all presents. I forgot.” She scoots back from the table. “They’re at my house. I’ll be right back.” She stands and takes two steps before turning back toward us. “Daniel? They’re kind of heavy. Mind giving me a hand?”</p><p>Don’t act too excited, Daniel.</p><p>I sigh heavily. “I guess,” I say as I scoot back from the table. I look at Holder and roll my eyes, then follow Six outside. Neither of us says a word while we make our way to the side of the house. She reaches her window, then turns around.</p><p>“I lied,” she says. Her eyes are worried, which causes me to worry.</p><p>“About what?”</p><p>She shakes her head. “I didn’t buy anyone presents. I just can’t take another second of all the questions, and then seeing you across the table and knowing how much I just wish it could be the two of us is making this whole dinner really irritating. But now I don’t have presents. How do I go back in there without presents?”</p><p>I try not to laugh, but I love that she’s been just as irritated as I’ve been. I was starting to worry I might have a few issues.</p><p>“We could just stay out here and never go back inside.”</p><p>“We could,” she says in agreement. “But they’d eventually come look for us. Not to mention it would be rude, since Jack and Karen went through all this trouble to cook for me and oh, my God, what if it’s true, Daniel?”</p><p>I don’t know if it’s me or if she’s just really difficult to keep up with, but I have no idea what she’s talking about. “What if what’s true?”</p><p>She exhales a quick breath. “What if our feelings are just reverse psychology? What if Holder had told you to date me Saturday night? You might not have been interested in me after that. What if the only reason we like each other so much is that it’s forbidden? What if the second they all find out the truth, we can’t stand each other?”</p><p>I hate that the worry in her voice sounds genuine, because that means she actually believes the shit she’s saying right now.</p><p>“You think there’s a chance I only like you because I’m not supposed to like you?”</p><p>She nods.</p><p>I grab her hand and yank her back toward the front of the house.</p><p>“Daniel, I don’t have presents!”</p><p>I ignore her and walk her up the front steps, open the door, and march her straight into the kitchen.</p><p>“Hey!” I yell. Everyone turns around and looks at us. I glance at Six and her eyes are wide. I inhale a deep breath, then turn back to the table. Specifically to Holder.</p><p>“She fist bumped me,” I say, pointing at Six. “It’s not my fault. She hates purses and she fist bumped me, then she made me push her on the damn merry-go-round. After that, she demanded to see where I had sex in the park, then she forced me to sneak into my own bedroom. She’s weird and half the time I can’t keep up with her, but she thinks I’m funny as hell. And Chunk asked me this morning if I wanted to love her someday, and I realized I’ve never hoped I could love someone more than I want to love her. So every single one of you who has an issue with us dating is going to have to get over it because . . .” I pause and turn toward Six. “Because you fist bumped me and I could care less who knows we’re together. I’m not going anywhere and I don’t want to go anywhere so stop thinking I’m into you because I’m not supposed to be into you.” I lift my hands and tilt her face toward mine. “I’m into you because you’re awesome. And because you let me accidentally touch your boob.”</p><p>She’s smiling wider than I’ve ever seen her smile. “Daniel Wesley, where’d you learn those smooth moves?”</p><p>I laugh. “Not moves, Six. Charisma.”</p><p>She throws her arms around my neck and kisses me. I wait for the moment Holder yanks me away from her, but that moment doesn’t come. We kiss for a solid thirty seconds before people begin clearing their throats. When Six pulls away from me, she’s still smiling.</p><p>“Does it feel different now that they know?” I ask her. “Because it actually feels better to me.”</p><p>She shoves my chest with an irritated laugh. “Stop! Stop saying things that make me grin like an idiot. My face has been hurting since the second I met you.”</p><p>I pull her to me and hug her, then suddenly become aware that we’re still standing in Sky’s kitchen and everyone is still staring at us. I hesitantly turn and look at Holder to gauge his level of anger. He’s never actually hit me before, but I’ve seen what he can do and I sure as hell don’t want to experience it.</p><p>When my eyes meet his, he’s . . . smiling. He’s actually smiling.</p><p>Sky has a napkin to her eyes and she’s wiping tears away.</p><p>Karen and Jack are both smiling.</p><p>It’s weird.</p><p>Too weird.</p><p>“Do you guys talk to my parents?” I ask cautiously. “Did they teach you their dirty reverse psychology tricks?”</p><p>Karen is the first to speak. “Sit down, you two. Your food is getting cold.”</p><p>I kiss Six on the forehead, then take my seat back at the table. I keep glancing at Holder, but he doesn’t look upset at all. He actually looks a little impressed.</p><p>“Where the hell is my present?” Jack asks Six.</p><p>She clears her throat. “I decided to wait until Christmas.” She picks up her glass and brings it to her lips, then glances at me. I smile at her.</p><p>Everyone else resumes whatever conversations were going on before my interruption. It’s like no one is even that shocked. They act like it’s completely normal. Like it’s a natural thing . . . me and Six.</p><p>And I totally get it, because it is. Whatever we have is good and even though I still don’t know her birthday . . . I know this is right. And based on the look on her face right now, so does she.</p><p>“I really like this one,” I say, looking at the picture in my hands. I’m leaning against the wall, sitting on the floor in Sky’s bedroom. Six is passing around pictures she took in Italy to Sky, Holder and me.</p><p>“Which pic are you looking at?” she says. She’s lying next to me on the floor. I look down at her and flip the photo over so she can see it. She shakes her head with a quick roll of her eyes. “You only like that one because my cleavage looks great.”</p><p>I immediately turn the photo back around. She’s right. It does look great. But that’s not at all why I liked it at first. She looks happy in this one. Peaceful.</p><p>“I took that picture the day I got to Italy,” she says. “You can keep it.”</p><p>“Thank you. I wasn’t planning on giving it back to you, anyway.”</p><p>“Consider it an anniversary present,” she says.</p><p>I immediately look down at the time on my phone. “Oh. Wow. It really is our anniversary.” I readjust myself until I’m leaning over her. “I almost forgot. I’m the worst boyfriend ever. I can’t believe you haven’t dumped me yet.”</p><p>She grins. “That’s okay. You can remember the next one.” She slips her hand to the back of my neck and pulls me forward until our lips meet.</p><p>“Anniversary?” Sky says, confused. “Exactly how long have the two of you been dating?”</p><p>I pull away from Six and sit back up against the wall. “Precisely twenty-four hours.”</p><p>An awkward silence follows, then of course Holder fills it. “Am I the only one who has a bad feeling about this?”</p><p>“I think it’s great,” Sky says. “I’ve never seen Six so . . . nice? Happy? Spoken for? It’s a good look for her.”</p><p>Six sits up and wraps her arms around my neck, then pulls me to the floor with her. “That’s because I’ve never met anyone as vulgar and inappropriate and horrible at first kisses as Daniel.” She pulls my mouth to hers and kisses me while she laughs at herself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This is a first. A kiss and a laugh at the same time? I think I might be in heaven.</p><p>“Six has a bedroom too, you know,” Holder says.</p><p>Six stops laughing. And she stops kissing me.</p><p>Holder is about to be put on my shit list.</p> <p>“Six doesn’t allow penises in her bedroom,” I reply to him while still staring down at her.</p><p>Six moves her mouth to my ear. “As long as you don’t expect me to stroke his ego tonight, I kind of want to kiss you on my bed.”</p><p>I didn’t know people could move as fast as I’m moving right now. This has to be some sort of record, because my hands are under her back and knees and I’m scooping her up in my arms before her sentence even completely registers. She throws her arms around my neck and squeals as I head straight for Sky’s window. I put her down gently, but then practically shove her outside. I begin to follow right behind her without even telling Sky or Holder goodbye.</p><p>“They are so strange together,” I hear Sky say right before I’m out the window.</p><p>“Yeah,” Holder says in agreement. “But also oddly . . . right.”</p> <p>I pause.</p><p>Did Holder just compliment my relationship with Six? I don’t know why I always want his approval so much, but hearing him say that fills me with this weird sense of pride. I turn around and take a step back to the window and lean inside. “I heard that.”</p><p>He looks at the window and sees me leaning inside, so he rolls his eyes. “Go away,” he says with a laugh.</p><p>“No. We’re having a moment.”</p><p>He cocks an eyebrow, but doesn’t respond.</p><p>“You’re my best friend, Holder.”</p> <p>Sky shakes her head and laughs, but Holder is still looking at me like I’ve lost my mind.</p><p>“For real,” I say. “You’re my best friend and I love you. I’m not ashamed to admit that I love a guy. I love you, Holder. Daniel Wesley loves Dean Holder. Always and forever.”</p><p>“Daniel, go make out with your girlfriend,” he says, waving me off.</p><p>I shake my head. “Not until you tell me you love me, too.”</p><p>His head falls back against Sky’s headboard. “I fucking love you, now GO AWAY!”</p><p>I grin. “I love you more.”</p><p>He picks up a pillow and tosses it at the window. “Get the hell out of here, dipshit. ”</p><p>I laugh and back away from the window.</p> <p>“You two are so strange together,” Sky says to him.</p><p>I pull the window shut, then turn around to face Six. She’s already in her bedroom, leaning out her window with her chin in her hands. She’s grinning.</p><p>“Daniel and Holder, sittin’ in a tree,” she says in a singsong voice.</p><p>I walk toward her and improvise the next line of the song. “But then Daniel climbs down,” I finish the rest of the sentence in a hurry, “and goes to Six’s window and climbs inside her bedroom and throws her on the bed and kisses her until he can’t take any more and has to go home and stroke his ego.”</p><p>She’s laughing and backing into her bedroom to make room for me to climb inside.</p><p>Once I’m inside, I look around and observe her room. I finally understand what she meant when she said my bedroom was more than just a room. This is like a secret glimpse into who Six really is. I feel like I could study this room and everything in it and find out everything I ever need to know about her.</p><p>Unfortunately, she’s standing at the foot of her bed and she looks a little bit nervous and way more beautiful than I deserve, and I can’t take my eyes off of her long enough to even study her bedroom.</p><p>I can’t help but smile at her. I can already tell this is about to be the best anniversary I’ve ever had. The lights are off, so the mood is already perfect for making out. It’s quiet, though. So quiet I can hear her breaths increase with each deliberately slow step I take toward her.</p><p>Shit. Maybe those are my breaths. I can’t tell, because every inch closer I get requires an extra intake of air.</p><p>When I reach her, she’s looking up at me with an odd mixture of peaceful anticipation. I want to push her onto the bed right now and climb on top of her and kiss the hell out of her.</p><p>I could do that, but why do the one thing she’s expecting me to do?</p><p>I lean in slowly. Very slowly . . . until my mouth is so close to her neck she more than likely can’t even tell if I’m touching her skin or not. “I have three questions I need to ask you before we do this,” I say quietly, but very seriously. I pull back just far enough to see her gulp softly.</p><p>“Before we do what?” she asks hesitantly.</p><p>I lift a hand to the back of her head, then pull back from her neck and position my lips close to hers. “Before we do what we both want to do. Before I lean in one more inch. And before you part your lips for me just enough for me to steal a taste. Before I put my hands on your hips and back you up until you have nowhere to go but onto your bed.”</p><p>I can feel her breath teasing my lips and it’s so tempting I have to force myself to lean in to her ear again so I’m not so close to her mouth. “Before I slowly lower myself on top of you and our hands become curious and brave. Before my fingers slip under the hem of your shirt. Before my hand begins to explore its way up your stomach, and I discover I’ve never touched skin as soft as yours.”</p><p>She gasps, then exhales a shaky breath and it’s almost as sexy as the fist bump.</p><p>It may even be sexier.</p><p>“Before I finally get to touch your boob on purpose.”</p><p>She laughs at that one, but her laugh is cut short when I press my thumb to the center of her lips.</p><p>“Before your breaths pick up pace and our bodies are aching because everything we’re feeling is just making us want more and more and more of each other . . . until I’m afraid I’ll beg you not to ask me to slow down. So instead, I regrettably tear my mouth from yours and force myself away from your bed and you lift up unto your elbows and look at me, disappointed, because you kind of wished I would have kept going, but at the same time you’re relieved I didn’t, because you know you would have given in. So instead of giving in, we just stare. We watch each other silently as my heart rate begins to slow down and your breaths are easier to catch and the insatiable need is still there, but our minds are clearer now that I’m not pressed against you anymore. I turn around and walk to your window and leave without even saying goodbye, because we both know if either of us speaks . . . it’ll be the collective demise of our willpower and we’ll cave. We’ll cave so hard.”</p><p>I move my hand to her cheek. She whimpers and looks like she’s about to collapse onto the bed, so I wrap my other arm around her lower back and pull her against me.</p><p>“So yeah . . . three questions first.”</p><p>I let go of her and immediately turn around two seconds before I hear her fall onto her bed. I walk straight to the desk chair and take a seat, for two reasons. One, I want her to think I mean business and that everything I just said to her didn’t affect me like it did her. And two, because I want her more than I’ve ever wanted anything and my knees were about to give out on me if I didn’t sit down.</p><p>“Question number one,” I say, watching her from across her room. She’s lying on her back with her eyes closed and I hate that I’m not watching her up close right now. “When’s your birthday?”</p><p>“October . . .”—She clears her throat, obviously still recovering—“thirty-first. Halloween.”</p><p>How could the date of a birthday make me fall even harder for her? I have no idea, but it somehow does.</p><p>“Question number two. What’s your favorite food?”</p><p>“Homemade mashed potatoes.”</p><p>Never would have guessed that one. Glad I asked.</p><p>“Question number three,” I say. “It’s a big one. Are you ready?”</p><p>She nods, but keeps her eyes closed.</p><p>“What’s the one thing in this room that tells the biggest secret about you?”</p><p>As soon as the question leaves my mouth, she’s completely still. Her exaggerated breaths come to a halt. She remains motionless for almost a whole minute before she slowly pushes herself up until she’s seated on the edge of the bed, facing me. “It has to be something inside this room?”</p><p>I nod slowly.</p><p>She lifts her hand and touches a finger to her heart, pointing at it. “This,” she whispers. “My biggest secret is right in here.”</p><p>Her eyes are moist and sad and somehow with that answer, the air instantly changes between us. In a dangerous way. A terrifying way. Because it feels like her air just became my air and I suddenly want to take in fewer breaths in order to ensure she never runs out.</p><p>I stand up and walk to the bed. Her eyes follow me closely until I’m directly in front of her. “Stand up.”</p><p>She stands slowly.</p><p>I weave both hands through the locks of her hair until I’m holding the back of her head. I stare at her until my heart can’t take anymore, then I press my lips to hers. I’ve lost count of how many times I’ve kissed her over the past day. Every time I kiss her, the feeling I get is like nothing I’ve ever experienced. The closest I’ve ever come to feeling this way is the day I was pretending to be in love with the girl in the closet. But even that day, the day I thought would surpass every day after it, doesn’t come close to this.</p><p>Her mouth is warm and inviting and everything it always is when I kiss her, but it’s also so much more. The fact that I have this reaction to her after one day scares the living shit out of me.</p><p>One day.</p><p>I’ve been doing this with her for one day and I have no idea what’s happening. I don’t know if it’s a full moon or if I have a tumor wrapped around my heart or if she really is a witch. Whatever it is still doesn’t explain how this kind of thing can exist between two people this ridiculously fast . . . and actually last.</p><p>I feel like deep down my heart knows she’s too good to be true. My mind and my whole body know she’s too good to be true, so I kiss her harder, hoping to convince myself that this is real. It’s not some fairy tale. It’s not an hour of make-believe.</p><p>This is reality, but even in our imperfect reality, people don’t fall for each other like this. They don’t develop feelings like this for someone they barely know.</p><p>The only thing my entire thought process is proving to me right now is how much I need to grab her tight and hang on, because wherever she goes, I want to go, too. And right now, she’s going backward, down onto the bed. I’m easing myself on top of her in the same way I just told her this would happen. And we’re kissing, just like I said we would, only this time it may just be a little more frantic and needy and holy shit.</p><p>Her skin.</p><p>It really is the softest skin I’ve ever touched.</p><p>I move my hand from her waist and inch my fingers underneath the hem of her shirt, then slowly begin to work my way to her stomach.</p><p>She pushes my hand away.</p><p>“Daniel.”</p><p>She immediately lifts up and I immediately lift off her. She’s breathing so heavily I catch myself holding my own breath, scared I’m hogging too much of her air. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She looks both regretful and embarrassed that she suddenly asked me to stop. I lift my hand and stroke her cheek reassuringly.</p><p>My eyes scroll over her features, taking in her nervous demeanor. She’s afraid of what might happen between us. I can see on her face and in the way she’s looking at me that she’s just as scared as I am. Whatever this is between us, neither one of us was searching for it. Neither one of us knew it even existed. Neither one of us is even remotely prepared for it, but I know we both want it. She wants this to work with me as much as I want it to work with her and seeing the look in her eyes right now makes me believe that it will. I’ve never believed in anything like I believe in the possibility of the two of us.</p><p>I can tell by the way she’s looking at me that if I tried to kiss her again, she’d let me. It’s almost as if she’s torn between the girl she used to be and the girl she is now and she’s afraid if I try to kiss her again, she’ll cave.</p><p>And I’m afraid if I don’t get up and walk away, I’ll let her.</p> <p>We don’t even have to speak. She doesn’t even have to ask me to leave, because I know that’s what I need to do. I nod, silently answering the question I don’t want her to have to ask. I begin to ease off her bed and a silent thank you flashes in her eyes. I stand up, back away from her and climb out her window without a word. I walk a few feet until I reach the edge of her house, then I lean against it and slide down to the ground.</p><p>I lean my head back and close my eyes, attempting to figure out where I went right in my life to deserve her.</p><p>“What the hell are you doing?” Holder asks. I look up and he’s halfway out Sky’s window. Once he makes it all the way out, he turns and pulls her window shut.</p><p>“Recovering,” I say. “I just needed a minute.”</p><p>He walks toward me and takes a seat on the ground across from me, then leans against Sky’s house. He pulls his legs up and rests his elbows on his knees.</p> <p>“You’re already leaving?” I ask him. “It’s not even nine o’clock yet.”</p><p>He reaches down to the ground and rips up a few blades of grass, then spins them between his fingers. “Got kicked out for the night. Karen walked in and my hand was up Sky’s shirt. She didn’t like that too much.”</p><p>I laugh.</p><p>“So,” he says, glancing back up at me. “You and Six, huh?”</p><p>Despite my effort not to smile, I do it anyway. I smile pathetically and nod. “I don’t know what it is about her, Holder. I . . . she just . . . yeah.”</p><p>“I know what you mean,” he says quietly, looking back down at the grass between his fingers.</p> <p>Neither one of us says anything else for several moments until he drops the blades of grass and wipes his hands on his jeans, preparing to stand up. “Well . . . I’m glad we had this talk, Daniel, but the fact that we already professed our mutual love for each other tonight is leaving me a little overwhelmed. I’ll see you tomorrow.” He stands up and begins walking toward his car.</p><p>“I love you, Holder!” I yell after him. “Best friends forever!”</p><p>He keeps walking forward, but lifts his hand in the air and flips me off.</p><p>It’s almost as cool as a fist bump.</p><p>Chapter Five</p><p>“You’re wrong,” she says.</p><p>We’re standing in my kitchen. Her back is pressed against the counter and I’m standing in front of her with my arms on either side of her. I catch her lips with mine and shut her up. It doesn’t last long because she pushes my face away.</p><p>“I’m serious,” she whispers. “I don’t think they like me.”</p> <p>I bring a hand up and wrap it around the nape of her neck and look her directly in the eyes. “They like you. I promise.”</p><p>“No we don’t,” my dad says as he makes his way into the kitchen. “We can’t stand her. In fact, we hope you never bring her back.” He refills his cup with ice, then walks back to the living room.</p><p>Six’s eyes follow him as he exits the room, then she looks back up at me, wide-eyed.</p><p>“See?” I say with a smile. “They love you.”</p><p>She points toward the living room. “But he just . . .”</p><p>My father’s voice cuts her off when he walks back into the kitchen. “Kidding, Six,” he says, laughing. “Inside joke. We actually like you a lot. I tried to give Danny-boy Grandma Wesley’s ring earlier but he says it’s still too soon to make you a Wesley.”</p><p>Six laughs at the same time she breathes a sigh of relief. “Yeah, maybe so. It’s only been a month. I think we should wait at least two more weeks before we talk proposals.”</p><p>My dad walks farther into the kitchen and leans against the counter across from us. I feel a little awkward standing so close to Six now, so I move next to her and lean against the bar.</p><p>“Did you come back in here so you could think of things to say that would embarrass me?” I ask. I know that’s why he’s standing here. I can see the glimmer in his eyes.</p><p>He laughs, then takes a drink of his tea. He scrunches his nose up. “Nah,” he says. “I would never do that, Danny-boy. I’m not the type of dad who would tell his son’s girlfriend how he talks about her incessantly. I would also never tell my son’s girlfriend that I’m proud of her for not having sex with him yet.”</p><p>Holy shit. I groan and slap myself in the forehead. I should have known better than to bring her here.</p><p>“You talk to him about the fact that we haven’t had sex?” Six says, completely embarrassed.</p><p>My father shakes his head. “No, he doesn’t have to. I know because every night he comes home he goes straight to his bedroom and takes a thirty-minute shower. I was eighteen once.”</p><p>Six covers her face with her hands. “Oh, my God.” She peeks through her hands at my dad. “I guess I know who Daniel gets his personality from.”</p><p>My father nods. “Tell me about it. His mother is terribly inappropriate.”</p><p>Right on cue, my mother and Chunk walk through the front door with dinner. I glare at my father, then walk toward my mother and grab the pizza boxes out of her hands. She sets her purse down and walks over to Six and gives her a quick hug.</p><p>“I’m sorry I didn’t cook for you. Busy day today,” she says.</p><p>“It’s fine,” Six replies. “Nothing like inappropriate conversation over pizza.”</p><p>I watch as my mother spins around and eyes my father. “Dennis? What have you been up to?”</p><p>He shrugs. “Just telling Danny-boy how I would never embarrass him in front of Six.”</p><p>My mother laughs. “Well, as long as you aren’t embarrassing him, then. I’d hate for Six to find out about his lengthy showers every night.”</p><p>I slap the table. “Mom! Jesus Christ!”</p><p>She laughs and my dad winks at her. “Already covered that one.”</p><p>Six walks to the table, shaking her head. “Your parents actually make you seem like a gentleman.” She takes a seat at the table and I sit in the chair next to her.</p><p>“I’m so sorry,” I whisper to her. She looks at me and smiles.</p><p>“Are you kidding me? I love this.”</p><p>“Why would long showers embarrass you?” Chunk says to me, taking a seat across from Six. “I would think wanting to be clean is a good thing.” She picks up a slice of pizza and begins to take a bite, but then her eyes squeeze shut and she drops the pizza onto her plate. By the look on her face, the meaning behind the long showers has just hit her. “Oh, gross. Gross!” she says, shaking her head.</p><p>Six begins to laugh and I rest my forehead against my hand, convinced this is more than likely the most uncomfortable, embarrassing five minutes of my life. “I hate all of you. Every last one of you.” I quickly look at Six. “Except you, babe. I don’t hate you.”</p><p>She smiles and wipes her mouth with a napkin. “I know exactly what you mean. I hate everybody, too.”</p><p>As soon as the words fall from her mouth, she looks away like she didn’t just punch me in the gut, rip out my intestines, and stomp them into the ground.</p><p>I hate everybody too, Cinderella.</p><p>The words I said that day in the closet are screaming loudly inside my head.</p><p>There’s no way.</p><p>There’s no way I wouldn’t have noticed she was Cinderella.</p><p>I bring my hands to my face and close my eyes, trying hard to remember something about that day. Her voice, her kiss, her smell. The way we seemed to connect almost instantly.</p><p>Her laugh.</p><p>“Are you okay?” Six asks quietly. No one else can tell something major is going on with me right now, but she notices. She notices because we’re in sync. She notices because we have this unspoken connection. We’ve had it since the second I laid eyes on her in Sky’s bedroom.</p><p>We’ve had it since the second she fell on top of me in the maintenance closet.</p><p>“No,” I say, bringing my hands down. “I’m not okay.” I grip the edge of the table, then slowly turn to face her.</p><p>Soft hair.</p><p>Amazing mouth.</p><p>Phenomenal kisser.</p><p>My mouth is dry, so I reach to my cup and down a huge gulp of water. I slam my cup back down on the table, then turn and face her. I’m trying not to smile, but this whole thing is slightly overwhelming. Realizing that the girl from my past that I wished I could know is the same girl from my present that I’m thankful to have is practically one of the best moments of my life. I want to tell Six, I want to tell Chunk, I want to tell my parents. I want to scream it from the rooftops and print it in all the papers.</p><p>Cinderella is Six! Six is Cinderella!</p><p>“Daniel. You’re scaring me,” she says, watching as my face grows paler and my heart pounds faster.</p><p>I look at her. Really look at her this time.</p><p>“You want to know why I haven’t given you a nickname yet?”</p><p>She looks confused that this is what I decide to say in the middle of my silent freak-out. She nods cautiously. I place one hand on the back of her chair and one hand on the table in front of her, then lean in toward her.</p><p>“Because I already gave you one, Cinderella.”</p><p>I pull back slightly and watch her face closely, waiting on the realization she’s about to have. The flashback. The clarity. She’s about to wonder how the hell she failed to realize it, too.</p><p>Her eyes slowly move up my face until they meet mine. “No,” she says, shaking her head.</p><p>I nod slowly. “Yes.”</p><p>She’s still shaking her head. “No,” she says again with more certainty. “Daniel there’s no way it could . . .”</p><p>I don’t let her finish. I grab her face and kiss her harder than I’ve ever kissed her. I don’t give a shit that we’re seated at a dinner table. I don’t care that Chunk is groaning. I don’t care that my mom is clearing her throat. I keep kissing her until she begins to back away from me.</p><p>She’s pushing on my chest, so I pull away from her just in time to see the regret wash over her entire face. I focus on her eyes long enough to see them squeeze shut as she stands to leave the kitchen. I watch her rush away long enough to see her stifle a sob by slapping her hand over her mouth. I remain in my seat until the front door slams shut and I realize she’s gone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I’m immediately out of my seat. I rush out the front door and run straight to her car, which is now backing out of my driveway. I slam my fist against her hood as I rush to catch up to her window. She’s not looking at me. She’s wiping tears away, trying her hardest not to look out the window I’m banging on.</p><p>“Six!” I yell, repeatedly banging on her window with my fist. I see her hand reach down to put the car in drive. I don’t even think. I sprint to the front of the car and slap my hands down on the hood, standing directly in front of it so she can’t take off. I’m watching her do everything she can to avoid looking at me.</p><p>“Roll down your window,” I yell.</p><p>She doesn’t move. She continues to cry as she focuses on everything other than what’s right in front of her.</p> <p>Me.</p><p>I slap the hood of the car again until she finally brings her eyes up to meet mine. Seeing her heartache confuses the hell out of me. I couldn’t have been happier finding out she was Cinderella, yet she seems embarrassed as hell that I realized it.</p><p>“Please,” I say, wincing from the ache that just reached my chest. I hate seeing her upset and I really hate that this is why she’s upset.</p><p>She puts the car in park, then reaches a hand to her door and lowers the driver’s side window. I’m not so sure she still won’t drive away if I move out from in front of her car. I carefully and very slowly begin to make my way toward her window, the whole time keeping an eye on her hand to ensure she doesn’t put the car back into drive.</p><p>When I reach her window, I bend my knees and lower myself until I’m face to face with her. “Do I even need to ask?”</p> <p>She looks up at the roof and leans her head against the headrest. “Daniel,” she whispers through her tears. “You wouldn’t understand.”</p><p>She’s right.</p><p>She’s absolutely right.</p><p>“Are you embarrassed?” I ask her. “Because we had sex?”</p><p>She squeezes her eyes shut, giving away the fact that she thinks I’m judging her. I immediately reach a hand through her window and pull her gaze back to mine. “Don’t you dare be embarrassed by that. Ever. Do you know how much that meant to me? Do you know how many times I’ve thought about you? I was there. I made that choice right along with you, so please don’t think for a second that I would ever judge you for what happened between us.”</p><p>She begins to cry even harder. I want her to get out of the car. I need to hold her because I can’t see her this upset and not do whatever I can to take it away.</p> <p>“Daniel, I’m sorry,” she says through her sobs. “This was a mistake. This was a huge mistake.” Her hand reaches down to the gearshift and I’m already reaching into the car, trying to stop her.</p><p>“No. No, Six,” I plead. She puts the car in drive and reaches to the door, then places her finger on the window button.</p><p>I make one last attempt to lean in and kiss her before the window begins to rise on me. “Six, please,” I say, shocked at the sadness and desperation in my own voice. She continues to raise the window until I’m completely out of it and it’s all the way up. I press my palms to her window and slap the glass, but she drives away.</p><p>There’s nothing left for me to do but watch the back of the car as it disappears down the street.</p><p>What the hell was that?</p><p>I pull my hands through my hair and look up at the sky, confused as to what just happened.</p><p>That wasn’t her.</p><p>I hate that she had the complete opposite reaction from me when she found out who I was.</p> <p>I hate that she’s embarrassed about that day, like she just wants to forget it. Like she wants to forget me.</p><p>I hate it because I’ve done everything I possibly can to commit that day to my memory, like no one or nothing else I’ve ever experienced.</p><p>She can’t do this. She can’t just push me away like this without an explanation.</p><p>Chapter Six</p><p>I couldn’t give my parents an explanation when I went back inside to grab my keys. They were apologetic, thinking they did something wrong. They felt bad about their jokes, but I didn’t even have it in me to reassure them that they weren’t the problem. I couldn’t reassure them, because I don’t even know what the problem is.</p><p>I’ll be damned if I don’t find out tonight, though. Right now.</p><p>I put my car in park and turn off the engine, relieved to see her car parked in her driveway. I get out of my car and shut my door, then head to her front door. Before I make it to her front porch, I detour to the side of the house. I know with the shape she left my house in a few minutes ago, there’s no way she would have walked through her front door. She would have taken the window.</p><p>I reach her bedroom and the window is shut, as well as the curtains. The room is dark, but I know she’s inside. Knocking won’t do me any good, so I don’t even bother. I push the window up, then slide the curtains to the side.</p><p>“Six,” I say firmly. “I’m respecting your window rule, but it’s really hard right now. We need to talk.”</p><p>Nothing. She says nothing. I know she’s in her room, though. I can hear her crying, but barely.</p><p>“I’m going to the park. I want you to meet me there, okay?”</p><p>Several silent moments pass before she responds.</p><p>“Daniel, go home. Please.” Her voice is soft and weak, but the message behind that sad, angelic voice is like a stab to my heart. I back away from the window, then kick the side of the house out of frustration. Or anger. Or sadness or . . . shit. All of it.</p><p>I lean back into her window and grip the frame. “Meet me at the goddamned park, Six!” I say loudly. My voice is angry. I’m angry. She’s pissing me the hell off. “We don’t do this kind of thing. You don’t play these games. You owe me a fucking explanation.”</p><p>I push away from her window and turn to walk back to my car. I make it five feet before my palms are running down my face and I’m wishing I could punch the actual air in front of me. I stop walking and pause for several moments while I search for patience. It’s in here somewhere.</p><p>I walk back to her window and hate that she’s crying much louder now, even though she’s trying to stifle the sounds with her pillow.</p><p>“Listen, babe,” I say quietly. “I’m sorry I said goddamned. And fucking. I shouldn’t cuss when I’m upset, but . . .” I inhale a deep breath. “But dammit, Six. Please. Please just meet me at the park. If you aren’t there in half an hour, I’m done. I had enough of this bullshit with Val and I’m not putting myself through it again.”</p><p>I turn to leave and make it all the way to my car this time before pausing and kicking at the ground. I walk back to her window again. “I didn’t mean it just now when I said I’d be done if you didn’t show up. If you don’t show up to the park, I’ll still want to be with you. I’ll just be sad that you didn’t show up. Because we show up, Six. It’s what we do. It’s me and you, babe.”</p><p>I wait for a reply for a lot longer than I even need to. She never responds, so I go back to my car and climb inside, then head to the park and hope she shows up.</p><p>Twenty-seven minutes pass before her car finally pulls into a parking spot.</p><p>I’m not surprised she showed up. I knew she would. Her reaction was uncharacteristic of her and I know she just needed time to let everything soak in.</p><p>I watch her as she slowly makes her way toward me, never once looking up at me. She keeps her eyes trained to the ground the whole time until she passes me. She sinks into the swing next to me and grabs the chains, then leans her head against her arm. I wait for her to speak first, knowing she more than likely won’t.</p><p>She doesn’t.</p><p>I run my hands up the chain rope until they’re even with my head, then I lean into my arm and mirror her position. We’re both staring quietly into the dark night in front of us.</p><p>“After you left that day,” I say. “I wasn’t sure of what you wanted me to do. I wondered if you thought about me too and if you had changed your mind. If maybe you wanted me to try and find you.”</p><p>I tilt my head and look at her. Her blonde hair is tucked behind her ears and her eyes are closed. Even with her eyes closed I can see the pain in her features.</p><p>“For days I wondered if that’s what you wanted me to do. I waited and waited for you to come back, but you never did. I know we both said we would be better off not knowing who the other was, but honestly, you were all I could think about. I wanted you to come back so fucking bad that I spent every single fifth period in that damn closet for the rest of the semester. The last day of school was the absolute worst. When the bell rang and I had to walk out of that closet for the last time, it absolutely sucked. So much. I felt like an idiot for being so consumed by the thought of you. When I met Val, I forced myself to go forward with her because it helped to not think about that damn closet so much.”</p><p>I twist the swing until I’m facing her. “I like you, Six. A lot. And I know this sounds all kinds of jacked up and crazy, but pretending to make love to you that day was the closest I’ve ever been to actually loving someone until now.”</p><p>I turn my swing to face forward again, then I stand up. I walk to her and kneel down on both knees in front of her, then wrap my arms around her waist. I look up at her and see the pain flash across her face when I touch her. “Six. Don’t let what happened between us become a negative thing. Please. Because that day was one of the best days of my life. Actually, it was the best day of my life.”</p><p>She lifts her head away from her arm and opens her eyes, then looks directly at me. Tears are streaming down her face. It breaks my damn heart.</p><p>“Daniel,” she whispers through her tears. She squeezes her eyes shut and turns her head like she can’t even look at me. “I got pregnant.”</p><p>Chapter Seven</p><p>Sometimes when I’m almost asleep, I’ll hear something that pulls me right back into a state of high alert. I’ll listen closely, wondering if I actually heard a sound or if it’s just my imagination playing tricks on me. I’ll hold my breath and be really still, and I’ll just listen quietly.</p><p>I’m quiet.</p><p>I’m still.</p><p>I’m holding my breath.</p><p>I’m listening.</p><p>I’m concentrating really hard while my head rests on her thighs. I don’t know when I lowered it here, but my hands are still gripping her waist. I’m trying to figure out if those words are going to hit me and completely knock my heart around like a punching bag all over again, or if it was just my imagination.</p><p>God, I hope it was my imagination.</p><p>A tear hits my cheek that just fell straight from her eyes.</p><p>“I didn’t find out until I was already in Italy,” she says, her voice coated and laced with sorrow and shame. “I’m so sorry.”</p><p>In my head, I’m counting backward. Counting the days and the weeks and the months and trying to make sense of what she’s saying, because she’s obviously not pregnant now. My mind is still churning, crunching numbers, erasing errors, crunching more numbers.</p><p>She was in Italy for almost seven months. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Seven months there, three months before she left and one month since she returned.</p><p>That’s almost a year.</p><p>My mind hurts. Everything hurts.</p><p>“I didn’t know what to do,” she says. “I couldn’t raise him by myself. I was already eighteen when I found out, so . . .”</p> <p>I immediately lift up and look at her face. “Him?” I ask, shaking my head. “How do you know . . .” I close my eyes and blow out a steady breath, then release my grip on her waist. I stand up and turn around, then pace back and forth, absorbing everything that’s happening.</p><p>“Six,” I say, shaking my head. “I don’t . . . are you saying . . .” I pause, then turn and face her. “Are you telling me you had a fucking baby? That we had a baby?”</p><p>She’s crying again. Sobbing, even. Hell, I don’t know if she ever even stopped. She nods like it’s painful to do.</p><p>“I didn’t know what to do, Daniel. I was so scared.”</p><p>She stands up and walks toward me, then places her hands delicately on my cheeks. “I didn’t know who you were, so I didn’t know how to tell you. If I knew your name or what you looked like I never would have made that decision without you.”</p> <p>I bring my hands up to hers, and I pull them away from my face. “Don’t,” I say as I feel the resentment building within me. I’m trying so hard to hold it back. To understand. To let it all soak in.</p><p>I just can’t.</p><p>“How could you not tell me? It’s not like you found a puppy, Six. This is . . .” I shake my head, still not getting it. “You had a baby. And you didn’t even bother telling me!”</p><p>She grasps my shirt in her fists, shaking her head, wanting me to see her side of things. “Daniel, that’s what I’m trying to tell you! What was I supposed to do? Did you expect me to plaster flyers all over the school asking for information on who knocked me up in the maintenance closet?”</p><p>I look her directly in the eyes. “Yes,” I say in a low voice.</p><p>She takes a step back, so I take a step forward. “Yes, Six! That’s exactly what I would have expected you to do. You should have plastered it all over the hallways, aired it on the radio, taken an ad out in the motherfucking newspaper! You get pregnant with my kid and you worry about your reputation? Are you kidding me?”</p> <p>My hand covers my cheek a second after she slaps me.</p><p>The pain in her eyes can’t even come close to matching the pain in my heart, so I don’t feel bad for saying what I said. Even when she begins to cry harder than I knew people were capable of crying.</p><p>She rushes back to her car.</p><p>I let her go.</p><p>I walk back to the swing and I sit.</p><p>Fucking life.</p><p>Motherfucking life.</p><p>Daniel: Where are you?</p> <p>Holder: Just left Sky’s house. Almost home. What’s up?</p><p>Daniel: I’ll be there in five.</p><p>Holder: Everything okay?</p><p>Daniel: Nope.</p><p>Five minutes later Holder is standing on his curb waiting for me. I pull onto the side of the street and he opens the passenger door, then climbs inside. I put my car in park and prop my foot on the dash, then look out my window.</p><p>I’m surprised at how pissed I am. I’m even surprised at how sad I am. I don’t know how to separate everything I’m feeling in order to get a grip on the core of what’s upsetting me the most. Right now I can’t tell if it’s the fact that I didn’t have a say in whatever decision she made or if it’s because she was even put into that situation to have to make that kind of decision to begin with.</p><p>I’m pissed I wasn’t there to help her. I’m pissed I was careless enough to make a girl go through something like that.</p><p>I’m sad because . . . hell. I’m sad that I’m so mad at her. I’m sad I have to know something this overwhelming and there isn’t a damn thing I can do about it now, even if I wanted to. I’m sad because I’m sitting here in a parked car and I’m about to have a breakdown in front of my best friend and I really don’t want to do that but it’s too late.</p><p>I punch the steering wheel the second I begin to cry. I punch it several times, over and over, until the car begins to close in on me and I need to get the hell out of it. I open the door and climb out, then turn around and kick my tire. I kick it over and over until my foot starts to go numb, then I collapse against the hood onto my elbows. I press my forehead against the cold metal of the car and focus on burying this anger.</p><p>It’s not her fault.</p><p>It’s not her fault.</p><p>It’s not her fault.</p><p>When I’m finally calm enough to return to the car, Holder is sitting quietly in the passenger seat, watching me closely.</p><p>“You want to talk about it?” he asks.</p><p>I shake my head. “Nope.”</p><p>He nods. He’s probably relieved I don’t want to talk about it.</p><p>“What do you want to do?” he asks.</p><p>I wrap my fingers around the steering wheel, then crank the car. “I don’t care what we do.”</p><p>“Me neither.”</p><p>I put the car in drive.</p><p>“We could go to Breckin’s house and let you get your aggression out on a video game,” he suggests.</p><p>I nod, then begin to drive toward Breckin’s house. “You better not fucking tell him I cried.”</p><p>Chapter Eight</p><p>“You look like hell,” Holder says, leaning against the locker next to mine. “Did you even sleep last night?”</p><p>I shake my head. Of course I didn’t sleep. How the hell could I have slept? I knew she wasn’t sleeping, so there’s no way in hell I could have slept.</p><p>“You gonna tell me what happened?” he asks. I shut my locker, but keep my hand on it as I look down at the floor and slowly inhale.</p><p>“No. I know I usually tell you everything, but not this, Holder.”</p><p>He taps the locker next to him a couple of times with his fist, then he pushes off of it. “Six isn’t telling Sky anything, either. Not sure what happened, but . . .” He looks at me until I make eye contact with him. “I like you with her. Get it worked out, Daniel.”</p><p>He walks away and I close my locker. I wait next to it for a few minutes more than necessary because my next class is down the hallway where Six’s locker is. I haven’t seen her since she left the park last night and I’m not sure I really want to see her. I’m not sure about anything. I have so many questions to ask her but just thinking about having to ask her any of them makes my chest hurt so bad I can’t fucking breathe.</p><p>After the final bell rings, I decide to walk to my next class. I debated staying home from school altogether, but I figured it would be worse just sitting in my room thinking about it all day. I’d rather be preoccupied for as long as I can today because I know as soon as school is out I need to confront her.</p><p>Or maybe I’m supposed to confront her right now, because as soon as I round the corner, my eyes land on her.</p><p>I come to a quiet stop and watch her. She’s the only one in the hallway right now. She’s standing still, facing her locker. I want to walk away before she sees me, but I can’t stop watching her. Her whole demeanor is heartbroken and I want so bad to rush over to her and wrap my arms around her but . . . I can’t. I want to scream at her and hug her and kiss her and blame her for every single jumbled-up emotion I’ve spent the last day trying to process.</p><p>I sigh heavily and she turns to look at me. I’m far enough away that I can’t hear her crying, but close enough I can see the tears. Neither one of us moves. We just stare. Several moments pass and I can see she’s hoping I say something to her.</p><p>I clear my throat and begin walking toward her. The closer I get, the louder her soft cry becomes. I get about five feet away, then I pause. The closer I get to her, the harder it is to breathe.</p><p>“Is he . . .” I close my eyes and pass a calming breath, then open them again and try my hardest to finish my sentence with dry eyes. “When you talked about the boy who broke your heart in Italy . . . you were referring to him, weren’t you. The baby?”</p><p>I can barely see the nod of her head when she confirms my thoughts. I squeeze my eyes shut and tilt my head back.</p><p>I didn’t know hearts could literally ache like this. It hurts so much I want to reach inside and rip it out of my chest so I’ll never feel this again.</p><p>I can’t do this. Not right here. We can’t stand in the hallway of a high school and have this discussion.</p><p>I turn around before I open my eyes so I don’t have to see the look on her face again. I walk straight to my classroom and open the door, then walk inside without looking back at her.</p><p>Chapter Nine</p><p>I don’t know why I’m still here. I don’t want to be here and I’m pretty sure I’ll leave in half an hour. I just can’t leave before then because I’m scared of what she might think if I don’t show up to lunch. I could text her and tell her I’ll talk to her later, but I’m not even sure I feel like sending her a text yet. There’s still so much I have to process, I’d rather just ignore it all until I find the strength to sort through everything.</p><p>I walk through the cafeteria doors and head straight to our table. There’s no way I can eat lunch so I don’t even bother getting food. Breckin is sitting in my usual spot next to Six, but that’s probably a good thing. Not so sure I could sit by her right now, anyway.</p><p>Her eyes are focused on the textbook in front of her. She’s not crying anymore. I take a seat across from her and I know she knows I just sat down, but her eyes never move. Sky and Holder are deep in conversation with Breckin, so I watch them, trying to find a spot to jump in.</p><p>I can’t though, because I’m completely unable to pay attention. I keep stealing glances at her to make sure she isn’t crying or to see if she’s looking at me. She never does either of those things.</p><p>“You’re not eating?” Breckin says, stealing my attention.</p><p>I shake my head. “Not hungry.”</p><p>“You need to eat something,” Holder says. “And a nap might do you some good, too. Maybe you should go home.”</p><p>I nod, but don’t say anything.</p><p>“If you do go home, you should take Six with you,” Sky says. “You both look like you could use a nap.”</p><p>I don’t even respond to that with a nod. My eyes fall back to Six just in time to see a tear land on a page in front of her. She quickly swipes it away with her hand and flips the page over.</p><p>Fuck if that just didn’t make me feel like complete shit.</p><p>I continue to watch her and tears continue to fall onto the pages, one by one. Her hand is always quick to wipe them away before anyone notices and she always flips to a new page before she could even possibly have read the last one.</p><p>“Get up, Breckin,” I say. He looks at me blankly, but doesn’t make an effort to move. “I want your seat. Get up.”</p><p>He finally realizes what I’m saying, so he quickly stands up. I stand and walk around the table, then I take a seat next to her. I sit down beside her and when I do, she brings her arms onto the table. She folds them and buries her head into the crease in her elbow. I watch as her shoulders begin to shake and dammit if I can allow her to keep feeling this way. I wrap an arm around her and lower my forehead to the side of her head and I close my eyes. I don’t say anything. I don’t do anything. I just hold her while she cries into her arms. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Daniel,” I hear her say through her muffled tears. She lifts her head and looks up at me. “Daniel, I’m so sorry. I’m so, so sorry.” Her tears become sobs and her sobs become too much. It’s too fucking much.</p><p>I pull her to my chest. “Shh,” I say into her hair. “Don’t. Don’t apologize.”</p><p>Her body becomes limp against mine and everyone in the cafeteria is beginning to stare at us. I want to hold her and tell her how sorry I am for allowing her to walk away last night, but she needs privacy. I wrap my arm tighter around her, then scoop her legs up into my other arm. I pull her against me, then stand up and carry her out into the hallway. I keep walking until I round the corner and find our room. She’s still crying against my chest, wrapped tightly around me. I open the door to the maintenance closet, then I close it behind us. I back up to the door and slide down until I meet the floor, still holding her in my arms.</p><p>“Six,” I say, lowering my mouth to her ear. “I want you to try to stop crying, because I have so much I want to say to you.”</p> <p>I feel her nod against my chest and I remain quiet, waiting on her to calm down. Several minutes pass before she’s finally quiet enough for me to continue.</p><p>“First of all, I am so sorry for letting you walk away last night but I don’t want you to think for one second it was because I was judging your choices. Okay? I’m not about to put myself in your shoes and tell you that you made a bad choice, because I wasn’t there and I have no clue how hard that must have been for you.”</p><p>I adjust her and straighten out my legs so she’s forced to sit up and look at me. I pull one of her legs to the other side of me until she’s facing me. “I’m just sad, okay? That’s all this is. I’m allowed to be sad about this and I need you to let me be sad because this is a whole hell of a lot to process in a day.”</p><p>She pulls her lips into a thin line and she nods while I wipe away her tears with both my thumbs. “I have so many questions, Six. And I know you’ll answer them when you’re ready, but I can wait. If you need me to give you time I can.”</p><p>She shakes her head. “Daniel. He’s your son. I’ll answer any question you ask me. I just don’t know if you want to hear the answers because . . .” She squeezes her eyes shut to hold back more tears. “Because I think I made the wrong choice and it’s too late. It’s too late to go back now.”</p> <p>She’s crying hard again, so I wrap my arms around her and hug her.</p><p>“If I knew he was yours or that I would eventually find you I would have never done it, Daniel. I would have never given him up but I did and now you’re here and it’s too late because I don’t know where he is and I’m sorry. God, I’m so sorry.”</p><p>I shake my head, wishing she would stop. It’s hurting me more to see her upset with herself than anything else about this whole situation.</p><p>“Listen to me, Six.” I pull back and look her in the eyes, holding her face firmly between my hands. “You made a choice for him. Not for yourself. Not for me. You did what was best for him and I will never be able to thank you enough for that. And please don’t think this changes how I feel about you. If anything, it just lets me know that I’m not crazy. For the past month I’ve been thinking my feelings for you couldn’t be real because there are so many of them and they’re so much. Too much sometimes. I constantly have to bite my tongue when I’m around you because all I’ve been wanting to do lately is tell you how much I love you. But it’s only been a month since we met and the only other time I’ve said those words out loud to a girl was over a year ago. Right here on this floor. And you wouldn’t believe how real I wanted that moment to be for us, Six. I know I didn’t know you but my God, I wished I did. And now that I do know you . . . really know you . . . I know it’s real. I love you. And knowing what we shared last year and now knowing what you had to go through and how it’s made you exactly who you are right now . . . it just blows my mind. It blows my mind that I get to love you.”</p><p>I feel her hands wiping tears from my cheeks when I lean in to kiss her. I pull her against me and she pulls me against her and I have no plans to ever let her go. I kiss her until her hands move up to my face and she pulls her lips from mine. Our foreheads meet and she’s still crying, but her tears are different now. I feel like they’re tears of relief rather than tears of worry.</p><p>“I’m so happy it’s you,” she says, keeping her hands locked on my face. “I’m so happy it was you.”</p> <p>I pull her against me and hold her. I hold her for so long that the bell rings and the hallway fills and empties and another bell rings and we’re still sitting here together, holding on to each other when the silence in the hallway returns. I’m periodically pressing kisses into her hair, stroking her back, kissing her forehead.</p><p>“He looked like you,” she says quietly. Her hand is lightly trailing up and down my arm and her cheek is pressed against my chest. “He had your brown eyes and he was kind of bald, but I could tell he was going to have brown hair. And he had your mouth. You have a great mouth.”</p><p>I rub my hand up her back and kiss the top of her head. “He’s got it made,” I say. “Looks just like his daddy, hopefully acts like his mommy, and he’ll have a nice Italian accent. Kid won’t have any problems in life.”</p><p>She laughs and hearing that sound immediately brings tears to my eyes again. I squeeze her tight against me and rest my cheek against the top of her head and sigh.</p><p>“It’s probably for the best that it all happened like it did,” I say. “If we had decided to keep him I would have ruined him with some stupid nickname. I probably would have called him Salty Balls or some shit like that. I’m not cut out to be a dad yet, obviously.”</p><p>She shakes her head. “You’d be a great dad. And one of these days, Salty Balls will be the perfect nickname for one of our kids. Just not yet.”</p><p>Now I’m the one laughing. “What if we have all girls?”</p><p>She shrugs. “Even better.”</p> <p>I smile and keep her held close against me. After last night and being apart from her, knowing how much she was hurting, I know I’ll never want to feel that way again. I never want her to feel that way again.</p><p>“You know what I just realized?” she says. “We’ve already had sex. I’ve been kind of bummed because if I had sex with you, it would have made you the seventh person I’ve ever had sex with and that’s a lot. But you’ll still be the sixth, because I was already counting you and I didn’t even know it.”</p><p>“I like six,” I say. “That’s a good number to be. It’s actually my favorite number.”</p><p>“Don’t get too excited now that you know we’ve already had sex,” she says. “I’m still making you wait.”</p><p>“I’ll wear you down soon enough,” I tease.</p><p>I bring one of my hands up to her head and I hold it while I lean forward and kiss her softly on the lips. I stay close to her mouth and make a confession. “I haven’t brought this up because we haven’t been together that long and I didn’t want to scare you off. But now that I know we have a kid together, it makes it less embarrassing.”</p><p>“Oh, no. What is it?” she asks nervously.</p><p>“We graduate in less than a month. I know you and Sky and Holder were planning on going to the same college in Dallas after the summer. I had already applied to a college in Austin, but after I met you I might have applied to Dallas, too. You know . . . in case things worked out with us. I didn’t like the thought of being five hours apart.”</p><p>She tilts her head and looks up at me. “When did you apply?”</p><p>I shrug like it’s not a big deal. “The night Sky had that dinner for you.”</p><p>She sits up and looks at me. “That was twenty-four hours after we went out for the first time. You applied to my college after knowing me for one day?”</p><p>I nod. “Yeah, but technically I knew you for a whole year. If you look at it that way, it’s way less creepy.”</p><p>She laughs at my logic. “Well? Did you get accepted?”</p><p>I nod. “I might have already made living arrangements with Holder, too.”</p><p>She grins and it’s probably the most I’ve ever loved a smile. “Daniel? This is serious. This thing with us. It’s pretty intense, huh?”</p><p>I nod. “Yeah. I think we might really be in love this time. No more pretending.”</p><p>She nods. “Things are so serious now, I think it’s time I introduced you to all my brothers.”</p><p>I stop nodding and start shaking my head back and forth. “I may be exaggerating. I don’t love you that much.”</p><p>She laughs. “No, you love me. You love me so much, Daniel. You’ve loved me since the second I let you accidentally touch my boob.”</p><p>“No, I think I’ve loved you since you forced me to stick my tongue in your mouth.”</p><p>She shakes her head. “No, you’ve loved me since I let you kiss me in a crowded restaurant next to a dirty diaper.”</p><p>“Nope. I’ve loved you since you walked through Sky’s bedroom door with that spoon in your mouth.”</p><p>She laughs. “Actually, you’ve loved me since the first time you told me you loved me a year ago. Right here in this room.”</p><p>I shake my head. “I’ve loved you since the moment you fell on top of me and said you hated everybody.”</p><p>She stops smiling. “I’ve loved you since the moment you said you hated everybody, too.”</p><p>“I used to hate everybody,” I say. “Until I met you.”</p><p>“I told you I was unhateable.” She grins.</p><p>“And I told you unhateable isn’t even a real word.”</p><p>Her eyes focus on mine and she takes both my hands, then laces her fingers through them. We stare at each other like we’ve done so many times before, but this time I feel it in every single part of me. I feel her in every part of me and the feeling is new and heavy and intense and I realize in this moment that we just became so much more together than we could ever possibly be alone.</p><p>“I love you, Daniel Wesley,” she whispers.</p><p>“I love you Seven Marie Six Cinderella Jacobs.”</p><p>She laughs. “Thank you for not turning out to be an asshole.”</p><p>“Thank you for never asking me to change.” I lean forward and kiss the smile that just spread across her lips as I silently thank the universe for sending her back to me.</p><p>My fucking angel.</p><p>The end. </p> </body></html>"]