["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As a child I didn't believe in the bogeyman. There was no monster in the closet. No dragon under the bed. When I was twenty-six I learned differently. The bogeyman was real. The monsters popped up in my own backyard. I haven't seen a dragon yet, but that doesn't mean one doesn't exist.</p><p>I was just a small town cop, doing my job - a little bored, a little lonely. Then the wolves went berserk and the people did, too. Once the dust settled, and I figured out who was good, who was bad and who was a psychotically evil werewolf, I was no longer Officer Jessie McQuade but a Jager-Sucher.</p><p>My whole world changed, in more ways than one. I swapped the relative safety of cop-hood in small town Miniwa, Wisconsin for extreme danger as a member of a secret group of government funded operatives. The trade-off was sleeping with Will Cadotte. The man was a sex god.</p><p>Oh, not literally. But in my new world, you never know. As I had to kill my best friend after she turned into a wolf god, it isn't too much of a stretch that my boyfriend could be an actual sex god. Stranger things have happened in the past few months. You don't believe me, watch a person turn into a wolf and back again, then we'll talk.</p> <p>After the wolf god incident, Will and I became Jager-Suchers, or Hunter-Searchers. I was the hunter, while Will was more the searcher. Though he was accomplished in tai chi and had kicked my ass on occasion, when it came time to kill things, he usually left that to me.</p><p>Late one night, not long after the previously mentioned incident the doorbell rang. I was uneasy. My mother always said that nothing good happened after midnight. Lately, nothing good happened after sundown.</p><p>I retrieved my weapon and checked the load - silver from this point forward. Once I'd taken a quick peep through the peephole, I opened the door.</p><p>\"Jessie.\" The leader of the Jager-Suchers, Edward Mandenauer, stepped inside without being invited. \"We must talk.\"</p><p>Will was asleep. He wasn't a night person. However I'd been working third shift throughout my career as a cop, which worked out well now that I'd taken to hunting werewolves. They tended to come out under the moon and run around until the sun came back. Go figure.</p> <p>\"Now?\" I asked, and followed him down the hall into my living room.</p><p>The lines in his face deepened on a frown. \"What is wrong with now?\"</p><p>\"Besides it being . . . \" I glanced at my watch. \"One in the morning?\"</p><p>\"Monsters do not care about the time.\"</p><p>\"I bet they don't. However I have a life.\"</p><p>He stared down his long, bony nose at me. This didn't happen often, since I was a solid five-ten. But Mandenauer topped out at over six feet of tough, skeletal old man. He'd spent his youth in Nazi Germany, spying for the good guys, which was how he'd discovered the monsters.</p> <p>\"Any life you have, you must give up to serve me.\"</p><p>\"Not likely, pal. I work for you. I live for Will.\"</p><p>It felt strange to say that. Me, who'd never had a boyfriend. Dates? Sure. Relationships? Never. And to have a relationship, a life, with Will . . . I was still getting used to the concept, still waiting for him to wake up one morning, look at me and wonder: What in hell was I thinking?</p><p>\"Spare me the nonsense,\" Mandenauer said. \"I allow you to work together because - \"</p><p>\"We're stronger together than apart.\"</p><p>Will stood in bedroom doorway. My throat went tight just looking at him.</p><p>Short, black hair all tousled, his equally dark eyes were still heavy with sleep. He'd yanked on his jeans but left the button open; the buttons on his shirt were open too, revealing his honed and toned chest.</p><p>He was the same bronze shade all over. I'd looked. Will liked to walk around at his place - several acres in the north woods outside of town - completely nude. He says it's an Ojibwe thing. Did I mention he's a member of the wolf clan? One of the reasons Edward shot him, but let's not get into that.</p> <p>The combination of beauty, grace and his great big . . . brain-- How was a girl supposed to think when a guy looked like that?</p><p>Will gave me a lazy smile and strolled over to join me. As soon as he was close enough, he took my hand. He was very touchy-feely. For a girl whose dad had taken off before she'd known what the word \"father\" meant and whose mom's idea of affection was not telling her daughter she was an unfeminine embarrassment for one whole day, Will's openness had been more of a puzzlement than a revelation.</p><p>\"Why are you here, Edward?\" Will was very good at getting to the point. He was also one of the few people who'd dared to call our boss Edward right out of the gate and get away with it.</p><p>\"We have a problem.\"</p><p>\"We meaning Jessie, me and you? Or we the Jager-Suchers?\"</p><p>\"We in the universal sense. Humankind may be in dire trouble.\"</p><p>\"Isn't it always?\" I asked. \"Foil the werewolves, save the world. That should be our motto.\"</p><p>Except mottos aren't too common in the secret agency biz.</p><p>\"I do not have time for your humor, Jessie.\"</p><p>I guess that meant I should lay off the sarcasm. But then what would I have to say?</p><p>\"I had a call from headquarters,\" Mandenauer continued. \"I need the two of you to pack your things. And he--\" Mandenauer waved his hand vaguely in Will's direction. \"Should bring his computer.\"</p><p>\"He has a name,\" I said.</p><p>Though Will had no trouble calling Edward . . . Edward, the old man couldn't seem to get his tight lips around the word Will. I wasn't sure if that was because Mandenauer really didn't like him, or because he didn't know how to be anything other than cranky.</p><p>I suspect having your world turned upside down when you were still a young man wasn't easy. Devoting your life to killing the monsters Hitler had ordered his insane pal Mengele to make meant Edward had been on the hunt for over sixty years. I didn't know if he'd ever been married; the idea of him dating was scary enough.</p><p>Mandenauer grunted but didn't bother to apologize, and Will didn't seem to care. He was the least likely person to take offense I'd ever met, which I guess was a good thing considering how annoying I could be. There were also a lot of people in small towns all over the north who didn't much care for Indians, and weren't shy about saying so. It didn't take fur, claws and teeth to make some folks into monsters.</p><p>Will went into the bedroom and returned with his laptop. Then he sat at the table, booted up the computer and started searching for his glasses.</p><p>\"Here.\" I snatched them off the end table where he'd left them earlier.</p><p>Will was forever misplacing the things, sometimes right on top of his head. I don't know why I found that absentminded professor stuff both sexy and endearing. The combination of that face, the body and his wire rimmed glasses . . . Let's just say I asked him to wear those glasses a lot.</p><p>Glasses and nothing else.</p><p>\"Where, when and what?\" Will's long clever fingers skated over the keyboard.</p><p>\"The village is called Riverview,\" Edward continued. \"For the past several months citizens have been going insane at an alarming rate.\"</p><p>\"When you say insane . . . \" I let my voice trail off. In our world, insane covered a whole lot of a territory.</p><p>There were those who believed they were werewolves and those who actually were. Both were nuts, but the latter had enough supernatural power to cause major death and destruction, not to mention turn normal, everyday nice people into murdering evil beasts.</p><p>And that was only the werewolves. According to Edward, there were a whole host of other things out there we didn't even know about yet.</p><p>\"In this case,\" Mandenauer answered, \"I am talking about normal insanity.\"</p><p>\"Isn't that an oxymoron?\" Will murmured, still staring at his computer.</p><p>Edward ignored him. \"The afflicted degenerate into gibbering fools. Nothing medical science has at its disposal will stop them.\"</p><p>Will glanced up from the screen. \"Has medical science been able to determine what sent them over the edge?\"</p><p>Edward shook his head. \"They have tested the air, the water, the soil, the very buildings in which they live and the food that they eat.\"</p><p>Will frowned and went back to his computer. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I understand why this is a concern,\" I said, \"but why is it our concern?\"</p><p>Mandenauer's influence was far-flung. Having the U.S. government behind him, albeit secretly, meant he not only had access to a lot of resources but also to a lot of funding. His spidery webs reached all over the place. Every odd report was tagged and sent to Jager-Sucher headquarters in Montana, where Edward's right hand woman, Elise, would dispatch agents to check out what was happening and, if necessary, eliminate it.</p><p>\"I can't find anything on the internet about this,\" Will murmured.</p><p>\"Do you think I would let it become common knowledge?\"</p> <p>Not only was Edward sent any odd report, but he possessed the resources to squash the information. All we needed was for a town to be taken over by werewolves and have the media show up. This would not only generate a panic but some very nasty news reporters.</p><p>Come to think of it, maybe Edward had slipped up a time or two already.</p><p>\"What is it about Riverview that rated a notice being sent to headquarters?\" I asked.</p><p>Edward gave a nod of approval at my question that would have had me preening, if I was the type to preen.</p><p>\"Though the insane gibber madly, there is one word that makes sense.\" Edward glanced from me to Will and back again before continuing. \"Boxenwolf.\"</p> <p>He said the word with a German twist. I still knew what it meant. \"Werewolf.\"</p><p>\"Ja.\"</p><p>Considering a great portion of the population in Wisconsin was of German extraction, I didn't find it surprising that the term boxenwolf might be bandied about. But by those who'd lost their minds, and all in the same town . . . That begged a few more questions.</p><p>\"Has anyone gotten up and walked out of the morgue after a horrific and bloody death? Torn out a few throats, drank some blood, started baying at the full moon through their brand new snout?\"</p><p>\"Not yet.\"</p><p>\"You said this has been going on for months.\"</p> <p>Mandenauer dipped his chin. \"Several full moons have come and gone, but none of the afflicted have become a demon werewolf.\"</p><p>Though a lot of werewolf lore was B.S., that stuff about shifting beneath the full moon was not.</p><p>\"Perhaps the gibbering people only saw a werewolf, they weren't turned into one,\" Will suggested.</p><p>I'd seen plenty of werewolves; sure they were scary, especially when they gazed at you with the eyes of someone you knew, someone you loved. But just seeing them shouldn't turn a normal human being into an insane inmate of a little white room.</p><p>\"The two of you must go to Riverview and discover what is happening,\" Edward said.</p><p>\"And when we do?\"</p><p>His faded blue eyes met mine; not a spec of emotion shone through. \"Need you ask?\"</p><p>Not really. The rules of Edward's world, and now my own, were simple.</p> <p>Monsters are shot with silver. Human beings are not.</p><p>Determine which is which before shooting.</p><p>Riverview was a three-hour drive northeast from Miniwa, which put us very close to Upper Michigan.</p><p>What Edward had referred to as a village was, in reality, a town the size of Miniwa, maybe a little larger, which made it a decent-sized town. To sport a psychiatric facility with enough rooms to accommodate over half the residents it would have to be.</p><p>We'd been told to go straight to the clinic, and it wasn't hard to find. On a ridge at the center, Riverview Psychiatric dominated the town.</p><p>\"I guess we don't have to worry about the homicidally crazy wandering into the maternity ward,\" I murmured.</p><p>A load off my mind. I hated it when the beasties got too close to small, helpless things. Nothing ever went very well after that.</p><p>But while I was glad the facility was psych only, I also found it odd such a hospital existed way out in the wilderness. Before the sudden outbreak of the crazies, who had inhabited all those beds?</p><p>The building was surrounded by thickset evergreens, not unusual in this part of the country. Smaller towns were often the remnants of lumber camps, which had sprung up in the middle of mammoth forests.</p><p>Such forests were where the wolves lived, and because of that isolation oftentimes no one noticed the beasts were becoming more numerous, more aggressive and a helluva lot smarter until it was too late.</p><p>The parking lot was full of cars, but there was no one at the reception desk to greet us. Weird. Places like this always had a receptionist, if not a security guard or two.</p><p>\"Hello?\" Will called.</p><p>No one answered.</p><p>\"Hey!\" I shouted. \"A little help here?\"</p><p>Still nothing.</p><p>We frowned at each other, and I jerked my chin to the right, indicating Will should go one way. I went the other.</p><p>Only empty offices lay down my corridor. I guess that made sense. The patients wouldn't be easily accessible to anyone walking in off the street. Like me. They also shouldn't be able to walk out the front entrance, just by walking a few feet down the hall, although I was starting to wonder if they had.</p><p>I glanced at Will. He'd reached the end of his corridor. He lifted his hands then lowered them. Nothing on his side either. We met again at the receptionist desk.</p><p>\"What do you think?\" I peered at the glass door straight ahead.</p><p>The entrance held a huge lock that appeared to need both a key card and a code to open. The glass was tinted. We couldn't see anything in there. I wondered if they could see us out here. If they were even in there at all.</p><p>\"Doesn't hurt to try.\" Will skirted the reception desk and bent over, squinting at the security box. Apparently he'd left his glasses in the car. \"I can probably figure this out.\" He straightened. \"I'll need my computer.\"</p><p>\"How about I just break the glass.\"</p><p>He tapped his knuckle against it. \"Appears a little bulletproof.\"</p><p>\"Why on earth would they have tinted, bulletproof glass for a clinic in Tiny Town, USA?\"</p><p>\"I have a feeling they don't want what's on the other side to get out.\"</p><p>\"Or maybe they don't want any of us to get in.\" My fingers itched. \"That just makes me want to.\"</p><p>Will grinned. \"One of the things I love about you,\" he said, then ran a hand over my short, non-descript hair--neither blond nor brown but something in between</p><p>\"Uh, yeah.\" I still wasn't used to his easy and numerous declarations of love. Maybe someday I would be, but I'd never been loved before, and I knew instinctively I never would be again in the way that Will loved me.</p><p>Utterly. Completely. No matter what. For always.</p><p>\"Why don't you get your computer? I'll wait here.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Leaning over, he brushed his lips across mine. In our business, we never knew when simple chores, such as retrieving a computer from the car, might separate us forever.</p><p>He didn't bother saying be right back. We tried not to make promises we weren't sure we could keep.</p><p>With Will gone I got antsy. I'd never been very good at waiting, was even less adept at keeping my hands to myself. I searched the papers on the desk and found nothing interesting--schedules, insurance info, not a word about boxenwolves anywhere. A tap on the computer keyboard did not bring the screen to life. I would leave that for Will.</p><p>Wandering back to the tinted glass door, I shrugged and tried the knob. It twisted.</p> <p>\"Uh-oh.\" I set my free hand on my gun.</p><p>\"What are you doing?\"</p><p>I jumped then scowled at Will. \"What did I tell you about sneaking up on me? Make noise like a normal person would.\"</p><p>\"Normal white person. Indians move like the wind.\"</p><p>I rolled my eyes but didn't argue, because he did. \"We forgot the first rule of breaking and entering.\"</p> <p>\"Which is?\"</p><p>\"Try the knob first.\" I pushed, and the door swung open.</p><p>The corridor beyond was brilliantly white and glaringly empty. Every door gaped wide. I didn't like it, but I took a deep breath, drew my weapon--who knows how fast whatever we might encounter could move--and said, \"Let's go.\"</p><p>Will set his computer under the receptionist's desk and followed. He left his weapon in its holster. He'd never been very good with it. Will Cadotte was much better at hand-to-hand.</p><p>As we moved down the corridor, every room not only appeared empty but, upon further checking, was empty.</p><p>\"Maybe everyone got better,\" Will murmured.</p> <p>\"Then where are the doctors, the nurses, the janitors? Whose cars are those in the lot?\"</p><p>\"Got me.\"</p><p>I liked this place less and less the longer we were there. Each room had been lived in, if you could call being incarcerated in the equivalent of a padded room \"living.\"</p><p>I pointed to the camera in the corner of the hallway. \"There has to be a security office somewhere.\" The red light was on. Tape was rolling.</p><p>\"I saw cameras in all the rooms, too,\" Will said. \"Wonder what that was about.\"</p><p>\"To keep track of patient care, or lack thereof. We need to find the other end of all those seeing eyes.\"</p><p>As we'd checked every room, every closet, every nook and cranny on the main floor, when I found the door that led to the basement, I started down without hesitation.</p><p>\"Hold on.\" Will laid a hand on my shoulder. \"Do you watch scary movies?\"</p> <p>I glanced up. The bright light from the hall flared around his head, casting his pretty face in shadow. \"Why on earth would I watch a horror flick when half the time I'm living in one?\"</p><p>\"The most important rule forgotten by stupid heroines everywhere is: Don't go in the basement.\"</p><p>I hated being called stupid almost as much as I hated being called a heroine.</p><p>\"I've got a gun.\" I lifted the weapon.</p><p>\"You always do. How many times has a gun been useless against the monster du jour?\"</p><p>More than I cared for. Still - \"We can't just leave. You want to tell Edward we were too frightened to go in the basement?\"</p><p>He took a deep breath then let it out. \"You could tell him.\"</p><p>\"No thanks.\" Edward was often scarier than anything we uncovered on the job.</p><p>Will fumbled behind me, and light flared above and below us.</p><p>\"See.\" I gestured with my gun. \"Nothing scary down here.\"</p><p>Although I had to say that the extreme cleanliness was disturbing. Didn't all basements have their share of cobwebs, dust and rats? Apparently not the basement of the Riverview Psychiatric Clinic.</p><p>I reached the bottom of the steps and was blinded by the brilliance. Everything was painted white--floor, ceiling, walls, doors. There were two. I opened the first, leading with my gun. The lack of light in front of me after having so much behind me made me blink. Nothing jumped out and said \"Grrr.\" All I heard was the low rumble of machinery.</p><p>\"Furnace,\" Will said.</p><p>The second door revealed what we'd been searching for--the security office--also darkened so the screens were easy to see. The place was empty as the rest of the building. The echoing silence and shadowy atmosphere gave me the urge to tread lightly and whisper. I guess that wasn't a bad thing.</p><p>\"Check all the screens,\" I murmured.</p><p>One glance and my unease deepened. While we'd been inside, dusk had fallen. As previously mentioned, bad things happened after the sun went down.</p><p>\"We'll need to pull up what was recorded in the last twenty-four hours.\"</p><p>Will nodded, heading to the left while I went to the right. It only took me an instant to locate the camera we were looking for. \"Hell,\" I muttered, and Will immediately joined me.</p><p>The apparatus had been mounted on the rear wall of the hospital and pointed toward the forest. I understood why. Any security issues approaching from that direction would come out of the trees. Any escaped prisoners - uh, I mean patients - would head directly for them.</p><p>So, were the beings emerging from the evergreens formerly patients or upcoming security risks? Considering they loped in our direction on four paws, it didn't really matter.</p><p>\"Wolves,\" Will murmured. \"A lot of them.\"</p><p>\"Mmm,\" I said, not bothering to count once I hit a dozen. I didn't have enough bullets to kill them all. Who would have thought we'd be attacked by a herd?</p><p>I should have. It had happened before.</p><p>Inching closer to the screen, I squinted in a vain attempt to see their eyes. Were they wolves, werewolves or something completely new and different? Hard to tell from here.</p><p>\"Let's go.\"</p><p>\"I don't suppose you mean home?\" Will muttered.</p><p>\"Do I ever?\"</p><p>He sighed, but he followed me from the security office, down the hall, up the steps, then toward the back door. As we went, we checked our guns.</p><p>\"Not enough bullets,\" Will said.</p><p>\"Make them count.\"</p><p>\"Then what?\"</p><p>I patted the pure silver knife at my waist. \"Then you get behind me. Find a room with no windows. Lock it.\"</p><p>\"Shouldn't we call Edward?\"</p><p>We'd reached the rear entrance to the clinic where a bank of glass overlooked the trees. \"Too late.\"</p><p>Dozens of wolves blocked the exit. Darkness threatened, but there was enough light left to reveal their eyes.</p><p>They weren't human. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"They're just wolves,\" Will said.</p><p>\"Maybe.\"</p><p>They weren't behaving like wolves. They sat in a semi-circle, patient, more like well-behaved dogs expecting a treat than wild animals, their attention focused on the windows but not on us. They were waiting for something, or perhaps, someone.</p><p>\"We can't shoot them,\" Will continued.</p> <p>\"No?\"</p><p>\"No,\" he said firmly.</p><p>As a member of the wolf clan, Will had a soft spot for the species. According to Ojibwe legend each clan member--bear clan, badger clan, stork clan and so on--was a descendant of the clan's totem animal. Which would make Will part wolf. However, since many of his relatives had started to slobber and slaver and chase us everywhere we went with the intent of killing us, he'd changed his opinion a bit.</p><p>\"If they're really wolves,\" he continued, \"they're endangered.\"</p><p>Not too long ago, the wolves had recovered enough in Wisconsin to be taken off the endangered species list, but recently they'd been put back again. This might have something to do with Edward's penchant for shooting first and discovering if the beast were wolf or werewolf later. I preferred Edward's way of doing things myself, but Will--being Will--disagreed.</p> <p>Somewhere in the clinic a bell chimed - soft not harsh - if the place hadn't been as silent as the proverbial tomb, we wouldn't have heard it.</p><p>Outside, the wolves cocked their heads then got to their feet and advanced. A chill wind seemed to swirl through the hall, though not a window, not a door, was open.</p><p>The way the animals moved--in tandem, exactly the same--freaked me out. They resembled computerized wolves on a movie screen, one wolf cloned over and over. If it weren't for their physical differences - brown, black, ash, white, auburn fur - I would think they were clones, which would be another problem entirely.</p><p>As the wolves neared the clinic, Will tensed.</p><p>\"They can't get in,\" I said. \"No thumbs.\"</p><p>Doors were a problem for the quadrupedal. Thank God.</p> <p>\"I doubt that's going to be an issue much longer.\"</p><p>The outlines of the beasts shimmered in the half-light, becoming indistinct, then solidifying again. Each time they reshaped a little differently. Within minutes the back door opened and dozens of people filed inside.</p><p>Stark naked, but they didn't seem to mind, probably because they didn't seem to know. They moved with a shuffling, zombie-like gait, and as they did they repeated the word \"boxenwolf\" like a litany.</p><p>I lifted my gun; Will shoved it back down. \"You can't.</p><p>\"You saw them shift. They're werewolves.\"</p><p>\"Are they?\"</p><p>Before I could stop him - he'd always been quicker than spit - Will snatched my knife and laid the flat of the blade against the nearest person's arm. I winced, expecting smoke, flames, screaming agony - the usual response when silver touched a werewolf in any form--but nothing happened.</p><p>Will flipped the knife end over end, catching it nimbly by the blade and handing it back to me with a quirk of his brow that very clearly mimed, Told you so.</p> <p>Lucky for him, he didn't say it.</p><p>\"Hey!\" I set the heel of my hand against the nearest naked chest--a middle-aged guy with an impressive spare tire. \"What's your name?\"</p><p>\"Boxenwolf,\" he replied, and took another step.</p><p>\"Hold on a second.\" I kept my hand right where it was,</p><p>The man didn't even glance my way before he shoved my chest so hard I flew several feet and crashed into the nearest wall.</p><p>\"Damn.\" I shook my head, freezing mid-shake when pain rocketed through my eye sockets and settled in my back teeth. Every time that happened, it hurt.</p><p>\"You okay?\" Will stood over me, concern in his eyes. But he knew better than to fuss. Or help me up after I'd been knocked down. That only made me feel more of an idiot.</p><p>\"No.\" I clambered to my feet, rubbing at the sore spot on my chest. \"That's gonna leave a mark.\"</p><p>\"It always does.\" Will turned his attention to the shuffling, mumbling mass of patients. \"Strength like that isn't quite human.\"</p><p>\"Ya think?\" I muttered. \"So what are they?\"</p><p>\"Boxenwolves.\"</p><p>I sighed. He was right, but-- \"What's a boxenwolf?\"</p><p>Will shrugged.</p><p>The residents separated, heading into the empty rooms. I strode to a doorway and watched as an elderly woman methodically put on her patient gown and climbed into bed. Closing her eyes, she appeared to sleep. Will peered into the next empty room.</p><p>\"Asleep?\" I asked. He nodded.</p><p>I moved to the bedside and tapped the woman on the shoulder. \"Ma'am?\"</p><p>Slowly she opened her eyes; confusion filled them. \"Are you the new nurse?\"</p><p>\"No, I'm--uh--Jessie.\"</p><p>\"How nice.\" She gave me a sleepy smile. She didn't seem evil.</p><p>\"Do you know why you're here?\" I asked.</p><p>\"To get well.\"</p><p>\"What's wrong with you?\"</p><p>She blinked at the question, which I suppose had been rude, but rude had always been my true middle name.</p><p>\"I'm crazy, child. Didn't you read the front door?\"</p><p>\"You don't seem crazy.\"</p><p>\"Does anyone?\" she murmured, and went back to sleep.</p><p>In my experience the crazy always seemed very crazy. But, also in my experience, crazy often went hand-in-hand with psychotic, murderer--be it werewolf or human.</p><p>I returned to Will. \"We've got to figure out what they are.\" I pulled out my cell phone. \"I'll call Elise.\"</p><p>Elise Hanover, Edward's right-hand woman, was a scientist who knew quite a bit about what made werewolves tick. I pressed the speed dial.</p><p>\"I wouldn't do that if I were you.\"</p><p>Juggling the phone, I reached for my gun. Will already had his. Together we trained our weapons on the man who emerged from the shadows.</p><p>He was a lot younger than I expected, although what I expected, I don't know--certainly not the slim, tall, blond-haired, blue-eyed guy in a white coat. Beneath it he wore a blue shirt and a yellow tie, the contrast emphasizing his own coloring.</p><p>\"Who the hell are you?\" I demanded, ever Miss Manners.</p><p>\"I should be asking you that question. This is my clinic.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I narrowed my eyes. \"Yours, as in you built it, own it, run it?\"</p><p>His lips curved. \"Yes.\"</p><p>\"You look kind of young to fund a place like this.\"</p><p>\"My ancestors put away quite a bit of money.\"</p> <p>\"Lucky you.\"</p><p>I didn't like him, and I wasn't sure why. But as I'd learned to trust my instincts, I didn't lower my gun. Will didn't either.</p><p>\"Name?\" I snapped.</p><p>My annoyance only seemed to amuse him, which annoyed me more. \"Dr. Jeremy Zachau. And you are?\"</p><p>I glanced at Will; he shrugged. We always have a cover story prepared before we go on a job - a cover Edward makes certain will hold up to any scrutiny.</p> <p>\"We're with the Department of Natural Resources. There've been reports of rabid wolves in the area.\"</p><p>He lifted one sandy brow. \"And why would the wolves be inside my clinic?\"</p><p>\"Yeah, why would they?\"</p><p>\"Because they're boxenwolves.\"</p><p>I blinked, and my gun dipped. I'd never had anyone actually admit to what they were doing without a little \"encouragement.\"</p><p>\"Who are you?\" I asked. \"And I don't mean your name. What are you up to here and why? How do you know about boxenwolves?\"</p> <p>\"I created them.\"</p><p>Inventing a new kind of creature was never good.</p><p>\"I'll be happy to tell you everything, Jessie.\"</p><p>I frowned. \"How did you know--?\"</p><p>\"Did you really think your feeble DNR lie would fool me?\"</p><p>It had fooled everyone else.</p><p>Zachau's hair fell in a charming tousle over his unlined forehead. I suddenly wanted to shoot him with silver just to see if he caught fire.</p><p>\"You're Jessie McQuade, one of Herr Mandenauer's best hunters.\"</p> <p>\"You know Edward?\"</p><p>\"My grandfather did.\"</p><p>\"And who was your grandfather?\"</p><p>\"His name is unimportant. His work is what matters. He spent his final days in a laboratory in the Black Forest.\"</p><p>\"Mengele,\" I muttered.</p><p>\"Oh, I'm not related to that great man. I only wish that I was.\"</p><p>\"You say great man, I say psychopath.\" I shrugged. \"Tomato. To-ma-toe.\"</p><p>Anger flashed in Zachau's eyes. \"Mengele was brilliant. A visionary.\"</p><p>\"He was an insane, elitist pig who killed people because they were different.\"</p><p>Zachau shrugged. \"In the advancement of science, sacrifices must be made.\"</p><p>My trigger-finger began to itch.</p><p>\"Jessie,\" Will warned.</p><p>\"Yeah, yeah.\" I tried to relax, but it wasn't easy. \"Mengele wasn't advancing science,\" I continued, \"he was building a werewolf army.\"</p><p>\"He did build one.\"</p><p>Which was how Edward had become . . . well, Edward. Back in WW2 he had been a double agent, assigned to discover just what in hell the \"great man\" was up to in the Black Forest. Unfortunately, Edward hadn't found out quickly enough. By the time he reached Mengele's lab, the doctor had panicked at the incoming allied invasion and released everything he'd created into the world. Edward had been chasing them ever since.</p><p>\"I've perfected his formula,\" Zachau said.</p><p>I went cold, even though the temperature in the clinic had been set to steam bath.</p><p>\"Perfected how?\" Will asked. He was always the voice of reason. Thank God. Someone had to be.</p><p>\"My wolves look like wolves, without the human eyes to alert the hunters. And silver doesn't hurt them.\"</p><p>\"What does?\" I asked. Zachau merely laughed.</p><p>\"Your formula isn't all that perfect,\" Will pointed out. \"It makes people insane. Or were they insane to begin with?\"</p><p>Zachau stopped laughing. \"I'm still tweaking.\"</p><p>\"You didn't answer the question.\"</p><p>\"My subjects were not insane to start with, and they won't be insane once I'm finished with them.\"</p><p>Werewolves that couldn't be killed with silver or recognized as werewolves by their human eyes was bad. Once Zachau set them loose on the world, rather than keeping them in little white rooms, there'd be no stopping them.</p><p>Usually, I shot whatever confused me. But shooting Zachau would be murder and shooting the boxenwolves with silver wouldn't do a damn bit of good.</p><p>Now what?</p><p>\"Once the formula is tweaked to your satisfaction,\" Will said, \"what then?\" Will always had just the right question.</p><p>\"I'll become a boxenwolf myself, of course.\"</p><p>\"Of course,\" I repeated. \"Who wouldn't want to run around on all fours, wag their tail, drool a bit?\"</p><p>Zachau scowled. \"Who wouldn't want to be immortal?\"</p><p>\"You got big plans for eternity?\" I asked.</p><p>\"More than you could imagine.\"</p><p>I could imagine quite a bit.</p><p>\"Put down the guns,\" Zachau ordered.</p><p>Let's see . . . We had them; he didn't. \"No.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Zachau whistled and patients surged from the doorways. The ones closest to Will grabbed him, those closest to me did the same, then they divested us of our guns. They took my cell phone, too. I probably should have tested Zachau's statement that silver wouldn't kill them, but I discovered myself unable to shoot a defenseless crazy person in a hospital gown. Go figure.</p><p>\"It was so nice of you stop by,\" Zachau said. \"I was in need of help to perform my final tests.\"</p><p>\"Do your own dirty work.\"</p><p>\"I wasn't talking to you, Miss McQuade but to Mr. Cadotte. He's the perfect specimen for this experiment. Wolf clan, correct?\"</p> <p>Will didn't so much as blink.</p><p>\"How do you know so damn much?\" I demanded.</p><p>\"I make it my business to know. You think the two of you came here by accident? It was by design. My design.\"</p><p>\"That's impossible.\" The Jager-Suchers were sent out in a rotation available only to Elise. No one could have known that Will and I would catch this case.</p><p>\"Nothing is impossible,\" Zachau said. \"I've proven that with my boxenwolves.\"</p> <p>He had a point. The word impossible didn't mean as much as it used to.</p><p>\"Take them to the lab,\" Zachau ordered.</p><p>Two burly patients grabbed each of us under the arms and practically carried us a pristine white wall at the end of the hallway. Zachau joined us, placing his palm against a metal plate. The entire wall slid aside, revealing an elevator. Which explained why we'd never found the lab.</p><p>The guards shoved us inside, but they remained outside. Zachau joined us, and the wall slid closed. We began to descend. The doctor held our guns, one trained on each of us.</p><p>I settled back, gaze never leaving him. Zachau would slip up eventually. Mad scientists always did. I only hoped the mistake occurred before he performed his experiment on Will.</p><p>The door slid open, revealing a state of the art facility - lots of bells and whistles, computers, beakers, test tubes, microscopes. Who was funding this guy?</p> <p>In the corner stood a shiny silver cage. He flicked the barrel of a gun in its direction. Will and I stepped inside, and the door clanged shut behind us.</p><p>Zachau wasted no time, moving to a table, setting down the weapons so he could prepare a syringe, then returning. \"Give me your arm, Mr. Cadotte.\"</p><p>\"Leave him alone,\" I said, my voice impressively forceful though I felt anything but.</p><p>Zachau lifted a brow. \"You think I'd go to the trouble and expense of having the two of you sent here, capture you, then leave him alone just because you say so?\"</p><p>His words hinted at a traitor in the ranks. Wouldn't Edward be surprised? If we managed to stay alive, and non-furry, long enough to tell him.</p><p>\"It was a worth a shot.\" I kept my gaze on Zachau, but part of my attention remained on the guns that still lay on the table behind him. If I could grab the doctor, smack his head into the bars, then I just might be able to sweep those guns closer with my foot. They weren't that far away.</p><p>\"Shot,\" Zachau repeated. \"A very good word.\" He picked up my gun and pointed it at my head. \"Give me your arm or she dies.\"</p><p>Will presented his arm in a hurry.</p> <p>\"Move away, Ms. McQuade,\" Zachau continued. \"To the far side of the enclosure, please.\"</p><p>Hell. He seemed able to read my mind, or maybe it was just my face. I'd never been much good at hiding things.</p><p>Seeing no other way, I retreated until my back pressed against the outside wall that made up one-quarter of our prison.</p><p>\"What trouble did you go to?\" I asked. Maybe if I kept him talking, he'd make a mistake. Couldn't hurt. Besides, I was curious.</p><p>\"Hmm?\" Zachau murmured, tapping Will's arm as he searched for a vein.</p><p>I could tell by the tension in Will's body that he was waiting for an opening, too. Unfortunately the doctor appeared quite ambidextrous. He kept my gun aimed at me while holding the syringe in that hand as well. This left his other hand free to mess with Will's arm.</p><p>I had no doubt that if I made a quick movement, he would have no trouble plunging the syringe into Will's arm before I could get close enough to stop him. If Will moved in any way that annoyed the doctor, a bullet would be dispatched for me. I wanted to avoid both scenarios.</p><p>\"You said you went to a lot of trouble to get us here. I'd like to know what you did.\"</p><p>\"You must be as delusional as my boxenwolves if you think I'll tell you.\"</p><p>\"If you tell me, it'll go no farther than this room, since you plan to kill me when you're through.\"</p><p>\"Why would I do that?\" Zachau didn't bother to look at me, which only made me more certain I was right.</p><p>\"Because if you inject that shit into Will, you're dead the next instant.\"</p><p>\"Big talk for someone without a gun.\"</p><p>More than talk but Zachau would figure that out soon enough.</p><p>\"So tell me how you did it.\"</p><p>\"The usual way.\" He shrugged. \"I paid for the information.\"</p><p>\"No one in the Jager-Suchers would dare.\"</p><p>\"There's always a price if you can afford to pay it.\"</p><p>\"Who?\" I asked.</p><p>Zachau snorted, and I didn't bother to ask again. If he knew the name of the traitor, he wasn't going to share it with me now. Or ever.</p><p>From the curve of his lips, he'd found a likely vein. He prepared to plunge the needle into Will's arm, but he at last had too many balls in the air, or too many items in his hands. In the instant that he hesitated, trying to figure out how to aim the gun, steady Will's arm and depress the syringe, Will said my name.</p><p>He didn't shout, he didn't whisper just spoke that single word in a casual tone of voice. I hit the dirt; he grabbed the gun.</p><p>The weapon went off. A bullet whizzed past my temple, leaving a scorching path of pain in its wake before plowing into the wall, sending bits of cement raining down.</p><p>Will yanked the gun from Zachau's grip and tossed it in my direction, even as he plucked the syringe from the doctor's suddenly limp fingers. Will had always been quicker than the average human--another reason Mandenauer had tried to kill him. However there was nothing supernatural about his ability, just the result of hours practicing tai chi.</p><p>Before Zachau could run, Will yanked him close. \"You psychotic prick,\" Will snapped, and the fury in his voice shocked me. Will Cadotte was the calmest man I knew. He had to be to live with me.</p><p>My shock paralyzed both my body and my brain. I didn't see Will's next action coming until it was too late.</p><p>He plunged the needle into the doctor's arm. Zachau backed away, staring at the syringe.</p><p>Will ran to me, falling to his knees, helping me sit up. \"You're hurt. This looks bad.\"</p><p>\"What?\" I pushed him away, moving toward the front of the cage as the doctor twitched, shuddered and mumbled.</p><p>\"Jess, you're bleeding.\"</p><p>Absently I put my hand to my head. My fingers came away slick with blood. \"Oh.\" In all the excitement, I'd forgotten the sharp pain. \"Just a scratch. You know head wounds always look more serious than they are.\"</p><p>His lips tightened. \"I thought he'd killed you.\"</p><p>\"Well, he didn't, so get over it.\"</p><p>Together we stared at the doctor. \"You think he's going to become a wolf?\" I asked.</p><p>\"Might,\" Will answered. I picked up my gun. \"He said that wouldn't work on a boxenwolf.\"</p><p>\"Let's find out.\"</p><p>However Zachau did not shift; he only gibbered nonsense. For hours and hours. He came close enough once for Will to grab him, then I removed the key to our cage from his pocket. We called Edward; the Jager-Suchers arrived shortly thereafter for a clean up.</p><p>Zachau now resides in his own personal cage at Jager-Sucher headquarters. His patients are there too, along with all of his notes and potions. Elise hopes that someday she'll be able to decipher what he did to those people and himself. With luck she'll even be able to cure it.</p><p>As for Will and I, there was always another werewolf around the corner. At least we have job security.</p><p>And each other. </p> </body></html>"]