["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The night was black, the moon and stars blotted out by ominous swirling clouds gathering overhead. Threads of shiny black obsidian spun and whirled in a kind of fury, yet the wind was still. Small animals huddled in their dens, beneath rocks and fallen logs, scenting the mood of the land.</p><p>Mists floated eerily out of the forest, clinging to the tree trunks so that they seemed to rise up out the fog. Long, wide bands of shimmering white. Swirling prisms of glittering opaque colors. Gliding across the sky, weaving in and out of the overhead canopy, a large owl circled the great stone house built into the high cliffs. A second owl, then a third appeared, silently making lazy circles above the branches and the rambling house. A lone wolf, quite large, with a shaggy black coat and glittering eyes, loped out of the trees into the clearing.</p><p>Out of the darkness, on the balcony of the rock house, a figure glided forward, looking out into the night. He opened his arms wide in a welcoming gesture. At once the wind began to move, a soft, gentle breeze. Insects took up their nightly chorus. Branches swayed and danced. The mist thickened and shimmered, forming many figures in the eerie night. The owls settled, one on the ground, two on the balcony railing, shape-shifting as they did, the feathers melting into skin, wings expanding into arms. The wolf was contorting even as it leaped onto the porch, shifting easily on the run so that a man landed, solid and whole.</p><p>\"Welcome.\" The voice was beautiful, melodious, a sorcerer's weapon. Vladimir Dubrinsky, Prince of the Carpathian people, watched in sorrow as his loyal kindred materialized from the mist, from the raptors and wolves, into strong, handsome warriors. Fighters every one. Loyal men. True. Selfless. These were his volunteers. These were the men he was sending to their death. He was sentencing each of them to centuries of unbearable loneliness, of unrelenting bleakness. They would live out their long lives until each moment was beyond endurance. They would be far from home, far from their kin, far from the soothing, healing soil of their homeland. They would know no hope, have nothing but their honor to aid them in the coming centuries.</p> <p>His heart was so heavy, Vladimir thought it would break in two. Warmth seeped into the cold of his body, and he felt her stirring in his mind. Sarantha. His lifemate. Of course she would share this moment, his darkest hour, as he sent these young men to their horrendous fate.</p><p>They gathered around him, silent, their faces serious - good faces, handsome, sensual, strong. The unblinking, steady eyes of confident men, men who were tried and true, men who had seen hundreds of battles. So many of his best. The wrenching in Vladimir's body was physical, a fierce burning in his heart and soul. Deep. Pitiless. These men deserved so much more than the ugly life he must give them. He took a breath, let it out slowly. He had the great and terrible gift of precognition. He saw the desperate plight of his people. He had no real choice and could only trust in God to be merciful as he could not afford to.</p><p>\"I thank all of you. You have not been commanded but have come voluntarily, the guardians of our people. Each of you has made the choice to give up your chance at life to ensure that our people are safe, that other species in the world are safe. You humble me with your generosity, and I am honored to call you my brethren, my kin.\"</p><p>There was complete silence. The Prince's sorrow weighed like a stone in his heart, and, sharing his mind, the warriors caught a glimpse of the enormity of his pain. The wind moved gently through the crowd, ruffled hair with the touch of a father's hand, gently, lovingly, brushed a shoulder, an arm.</p><p>His voice, when it came again, was achingly beautiful. \"I have seen the fall of our people. Our women grow fewer. We do not know why female children are not born to our couples, but fewer are conceived than ever before, and even fewer live. It is becoming much more difficult to keep our children alive, male or female. The scarcity of our women has grown to crisis point. Our males are turning vampire, and the evil is spreading across the land faster than our hunters can keep up. Before, in lands far from us, the lycanthroscope and the Jaguar race were strong enough to keep these monsters under control, but their numbers have dwindled and they cannot stem the tide. Our world is changing, and we must meet the new problems head on.\"</p> <p>He stopped, once again looking over their faces. Loyalty and honor ran deep in their blood. He knew each of them by name, knew each of their strengths and weaknesses. They should have been the future of his species, but he was sending them to walk a solitary path of unrelenting hardship.</p><p>\"All of you must know these things I am about to tell you. Each of you weigh your decision one last time before you are assigned a land to guard. Where you are going there are none of our women. Your lives will consist of hunting and destroying the vampire in the lands where I send you. There will be none of your countrymen to aid you, to be companions, other than those I send with you. There will be no healing Carpathian soil to offer comfort when you are wounded in your battles. Each kill will bring you closer to the edge of the worst possible fate. The demon within will rage and fight you for control. You will be obliged to hang on as long as you are able, and then, before it is too late, before the demon finds and claims you, you must terminate your life. Plagues and hardships will sweep these lands, wars are inevitable, and I have seen my own death and the death of our women and children. The death of mortals and immortals alike.\"</p><p>That brought the first stirring among the men, a protest unspoken but rather of the mind, a collective objection that swept through their linked minds. Vladimir held up his hand. \"There will be much sorrow before our time is finished. Those coming after us will be without hope, without the knowledge, even, of what our world has been and what a lifemate is to us. Theirs will be a much more difficult existence. We must do all that we can to ensure that mortals and immortals alike are as safe as possible.\" His eyes moved over their faces, settled on two that looked alike.</p><p>Lucian and Gabriel. Twins. Children of his own second in command. Already they were working tirelessly to remove all that was evil from their world. \"I knew that you would volunteer. The danger to our homeland and our people is as great as the danger to the outside world. I must ask that you stay here where the fight will be brother against brother and friend against friend. Without you to guard our people, we will fall. You must stay here, in these lands, and guard our soil until such time as you perceive you are needed elsewhere.\"</p><p>Neither twin attempted to argue with the Prince. His word was law, and it was a measure of his people's respect and love that they obeyed him without question. Lucian and Gabriel exchanged one long look. If they spoke on their private mental path, they didn't share their thoughts with any other. They simply nodded their heads in unison, in agreement with their Prince's decision.</p><p>The Prince turned, his black eyes piercing, probing, searching the hearts and minds of his warriors. \"In the jungles and forests of far off lands the great Jaguar have begun to decline. The Jaguar are a powerful people with many gifts, great psychic talents, but they are solitary creatures. The men find and mate with the women then leave them and the young to fend for themselves. The Jaguar men are secretive, refusing to come out of the jungles and mingle with humans. They prefer that the superstitious revere them as deities. The women have naturally turned to those who would love them and care for them, see them as the treasures they are. They have, for some time, been mating with human men and living as humans. Their bloodlines have been weakened; fewer and fewer exist in their true form. Within a hundred years, perhaps two hundred, this race will cease to exist. They lose their women because they know not what is precious and important. We have lost ours through nature itself.\" The black eyes moved over a tall, handsome warrior, one whose father had fought beside the Prince for centuries and had died at the hands of a master vampire.</p> <p>The warrior was tall and straight with wide shoulders and flowing black hair. A true and relentless hunter, one of so many he would be sentencing to an ugly existence this night. This fighter had been proven many times over in battle, was loyal and unswerving in his duties. He would be one of the few sent out alone, while the others would go in groups or pairs to aid one another. Vlad sighed heavily and forced himself to give the orders. He leaned respectfully toward the warrior he was addressing, but spoke loudly enough for all to hear.</p><p>\"You will go to this land and rid the world of the monsters our males have chosen to become. You must avoid all confrontation with the Jaguar. Their species, as ours must, will either find a way to join the world or become extinct like so many others before us. You will not engage them in battle. Leave them to their own devices. Avoid the werewolf as best you can. They are, like us, struggling to survive in a changing world. I give you my blessing, the love and thanks of our people, and may God go with you into the night, into your new land. You must embrace this land, make it your own, make it your home.\"</p><p>\"After I have gone, my son will take my place. He will be young and inexperienced, and he will find it difficult to rule our people in troubled times. I will not tell him of those I have sent out into the world as guardians. He cannot rely on those much older than he. He must have complete faith in his ability to guide our people on his own. Remember who you are and what you are: guardians of our people. You stand, the last line of defense to keep innocent blood from being spilled.\"</p><p>Vladimir looked directly into the gaze of the young warrior. \"Do you take this task of your own free will? You must decide. None will think the less of any who wish to remain. The war here will also be long and difficult.\"</p><p>The warrior's eyes were steady on the Prince. Slowly he nodded acceptance of his fate. In that moment his life was changed for all time. He would live in a foreign land without the hope of love or family. Without emotion or color, without light to illuminate the unrelenting darkness. He would never know a lifemate, but would spend his entire existence hunting and destroying the undead. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Present Day</p><p>The streets were filthy and smelled of decay and waste. The dreary drizzle of rain could not possibly dispel the offensive odor. Trash littered the entrances to rundown, crumbling buildings. Ragged shelters of cardboard and tin were stacked in every alleyway, every conceivable place, tiny cubicles for bodies with nowhere else to go. Rats scurried through the garbage cans and gutters, prowled through the basements and walls. Falcon moved through the shadows silently, watchful, aware of the seething life in the underbelly of the city. This was where the dregs of humanity lived, the homeless, the drunks, the predators who preyed on the helpless and unwary. He knew that eyes were watching him as he made his way along the streets, slipping from shadow to shadow. They couldn't make him out, his body fluid, blending, a part of the night.</p><p>It was a scene that had been played out a thousand times, in a thousand places. He was weary of the predictability of human nature.</p><p>Falcon was making his way back to his homeland. For far too many centuries he had been utterly alone. He had grown in power, had grown in strength. The beast within him had grown in strength and power also, roaring for release continually, demanding blood. Demanding the kill. Demanding just once, for one moment, to feel.</p> <p>He wanted to go home, to feel the soil soak into his pores, to look upon the Prince of his people and know he had fulfilled his word of honor. Know that the sacrifices he had made had counted for something. He had heard the rumors of a new hope for his people.</p><p>Falcon accepted that it was too late for him, but he wanted to know, before his life was over, that there was hope for other males, that his life had counted for something. He wanted to see with his own eyes the Prince's lifemate, a human woman who had been successfully converted. He had seen too much death, too much evil. Before ending his existence, he needed to look upon something pure and good and see the reason he had battled for so many long centuries.</p><p>His eyes glittered with a strange red flame, shining in the night as he moved silently through the filthy streets. Falcon was uncertain whether he would make it back to his homeland, but he was determined to try. He had waited far too long, was already bordering on madness. He had little time left, for the darkness had nearly consumed his soul. He could feel the danger with every step he took. Not emanating from the dirty streets and shadowed buildings, but from deep within his own body.</p><p>He heard a sound, like the soft shuffle of feet. Falcon continued walking, praying as he did so for the salvation of his own soul. He had need of sustenance and he was at his most vulnerable. The beast was roaring with eagerness, claws barely sheathed. Within his mouth his fangs began to lengthen in anticipation. He was careful now to hunt among the guilty, not wanting innocent blood should he be unable to turn away from the dark call to his soul. The sound alerted him again, this time many soft feet, many whispering voices. A conspiracy of children. They came running toward him from the three-story hulk of a building, a swarm of them, rushing toward him like a plague of bees. They called out for food, for money.</p><p>The children surrounded him, a half dozen of them, all sizes, their tiny hands slipping under his cloak and cleverly into his pockets as they patted him, their voices pleading and begging. The young ones. Children. His species rarely could keep their sons and daughters alive beyond the first year. So few made it, and yet these children, as precious as they were, had no one to cherish them. Three were female with enormous, sad eyes. They wore torn, ragged clothing and had dirt smeared across bruised little faces. He could hear the fear in their pounding hearts as they begged for food, for money, for any little scrap. Each expected blows and rebuffs from him and was ready to dodge away at the first sign of aggression.</p> <p>Falcon patted a head gently and murmured a soft word of regret. He had no need of the wealth he had acquired during his long lifetime. This would have been the place for it, yet he had brought nothing with him. He slept in the ground and hunted live prey. He had no need of money where he was going. The children all seemed to be talking at once, an assault on his ears, when a low whistle stopped them abruptly. There was instant silence. The children whirled around and simply melted into the shadows, into the recesses of the dilapidated and condemned buildings as if they had never been.</p><p>The whistle was very low, very soft, yet he heard it clearly through the rain and darkness. It carried on the wind straight to his ears. The sound was intriguing. The tone seemed to be pitched just for him. A warning, perhaps, for the children, but for him it was a temptation, a seduction of his senses. It threw him, that soft little whistle. It intrigued him. It drew his attention as nothing had in the past several hundred years. He could almost see the notes dancing in the rain-wet air. The sound slipped past his guard and found its way into his body, like an arrow aimed straight for his heart.</p><p>Another noise intruded. This time it was the tread of boots. He knew what was coming now, the thugs of the street. The bullies who believed they owned the turf, and anyone who dared to walk in their territory had to pay a price. They were looking at the cut of his clothes, the fit of his silk shirt beneath the richly lined cape, and they were drawn into his trap just as he'd known they would be. It was always the same. In every land. Every city. Every decade. There were always the packs who ran together bent on destruction or wanting the right to take what did not belong to them. The incisors in his mouth once more began to lengthen.</p><p>His heart was beating faster than normal, a phenomenon that intrigued him. His heart was always the same, rock steady. He controlled it casually, easily, as he controlled every aspect of his body, but the racing of his heart now was unusual, and anything different was welcome. These men, taking their places to surround him, would not die at his hands this night. They would escape from the ultimate predator and his soul would remain intact because of two things: that soft whistle and his accelerated heartbeat.</p><p>An odd, misshapen figure emerged from a doorway straight in front of him. \"Run for it, mister.\" The voice was low, husky, the warning clear. The strange, lumpy shape immediately melted back and blended into some hidden cranny.</p><p>Falcon stopped walking. Everything in him went completely, utterly still. He had not seen color in nearly two thousand years, yet he was staring at an appalling shade of red paint peeling from the remnants of a building. It was impossible, not real. Perhaps he was losing his mind as well as his soul. No one had told him that a preliminary to losing his soul was to see in color. The undead would have bragged of such a feat. He took a step toward the building where the owner of that voice had disappeared.</p> <p>It was too late. The robbers were spreading out in a loose semicircle around him. They were large, many of them displaying weapons to intimidate. He saw the gleam of a knife, a long-handled club. They wanted him scared and ready to hand over his wallet. It wouldn't end there. He had witnessed this same scenario too many times not to know what to expect. Any other time he would have been a beast whirling in their midst, feeding on them until the aching hunger was assuaged. Tonight was different. It was nearly disorienting. Instead of seeing bland gray, Falcon could see them in vivid color, blue and purple shirts, one an atrocious orange.</p><p>Everything seemed vivid. His hearing was even more acute than usual. The dazzling raindrops were threads of glittering silver. Falcon inhaled the night, taking in the scents, separating each until he found the one he was looking for. That slight misshapen figure was not a male, but a female. And that woman had already changed his life for all time.</p><p>The men were close now, the leader calling out to him, \"Throw me your wallet.\" There was no pretending, no preliminary. They were going to get straight down to the business of robbing, of murdering. Falcon raised his head slowly until his fiery gaze met the leader's cocky stare. The man's smile faltered, then died. He could see the demon rising, the red flames flickering deep in the depths of Falcon's eyes.</p><p>Without warning, the misshapen figure was in front of Falcon, reaching for his hand, dragging at him. \"Run, you idiot, run now.\" She was tugging at his hand, attempting to drag him closer to the darkened buildings. Urgency. Fear. The fear was for him, for his safety. His heart turned over.</p><p>The voice was melodic, pitched to wrap itself around his heart. Need slammed into his body, into his soul. Deep and hard and urgent. It roared through his bloodstream with the force of a freight train. He couldn't see her face or her body, he had no idea what she looked like, or even her age, but his soul was crying out for hers.</p><p>\"You again.\" The leader of the street gang turned his attention away from the stranger and toward the woman. \"I told you to stay outa here!\" His voice was harsh and filled with threat. He took a menacing step toward her.</p><p>The last thing Falcon expected was for the woman to attack. \"Run,\" she hissed again and launched herself at the leader. She went in low and mean, sweeping his legs out from under him so that the man landed on his backside. She kicked him hard, using the edge of her foot to get rid of his knife. The man howled in pain when she connected with his wrist, and the knife went spinning out of his hand. She kicked the knife again, sending it skittering over the sidewalk into the gutter.</p><p>Then she was gone, running swiftly into the darkened alleyway, melting into the shadows. Her footfalls were light, almost inaudible even to Falcon's acute hearing. He didn't want to lose sight of her, but the rest of the men were closing in. The leader was swearing loudly, vowing to tear out the woman's heart, screaming at his friends to kill the tourist.</p> <p>Falcon waited silently for them to approach, swinging bats and lead pipes at him from several directions. He moved with preternatural speed, his hand catching a lead pipe, ripping it out of astonished hands, and deliberately bending it into a circle. It took no effort on his part and no more than a second. He draped it around the pipe wielder's head like a necklace. He shoved the man with casual strength, sent him flying against the wall of a building some ten feet away. The circle of attackers was more wary now, afraid to close in on him. Even the leader had gone silent, still clutching his injured hand.</p><p>Falcon was distracted, his mind on the mysterious woman who had risked her life to rescue him. He had no time for battle, and his hunger was gnawing at him. He let it find him, consume him, the beast rising so that the red haze was in his mind and the flames flickered hungrily in the depths of his eyes. He turned his head slowly and smiled, his fangs showing as he sprang. He heard the frenzied screams as if from a distance, felt the flailing of arms as he grabbed the first of his prey. It was almost too much trouble to wave his hand and command silence, to keep the group under control. Hearts were pounding out a frantic rhythm, beating so loudly the threat of heart attack was very real, yet he couldn't find the mercy in him to take the time to shield their minds.</p><p>He bent his head and drank deeply. The rush was fast and addictive, the adrenaline-laced blood giving him a kind of false high. He sensed he was in danger, that the darkness was enveloping him, but he couldn't seem to find the discipline to stop himself.</p><p>It was a small sound that alerted him, and that alone told him just how far gone he really was. He should have sensed her presence immediately. She had come back for him, come back to aid him. He looked at her, his black eyes moving over her face hungrily. Blazing with urgent need. Red flames flickering. Possession stamped there.</p><p>\"What are you?\" The woman's soft voice brought him back to the reality of what he was doing. She gasped in shock. She stood only feet from him, staring at him with large, haunted eyes. \"What are you?\" She asked it again, and this time the note of fear registered deep in his heart.</p><p>Falcon lifted his head, and a trickle of blood seeped down his prey's neck. He saw himself through her eyes. Fangs, wild hair, only red flames in his otherwise empty eyes. He looked a beast, a monster to her. He held out his hand, needing to touch her, to reassure her, to thank her for stopping him before it was too late.</p><p>Sara Marten stepped backward, shaking her head, her eyes on the blood running down Nordov's neck to stain his absurdly orange shirt. Then she whirled around and ran for her life. Ran as if a demon were hunting her. And he was. She knew it. The knowledge was locked deep within her soul. It wasn't the first time she had seen such a monster. Before, she had managed to elude the creature, but this time was very different. She had been inexplicably drawn to this one. She had gone back to be sure he got away from the night gang. She needed to see that he was safe. Something inside her demanded that she save him.</p><p>Sara raced through the darkened entryway into the abandoned apartment building. The walls were crumbling, the roof caving in. She knew every bolt hole, every escape hatch. She would need them all. Those black eyes had been empty, devoid of all feeling until the... thing... had looked at her. She recognized possession when she saw it. Desire. His eyes had leaped to life. Burning with an intensity she had never seen before. Burning for her as if he had marked her for himself. As his prey.</p><p>The children would be safe now, deep in the bowels of the sewer. Sara had to save herself if she was going to continue to be of any assistance to them. She jumped over a pile of rubble and ducked through a narrow opening that took her to a stairwell. She took the stairs two at a time, going up to the next story. There was a hole in the wall that enabled her to take a shortcut through two apartments, push through a broken door and out onto a balcony where she caught the lowest rung of the ladder and dragged it down.</p><p>Sara went up the rungs with the ease of much practice. She had scoped out a hundred escape routes before she had ever started working in the streets, knowing it would be an essential part of her life. Practicing running each route, shaving off seconds, a minute, finding shortcuts through the buildings and alleyways, Sara had learned the secret passageways of the underworld. Now she was up on the roof, running swiftly, not even pausing before launching herself onto the roof of the next building. She moved across that one and skirted around a pile of decaying matter to jump to a third roof.</p><p>She landed on her feet, already running for the stairs. She didn't bother with the ladder, but slid down the poles to the first story and ducked inside a broken window. A man lolling on a broken-down couch looked up from his drug-induced fog and stared at her. Sara waved as she hopped over his outstretched legs. She was forced to avoid two other bodies sprawled on the floor. Scrambling over them, she was out the door and running across the hall to the opposite apartment. The door was hanging on its hinges. She went through it fast, avoiding the occupants as she crossed the floor to the window.</p><p>Sara had to slow down to climb through the broken glass. The splintered remains caught at her clothes, so that she struggled a moment, her heart pounding and her lungs screaming for air. She was forced to use precious seconds to drag her jacket free. The splinters scraped across her hand, shearing off skin, but she thrust her way outside into the open air and the drizzling rain. She took a deep, calming breath, allowing the rain to run down her face, to cleanse the tiny beads of sweat from her skin.</p><p>Suddenly she went very still, every muscle locked, frozen. A terrible shiver went down her spine. He was on the move. Tracking her. She felt him moving, fast and unrelenting. She had left no trail through the buildings, she was fast and quiet, yet he wasn't even slowed down by the twists and turns. He was tracking her unerringly. She knew it. Somehow despite the unfamiliar terrain, the crumbling complex of shattered buildings, the small holes and shortcuts, he was on her trail. Unswerving, undeterred, and absolutely certain he would find her.</p><p>Sara tasted fear in her mouth. She had always managed to escape. This was no different. She had brains, skills; she knew the area and he didn't. She wiped her forehead grimly with the sleeve of her jacket, suddenly wondering if he could smell her in the midst of the decay and ruin. The thought was horrifying. She had seen what his kind could do. She had seen the broken, drained bodies, white and still, wearing a mask of horror.</p><p>Sara pushed the memories away, determined not to give in to fear and panic. That way lay disaster. She set off again, moving quickly, working harder at keeping her footfalls light, her breathing soft and controlled. She ran fast through a narrow corridor between two buildings, ducked around the corner, and slipped through a tear in the chain-link fence. Her jacket was bulky, and it took precious seconds to force her way through the small opening. Her pursuer was large. He'd never be able to make it through that space; he would have to go around the entire complex.</p><p>She ran into the street, racing now with long, open strides, arms pumping, heart beating loudly, wildly. Aching. She didn't understand why she should feel such grief welling up, but it was there all the same.</p><p>The narrow, ugly streets widened until she was on the fringes of normal society. She was still in the older part of the city. She didn't slow down, but cut through parking lots, ducked around stores, and made her way unerringly uptown. Modern buildings loomed large, stretching into the night sky. Her lungs were burning, forcing her to slow to a jog. She was safe now. The lights of the city were beginning to appear, bright and welcoming. There was more traffic as she neared the residential areas. She continued jogging on her path.</p><p>The terrible tension was beginning to leave her body now, so that she could think, could go over the details of what she had seen. Not his face; it had been in the shadows. Everything about him had seemed shadowed and vague. Except his eyes. Those black, flame-filled eyes. He was very dangerous, and he had looked at her. Marked her. Desired her in some way. She could hear her own footsteps beating out a rhythm to match the pounding of her heart as she hurried through the streets, fear beating at her. From somewhere came the impression of a call, a wild yearning, an aching promise, turbulent and primitive so that it seemed to match the frantic drumbeat of her heart. It came, not from outside herself but rather from within; not even from inside her head but welling up from her very soul.</p><p>Sara forced her body to continue forward, moving through the streets and parking lots, through the twists and turns of familiar neighborhoods until she reached her own house. It was a small cottage, nestled back away from the rest of the homes, shrouded with large bushes and trees that gave her a semblance of privacy in the populous city. Sara opened her door with shaking hands and staggered inside.</p><p>She dropped her soggy jacket on the entryway floor. She had sewn several bulky pillows into the overlarge jacket so that it would be impossible to tell what she looked like. Her hair was pressed tight on her head, hidden beneath her misshapen hat. She flung the hairpins carelessly onto the countertop as she hurried to her bathroom. She was shaking uncontrollably; her legs were nearly unable to hold her up.</p><p>Sara tore off her wet, sweaty clothes and turned on the hot water full blast. She sat in the shower stall, hugging herself, trying to wipe away the memories she had blocked from her mind for so many years. She had been a teenager when she had first encountered the monster. She had looked at him, and he had seen her. She had been the one to draw that beast to her family. She was responsible, and she would never be able to absolve herself of the terrible weight of her guilt.</p><p>Sara could feel the tears on her face, mingling with the water pouring over her body. It was wrong to cower in the shower like a child. She knew it did no good. Someone had to face the monsters of the world and do something about them. It was a luxury to sit and cry, to wallow in her own self-pity and fear. She owed her family more than that, much more. Back then, she had hidden like the child she was, listening to the screams, the pleas, seeing the blood seeping under the door, and still she hadn't gone out to face the monster. She had hidden herself, pressing her hands to her ears, but she could never block out the sounds. She would hear them for eternity.</p><p>Slowly she forced her muscles under control, forced them to work once again, to support her weight as she drew herself reluctantly to her feet. She washed the fear from her body along with the sweat from running. It felt as if she had been running most of her life. She lived in the shadows, knew the darkness well. Sara shampooed her thick hair, running her fingers through the strands in an attempt to untangle them. The hot water was helping her overcome her weakness. She waited until she could breathe again before she stepped out of the stall to wrap a thick towel around herself.</p><p>She stared at herself in the mirror. She was all enormous eyes. So dark a blue they were violet as if two vivid pansies had been pressed into her face. Her hand was throbbing, and she looked at it with surprise. The skin was shredded from the top of her hand to her wrist; just looking at it made it sting. She wrapped it in a towel and padded barefoot into her bedroom. Dragging on drawstring pants and a tank top, she made her way to the kitchen and prepared a cup of tea.</p><p>The age-old ritual allowed a semblance of peace to seep into her world again and make it right. She was alive. She was breathing. There were still the children who needed her desperately, and the plans she had been making for so long. She was almost through the red tape, almost able to realize her dream. Monsters were everywhere, in every country, every city, every walk of life. She lived among the rich, and she found the monsters there. She walked among the poor, and they were there. She knew that now. She could live with the knowledge, but she was determined to save the ones she could.</p><p>Sara raked a hand through her cap of thick chestnut hair, spiking the ends, wanting it to dry. With her teacup in hand, she wandered back outside onto her tiny porch, to sit in the swing, a luxury she couldn't pass up. The sound of the rain was reassuring, the breeze on her face welcome. She sipped the tea cautiously, allowing the stillness in her to overcome the pounding fear, to retake each of her memories, solidly closing the doors on them one by one. She had learned there were some things best left alone, memories that need never be looked at again.</p><p>She stared absently out into the dazzling rain. The drops fell softly, melodically onto the leaves of the bushes and shimmered silver in the night air. The sound of water had always been soothing to her. She loved the ocean, lakes, rivers, anywhere there was a body of water. The rain softened the noises of the streets, lessened the harsh sounds of traffic, creating the illusion of being far away from the heart of the city. Illusions like that kept her sane.</p><p>Sara sighed and set her teacup on the edge of the porch, rising to pace across its small confines. She would never sleep this night; she knew she would sit in her swing, wrapped in a blanket, and watch the night fade to dawn. Her family was too close, despite the careful closing off of her memories. They were ghosts, haunting her world. She would give them this night and allow them to fade.</p><p>Sara stared out into the night, into the darker shadows of the trees. The images captured in those gray spaces always intrigued her. When the shadows merged, what was there? She stared at the wavering shadows and suddenly stiffened. There was someone - no, something in those shadows, gray, like the darkness, watching her. Motionless. Completely still. She saw the eyes then. Unblinking. Relentless. Black with bright red flames. Those eyes were fixed on her, marking her.</p><p>Sara whirled around, springing for the door, her heart nearly stopping. The thing moved with incredible speed, landing on the porch before she could even touch the door. The distance separating them had been nearly forty feet, but he was that fast, managing to seize her with his strong hands. Sara felt the breath slam out of her as her body impacted with his. Without hesitating, she brought her fist up into his throat, jabbing hard as she stepped back to kick his kneecap. Only she didn't connect. Her fist went harmlessly by his head, and he dragged her against him, easily pinning both of her wrists in one large hand. He smelled wild, dangerous, and his body was as hard as a tree trunk.</p><p>Her attacker thrust open the door to her home, her sanctuary, and dragged her inside, kicking the door closed to prevent discovery. Sara fought wildly, kicking and bucking, despite the fact that he held her nearly helpless. He was stronger than anyone she had ever encountered. She had the hopeless feeling that he was barely aware of her struggles. She was losing her strength fast, her breath coming in sobs. It was painful to fight him; her body felt battered and bruised. He made a sound of impatience and simply took her to the floor. His body trapped hers beneath it, holding her still with enormous strength, so that she was left staring up into the face of a devil... or an angel. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sara went perfectly still beneath him, staring up into that face. For one long moment time stopped. The terror receded slowly, to be replaced by haunted wonder. \"I know you,\" she whispered in amazement.</p><p>She twisted her wrist almost absently, gently, asking for release. Falcon allowed her hands to slip free of his grip. She touched his face tentatively with two fingertips. An artist's careful stroke. She moved her fingers over his face as if she were blind and the memory of him was etched into her soul rather than in her sight.</p><p>There were tears swimming in her eyes, tangling on her long lashes. Her breath caught in her throat. Her trembling hands went to his hair, tunneled through the dark thickness, lovingly, tenderly. She held the silken strands in her fists, bunching the heavy fall of hair in her hands. \"I know you. I do.\" Her voice was a soft measure of complete wonder.</p><p>She did know him, every angle and plane of his features. Those black, haunting eyes, the wealth of blue-black hair falling to his shoulders. He had been her only companion since she was fifteen. Every night she slept with him, every day she carried him with her. His face, his words. She knew his soul as intimately as she knew her own.</p> <p>She knew him. Dark angel. Her dark dream.</p><p>She knew his beautiful, haunting words, which revealed a soul naked and vulnerable, and so achingly alone.</p><p>Falcon was completely enthralled, caught by the love in her eyes, the sheer intensity of it. She glowed with happiness she didn't even try to hide from him. Her body had gone from wild struggling to complete stillness. But now there was a subtle difference. She was wholly feminine, soft and inviting. Each stroke of her fingertips over his face sent curling heat straight to his soul.</p><p>Just as quickly her expression changed to confusion, to fright. To guilt. Along with sheer terror he could sense determination. Falcon felt the buildup of aggression in her body and caught her hands before she could hurt herself. He leaned close to her, capturing her gaze with his own. \"Be calm; we will sort this out. I know I frightened you, and for that I apologize.\" Deliberately he lowered his voice so that it was a soft, rich tapestry of notes designed to soothe, to lull, to ensnare. \"You cannot win a battle of strength between us, so do not waste your energy.\" His head lowered further so that he rested, for one brief moment, his brow against hers. \"Listen to the sound of my heart beating. Let your heart follow the lead of mine.\"</p><p>His voice was one of unparalleled beauty. She found she wanted to succumb to his dark power. His grip was extraordinarily gentle, tender even; he held her with exquisite care. Her awareness of his enormous strength, combined with his gentleness, sent strange flames licking along her skin. She was trapped for all time in the fathomless depths of his eyes. There was no end there, just a free fall she couldn't pull out of. Her heart did follow his, slowing until it was beating with the exact same rhythm.</p> <p>Sara had a will of iron, honed in the fires of trauma, and yet she couldn't pull free of that dark, hypnotic gaze, even though a part of her recognized she was under an unnatural black-magic spell. Her body trembled slightly as he lifted his head, as he brought her hand to his eye level to inspect the shredded skin. \"Allow me to heal this for you,\" he said softly. His accent gave his voice a sensual twist she seemed to feel right down to her toes. \"I knew you had injured yourself in your flight.\" He had smelled the scent of her blood in the night air. It had called to him, beckoned him through the darkness like the brightest of beacons.</p><p>His black eyes burning into hers, Falcon slowly brought Sara's hand to the warmth of his mouth. At the first touch of his breath on her skin, Sara's eyes widened in shock. Warmth. Heat. It was sensual intimacy beyond her experience, and all he had done was breathe on her. His tongue stroked a healing, soothing caress along the back of her hand. Black velvet, moist and sensual. Her entire body clenched, went liquid beneath him. Her breath caught in her throat. To her utter astonishment, the stinging disappeared as rough velvet trailed along each laceration to leave a tingling awareness behind. The black eyes drifted over her face, intense, burning.</p><p>Intimate.</p><p>\"Better?\" he asked softly.</p><p>Sara stared at him helplessly for an eternity, lost in his eyes. She forced air through her lungs and nodded her head slowly. \"Please let me up.\"</p><p>Falcon shifted his body almost reluctantly, easing his weight from hers, retaining possession of her wrist so he could pull her to her feet in one smooth, effortless tug as he rose fluidly. Sara had planned out each move in her head, clearly and concisely. Her free hand swept up the knife hidden in the pocket of her sodden jacket, which lay beside her. As he lifted her, she jack-knifed, catching his legs between hers in a scissors motion, rolling to bring him down and beneath her. He continued the roll, once more on top. She tried to plunge the knife straight through his heart, but every cell in her body was shrieking a protest and her muscles refused to obey. Sara determinedly closed her eyes. She could not look at his beloved face when she destroyed him. But she would destroy him.</p> <p>His hand gripped hers, prevented all movement. They were frozen together, his leg carelessly pinning her thighs to the floor. Sara was in a far more precarious position than before, this time with the knife between them. \"Open your eyes,\" he commanded softly.</p><p>His voice melted her body so it was soft and yielding like honey. She wanted to cry out a protest. His voice matched his angel face, hiding the demon in him. Stubbornly she shook her head. \"I won't see you like that.\"</p><p>\"How do you see me?\" He asked it curiously. \"How do you know my face?\" He knew her. Her heart. Her soul. He had known nothing of her face or her body. Not even her mind. He had done her the courtesy of not invading her thoughts, but if she persisted in trying to kill him, he would have no choice.</p><p>\"You're a monster without equal. I've seen your kind, and I won't be fooled by the face you've chosen to wear. It's an illusion like everything else about you.\" She kept her eyes squeezed tight. She couldn't bear to be lost in his black gaze again. She couldn't bear to look upon the face she had loved for so long. \"If you are going to kill me, just do it; get it over with.\" There was resignation in her voice.</p><p>\"Why do you think I would want to harm you?\" His fingers moved gently around her hand. \"Let go of the knife, piccola.</p><p>I cannot have you hurting yourself in any way. You cannot fight me; there is no way to do so. What is between us is inevitable. Let go of the weapon, be calm, and let us sort this out.\"</p><p>Sara slowly allowed her fingers to open. She didn't want the knife anyway. She already knew she could never plunge it into his heart. Her mind might have been willing but her heart would never allow such an atrocity. Her unwillingness made no sense. She had so carefully prepared for just such a moment, but the monster wore the face of her dark angel.</p><p>How could she ever have prepared for such an unlikely event?</p> <p>\"What is your name?\" Falcon removed the knife from her trembling fingers, snapped the blade easily with pressure from his thumb, and tossed it across the room. His palm slid over her hand with a gentle stroke to ease the tension from her.</p><p>\"Sara. Sara Marten.\" She steeled herself to look into his beautiful face. The face of a man perfectly sculpted by time and honor and integrity. A mask unsurpassed in artistic beauty.</p><p>\"I am called Falcon.\"</p><p>Her eyes flew open at his revelation. She recognized his name.</p><p>I am Falcon and I will never know you, but I have left this gift behind for you, a gift of the heart.</p><p>She shook her head in agitation. \"That can't be.\" Her eyes searched his face, tears glittering in them again. \"That can't be,\" she repeated. \"Am I losing my mind?\" It was possible, perhaps even inevitable. She hadn't considered such a possibility.</p><p>His hands framed her face. \"You believe me to be the undead. The vampire. You have seen such a creature.\" He made it a statement, a raw fact. Of course she had. She would never have attacked him otherwise. He felt the sudden thud of his heart, fear rising to terror. In all his centuries of existence, he had never known such an emotion before. She had been alone, unprotected, and she had met the most evil of all creatures, nosferatu.</p><p>She nodded slowly, watching him carefully. \"I have escaped him many times. I nearly managed to kill him once.\"</p><p>Sara felt his great body tremble at her words. \"You tried such a thing? The vampire is one of the most dangerous creatures on the face of this earth.\" There was a wealth of reprimand in his voice. \"Perhaps you should tell me the entire story.\"</p><p>Sara blinked at him. \"I want to get up.\" She felt very vulnerable lying pinned to the floor beneath him, at a great disadvantage looking up into his beloved face.</p><p>He sighed softly. \"Sara.\" Just the way he said her name curled her toes. He breathed the syllables. Whispered it between exasperated indulgence and purring warning. Made it sound silky and scented and sexy. Everything that she was not. \"I do not want to have to restrain you again. It frightens you, and I do not wish to continue to see such fear in your beautiful eyes when you look upon me.\" He wanted to see that loving, tender look, that helpless wonder spilling from her bright gaze as it had when she first recognized his face.</p><p>\"Please, I want to know what's going on. I'm not going to do anything.\" Sara wished she didn't sound so apologetic. She was lying on the floor of her home with a perfect stranger pinning her down, a stranger she had seen drinking the blood of a human being. A rotten human being, but still... drinking blood.</p><p>She had seen the evidence with her own eyes. How could he explain that away?</p><p>Falcon stood up, his body poetry in motion. Sara had to admire the smooth, easy way he moved, a casual rippling of muscles. Once again she was standing, her body in the shadow of his, close, so that she could feel his body heat. The air vibrated with his power. His fingers were wrapped loosely, like a bracelet, around her wrist, giving her no opportunity to escape.</p><p>Sara moved delicately away from him, needing a small space to herself. To think. To breathe. To be Sara and not part of a Dark Dream. Her Dark Dream.</p><p>\"Tell me how you met the vampire.\" He said the words calmly, but the menace in his voice sent a shiver down her spine.</p><p>Sara did not want to face those memories. \"I don't know if I can tell you,\" she said truthfully and tilted her head to look into his eyes.</p><p>At once his gaze locked with hers, and she felt that curious falling sensation again. Comfort. Security. Protection from the howling ghosts of her past.</p><p>His fingers tightened around her wrist, gently, almost a caress, his thumb sliding tenderly over her sensitive skin. He tugged her back to him with the same gentleness that often seemed to accompany his movements. He moved slowly, as if afraid to frighten her.</p><p>As if he knew her reluctance, and what he was asking of her. \"I do not wish to intrude, but if it will be easier, I can read the memories in your mind without your having to speak of them aloud.\"</p><p>There was only the sound of the rain on the roof. The tears in her mind. The screams of her mother and father and brother echoing in her ears. Sara stood rigid, in shock, her face white and still. Her eyes were larger than ever, two shimmering violet jewels, wide and frightened. She swallowed twice and resolutely pulled her gaze from his to look at his broad chest. \"My parents were professors at the university. In the summer, they would always go to some exotic, fantastically named place, to a dig. I was fifteen; it sounded very romantic.\" Her voice was low, a complete monotone. \"I begged to go, and they took my brother Robert and me with them.\" Guilt. Grief. It swamped her.</p><p>She was silent a long time, so long he thought she might not be able to continue. Sara didn't take her gaze from his chest. She recited the words as if she'd memorized them from a textbook, a classic horror story. \"I loved it, of course. It was everything I expected it to be and more. My brother and I could explore to our hearts' content and we went everywhere. Even down into the tunnels our parents had forbidden to us. We were determined to find our own treasure.\" Robert had dreamed of golden chalices. But something else had called to Sara. Called and beckoned, thudded in her heart until she was obsessed.</p><p>Falcon felt the fine tremor that ran through her body and instinctively drew her closer to him, so that the heat of his body seeped into the cold of hers. His hand went to the nape of her neck, his fingers soothing the tension in her muscles. \"You do not have to continue, Sara. This is too distressing for you.\"</p><p>She shook her head. \"I found the box, you see. I knew it was there. A beautiful, hand-carved box wrapped in carefully cured skins. Inside was a diary.\" She lifted her face then, to lock her eyes with his. To judge his reaction.</p><p>His black eyes drifted possessively over her face. Devoured her.</p><p>Lifemate.</p><p>The word swirled in the air between them. From his mind to hers. It was burned into their minds for all eternity.</p><p>\"It was yours, wasn't it?\" She made it a soft accusation. She continued to stare at him until faint color crept up her neck and flushed her cheeks. \"But it can't be. That box, that diary, is at least fifteen hundred years old. More. It was checked out and authenticated. If that was yours, if you wrote the diary, than you would have to be...\" She trailed off, shaking her head. \"It can't be.\" She rubbed at her throbbing temples. \"It can't be,\" she whispered again.</p><p>\"Listen to my heartbeat, Sara. Listen to the breath going in and out of my lungs. Your body recognizes mine. You are my true lifemate.\"</p><p>For my beloved lifemate, my heart and my soul. This is my gift to you.</p><p>She closed her eyes for a moment. How many times had she read those words?</p><p>She wouldn't faint. She stood swaying in front of him, his fingers, a bracelet around her wrist, holding them together. \"You are telling me you wrote the diary.\"</p><p>He drew her even closer until her body rested against his. She didn't seem to notice he was holding her up. \"Tell me about the vampire.\"</p><p>She shook her head, yet she obeyed. \"He was there one night after I found the box. I was translating the diary, the scrolls and scrolls of letters, and I felt him there. I couldn't see anything, but it was there, a presence. Wholly evil. I thought it was the curse. The workmen had been muttering about curses and how so many men died digging up what was best left alone. They had found a man dead in the tunnel the night before, drained of blood. I heard the workers tell my father it had been so for many years. When things were taken from the digs, it would come. In the night. And that night, I knew it was there. I ran into my father's room, but the room was empty, so I went to the tunnels to find him, to warn him. I saw it then. It was killing another worker. And it looked up and saw me.\"</p><p>Sara choked back a sob and pressed her fingertips harder into her temples. \"I felt him in my head, telling me to come to him. His voice was terrible, gravelly, and I knew he would hunt me. I didn't know why, but I knew it wasn't over. I ran. I was lucky; workmen began pouring into the tunnels, and I escaped in all the confusion. My father took us into the city. We stayed there for two days before it found us. It came at night. I was in the laundry closet, still trying to translate the diary with a flashlight. I felt him. I felt him and knew he had come for me. I hid. Instead of warning my father, I hid there in a pile of blankets. Then I heard my parents and brother screaming, and I hid with my hands pressed over my ears. He was whispering to me to come to him. I thought if I went he might not kill them. But I couldn't move. I couldn't move, not even when blood ran under the door. It was black in the night, not red.\"</p><p>Falcon's arms folded her close, held her tightly. He could feel the grief radiating from her, a guilt too terrible to be borne. Tears locked forever in her heart and mind. A child witnessing the brutal killing of her family by a monster unsurpassed in evil. His lips brushed a single caress onto her thick cap of sable hair. \"I am not vampire, Sara. I am a hunter, a destroyer of the undead. I have spent several lifetimes far from my homeland and my people, seeking just such creatures. I am not the vampire who destroyed your family.\"</p><p>\"How do I know what you are or aren't? I saw you take that man's blood.\" She pulled away from him in a quick, restless movement, wholly feminine.</p><p>\"I did not kill him,\" he answered simply. \"The vampire kills his prey. I do not.\"</p><p>Sara raked a trembling hand through the short spikes of her silky hair. She felt completely drained. She paced restlessly across the room to her small kitchen and poured herself another cup of tea. Falcon filled her home with his presence. It was difficult to keep from staring at him. She watched him move through her home, touching her things with reverent fingers. He glided silently, almost as if he floated inches above the floor. She knew the moment he discovered it. She padded into the bedroom to lean her hip against the doorway, just watching him as she sipped her tea. It warmed her insides and helped to stop her shivering.</p><p>\"Do you like it?\" There was a sudden shyness in her voice.</p><p>Falcon stared at the small table beside the bed where a beautifully sculpted bust of his own face stared at him. Every detail. Every line. His dark, hooded eyes, the long fall of his hair. His strong jaw and patrician nose. It was more than the fact that she had gotten every single detail perfect, it was how she saw him. Noble. Old World. Through the eyes of love. \"You did this?\" He could barely manage to get the words past the strange lump blocking his throat.</p><p>My Dark Angel, lifemate to Sara.</p><p>The inscription was in fine calligraphy, each letter a stroke of art, a caress of love, every bit as beautiful as the bust.</p><p>\"Yes.\" She continued to watch him closely, pleased with his reaction. \"I did it from memory. When I touch things, old things in particular, I can sometimes connect with events or things from the past that linger in the object. It sounds weird.\" She shrugged her shoulders. \"I can't explain how it happens, it just does. When I touched the diary, I knew it was meant for me. Not just anyone, not any other woman. It was written for me. When I translated the words from an ancient language, I could see a face. There was a desk, a small wooden one, and a man sat there and wrote. He turned and looked at me with such loneliness in his eyes, I knew I had to find him. His pain could hardly be borne, that terrible black emptiness. I see that same loneliness in your eyes. It is your face I saw. Your eyes. I understand emptiness.\"</p><p>\"Then you know you are my other half.\" The words were spoken in a low voice, made husky by Falcon's attempt to keep unfamiliar emotions under control. His eyes met hers across the room. One of his hands rested on the top of the bust, his fingers finding the exact groove in a wave of the hair that she had caressed thousands of times.</p><p>Once again, Sara had the curious sensation of falling into the depths of his eyes. There was such an intimacy about his touching her familiar things. It had been nearly fifteen years since she had really been close to another person. She was hunted, and she never forgot it for a single moment. Anyone close to her would be in danger. She lived alone, changed her address often, traveled frequently, and continually changed her patterns of behavior. But the monster had followed her. Twice, when she had read of a serial killer stalking a city she was in, she had actively hunted the beast, determined to rid herself of her enemy, but she had never managed to find his lair.</p><p>She could talk to no one of her encounter; no one would believe her. It was widely believed that a madman had murdered her family. And the local workers had been convinced it was the curse. Sara had inherited her parents' estate, a considerable fortune, so she had been lucky enough to travel extensively, always staying one step ahead of her pursuer.</p><p>\"Sara.\" Falcon said her name softly, bringing her back to him.</p><p>The rain pounded on the roof now. The wind slammed into the windows, whistling loudly as if in warning. Sara raised the teacup to her lips and drank, her eyes still locked with his. Carefully she placed the cup in the saucer and set it on a table. \"How is it you can exist for so long a time?\"</p><p>Falcon noticed she was keeping a certain distance from him, noticed her pale skin and trembling mouth. She had a beautiful mouth, but she was at the breaking point and he didn't dare think about her mouth, or the lush curves of her body. She needed him desperately, and he was determined to push aside the clawing, roaring beast and provide her with solace and peace. With protection.</p><p>\"Our species have existed since the beginning of time, although we grow close to extinction. We have great gifts. We are able to control storms, to shape-shift, to soar as great winged owls and run with our brethren, the wolves. Our longevity is both gift and curse. It is not easy to watch the passing of mortals, of ages. It is a terrible thing to live without hope, in a black endless void.\"</p><p>Sara heard the words and did her best to comprehend what he was saying. Soar as great winged owls. She would love to fly high above the earth and be free of the weight of her guilt. She rubbed her temple again, frowning in concentration. \"Why do you take blood if you are not a vampire?\"</p><p>\"You have a headache.\" He said it as if it were his most important concern. \"Allow me to help you.\"</p><p>Sara blinked and he was standing close to her, his body heat immediately sweeping over her cold skin. She could feel the arc of electricity jumping from his body to hers. The chemistry between them was so strong it terrified her. She thought of moving away, but he was already reaching for her. His hands framed her face, his fingers caressing, gentle. Her heart turned over, a funny somersault that left her breathless. His fingertips moved to her temples.</p><p>His touch was soothing, yet sent heat curling low and wicked, making butterfly wings flutter in the pit of her stomach. She felt his stillness, his breath moving through his body, through her body. She waited in an agony of suspense, waited while his hands moved over her face, his thumb caressing her full lower lip. She felt him then, his presence in her mind, sharing her brain, her thoughts, the horror of her memories, her guilt... Sara gave a small cry of protest, jerked away from him, not wanting him to see the stains forever blotting her soul.</p><p>\"Sara, no.\" He said it softly, his hands refusing to relinquish her. \"I am the darkness and you are the light. You did nothing wrong. You could not have saved your family; he would have murdered them in front of you.\"</p><p>\"I should have died with them instead of cowering in a closet.\" She blurted out her confession, the truth of her terrible sin.</p><p>\"He would not have killed you.\" He said the words very softly, his voice pitched low so that it moved over her skin like a velvet caress. \"Remain quiet for just a moment and allow me to take away your headache.\"</p><p>She stayed very still, curious as to what would happen, afraid for her sanity. She had seen him drink blood, his fangs in the neck of a man, the flames of hell burning in the depths of his eyes, yet when he touched her, she felt as if she belonged to him. She wanted to belong to him. Every cell in her body cried out for him. Needed him.</p><p>Beloved Dark Angel.</p><p>Was he the angel of death coming to claim her? She was ready to go with him, she would go, but she wanted to complete her plans. Leave something good behind, something decent and right.</p><p>She heard words, an ancient tongue chanting far away in her mind. Beautiful, lilting words as old as time. Words of power and peace. Inside her head, not from outside herself. His voice was soft and misty like the early morning, and somehow the healing chant made her headache float away on a passing cloud.</p><p>Sara reached up to touch his face, his beloved familiar face. \"I'm so afraid you aren't real,\" she confessed.</p><p>Falcon. Lifemate to Sara.</p><p>Falcon's heart turned over, melted completely. He pulled her close to his body, gently so as not to frighten her. He trembled with his need of her, as he framed her face with his hands, holding her still while he slowly bent his dark head toward hers. She was lost in the fathomless depths of his eyes. The burning desire. The intensity of need. The aching loneliness.</p><p>Sara closed her eyes right before his mouth took possession of hers. And the earth moved beneath her feet. Her heart thudded out a rhythm of fear. She was lost for eternity in that dark embrace. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Falcon pulled her closer still, until every muscle of his body was imprinted on the softness of hers. His mouth moved over hers, hot silk, while molten lava flowed through her bloodstream. The entire universe shifted and moved, and Sara gave herself up completely to his seeking kiss. Her body melted, soft and pliant, instantly belonging to him.</p><p>His mouth was addictive. Sara made her own demands, her arms creeping up around his neck to cradle him close. She wanted to feel him, his body strong and hard pressed tightly to hers. Real, not an elusive dream. She couldn't get enough of his mouth, hot and needy and so hungry for her. Sara didn't think of herself as being a sensual person, but with him she had no inhibitions. She moved her body restlessly against his, wanting him to touch her, needing him to touch her.</p><p>There was a strange roaring in her ears. She knew no thoughts, only the feel of his hard body against hers, only the sheer pleasure of his mouth taking possession of her so urgently. She gave herself up completely to the sensations of heat and flame. The rush of liquid fire running in her veins, pooling low in her body.</p><p>He shifted her closer, his mouth retaining possession, his tongue dueling with hers as his hand cupped her breast, his thumb stroking her nipple through the thin material of her shirt. Sara gasped at the exquisite pleasure. She hadn't expected company and she wore nothing beneath the little tank top. His thumb nudged a strap from her shoulder, a simple thing, but wickedly sexy.</p> <p>His mouth left hers to blaze a path of fire along her neck. His tongue swirled over her pulse. She heard her own soft cry of need mingle with his groan of pleasure. Teeth scraped gently, erotically, over her pulse, back and forth while her body went up in flames and every cell cried out for his possession. His teeth nipped, his tongue eased the ache. His arms were hard bands, trapping her close so that she could feel the heavy thickness of him, an urgent demand, tight against her.</p><p>A shudder shook Falcon's body. Something dark and dangerous raised its head. His needs were swamping him, edging out his implacable control. The beast roared and demanded its lifemate. The scent of her washed away every semblance of civilization so that for one moment he was pure animal, every instinct alive and darkly primitive.</p><p>Sara sensed the change in him instantly, sensed the danger as his teeth touched her skin. The sensation was erotic, the need in her nearly as great as the need in him.</p><p>Fraternizing with the enemy.</p><p>The words came out of nowhere. With a low cry of self-recrimination, Sara dragged herself out of his arms. She had seen him take blood, his fangs buried deep in a human neck. It didn't matter how familiar he looked; he wasn't human, and he was very, very dangerous.</p> <p>Falcon allowed her to move away from him. He watched her carefully as he struggled for control. His fangs receded in his mouth, but his body was a hard, unrelenting ache. \"If I planned on harming you, Sara, why would I wait? You are the safest human being on the face of this planet, because you are the one I would give my life to protect.\"</p><p>I am Falcon and I will never know you, but I have left this gift behind for you, a gift of the heart.</p><p>Sara closed her eyes tightly, pressed a hand to her trembling mouth. She could taste him, feel him; she wanted him. How could she be such a traitor to her family? The ghosts in her mind wailed loudly, condemning her. Their condemnation didn't stop her body from throbbing with need, or stop the heat moving through her blood like molten lava.</p><p>\"I felt you,\" she accused, the tremors running through her body a result of his lethal kiss more than fear of his lethal fangs. She had almost wanted him to pierce her. For one moment her heart had been still as if it had waited all eternity for something only he could give her. \"You were so close to taking my blood.\"</p><p>\"But I am not human, Sara,\" he replied softly, gently, his dark eyes holding a thousand secrets. His head was unbowed, unshamed by his dark cravings. He was a strong, powerful being, a man of honor. \"Taking blood is natural to me, and you are my other half. I am sorry I frightened you. You would have found it erotic, not distasteful, and you would not have come to any harm.\"</p><p>She hadn't been afraid of him. She had been afraid of herself. Afraid she would want him so much the wails of her family would fade from her mind and she would never find a way to bring their killer to justice. Afraid the monster would find a way to destroy Falcon if she gave in to her own desires. Afraid to reach for something she had no real knowledge of. Afraid it would be sinfully and wonderfully erotic.</p> <p>For my beloved lifemate, my heart and my soul. This is my gift to you.</p><p>It was his beautiful words that had captured her heart for all time. Her soul did cry out for his. It didn't matter that she had seen those red flames of madness in his eyes. In spite of the danger, his words bound them together with thousands of tiny threads.</p><p>\"How is it you came to be here in Romania? You are American, are you not?\" She was very nervous, and Falcon wanted to find a safe subject, something that would ease the sexual tension between them. He needed a respite from the urgent demands of his body every bit as much as Sara needed her space. He was touching her mind lightly, could hear the echoes of her family demanding justice.</p><p>Sara could have listened to his voice forever. In awe, she touched her mouth, which was still tingling-from the pressure of his. He had such a perfect mouth and such a killer kiss. She closed her eyes briefly and savored the taste of him still on her tongue. She knew what he was doing, distracting her from the overwhelming sexual tension, from her own very justified fears. But she was grateful to him for it. \"I'm American,\" she admitted. \"I was born in San Francisco, but we moved around a lot. I spent a great deal of time in Boston. Have you ever been there?\" Her breath was still fighting to find its way into her lungs and she dragged in air, only to take the scent of him deep within her body.</p><p>\"I have never traveled to the United States but I hope that we will do so in the future. We can travel to my homeland together and see my Prince and his lifemate before we travel to your country.\" Falcon deliberately slowed his heart and lungs, taking the lead to get their bodies, both raging for release, back under control.</p><p>\"A Prince? You want me to go with you to meet your Prince?\" In spite of everything, Sara found herself smiling. She couldn't imagine herself meeting a Prince. The entire evening seemed something out of a fantasy, a dark dream she was caught in.</p><p>\"Mikhail Dubrinsky is our Prince. I knew his father, Vladimir, before him, but I have not had the privilege of meeting Mikhail in many years.\" Not for over a thousand years. \"Tell me how you came to be here, Sara,\" he prompted softly. The Prince was not entirely a safe subject. If Sara began thinking too much about what he was, she would immediately leap to the correct conclusion that Mikhail, the Prince of his people, was also of Falcon's species. Human, yet not human. It was the last thing he wanted her to dwell on.</p><p>\"I saw a television special about children in Romania being left in orphanages. It was heartrending. I have a huge trust fund, far more money than I'll ever use. I knew I had to come here and help them if I could. I couldn't get the picture of those poor babies out of my mind. It took great planning to get over to this country and to establish myself here. I was able to find this house and start making connections.\"</p> <p>She traced the paths of the raindrops on the window with her fingertip. Something in the way she did it made his body tighten to the point of pain. She was intensely provocative without knowing it. Her voice was soft in the night, a melancholy melody accompanied by the sounds of the storm outside. Every word that emerged from her beautiful mouth, the way her body moved, the way her fingertips traced the raindrops entranced him until he could think of nothing else. Until his body ached and his soul cried out and the demon in him struggled for supremacy.</p><p>\"I worked for a while in the orphanages, and it seemed an endless task - not enough medical supplies, not enough people to care for and comfort the babies. Some were so sick it was impossible to help them. I thought there was little hope of really helping. I was trying to establish connections to move adoption proceedings along quicker when I met a woman, someone who, like me, had seen the television special and had come here to help. She introduced me to a man who showed me the sewer children.\" Sara pushed at her gleaming sable hair until it tumbled in spiky curls and waves all over her head. The light glinted off each strand, making Falcon long to touch the silky whorls. There was a terrible pounding in his head, a relentless hammering in his body.</p><p>\"The children you whistled a warning to tonight.\" He tried not think about how enticing she looked when she was disheveled. It was all he could do not to tunnel his hands deep in the thick softness and find her mouth again with his. She paced restlessly across the room, her lush curves drawing his dark gaze like a magnet. The thin tank top was ivory, and her nipples were dark and inviting beneath the sheath of silk. The breath seemed to leave his body all at once, and he was hard and hot and uncomfortable with a need bordering on desperation.</p><p>\"Well, of course those were only a few of them. They are excellent little pickpockets.\" Sara flashed a grin at him before turning to stare once again out the window into the pouring rain. \"I tried to get them to turn in earlier, before dark, because it's even more dangerous on the street at night, but if they don't bring back a certain amount, they can be in terrible trouble.\" She sighed softly. \"They have a minicity underground. It's a dangerous life; the older ones rule the younger and they have to band together to stay safe. It isn't easy winning their confidence or even helping them. Anything you give them could easily get them killed. Someone might murder them for a decent shirt.\" She turned to look over her shoulder at him. \"I can't stay in one place too long, so I knew I could never really help the children the way they needed.\"</p><p>There was a sense of sadness clinging to her, yet she was not looking for pity. Sara accepted her life with quiet dignity. She made her choices and lived with them. She stood there with the window behind her, the rain falling softly, framing her like a picture. Falcon wanted to enfold her in his arms and hold her for eternity.</p><p>\"Tell me about the children.\" He glided silently to the narrow table where she kept a row of fragrant candles. He could see clearly in the darkness, but Sara needed the artificial light of her lamps. If they needed lights, he preferred the glow of candlelight. Candlelight had a way of blurring the edges of shadows, blending light into dark. He would be able to talk of necessary things to Sara in the muted light, to talk of their future and what it would mean to each of them. \"I found seven children who have interesting talents. It isn't easy or comfortable to be different, and I realized it was my difference that drew that horrible monster to me. I knew when I touched those children that they would also draw him to them. I know I can't save all the orphans, but I'm determined to save those seven. I've been setting up a system to get money to the woman aiding the children in the sewers, but I want a home for my seven. I know I won't be able to be with them always, at least not until I find a way to get rid of the monster hunting me, but at least I can establish them in a home with money and education and someone trustworthy to see to their needs.\"</p><p>\"The vampire will only be interested in the female children with psychic talents. The boys will be expendable; in fact, he will view them as rivals. It will be best to move them as quickly as possible to safety. We can go the mountains of my homeland and establish a home for the children there. They will be cherished and protected by many of our people.\" Falcon spoke softly, matter-of-factly, wanting her to accept the things he told her without delving too deeply into them yet. He was astonished that she already knew about vampires, and that she could be so calm about what was happening between them. Falcon didn't feel calm. His entire being was in a meltdown.</p><p>Her heart pounded out a rhythm of fear at the casual way he acknowledged that her conclusions were correct. The vampire would go after her children, and she had inadvertently placed them directly in his path.</p><p>She watched curiously as Falcon stared at the candles. The fingers of his right hand swirled slightly and the entire row of candles leaped to life. Sara laughed softly. \"Magic. You really are magic, aren't you?\" Her beloved sorcerer, her dark angel of dreams.</p><p>He turned to look at her, his black eyes drifting over her face. He moved then, unable to keep from touching her, his hands framing her face. \"You are the one who is magic, Sara,\" he said, his voice a whisper of seduction in the night. \"Everything about you is pure magic.\" Her courage, her compassion. Her sheer determination. Her unexpected laughter in the face of what she was up against.</p><p>Monster without equal.</p><p>And worse, Falcon was beginning to suspect that her enemy was one of the most feared of the vampires, a true ancient.</p><p>\"I've told you about me. Tell me about you, about how you can be as old as you are, how you came to write the diary.\" More than anything else, she wanted the story of the diary. Her book. The words he had written for her, the words that had poured out of his soul into hers and filled her with love and longing and need. She wanted to forget reality and lean into him, taking possession of his perfect mouth.</p><p>Sara needed to know how his words could have crossed the barrier of time to find her. Why had she been drawn into the darkness of those ancient tunnels? How had she known precisely where to find the hand-carved box? What was there about Sara Marten that drew creatures like him to her?</p><p>What had drawn one of them to her family?</p><p>\"Sara.\" He breathed her name into the room, a whisper of velvet, of temptation. The rain was soft on the rooftop, and his lifemate was only a scant few inches from him, tempting him with her lush curves and beautiful mouth and enormous violet eyes.</p><p>Reluctantly he allowed his hands to fall away from her face. He forced his gaze from her mouth when he needed the feel of it again so desperately. \"We are very close to the Carpathian Mountains. It is wild still, where we will go, but your plan to establish a house for the children will be best realized there. Few vampires dare to defy the Prince of our people on our own lands.\" He wanted her to accept his words. To know he meant to be with her and help her with whatever she needed to make her happy. If she wanted a house filled with orphans, he would be at her side and he would love and protect the children with her.</p><p>Sara took several steps backward. Afraid. Not so much of the man exuding danger and power, filling her home with his presence, filling her soul with peace and her mind with confusion. She was afraid of herself. Of her reaction to him. Afraid of her terrible aching need of him. He was offering her a life and hope. She had not envisioned either for herself. Not once in the last fifteen years. She pressed her body close to the wall, almost paralyzed with fear.</p><p>Falcon remained motionless, recognizing she was fighting her own attraction to him, the fierce chemistry that existed between them. The call of their souls to one another. The beast in him was strong, a hideous thing he was struggling to control. He needed his anchor, his lifemate. He must, for both of their sakes, complete the ritual. She was a strong woman who needed to find her own way to him. He wanted to allow her that freedom, yet they had so little time. He knew the beast was growing stronger, and his new, overwhelming emotions only added to his burden of control. Sara smiled suddenly, an unexpected humor in her eyes. \"We have this strange thing between us. I can't explain it. I feel your struggle. You need to tell me something but you are very reluctant to do so. The funny thing about it is that there is no real expression on your face and I can't read your body language, either. I just know there's something important you aren't telling me and you're very worried about it. I'm not a shrinking violet. I believe in vampires, for lack of a better word to call such creatures. I don't know what you are, but I believe you aren't human. I haven't made up my mind whether you are one of them; I'm afraid I'm blinded by some fantasy I've woven about you.\"</p><p>Falcon's dark eyes went black with hunger. For a moment he could only stare at her, his desire so strong he couldn't think clearly. It roared through him with the force of a freight train, shaking the foundations of his control.</p><p>\"I am very close to turning. The males of our race are predators. With the passing of the years, we lose all ability to feel, even to see in color. We have no emotions. We have only our honor and the memories of what we felt to hold us through the long centuries. Those of us who must hunt the vampire and bring him to justice are taking lives. That adds to the burden of our existence. Each kill spreads the darkness on our souls until we are consumed. I have existed for nearly two thousand years, and my time has long since past. I was making my way home to end my existence before I could become the very thing I have hunted so relentlessly.\" He told her the truth starkly, without embellishment.</p><p>Sara touched her mouth, her eyes never leaving his face. \"You feel. You could never fake that kiss.\" There was a wealth of awe in her voice.</p><p>Falcon felt his body relax, the tension draining from him at her tone. \"When we find a lifemate, she restores our ability to feel emotion. You are my lifemate, Sara. I feel everything. I see in color. My body needs yours, and my soul needs you desperately. You are my anchor, the one being, the only being who can keep the darkness in me leashed.\"</p><p>She had read his diary; the things he was telling her were not new concepts. She was light to his darkness. His other half. It had been a beautiful fantasy, a dream. Now she was facing the reality, and it was overwhelming. This man standing so vulnerable in front of her was a powerful predator, close to becoming the very thing he hunted.</p><p>Sara believed him. She felt the darkness clinging to him. She felt the predator in him with unsheathed claws and waiting fangs. She had glimpsed the fires of hell in his eyes. Her violet eyes met his without flinching.</p><p>\"Well, Sara.\" He said it very softly. \"Are you going to save me?\"</p><p>The rain poured onto the roof of her home, the sound a sensual rhythm that beat through her body in time to the drumming of her heart. She couldn't pull her gaze away from his. \"Tell me how to save you, Falcon.\" Because every word he'd spoken was truth. She felt it, knew it instinctively.</p><p>\"Without binding us with the ritual words, I am without hope. Once I speak them to my true lifemate, we are bound together for all eternity. It is much like the human marriage ceremony, yet more.\" She knew the ancient words. He had said them to her, had whispered them to her a thousand times in the middle of the night. Beautiful words.</p><p>I claim you as my lifemate. I belong to you. I offer my life for you. I give to you my protection, my allegiance, my heart, my soul, and my body. I take into my keeping the same that is yours. Your life, happiness, and welfare will be cherished and placed above my own for all time. You are my lifemate, bound to me for all eternity and always in my care.</p><p>She had stumbled over the translation for a long time, wanting each word perfect in its beauty, with the exact meaning he had intended. The words that had gone from his heart to hers. \"And we would be considered married?\"</p><p>\"You are my lifemate; there will never be another. We would be bound, Sara, truly bound. We would need the touch of our minds, the coming together of our bodies often. I could not be without you, nor you without me.\"</p><p>She recognized that there was no compulsion in his voice. He was not trying to influence her, yet she felt the impact of his words deep inside her. Sara lifted her chin, trying to see into his soul. \"Without binding us, you would really become like that monster who killed my family?\"</p><p>\"I struggle with the darkness every moment of my existence,\" he admitted softly. A jagged bolt of lightning lit the night sky and for one moment threw his face into harsh relief. She could see his struggle etched plainly there, a certain cruelty about his sensual mouth, the lines and planes and angles of his face, the black emptiness of his eyes. Then once again the darkness descended, muted by the glow of the candles. Once again he was beautiful, the exact face in her dreams. Her own dark angel. \"I have no other choice but to end my life. That was my intention as I made my way to my homeland. I was already dead, but you breathed life back into my shattered soul. Now you are here, a miracle, standing in front of me, and I ask you again: Are you willing to save my life, my soul, Sara? Because once the words are said between us, there is no going back, they cannot be unsaid. You need to know that. I cannot unsay them. And I would not let you go. I know I am not that strong. Are you strong enough to share your life with me?\"</p><p>She wanted to say no, she didn't know him, a stranger who came to her straight from taking a man's blood. But she did know him. She knew his innermost thoughts. She had read every word of his diary. He was so alone, so completely, utterly alone, and she knew, more than most, what it was like to be alone. She could never walk away from him. He had been there for her all those long, empty nights. All those long, endless nights when the ghosts of her family had wailed for vengeance, for justice. He had been there with her. His words. His face.</p><p>Sara put her hand on his arm, her fingers curling around his forearm. \"You have to know I will not abandon the children. And there is my enemy. He will come. He always finds me. I never stay in one place too long.\"</p><p>\"I am a hunter of the undead, Sara,\" he reminded, but the words meant little to him. He was only aware of her touch, the scent of her, the way she was looking at him. Her consent.</p><p>He was waiting. His entire being was waiting. Even the wind and rain seemed to hesitate. \"Sara.\" He said it softly, the aching need, the terrible hunger, evident in his voice.</p><p>Closing her eyes, wanting the dream, she heard her own voice in the stillness of the room. \"Yes.\"</p><p>Falcon felt a surge of elation. He drew her against him, buried his face in the softness of her neck. His body trembled from the sheer relief of her commitment to him. He could hardly believe the enormity of his find, of being united with his lifemate in the last days of his existence. He kissed her soft, trembling mouth, lifted his head to look into her eyes. \"I claim you as my lifemate.\" The words broke out of him, soared from his soul. \"I belong to you. I offer my life for you. I give to you my protection, my allegiance, my heart, my soul, and my body. I take into my keeping the same that is yours. Your life, happiness, and welfare will be cherished and placed above my own for all time. You are my lifemate, bound to me for all eternity and always in my care.\" He buried his face once more against her soft skin, breathed in her scent. Beneath his mouth her pulse beckoned, her life force calling to him, tempting. So very tempting.</p><p>She felt the difference at once, a strange wrenching in her body. Her aching heart and soul, so empty before, were suddenly whole, complete. The feeling filled her with elation; it terrified her at the same time. It couldn't be her imagination. She knew there was a difference.</p><p>Before she could be afraid of the consequences of her commitment, Sara felt his lips, velvet soft, move over her skin. His touch drove out all thought, and she gave herself willingly into his keeping. His arms held her closer still to his heart, within the shelter of his body. His teeth scraped lightly, an erotic touch that sent a shiver down her spine. His tongue swirled lazily, a tiny point of flame she felt raging through her blood stream. Of their own volition, her arms reached up to cradle his head. She was no young girl afraid of her own sexuality; she was a grown woman who had waited long for her lover. She wanted the feel of his mouth and hands. She wanted everything he was willing to give her.</p><p>His hands moved over her, pushing aside the thin barrier of her top to take in her skin. She was softer than anything he had ever imagined. He whispered a powerful command; his teeth sank deep, and whips of lightning lashed through his body to hers. White-hot heat. Blue fire. She was sweet and spicy, a taste of heaven. He wanted her, every inch of her. He needed to bury his body deep within her, to find his safe haven, his refuge. He had fed well, and it was a good thing, or he never would have found the will to curb his strength. It took every ounce of control to stop himself from indulging wildly. He took only enough for an exchange. He would be able to touch her mind, to reassure her. That would be absolutely necessary for their comfort and safety.</p><p>He slashed his own chest, pressed her mouth to his ancient, powerful blood, and softly commanded her obedience. She moved sensuously against him, driving him closer and closer to the edge of his control.</p><p>He wanted her, needed her, and the moment he knew she had taken enough for the exchange, he whispered his command to stop feeding. He closed the wound carefully and took possession of her mouth, sweeping his tongue along hers, dueling and dancing, so that, as she emerged from the enthrallment, there was only the strength of his arms, the heat of his body, and the seduction of his mouth.</p><p>Without warning, the storm increased in intensity, battering at the windowsill. Bolts of lightning slammed into the ground with such force, the ground shook. Sara's little cottage trembled, the walls shaking ominously. Thunder roared so that it filled the spaces in the house, a deafening sound. Sara tore herself out of his arms, clapped her hands over her ears, and stared in horror out into the fury of the squall. She gasped as another bolt of lightning sizzled across the sky in writhing ropes of energy. Thunder crashed directly overhead, wrenching a soft, frightened cry from her throat. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Before another sound could escape from Sara, Falcon's hand covered her mouth gently in warning. Sara didn't need his caution; she already knew. Her enemy had found her once again. \"You have to get out of here,\" she hissed softly against his palm.</p><p>Falcon bent his head so that his mouth was touching her ear. \"I am a hunter of the undead, Sara. I do not run from them.\" The taste of her was still in his mouth, in his mind. She was a part of him, inseparable now.</p><p>She tipped her head back to stare up at him, wincing as the wind howled and shrieked with enough force to cause small tornadoes in the street and yard, throwing loose paper, leaves, and twigs into the air in a rush of anger. \"Are you any good at killing these things?\" She asked it with a hint of disbelief. There was a challenge in her voice. \"I need to know the truth.\"</p><p>For the first time that he could remember, Falcon felt like smiling. It was unexpected in the midst of the vampire's arrival, but the doubt in her voice made him want to laugh. \"He is sending out his threat ahead of him. You have angered him. You have a built-in shield, a rare thing. He cannot find you when he scans, so he is looking for an awareness, a surge of fear that will tell him you know who he is. That is how he tracks you. I will send my answer to him so he is aware that you are under my protection.\"</p> <p>\"No!\" She caught his arm with suddenly tense fingers. \"This is it, our chance. If he doesn't know about you, then he will come for me. We can lay a trap for him.\"</p><p>\"I do not need to use you as bait.\" His voice was very mild, but there was a hint of some unnamed emotion that made her shiver. Falcon was unfailingly gentle with her, his tone always soft and low, his touch tender. But there was something deep inside him that was terribly dangerous and very dark.</p><p>Sara found herself shivering, but she tightened her hold on him, afraid that if he went into the raging storm he would be lost to her. \"It's the best way. He'll come for me; he always comes for me.\" Already her bond with Falcon was so strong, she couldn't bear the thought of something happening to him. She must protect him from the terrible thing that had destroyed her family.</p><p>\"Not tonight. Tonight I'll go after him.\" Falcon put her from him gently. He could clearly see her fears and her fierce need to be sure that he was safe. She had no concept of what he was, of the thousands of battles he had fought with these very monsters: Carpathian males who had waited too long, or who had chosen to give up their souls for the fleeting momentary pleasure of the kill. His brethren.</p><p>Sara caught his arm. \"No, don't go out there.\" There was a catch in her voice. \"I don't want to be alone tonight. I know he's here, and for the first time, I'm not alone.\"</p> <p>He leaned down to capture her soft mouth with his. At once there was that melting sensation, the promise of silken heat and ecstasy he had never dared to dream about. \"You are worried about my safety and seek ways to keep me with you.\" He said the words softly against her lips. \"I dwell within you now; we are able to share thoughts with one another. This is my life, Sara; this is what I do. I have no choice but to go. I am a male Carpathian sent by the Prince of my people into the world to protect others from these creatures. I am a hunter. It is the only honor I have left.\"</p><p>There was that aching loneliness in his voice. She had been alone for fifteen years. She couldn't imagine what it would be like to be alone for as long as he had been. Watching endless time go by, the changes in the world, without hope or refuge. Sentenced to destroying his own kind, perhaps even friends.</p><p>Honor.</p><p>That word had been used often in his diary. She saw the implacable resolve in him, the intensity that swirled dangerously close to the surface of his calm. Nothing she could say would stop him.</p><p>Sara sighed softly and nodded. \"I think there is much more in you to honor than just your abilities as a hunter, but I understand. There are things I must do that I don't always want to, but I know I couldn't live with myself if I didn't do them.\" She slipped her arms around his neck and pressed her body close to his. For one moment she was no longer alone in the world. He was solid and safe. \"Don't let him harm you. He's managed to destroy everyone I care about.\"</p><p>Falcon held her, his arms cradling her body, every cell needing her. It was madness to hunt when he was so close to turning and the ritual had not been completed, but he had no choice. The wind beat at the window, the branches of trees sweeping against the house in a kind of fury. \"I will be back soon, Sara,\" he assured her softly.</p> <p>\"Let me go with you,\" she said suddenly. \"I've faced him before.\"</p><p>Falcon smiled. His soul smiled. She was beautiful to him, nearly unbelievable. Ready to face the monster right beside him. He bent once more and found her mouth with his. A promise. He made it that. A promise of life and happiness. And then he was gone, wrenching open the door while he still could, while his honor was strong enough to overcome the needs of his body. He simply dissolved into mist, mixing with the rain for camouflage, and streamed through the night air, away from the shelter and temptation of her body and heart.</p><p>Sara stepped out onto the porch after him, still blinking, unsure where he had gone, it had happened so quickly. \"Falcon!\" His name was a cry wrenched from her soul. The wind whipped her hair into a frenzy. The rain doused her clothes until the silk was nearly transparent. She was utterly alone again.</p><p>You will never be alone again, Sara. I dwell within you as you are within me. Speak to me; use your mind, and I will hear you.</p><p>She held her breath. It was impossible. She felt a flood of relief and sagged against the column of her porch for support. She didn't question how his voice could be in her mind, clear and perfect and sexy. She accepted it because she needed it so desperately. She jammed her fist in her mouth to stop herself from calling him back to her, forgetting for a moment that he must be reading her thoughts.</p><p>Falcon laughed softly, his voice a drawling caress.</p><p>You are an amazing woman, Sara. Even to be able to translate my letters to you. I wrote them in several languages. Greek, Hebrew. The ancient tongue. How did you accomplish such a feat?</p><p>He was traveling swiftly across the night sky, scanning carefully, looking for disturbances that would signal the arrival of the undead. Sometimes blank spaces revealed the vampire's lair. Other times it would be a surge of power or an unexpected exodus of bats from a cave. The smallest detail could provide clues to one who knew where to look.</p> <p>Sara was silent a moment, turning the question over in her mind. She had been obsessed with translating the strange documents wrapped so carefully in oilskin. Perseverance. She had needed to translate those words. Sacred words. She remembered the feeling she had each time she touched those scrolled pages. Her heart had beat faster, her body had come to life, her fingers had smoothed over the fibers more times than she wanted to count. She had known that those words were meant for her. And she had seen his face. His eyes, the shape of his jaw, the long flow of his hair. The aching loneliness in him. She had known that only she would find the right translation.</p><p>My parents taught me Greek and Hebrew and most of the ancient languages, but I had never seen some of the letters and symbols before. I went to several museums and all the universities, but I didn't want to show the diary to anyone else. I believed it was meant for me.</p><p>She had known that the words were intimate, meant only for her eyes. There had been poetry in those words before she had ever translated them. Sara felt tears gathering in her eyes. Falcon. She knew his name now, had looked into his eyes, and she knew he needed her. No one else. Just Sara.</p><p>I studied the diary for several months, translated what I could, but I knew it wasn't right, word for word. And then it just came to me. I felt when it was right. I can't explain how, but I knew the moment I hit on the key.</p><p>Falcon felt the curious wrenching in his heart. She could make his soul flood with warmth, overwhelming him with such intense feeling that he was no longer the powerful predator but a man willing to do anything for his lifemate. She humbled him with her generosity and her acceptance of what he was. He had written those words, expressing emotions he could no longer feel. Writing the diary was a compulsion he couldn't ignore. He had never expected anyone to read it, yet he had never destroyed it, unable to do so.</p><p>Dawn was a couple of hours away and the vampire would still be lethal. More than likely he was searching for lairs, escape routes, gathering information. Falcon had hunted and successfully battled the vampire for centuries, yet he was growing distinctly uneasy. He should have picked up a trail, yet there were none of the usual signs to indicate the undead had passed over the city. Few of the creatures could achieve such a feat; only a very powerful ancient enemy would have such skills.</p><p>You are my heart and soul, Sara. The words I left for you are truth, and only my lifemate would know how to find the key to unlock the code to translate the ancient language.</p><p>His tone held admiration and an intensity of love that wrapped her in warmth.</p><p>I must concentrate on the hunt. This one is no fledgling vampire, but one of power and strength. It requires my full attention. Should you have need of me, reach with your mind and I will hear you.</p><p>Sara crossed her arms across her breasts, moving back onto her porch, watching the sheets of rain falling in silvery threads. She felt Falcon's uneasiness more than heard it in his tone.</p><p>If you need me, I will come to you.</p><p>She meant it. Meant it with every cell in her body. It felt wrong to have Falcon going alone to fight her battles.</p><p>Falcon's heart lightened. She would rush to his aid if he called her. Their tie was already strong, and growing with each passing moment. Sara represented the miracle granted to his species.</p><p>Lifemate.</p><p>He was cautious as he moved across the sky, using the storm as his cover. He was adept, able to shield his presence easily. He began surveying the areas most likely to harbor the undead. Within the city, it would be the deserted older buildings with basements. Outside of the city, it would be any cave, any hole in the ground the ancient vampire could protect.</p><p>Falcon found no traces of the enemy, but the uneasiness in him began to grow. The vampire would have already attacked Sara if he had known for certain where she was. Obviously, he had vented his rage because he hadn't found her, and he had hoped to frighten her into betraying her presence. That left one other avenue open to Falcon. He would have to find the vampire's kill and trace him from there. It would be a painstakingly slow process and he would have to leave Sara alone for some time. He reached for her.</p><p>If you feel uneasy, call for me at once. Anything at all, Sara, call for me.</p><p>He felt her smile.</p><p>I have been aware of this enemy for half my life. I know when he is close, and I have managed to escape him time after time. You take care of yourself, Falcon, and don't worry about me.</p><p>Sara had been alone a long time and was an independent, self-sufficient woman. She was far more worried about Falcon than she was about herself.</p><p>The rain was still pouring down, the wind blowing the droplets into dismal heavy sheets. Falcon felt no cold in the form he had taken. Had he been in his natural body, he would have regulated his body temperature with ease. The storm was a deterrent to seeking his enemy by using scent, but he knew the ways of the vampire. He found the kill unerringly.</p><p>The body was in an alleyway, not far from where Sara's sewer children had rushed Falcon. His uneasiness grew. The vampire obviously had become adept at finding Sara. There was a pattern to her behavior, and the undead capitalized on it. Once he found the country and the city she had settled in, the vampire would go to the places where Sara, would eventually go. The refuges of the lost, the homeless, the unwanted children and battered women. Sara would work in those areas to accomplish what she could before she moved on. Money meant little to her; it was only a means to keep moving and to do what she could to help. She lived frugally and spent little on herself. Just as Falcon had studied vampires to learn their ways, this vampire had studied Sara. Yet she had continued to elude him. Most vampires were not known for their patience, yet this one had followed Sara relentlessly for fifteen years.</p><p>It was a miracle that she had managed to avoid capture, a tribute to her courageous and resourceful nature. Falcon's frame shimmered and solidified in the dreary rain beside the dead man. The vampire's victim had died hard. Falcon studied the corpse, careful not to touch anything. He wanted the scent of the undead, the feel of him. The victim was young, a street punk. There was a knife on the ground with blood on the blade. Falcon could see the blade was already corroding. The man had been tortured, most likely for information about Sara. The vampire would want to know if she had been seen in the area. The echoes of violence were all around Falcon.</p><p>He couldn't allow the evidence to remain for the police. He sighed softly and began to summon the energy in the sky above him. Bolts of lightning danced brightly, throwing the alley into sharp relief. The whips sizzled and crackled, white-hot. He directed the energy to the body and the knife. It incinerated the victim to fine ashes and cleansed the blade before melting it.</p><p>The flare of power was all around him as the lightning burned like an orange flame from the ground back up to the dark, ominous clouds, where it veined out in radiant points of blue-white heat. Falcon suddenly raised his head and looked around him, realizing that the power vibrating in the air was not his alone. He leaped back, away from the ashes as the blackened ruins came to life. An apparition of horror rose up with a misshapen head and pitiless holes for eyes.</p><p>Falcon whirled, a fraction of a second too late, to meet the real attack. A claw missed his eye and raked his temple. Razor-sharp tips dug four long furrows into his chest. The pain was excruciating. Hot, fetid breath exploded in his face and he smelled rotting flesh, but the creature was a blur, disappearing as Falcon struck instinctively toward the heart.</p><p>His fist brushed thick fur and then empty air. At once, the beast within Falcon rose up, hot and powerful. The strength of it shook him. There was a red haze in front of his eyes, chaos reigning in his mind. Falcon spun around as he took to the sky, barely avoiding slamming bolts of energy that blackened the alley and took out the sides of the already crumbling building. The sound was deafening. The beast welcomed the violence, embraced it. Falcon was fighting himself as well as the vampire, battling the hunger that could never be assuaged.</p><p>Falcon?</p><p>Her voice was a breath of fresh air, pushing aside the call of the kill.</p><p>Tell me where you are. I feel danger to you.</p><p>It was the naked concern in her voice that allowed him to control the raging demon, to push it aside despite the desire for violence.</p><p>Falcon struck fast and hard, a calculated risk, flying toward the bizarre figure made of ash, his fist outstretched before him. The ashes scattered in a whirlwind, rising high like a tower of grotesque charcoal. For an instant a form shimmered in the air as the vampire attempted to throw a barrier between them. Falcon drove through the flimsy structure, again feeling the brush, this time of flesh, but the creature had managed to dissolve again. The vampire was gone, vanishing as swiftly as it had appeared.</p><p>There was no trace of the monster, not even the inevitable blankness. Falcon searched the area carefully, thoroughly, looking for the smallest clue. The longer he searched, the more he was certain that Sara was hunted by a true ancient, a master vampire who had managed to elude all hunters throughout the centuries.</p><p>Falcon moved through the sky warily. The vampire would not strike at him again now. Falcon had been tested, and the ancient had lost the advantage of surprise. The enemy now knew he was up against an experienced hunter well versed in battle. He would go to ground, avoid contact in the hopes that Falcon would pass him by.</p><p>A clap of thunder echoed across the sky. A warning. A dark promise. The vampire was staking his claim, despite the fact that he knew a hunter was in the area. He would not give Sara up. She was his prey.</p><p>Sara was waiting for Falcon on the small porch, reaching for him with eager arms. Her gaze moved over him fearfully, assessing him for damage. Falcon wanted to gather her into his arms and hold her against his heart. No one had ever welcomed him, worried about him, had that look on her face. Anxious. Loving. She was even more beautiful than he remembered. Her clothes were soaked with rainwater, her short hair spiky and disheveled, her eyes enormous. He could drown in her eyes. He could melt in the heat of her welcome.</p><p>\"Come into the house,\" Sara said, touching his temple with gentle fingers, running her hands over him, needing to feel him. She drew him into her home, out of the night air, out of the rain. \"Tell me,\" she urged.</p><p>Falcon looked around him at the neat little room. It was soothing and homey. Comforting. The stark contrast between his ugly, barren existence and this moment was so extreme, it was almost shocking. Sara's smile, her touch, the worry in her eyes - he wouldn't trade those things for any treasure he had ever come across in his centuries on earth.</p><p>\"What happened to you, Falcon? And I don't mean your wounds.\" The fear for him she felt deep within her soul had been overwhelming in those moments before their communication.</p><p>Falcon shoved a hand through his long hair. He had to tell her the truth. The demon in him was stronger than ever. He had waited too long, been in too many battles, made too many kills. \"Sara,\" he said softly. \"We have a few choices, but we must make them swiftly. We do not have the time to wait until you fully understand what is happening. I want you to remain quiet and listen to what I have to say, and then we will have to make our decisions.\"</p><p>Sara nodded gravely, her eyes on his face. He was struggling, she could see that clearly. She knew he feared for her safety. She wanted to smooth the lines etched so deeply into his face. There was blood smeared on his temple, a thin trail that only accented the deep weariness around his mouth. His shirt was tattered and bloody, with four distinct rips. Every cell in her body cried out to hold him, to comfort him, yet she sat very still, waiting for what was to come.</p><p>\"I have tied us together in life or death. If something were to happen to me, you would find it very difficult to continue without me. We must get to the Carpathian Mountains and my people. This enemy is an ancient and very powerful. He is determined that you are his, and nothing will deter him from hunting you. I believe you are in danger during both the hours of sunlight and darkness.\"</p><p>Sara nodded. She wasn't about to argue with him. The vampire had been relentless in his pursuit of her.</p><p>She had been lucky in her escapes, willing to run at the smallest sign that he was near. Had the vampire stalked her silently, he would have had her, she was certain, but he didn't seem to credit her ability to ignore his summons. \"He's used creatures during the day before.\" She looked down at her hands. \"I burned one of them.\" She admitted it in a low voice, ashamed of herself.</p><p>Falcon, feeling her guilt like a blow, took her hands, turned them over, and placed a kiss in the center of each palm. \"The vampire's ghouls are already dead. They are soulless creatures, living on flesh and the tainted blood of the vampire. You were lucky to escape them. Killing them is a mercy. Believe me, Sara, they cannot be saved.\"</p><p>\"Tell me our choices, Falcon. It is nearly morning and I'm feeling very anxious for you. Your wounds are serious. You need to be looked after.\" She could hardly bear the sight of him. He was smeared with blood and so weary he was drooping. Her fingers smoothed back stray strands of his long black hair.</p><p>\"My wounds truly are not serious.\" He shrugged them off with a casual ripple of his shoulders. \"When I go to ground, the soil will aid in healing me. While I am locked within the earth, you will be alone and vulnerable. During certain hours of the day I am at my weakest and cannot come to your aid. At least not physically. I would prefer that you remain by my side at all times to know you are safe.\"</p><p>Her eyes widened. \"You want me to go beneath the earth with you? How would that be possible?\" There were things left undone, things she needed to do in the daylight hours. Business hours. The world didn't accommodate Falcon's people so readily.</p><p>\"You would have to become fully like me.\" He said it softly, starkly. \"You would have all the gifts of my people, and also the weaknesses. You would be vulnerable during daylight hours, and you would require blood to sustain your life.\"</p><p>She was silent for a moment, turning his words over in her mind. \"I presume that if I were like you, that would not be so abhorrent to me. I would crave blood?\"</p><p>He shrugged. \"It is a fact of our lives. We do not kill; we keep our prey calm and unknowing. I would provide for you, and it would not be in such a way that you would find it uncomfortable.\"</p><p>Sara nodded her acceptance of that even as her mind turned over his use of the word prey.</p><p>She had lived in the shadows of the Carpathian world for fifteen years. His words weren't a shock to her. She drew Falcon toward the small bathroom where she had a first aid kit. He went with her because he could feel her need to take care of him. And he liked the feel of her hands on him.</p><p>\"I can't possibly make a decision like this in one night, Falcon,\" she said as she ran hot water onto a clean cloth. \"I have things I have to finish and I'll need to think about this.\" She didn't need to think too long or too hard. She wanted him with every fiber of her being. She had already learned in the short time while he was off chasing her enemy what it would be like to be without him.</p><p>Sara leaned into him and kissed his throat. \"What else?\" Her full breasts brushed against his arm, warm, inviting. Very gently she dabbed at the lacerations on his temple, wiping away the blood. The wounds on his chest were deeper. It looked as if an animal had raked claws over his chest, ripping his shirt and scoring four long furrows in the skin.</p><p>\"I came very close to losing my control this night. I need to complete the ritual so we are one and you are my anchor, Sara. You felt it; you sensed the danger to me and called me back to you. Once the ritual is complete, that danger would no longer exist.\" He made the confession in a low voice, his overwhelming need evident in his husky tone. He couldn't think straight when she was so close to him, the roar in his head drowning out everything but the needs of his body.</p><p>Sara caught his face in her hands. \"That's it? That's the big confession?\" Her smile was slow and beautiful, lighting her eyes to a deep violet. \"I want you more than anything on this earth.\" She bent her head and took possession of his mouth, pressing her body close to his, her rain-wet silken tank top nearly nonexistent, her breasts thrusting against him, aching with need. A temptation. An enticement. There was hunger in her kiss, acceptance, excitement. Her mouth was hot with her own desire, meeting the demands of his. Raw. Earthy. Real.</p><p>She lifted her head, her gaze burning into his. \"I have been yours for the last fifteen years. If you want me, Falcon, I'm not afraid. I've never really been afraid of you.\" Her hands pushed aside his torn shirt, exposing his chest and the four long wounds.</p><p>\"You have to understand what kind of commitment you are making, Sara,\" he cautioned. He needed her. Wanted her.</p><p>Hungered for her. But he would not lose his honor with the most important person in his life. \"Once the ritual is complete, if you are not with me below the ground while I sleep, you will fight a terrible battle for your sanity. I do not wish this for you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sara blinked, drawing attention to her long lashes. Her gaze was steady. \"Neither do I, Falcon\" - her voice was a seductive invitation - \"but I'd much rather fight my battles briefly than lose you. I'm strong. Believe in me.\" She bent her head, pressed a kiss into his shoulder, his throat. \"You aren't taking anything I'm not willing to give.\"</p><p>How could she tell him, explain to him that he had been her only salvation all those long, endless nights when she'd hated herself, hated that she was alive and her family dead? How could she tell him he had saved her sanity, not once, but over and over? All those long years of holding his words close to her, locked in her heart, her soul. She knew she belonged with Falcon. She knew it in spite of what he was.</p><p>She didn't care that he was different, that his way of surviving was different. She only cared that he was real, alive, standing in front of her with his soul in his eyes. Sara smiled at him, a sweet, provocative invitation, and simply drew her tank top over her head so that he could see her body, the full, lush curves, the darker peaks. Sara dropped the sodden tank top in a little heap on top of his shirt. She tilted her chin, trying to be brave, but he could see the slight trembling of her body. She had never done such an outrageous thing in her life.</p><p>Falcon found the nape of her neck, his fingers curling possessively as he dragged her close to him. His wounds were forgotten, his weariness. In that moment everything was forgotten but that Sara was offering herself to him. Pledging to give her life and her body into his keeping. Generously. Unconditionally.</p> <p>Falcon thought she was the sexiest thing he had ever seen in all his years of existence. She was looking at him with enormous eyes so vulnerable his insides turned to mush. His breath slammed right out of his lungs. His body was so hot, so hard, so tight, he was afraid he might shatter if he moved. Yet he couldn't stop himself. His hand of its own volition drifted down her throat to cup her breast. Her skin was incredibly soft, softer even than it looked. It was shocking the way he felt about her, the sheer intensity of it. Where he had never wanted or needed, where no one had mattered, now there was Sara to fill every emptiness in him. His fingertips brushed over the curve of her breast, an artist's touch, explored the line of her ribs, the tuck of her waist, returned to cup her lush offering.</p><p>His black gaze burned over her possessively, scorching her skin, sending flames licking along the tips of her breasts, her throat, her hips, between her legs. And then he bent his head and drew her breast into the hot, moist cavern of his mouth.</p><p>Sara cried out, clutched his head, her fingers tangling in the thick silk of his hair, her body shuddering with pleasure. She felt the strong, erotic pull of his mouth in the very core of her body. Her body clenched tightly, aching, coiled with edgy need.</p><p>Falcon skimmed his hand down the sleek line of her back.</p><p>Are you certain, Sara? Are you certain you want the complete intimacy of our binding ritual?</p> <p>He sent her the picture in his head: his mouth on her neck, over her pulse, the intensity of his physical need of her. He was already pulling her closer, devouring her skin, the lush curves so different from the hard planes and angles of his own body.</p><p>If Sara had wanted to pull back, it was already far too late. She was lost in the arcing electricity, the dazzling lightning dancing in her bloodstream. The images and the sheer pleasure in his mind, darkly erotic, only added to the firestorm building in her body. She had never experienced anything so elemental, so completely right, so completely primitive. She needed to be closer to him, skin to skin. The need was all-consuming, as hot as the sun itself, a firestorm raging, crowning, until there was nothing else, only Falcon. Only feeling. Only his fierce possession. She cradled his head to her breast, arcing deeper into his mouth while her body went liquid hot.</p><p>She wrapped one leg around his hips, pushing her heated center against the hard column of his thigh, a hard friction, moving restlessly, seeking relief. Her hands were tugging at his clothes, trying to get them off him while his mouth left flames on her neck, her breasts, even her ribs. His hands skimmed the curve of her hips, taking the silken pajamas down her thighs so the material pooled on the floor in a heap. He caught her leg and once more wrapped it around his hips so that she was open to him, pressed, hot and wet, tight against him.</p><p>Falcon's mouth found hers in a series of long kisses, each inflaming her more than the last. His hands were possessive on her breasts, her belly, sliding to her bottom, the inside of her thigh.</p><p>She was hot and wet with her need of him, her scent calling to him. Falcon's body was going up in flames. Sara had no inhibitions about letting him know she wanted him, and it was a powerful aphrodisiac. Her body moved against his, rubbing tightly, open to his exploration. She was pushing at his clothes, trying to get closer, her mouth on his chest, her tongue swirling to taste his skin. He removed the barrier of his clothing in the easy manner of his people, using his mind so that her hands could find him, thick and hard and full and throbbing with need. The moment her fingers stroked him, little firebombs seemed to explode in his bloodstream.</p><p>She knew him intimately, his thoughts, his dreams. She knew his mind, what he liked, what he needed and wanted. And he knew her. Every way to please her. They came together in heat and fire, yet for all his enormous strength, his desperate need, his touch was tender, exploring her body with a reverence that nearly brought tears to her eyes. His mouth was everywhere, hot and wild, teasing, enticing, promising things she couldn't conceive of.</p> <p>Sara clung to him, wrapped her arms around his head, tears glistening like diamonds in her eyes, on her lashes. \"I've been so alone, Falcon. Never go away. I don't know if you're real or not. How could anything as beautiful as you be real?\"</p><p>He lifted his head, his black eyes drifting over her face. \"You are my soul, Sara, my existence. I know what being alone is. I have lived centuries without home or family. Without being complete, the best part of me gone. I never wish to be apart from you.\" He caught her face between his hands. \"Look at me, Sara. You are my world. I would not choose to be in this world without you. Believe in me.\" He bent his head to fasten his mouth to hers, rocking the earth for both of them.</p><p>Sara had no idea how they ended up in the bedroom. She was vaguely aware of being pressed against the wall, a wild tango of drugging kisses, of hot skin and exploring hands, of moving through space until the comforter was pressed against her bare body, her skin so sensitive she was gasping with the urgency of her own needs.</p><p>His mouth left hers to trace a path over her body, the swell of her breasts, her belly, his tongue trailing fire in its wake. His hands parted her thighs, held her tight as her body exploded, fragmented at the first stroking caress of his tongue.</p><p>Sara cried out, her hands fisting in his wealth of thick, long hair. She writhed under him, her body rippling with aftershocks. \"Falcon.\" His name came out a breathy whispered plea.</p><p>\"I want you ready for me, Sara,\" he said, his breath warming her, his tongue tasting her again and again, stroking, caressing, teasing until she was crying out again and again, her hips arcing helplessly into him.</p><p>His body blanketed hers, skin to skin, his heavier muscles pressed tightly against her softer body so that they fit perfectly. Falcon was careful with her despite the wildness rising within him. He watched her face as he began to push inside her body. She was hot, velvet soft, a tight sheath welcoming him home. The sensation was nothing like he had ever imagined, pure pleasure taking over every cell, every nerve. In the state of heightened awareness that he was in, his body was sensitive to every ripple of hers, every clench of her muscles, every touch of her fingers. Her breath - just her breath gave him pleasure.</p><p>He thrust deeper until her breath came in gasps. Until her body coiled tightly around his. Until her nails dug into his back. She was so soft and welcoming. He began to move, surging forward, watching her face, watching the loss of control, feeling the wildness growing in him, reveling in his ability to please her. He thrust harder, deeper, over and over, watching her rise to meet him, stroke for stroke. Her breasts took on a faint sheen, tempting, enticing, a lush invitation.</p> <p>Falcon bent his head to her, his dark hair sliding over her skin so that she shuddered with pleasure, so that she cried out with unexpected shock at another orgasm, fast and furious.</p><p>Sara knew the moment his mouth touched her skin. Scorched her skin. She knew what he would do, and her body tightened in anticipation. She wanted him wild and out of control. His tongue found her nipple, lapped gently. His mouth was hot and greedy, and she heard herself gasp out his name. She held him to her, arcing her body to offer him her breast, her hips moving in perfect rhythm with his.</p><p>His mouth moved to the swell of her breast, just over her heart, his teeth scraping gently, nipping, his tongue swirling. Sara thought she might explode into a million fragments. Her body was so hot and tight and aching \"Falcon...\" She breathed his name, a plea, needing to fulfill his every desire.</p><p>His hands tightened on her hips, and he buried himself deep inside her body and inside her mind, his teeth sinking into her skin so that white-hot lightning lashed through her, through him, until she was consumed by fire. Devoured by it. She cradled his head, but her body was rippling with pleasure, again and again until she thought she might die from it. Endless. On and on, again and again.</p><p>His tongue swirled lightly over the small telltale pinpricks. He was trembling, his mind a haze of passion and need. He whispered softly to her, a command as he lifted her head to the temptation of his chest. Falcon felt Sara's mouth move against his skin. His body tightened, a pain-edged pleasure nearly beyond endurance. With Sara firmly caught in his enthrallment, he indulged himself, coaxing her to take enough blood for a true exchange. His body was hard and hot and aching with the need for relief, the need for the ecstasy of total fulfillment. He closed the wound in his chest and took possession of her mouth as he awakened her from the compulsion.</p><p>And then he was surging into her, wild and out of control, taking them closer and closer to the edge of a great precipice. Sara clung to him, her softer body rising to meet his with a wild welcome. Falcon lifted his head to look at her, wanting to see the love in her eyes, the welcome, the intense need for him. Only him. No other. It was there, just as when she had first recognized him. It was deep within her soul, shining through her eyes for him to see. Sara belonged to him. And he belonged to her.</p><p>Fire rushed through him, through her. A fine sheen of sweat coated their skin. His hands found hers and they moved together, fast and hard and incredibly tender. She felt him swell within her, saw his eyes glaze, and her own body tightened, muscles clenching and rippling with life. His name caught in her throat, his breath left his lungs as they rushed over the edge together.</p><p>They lay for a long while, holding one another, their bodies tangled together, skin to skin, his thigh over hers, in between hers, his mouth and hands still exploring. Sara cradled him to her, tears in her eyes, unbelieving that he was in her arms, in her body, one being. She would never be alone. He filled her heart and her mind the way he filled her body. \"We fit,\" he murmured softly. \"A perfect fit.\"</p><p>\"Did you know it would be like this? So wonderful?\" He moved then, rising from the bed and bringing her up with him, taking her to the shower. As the water streamed off them, he licked the water from her throat, followed the path of several beads along her ribs. Sara retaliated by tasting his skin, sipping the water beads as they ran low along his flat, hard belly. Her mouth was hot and tight, so that he had to have her again. And again. He took her there in the shower. They made it as far as the small dresser, where he found the sight of her bottom too perfect to ignore. She was receptive, as hot and as needy as Falcon, never wanting the night to end.</p><p>The early morning light filtered through the closed curtains. They lay together on the bed, talking together, holding each other, hands and mouths stroking caresses in between words. Sara couldn't remember laughing so much; Falcon hadn't thought he knew how to laugh. Finally, reluctantly, he leaned over to kiss her.</p><p>\"You must go if you are going to do this, Sara. I want you high in the Carpathian Mountains before nightfall. I will rise and come straight to you.\"</p><p>Sara slid from the bed to stand beside the bust she had made so many years earlier. She didn't want to leave him. She wanted to remain curled up beside him for the rest of her life.</p><p>Falcon didn't need to read her mind to know her thoughts; they were plain on her transparent face. For some reason, her misgivings made it easier for him to allow her to carry out her plans. He stood up, his body crowding close to hers. He needed sleep; he needed to go to ground and fully heal. Mostly he needed to be with Sara.</p><p>\"I'm afraid that if I leave, I might never get the children. The officials are disturbed because I'm asking for all seven of them and there are no records.\" Sara's fingers twisted together in agitation.</p><p>\"Mikhail will be able to get rid of the red tape for us. He has many businesses in this area and is well known.\" Falcon brought her fingers to the warmth of his mouth to calm her. \"I have not been to my homeland in many years, but I am well aware of everything that is happening. He will be able to assist us.\"</p><p>\"How do you know so much if you've been away?\" Sara wasn't ready to trust a complete stranger with something so important as the children.</p><p>He smiled and tangled his fingers in her hair. \"The Carpathian people speak on a common mental pathway. I hear when hunters have gone through the land or some trauma has taken place. I heard when our Prince nearly lost his lifemate. Not once, but on two occasions. I heard when he lost his brother and then his brother returned to him. Mikhail will assist you. When you reach the area, he will find you in the evening and you will be under his protection. I will rise as soon as possible and come straight to you. He will assist us in finding a good location for our home. It will be near him and within the protection of all Carpathians. I have marked the trails for you in the mountains.\" Falcon bent his head to the temptation of her breast, his tongue lapping at the tight, rosy peak. His hair skimmed over her skin like so much silk. \"You must be very careful, Sara. You cannot think you are safe because it is daylight. The undead are locked within the earth, but they are able to control their minions. This vampire is an ancient and very powerful.\"</p><p>Her body caught fire, just like that, liquid flames rushing through her bloodstream. \"I will be more than careful, Falcon. I've seen what he does. I'm not going to doing anything silly. You don't have to worry. After I contact my friends and get a call through to my lawyer, I'll be going straight to the mountains. I'll find your people,\" she assured. Her heart was beating a little too fast at that thought, and she knew he heard it. Her own hearing was far more acute than it had been, and the thought of food made her feel slightly sick. Already she was changing, and the idea of being separated from Falcon was frightening. Sara lifted her chin determinedly and flashed him a reassuring smile. \"Once I set everything up, I'll get on the road.\" Her fingers were continually sliding over the bust of Falcon's head, lovingly following the grooves marking the waves in his hair.</p><p>Watching her, knowing that statue had been her solace in years past, Falcon felt his heart turn over. He gathered her close to him, his touch possessive, tender, as loving as he could make it. \"You will not be alone, Sara. I will heed your call, even in my most vulnerable hour. Should your mind start to play tricks on you, telling you I am dead to you, call me and I will answer.\"</p><p>Sara molded her body against his, clinging to him, holding him close so that he felt real and strong and very solid. \"Sometimes I think maybe I dreamed of you for so long I'm hallucinating, that I made you up and any minute you'll disappear,\" she confessed softly.</p><p>His arms tightened until he was nearly crushing her against him, yet there was great tenderness in the way he held her. \"I never dared to dream, even to hope. I had accepted my barren existence. It was the only way to survive and do my duty with honor. I am not ever going to leave you, Sara.\" He didn't tell her he was terrified at the thought of going to ground while she faced danger on the surface. She was a strong woman, and she had survived a long, deadly duel with the vampire completely on her own. He couldn't find it in him to insist she do things his way simply for his comfort.</p><p>Sara was touching his mind, could read his thoughts, the intensity of his fear for her safety. A wave of love swept through her. She turned her face up to his, hungrily seeking his mouth, wanting to prolong her time with him. His mouth was hot and dominant, as hungry as hers. As demanding. A fierce claim on her. He kissed her chin, her throat, found her mouth again, devouring her as if he could never get enough. There was an edginess to his kiss now, an ache. A need.</p><p>Sara's leg slid up his leg to wrap around his waist. She pressed against the hard column of his thigh, grinding against him, so that he felt her invitation, her own demand, hot and wet and pulsing with urgency.</p><p>Falcon simply lifted her in his arms, and she wrapped both legs around his waist. With her hands on his shoulders, her head thrown back, she lowered her body to the thick hardness of his. He pressed against her moist entrance, making her gasp, cry out as he slowly, inch by inch, filled her completely. Sara threw back her head, closed her eyes as she began to ride him, losing herself completely in Falcon's dark passion. They took their time, a long, slow tango of fiery heat that went on and on as long as they dared. They were in perfect unison, reading each other's minds, moving, adjusting, giving themselves completely, one to the other. When they were spent, they leaned against the wall and held one another, their hearts beating the same rhythm, tears in their eyes. Sara's head was on his shoulder and Falcon's head rested on hers.</p><p>\"You cannot allow anything to happen to yourself, Sara,\" he cautioned. \"I have to go now. I cannot wait much longer. You know I cannot be without you. You will remember everything I have said to you?\"</p><p>\"Everything.\" Sara tightened her hold on him. \"I know it's crazy, Falcon, but I love you. I really do. You've always been with me when I needed you. I love you.\"</p><p>He kissed her, long and tender. Incredibly tender. \"You are my love, my life.\" He whispered it softly and then he was gone. Sara remained leaning against the wall, her fingers pressed against her mouth for a few moments. Then she sprang into action.</p><p>She worked quickly, packing a few clothes and tossing them in her backpack, making several calls to ask friends to keep an eye on the children until she could return. She had every intention of coming back for them as soon as she sorted out the extensive paperwork and set up a home for them. She was on the road heading toward the Carpathian Mountains within an hour.</p><p>She needed the darkness of sunglasses, although the day was a dreary gray with ominous clouds overhead. Her skin prickled with unease as rays of sunlight pushed through the thick cloud covering to touch her arm as she drove. She tried not to think about Falcon locked deep within the ground. Her body was wonderfully sore. She could feel his touch on her, his possession, and just the thought of him made her hot with renewed desire. She couldn't prevent her mind from continually seeking his. Each time she touched on the void, her heart would contract painfully, and it would take tremendous effort to control her wild grief. Every cell in her body demanded that she go back, find him, make certain he was safe.</p><p>Sara tilted her chin and kept driving, hour after hour, leaving the cities for smaller villages until she was finally in a sparsely populated area. She stopped twice to rest and stretch her cramped legs, but continued steadily, always driving up toward the region Falcon had so carefully marked for her. She was concentrating so hard on finding the trail leading into wild territory that she was nearly hit by another vehicle as it overtook her and roared by. It shot past her at breakneck speed, a larger, much heavier truck with a camper. She was forced to veer off the narrow track to keep from being shoved off the trail. The vehicle went by her so quickly she nearly missed seeing the little faces peering out at her from the window of the camper shell. She nearly missed the sounds of screams fading into the forest.</p><p>Sara froze, her mind numb with shock, her body nearly paralyzed. The children. Her little ones, the children she had promised safety and a home. They were in the hands of a puppet, a ghoul. The walking dead. The vampire had taken a human, enslaved him, and programmed the creature to take her children as bait. She should have known, should have guessed he would discover them. She gave chase, hurtling along the narrow, rutted trail, clinging to the steering wheel as her truck threatened to break apart.</p><p>Two hours later, she was completely and hopelessly lost. The ghoul was obviously aware that she was following and it simply drove where no vehicle should have been able to go, racing dangerously through hairpin turns and smashing his way through vegetation. Sara attempted to follow, driving at breakneck speed through the series of turns, wheels bouncing over the rough pits in the roads. Once a tree was down directly across her path and she had to take her truck deeper into the forest to get around it. She was certain the ghoul had shoved the tree there to block her pursuit, to delay her. The trees were so close together, they scraped the paint from the sides of her truck. She couldn't believe she could possibly have lost the other vehicle; there weren't that many roads to turn onto. She tried twice to look at the map on the seat beside her, but with the terrible jouncing, it was impossible to focus. Branches scraped the windshield; twigs snapped off with an ominous sound.</p><p>With her arms aching and her heart pounding, Sara managed to maneuver her truck back onto a faint trail that might pass for a road. It was very narrow and ran along a deep, rocky ravine that looked like a great crack in the earth. In places, the boulders were black and scarred as if a war had taken place. The branches slapped at her truck as it rushed through the trees along the winding road. She would have to pull over and consult the map Falcon had given her.</p><p>His name immediately brought a welling of grief, of fear that he was lost to her, but Sara attempted to push the false emotion aside, grateful that he had prepared her for such a possibility. A sob welled up, choking her; tears blurred her vision but she wiped them away, wrenching at the wheel determinedly when her truck nearly bounced off the road from a particularly deep rut.</p><p>This couldn't be happening. The children, her children in the hands of the vampire's evil puppet. A flesh-eating ghoul. Sara wanted to continue driving as fast as she could, terrified that if she stopped she would never be able to catch them. She was well aware that it was late afternoon and once the ghoul delivered the children to the vampire, she had little hope of saving them.</p><p>Sara sighed softly and slowed the truck with great reluctance, pulling to the side of the trail. A steep cliff rose up sharply on her left. It took tremendous discipline to force herself to stop her vehicle and spread the map out in front of her. She needed to look for places where she could have gotten off the track, where the ghoul could have gotten away from her. She found she was nearly choking with grief. She shoved the door open and, leaving the vehicle running, jumped out where she could breathe the cool, crisp, fresh air.</p><p>Falcon.</p><p>She breathed his name. Wanted him. Dashing the tears away, Sara grabbed the map from the seat and stared down at the clearly marked trail. Where had the ghoul turned off? How had she missed it? She had been driving as fast as she dared, yet she had still lost sight of the children.</p><p>A terrible sense of failure assailed her. She spread the map out on the hood of the truck and glared at the markings, waiting for inspiration, for some tiny clue. Her fingernails beat out a little tattoo of frustration on the metal hood. All around her was the sound of the wind whipping through the trees and out over the cliffs into empty space. But some sixth sense warned her she was not alone.</p><p>Sara turned her head. The creature was lumbering toward her, his blank expression a hideous reminder that he was no longer human. There would be no reasoning with him, no pleading with him. He had been programmed by a master of cunning and evil. She let out her breath slowly, carefully, centering herself for the attack. Sara crouched lower on the balls of her feet, her mind clear and calm as the thing neared her. Its eyes were fixed on her, its fingers clenching and unclenching as it shuffled forward. She didn't dare allow it to get its hands on her. Her world narrowed to the thing approaching her, her mind clear, as she knew it would have to be.</p><p>She waited until the creature was nearly on top of her before she moved. She used her speed, whirling in a spin, generating power as her leg lashed out, the edge of her foot catching the ghoul's kneecap in an explosion of violence. She sprang away, out of reach of those clawed hands. The creature howled loudly, spittle spraying into the air, a thick drool oozing from the side of its mouth. The eyes remained dead and fixed on her as its leg buckled with an audible crack. Unbelievably, it lurched toward her, dragging its useless leg but coming at her steadily.</p><p>Sara knew its kneecap was broken, yet it continued toward her relentlessly. Sara had faced such a thing before, and she knew it would keep coming even if it had to drag itself on the ground. She angled sideways, circling to the ghoul's left in an attempt to slide past it. It bothered her that she couldn't hear the children, that none of them were crying or yelling for help. With her hearing so acute. Sara was certain she would have been able to hear whimpers coming from the ghoul's truck, but there was an ominous silence.</p><p>She stood her ground, shaking her arms to keep them loose. The ghoul swiped at her with its long arm, its huge, hamlike fist missing her face as she ducked and slammed her foot into its groin, then straight up beneath its chin. It howled, the sound loud and hideous, its body jerking under the assault, but it only rocked backward, jolted for a moment. Sara had no choice but to slip out of its reach.</p><p>It was a lesson in sheer frustration. No matter how many times she managed to score a kick or hit, the creature refused to go down. It howled, spittle exploding from its mouth, but its eyes were always the same, flat and empty and fixed on her. It was like a relentless machine that never stopped. As a last resort, Sara tried luring it near to the edge of the ravine in the hope that she could push it over, but it stood for a moment, breathing heavily, and then turned unexpectedly and lumbered away from her into heavier brush and trees.</p><p>Sara hastily scrambled to her truck, her heart pounding heavily. A thunderous crash made her swing her head around. To her horror, the ghoul's heavier vehicle was mowing down brush and even small trees, roaring out of the forest like a charging elephant, aimed straight at the side of her truck. More out of reflex than rational thought, her foot slammed down hard on the accelerator.</p><p>Her truck slewed sideways, fishtailed, the tires spinning in the dirt. Sara's heart nearly stopped as the larger vehicle continued straight at her. She could see the driver's face as it loomed closer. It was masklike, the eyes dead and flat. The ghoul appeared to be drooling. She could hear the screams of the children, frightened and alone in the madness of a world they couldn't hope to understand. At least they were alive. She had been afraid that their former silence meant the ghoul had murdered them.</p><p>The truck hit the side of hers, buckling the door in on her and shoving her vehicle closer to the edge of the steep ravine. Sara knew she was going to go over the crumbling cliff. Her small truck slid, metal grinding, children screaming, the noise an assault on her sensitive ears. A strange calmness invaded her, a sense of the inevitable. Her fingers wouldn't let go of the steering wheel, yet she couldn't steer, couldn't prevent the truck from sliding inch by inch, foot by foot toward the edge of the cliff.</p><p>Two wheels went over the edge, the truck tilted crazily, and then she was falling, tumbling through the air, slamming into the ravine, sliding and rolling. The seatbelt tightened, a hard jolt, biting into her flesh, adding to the mind-numbing pain.</p><p>Falcon.</p><p>His name was a soft sigh of regret in her mind. A plea for forgiveness.</p><p>Falcon was wrenched from his slumber, his heart pounding, his chest nearly crushed in suffocation. He was far from Sara, unable yet to aid her. He would build a monstrous storm to help protect his eyes so he could rise early, but he still would not reach her in time.</p><p>Sara.</p><p>His life. His heart and soul. Terror filled him. Took him like a crushing weight.</p><p>Sara.</p><p>His Sara, with her courage and her capacity for love.</p><p>She was already in the Carpathian Mountains, caught in the trap the vampire had laid for her. He had no choice. Everyone of Carpathian blood would hear, and that included the undead. It was a risk, a gamble. Falcon was an ancient presumed dead. He had never declared his allegiance to the new Prince and he might not be believed, but it was Sara's only chance.</p><p>Falcon summoned his strength and sent out his call.</p><p>Hear me, brethren. My lifemate is under attack in the mountains near you. You must go to her aid swiftly as I am far from her. She is hunted by an ancient enemy and he has sent his puppets to acquire her. Rise and go to her.! Warn all within my hearing, I am Falcon, a Carpathian of ancient blood, and I will be watching to protect her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There was a swirling fear in Sara's mind, in his. Falcon burst through the soil and into the sky. Light assailed his sensitive eyes and burned his skin, but it didn't matter. Nothing mattered except that Sara was in danger. One moment he was merged mind to mind with Sara; in the next microsecond of time, there was a blank void. He had an eternity to feel the helpless terror roiling in his gut, the fist clamping his heart like a vise, the emptiness that had been his world, now unbearable, unthinkable, a blasphemy after knowing Sara. Falcon forced his mind to work, reaching relentlessly into that blank void for his very soul. For his life. For love.</p><p>Sara. Sara, answer me. Wake now. You must wake. I am on my way to you, but you must awaken. Open your eyes for me.</p><p>He kept his voice calm, but the compulsion was strong, the need in him raw.</p><p>Sara, you must wake.</p> <p>The voice was far away, coming from within her throbbing head. Sara heard her own groan, a foreign sound. She was raw and hurting everywhere. She didn't want to obey the soft command, but there was a note she couldn't resist. The voice brought with it awareness, and with awareness came pain. Her heart began to pound in terror.</p><p>She had no idea how long she had been unconscious in the wreckage of the truck, but she could feel the metal pressing on her legs and glass cutting her body. She was trapped in the twisted metal, shattered glass all around her, blood running down her face. She didn't want to move, not when she heard movement close to her. She squeezed her eyes shut and willed herself to slip back into oblivion.</p><p>Relief washed over Falcon, through him, shook him. For a moment he went perfectly still, nearly falling from the sky, nearly unable to hold the image he needed to stay aloft. His mind was fully merged with Sara's, buried within hers, worshiping, examining, nearly numb with happiness. She was alive. She was still alive! Falcon worked at controlling his body's reaction to the sheer terror of losing her, the unbelievable relief of knowing she was alive. It took discipline to lower his heart rate, to steady his terrible trembling. She was alive, but she was trapped and hurt.</p><p>Sara, piccola, do as I ask, open your eyes.</p><p>Keeping his voice gentle, Falcon gave her no choice, burying a compulsion within the purity of his tone. He felt pain sweeping through her body, a sense of claustrophobia. She was disoriented; her head was pounding. Now his fear was back again in full force, although he kept it hidden from her. Instead, it was trapped in his heart, in his deepest soul, a terror such as he had never known before. He was moving fast, streaking across the sky as quickly as possible, uncaring of the disturbance of power, uncaring that all ancients in the area would know he was racing toward the mountains. She was alone, hurt, trapped, and hunted.</p> <p>Sara's eyes obeyed his soft command. She looked around her at the crushed glass, the twisted wreckage, and the sheered-off top of her truck. Sara wasn't certain she was still actually inside the vehicle. She couldn't recognize it as a truck any longer. It looked as if she were trapped in a smashed accordion. The sun was falling in the mountains, a shadow spreading across the rocky terrain.</p><p>She heard a noise, the scrape of something against what was left of her truck, and then she was looking into the face of a woman. Sara's vision was blurry, and it took a few moments of blinking rapidly to bring the woman into focus. Sara remembered how she had gotten in her predicament, and it frightened her to think of how much time might have past, how close the ghoul might be. She tried to move, to look past the woman. When she moved, her body screamed in protest and a shower of safety glass fell around her. Her dark glasses were missing, and her eyes burned so that they wept continually.</p><p>\"Lie quietly,\" the woman said, her voice soothing and gentle. \"I am a doctor and I must assess the severity of your injuries.\" The stranger frowned as she lightly took Sara's wrist.</p><p>Sara felt very disoriented, and she could taste blood in her mouth. It was far too much of an effort to lift her head. \"You can't stay here. Something was chasing me. Really, leave me here; I'll be fine. I've got a few bruises, nothing else, but you aren't safe.\" Her tongue felt thick and heavy and her tone shocked her, thin and weak, as if her voice came from far away. \"You aren't safe,\" she repeated, determined to be heard.</p><p>The woman was watching her carefully, almost as if she knew what Sara was thinking. She smiled reassuringly. \"My name is Shea, Shea Dubrinsky. Whatever is chasing you can be dealt with. My husband is close by and will aid us if necessary. I'm going to run my hands over you and check you for injuries. If you could see your truck, you would know what a miracle it is that you survived.\"</p><p>Sara was feeling desperate. Shea Dubrinsky was a beautiful woman, with pale skin and wine-red hair.</p> <p>She looked very Irish. She was serene despite the circumstances. It was only then that the name registered. \"Dubrinsky? Is your husband Mikhail? I've come looking for Mikhail Dubrinsky.\"</p><p>Something flickered in Shea Dubrinsky's eyes behind her smoky sunglasses. There was compassion, but something else, too, something that made Sara shiver. The doctor's hands moved over her impersonally, but thoroughly and gently. Sara knew that this woman, this doctor, was one of them. The others.</p><p>Right now Shea Dubrinsky was communicating with someone else in the same manner Sara did with Falcon. It frightened Sara nearly as much as the encounter with the ghoul. She couldn't tell the difference between friend and foe.</p><p>Falcon.</p><p>She reached for him. Needed him. Wanted him with her. The accident had shaken her so that it was difficult to think clearly. Her head ached appallingly and her body was shaky, trembling beyond her ability to control it. It was humiliating for someone of Sara's strong nature.</p><p>She is one of them. I am here. Do not fear. No one can harm you. Look directly at her, and I will observe what you see.</p><p>There was complete confidence in Falcon's voice and he swamped her with waves of reassurance, the feel of strong arms stealing around her, gathering her close, holding her to him. The feeling was very real and gave her confidence.</p><p>She speaks to another. She says her name is Dubrinsky and her husband is close. I know she speaks to him. She has called him to us.</p> <p>Sara said, it with complete conviction. The woman looked calm and professional, but Sara felt what was happening, knew that Shea Dubrinsky was communicating with some other even though Sara could not see anyone else.</p><p>Sara gasped as the woman's hands touched sore places. She tried to smile at the other woman. \"I'm really okay, the seat belt saved me, although I hurt like crazy. You have to get away from here.\" She was feeling a bit desperate searching for signs of the ghoul. Sara tried to move and groaned as every muscle in her body protested. Her head pounded so that even her teeth hurt.</p><p>\"Stay very quiet for just a moment,\" Shea said softly, persuasively, and Sara recognized a slight \"push\" toward obedience. Falcon was there with her, sharing her mind, so she wasn't as afraid as she might have been. She believed in him. She knew he would come, that nothing would stop him from reaching her side. \"Mikhail Dubrinsky is my husband's brother. Why are you seeking him?\" Shea spoke casually, as if the answer didn't matter, but once again, there was that \"push\" toward truth.</p><p>Sara made an attempt to raise her hand, wanting to remove the broken glass from her hair. Her head was aching so much it made her feel sick. \"For some reason, compulsion doesn't work very well on me. If you are going to use it, you have to use it with much more strength.\" She was struggling to keep her eyes open.</p><p>Sara! Focus on her. Stay focused!</p><p>Falcon's command was sharp.</p><p>I sent a call ahead to my people to alert them to find you. Mikhail did have brothers, but you must remain alert. I must see through your eyes. You must stay awake.</p><p>Shea was grinning at her a little ruefully. \"You are familiar with us.\" She said it softly. \"If that is the case, I want you to hold very still while I aid you. The sun is falling fast. If you are hunted by a puppet of the undead, the vampire will be close by and waiting for the sun to sink. Please remain very quiet while I do this.\" Shea was watching Sara's face for a reaction.</p><p>There was a movement behind Shea and she turned her head with a loving smile. \"Jacques, we have found the one we were seeking. She has a lifemate. He is watching us through her eyes. She is one of us, yet not.\" Out of courtesy she spoke aloud. There was a wealth of love in her voice, an intimacy that whispered of total commitment. She turned back to Sara. \"I will attempt to make you more comfortable, and Jacques will get you out of the truck so we may leave this place and get to safety.\" There was complete confidence in her gentle tones.</p><p>Sara wanted the terrible pounding in her head to go away. She couldn't shift her legs; the wreckage was entombing her as surely as a casket. Falcon's presence in her mind was the only thing that kept her from sliding back into the welcoming black void. She struggled to stay alert, watching Shea's every move. The unknown Jacques had not come into her line of vision, but she felt no immediate threat.</p><p>Shea Dubrinsky was graceful and sure. There were no rough edges to her, and she seemed completely professional despite the bizarre way she was healing Sara. Sara actually felt the other woman inside her, a warmth, an energy flowing through her body to soothe the terrible aches, to repair from the inside out. She was amazed that the terrible pounding in her head actually lessened. The nausea disappeared.</p><p>Shea leaned over to unfasten the seat belt that was biting into Sara's chest. \"Your body has suffered a trauma,\" she said. \"There will be extensive bruising, but you're very lucky. Once we are safe, I can make you much more comfortable.\" She moved out of the way to allow her lifemate access to the wreckage.</p><p>Sara found herself staring up at a man with a singularly beautiful face. His eyes, as he took off his sunglasses, were as old as time, as if he had seen far too much. Suffered far too much. He pushed the glasses onto Sara's face, bringing a measure of relief to her burning eyes. Shea brushed Jacques's hand with hers, the lightest of gestures, but it was more intimate than anything Sara had ever witnessed. She could feel the stillness in Falcon, could feel him gathering his strength should there be need.</p><p>\"Hold very still,\" Jacques cautioned softly. His voice held the familiar purity that seemed to be a part of the Carpathian species.</p><p>\"He has the children. Go after him. If you're like Falcon, you have to go after him and get the children back. He's taking them to the vampire.\"</p><p>Falcon, I'm all right. You must find the children and keep them from the vampire.</p><p>She was beginning to panic, thinking much more clearly now that the pain was receding.</p><p>Jacques grasped the steering column and gave a wrench, exerting strength so that it bent away from her, giving her more room to breathe. \"The ghoul will not reach the vampire. Mikhail has risen and he will stop the puppet from reaching his master.\" There was complete confidence in Jacques's soft voice. \"Your lifemate must be on his way, perhaps already close to us. All heard his warning, although he is not known to us.\" It was a statement, but Sara heard the question in his words.</p><p>She watched his hands push the crumbling wreckage from around her legs so that she could move. The relief was so tremendous she could feel tears gathering in her eyes. Sara turned her head away from the probing gaze of the stranger. At once warmth flooded her mind.</p><p>I am with you, Sara. I feel your injuries and your fear for the children, but this man would not lie to you. He is the brother of the Prince. I have heard of him, a man who has endured much pain and hardship, who was buried alive by fanatics. Mikhail will not fail to rescue the children. You go; don't worry about me. You make certain the children are safe!</p><p>She didn't know the Prince. She knew Falcon and she trusted him. If the children could be snatched away from the vampire, he would be the one to do it. And he was closer now, she was certain of it. His presence was much stronger and it took little effort to communicate with him. \"I am going to help you out of there,\" Jacques warned.</p><p>Sara had desperately wanted to be free of the wreckage of her truck, but now, faced with the prospect of actually moving, it didn't seem the best of ideas. \"I think I'll just sit here for the rest of my life, if you don't mind,\" she said.</p><p>To her shock, Jacques smiled at her, a flash of white teeth that lit his ravaged eyes. It was the last thing she'd expected of him, and she found herself smiling back. \"You do not frighten very easily, do you?\" he asked softly. He gave no sign that the light of day hurt his eyes, but she could see they were red and streaming. He endured it stoically.</p><p>Sara lifted a trembling hand to eye level and watched it shake. They both laughed softly together. \"I'm Sara Marten. Thanks for coming to my rescue.\"</p><p>\"We could do no other, with your lifemate filling the skies with his declaration.\" The white teeth flashed again, this time reminding her of a wolf. \"I am Jacques Dubrinsky; Shea is my lifemate.\"</p><p>Sara knew he was watching her closely to see what effect his words had on her. She knew Falcon was watching Jacques through her eyes, catching every nuance, sizing up the other man. And Jacques Dubrinsky was well aware of it, too.</p><p>\"I am going to lift you out of there, Sara,\" he said gently. \"Let me do the work. I have never dropped Shea, so you do not need to worry,\" he teased.</p><p>Sara turned her head to look at the other woman. She lifted an eyebrow. \"I don't think that's much of a reassurance. She's much smaller than I am.\"</p><p>Shea grinned at her, a quick, engaging smile that lit her entire face. \"Oh, I think he's up to the task, Sara.\"</p><p>Jacques didn't give her any more time to think about it. He lifted her out of the wreckage and carried her easily to a flat spot in the high grass, where his lifemate bent over her solicitously. The movement took Sara's breath away, sent pain slicing through her body. Shea carefully brushed glass from Sara's hair and clothing. \"You have to expect to be a bit shaky. Tell your lifemate we are going to take you to Mikhail's house. You will be safe there, and Raven and I can look after you while Jacques joins the men in the hunt for these lost children.\"</p><p>I want the male to stay near you while I am away.</p><p>Sara heard the underlying irony in Falcon's voice and she laughed softly. The thought of any male near Sara was disconcerting to him, but he needed to know she was safe.</p><p>Sara's relief that Falcon was close and was searching for the children was enormous. She could breathe again, yet, inexplicably, she wanted to cry.</p><p>Shea knelt beside her, took her hand, and looked into her eyes. \"It's a natural reaction, Sara,\" she said softly. \"It's all right now, everything is going to be all right.\" Unashamedly she used her voice as a tool to soothe the other woman. \"You are not alone; we really can help.\"</p><p>\"Falcon says the vampire is ancient and very powerful,\" Sara said in warning. She was struggling to appear calm and to control the trembling of her body. It was humiliating to be so weak in front of strangers.</p><p>Jacques swung his head around alertly, his eyes black and glittering, his entire demeanor changed. All at once he looked menacing. \"Is she able to travel, Shea?\"</p><p>Shea was straightening slowly, a wary look on her beautiful face. A flutter of nerves in Sara's stomach blossomed into full-scale fear. \"He's here, isn't he? The ghoul?\" She bit her lip and made a supreme effort to get to her feet. \"If he's close to us, then so are the children. He can't have handed them off to the vampire.\" To her horror, she only managed to get a knee under her before blackness began swirling alarmingly close.</p><p>\"The ghoul is making his way quickly to his master,\" Jacques corrected. \"The vampire probably has summoned the ghoul to him. The undead is sending his warning, a challenge to any who dare to interfere with his plans.\"</p><p>Shea slipped her arm around Sara to keep her from falling. \"Do not try to move yet, Sara. You are not ready to stand.\" The woman turned to her lifemate. \"We can move her, Jacques. I think it best to hurry.\"</p><p>They know something I don't.</p><p>Sara rubbed her pounding head, frustrated that she was unable to see or hear the things heralding danger.</p><p>Something is wrong.</p><p>At once she could feel Falcon's reassurance, his strong arms, warmth flooding her, though he was many miles away.</p><p>The vampire is locked within his lair, but he is sending his minions across the land searching for you. The male wishes to take you to safety. Do you really want me to go with him? I feel so helpless, Falcon. I don't think I could fight my way out of a paper bag. Yes. Sara, it is best. I will be with you every moment.</p><p>The sky was becoming dark, not because the sun was setting but because the winds had picked up, whirling faster and faster, gathering dust, dirt, and debris together, drawing it into a towering mass. Swarms of insects assembled, masses of them, the noise of their wings rivaling the wind.</p><p>The children will be so afraid</p><p>Sara reached out for assurance.</p><p>Falcon wanted to gather her close, hold her to him, shelter her from the battles that would surely take place. He sent her warmth, love.</p><p>I will find them, Sara, You must stay alert so I can guard you while we are apart.</p><p>For some reason, Falcon's words humbled her. She wanted to be at his side. She needed to be at his side.</p><p>Jacques Dubrinsky leaned down to Sara. \"I understand how you feel. I dislike to be away from Shea. She is a researcher, very important to our people.\" He looked at his lifemate as he gathered Sara easily into his arms. His expression was tender, mixed with pride and respect. \"She is very single-minded, focused on what she is doing. I find it somewhat uncomfortable.\" He grinned ruefully, sharing his confession candidly.</p><p>\"Wait!\" Sara knew she sounded panic-stricken. \"There's a backpack in the truck, I can't leave it. I can't.\" Falcon's diary was in the wooden box. She carried it everywhere with her. She was not about to leave it.</p><p>Shea hesitated as if she might argue, but obligingly rummaged around in the wreckage until she triumphantly came up with the backpack. Sara had her arms outstretched and Shea handed it to her.</p><p>Jacques lifted an eyebrow. \"Are you ready now? Close your eyes if traveling swiftly bothers you.\"</p><p>Before she could protest, he was whisking her through space, moving so fast that everything around her blurred into streaks. Sara was happy to be away from the wreckage of her truck, from the fierce wind and the swarms of insects blackening the sky. She should have been afraid, but there was something reassuring about Jacques and Shea Dubrinsky. Solid. Reliable.</p><p>She had the impression of a large, rambling house with columns and wrap-around balconies. She had no time to get more than a quick look before Jacques was striding inside. The interior was rich with burnished wood and wide open spaces. It all blended together - art, vases, exquisite tapestries, and beautiful furniture. Sara found herself in a large sitting room, pressed into one of the plush couches. The heavy drapes were pulled, blotting out all light so only soft candles lit the room, a relief to eyes sensitive to the sun.</p><p>Sara removed Jacques's sunglasses with a shaky hand. \"Thank you. It was thoughtful of you to lend them to me.\"</p><p>He grinned at her, his teeth gleaming white, his dark eyes warm. \"I am a very thoughtful kind of man.\" Shea groaned and rolled her eyes. \"He thinks he's charming, too.\"</p><p>Another woman, short with long black hair, glided into the room, her slender arm circling Jacques's waist with an easy, affectionate manner. \"You must be Sara. Shea and Jacques alerted me ahead of time that they were bringing you to my home. Welcome. I've made you some tea. It's herbal. Shea thinks your stomach will tolerate it.\" She indicated the beautiful teacup sitting in a saucer on the end table. \"I'm Raven, Mikhail's lifemate. Shea said you were searching for Mikhail.\"</p><p>Sara glanced at the tea, leaned back into the cushions, and closed her eyes. Her head was throbbing painfully and she felt sick again. She wanted to curl up and go to sleep. Tea and conversation sounded overwhelming.</p><p>Sara!</p><p>Falcon's voice was stronger than ever.</p><p>You must stay focused until I am at your side to protect you. I do not know these strangers. I believe they do not intend you harm, but I cannot protect you if there be need, unless you stay alert.</p><p>Sara made an effort to concentrate. \"I have had a vampire hunting me for fifteen years. He killed my entire family and he's stolen children he knows matter a great deal to me. All of you are in great danger.\"</p><p>Jacques's eyebrows shot up. \"You eluded a vampire for fifteen years?\" There was a wealth of skepticism in his voice.</p><p>Sara turned her head to look at Shea. \"He isn't nearly as charming when you've been around him awhile, is he?\"</p><p>Shea and Raven dissolved, into laughter. \"He grows on you, Sara,\" Shea assured.</p><p>\"What?\" Jacques managed to look innocent. \"It is quite a feat for anyone to escape a vampire for fifteen years, let alone a human. It is perfectly reasonable to think there has been a mistake. And I am charming.\"</p><p>Raven shook her head at him. \"Don't count too heavily on it, Jacques. I have it on good authority that the inclination to kick you comes often. And humans are quite capable of extraordinary things.\" She picked several pieces of glass from Sara's clothes. \"It must have been terrifying for you.\"</p><p>\"At first,\" Sara agreed tiredly, \"but then it was a way of life. Running, always staying ahead of him. I didn't know why he was so fixated on me.\"</p><p>Shea and Raven were lighting aromatic candles, releasing a soothing scent that seeped into Sara's skin, made its way into her lungs, her body, and lessened the aches. \"Sara,\" Shea said softly, \"you have a concussion and a couple of broken ribs. I aligned the ribs earlier, but I need to do some work to ensure that you heal rapidly.\"</p><p>Sara sighed softly. She just wanted to sleep. \"The vampire will come if he finds out I'm here, and you'll all be in danger. It's much safer if I keep moving.\"</p><p>\"Mikhail will find the vampire,\" Jacques said with complete confidence.</p><p>Allow the woman to heal you, Sara. I have heard rumors other. She was a human doctor before Jacques claimed her.</p><p>Sara frowned as she looked at Shea. \"Falcon has heard of you. He says you were a doctor.\"</p><p>\"I still am a doctor,\" Shea reassured gently. \"Thank you for your warning and your concern for us. It does you credit, but I can assure you, the vampire will not be allowed to harm us here. Allow me to take care of you until your lifemate arrives.\" Her hands were very gentle as they moved over Sara, leaving behind a tingling warmth. \"Healing you as a Carpathian rather than a human doctor is not really all that different. It is faster, because I heal from the inside out. It won't hurt, but it feels warm.\"</p><p>Raven continued to remove glass from Sara's clothing. \"How did you meet Falcon? He is unknown to us.\" She was using a soft, friendly voice, wanting to calm Sara, to reassure her that she would be safe in their home. She also wanted any information available to be transferred to her own lifemate.</p><p>Sara leaned into the cushions, her fingers tight around the strap of her backpack. She could hear the wind, the relentless, hideous wind as it howled and moaned, screamed and whispered. There was a voice in the wind. She couldn't make out the words, but she knew the sound. Rain lashed at the windows and the roof, pounded at the walls as if demanding entrance. Dark shadows moved outside the window - dark enough, evil enough to disturb the heavy draperies. The material could not prevent the shadows from reaching into the room. Sparks arced and crackled, striking something they couldn't see. The howls and moans increased, an assault on their ears.</p><p>\"Jacques.\" Shea said the name like a talisman. She slipped her hand into her lifemate's larger one, looking up at him with stark love shining in her eyes.</p><p>The man pulled his lifemate closer, gently kissed her palm. \"The safeguards will hold.\" He shifted his stance, gliding to place his body between the window and the plush chair where Sara was sitting. The movement was subtle, but Sara was very aware of it.</p><p>The sound of the rain changed, became a hail of something heavier hitting the windows and pelting the structure. Raven swung around to face the large rock fireplace. Hundreds of shiny black bodies rained down from the chimney, landing with ugly plops on the hearth, where bright flames leaped to life, burning the insects as they touched the stones. A noxious odor rose with the black smoke. One particularly large insect rushed straight toward Sara, its round eyes fixed malevolently on her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Falcon, in the form of an owl, peered at the ground far below him. He could see the ghoul's truck through the thick vegetation. It was tilted at an angle, one tire dangling precariously over a precipice. A second owl slipped silently out of the clouds, unconcerned with the wicked wind or lashing rain. Falcon felt a stillness in his mind, then a burst of pleasure, of triumph, a glowing pride in his people. He knew that lazy, confident glide, remembered it well. Mikhail, Vladimir Dubrinsky's son, had his father's flair.</p><p>Falcon climbed higher to circle toward the other owl. It had been long since he had spoken to another Carpathian. The joy he felt, even with a battle looming, was indescribable. He shared it with Sara, his lifemate, his other half. She deserved to know what she had done for him; it was she who had enabled him to feel emotion. Falcon went to earth, landing as he shifted into his own form.</p><p>Mikhail looked much as his father had before him. The same power clung to him. Falcon bowed low, elegantly. He reached out, clasping Mikhail's forearms in the manner of the old warriors. \"I give you my allegiance, Prince. I would have known you anywhere. You are much like your father.\"</p><p>Mikhail's piercing black eyes warmed. \"You are familiar to me. I was young then. You were lost to us suddenly, as were so many of our greatest warriors. You are Falcon, and your line was thought to have been lost when you disappeared. How is it you are alive and yet we had no knowledge of you?\" His grip was strong as he returned the age-old greeting between warriors of their species. His voice was warm, mellow even, yet the subtle reprimand was not lost on Falcon.</p> <p>\"Your father foresaw much in those days, a dark shadowing of the future of our people.\" Falcon turned toward the truck teetering so precariously. He began to stride toward the vehicle, with Mikhail in perfect synchronization. They moved together almost like dancers, fluid and graceful, full of power and coordination. \"He called us together one night, many of us, and asked for volunteers to go to foreign lands. Vlad did not order us to go, but he was very much respected, and those of us who chose to do as he asked never thought of refusing. He knew you were to be Prince. He knew that you would face the extinction of our species. It was necessary for you to believe in your own abilities, and for all our people to believe in you and not rely on those of us who were older. We could not afford a divided people.\" Falcon's voice was gentle, matter-of-fact.</p><p>Mikhail's black eyes moved over Falcon's granite-honed face, the broad shoulders, the easy way he carried himself. \"Perhaps advice would have been welcomed.\"</p><p>A faint smile touched Falcon's sculpted mouth, hinted at warmth in the depths of his eyes. \"Perhaps our people needed a fresh, new perspective without the clutter of what once was.\"</p><p>\"Perhaps,\" Mikhail murmured softly.</p><p>The ghoul had climbed from the truck and moved around the vehicle as if examining it. It didn't look up at the two Carpathian males, or acknowledge their presence in any way. Suddenly it placed its back against the truck, dug its feet into the rocky soil, and began to strain.</p> <p>The sky erupted with black insects, so many the air seemed to groan with the numbers, raining from the sky with a fury equal to a tempest. From inside the truck, the children began to scream as the metal shrieked. The vehicle was being inched slowly but inevitably over the edge of the cliff.</p><p>Falcon put on a burst of preternatural speed, catching the ghoul by the shoulder and whirling it away from the truck. He trusted Mikhail to stop the children from going over. The insects were striking at him, stinging, biting, hitting his body, thousands of them, going for his eyes and nose and ears. Falcon was forced to dissolve into vapor, throwing up a quick barricade around himself as he reappeared behind the ghoul.</p><p>The creature swung around awkwardly, dragging one leg as it attempted to turn to face Falcon. Its eyes glowed a demonic red. It was making strange noises, somewhere between growling and snarling. It swiped at Falcon with razor-sharp nails, missed by inches. Falcon stayed just out of reach, watching closely. The ghoul was a mindless puppet to be used by its master. The vampire must have known that Falcon was an ancient, easily able to destroy such a creation, so it made little sense that the creature would attempt to fight him, yet that was exactly what the ghoul did. The macabre puppet grasped Falcon, fumbling to get its hands locked around Falcon's neck.</p><p>Falcon easily broke the grip, shattering the thick bones and wrenching the ghoul's head. The crack was audible despite the intensity of the wind and the loud clacking of the insects as they hit the ground. The ghoul seemed to glow for a moment, the eyes lighting an eerie orange in the darkness, the skin sloughing off as if the creature were a snake rather than a man.</p><p>\"Get those children out of here,\" Falcon called out gravely, backing away from the creature. The light coming from inside the ghoul was becoming brighter, giving off a peculiar luminescence. \"It is a trap.\"</p><p>Mikhail was tossing the children to safer ground. Three little girls and four boys. He leaped out of the way as the truck teetered precariously and then tumbled over the edge. He had shielded the children's minds, knowing they had been terror-stricken for most of the day. The oldest child, a boy, couldn't have been more than eight. Mikhail sensed that each of them was special in some way, each had psychic ability.</p> <p>Insects were raining from the sky, dropping around them to form thick, grotesque piles of squirming bodes. Although Mikhail had erected a barrier over them and had shielded their minds, the children were staring in wide-eyed horror at the bugs. Mikhail heard Falcon's soft warning, glanced at the ghoul, and immediately shifted his shape, becoming a long, winged creature, the fabled dragon. Using his mind to control the children, he forced them to climb onto his back. They clung to him, their bodies trembling, but they accepted what was happening without real comprehension. Mikhail took to the air, laying down a long red-orange flame, incinerating all of the hideous beetles and locusts within his range.</p><p>I will transport the children to safety. Go now!</p><p>Falcon was alarmed for the Prince, alarmed for the children. The ghoul was spinning, creating a peculiar whirlwind motion reminiscent of a mini tornado. The winds were furious, blowing the insects in all directions, even sucking them up into the sky. The glow was bright enough to hurt Falcon's sensitive eyes.</p><p>In all my long centuries of battles with the undead and their minions, this is a new phenomenon. New to me also.</p><p>Mikhail was winging quickly through the waning light in the sky, battling the ferocity of the wind and the thick masses of insects attacking from all directions.</p><p>The undead is indeed powerful to create this havoc while he still lies within his lair. He is without doubt an ancient. I sent word to your brother to wait to fight him, as I am certain this one is as old and as experienced as I am. I hope he listens to Sara.</p><p>Mikhail, in the body of the dragon, sighed. He hoped so, too. Immediately he touched Jacques's mind, relayed what had transpired and their conclusions.</p><p>Falcon moved carefully away from the ghoul, attempting to put distance between them.</p> <p>The undead baited a trap, drew us away from Sara using the children and the ghoul. He will go after her.</p><p>Each direction Falcon chose, the grotesque creature turned with him in perfect rhythm, matching his flowing motions as if they were dance partners.</p><p>Get out of here now, Mikhail. Do not wait for me. This thing has attached itself to me like a shadow. A lethal and difficult spell to break. He is a bomb. Get to Sara. I will not be happy if such a despicable creature harms you.</p><p>There was an edge of humor to Mikhail's soft voice. An edge of worry.</p><p>I am an ancient. This one will not defeat me. I am concerned only with the safety of you and the children. And with the delay in reaching Sara.</p><p>It was the truth. Falcon might not have seen such a thing before, but he had supreme confidence in his own abilities. Already he was working at removing the binding attachment from his cells. It was a deep shadowing, as though the ghoul had managed to embed its molecules into Falcon's. Falcon tried various methods but could not find where the binding was impressed into his body. The ghoul was white-hot, blossoming like a mushroom and emitting a strange low hum. Time was running out.</p><p>Falcon ran his hands down his arms, across his chest. At once he felt the strange warmth emanating from his chest. Of course. The four long furrows the vampire had carved into his chest! The undead had left the spell in Falcon's chest, spoor for the ghoul to recognize, to adhere itself to. Falcon transmitted the information immediately to the Prince as he hastily began to detach himself from the monstrous time bomb.</p><p>The humming was louder, pitched much higher as the insects clacked with more intensity. The bugs were in a kind of frenzy, flying in ail directions, swarming, attempting to scratch their way through the barrier Falcon had erected around himself. He had no time to think about poisonous insects; he had to turn his full attention to removing the hidden shadowing on his body. The vampire's fingerprints were etched deep beneath Falcon's skin.</p><p>Falcon glided quickly toward the ravine, drawing the ghoul away from the forest. As he twisted this way and that, taking the vampire's puppet with him at every step, he was examining his body from the inside out. He had missed those tiny prints marring his skin, pressed deeply into the lacerations he had already healed. So small, so lethal. He concentrated on scraping the nearly invisible marks from under his skin. It took tremendous discipline to work as he moved, using only his mind, leading the macabre ghoul right over the edge of the cliff. He was floating over empty space, enticing the unholy creature to take the last step that would send it plummeting to the rocks below. The explosion, when it came, could be contained deep within the ravine. Falcon worked rapidly, knowing that if the ghoul was attached to him, even by such tiny and invisible threads, the explosion would kill him.</p><p>The ghoul was in the air with him now, and Falcon began the descent slowly, taking the hideous thing where it could do no harm, even as he continued to find each print in the furrows on his chest. The whirling hot light suddenly shuddered, slipped, as if hanging by only a few precarious threads. The humming was now at fever-pitch, a merciless, unrelenting screaming in his head that made it difficult to think.</p><p>Falcon shut out the noise, increasing his speed, knowing he was close to throwing off the ghoul, knowing it was close to the end of its run. The vampire was waiting for sunset, holding Falcon away from Sara as surely as if he had imprisoned him. The ghoul pulsed with red-orange light through the white-hot glow just as Falcon sloughed off the last of the vampire's marks. The puppet began to fall, dropping away as Falcon rose swiftly toward the roiling clouds.</p><p>Falcon dissolved into mist as he rushed away from the screeching bomb. The explosion was monumental, a force that blew insect parts in all directions, carved a crater into the side of the ravine, and set the brush on fire. Falcon immediately doused the flames with rain, directing the heavy clouds over the steep ravine as he turned toward Mikhail's home, picking the directions out of the Prince's mind.</p><p>When Falcon made contact with Mikhail, he found him engaged in conversation with a human male, cautioning the man to protect the children. He knew he need not worry about the children; Mikhail would never place them in a dangerous situation.</p><p>Sara, I am some distance away but I will reach you soon. Falcon!</p><p>Sara pushed herself upright despite her dizziness, staring in horror at the hideous beetle scurrying across the floor toward her. It was staring directly at her, watching her, marking her. And she knew what it was. Just as Falcon could use her eyes to see what was happening around her, the vampire was using the beetle's. The hard shell was on fire, the smell atrocious, but it was moving unerringly toward her, the eyes fixed on her.</p><p>He knows where I am. He'll kill all these people.</p><p>She was terrified, but Sara couldn't live with more guilt. If this monster wanted her so badly, perhaps the solution was simply to walk out the door and find him.</p><p>No!</p><p>Falcon's voice was strong, commanding.</p><p>You will do as I say. Warn the male that this enemy is an ancient, most likely one of the warriors sent out by Mikhail's father who turned vampire. The sun has not yet set, we have a few minutes. The male must use delaying tactics until we arrive to aid him.</p><p>Jacques simply stepped on the large insect, flames and all, crushing the thing beneath his foot, smothering the flames. Sara cleared her throat and looked at Jacques with sorrow in her eyes. \"I'm so sorry. I didn't mean to bring this enemy to you. He's an ancient, Falcon says, most likely one of the warriors Mikhail's father sent out.\"</p><p>Raven smoothed back Sara's hair with gentle fingers. Jacques hunkered down so he was level with Sara. His expression was as calm as ever. \"Tell me what you know, Sara. It will aid me in battle.\"</p><p>Sara shook her head, had to suppress a groan as her head throbbed and pulsed with pain. \"Falcon says to delay the battle, to wait for him, and for Mikhail.\"</p><p>\"Heal her, Shea,\" Jacques ordered gently. \"The sun has not set and the vampire is locked deep within the earth. He knows where she is and will come to us, but the safeguards will slow him. We have time. Mikhail will make his way here, and her lifemate will come also. This ancient enemy is a powerful one.\"</p><p>The children, Falcon. What of the children?</p><p>Sara was finding it difficult to think, with the grotesque remains of the insect on the immaculate shining wood floor.</p><p>The children are safe, Sara. Do not worry about them. Mikhail has taken them to a safe house. A man, a human, known to him and our people, is there to watch over them. They will be safe while we are hunting your enemy.</p><p>Sara inhaled sharply. Hadn't the others seen what she had? The vampire had penetrated the safeguards and had found her, had watched her through the eyes of its servant. Now the children she wanted to adopt were being taken to a perfect stranger.</p><p>Who is this man? How do you know of him, Falcon? Maybe you should go there yourself. They must be so afraid. Mikhail trusts this man. His name is Gary Jansen, a friend to our people. He will look after the children until we have destroyed the vampire. We cannot afford to draw the undead to them a second time. Mikhail will not leave them frightened. He is capable of helping them to accept this human and their new situation.</p><p>Sara lifted her chin, trying to ignore the terrible pounding in her head. \"Do you know someone called Gary? Mikhail is taking the children to him.\" She knew she sounded anxious but she couldn't help it.</p><p>Shea laughed softly. \"Gary is a genius, a man very much involved with his work. He flew out here from the States to help me with an important project I'm working on.\" As she spoke she silently signaled her lifemate to lift Sara and transport her to one of the underground chambers below the house. \"I wish I'd been there to see the expression on his face when Mikhail showed up at the inn with several frightened children. Gary is a good man and very dedicated to helping us discover why our children are not surviving, why there are so few female children born, but I can't imagine him attempting to take care of little ones all by himself.\"</p><p>\"You are enjoying the thought way too much.\" Jacques's laughter was low, a pleasant sound in contrast with the loud, frightening noises outside the home. \"I cannot wait to tell the human you are pleased with his new role.\"</p><p>\"But he will take care of them.\" Sara sought reassurance even as Jacques lifted her high into his arms.</p><p>Raven nodded emphatically. \"Oh, yes, there's no need to worry. Gary would never abandon the children, and all Carpathians are bound to protect him should he have need. Your children will be very safe, Sara.\" As they moved through the house, she indicated a framed picture on the wall. \"That is my daughter, Savannah. Gary saved her life.\"</p><p>Sara peered at the picture as they went by. The young woman was beautiful, but she looked the same age as Raven. And she looked vaguely familiar. \"She's your daughter? She looks your age.\"</p><p>\"Savannah has a lifemate.\" Raven touched the frame in a loving gesture. \"When they are small, our children look very young, but their bodies grow at about the same rate as a human child for the first few years. It is only when our people reach sexual maturity that our growth rate slows. That is one reason we have trouble reproducing. It is rare for our women to be able to ovulate for a good hundred years after having a baby. It has happened, but it is rare. Shea believes it is a form of population control, just as most other species have built in controls. Because Carpathians live so long, nature, or God, if you prefer, built in a safeguard. Savannah will be returning home quite soon. They would have returned immediately upon their union, but Gregori, her lifemate, has received word of his lost family and wishes to meet with them first.\" Raven's voice held an edge of excitement. \"Gregori is needed here. He is Mikhail's second in command, a very powerful man. And, of course, I've missed Savannah.\"</p><p>Sara was suddenly aware that they were going swiftly through a passageway. Raven's chatter had distracted her from her headache and from the danger, but mostly from the fact that they were moving steadily downward, beneath the earth. She felt the leap of her heart and instantly reached out for Falcon. Mind to mind. Heart to heart.</p><p>We can only have a child once every hundred years.</p><p>She said the first thing she thought of, then was embarrassed that she had whispered a secret dream, now a regret. She longed for a house filled with children. With love and laughter. With all the things she had lost. All the things she had long ago accepted she would never have.</p><p>We have seven children, Sara, seven abandoned, half-starved, very frightened children. They will need us to sort out their problems, love them, and aid them with their unexpected gifts. The three girls may or may not be lifemates for Carpathians in sore need, but all will need guidance. We will have many children to love in the coming years. Whatever your dream, it is mine. We will have a home and we will fill it with children and laughter and love.</p><p>He was closer, he was on his way to her. Sara wrapped herself in his warmth, in his words.</p><p>This is my gift to you.</p><p>A dark dream she would embrace. Reach for.</p><p>\"Where are you taking me?\" Sara's anxiety was embarrassing, but she couldn't seem to hold it in check. Falcon had to be able to find her.</p><p>She heard the reassurance of his soft laughter.</p><p>There is no place they could take you where I could not find you. I am in you as you are in me, Sara.</p><p>\"What you are feeling is normal, Sara,\" Raven said softly. \"Lifemates cannot be apart from one another comfortably.\"</p><p>\"And you have a concussion,\" Shea reminded. \"We're taking you where you will be safe,\" she assured again, calmly, patiently.</p><p>The passageway wound deep within the earth. Jacques took Sara through what seemed like a door in the solid rock to a large, beautiful chamber. To Sara's grateful surprise, it looked like a bedroom. The bed was large and inviting. She curled up on it the moment Jacques put her down, closing her eyes and wanting just to go to sleep. She felt that even a few minutes' rest would make her feel better. The comforter was thick and soothing, the designs unusual. Sara found herself tracing the symbols over and over.</p><p>The candles leaped to life, flickering and dancing, casting shadows on the walls and filling the room with a wonderful aroma. Sara was barely aware of Shea's healing touch with all the precision of a surgeon. Sara could only think of Falcon. Could only wait for him deep beneath the earth, hoping they would all be safe until he arrived. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The attack came immediately after sunset. The sky rained fire, streaks of red and orange dropping straight down toward the house and grounds. Long furrows in the ground appeared, moving quickly, darting toward the estate, tentacles erupting near the massive gates and columns surrounding the property. Bulbs burst through the earth, spewing acid at the wrought-iron fence. Insects fell from the clouds, oozed from the trees. Rats rushed the fence, an army of them, round beady eyes gleaming. There were so many bodies the ground was black with them.</p><p>Beneath the earth Jacques lifted his head alertly. His lifemate was performing her healing art. His eyes met Raven's over Sara's head. \"The ancient one has sent his army ahead of his arrival. The house is under attack.\"</p><p>\"Will the safeguards hold?\" Raven asked with her usual calm. She was already reaching out to Mikhail. They were still separated by many miles, yet his warmth flooded her immediately.</p><p>\"Against his servants, the safeguards will certainly hold. The ancient one is attempting to weaken the safeguards so that he can more easily penetrate our defenses. He knows that Mikhail and Sara's lifemate are on their way. He thinks to have a quick and easy victory before their arrival.\" Jacques was calm, his black eyes flat and cold. He was banishing all emotion in preparation for battle. His arms were around Shea's waist, his body pressed close, protectively toward her. He bent his head to kiss her neck, a light, brief caress before moving away.</p> <p>Raven caught his arm, preventing him from leaving the chamber. \"Mikhail and Falcon say this one is dangerous, a true ancient, Jacques. Wait for them, please.\"</p><p>He looked down at her hand. \"They are all dangerous, little sister. I will do what is necessary to protect the three of you.\" Very gently he removed her hand from his wrist, gave her an awkward, reassuring pat, a gesture at odds with his elegance.</p><p>Raven smiled at him. \"I love you, Jacques. So does Mikhail. We don't tell you nearly enough.\"</p><p>\"It is not necessary to say the words, Raven. Shea has taught me much over the years. The bond between us is very strong. I have much to live for, much to look forward to. I have finally convinced my lifemate that a child is worth the risks.\"</p><p>Raven's face lit up, her eyes shiny with tears. \"Shea didn't say a word to me. I know she's always wanted to have a baby. I'm happy for you both, I really am.\"</p> <p>Shea returned to her body, swaying from the intense effort of healing Sara. She staggered toward Jacques.</p><p>He caught her to him, drew her gently into his arms, buried his face in the mass of wine-red hair. \"Is Sara going to be all right?\" he asked softly. There was a wealth of pride in his voice, a deep respect for his lifemate.</p><p>Shea leaned into him, turned up her face to be kissed. \"Sara will be fine. She just needs her lifemate.\" She stared into Jacques's eyes. \"As I do.\"</p><p>\"Neither you nor Raven seems to have much faith in my abilities. I'm shocked!\" Jacques's chagrined look had both women laughing despite the seriousness of the situation. \"I have my brother attempting to pull his Prince routine on me, giving me orders not to engage the enemy until His Majesty returns. My own lifemate, brilliant as she is, does not seem to realize I am a warrior without equal. And my lovely sister-kin is deliberately delaying me. What do you think about that, Sara?\" He arced one eyebrow at her.</p><p>Sara sat up slowly, pushed her hand through her tousled, spiky hair. Her head was no longer pounding and her ribs felt just fine. Even the aches from the bruises were gone. \"I don't know about your status as a warrior without equal, but your lifemate is a miracle worker.\" She had the feeling that Raven and Shea spent a great deal of time laughing when they were together. Neither seemed in the least intimidated by Jacques, despite the gravity of his appearance.</p><p>\"I cannot argue with you there,\" Jacques agreed.</p> <p>Shea grinned at Sara, her face pale. \"He has to say that. It is always best to compliment one's lifemate.\"</p><p>\"And that is why you and Raven are casting aspersions upon my battle capabilities.\" Once more Jacques kissed his lifemate. With his acute hearing, he could hear the assault upon the estate.</p><p>Sara could hear it, too. She twisted her fingers together anxiously. \"He's coming. I know he is.\"</p><p>\"Do not fear him, Sara,\" Shea hastened to assure her. \"My lifemate has battled many of the undead and will do so long after this one is gone.\" She turned her gaze on her husband. \"Raven will provide for me while you delay this monster. You will return to me unharmed.\"</p><p>\"I hear you, little red hair, and I can do no other than obey.\" His voice was soft, an intimate caress. He simply dissolved into vapor and streamed from the chamber.</p><p>Sara made an effort to close her mouth and not gape in total shock. Raven, one arm wrapped around Shea's waist, laughed softly. \"Carpathians take a little getting used to. I ought to know.\"</p><p>\"I must feed,\" Shea said, her gaze steady on Sara's. \"Will it alarm you?\"</p><p>\"I don't know,\" Sara said honestly. For no reason at all, the spot along the swell of her breast began to throb. She found herself blushing. \"I suppose I should get used to it. Falcon and I were waiting until I had settled the red tape with the children before we\" - she sought the right word - \"finalized things.\" She lifted her chin. \"I'm very committed to him.\" It seemed a pale way of explaining the intensity of her emotions.</p> <p>\"I am amazed he allowed you the time. He must be extraordinarily certain of his abilities to protect you,\" Raven said. \"Feed, Shea. I offer freely that you may be at full strength once again.\" She casually extended her wrist to Shea. \"Carpathian males usually have a difficult time at the first return of their emotions. They have to contend with jealousy and fear, the overwhelming need to protect their lifemate and the terror of losing her. They become domineering and possessive and generally are a pain in the neck.\" Raven laughed softly, obviously sharing the conversation with her lifemate.</p><p>Sara could feel her heart racing as she watched in horrified fascination while Shea accepted nourishment from Raven. Although it was bizarre, she could see no blood. She was almost comforted by the completely unselfish act between the two women. Sara was humbled by Shea's gift of healing. She was humbled by the way she was accepted so completely into their circle, a close family willing immediately to aid her, to place their lives directly in the path of danger for her.</p><p>\"Are you really planning to have a child?\" Raven asked as Shea closed the tiny pinpricks in her wrist with a sweep of her tongue. \"Jacques said he has finally convinced you.\" There was a slight hesitation in Raven's voice.</p><p>Sara watched shadows chase across Shea's delicate features. Sara had always wanted children, and she sensed that Shea's answer would be important to her dreams, also.</p><p>Shea took a deep breath, let it out slowly. \"Jacques wants a child desperately, Raven. I have tried to think like a doctor, because the risks are so high, but it is difficult when everything in me wants a child and when my lifemate feels the same. It was a miracle Savannah survived; you know that, you know how difficult it was. It took both Gregori and me that first year of fighting for her life, along with Mikhail and you. I have improved the formula for infants, since we cannot feed them what was once the perfect nourishment. I do not know why nature has turned on our species, but we are fighting to save every child born to us. Still, knowing all this does not stop me from wanting children. I know now that if something happened to me, Jacques would fulfill my wish and raise our child until he or she has a family. I will choose a time soon and hope we are successful with the pregnancy and keeping the child alive afterward.\"</p><p>Sara stood up carefully, a little gingerly, a frown on her face. She could hear the sizzle of fire meeting water, of insects and other frightening things she had no knowledge of. She could hear clearly, even envision the battle outside, the army of evil seeking to break through the safeguards protecting those within the walls of the house. Yet she felt safe. Deep below the earth, she felt a kinship with the two women. And she knew Falcon was on his way. He would come to her. For her. Nothing would stop him.</p><p>It seemed crazy, yet perfectly natural, to be in this chamber talking intimately with Raven and Shea while, just above them, the ancient vampire was seeking entrance. \"Will I have problems having a child once I become fully like Falcon?\" Sara asked. It had not occurred to her that she would not be able to have a child once she was a Carpathian.</p><p>Shea and Raven both held out their hands to her. A gesture of camaraderie, of compassion, of solidarity. \"We are working very hard to find the answers. Savannah survived and two male children, but no other females. We have much more research to do, and I have developed several theories. Gary has flown out from the United States to aid me, and Gregori will follow in a few weeks. I believe we can find a way to keep the babies alive. I even believe I'm close to finding the reason why we give birth to so few females, but I am not certain that, even once I know the cause, I can remedy the situation. I do believe that every female who was human at one time has a good chance of having a female child. And that is a priceless gift to our dying race.\"</p><p>Sara paced the length of the room, suddenly needing Falcon. The longer she was away from him, the worse it seemed to be. Need. It crawled through her, twisted her stomach into knots, took her breath away. She accepted it, had known the need long before she had known the reality of Falcon. She had carried his journal everywhere with her, his words imprinted on her mind and in her heart. She had needed him then; now it was as if a part of her were dead without him.</p><p>\"Touch his mind with yours,\" Raven advised softly. \"He is always there for you. Don't worry, Sara, we will be here for you, too. Our life is wonderful, filled with love and amazing abilities. A lifemate is worth giving up what you had.\"</p><p>Sara pushed a hand through her hair, tousling it further. \"I didn't have much of a life. Falcon has allowed me to dare to dream again. Of a family. Of a home. Of belonging with someone. I'm not afraid.\" She suddenly laughed. \"Well... maybe I'm nervous. A little nervous.\"</p><p>\"Falcon must be an incredible man,\" Shea said.</p><p>Not that incredible.</p><p>Jacques never quite relinquished his touch on Shea. Over the years he had managed to relearn many things that had once been wiped from his mind, but he needed his lifemate anchoring him at all times. Before, he would have been jealous and edgy; now there was a teasing quality to his voice.</p><p>Shea laughed at him. Softly. Intimately. Sent him her touch, erotic pictures of twining her body around his. It was enough. She was his lifemate. His world.</p><p>Sara watched the expressions chase across Shea's delicate features, knowing exactly what was transpiring between Shea and her lifemate. It made Sara feel as if she really were a part of something, part of a family again. And Raven was right, the moment she reached for Falcon, he was there, in her mind, enfolding her in love and warmth, in reassurance. She wrapped her arms around herself to hold him close to her, felt him in her mind, heard him, the soft whispers, the promises, his supreme confidence in his abilities. It was all there in an instant.</p><p>\"Sara.\" Raven brought Sara's attention back to the women, determined to keep it centered on them rather than on the coming battle. \"Whose children are these that the vampire went to so much trouble to acquire?\"</p><p>Sara suddenly smiled, her face lighting up. \"I guess they are mine now. I found them living in the sewers. They had banded together because of their difference from most. All of them have psychic abilities. Three little girls and four boys. Not all of their talents are the same, but they still knew, as young as they are, that they needed one another. I had great empathy with them because I grew up feeling different, too. I wanted to give them a home where they could feel normal.\"</p><p>\"Three little girls?\" Shea and Raven exchanged a long, gleeful grin. Shea shook her head in astonishment. \"You are truly a treasure. You've brought us an ancient warrior. We may learn much from him. You have seven little ones with psychic talent, and you are a lifemate. Tell me how it is that you accept our world so readily.\"</p><p>Sara shrugged. \"Because of the vampire. I saw him killing in the tunnels of a dig my parents were on. Two days later he killed my whole family.\" She lifted her chin a little as if in preparation for condemnation, but both women only looked sad, their gazes compassionate. \"He chased me for years. I always kept moving to stay ahead of him. Vampires have been part of my life for a long time. I just didn't understand the difference between vampires and Carpathians.\"</p><p>\"And Falcon?\" Raven prompted.</p><p>Sara heard a sudden hush outside the house, as if the wind were holding its-breath. The night creatures stilled. She shivered, her body trembling. The sun had set. The vampire had risen and was hurtling through space to reach the estate before Falcon and Mikhail had a chance to return.</p><p>Sara was positive that both women were aware of the vampire's rising, but they remained calm, although they linked hands. She took a deep breath, wanting to follow their examples of tranquility. \"Falcon has been my salvation for fifteen years. I just didn't know he was real. I found something that belonged to him.\"</p><p>This is my gift to you Sara, lifemate to Falcon.</p><p>She held his words tightly to her. \"I saw him clearly, his face, his hair, his every expression. I felt as if I could see into his heart. I knew I belonged with him, yet he was from long ago and I was born too late.\"</p><p>Falcon, winging his way strongly through the falling night felt her sorrow. He reached out to her, flooding her mind with the sheer intensity of his love for her.</p><p>You were not born too late, my love. Accept what is and what has been given to us. A great gift, a priceless treasure. I am with you now and for all time. I love you with all my heart, with every breath. Then believe that I will not allow this monster to tear us apart. I have endured centuries of loneliness, a barren existence without your presence. He will not take you from me. I am of ancient lineage and much skilled. Our enemy is indeed powerful, but he will be defeated.</p><p>Sara's heart began to ease its frantic racing, slowing to match the steady beat of Falcon's heart. Deliberately he breathed for her, for them, a shadow in her head as much for his own peace of mind as for hers. He was well aware of the vampire moving swiftly toward the house to find Sara. The foul stench was riding on the night wind. The creatures of the evening whispered to him, scurried for cover to avoid the danger. Falcon had no way of communicating with Mikhail and Jacques without the vampire hearing. He could use the standard path of telepathy used by their people, but the vampire would certainly hear. Mikhail and Jacques shared a blood tie and had their own private path of communication the undead could not share. It would make the planning of a battle against an ancient vampire much easier.</p><p>Falcon felt heat sizzling through the air as the first real attack was launched by the vampire. The vibrations of violence sent shock waves through the sky, bouncing off the mountain peaks so that wicked veins of lightning rocked the black, roiling clouds. The avian form he was using could not withstand such force. He tumbled through the sky, falling toward earth. Falcon abandoned that form and shifted into vapor. The wind changed abruptly, because a gale force, blowing the droplets of water in the opposite direction from where he wished to go. Falcon took the only avenue safely open to him; he dropped to earth, landing in the form of a wolf, running flat out on four legs toward his lifemate and the Prince's estate.</p><p>Despite the miles separating them, Mikhail ran into the same problem. It was no longer safe or expedient to travel through the air. He took to the ground, a large, shaggy wolf running at top speed, easily clearing logs in his path.</p><p>Jacques surveyed the sky thick with locusts and beetles, the arrows of flame and the spinning black clouds veined with forks of lightning. Tentacles erupted along the inside of the gates, a small inconvenience announcing the first break in the safeguards. He was calm as he withered the tentacles and protected the structure from the fire and insects. He began to throw barriers up, small, flimsy ones that took little time to build yet would cost the vampire time to destroy. Minutes counted now. Every moment that he managed to delay the ancient vampire gave Mikhail and Falcon a chance to reach them.</p><p>I have been in many battles, yet this is the first time I have encountered a vampire so determined to break through obvious safeguards.</p><p>Jacques sent the information to his brother.</p><p>He knows this is the home of the Prince, that the women are protected by more than one male, yet he is persistent. I think we should send the women deep within the earth and you should stay away until this enemy is defeated. What of the human woman?</p><p>The advice didn't slow Mikhail down. The wolf was running flat out, not breathing hard, nature's perfect machine.</p><p>I will protect her until her lifemate arrives. We will defeat this vampire together. Mikhail, you have a duty to your people. If Gregori were here - Gregori is not here, Mikhail interrupted wryly.</p><p>He is off with my daughter neglecting his duty to protect the Prince.</p><p>There was a hint of laughter in his voice.</p><p>Jacques was exasperated.</p><p>The undead is unlike anything we have faced. He has not flinched at anything I have thrown at him. His attack has never faltered. It seems that this ancient enemy is very sure of his abilities.</p><p>Mikhail's voice was a soft menace, a weapon of destruction if he cared to use it. There was a note of finality that Jacques recognized immediately. Mikhail was racing through the forest, so quickly his paws barely brushed the ground. He felt the presence of a second wolf close by. Smelled the wild pungent odor of the wolf male. A large animal burst through the heavy brush, rushing at him on a diagonal to cut him off.</p><p>Mikhail was forced to check his speed to avoid a collision. The heavier wolf contorted, wavered, took the shape of a man. Mikhail did so also.</p><p>Falcon watched the Prince through thoughtful, wary eyes. \"I believe it would be prudent on our part to exchange blood. The ability to communicate privately may come in handy in the coming battle.\"</p><p>Mikhail nodded his agreement, took the wrist that Falcon offered as a gesture of commitment to the Prince. Mikhail would always know where Falcon was, what he was doing if he so desired. He took enough for an exchange and calmly offered his own arm in return.</p><p>Falcon had not touched the blood of an ancient in many centuries, and it rushed through his system like a fireball, a rush of power and strength. Courteously he closed the pinpricks and surveyed Vladimir's son. \"You know you should not place yourself in harm's way. It has occurred to me that you could be the primary target. If you were to be killed by such a creature, our people would be left in chaos. The vampire would have a chance of gaining a stranglehold on the world. It is best if you go to ground as our last line of defense. Your brother and I will destroy the undead.\"</p><p>Mikhail sighed. \"I have had this conversation with Jacques and do not care to repeat it. I have fought countless battles and my lifemate is at risk, as well as the villagers, who are my friends and under my protection.\" His shape was already wavering.</p><p>\"Then you leave me no choice but to offer my protection since your second is not present.\" There was an edge to Falcon's voice. His body contorted, erupted with hair, bent as feet and hands clawed.</p><p>\"Gregori is in the United States collecting his lifemate.\" It was enough, a reprimand and a warning.</p><p>Falcon wasn't intimidated. He was an ancient, his lineage old and sacred, his loyalties and sense of duty ingrained in him. His duty was to his Prince; honor demanded that he protect the man from all harm no matter what the cost.</p><p>They were running again, fast and fluid, leaping over obstacles, rushing through the underbrush, silent and deadly while the skies rained insects and the mist thickened into a fogbank that lay low and ugly along the ground. The wolves relied on their acute sense of smell when it became nearly impossible to see.</p><p>They burst into the clearing on the edge of the forest. The ground erupted with masses of tentacles. The writhing appendages reached for them, squirming along the ground seeking prey. The two wolves leaped nearly straight into the air to avoid the grasping tentacles, danced around walls of thorns, and skidded to a halt near the tall, double, wrought-iron gates.</p><p>Falcon angled in close to Mikhail, inserting his body between the Prince and a tall, elegant man who appeared before them, his head contorting into a wedge shape with red eyes and scales. The mouth yawned wide, revealing rows of dagger-sharp teeth. The creature roared, expelling a fiery flame that cut through the thick fog straight at them.</p><p>Jacques exploded from the house, leaping the distance to the gate, then jumping over to land on the spot where the undead had been. The vampire used its preternatural speed, spinning out of reach. He hissed into the night air, a foul, poisonous blend of sound and venom. Vapor whirled around his solid form, green and then black. A noxious odor was carried on the blast. The vapor simply dissolved into thousands of droplets of water, spreading on the wind, an airborne cloud of depravity.</p><p>The hunters pressed forward into the thick muck. Falcon murmured softly, his hands following an intricate pattern. At once the air was filled with a strange phosphorescent milky whiteness. The trail left by the undead was easily seen as dark splotches staining the glowing white. Falcon took to the clouds, a difficult task with the air so thick and noxious. The splotches scattered across the heavens, tiny stains that seemed to spread and grow in all directions, streaking like dark comets across the night sky.</p><p>The vampire could only go in one direction, yet the stains were scattering far and wide, east and south, north and west, toward the village, high over the forest, along the mountain ridge, straight up, blowing like a foul tower and falling to earth as dark acid rain.</p><p>On the ground the rats and insects retreated, the walls of thorn wavered and fell, the tentacles retreated beneath the earth. Near the corner of the gate, a large rat stared malevolently at the house for several moments. Teeth bared, the rodent spat on the gate before it whirled around and scurried away. The wrought iron sizzled and smoked, the saliva corroding the metal and leaving behind a small blackened hole.</p><p>Mikhail sent out a call to all Carpathians in the area to watch over the villagers. They would attempt to cut off the vampire's source of sustenance. With the entire region on alert, he hoped to find the vampire's lair quickly. He signaled the other two hunters to return to the house. Chasing the vampire when there was no clear trail was a fool's errand. They would regroup and form a plan of attack.</p><p>\"This one is indeed an ancient,\" Jacques said as they took back their true forms at the veranda of the Prince's home. \"He is more powerful than any other I have come across.\"</p><p>\"Your father sent out many warriors. Some are still alive, some have chosen the dawn, and a few have turned vampire,\" Falcon agreed. \"And there is no doubt that this one has learned much over the years. But he had fifteen years to find Sara, yet she escaped. A human, a child. He can and will be defeated.\" He glanced toward the gate. \"He left behind his poisonous mark. I spotted it as we came in. And, Jacques, thank you for finding Sara so quickly and getting her to safety. I am in your debt.\"</p><p>\"We have much to learn of one another,\" Mikhail said, \"and the unpleasant duty of destroying the evil one, but Sara must be able to go to ground. She is beneath the earth in one of the chambers. For her protection, it is best that you convert her immediately.\"</p><p>Falcon's dark eyes met his Prince's. \"And you know this can be safely done? In my time such a thing was never tried by any but the undead. The results were frightening.\"</p><p>Mikhail nodded. \"If she is your true lifemate, she must have psychic abilities. She can be converted without danger, but it is not without pain. You will know instinctively what to do for her. You will need to supply her with blood. You must use mine, as you have no time to go out hunting prey.\"</p><p>\"And mine,\" Jacques volunteered generously. \"We will have need of the connection in the coming battle.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sara was waiting for Falcon in the large, beautiful chamber. Candles were everywhere, flames flickering so that the glowing lights cast shadows on the wall. She was alone, sitting on the edge of the bed. The other women had been summoned by their lifemates. Sara jumped up when Falcon walked in. She wore only a man's silken shirt, the tails reaching nearly to her knees. A single button held the edges together over her generous breasts. She was the most beautiful thing he had ever seen in all his centuries of existence. He closed the door quietly and leaned against it, just drinking her in. She was alive. And she was real.</p><p>Sara stared up at him, her heart in her eyes. \"It seems like forever.\"</p><p>Her voice was soft but it washed over him with the strength of a hurricane, making his pulses pound and his senses reel. She was there waiting for him with that same welcome on her face. Real. It was real, and it was just for him.</p><p>Falcon held out his hand to her, needing to touch her, to see that she was alive and well, that the healer had worked her miracle. \"I never want to experience such terror again. Locked within the earth, I felt helpless to aid you.\"</p> <p>Sara crossed to his side without hesitation. She touched his face with trembling fingertips, traced every beloved line - the curve of his mouth, his dark eyebrows - and rubbed a caress along his shadowed jaw. \"But you did come to my aid. You sent the others to me, and you were always with me. I wasn't alone. More than that, I knew you would save the children.\" There was a wealth of love in her voice that stole his heart.</p><p>He bent his head to take possession of her tempting mouth. She was soft satin and a dark dream of the future. He took his time, kissing her again and again, savoring the way she melted into him, the way she was so much a part of him.</p><p>Are you ready to be as I am? To be Carpathian and walk beside me for all time?</p><p>He couldn't say it aloud but whispered it intimately in her mind while his heart stood still and his breath caught in his lungs. Waiting. Just waiting for her answer.</p><p>You are my world. I don't think I could bear to be without you.</p> <p>She answered him in the way of his people, wanting to reassure him.</p><p>\"Is this what you want, Sara? Am I what you want? Be certain of this - it is no easy thing. Conversion is painful.\" Falcon tightened his hold on her possessively, but he had to tell her the truth.</p><p>\"Being without you is more painful.\" Her arms crept around his neck. She leaned her body against his, her soft breasts pushing against his chest, her body molding to his. \"I want this, Falcon. I have no reservations. I may be nervous, but I am unafraid. I want a life with you.\" Her mouth found his, tiny kisses teasing the corners of his smile, her teeth nibbling at his lower lip. Her body was hot and restless and aching for his. Her kiss was fire and passion, hot and filled with promises. She gave herself into his keeping without reservation.</p><p>He melted inside. It was an instant and complete meltdown, his insides going soft and his body growing hard. She tore him up inside as nothing had ever done. No one had ever penetrated the armor surrounding his heart. It had been cold. Dead. Now it was wildly alive. His heart pounded madly at the love in her eyes, the touch of her fingertips, the generous welcome of her body, the total trust she gave him when her life had been one of such mistrust.</p><p>His kiss was possessive, demanding. Hot and urgent, the way his body felt. His hands went to her waist in a soft caress, slid upward to cup the weight of her breasts in his hands. But his mouth was pure fire, wild and hot even when his hands were so tender. He slipped the single button open, his breath catching in his throat, and he stepped back to view the lush temptation of her breasts. \"You are so beautiful, Sara. Everything about you. I love you more than anything. I hope you know that. I hope you are reading my mind and you know that you are my life.\" His finger trailed slowly down the valley between her breasts to her navel. His body reacted, that painful ache of urgent demand. And he let it happen.</p><p>Sara watched his eyes change, watched the way his body changed, and she smiled, unafraid of the wildness she glimpsed in him. Wanting it. Wanting him crazy for her. She unbuttoned his shirt, slipped it from his shoulders. Leaning forward, she pressed a row of kisses along his muscles, her tongue sliding around his nipple. She smiled up at him as she rubbed her hand over the bulging material of his trousers, her fingers deftly freeing him from the tight confines. Her hand wrapped around the thick length of him, simply held him for a moment, enjoying the freedom of being able to explore. Then she hooked her thumbs into the waistband of the trousers to remove them. \"I think you're beautiful, Falcon,\" she admitted. \"And I know that I love you.\"</p> <p>He wrapped his arm around her waist, dragged her to him, his mouth fusing with hers, all at once aggressive, demanding, a little primitive. Sara met him kiss for kiss. His hands were everywhere; so were hers. He slid his palm over her stomach, wanting to feel a child, his child, growing there, wanting everything at once - her, a child, a family, everything he had never had. Everything he'd believed he never could have. His fingers dipped lower into the thatch of tight curls, cupped her welcoming heat even as his mouth devoured hers. \"I know I should slow down,\" he managed to get out.</p><p>\"There's no need,\" she answered, feeling the exact same sense of wild urgency. She needed him. Wanted him. Every inch of him buried deep within her merging their two halves into one whole.</p><p>Shadows danced on the wall from the flickering candlelight, threw a soft glow over Sara's face. He lifted his head as he slowly, carefully, pushed two fingers deep inside her. He wanted to watch the pleasure in her eyes. She held nothing back from him, not her thoughts, her desires, or her passion. She gasped, her body tightening, clamping around his fingers, hot and needy. She moved against his hand, a slow, sexy ride, her head thrown back to expose her throat, her breasts a gleaming enticement in the candlelight.</p><p>He pushed deeper into her, felt the instant answering wash of hot moisture. Very slowly he bent his head to her throat. His tongue swirled lazily. His teeth nipped. He hid nothing from her, his mind thrusting into hers, sharing the perfect ecstasy of the moment with her, his body's reaction and the frenzy of heated passion. His fingers penetrated deep into her feminine channel as he buried his teeth in her throat. The lightning lanced both of them, hot and white, a pain that gave way to an erotic fire. She was hot and sweet and just as wild as he was. Falcon was careful to keep his appetite under control, taking only enough blood for an exchange. His mouth left her throat with a soothing swirl of his tongue; he lifted her with only one arm wrapped around her waist and took her to the bed. All the time, his fingers were sliding in and out of her, his mouth was fused to hers, the pleasure blossoming and spreading like wildfire through both of them.</p><p>She expected to find the taking of her blood disgusting, but it was erotic and dreamy, almost as if he had drawn a veil over her mind, ensnaring her in his dark passion. Yet she shared his mind and knew he had not. She also shared the intensity of his pleasure in the act, and it gave her courage.</p><p>\"It isn't enough, Falcon. I want more, I want you in my body, I want us together.\" Her voice was breathless against his lips, her hands sliding over him eagerly, tracing each defined muscle, urging his hips toward hers.</p><p>He kissed her throat, her breasts, swirling his tongue over her nipples, along her ribs, around her belly button. Then she was gasping, rising up off the bed, her hands clutching fistfuls of his hair as he tasted her. She was shattering with the sheer intensity of her pleasure. Falcon could transport her to other worlds, places of beauty, emotion, and physical rapture.</p><p>He rose above her, a dark, handsome man with long, wild hair and black, mesmerizing eyes. There was a heartbeat while he was poised there, and then he surged forward, locking them together as they were meant to be, penetrating deeply, sweeping her away with him. He began to move, each stroke taking him deeper, filling her with a rush of heat and fire. She rose to meet him, craving the contact, wanting him deep inside, all the time her body winding tighter and tighter, rushing toward that elusive perfection.</p> <p>Sara gasped as he thrust deeper still, the fiery friction clenching every muscle in her body, flooding every cell with a wild ecstasy. Then he was merging their minds, thrusting deep as his body took hers. She felt his pleasure, he felt hers, body and mind and heart, a timeless dance of joy and love. They soared together, exploding, fragmenting, waves of release rocking the earth so that they clung together with hearts pounding and shared smiles.</p><p>Falcon held her tightly, buried his face in her neck, whispered soft words of love, of encouragement before reluctantly untangling their bodies.</p><p>They lay on the bed together... waiting. Her heart was pounding, her breath coming too fast, but she tried valiantly to pretend that everything was perfectly normal. That her entire world was not about to be changed for all eternity.</p><p>Falcon held her in his strong arms, wanting to reassure her, needing the closeness as much as she did.</p><p>\"Do you know why I wrote the journal?\" He kissed her temple, breathed in her scent. \"A thousand years ago, the words welled up inside me when I could feel nothing, see nothing but gray images. The emotions and words were burned into my soul. I felt I needed to write them down so I would always remember the intensity of my feelings for my lifemate. For you, Sara, because even then, a thousand years before you were born, more even, I felt your presence in my soul. A tiny flicker and I needed to light the way.\" He kissed her gently, tenderly. \"I guess that doesn't make much sense. But I felt you inside of me and I had to tell you how much you mattered.\"</p><p>\"Those words saved my life, Falcon. I wouldn't have survived without your journal.\" She leaned into him. She would survive this, as well. She was strong and she would see it through.</p><p>\"I shudder to think what trouble the children are giving this poor stranger who has been called into service,\" Falcon teased, wanting to see her smile.</p><p>Sara nibbled at his throat. \"How long will it take us to get the children in a real home? Our home?\"</p><p>\"I think that can be arranged very fast,\" Falcon assured, his fingers sliding through her thick, silken hair, loving the feel of the sable strands. \"The one wonderful thing about our people is that they are very willing to share what they have. I have jewels and gold stashed away. I was going to turn it over to Mikhail to aid our people in any way possible, but we can ask for a house.\"</p><p>\"A large house. Seven children require a large house.\"</p><p>\"And a large staff. We will have to find someone we trust to watch over the children during the day,\" Falcon pointed out. \"I am certain Raven and Shea will know the best person to contact. The children have very special needs. We will have to aid them...\"</p><p>She turned her head, frowning at him. \"You mean manipulate them.\"</p><p>He shrugged his powerful shoulders, unperturbed by her irritation. \"It is our way of life in this world. We must shield those who provide sustenance for us, or they would live in terror. Officials who do not want to hand us these children are easily persuaded otherwise. To keep the children from being afraid and allow them to become more used to their environment and more accepting of a new lifestyle, it will be necessary. It is a useful gift, Sara, and one we depend on to keep our species from discovery.\"</p><p>\"The children want to live with me. We have discussed it on many occasions. I would have taken them to my home immediately but I knew that eventually the vampire would come. I was attempting to set up a safe house for them, a refuge where I could see them without endangering them. But the officials continually put roadblocks in my way, mostly to charge more money. But the children knew I was trying. They believed in me, and they won't be afraid of a new life.\"</p><p>\"You will not be with them during the day, Sara. We must ensure that they trust the humans we will have to rely on to guard them during those hours.\"</p><p>Just then a ripple of fire moved through Sara's body. She put her hand over her stomach and turned her head, meeting his shadowed gaze. He put his hand over hers.</p><p>He bent to kiss her, a kiss of sorrow, of apology. \"I would spare you this pain if I could.\" He whispered it against her skin. His body trembled against hers.</p><p>She caught his hand, twining their fingers together. Her insides were burning alarmingly. \"It's all right, Falcon. We knew it was going to be like this.\" She wanted to reassure him even though every muscle was cramping and her body was shuddering with pain. \"I can do this. I want to do this.\" She allowed nothing else to enter her mind. Not fear. Not growing terror. It had no place, only her complete belief in him, in them. In her decision. A convulsion lifted her body, slammed it back down. Sara tried to crawl away from him, wanting to spare him.</p><p>Falcon caught at her, his mind firmly entrenched in hers.</p><p>Together, piccola. We are in this together.</p><p>He could feel the pain ripping through her body and he breathed deeply, evenly, determined to breathe for both of them, protecting her as best he could. He wanted, needed, to take the pain from her, but even with his great strength and all of his powers, he could not alleviate the terrible burning as her organs were reshaped. He could only shoulder part of the terrible pain and share her suffering. He held her as her body rid itself of toxins. Never once did he detect a single moment when she blamed him or wavered in her choice to join him.</p><p>For Falcon, time inched by slowly, an eternity, but he forced serenity into his mind, determined to be as accepting as Sara. Determined to be everything she needed, even if all he could do was believe that everything would turn out perfectly. In the centuries of his existence, he had mingled with humans and had seen extraordinary moments of bravery, but her steadfast courage astounded him. He shared his admiration of her, his belief in her ability to ride above the waves of pain and the convulsions possessing her body. She took each moment separately, seeking to reassure him when each wave ebbed, leaving her spent and exhausted.</p><p>Once, she smiled and whispered to him. He couldn't hear her, even with his phenomenal hearing.</p><p>Having a baby is going to be a piece of cake after this.</p><p>There was a wry humor in her soft voice brushing at the walls of his mind. Falcon turned his head away to keep her from seeing the tears in his eyes at the evidence of her deep commitment to him.</p><p>The moment he knew it was safe to send her to sleep, Falcon commanded it, opening the earth to allow the healing properties to aid her. Carpathian soil, more than any other, rejuvenated and healed its people, yet they could use whatever was available, as he had been doing for centuries. He had forgotten the soothing richness of his homeland. Falcon carefully cleaned the bedchamber, removing every trace of illness and evidence of Sara's conversion. He took his time, relying on the other two Carpathian males to hold a watchful vigil against further assaults by the ancient vampire. It had been far too long since he had been home, since he had known the comfort of being with his own people, the luxury of being able to depend on others.</p><p>Falcon took the sustenance offered to him by Jacques, again grateful for the powerful blood supplied by an ancient of great lineage. He rested for an hour, deep within the earth, his arms wrapped tightly around Sara.</p><p>When Falcon was certain that Sara was completely healed, he brought her to the surface, laying her carefully on the bed, her naked body stretched out, clean and fresh, the lit candles releasing a soothing, healing fragrance. His heart was pounding, his mouth dry.</p><p>Sara. My life. My heart and soul. Awake and come to me.</p><p>He bent his head to capture her first breath as a Carpathian. His other half.</p><p>Sara woke to a different world. The vivid details, the smells and sounds, were almost too much to take in. She clung to Falcon, fitting her body trustingly into his. They both could hear her heart pounding loudly, frantically.</p><p>He kissed the top of her head, rubbed his chin over the silken strands of her hair. \"Ssh, my love, it is done now. Breathe with me. Let your heart follow the rhythm of mine.\"</p><p>Sara could hear everything.</p><p>Everything.</p><p>Insects. The murmur of voices in the night. The soft, hushed flight of an owl. The rustle of rodents in nearby brush. Yet she was far beneath the earth in a chamber constructed of thick walls and rock. If she could hear everything, so could all people of this species.</p><p>Falcon smiled, his teeth immaculately white. \"It is true, Sara,\" he agreed, easily monitoring her thoughts. \"We learn discretion at a very young age. We learn to tune out what is not our business. It becomes second nature. You and I have been alone far too long; we are now a part of something again. The adjustment will take some time, but life is an exciting journey now, with you by my side.\"</p><p>Against his shoulder she laughed softly. \"Even before I ever underwent conversion, I could read you like a book. Stop being afraid for me. I am strong, Falcon. I made the decision fifteen years ago that you were my life. My everything. You were with me in my dreams, my dark lover, my friend and confidant. You were with me in my darkest hours when everything was bleak and hopeless and I had no one. All my days, all my nights, you were in my heart and mind. I know you. I lived only because of your words. I would never have survived without your journal. Really, Falcon. You know my mind, you know I am telling the truth. I am not afraid of my life with you. I want it. I want to be with you.\"</p><p>He felt humbled by her tremendous generosity, her gift to him. He answered her the only way he could, his kiss tender and loving, expressing with his body the deep emotion that could not be described by words. \"I still cannot believe I found you,\" he whispered softly.</p><p>Her arms circled his neck, her soft breasts pressed tightly against his chest. She shifted her legs in invitation, wanting his body buried deep in hers. Wanting the safe anchor of his strength. \"I still can't believe you're real and not my fantasy, the dream lover I made up from a vision.\"</p><p>Falcon knew what she needed. He needed the same reassurance. Sara. His Sara. Never afraid of appearing vulnerable to him. Never afraid of showing her desires. His mouth found hers, shifting the heavens for both of them. Her body was warm and welcoming, his haven, a refuge, a place of intimacy and ecstasy. The world fell away from them. There was only the flickering candlelight and the silk sheets. Only their bodies and long, leisurely explorations. There was gasping pleasure as they indulged their every fantasy.</p><p>Much, much later, Falcon lay across the bed, his head in her lap, enjoying the feel of the cool air on his body, the way her fingers played through his hair. \"I cannot move.\"</p><p>She laughed softly. \"You don't have to move. I like where you are.\" Her breath tightened, caught in her throat as he blew warm air gently, teasingly, across her thighs. Her entire body clenched in reaction, so sensitized by their continual lovemaking that Sara didn't think she would ever recover.</p><p>\"Ahh, but I do, my love. I have our enemy to hunt. No doubt he is close and very anxious to finish his work and leave these mountains. He cannot afford to bide his time here.\" Falcon sighed. \"There are too many hunters in this area. He will want to leave as soon as possible. As long as he is alive, the children and you will never be safe.\" He turned his head slightly to swirl a small caress along her inner thigh with his tongue. His hair slid over her skin so that she throbbed and burned in reaction.</p><p>\"Stop trying to distract me,\" she said. His arm was around her, his palm cupping her buttocks, massaging gently, insistently. It was very distracting, rendering her nearly incapable of rational thought.</p><p>\"And all this time I thought you were distracting me.\" His voice was melodic with amusement. Deliberately he slid his finger along her moist core. \"You are incredibly hot, Sara. Did you stay in my mind while we made love? Did you feel how tightly you wrapped around me? The way your body feels to me when I'm surrounded by your heat? Your fire?\" He pushed two fingers into her, a long, slow stroke. \"The way your muscles clamp around me?\" He let out his breath slowly. \"Yes. Just like this. There is nothing else like it in this world. I love everything about your body. The way you look.\" He withdrew his fingers, brought them to his mouth. \"The way you taste.\"</p><p>Her body rippled to life as she watched him insert his fingers into his mouth as if he were devouring her all over again. He smiled, knowing exactly what he was doing to her. Sara laughed softly, happily, the sound carefree. \"If we make love again, I'm certain I'll shatter into a million pieces. And you, crazy man, will not be in any shape to go chasing after vampires if you touch me one more time. So if you're determined to do this, behave yourself.\"</p><p>He kissed the inside of her thigh. \"I thought I was behaving just fine.\"</p><p>She caught a fistful of his hair. \"What I think is that you need me to bag the vampire. To bring him right to you.\"</p><p>He sat up, his black gaze wary all at once. \"You just stay right here where I know you are perfectly safe.\"</p><p>\"I'm not the safe type, Falcon, I thought you knew that by now. I expect a partnership and I'm not willing to settle for less,\" she said firmly.</p><p>He studied her face for a long moment, reached out to trace the shape of her breast, sending a shiver through her body at his feather-light touch. \"I would not want less than a partnership, Sara,\" he answered honestly. \"But you do not fully comprehend what would happen if something should harm you.\"</p><p>She laughed at him, her eyes suddenly sparkling like jewels. \"I don't think you fully comprehend what would happen if something should harm you.\"</p><p>\"I am a hunter, Sara. Please trust my judgment in this.\"</p><p>\"More than anything I do trust your judgment, but it is very biased at the moment, isn't it? It makes no sense not to use the one person he would come out into the open to find. You know that if he chased me for fifteen years, he isn't going to stop. Falcon\" - she placed a hand on his chest, leaned forward to kiss his chin - \"he will show himself if he thinks he has a serious chance of getting to me. If you don't use me as bait, everyone will continue to be in danger. Our children are frightened and in the care of a total stranger. These people have been good to us; we don't want to bring them and the surrounding villagers trouble.\" She pushed a hand through her short sable hair. \"I know I can bring him out into the open. I have to try. I can't be responsible for any more deaths. Every time he follows me to a city and I read about a serial killer in the papers, I feel as if I had brought him there. Let me do this, Falcon. Don't look so stubborn and intimidating. I know you understand why I have to do this.\"</p><p>Falcon's hard features slowly softened. His perfectly sculpted mouth curved into a smile. He framed her face between his hands and bent his head to kiss her. \"Sara, you are a genius.\" He kissed her again. Slowly. Thoroughly. \"That is exactly what we will do. We will use you as bait and trap ourselves a master vampire.\"</p><p>She raised an eyebrow, not trusting the sudden grin on his face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sara sat on a boulder, dipped her hand into the small pool of water, and looked up at the night sky. The clouds were heavy and dark, blotting out the stars, but the moon was still valiantly attempting to shine. White wisps of fog curled here and there along the forest floor, lending an eerie appearance to the night. An owl sat in the high branches of the tree to her left, completely still and very aware of every movement in the forest. Several bats wheeled this way and that overhead, darting to catch the plethora of insects flying through the air. A rodent scurried through the leaves, foraging for food, drawing the attention of the owl.</p><p>Sara had been out for some time, simply inhaling the night. Her favorite perfume mingled with her natural scent and drifted through the forest so that the wildlife were very aware of her presence. Sara stood up slowly and wandered back toward the house. Rare night blossoms caught her attention and she stopped to examine one. Her fresh scent mingled with the fragrant flower and was carried on the breeze, wafting through the forest and high into the trees. A fox sniffed the air and shivered, crouching in the heavy underbrush near the boulder where the human had been.</p><p>There was a soft sound in the vegetation near her feet. Sara froze in place, watching the large rat as it foraged in the bushes quite close to her. Too close to her. Between her and the house. She backed away from the rodent, back toward the interior of the forest. She glanced toward the boulder, judging its height. Vampires were one thing, rats quite another. She was a bit squeamish when it came to rats.</p><p>When Sara turned back, a man stood watching her. Tall. Gaunt. With gray skin and long white hair. The vampire stared at her through red-rimmed eyes. Eyes filled with hatred and rage. There was no false pretense of friendship. His bitter enmity showed in every deep line of his ravaged face. \"After all those wasted years. At last I have you. You have cost me more than you will ever know. Stupid, pitiful woman. How ridiculous that a nothing such as you should be a thorn in my side. It disgusts me.\"</p> <p>Sara retreated from him, backing the way she had come until her legs bumped against rock. With great dignity she simply seated herself on the boulder and watched him in silence; her fingers twisting together were the only sign of fear. This was the monster who had murdered her family, taken everyone she had loved, virtually taken her life from her. This tall, gaunt man with hollow cheeks and venomous eyes.</p><p>\"I have nearly limitless power, yet I need a little worm like you to complete my studies. Now Falcon's stench is all over you. How that sickens me.\" The vampire laughed softly, tauntingly, spittle flying into the air, fouling the wind. \"You did not think I knew who he was, but I knew him well in the old time. A stooge to do the Prince's bidding. Vladimir lived long with Sarantha, yet he sent us out to live alone. His sons stayed behind, protected by him, yet we were sent to die alone. I did not choose death but embraced life, and I have studied much. There are others like me, but I will be the one to rule. Now that I have you, I will be a god and nothing will touch me. The Prince will bow to me. All hunters will tremble before me.\"</p><p>Sara lifted her head. \"I see now. Although you think yourself all-powerful, a god, you still have need of me. You have followed me for fifteen years, a puny human woman, a child when you found me, yet you could not catch up to me.\"</p><p>He hissed, an ugly, frightening sound, a promise of brutal retaliation.</p><p>Sara frowned at him, sudden knowledge in her eyes. \"You need me to find something for you. Something you can't do yourself. You killed everybody I loved, yet you think I will help you. I don't think so. Instead I intend to destroy you.\"</p> <p>\"You do not have any idea of the pain I can inflict on you. The things I can make you do. I will derive great pleasure in bending you to my will. You have no idea how powerful I am.\" The vampire's parody of a smile exposed stained, jagged teeth. \"I will enjoy seeing you suffer as you have been a plague to me for so long. Do not worry, my dear, I will keep you alive a very long time. You will find the tomb of the master wizard and the book of knowledge that will give me untold power. I have acquired several of his belongings, and you will know where the book is when you hold these items. Humans never know the true treasures for what they are. They lock them up in museums few people ever visit, and none see what is truly valuable. They believe that wizards and magic are mere fairy tales, and they live in ignorance. Humans deserve to be ruled with an iron fist. They are cattle, nothing more. Prey only, food for the gods.\"</p><p>\"Perhaps that is your impression of humans, but it is a false one. Otherwise how could I have evaded you for fifteen years?\" Sara asked mildly. \"I am not quite so insignificant as you would like me to believe.\"</p><p>\"How dare you mock me!\" The vampire hissed, his features contorting with hatred as he suddenly looked around warily. \"How is it you are alone? Are your keepers so inept they would allow you to walk around unprotected?\"</p><p>\"Why would you think they are not guarding me? They are all around me.\" She sounded truthful, sincere.</p><p>His eyes narrowed and he pointed one daggerlike fingernail at her. Had she denied it, he would have been far more wary, but she was too quick to give the hunters away. \"Do not try my patience. No Carpathian hunter would use his lifemate to bait a trap. He would hide you deep in the earth, coward that he is, knowing I am too powerful to stop.\" He laughed softly, the sound a hideous screech. \"It is your own arrogance that has caused your downfall. You ignored his orders and came out into the night without his knowledge or consent. That is a weakness of women. They do not think logically, always whining and wanting their way.\" His dagger-sharp finger beckoned her. \"Come to me now.\" He used his mind, a sharp, hard compulsion designed to hurt, to put tremendous pressure on the brain even as it demanded obedience.</p><p>Sara continued to sit serenely, a slight frown on her soft mouth. She sighed and shook her head. \"That has never worked on me before. Why should it now?\"</p> <p>Cursing, the vampire raised his arm, then changed his mind. The vibration of power would have given him away immediately to the Carpathian hunters. He stalked toward her, covering the short distance between them, his strides purposeful, his face a mask of rage at her impertinence.</p><p>Sara sat perfectly still and watched him come to her. The vampire bent his tall frame, extending his dagger-tipped bony fingers toward her. Sara exploded into action, only it was Falcon's fist slamming hard into the chest cavity of the undead, as he returned to his true form. As Falcon did so, the vampire, with a look of sheer disbelief, stumbled back so that the fist barely penetrated his chest plate. Overhead, Jacques, in the shape of the owl, launched himself from the branches and flew straight at the undead, talons outstretched. The small fox grew in stature, shape-shifting into the tall, elegant frame of a male hunter, and Mikhail's hands were already weaving a binding spell to prevent the vampire from shifting or vanishing.</p><p>Pressed from the air, caught between the hunters and unable to flee, the vampire launched his own attack, risking everything in the hopes of defeating the one Carpathian whose death might force the other two to pause. Calling on every ounce of power and knowledge he possessed, he slammed his fist into Falcon's elbow, shattering bone. Then he whirled away, his body replicating itself over and over until there were a hundred clones of the undead. Half the clones initiated attacks using stakes or sharp-pointed spears; the others fled in various directions.</p><p>Jacques, in the owl form, drove talons straight through the head of a clone, going through empty air so that he was forced to pull up swiftly before hitting the ground. The air vibrated with power, with violence and hatred.</p><p>Each of the clones on the attack was weaving a different spell, and sprays of blood washed the surrounding air a toxic crimson. Falcon's mind shut off the pain of his shattered elbow as he assessed the situation in that one heartbeat of time. It was all he had. All he would ever have. In that blink of an eye the centuries of his life passed, bleak and barren, stretching endlessly until Sara.</p><p>This is my gift to you.</p><p>She was his life. His soul. His future. But there was honor. There was what and who he was, what he stood for. He was guardian of his people.</p><p>She was there with him. His Sara. She understood that he had no other choice. It was everything he was. Without regret, Falcon flung his body between his Prince and the vampire moving in for the kill. A multitude of razor-sharp spears pierced Falcon's body, taking his breath, spilling his life force onto the ground in dark rivers. As he toppled to earth, he reached out, slamming both open hands into the scarlet fountain on the vampire's chest, leaving his prints like a neon sign for the other hunters to target.</p> <p>Sara, sharing Falcon's mind, reacted calmly, already knowing what to do. She had made good use of Falcon's knowledge and she shut down his heart and lungs instantly, so that he lay as still as death on the battlefield. She concentrated, holding him to her, a flickering, dim light that wanted to retreat from pain.</p><p>She had no time for sorrow. No time for emotion. She held him to her with the same fierce determination of the Carpathian people's finest warrior as the battle raged on around him.</p><p>Mikhail saw the ancient warrior fall, his body riddled with holes. The Prince was already in motion, snapping the spears like matchsticks as he drove forward, directing Jacques with his mind. The clones tried to regroup to throw the hunters off the scent, but it was too late. The vampire had revealed himself in his attack, and Mikhail locked onto Falcon's marks, as certain as fingerprints.</p><p>The undead snarled his hatred, shrieked his fury, but the holding spell bound him. He could not shift his shape and it was already too late. The Prince buried his fist deep, following the twisted path the ancient warrior had mapped out. Jacques took the head, slicing cleanly, a delaying tactic to give his brother time to extract the black, pulsating heart. The sky rained insects, great stinging bugs, and pellets of ice and rain.</p><p>Mikhail calmly built the charge of energy in the roiling clouds. All the while, the black heart jumped and crawled blindly, seeking its master. Blisters rose on the ground and on their arms as the scarlet spray embedded itself in their skin. The fury of the wind whipped them, moaning and hissing a dark promise of retaliation. Mikhail grimly continued, calling upon nature, directing a fiery orange ball from the sky to the pulsing heart. The thing was incinerated with a noxious odor and a cloud of black smoke.</p><p>The body of the vampire jerked, the head rolled, the eyes staring at Falcon's still form with a hatred beyond anything the hunters had ever witnessed. A hand moved, the dagger-tipped claws reaching for the fallen warrior as if to take him along on the path to death. The orange ball of energy slammed into the body, incinerating it immediately, then leaping to the head to reduce it to a fine powder of ashes.</p><p>Jacques took over the cleansing of the earth, and then their own skin, erasing the evidence of the foul creature which had gone against nature itself.</p><p>Raven met her lifemate at the door, touching his arm, sharing his deep sorrow, offering him comfort and warmth. \"Shea has gone ahead to the cave of healing, opening the earth and taking the candles we will need. Jacques has brought Falcon there. The soil is rich and will aid her work. I have summoned our people to join with us in the healing chant.\" She turned to look at Sara.</p><p>Sara stood up slowly. She could see compassion, even sorrow, on Raven's face. Tears streaked Raven's cheeks and she held out both hands. \"Sara, they have brought him to the best place possible, a place of power. Shea says...\" She choked back a sob and pressed a fist to her mouth even as she caught Sara's hand in hers. \"You must come with us quickly to the cave of healing.\"</p><p>Mikhail stepped back, avoided her eyes, his features a mask of granite, but Sara knew what he was thinking. She touched his arm briefly to gain his attention. \"I was sharing his mind when he made the decision. It was a conscious decision, one he didn't hesitate to make. Don't lessen his sacrifice by feeling guilty. Falcon believes you're a great man, that the loss of your life would be intolerable to him, to your people. He knew exactly what he was doing and what the cost might be. I am proud of him, proud of who he is. He is an honorable man and always has been. I completely supported his decision.\"</p><p>Mikhail nodded. \"You are a fitting lifemate for an ancient as honorable as Falcon. Thank you for your kindness in such a bleak hour, Sara. It is a privilege to count you among our people. We must go to him rapidly. You have not had time to become used to our ways, so I ask that you allow me to take your blood. Falcon's blood runs in my veins. I must aid you in shape-shifting to get to this place of healing.\"</p><p>She met his black gaze steadily. \"You honor me, sir.\"</p><p>Raven's fingers tightened around Sara's as if holding her close, but Sara could barely feel the contact. Her mind was firmly entrenched in Falcon's, holding him to her, refusing to allow him to slip away despite the gravity of his injuries. She felt the prick of Mikhail's teeth on her wrist, felt the reassuring squeeze of Raven's hand. Nothing mattered to Sara but that flickering light so dim and far away.</p><p>Mikhail placed the image of an owl in her mind, and she actually felt the wrenching of her bones, the contorting of her body, and the sudden rush of air as she took flight. But there was only Falcon, and she didn't dare let go of that fading light to look at the world falling away from her as she winged her way to the cave of healing.</p><p>Deep beneath the earth, the air was heavy and thick with the aroma of hundreds of scented candles. Sara went to Falcon, shocked at the terrible wounds in his body, at his white, nearly translucent skin. Shea's body was an empty shell. Sara was vividly aware of her in Falcon's body, valiantly repairing the extensive damage. The sound of chanting - ancient, beautiful words in a language she recognized yet didn't know - filled the chamber. The ancient language of the Carpathians. Those not present were there nonetheless, joined mind to mind, sending their powers of healing, their energy, to their fallen warrior.</p><p>Sara watched the Prince giving his blood, far more than he could afford, yet he waved the others off and gave until he was weak and pale, until his own brother forced him to replenish what he had given. She watched each of the Carpathians, strangers to her, giving generously to her lifemate, reverently, paying a kind of homage to him. Sara took Falcon's hand in hers and watched as Shea returned to her own body.</p><p>Shea, swaying with weariness, signaled to the others to pack Falcon's terrible wounds with saliva and the deep rich earth. She fed briefly from her lifemate and returned to the monumental task of closing and repairing the wounds.</p><p>It took hours. Outside the cave the sun was climbing, but not one of the people faltered in their task. Sara held Falcon to her through sheer will, and when Shea emerged, they stared at one another across his body, both weary, both with tears shimmering in their eyes.</p><p>\"We must put him to ground and hope that the earth works its magic. I have done all I can do,\" Shea said softly. \"It's up to you now, Sara.\"</p><p>Sara nodded. \"Thank you. We owe you so much. Your efforts won't be wasted. He'll live. I won't allow anything else.\" She leaned close to her lifemate. \"You will not die, do you hear me, Falcon?\" Sara demanded, tears running down her face. \"You will hold on and you will live for me. For us. For our children. I am demanding this of you.\" She said it fiercely, meaning it. She said it with her heart and her mind and her soul.</p><p>Gently she touched his beloved face, traced his worn features.</p><p>Do you hear me?</p><p>She felt the faintest of stirrings in her mind. A warmth. Soft, weary laughter.</p><p>Who could not hear you, my love? I can do no other than comply.</p><p>The house was large, a huge, rambling home built of stone and columns. The veranda wrapped around the entire structure on the lower story. A similar balcony wrapped around the upper story. Stained-glass windows greeted the moon, beautiful unique pieces that soothed the soul. Sara loved every single thing about the estate. The overgrown bushes and thick stands of trees. The jumbles of flowers that seemed to spring up everywhere. She would never tire of sitting on the swing on her porch and looking out into the surrounding forest.</p><p>It was still difficult to believe, even after all these months, that the vampire was truly out of her life. She had been firmly in Falcon's mind when he assumed her shape. Her thoughts and emotions had guided his disguised body. Falcon buried deep, so that the vampire would fail to detect him. The plan had worked, the vampire was destroyed, but it would take a long while before she would wake without being afraid. She could only hope that the book the vampire had been searching for would remain hidden, lost to mortals and immortals alike. The fact that the undead had gone to such lengths to find the book could only mean that its power was tremendous. In the wrong hands, that book could mean disaster for both mortals and immortals.</p><p>Falcon had told Sara he'd known the vampire as a young boy growing up. Vladimir had sent him to Egypt while Falcon had gone to Italy. Somewhere along the way, Falcon had chosen honor, while his boyhood friend had wanted ultimate power. Sara rocked back and forth in the swing, allowing the peace of the evening to push the unpleasant thoughts from her mind.</p><p>She could hear the housekeepers in the kitchen talking quietly together, their voices reassuring. She could hear the children, upstairs in their bedrooms, laughing and murmuring as they began to get ready for bed. Falcon's voice was gentle as he teased the children. A pillow fight erupted as if often did, almost on a nightly basis.</p><p>You are such a little boy yourself.</p><p>The words appeared in Falcon's mind, surrounded by a deep love that always took his breath away. Sara loved him to have fun, to enjoy all the simple things he had missed in his long life. And she was well aware Falcon loved her for that and for the way she enjoyed every moment of their existence, as if each hour were shiny and new.</p><p>They attacked me, the little rascals.</p><p>Sara could see the image of him laughing, tossing pillows as fast as they were thrown at him.</p><p>Yes, well, when you are finished with your war, your lifemate has other duties for you.</p><p>Sara leaned back in her swing, tapped her foot impatiently as a small smile tugged at her soft mouth. Deliberately she thought of her latest fantasy. The pool of water she had discovered by the waterfall in the secluded ciffside. Tossing her clothes aside. Standing naked on the boulder stretching her arms up in invitation to the moon. Turning her head to smile at Falcon as he came up to her. Leaning forward to chase a small bead of water across his chest, down his belly, then lower, lower.</p><p>The air shimmered for a moment and he was standing in front of her, his hand out, a grin on his face. Sara stared up at him, taking in his long silken hair and his mesmerizing dark eyes. He looked fit and handsome, yet she knew there were still faint scars on his body. They were etched in her mind more deeply than in his skin. Sara went to him, flowed to him, melted into him, lifting her face for his kiss, knowing he could move the earth for her.</p><p>\"I want to check out this pool you have discovered,\" he whispered wickedly against her lips. His hands moved over her body gently, possessively.</p><p>She laughed softly. \"I had every confidence you would.\" </p> </body></html>"]