["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Witches come in two flavors: good and bad. A while ago, I would have pegged the witch sitting across from me squarely in the good category. But that was before I killed her sister, the black witch Belinda Burke.</p><p>Sophie Deveraux hasn't said two words since appearing unexpectedly at my office door. It happens I'm alone since my bounty hunting business partners, David and Tracey, are in Arizona tracking a skip. I elected to stay behind and handle office duties. The last few months I've had more than my share of excitement.</p><p>My name is Anna Strong. I'm a vampire. Not just any vampire, but the Chosen One. Which means besides the usual problems vampires face, finding safe food sources, hiding my identity from my human family, avoiding the pitfalls that would \"out\" me to an unsuspecting mortal world, I have other uber-vamps to contend with. Not all of whom wish me well.</p><p>But that's another story.</p> <p>Right now, I'm alone with a witch whose intentions I can't read. Sophie looks twenty-something. Her perfect face is framed by shoulder-length dark hair. Her skin stretches smooth over high cheekbones, her thick-lashed eyes are clear and blue as a summer sky. Her mouth is pursed a little, an indication that she's not overjoyed at being here. She's dressed in tailored slacks and a form fitting jersey top that emphasizes her full figure.</p><p>I have a feeling it's not a top that Sophie picked out herself.</p><p>Of course not. A familiar masculine voice intrudes on my thoughts. I'm trying to update her wardrobe and it's no easy task. She has the taste of a puritan.</p><p>Sophie's lips grow thinner.</p><p>I smile. Hello Jonathan. Wondered when you'd speak up.</p> <p>At that, Sophie decides to speak up, too. \"Being here is his idea. Not mine.\"</p><p>And it's a damned good one. Jonathan's voice fairly crackles with anger. Anna can help us. And if you'd like to continue breathing, and just for the record, I would very much like you to continue breathing, you'll let her.</p><p>The very first time I heard a male voice projecting from that petite, feminine body, I thought Sophie had been possessed. By what, I had no idea. But it creeped me out. Turns out, what happened to her was Sophie's doing. She didn't intend to share her body with a vampire but after Jonathan was immolated by his wife at a birthday party, Sophie mixed his ashes in with a face cream. She thought it might reverse the ageing process. It did, but the side effect was that she absorbed his essence. Now she's a hybrid vampire-witch with the physical perfection of a twenty year old and the abilities of an eighty-year-old very powerful witch.</p><p>And since their two personalities are polar opposites, it's not exactly a smooth cohabitation.</p><p>The vampire side, Jonathan, can speak to me telepathically. Sophie, though, while she can hear our head talk if Jonathan allows her access, can only speak to either of us in the mortal way. Her emotions are felt by Jonathan and vice versa.</p><p>Personally, I don't know how she keeps from going insane.</p> <p>I shift in my chair, waiting for one of them to tell me the reason they're here. When neither takes the initiative, I do.</p><p>\"I take it this isn't a social call.\"</p><p>Sophie releases a deep sigh, not a wistful sigh, but a frustrated, angry one. \"Jonathan has gotten us in a mess. Another mess, I might add. Because of his vanity he's put my life in danger.\"</p><p>Mine, too, don't forget. If you die, I die.</p><p>She sniffs. \"You should have thought of that sooner.\"</p><p>How could I have known of all the editors at all the publishing houses, we would have ended up with one with a grudge?</p><p>Sophie opens her mouth to bark a retort, but I hold up a hand. \"What are you talking about? What editor? What's going on?\"</p><p>Sophie's mouth clamps shut as if waiting for Jonathan to reply. Jonathan is not jumping to the bait.</p> <p>\"One of you better tell me why you're here. I do have other things to do.\"</p><p>Sophie squirms in her chair, then leans forward. \"Jonathan had this brilliant idea to make money. As if we need more.\" She bites off the last words as if aiming them right at Jonathan. \"We'd write a vampire book. Based on his experiences. I'd be the public face of the book and he'd provide the material.\"</p><p>It was a great idea, Jonathan interjects. Just check out the best seller lists today. Charlaine Harris has made a bundle on her Sookie Stackhouse books, Richelle Mead and her Vampire Academy is a perennial best seller. Imagine how much better I could do? A real vampire with the inside track and a hundred plus years of experience to draw from? It was a sure thing.</p><p>\"So what went wrong?\"</p><p>Jonathan grows quiet. Sophie's face grows dark with anger. \"The genius here decided his first story will be about how he was turned. A brilliant story of love and betrayal. The very first editor it was given to accepted it immediately. Should have suspected right then something was wrong. But Jonathan just chalked it up to his dazzling writing style.\"</p><p>Jonathan starts to interrupt but Sophie shuts him down with a quick follow-up. \"The editor brought me to New York, wined and dined me, all the while pumping me for more details. Details, of course, Jonathan could provide. He offered us a huge advance, a national marketing campaign, all the things Jonathan had hoped for. The only catch was that he wanted me to accompany him to the scene of the story, to gather background info to add realism to the book. We, of course, agreed.\"</p><p>Her last words drip sarcasm.</p><p>\"I take it the trip didn't go so well.\"</p><p>\"Haven't made the trip yet but as soon as I got back to Denver from New York, the first incident occurred.\"</p><p>\"Incident?\"</p><p>\"At the airport. We'd chartered a jet for the trip. Another of Jonathan's vanities.\"</p><p>Joanthan growls. Didn't see you complaining when we skipped those irritating security lines.</p><p>Sophie ignores the mocking aside.</p><p>\"I was getting into a taxi to go home and someone took a shot at me. The bullet missed, but smashed the cab's rear window. The police are still investigating but are inclined to chalk it up to a random crazy. I was so grateful to be alive, I accepted the theory.\"</p><p>\"But you don't now?\"</p><p>\"Not after it happened a second time. This time I was out riding on the property. And this time, the bullet missed me, but not my horse.\" For the first time, her face softens, her mouth wilts in sadness. \"He killed my horse.\" The flicker of sorrow is gone as quickly as it appeared to be replaced once again by stony anger. \"I could have been seriously injured when he went down, but of course, those vampire genes kept that from happening.\"</p><p>Something she's yet to thank me for.</p><p>\"Don't hold your breath. None of this would have happened if you weren't such a greedy bastard.\"</p><p>Sophie is on the verge of a full-blown tirade. I stave it off by jumping in. \"I don't understand. Why do you think Jonathan's book has anything to do with the attacks on your life?\"</p><p>Sophie sits back in her chair, spine stiff, hands gripping the arms of the chair with white-knuckled ferocity. \"You want to tell her, genius?\"</p><p>Jonathan lets a groan come through. I couldn't have foreseen this in a million years.\"</p><p>My patience is growing as thin as Sophie's temper. \"Foreseen what?\" I snap.</p><p>\"He used real names in his book,\" Sophie snaps right back. \"And locations.\"</p><p>\"So?\"</p><p>Jonathan's tone at last shows a modicum of regret. The editor who bought the book is the great-grandson of the vampire who turned me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I suppose I should have been surprised. But after all I've experienced in the time since I became vampire, it's damn hard to be surprised by anything. So instead of reacting with shock or incredulity, I ask the logical question, \"And just how did you determine that the editor is the great-grandson of the vampire who sired you?\"</p><p>I can hear the shrug in Jonathan's voice. How does one determine anything these days? I had Sophie do a Google search.We traced the genealogy of the mortal relatives of my sire. Steven Prendergast is indeed one of them.</p><p>\"Steven Prendergast? He's the editor?\"</p><p>Sophie nods glumly.</p> <p>\"But what makes you think he's behind the attacks on your life?\"</p><p>\"I saw him the second time. He was running toward the road after shooting my horse. He glanced back and I recognized him.\"</p><p>\"Did you tell the police?\"</p><p>\"Tell the police what? That the editor of the vampire book I wrote is out to get me because he thinks I know the one responsible for turning his great-grandmother? Because that's what we suspect this is all about. We were able to access newspaper archives from the 1800's. The disappearance of Prendergast's great-grandmother's caused a scandal in the family. Her missing corpse, the fact that she was sighted long after her 'death', the bloodless corpses that turned up. The entire family was disgraced.\"</p><p>My head is spinning. \"How in the world did you end up with the one editor who has connections to Jonathan?\"</p> <p>Sophie huffs out a breath. \"How do you think? Jonathan when he was-\" she pauses, as if searching for the right word, \"corporeal had many contacts in the entertainment world. One was a lawyer in New York. Jonathan had me send the lawyer the manuscript under the guise of my new identity, Jonathan's niece. I told him it was a recounting of an old family story I'd heard from my mother. He read it, liked it, and gave it to an editor friend of his who just happened to be big in the genre. Steven Prendergast is editor to many of today's top vampire writers.\"</p><p>I place both hands on the desk and lean forward. \"But why would he attack you immediately instead of waiting until he got you alone on that research trip he proposed? Wouldn't that have made more sense?\"</p><p>Sophie's perfect brow wrinkles. \"I don't know what he's thinking. He must know I'm human since he keeps taking shots at me. At the same time, he believes in vampires. We thought maybe we could convince him to meet with us before he goes too far. But he won't return my calls. I get the same message from his assistant every time I call. He's not available.\" She leans forward, hands clasped on the desktop. \"I want this nightmare to end. I've told his assistant I'm backing out of the deal. That I'll return the advance. Still, nothing. I'm afraid to go outside, afraid to run a simple errand. I want my life back.\"</p><p>The emphasis she puts on the last words reflects more than a simple desire to resolve the issue with Prendergast. It's obvious to me she is tired of sharing her consciousness with Jonathan. When she says she wants her life back, she means all of it.</p><p>The fact that Jonathan does not immediately respond with a snarky remark is proof that he feels her frustration, too. The silence that stretches between us is fraught with tension. It sizzles in the air like static electricity until even my nerves start to hum.</p><p>I shift in my chair. Clear my throat to ease the strain. Ask, \"So why did you come to me?\"</p> <p>Sophie closes her eyes a moment, shakes her shoulders as if shaking off the lingering effects of a bad dream. Then she meets my gaze. \"We want you to come with us to Leadville.\"</p><p>\"Leadville?\"</p><p>\"Leadville, Colorado. Where the story takes place. We figure we'll draw Prendergast out. It's a very small town, isolated. He won't be able to hide and we can confront him on our terms. Make him understand what happened and that I'm not the person he should be attacking.\"</p><p>Again, an undercurrent of meaning swirls beneath the surface of her words, subtle but aimed at Jonathan like the sharpened point of a stake.</p><p>I've never seen Sophie like this. Never felt such rage. When I killed her sister, she was angry with me but she knew her sister had crossed the line. She knew that Belinda Burke caused the deaths of many innocents and would undoubtedly have killed again. What she didn't know, what I didn't tell her, was that her sister had sworn revenge against Sophie, too, so I accepted her anger.</p><p>But the anger of this woman sitting across from me is like nothing I've ever experienced. It rages deep inside, tightly contained. If the door is ever opened, that rage will burst forth like a back draft, consuming everything in its path.</p><p>I pretend to consult the calendar on the desk in front of me when in reality I'm debating if I want to be around when Sophie lets go.</p><p>It's bad, Jonathan's voice in my head reminds me that I'd forgotten to shield my thoughts. She's wound so tight lately, I'm afraid she's going to do something drastic.</p> <p>Is that why you want me along?</p><p>I know your relationship with Sophie is strained since what happened with Belinda. But she trusted you before. Maybe you can help diffuse this situation before it gets worse.</p><p>Sophie's eyes are downcast, she isn't privy to the conversation going on between Jonathan and me. You don't seem to be helping, I reply archly.</p><p>I admit, in hindsight, the book was a mistake. But I did it as much for Sophie as for myself. She lives like a recluse. I wanted to get her out in the world.</p><p>You wanted to get yourself out in the world.</p><p>Okay. Yes. I'm going crazy in that house. We have no friends. No social life.</p><p>You seem to forget. Sophie looks like a twenty year old. She's really over eighty. She needs time to adjust to her new reality.</p><p>Time? It's been well over a year. How much time--?</p><p>\"Well,\" Sophie brings me back with a start. \"Will you come with us? I'd like to leave immediately.\"</p><p>I'm fingering the corner of the calendar. David and Tracey can handle anything going on in the office.</p><p>And I owe Sophie. She saved the lives of two of my dearest friends. \"I'll need a day or two. I have to wait for my business partners to get back. They're due tomorrow, Saturday at the latest. I can meet you in Denver. Will that be all right?\"</p><p>\"It will have to be.\" Sophie stands, pushing the chair out of the way with a jerk.</p><p>\"How will you let Prendergast know what we're doing?\"</p><p>\"He's obviously been following us. He'll know. Just in case, I'll leave a message-another message-with his assistant telling him I'm leaving for Leadville on my own.\"</p><p>I rise, too, come around the desk. \"Be careful. I'll call as soon as I'm ready to leave.\"</p><p>\"Don't waste too much time.\" Sophie's tone teeters on the edge of a warning. \"I want this over with.\"</p><p>She leaves, spine straight, shoulders tense. Nothing from Jonathan. He's probably wondering the same thing I am-which this does she want over?</p><p>I use the time waiting for David and Tracey to do a little research on my own. Leadville at 10,430 feet above sea level is listed as the highest incorporated city in North America-if you can call a place with a population under three thousand a city. Pictures show one main street running straight through town and lined with historic buildings, most dating from the 1800's. Not a mall or movie theatre in sight. Hunting, mountain biking and fishing are listed as the main attractions. None of which I find the least appealing. And when I read descriptions like \"quaint\" and \"unpretentious\" to describe lodging, I start to get nervous.</p><p>But Leadville does have an airport. I check with my pilot and he says we can fly directly there from San Diego. Good. From Denver it looks like a long car ride and being cooped up with Sophie and Jonathan is not my idea of a good time. I should feel guilty for not offering to stop for them, but if I do that, it means I have to take them back to Denver, too.</p><p>Call me selfish, but when our adventure is over, I want to be able to make a clean getaway.</p><p>David and Tracey make it back, skip in tow. They have no objection to my taking off for a few days. In fact, from the looks passing between the two, I have a feeling more went on during their trip then just bounty hunting. Fine with me. They're both unattached adults and I know Tracey has had the hots for David for sometime. I say, go for it, girl.</p><p>When I call Sophie to tell her I'll meet her in Leadville, she sounds calmer then before. She tells me she's made reservations for us in the best hotel in Leadville, The Delaware Hotel, right in the middle of town. We make plans to meet in twenty-four hours.</p><p>I can hardly wait. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The flight from San Diego takes about three hours. I learned from my trusty pilot that he was excited about the trip. Turns out the Leadville Airport is the highest elevation airport in North America. He saw it as a chance to do a little high altitude performance testing. I wasn't so enthusiastic about the testing part, but since he always seems to know what he's doing, and if I go down, he goes down, I didn't waste much time worrying about it.</p><p>After we land, I send the crew on to Denver. No use subjecting them to the limited attractions of an old west-mining town. I made reservations for them in the Ritz Carlton downtown and told them to take a few days vacation on me. After looking Leadville over, they were more than happy to take me up on it. Since once in the air, they can make it to Leadville from Denver literally in minutes, when I'm ready to leave, all I'll have to do is call.</p><p>The airport is a short car ride from Leadville. It's mid-day and the main drag is quiet, only a few cars parked here and there. The town is ringed with snow-capped peaks even though it's summer. The driver takes me to the hotel and when he disgorges me and my bags, refuses the tip I offer.</p><p>\"Complements of the Leadville airport,\" he says.</p> <p>I watch him drive away open-mouthed. Who ever refuses a tip?</p><p>Definitely not in Kansas anymore.</p><p>The hotel itself is a sprawling brick building occupying an entire city block. I'm always leery of old hotels. I've had a few experiences with spirits who are bound to their earthly abodes and it hasn't been pleasant. When I walk into the Delaware, though, I feel none of the goose-fleshy, hair-raising warnings that the presence of such spirits usually awakens in my vampire nature. The vampire remains quiet and undisturbed.</p><p>So far, so good.</p><p>Sophie made reservations in both our names so I am able to check into my room. It's a very nice room, done in tasteful antiques, clean, with modern bathroom fixtures. The view from the window stretches up and down the street. The sidewalks are nearly empty.</p> <p>Who would choose to live in such an isolated place?</p><p>Since Sophie hasn't checked in yet, I take a walk to scope out the town. The entire city was built well before 1900; plaques commemorate one historic building after another. The colors are vibrant under the summer sky-red, green, lavender, blue. Victorians beautifully restored and lovingly cared for. Even I find myself impressed.</p><p>But I didn't come for the architecture.</p><p>I circle back to the hotel and ask if Sophie has arrived. She hasn't. I take a seat in the lobby, doing some mental finger tapping, impatient. Where are they? I'm deciding which saloon I past during my walk to go to for a drink when a man walks in and asks the same question of the receptionist that I had moments before.</p><p>\"Has Sophie Deveraux checked in yet?\"</p><p>The guy is in his thirties, slicked back dark hair, face with features that can only be described as sharp. Angular cheekbones, square jaw, high forehead. He's dressed in a business suit that pegs him immediately as a tourist and from the cut and style of the suit, a big city tourist. Gucci wingtips on his feet and an expensive leather suitcase complete the picture.</p> <p>Definitely big city.</p><p>Steven Prendergast?</p><p>He completes his registration, scribbles a note on a piece of hotel stationery and hands it to the clerk. \"Please see that Ms. Deveraux gets this will you?\"</p><p>Steven Prendergast.</p><p>The clerk takes it. \"Sure thing. Here's your key. Room 302, top of the stairs.\"</p><p>302, huh? Right next door. I let him go ahead and wait a discreet amount of time before heading to my own room, 300. Maybe I can pick up a tidbit or two by eavesdropping on Prendergast. If he makes a telephone call, for instance, my vampiric powers will allow me to hear. Old hotels do have one distinct advantage-thin walls.</p><p>He does make one call, but to his office. A checking in call to let someone named Nancy know that he arrived at the hotel and where he can be reached in an emergency. Nothing to indicate that he's up to anything other than a business trip. He mentions Sophie's name and that he expects their business to be wrapped up in less than two days.</p><p>Brief. Nothing ominous.</p> <p>Disappointing.</p><p>My cell phone chimes. I move away from the wall just in case Prendergast's hearing is better than average, too. It's Sophie.</p><p>\"We're in the lobby,\" she says, sounding breathless. \"Prendergast left me a message. I'm to call him when we get in. Arrange dinner plans. What should I do?\"</p><p>\"Prendergast knows nothing about me, right?\"</p><p>\"Don't know how he could. The trip to see you in San Diego was last minute and we were gone less than one day. Why?\"</p><p>\"Make those plans. Let me know where you're going. Stay in your room until it's time to meet him. I'll tail you.\"</p><p>She agrees, starts to ring off.</p><p>\"Wait a minute. I'm in room 300, he's in 302. Ask for a room on the second floor.\"</p><p>Sophie says she will and we end the call.</p><p>Now I have nothing to do but wait for Sophie to make those dinner plans. I plop myself on the bed and let my mind wander. A hundred years from now, will I be recalling the year I became vampire with more regret than satisfaction over the choices I've made? If I could start over, what would I have done differently?</p><p>The questions prickle like an irritating bug bite. I've had little choice in anything I've done in the last year. The one decision I may have made in haste was killing a helpless Belinda Burke. She was evil and I told myself I was protecting both Sophie and myself, but could I have handled it differently? Is Sophie's attitude now a result of what I did? My desire for revenge was strong and I disregarded Sophie's plea to spare her sister's life.</p><p>The practical side of my brain chimes in. I did what had to be done to protect my family. No use second-guessing myself now. It's done and I can't undo it even if I wanted to. The problem now is helping Sophie recover her equilibrium. Concentrate on the problem at hand.</p><p>When Sophie calls with the dinner arrangements, I'm more than ready to concentrate on something other than my shortcomings. They're meeting Prendergast in the Calloway, the hotel bar, at six, then going to The Matchless Steak House for dinner at seven. I remember passing the Matchless on my walk this afternoon. It's a short distance from the hotel. I tell Sophie I'll get there before they do and look the place over. From the outside, it didn't look like a very big place and odds are there'll be a bar where I can inconspicuously eavesdrop on the conversation. In the meantime, I remind her to stay in her room. I'm keeping an eye (or ear) out for Prendergast.</p><p>He doesn't leave his room either. I hear the tap of fingers on a keyboard and guess he's working. He makes no calls and about five thirty, comes the sound of running water from the shower. I duck out of my room a few minutes after I hear Prendergast leave and head for the bar.</p><p>The Calloway is what you'd expect in a bar in a vintage hotel. Dark, lots of wood, lots of brass. I pass through and see Sophie and Prendergast, their heads together, talking quietly. Neither looks up as I pass by. I pick a bar stool close to the door and nurse a beer. Sophie's demeanor is calm, relaxed, unthreatened. Prendergast has changed into jeans and an open-neck shirt under a leather jacket. Much more appropriate attire for Leadville. His expression is serious but I'm not getting any warning vibes to alert me that Sophie is in immediate danger. Obviously, she isn't either. There's too much ambient noise for me to zero in on their conversation. At one point, Sophie looks up and spies me at the bar. Her eyes flick away and back and Jonathan's voice is in my head.</p><p>Interesting development. Go on to the restaurant. We'll meet you there.</p><p>There's a halting quality to his words that makes me uneasy. What's going on?</p><p>No reply. The conduit between us is shut.</p><p>So at six forty-five, I leave for The Matchless. Like everything else along the main drag, The Matchless is a throwback to the days when Leadville was a booming mining town. Brick front, dark, shuttered windows. When I push through the door, I'm greeted with the smell of grilling beef and a hundred years of cigar and cigarette smoke. Mementos, mining paraphernalia, and gilded photos of a couple named Tabor line the walls and the back of the bar. A glance at one of them and the origin of the bar's name becomes clear. Evidently this couple had a mine in Leadville named The Matchless.</p><p>The bar stretches along one wall. The rest of the place is filled with a dozen tables and booths. All are occupied. I hope Prendergast made reservations.</p><p>I take a seat at the bar, one of only two left. The place buzzes with conversation and laughter. From what I pick up, this is a popular place with the locals.</p><p>The bartender is a grizzled, grey-haired guy of indeterminate age. He's wearing overalls and a flannel shirt with sleeves rolled up to the elbows. He wanders down to my end of the bar and slaps a coaster in front of me. No smile, but he's not glowering at me either.</p><p>\"What'll it be?\"</p><p>I peruse the draft handles, surprised at the number of German brews available. I would have pegged this for a Millers or Budweiser kind of place. \"Paulaner Oktoberfest.\"</p><p>He does a quick about face and expertly fills a glass.</p><p>\"Nice pour.\"</p><p>His mouth twitches. A hint of blossoming good will? He moves away from me, to the middle of the bar, before I can be sure.</p><p>I've taken two appreciative swallows of my beer when the door swings open.</p><p>Sophie and Prendergast enter, pausing just inside the vestibule. Sophie looks around and then does the last thing I expect. She walks right up to me.</p><p>\"Anna,\" she says. \"Please join us. I've told Steven all about you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I'm sure I must have a deer in headlight expression on my face. Sophie pretends not to notice. When I try to reach Jonathan to find out what the hell is going on, I get nothing.</p><p>The bartender joins us. \"You folks have a reservation?\"</p><p>Prendergast nods. \"Prendergast. I called this afternoon. For two.\" A vague look in my direction. \"Seems we now have three.\"</p><p>\"No problem. Right this way.\"</p> <p>I look around. I didn't see any empty tables when I came in, but he leads us to a booth partly hidden behind a screen in the back. It's a big, dark mahogany booth upholstered in burgundy leather and shaped like a horseshoe. I let Sophie slip into the middle and Prendergast and I take the ends, facing each other. He has yet to meet my gaze.</p><p>Prendergast looks to the bartender. \"Menus?\"</p><p>\"Only serve one thing here. Steak. Any cut, cooked any way you like it except well-done. Cook refuses to burn a good steak. Comes with baked potato, salad, bread. What's your pleasure, folks?\"</p><p>Sophie orders a filet, medium rare. Jonathan must be delighted. One of the things he likes most about his strange predicament is that he no longer needs blood. He is able to enjoy food again through Sophie.</p><p>Who used to be a vegetarian.</p> <p>I raise an eyebrow at her and she shrugs.</p><p>Prendergast orders the same and asks about wine. The bartender recites a list and he chooses a merlot.</p><p>Then the bartender looks at me. I raise my glass. \"No dinner, thanks. Just beer.\"</p><p>The brief moment of cordiality we shared at the bar is over. \"You sure? Best steaks in Colorado.\"</p><p>\"Thanks, but I'm sure. I had a late lunch.\"</p><p>He ambles off, clucking his tongue and mumbling something about damned vegetarians.</p> <p>If he only knew.</p><p>Sophie looks at Prendergast, I look at Sophie. I send Jonathan a message asking just what did Sophie mean when she said she told the editor all about me? But he's not responding. I don't get even a glimmer of recognition. It's as if Jonathan has been pushed deep into Sophie's subconscious and she's not letting him resurface.</p><p>A new trick she's learned?</p><p>Sophie finally swivels in my direction. The steel hardness in her eyes makes a shiver of trepidation run up my spine. \"Steven knows all about you, Anna,\" she says.</p><p>I lean forward, frowning. \"What does he know about me?\"</p><p>Prendergast's tone is as cold as Sophie's eyes. \"I know you're a vampire,\" he says. \"And I know Sophie's story is really your own.\"</p><p>Once again, I'm knocked off balance. I lock onto Sophie's face with a steely gaze of my own. \"What are you doing?\"</p><p>She raises her shoulders. \"Getting my life back.\"</p> <p>The bartender arrives with the wine and our conversation comes to a halt. I try to reach Jonathan. Once again I'm met with an impenetrable curtain of silence. Sophie has a half-smile on her face, as if she knows exactly what I'm doing.</p><p>I don't know what game she's playing, but the vampire is quickly tiring of it.</p><p>When the bartender leaves us, I grab Sophie's arm. \"Where's Jonathan?\"</p><p>\"Who?\" she asks.</p><p>My grip tightens and she flinches away. Prendergast reaches for my hand but he quickly finds he can't dislodge my fingers. Vampire shows her face and he shrinks against the seat. Still holding Sophie's arm, I growl at him.</p><p>\"What did Sophie tell you?\"</p><p>Prendergast looks at Sophie with wide eyes. \"She told me she got the story from you. She knows all about your connection to my family. That you were the vampire that turned my great-grandmother. She admitted the book was all your idea and it was just a crazy coincidence that it landed on my desk.\"</p><p>\"And you believe her?\"</p><p>\"Why shouldn't I? She's not a vampire. She couldn't have known so much about my great-grandmother without hearing it from someone who was there.\"</p><p>\"What made you so sure Sophie wasn't a vampire?\"</p><p>He gives me a look that's half astonishment I'd ask such a simple-minded question and half amusement. \"We ate lunch together.\" He waves a hand in my direction. \"She ordered more than beer.\"</p><p>I close my eyes for a minute to swallow down the irritation rising like bile because this jerk had to point out something that should have been so obvious to me. Then, \"So you followed her to Denver and tried to kill her. What was the point of that?\"</p><p>\"That was rash, I admit.\" Prendergast sinks down in his chair. \"I was angry. I wasn't thinking clearly. I thought if I scared her badly enough, she'd do what she just did. Tell me about you. I've been searching for proof that vampires were real since I was old enough to read the family journals. This book was the proof I needed.\"</p><p>\"Proof of what?\"</p><p>\"That the family legend was true. That a vampire ruined my family's life. Stole our fortune. When I saw how Sophie lived, when I researched her background, it all fell into place. She inherited her fortune from an 'uncle' who lived a mysterious life and died even more mysteriously by burning to death. One of the ways a vampire can be killed. When she told me it was your story, I figured you were somehow connected to her uncle. I don't know how but the fact remains the same. One way or the other, you owe me.\"</p><p>\"And what do you think now?\"</p><p>\"When I got Sophie's message that she was coming here, that she wanted to make things right, I knew she was ready to tell me the truth. Ready to make things right.\"</p><p>\"The truth?\" I shoot Sophie a look. She averts her eyes but says nothing. I turn again to Prendergast. \"And what do you intend to do with this truth? Besides extort money that doesn't belong to you? Do you intend to make me your next target?\" I lean forward, smile at him the way a cougar smiles at a rabbit. \"I may not be so easy to kill.\"</p><p>It's clear from the slouch of Prendergast's shoulders that he hadn't thought it through completely. Taking pot shots at a young woman from a safe distance is one thing, facing a vampire is something else.</p><p>Sophie has been sitting quietly, not fighting against my restraining hand. I can't fathom why she spun the tale, but I plan to find out. I stand up, dragging Sophie with me.</p><p>\"She'll have to take a rain check on dinner.\"</p><p>Prendergast opens his mouth to object, but one look into my face-into vampire's face-and he cowers away.</p><p>Sophie and I are almost at the door when we pass the bartender on his way to our table, plates in hand. He looks at Sophie in confusion but when he looks at me, confusion is replaced by something else. He backs out of the way and lets us pass without a word. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We're in the hotel, in Sophie's room. She's sitting on the edge of the bed. I'm pacing, trying to quell the rising storm of anger brewing in my gut. Finally, I stop in front of her. It takes a great deal of effort to force myself to speak calmly and still, my voice sounds strained.</p><p>\"Where's Jonathan?\"</p><p>Sophie touches a hand to the center of her chest. \"Here.\"</p><p>\"Why isn't he communicating with me?\"</p> <p>\"He's asleep.\"</p><p>\"Asleep?\"</p><p>She looks up at me then, a smile as brittle and transient as frost touching the corners of her mouth. \"I learned how to make him go away. Not permanently yet. But maybe soon.\"</p><p>There's such emptiness in her eyes, so much hopelessness in the slump of her shoulders that my own senses ache with her desperation. But that empathy passes quickly.</p><p>\"Sophie, what have you done?\"</p> <p>\"Nothing.\" She twists a strand of hair around her fingers. \"I've been studying. Learning.\"</p><p>I sink down on the bed beside her. \"About what?\"</p><p>\"Possession. Exorcisms.\"</p><p>Once more, a chill touches the nape of my neck. \"Exorcisms? Jonathan isn't a demon.\"</p><p>\"He's a vampire.\"</p><p>Her tone implies, \"same thing.\"</p> <p>I can't believe I'm hearing this from a woman who took three damaged vampires into her home to help them only a few months ago. A terrible thought strikes me. \"How are the young women you took with you to Denver? Are they doing well?\"</p><p>\"I don't know. Justin Turnbull took them. He thought it best they be with they're own kind.\"</p><p>Relief washes over me. Turnbull is a very old, very powerful vampire who lives in Denver, too. I'm glad they're with him. Something is going on with Sophie and obviously Turnbull saw it. I wish he'd warned me.</p><p>\"Why did you tell Prendergast Jonathan's story was mine?\"</p><p>She fires her answer at me like a bullet. \"You can take care of yourself.\"</p><p>\"But you knew it was a lie. He'll know it, too, when he starts asking questions I can't answer.\"</p><p>\"Jonathan will help. He'll be with us soon.\"</p><p>Her tone implies she is sick at the thought. The lines of her face droop with weariness. I'm suddenly afraid to leave her alone. When Jonathan comes back, he'll be angry. I need to talk to him before she banishes him again.</p> <p>\"I'm going to sleep in your room tonight,\" I tell her. \"We'll need to decide what to do about Prendergast. He can't be allowed to go on thinking I'm the vampire he's been seeking. Only Jonathan will be able to help with that.\"</p><p>\"But I don't want Jonathan to come back. I want to be myself again. I can't stand what he's doing to me. I can't stand what I'm becoming.\"</p><p>\"Jonathan didn't do this to you, Sophie,\" I remind her quietly. \"You did this to him.\"</p><p>Her face is a blank slate, devoid of emotion, of comprehension, as if a switch had been thrown and her personality extinguished.</p><p>Jonathan returns with a roar.</p><p>What the fuck did she do to me?</p><p>Jonathan's anger is like a laser flare burning so hot even I feel scorched by it.</p><p>Sophie is more desperate than you realized, I tell him. She wants to rid herself of you for good.</p><p>Impossible. If she gets rid of me, she goes, too. Doesn't she realize that?</p><p>I press the palms of my hands against my eyes. How do I describe Sophie's anguish? I don't think she cares. She's suffering.</p><p>Suffering? The anger flares again. How the hell is she suffering? I've brought adventure into her life. I've opened doors for her. I've given her a home and a fortune. I've given her everything she wished for when she was an old, used up witch. What more does she want from me?</p><p>She wants her freedom.</p><p>The simple truth spoken in a whisper is met with silence. Jonathan's rage dissipates. I feel the hollowness it leaves in his mind the same way I felt the heat of his rage moments before.</p><p>I'm not sure which is more disturbing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sophie stirs. \"Jonathan is here, isn't he?\"</p><p>You bet your ass, sweet cheeks. Jonathan's bitterness is caustic as acid. What did you do while I was under? Something stupid, I'll bet. You want to tell me or should I ask Anna?</p><p>Sophie looks up at me and I think she's asking me to tell the story but instead she says, \"I told Prendergast the book was Anna's idea. That it was her story.\"</p><p>I expect an eruption. Instead, Jonathan's reaction is uncharacteristically calm. Why did you do that?</p> <p>\"Because I wanted Prendergast to go after someone else.\"</p><p>So you sent him after our friend?</p><p>\"Friend?\" Sophie's face darkens with anger. \"She's not my friend. She killed my sister after I begged her not to. Belinda was sick. She couldn't protect herself. She was no threat to anyone.\"</p><p>You have no idea--</p><p>I know what Jonathan is about to say. He knew the truth about Belinda's vow to kill the sister she thought had betrayed her. I stop him before he goes any farther.</p> <p>\"I'm sorry, Sophie. I did what I thought was right at the time. If you can't forgive me, at least try to understand. None of this is Jonathan's fault.\"</p><p>Sophie's expression remains fixed, unmoved by what I've said. I wait a heartbeat before moving on to what must be resolved before this night is over.</p><p>\"What do we do about Prendergast? I think he originally planned to try to kill the vampire he blames for turning his grandmother. Since this is the first time face to face with a real vampire, though, he may be rethinking that plan.\"</p><p>Jonathan interjects. Sophie, what did you and Prendergast talk about after you got rid of me?</p><p>His emphasis on the last words makes it clear that was a subject he'd be revisiting. In the meantime, though, I look to Sophie for the answer to a question I would have asked myself.</p><p>She draws a breath. \"After I told him the story was Anna's, he wanted more details. Details I couldn't give him but promised Anna would.\"</p> <p>\"But you knew that was impossible. I haven't even read the stupid book.\"</p><p>Stupid book?</p><p>You know what I mean, Jonathan. Out loud. \"How did you think it would go when he started questioning me?\"</p><p>Sophie finally allows a bit of confidence to break through the gloom. \"I knew it wouldn't get that far. Anna would show her true nature and Prendergast would back down. Which he did. I also knew you'd get me out of there at the first opportunity. Prendergast is probably on his way out of town as we speak.\"</p><p>She had thought it through. A flicker of admiration blooms. Briefly. \"If you're right, and Prendergast decides it's better to leave and let the family legend fade on its own, your plan worked. If not-\"</p><p>Sophie rises from the bed. \"Well, we'll know tomorrow, won't we?\"</p><p>An obvious signal that it's time for me to leave. I reach out to Jonathan. Go easy on her.</p><p>No reply. I release a breath and wave a weary hand. \"Good night, Sophie. Sleep well.\"</p> <p>Even as I say it, I know that's unlikely. She seems aware of it, too, and I wonder if Jonathan has already begun haranguing her.</p><p>I wish I could muster up pity.</p><p>Nothing looks so inviting as the bed in my hotel room. I shower, slip into shorts and a tank top and settle myself under sweet-smelling sheets. It's still early, only about ten, but weariness washes over me. Tonight has been laden with emotion-more exhausting than a day of physical exertion. I don't have the energy to sort through what's happened or brain storm solutions. Blissful sleep comes easily.</p><p>The vampire hears it first. A scratching at the door lock, a twisting of the knob.</p><p>She awakens the human Anna, dragging her unwillingly from a dream until the fog clears and she's aware, too.</p><p>I sit straight up in bed, my eyes on the door. Vampire is already roused for action. Teeth bared in a snarl, fists ready to claw the throat of an intruder.</p><p>Stealthy as any predator, I slip out of bed, go to stand just behind and to the left of the door.</p><p>The scratching continues, a clumsy attempt to pick the lock. I'm tempted to grab the door and pull it open, but I want to see what the late night visitor intends. I wait and watch and listen until the tumblers fall into place and the door opens on silent hinges.</p><p>I recognize his smell. Carnivore, reeking of the steak he consumed and the wine he drank. Probably for courage. He is still hidden from sight, but his breathing is ragged and fear exudes from his pores. With a sharp intake of breath, he bursts into the dark room, heads straight for the bed, plunges something into the bedclothes not aware in his frenzy that the bed is empty.</p><p>He raises his hand to strike again and I still the hand in mid-air. The wooden stake falls to the floor when my grip threatens to break his wrist.</p><p>Prendergast looks at me with eyes wide with surprise and panic. His mouth opens and closes like a fish gasping for air. I swing him around and throw him down on the bed.</p><p>Vampire wants to finish him off. She lusts for his blood. He attacked us and it is our right to defend ourselves. It is the way.</p><p>The human Anna is reluctant to interfere. But there are practical considerations. Disposing of a body is difficult. Better to let him go. For now.</p><p>I grab Prendergast by his jacket and haul him into a sitting position. \"You missed.\"</p><p>He blinks at me as if surprised I haven't killed him.</p><p>\"Sophie lied to you. I'm not the vampire you seek. If I let you go, and you promise to be a good boy and go to your room, you will live to hear the truth. If you don't, we will end it here and you'll die never knowing it.\"</p><p>He still can't find his voice. A shaky nod, a two-handed push off the bed, an awkward stumble toward the door is all the answer I get.</p><p>I beat him by five steps and hold open the door. Vampire shows her serious face. \"Remember what I said.\"</p><p>I think he will. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sophie is pale, her manner remote when she opens the door to me the next morning. I can only imagine the hell Jonathan put her through. I wonder if she got any sleep at all.</p><p>I don't make things better when I recount my encounter with Prendergast. It's not my intention to make matters worse between Jonathan and Sophie but they need to know he's still here and that I told him I was not the vampire he's been seeking.</p><p>\"So,\" she says. \"What happens now?\"</p><p>\"We meet with Prendergast and let him ask his questions.\"</p> <p>\"I won't tell him about Jonathan being a part of me.\" Sophie rouses enough to put heat in her voice. \"I won't have him coming after me again.\"</p><p>Since Jonathan doesn't respond and I can't come up with a reply that would do anything except incite more antagonism, I change tactics. \"Jonathan, do you have any information that is not in the book? Information that might make Prendergast let go of his vendetta?\"</p><p>The silence stretches on so long, I begin to wonder if Sophie's done it again, trapped him in some deep corner of her psyche. But her demeanor is too subdued for that to be true and at last, Jonathan speaks.</p><p>Yes. I changed some of the facts in the book.</p><p>\"Changed them how?\"</p> <p>To add more drama to the story.</p><p>\"In what way?\"</p><p>Well, I may have embellished my part somewhat. There were others involved.</p><p>Sophie sits up straight. \"What are you saying? The story wasn't about you?\"</p><p>Of course it was about me. But, as I said, there were others involved.</p><p>\"Would that make a difference to Prendergast?\" I ask.</p> <p>Another protracted silence. I can't penetrate Jonathan's thoughts so I have to wait. But it's making me antsy and that he does pick up on.</p><p>Yes.</p><p>Now it's my turn to show my agitation. How will it make a difference?</p><p>I don't ask the question aloud, afraid to send Sophie into another fury.</p><p>Jonathan cloaks his reply to me, too. I imagine he's afraid of the same thing. It didn't happen quite the way I said.</p><p>Then how did it happen?</p><p>I didn't turn Prendergast's grandmother. He pauses. She turned me.</p><p>Sophie is aware some exchange is going on that she's not privy to. She rises from her perch on the end of the bed and faces me. \"Stop it. I know you and Jonathan are talking. If you don't include me, I'll send him away again.\"</p> <p>You have to find out how she did it. Jonathan sounds nervous.</p><p>Finding that out will be a subject to pursue once we get Prendergast out of the way, I fire back.Not now.</p><p>I raise a placating hand. \"Sorry, Sophie. You're right. You should be a part of this since you're going to have to be the one to convince Prendergast of the truth.\"</p><p>She sets her jaw. \"I told you, I won't tell him about Jonathan and me.\"</p><p>\"Maybe you won't have to. But before we know for sure, Jonathan, tell us the real story.\"</p><p>Better take a seat, he says. This will take some time.</p><p>Reluctantly, Sophie and I sit down. She takes the foot of the bed. I plop onto the divan facing it.</p><p>Jonathan spins his tale.</p><p>Prendergast's grandmother was not a paragon of virtue brought to ruin by a seductive vampire. Just the opposite. Long before I came to Leadville, about 1861 or so, Leticia Hurlburt ran one of the first bordellos in the city. She and her business partner found whiskey and whores such a lucrative business, they soon accumulated fortunes of their own.</p><p>I came to Leadville attracted by the same thing. The promise of wealth, the lure of gold. Wasn't long before I began frequenting Leticia's establishment. I was young, handsome and generous with my gold. I soon became a favorite, not only with her girls, but also with Leticia herself.</p><p>I had no idea of Leticia's true nature until the night I got into a drunken brawl with another miner outside the saloon. The miner drew first. He shot me in the chest and pain was the last mortal sensation I was to experience.</p><p>I learned from Leticia later that she had my body brought to her room. There was a faint heartbeat and her first inclination was only to drink from me as she had so many fatally wounded humans who fell at the steps of her establishment. But my will to live was strong and when she bit through the fragile layer of skin at my jaw line and began to drink, I stirred in her arms. She was overcome with another desire. She had no companion to share her life or her wealth. I was handsome, young and strong. Her human family all lived far away and had cut off ties because of what she chose to do with her life.</p><p>Jonathan pauses as if sorting memories. Leticia had been turned when she was twenty-one, a young widow with a son, and leaving him with her family was the hardest thing she had ever done.</p><p>But she was vampire and when the one who sired her moved on, she followed. They parted ways in Leadville. He moved on to California, where rumors of even richer strikes meant fortunes to be made and miners in lonely, isolated cabins an easy food source to be tapped.</p><p>Leticia set down roots in Leadville. Her business flourished. There were enough killings to keep her well fed and her true identity concealed. For that was the nature of a mining town. Disagreements were settled with a gun or knife. Bodies would be left on the sidewalk. Leticia saw that they were properly buried. After she'd fed.</p><p>Now here I was, a young man, in her arms, moaning with pain and the pleasure of her teeth at my neck. She decided I would become her companion. She hesitated only a moment before tearing open her wrist. She held my head with one hand and pressed her wrist against my lips, keeping it there until she saw my throat move. I came to gradually, drank slowly, hesitantly at first, but as my life force grew stronger, so did my demand for the blood. Soon I was holding her wrist to my mouth, greedy, insatiable. When she knew the change had taken place, she pushed me gently away.</p><p>I remember looking at her with eyes full of questions. My body hummed with new life and I felt stronger than I'd ever felt before. I was sexually aroused, too, and she felt the stirring of my lust.</p><p>He sighs as if the memory still filled him with pleasure. She opened her gown and welcomed me in. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jonathan stops. The story of his becoming provoked in him a far different response than the story of mine does in me. His voice is filled with wonder reflecting the depth of feeling he still has for the woman who turned him. I was taken by force by a rogue who intended to rape and kill me. The only thing I feel for that bastard is hatred.</p><p>Jonathan's story raises so many questions. Why did they part ways? What became of Leticia? Is she still alive? My head swims with possibilities. Vampire relationships seem short-lived at best despite the prospect of immortality making 'til death do you part' more than just a cliche. Or maybe it's because the prospect of spending eternity with one person too often becomes a cliche of another sort: familiarity breeding contempt.</p><p>Sophie shatters the fragile shell of silence with a snort. \"So the story you had me write was a lie. Prendergast is right. Your fortune belongs to him, the human descendant.\"</p><p>I blink over at her. \"How did you come to that conclusion?\"</p> <p>She glares at me. \"Isn't it obvious? Jonathan isn't a blood relative. He's not even a bastard child. He's the product of an unholy alliance between a vampire whore and -\"</p><p>She stops suddenly with a gasp, clasping her hands to her midsection and doubling over.</p><p>Jonathan's fury radiates outward, a rabid, raging storm that he is using to cause Sophie physical pain. I'm frozen in shock. I didn't know he was capable of such a thing.</p><p>Sophie has fallen back on the bed, drawn her body into a fetal position. She is moaning, a terrible keening sound that sets my teeth on edge. It rouses me to action. I start for her, sending a message to Jonathan, yelling at him to stop.</p><p>Suddenly, the tone and timbre of Sophie's cries change.</p> <p>She sits up, eyes flashing, the guttural sounds from her throat morphing into a language I don't understand. Her words spew forth like a geyser, as if by the sheer force of their intensity they are unleashing an internal defense against Jonathan's attack. She is no longer in pain. She is wresting control from Jonathan.</p><p>She is casting a spell. I feel Jonathan's presence slip away as she continues the incantation. Her eyes are closed, her hands clasped in supplication. I don't recognize her. An aura of magic, dark and ominous, surrounds her. Her face is a mask of grim determination, all vestiges of softness and compassion gone. The Sophie who saved my friends and was willing to sacrifice her life to right a wrong committed by her sister is swallowed up by this other. Watching her, dread chills my bones. At this moment, she reminds me of Belinda, the black magic witch who stopped at nothing to get her way.</p><p>A shiver of repulsion makes me move away from the creature on the bed. Even vampire is reluctant to interfere. We can only watch and wait and hope reason returns to Sophie before it is too late.</p><p>I remember what Jonathan said. If he dies, Sophie does, too. Is she aware that her own fate is tied to his? And what if Jonathan is wrong? What if she can rid herself of him and continue on as before? Would she revert to her real age? Would she care? The frustration I felt in her makes me believe that life or death may make no difference to her. Her only goal is to be free.</p><p>Finally, the chanting stops. Sophie's body relaxes as she slumps back against the pillows. The sphere of sinister light that surrounded her is gone. Her eyes remain closed, but her face softens. A small smile touches the corners of her mouth.</p><p>\"Sophie?\"</p> <p>Her eyes open, her expression is at once surprised to see that I'm still in the room and pleased that I am. \"I did it,\" she says. \"How long?\"</p><p>At first I'm confused by the question, but then a flash of understanding. \"Five minutes. Maybe less.\"</p><p>The smile widens. \"I'm getting better. The first time it took almost twenty minutes and I was exhausted after.\" She stretches, languid as a cat. \"I feel fine.\"</p><p>\"Jonathan?\"</p><p>\"He's where he can't hurt me. I think he may be gone longer, too. The magic felt more potent. It was wonderful.\"</p><p>I don't know how to respond. \"Is he aware?\" I ask.</p><p>A shrug of indifference. \"Don't know. Don't care.\"</p><p>\"How did you learn to do that without Jonathan knowing?\"</p> <p>She smiles again, this time a smile of conspiratorial slyness. \"When we were writing the book. He'd delve into his memories, lost in his own world, leaving me free to do some research of my own.\"</p><p>\"Research?\"</p><p>\"I was a practicing witch, remember, as was my mother and grandmother before me. I have texts and journals from before the Salem witch trials, hidden by my family down through the ages.\"</p><p>\"Were some of them Belinda's?\"</p><p>A furtive glance as elusive as her ambiguous answer, \"Maybe.\"</p><p>I push aside the dark foreboding creeping into my head like an icy fog and concentrate on the more immediate problem: Prendergast. Jonathan will have to wait it out in his isolation cell.</p><p>\"What do we do about Prendergast?\"</p><p>That elicits a real smile. \"Easy,\" she says. \"We tell him the truth. The real story now that we know it. And I turn all of Jonathan's holdings over to him.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>At first I think she's joking. But that's not a \"gotcha\" smile, but a triumphant one.</p><p>\"You can't do that.\"</p><p>She raises an eyebrow. \"Of course I can. Jonathan made me his heir. I figure this solves all our problems. Prendergast will go away satisfied and I will go back to living the way I did before Jonathan took over.\"</p><p>\"You don't think Jonathan will have something to say about giving his fortune to this stranger?\"</p> <p>\"Jonathan won't have anything to say. Now that I know how to silence him temporarily, it's only a matter of time before I learn how to do it permanently.\"</p><p>\"Think this through, Sophie. What if banishing Jonathan banishes you as well?\"</p><p>\"Then I will still have accomplished my goal. I'll be free.\"</p><p>The unconcerned way she says it makes me think there's more to her plan than she's willing to share. The cagey look in her eyes, though, says grilling her about it is useless.</p><p>\"What do we do now?\"</p> <p>\"I think Prendergast should learn about his grandmother where it all happened. Do you know The Matchless is in the same building where Leticia had her brothel? She had the whole building then, of course, but the dining room was actually the saloon.\"</p><p>It doesn't hit me until I hear Sophie talking about The Matchless. Then a light goes on and I stare at her in disbelief. \"You knew the truth about Jonathan's story?\"</p><p>The look she shoots me is full of contempt. \"Jonathan thinks I can't read his thoughts or shield mine from him. I learned early on how to do it.\"</p><p>\"Then why did you go along with the book idea?\"</p><p>She waves a hand. \"Because this has got to stop. I can't live like this anymore.\" She draws a breath. \"The idea didn't come to me until I met the editor and learned who he was. Until then, I thought if I placated Jonathan, maybe he'd leave me in peace. I'd help him publish his damned book and make a deal with him. I'd give him the book tour and travel he craved and in return, he'd promise to remove himself from my life for the same number of months.\"</p><p>\"It changed when you met Prendergast.\"</p> <p>Excitement lights her face. \"It got better. I wasn't crazy about his shooting at me. But the rest...I couldn't have dreamed up a more perfect plan. If all goes well, tonight will be the end of it.\"</p><p>\"Tonight?\"</p><p>\"It's all arranged. I did it before you arrived this morning. After Jonathan finished threatening me with all sorts of dire consequences should I try to get rid of him again.\" A triumphant gleam brightens her eyes. \"He tired himself out, I guess, because he left me alone. That's when I did it. Called the manager over at The Matchless. We're taking over the place at eleven tonight. For a private party. Then I called Prendergast. He sounded nervous.\" She laughs, nodding in my direction. \"Now I know why. Anyway, he agreed to come, too.\"</p><p>\"And what about Jonathan? Will he be there?\"</p><p>\"If he behaves himself.\"</p><p>I should have given Sophie more credit. Jonathan should have given her more space. I don't know what's going to happen tonight but vampire will be on the alert.</p><p>Whatever Sophie's grand plan, she's made her feeling about vampires crystal clear.</p><p>I don't intend to become a sacrificial lamb.</p> <p>There isn't a lot to do in Leadville. The day drags with leaden boots. The hotel does have a library, though, so I ensconce myself on a big, upholstered chair by a window and do a little research of my own.</p><p>Leadville's history is reminiscent of so many boom and bust towns in the west. Originally called Cloud City (fitting considering the elevation,) first gold, then silver were mined until economies change and the silver bust of 1893 sent miners scrambling for greener pastures. But the town lived on, becoming known as a tourist destination because of quaint celebrations like Burro Days and earlier, the spectacular Ice Palace once the jewel of the ongoing Crystal Carnival.</p><p>I also learned who Horace and Baby Doe Tabor were and their sad but romantic ties to Leadville.</p><p>I scoured the books for pictures, particularly pictures taken around the time Leticia opened her brothel. I paged through two books before I found one.</p><p>A daguerreotype, yellow and brittle with age, taken from a museum collection. There were three girls in the picture, but only Leticia is named. The three are dressed in frilly white gowns, looking as virginal and innocent as the snow capped peaks behind them. I can't help but wonder if the photographer brought the gowns with him, romanticizing a life that was anything but.</p><p>The caption names Leticia as owner of the building, mentioning the saloon but little else. When I study her face, I can see why Jonathan would have been attracted to the petite, blonde with an hourglass figure and long curls. She had a hat on with a floppy brim and she was twirling a parasol and grinning right at the camera. Evidently the old form of photography captured vampire images just as digital cameras do now.</p><p>I wonder if she's still alive.</p><p>I wonder what Jonathan would feel if he saw this picture.</p><p>I wonder if Jonathan will be around much longer to feel anything at all. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sophie calls at ten forty-five to ask if I want to walk with her to The Matchless. There's a moment where I have to question why she wants me with her tonight. If I have a part to play in Sophie's scheme, she hasn't made that clear. The only good reason for me to go along is a nagging worry that whatever she has planned, it might backfire. She might be a powerful witch, but she can be stopped by a bullet. Prendergast has tried it before. He might decide if he can't take his vengeance out on a vampire, she'll do just as well. Particularly since he doesn't know what she intends to propose.</p><p>The bar is emptying as we approach. There's a lot of grumbling from disgruntled locals being evicted from a favorite drinking spot. Evidently it doesn't happen often.</p><p>\"How much did you pay to get this place to yourself?\" I ask Sophie.</p><p>\"A lot,\" she replies. \"But it's Jonathan's money so who cares? It may be the last of it I ever spend.\"</p> <p>She's much too enthused by the prospect. \"Is he with us?\"</p><p>She shakes her head. \"Not yet. But he will be when the time is right.\"</p><p>\"Which means?\"</p><p>\"You'll see.\"</p><p>The last of the patrons files by. The bartender has been holding the door and when he sees us, he gestures for us to enter.</p> <p>\"All yours,\" he says. He holds up a key. \"Just lock up when you're finished. The kitchen is off limits, but help yourself to anything in the bar.\"</p><p>Sophie exchanges the key in his hand for a check that she's pulled from a big leather purse. I just get a glimpse, but there are a lot of zeroes scrawled above Sophie's signature. \"What shall I do with the key when we're done?\" she asks.</p><p>\"Leave it at the front desk in your hotel. I'll pick it up in the morning.\"</p><p>He is on his way out when Prendergast is on his way in. He blocks the door, looking over his shoulder at Sophie with a questioning quirk of bushy eyebrows. She nods and he waves Prendergast in.</p><p>\"Best lock up after me and shut off the lights,\" is his parting shot. \"Or folks will be pounding on the door all night.\"</p><p>Sophie crosses the room and turns the deadbolt with a snap. She also reaches over and shuts off the neon \"Open\" sign and the bank of lights illuminating the front of the bar. The room plunges into semi-darkness, the only light filtering from the dining area behind us.</p> <p>Prendergast hasn't taken his eyes off me since coming in. He stands as far away from me as he can, too, his back pressed against the end of the bar.</p><p>\"Why is she here?\" he asks. \"You didn't tell me she'd be here.\"</p><p>But Sophie is busy pulling things out of a big canvas tote she brought from the hotel. Black candles. Crystals. Herbs tied in bundles. A vial of clear liquid. Chalk.</p><p>The skin on the back of my neck begins to prickle. She's preparing to cast a spell.</p><p>\"Sophie, what are you doing?\"</p><p>She ignores me the way she did Prendergast. She clears a space in the middle of the room by pushing chairs out of the way. Chalk in hand, she gets down on her knees, begins to draw a pentagram.</p><p>\"What is she doing?\"</p><p>Now Prendergast is talking to me, though he still keeps his distance.</p> <p>I don't know what she's doing exactly but I can guess. I've seen her prepare before. But it's nothing I can share without causing him panic so I turn my back on him to join Sophie on the floor. I stop her hand with my own, forcing her to look up at me.</p><p>\"What is this?\"</p><p>She glances toward Prendergast. \"I'm going to give Steven what he wants. The answers to all his questions.\"</p><p>\"We can tell him what he needs to know,\" I remind her. \"We know the story now.\"</p><p>She turns fierce blue eyes on me. \"Oh, but this will be so much better. He's going to hear it from his great-grandmother herself. And then she's going to hear what misery Jonathan has inflicted on me. It should be quite a show.\"</p><p>\"How will you bring her here? Is she dead?\"</p><p>\"It doesn't matter. I've perfected a summoning charm. Whether we pull her from the afterlife or next door, she'll appear in corporeal form.\"</p><p>\"What about Jonathan? How does he figure in this?\"</p><p>Her lips curl into a sneer. \"Oh, he's the star attraction. He's my special gift to Leticia.\"</p><p>\"Gift?\"</p><p>Excitement burns through her eyes. \"I'm going to make sure she takes Jonathan with her when she goes. I just hope it's straight to hell.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>From the corner of my eye, I see Prendergast inching his way toward the door.</p><p>Sophie sees it, too.</p><p>\"Oh, you don't want to go, Steven,\" she purrs. \"Remember, this is mainly for your benefit. And when it's done, you can be the one to correct the family history you're so bent on protecting.\"</p><p>He looks at me. \"What does she mean?\"</p> <p>\"Don't ask me. I'm just like you. Along for the ride.\"</p><p>My tone is deriding but one look at her setting out candles and crystals on the five points of a star hand drawn on the floor of a bar and I understand his instinct to get the hell away from Sophie.</p><p>\"How did she get you here?\"</p><p>His eyes flick to her. \"She said she'd make it worth my time.\"</p><p>So he came because of greed. Should have known.</p> <p>What about me? What am I doing here? There's concern for Jonathan of course, and my curiosity to see how she's going to pull this off. Truthfully, the opportunity to meet and talk with Leticia peaks my interest, too.</p><p>Then vampire tempers my enthusiasm with a quiet reminder.</p><p>Sophie hates all vampires. Be on guard. Make sure she doesn't intend to send you off with Jonathan. Remember: magic always exacts a price.</p><p>Points well taken.</p><p>Sophie is finishing her preparations. She looks up once at Prendergast, notices the furrowed brow and the way he's tapping a nervous left foot. \"Get a drink,\" she tells him. \"It may help you relax.\"</p><p>His expression is at first leery, but within two seconds, he's behind the bar and uncapping a bottle of scotch. He fills a tumbler and takes a long pull.</p> <p>\"Take it easy,\" Sophie says, standing. \"I said I wanted you relaxed, not comatose.\"</p><p>Prendergast pays her no heed. At his third pull, Sophie takes the glass from his hand and leads him to the star, beckoning me to follow.</p><p>She positions us around the star, each of us between a point, close but not touching. She waves a hand and the candles ignite. I see Prendergast's shoulders jump and have to suppress a smile.</p><p>He ain't seen nothing yet.</p><p>Sophie begins to chant. A low, melodious tune that is mesmerizing in its simplicity. Her volume neither increases nor decreases and yet it's as if the music fills the room, becoming a fourth presence that is tangible. Then it is more than perception as a mist swirls around us, moving to the rhythm of Sophie's voice. The mist takes on all the colors of the rainbow, mirrored in the crystals now shining like golden orbs on the floor.</p><p>My breath catches. It's so beautiful. Fear for Jonathan, the possibility of danger, all fade. I'm transfixed by what I see. Music you can touch. My hand lifts, fluttering through the mist, causing ripples that ebb and flow like the tide before settling once again into their original patterns.</p><p>The cadence of Sophie's chant quickens, the pitch drops. The mist changes, too. Primary colors fade, replaced by shades of charcoal and grey. There's a chill in the room now. An edge that has a dampening effect on the mind as well as the body.</p><p>A shudder shakes my shoulders. I'm aware of Sophie next to me. When I look at her, she has her arms outstretched. Her eyelids flutter. I want to grab her, shake her. There is danger here. This is what vampire reminded me of.</p> <p>Before I can move, the crystals spark, bursting into flame. They form a circle, so close heat singes my feet, forcing me to take a step back. Prendergast jumps back, too. Sophie alone stands with the flames licking at her feet and ankles. She doesn't flinch. Only her voice changes, rising with the flames, intoning a command.</p><p>There is a blinding flash as the flames leap upward followed by a crack that shakes the floor and reverberates like thunder.</p><p>Prendergast claps his hands to his ears.</p><p>I can't move, frozen by the specter that appears in the circle of flame.</p><p>A girl with an hourglass figure and long blonde curls.</p><p>She blinks at us, confused, shielding her eyes from the blinding light surrounding her.</p><p>It's not until the light fades and the flames retreat into their crystal orbs that she lowers her hand and stares out.</p><p>\"How the hell did I get here?\" she says. \"And who the fuck are you people?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not the first words I expected out of Leticia's mouth just as I did not expect a modern woman dressed in a skintight black sheathe and Jimmy Choos.</p><p>Guess Leticia has not gone to the afterlife-whatever that is-unless it's complete with designer boutiques and high-end shoe stores. I look at Sophie to see if she's disappointed.</p><p>Sophie stands quietly, a smile of accomplishment brightening her face. She looks at Prendergast. \"Here's your great-grandmother, Steven. Say hello.\"</p><p>But before he can give voice to the astonishment reflected on his face, Leticia zeroes in on me.</p> <p>\"Vampire. Did you bring me here?\"</p><p>I shake my head and point to Sophie. \"Nope. She did.\"</p><p>Credit should be given where it's due.</p><p>Leticia spins on those stilettos. Her sheathe is backless, plunging to the base of her spine. I stare while she skewers Sophie with a glare. \"Why, witch?\"</p><p>Sophie, in turn, points to Prendergast. \"Your great-grandson wanted to meet you.\"</p> <p>A squeak erupts from Prendergast's throat. \"Are you a ghost?\"</p><p>\"Do I look like a ghost?\"</p><p>\"But how--?\" Perspiration makes his face shine in the candlelight. \"How is it possible?\"</p><p>Sophie grunts. \"She's a vampire, remember? Isn't that the reason we're here?\"</p><p>As Sophie talks, Leticia is looking around. At first, it's in a vacant, curious sort of way. But soon the light of recognition flickers in her eyes. She walks to the bar, runs a hand along the polished mahogany rails. She breathes in sharply. \"Where am I?\"</p><p>\"Look at the pictures on the wall,\" Sophie replies. \"It'll come to you.\"</p> <p>Leticia crosses the room. She pauses beneath each gilded frame as if memorizing the images.</p><p>\"How long has it been since you've been here?\" I ask.</p><p>Her voice is tight with emotion. \"Well over a hundred years.\"</p><p>\"Do you remember much about your time in Leadville?\"</p><p>\"Leadville?\" She half turns to look at me. \"What's that?\"</p><p>I flash to my tutorial in the library this morning. \"That's right. When you lived here it was called Cloud City.\"</p><p>\"And they changed the name to Leadville? Why on earth did they do that?\"</p><p>\"It's a long story,\" Sophie says, stepping between us. \"And we don't have time for it now. If you and Anna want to discuss it later, I'm sure she'll be happy to fill you in.\"</p> <p>Leticia nods in my direction. \"Anna?\"</p><p>\"Anna Strong.\"</p><p>She tilts her head to look at me, a subtle shift in the set of her shoulders. \"The Anna Strong?\"</p><p>Again, Sophie takes a step toward Leticia. \"You have to tell your great-grandson what happened between you and Jonathan Deveraux.\"</p><p>This time the shift is more obvious, decidedly negative, and aimed at Sophie. \"What do you know about Jonathan Deveraux?\"</p><p>Prendergast finally finds his voice. \"He was the vampire that turned you. He stole the family fortune and had you run out of town.\"</p><p>Leticia looks at Prendergast with a mixture of incredulity and disdain. \"Wherever did you hear that?\"</p><p>\"It's been a family legend for over a century. How becoming a vampire cost you everything-a family that loved you, your money, even your son. You were banished, never to be heard from again. Deveraux was responsible.\"</p><p>Leticia clucks her tongue. \"Who told you that? The Prendergast side of the family? It's bullshit. All of it.\"</p><p>\"Why don't you tell him the truth, Leticia?\" Sophie's voice is soft, throaty as if she can hardly wait for Prendergast's illusion to be shattered.</p><p>\"I know the truth,\" he snaps. \"Deveraux took advantage of an innocent young girl. He corrupted her. Turned her into a demon. Our family has lived in the shadow of the scandal for as long as I can remember.\"</p><p>Leticia throws her head back and laughs. \"Oh my god,\" she says when she's caught her breath. \"You are delusional.\" She turns to Sophie. \"Where did you find this clown?\"</p><p>Prendergast bristles, tripping over his words in his fervor to object. \"It's true. My grandmother wrote it all in a journal. We should have been heir to a mining fortune. Your fortune. But it was stolen and the family name disgraced. I'm here to get our money back. And to set the record straight. You should be grateful.\"</p><p>Leticia's face darkens with anger. I recognize vampire close to the surface and my defenses are immediately on alert.</p><p>She flashes bared teeth. \"Your money? Would you like to know how I made your money?\"</p><p>Prendergast nods, a nervous, jerky head bob that is more acquiescence to a command then willing assent.</p><p>Leticia moves to stand at the middle of the bar. \"It was here. In this building. There was no family mining operation. My family disowned me. Took my son. I was run out of town, all right, but it was Boston, not Cloud City. All because I fell in love with a handsome man who promised me the world. He gave it to me, too.\"</p><p>\"Deveraux,\" Prendergast says.</p><p>\"Not Deveraux,\" Leticia counters. \"Another. And he brought me to Cloud City and we set up business. Want to know what kind of business, great-grandson? I ran a whorehouse. The best in the county. I sold whiskey and girls and business was good. I made more money than the miners who came stinking of dirt and sweat. They came to fuck pretty young things who smelled of lavender and rose blossoms and to drop their week's wages into my willing hands. That's how I made my fortune. My fortune. Deveraux had nothing to do with it.\"</p><p>Prendergast isn't ready to let go of a hundred-fifty years of family legend. \"I don't believe you. Why would everyone lie?\"</p><p>Leticia laughs again, this time it's cold, hard and completely without mirth. \"Because they were ashamed of the way they treated me. Why do you think I turned to the only man in town who didn't treat me like a soiled dove because I had a child and no husband?\"</p><p>\"But you were a widow,\" he says.</p><p>\"A grass widow,\" she corrects. \"Do you know what that means?\"</p><p>He looks confused so she continues. \"I was engaged to a man, a wealthy farmer on the outskirts of town. We intended to marry. He died before we could. But I was already pregnant. That just wasn't done in those days. Neither his family nor mine accepted the child.\"</p><p>\"Your mother raised him,\" Prendergast reminds her.</p><p>\"After they kicked me out. And only because she hoped someday his father's family would come around. Make him heir to his father's land. They didn't.\"</p><p>\"So you turned to a vampire?\" He spits the word.</p><p>Leticia moves faster than human eyes can follow. She grabs his shirt and pulls his face close to hers, close to her vampire face. \"A vampire worth a hundred of you, worm.\"</p><p>Flashing teeth and yellow eyes burn with the desire to end this discussion once and for all, to end the life of this long-lost relative, to sever the ties that bound her to a human family who caused her so much pain a lifetime ago and still lies about her.</p><p>I read her intentions. She's opened her mind to me. She's issuing an invitation.</p><p>Inviting me to join in the kill.</p><p>Don't, Leticia. He's not worth it.</p><p>She pulls a whimpering Prendergast closer, nuzzling his neck. What difference does that make? He's a meat puppet. A stupid one at that.</p><p>It's Sophie who breaks the tension. \"Don't kill him yet, Leticia,\" she says. \"Tell him about Jonathan Deveraux.\"</p><p>Leticia releases her grip on Prendergast and sends him crashing against the bar. He slithers down and lands on his ass with an undignified jolt. He's so relieved to be free, he doesn't protest.</p><p>Leticia turns her wrath on Sophie. \"Listen, witch, Jonathan Deveraux is none of your business. You've had your fun. Impressed your friends with your little parlor trick. Now send me home or it will be the last spell you ever cast.\"</p><p>\"You're wrong,\" Sophie says calmly. \"He is my business. In fact, would you like to speak with him?\"</p><p>Leticia stares at her. \"That's not possible. He was killed. A year ago. Murdered by his wife. If I hadn't heard that she disappeared soon after, I would have gone after her myself.\"</p><p>\"All true,\" Sophie says. \"By the way, you haven't asked my name.\"</p><p>\"Why would I care what your name is?\"</p><p>\"You should care. I'm the one who helped Jonathan get rid of his wife-his widow. You might say Jonathan and I have been together ever since.\"</p><p>Leticia shakes her head. \"If he was alive, I'd know it. We had a special bond.\"</p><p>\"Because you were his sire?\"</p><p>Prendergast groans from his place on the floor. \"No.\"</p><p>Leticia ignores him, eyes locked on Sophie. \"You wouldn't know that unless Jonathan told you. Where is he?\"</p><p>Sophie touches the middle of her chest with a closed fist. \"He's here.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The room is suddenly colder as Leticia moves to stand in front of Sophie. \"Explain yourself, witch.\"</p><p>Sophie is not intimidated. \"The name is Sophie,\" she says, looking directly into Leticia's eyes. \"Sophie Deveraux.\"</p><p>Leticia frowns. \"You and Jonathan were married?\"</p><p>\"Not exactly.\" Sophie closes her eyes, takes a deep breath, exhales slowly. \"Come on out, Jonathan,\" she says. \"We have company.\"</p> <p>Silence. I don't feel Jonathan's presence and wonder if Sophie is having trouble bringing him back but then...</p><p>Company? Sophie, what do you mean? What did you do?</p><p>Jonathan's voice is muted, his speech slurred as if he'd just awakened from a drug-induced sleep.</p><p>Leticia's shoulders jump, startled eyes widening as she recognizes the voice. \"Jonathan?\"</p><p>There's a moment when the very air in the room begins to vibrate with the intensity of her confusion. \"Where are you?\"</p> <p>\"I told you,\" Sophie says, repeating her fist to chest gesture. \"He's in here. He's a part of me.\"</p><p>Leticia grabs her shoulders. \"How did you do it? Can you get him back?\"</p><p>Leticia? This time the thickness in Jonathan's voice is more than being dragged to consciousness. How is this possible? How are you here?</p><p>\"The witch brought me. She says her name is Sophie Deveraux. I don't understand.\"</p><p>I feel Jonathan's mystification as he tries to puzzle out Sophie's motivation for bringing Leticia to Leadville. It's more than Prendergast, he's sure of it. He reaches out to me.</p><p>What is she doing, Anna?</p> <p>Before I can respond, Sophie does. \"Don't ask Anna,\" she says, breaking into his cloaked thought. \"Ask me.\"</p><p>Jonathan is startled by the intrusion into what he assumed was a private exchange. It doesn't take him more than a heartbeat to understand. How long--?</p><p>\"Long enough. It's not so hard once you understand which part of the mind to open and which part to close.\"</p><p>Leticia's impatience grows with her confusion. She's fighting to control the vampire's natural inclination to tear the information out of Sophie. I see her jaw tense, hear her teeth gnash.</p><p>\"Sophie, you'd better tell Leticia what she wants to know,\" I say, trying to ward off trouble. Leticia doesn't know that harming Sophie will harm Jonathan.</p><p>Sophie turns to Leticia. \"You and Jonathan want to know why I brought you here? It's simple really. I want to reunite lovers. I want you to take Jonathan with you when I send you back.\"</p><p>My spidey sense starts to tingle with alarm. \"Sophie, how do you expect to do that?\"</p><p>Jonathan must be feeling the same panic. It's not possible, he says. You know it's not possible, Sophie.</p> <p>Leticia holds up a hand to interrupt. \"Let's hear her out. I don't know what's going on, but if Sophie can bring you to me, Jonathan, I want her to do it. I've regretted the way we parted everyday since I left you. I was a fool to let you go. Let me make it up to you.\"</p><p>She speaks the words with passion, looking into Sophie's eyes as if seeing Jonathan reflected there.</p><p>Maybe she does.</p><p>A satisfied smile tips the corners of Sophie's mouth as she says, \"Okay. Let's put Jonathan to sleep for awhile.\" She grows still, closes her eyes, breathes in and out. After a moment she opens her eyes, releases a breath. \"There. That's better. Now let's get to it, shall we?\"</p><p>She crosses to the bar to retrieve her bag. I follow close.</p><p>\"Sophie, what are you thinking? What kind of spell will separate you from Jonathan? And if you do manage to separate your essences, where will Jonathan's go?\"</p><p>She looks up at me. \"Don't worry, Anna. I have it all figured out. At first I thought I'd make Leticia and Jonathan one, like he is with me. But then I got a better idea.\" Her eyes twinkle as she glances over at a still prone Prendergast and whispers in my ear. \"How do you think Jonathan will like being an editor?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Prendergast?\" My voice croaks with disbelief. \"You have to be kidding. Where will he go?\"</p><p>\"Oh, he'll still be around. But he's merely human so Jonathan will run the show. It will be the life Jonathan craves. Better than he deserves after the hell he put me through, but as long as he's out of me, I don't care.\"</p><p>Prendergast is staring at us as if he realizes we're talking about him but is too scared to find out why. I try to imagine Jonathan in that oily haired, New York urban chic metro-male persona and can't. \"Jonathan is never going to go for this.\"</p><p>That brings a snarl from Sophie. \"Did I say I was giving him a choice?\"</p> <p>\"What about Prendergast? Don't you think he should have a say?\"</p><p>\"Why? He's going to get everything he wants, too. I imagine Jonathan will want to reclaim his estate as soon as he makes the adjustment.\"</p><p>Leticia has been standing to the side, waiting for something-anything-to happen. Since Sophie and I haven't moved in five minutes, and I'm shielding my thoughts, her patience comes to an end. She stomps over to us.</p><p>\"Where's Jonathan? I want to talk to him.\"</p><p>\"You'll soon be able to talk to him all you want,\" Sophie replies. \"You'll be able to talk, kiss, fuck. Pick up right where you left off a hundred years ago. Course some things will be different. He won't look the same.\"</p> <p>The tease in her voice snaps Leticia's ire. \"What do you mean?\"</p><p>Sophie's eyes drift to Prendergast. \"I'm afraid Jonathan's physical body is gone. Now I know there's a certain ick factor to fucking your great-grandson but you're a vampire. I'm sure you've done worse.\"</p><p>I can feel Leticia's anger grow. I don't know why Sophie is baiting her like this, but it's not wise to push a vampire. It's downright dangerous.</p><p>As if to prove the point, Leticia shoves Sophie against the bar. \"Witch, you are trying my patience. I want Jonathan. If the only way that can happen is to place his essence in the mortal shell of that miserable excuse for a man, do it. But I warn you. It better be Jonathan in every other respect. If you damage him in any way, I will know. And you will pay.\"</p><p>Leticia isn't whispering. In fact, her voice thunders in the small bar. Prendergast catches every word. He leaps to his feet. \"What the hell are you talking about?\"</p><p>With two steps, Leticia is in his face. \"It's wonderful irony. You will become what you have searched for all those years.\"</p> <p>She leans close, one hand grasping Prendergast behind the neck, the other snaking down to cup his genitals in her palm. \"I can already feel there will be some disappointments. Oh well, you know what they say. It's not the size...\"</p><p>Prendergast squeals as she squeezes. She laughs. \"Just think of the perks, worm. Specifically, me.\" She glances back to Sophie. \"He doesn't have a family, does he?\"</p><p>\"Not one he's close to in spite of his story. A sister in Australia. A cousin in the Midwest. I checked. He does have a fiance, though.\"</p><p>\"Good. A fiance is easily disposed of.\" She lets him go. \"Well, witch, what are you waiting for? Let's do it.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prendergast's face is crumbling, as if he can't understand what he's hearing and is too frightened to try to make sense of it. He shrinks back against the bar like a turtle pulling into a shell. Is he trying to make himself less vulnerable, less exposed? It only makes him look pathetic.</p><p>Sophie's face, on the other hand, is determined, a granite mask of resolve and tenacity. She pulls more crystals from the bag, more candles, white this time. She chooses a bundle of herbs tied with a flax ribbon and sets them aside with the vial of clear liquid she withdrew earlier. She walks over to the pentagram. She sweeps away the black candles and crystals with the back of her hand. Then she leans down and draws a circle around the star. She sets out the new candles, arranges the crystals around the perimeter of the circle. She stands up and surveys her work.</p><p>\"Good. I think we're ready.\"</p><p>She goes to her bag. This time she withdraws a piece of paper and turns to me.</p> <p>\"You'll have to help.\"</p><p>\"Me?\"</p><p>She hands me the paper. \"Read this as soon as the crystals ignite.\"</p><p>I look it over. \"What is this? Latin? I can't read Latin.\"</p><p>Leticia stalks over, grabs the paper from my hand. \"I can read it. I went to school in Boston when Latin was still taught. Unlike the modern educational system that has steadfastly stripped education of all that is important.\" She reads the words to herself, then fixes Sophie with a warning glare. \"This is a prayer for an exorcism. To rid a host of a demon. Jonathan is not a demon.\"</p> <p>\"That's what I said.\" I can't help repeating what I told Sophie earlier. Most of the world might think of vampires as demons, I refuse.</p><p>\"Read it more carefully,\" Sophie says calmly. \"I replaced the word 'demon' with a more innocuous word. 'Spirit'. And I changed the rite. Instead of banishing the spirit to the underworld, it will send the spirit into another human host. Prendergast's body.\"</p><p>Prendergast finally rouses himself. Color returns to his pale face. \"You can't do this. I won't let you.\" He hears what he's saying, rubs a hand over his face, shaking his head. \"Am I crazy? Is this a nightmare? I'm leaving. And if anyone of you tries to follow me, I swear I'll-\"</p><p>He gets no farther. At first I think Leticia has done something-or Sophie-to stop him. It isn't until he clutches a hand to his chest and bends forward at the waist that I hear it. His heart thudding in his chest. Again I think Sophie is doing it.</p><p>I whirl on her. \"Stop, Sophie. You'll kill him.\"</p><p>She turns wide eyes on me. \"I'm not doing anything.\" When she sees my dark frown, she raises a hand. \"I swear. It's not me.\"</p> <p>Leticia reaches him first, places a palm flat against his heaving chest. \"I think he's having a heart attack.\"</p><p>\"Then we need to call an ambulance.\"</p><p>\"No.\" Sophie grabs my arm. \"We'll save him by working the spell. Leticia, bring him to the circle. Quickly.\"</p><p>Leticia doesn't hesitate. She sweeps a gasping Prendergast into her arms. \"What do I do?\"</p><p>\"Put him the circle.\"</p><p>Leticia sets Prendergast on his feet. His breathing is quick, shallow. He grabs at his left arm. \"Please. I have a heart condition. In my pocket. Nitroglycerine.\"</p><p>Leticia casts a glance in Sophie's direction. \"Will it affect the spell?\"</p><p>Sophie shakes her head. \"I don't think so. And we need him alive.\"</p> <p>Leticia searches his pockets, finally finding the small container in his jacket. She opens it and spills one of the white tablets into her hand.</p><p>Prendergast takes it and slips it under his tongue. Within a minute, his breathing has returned to normal, he straightens up. He looks around as if confused to find himself standing in the middle of a circle. \"What's going on?\"</p><p>The pain must have been so intense, he wasn't aware that Leticia had carried him from his place at the bar. He remembers everything else, though, the familiar look of panic settling over his features.</p><p>Leticia turns again to Sophie. \"What now?\"</p><p>\"He needs to lay down in the circle. I will lie beside him. You read the ritual. Anna, you sprinkle the contents of this vial over me at the proper time.\"</p><p>My head swims with questions. \"How will I know the proper time? What's in the vial? Will Prendergast feel anything?\"</p><p>Sophie has stepped into the circle. \"You'll know the proper time, don't worry. And it's holy water in the vial. That should assuage some of your guilt. Nothing poisonous or harmful. Holy water. Prendergast may feel a tingling. But it will feel like renewal, not death. He will feel strong and healthy. That should be the last nitroglycerine tablet he ever needs.\"</p><p>Too pat. What isn't she telling me? Vampire whispers in my ear, magic always exacts a price.</p><p>\"What about you, Sophie?\" I ask.</p><p>She shrugs. \"Worse case scenario, I'm eighty again. But I was healthy before, I should be healthy again.\"</p><p>Leticia's impatience sparks again. \"Can we get on with it?\"</p><p>\"Prendergast, lie down.\"</p><p>He tries to step out of the circle, but Leticia swings him up and has him prone on the floor before he can take a step. He struggles to get up. She places a hand on the middle of his chest. \"Sophie, can I knock him out? I can cut off his breathing by pressing right here,\" she demonstrates by placing a palm on his jugular.</p><p>Sophie leans over Prendergast. \"Think of it this way, Steven. A new life. One without pain. You're getting everything you wanted.\"</p><p>Prendergast draws a breath, his eyes searching Sophie's. \"I won't feel anything?\"</p><p>Sophie nods. \"Nothing bad. Promise.\"</p><p>Leticia removes her hand. \"Remember, I move faster than you think. Don't try to pull anything.\"</p><p>He closes his eyes. Is he praying?</p><p>Sophie hands Leticia the paper and bundle of herbs and me the vial. Then she steps into the circle and lowers herself to the floor. She positions her body so her head is at his feet. They are close, but not touching. She ignites the candles as she did before, with a wave of her hand. Then she takes Prendergast's hand and looks to Leticia. \"Begin.\"</p><p>I see Prendergast's body tense. He still hasn't opened his eyes. Part of me feels sorry for him but part of me feels it was his thirst for vengeance that got him into this predicament. That and the thought of a fortune if he could extort it. What does he think now that he knows the truth? That Deveraux didn't turn his great-grandmother, she turned him? Does he wish he'd never seen the manuscript? Does he curse the lies his family perpetuated to ease their own guilt?</p><p>I close my eyes, too. I'm letting this happen. How guilty am I going to feel if something goes wrong?</p><p>I imagine pretty fucking guilty. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Leticia reads the Latin script expertly and without hesitation. It's a long passage, full of pauses during which she waves the bundle of herbs in ways that resemble the sign of the cross. Did Sophie take her rite from a Catholic exorcism textbook?</p><p>Nothing is happening. The words provoke no immediate reaction in the two on the floor. I guess I was expecting the dramatic three-sixty head spinning and projectile vomiting pictured in movies when an exorcism is performed. Or at least an impressive string of cursing. Sophie and Prendergast lie still and seemingly unaffected. Even Prendergast shoulders start to relax and his breathing is so regular, I wonder if he's fallen asleep. Will Jonathan's spirit slip effortlessly from Sophie into his body?</p><p>But I should have known it wouldn't be that easy.</p><p>Leticia is caught up in the words, the magic. Her face takes on an excited flush, her voice rises and falls. Soon the crystals begin to glow. I take an involuntary step back, remembering the flash fire of before. There's no mist this time, no colorful liquid vapor you can touch and send gently rippling with a touch of your hand. This time the crystals send off scorching heat and light as bright as a laser, turning night into day in the confines of the bar.</p> <p>Prendergast groans. My eyes snap to him. He's writhing on the floor, his face contorted.</p><p>I thought Sophie said there'd be no pain?</p><p>Sophie is still quiet, not moving. She has a smile on her face and she clutches Prendergast's hand like a lifeline.</p><p>Leticia continues to read. Pause. Wave the bundle of herbs. Her face reflects excitement, anticipation. She glances now and then at the two in front of her, as if gauging something.</p><p>Then it happens. Sophie's back arches, she cries out. A specter, a cloud of grey, rises from her body. At the same time, the crystals flare and go out. The specter pauses, suspended in mid-air, as if aware but unsure what path to take.</p> <p>\"Now, Anna, the holy water.\" Leticia's hushed voice rouses me. \"Quickly. Sophie.\"</p><p>I uncap the vial and sprinkle the water over Sophie's writhing body. As if the act is a cue, the specter moves away from her and into Prendergast. He bucks once. Then, as the cloud is absorbed into his body, he grows still.</p><p>The candles flicker, too, and go out, plunging the room into darkness.</p><p>It's so quiet.</p><p>I can't take my eyes off the two on the floor. They lie as if asleep. Leticia hasn't said a word either and I feel her tremble. She's as eager with anticipation as I am. I fight the urge to reach out, shake Sophie's shoulders, ask the hundred questions spinning in my head like bits of driftwood in a whirlpool.</p><p>As the minutes tick by and there's no movement, no sign of consciousness returning to Sophie and Prendergast, I'm overcome with dread.</p> <p>They are asleep aren't they? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I feel Leticia's anxiety growing with mine.</p><p>\"What have I done?\" she whispers.</p><p>I move to stand beside her. \"You did what Sophie asked.\"</p><p>\"But what if I've killed Jonathan?\" Her voice becomes hard, concern replaced with anger. \"She didn't ask Jonathan what he wanted. I should have made her bring him back. Let him choose.\"</p> <p>I remember Sophie in the office when she came to ask me to accompany her to Leadville. \"Sophie would have gotten rid of Jonathan one way or the other. She was that desperate.\"</p><p>Leticia turns puzzled eyes on me. \"I don't even know how they came to co-exist. How could such a thing happen?\"</p><p>I give her a condensed version: who Sophie was, how she came to have access to Jonathan's ashes when he was immolated, what she tried to do with them that produced the unorthodox results.</p><p>Rather than feel sympathy for Sophie after hearing the story, Leticia snarls. \"She should have been happy. He gave her youth, wealth, a life without bounds. Stupid witch. If she survives and he doesn't I'll make her pay for her ingratitude.\"</p><p>I blow out a breath. I can tell from what she's feeling, there would be no use arguing the point. And I have a question of my own.</p> <p>\"You and Jonathan obviously loved each other very much. Why did you part?\"</p><p>For the first time, a deep well of regret opens in Leticia's thoughts, allowing me to glimpse the depth of her remorse. \"I talk of Sophie being stupid. I was no less so. I wanted to move on, to California where new adventure beckoned. Jonathan liked our life in Leadville. And he knew part of the reason I wanted to go to California was because Anthony, my sire, invited me there. He sent letters full of stories of the beauty of the state, of the ocean. Jonathan felt I might still have unresolved feelings for Anthony. And he was right. I did. But Anthony had moved on. He found he liked 'recruiting' new vampires into his fold and I would have been just one more in his harem.\"</p><p>\"Why didn't you return to Jonathan?\"</p><p>\"Why do you think? Pride. Embarrassment. Time moves slowly for vampires and it makes forming attachments difficult. I soon found temporary relationships, be it with mortals or vampires, work best. At least I did until I heard Jonathan's voice.\"</p><p>She looks at me. \"You have not been vampire long, have you? I know you have extraordinary abilities but you also still have a mortal family. I have heard the stories. I can feel your uncertainty about what lies ahead for you. I can only give you one piece of advice. If you are lucky enough to find a soul mate, whether the relationship lasts a mortal lifetime or an eternity, you may be given only one chance at real fulfillment. Don't let it slip away.\"</p><p>We have been talking quietly, heads close together, caught up in emotions transmitted both in words and thoughts.</p> <p>I find myself envying her and being fearful for her at the same time. If Jonathan is truly gone, it was a cruel act of fate, and Sophie, to remind her again of what she lost.</p><p>She can do nothing about fate, but Sophie is another matter.</p><p>A sound snaps our attention to the circle. Sophie is sitting up, confusion drawing her face into a scowl. She looks around, eyes cloudy with the effort of trying to remember, questions reflected in her expression. She doesn't know where she is.</p><p>Leticia takes a step forward. I stop her. \"Wait. Let her come back.\"</p><p>I shield my thoughts and try to reach Jonathan, first in Sophie, then in Prendergast, still unconscious.</p><p>I get nothing.</p><p>From either of them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sophie comes around slowly. She presses both hands against her face. I can't tell if she's taking mental inventory or is just weary from the exorcism. I try again to reach out to Jonathan. Leticia is doing the same. We both ask the same question:</p><p>Where are you?</p><p>We both get the same answer: nothing.</p><p>Leticia isn't willing to wait any longer. She kneels down between Sophie and Prendergast. She turns Sophie's face upward with a hand to her chin.</p> <p>\"Did it work?\"</p><p>Sophie looks at her with no expression.</p><p>Leticia's anger snaps. She slaps Sophie with the palm of her hand. \"Come out of it, damn you. Did it work?\"</p><p>Sophie's head jerks, her hand flies to her cheek. Anger flushes confusion from her eyes. \"What did you do that for?\"</p><p>At least she's speaking. Color rushes into her face. She struggles to stand up but Leticia stops her. Sophie pushes her hand away. \"Let me up.\"</p> <p>Leticia rises with her. For a moment, they stare at each other. Sophie touches her chest. Tilts her head as if listening. Then a slow smile blossoms on Sophie's lips.</p><p>\"He's gone,\" she says. Her face shines with the wonder of it. \"He's really gone.\"</p><p>Leticia doesn't take the same pleasure in Sophie's declaration. She takes step closer, teeth bared in warning. \"Where is he, witch?\"</p><p>Sophie looks down at Prendergast. \"Did you see his spirit when it left my body?\"</p><p>I figure it's time I inserted myself in the conversation. Leticia's growing fury is reaching critical mass. \"We did,\" I say, stepping between them. Maybe not the best place to be if Leticia explodes, but I can handle her better than Sophie.</p><p>I point to Prendergast. \"It seemed to rise like a cloud and settle into him. But he hasn't moved since and we can't reach Jonathan telepathically.\"</p> <p>Sophie bends over Prendergast, feels for a pulse. \"He's alive.\"</p><p>\"I don't give a fuck if he's alive,\" Leticia roars. \"Where's Jonathan?\"</p><p>Sophie turns to me. \"Help me get him to the bar.\"</p><p>I move around Leticia feeling the heat of her anger rolling off her body in waves. She'd tear Sophie apart if I wasn't here.</p><p>I hoist Prendergast over my shoulder and deposit him on a chair. Sophie gets a glass of water and tips it into his mouth.</p><p>Prendergast swallows reflexively, chokes. His head rolls on his shoulders. He moans and finally, finally, opens his eyes.</p><p>His expression is as blank as Sophie's when she first regained consciousness.</p><p>Until he sees Leticia.</p> <p>Quicker than is humanly possible, he is at her side. He grabs her, crushes her to his chest, one hand at the nape of her neck the other on her ass.</p><p>I glance over at Sophie. \"I think we've found Jonathan.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Leticia's hand snakes between their bodies. \"I'd say you were happy to see me.\"</p><p>I clear my throat. \"Can you restrain yourself until you're alone?\" I wait for them to part-reluctantly-and look into Prendergast's eyes. \"Jonathan?\"</p><p>He nods. \"In the flesh evidently.\"</p><p>\"Is Prendergast in there with you?\"</p> <p>A pause as if Jonathan is taking inventory. \"I think he's gone. I felt something when I first entered his body. A sharp pain in my-his-chest. For a minute I thought we had both died.\"</p><p>\"He had a heart condition,\" Sophie says, joining us from the shadow of the bar. \"If we'd waited a minute longer, you both would have died.\"</p><p>I steel myself for Jonathan's reaction when he sees Sophie. Would he be angry that she risked his life to be rid of him?</p><p>Leticia is rubbing the back of his neck, nibbling his ear. He's projecting nothing but contentment, purring inside like a kitten getting a chin rub.</p><p>After a moment, he rouses himself long enough to face Sophie. \"I knew you were unhappy. You took a risk bringing Leticia into it, though. You would be dead if hadn't worked.\"</p> <p>\"You may still be dead,\" Leticia growls, \"if the spell turns out to be temporary. I need to know-what is Jonathan? Human or vampire?\"</p><p>Sophie shakes her head. \"I don't know. But does it matter? If he's human, you can change that.\"</p><p>Leticia raises her eyebrows. \"Hadn't thought of that. You're right. We'll test it tonight.\"</p><p>Jonathan looks around the bar. \"Are there any mirrors? If I am human, I'd like to get a look at myself.\"</p><p>Sophie spies one behind a booth. \"There.\"</p><p>He walks over, Leticia by his side. There's a fuzzy image, fading even as he looks. I get a flashback to my first realization that I was a vampire. A mirror image vanishing as I watched just as his does now.</p> <p>A stab of emotion washes over me-recollection of what I felt then-a sense of loss, uncertainty, fear.</p><p>That was eighteen months ago.</p><p>I've reconciled to what I am. Jonathan won't have to go through that same period of adjustment. He'd been a vampire a long time before his assimilation into Sophie.</p><p>Jonathan runs a hand through his hair, glances down at his hand with a frown. \"Well. I guess I have my work cut out for me. This guy was flabby and what's with this hair?\" He sweeps Leticia into his arms. \"Can you live with this face?\"</p><p>\"We've got other things to discuss,\" I remind him before he and Leticia start another round of petting. \"Prendergast had a job. Do you intend to take over his life as well as his identity?\"</p><p>He shrugs. \"I suppose it depends on how much fun I can have. And how much money he makes. I am used to a certain lifestyle.\"</p><p>Leticia clucks her tongue. \"Money is no object, my love. I have plenty for both of us.\"</p><p>\"And there is Jonathan's estate,\" Sophie adds quietly. \"I am willing to relinquish any claim. I still have my house in Denver.\"</p> <p>Jonathan waves his hand. \"All things we can discuss later. Tomorrow.\" His voice is husky. \"Right now, I have more urgent matters on my mind.\" He leans over and whispers in Leticia's ear.</p><p>She pulls back, grinning. \"You haven't had sex in how long? What are we doing standing here?\"</p><p>Jonathan looks at Sophie. \"Prendergast was in room 302, right?\"</p><p>She nods. \"The key is probably in his pocket.\"</p><p>Jonathan and Leticia barely take the time to wave on their way out.</p><p>Great. If I could hear Prendergast pecking at his computer and talking on the phone, what will it be like when those two start going at it?</p><p>I stay behind with Sophie to help her clear away the debris from her spell making and scrub the pentagram from the floor. We don't speak. I imagine it's a relief for Sophie to be alone with her own thoughts so I don't intrude with small talk.</p><p>We part at the hotel lobby and I go reluctantly up to my room. It's been a couple of hours, but the bed springs are still singing next door and the mingled moans of Jonathan and Leticia keep me awake long past dawn. The windows are open and once in awhile a whiff of sex and blood drifts in, making my own hormones jump into overdrive.</p><p>Tomorrow, I ask for a different room. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The ringing of a telephone wakens me from a deep sleep. With a groan, I roll over and look at the clock.</p><p>Ten A.M.</p><p>Between listening to Jonathan (I've already started thinking of Prendergast as Jonathan) and Leticia's uninhibited cavorting and trying to come to terms with the morality (or immorality) of what we did last night, I didn't get much sleep.</p><p>I pick up the receiver and croak, \"What?\"</p> <p>\"Well, good morning to you, too.\"</p><p>Leticia sounds much too perky, too cheerful. Her voice grates in my ear like nails on a chalkboard.</p><p>\"You sound well-laid,\" I grumble.</p><p>She laughs. \"And you don't. You're next door, aren't you?\" As if testing, she knocks on the wall. \"Sorry if we disturbed you.\"</p><p>\"I'm sure. Is there a reason for this wake-up call?\"</p> <p>\"We're meeting Sophie downstairs at eleven. Will you join us?\"</p><p>I tell her I will and hang up. I've no sooner swung my legs out of bed when I hear Leticia squeal with delight. I huff out a breath. \"Jesus. Not again.\"</p><p>And beat it into the shower.</p><p>I stand under a stream of scalding water, fighting emotions battling in my mind and body like prizefighters seeking the knock out punch. It's not just aggravation I'm feeling. It's jealousy. The closest I've come to a relationship like theirs was with a vamp I ended up killing. I don't seemed destined for a happily-ever-after.</p><p>At eleven, I'm dressed and waiting in the lobby. I'm the first one down. Leticia and Jonathan are probably going another round. But where is Sophie? I got the impression she called this meeting.</p><p>I take a seat in the lobby and watch people come and go. Ordinary mortals, some with kids in tow, heading out for a day of sightseeing or hiking or fishing. They all have a plan. A destination.</p> <p>What do I have?</p><p>No doubt about it. I'm in a funk. I need to get home and go back to work. I pull my cell phone out of my pocket and pull up my pilot's number. I'm just about to hit send when the elevator door opens.</p><p>Leticia and Jonathan spill out like teenagers on a first date, all smiles and giggles and roving hands. Their skin is glowing, the effect sex has on a vampire's constitution. It heats the blood and floods us with warmth. Leticia is wearing the same clothes as last night. Not surprising since she didn't exactly arrive in Leadville with a suitcase. But Jonathan has washed the slickness from his hair and it falls over his eyes and tickles the collar of his shirt. He looks younger and relaxed and healthy. Far different from the Prendergast of old.</p><p>I watch them approach with narrowed eyes.</p><p>I'm jealous again.</p><p>\"What's the matter, Anna?\" Leticia asks, plopping herself down on the chair next to me. Jonathan squeezes in beside her.</p><p>Naturally.</p><p>\"You look like you want to bite the head off a chicken.\"</p> <p>I puff out a breath and try to wipe the resentment off my face. I go for a smile but I'm doubtful I succeed in anything more than a grimace. \"Just tired,\" I say in an attempt to cover up the unreasonable hostility eating at my gut. \"Where's Sophie? I thought she was going to meet us?\"</p><p>Jonathan looks at the watch on his wrist as if seeing it for the first time. \"Hmmm. Patek Philippe. At least Prendergast had good taste. It's only eleven fifteen. She'll be here.\"</p><p>\"So what did you two decide? Will you go to New York or...?\" I realize I don't know where Leticia was when Sophie conjured here in Leadville. \"Where were you last night, Leticia, before Sophie yanked you away.\"</p><p>Leticia laughs. \"Good description of what happened. I was at my summer place in the Hamptons. In the middle of a party. I imagine they're still talking about my disappearance. Luckily they know how mercurial I am. Probably thought I decided to jet off to my place in Paris or Lisbon.\"</p><p>\"Nice life. I guess you were right when you told Jonathan money would be no object.\"</p><p>\"I've invested wisely,\" she says modestly.</p><p>\"Anyway, we'll go to New York from here. Check out Prendergast's offices and home. Jonathan did a little snooping on his computer last night. He has some interesting projects in the works. Might be fun to live his life for a little while.\"</p><p>Jonathan grins. \"First, though, there's a fiance I have to dump.\"</p><p>\"I offered to help with that,\" Leticia says. \"But he think it would be better if he handled it himself. I might be too-forceful.\"</p><p>If I have to spend any more time with these two lovebirds, I'm going to hurl. I start to rise, then remember something from yesterday. \"I overheard Prendergast speaking to his assistant yesterday. Her name is Nancy if that's any help.\"</p><p>\"Yeah, I got that from office email,\" Jonathan says. \"There were some personnel records, too, so I'm not going in completely blind.\"</p><p>I watch Jonathan slipping into another person's life as easily as he slipped into Prendergast's Gucci loafers. \"Don't you feel guilty?\" I ask.</p><p>He lifts a shoulder in a half-shrug. \"Prendergast is gone. He probably would have died soon anyway. His heart was bad. Mine is not. And don't forget, none of this was my doing. Sophie orchestrated all of it. If anyone should feel guilty, I'd say it was Sophie.\"</p><p>And me? I let it happen without interfering.</p><p>A little voice sets my spidey sense to tingling. Vampire reminds me: It may not be over yet.</p><p>Magic always exacts a price. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Do you think we should check on Sophie?\" I ask when eleven thirty comes and goes and there's still no sign of her.</p><p>Jonathan extracts himself from the chair. He's so tightly wedged in beside Leticia that I expect his rising to produce a giant sucking sound as he gets up. \"I'll go use the house phone,\" he says. \"See what's keeping her.\"</p><p>Leticia and I wait in silence for his return. She has a wonderfully giddy expression on her face as she watches him cross the room. She's in love.</p><p>Bitch.</p> <p>No. That's not fair. She's been given a second chance and she's not going to waste it. My skin prickles with envy.</p><p>Jonathan rejoins us. \"That's odd,\" he says. \"There's no answer.\"</p><p>But before we can comment, the elevator door opens.</p><p>Sophie's eyes scan the lobby. When she spots us, she starts over.</p><p>Not the Sophie I left last night. Not the young, beautiful girl with shiny hair and sparkling eyes.</p> <p>My breath catches. I hear Jonathan and Leticia gasp, too.</p><p>Only Sophie is smiling as if nothing is wrong. \"It's all right,\" she says.</p><p>But is it? This Sophie walks with a slight stoop, her face lined and wrinkled, her hair gone white. Even her eyes are changed. Not the color, they're still deep blue. But yesterday Sophie's eyes were hard and stormy with discontent. Today they twinkle with contentment.</p><p>She exudes tranquility and the stillness of inner peace.</p><p>Leticia jumps up and offers Sophie her chair. Sophie sinks into it with a sigh.</p><p>\"You look so troubled,\" she says quietly. \"Don't be. I expected this might happen.\"</p> <p>Jonathan crouches down and takes her hand. \"But you didn't look...\" He struggles with the words. \"You didn't look this old when you catered my party. What happened?\"</p><p>Sophie squeezes his hand. \"I had been experimenting with anti-ageing creams and lotions long before you came into the picture. Some worked pretty well. I may just try some of those formulas again. They're all in my basement at the old house in Denver.\"</p><p>She raises her shoulders. \"If they don't work, so be it. It's time I looked my age. Frankly, it's fatiguing to be young. I'm glad I don't have to play at it so hard anymore.\"</p><p>Jonathan exchanges a look with Leticia. \"We talked about this last night, Sophie. We want you to keep living on the estate. You can have your things brought over from the old house. Build yourself a proper lab. We won't be living there. You may as well enjoy it. And we feel we owe you.\"</p><p>Sophie shakes her head. \"No. You don't owe me anything. I took a chance that could have destroyed us both. Another example of the impetuousness of youth. If I had it to do over again today, I'd have second thoughts.\"</p><p>She pauses. Tilts her head. \"Well, maybe not. I believe in fate. Things work out the way they're supposed to. Look at you and Leticia.\"</p><p>\"In any case,\" Jonathan continues, \"The estate is yours. You are still legally Sophie Deveraux though I don't know how you're going to explain the physical transformation.\"</p><p>Sophie looks down at hands wrinkled with age. \"That might be a problem. I might take a page from my sister's spell book.\"</p> <p>She sees me jerk upright and grins. \"No. Nothing evil. Just a simple glamour spell until I see what I can do myself. To the world, I'll continue to look twenty. Might make things less complicated things until we can come up with a plan to return the estate to you.\"</p><p>Jonathan is shaking his head. \"I mean it, Sophie. You should stay on. I know you love the horses.\"</p><p>\"No. It's a wonderfully generous offer but in reality, I missed my little house. I missed my witch friends. Most think the old Sophie is long dead. Luckily we witches are known for having more lives than a cat. Of course, I'll have to be careful the way I reintroduce myself. Most of my friends are older than I am-I wouldn't want to give anyone a heart attack by popping up without preparing them first.\"</p><p>Happiness shines on her face the way the glow of love does on Jonathan's and Leticia's. I feel left out. The only thing I'm sure I'm projecting is discontent and gloom. A fucking thundercloud threatening to rain out the love fest. I'd better get out of here before the storm is unleashed.</p><p>I rise to go. \"I'm going home today.\"</p><p>Jonathan and Leticia stand up, too. \"We're leaving today as well,\" Leticia says. \"I called my pilot this morning. He'll have the jet here this afternoon. Sophie, can we take you to Denver?\"</p><p>Jonathan offers Sophie a hand and she lets him help her to her feet. \"That would be lovely.\"</p><p>Jonathan turns to me. \"It's been a pleasure knowing you, Anna Strong,\" he says. \"We've shared some interesting experiences and I won't forget you saved my-\" he grins at Sophie, \"Our life on more than one occasion. When Leticia and I get settled, we'd like you to come visit.\"</p><p>Leticia tilts her head, giving me a once over. I know a lot of interesting single men-mortal and vamp-who would be thrilled to meet the Chosen One. Interested?</p><p>Why not? I'm sure as hell not doing very well on my own.</p><p>Leticia picks up the aside and grins.</p><p>Sophie gives me a hug. It's a surprising and unexpected gesture and I find myself flooded with gratitude and relief. She doesn't say anything. She doesn't need to. The simple act soothes my soul like a rite of absolution.</p><p>Jonathan suddenly fixes me with a look that says he just got an idea.</p><p>\"This is great.\" Excitement shines from his eyes. \"Anna, you could write a book. All about what happened here. We'd change the names, of course, but I'd be your editor and we...\"</p><p>Leticia places a palm over his mouth. \"He's channeling Prendergast,\" she says gaily. \"We may have created a monster.\"</p><p>I look from Sophie to Jonathan to Leticia.</p><p>Contentment. Excitement. Passion.</p><p>Magic does exact a price. Sometimes it's well worth the cost.</p><p>THE END </p> </body></html>"]