["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nola stood in the center of the battle tent, watching as her sisters-by-race lined up. Each shifted eagerly from one foot to the other, clutching their weapon of choice. She spotted several axes, a few spears, but mostly swords.</p><p>Mating season had officially begun.</p><p>Soon the females would break into groups, fighting each other for the right to whichever stolen slave they desired. Those slaves, eight in number, were currently chained to the far wall at the end of the spacious enclosure. Three dragon shifters, two centaurs, two male sirens and a vampire. All eight were muscled, beautiful...and all but one was grinning. The vampire.</p><p>Her vampire. Zane.</p> <p>The men would be bedded this night and for several weeks to come. Then they would be freed, never to return. That was the way of the Amazons. Capture, breed and abandon. Of course the males were happy about this. All but Zane.</p><p>Zane had dark hair, equally dark eyes and the fiercest temper she'd ever encountered. He didn't like to be touched and had actually injured many Amazons - not an easy feat - in his quest for freedom. Finally, in an effort to tame him, they had stopped feeding him the blood he needed for strength. Now he was physically weakened, only able to lean against the wall and wait for his mistress to be declared.</p><p>However, nothing could weaken his hatred - or the promised retribution that radiated from him.</p><p>Nola had met him what seemed an eternity but had actually only been four months ago. He'd desired her, had tried to win her affections - and she'd tried to kill him. With the memory, guilt filled her. But in her defense, she hadn't known him then. Had only been concerned with her own survival. The gods had swept them to a remote island, along with several other creatures, and pitted them against each other, forcing them to fight, to watch helplessly as their friends were executed.</p><p>More than that, she'd spent her entire life hating men and the pain they brought with them. As a young child, she'd been sold by her own mother to male after male; she'd been used, hurt, taunted...ruined. Zane's desire had frightened her, and she had lashed out.</p> <p>And now, she was paying for that.</p><p>No one could see her. No one could hear her. Though she was encircled by the bright, golden light seeping through the tent's apex, no one knew she was there, that she'd been among them, month after month. The gods had cursed her with invisibility when she'd been eliminated from their impossible contest - and then chained her to this camp as surely as Zane was now chained.</p><p>The gods had seen to Zane's captivity, as well, gifting the vampire to the Amazons to use as they saw fit. And use him they would - and had. Because mating season had not begun until today, they had forced him to work their land, hauling boulder after boulder for the building of more tents. He'd had to find sticks and sharpen them into weapons. They'd even forced him to feed many of the women by hand. Of course, he'd tried to escape, so they'd resorted to starving him. That starvation caused him to weaken unbearably, rendering him useless. Lately all he'd been able to do was lie in place and curse.</p><p>\"Stand before the slave you wish to claim,\" Kreja, the Amazon queen, commanded. She stood at the edge of her royal dais, her gaze scanning, expectant. She was a lovely woman, with pale hair and light eyes, both of which gave her the appearance of fragility. But she possessed an iron core, a vicious nature.</p><p>The warrioresses broke apart, as Nola had known they would, and crowded around the males that tempted them.</p><p>Nineteen of the thirty-two females chose Zane.</p> <p>She had hoped their aversion to biting and blood would deter them. She should have known better. Strength was prized among the Amazons, and Zane had nearly won his freedom. Twice. They wanted that strength for their offspring, which was the entire point of mating season.</p><p>\"Excellent,\" Kreja said with a grin.</p><p>Zane snarled.</p><p>That delighted the women around him, edging them to a new level of eagerness.</p><p>Nola fought a wave of anger, of helplessness. She should not have feared Zane. She should have enjoyed him while she'd had the chance. His was the first touch in the entire span of her life that had not filled her with disgust. There had been something almost...reverent in his every gentle caress. If she'd welcomed him, he might have helped purge the demons of her past. He might have saved her from herself.</p><p>Now, she would never know.</p><p>\"Fight for me if you wish,\" he said through sharp, gritted teeth, \"but know that I will slay the winner with my bare hands.\"</p><p>He was not a man given to boasting, Nola knew.</p> <p>\"So vengeful,\" someone twittered happily.</p><p>\"So mine,\" another snapped.</p><p>\"It is I who will win his seed,\" still another growled. \"I who will give birth to his offspring.\"</p><p>\"No one will bear my child,\" he roared.</p><p>He is not meant to be a slave, Nola longed to shout. He was too proud, too defiant. Traits she also possessed. Which was why she had finally risen up and slain her own mother. Which in turn was why she sometimes cried herself to sleep, wishing she could claw the images from her mind.</p><p>Scowling, Nola strode forward and reached out, hoping that, for once, her fingers would do more than ghost through as she tried to shove the Amazons aside. As always, her hand slipped through their bodies as if she were nothing more substantial than mist.</p><p>A cry of frustration escaped her.</p><p>Still, no one paid her any heed.</p><p>\"Those of you who desire the vampire will now enter the arena.\" Kreja's hard voice silenced their arguments. Together they did as commanded, bypassing Nola, even stepping through her.</p><p>\"Damn you!\" she shouted. \"Hear me!\"</p><p>Of course, they did not.</p><p>Shoulders slumping, she closed the distance between herself and Zane and sank beside him. Like the others, he did not act as if he noticed. But she could almost - almost - feel his warmth, and goose bumps broke out over her skin.</p><p>\"Lily,\" Kreja called with a wave of her hand.</p><p>Lily, the child-princess who would one day rule this clan, stood up from her throne atop the dais and walked to her mother's side, her little body draped in velvet robes rather than the leather straps and skirts worn by the warrioresses.</p><p>She had changed much in the past few months. No longer was this queen-in-training giddy and innocent. Once having run from camp to prove herself worthy of her people - thereby inadvertently beginning a war between the Amazons and the dragons, a war she'd thought had caused the deaths of Nola and another Amazon - she was now solemn, determined to become a worthy leader. She'd even relinquished her right to claim Brand the dragon shifter, another of the gods' exiles, as her personal servant, and had offered him up to her people. He now sat among the other slaves.</p><p>\"You will not fight to the death,\" Lily proclaimed in her soft voice. \"But you will continue to engage each other until only one of you is left standing. It is she who will earn the right to bed the vampire.\"</p><p>After Nola's own experience with the gods' cruel contest, she had no desire to watch another. For Zane, however, she would watch. And she would wish.</p><p>There was only a slight pause before Kreja said, \"You may begin.\"</p><p>Immediately the women leapt into action. Metal clanged against metal, grunts abounded, and sand was flung in every direction. Bodies were collapsing, cries of pain echoing, as one pink-haired female savagely worked her way through the masses.</p><p>Soon, she was the only one standing.</p><p>Nola wanted to vomit.</p><p>\"And so we have a winner.\" Kreja motioned to Zane with a wave of her hand. \"Claim your prize, beloved. Know that we are proud of the strength and tenacity you have demonstrated today.\"</p><p>As the female approached, Zane trembled. In rage. Perhaps in fear.</p><p>\"I won't let her have you,\" Nola vowed, though she knew there was nothing she could do to stop what would happen. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The female was going to kill him, Zane thought dazedly, dispassionately.</p><p>She'd won him, however long ago she'd fought for him - one day? Two? Weak as he was, he'd lost track of time. All he knew was that she'd tried multiple times to bed him. But she needed a hard cock for that, and he hadn't given it to her.</p><p>Denying her had delighted him.</p><p>Now two of those wretched Amazons stood around him, staring down at his naked body. If he hadn't been half-starved and teetering on the brink of total collapse, those stares would have sent him into a killing rage. He hated being looked at as much as he hated being touched.</p> <p>He'd spent too many centuries as the demon queen's whore, hers to use, hers to hurt. And he'd suffered those indignities willingly, all for the love of a woman. A slave, as he was supposed to be now. Marina, that detestable queen, had promised to set his beloved free if Zane pleased her until she grew tired of him. But she'd never grown tired of him, and Cassandra, his chosen mate, had begun to hate him as a result. Yet, still he'd stayed, determined to finally win his prize.</p><p>And then Layel, the vampire king, had done the impossible and drained the demon queen, finally freeing both Zane and Cassandra, and he'd thought to earn back her love. After all, everything he had done had been for her. Only, she'd fled him. For another man. Perhaps that was for the best.</p><p>Zane was not the man he'd once been. He eschewed females and wanted no part of them. Wanted no part of sex. He shuddered at even the thought of it. The things he'd done...the things that had been done to him...sickness churned in his stomach. Had he eaten that day, he would have vomited.</p><p>But then Nola had walked into his life. Beautiful, passionate, fierce Nola. A woman who hadn't wanted him, who had rebuffed him. A woman he'd craved with every ounce of his being, despite what had been done to him. A woman the gods had taken from him. He did not know if she'd survived their island game or if the gods had set her free, but sometimes he would swear that he smelled her sweet scent, felt the gentle glide of her hands.</p><p>The first time he'd seen her, he'd thought her a gift from the gods. For why else would he have been able to endure - no, enjoy - her touch and no other's? Now, he thought that perhaps she'd been another curse. He craved her still, yet like Cassandra he could never have her. What did I do to deserve this?</p> <p>\"I'm strong,\" his \"owner\" said now, drawing his attention, \"so of course he desires me. I mean, look at what I did to my competitors! Eighteen against one, yet I owned that arena. But he's too weak to be claimed.\"</p><p>\"He needs blood,\" another said.</p><p>\"Yes, but if he's given blood, he'll be able to raise his head and bite me.\"</p><p>Both of the females shuddered.</p><p>Did these Amazons - who abhorred the biting of flesh and the drinking of blood and who thought to rape him to steal a child from him - not realize the child of a vampire would most likely need to bite and drink blood to survive?</p><p>Would they kill the halfling if it proved to be more vampire than Amazon? Even through the haze of weakness, rage sparked inside his chest. He would kill them first.</p> <p>Perhaps they meant to feed the child as they'd fed him, he thought next. The idea mollified him somewhat.</p><p>Before his last escape attempt, they'd kept him nourished by allowing him three small cups of blood a day. Who had donated the blood, he didn't know. Didn't care. What they didn't realize was that he never took from a living source. He only took from those he'd killed. As he was too weak to hurt them, they were in no danger of being bitten. Even starved as he was.</p><p>He would be lying if he said he didn't enjoy their fear and distaste.</p><p>But all of that was moot, he knew. He would never leave a child of his behind. What was his, was his.</p><p>\"Did you try manipulating his rod?\"</p><p>\"Of course. He's not my first slave, you know.\"</p><p>\"Well, give him blood, then bind his mouth. That way, he'll be strong enough to bed but unable to nibble on you.\"</p><p>\"Oh, excellent idea! Grab a goblet.\" The pink-haired woman - he hadn't cared to remember her name - palmed one of her daggers, sliced a groove in her wrist and held the wound over the offered goblet.</p> <p>His mouth watered at the sight and smell of that crimson nectar; his fangs elongated.</p><p>She approached him and held the cup to his lips. Thankfully, her skin did not touch his. \"Drink.\"</p><p>He obeyed, swallowing three precious mouthfuls. Instantly, warmth spread through him, followed on its heels by strength.</p><p>\"It's working. His color is returning.\" The cup was removed from his mouth, and he found his gaze locked with that of his captor. She was pretty, if he cared for such things. He didn't. He only cared that she had pink hair rather than black, brown eyes rather than turquoise, and she did not smell like Nola. Like sea and storms and flowers.</p><p>There was a pause, then a purr of agreement. \"He's beautiful, isn't he?\"</p><p>\"Don't forget he's mine,\" was the snapped reply.</p><p>\"Well, his cock is still flaccid, so you won't be claiming him any time soon,\" the other Amazon lashed back.</p><p>As the blood continued to work through him, the lethargy that had plagued him all these many days dissolved, leaving energy in his muscles, a sizzle in his bones. Escape, he thought, a growl working its way past his throat.</p><p>Both Amazons jumped away from him with a yelp.</p><p>\"Hurry! Let's bind his mouth.\"</p><p>\"Don't touch me!\" Growls intensifying, Zane jerked at the chains circling his wrists and ankles. He hissed and snapped, kicking as much as he was able as the Amazons maneuvered around him. \"No touching! Do you hear me? I'll kill you.\"</p><p>Suddenly a golden ray of light spilled inside the tent, and he would have sworn he caught a glimpse of Nola.</p><p>\"No - \" He stilled, his heart slamming against his ribs.</p><p>His captor moved, reaching for his neck, blocking the vision.</p><p>\"Out of my way!\" he shouted, bumping his hip against hers and sending her toppling to her face. He'd imagined Nola before, there in the battle tent. This vision, he planned to enjoy as long as possible.</p><p>Sure enough, there was a shimmering outline of long black hair, a glow of turquoise eyes, as Nola tried ineffectually to tug his captor away from him. He lost his breath. So lovely. His shaft hardened quickly and painfully. Nola. His sweetest tormentor.</p><p>Sadly, the illusion didn't last more than a few seconds. He wanted to scream and hurt and maim. To kill and be killed. The desire came too late, though, his stunned immobility costing him. The Amazon was able to leap to her feet and easily hook a thick strap of material around his mouth.</p><p>\"Finally.\" Sighing with satisfaction, she leaned away from him, crouching on her haunches and smiling smugly. \"And just as I suspected, your rod is - \" Her words halted and her smile faded as his cock withered before her eyes. \"But...you were...why...\"</p><p>He had only imagined Nola; he knew that, but he couldn't stop his gaze from searching for another glimpse of her. To his dismay, he saw only furs, carved furniture and weapons. Even as his captor attempted to arouse him once more, stripping for him, caressing him, he did not stop searching.</p><p>Finally, exasperated with him, the Amazon dressed and stormed from the tent, leaving him alone with his insanity. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As many times as Nola had been chained and used in her life, she knew the humiliation, frustration and helplessness Zane was feeling. He must want to kill Amelia, his new owner. She did.</p><p>Hurting another Amazon went against every instinct Nola possessed, every rule she'd ever been taught, but she would have sliced the warrioress to pieces if she'd been able to grip a blade. Zane's eyes had been so wild, his snarls desperate. And she'd been unable to aid him, had only been able to watch in horror.</p><p>\"I will take his place,\" she shouted to the ceiling, not knowing if the gods were listening. Or if they even cared. Zane didn't deserve this. No one did. But at least she had endured servitude before. The women wouldn't rape her, of course, but they would work her and beat her, both of which she could survive.</p><p>Air sucked through Zane's nostrils, and his body suddenly jerked. Then he began struggling against his bonds again. Her attention whipped to him. He was staring directly at her, his dark gaze boring into her.</p> <p>\"Zane,\" she said, rushing to his side and kneeling. \"Shh, now. Shh. You'll only injure your wrists and ankles further.\" Already he was bleeding, losing the blood he'd just been given.</p><p>He tracked her every movement.</p><p>Could he...no. Not possible. No matter how many times she'd wished otherwise, she'd remained as unnoticeable as the air he breathed. Besides, if he knew she was here, he would be fighting her as he'd fought Amelia. Perhaps even more violently. How many times, before this terrible punishment, had she rebuked his advances? Tried to hurt him? Called him vile names? All because she'd been too frightened of her feelings. I am not worthy of being an Amazon warrioress.</p><p>Frantic, Zane rubbed his jaw against his shoulder until the material fell away from his mouth. \"Nola,\" he rasped. \"Nola, Nola, Nola.\"</p><p>He could see her. Oh, gods. Oh, gods! Could she touch him? Her arm shook as she reached out, meaning to brush his hair from his face, but as always, her hand ghosted through him. She moaned in frustration.</p> <p>He laughed, the sound full of sweet satisfaction. \"I've finally slipped over the edge of sanity and I don't care.\" He relaxed against the blankets spread out beneath him. \"My Nola, here to comfort me. As beautiful as ever.\"</p><p>His Nola? A shiver moved through her. Oh, if only...\"You aren't imagining me, Zane. I'm truly here. I've been here since the day of your arrival.\"</p><p>Zane didn't seem to hear her. His gaze was too busy drinking her in. \"Of course I would imagine you like this, soft and lush, but still not mine to possess.\"</p><p>\"Listen to me. The gods cursed me, as they cursed you, only I am not to be seen, heard or felt.\" Until now. Why, why, why could she now be seen and heard but still not felt?</p><p>Finally, her words seemed to take root. His eyelids narrowed and his lips pulled tight against his teeth, revealing the tips of those deadly fangs. \"How can I see you now, then?\" he asked, mirroring her thoughts.</p><p>\"I wish I knew,\" she said on a sigh. Would others be able to see her, as well?</p> <p>\"So. Another curse is to be heaped upon me. To see, but never to touch.\" He turned his head from her, as if he couldn't bear to look at her another second. That was the treatment she'd expected from him, but it still hurt. You deserve it. Take it like a warrior.</p><p>At least he no longer thought himself crazy.</p><p>\"Why aren't you with Brand?\" he demanded.</p><p>Brand, the dragon shape-shifter who had been cursed right alongside them. \"I don't...\" What? She liked Brand, but she wasn't concerned with his treatment. He had not fought his captivity like Zane. He had embraced the thought of an Amazon owner. Other than Lily, that is. Lily had been too young for him, and he'd been nothing more than a maid for her. Since she'd released him to the ownership of the other Amazons, though, he'd looked nothing but content.</p><p>But even if he had not been enjoying himself, Nola still would have chosen to watch over Zane. His strength and determination, and even his wildness, drew her.</p><p>Maybe because that wildness had never truly extended to her. Even when she'd stabbed both of his shoulders with spears, he had not attempted to hurt her. He had cried out for her, wanting to be with her.</p><p>\"Why haven't you used your...gift to help you escape?\" she asked, ignoring his question. Much as this man had to hate her, she wasn't ready to voice her softer feelings. Even she didn't understand her change from tormentor to tormented.</p><p>His cheeks heated in embarrassment, but still he did not face her.</p> <p>He'd once used that gift on her. Had slipped inside her dreams and showed her how good it would be between them. How he would kiss and taste every inch of her body, enjoy her, help her enjoy him. \"You can show the Amazons the destruction you will unleash if they fail to release you.\"</p><p>\"The gods stripped me of the ability when they sent me here. I can no longer enter dreams. Or create nightmares. They also stripped me of my ability to transport myself to other locations with only a thought.\"</p><p>Damn them! \"There has to be a way to free you. I wish I could leave camp and visit your king. Word has spread through Atlantis that he is wed now to my sister, Delilah. They would help you, I know it. And maybe, like you, they would be able to see and hear me. But I am bound to this camp, as surely as if I were shackled. I cannot leave its boundaries.\" Or perhaps she could, now that part of her curse seemed to be lifted. She wanted to check, but couldn't force herself to move away.</p><p>Zane shifted even further away from her, and his chains rattled. It was another stark reminder of their doomed circumstances. \"Why would you help me?\"</p><p>\"Because I - \" She peered down at her hands. Her fingers were twined together and twisting the leather of her skirt. They wanted to be on Zane's body, learning his every nuance. What would make him gasp in pleasure? What would make him moan? \"I owe you. I hurt you, and I'm sorry for that. Sorrier than I can ever express. I want - \"</p><p>\"Enough,\" he growled, cutting her off. \"I don't want your apology. I never did. I've always wanted you...your body.\"</p><p>Need trembled through her. \"Yes.\" Yes. That's what she wanted, too. \"But you can't touch me. How...\"</p><p>\"We will figure it out. Climb on top of me.\"</p><p>She did, straddling his waist. His eyes closed, and he arched up. She imagined his hard shaft rubbing against her and moaned. \"Zane, I - \"</p><p>The entrance to the tent flapped, and Amelia strode inside. \"Well, vampire. I have decided - \" Her eyes widened, and she stopped. \"Nola? What are you doing here?\"</p><p>Nola jumped up as though burned. She wanted to scream in frustration, but held her tongue. One question had been answered, at least. Others could see her. \"Hello, Amelia.\" Did she sound as breathless to the warrioress as she did to herself?</p><p>\"We thought you were dead.\"</p><p>\"You thought wrong.\"</p><p>Amelia's dark gaze swung to Zane, then back to Nola. \"Either way, you will move away from my slave.\"</p><p>\"Nola,\" Zane said, and there was a warning in his tone.</p><p>A warning of what? Nola didn't face him, but squared her shoulders and forced her expression to harden. \"How is he truly your slave when you have not yet battled every female who would lay claim to him? Amelia, I challenge you for the vampire.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Hurry! She'll return any moment, and she'll have others with her. Perhaps the entire army.\"</p><p>Zane watched as Nola tried and failed to jerk the head of his chains from the iron pole they were attached to, a pole that was anchored deep in the earth. As before, her fingers merely passed through the object.</p><p>His shock had yet to diminish. Nola was here; Nola thought to help him. After her announcement, his captor had stormed out of the tent with every intention of speaking to the Amazon queen. Nola wanted him for her own.</p><p>Earlier when she'd apologized to him, it had not been remorse thickening her voice. It had been desire. Then she'd climbed on top of him without hesitation, had moaned when he'd arched into her. He hadn't been able to feel her, but oh, just the thought of doing so was enough for him.</p> <p>\"How do you propose to fight her?\" he demanded. \"You cannot hurt her, and she cannot hurt you.\"</p><p>\"I didn't want to fight her. I wanted time. And why are you just lying there?\" She peered down at him, hands on her hips, dark hair streaming wildly around her delicate face. There was the soldier he knew. \"Fight free!\"</p><p>\"You will come with me? If I escape?\"</p><p>\"If I can, yes. I want that more than anything,\" she added in a whisper.</p><p>Again, there was no hesitation. There was even a flicker of hope in her magnificent eyes. She truly did not hate him.</p> <p>What had brought about this change in her? Doesn't matter right now. Everything he'd craved these many months of his captivity - Nola, freedom, a chance to be together - was now being offered to him. No longer did he feel cursed. Never had he been so blessed.</p><p>He couldn't feel her? So what. Being with her was more important.</p><p>He was suddenly fueled with a fervor he had never experienced before, not even when he'd been whoring for the demon queen, desperate to save Cassandra. He wanted this. Would have this. Just as...soon as...he broke...free. For what seemed an eternity, he pulled hard at his wrists and ankles, straining so forcefully his bones eventually gave way.</p><p>Out came both his ankles; out came both his wrists. The pain of it nearly bowled him over as he sat up, then stood to trembling legs. He didn't care. He was free at last.</p><p>\"I hear them,\" Nola gasped. \"Come on.\" She made to grab him, but her hand misted through his body. \"Damn this!\"</p><p>There was no sensation, no chill, but the knowledge that she had tried to touch him caused him to shiver rather than shudder. From the very first, it had been that way. Others he ran from. Others he abhorred. Her, he only yearned for more of. Why?</p> <p>\"This way.\" She raced to the far end of the tent. \"Raise the flap.\"</p><p>He lumbered to her, stumbling constantly, and did as commanded. All the while, his battered body screamed in agony, black winking over his vision, stomach threatening to heave. Vampires were fast healers, but he'd been without blood too long, the few sips he'd had earlier already used up.</p><p>Outside, light poured from the crystal dome surrounding all of Atlantis, heating and stinging his now-sensitive skin and making his eyes water. This kind of reaction had only happened once before. On that cursed island of the gods. The reminder of his time there infuriated him and that fury gave him strength. Tent after tent dotted the surrounding land. Amazons were scattered throughout. Some were bent over a fire and hammering at weapons; some were hanging animal hides.</p><p>\"Walk behind me,\" Nola said, \"as if you are my slave.\"</p><p>She moved forward, head held high. Behind him, he could hear a murmur of voices inside his captor's tent. Amelia had returned, and she had indeed brought an army with her. Zane kicked into motion. Thankfully, no one paid them any heed - until a horn blasted. The Amazons around him straightened, a few even reaching for weapons.</p><p>\"Run,\" Nola shouted, picking up speed. \"Run.\"</p><p>No longer content to remain behind her, he matched her pace. A forest loomed a few yards ahead, thick trees promising cover.</p><p>\"Nola!\" someone shouted. \"Stop!\"</p> <p>\"Vampire,\" his captor screamed. \"Not another step. I will punish you.\"</p><p>Zane tripped over a rock. He lurched forward, his broken ankles unable to support him. When he hit the ground, he hit hard and lost every bit of oxygen in his lungs. Grimacing, he lumbered back up. Started running again.</p><p>All the while, Nola encouraged him. \"You can do it. I know you can. That's the way. Just a little farther.\" But when they reached the trees, she stopped and screeched. \"No! No, no, no.\"</p><p>He, too, stopped and faced her. He tried to grab her, but as always before, encountered only air. \"Come. Now.\"</p><p>\"I can't. It's like a wall is blocking me.\" Frantic, she tossed a glance over her shoulder at the scowling Amazon warrioresses bearing down on them. \"Go. Please. Just go.\"</p><p>He remained in place, the screams in his head no longer for his bodily pain. He couldn't leave this woman behind. But he couldn't stay here, broken as he was. He was no good to either of them. Damn the gods to Hades!</p><p>\"Will they attempt to punish you?\" he asked.</p><p>\"They can't hurt me. They might be able to see me, but I'm untouchable, remember?\" She smiled, but it didn't quite reach her eyes. \"Now go, before they take you. They will not be as gentle with you this time.\"</p><p>\"Nola...\"</p><p>\"Zane. Go. Please. Save yourself. You are not meant to be any woman's slave.\"</p><p>A muscle ticked below his eye. \"I will come back for you. Soon as I'm healed, I will come back.\" As he spoke, he walked backward. Only when she was blocked from his view did he spin and run. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nola faced off with her sisters. They formed a menacing half-circle around her, each glaring at her.</p><p>\"You freed my slave,\" Amelia growled, and several warrioresses booed and hissed at Nola.</p><p>She had always been something of a tribe outsider, so she wasn't surprised at the cold welcome. \"He isn't yours, but yes,\" she said proudly. \"I freed him.\"</p><p>A frowning Kreja stepped forward, separating herself from the masses and placing herself nose-to-nose with Nola. \"I want five of my elite armed and hunting the vampire within the next five minutes.\"</p> <p>Footsteps echoed as the warrioresses complied.</p><p>\"And you,\" the queen continued, \"you know the punishment for stealing your sister's slave?\"</p><p>\"Yes,\" Nola repeated. The punishment - a savage, wish-you-were-dead whipping. Not that they could administer it. But even if she'd been tangible, she would have risked it. Zane's freedom was worth losing the skin on her back. At the very least.</p><p>\"Delilah returned and told us you lived still, but that did not stop our worry for you. And now I find you here, working against us. Why would you do such a thing?\" the queen asked, sounding genuinely curious rather than enraged.</p><p>\"The vampire had endured enough at the hands of the Amazons. Like us, he is a living being with feelings. He is courageous, wild as the animals in this forest and fierce beyond imagining.\"</p> <p>And he would return for her. She trusted him.</p><p>Never before had she trusted a man, but she trusted Zane. Having watched him these past few months, she knew he was not the kind of man who made vows lightly. She knew he did not say things simply to placate his audience. Oh, yes. He would return.</p><p>What they would do when he reached her, she didn't know. She only knew that she needed to be with him. To see his face and hear his voice. She could live with any curse, as long as he was alive and well and with her.</p><p>Kreja sighed. \"Wise words, but that does not change what you have done. Not only did you free a slave, you freed your sister's slave. For that, you will deal with Amelia in the battle arena. She will be armed. You will not. Afterward, if you survive, you will be whipped, as is our custom.\"</p><p>The queen reached out - and wrapped her fingers around Nola's suddenly solid forearm, dragging her toward the arena, Amelia close on her heels. Nola gasped in shock. What...why...how was it possible?</p><p>\"I will not go easy on you,\" Amelia snarled at her.</p> <p>They can touch me. Which means they can hurt me, Nola realized, dread sweeping through her.</p><p>Would she be alive when Zane returned?</p><p>Zane reached the vampire stronghold and collapsed at its gates. His strength - gone. His wounds - unhealed. Followed as he'd been, he wouldn't have been able to hunt for food. Broken as he was, he'd been unable to capture a single animal and feed himself.</p><p>Thankfully the guards recognized him. He was hefted over a shoulder and carted inside the palace. The touch disturbed him, but he didn't fight it. He was in too much of a hurry and knew this was the best way. By the time they reached his personal chamber, there was a buzz of activity, his name being whispered from everyone's lips.</p><p>\"Blood,\" he rasped as the guard lay him down on the bed.</p><p>That guard tilted his head, offering his own neck.</p><p>Zane shook his head and closed his eyes. \"Glass.\" He would not take from a living source. Still couldn't stomach the thought - unless that living source was Nola. Once, when he'd ensured she would welcome him by invading her dreams, he had tasted her. The sweetness of her blood...the decadence of her moans...and he'd reveled in every nuance of her. He would not overshadow that precious memory by taking from someone else, even in his desperation.</p><p>How did she affect him this way?</p> <p>Perhaps he did not mind her hands on him because he saw himself in her eyes. Saw vulnerability and pain, fear and yearning. Perhaps they shared a similar past; she'd alluded to such a thing once before, when they'd been pitted against each other on the island. That meant someone had hurt her at some point in her life. Hurt her deeply and unequivocally. Zane wanted to destroy that someone, bit by bit.</p><p>Warm hands settled on his shoulders and shook him.</p><p>His eyelids fluttered open, a growl in his throat. When he saw that Layel loomed above him, glass in hand, he forced himself to relax against the feathered mattress. \"My king, I - \"</p><p>\"No talking just yet. Drink,\" Layel said, placing the glass to his lips. Tall and leanly muscled, with white hair and blue eyes, he was an eerily beautiful sight that reminded Zane of both his rescue from the demon queen and the horrors he'd endured at the hands of the gods. \"Drink.\"</p><p>Zane opened his mouth, and the sweet nectar of life poured down his throat. He swallowed greedily. Once again, warmth spread through him. Warmth and strength and determination.</p><p>He had not lied to Nola. He was going back for her. He would conquer that damn camp and everyone inside it. Nola will not like that. Those women are her sisters.</p><p>Well, they damn well should not have tried to enslave him, he thought darkly. But he knew deep down that he wouldn't hurt them. Not really. For Nola, he would simply send them on their way, claiming the camp as his own and remaining there until she could leave.</p><p>\"Good now?\" Layel asked.</p><p>\"More,\" he said when the supply ran out. He'd need every ounce of his strength to conquer the Amazons.</p><p>Layel cut his wrist, filled the glass with his own life force, and offered it up. This time, Zane was able to hold the glass on his own. He drained every drop. When he finished, he licked his lips and faced the king.</p><p>\"I am ready to talk,\" he said. \"You escaped the gods and their island.\" He grunted as his wrists and ankles popped back into place. \"Did you win their game?\"</p><p>The king's lips slowly lifted in a grin. \"Delilah did. She saved us both. We have been searching for you since the moment of our return, but the Amazons hid you well.\"</p><p>\"Have you news of my sister?\" a female voice asked.</p><p>Zane looked past his king and saw Delilah standing in the doorway. She was petite in appearance, but as fierce as Nola on a battlefield. Her blue hair was falling around her shoulders, and worry was etched in the violet depths of her eyes.</p><p>\"She is alive,\" he told her, and she expelled a relieved breath. \"And she is mine.\"</p><p>\"And does she agree with that statement?\" Delilah's head tilted to the side as she rubbed at her slightly rounded belly.</p><p>Slightly rounded. A baby? Layel was to become a father? An ache bloomed in Zane's chest. He'd wanted children with Cassandra. Had dreamed of them. Yet that, too, had been denied him. Until...now?</p><p>With Nola...You cannot truly touch her, you fool. That dream is still dead. He couldn't make himself care, however. As long as he had Nola, nothing else mattered.</p><p>\"Well?\" Delilah insisted.</p><p>Did Nola wish to belong to him? she'd asked. He thought so, yes. She had helped him. She had even wanted to go with him. But she was also a warrior to her core, an Amazon warrior at that, and they only tolerated men during mating season. He wanted far more than that. No matter the circumstances. He wanted what Layel and Delilah clearly had.</p><p>\"We will see,\" Zane said, kicking his legs over the bed.</p><p>\"You only just returned,\" Layel said. \"Where are you going?\"</p><p>\"To get my woman.\" This one, he wouldn't let get away. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Grunts, groans and the clang of metal against metal roused Nola from her troubled sleep. She wanted to rise, to see what was happening, but could not force her body into action. Her back was a mass of agony, the skin flayed completely. The rest of her, well, it had not fared much better during her battle with Amelia. Nola had won, her determination stronger than any weapon, but she had not emerged unscathed. There were deep sword slices all down her arms, stomach and legs.</p><p>She lay on her bed, her stomach pressed into soft blankets. Alone, always alone. No one was allowed to help her. Not in any way. Amazons healed as slowly as humans, so she knew she would suffer like this for many weeks to come.</p><p>Outside, a scream echoed. Her muscles were heavy as stones, and she didn't have the strength to drag herself upright. Or gather food. Not that she even had the strength to eat. She wanted to help her sisters, though. Despite what had been done to them, she loved them.</p><p>\"You will die for this, vampires!\" someone shouted.</p> <p>\"Not by your hand,\" she heard a male voice say. The vampire king?</p><p>Despite her pain, Nola grinned. Relaxed. Zane was here.</p><p>For hours, the battle continued to rage. Nola didn't want her sisters injured, but neither did she want Zane to lose, and waiting proved difficult. She chewed at her cheeks, dug her nails into her palms and broke into a sweat, which caused her back to burn as if it had been set on fire.</p><p>Finally, the tent flap rose and light flooded inside. And then he was there, standing in front of her. Her vampire. Zane. Her heart knocked against her ribs.</p><p>\"Knew you'd come,\" she said, her voice barely audible. She hadn't screamed during her whipping, hadn't made a sound, but holding her cries inside had scraped her throat raw.</p> <p>\"Nola...sweet...\" He approached her slowly, as if she were a trapped animal. \" What did they do to you?\" There was horror in his tone. He crouched beside her, reached out and smoothed her hair from her damp forehead. Then he froze. \"How is this possible? I'm touching you.\"</p><p>\"Yes. Happened just after you'd left.\" Any other time, she would have been mortified for him to see her like this: broken, helpless, naked but for a sheet covering her lower half. Her relief at seeing him alive and well, however, was simply too great.</p><p>\"I will destroy the gods for this. I will find a way to raid the heavens and I will - \"</p><p>\"No, no. This is a blessing. I've had time to think, and I believe I know what's happening. Each time I admit something about you, like the fact that you did not deserve what was done to you, and that I trust you, I've been given back a piece of my life.\"</p><p>His brows furrowed together, and a spark of hope entered his eyes. \"Can you pass the camp boundary?\"</p><p>\"No. My sisters carried me there, meaning to toss me out, but that invisible wall blocked them.\"</p> <p>Fury replaced the hope. \"We didn't hurt your sisters - I knew you would hate it if we did, but now I wish I'd sliced each and every one of them to pieces. They abandoned camp or I would see to it now.\"</p><p>\"You're here now. That's all that matters. But...how long will you be able to stay?\" Her nervousness returned. His king would want him back. And the Amazons would one day come back. \"You can't remain forever and I can't leave. We'll be forced to separate again and - \"</p><p>\"It's all right. It's all right, sweet. I'm here, and I'm not leaving without you. No matter what. You freed me. I will find a way to free you.\"</p><p>The burst of strength her nervousness had given her drained, and she expelled a breath. \"As long as I have you, I'll be all right.\"</p><p>\"Yes, you will.\" He stretched out beside her and angled his head, displaying his neck to her. The scent of him filled her nose. Dark spice and tree dew. She inhaled deeply, savoring.</p><p>\"Drink,\" he said.</p><p>\"Wh ̈Cwhat?\" Even when they'd been trapped on that island, he had not let anyone drink from him. Not from his wrist, and certainly not from his neck.</p><p>\"Drink. I know biting and blood are distasteful to your kind, but you will heal faster if my blood flows inside your veins.\"</p> <p>\"No, you don't understand. I don't mind drinking from you. I just don't want to disgust you. I know you do not like such things being done to you.\"</p><p>\"I want to give you everything, Nola. Even this. With you and no other. I need this, so please. Please.\"</p><p>Please, this proud, strong man had said. How could she deny him? She cried out as she edged toward him and sank her teeth into his neck, hard as she could, cutting past skin and hitting vein. Blood instantly trickled down her throat. Once, the thought of doing this would have been distasteful to her, as he'd claimed. But this was Zane. She wanted him inside her. Any part of him that she could get. And like him, she wanted him to have everything she had to give.</p><p>\"I never thought to allow someone to take from me again,\" he said, petting her head. \"The demon queen, I was her slave for many centuries and she took from me whenever and however she desired. Her methods sickened me, but I allowed them because she had something - someone - my compliance was supposed to purchase. Did I ever tell you that?\"</p><p>He was trying to distract her from her task, she suspected, as the warmth of his blood spun through her, lighting her up from the inside out. But she did not stop, because she wanted to hear more.</p><p>\"When she died and I was freed, I thought to never endure such things again. You, though, I think I would allow to do anything to me. It has been that way since the first. I don't understand it, either. Your presence doesn't drown out the memories or take away my revulsion for this act with others. My...need for you simply overrides it. But why do I need you, do you think?\"</p><p>Finally she pulled from him. She didn't move away, but snuggled into his waiting embrace, head cradled in the hollow of his neck. The action pained her, but only a little. She could feel the flesh weaving together on her back.</p><p>\"When I was a child, my mother mated with a man and left the Amazon camp to live with him. They had no money and so they...sold me, time and time again,\" she said, heat spreading over her cheeks. \"I know the desire to never again be touched by another. But with you...\"</p><p>\"Oh, sweet. I am so sorry.\"</p><p>That gentle tone brought tears to her eyes.</p><p>He wrapped his arm around her, careful of her injuries. \"You once told me your family had destroyed you, that you had killed them for it, but I had no idea they'd done such things to you,\" he said.</p><p>She flattened her palm against his chest, exactly as she'd wanted to do all these months while watching him. His heart beat, fast and hard. \"Maybe we remind each other of what we were like, before. Unafraid, untainted. Maybe we see the future in each other and the past ceases to matter.\"</p><p>He didn't reply, which disappointed her. Instead, he settled her onto the blankets and sat up, which angered her. Did he not want a future with her? Was that what his silence signified? Did he -</p><p>He traced a fingertip along her spine, and she shivered. \"All healed,\" he said huskily. \"And now, all mine.\"</p><p>Thank the gods. She wasn't sure what she would have done if he'd rebuffed her as she'd once done him.</p><p>\"Make love to me, Zane.\" She'd never been with a man of her choosing. Never given herself completely. She was suddenly desperate to know what that was like. With this man. Only this man, who was surely a gift from the heavens, even amid her curse. \"Please.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Zane flipped Nola to her back so that she was peering up at him. A gasp escaped her, but she didn't try to scramble away, even though he loomed above her, dressed in his blood-splattered battle clothes while she was naked.</p><p>Her breasts were small but firm, perfectly tipped with hard pink nipples. Her stomach was flat, her skin sun-kissed and smooth. He could see every ridge of her ribs and knew she hadn't eaten since his departure six days ago. Damn her sisters! Had she not already been through enough torment, without her tribe adding to it?</p><p>He was going to burn away the images of what they'd done to her. Burn away the memories of the men who had used her. He would replace both with thoughts of himself. He didn't care what he had to do to accomplish it.</p><p>\"Have you ever experienced pleasure in the act?\" he asked.</p> <p>Up and down her chest rose with the force of her breathing. \"No. You?\"</p><p>\"Long, long ago.\" He only prayed he remembered how to please his woman. With the demon queen, he hadn't cared to try. He'd simply endured. Never had a female's enjoyment been more important to him. \"If I scare you, do something you don't like, tell me.\"</p><p>She nodded, nervously licked her lips. \"You tell me, as well.\"</p><p>It was his turn to nod. Rather than suck on her nipples as he desired, he lifted himself off her, reached behind him and tugged off his shirt. He tossed it aside. His boots and pants quickly followed, leaving him as bare as she was.</p><p>Nola's gaze traveled the length of him, and fire leapt inside her turquoise eyes. \"Zane...\"</p> <p>\"Afraid?\"</p><p>\"No. You won't hurt me. I just wanted you to know I like what I see.\"</p><p>Her trust emboldened him, as did her praise. Gently he eased atop her. Skin against skin, hardness against softness. They moaned in unison. Contact with anyone else, even his king, was hell. Contact with Nola was heaven. Her legs opened, allowing him a deep cradle.</p><p>\"I want to kiss you now,\" he said.</p><p>Only when she whispered her consent did he lean down and press his lips against hers. Softly at first, barely even a touch. But the sweet scent of her was in his nose, her nipples hard against his chest, her thighs pliant against his, and soon he had to have more. He licked at her, and her lips eagerly parted. His tongue glided past their teeth to intertwine with hers.</p><p>He'd had her blood, but he'd never had her mouth. To his delight, this was even better. Sweeter, headier, not for living or healing or even to relieve hunger, but simply for pleasure. It was addictive, and he wondered how he'd gone without this for so long.</p> <p>Tentatively, she tangled her hands in his hair. And at first, her tongue was hesitant against his. Seeking, as if she wasn't sure what to do with it. But the more he explored her mouth, the bolder she became. Soon their teeth were banging together, their bodies writhing against each other. Sweat was beading over his skin, his blood heating as though lava flowed in his veins.</p><p>\"Going to...suck your...breasts now,\" he managed to say between pants. \"Like that?\"</p><p>\"Yes. Yes.\" She, too, was panting. She, too, was sweating. Her eyes were closed and her head was thrashing from side to side.</p><p>I did that. Pride filled him as he lowered his head, fitting his lips around one tight little pearl. He laved it with attention before turning to the other one - careful, so careful to deliver pleasure without any sting.</p><p>When he kissed his way down her stomach, she quivered and gasped his name.</p><p>\"Stop?\" he asked. Would be difficult, but he would find a way.</p><p>\"More.\"</p><p>Thank the gods. Never had he been more determined in his life. He would know this woman, every inch of her. Nothing would be prohibited. Body, mind...soul. Mouth watering, he licked between her legs. Wet, wild, wanton.</p> <p>A memory of doing this very thing to the demon queen slipped into his mind. He'd once hated this act - until he'd tried it on Nola on that island. Oh, how he had enjoyed doing so, which had shocked him. Since then, he'd craved it - another shock. He wanted this to last forever. Nola was precious, a treasure, her cries a drug for his ears. Do not think about the demon. She has no place in this wondrous moment.</p><p>\"Like?\" Please, please, please.</p><p>\"Mmm, yes. Before, they just ripped at my clothes and shoved their way - \"</p><p>\"No, no. None of that.\" As she'd spoken, she'd stopped writhing. Had released her death grip on his hair. \"That does not belong between us. It's just you and me in this bed. You and me.\"</p><p>Her eyes were luminous as she nodded. \"Bite me, then. Take my blood and remind me that my vampire is claiming me.\"</p><p>\"No. No, I can't.\"</p><p>'Because you do not take from living beings?\" she asked hesitantly.</p><p>\"You, I would gladly take from. Anytime you would have me.\" It was the truth. \"But as I told you, I know your kind abhors that, and I will never ask you to do anything you do not want to do. I will find my nourishment elsewhere.\"</p><p>\"No!\" she shouted, and it was a soldier's cry. She might appear delicate, but she truly had the soul of a warrior. \"You will only ever take from me.\"</p><p>A possessive warrior, he realized, wanting to grin. He crawled up her body, fit his cock against her moist entrance. \"I will only ever crave you, sweet. That much is true.\"</p><p>\"I need you inside me. I need to feel you, as deep as you can go. Your shaft - and your teeth. Take all of me. Please.\"</p><p>Oh, that please...He'd seen the way her expression softened when he'd uttered that word. Now she thought to use it against him, bless her. Inch by inch, he sank inside her, careful, meticulous. Never had he exercised such exquisite care. Finally, though, he was in her to the hilt. They were joined; they were one. She surrounded him, hot and tight and wet, and it was better than he'd anticipated.</p><p>Tenderly he cupped her face. Her beautiful face. His thumbs brushed over her lips. He would care for her all the days of his life. He would ensure no one ever hurt her again. \"Ready?\"</p><p>\"For you? Always.\"</p><p>He withdrew from her, almost all the way out, before sinking back in and groaning at the bliss. Her back arched, and her perfect white teeth nibbled on her bottom lip. Her head fell to the side, revealing the delicious plane of her neck. Still he did not bite her. He wouldn't. Wouldn't do that to her.</p><p>In and out he moved, in and out he savored her. He stared into her eyes the entire time, and she stared into his. It was as if they were each other's anchor. As if seeing each other kept them here, locked in the moment, just the two of them, safe and cherished. There was nothing else, no one else, the fruition of every secret yearning he'd ever possessed.</p><p>\"Bite,\" she commanded.</p><p>\"No. You are healing.\"</p><p>\"No, I am healed. Bite me. I want it. I need it. Don't deny me this. Please, don't deny me this.\"</p><p>\"Nola - \"</p><p>\"Please, Zane. Please. With you, nothing seems wrong. Don't make me beg.\"</p><p>He could not stand the thought of this strong woman begging for anything. He bit, fangs driving into her neck. The sweetness of her taste exploded on his tongue, through his body, making his muscles quiver and his bones vibrate.</p><p>\"Zane,\" she cried as her inner walls spasmed around his shaft. \"Zane, Zane.\" Her hands clutched at his back, her nails digging into his muscles. \"Yes, yes, yes.\"</p><p>\"Nola!\" That was all his body needed to propel into its own release. He roared, shooting inside her, filling her up with everything that he was. In that moment, his entire existence made sense. He'd been born to be this woman's mate. He'd given himself to a demon to better understand this precious woman's pain. He'd been chosen for the gods' cruel game to ensure this woman's survival.</p><p>He loved her. Would always love her.</p><p>And now, he thought, an idea springing to life, he would save her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nola cuddled against Zane's body, happier than she'd ever been in her life. She'd just made love. Truly made love. And it had been amazing. Her body had hummed with pleasure, and her mind had soared to the heavens.</p><p>Only once had she considered her past, and Zane had quickly defeated the memories, as only a strong, fierce warrior could. No one had ever made her feel as protected or as prized as this man had. She hadn't thought such feelings possible, actually.</p><p>\"Zane,\" she said, grinning. She was buzzing with joy, drunk with it, and just might smile for the rest of her life. \"Thank you.\"</p><p>\"I did do a good job, didn't I?\"</p> <p>It was the first time he'd ever teased her, and she liked it. A laugh bubbled from her; she couldn't hold it back. Soon she was laughing so hard, tears were streaming down her cheeks.</p><p>Zane's lips were twitching. \"Some men would take this as a criticism of their performance.\"</p><p>\"But as you know you did a good job...\"</p><p>\"I'm not one of them,\" he agreed.</p><p>They shared a grin.</p> <p>His arms tightened around her. \"You said every time you admitted something about me, you were freed from some part of your curse.\"</p><p>\"Yes.\" Reminded of her plight, some of the happiness drained from her.</p><p>\"Then do you have something else to admit to me?\"</p><p>\"Oh. Well...I-I - \" Nola sat up and peered down at him. No longer did he appear so confident and joyous. His expression was blank. No, not blank. Fear was sparking in the depths of his eyes. For some reason, seeing it gave her courage. \"I love you. I love you so much I ache with it.\" The words tumbled from her; she couldn't stop them. \"I can't imagine my life without you in it. I want to make love to you every night and wake up to you every morning. And I don't want you to think I'm saying this only because I wish to lift the curse. I'm not.\"</p><p>\"You are too honest for such a trick.\" He grabbed her and rolled her under him. \"And just so you know, I love you, too. So much I would die without you. You are my life, my heart, my everything. Wherever you are, that's where I want to be.\"</p><p>She hadn't dared dream of having a man like him, or a life like they would surely lead, not even as a child. It had seemed too much to ask, too unattainable, and she had preferred to wallow in her sorrows rather than risk hope.</p> <p>\"The gods didn't take your ability from you,\" she said. \"You can still create dreams. For the first time in my life, I see joy in my future.\"</p><p>\"Oh, Nola. You are my joy.\"</p><p>With another laugh, she threw her arms around him and rolled him to his back. Her dark hair fell around him, forming a curtain that left only the two of them - just the way she liked it.</p><p>They made love twice more and spent several hours simply talking and getting to know each other better, before dressing and emerging from the tent. Night had fallen, but vampire warriors still patrolled the area.</p><p>Nola spotted the king and her sister in front of the fire. There was no love lost between herself and Delilah. Nola had once tried to murder Layel, after all. She marched on, determined. Anything for Zane. Still...</p><p>\"Will they...what if...\"</p><p>Zane captured her hand with his own and squeezed. \"They will love and welcome you or we will find somewhere else to live.\"</p><p>She shook her head. \"I don't want you to lose everything you hold dear because of me.\"</p> <p>\"Nola,\" he said, stopping her and forcing her to look up at him. \"You are all that I hold dear. Nothing else matters to me.\"</p><p>Tears burned her eyes. \"What did I ever do to deserve you?\"</p><p>\"It is I who is undeserving. But you have my word, I will do everything in my power to prove myself worthy of you.\"</p><p>She pressed a soft kiss to his lips. \"You already have.\"</p><p>\"Nola,\" she heard Delilah call.</p><p>Nola turned and Zane wrapped his arms around her, keeping her in the protection of his embrace. The blue-haired warrioress was walking toward her, expression blank. Layel stayed close on her heels, a blade in his hand, as protective of his woman as Zane was of Nola.</p><p>\"You are well,\" Delilah said.</p><p>\"Yes. And you?\"</p><p>\"Yes.\" And then Delilah was there, grinning, pushing Zane aside to hug her tightly. \"I've been so worried about you.\"</p><p>Nola glanced at Zane and he gave her a nod of encouragement. Biting her lip, Nola hugged her back.</p><p>\"I thought I was going to have to burst into that tent and give Zane a stern talking to,\" Delilah said, pulling back and grinning. \"But the moans were of pleasure rather than rebuke, so Layel was able to hold me back.\"</p><p>Nola's cheeks heated.</p><p>So did Zane's, she noticed. And for some reason, that eased her own embarrassment.</p><p>Layel slapped him on the back. Zane stiffened for a moment, then relaxed against Nola. \"Good man,\" the king said with a laugh. \"Doing our people proud.\"</p><p>\"Well, shall we go home?\" Delilah asked. She rubbed her belly, which Nola suddenly realized was not quite as flat as she remembered. \"As protector of this little hellion, I am not the soldier I once was and prefer the comfort of my own bed.\"</p><p>A baby. Nola again glanced at Zane. He offered a soft smile - one that promised they, too, would one day experience such a joy. \"Congratulations, Delilah. I am so happy for you.\"</p><p>Delilah beamed. \"Thank you.\"</p><p>The warrioress and her husband shared a tender smile before Layel escorted her a few feet away, to where the horses were chewing on grass. \"Zane? Will you be joining us?\"</p><p>\"We will try,\" he said, but didn't explain further.</p><p>Whether the king understood or not, he merely nodded. \"Back to the palace, men,\" he called.</p><p>Zane helped Nola atop his horse, then swooped up behind her. Nervousness skidded through her when they started forward. First Layel and Delilah disappeared beyond the trees, then the vampire troops. Soon their turn would come...soon she would know if she was still bound to the camp.</p><p>\"Zane,\" she said, unable to keep the tremor from her voice.</p><p>He didn't say a word, just urged the horse into a quicker pace. And then they were past the trees, just like everyone else. They were in the forest, heading away from their captivity.</p><p>\"We did it! We're free!\"</p><p>\"As I knew we would be.\" He kissed the top of her head. \"The gods are not the cruel monsters I imagined. How can they be, when they paired us together?\"</p><p>Thank you, she mouthed to the top of the dome. Not once did she look back. There was too much to look forward to. \"I love you, Zane.\"</p><p>\"And I love you. It will be my pleasure to prove it to you, over and over again.\"</p><p>\"Even when mating season ends?\" she teased.</p><p>He squeezed her tight. \"I have a feeling our mating season will last for eternity, sweet.\" </p> </body></html>"]