["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>“Get your goddamn hands off my wife.”</p><p>Quinn McKay was in a rage. A red rage. An aneurysm-inducing rage. A going-postal rage.</p><p>And the worst part? His wife, his helpmate, his lover, his partner, his...everything—goddammit, Libby was his everything—didn’t give two shits about his foul mood.</p> <p>Not. Two. Hot. Shits.</p><p>Which enraged him further.</p><p>“Walk it off, Quinn,” Libby McKay tossed over her shoulder, letting the young buck lead her deeper into the crowd on the dance floor. The last thing Quinn saw was the sassy head shake of her sassy new hairdo.</p><p>“I’m gonna fuckin’ kill him. See how goddamn happy his hands are after I break ’em off at the wrists.”</p><p>“Jesus, Q, will you sit the hell down? People are starin’ at you.”</p> <p>“Let ’em look.”</p><p>His brother Ben hissed, “Screw that. Get your dumb ass back to the table or I’m leavin’ and you can hoof it home.”</p><p>“Be worth it to punch that sonuvabitch in the face.”</p><p>“I ain’t bailin’ you outta jail neither.”</p><p>Quinn scowled, reluctantly following Ben back to the booth. He drained his cup of beer and poured another from the pitcher. Mostly foam. Didn’t it just figure even the beer wasn’t cooperating with him tonight?</p><p>“You gotta stop doin’ this, man.”</p> <p>“Doin’ what? Drinkin’?”</p><p>“No.”</p><p>“Oh, you mean quit comin’ to Ziggy’s to watch my wife dance with every good-for-nuthin’ loser in this place?”</p><p>“Bingo.”</p><p>“Fuck that.” Quinn slammed his empty cup down. “It’s a free country. I live in this goddamned county. I got just as much right to be here as she does.”</p><p>Ben jerked the pitcher away before Quinn dispensed a refill. “It’s been three months since you and Libby separated, Q. Face it. Maybe it’s time you moved on. Looks like she has.”</p><p>“Wrong. If Libby is so all fired up to ‘move on’ then why the hell hasn’t she hired a lawyer and filed for divorce?”</p><p>“Probably waitin’ ’til school gets out and she has more time.”</p> <p>His answer resembled a growl.</p><p>“I don’t know why you’re so surprised.” Ben poured himself a cup of foam. “You guys’ve been headed down this road for a while.”</p><p>“The hell we have.”</p><p>“You tellin’ me you were just rollin’ along, mindin’ your own business and wham! Her demand of ‘I want a trial separation’ came from left field?”</p><p>Quinn hated— hated—talking about this kind of touchy feely crap with anyone. “All married couples hit rough patches. I thought it’d blow over. It always has before.”</p><p>“Before?” Ben choked on his beer. “This ain’t the first time?”</p><p>“It’s the first time she’s kicked me outta my own damn house.” Three fucking months he’d been living in tin, eating out of tin and sleeping alone in absolute misery.</p><p>“So you been goin’ to counseling and shit?”</p><p>“Nope.”</p><p>“Why not? Did she ask you to?”</p><p>Sort of. Quinn knew he and Ben weren’t talking about the same type of professional help Libby had suggested. He hedged. “Yeah.”</p><p>“What’d ya say?”</p><p>“No.”</p><p>“Jesus. You are one stubborn sonuvabitch. I can see why Libby is tired of it and booted your ass.”</p><p>Stubborn sonuvabitch. A familiar phrase. His normally sweet-tongued wife had hurled those words at him as she’d hurled a suitcase full of his dirty clothes on the front porch. “Fuckin’ great. I’m glad you’re takin’ her side, bro.”</p><p>“Quinn, man, no offense, but you suck as a husband.”</p><p>Embarrassment flared. Libby’d said that much too. “How the hell do you know? You’ve been married what, zero times?”</p><p>“Don’t mean I can’t see when something ain’t workin’,” Ben countered. “Obviously your marriage ain’t doin’ so hot. I’d be more’n happy to offer you red-hot tips to fire it back up.”</p><p>“Tips from the guy whose last relationship barely passed the one month mark? This oughta be interestin’.”</p><p>“No skin off my nose if you’re too proud to accept help. But even as a single guy, I’m aware bein’ a good husband is more than bein’ a good provider.”</p><p>Yep. Quinn’s spouse had also tossed that phrase at him. But the irony was that street ran both ways.</p><p>Libby ought to realize there was more to being a good wife than having supper on the table, maintaining a spotless house, and cramming his dresser drawers with clean clothes. Not that he’d say that to her, knowing how much it’d hurt her feelings. Why hadn’t Libby realized how deeply it’d cut him when she’d carelessly flung those same words in his face? He sighed. “Go ahead, Ben, wow me with your golden marriage tips.”</p><p>“First of all, you have to stop takin’ Libby for granted.”</p><p>“I’ve never taken her for granted. Never.”</p><p>“Fine then. You gotta show her how much she matters to you. You gotta...woo her.”</p><p>“Woo her?” Baffled, Quinn stared at his brother. “How the hell am I supposed to do that?”</p><p>“Act like you did when you were dating. Bring her flowers, wine and dine her with candlelit dinners, take her to the movies. Spend time just makin’ out and tryin’ to cop a feel in the truck.”</p><p>Quinn leaned forward. “I’m reminding you I’ve been with Libby for fourteen years. We started dating when we were sixteen. I married her the month after she graduated from college. We’ve been man and wife for nine years. So I’m a little rusty on my wooin’ skills.”</p><p>“Then it’s past time to brush up on ’em, Q. Because if you don’t use ’em on her, you’re gonna need to use ’em on someone else.”</p><p>Shame burned and he dropped his gaze to the table. “Then I’m doomed. I never done any of that romantic crap with her.” Or any other woman. Libby was the first girl he’d dated. The first and only woman he’d had sex with. The only woman he’d ever wanted. The only woman he’d ever loved.</p><p>And I’m about to lose her.</p><p>“Never?” Ben prompted.</p><p>Quinn shook his head. “Libby’s always been practical. That’s one of the reasons I fell for her. She didn’t need any of the superficial junk other girls did. She didn’t expect me to be a rodeo star or go to trade school. She knew I’d never leave here because ranchin’ is in my blood. She was fine with that. She wanted that life...or so I thought.”</p><p>Things—no, Libby had changed in the last year. It had started out with small modifications. New furniture, repainting a room or two, hanging new draperies, trying out new recipes from faraway places.</p><p>Then she’d started dropping hints about them doing “couple” activities.</p><p>When Libby had returned to her job as the school librarian after summer hiatus, she went on a diet and lost twenty-five pounds. He’d always loved her curvy body, but she seemed happier thinner. She’d tossed out her old duds and bought new ones. Gone were the long denim skirts, loose shirts, bulky sweaters, baggy sweats and oversized T-shirts she’d worn for years. Ditto for neutral colors.</p><p>No, Libby—his Libby—began wearing tight, low-cut jeans. Clingy blouses that accentuated her ample chest. Short skirts in vivid colors. Just as he was wrapping his head around those changes, she’d trotted off to Denver for a professional makeover. She’d chopped her long, honey-brown hair into a short, trendy cut and added blondish-red highlights. She’d never worn much makeup, so it’d shocked Quinn to see her freckles covered, her lips glossy red and black eyeliner emphasizing her blue eyes.</p><p>At that point he’d begun to worry, wondering if she’d met a man she was trying to impress.</p><p>When Libby asked him how he liked the “new” her, Quinn replied honestly: He’d liked the old her just fine.</p><p>A day later he was living in the horse trailer.</p><p>“Dammit. You aren’t even listenin’ to me, are you?” Ben demanded.</p><p>Quinn ignored the taunt and focused on Libby sashaying off the dance floor. The smile she allotted her dance partner didn’t reach her eyes like it did whenever she danced with him. Her shoulders were bunched up to her ears. Her normally graceful body movements were forced. Unnatural. She looked as if she were merely going through the motions.</p><p>Just like him.</p><p>The truth hit Quinn as viciously as a horse hoof to the head. He’d gone about dealing with this misstep in their marriage the wrong way, expecting Libby to come to him. He had to fix it, to man up, take the bull by the horns, grab the tiger by the tail, climb on the horse that threw him, reclaim what was rightfully his. Clichéd phrases, but truisms to lead him in the right direction—the only direction—straight back to her.</p><p>“Quinn? You okay?”</p><p>“Nah. I ain’t been right since she kicked me out, Ben. Dammit. I miss her something fierce.”</p><p>Ben froze. “Ah shit, Q, you ain’t gonna start with that, I love you man, kinda drunk talk, are you?”</p><p>“Hell no.” Quinn shoved the pitcher aside and propped his elbows on the table. “But I have been listenin’ to you yammer on, and you’re exactly right. I’ve gotta do something. And you’re gonna help me.”</p><p>“Help you do what?”</p><p>“Help me come up with a plan to win my wife back.”</p><p>Chapter Two</p><p>“Second shelf on the bottom row.”</p><p>The seven-year-old girl shook her head, bouncing her blonde corkscrew pigtails. “Huh-uh. I looked.”</p><p>“Look again.”</p><p>“But you’re the librarian. You always help me.”</p><p>“This time is different, sweetie, because your teacher wants you to find the book. It’ll improve your alphabetizing skills.” Libby resisted her impulse to smooth the girl’s puckered brow. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I wish you were my teacher, Mrs. McKay,” she announced before flouncing away.</p><p>I wish I had a little girl just like you.</p><p>Libby briefly squeezed her eyes shut. Don’t go there. She had enough issues and failures to deal with, thank you very much, starting with the demise of her marriage to Quinn McKay.</p> <p>Damn stubborn man. What would spur him into action? To get across this wasn’t a game? This was their life hanging in the balance.</p><p>Quinn hadn’t balked at her demand of a trial separation. He’d taken it in stride and blithely continued his day-to-day life on the ranch, content to hole up in the horse trailer until she “came to her senses”.</p><p>Three months had gone by and they were at an impasse.</p><p>It didn’t help Libby hadn’t spoken directly to her husband in that time frame. Her involvement with their ranching operation made their lack of daily communication a real dilemma. Being the efficient sort, she’d created a schedule for ranch business and bill paying, and for personal issues, such as when Quinn could use the shower and the washer and dryer in the house.</p><p>The system worked, but it forced them to leave each other notes. His were terse and to the point. Hers were polite and filled with detailed explanations. Which pretty much summed up their marriage in the last year or so.</p> <p>But Libby still loved Quinn. She missed him like crazy. Yet after last night, she questioned whether love was enough. Why wouldn’t he fight for her? For them? Why was it solely up to her to enact the changes they both so desperately needed?</p><p>If you’re so eager for change, why haven’t you signed the legal complaint paperwork the attorney gave you that’s been in your desk for a month?</p><p>Good question.</p><p>But at least she’d made an effort to test her wings and gauge if walking away from him for good was a possibility. Bored and lonely, Libby had started hanging out with her single female coworkers at Ziggy’s, a bar which catered to a younger crowd than the other honky-tonks in the area. Getting hit on by eager, hot cowboys did wonders for her self-esteem, even when she’d only flirted, danced and accepted the occasional free drink.</p><p>Then Quinn began showing up. He’d hunker down in a booth, drinking beer, sometimes alone, sometimes with his brother. Quinn never approached her. He just watched her.</p><p>Until last night.</p> <p>Quinn’s clipped, “Get your goddamn hands off my wife,” had instilled a tiny seed of hope. Libby secretly wished for Quinn the Barbarian to hoist her over his shoulder and cart her out of the bar. She fantasized her he-man would be in such a lust-filled state to have her, he’d fuck her against his dirty pickup, not caring who might see him staking his claim.</p><p>Afterward, he’d race them home and make mad, passionate love to her for days on end. In their bed.</p><p>On the kitchen table. In the shower. Up against the corral. All the while confessing his undying love for her. Profess he’d been a fool. He’d do anything to keep her and guarantee her happiness for the rest of their lives.</p><p>That hadn’t happened. Libby had to face reality—it probably never would. Last night Quinn had simply muttered and walked away. Given up. Dashing her idiotic, girlish romantic dreams of reconciliation.</p><p>Tears fell as she reached for the file folder in the back of the drawer. She pulled out the sheaf of legal papers titled Complaint. Libby scrawled her name on the bottom line, dated it and crammed the whole works in a manila envelope.</p><p>The rest of Mrs. Rich’s rambunctious second-grade class barreled into the library. Libby hastily set the envelope on her desk and put the whole thing out of her mind.</p><p>A sage-scented breeze stirred Libby’s hair as she exited the school hours later. Exhausted, she juggled a bag of books and her car keys, so she didn’t notice the man leaning against her car until the tips of his boots were within view.</p><p>Libby raised her chin. Her heart whomped when her gaze caught familiar blue eyes.</p> <p>Quinn.</p><p>Even after fourteen years together, just seeing him set her pulse racing. Quinn was the stereotypical Wyoming rancher, more rugged looking than classically handsome. He’d maintained the same stocky build as in his younger years, although it appeared he’d dropped weight since being forced to cook his own meals. But it looked good on him. Everything looked good on him.</p><p>His face was smoothly shaven. The fresh scent of his aftershave, mixed with the aroma of his sun-warmed skin, drifted toward her, swamping her with longing.</p><p>Damn him.</p><p>To top it off, Quinn had worn her favorite shirt, the one she’d bought him for Christmas, navy blue with pearl-snap buttons and white stitching around the pocket flaps. The cut of the material showcased his wide shoulders and broad chest. The sleeves hugged his muscled biceps, every bulge earned the hard way from manual labor required to run a ranch. The dark fabric emphasized his coloring, his blackish-brown hair, the long, thick, sooty lashes surrounding his mesmerizing blue eyes.</p><p>Those intense eyes locked onto hers. Quinn gave her the unsure smile she hadn’t seen in ages. Her heart thumped harder.</p><p>“Hey, Libby. You, ah, look good. Real good.”</p><p>“Thanks. What’re you doing here?” A panicked thought crossed her mind. “Did someone die?”</p><p>“No.” He paused. Frowned. Seemed highly flustered. “It’s sorta sad you’d think that’s what it’d take to get me to come around.”</p><p>Libby shrugged. “You haven’t come around.”</p><p>“True enough. But last time I checked, the roads run both ways, darlin’ wife.”</p><p>She notched her chin higher. “What do you want?”</p><p>“You.”</p><p>Her stomach did a swoopy roll. “Excuse me?”</p><p>He kept leaning against the driver’s side door, hands jammed into the pockets of a new pair of dark blue Wrangler jeans, his going-to-town boots crossed at the ankles. “I’m here ’cause I’m waitin’ for you.”</p><p>“Why?”</p><p>For a second, his shoulders tensed. Then he pushed away from the car and ambled toward her.</p><p>“Because I don’t like you dancin’ with other men.”</p><p>Taunting him usually had no effect. No matter how pissed off he might be, Quinn McKay never caused a scene. Never acted improper or impulsive in public, which was why his outburst in the bar last night had thoroughly confused her. Hell, he rarely acted improper or impulsive in private. So, she couldn’t help the flip, “Oh. Is that all?” to see if she could goad him into another heated reaction.</p><p>“No, that ain’t all. I’m also here to remind you that you’re my wife and I don’t share what’s mine.”</p><p>A chill skittered through her at his possessive tone. “I didn’t think you cared.”</p><p>“You thought wrong. Now dump your stuff in the back of the truck and get in. We’re goin’ home.”</p><p>Libby’s jaw dropped. The book bag hit the dirt. Her temper skyrocketed and her voice escalated. “Just like that? You think after three months of ignoring me and our problems that you can just show up and... command me? I’ve got news for you buddy, not happening. Too little, too late.”</p><p>A heavy pause lingered. She expected him to remind her to lower her voice. She didn’t expect him to lower his head until her face was shadowed beneath the brim of his ever-present cowboy hat.</p><p>“Wrong answer. Better late than never is my new creed.” Quinn peered into her eyes so closely she felt his breath fanning her lips. “I agreed to give you the space you demanded, Libby. Now I can see that was a fool-headed mistake on my part. So you’re gonna rectify it.”</p><p>“Me? How?”</p><p>“By givin’ me the second chance I deserve.” Quinn lifted his hand to her face. It shocked her to see that strong, capable hand trembling. He dragged the back of his rough-skinned knuckles down her cheek.</p><p>“Please.”</p><p>Oh God. When was the last time Quinn said that simple word to her? And meant it?</p><p>Libby stared at him, puzzled, yet unable to squash that last bit of hope. Was she seeing new determination in the eyes of the man she’d loved most of her life? A man she swore she knew straight to the bone?</p><p>“Libby?”</p><p>The soft, gruff way he’d spoken her name as a question, not a demand, tore at her resistance. “What?”</p><p>“Spend the weekend with me. Just you and me.”</p><p>“And what happens come Monday morning?”</p><p>“We’ll take it one day at a time and see how it goes from there.”</p><p>“If I agree to the weekend, you’ll give me time to think it over next week? No matter what happens?”</p><p>“Yep. I promise. No pressure.”</p><p>Perfect. She’d be in Cheyenne at the state librarian’s conference next week. It’d allow her physical and emotional distance from him, and time to put it all in perspective, no matter how the weekend turned out.</p><p>You’ve got nothing to lose. This is the chance you never thought you’d have.</p><p>“Please. Come home. I, ah, managed to fix supper.” A sheepish smile was there and gone again.</p><p>“Nuthin’ fancy, just fried potatoes and sausage. But I sure would like to share a meal with you tonight.”</p><p>Libby kept her gaze steady and retorted, “Just as long as you understand that sharing a meal doesn’t mean we’ll be sharing a bed, Quinn McKay.”</p><p>Quinn’s hand dropped and he stepped back. “I wasn’t tryin’ to... I never thought...” He smiled with deliberate slowness. “Hell, Libby, if I woulda wanted to be in our bed again, I woulda said so up front. You probably don’t believe me, ’cause you seem to think the worst of me these days, but I didn’t fix a quick supper in exchange for a quickie.”</p><p>Heat climbed up her neck, setting her face aflame. She’d jumped to the wrong conclusion. Again. Not that Quinn pointed out her faults and failings like she’d freely done with his.</p><p>In his understated, gentle way, he said, “I’ll see you back at the house.” He hopped in his mud-covered truck and roared away.</p><p>Quinn had set the kitchen table with their wedding china before he’d left for town. He snagged a beer from the fridge, but hesitated before popping the top. Would Libby attribute his openness and willingness to talk to alcohol? Probably. He slid the Budweiser back on the top shelf. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Dishes washed, counters cleaned, he had nothing to do but wait. He’d gotten used to his own company in the evenings in recent months. Didn’t mean he liked it.</p><p>After turning the burner to simmer, Quinn snuck upstairs and stood in the doorway to their bedroom.</p><p>The same faded wedding ring quilt adorned the brass bed. The usual explosion of pillows were piled at the head and the extra wool blanket dangled off the foot.</p> <p>The room smelled the same, Libby’s cherry-almond hand lotion and a hint of wood from the cedar-lined closet. If Quinn peeled back the bedcovers, he’d catch a whiff of Libby’s apple shampoo and the underlying musky-sweet fragrance of just Libby.</p><p>He stared mindlessly, trying to remember the last time he and Libby had made love in that bed. In the months prior to their separation, they may as well have been sleeping in separate rooms.</p><p>A memory came to him, leaving him as breathless and embarrassed as he’d been at the time. Missing his wife, feeling adrift and lonely, Quinn had mustered the guts to cross the invisible line running down the center of the mattress, only to have Libby literally give him the cold shoulder. Tired of being rejected, he hadn’t bothered trying to touch her at all, in bed or out, for the next six months.</p><p>Initially, he’d blamed their lack of intimacy on a multitude of things, exhaustion, familiarity and laziness. It’d seemed weird to experiment with crazy new sexual positions when the old standbys worked so well. They both got off and wasn’t that the point of sex? Besides, the red-hot-have-to-have-you-now passion had cooled into something more comfortable over the years. Which wasn’t all bad until that comfort factor had turned into a sexual snooze-fest.</p><p>But Quinn refused to take all the blame for their fizzling—rather than sizzling—sex life. Heaven knew Libby rarely initiated lovemaking, but left the seducing up to him. Sure, once he’d stoked her fires she was a generous and enthusiastic lover, not particularly adventurous, but then again, he wasn’t exactly the hanging-from-the-chandelier wild sex type either.</p> <p>If he were completely honest, things had fallen apart on the sexual front when they’d decided to try for a baby. At first it’d been fun, the carefree let’s-have-sex-all-the-time romps. But three years after Libby had stopped taking the pill, she still wasn’t pregnant.</p><p>So his practical, organized wife had drawn elaborate fertility charts. Detailed lists of when they could—and couldn’t—make love. First, she’d tossed his tighty whities and bought boxer shorts to keep his balls from getting overheated and inadvertently lowering his sperm count. Then, she’d purchased bottles of vitamins and cheerfully watched as he swallowed every blasted horse-sized pill. When that had no effect, she’d modified their diet and limited their alcohol intake. Finally, she’d insisted on sex in the missionary position only. After he ejaculated, she’d prop her hips under three pillows and stay in that pose for at least half an hour...while he wandered off to watch TV. Alone.</p><p>Eventually, sex had become just another one of his daily chores. Charts, cycles, basal temperatures, books and articles on conceiving a baby were the topics of discussion—but only at home. When another two years had passed and she hadn’t filled the heirloom bassinet with a bundle of joy, Libby had suggested they schedule an appointment with a specialist dealing with infertility.</p><p>Quinn had flat-out refused. First, because they weren’t that old. Making a baby could still happen the old-fashioned way, given time. Libby was just impatient. True, part of his refusal was masculine pride—no man wants to hear he’s got problems with his Johnson. The other part of his refusal was personal. It seemed his relationship with his wife was no longer based on love, but on his capability, or incapability, as a breeder.</p><p>Quinn had told Libby he was perfectly content to spend his life with her, just her, and he wasn’t basing his present or future happiness on whether the stick turned pink or blue every month.</p><p>That’s when things had gone downhill.</p> <p>So Quinn had lied to Ben when he claimed he hadn’t seen the separation coming. He just hadn’t known how to handle it, so he’d done nothing to prevent it. He’d been floating along, hoping like hell Libby would come around.</p><p>She hadn’t. In fact, she hadn’t been around at all.</p><p>Too little, too late.</p><p>Like hell. He might’ve been slow on the uptake, but he was good at playing catch-up. Damn good.</p><p>The sound of Libby’s car crunching on the driveway brought Quinn out of his reverie and he headed downstairs.</p><p>Her arms were overloaded with bags and Quinn rushed forward. “Lemme help you.”</p><p>“Thanks.”</p><p>“Where you want me to put them?”</p> <p>“Dining room table is fine.”</p><p>Libby arranged her belongings to her liking before she looked at him.</p><p>God, she was pretty. Old hairstyle or new haircut, barefaced or all made up, it didn’t matter. One glimpse into her eyes was all he needed to see the real Libby. His Libby.</p><p>She bristled. “What?”</p><p>“Can’t a man admire his wife?” Quinn let his gaze roam over her sweet face and linger on her lips.</p><p>“I thought we were gonna eat.”</p><p>Staring at her made her nervous. Interesting.</p><p>“We are. Go on in and have a seat. I’ll dish up.”</p><p>“This is odd, you waiting on me,” she said.</p><p>“No more odd than you lettin’ me do it.”</p><p>That retort brought forth the cute wrinkle on her forehead and no additional comment.</p><p>Good.</p><p>Soon as Quinn sat across from Libby, she frowned and started to get up. Quickly, but gently, Quinn placed his hand on her forearm. “What do you need? I’ll get it.”</p><p>“A napkin.”</p><p>He reached behind him for the wicker container and kept hold of her arm. “Here.”</p><p>“Thank you.”</p><p>“No problem. So what’s been happenin’ in the world of books?”</p><p>Libby clutched her fork. “You really interested or are you just making conversation?”</p><p>“I’m interested, Lib, I’ve always cared about what you do at the school.”</p><p>Satisfied with his answer, she said, “I’m gearing up for the summer reading program.”</p><p>“Betcha already got quite a few kids signed up for that.”</p><p>“Yes, actually I do. How’d you know?”</p><p>Quinn gave her a noncommittal shoulder hitch. “Because you’re you. You never do anything half-assed.”</p><p>“My, my, aren’t you full of compliments tonight?”</p><p>“I reckon I owe you more than three months’ worth so I’d better start makin’ up for lost time.” He swept his thumb over the smooth skin on the back of her wrist. “That okay with you, darlin’ wife?”</p><p>She squirmed at his term of endearment but didn’t try and shake off his hand, much to his surprise.</p><p>“I’m not used to you acting this way.”</p><p>“Maybe you oughta get used to it. Maybe I’ve realized the error of my ways and I’m a changed man.”</p><p>“Is that why you behaved like that last night at Ziggy’s?”</p><p>“Like what?”</p><p>“You know how you behaved.”</p><p>Quinn chewed slowly and swallowed. “You lookin’ for an apology?”</p><p>“Maybe.”</p><p>“Okay. I’m sorry that sonuvabitch who had his paws all over you didn’t spend all goddamn night pickin’ his teeth up off the floor after I knocked ’em clean outta his mouth.”</p><p>Libby stammered, “B-but, you didn’t do anything! You just left.”</p><p>“Huh-uh. Ben said he wouldn’t post bond if I beat the snot outta that snot-nosed punk. With you and me on the outs, I figured I couldn’t count on you for bail money either, so I let Ben drag me away, against my will, I might add.”</p><p>“So you’re not apologizing?”</p><p>Quinn flashed his teeth. “For actin’ like a man and for protecting what’s mine? Hell no.” He leaned closer. “Does that shock you?”</p><p>“A little. Lord, Quinn, that was completely out of character for you, cussing, threatening a guy and causing a public scene.”</p><p>He shrugged. “That’s because I keep that side of myself to myself.”</p><p>“Why?”</p><p>Should he answer? Could he?</p><p>Yes. No more hiding. Balls to the wall.</p><p>“Quinn?”</p><p>“Because it’d scare you worse than it does me.”</p><p>“I’m not exactly a delicate flower,” she retorted. “And I’ve known you all my life.”</p><p>“Yeah? Then did ya think I’d go with my original impulse of draggin’ you back home by the hair and provin’ to you just who has the right to put his hands all over you?”</p><p>Libby’s amazing blue eyes widened, not with reproach but with...interest.</p><p>Goddamn if his cock didn’t take notice.</p><p>Quinn grinned at her. “Eat your supper ’fore it gets cold.”</p><p>They managed normal conversation for the remainder of the meal. Afterward, they even washed the dishes together, something they hadn’t done since the first year they were married. Over coffee and cake, Quinn said, “I have plans for us for tomorrow afternoon.”</p><p>“Plans to do what?”</p><p>“It’s a surprise.” He sipped the last of his coffee and added, “A romantic surprise.”</p><p>Quinn read the emotions warring on Libby’s face. The need to question him further. The disbelief of his casual use of the word “romantic”. But mostly he saw a response that’d been a long time coming—</p><p>hopeful curiosity.</p><p>“What time?”</p><p>Thank you, Jesus. “I’ll come get ya at twelve-thirty. It starts at one o’clock. We can ride together.”</p><p>“You aren’t telling me where you’re taking me, are you?”</p><p>“Nope.”</p><p>Libby smiled. “You know it’s gonna drive me crazy.”</p><p>“Yep.”</p><p>“Why are you doing this?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What? Drivin’ you crazy?”</p><p>“No. Acting so unlike you.”</p><p>“Because, you don’t believe I can change, so it’s up to me to convince you otherwise.”</p> <p>Her smile dimmed. “But what if it doesn’t change anything?”</p><p>“What if it does?” he countered.</p><p>Silence.</p><p>Might as well get it all out in the open. “It hasn’t always been like this between us. We were good together, weren’t we?”</p><p>“Quinn—”</p> <p>“Has every year of our marriage been pure hell for you, Libby?”</p><p>“God. No. Not even close.” Libby started to say something else but snapped her mouth shut, choosing instead to fiddle with the lace edging on the placemat.</p><p>“Good to know.” Quinn stood. He ached to stay, but he’d left her enough to mull over for one night.</p><p>On the porch, he paused to absorb the beauty of the place they called home. Dusk had fallen, turning the sky purple-gray and dusting the tree line in the distance with fluffy pink clouds. A brisk breeze rattled the bird feeders. The dark, ripe scent of wet earth filled his lungs. It seemed as if he’d taken his first real breath in months.</p><p>The heat of Libby’s body behind his made him turn around very slowly, even when his heart raced like a snared rabbit’s. With forced casualness, Quinn said, “Oh, one other thing.”</p><p>“What?”</p> <p>“This.” Quinn cupped her face in his hands. He pressed his mouth down, allowing his lips to reacquaint themselves with the softness and shape of hers beneath his. One smooth brush of his lips morphed into a dozen drugging kisses. At the insistent glide of his mouth, teasing nips of his teeth, tiny flicks of his tongue, Libby’s lips parted on a soft sigh.</p><p>His tongue slipped inside and her flavor burst in his mouth, sweet coffee, sweet Libby and sweet temptation. It’d been an eternity since he’d kissed his wife this way, a slow seduction. A promise. A renewal of intent.</p><p>Quinn tilted her head, kicking the kiss from lazy exploration to undeniable hunger. For her. Only ever for her. A wet, wild reunion of dueling tongues, stuttered breaths and the powerful slide into passion they’d either forgotten or had denied themselves.</p><p>Despite the heat and the sense of yearning, he kept their bodies apart, because what was blossoming between them again was too important to rush.</p><p>Tonight. Tomorrow all bets were off.</p><p>He forced himself to break the kiss. His hands fell away and he buried his nose in her apple-scented hair. “I miss talkin’ to you. Touchin’ you.” He kissed the start of her jawline beneath her ear. “I miss the way you smell. The way you taste. The way you feel. Goddamn, I miss the everything of you, Libby.”</p><p>“Quinn, I...”</p><p>His body was primed for action and it took every bit of willpower to step back from her. “I ain’t gonna apologize.”</p> <p>“I don’t want you to.”</p><p>Damn, if that admission didn’t cause his cock to jerk with hope. Especially when he saw her gaze drop to the bulge beneath his zipper.</p><p>Double damn. Definitely time to go. “Good night, Libby. Sweet dreams.” He smiled cagily and melted into the shadows.</p><p>Chapter Three</p><p>“You have no idea where he’s taking you?”</p><p>“None.” Libby peeked out the kitchen window, feeling silly for watching for Quinn’s truck to barrel up the drive. She hadn’t done that for years.</p><p>“And you just agreed?”</p><p>“Yep.”</p><p>Jillian sighed. “Sis, no offense, but the last time Quinn surprised you, he brought you home a new crock pot.”</p><p>Libby stuck her tongue out at the receiver. She loved that damn crock pot. Jilly didn’t understand it’d been an incredibly sweet gesture on Quinn’s part because he so rarely acted spontaneously. “He’s trying, Jilly.”</p><p>“Well, it’s about damn time.”</p><p>Usually Jillian’s constant yakking was impossible to ignore, but today, Libby easily tuned her out.</p><p>She had more important things to tune into. Like the steamy kiss that’d knocked her sideways last night.</p><p>Man. She’d forgotten Quinn could kiss like that. She’d forgotten she could kiss like that. She’d definitely forgotten how arousing a simple kiss could be, as evidenced by the soaking wet condition of her panties when she’d stumbled back into the house on wobbly knees.</p><p>And Libby couldn’t help but notice Quinn’s erection. Kissing her had the same effect on him—a good sign—since the man hadn’t touched her for three months prior to their separation.</p><p>Six long months without physical intimacy. Half a year without her husband paying attention to her at all.</p><p>To cope with his apathy, she’d tried a few changes around the house, dropped some weight, updated her hairstyle, makeup and wardrobe. A confidence-boosting bonus she’d hoped would increase her physical attraction to her mate. But when she’d marshaled the courage to ask Quinn how he liked the “new” her, he’d responded he’d liked the old her just fine.</p><p>Quinn probably hadn’t meant his remark in an unflattering way, but it’d stung nevertheless. In response, she’d lashed back at him like she’d never done, said hurtful things and then kicked him out.</p><p>And speak of the devil; the man was kicking up a cloud of dust as he zipped up the gravel driveway.</p><p>“Can I offer you some advice—”</p><p>She cut Jillian off mid-sentence. “Quinn is here.”</p><p>“Libby, will you listen to me before you hang up?”</p><p>No. But Jillian would blather on anyway. “What?”</p><p>“Avoid talking about the baby issue. If you really want your relationship with Quinn to have a fair shot, it needs to only be about your relationship as man and wife.”</p><p>“Meaning?”</p><p>“Don’t bring up his refusal to take fertility tests or the years you’ve spent trying to get pregnant to the exclusion of everything else.”</p><p>“That’s unfair, Jilly. You make it sound like that’s all I’ve cared about.”</p><p>“It’s certainly been all you’ve talked about for the last several years,” Jilly gently chided. “I know I’m the only person you’ve trusted with your frustration about your inability to conceive, so my view might be skewed.”</p><p>Libby opened her mouth to argue, but a teeny germ of guilt sprouted. Only in the last twelve months she hadn’t been obsessing about babies because she’d been obsessing about what’d gone wrong between her and her husband. She’d figured by letting the big issue drop, they’d be able to focus on the smaller ones.</p><p>That hadn’t happened either.</p><p>She let her disquiet build as she watched Quinn hurry into the horse trailer.</p><p>“Libs? You there?”</p><p>“Yeah. Sorry. I’m still here.” Pause. “Was I really that bad?”</p><p>“It’ll be hard for you to hear, but yeah, you were. Sometimes I understand why Quinn didn’t protest too much about the separation. It’s been a rough couple years on both of you.”</p><p>Her stomach lurched. If she’d been so blatantly single-minded why hadn’t Quinn said anything to her?</p><p>Because his unwillingness to talk about anything was the reason you asked for the separation.</p><p>But Quinn hadn’t always been like that.</p><p>Maybe he’s grown tired of discussing the same old things and silence was his only defense.</p><p>“I didn’t say that to hurt you, Libs.”</p><p>“I don’t understand why you didn’t mention it before now.”</p><p>“Because it wasn’t my place, honey. It was Quinn’s. And we both know he wouldn’t say shit if he had a mouthful.”</p><p>Libby fought the urge to curl into a ball and weep. “Lord. How did everything get so screwed up?”</p><p>“I don’t know. Good luck.” Jillian hung up.</p><p>Quinn exited the horse trailer and Libby caught her first glimpse of his clothes. Gray sweatpants. A faded brown and gold University of Wyoming Go Pokes! T-shirt, tennis shoes and a “gimme” ball cap from the local Yamaha dealership.</p><p>Whoa. Quinn never dressed casually, especially if he planned on being seen in public. Some kind of proper public cowboy attire had been hardwired into the man’s DNA. Did that mean he’d planned a private outing?</p><p>He bounded up the steps like an eager pup and barged right in. “Heya, Libby. You look great.</p><p>Ready?”</p><p>A compliment right off the bat? The man really was trying. “Yeah. Just let me grab my purse.”</p><p>Familiar warmth spread inside and outside her body from his hand caressing the small of her back as he followed her down the porch steps.</p><p>“Where are we going?”</p><p>Quinn smiled and opened the truck door. “You’ll find out soon enough.”</p><p>Inside the pickup, he patted the bench seat. “Scoot over. I wanna relive those times when we were first dating and you practically sat on my lap.”</p><p>Touched by his request, she slid next to him until they were matched thigh-to-thigh. “Is this a date?”</p><p>“As much as a man can be on a date with his wife of nine years.”</p><p>Libby turned. His face was mere inches away.</p><p>“Bein’s you are my wife, I’m entitled to steal a kiss.” Quinn angled his head and gently brushed his lips over hers one time. Then he straightened up and started the truck.</p><p>“That’s it?” burst out before she could stop it.</p><p>“You were expectin’ something else?”</p><p>“I was hoping for a kiss like the one from last night.”</p><p>“Libby, darlin’, you can kiss me like that anytime you want. Any. Damn. Time. At all. And it don’t gotta stop at kissin’.”</p><p>Just like that, Quinn had gotten his point across in his usual low-key manner. She bumped him with her shoulder. “Maybe I will.”</p><p>“I’ll look forward to it.” He kept his hand on her thigh during the drive to Sundance.</p><p>Quinn parked in front of the Sandstone Building. It housed three separate businesses, all run by women who’d married into the McKay family. Macie McKay ran Dewey’s Delish Dish, Skylar McKay owned Sky Blue, and her sister, India, owned the tattoo shop, India’s Ink, which were housed together in the same space, while AJ McKay operated Healing Touch Massage. It was too late to eat lunch so Libby couldn’t fathom why they were here. A panicked thought struck her. “Are we getting a tattoo?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He laughed. “You oughta see your look of horror.”</p><p>She noticed he hadn’t answered her question. “Are we?”</p><p>“No.” Quinn offered a wicked smile. “Unless you’ve got a hankerin’ to tattoo my initials on your sweet little ass?”</p> <p>“Quinn!”</p><p>“What? It is a sweet little ass.”</p><p>Married nine years and the man could still make her blush. “That’s not what I meant.”</p><p>He stroked the back of his knuckles down her heated cheek. “That’s been part of the problem in recent years, ain’t it? Neither one of us is sayin’ what we really mean, or meanin’ what we say.”</p><p>Libby closed her eyes and basked in his tender touch.</p> <p>“I wanna fix this between us, Libby.”</p><p>Me too.</p><p>Two solid raps startled them both. Quinn rolled down his window. “Hey, Cord, what’s up?”</p><p>“Just makin’ sure you didn’t get cold feet.”</p><p>“Nope.”</p><p>Cord grinned. “Good. Took a bit of finagling, but we made room. See you two in there.”</p> <p>“In where?” Libby asked.</p><p>“Healing Touch.” Quinn rolled up the window. “AJ is offerin’ a class on sensual massage.”</p><p>“Are you serious?”</p><p>“Yep.”</p><p>“You signed us up for a class so I could learn to give you a...sexy massage?”</p><p>“There you go jumpin’ to conclusions again. I signed up so I could learn to give you a sexy massage.”</p><p>Talk about being completely pole-axed. “When did you do this?”</p><p>“Yesterday. There was, ah, a last minute cancellation so I lucked out and they squeezed us in.”</p> <p>Last minute cancellation. Right. She’d bet a hundred bucks he’d strong-armed his way into getting a spot in that class—an example of McKay nepotism at its finest. But she couldn’t help being impressed.</p><p>“Why are you doing this?”</p><p>Quinn stayed quiet so long she was afraid he wouldn’t answer. “In the last year or so you were pretty hell bent on us takin’ some ‘couples’ classes together. I’ll admit I was kinda a jerk about it, so I thought I’d make it up to you and learn a new skill to boot.” He focused his gaze out the windshield. “Plus, I like touchin’ you. Thought this’d be a good reminder for me. For both of us.”</p><p>How had she forgotten the thoughtful side of this sweet, sweet man? Libby curled her fingers around Quinn’s jaw, turning his face toward her. She smashed her lips to his, kissing him crazily, kissing him like he’d asked her to. Thrown off balance, she eased back and whispered, “Thank you.”</p><p>Inside the massage studio, chairs were lined up in front of a projection screen. All the seats but two were occupied.</p><p>Good Lord. They knew everyone in the room.</p><p>The owner of the hardware store and his wife held court in the front row. Dixie, proprietor of the Golden Boot, and her hubby of fifty years, sat next to Darnell Broken Nose, a board member of the Crow Agency and his wife, Leela. Libby expected Quinn to pull his ball cap down over his eyes out of embarrassment, but he nodded to the men and directed her to the two empty chairs.</p><p>Gorgeous, blonde and enormously pregnant AJ McKay stepped front and center. “Good to see everyone this afternoon. First we’ll watch a twenty-minute film on basics of massage and then we’ll get to the hands-on portion of the class.” She smiled. “If anyone has questions at any point, don’t hesitate to ask.</p><p>And if you tend to be a little shy—” she looked directly at Quinn, “—I’ll be happy to answer questions in private.”</p><p>The lights dimmed. The movie rolled. Libby expected soft-core porn or worse, a thinly disguised instruction manual, but the video struck a good balance between sensuality and the how-to aspects of massage.</p><p>After the video ended, Cord unfolded four padded tables and four six-foot high privacy screens, positioning one in each corner of the narrow room.</p><p>AJ walked through the maze, stacking towels, and draping sheets over each screen. “Next, I’ll demonstrate tricks and techniques on my guinea pig—I mean my helpful husband—before I turn you loose to experiment on your own.” She directed them to a massage room at the back of the building.</p><p>A shirtless Cord was stretched out on a padded table. AJ affectionately swept her hand up his spine.</p><p>“You ready?”</p><p>Cord grinned over his shoulder and focused on the swell of her belly. “It’s obvious I’m always ready for you, baby doll.”</p><p>AJ dribbled oil on Cord’s naked back, but the look she leveled on him said she’d make him pay for that suggestive remark later, guaranteed.</p><p>Libby bit back a grin. The dynamics in the huge McKay family still fascinated her, even after being part of it for more than a decade. She got a huge kick out of how easily AJ led gruff Cord around by the nose.</p><p>The aroma of sandalwood and lemon filled the room. “First and foremost, there is a pronounced difference between giving your partner a sensual massage and a deep tissue massage.” She dug her thumbs into the base of Cord’s spine and followed the line up to his neck. “You don’t want to cause your partner any discomfort. The amount of pressure used isn’t as important as a strong and steady touch.”</p><p>In order to see AJ, Quinn leaned over Libby’s shoulder. Libby had a devil of a time focusing on AJ’s instructions when Quinn plastered his male hardness against her backside. Her blood raced. Her face heated. Her palms sweat. She’d be a horny basket case by the time Quinn actually put his hands on her.</p><p>“The other aspect of sensual massage is setting the mood. If you have children, you’ll want to plan this for when you have an hour of uninterrupted time. In most houses, the bed in the bedroom is the easiest place to set up. Music isn’t necessary, but I’ve found it can be both relaxing and arousing. Candles are good. They provide light, scent and ambience. Plain white cotton sheets are a smart choice. They can be warm or cool to the skin. And if you get carried away with the oil they’re easy to clean. But the single most important thing to bring is a positive attitude. Making your partner feel good shouldn’t be a chore. It should be a sensual enjoyment for both of you.”</p><p>When Quinn whispered, “Amen,” in Libby’s ear, a tremor of desire rippled through her.</p><p>AJ demonstrated a few more techniques and then dismissed everyone back to their areas.</p><p>“What do you suppose we’re gonna do now?” Libby asked when they were alone behind the partition.</p><p>Quinn held up a sheet with a cat-who-ate-the-mouse grin. “You’re supposed to strip.”</p><p>“Down to nothing?”</p><p>“What else does strip mean?”</p><p>“But all those people are out there—”</p><p>He eliminated the distance until they were a breath apart. “It’s just you and me. No one else matters.”</p><p>“You wouldn’t have a problem getting buck-ass nekkid with the family banker in the next cubicle?”</p><p>“Not if I knew it was gonna lead to you puttin’ your hands all over me. Damn, do I love havin’ your hands on me.”</p><p>When had closed-mouthed Quinn McKay become such a silver-tongued devil? “You don’t play fair.”</p><p>“Because I’m playin’ for keeps.” Quinn smooched her nose. “You want my help gettin’ undressed?”</p><p>“No!”</p><p>“If we were home I wouldn’t allow you a choice. But I’ll do the gentlemanly thing, just this one time, and step outside. Whistle when you’re ready for me.”</p><p>Whistle. Right. And what the heck did he mean by doing the gentlemanly thing just this one time? Did Quinn plan on showing her a more verbal, more commanding side?</p><p>Libby shivered and it had nothing to do with being naked.</p><p>Quinn fought the urge to pace. He wasn’t nervous so much as antsy, because after two steamy kisses, he was raring to crank up the sexual heat with his delectable wife.</p><p>AJ moved to the center of the room. “Once your partners are set, I’ll come around with a bottle of oil.</p><p>This’ll be your last chance to ask questions before I shut off the lights, turn on the music and leave you to your own devices.</p><p>“Once everyone is settled, I’ll be in the backroom for the duration of your massage experimentation time, so you’ll have no interruptions from me—or anyone else—within your private areas. Remember, there is no right or wrong way. Sensual massage is highly personal and having a good technique isn’t nearly as important as having fun and an open mind.”</p><p>The table creaked and Libby swore.</p><p>Quinn spoke through the curtained panel. “You ready?”</p><p>“If you mean am I naked,” she said in a hushed tone, “then yes. Throw me that extra sheet.”</p><p>“Sure.” He tossed it over the partition.</p><p>Loud instrumental music started and the lights clicked off. AJ sauntered up with her usual sunny smile. She popped her head around the partition and her smile slipped. “Oh. Umm. That’s great, Libby.</p><p>You’re all set.” AJ whirled on Quinn and hissed in his ear, “Didn’t you tell her she only had to take off her shirt?”</p><p>“Nope.”</p><p>AJ whapped him on the arm, but her eyes twinkled. “Typical McKay man. Here’s your oil. Put it to good use.”</p><p>“I intend to.”</p><p>Quinn skirted the privacy panel and sucked in a harsh breath. Lordy, look at that. Libby’s bare, toned arms were stretched above her head. Save for the sheet covering her lower half, her sexy, freckled back was completely exposed and his for the taking.</p><p>She lifted her head. Her eyes darted past the partition. “Quinn, I’m—”</p><p>“Just us, remember?” He uncapped the oil and drizzled a thin line across her shoulders and spine in a T-shape. “I’ll start at the top and work my way down, is that all right with you?”</p><p>“This is your show.”</p><p>“That it is. Keep that in mind later.” When his hands touched her skin, his cock went hard as a brick. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>God, she was so feminine. So warm. So perfectly supple.</p><p>So his.</p><p>At first, Quinn feared he’d freeze up. But faced with Libby’s naked body spread out in a sumptuous feast, when he’d been starving for her for months, something instinctual kicked in.</p> <p>Lust.</p><p>He swept his fingertips through the oil, hoping it’d lessen the abrasiveness of his callused hands. He played connect the dots with her moles and freckles, promising himself he’d use his tongue next time. Once the oil glistened across her torso, he began to rub it in.</p><p>If her sighs and moans were any indication, he must’ve been doing something right.</p><p>Quinn worked his thumbs into the tensed muscles stretching across her back, rounding to the bottom of her shoulder blades. Then he gradually moved down her spine, a vertebra at a time. When he reached the sexy dimples above her ass, an area he remembered as highly sensitive, he decreased the pressure. His touches became playful. As Quinn drew ever-widening circles, she arched into his teasing caresses.</p><p>“Quinn—”</p> <p>Instantly, his mouth was by her ear. “Something you need?”</p><p>“Yes. No. I...I wanted to tell you I love the way you’re touching me.”</p><p>“Good.” He smiled against her damp neck and rained kisses along her nape, pleased as punch when gooseflesh broke out beneath his questing lips.</p><p>Quinn continued his sensual assault. His hands mapped her every tempting curve, his fingers soothed every quivering muscle. When he finished tormenting one area, he’d scatter openmouthed kisses over each inch of bared flesh before focusing his attention on the next trembling section.</p><p>When he completed his final pass to those alluring dimples, he caught a whiff of Libby’s arousal. A primal male need slammed into him. His chance of tamping it down vanished, especially when he noticed her hips bumping up to meet his every touch.</p><p>Libby faced the screen, almost as if she was hiding her reaction from him.</p> <p>Oh hell no. That wouldn’t do at all.</p><p>As Quinn put his lips to her ear, he traced the crack of her ass down to where her body was warm and sticky. He groaned in her hair. “Lemme touch you here.”</p><p>“No!” Libby’s shoulders shot up.</p><p>Quinn pushed them back down. “Yes.”</p><p>“But we aren’t supposed to—”</p><p>“Aren’t supposed to what? Ain’t no rules but mine. This is my show, remember? Raise your hips higher so I can reach your sweet spot.”</p><p>She had a moment of hesitation before she complied.</p><p>“That’s my girl.” Quinn slid his first and middle fingers through the sweet cream pouring from her sex, combining it with the oil, swirling the mixture up. After a few concentrated strokes, he slipped his fingers into her pussy, letting her clit rest on the bony section at the base of his thumb.</p> <p>“Oh. That does feel really good.”</p><p>He wiggled his fingers around the snug channel, satisfaction filled him at seeing her writhing and trying to force his fingers deeper.</p><p>“Please.”</p><p>“What?” Quinn was in a fog of lust. His need to prove he could still satisfy his mate became a single-minded pursuit.</p><p>At her whispered plea, “Faster,” Quinn lost it. Pumping his fingers inside her, he growled in her ear,</p><p>“I wanna fuck you like this, darlin’ wife. Face down on the dining room table, no foreplay, just hard, fast fucking. Poundin’ into this pussy until you scream.”</p><p>“Yes. God. Yes.”</p><p>“Give it to me, Libby. Come around my fingers. Prove to me you love the way only I can make you come.”</p><p>Libby gasped.</p><p>“Ssh. When we’re home you can cause a ruckus, but this time be quiet.” He whispered, “And don’t that just make our naughty little secret so much raunchier, knowin’ you gotta be still when your whole body is buckin’ for release?”</p><p>“Quinn...I’m gonna—”</p><p>“Come. Now.”</p><p>Another gasp escaped Libby’s sweet mouth as her orgasm exploded. Quinn felt it everywhere, a rhythmic pulling around his fingers, a steady throbbing where her clit pressed into his hand, even the skin on her back pulsed the same cadence. He stared greedily as her climax inundated her.</p><p>On a final sigh, Libby slumped to the table.</p><p>Quinn removed his hand from between her thighs and loomed over her. “Look at me.”</p><p>She blinked at him.</p><p>“I love the way you taste.” He placed his fingers inside his mouth and sucked noisily. Then he traced her lips with his wet fingers. “Taste yourself.”</p><p>Heat flashed in Libby’s eyes. Keeping their gazes locked, she parted her lips, sucking his fingers to the knuckles. Quinn growled at feeling her hot little tongue swirling around the rough skin. He withdrew his fingers, flipped her over, and took her mouth savagely.</p><p>The kiss was out of control from the start. After several blissful minutes, Quinn managed to find his sanity before they fucked right there in AJ’s massage studio. He slipped his lips free from hers and placed them against her ear. “Get dressed.”</p><p>“But—”</p><p>“We’re done here, Libby. Get dressed. Fast.” He drew in a deep breath. “Please.”</p><p>In such close proximity, he felt—rather than saw—her nod. Unable to control his need for her or his raging hard-on, he presented his back to her, trying like hell to ignore the sexy sounds of her uneven breathing and the rustle of her clothing.</p><p>Libby cleared her throat. “I’m ready.”</p><p>He clasped her hand and ushered her outside without another word.</p><p>Chapter Four</p><p>The wind whistled, blowing leaves and debris around their feet. Although Libby’s mind was hazed with pleasure, she hated that Quinn was dragging her off like a disobedient child.</p><p>She dug her bootheels into the sidewalk and jerked them to a stop.</p><p>Quinn whirled around.</p><p>Everything feminine inside her cheered at his scorching look. His gorgeous blue eyes were nearly black, not from rage, but from passion, which increased her determination to set things straight before they took another step—literally or figuratively.</p><p>Testily, he said, “What?”</p><p>“Where are we going?”</p><p>“Home.”</p><p>“Why did you haul me out of there so damn fast?”</p><p>“Guess.”</p><p>Yippee, he was back to one-word answers. “Were you embarrassed about what just happened?”</p><p>“No. Were you?”</p><p>“No. It was hot as hell.” Libby’s gaze dropped to the front of Quinn’s sweats. Bingo. Damn impressive tent. She smirked. “Are we leaving because you have a hard-on?”</p><p>“Yep.”</p><p>“That’s all?”</p><p>“Jesus, Libby, will you get in the goddamn truck so we can talk about this at home?”</p><p>“Nope.”</p><p>Quinn stared at her as if she’d morphed into a three-eyed, green-tentacled alien life form.</p><p>“So it’s okay for you to get me off in public, but I can’t return the favor?”</p><p>“What?”</p><p>Libby grabbed him by the shirtsleeve and towed him around the corner of the building. Luckily, this side of the two-story brick structure faced an empty lot. She pressed her back against the sandstone bricks and tugged him. Well, she tried to tug him, but the solidly built man wouldn’t budge.</p><p>“What are you doin’?”</p><p>“Seducing you. Fair’s fair, Quinn. I wanna get you off. Right here, right now.”</p><p>“Good Lord, woman, what’s gotten into you?”</p><p>“You’ve gotten into me, remember whose fingers were in who?” Libby wrapped her arms around his neck. “Hoist me against this wall and rub your cock on me until you come.”</p><p>She could picture her husband mentally compiling a list of pros and cons. “We’re outside. Anyone could see us.”</p><p>“So?”</p><p>“Libby.”</p><p>“What? Can you blame me for wanting more of the wild man I met behind the curtain?” Libby rubbed her lips over the baby-smooth line of his jaw and he angled his head, allowing her better access to all the tasty spots. “You’ve held back with me, Quinn. Sometimes you’ve shown me a glimpse of that beast inside you. If we’re really going to try and make this work, no more secrets between us. No more politeness. No more PC behavior. No more hiding behind a mask.”</p><p>He squinted at her. “If I lower my mask, you’d better be prepared to lower yours too.”</p><p>“What do you mean?”</p><p>“That means I wanna see some of the shine worn off the perfect rancher’s wife halo you wear like a tiara. Hell, I’d love to knock that crown right off your pretty, proper little head.”</p><p>There was the opening she’d longed for. Masks off, gloves off, the real down and dirty side to each of them, squaring off with no rules. She said, “Deal.”</p><p>Quinn’s eyes took on a predatory look. “Make doubly sure you mean what you’re sayin’, ’cause once I let that cat outta the bag, it ain’t ever goin’ back in. I’ve got some dark edges I’ve never explored, Libby.</p><p>Be one-hundred-percent sure you can handle ’em.”</p><p>For a split second, Libby’s determination wavered, seeing the steely glint of danger in her husband’s eyes. But she’d loved him long enough to know he wouldn’t physically hurt her. In fact, he’d probably hidden those rough edges to protect her. Silly man.</p><p>Meeting his gaze dead on, she gave him an unequivocal, “Yes, I’m sure. Now show me, dammit.”</p><p>His answering snarl was decidedly feral. Quinn clamped his mouth to hers as he clapped his hands on her ass and boosted her against the building.</p><p>Libby circled her legs around his hips as he lined his cock to the top of her cleft, rocking his pelvis, so the length, from root to tip, rubbed perfectly on her pubic bone. He groaned in her mouth and kissed her harder.</p><p>Yes. This was what she’d wanted. His uninhibited response. A chance to crack the gentlemanly cowboy mantle that weighted him down like a yoke.</p><p>His every grinding stroke hit her clitoris. Her sex swelled and wept and gloried in the friction. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Quinn ripped his mouth free and nestled his cheek beside hers. “Been so long. God, Libby. I’m already there.” His rhythm never faltered, even through his short and choppy breaths. “Lift your shirt. Pull my sweats down so I can come on your belly.”</p><p>Those gruff words alone would’ve been enough to get her hot again, but she was already past the point of no return. Libby reached between them. The head of his cock poked up past the waistband of his sweatpants. He’d gone commando. Handy. She briefly touched the sleek maleness before aligning the weeping tip above her belly button. “Do it.”</p><p>The thrusts were hard and fast. Quinn’s head snapped back with enough force his hat fell to the dirt.</p> <p>Libby shamelessly watched pleasure contort her husband’s face as he came with a low moan. His pelvis kept pumping until warmth spurted across her stomach. With the constant abrasion to her clit, another quick orgasm erupted that left her gasping and selfishly wanting more.</p><p>Quinn stilled and slowly opened his eyes.</p><p>Rather than break the moment, Libby swirled her fingertips through the come dripping down her belly. She brought the slickly coated fingers to her mouth, licking at the salty offering. “Mmm.”</p><p>His powerful gaze never wavered. Not even when she traced the seam of his lips with her wet fingers and demanded, “Taste.”</p><p>Without hesitation Quinn drew her fingers deeply into his mouth and sucked.</p> <p>Her sex clenched. Her blood seemed to sizzle and pop beneath her skin. Who was this wild man? She managed a raspy, “Quinn.”</p><p>“I know, darlin’ wife. Home. Now.” He gently deposited her on the ground. Hat on, their clothes somewhat back in order, he guided her to the truck.</p><p>On the road home, Quinn reached for her hand, but didn’t urge her to sit next to him. Nor did he speak, which caused a heightened sense of sexual awareness in the confines of the silent cab. Her stomach flipped whenever the coarse pad of Quinn’s thumb stroked the pulse point on the inside of her wrist.</p><p>After he’d parked in front of the house, Quinn turned off the engine, but didn’t attempt to get out of the pickup. He lounged against the door. Not in a relaxed manner, but tensed, like a coiled snake about to strike.</p><p>“What?”</p><p>His very hungry, very male gaze executed a methodical sweep of her body, from the tip of her nose to the toes of her boots. “Strip.”</p> <p>Not the response she’d expected. “Right here? In the truck?”</p><p>“Yep.”</p><p>“But—”</p><p>“Huh-uh. Here’s that darker edge, Libby. I ain’t foolin’ around when I say take off your damn clothes.</p><p>Now.”</p><p>“In a striptease?”</p><p>“If you like. I don’t care just as long as you get nekkid. Fast.”</p><p>The demand was so unlike Quinn.</p> <p>Isn’t this what you wanted? To witness the dark side of your lover you suspected he kept hidden from you?</p><p>Absolutely.</p><p>Libby tentatively unbuttoned her blouse. Once she’d taken it off, she looked to him for further instruction.</p><p>“All of it. Bra, jeans, thong.” He grinned. “Have I mentioned how much I love seein’ nuthin’ marring that sweet ass except a single string? Them bright pink ones are my favorite.”</p><p>She swallowed hard. She’d assumed he hated the changes she’d made in the last year, since he hadn’t said a word, good, bad or otherwise. Seemed she’d been mistaken.</p><p>What else had she been mistaken about when it came to her husband?</p><p>“Libby?”</p><p>“Fine. I’m doing it.” First, she yanked at her boots. She’d been in such a hurry to leave the massage studio she’d pulled her boots on over her jeans. After peeling off her socks, Libby glanced over at him.</p><p>“Bra next. I wanna see your tits bouncin’ and swayin’ as you’re wigglin’ outta them skin-tight jeans.”</p><p>Her face flamed at the mental picture he’d painted. “Quinn!”</p><p>“Don’t act so surprised. You gotta remember how much I love your tits.” He cocked an eyebrow. “Or am I gonna have to give you a very intensive refresher course? ’Cause I am so all over that.”</p><p>Good Lord. She couldn’t believe how hot his dirty talk and highhanded behavior made her. Her thong was soaked. She rubbed her thighs together as she sought the bra clasp in the middle of her back. Libby slipped the satin straps down her biceps. Once her arms were freed, she playfully flung the lacy bra in Quinn’s face.</p><p>“God, I forgot how pretty your nipples are.” Quinn licked his lips. “Get them britches off.”</p><p>Libby rested her shoulders on the door and wiggled her hips. As her fingers made quick work of the button and zipper, she hoped her cottage-cheese thighs wouldn’t jiggle as much as her boobs. She shimmied the denim and her underwear down her legs, past her knees and calves, kicking them to the floorboard.</p><p>Quinn didn’t utter a peep. Libby stayed motionless, red-faced, heart pounding, blood racing, perched naked as the day she was born, on the front seat of his truck, in broad daylight.</p><p>“Libby. Darlin’, look at me.”</p><p>She slowly elevated her chin. Quinn’s face glowed with pure male heat. And his eyes. Lord, his indigo eyes were filled with such love and need, that her soul nearly burst.</p><p>“You are beautiful. You’ve always been the most beautiful girl in the world to me. That hasn’t changed in fourteen years. The way I feel about you hasn’t changed. It never will.”</p><p>“Quinn—”</p><p>“That said...” He distractedly adjusted his cock. When he realized she’d been staring at his crotch, his palm repeatedly stroked the bulge between his legs. “Oh, little wifey mine. I’m likin’ this naughty side of you. I like it so much, in fact, that I’m gonna give you fair warnin’.”</p><p>“About what?”</p><p>Instead of answering, Quinn removed his hat. Stripped off his T-shirt. Toed off his shoes and socks.</p><p>But he left his sweatpants on.</p><p>“Fair warning about what?” she prompted.</p><p>“Fair warnin’ that after you run into the house, I’m gonna be hot on your heels. And when I catch you, I’m gonna fuck you right where you stand.”</p><p>Her heart thumped a whole lot faster.</p><p>“You wanted to let the cat outta the bag and here I am, more than ready to pounce.”</p><p>Oh God.</p><p>“So if I’m the cat, I guess that makes you—” his gaze swept over her impatiently, “—the mouse.”</p><p>Ah hell, she was so screwed.</p><p>And she loved every second of it.</p><p>Quinn showed his teeth in a ravenous smile. “Now’s your chance. Run little mouse, run.”</p><p>Libby opened the truck door just as Quinn lunged at her. Modesty forgotten, she raced up the walkway naked.</p><p>Three. Two. One.</p><p>Quinn leapt out of the truck.</p><p>He ignored the burn and sting of the concrete on his bare feet. His focus was on one thing.</p><p>Libby.</p><p>Finding her. Fucking her. Marking her. A possessive, red haze, more animal than man, fogged his neural pathways. Every pounding footstep echoed in his head as a mantra: mine mine mine.</p><p>He tore up the porch steps and shouldered aside the front door. The kitchen zipped by in a blur. He sprinted past the dining room table into the front room.</p><p>No. Wait. He stopped. Backtracked in mind and body. There she was, trying to blend into the wall separating the three-season room from the living room.</p><p>Silly woman. She’d never been a wallflower in his eyes. She’d never blended. She’d always been the only one who’d stood out in every crowd. From the first moment he’d seen her.</p><p>Find her. Fuck her. Mark her.</p><p>Mine mine mine.</p><p>Quinn growled and advanced on her.</p><p>Libby remained utterly still. He ripped off his sweats and stood naked and fully aroused before her.</p><p>He slapped his hands on the wall above her head, but she didn’t flinch.</p><p>He planted his mouth next to her ear. “I found you.”</p><p>“I see that.”</p><p>“I want you.” Quinn rubbed his cheek over hers, marking her with his scent.</p><p>“I know.”</p><p>“You’re mine. Only. Ever. Mine.”</p><p>“I know that too, Quinn.”</p><p>“Do you also know how I wanna fuck you, little mouse?” Quinn let his lips trail to where her pulse jumped frantically in her throat.</p><p>“Ah. No.”</p><p>“Then I’ll tell you. You’re gonna be face-first against this wall. Me rammin’ into that sweet, wet, hot, tight pussy from behind, takin’ what belongs to me. And when I can’t hold back another second?” He flicked his tongue across the hollow of her throat. “Then I’m gonna pull out and come all over your back.</p><p>Just like I came all over your front.”</p><p>She whimpered a sound of pure need.</p><p>Quinn spun Libby forward, positioning her arms above her head, flattening her palms to the wall. He curled his hands around her hips and angled her pelvis for easier, faster, deeper entry.</p><p>He slid his right hand over her swollen pussy lips and used the thick cream to stroke her clit. “You’re drippin’ wet thinkin’ about what I’m gonna do to you.”</p><p>Another moan. Louder.</p><p>“Gonna be fast, hard and dirty, darlin’ wife.”</p><p>“Do it.”</p><p>Quinn kept his hold on the front of her body as his left hand aligned his cock. He thrust to the root with one sharp snap of his hips.</p><p>Tight. Hot. Wet. Damn. It was good to be inside her. It was damn good to be home.</p><p>“Oh. God. Yes.” Her hoarsely spoken words shattered what little restraint he had left.</p><p>He slammed in. Withdrew quickly and rammed in again. Over and over. Setting a pace that robbed him of reason and the ability to do anything but sate his need for her by fucking her.</p><p>Sweat dampened his hair and trickled down his spine. Blood pounded in his head, his throat, his heart.</p><p>His groin was on fire.</p><p>A familiar tightening at the base of his cock signaled he’d reached the end point. Four, five, six, ball-bruising thrusts and he withdrew from Libby in time to take himself in hand. He jacked his cock hard and aimed at her lower back, groaning at every hot burst of come exploding from his dick. He watched each spurt dotting her skin and a primal roar arose. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Soon as the final shot was over, he pressed his belly to her back, spreading his fluid between them.</p><p>“Quinn. I-I need—”</p><p>“I’ll take care of you.” Gripping her left hip in his left hand, he used his right fingers to rub her distended clit. No teasing touches. He focused every bit of attention on that pouting bundle of nerves.</p><p>Libby gasped. “Yes. Don’t stop.”</p><p>“I won’t. Come for me. Show me you can still come undone at my touch.”</p><p>Powerful contractions pulsed beneath his finger and Libby threw her head back. Quinn latched onto the sweet spot at the nape of her neck and suckled strongly, gifting her with a mark.</p><p>She bumped her pelvis in time to the throbbing pulses until they stopped. Then she sighed dreamily.</p><p>He whispered fiercely, “You’re mine. Don’t forget that.”</p><p>After a minute or so, she wiggled her butt. “Good thing, because I think we’re stuck together.”</p><p>“Appears so.” Lightly, he said, “You mind bein’ stuck with me?”</p><p>She didn’t respond right away.</p><p>Quinn waited, even though it damn near killed him.</p><p>Libby released another long sigh. “I’m finding the idea of being stuck with you more appealing than I imagined a day ago.”</p><p>“I can work with that. Hang on.” He turned her and slipped his right arm behind her knees, cradling her to his chest as he lifted her into his arms.</p><p>“Quinn! I’m too heavy for you to carry.”</p><p>“No, you ain’t. Now hush up.”</p><p>“Where are you taking me?”</p><p>“To bed.”</p><p>“Oh.”</p><p>Sheer grit helped him scale the flight of stairs. He paused in front of their bedroom door.</p><p>“With you carrying me, I feel like a bride again.”</p><p>“I’m gonna treat you like a new bride. ’Cept better, ’cause this time around I’ll have the benefit of years of experience as a bridegroom.”</p> <p>“And what will you do with those years of experience?”</p><p>“Use them to please my darlin’ wife.” Quinn adjusted his stance. “Once we cross this threshold, it’ll be like we’re startin’ over.”</p><p>She wiped a bead of sweat from his temple. “Why, Quinn McKay. That was downright romantic.”</p><p>“You sound surprised.”</p><p>“I am.”</p><p>He grinned. “I’m tryin’. So what say you, bride of mine? Shall we christen the marriage bed?” Then Quinn saw tears swimming in her pretty eyes. “Hey, now. None of that.”</p><p>“I can’t help it. You’re so sweet.”</p><p>“Sweet? Woman, it rips my guts out to see you cryin’.”</p><p>“Even happy tears?”</p><p>“Any kind of tears.”</p><p>She kissed his Adam’s apple. “Then take me to bed and see if you can’t turn my tears into screams of pleasure.”</p><p>“That, I can do.”</p><p>Chapter Five</p><p>The instant Quinn deposited her on the bed, Libby yawned. Lord. She’d been through the wringer the last few hours. Emotionally. Physically. Her body was relaxed from the massage, as well as sated from the hot, fast orgasm. The cool sheets against her heated skin induced a strong wave of sleepiness.</p><p>“I saw that.”</p><p>“Saw what?”</p><p>“Your yawn.” Quinn propped a hip on the mattress next to hers. “Tired?”</p><p>“Huh-uh.” She yawned again.</p><p>He laughed softly. “Liar. Why don’t you take a little catnap?”</p><p>Libby allowed a quick smile. “Don’t you mean a little mouse nap?”</p><p>“Is that a complaint about our game of cat and mouse?”</p><p>“God, no.”</p><p>“Good. ’Cause that was the best time I’ve had in a long time.”</p><p>“Me too.”</p><p>They stared at each other in silence until Quinn tenderly swept a hank of hair from her forehead. He kept floating his knuckles up and down the side of her face.</p><p>Such serious eyes. “What?” she asked softly.</p><p>“Rest up. I ain’t nearly done with you. Not even close. Not by half.”</p><p>“If that’s the case, maybe you oughta rest up too.”</p><p>“You think I need a break so I can get it up later?”</p><p>“Maybe.”</p><p>He grunted.</p><p>“Or maybe I just don’t want to nap alone.” Libby impishly nipped the inside of his wrist. “I miss how you used to hold me all night. Like you couldn’t bear to be away from me for a single second, even in sleep.”</p><p>“Seems a long time ago, huh?”</p><p>“A lifetime. Come to bed, Quinn. Remind us both of what we’ve been missing.”</p><p>He stood and dove over her, almost bouncing her off the mattress.</p><p>Libby shrieked, thrilled by his playful side.</p><p>In one fell swoop, Quinn wrapped himself around her, tucking her head to his chest so their naked bodies were entwined. He pulled the quilt up and bussed her crown.</p><p>The steady thump thump thump of his heart lulled her into a sense of peace.</p><p>An insistent circle drawn around the tip of her nipple woke her. Warm, supple lips drifted over hers in a seductive tease, bestowing fleeting kisses, interspersed with firm-lipped nips.</p><p>Libby opened her eyes. “That’s a nice way to wake up.”</p><p>“And I’m just gettin’ started.” Quinn kissed the corners of her mouth and traced the seam with the point of his tongue.</p><p>Libby parted her lips, an invitation for a more thorough kiss. He gently sank his teeth into her bottom lip and tugged. When a whimpering moan rumbled from her throat, Quinn didn’t just kiss her, he inhaled her. His hands were on her breasts, his cock was slapping her belly, his tongue was thrusting against hers in a full-body kiss.</p><p>Then his mouth left a hot trail down her neck, straight to her cleavage. He glanced up at her from beneath lowered lashes. “I couldn’t wait ’til you woke up so I could get my mouth all over these, because damn, do I love your tits. I’m gonna take my time refreshing my memory of them.” He rubbed his face over the plumped mounds cupped in his hands. “It’s been so long, Lib. God, I miss this.”</p><p>“Miss sex?”</p><p>“Well, yeah, but I miss bein’ with you, nekkid or otherwise.”</p><p>She understood his difficulty in admitting the tiniest show of need. Softly, she said, “I know,” and threaded her fingers through his silky hair.</p><p>He bent his head and lapped at her left nipple. Never using his whole mouth, never sucking, just licking in a delicate manner. The pad of his thumb swept the lower swell of the other breast in an erotic arc.</p><p>He switched to her right nipple and did the exact same thing. Slowly. Sensually. Systematically.</p><p>No doubt, Quinn planned to torture her.</p><p>He placed his mouth on the top of her breast and sucked. Hard.</p><p>Libby gasped.</p><p>Quinn only broke the tight suction to apply the same stinging bite to the other side. A dark gleam of satisfaction filled his eyes when he angled back to admire the love-bruises.</p><p>That’s when the real assault began. Quinn suckled and nipped and licked, using his teeth, his fingers, his breath until she writhed in abandon. “Please.”</p><p>He ignored her plea and flicked his tongue rapidly over the right nipple, blowing on the wet tip until it puckered into a tight point.</p><p>Just when Libby couldn’t take any more, that wickedly talented mouth traveled south. He paused to trace the indentation of her navel. He scattered kisses from hipbone to hipbone, letting his soft hair tickle her belly.</p><p>“Quinn.”</p><p>“Right here.” He lifted his head. “Hand me a pillow so I can prop your hips higher.”</p><p>“Why?”</p><p>“I wanna see you. All of you.”</p><p>It wasn’t as if he hadn’t seen her privates before. Yet her inborn sense of modesty caused her to waver.</p><p>He nuzzled her mound. “Don’t you want me to eat my fill of your sweet pussy? You used to like it.”</p><p>His tongue wiggled an inch or so down her cleft. “Or has it been so long you don’t remember?”</p><p>“I remember. I just...”</p><p>“Then grab a pillow. Now.”</p><p>Another glimpse of that darker edge. She tossed him a pillow and raised her hips while he placed it under her butt.</p><p>“Move your legs apart. I need room to work.”</p><p>Libby hoped after he arranged her she’d feel less like she was getting a pelvic exam and more like she was about to receive the most amazing oral sex of her life.</p><p>“We seemed to have lost our momentum, darlin’ wife.” The bed jiggled as Quinn scooted down until his head disappeared between her legs.</p><p>After one long, wet lash of his tongue, Libby said, “I definitely remember.”</p><p>He chuckled against the tender flesh and the vibration sent her belly muscles rippling.</p><p>With her hips propped up, Quinn’s hands were free to roam. He stroked the inside of her thighs while his tongue drew feather-light circles around her clit. Then he’d back off, his growling noises heightened her excitement as he lapped at the juices dampening her entrance.</p><p>Quinn knew exactly how to make her body hum. So it surprised her when he asked, “Which feels better? This?” Using firmed lips, he opened and closed his mouth over her pussy lips and clit in little biting increments.</p><p>“Oh, I like that.”</p><p>“How about this?” His fingers pulled back the hood covering her clitoris and he randomly flicked just the very tip of his tongue over the hot spot.</p><p>An electric tingle shot straight up her center. “Whoa. Where’d you learn that?”</p><p>“Figured maybe it was time for this old dog to learn new tricks.” He paused. “If I did something you didn’t like, or if you wanted more of something you did like, you’d tell me, right?”</p><p>Did he think his...technique was off? Lord. She’d never had any complaints about his oral talents. In fact, it’d always scared her that he instinctively could catapult her into pleasure in no time flat. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Had Quinn suffered a crisis of faith in his skills as a lover? Was that somehow her fault?</p><p>You’ve been so focused on the results of sex—creating a baby—you’ve forgotten the best part of sex is creating lifelong intimacy with the person you trust above all others.</p><p>Libby gazed at him. When had their marriage become only about what she wanted and needed? What about Quinn’s wants and needs?</p><p>“Lib? Darlin’, what’s wrong?”</p><p>She swallowed the lump of guilt stuck in her throat. Quinn deserved better than the little he’d been getting from her. Sobering, to consider she had just as much changing to do as she’d expected from him—</p><p>maybe more. Those changes wouldn’t happen overnight for either of them, but she’d do her part, starting right now.</p><p>“Nothing is wrong.” Libby’s voice dropped to a whisper. “I’ve missed you. Being with you like this.</p><p>Whenever you put your mouth on me I can’t think of anything else but how great you make me feel.”</p><p>Quinn’s eyes shone with male pride. He slapped his palms on the inside of her thighs and his dark head descended.</p><p>Libby held her breath. Every muscle in her body clenched in anticipation of the next swipe of his wet tongue.</p><p>“Relax.”</p><p>“I am.”</p><p>“Wrong. I can feel the tension vibrating off you.”</p><p>“It’s not tension, Quinn. It’s lust. I don’t need new tricks. I just need you.”</p><p>An animalistic snarl was her only signal she’d pushed him to the brink.</p><p>No gentleness, just hunger. His single-minded, unyielding pursuit of her pleasure sent her body into overdrive. Dizzy from the sensations bombarding her, Libby closed her eyes, lost in the burning brand of his skilled mouth, the sweet suction, the bruising grip of his fingers. With her every shallow breath, Quinn’s musky aroma filled her lungs.</p><p>Two fingers slipped into her sheath, curling behind her pubic bone, and she bowed off the bed.</p><p>He flickered his tongue over her clitoris in short, fast stabs as he rubbed her innermost tissues with his fingertips. Not in and out, but in the sweetest, erotic internal caress.</p><p>Before she’d gotten used to the feeling of fullness from those clever, fondling fingers, her blood gathered in the hot spot beneath his dancing tongue. “Quinn?”</p><p>“Tell me what’ll get you there.”</p><p>“Suck harder.”</p><p>He did.</p><p>She clutched his hair. The orgasm flooded her, a throbbing, take-her-breath-away seizure of pulsing bliss. A drawn out, “Oh God,” escaped as she arched hard into him, thrashing against the sheets and rolling her hips into his face.</p> <p>He kept his mouth suctioned to her clit until the pulses slowed.</p><p>She flopped into the mattress with a final groan. Her body twitched as he gently lapped the super-sensitized areas of her sex, and she swore she felt him grin against the crease of her thigh when she sighed again.</p><p>Libby peeled her eyes open, pushing herself up on her elbows. “What other new tricks did you learn?”</p><p>Quinn laughed and gave her one last deliberate lick. “Now where’s the fun in tellin’ you? I’d rather show you. Later. First,” he crawled up her body with an unholy gleam in his eyes, “you’re gonna return the favor.”</p><p>Libby licked her lips and looked at his cock.</p><p>“You can use that pretty little tongue on me later. I’ve got something else in mind right now.</p><p>Something I’ve fantasized about doin’ for a long time. The old me was too polite to ask. The new me, well...he’s a bit more demandin’.”</p><p>“What do you want to do?”</p><p>He straddled her belly and slid his knees next to her armpits. “I wanna feel these tits cushioning my cock as I’m slidin’ it here.” The tip of his index finger drew a line from the hollow of her throat down through her cleavage.</p><p>Libby wasn’t gawking at him as if he were the biggest pervert on the planet, but frown lines appeared between her eyebrows, which meant she was thinking hard.</p><p>“Shocked?”</p><p>“No, just wondering if you thought I was so prissy that I wouldn’t want to try it.”</p><p>“Libby—”</p><p>“You brought it up, so answer the damn question.”</p><p>The old Quinn would’ve clammed up. The new Quinn got right in her face. “What would you have said, darlin’ wife, if I would’ve demanded to fuck these luscious tits? Not only that, I wanna come all over them. There’s something mighty appealin’ about seein’ my sperm dotted all over your pretty freckled skin.”</p><p>Her eyes narrowed. “So, you didn’t ask me because you were waiting to fulfill that particular fantasy with another woman?”</p><p>“Hell no.” Jesus. Was his even-keeled Libby acting all pissed off because he hadn’t asked her?</p><p>“I’m your wife, Quinn. I’ve been your lover for fourteen years. Why couldn’t you ask me or tell me what you want from me in bed?”</p><p>Frustrated, he snapped, “Because of the way I was raised. It ain’t exactly easy for me to look my wife in the eyes and demand the sexual stuff that’s out of the norm. Especially when we’ve been told that wantin’ that kind of kink is just plain wrong.”</p><p>What he didn’t say—what he’d never say because it’d hurt her beyond repair—is in the last few years, when they were trying for a baby, the only place she wanted his sperm was in her baby channel. She’d stopped giving him handjobs or blowjobs, unless it led to him sticking his dick in her and filling her with his seed.</p><p>Libby stared at him. A dozen different expressions crossed her face. None of them good.</p><p>Ah crap. Sexual playtime was obviously over. His cock had gone soft. His hopes had gone south. He scooted back, but she clamped her fingers into the top of his thighs, keeping him in place.</p><p>Quinn heard a muttered stupid tumbling from her pursed lips. “What?”</p><p>“I said we’ve both been so stupid. Full of pride. Listening to other people’s viewpoints, and not deciding our own.” Her grip on his legs turned into a caress. “I’ve been so insistent on being a ‘proper’</p><p>wife to you that I’ve actually not been any kind of wife at all, least of all the kind of wife you need.”</p><p>“Libby—”</p><p>“Hear me out. And you’re so worried I’m gonna think you’re a pervert that you’re afraid to ask me to take a walk on the wild side of sex with you.” Her gaze roamed his face. “Is that true?”</p><p>He nodded, half-worried, half-hopeful of where this conversation was headed.</p><p>“I don’t want it to be like that between us any more. No more tiptoeing around what we want because it might be considered dirty. I want sex to be fun and raunchy and spontaneous like it’s been today.”</p><p>“As long as we’re bein’ honest, I don’t always wanna be the one to get things goin’ in the bedroom.</p><p>It’d be good if you touched me without me havin’ to ask.”</p><p>Libby beamed a decidedly naughty smile. “Did you like me dragging you around the corner and demanding you get your rocks off on me?”</p><p>“Like you wouldn’t believe.”</p><p>“Then bring your cock closer so I can suck on it. Once that bad boy is hard, let’s see how it feels sliding between my tits.”</p><p>“Really?”</p><p>“Yes. I wanna fulfill your every fantasy, Quinn.”</p><p>“Goddamn. Hearin’ nasty talk comin’ from that sweet mouth is a fuckin’ turn on, Lib.”</p><p>She’d slid her hands up until they were curled around his ass. She urged him forward. “Gimme.”</p><p>Quinn leaned until he could grip the brass rails of the headboard. He kept enough space so he could look down and watch the show.</p><p>And what a show his sexy wife put on for him. His cock had already started to stir, but it was still soft enough she could get the whole thing in her mouth. The warmth and wetness of Libby’s mouth surrounding his dick...nothing like it in the world. Nothing. It was sheer heaven.</p><p>Libby’s little humming noises sent chills up his shaft and vibrating through his body. After teasing him to distraction, she released his erection. “It’s been a long time since I did that.”</p><p>“I missed it. You’re as good at it as you ever were.”</p><p>“I could get used to this sweet-talkin’ side of you, darlin’ husband.” Libby stretched her arms above her head, fully aware he was watching how her breasts swayed with the sensual movement. “Now what?</p><p>Do you wanna get right to it?”</p><p>“Probably be a good idea to use some lube.” Quinn reached toward the nightstand drawer where they stashed the K-Y, and Libby nearly knocked him off the bed when she scrambled upright.</p><p>“Whoa. Careful.”</p><p>“I’ll get it.”</p><p>“That’s okay. I can reach it.”</p><p>“Maybe we won’t need any.” She tugged him back on top of her. “Let’s just do it like this.”</p><p>His funny feeling intensified when he noticed the guilty expression his wife wore. “What’s goin’ on?”</p><p>“Don’t you wanna get started? Since this has been a longtime fantasy?”</p><p>“Yeah. But I want the K-Y.” He dodged her wandering hands and his fingers connected with the drawer handle.</p><p>“Quinn. Wait.”</p><p>Stay calm.</p><p>“What’s in the drawer, Libby?” He’d lose his fucking mind if he found an opened box of condoms.</p><p>Absolutely lose his fucking mind.</p><p>“I can explain.”</p><p>Keeping his eyes on his wife, Quinn jerked the drawer open.</p><p>She turned her head toward the opposite wall.</p><p>He inhaled deeply before he looked. He didn’t move for the longest time. “When did you buy this?”</p><p>“I didn’t. My sister did.”</p><p>“Jilly thought this might come in handy?”</p><p>“Yes.”</p><p>“Look at me.”</p><p>Libby raised her chin to the level he deemed stubborn. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Has it come in handy?”</p><p>No answer.</p><p>Rather than demand her response, Quinn picked it up and turned it on. A loud buzzing sound echoed in the room.</p> <p>Libby’s face was beet red.</p><p>“Tell me, have you used this vibrator?”</p><p>“Yes, damn you, I did, okay? I was curious and horny and I burned through an entire sixteen pack of batteries in the first week. Happy now?”</p><p>“Did it make you happy?” Quinn tossed the tube of K-Y on the bed and moved over her so they were face-to-face. “Is this piece of vibrating plastic better than the real thing?”</p><p>She shook her head. “It takes the edge off, but it’s...”</p> <p>“What?”</p><p>“Impersonal. Mechanical. Not you.” She gave him a considering look. “Are you mad?”</p><p>“Hell no.” The grin he’d been hiding bloomed. “I’d been tryin’ to figure out a way to bring up sex toys to spice up our sex life long before our...break. I’m happy to see you’re good with it.” Quinn lowered his head, reviving their desire with a steamy kiss.</p><p>“Mmm.” Libby whispered against his mouth, “You ready to fulfill your fantasy?”</p><p>Chapter Six</p><p>“Nope.” Quinn rolled her so she was on top.</p> <p>“What’re you doing?”</p><p>“I want you to ride me so I can test out your new toy.”</p><p>Libby blushed.</p><p>“You already know how much I love to see certain parts of you bouncin’.”</p><p>Her whole body seemed to flame with embarrassment.</p><p>He brushed his finger over the hot spot on her cheekbone. “Interestin’.”</p><p>“What?”</p><p>“I can still make you blush. I’ll probably try to turn your cheeks bright red when you’re an eighty-year-old lady.”</p> <p>“You think we’ll still be together?”</p><p>“Yep. I can’t imagine my life without you, Libby. These last few months have been pure hell.”</p><p>Even though Libby was buck-ass nekkid, she seized the opportunity to talk, since it appeared Quinn was in a rare mood to do just that. “It didn’t seem like you cared.”</p><p>“Jesus. No. I cared, I was just...” Quinn frowned and a minute or so passed before he spoke again. “I can see where you’d get that idea, bein’s I took off right after you kicked me out to help Ben and my cousins with calvin’.”</p><p>“I thought after you returned from living at Ben’s for three weeks you might’ve been ready to hash it out.”</p><p>Quinn’s eyes searched hers. “Wanna know the real truth?”</p><p>She nodded, even when her stomach pitched.</p><p>“I didn’t know what to say to you. I ain’t ever been good at sharin’ my feelings and shit. I thought if I ignored it, maybe it’d work itself out.” He scowled. “Stupid, huh?”</p><p>“Naïve, maybe. Our problems didn’t happen overnight.”</p><p>“Yeah, well, I guess those problems never seemed that bad to me.”</p><p>That comment floored her. “Are you serious?”</p><p>“It ain’t like one of us was cheatin’. Or one of us was drinkin’ too much. Or we were bein’ physically or verbally abusive. Or that we’d gotten in debt up to our eyeballs. Hell, I didn’t think much beyond that our problem was us just bein’ stuck in a rut.”</p><p>“How’d you figure we’d get out of that rut?”</p><p>He shrugged.</p><p>“Or were we just supposed to sit and spin our wheels?”</p><p>“Better that than burnin’ rubber tryin’ to get away.” He sighed. “I don’t wanna fight with you, Libby.”</p><p>“And I don’t wanna sweep this under the rug anymore, Quinn.”</p><p>He mumbled and looked away.</p><p>“What?”</p><p>“I said this is typical.”</p><p>“Typical?” She braced her hands on his chest and got in his face. “Explain that.”</p><p>His focus snapped back to her. “We’re nekkid. In bed. I had a fuckin’ hard-on to rival a fencepost, we were all set to have hot, fun, wild sex with toys, with extra lube and trying new positions...and now all you wanna do is talk, talk, talk.”</p><p>Stung, she retorted, “Yeah? You think ignoring the important stuff and having wild, kinky sex is gonna fix it?”</p><p>“It sure as hell can’t hurt, and at least we’d be havin’ sex for once.”</p><p>“For once?”</p><p>“Christ. You ain’t gonna deny that in the last year, even before you demanded a separation, we weren’t havin’ sex on a regular basis.”</p><p>“Sex on a regular basis?” she repeated inanely. “That’s what’s so all-fired important to you?”</p><p>“Sex is a big part of the important stuff we need to discuss. At least it is to me. You’re all for talkin’</p><p>about what’s bothering you, and yet, whenever I tried to bring up what’s bothering me, you changed the damn subject.”</p><p>When she froze in shock, he moved her off his body.</p><p>“That’s not fair. My unwillingness to talk about sex was in the past.”</p><p>“You’re right. Forget it.” He rolled sideways and perched on the edge of the bed with his back to her.</p><p>What’d just happened? Everything had been going so well. “Quinn?”</p><p>No answer.</p><p>Libby forged ahead anyway. “What makes you think that sex isn’t important to me?”</p><p>“For the last several years sex is important to you as long as you’re gettin’ what you want out of it, and out of me.”</p><p>“Which is what?”</p><p>“A baby.” He stood. Without looking at her, he said, “I need to check cattle,” and booked it out of the room, apparently not caring that he was completely naked.</p><p>Stunned, and a little heartsick, Libby slipped on her robe. She went to the window and opened the blinds.</p><p>A few minutes later, a bare-chested Quinn exited the house and plopped on the porch steps. He yanked his old boots over his gray sweatpants in angry, jerky movements. He stalked to the truck, grabbed his T-shirt from inside the cab and pulled it on over his head. Then he slapped on his ball cap, climbed in and roared off.</p><p>Needing something to do besides pace, or wait to see if Quinn returned to the house, or if he preferred the cramped horse trailer to her lousy company, Libby went downstairs.</p><p>Darkness enveloped the big, bold Wyoming sky by the time Libby heard the porch screen slam. The table was set and ready, but supper had gone cold. Would Quinn fight with her? Or pull that silent macho crap and ignore her? At this point she didn’t know which she’d prefer.</p><p>Wrong. She wanted his fire. His anger. His honest reaction. Because his words spurred her to take a longer, deeper look at her actions and inactions over the last few years and she hadn’t liked what she’d seen.</p><p>Consequently, she’d been staring out the kitchen window, nursing a glass of whiskey for the better part of an hour. She didn’t turn around when he entered the kitchen.</p><p>The silence between them was absolute.</p><p>Who would be the first to break it?</p><p>Quinn said, “I’m—” at the same time she said, “I didn’t—”</p><p>They both laughed, but it was forced laughter.</p><p>Quinn approached her. Her heart sped up.</p><p>Slipping his arms around her waist, he rubbed his face in her hair. “Sorry.”</p><p>“I’m sorry too.”</p><p>“We probably oughta talk about it, huh?”</p><p>“Or we could just get drunk.”</p><p>He chuckled. “There is that option. Might be less painful initially, but guaranteed we’d pay for it in the mornin’.”</p><p>“True.”</p><p>“Where do we start?”</p><p>“Where we left off.” Libby drained the last of her whiskey. “Where the problems began. Jilly warned me about bringing up the baby issue, or lack thereof.”</p><p>“Jilly? What’s she have to do with it?”</p><p>“She called and offered me some free advice.”</p><p>“Then take it for what it’s worth. Nuthin’. Besides, I’m the one who brought it up. And not in a nice way neither.”</p><p>“I don’t think there is a nice way to tell me that I seriously screwed up everything with my quest for a baby.”</p><p>“Libby—”</p><p>“Just let me get this out, okay?” Would this confession be easier if she wasn’t looking into his all-knowing eyes? Probably not.</p><p>“I’m not gonna pretend that I was aware that I was driving you away when I became obsessed with getting pregnant. After you stormed away a couple hours ago, it was like a light bulb went off in my head and I saw everything in a whole different light. I didn’t like what I saw.</p><p>“It was all about me. My body. What I wanted. What I needed.” Tears gathered in her eyes when she considered how selfish she’d been. How much she’d hurt him and without knowing it.</p><p>“And?” he prompted.</p><p>Suck it up. You made the bed, you can lie in it.</p><p>“And the truth is you were one hundred percent right when you said I cared only about your sperm, not about sex. Making love with you or to you didn’t cross my mind if it didn’t have...purpose. Sad to admit that mindset would’ve stayed even if I had gotten pregnant, because I would’ve focused all my attention on the baby. You suffered either way. God, Quinn, what kind of horrible, self-centered wife does that make me? And yet, I justified my attitude because I blamed you for not being interested in whether we got pregnant or not.”</p><p>“I just didn’t see the big rush, Libby. It wasn’t like we were too old then or even now. It’s just...well...”</p><p>“What?”</p><p>“Part of me wondered if you were in some sort of competition with your sister. She popped out four babies with no trouble. Then every time she came over with the kids, it was like she was rubbing them in your face. Jilly always was hinting around maybe one or both of us had problems with our, um, plumbing, so to speak.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>How much weight had Libby given to Jilly’s suggestions regarding fertility issues? A lot. After all, with four pregnancies under her belt, Jilly was an expert. She just wanted to help. Why had Libby confided her fears to her sister instead of her husband? God. She’d been such an idiot on so many levels.</p><p>“Libby?”</p><p>She couldn’t face him when she blurted, “I spent years feeling like a failure as a woman because I couldn’t pop out a little McKay.”</p> <p>“It ain’t like the McKay name is gonna die out with the way my cousins are reproducing like rabbits.”</p><p>“True. But I was constantly fielding questions from relatives about when you and I were going to start a family since we’ve been married a while. If I hedged, then they asked if we were having marriage problems or reproductive issues. It was a stick poking an open wound you didn’t even know I had.”</p><p>Libby felt him wince.</p><p>“I’m so damn sorry. To be honest, it hurt that you wanted a kid more than you wanted me. Part of the reason I refused the fertility tests was I was afraid you’d leave me if I was the reason you weren’t pregnant.</p><p>Sounds selfish, don’t it?”</p> <p>No more selfish than what she’d done.</p><p>He sighed. “Jesus, Libby. I’m such a prick. Not talkin’ to you. Lettin’ you think the worst of yourself, makin’ you handle all that family shit alone, when I didn’t know the half of it. No wonder you booted my ass.”</p><p>The resentment she should’ve felt was strangely absent. It felt good—freeing—to be brutally honest, to air all their dirty laundry. They had nothing else to lose, because they were damn close to losing it all.</p><p>“Look. We both were wrong. We both made mistakes. We both closed down and dealt with our issues separately, rather than together. We didn’t have fidelity, financial or substance abuse issues, but our issues were big enough to cause a rift in our marriage.”</p><p>Quinn didn’t say anything, which wasn’t surprising. He’d said more than she’d expected.</p><p>Still, she’d been carrying the burden for quite some time, so she might as well get it all off her chest.</p> <p>“When I realized I probably wouldn’t ever get pregnant, I created a new me—Libby McKay 2.0. I fixed up the house, jazzed up the meals, pursued new interests and stopped thinking about babies entirely. I thought if I wasn’t a frumpy, chubby, boring ranch wife, you’d want me again.”</p><p>Quinn spun her around so fast spots danced in front of her eyes. “Want you again? I’ve always wanted you. Jesus. You think that’s how I see you? Frumpy? Chubby? Boring?” He shook her slightly. “Dammit. I see you, Libby, not a fuckin’ brood mare! You are the smart, funny, sexy, hard-workin’ girl that knocked me for a loop when I was a dumb kid of sixteen. A woman I’ve always known is too good for the likes of me. A woman I pledged my life, heart and soul to. A woman I love with every goddamn bone and breath in my body. What don’t you understand about that?”</p><p>“Quinn—”</p><p>“Just shut up. We’re done talkin’.” His mouth crashed down on hers and he kissed the living daylights out of her.</p><p>Arms, legs, hands, fingers clashed and collided as they tried to touch each other everywhere, all at once. The wet, hot kiss overwhelmed her until she could only cling to him and experience the spectacle of her calm, cool and collected husband totally out of control.</p><p>Quinn ripped his lips from hers. “Now. Goddammit. I need to prove...to show you how much I—”</p><p>“It’s okay.”</p><p>“I want you right now.”</p> <p>“Where?”</p><p>“Table.” He untied the belt on her robe, pushed it to the floor and groaned satisfaction she was still naked.</p><p>“But the dishes—”</p><p>“Fuck the dishes.” Quinn turned, jerked the corners of the tablecloth until all the plates and silverware crashed together and rolled to the opposite end of the table. “Problem solved.”</p><p>Libby grabbed his face in her hands and kissed him, needing that connection as he lifted her on the kitchen table.</p><p>The woman absolutely pushed his limits of restraint today...and he’d never been happier in his frustration.</p><p>Quinn needed to get inside her. Now now now pounded in cadence with the blood throbbing in his cock.</p><p>Libby twisted her hand in his T-shirt, stopping him. “This gone. I wanna feel your skin on mine.”</p><p>Yank. Off it went. He latched onto her hips and pulled until her legs hung off the table. He jerked his sweatpants to the tops of his boots and his cock went sproing like it was spring-loaded. He circled the opening to her pussy once and plunged inside to the root.</p><p>She hissed. Her upper body bowed up and she slid up half a foot from the force of his thrusts.</p><p>He scooted her back down. “Grab onto the edge. Hands above your head. Like that. Oh hell, yeah, exactly like that.”</p><p>“You’re watching my tits bounce, aren’t you?”</p><p>Quinn laughed and drove into her hard. “Uh-huh. Goddamn that’s sexy.”</p><p>“Just as long as you aren’t so busy watching you forget what you’re supposed to be doing.”</p><p>“And what is that, darlin’ wife?”</p><p>“Fucking me until I scream.”</p><p>The noise leaving his throat was half-grunt, half-snarl and all possessive male. He obliged her with thrusts that rocked the table and his legs quaked from the strain.</p><p>“Yes. Don’t stop.”</p><p>He gave her everything he had. A heart-thumping, sweat-inducing, hip-pounding, teeth-grinding, primal mating. As he anchored her hips, his avid gaze moved from the steady bounce of her breasts to where they were joined. It was hot as sin to see the wet proof of her excitement coating his dick as he pulled out, then feeling the tight clasp as he slammed home. Again and again and again. Every thrust seemed to bring him deeper into her.</p><p>When he noticed Libby biting her lip, he leaned over her. “You okay? Too much?”</p><p>“No.” She arched into him. “Your chest hair on my nipples drives me crazy. And God, you’re hitting the exact spot pressed against me like that.”</p><p>“Like this?”</p><p>“Yes.”</p><p>“Harder?”</p><p>“No.”</p><p>“Faster?”</p><p>“Yeah.”</p><p>Quinn clasped their hands together so they were matched palm to palm. “Fly apart for me.” He added a little grind at the end of his upstroke and she gasped.</p><p>“Good?”</p><p>“Uh-huh, more— yes! ”</p><p>His hips began to piston, each stroke brought forth more sweat and more labored breaths and a more desperate race to the finish. When Libby squeezed his hands and cried out, Quinn felt that deep, rhythmic pulsing of her body sucking at his cock like a separate mouth.</p><p>Closing his eyes, he let himself fall into the moment. As his cock emptied, he was reminded how perfect it felt being with Libby, naked in body and soul. Quinn buried his face in her neck and clutched her tightly, silently swearing to never let her get so far out of his reach again. “God, I love you. Don’t ever leave me...I can’t...”</p><p>“Ssh. I know. It’s okay. I’m here. We’re both here.”</p><p>After they’d leveled their breathing and their heart rates returned to normal, she shuddered beneath him. He raised his head to peer into her eyes. “Cold?”</p><p>“With two hundred pounds of hot rancher on top of me? Hardly.”</p><p>“Am I too heavy?”</p><p>Libby shook her head.</p><p>He kissed each nipple and pushed upright. Studying her face for signs of pain, he slowly pulled out.</p><p>“Sore?”</p><p>“No. And even if I was, I wouldn’t mind. Because you just fulfilled one of my fantasies.”</p><p>“Really? On the kitchen table?”</p><p>“Mmm-hmm.”</p><p>“Well, hot damn.” After Quinn tugged his sweatpants in place, he helped her sit up and noticed her eyes darted to the pile of dishes beneath the rumpled tablecloth. “Sorry I ruined supper.”</p><p>“Don’t be. Being with you, having you look at me like that...”</p><p>“Like what?”</p><p>“Like you used to. Like I was everything.”</p><p>Quinn rested his forehead to hers. “You are everything to me. You always have been. I’m sorry it got to the point where you ever doubted that.”</p><p>“Me too.”</p><p>The moment, while brief, seemed to reinforce a connection between them Quinn hadn’t realized was broken.</p><p>Libby’s stomach rumbled.</p><p>“Since I wrecked supper, and you’re clearly starving, can I take you out?”</p><p>“Good Lord, I’m a mess. By the time I get myself cleaned up, every place within thirty miles will be closed.”</p><p>“You do look kinda mussed. But it’s a well-fucked, well-kissed kinda mussed.”</p><p>“Quinn McKay!”</p><p>He loved that indignant tone, mostly because it was all for show. “Tell you what. Let’s go to the Tasty Treat Drive-in. We don’t have to get out. I can sneak a couple kisses between feeding you curly fries. Like we used to.” He nibbled on her lips. “And we might finally christen the damn truck after six years.”</p><p>Libby leaned back. “We’ve had sex in your truck.”</p><p>“No, we haven’t.”</p><p>“Yes, we have.”</p><p>“When?”</p><p>She appeared to be thinking. “Shoot. I thought after some big McKay bash you and I...” Libby looked him expectantly.</p><p>“We did. But that was my old red Dodge years ago, not this one.”</p><p>“Huh.”</p><p>“What?”</p><p>“Just remembering the first time we had sex in your pickup.”</p><p>He cringed. “I’m surprised you ever had sex with me again.”</p><p>“It wasn’t that horrible.”</p><p>“Well, it sure as hell wasn’t romantic. Woulda been better if we’d waited and done it in my bed rather than on a pickup bench seat in the middle of a damn pasture. You deserved better.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I didn’t care. I just wanted to be with you.” A wistful look crossed her face. “Sometimes I think we’ve come so far...and then I look at you and still feel like that unsure sixteen-year-old girl.”</p><p>That jarred him. “Unsure about me?”</p><p>“No, unsure on why you picked me.”</p> <p>“Why?”</p><p>“The McKay boys’ reputation for preferring wild girls. I’ve never been wild.”</p><p>“I ain’t ever been like my cousins when it comes to skirt chasin’. Didn’t interest me.” He allowed a small grin. “On the other hand, I’m likin’ that you’re finally gettin’ wild with me.”</p><p>“But, you could’ve had any girl.”</p><p>“Don’t matter. I didn’t want any other girl besides you, Libby. Then or now.”</p> <p>Libby’s gaze roamed his face. “What are we doing?”</p><p>Quinn knew she wasn’t referring to their supper plans. A temporary break from the issues would do them both good, so he deliberately misunderstood her. “Soon as you slip on some clothes, we’re headed to the Tasty Treat.”</p><p>Her mouth opened. Closed.</p><p>“Come on, it’ll be fun.”</p><p>“Fine.” She hopped off the table. “But I’m not sharing my chocolate malt with you.”</p><p>Chapter Seven</p> <p>“Wanna another bite?”</p><p>“No. I’m stuffed. I shouldn’t have eaten all those mozzarella sticks.”</p><p>“It’s good to indulge once in a while.”</p><p>Libby stirred the dregs of her shake. “I worked damn hard to lose weight. Overindulgence will pack those pounds right back on.”</p><p>“If I haven’t said so, you look good. Real good. Damn good.”</p><p>She snorted. “You weren’t very complimentary when I asked you that same question three months ago.”</p><p>“You can apply my earlier ‘I was a prick’ comment to that response too.”</p><p>“So why did you say that?”</p> <p>Quinn sighed. “I thought you were fancyin’ yourself up because you were fixin’ to dump me.”</p><p>Her hand froze on the straw. “And then I—”</p><p>“Told me you wanted a trial separation.”</p><p>“Oh Quinn, oh damn. That’s not why I...” Good Lord. With all the mixed signals they’d been sending each other it was a miracle they’d managed to stay married as long as they had.</p><p>When he didn’t add anything else, Libby shoved the empty cup on the dash and scooted closer. “I’m sorry.”</p><p>“I get that now. It’s over and done with.” Quinn slapped his thighs. “Climb on over here and sit on my lap.”</p><p>“We gonna kiss and make up?”</p><p>“Maybe. Or maybe I just wanna cop a feel in the truck.”</p><p>“I guess we’ll see if you get to second base, buddy.”</p><p>“I’m hopin’ for a grand slam.” Grinning, he adjusted the seat.</p><p>Libby balanced on one knee and swung the other over his left leg, placing her hands on his shoulders as she lowered onto his lap. Then she took his hat off.</p><p>Quinn flexed those scarred, callused hands she loved so much across her upper back and slowly pulled her toward him.</p><p>Eyes locked, bodies pressed together, each inch they moved closer built anticipation higher. Heated breath mingled, lips softened, hearts raced.</p><p>A whisper apart, Quinn cocked his head and let his mouth sink into hers. He teased, tempted, nibbled, drawing out the kiss until Libby shook with need.</p><p>The moment was as erotic as it was familiar.</p><p>She allowed her hand to wander over his jaw, cheeks, temple and forehead. She raked her fingers through his hair. Gently biting at his mouth, dipping her tongue between his parted lips and slicking it across his teeth. When he opened wider, she dove in, offering him the same reckless passion he’d shown her.</p><p>A satisfied groan rumbled from Quinn’s throat.</p><p>Giddy, feeling freer than she had in ages, she touched, stroked and rubbed against her husband until they were both panting. Frantic. Aroused.</p><p>Three raps on the passenger side jolted them out of the moment and the crotch-grinding kiss. They squinted at the interloper through the steamed-up windows.</p><p>Vaudette Dickens. President of the Presbyterian Ladies Guild, neighbor to the Charles McKay family for years...and Quinn’s mother’s best friend.</p><p>Quinn swore under his breath.</p><p>Libby began to slide back, but Quinn stopped her retreat with a terse, “Stay put.”</p><p>He offered Vaudette a smile and leaned sideways to roll down the window. “Miz Dickens. I’m surprised to see you.”</p><p>“I’ll just bet you are, Quinn McKay.” Her eyes narrowed behind thick-lensed glasses. “Who’s that with you? Libby?”</p><p>Libby wanted to snap, “Who else were you expecting?” but she managed a civilized, “Yes, it’s me, Miz Dickens.”</p><p>“Goodness. I thought you two were separated.”</p><p>“We are. Were. Anyway, we’re workin’ it out,” Quinn said.</p><p>“That’s wonderful. Does your mother know?”</p><p>“Ah. No, ma’am.”</p><p>“Honey, with the way you two are carrying on, by tomorrow morning everyone will know you were fogging up your truck windows at the Tasty Treat.”</p><p>Mostly courtesy of Vaudette’s lips, Libby thought.</p><p>“And your point is?” Quinn drawled.</p><p>Vaudette’s shoulders snapped straight. “I was looking out for your best interests. I popped over here because I was certain some wild teenagers were out joy riding in your truck and I wanted to give them what-for before I called the sheriff.”</p><p>“Now why on earth would you think something like that?”</p><p>She motioned to Libby still perched on Quinn’s lap. “Because I expected such behavior from hormonal teenagers, not from a longtime married couple. Goodness, aren’t you two a little old to be necking in the Tasty Treat parking lot at ten o’clock on a Saturday night?”</p><p>Quinn smirked at Libby. He smoothed a piece of hair behind her ear. “God, I hope not. A man’s entitled to kiss his wife, whenever and wherever he pleases.”</p><p>Libby bit her lip to keep from laughing at Quinn’s double meaning.</p><p>Vaudette let out a gasp that managed to be both indignant and chiding.</p><p>“But we appreciate your concern, Miz Dickens. And you’re right. I reckon we oughta take this someplace more private.” He looked at Vaudette and winked. “Tell my mother I said hello,” and he cranked up the window.</p><p>Libby lost it. She buried her face in Quinn’s neck to muffle her laughter.</p><p>“Damn busybody.”</p><p>She lifted her head. “The gossip won’t bother you?”</p><p>“Let ’em gossip. I could give a damn.” He frowned. “This ain’t gonna affect your job at the library, is it?”</p><p>“Kissing my husband in public is hardly a firing offense.” She brushed her lips over his. “But fucking my husband in public is a different story.”</p><p>“You wanna fuck me?”</p><p>“Uh-huh. You got me all hot and bothered. I’m thinking about the positions we didn’t try today because we were too busy talking.” Libby traced the inside of his ear with her tongue and gently blew across it. “I don’t wanna talk anymore.”</p><p>He started the truck with her still on his lap.</p><p>“Quinn! You can’t drive like this.”</p><p>“Like what? Bein’ horny as hell with a hot woman bouncin’ on my pole as we hit every damn pothole on Main Street?” He grinned. “Sounds good to me.”</p><p>She whapped him on the chest before returning to the passenger side.</p><p>He wiggled his hat back on his head and threw the gearshift in reverse.</p><p>When they hit the outskirts of town, Libby casually asked, “So, since you didn’t get to fulfill your fantasy earlier today, do you have any others you wanna share with me?”</p><p>Quinn shot her a sideways glance. “What’s good for the goose is good for the gander.”</p><p>“I’ve got no problem sharing a fantasy, but you go first.”</p><p>“Okay.” He shifted in the seat. “I wanna fuck you while you’re wearin’ nuthin’ but them tight, black suede chaps with the long fringe runnin’ down the sides.”</p><p>“That’s it?”</p><p>“I’m a simple man. Your turn.”</p><p>Libby wondered how he’d react to her fantasy. Would he get angry? Go along with it? Think it was weird? Or stupid?</p><p>“Lib?” he prompted. “No more secrets, remember?”</p><p>She blurted, “Let’s pretend we’re strangers. You picked me up in a bar after we slow danced and shared a couple of smokin’ kisses. You’re taking me back to your place to have your wicked way with me.”</p><p>“You wanna do this now? Tonight?”</p><p>“Yeah. And when we get home—I mean there—I wanna spend the night in the horse trailer.”</p><p>“Deal. But if we were strangers and so hot to have each other, I bet you’d be sittin’ closer to me.”</p><p>Relieved at his willingness to play along, she slid next to him. She flipped the radio on low and Dwight Yoakam crooned a mournful song about love gone wrong. Quinn wrapped his arm around her shoulder and lazily rubbed her bicep.</p><p>Libby stroked the corded muscle of his thigh beneath his soft sweatpants. With every sweeping pass her fingers drifted higher, lingered longer. She’d forgotten how much she loved touching him and hearing the soft catch of his breath whenever she did something he liked.</p><p>She glanced at him. Quinn’s knuckles on the steering wheel shone white in the dashboard lights.</p><p>Talk about tense. What could she do to relax him?</p><p>A naughty idea popped up. Smiling, she hid her face in his neck. “Mmm. You smell good.”</p><p>His answer was a low groan.</p><p>Encouraged, Libby continued nuzzling his throat, letting her fingers wander until they reached the swelling between his thighs. She traced the length of his erection. The only barrier between his cock and her hand was a thin piece of fleece. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Dragging openmouthed kisses to his ear, she whispered, “Help me slide these down so I can touch you bare.”</p><p>Immediately, Quinn gripped the back of the seat with his right hand and lifted his hips.</p><p>Libby hooked her fingers in the waistband and pulled the sweatpants down to his knees. She curled her hand around the girth of his cock and squeezed.</p> <p>He hissed. Loudly.</p><p>Hmmm. What other noises could she elicit from her normally silent cowboy?</p><p>Still kissing his neck, she played with his cock. Feathering touches from tip to root, circling her thumb through the pre-come to tease the sweet spot below the head.</p><p>After giving his jawline one last nip, she lowered her face into his lap and replaced her hand with her mouth.</p><p>“Sweet Jesus, woman, what are you doin’?”</p> <p>Libby scooted back slightly for a better angle and cranked her head around. “If you don’t know I must be doing it wrong. You want me to stop?”</p><p>“No!”</p><p>“Thought you might say that.”</p><p>“It’s just, I never thought you’d...” He looked down at her. “You’re a wild one, eh?”</p><p>“Yep.” When Quinn kept staring at her, she reminded him, “Eyes on the road, buddy.”</p><p>“Ah, shit. Sorry.”</p> <p>She worked him over. Licking the head with little whips of her tongue, then pulling him into her mouth an inch at a time until her lips were against the base. She breathed through her nose, filling her lungs with the musky scent that was uniquely Quinn. Then Libby released all that male hardness, loving the sleek feel of his tight skin moving backward across her tongue.</p><p>A muttering curse sounded above her, but she paid no attention. She kept the deep-throating rhythm, letting her saliva coat the shaft. The darkness, the heat rolling from his body, the constant wet glide of her mouth on his rock-hard cock, soaked her panties to the point she knew Quinn smelled her arousal.</p><p>She loved this. His sense of surprise. The confidence she could please him. But mostly she reveled in the knowledge that passion this intense still existed between them.</p><p>Quinn’s hand had somehow landed on her head. His hips were bumping up, a signal he was close to blowing.</p><p>Libby switched to shallow strokes. Lightly holding his dick at the root, her hand moved up to meet her mouth moving down. She applied more suction to the head.</p><p>“Goddamn, that feels so fuckin’ good.”</p><p>She hummed around his cock as her head bobbed faster.</p><p>“Oh hell yeah, baby, almost there.”</p> <p>Sexual power raced through her. Libby wanted his climax. She wanted to taste it, to bathe in it, to glory in it, because goddammit, she’d earned it.</p><p>“Uh. Fuck. There it is.” Quinn groaned, his fingers increasing the grip on her hair.</p><p>His cock throbbed against her tongue with each hot spurt. She swallowed, keeping her lips wrapped tightly around the head until the very last pulse.</p><p>He sighed. His body went slack against the seat. After a bit, he said, “That was amazin’. ’Cept, I almost wrecked the truck. Twice.”</p><p>Flush with success of pleasing her man, she gave his cock one last kiss and lifted her head. She gazed out the window and noticed they were about a mile from the turnoff home.</p><p>Quinn reached for her hand. He opened his mouth. Snapped it shut. Apparently he was too stunned to talk.</p><p>Good. That was the type of silence she preferred from him.</p><p>They parked alongside the horse trailer. In the darkened truck, Quinn stayed still. Libby wanted to crawl out of her skin at the renewed tension.</p><p>“I want you like crazy.”</p><p>A shiver raced up her spine at his husky tone.</p><p>“But I want you on my terms. So if you get outta this truck and follow me into that trailer, we’re gonna do things my way. Everything. No arguin’. If you wanna back out, say so now.”</p><p>Practical Libby would demand to know the parameters. But tonight, she wasn’t Libby. She was a temptress who’d given a stranger a blowjob in his pickup. Plus, she was damn curious to know what Quinn meant by his “terms”.</p><p>“I put myself in your capable hands.”</p><p>The wicked smile that’d charmed her since high school lit up Quinn’s face. He opened the glove box and snagged a folded red bandana.</p><p>“What’re you using that for?”</p><p>“A blindfold.”</p><p>“Turn toward the window. Might feel a slight pinch.” He knotted the material at the back of her head.</p><p>“There. Can you see?”</p><p>“Not at all.”</p><p>“I’ll come around and help you out.” Quinn aimed to keep her off balance, so he didn’t kiss her, talk to her, as he piloted her into the trailer.</p><p>Once they were inside, he plastered his body to hers so completely that a single grain of wheat wouldn’t have fit between them. His kiss was a flat-out, I-love-you, I-need-you, I’m-gonna-fuck-your-brains-out mark of passion and possession.</p><p>Her whimper was his sign to move to the next stage. While unbuttoning her blouse, he spoke just below her ear. “Kick off them shoes, ditch the britches. I want you naked.”</p><p>She stripped in record time.</p><p>“You’re gettin’ good at that.” Quinn balled her clothes up and whipped them in the corner. He let his hands meander down her neck, across her collarbones, over those incredible breasts and sweetly rounded belly to her curvaceous hips. She looked damn fine. Felt damn fine too.</p><p>Gooseflesh broke out across Libby’s skin.</p><p>He stroked the area between her hipbones. A leisurely caress of his rough flesh against the suppleness of hers. Gradually, he allowed his fingertips to brush the hair covering her mound. He trailed nibbling kisses from the bottom of her earlobe to her shoulder as his fingers traced her cleft. “You taste so sweet here. And I’ve got a hankerin’ to feel nuthin’ but your velvety-soft, bare skin against my mouth.”</p><p>“What are you talking about?”</p><p>“I’m gonna shave you. Every bit of hair gone so you’re smooth as a ripe peach.”</p><p>“Oh my.” She swallowed hard. “But, I-I—”</p><p>“You were the adventurous type in the truck. I’ll be extra careful.”</p><p>“You promise?”</p><p>“I swear.”</p><p>“Then okay.”</p><p>Quinn unfolded a chair and situated Libby with a pillow behind her upper back, close enough to the small table and counter that she could hold on. “Be right back.”</p><p>In the small bathroom, he soaked two washcloths in hot water and grabbed a new razor. Shame he didn’t have an old-fashioned barber’s kit with a lathering brush. The tickle of the bristles on her naked sex would heighten her senses. With shaving cream, razor and towels in hand, he returned to his naked wife.</p><p>She hadn’t budged.</p><p>“Don’t jump, this is just a hot towel.” Quinn laid the steaming cloth across her mound. He filled a plastic bowl with warm water and dropped to his knees.</p><p>“Spread your legs more. Scoot down. That’s it. You comfortable?”</p><p>“As comfortable as I can be, naked, blindfolded, with my privates flapping in the breeze and a man wielding a razor staring at me.”</p><p>Quinn laughed and slathered on shaving cream. “Don’t look that way to me. You look sexy as all get out.” He held the razor aloft and said, “Ready?”</p><p>“I guess.”</p><p>“Don’t flinch.” He made the first pass of the razor down the outside of the left side of her sex. A quick rinse and he shaved the next section.</p><p>“That tickles.”</p><p>He glanced up at her. “Is it makin’ you hot?”</p><p>“I was already hot from what happened in the truck.”</p><p>“You liked havin’ my cock in your mouth?”</p><p>Libby blushed. “Yeah. I liked surprising you.”</p><p>“That you did.” Quinn swished the razor and bent closer. “You also fulfilled another one of my longtime fantasies.”</p><p>“Really?”</p><p>“Yep.”</p><p>“Why didn’t you tell me?”</p><p>“Thought we was only sharin’ one.”</p><p>“No. I mean, why didn’t you tell me that was your fantasy before tonight?”</p><p>“If I woulda said, ‘Libby, I want you to suck me off some night while we’re zipping down the road in my truck’ you’d have said yes?”</p><p>“Maybe. You never know unless you ask. Hey, we’re not supposed to be using names. We’re strangers, remember?”</p><p>“My mistake. Hang tight, I wanna wipe you down before I get to the delicate parts.”</p><p>“I’m actually really glad I’m blindfolded.”</p><p>Quinn smiled. “I am too, because I’m drooling like a fool, seein’ all this pretty pink flesh that’s gonna be mine for the takin’.”</p><p>They didn’t say anything for a while. Quinn wanted to be done so he could bury his face in her. So he could lick and lap at the cream he saw welling in the opening to her sex, but he forced himself to stay slow and steady.</p><p>She said, “I can feel your breath on my delicate parts.”</p><p>“Pretty soon it’s gonna be my tongue on those parts. All of ’em.”</p><p>“I like it when you talk dirty.”</p><p>“Then I’ll make sure to whisper naughty sweet-nuthin’s in your ear as I’m fuckin’ you. Almost done.</p><p>Scoot down a little more and tilt your hips so I can see your ass crack.”</p><p>A tiny gasp. “You aren’t going to shave me...there?”</p><p>“Sure am. You get the whole treatment.”</p><p>“Lucky me.”</p><p>“Indeed, ’cause darlin’, you ain’t seen nuthin’ yet.”</p><p>“And yet, you’ve seen everything,” she muttered.</p><p>“What I’m seein’ is makin’ my mouth water and my dick hard.”</p><p>He rinsed the washcloth and cleaned her until not a bit of hair or shaving cream remained. After the last swipe, he washed his hands and dumped everything in the sink.</p><p>Quinn crouched in front of her. He rubbed his cheek over the top of her cleft, losing himself in her softness and warmth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Libby made a surprised noise.</p><p>“Do you like that?”</p><p>“Yes. It feels...Bare. Super-sensitive. Put your mouth on me. All over me. God. Everywhere. Like you promised.”</p> <p>“I ain’t lettin’ you outta my bed until mornin’. We clear on that?”</p><p>“Uh-huh.”</p><p>He helped her to her feet and they shuffled to the single bed inset into the wall. “Step up.”</p><p>She stretched out flat on her back. Quinn ditched his clothes and turned off the lights before climbing in.</p><p>After giving her a quick peck on the mouth, he kissed straight down her torso. Quinn used the tip of his tongue to trace her silky smooth pussy lips. He burrowed his tongue inside that hot, clenching channel then retreated to lick every hairless inch of her pussy. Damn. He could stay there for hours, coaxing the sticky sweetness from her body and gorging himself on her juices. On just her. His lover. His best friend.</p> <p>His wife. His everything. Not a stranger, his Libby.</p><p>“That feels so... Oh, don’t stop.”</p><p>He used his thumbs to hold her open as he focused on her clit. His tongue strokes were fast, relentless and accurate.</p><p>She gasped, “Yes!” and held his head in place as she orgasmed against his mouth, making those sexy little squeaking moans that ratcheted his lust to a whole new level.</p><p>Soon as Libby settled down, he growled, “Again. Come for me like that again.”</p><p>“I can’t.”</p> <p>“Wrong. And this time, you’re gonna scream.”</p><p>A sense of sexual power consumed Quinn, as she did just that.</p><p>As Libby was coming down from another climax, he untied the blindfold and flipped her on her belly.</p><p>“My turn. Get up on your hands and knees.”</p><p>Quinn followed the arc of her spine with his tongue from her nape to her tailbone. He parted those sweet cheeks and kept going down the downy crack of her ass. His wandering tongue met the bud of her anus and he painted it with wet swirls.</p><p>“Oh. My. God.” Her whole body shook.</p><p>He’d never done that before, but damn if she didn’t like it. So he did it again. He ventured past merely licking the sweet rosette and wiggled his tongue inside the pucker.</p><p>Goddamn, he wanted in there, the one place she’d balked at allowing him access. No more. He’d marked her everywhere else; he’d mark her there too. He’d fuck that virgin channel with his fingers, his tongue and his cock.</p> <p>Keeping his finger pressed to that tight hole, Quinn warned, “I’m gonna take you here, darlin’ wife.</p><p>Not tonight, but soon. You want that, don’t you. Wanna experience my cock slidin’ into your ass.”</p><p>Libby just moaned.</p><p>“Right now I’m gonna fuck you like this.” He yanked her hips back and impaled her.</p><p>Jesus. She was so wet and hot and making such sexy sounds, greedily pushing her body back into his.</p><p>He gritted his teeth and attempted some semblance of control.</p><p>“Quinn, don’t you dare hold back. You’re not gonna break me. More. Harder.”</p><p>Her plea cut his last thread of restraint. Quinn fucked her without pause. Fucked her through another orgasm. Fucked her hard enough that she’d have bruises on her backside from the grip he maintained to keep her from skidding across the sheets. The sheer force of his thrusts set his knees on fire.</p><p>And he didn’t stop. He couldn’t stop.</p><p>Sweating, shaking, Quinn was helpless in the haze of passion, indebted to the woman who gave herself over to him so freely, the woman who still had the power—and the desire—to rock his world.</p><p>When Libby looked at him over her shoulder and said, “Baby, let go,” he did, saying her name as a benediction as he came until his balls were empty.</p><p>She collapsed face-first on the bed, dislodging his cock.</p><p>Quinn’s dizziness subsided after he braced his hand on the wall and took several deep breaths. He lowered himself next to her.</p><p>Libby turned her head and blinked at him.</p><p>No smile. No flip remark. Maybe he had been too rough with her. He smoothed his hand down her damp, naked back. “What?”</p><p>“I can’t be what you need if you don’t let me see all sides of you.”</p><p>“Libby—”</p><p>“You know what scares me?”</p><p>Being married to a man who fucked you until your elbows and knees were raw with sheet burns?</p><p>“What?”</p><p>“That after this weekend we’ll revert to the way it was between us before.”</p><p>“It won’t—I won’t. We won’t. But havin’ wild sex a coupla times a day ain’t gonna be the norm for us either.”</p><p>“I know.” Her eyes searched his. “Do you think we’ve accomplished anything besides proving that sex between us can be fantastic?”</p><p>“We’ve talked more in the last twenty-four hours than we have in the last twenty-four months. Is every little thing ironed out? No. But I reckon there’s lots of stuff we ain’t gonna see eye-to-eye on, even if we talk about it for the next fifty years. As long as we have open discussions, no accusations, no holdin’</p><p>back, no ignorin’ the problem, then I think we’ll be okay.”</p><p>“Just okay?”</p><p>“Better than okay. We’re gonna be better than we’ve ever been. And that’s a promise.” Quinn wrapped her in his arms and kissed her forehead. “You plum wore me out today. Let’s get some sleep.</p><p>We’ll talk more in the mornin’.”</p><p>Chapter Eight</p><p>Libby tried to roll over but a warm, dry hand on her stomach held her in place.</p><p>“Whoa, darlin’. Ain’t a lotta room on a twin bed to be thrashin’ around. I gotta say, I much prefer it crowded with you.”</p><p>“So last night and yesterday wasn’t a dream? I won’t open my eyes and wake up in my queen-sized bed alone?”</p><p>“Not a dream.” Quinn’s lips brushed her ear. “I’m hopin’ to make yesterday’s events a new reality in our queen-sized bed.”</p><p>“Mmm.” She stretched, loving the feel of his legs tangled with hers and their bodies pressed together.</p><p>“Does my ‘night with a stranger’ fantasy include breakfast?”</p><p>“Sure, if you don’t mind blueberry Pop-Tarts, ’cause that’s about all I’ve got.”</p><p>“Yuck.”</p><p>“After we shower and get dressed up at the house, I could cook us up eggs and toast. I think there’s deer sausage left in the deep freeze.”</p><p>“Are you offering to wash my back?”</p><p>“And your front.” Quinn’s hands slid up to cup her breasts. “And every place in between.”</p><p>He started biting her neck and she squealed, so they only heard the last couple rings of his cell phone.</p><p>“Thought I left that damn thing in the truck,” Quinn muttered. He climbed over Libby and snatched the phone from the tiny table where it’d started ringing again.</p><p>“Hello? Hey, Ma. Nah. Because I didn’t feel like goin’ to church, that’s why.”</p><p>Libby withheld a groan. As much as she liked Quinn’s mother, Violet McKay had a tendency to forget Quinn wasn’t a teenager but a grown man. Since she and Quinn had been together since their teen years, she treated Libby the same way.</p><p>Quinn said, “Nope, Ben’s takin’ care of it this weekend. Because Libby and me are spendin’ time together. What’s that? I didn’t tell you because it ain’t your concern.” He sighed. “Sorry.”</p><p>Ooh, pissing off Mama McKay? That was a first. Libby heard the woman’s rapid fire reprimand on the other end of the phone from five feet away.</p><p>“I don’t know. We’re workin’ on it.” Pause. “I don’t give a damn what Vaudette Dickens told you. It ain’t none of her concern neither.”</p><p>Good Lord. Vaudette had been a busy bee; it was only nine-thirty in the morning.</p><p>“Ma. Ma! Look, I know you think you mean well... Butt out. This is between me and my wife.”</p><p>Pause. The floorboards squeaked as Quinn paced. “Jesus. Please tell me you didn’t take it upon yourself to ask her that.” Pause. “Because it ain’t none of your goddamn business. I don’t care if it’s the Lord’s Day; you had no right. No right.” Pause. “Fine. Put him on the damn phone.”</p><p>Libby’s stomach cartwheeled. She’d never heard Quinn speak to his mother so harshly. Never. She crawled out of bed and laid her cheek between his shoulder blades, wrapping her arms around him. His body shook, not from cold but with fury.</p><p>“Dad? No, you listen. I don’t give a good goddamn if she claims she meant no harm.” Pause. “Huh-uh. This is your first and only warning. Back off. Both of you.” Quinn clicked the phone shut and threw it on the floor.</p><p>His breathing was rapid and shallow. His body both hot and cold. He didn’t say anything or move to dislodge her arms, so Libby clutched him tightly, hoping it might calm him down.</p><p>“I didn’t know. I swear to God, I didn’t know. What kinda husband does that make me? Dammit, how could I not have seen it?”</p><p>Libby stepped back. “What was that phone call about?”</p><p>“My mother chewed me out for not bein’ in church. She demanded to know why Vaudette Dickens found out we were back together and why I hadn’t bothered to tell her first. She expected me to deny the rumor we were acting ‘obscene’ in public last night. Then she asked if we were done bein’ separated and when she could expect grandkids, ’cause she’d been waitin’ a long time and she was tired of nagging you about quittin’ your job and us startin’ a family.”</p><p>He spun around. His eyes were black with rage and his lips were drawn into a thin white line. “I didn’t know she’d been hounding you about grandkids because she ain’t said a single word to me. Not one word. Ever.” His eyes frantically searched hers. “She makes a big deal about it to you, doesn’t she?”</p><p>Libby nodded.</p><p>“Why didn’t you tell me?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“She’s your mother.”</p><p>“So?”</p><p>“So, if I would’ve said, ‘Quinn, your mama’s been demanding answers on why I’m not pregnant yet’, we both know you would have brushed it off. If I had complained every damn time she did it, you would’ve thought I was being overly sensitive and brushed it off too.”</p> <p>Guilt flashed across his face.</p><p>“It wasn’t bad at first. But as the years wore on, her comments became a little sharper. I didn’t want to cause family problems or make waves so I didn’t tell you.”</p><p>“Dammit, Libby, I didn’t know. I’m sorry. So damn sorry.”</p><p>“You can’t control her. I’ll admit I was jealous when your cousins started having babies. It embarrassed me at McKay functions hearing your mother complaining to the other women in the family that she didn’t have a grandchild to spoil yet.”</p><p>“And yet, she never said a fucking word to me. Sayin’ sorry doesn’t seem like enough. No wonder you resented me. No wonder you wanted to rid yourself of me and this overbearing family.”</p> <p>“Your mother didn’t cause our marital problems.”</p><p>“I realize that, but her behavior, coupled with my ostrich-like mentality, didn’t help matters.” He blew out a frustrated breath. “Enough.”</p><p>“We still have a lot to talk about, but you’re right. Let’s take a break. No more discussions about babies, fertility tests, mixed signals, meddling mothers and sisters.”</p><p>“For how long?”</p><p>“A while. Look, we can’t solve anything in two days, and with the resentment and confusion on both our parts, some issues we weren’t even aware we had...frankly, I’m too emotionally raw to deal with any of it right now.”</p><p>“Amen. And I ain’t sayin’ that because I’m hopin’ you’ll forget about it. I know we have to talk about this. Sooner, rather than later. But when we’re ready...well, I ain’t opposed to talkin’ to a fertility doctor to see if there is something wrong, if that’s still what you want.”</p> <p>Feeling a little misty eyed, Libby walked straight into Quinn’s arms.</p><p>“You all right?”</p><p>“No. My head is spinning.”</p><p>“You wanna go up to the house and lay down?”</p><p>“Maybe for a bit. Then can we just hang out at home today? Screw around. Take the four wheelers out, maybe snuggle up and watch a little TV?”</p><p>“You sure?”</p><p>“Yeah, why?”</p><p>“I thought you’d wanna do something more exciting.”</p> <p>She pushed back and looked at him. “Is that what you think? I have to be doing something new and exciting all the time? I find being on the ranch with you...boring?”</p><p>Quinn gave her a half-shrug and ducked his head.</p><p>Another truth hit her. “I’ve hurt you by letting you believe you and our home weren’t enough for me anymore.” Libby rubbed the tips of her fingers over his morning whiskers. “Oh Quinn. Oh, honey, that’s not why I wanted the separation. I’d hoped if we were apart we’d miss each other. We’d be forced to communicate beyond ‘What’s for supper?’ and ‘I washed your coveralls’ and we’d work harder to stay together.”</p><p>“Has it worked? Us spendin’ the weekend together?”</p><p>Libby laid her head on his chest and listened to his heartbeat. So strong. So steady. “We’re off to a damn fine start.”</p><p>Quinn stayed silent a beat too long and Libby knew she hadn’t given him the answer he wanted.</p><p>“Whatcha doin’?”</p><p>She shuffled the papers as the printer spat them out. “Research.”</p><p>Why did she look so guilty? “Can I see?”</p><p>“What time is it?” Libby asked, avoiding his question.</p><p>“Almost eight. Why?”</p><p>She unplugged the printer cable and powered down her laptop. “I thought it’d be fun to play cards.”</p><p>“I’d be up for a game of strip poker.” Quinn waggled his eyebrows.</p><p>“I was thinking a game of hearts and you were thinking with a hard-on.”</p><p>“I can’t help it. All the smokin’ hot sex yesterday, in the shower this mornin’, and my mind is runnin’</p><p>on one track.”</p><p>“Hold that thought. And get your money out. After I’ve finished packing I’m gonna whip your butt in poker.”</p><p>Quinn froze. “Finished packing for what?”</p><p>“I’m going to Cheyenne tomorrow for the state library conference, remember?”</p><p>“First I’ve heard of it.”</p><p>“I thought I’d told you.” She shrugged. “Must’ve slipped my mind.”</p><p>“How long you gonna be gone?”</p><p>“All week. There’s two days of training and then the actual conference. I’ll be back Friday afternoon.”</p><p>He flipped the station to an outdoor hunting channel and stared at the screen without seeing it.</p><p>“Maybe I oughta go with you.”</p><p>Libby kissed his forehead. “Don’t scowl, it’ll give you wrinkles. Besides, Cheyenne wouldn’t be fun for you, stuck in the hotel all day.”</p><p>“But the nights of hot motel sex would make up for it.”</p><p>“I’m assigned a roommate.”</p><p>Quinn hated when she went to conferences. She was too damn busy during the day to call him and too tired at night. He was lucky if they talked one time.</p><p>“Speaking of... I have to leave at the crack of dawn, so I’d better get going.” She flounced out of the room.</p><p>That sucked. He dropped his head back on the couch and gazed at the ceiling. Had Libby deliberately misled him?</p><p>You two weren’t exactly talking before last Friday.</p><p>True, but they’d done a helluva lot of talking since then. Then he remembered her insistence they not make promises for the future beyond the weekend, because she might need more time to think it over.</p><p>Evidently, Libby always intended on taking that time, in Cheyenne—whether he liked it or not.</p><p>Quinn didn’t like it one little bit.</p><p>But he’d damn sure give her something to remember him by before she left. He managed to cool his heels for ten minutes before he went upstairs.</p><p>The suitcase was open on the floor. The suit bag was spread out across the bed. Both were almost full.</p><p>Quinn leaned against the doorjamb and watched Libby scurrying around.</p><p>She finally noticed him. “Why are you skulking in the doorway?”</p><p>“Can’t a man appreciate his wife?”</p><p>“Sweet-talker.”</p><p>“I’m tryin’. How much packing you got left?”</p><p>“Almost done. Just have to pick shoes, but I’m tempted to take one pair.”</p><p>“Need help?” He ambled toward the closet.</p><p>“Nah. I’m good.”</p><p>Libby paid no attention to him as she mumbled and pawed through her dresser drawers.</p><p>Her side of the closet contained fewer clothes. It was easy to find what he wanted. Quinn unhooked the heavy material from the metal hanger. After she’d zipped up the suit bag and set it next to the suitcase on the floor, he tossed the pair of black suede fringed chaps on the bed.</p><p>She slowly turned around with an odd look in her eyes. “Umm. I think those are inappropriate for a librarian’s conference, don’t you?”</p><p>“Good thing you ain’t wearin’ ’em for nobody but me.”</p><p>“Quinn—”</p><p>He loomed over her in a half a heartbeat. “Put them on. No arguin’. No panties. No shirt. No bra. No socks. No boots. Just the chaps. I’ll be back in five minutes. You’d better be undressed and ready.”</p><p>“Ready for what?”</p><p>“Ready for whatever I tell you to do.”</p><p>Libby blinked at him. A few seconds passed and she nodded.</p><p>Quinn retreated to the bathroom. Seemed an eternity before he trekked back down the hallway to their bedroom.</p><p>She was sitting on the bed and jumped up the instant she saw him. “Was I supposed to be standing?”</p><p>“You’re fine.” Quinn shut and locked the door. He closed the blinds. Turned off the overhead light and flipped on the bedside lamp. Rolled back the quilt, exposing the sheets. Then he faced her. Crowded her, really. “Hands by your sides.”</p><p>She dropped the arms she’d crossed over her chest.</p><p>“Lord almighty, lookit you.” And what an eyeful Quinn got. His wife made his pulse race and his cock hard. “Turn and let me see the view from the back.”</p><p>It appeared Libby might argue, but she swiveled her hips, tossed her head and twirled around.</p><p>“Holy mother. That’s the sexiest damn sight I’ve ever seen.” The leather hugged her legs. The cut of the chaps highlighted her rounded, naked ass. The thick strap spanned the curve of her lower back and brought to mind bondage games he’d salivated over in porn flicks, but hadn’t thought he’d ever get the chance to try. He’d like to tie her up. Bind her hands in all sorts of tempting ways—above her head, behind her back, in front where the ropes would rub against her—</p><p>“Quinn?”</p><p>His gaze whipped to hers. Another time he’d remind her of his expertise with ropes. A small smile crept up. “Lemme see you shakin’ that badonkadonk.”</p><p>“What?”</p><p>“I wanna see your ass swingin’ and the fringe flappin’.”</p><p>“But—”</p><p>“Do it, Lib. Make me wild to get my hands and mouth all over you.”</p><p>“For being a man of few words you sure do use them well.”</p><p>“I’m a new man, darlin’ wife.”</p><p>At first, her hands were clutched into fists by her side, but eventually she hitched her shoulders back and raised her arms. Cupping each elbow, her arms created a square above her head. Libby twitched her hips side-to-side, adding a quick snap at the end, causing the fringe to slap against the leather and her skin.</p><p>Quinn groaned at the erotic swish-swish-snap sound. “Keep goin’. I’m gettin’ all kinds of worked up.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Libby widened her stance, performing a bump-and-grind routine that’d cause a stripper envy. She rolled her pelvis as she shimmied forward and peeped at him upside down from between her legs. She cooed, “How’m I doing, cowboy?”</p><p>“Definitely makin’ me wild. Stand up and face me.”</p><p>She spun around. “What now?”</p><p>“You’ll see. Be still.” He idly dragged his index finger from the tip of her chin, down the flushed skin of her throat, through the valley of her cleavage, zigzagging over her ribs and stomach. He traced the leather strap between her hipbones and her flesh quivered.</p><p>Libby trembled when he fell to his knees.</p><p>Quinn admired his handiwork from the previous night—her completely bare-shaven pussy. He passed his palms down the outside of her thighs. The fringe tickled her legs as he followed the sensuous curves to her ankles.</p><p>When he allowed his hands the same leisurely journey back up, she emitted a soft moan. Brushing his lips across the swell of her belly, he murmured, “Tell me what you want. I’ll do anything you ask.”</p><p>“You know what I want.”</p><p>His let his hair tease the underside of her breasts, knowing it drove her crazy as he feathered butterfly kisses over her lower torso. “Say the words, Libby.”</p><p>“Put your mouth on my...sex. Suck my clit. Use your hands and your tongue, just...make me come.”</p><p>“Sit on the edge of the bed. Lay back. Close your eyes.”</p><p>The bed bounced she hit it so fast.</p><p>He withheld a smile as he grabbed the lube and her vibrator out of the nightstand drawer. He scooted between her legs, bent his head and tasted her.</p><p>“Oh. Yeah.”</p><p>Another pass of his tongue. Quinn licked and teased, rubbing his face all over her smooth skin.</p><p>Evidently the sensation of his wet mouth and cooling breaths across her hot flesh, coupled with soft tongue flicks and the rough scrape of his evening beard, quickly drove Libby to the edge.</p><p>“Quinn. Please.”</p><p>As he zeroed in on her clit, he began to lightly massage her anus. She tensed up, like she always did.</p><p>This time instead of backing off, he said, “Relax. Lemme make you feel good.”</p><p>Surprisingly, she did relax.</p><p>With every suck and lick, Quinn swirled his finger a little deeper inside her back channel, while he thrust his thumb in and out of her wet pussy. When Libby began pushing down on his hand, he suctioned his lips around her clit and slid his middle finger in her ass as she started to come.</p><p>It was hot as hell, feeling her throb against his tongue as her interior muscles contracted around his finger and thumb.</p> <p>After the pulses subsided, Libby opened her eyes. “Wow.”</p><p>He took his time tasting the dips and hollows of her body, steeping his taste buds in the sweet and salty flavor of her skin. Against her throat, he said, “Did you like that?”</p><p>“God, yes.”</p><p>“Do you want more?”</p><p>“Mmm. You could probably persuade me.”</p><p>“Flip onto your belly.” Once Quinn had her stretched out at an angle across the bed, he followed her spine with his tongue. “You got what you wanted. Now it’s my turn. I wanna slide my cock in that virgin hole and fuck you.”</p><p>She sucked in a harsh breath. “Are you giving me a choice?”</p><p>“Nope. I’m claimin’ this part of you I’ve waited for, for years.” His teeth tugged on her earlobe.</p><p>“Admit it. You liked my finger.”</p><p>“Well, yeah, but there’s a difference between one finger and your cock.”</p><p>“I ain’t exactly hung like a bull.”</p><p>“I don’t think—”</p><p>“So don’t think. I’ll make sure you’re ready, and when you are, I’ll go slow.” He kept kissing everywhere his lips could reach, brushing his clothed body against her bare skin. “Come on, darlin’, I’m dyin’ here. And if you were honest with yourself, you’d admit you’re just as curious as I am.”</p><p>Libby lifted her head to look at him. “I swear to God, if it hurts—”</p><p>The rest of Libby’s protest was lost in Quinn’s demanding kiss. He seduced her, inflamed her, brought her back to the magical place where desire ruled.</p><p>She ripped her mouth free with a gasp. “Do it before I change my mind.”</p><p>Didn’t have to tell him twice. He hopped up and stripped. He liberally coated his fingers, staring greedily at the rounded globes of her ass and the hidden pink hole as he greased up his cock.</p><p>When she attempted to push to her hands and knees, he hiked her hips into the air and pressed her chest against the mattress. “Stretch your arms above your head.”</p><p>Quinn climbed on the bed and squirted a dollop of lube on the rose-colored pucker. He swirled his index finger around, waiting for her to clench.</p><p>She didn’t.</p><p>While stroking the expanse of her naked back with his free hand, he inserted his finger deep, to the webbing.</p><p>Libby hissed.</p><p>“You okay?”</p><p>“Yeah, it just feels...different from this angle.”</p><p>After squeezing out more lube, he added a second finger.</p><p>Her body stiffened slightly but the muscles surrounding his fingers remained loose.</p><p>“So sexy, so hot, so damn tight.” Quinn leaned forward and nibbled on her shoulder blades as he carefully stretched her. When she rocked her ass back onto his fingers, he knew she was ready. “Give me your right hand.” She slid her arm down and he placed the vibrator in her palm. He turned it on. “I wanna see you usin’ this as I’m fuckin’ you.”</p><p>Libby made a sound that was half-moan, half-gasp as her hand disappeared between her legs.</p><p>Quinn pressed his cock against the opening and gently pushed the head past the ring of muscle.</p><p>Despite his need to pound into her, he stopped. Took a breath. As a man of few words, Libby wouldn’t expect a play-by-play and he was too far gone with lust to indulge in dirty talk.</p><p>Holding her soft butt cheeks in his hands, he watched his cock disappear into her ass an inch at a time.</p><p>Oh sweet Jesus, that was good. He waited a minute to savor claiming the last piece of his wife’s virginity and giving her the last of his.</p><p>Vibrations inched closer to his balls as Libby stroked the vibrator over her slit. The buzzing sensation sent tingles up his spine. Straight up his dick. He pulled out little by little, leaving just the tip of his cock hugged by her flexing muscles. Then he slid deep until her anus was snug against the wider base of his shaft.</p><p>Two, three more times, he drove in and out, the warning slow slow slow screamed in his head, warring with the ever louder harder harder harder. Quinn managed to keep the pace steady even when sweat dripped into his eyes. He clenched his teeth, his fingers and his ass cheeks against the need to pound into that tight channel with everything he had.</p><p>“Quinn?”</p><p>“Uh-huh?”</p><p>“You’re holding back, aren’t you?”</p><p>“Uh-huh.”</p><p>“You aren’t hurting me.”</p><p>“You sure?”</p><p>“Positive. Take me how you want.”</p><p>With a noise similar to a snarl, Quinn unleashed the beast inside him. He withdrew and slammed into her with enough force to send her grasping for purchase on the slippery sheets. Over and over. Without pause. “Fuck, that’s so good.”</p><p>Each pounding thrust had Quinn climbing the precipice to that elusive point of pleasure. The tight clasp of her untried passage, the buzz of the vibrator, the visual of Libby’s body stretched out before him as he’d always dreamed. He fucked her hard enough the bed shook.</p><p>Libby’s orgasm hit. She screamed.</p><p>The high-pitched feminine wail was one of the sexiest sounds Quinn had ever heard.</p><p>When she bore down on his cock, and her body attempted to suck his pulsing sex deeper, Quinn lost his thin grip on control. He rammed in to the hilt as his balls lifted and he bathed her channel with his seed.</p><p>He squeezed his eyes shut as her body milked every hot spurt, each blast of heat burst from his cock like a pipeline of liquid fire.</p><p>Eventually, the primitive roar in his head lessened. Even when he could think and breathe again, his heart kept a rapid thud-dunk-adunk as he eased out of her.</p><p>After kissing the back of her head and murmuring sweet nonsense, Quinn retreated to the bathroom, cleaned himself up, and brought back a warm washcloth to do the same for her.</p><p>She didn’t move much. She didn’t look at him. He didn’t know whether that was a bad or a good sign.</p><p>After he’d tossed the washcloth aside, he rolled her over. Finally, she opened her eyes.</p><p>“Hey. You all right?”</p><p>“Tired.” Her jaw cracked as she yawned. “Man. I’m not used to two days of raunchy sex.”</p><p>“Complaints?”</p><p>“Not a single one. I liked that. I didn’t think I would.”</p><p>“Good.”</p><p>Silence.</p><p>Libby sat up and reached for the covers. “I’ve gotta be up early tomorrow. You coming to bed?”</p><p>Quinn toyed with the lace on the pillowcase. “I didn’t know if I’d be sleepin’ in the horse trailer again.”</p><p>“Why would you think that?”</p><p>“Because I was rough with you.”</p><p>“I asked you to be rough with me.”</p><p>“But—”</p><p>“No buts, silly man. Of course I want you here. No more regrets, no more holding back.” She touched his face. “I want to be everything you need, Quinn. Everything. In bed and out.”</p><p>“You are.”</p><p>“Good. Now come in here and warm me up.”</p><p>He slid between the sheets and spooned behind her. “I missed sleepin’ with you, Lib.”</p><p>“Is that all you missed?” she teased.</p><p>“No. But I don’t got time to tell you everything I missed. It’d take hours.” He let his lips follow the outside shell of her ear. “Days maybe.”</p><p>“You’re so sweet.”</p><p>After a bit, he whispered, “I love you like crazy, Libby McKay. I ain’t ever lettin’ you get away from me again.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter Nine</p><p>Late Thursday morning, Quinn was wrenching on an old tractor outside the barn when a Crook County sheriff’s car pulled up. He wiped his hands on a rag and squinted at the familiar driver.</p><p>His cousin, Cam McKay, had signed on as a deputy after his return from Iraq. The door opened and all six-foot-five inches of Cam unfolded from the vehicle.</p> <p>“Mornin’,” Quinn said.</p><p>“Mornin’, Q,” Cam replied, slamming the door.</p><p>Cam’s limp was noticeable as he ambled over. Quinn focused his attention on Cam’s face rather than his disability. “Out makin’ the rounds today, Deputy McKay?”</p><p>“I wish. Is Libby around?”</p><p>“Nah. She’s at a conference in Cheyenne all week.”</p> <p>“That explains it.”</p><p>“Explains what?”</p><p>“This.” Cam held up an envelope. “Why I’m serving you with papers from Ginger Paulson, Attorney-at-Law.”</p><p>Quinn’s stomach pitched. “You’re shittin’ me.”</p><p>“Nope. Sorry.” Cam passed over the envelope. “This part of my job sucks worse than dodging bullets.”</p><p>“When did you get this?” Quinn asked as he ripped the flap open.</p> <p>“First thing this morning. I grabbed it soon as it was dropped off. I figured you’d rather get it from me than from Sheriff Turnbull.” Pause. “Unless you plan on shooting the messenger?”</p><p>“Not hardly. Ain’t your fault and my gun is in my truck.” Quinn didn’t know squat about legal procedure, but he had a pretty good idea what kind of papers were inside the envelope. The rag fell to the ground as he scanned the document.</p><p>A Summons and Complaint, filed by Ginger A. Paulson, Attorney-at-Law, on behalf of Libby Adams McKay, Complaint. Dated...Tuesday morning.</p><p>Son of a bitch.</p><p>Quinn’s face grew hot, his eyes smarted. He felt like he’d been bucked off a bull—breathless, blindsided and stupid.</p><p>“Q? Buddy, you okay?”</p><p>He couldn’t look at his cousin. The pity in Cam’s eyes would do him in. “No. I’m about as far from fine as a man can get.” Spilling his guts. Nice. Maybe he oughta throw himself in the dirt and start bawling too.</p><p>“Look, I ain’t tryin’ to be a dick, or to stick my nose in, but Ben made it sound like you and Libby had gotten back together last weekend.”</p> <p>“I thought we had.”</p><p>Silence.</p><p>Finally, Quinn glanced up and waved the paper. “This ain’t some kinda mistake?”</p><p>Cam shook his head.</p><p>“Fuck.”</p><p>“Have you talked to Libby since she’s been in Cheyenne?”</p><p>“Once. She’s always so damn busy at those conferences she don’t have time to call.” Come to think of it, when he’d called her Tuesday night, she had acted more distracted than usual.</p><p>Why?</p><p>Because you showed her your darker side. It scared her and she’s rethinking whether she wants to spend her life with you.</p><p>No. Libby had wanted to see it. Hell, she’d demanded to see it.</p><p>Then why with all your sharing of feelings and hours of lovemaking didn’t she tell you she loved you?</p><p>His heart nearly stopped.</p><p>Surely Libby had uttered those three little words at some point over the weekend.</p><p>Hadn’t she?</p><p>He’d said them to her, but now that he really thought about it...his wife hadn’t reciprocated. Not one time. Why not? Was this past weekend a way to get him to open up before she leveled the killing blow to their marriage?</p><p>No. Libby wasn’t a cold, vindictive woman—even when the divorce petition clutched in hand suggested otherwise. So what in tarnation was going on with her?</p><p>Only one way to find out.</p><p>Quinn’s boots kicked up dust as he raced to his pickup.</p><p>Cam called out, “Hey! Where you going?”</p><p>“Cheyenne.” Within two seconds, his cousin jerked him around and got right in his face. Damn. Cam was scary fast and stealthy, even sporting a fake leg. “What?”</p><p>“I can’t let you go, Q, if you’re planning on doing something stupid.”</p><p>“Jesus, Cam, you think I’d ever hurt her? I love her. She’s everything in the damn world to me.”</p><p>His younger cousin gave him a hard cop stare.</p><p>“I’ve hurt her enough. Only stupid thing I’m doin’ is standin’ here, tellin’ you what I oughta be tellin’</p><p>her.”</p><p>Cam grinned. “That’s all I wanted to hear. Drive safe.”</p><p>Four hours later, Quinn hit the state capital. The parking lot of the Sheraton was jam-packed. He rolled the papers up and shoved them in his back pocket.</p><p>Inside the convention center, he checked the electronic display board listing class times and rooms.</p><p>Librarians roamed the halls. Mostly females. Luckily in Wyoming no one paid attention to just another man in a cowboy hat.</p><p>He paused outside the door to Conference Room B and took a deep breath. Rounding the corner, he scanned the women congregated around the beverage station and scattered in groups of twos and threes.</p><p>Bingo. There she was, looking pretty as a picture in a clingy purple pantsuit, chatting with a lady twice her age and half as tall.</p><p>Quinn strode toward her.</p><p>Libby glanced up when ten feet separated them. Her eyes widened. “Quinn? What on earth?”</p><p>“I’m happy to see you too, darlin’ wife.”</p><p>The older woman tittered.</p><p>Color rose in Libby’s cheeks. “Why are you here?”</p><p>“Because I got hold of some interestin’ papers today and I wanted to talk to you about them.” He slipped his arm around Libby’s stiff shoulders and smiled at her companion. “Ma’am. If you’ll excuse us.”</p><p>“Certainly.”</p><p>He sensed Libby fuming as he attempted to steer her out of the room. She dug in her heels. “I’m busy.</p><p>This is not the place to discuss this.”</p><p>Quinn placed his lips near her temple. “Wrong. Unless you want me to hoist you into a fireman’s hold and drag you outta this room, you’d better keep movin’.”</p><p>She jerked back. “You wouldn’t dare.”</p><p>“Try me.” After a couple seconds of her indecision, Quinn flashed his teeth at her. “Fine. If that’s the way you wanna play this.” He bent down, intending to throw her over his shoulder.</p><p>“No! Wait.” Libby grabbed his hand and hustled him out the side door. She kept dragging him along at a good clip until they reached a deserted corridor. She whirled around, hands on hips. But he could tell she wasn’t really mad, just...worried.</p><p>“What happened between us last weekend?” Quinn asked. “Was it only about sex?”</p><p>She shook her head.</p><p>“It wasn’t one last tumble before you moved on?”</p><p>“Moved on? Why in the world would you say that? You were there, Quinn. You know how everything changed between us.”</p><p>“Yeah, but I thought it was a change for the better.”</p><p>“It was. It is.”</p><p>Quinn reached into his back pocket and held out the rolled-up papers. “Then how in the hell can you possibly explain this?”</p><p>Libby’s eyes darted away. “It was supposed to be a surprise.”</p><p>“A surprise?”</p><p>“We’ve never done anything like that. I thought it’d be fun.”</p><p>“Fun?” he repeated. “Since when is a surprise divorce fun?”</p><p>“What are you talking about?”</p><p>“This.” Quinn waved the papers. “A signed document from Ginger Paulson, Attorney-at-Law, starting the divorce proceedings at your request.”</p><p>“Gimme that.” Libby snatched the papers and unrolled them. All the blood drained from her face and she wilted against the wall as she flipped through the pages. “No. No. No! This wasn’t supposed to happen.”</p><p>“Then how did it?”</p><p>Silence.</p><p>“Libby?”</p><p>“Last Friday, I’d given up hope. I thought you didn’t care—”</p><p>“I remember that conversation. We’ve been through this.”</p><p>“You don’t know this part. Earlier that day I signed the Complaint paperwork. I put it in my outbox, intending to mail it...and then you were waiting for me in the parking lot. Since I was out of town this week, someone at the school must’ve thought they were doing me a favor and sent it off.”</p><p>“Some favor.”</p><p>“This wasn’t what I wanted.” Libby looked at him beseechingly. “You have to believe me. I forgot all about it. Especially after we spent the weekend trying to work things out.”</p><p>“Did we work things out, Libby?”</p><p>“Yes!”</p><p>Relief like he’d never felt swept through him. “So if you would’ve gone into the library on Monday?”</p><p>“I’d have ripped this into shreds.” Her chin wobbled. “God, Quinn, I’m so sorry. You probably were thinking all sorts of horrible thoughts about me.”</p><p>Quinn pulled her into his arms. “Never. I was just mighty confused and needed to get to the bottom of it straightaway, since we talked about not keepin’ things from each other.”</p><p>“So you...?”</p><p>“I hopped in my truck and headed for Cheyenne right after Cam dropped it off this mornin’.”</p><p>“Your cousin delivered this to you?” She cringed. “That oughta be fodder for the McKay gossipmongers.”</p><p>“Since it was official business, I doubt he’ll say anything.” He swallowed his pride. “But I wouldn’t mind reassurance from you that it ain’t gonna be grist for the mill.”</p><p>She tipped her face up to look at him. “Like?”</p><p>“Like...do you still love me?”</p><p>“Of course I still love you. I never stopped loving you.”</p><p>“Say it again.”</p><p>Libby stood on her tiptoes and peppered his face with kisses. “I love you. Love, love, love you, with my heart, my soul, my everything. Quinn McKay, you are my everything, and if you think for one moment I’m ever letting you go, after all we’ve been through—” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Quinn dipped his head and kissed her. For a good long time.</p><p>When they broke apart, she murmured, “My roommate is in a class right now. Wouldn’t it be fun to mess around? Especially when there’s a chance we’ll get caught?”</p><p>“Sounds like my kinda fun.” Fun. That reminded him. “What did you mean when you said you thought it’d be a fun surprise and we’d never done anything like it?”</p> <p>Color tinged her cheeks. “Oh. When I saw those papers, I thought you’d found the tropical island</p><p>‘couples only’ getaway packages I’d printed out on Sunday. I wanted to tempt you into taking a real vacation, just you and me, the sand and the sea.”</p><p>Quinn brought her hand to his mouth and kissed her knuckles. “Is that another one of your untold fantasies? Jetting off to a tropical island?”</p><p>“Only if it’s jetting off with you.”</p><p>“Then the week after you get outta school for the summer, we’ll hop on a plane and be sippin’ drinks on the beach by sunset. You can call it a fantasy. I’ll call it our second honeymoon.”</p> <p>“Really? You’d do that for me? Even though you hate to fly?”</p><p>Quinn touched her, the woman he’d loved most his life, the woman who was his everything, the woman who loved him enough to give him a second chance. “Libby, I love you. I’d do anything for you. I wanna make you happy. I want us both to be happy. Not just for a week, or for a weekend, but for the rest of our lives. Let’s go home.”</p><p>Libby stepped back and gave him a wicked grin. “Right after we test the bounce factor of the mattress in my room.”</p><p>Yep, he was really grateful for second chances.</p><p>Epilogue</p><p>Six months later</p> <p>Libby barely made it to the toilet before she threw up.</p><p>Again.</p><p>Damn flu.</p><p>She managed a sip of water. The liquid stayed down for a change. Good. She wiped her mouth and let the sink cabinet hold her up, hoping she could climb back in bed before Quinn returned home from checking cattle.</p><p>Yeah, she’d pop to her feet and walk those twenty steps to their bedroom. In a second. She just needed to rest her eyes for a minute or two.</p><p>“Nappin’ in the bathroom again?”</p><p>Her eyes flew open, giving her an instant case of vertigo. Dammit. She’d dozed off. Worse, he’d caught her dozing off.</p><p>Quinn crouched down, his face lined with concern. “Libby—”</p> <p>“I’m fine.”</p><p>“No, you ain’t. You need to go to the doctor.”</p><p>“It’s the flu, Quinn.” When he scowled, she added, “It’s flu season. I work with coughing, hacking, feverish kids every damn day. Do the math. I’m bound to get sick a lot.”</p><p>“I have done the math, which is why I know it ain’t the damn flu.” He stood and stalked out of the bathroom.</p><p>Libby yelled, “I am not going to the doctor.”</p><p>No answer.</p><p>Crap. She hated arguing with him. It’d been a rarity since their reconciliation, but not because they weren’t communicating. They talked all the time. In fact, her formerly strong, silent type of husband had become downright chatty. Libby wasn’t complaining. She’d never been happier and Quinn felt the same.</p><p>Their life wasn’t perfect, but it was damn close.</p><p>Now, if she could just get over the flu that’d been hanging on for the last month.</p><p>Paper rustled and she looked up at Quinn leaning in the doorway. A white pharmacy bag dangled from his hand. She managed a wan smile. “You went to town and got me medicine? That’s so sweet.”</p><p>“No, I went to town and got you a pregnancy test.”</p><p>Her stomach lurched. She crawled to the toilet and threw up again.</p><p>Quinn held her hair back and wiped her face. After he situated her on the floor, he stretched out across from her. “Better?”</p><p>When the queasiness subsided, she said, “I’m not pregnant. I’m never pregnant.”</p><p>“This time is different.”</p><p>“How do you know?”</p><p>“Pregnant is pregnant. I recognize the signs.”</p><p>Indignantly, she snapped, “I am not a heifer! You cannot judge me by the way I twitch my backside or behave erratically whether or not I’m pregnant for the first time.” To Libby’s utter dismay, she began to cry.</p><p>“Ah hell. Take a deep breath or else you’ll be right back hangin’ over that toilet after gettin’ so worked up.”</p><p>“Shit. Shit. Shit. I hate to bawl. I hate to whine. I hate to throw up. I hate that I’m sitting on the damn bathroom floor again doing all three.”</p><p>“I know you do.” He ripped off a chunk of toilet paper and handed it to her. “Lib, what’s really goin’</p><p>on?”</p><p>She sniffled and blew her nose. “I’m scared.”</p><p>“Me too.” He paused, but his silences no longer made her nervous.</p><p>“It’s just...things are so good between us now. I don’t want anything to wreck it.”</p><p>“You think havin’ a baby could do that?”</p><p>“Me wanting one so badly did before.”</p><p>“Yeah, but it wasn’t the only thing that caused our problems. We’re different now. We’re probably better prepared to deal with all the issues involving a baby. So maybe there was a reason we didn’t get this gift until we were both ready to handle it.”</p><p>Libby stared at him. “You really think I could be pregnant?”</p><p>Quinn took her hand. “Come on. Indulge me. I believe in my gut and in my heart we’ll be fine no matter what the stick says.”</p><p>She did too. “All right.”</p><p>“Good.” Quinn cracked open the pregnancy test kit, read the directions a billion times and watched her like a hawk so she didn’t screw it up. In all the years she’d locked herself in the bathroom and conducted multitudes of pregnancy tests, this was the first time she’d involved Quinn in the process.</p><p>They left the urine-soaked stick on the back of the toilet and Quinn set his watch.</p><p>Holding her close, he gave her a reassuring kiss on the top of her head and murmured, “I love you.</p><p>Nothin’ll ever change that. Baby. No baby. Don’t matter as long as I have you.”</p><p>“I feel the same. I love you. God, I love you so much.”</p><p>The watch beeped.</p><p>“Ready?” he asked.</p><p>“Ready,” she answered.</p><p>They held hands as they peered at the indicator.</p><p>Finally, Quinn said softly, “I’ll be damned.”</p><p>The results window read...a plus sign in big, bold type.</p><p>Not the flu after all.</p><p>Libby didn’t know whether to laugh or cry.</p><p>“You okay?” he said.</p><p>“Uh-huh. I’ll probably freak out once it sinks in.”</p><p>“That’ll make two of us, darlin’.”</p><p>“Don’t you mean, three of us?”</p><p>“Three. Right. God. A baby. We’re havin’ a baby.” His body went ironing board rigid. “Now that we know, get your butt back in bed, pretty mama. I’m callin’ Doc Monroe and you’re goin’ to see her first thing tomorrow. But today you need to rest.”</p><p>“But—”</p><p>“No buts. I’m gonna make sure you don’t move, even if I hafta hogtie you to the headboard. ’Cept I know how much you love bein’ tied up.”</p><p>“Quinn—”</p><p>“No arguin’, Lib, I mean it.”</p><p>She sighed. “Are you gonna be one of those hovering, overbearing husbands who obsesses about every little thing during this pregnancy?”</p><p>A beat passed. “I reckon so.”</p><p>Libby leaned into him, grateful to have him standing behind her, holding her up, in every possible way. “I can live with that.” </p> </body></html>"]