["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Men love Star Wars. Not in the same way women love Titanic or The Notebook—I cry every time I watch them. But Star Wars is different for men. It’s not just entertainment.</p><p>They believe in it.</p><p>It’s their handbook, their Bible. Apparently, all the secrets of life can be found in George Lucas’s films. At least in the first three. According to Drew, the last three “suck ass.”</p><p>We’re watching The Empire Strikes Back now.</p> <p>Drew and I have been living together for just over a month. But it feels like it’s been longer. You know when you get your hair highlighted? And after just a day or two you can’t remember what you looked like before? Can’t imagine a time when your hair wasn’t this vibrant, multifaceted shade? It’s a lot like that.</p><p>There we are—on the floor, snuggled under a pile of pillows and blankets, eating popcorn—while Han Solo is about to be frozen in carbonite. Oh, and Mackenzie is here too. Alexandra and Steven asked us to watch her for the afternoon.</p><p>“I don’t get it.”</p><p>Drew’s eyes don’t stray from the plasma. “What don’t you get?”</p><p>I sit up as I explain. “The man is most likely about to die, and the woman he’s wanted all this time finally tells him she loves him—and what does he say? I know? What kind of line is that?”</p> <p>Drew looks genuinely shocked. “Uh...the greatest in cinematic history?”</p><p>“Why didn’t he just say he loves her too?”</p><p>He sits up, giving me his full attention. Prepare to be tutored in the finer points of male logic.</p><p>“Because he’s Han freaking Solo. He’s the coolest guy in the galaxy. He doesn‘t have to say he loves her—look at everything he’s done for her. She should already know.”</p><p>Typical. I shake my head and look down at Mackenzie, who sits between us. “When you fall in love? Go for a guy like Luke.”</p><p>Drew is highly offended. “No. No way...”</p> <p>“He’s sweet. Brave but sensitive.”</p><p>“Luke is a whiny little bitch until Return of the Jedi.”</p><p>Mackenzie reaches for her calculator and adds ten to the tab. Did you miss the Bad Word Jar that’s sitting on the coffee table? Yeah—it’s almost full. I say Drew should just buy her a Ferrari now. By the time she’s old enough to drive it, they should be about even.</p><p>“If you decide you want to get married, Mackenzie—someday—it should be to a guy like Han.”</p><p>Mackenzie turns her head from Drew to me, like she’s watching a match at Wimbledon.</p><p>“He’s selfish and egotistical. Always running off in his space cruiser—”</p><p>“That’s the Millennium Falcon to you,” Drew interrupts.</p><p>I ignore his correction. “And he’s obviously a playboy! A womanizer. Why would you want Mackenzie with someone like that?”</p> <p>“Correction: he was a womanizer. Until he met Leia. She changed him. And Mackenzie—like Leia—is going to be smart, strong, and powerful. She’ll eat a weakling like Luke for breakfast. Han, on the other hand, will keep up with her. Keep her satisfied.”</p><p>He smirks—in that way that makes my stomach tighten—as he adds, “Like us.”</p><p>I smile teasingly. “But I’m never satisfied. I always want more.”</p><p>Drew’s voice drops suggestively. “I guess I’ll have to work harder, then.”</p><p>And just like that, we’re in Lust Land. Get used to it—it happens often. Our gazes lock, and our mouths gravitate towards each other. Don’t worry about Mackenzie; it’s nothing she hasn’t seen before.</p><p>Drew is big on the PDAs. Because when it comes to affection—and everything, for that matter—he’s impatient and spoiled. So if he wants to touch me, kiss me? He does. And he really doesn’t give a damn who’s around at the time.</p><p>It can be a real turn-on—or incredibly frustrating, depending on the circumstances.</p><p>Before our lips touch, the phone rings. And Mackenzie’s blond head pops up between us.</p><p>“I’ll get it!”</p><p>Alexandra said she’s really into answering the phone lately.</p><p>“Evans-Brooks res-dance?”</p><p>Has a nice ring to it, doesn’t it?</p><p>She listens to the receiver, then turns to Drew. “Uncle Drew, it the doorman. He say there a package for you.”</p><p>“Tell him to sign for it, and I’ll pick it up later.”</p><p>She does. Then she listens again and says, “He say it per-ish-able.”</p><p>Drew’s brow furrows, wondering what it could be. “Okay. Tell him to send it up.”</p><p>Drew pauses the movie. Before he stands, he picks up my hand and kisses it softly. And his eyes promise more to come.</p><p>This is our first clothed weekend. And although I adore Mackenzie, I’d be lying if I said I wasn’t looking forward to some non-G-rated activity later on. Yes—my name is Kate, and I am a newly indoctrinated sex addict.</p><p>But come on, look at the man. Can you blame me?</p><p>Drew opens the door, and a uniformed man hands him a clipboard before sliding a large cardboard box—with holes on top—through the doorway. Drew signs, looks down at the box, and kicks it with his foot. “What’s in—”</p><p>Before he can finish, a chorus of sounds emerges from the box.</p><p>Meows.</p><p>Mackenzie’s jaw drops as she runs forward. “It sounds like kittens!” She takes the lid off the box. “It is! Is a whole box full of kittens!”</p><p>Is it ever. I stand up and peer inside. Eight kittens, to be exact.</p><p>Drew looks accusingly at the deliveryman. “What the f**k is this?”</p><p>“These are your foster kittens.”</p><p>“My what?!”</p><p>Kitten Man checks the clipboard. “Drew Evans, right?”</p><p>He nods.</p><p>“You signed up to be an animal foster parent. These are your wards for the next four to six weeks.”</p><p>Drew is already shaking his head. “I didn’t sign up for shit. I hate cats—they’re Satan’s pets.”</p><p>Kitten Man hands Drew the clipboard. “That’s not what it says here.”</p><p>By this time, Mackenzie is cooing and petting the box of meowing fur. And I cover my mouth to keep from laughing.</p><p>Have you figured it out yet?</p><p>“I’m going to kill her. I swear to God! I’m gonna be an only child by the time this day is over!”</p><p>That’s when I start laughing. Loudly. As I ask him, “What did you expect? You had a farm animal delivered to her condo on Christmas morning.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That was a gift! This is just mean.”</p><p>Drew hands the clipboard back to Kitten Man. “Take them back. There’s been a mix up. They can’t stay.”</p><p>Kitten Man looks disappointed. “That’s too bad. Without you, these little guys will be euthanized by the end of the day.”</p><p>Big round blue eyes stare up at Drew.</p> <p>“What eufanized mean, Uncle Drew?”</p><p>Drew looks at her sad little face for about five seconds. Then he lowers his head in defeat. “Goddamn it.”</p><p>I smile at Mackenzie. “It means the kittens are staying, sweetie.”</p><p>“Yippee!” She starts taking them out of the box one by one.</p><p>Kitten Man turns to go. “Happy Holidays. God bless you.”</p> <p>Drew scowls. “Yeah, yeah. Happy f**king New Year.”</p><p>Then he kicks the door closed.</p><p>“I’m gonna name you Nala, and you Simba, and you Fluffy, and you Muffy...and I’m gonna call you Drew Junior! He look like Uncle Drew, don’t he, Aunt Kate?”</p><p>Oh yeah—I’m already Aunt Kate. How great is that?</p><p>“He does. He’s very handsome and seems smart too. Don’t you think, Drew?”</p><p>He’s still pouting. “Yeah. Fantastic. Hey, here’s an idea—let’s take Drew Junior and his buddies down to the Hudson River and see if they can swim?”</p> <p>I saunter towards my boyfriend. “You don’t want to do that.”With Mackenzie’s focus still on the kittens, I slide my hand under Drew’s T-shirt and scrape my nails over his abs.</p><p>That gets his attention.</p><p>“I don’t?”</p><p>I keep my voice low. “Nope. Because rescuing poor defenseless animals gets me really ...hot.”</p><p>Drew raises his brows. “How hot?”</p><p>I lick my lips. He watches.</p><p>“Very. I’ll probably need you to cool me down with...ice cubes...or whipped cream...”</p><p>He puts his hands on my hips and pulls me forward. “Mmmm. Maybe...kittens have their good points after all.”</p> <p>I smile and nod. And then our mouths are joined. I wrap my arms around his neck, and my feet leave the floor as Drew lifts me up.</p><p>Just as his tongue comes out to play, Mackenzie calls out, “Uncle Drew! Simba went pee-pee on the rug!”</p><p>He sighs. And presses his forehead against mine.</p><p>“I’m sending The Bitch the bill when I get these carpets cleaned. No...better...I’ll have them replaced. That’ll bite her in the ass.”</p><p>I don’t want him too focused on a war with his sister. Not when there are so many other—more enjoyable—things he could be focusing on.</p><p>“Let it go, Drew. And after Mackenzie leaves, you can bite my ass instead.”</p><p>He laughs. And nips at my earlobe.</p><p>“You’re right. That’ll be a lot more fun.”</p><p>The Honeymoon’s Over (Drew POV)</p><p>Endorphins: chemicals in the brain that instill feelings of well-being or euphoria.</p><p>They’re the reason we keep going back to the gym for those punishing workouts. They’re the reason even the most uptight man on earth can fall asleep after a good lay. They are also responsible for a little phenomenon commonly referred to as The Honeymoon Period.</p><p>You know what I’m talking about. It’s the beginning of a relationship—when everything is all sweetness and light. Everyone’s on their best behavior.</p><p>Guys don’t pass gas; women don't eat.</p><p>Or, if they just can’t help themselves, even the worst habits seem like the most adorable thing since Punky frigging Brewster. His cute little snore, her delightful nail biting.</p><p>Humans are not the only ones who go through a Honeymoon Period. It’s an interspecies experience. In fact, without it, sharks would cease to exist. See, sharks are natural predators. They’ll eat anything—including their own offspring.</p><p>Right after giving birth, however, the mother shark’s brain is flooded with endorphins, putting her into a kind of ecstatic coma. This gives the baby shark about ten minutes to swim away.</p><p>Because if he’s still around when Momma wakes up? He’s lunch.</p><p>Which brings us to the other universal characteristic of The Honeymoon Period:</p><p>Eventually, it ends.</p><p>“Hey, Kate?”</p><p>It’s Saturday afternoon. Matthew and Steven are over. We’re in the living room, watching the game.</p><p>“Kate!”</p><p>And we need beer.</p><p>Sure, she’s in the office working, but the Yankees are on. And I’m a New York boy—born and raised. Which means there are only two teams I like: the Yankees and whoever’s playing the Boston Red Sox.</p><p>“KAAATE!”</p><p>She appears at the entrance to the room, arms folded, hip cocked. She’s wearing a sundress—short with a sexy floral pattern and buttons down the front for easy removal. I worship the creator of the sundress.</p><p>Her voice is annoyed. “What is it, Drew?”</p><p>I toss her a smile. “Hey, babe...could you grab us a few beers from the fridge?”</p><p>Animals are non-verbal. A girl dog can’t tell a boy dog, Screw me now; I want to have your puppies. So instead she sticks her ass in the air. Now, if the boy dog happens to read her signals wrong? If he jumps on her ass before it’s raised?</p><p>He might just get his balls bitten off.</p><p>Women are a lot like female canines—or bitches, if you want the correct terminology—and God help the man who misreads them.</p><p>We’ll get back to that later.</p><p>As for now, when Kate raises one eyebrow at me, I know she’s looking for an explanation. I gesture towards the television. “Jeter’s about to beat the all-time hitting record.”</p><p>She sighs. Pacified. “Okay.” Then she heads off to the kitchen.</p><p>A few minutes later, she comes back with her arms full of beer bottles. She hands one to Matthew.</p><p>“Thanks, Kate.”</p><p>And one to Steven. “Thank you.”</p><p>And one to me. I take a sip. And flinch. “Ah, this is piss warm.” I hand it back to her.</p><p>“I just took it out of the refrigerator.”</p><p>With my eyes still on the game, I flick my wrist, shooing her back to the kitchen. “You have to take them from the back of the fridge. That’s where the cold ones are...Come on, A-rod! Get your head out of your ass and in the game!”</p><p>And we should pause here a moment.</p><p>Remember those dogs I was talking about? The cues? While I was watching TV, I missed a few. Take a look:</p><p>Steven is smiling, almost laughing. After all the punishment he’s received from my sister over the years, he’s developed quite the sadistic streak when it comes to other people getting their asses handed to them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Then there’s Matthew. God only knows what kind of sick and depraved penalties Delores has inflicted on that poor bastard, because he just looks scared.</p><p>Kate, on the other hand, is staring at my hand like it’s a cockroach. That she wants to squash. And then she gets an idea—a wonderful, awful idea. If you look hard enough, you can see the light bulb go on above her head. She smiles and leaves the room.</p><p>I missed all this the first time.</p><p>A few minutes later, Kate breezes back in carrying an ice bucket filled with beer. Nope, not beer bottles. Just beer. She stands next to the couch, and I—eyes still on the game—hold out my hand for my drink. And she proceeds to take her bucket and dump it over my f**king head.</p> <p>Splash.</p><p>I jump up, dripping and choking. “Jesus Christ!”</p><p>She asks me sweetly, “Is that cold enough for you, honey?”</p><p>I wipe my face with my hand and glare at her. “Are you crazy!”</p><p>She glares right back. “No—and I’m not a waitress either! Though I would hope you’d show a little more courtesy to them.”</p> <p>Matthew stands up. “I’m going to head down to McCarthy’s Bar and watch the game from there.”</p><p>Steven gets his jacket. “I’ll come with you.”</p><p>I wring out the bottom of my shirt. “Hold the cab for me, guys. I’ll be right down.”</p><p>Matthew laughs. And pats me on the back. “Sure you will, buddy. Bye, Kate.”</p><p>“Later, Kate.”</p><p>She doesn’t answer them. She’s too busy trying to kill me with her eyes.</p> <p>And with that, Matthew and Steven make their escape.</p><p>While Kate and I glower at each other.</p><p>Ding-ding.</p><p>Yep—that’s the bell. Round one just got started.</p><p>I begin calmly. When verbally sparring with an adversary, it’s always better to stay levelheaded. Choose your words carefully. Be smart.</p><p>And lethal.</p><p>“What is this about?”</p><p>Apparently, Kate does not share my philosophy.</p> <p>“You tell me, Drew! Tell me why the hell Matthew and Steven can say please and thank you and all I get from you is a...” She flicks her hand dismissively, mimicking my earlier action.</p><p>And once again, I stay composed. Still dripping—but composed.</p><p>“So you’re telling me you wasted good beer and ruined my Saturday afternoon because I forgot my manners?”</p><p>“Why couldn’t you just say it?”</p><p>“Why couldn’t you just say, ‘Hey, Drew, a thank you would be nice’? Was it necessary to be such a god damn drama queen about it?”</p><p>She folds her arms and scoffs, “I am not a drama queen.”</p><p>I hold up my fingers. “Two words, Kate: Chanel suit.”</p><p>You remember, don’t you? The one I bought her from Saks, after our first screw-fest?</p><p>Her eyes narrow. “What about it?”</p><p>My eyebrows rise. “What about it? You set it on fire.”</p><p>Yep—she and Delores made like homeless people and incinerated the freaking thing in the dumpster outside Kate’s old building.</p><p>She shrugs. “So? You were nothing to me, and I wanted to make sure everything you’d ever given me was nothing too.”</p><p>And that, boys and girls, is called proving my point. I smirk. “I really don’t need to say anything else.”</p><p>She rolls her eyes. “Whatever. I didn’t throw beer on you just because you forgot to say thank you. I’m not some hysterical nagging psycho-bitch.”</p><p>Right. And if it walks like a duck and talks like a duck...it’s a horse.</p><p>She goes on. “There are a lot of things that have been bothering me lately.”</p><p>“Like what?”</p><p>I’m actually curious. As far as I know, Kate and I have the perfect relationship. And I—of course—am the perfect boyfriend.</p><p>“Like how you never help me clean up in the kitchen. Every time we cook, you disappear while I’m stuck washing and drying and putting away!”</p><p>My voice becomes a little louder. Defensive. “You do most of the cooking. I figure you want to organize the kitchen! I don’t want to mess up your system.”</p><p>And this is partly true. But if I’m being totally honest, I’ve never seen my old man wash a dish in his life. Not even a frigging spoon. And Steven—the one time he tried to help The Bitch out with the laundry? She pissed and moaned for a week about how he ruined her gentle delicates, whatever the hell those are.</p><p>“And you never complained about it before. If you wanted my help, why didn’t you just ask me?”</p><p>Her volume reaches maximum decibels. “Why should I have to ask you? You’re a grown man! You should just know!”</p><p>And there it is, kiddies. The Famous Female Mind Fuck.</p><p>That’s short for: If you can’t read their minds? You’re f**ked.</p><p>And as for that composure I was so proud of? Yeah—he took a hike. “Well, I didn’t! For Christ’s sake, don’t give me enough rope to hang myself and then cut my balls off when I actually do! You should’ve just told me!”</p><p>Kate pushes my shoulders, and my shirt makes a wet squishing sound.</p><p>“Fine. You wanna know? I’ll tell you now.”</p><p>Despite what I just said, no, I don’t want to know. No guy likes being criticized. No one wants to be told they’re screwing up. So, like any man under attack, I go on the offensive.</p><p>“You’re not exactly a joy to live with all the time either.”</p><p>That stops Kate’s tirade in its tracks. Her brow furrows slightly. “What is that supposed to mean?”</p><p>Honestly? I have no idea. I have two reactions to anything Kate does: she makes me smile or she makes me hard. Smile, hard, smile, hard, smile...hard. Usually both at the same time. You know that song “Every Little Thing She Does Is Magic”? It’s a lot like that. Nothing she does turns me off. But I’m not about to let her know that. This is our first argument.</p><p>Winning is crucial. I have to set a precedent.</p><p>So, genius that I am, I spew the first thing that pops into my head. “You chew on your pens.”</p><p>“What?”</p><p>Too late now—might as well go with it. “When we’re working in the office. You chew on your pen. It’s distracting. It sounds like some crazed woodchuck is trying to eat its way through the drywall. Chck, chck, chck, chck.”</p><p>She thinks about it a moment. And shrugs. “Fine. I won’t chew my pen anymore. But we’re not talking about me right now. We’re talking about you...and...and how you disrespect me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Hold on. Back the hell up. I am an extremely respectful person. Always. Even to my do-me-once-and-don’t-ever-talk-to-me-agains—I was a goddamn gentleman.</p><p>“What are you talking about? How do I disrespect you?”</p><p>Her tone is clipped. Accusing. “You’ve never once changed the toilet paper roll.”</p><p>She’s kidding, right? Seriously. Tell me she’s f**king with me.</p> <p>“And how exactly does me not changing the toilet paper roll disrespect you?”</p><p>Her face goes blank, like she’s shocked that I don’t immediately understand the insanity that is her.</p><p>“Well, who do you think is going to change it?”</p><p>“Uhh...I don’t?”</p><p>She spreads her arms out, like I just said the magic words.</p> <p>“Exactly.”</p><p>I pinch my nose. Maybe if I stem the flow of blood to my brain, I’ll pass out.</p><p>She goes on, “You don’t think about it at all! You just assume, ‘Oh Kate will do it. She’s got nothing better to do’...”</p><p>I put my hand up, cutting her off. “No, no—I don’t think that! If I need toilet paper and it’s there, I use it. If it’s not, I improvise.”</p><p>Her face wrinkles. “Well, that’s just disgusting.”</p><p>So this is what it feels like to be stuck in quicksand. You kick and struggle...but you just keep on sinking.</p> <p>“You know what? Okay, fine. You’re right. I’ll change the toilet paper roll from now on. Problem solved.”</p><p>But apparently it’s not.</p><p>She folds her arms. “I don’t want to be right, Drew. I don’t want you to change the toilet paper roll because I’m yelling at you. I want you to want to change the toilet paper roll.”</p><p>Okay—now I start laughing. I just can’t help it.</p><p>“Why the f**k would anyone want to change the toilet paper roll!”</p><p>She looks offended. Highly. “For me. For me, Drew! You know, I happen to like doing things for you because I love you. But only if you appreciate it. When it just becomes...expected...then I feel degraded. And it makes me not want to do things for you!”</p><p>Her lips are moving. I know she’s trying to tell me something.</p><p>What it is? No clue.</p> <p>“I don’t even know what that means!”</p><p>She points her finger at me. And hops up and down. “Yes, you do! You’re just purposely not seeing my point to drive me crazy.”</p><p>No, I’m really not. Because judging from this conversation? She’s already there.</p><p>And then a thought occurs to me. “Are you on the rag?”</p><p>Her mouth opens wide. And you might want to take a step back, because I think her head might actually explode.</p><p>She grabs the nearest thing she can reach—a picture of us on vacation two months ago—and flings it at my head. Frisbee style. Lucky for me, she’s got bad aim. The shelf behind me? Not so lucky.</p><p>Smash.</p><p>“Why is it that whenever a woman is justifiably upset, the guy always blames it on PMS?”</p><p>Please. I’ve been on the receiving end of Alexandra’s premenstrual-induced psychosis often enough to recognize the signs.</p><p>“Oh, I don’t know...could it be because it usually is the reason?”</p><p>That’s when Kate starts to pummel me.</p><p>With both fists.</p><p>Like a kindergartener going to the mat over his favorite color crayon.</p><p>“You...are...such...a...jerk!”</p><p>Somewhere in between the second and the fifth punch, my dick peeks out from where he’s been hiding since the beer bath to reevaluate the situation. To see if there’s any way to turn this sorry state of affairs into something...a little more to his liking.</p><p>He thinks there is. And so I grab Kate’s wrists and back her up against the wall, holding her hands over her head.</p><p>Restrained—such a nice look for her.</p><p>Her chin is high, and her eyes are blazing. “I so don’t like you right now!”</p><p>I smirk. “I’m sensing that.”</p><p>She twists and pulls but can’t get free. Like some beautiful, exotic fish caught in a net.</p><p>“You’re an insensitive prick.”</p><p>I lean in, pressing the lower half of our bodies together. “I resent that. My prick happens to be extremely sensitive. Wanna see?”</p><p>Kate catches on to what’s coming and opens her mouth to protest. Which works well for me. I swoop in and cover her lips with mine. She tries to turn her head away, but I grab her chin and hold it tight. Which allows her to take one newly freed hand and bury it in my hair.</p><p>Before yanking with all of her motherfucking might.</p><p>I lift my mouth from hers. “Feisty. I appreciate you trying to make things more interesting, but it’s really not necessary.”</p><p>And then I’m at her neck, nipping and sucking, working my way down to her cle**age. Kate slaps at my shoulder, but there’s no real effort behind it. Which means I’m wearing her down.</p><p>“I’m still mad at you.”</p><p>“I’m sure you are.”</p><p>I rest my nose against her skin, inhaling deeply. Then I take one nipple in my mouth—over her dress—and suckle it hard.</p><p>See, Kate’s br**sts are kind of like start buttons. No matter how tired or moody she may be, a little attention to those bad boys switches things around real quick.</p><p>Her head slams back against the wall. And she moans, holding my head in place.</p><p>We have ignition.</p><p>I grip her knee and hoist it up around my waist, lining us up, and grind against her. And despite my soaked clothes, I can feel how hot she is.</p><p>Turned on.</p><p>“You’re a bastard.”</p><p>I chuckle. “So you’ve said.”</p><p>I kiss her again, our tongues tangling in their own sensuous battle. Then I slide my hand between us, down her panties. She’s slick and smooth. Velvet wetness. When I push two fingers inside her, her voice changes. It’s all breathy and moaning—not a trace of pissed-offness to be heard.</p><p>“God...Drew...”</p><p>And then she’s pulling me against her and kissing me back with all she’s got. Telling me without words what I’ve known all along: horny and angry are a fabulous combination.</p><p>I push my shorts down and drag both of her legs up around me. Pressing her into the wall.</p><p>But just as I’m about to slide into home, Kate puts her palm against my forehead and pushes it back.</p><p>“Wait...no...wait...”</p><p>What? Wait? I hate waiting.</p><p>“What?”</p><p>Even though she’s panting, her eyes are round and dark with...worry. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“We have to talk about this. We can’t just cover all our problems with sex. I have some valid issues here, and if this is going to work, we need to figure this out.”</p><p>I press my forehead to hers. Thinking. Or trying to, anyway.</p><p>With my c**k so close to Mecca, it’s difficult to remember my own name at the moment.</p><p>And then it all becomes clear. And I look at Kate’s face. “So, in a nutshell...you want me to stop being a dickhead?”</p> <p>She mulls it over. And then she nods.</p><p>“Yeah. Pretty much.”</p><p>I nod too. “Got it. That’s really all you needed to say, baby.”</p><p>And then those lips that I love break into a big happy bang-me-up-against-the-wall smile. “Okay, then.” She scrapes my bottom lip between her teeth before moving down my jaw and nibbling my neck.</p><p>Then she whispers, “You’re going to miss the game.”</p> <p>I shred her underwear and get what’s left of her dress out of my way.</p><p>“Fuck the game.” That’s why God gave us DVR, right?</p><p>She giggles wickedly. And looks me straight in the eyes.</p><p>“I’d rather you f**k me.”</p><p>Have I mentioned how much I absolutely adore this woman?</p><p>I lean back just long enough to rip my sopping shirt over my head. “God, I love you.”</p> <p>Kate giggles again. And in her best Han Solo impression, tells me, “I know.”</p><p>Okay, ladies—what have we learned from this example? Keep it simple. Be broad but don’t bog us down with specifics. It’ll only confuse us.</p><p>You’re an ass**le.</p><p>You’re a slob.</p><p>Stop being that way.</p><p>Any of the above should work just fine.</p><p>As for Kate and me? We had our first living-together-in-sin fight. A milestone. Go us. Overall, I think it went pretty well. In fact, if all of our arguments end like this? I won’t complain at all.</p><p>No. Wait. I take that back.</p> <p>If all of our arguments end like this?</p><p>I plan on complaining a whole hell of a lot.</p><p>What A Difference A Year Makes</p><p>Dates are important to women. Particularly to women in relationships.</p><p>There’s all the major holidays: Christmas, Valentine’s, Easter. There’s the birthday—obviously. Then there’s the day you met, the day you went out, the day you dropped the L-bomb, the day you got engaged, the day you got married...</p><p>I could go on, but I really don’t want to.</p><p>Because here’s the thing—guys don’t give a shit about any of that stuff. When we pretend to care? It’s only to avoid the verbal ass-whipping that’s sure to follow if we act like we don’t. For us, there’s only one day worth commemorating. One moment that deserves recognition. The ultimate holy day of obligation.</p><p>I like to call it—the Fuckiversary.</p><p>It’s the day you first sealed the deal. Bumped uglies. Hit the homerun.</p><p>Or in my case—the grand slam.</p><p>I mean, seriously, you meet new people every day; it’s a common occurrence. But unless you have a stellar record like yours truly, you don’t screw a new person every day. So for guys, the first time you did the deed is definitely a day to celebrate.</p><p>And for me and Kate? That day is today, kiddies. It’s huge. One year ago, the course of my life was altered forever. The foundation of my existence was shaken.</p><p>And my bed frame.</p><p>That’s why I’m in the kitchen right now. See me? Whistling, slicing fruit, and squaring a variety of cheeses? They’re for later. We’re going to need them—gotta keep the energy up. Because, in my book, you don’t just memorialize a f**kiversary. You top it. And considering the Olympic-worthy high bar that was set that night? I’ve got my work cut out for me.</p><p>But I’m always up for a challenge. Pun intended.</p><p>I don’t want you to think that f**kiversaries are just about humping like dogs either. Although, that position is always fun.</p><p>But no, it’s also about tradition. Sentiment.</p><p>Presents.</p><p>For a first wedding anniversary, gifts are supposed to be made of paper or some kind of useless crap like that. My gift is so much better—Santa’s elves can eat their hearts out. Kate is going to lose it when she sees it. Her jaw’s gonna hit the floor. And her panties will be right behind it.</p><p>The front door opens.</p><p>That would be the lucky lady herself.</p><p>I left work at noon—had preparations to make—so I haven’t seen her since lunch. I walk into the living room. And there she is—bag in hand, a mid-length trench coat wrapped around her scrumptious little body. Her hair is down and shiny. Spiked black heels encase the tasty toes I like to suck on like a hard candy.</p><p>She smiles.</p><p>And as with every other time—it hits me like a punch to the gut.</p><p>“Hello, Boyfriend.”</p><p>“Girlfriend.”</p><p>Sickening, aren’t we? There’s a garbage can in the corner if you feel the need to puke.</p><p>I stalk towards her. “How was your day, dear?”</p><p>She puts her bag down, but leaves the coat on. “It was...distracting.”</p><p>I’m about to ask her what that means, but she cuts me off.</p><p>“What are these?” She’s referring to the lighted candles and rose petals strewn about the place.</p><p>Depending on your lifestyle, there are different definitions of romance. For some it’s classical music, a foot massage, or satin sheets. Personally, I happen to think a blow job during a Yankee game is ideal. But Kate is a more frilly, girly, kind of romantic. So these are for her.</p><p>“Candles.”</p><p>She smirks. “Thank you, Captain Obvious. I mean what are they for?”</p><p>I walk around her, my eyes caressing every curve slowly—like my hands will be doing shortly. Then I lean in and whisper next to her ear, “They’re part of your surprise. Because today is a very, very special day.”</p><p>She shivers—in the good kind of way. And her voice drops low. “I know. One year ago today, I rocked your world.”</p><p>“You rocked my world?”</p><p>She nods, and her eyes sparkle. “Yep. Right off its axis.”</p><p>“I’m pretty sure it was the other way around.”</p><p>Her tongue peeks out and wets her lips. “You’re sadly mistaken, Mr. Evans.”</p><p>I move in closer. “Maybe you need a refresher, Miss Brooks.”</p><p>She tilts her head, looking up into my eyes. Daring me.</p><p>“I think a refresher is exactly what I need.”</p><p>My hand snakes around her neck, pulling her against me. And our lips mold together. A year ago, I didn’t appreciate the value of kissing. Then it was just a teaser—like the never-ending stream of previews you have to sit through in the movie theater until you get to the main attraction. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But with Kate, kissing is a whole f**king event in and of itself. The way she tastes. The way she moans. The way her tongue slides against mine. It’s goddamn dizzying.</p><p>My hands come up to remove her coat, but she grabs them. And she pulls back, a little out of breath. “Wait. Not yet. I left work early today—to pick some things up. For you.”</p><p>“I got you something too. Can I go first?”</p><p>I like being first. It’s just how I am.</p><p>“Okay.”</p><p>I stand in front of her. Then I slowly unbutton my shirt, keeping eye contact the whole time.</p><p>Kate tries to guess. “Did you take strip-tease lessons?”</p><p>I smile. “No. But I’ll keep that in mind for next year.” My dress shirt hits the floor. I lift my white T-shirt over my head. And Kate’s hand rises to my chest and trails down my stomach. I back away and wag my finger. “Patience, Kate.”</p><p>She stomps her foot and pouts. And I want to tell her just where she can put those pouty lips. But I don’t. Gifts come first.</p><p>Then it’s our turn.</p><p>Ha—did you get that?</p><p>I turn to the side and remove the gauze bandage that covers my upper right bicep. And then she sees it. Her eyes glaze over, and her jaw goes slack.</p><p>And she whispers, “You got a tattoo...of my name?”</p><p>It’s a black whip—that spells out KATE.</p><p>I hope you weren’t thinking it was going to be an engagement ring or something. Screw that. In today’s day and age, rings don’t mean much. Ask any married man who frequents the titty bars—rings can be removed.</p><p>But a tattoo? That’s forever. Permanent—unless you like the idea of having several layers of skin scraped off.</p><p>Kate’s fingers slide around it disbelievingly. “I love it, Drew. It’s the most...amazing thing anyone’s ever done for me. I love you.”</p><p>I cup her cheek with my hand. “Not like I love you.”</p><p>She smiles for a moment. But then her expression changes. And she looks...disappointed.</p><p>“What? What’s wrong?”</p><p>“Nothing...it’s just...you branded my name on your flesh. I guess I just feel a little stupid. All I got you were toys.”</p><p>My ears perk up. Like a dog hearing the rustle of his food bag.</p><p>“Toys? Would these toys be...naughty...in nature?”</p> <p>Kate bites her lip. And nods.</p><p>Sweet Jesus. My mouth goes dry. “Can I...see them?”</p><p>Some guys aren’t into toys. Dildos—with their bells and whistles—can be intimidating. But not to me. I think of them as tools of the trade. Power tools, to be exact, and there’s no shame in using them. Even a master carpenter wouldn’t try to build a house without a handsaw and hammer, you know?</p><p>Kate takes a bag out of her purse. She reaches in and pulls out a short, velvet-tipped riding crop.</p><p>And my c**k comes alive like Frankenstein’s monster.</p><p>For all you ladies out there? Take notes. Sex toys are the ultimate gift. Fun for the whole family. Okay, not really. But they’re definitely the gift that keeps on giving.</p><p>She hands it to me. “Remember a few weeks ago? In the living room when you...you know...with your hand?”</p><p>My voice is breathless. “Yeah.”</p><p>Of course I remember. You might not know it looking at her, but deep down, Kate is a total c**k tease. She likes to push me to the edge—see me snap. And on that particular day, she’d been taunting me all morning, walking around braless in a barely-there tank top and underwear. At one point, she sat on my lap and wiggled around.</p><p>Then she hopped off claiming she didn’t have time to finish what she’d started because she had work to do.</p><p>And I lost it. I pulled her back, threw her across my thighs and spanked her.</p><p>Like the naughty girl she was. Wasn’t anything to write The Story of O about—just a few short slaps to the ass. But it was fun.</p><p>Kate smiles shyly. “I liked it.”</p><p>Oh, baby—she wasn’t the only one.</p><p>Kate reaches back into the bag from heaven. And pulls out a small silver cylinder.</p><p>It’s a vibrator. It almost looks like one of those practical-joke electric buzzer things we all had when we were kids. She hands it over.</p><p>“It’s called a—”</p><p>“Bullet,” I finish for her. “Yeah, I know.” I stare at it. And images of Kate writhing under me—bordering on the brink of insanity and begging to come—fill my head.</p><p>My voice comes out rough, but worshipful. “You are the most awesome girlfriend ever.”</p><p>I wrap my arms around her and kiss her. And it’s long and slow and appreciative.</p><p>Kate pulls back and smiles big. “There’s one more thing. I saved the best for last.”</p><p>She slides the belt of her coat slowly from the loops and grips the lapels with both hands. Then, in one fluid motion, she drops the jacket to the floor.</p><p>And I almost come on the spot.</p><p>Lots of women think lingerie is the magic ingredient of seduction. They buy something lacey and expensive and expect us guys to be drooling into our frigging laps. But it doesn’t really work that way.</p><p>At Christmas, for example, when you see a big, brightly wrapped package under the tree with your name on it, you’re interested. But it’s not the wrapping paper you’re looking forward to. It’s the present inside. Lingerie works the same way. It’s nice—but naked is always better.</p><p>Except for this.</p><p>This is the wet dream of every man born after 1975.</p><p>It’s the elite of eroticism.</p><p>The ultimate fantasy.</p><p>Oh yeah—it’s the Princess Leia bikini.</p><p>My mouth drops open. “Oh...my...motherfuck.”</p><p>Kate spins slowly. Proudly. “Do you like it? It’s crotchless.”</p><p>I’m speechless.</p><p>Seriously. I have no words. I’m pretty sure every ounce of blood in my body has been rerouted to my dick, so there’s not enough left in my brain to form them.</p><p>Kate’s voice is hushed and tempting. “If you promise to be good...I’ll let you chain me up like Jabba did to Leia.”</p><p>I break out of my horny-induced trance. I grab her upper arms and haul her against me.</p><p>“Baby, the only thing I’m promising is you won’t be able to walk tomorrow.”</p><p>I pick her up and throw her over my shoulder. She screams. And laughs. And I walk down the hallway, passing by my tray of prepared snacks.</p><p>Because, really—who the hell needs food?</p><p>I slide Kate off my shoulder, gripping her sweet little ass on the way down. I turn her around so her back’s to me. Then I bend the riding crop halfway and let it fly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Snap.</p><p>It lands on the exposed skin of her ass cheek, and she lurches forward with a squeal. Then she giggles. “Maybe this wasn’t such a good idea. With great power comes great responsibility, Batman.”</p><p>I take my pants and boxers off in record time.</p><p>“Don’t you worry, sweetheart. I plan on satisfying every responsibility I have, again and again and again for good measure. Now get on the f**king bed.”</p> <p>She does—on all fours. Her hair falls over one shoulder, and her eyes are on mine. Christ, look at her. All laid out—just for me—waiting.</p><p>I feel like a goddamn kid in a candy store.</p><p>The only question is: Where to start first? It’s always a fabulous conundrum. Every one of Kate’s assets are equally deserving of attention. Hell, even the backs of her knees are sexy.</p><p>I slide the velvet tip of the crop across her chest, between her br**sts, and down her stomach. I pause between her legs.</p><p>And rub.</p> <p>The beauty with this kind of tool is that the nerve endings rush to wherever it touches, making the skin hypersensitive. Taut—like an over-tuned guitar string just dying to get plucked.</p><p>Kate’s eyes close, and her head tilts back. I rub the crop over her pu**y, back and forth.</p><p>Then I smack it lightly.</p><p>And she gasps.</p><p>When I was ten, my parents got me a racing bike during the height of the BMX craze. I remember thinking at the time that it was the greatest gift I’d ever get.</p><p>Boy, was I a moron.</p> <p>I lean closer to the bed, over her, and kiss a trail up Kate’s spine and around her neck.</p><p>I pull the gold bikini down from one plump tit and latch on.</p><p>Delicious.</p><p>Her nipple’s already a stiff pink peak, but I flick my tongue over it anyway. Kate moans. And lifts one hand to the back of my head.</p><p>I smack her ass with the riding crop. “Don’t move.”</p><p>Her hand snaps back to the bed.</p><p>This...submission. It’s not about degradation or humiliation—it’s about faith. Leaving yourself completely open, totally exposed. Offering everything you’ve got, everything you are, to someone else. Letting them see the real you, not just the person you want to be. Every sin, every fantasy, because you know they’ll never judge you. Never hurt you. Some people go their entire sorry lives without knowing what real trust is.</p><p>But I know.</p> <p>I have it.</p><p>With Kate. Only ever with her.</p><p>I give her nipple one last lick and move on. I put the riding crop down and twist the vibrator on.</p><p>Then I move down to Kate’s ass. A bright red square marks one cheek. I soothe it with my mouth. And bring the buzzing bullet between her legs, moving in wide, slow circles—coming close to her clit but not actually touching it.</p><p>Anticipation, satisfaction—pleasure and pain—it’s a delicate balance. When combined in the right amounts, the sensation can be overwhelming. And because I’m an expert on Kate’s body, I know just how to play her. When to speed up and slow down. If Kate were an orchestra, I’d be a maestro.</p><p>She moans and wiggles her ass, trying to move her hot spot closer to the vibrating toy. But I’m not having it.</p><p>Not yet.</p><p>I grip the gold bikini bottom from the back, drag it down her hips and toss it on the floor. Because as fun as crotchless panties are, Kate Brooks’s cunt is just too f**king pretty to cover.</p><p>I move the bullet in ever tightening circles in front. And then I dip my head down between her spread legs from behind. I nibble around the outside, taking my time. Then, I plunge my tongue deep inside.</p><p>The bullet finally makes its way to her clit—and I press it down firmly.</p><p>She moans as she comes. Her forehead hits the bed and her arms and legs tremble with aftershocks. She pants, “Drew...please...I want...God...”</p><p>All the nightingales out there? They should just freaking kill themselves with a bird-sized BB gun.</p><p>Because Kate begging for it is by far the sweetest sound God ever made.</p><p>“What, baby...what do you want?”</p><p>Instead of pleading for my cock, like I thought she would, Kate turns the tables on me. She spins around, and before I can blink, my painfully hard dick is down her throat.</p><p>My head rolls back. And I’m pretty sure I just went blind.</p><p>“Jesus...Kate...”</p><p>She sucks hard and moves her lips up and down fast. Yet as unbelievably perfect as her mouth feels, I find the willpower to pull out. I turn her around, grab her hips with my hands, and thrust into her from behind. She groans long and low. With relief and satisfaction.</p><p>Or maybe that was me.</p><p>We’re both so f**king turned on—I can’t tell anymore.</p><p>She pushes back against me as I surge forward. Kate’s head is low, and her hair swings like a pendulum as we rock and grind against each other. Clashing. My strokes gain force. Driving us forward.</p><p>But I need more. I need to feel her—be closer. I nudge her further onto the bed and climb on behind her.</p><p>Then, still buried inside, I pull Kate up by her shoulders and bend my knees so she’s straddling me—but facing away. Reverse Cowgirl Style.</p><p>My chest presses against her back. Her hair tickles my face as my lips devour her neck. She’s everywhere—surrounding me. Her scent, the feel of her against me, the taste of her skin, the sound of her voice crying my name.</p><p>It’s consuming.</p><p>Overwhelming.</p><p>Like drowning.</p><p>And if you’ve got to go? Trust me—this is the f**king way.</p><p>My arms cross over Kate’s chest with my hands on her shoulders, pushing down as my hips thrust up hard.</p><p>And her words come out high-pitched and urgent: “Drew...Drew...I’m coming.”</p><p>“Fuck...I know...I can feel you.”</p><p>Her walls tighten around me like a starved boa constrictor.</p><p>And even though I want to hold out, even though I don’t want it to end yet—or ever—my dick apparently has other ideas, and I explode deep inside her.</p><p>My hands fall down to Kate’s waist, pulling her closer to me. Her head rests on my knees, and my mouth is against her back.</p><p>We’re both panting, out of breath.</p><p>But I find my voice first.</p><p>“Best...gift...ever.”</p><p>Kate laughs against my legs. “Couldn’t agree more.”</p><p>Much, much later, Kate and I lay in the middle of the bed, on top of the covers. A tangled mess of limp limbs and sweaty skin.</p><p>I like this part.</p><p>That may be pansy to admit, but let’s be real. Kate’s name is tattooed on my frigging arm. Trying to pretend like she doesn’t have my balls in her purse? Really kind of useless at this point. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her head rests on my chest. And I feel her smile before she whispers, “Tell me something about you. Something no one else knows.”</p><p>I look at the ceiling. And call forth my deepest, darkest secret.</p><p>“I have Justin Bieber on my iPod.”</p><p>She giggles, “Really?”</p> <p>“Yep. That ‘As Long as You Love Me’ song. And if you ever tell the guys, I’ll deny it till the day I die.”</p><p>She traces my abs with her fingers. Then I say, “Now you. Tell me something I don’t know yet.”</p><p>She kisses my chest slowly as she thinks. Then she looks up into my eyes. “Nothing. You know absolutely everything there is to know about me.”</p><p>“All right. Then...if you had three wishes, what would you wish for?”</p><p>I once told Kate I wanted to make all her dreams come true. And I didn’t think it was possible at the time, but she means even more to me now than the night I told her that. So if there’s something she wants, something she needs? Heaven and hell better watch their backs—cause I’ll knock both on their asses to get it for her.</p> <p>She thinks some more. And when she speaks, her voice is hushed with surprise and gratitude. “I wouldn’t wish for anything.”</p><p>“What do you mean?”</p><p>“I mean, at this moment, I have everything I want. My mother’s happy; I love my work. And anything more I ever would’ve wished for...is right here in front of me.”</p><p>I swallow hard. Hearing that answer? That’s better than a whole sack full of sex toys.</p><p>Okay—maybe not the riding crop.</p><p>But it’s definitely close.</p> <p>I frame her face with my hands and kiss her.</p><p>Life’s funny, you know? I mean, did you really think a year ago—when Kate and I were going at it, falling through my front door—that we’d ever end up here? At the time, I figured it would be just another one-nighter. Amazing—no question—but still just a fantastic scratch for my long-suffering itch.</p><p>And yet here I am.</p><p>Committed.</p><p>Monogamous.</p><p>Completely, disgustingly infatuated.</p><p>And I couldn’t be happier.</p><p>And this is just year one. Not to go all Notebook on you, but Kate and I have a hell of a lot more years ahead of us. A lifetime’s worth.</p> <p>And I plan on making the most of every f**king one of them. </p> </body></html>"]