["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Kyle looked down at the comp pad in his hand and got his first look at Tarr Bonnet. The man was young, exotic and gorgeous, a humanoid shifter from the planet Tygeria who was also one of the most notorious men in all the galaxies. This was Kyle’s first look at him and something about the man fascinated him. He traced a finger down one of the stripes on the face in the picture.</p><p>Extremely fit and muscular, Tygerians were even bigger than the Lycans, at an average of perhaps seven feet tall. Their skin was a golden-brown, and most were fair-haired. Tarr Bonnet’s hair was long and curly and a shade somewhere between red and gold. His eyes, like all of his people’s, were catlike, slanted, and a rich emerald green. In addition, the Tygerians had exotic, black tiger-like stripes running just under their skin, making the people look like some outlandish fantasy creature.</p><p>Gods, he was a gorgeous thing, and Kyle had to adjust himself a little as he stared down at the picture. Too bad he was a thieving, cold-blooded bastard of a Jolly Roger pirate.</p> <p>Blayde walked up behind him and stood looking over his shoulder. “Nice looking, isn’t he?”</p><p>Kyle slanted him an incredulous glance. Calling Tarr Bonnet nice looking just wasn’t adequate. The words were too tame, too ordinary for what he was.</p><p>Kyle nodded anyway and traced his finger over the picture again. “This one won’t be easy to catch,” he said. “All of the Tygerians are strong and smart, from what I’ve heard.”</p><p>“I know. Tarr Bonnet is for sure. That’s why I’ll need your help. I’m not taking Ryan on this one, even though I hate to be away from him that long. If anything went wrong...”</p><p>“Oh hells, that’s right. The Tygerians love humans. They prefer them, they say, over all other species.”</p> <p>“Yes,” Blayde replied, his lips tightening. “For their submissive love slaves. If he got his hands on Ryan he’d have him packaged up and sold to the highest bidder before I knew what hit me.”</p><p>Ryan and Blayde had been mated for almost two full cycles, and still couldn’t keep their hands off each other. Blayde had every right to be cautious about him, though. The young man was beautiful and a former porn star, whose vids had been circulated all over the known galaxies. Not to mention the fact that he was a blond humanoid from the planet Earth, and exactly the type the Tygerians were so fond of as their concubines. They would pay a lot for a prize like him if they could get their hands on him. Though the Alliance would love to put a stop to it, the Tygerians had been trafficking in human slaves for many years, and paid little attention to anything the Alliance wanted. Tygeria had been at war with the Alliance for over a century.</p><p>It had all started when the Alliance of Planets had discovered how rich Tygeria was—rich beyond belief—in diamond deposits. Probable reserves using Alliance standard measures had been estimated at five hundred million cubic meters of ore at an ore grade of 2.29 carats per one hundred cubic meters. With diamonds as the primary monetary system of the Alliance, its governing body first tried diplomacy—and when that didn’t work, they tried invasion.</p><p>The Tygerians fought off the Alliance forces with unparalleled ferocity. In the first wave of invasion, almost ninety years before, the invading starship troopers had been totally annihilated by the Tygerian forces when they shifted into massive tigers and wiped out the first wave of troopers to the last man. At that time, they took no prisoners, and made an example of the ones they managed to catch. The bodies the Alliance forces managed to recover had been ripped to pieces.</p><p>Then an Alliance ship had crashed on the planet while attempting a covert operation, and its entire crew of one hundred and fifteen men had been taken mostly alive. The Tygerians had imprisoned them and used them in their Exhibition Games, gladiator-style games that were fought before a huge crowd of spectators, with only the most fit and brave Alliance warriors surviving to fight again. At the end of the games only a handful of men had survived, and they were taken as love slaves by their victorious opponents in order to humiliate the Alliance.</p><p>They paraded the men around the arena naked and almost defenseless. Young Tygerian warriors came out to face them, and the crowds in the stands gave a thumbs up or down to determine which of the Alliance warriors deserved to live after the dust settled.</p> <p>The Tygerian battle commander himself had taken one of the survivors as his slave and concubine and fallen in love with him. Since then, Earthan humanoids had become very popular on the planet as love slaves, but any humanoid species whose planet belonged to the Alliance was fair game.</p><p>Now, almost a hundred years later, neither diplomacy nor war had brought the Alliance any closer to their goal of taking over the planet. Tygeria was one of the largest planets in the known galaxies, with resources and technology their enemies could still only guess at. The entire planet was shrouded in thick gases that shielded its surface from its sun’s searing rays and from all but the most determined alien intrusion. The Tygerians wanted only to be left alone, but with the diamond standard growing higher every year, it was unlikely that would ever happen.</p><p>Since the Tygerians became aware that diamonds were the monetary standard of the Alliance and its planets, diamond mines had begun to proliferate the planet. As a result, most of the Tygerians now had little need for any other income, and the wealthy Tygerians had plenty of time to indulge their leisure activities, like trading in gorgeous, young, male love slaves. The Alliance was desperate to stop it, and that was where the Balanescus came in. Considered the best bounty hunters in the known galaxies, they had a reputation for always getting their man.</p><p>The one the family was after now was Tarr Bonnet, the foremost dealer in Tygerian love slaves. It was a lucrative business and Tarr thumbed his nose at the Alliance laws.</p><p>To obtain the slaves, Tarr Bonnet had circumvented the huge and far-reaching influence of the Planetary Alliance and set up trade agreements with the Nilaniums, or the so-called Jolly Rogers. Most of the Jolly Rogers were Nilaniums, an ancient culture, dating back thousands of cycles. The Nilanium home planet was destroyed when their sun went supernova two centuries before, but rather than find a home on another planet, the survivors became nomads, traveling the galaxy in their ships. Like the Tygerians, they were warlike and unfriendly to outsiders, considering themselves superior to most other races.</p><p>At some point in their history, the Nilaniums became space pirates, known as Jolly Rogers, so-called after the skull and crossbones flag they painted on the sides of their ships. Little more than cutthroats and thieves, the Rogers made their living preying on the ships up and down the space corridors. Usually piloting small, fast ships, they used docking technology to allow them to latch onto a larger starship, and, once docked, enter by force, rob and terrorize the crew before taking off and losing themselves in the vastness of space. If the crew had any young, good-looking members or passengers, Tarr and the Rogers would often take them along as captives to be sold on the slave markets. They became just another valuable commodity to be sold or traded.</p><p>“How did a Tygerian come to be a member of the Rogers anyway?” Kyle asked.</p><p>Blayde shrugged. “I’m not sure, but he’s a major player and runs most of their slave traffic.”</p> <p>“Tygerians only buy males, though, right?”</p><p>“Yes. Tygerian males and females don’t mix. That is, the females don’t live with the men and don’t want to. The gods only know how it got started—some say the early Tygerians bred too much and their planet was seriously overpopulated and running out of resources, but it’s only speculation. For whatever reason, the women have stayed in their own sectors for hundreds, maybe thousands of cycles and the men in theirs. They breed with each other only by artificial insemination—then if the child is female, it’s raised by the mother. If male, the father takes it to rear. That’s one reason the Tygerians purchase love slaves. The slaves rear the babies for them.”</p><p>“What, like nannies?”</p><p>Chuckling, Blayde shook his head. “No, more like concubines. They call them their nobyos. To them, it’s almost like a spouse and another father for their children. They keep them very submissive, but it’s said they’re well-treated.”</p><p>“So Bonnet trades in these love slaves, or what did you call them? Nobyos?”</p><p>“Yes, primarily, but never underestimate him. He’s tough and ruthless and able to shift into one of the Tygerian tygers, huge, vicious creatures—more than a match for our wolves.”</p><p>Kyle’s family, the ancient Balanescus, were Lycan shifters, commonly referred to as werewolves, though there were significant differences. Lycan wolves had supernaturally strong metabolisms and lived a long time, but weren’t supernatural or immortal, by any means. If their opponent was big enough and strong enough, they could be defeated. Tygerian tigers, it was said, could be up to sixteen feet long and stood at least five to six feet tall at the shoulders—tough to beat by anyone’s standards.</p><p>“Remind me again why I decided to help you with this bounty. I was all set to enjoy a couple weeks off.”</p><p>Blayde clapped him on the back and laughed. “Just be careful Bonnet doesn’t get the drop on you or else you’ll wind up being led around on a leash as some Tygerian’s pet nobyo. You always were the pretty one in the family.”</p><p>Kyle’s snarl and look of outrage had Blayde bounding out of reach and laughing at him. “Sorry, just kidding! But I’m serious about one thing. If he catches either one of us, we’ve had a bad day. We could really wind up as Tygerian nobyos, taking care of little tiger babies. Both of us are young enough to be concubines, and we’re Lycan alphas. Those facts alone would appeal to some of the Tygerian buyers. They hate us in particular, because the prisoner of war camps for captured Tygerians is on Lycanus. Bonnet’s just twisted enough to think enslaving and selling us would be some kind of humiliating coup, not to mention making an example of us for what happens to anyone who comes after him.”</p><p>“Okay, duly noted. We both need to be careful. Do you have a good lead on him yet?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blayde nodded. “That’s why we’re on our way to Leeria. He has some kind of hangout there—a bar of some kind. It’s fairly near Jayron, as a matter of fact.” Kyle knew that out-of-the-way planets like these were often used as the Rogers’ bases of operation, and this sector in particular was being used more and more by the Rogers in this star system.</p><p>“The Leerians have been trying to buy a shipment of Lycan bauxite ore for a while now, but no one wants to risk a delivery. Of course, you remember what happened on Jayron with Nikolai.”</p><p>Kyle remembered only too well. He’d been the one piloting the ship when his brother Nikolai went down to arrange the payment and delivery. The next thing Kyle knew, Nikolai had pressed a panic device he wore on his clothing, and using safeguards already in place, Kyle had taken off immediately, leaving his brother on the planet’s surface. It had almost killed him to do it, but he was following strict protocol. That fiasco had been due to Jolly Rogers, too, and though it had worked out well enough—Nikolai had found his mate in the Jayronian prince, the exotic and beautiful Jagger—it wasn’t an experience Kyle ever wanted to repeat.</p> <p>“So you think they’ll attack and try to steal our shipment, like they did on Jayron?”</p><p>Blayde shrugged. “I’m not sure. It’s a distinct possibility, and we have to be ready for that. But I think the Leerians won’t allow it. They’re already having trouble finding anyone willing to trade with them. An attack on our ship would likely end trade for them altogether. They’ve made extravagant promises about safe passage for the ship, so I think we’ll be okay on that score.”</p><p>“Then how will we find Bonnet?”</p><p>“I have information on this hangout of his on Leeria. It’s a bar he either frequents or owns, and he’s supposed to be there most evenings he’s on the planet. It’s on the seaside, near the docks and called Blood in the Water, after the rust-colored water in the Leerian oceans.”</p><p>“I can’t say I like that name too much, considering,” Kyle said. “So what’s your exit plan? No way we can just march in there and pick him up.”</p> <p>“No, but he’s all Tygerian in one way, at least. He likes good-looking men. So you being the aforementioned pretty one and all...”</p><p>“Oh no! You’re not using me as bait!”</p><p>“I prefer to think of it as a strategic ploy to entice him outside.”</p><p>“Balls! Which, by the way, I have no intention of risking on your behalf. Now I’m beginning to see why you left Ryan at home. Too dangerous for your boy, so hey, let’s call Kyle. He’ll do it. Well, not this time.”</p><p>“Oh c’mon Kyle, give me a break. There’s very little risk—probably. I’ll be right outside, and the minute you step out with him, I’ll be ready with a tranquilizer gun. He’ll never know what hit him, and he’ll wake up back on board our ship in a holding cell.”</p><p>“Seems to me you’re skipping a whole lot of steps. You just told me the man’s not stupid. How the hells am I going to get him to follow me outside to some dark alley? Then even if I do manage to get him outside and we tranq him, how do we get him back on the ship? He’s not exactly small, you know, if he’s a typical Tygerian. And what are his men doing all this time we’re luring him outside, knocking him out and toting him to the ship? The idea’s crazy!”</p> <p>“Okay, valid points. So maybe I didn’t think it through so well. What if I offer to sell you to them? We’ll set up one of those sting operation like in some of those Earth vids that Ryan watches. I could say you’re having an affair with my mate behind my back or something, and I found out and want to get rid of you. I could ask for a meet and then we grab Bonnet—hold a gun on him, force whoever comes with him off the ship, and take off.”</p><p>“That could work, I guess. Despite the fact that, once again, my ass is on the line.” Kyle angled a wry look at Blayde.</p><p>“Okay, then you make the offer to sell me. Say that I’ve been after your mate or whatever.”</p><p>“They won’t know I don’t have a mate?”</p><p>“How would they know that, Kyle? It’ll work. They’re all disloyal bastards and think everybody else is too. Bonnet will totally buy into the story, because it’s probably the kind of thing he would do.”</p><p>“How do we set up a meeting with him?”</p><p>“We know his hangout. After we deliver our shipment, we’ll go there for a drink and scope it out. Then we play it by ear, and try to find a way to speak to him. If you can get close enough, you can set something up.”</p><p>“I still think we should have brought more men with us.”</p> <p>“Everyone was busy. And Lucas has the new baby.”</p><p>“And his new mate. Thank the gods I haven’t been trapped with the curse yet. Larsson and I are the only hold-outs.”</p><p>Blayde settled himself beside Kyle in one of the two chairs on the comm deck. “You’ve just been lucky so far. When the curse hits you, it hits hard and you can’t resist it. You just wait—you’ll see,” he warned, though Kyle only smiled at him. It was true the curse hadn’t struck him yet, though it had taken its toll on his brother, Nikolai, and three of his cousins, Blayde, Lucas, and Konnor. Only he and his youngest cousin, Larsson, had remained unscathed.</p><p>Until the curse struck Blayde, they’d thought it was an old legend and put little credence in it, though their elders declared it was all true. According to the legend, Kyle’s great-grandfather, Gunnar, had seen a beautiful human woman on a voyage to Europa, one of the moons of Jupiter, and had kidnapped her. The inhabitants of the moons of Jupiter had long been rumored to practice witchcraft, but Gunnar was wild and more than a little crazy. He wasn’t interested in the woman for himself—his preference was for handsome males, but the female Lycan who was his mate liked other females.</p><p>He took the woman to give to his mate as a companion, to help her raise their children. Sometimes Lycans took these “companions” as lovers. In fact, Gunnar lay with the woman at the same time he impregnated his mate, so that both produced sons at around the same time. The human female produced a son, red-haired and handsome, half Lycan and half human. And though she eventually grew to love her Lycan mistress, the human female never made a secret of her utter hatred for Gunnar.</p><p>Gunnar made a second trip to Europa and kidnapped the companion’s handsome twin brother to be his own concubine. Not only was Gunnar intrigued by his beauty, but since his mate was now really more interested in her lovely human, he was free to indulge his own needs. He thought he would make an excellent love slave. He had no idea that the man was also a powerful warlock.</p><p>The male, whose name was Ivan, was furious with Gunnar, but also fiercely attracted almost against his will. He couldn’t bring himself to hurt Gunnar, it was said, though his sister urged him to. He eventually decided to curse all of Gunnar’s descendants, not in a hurtful way, but one that would ensure all of them would be males and all alphas. It was well-known that alphas had great difficulty living together in harmony, so he had, in effect, ensured that all of Gunnar’s offspring would be at each other’s throats. In addition, and maybe because Gunnar left him alone so often to voyage around the galaxies, Ivan cursed them to fall madly, irrevocably in love while still young, and never be able to be without their mates again.</p><p>No, Kyle had been lucky so far, and he intended to do everything in his power to keep it that way. He was still young and looked forward to playing the field for many years to come. He glanced down into the by-now blank screen of the compnet at his reflection there. Blayde said he was the prettiest of them, and he was vain enough to wonder if it was true, though the word pretty made him cringe a little. Surely he was far too masculine for such a word. It was true he wore his dark hair a little longer than the rest of his cousins, but mainly because he couldn’t be bothered to have it cut most of the time.</p><p>His eyelashes were a bit too long and curled up almost like a female’s, and he’d always hated it. His eyes were the deep red of all the Lycans, though his were so dark as to be almost black, and this drew a lot of attention to his eyes. He snapped the cover closed and sat back in his chair—attractive, perhaps, but definitely not pretty.</p><p>Tarr Bonnet saw the Lycans the moment they entered the bar. His usual table was in the corner, tucked away in the shadows, and so far neither of the bastards had so much as glanced his way, but his senses went on high alert immediately. He fucking hated Lycans, and most especially since his twin brother had been captured by them.</p><p>His brother, Taz, had been a passenger on board a freighter carrying a shipment of diamonds to one of their Nilanium allies when they were attacked by Alliance ships. The shipment was stolen and his brother taken prisoner. He had been sent to the prison on the planet Lycanus, because it was theorized that only Lycans stood any chance of keeping Tygerians contained without resorting to strong drugs.</p><p>Since there had already been fatalities among Tygerian prisoners due to these powerful drugs, the Alliance decided it might be cruel and unusual punishment to drug them constantly to keep them from shifting. Lycan wolves were the only thing that came close to matching them in power and strength.</p><p>Tarr had managed to attack the Lycan prison ship as his brother was being moved to a larger facility on Lycanus 2, and freed him after an intense and bloody battle that cost him two of his best men. He retrieved his brother, but he owed the bastards payback, and he thought he might know how to get it for both his brother and himself.</p><p>He gaze swept over these Lycans now, assessing whether or not they posed any threat if he went through with his idea. They were both muscular and well built, though one was a bit larger than the other. Both were handsome, too, even if they were Lycan. The larger one might have been a couple of years older, dark-haired, with those strange red eyes all the Lycans had, giving him what Tarr thought of as a devilish look. The Tygerian religion warned of devils who were seductively handsome despite their red hair and eyes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The other Lycan was almost sinfully good-looking, with plump, luscious lips, high cheekbones and eyelashes as long as any female’s. The idea of what he might do with these Lycans grew in Tarr’s mind—it was outrageous, but rather a stroke of genius, if he did say so himself.</p><p>Tarr had just received a message from his brother telling him to be on the lookout for a suitable nobyo for him. He asked him to purchase one right away if he found one he thought he’d like, as his first child was due to arrive soon. One of these Lycans would be eminently suitable to fulfill his request.</p><p>There was no appropriate translation for the word nobyo, but to the Tygerians it meant lover, or paramour. It was even used as a term of endearment for their concubines. A nobyo was like a spouse, in a way, though, of course, marriage to an alien species was out of the question—only female Tygerians were accepted as marriage partners. The Tygerian female never lived with the male, but they kept in close contact when they had children together. Even more, though, a nobyo was a life companion, and was in charge of rearing all the children.</p> <p>The nobyo was even closer to the Tygerian than a wife, because he was well-loved and cared for his entire life. Even if the unlikely happened, and the long-lived Tygerian passed away first, the nobyo was cared for and cherished by the children for as long as they lived.</p><p>Tarr wondered how Taz would feel about a Lycan for his nobyo. It would take a lot of training and a strong hand, but the challenge would definitely be fun. And since his capture, Taz hated the Lycans on general principle. To have one as his submissive love slave would be sweet. Tarr let his gaze wander over both Lycans again. He could try for both of them, but his chances would be better to capture at least one if he could separate them—the smaller one, perhaps. He was pretty and looked a bit more malleable too, more open to persuasion than the bigger one.</p><p>As he watched and sipped his drink, trying to figure out if he could separate them in some way, he saw the smaller one slip something to the bartender. Interested, he watched as the bartender turned and moved to the other end of the bar, where he appeared to be reading a note. Then he glanced up and caught Tarr’s gaze. Amazingly, he walked directly over to Tarr’s table and handed the note to him.</p><p>“The Lycan dog over there slipped this to me for you, sir. The note says he’ll make it worth my while to give this to you. Should I kill him for his insolence in disturbing you?” The bartender was a fiercely loyal slave who had worked with Tarr for years. The bar itself was owned by Tarr, and he used it not only for his amusement, but as a way to meet potential buyers for his collection.</p><p>“No, Ozrom, I’ll handle this. You did the right thing to bring the note to me.”</p> <p>Ozrom nodded and moved away. He had belonged to Tarr’s family most of his life. His Earthan mother had been captured when he was a small child, and her new owner had allowed her to keep him. As he grew up, and it became apparent he’d never be pretty enough to be a love slave, he’d become a service slave, and Tarr’s father bought him when he was only sixteen cycles. He’d trained him to work in the bar, a much easier life than most service slaves endured. Since Tarr’s father treated all his slaves well, even allowing service slaves to take lovers if they wished, he’d earned the man’s undying gratitude.</p><p>Tarr opened the note and quickly read the contents. Written in the Galactic Standard text in a small, neat handwriting, the note was short, asking for a meeting. It said the Lycan had some important, unnamed business to discuss. Tarr scribbled his reply and caught Ozrom’s eye. Ozrom began to work his way over to his master as unobtrusively as possible so he could return the note to the Lycan. This was turning out to be a very interesting evening indeed.</p><p>Kyle walked back into the bar three hours later, alone. He spotted Tarr at the same table in the corner, and wondered briefly if he’d been there ever since Kyle had left with Blayde earlier in the evening. In the note he’d sent back, Tarr said he would meet with Kyle at midmoon—but only if Kyle came alone. The note said Blayde had to remain on their ship and his men would monitor him to be sure. If Kyle didn’t come alone, then he shouldn’t bother, because as Tarr said in the note, he was ‘familiar with Alliance tricks.’</p><p>Kyle had no doubt he was telling the truth about monitoring the ship, yet he’d had a terrible time trying to convince Blayde to stay onboard.</p><p>“You’ll probably be walking right into a trap, damn it!” Blayde yelled at him.</p><p>“I know,” Kyle said for seemed like the hundredth time. “But how else can I speak directly to him? Sure, he could take me prisoner, but why settle for taking me when he could take the deal I’m going to offer him? He’s a businessman, after all, so surely he’ll recognize a good deal when he hears it.”</p> <p>“You’re assuming he’ll even give you a chance to tell him the deal. What if he grabs you the minute you walk in there?” Blayde continued his pacing back and forth across the comm deck on the ship, occasionally running his hand through his hair, something he often did when he was agitated. “No, it’s too fucking risky. We’ll try something else.”</p><p>“Like what? Look, we’re here—I’ve made contact. I think we should go through with it.”</p><p>“Well, I don’t!” Blayde slammed down his hand on the arm of Kyle’s chair. “And this is my bounty. No, it’s out of the question. I forbid it. We’ll figure out something else, but this is just stupid.”</p><p>With that, Blayde had turned his back and left the command deck, going down to his own quarters, leaving Kyle to stare at the closed door in outrage. Blayde wasn’t his alpha, and even his cousin Lucas, his true alpha, would never lay down an order like that to one of the family. He resented the tone Blayde had taken with him. Blayde may have been a few years older and had more experience with bounties, but he’d be damned if he’d let Blayde tell him what to do. Perhaps Blayde had worked with his mate Ryan too long if he thought Kyle would roll over and obey him just because he fucking forbade it.</p><p>For a long time, Kyle had questioned whether or not he was truly an alpha. His brother and all his cousins were, and the curse foretold that all descendants of old Gunnar would be alphas, but did that necessarily make it true?</p><p>He wasn’t a gamma either—he liked giving orders, but he was also comfortable in not taking the lead. He often found himself as a pilot, ferrying the bauxite around the galaxies, along with one of his cousins, and he was happy to let that cousin do most of the negotiations with the clients. Maybe a strong beta, then—that seemed more likely to Kyle. He liked the role of strong right-hand man, and as a Balanescu, he’d never had to go through the selections like most other Lycans. They chose their own alpha on Lycanus 3 and that was Lucas.</p><p>So the issue of his rank had never really come up. Still, he didn’t like the tone Blayde had taken with him. Kyle knew he was capable and strong, and could handle himself. He didn’t appreciate Blayde telling him what to do. Kyle got up, checked to make sure he had the pouch of diamonds he’d need to make the deal, and defiantly left the ship, heading back to Blood in the Water. Blayde might be pissed when he found out, but so be it. He’d be happy enough when he’d made the deal and arranged the sting. Or at least that’s what Kyle kept telling himself.</p><p>Chapter Two</p> <p>From the moment he left the ship, he felt like he was being observed, but it could have only been his imagination, despite Tarr’s threats. Still, he was feeling a little nervous, and wondered if he wasn’t making a huge mistake.</p><p>When he walked into the club, nothing seemed to be any different than earlier in the evening. The place was still mostly deserted, with only a few customers standing near the bar, talking quietly. The bartender glanced up as he walked in and nodded shortly, but still frowned at him. Across the room, from the same corner, he saw the Tygerian, Tarr Bonnet, watching him from the shadows.</p><p>Kyle glanced around him, but saw no outward sign of any of Tarr’s men. The men at the bar could have been Nilaniums, but they barely glanced at him and didn’t seem to show much interest. He knew they must be around, though, and he’d need to be on his guard if this were to have any chance of working. He walked slowly over to Tarr’s table and stood in front of him, looking him over curiously.</p><p>He was as handsome as his picture indicated, though his curly hair looked a little greasy and he was in need of good bath, in Kyle’s opinion. Lycans were scrupulously clean, and he couldn’t help wrinkling his nose a bit at the strong, though not altogether unpleasant body odor coming off the Tygerian. His stripes were exotic and beautiful, and Kyle found himself fascinated by the man.</p><p>Tarr smiled up at him and fired something off in a rapid language Kyle didn’t understand. When Kyle simply looked at Tarr blankly in response, Tarr gave a short laugh, showing strong white teeth, and spoke again in heavily accented Lycan. “Sit down, wolf. I won’t bite—not much, anyway.”</p><p>He bared his teeth again and indicated a chair across from him. “I must admit I’m interested in what you might have to say to me. It’s been my experience that the Lycans are as bloody-minded as their Alliance cohorts and have little use for Tygerians. I wonder what you could possibly have to say to me that I would be interested in.”</p><p>Kyle sank down to the chair across from Bonnet, took the pouch of diamonds from his jacket and laid it on the table between them. “This is yours if you’ll hear me out.”</p><p>Tarr glanced over at the pouch, and one corner of his mouth quirked up. “Tell me what’s on your mind, Lycan.”</p><p>“I want to give you a love slave—that’s your business, isn’t it? Well, I’ll give you a valuable one and even pay you to take him if you’ll agree.”</p><p>Tarr glanced again at his face and tilted his head a bit to the side. “What sort of love slave? I have very exacting standards.”</p><p>“You saw the man I was with earlier, didn’t you? I’m talking about him.”</p><p>Bonnet narrowed his gaze. “What’s the catch? You two have the look of each other—is he not some kind of relative of yours?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He’s my cousin, yes, but there’s no catch to this. He needs to disappear, that’s all, and never come back. Suffice to say I have my reasons.” He pushed the pouch of diamonds toward Tarr. “He’s young and good looking, so you should be able to find a buyer for him, and I’ll give you another pouch just like this one when you pick him up.”</p><p>“When I pick him up, huh? That easy? And where might I find this man?”</p><p>“He’s on my ship. I’ll make sure it is easy for you—I can slip him a sedative in his food. That won’t be a problem.”</p> <p>Bonnet shook his head. “If he’s your cousin, why would you do this? I understand Lycan families are quite close. Something about this doesn’t feel right.”</p><p>“He has a human mate that I’ve fallen in love with, if you must know. I need him out of the way so we can be together. It doesn’t really matter, does it? Just get him out of my way and I’ll pay you any price you ask—plus you’ll have whatever you’ll be able to get for selling him.”</p><p>Tarr continued to stare at him, so he leaned forward, trying to make his case. “If that’s not enough, I can get more. Just tell me what you need.”</p><p>Tarr smiled. “What I need?”</p><p>“Yes, I’ll get it for you.”</p> <p>“That’s a very kind offer, and I’m glad to see you’re so willing to see to my needs. It will stand you in good stead in the years of service to come.”</p><p>Kyle sat back in his chair, his heart beating a little too fast. This asshole was toying with him, that’s all. He had to keep calm and not let him see he’d rattled him. “Don’t threaten me, Tygerian,” Kyle said. He could feel his hackles rising on his spine.</p><p>Tarr shrugged. “No threats. But why do I need to go to any more trouble when I already have you, plus this little bag of diamonds?”</p><p>Another icicle of alarm slid down Kyle’s spine, but he sat up straighter, glaring at the Tygerian. He could feel his incisors dropping from his gums. “I already told you. I’ll give you my cousin plus more of these diamonds. As many as you say.”</p><p>Tarr flicked his hand at the pouch, pushing it aside. “I have no need of more diamonds. What I do have need of is a beautiful wolf, and I think you’ll do quite nicely.” He turned his head and nodded toward someone behind Kyle. Kyle jumped to his feet, whirling around, and saw six large men coming toward him from a curtained area behind the bar. He felt the shift come over him as he backed away, growling menacingly. He backed right into a hard body behind him and turned, snarling and ready to rip out the Tygerian’s throat. Instead he found himself looking down the barrel of a gun pressed right between his eyes.</p><p>His split second’s hesitation allowed the men coming up behind him to charge him. Grabbing his arms, they held him fast while he struggled, shouting his rage, and their combined weight bore him to the floor. A big knee landed on his chest and he found himself looking up into Tarr’s green eyes. He held a syringe in his hand and jabbed it painfully into Kyle’s arm as he struggled, helpless to stop him. A great lethargy began to settle over him and he found it hard to move his limbs. As blackness settled over him like a shroud, he lifted his snout and gave one last roar of defiance, a howl of rage and frustration and fear so loud the walls vibrated with the sound.</p> <p>Kyle felt as if he were swimming in a murky sea. There were times when he rose toward the dim light that seemed to come from above him and almost reached the surface, only to be pulled back down again, despite his struggles, by the relentless undertow. The water was so thick he felt as if he were swimming in some thick, syrupy substance. It weighed him down, confining him and bearing him to the murky bottom.</p><p>Only once or twice did he manage to almost break the surface, when his mouth was forced open and filled with water. He had no choice but to swallow it, and it lay heavy in his stomach. Once he vomited it back up and choked on it, but the currents rolled him to his side and pounded against his back, and then more water was forced down his throat. Again and again, the process was repeated and the only times he managed to find any peace at all was when the strong current allowed him to sink to the muck at the bottom of the sea and settle there, half-buried in it.</p><p>After an interminable time, the waters seemed to press him down a little less, and he was able to swim up closer to the surface. Someone was calling him, pulling on his consciousness. He opened his eyes and the first blinding headache hit, so hard and sudden it took his breath away. He closed his eyes and gasped at the pain, but he was being shaken by a strong hand. Opening one eye, he looked up and saw Tarr Bonnet staring down at him. There were some kind of bars over his face and for a few seconds, Kyle couldn’t make any sense of it. He forced open his other eye and shook his head, trying to clear his blurry vision.</p><p>No, it wasn’t bars over Tarr’s face at all, rather it was bars to some kind of cage, and Kyle was naked and enclosed inside it. The bars were just inches above his face, and he was sitting slumped in a corner of a metal cage just barely large enough to contain him. He couldn’t even sit up straight, but was hunched over, his head twisted to the side. He ached all over, but it was especially his head that hurt so much he could barely stand to keep his eyes open.</p><p>There was some kind of very sweet smell in the room, almost like the cookies his grandmother’s concubine used to make for him and his brother when he was a little boy. It smelled delicious and made his mouth water. Despite the pain and nausea, his stomach was cramping for food. One part of his mind idly wondered if they were trying to starve him into submission.</p><p>He closed his eyes against the sharp pains in his head, thinking he might drift back down to sleep. Near him, he heard sharp, almost angry words spoken in some alien language he’d heard before but couldn’t quite place—Tygerian, maybe? The voices grew louder. He opened his eyes again and thought he must be seeing double. There were two Tarrs now staring down at him, and oddly enough, one of them seemed to be really angry, while the other one seemed to be smirking at him with calm indifference.</p><p>The angry one suddenly put a hand through the bars and Kyle flinched away, thinking he was about to be hit. Instead, the hand retreated quickly and more rapid-fire Tygerian was shouted back and forth. The sneering-faced Tarr reached in and stroked his hair out of his face impatiently, so that the angry one could lean down closer to look at him. Kyle looked up at him too, trying hard to focus and blinking his eyes rapidly.</p><p>The second Tygerian’s eyes were beautiful, thickly lashed and a strange shade of golden green. They were warm and admiring as they stared down at him, and his face softened. Finally, after what seemed like a long time, he pulled his gaze away and nodded over toward the other Tarr.</p> <p>Another rapid flurry of Tygerian words passed, and then the top of the cage was being lifted. Kyle saw two strange men who must have been some of Tarr’s workers come forward. Two sets of strong hands came down and lifted him as if he were a child, pulling him up and out of the cage. He tried to pull away but found he was too weak. He found himself being set down on his feet, but when the hands released him, his knees gave way and he sank down to his knees, unable to stand alone.</p><p>The angry Tarr knelt down beside him and peered into his face again, murmuring to him. Kyle tried to focus on him, but couldn’t quite clear his vision. This was definitely the source of the wonderful smell, though. It radiated off the man, surrounding Kyle with its sweet scent. Then he touched the side of Kyle’s face and what felt like a jolt of electricity jumped from his fingers, searing into Kyle’s brain. It screamed mate. Alarmed and amazed, Kyle recoiled, falling back on his ass and crying out again in alarm.</p><p>The two Tarrs looked at each other in surprise and then back down at him. Kyle tried hard to calm himself and shook his head again to clear it. This time when he looked back up, he realized that the smell and the overpowering urge to mate was coming from only one of the Tarrs—the one he’d termed the angry one.</p><p>Confused and shaken, he leaned toward the angry one’s legs. Touching him again was a risk, but he felt almost compelled to do it, and besides, the man seemed to be more puzzled now than anything else. Feeling sick and hurt, Kyle wanted only to get closer to his mate for comfort. Kyle wrapped his arms around his legs and amazingly, his mate allowed it, even bending over to stroke his hair as the two Tarrs carried on a conversation above him.</p><p>One of the workers came closer and pulled him roughly away from his mate’s legs and pushed him back down on his ass. His mate shouted at the man, who cringed away, and seemed to be apologizing profusely, dropping to his knees and then bending over to touch his forehead to the floor. The worker approached Kyle again, but this time he seemed much gentler as he strapped a kind of leather harness around Kyle’s upper torso. A silver ring rested in the middle of Kyle’s chest and to this ring, the man attached a sort of chain, or leash. He then handed the other end of the leash to the man who was Kyle’s mate.</p><p>All of this registered on some level inside Kyle’s brain, but he wasn’t upset or worried about it, or about anything else, really. Drugs...they’ve drugged me. That’s why I don’t feel like fighting any of this. It all seems like a dream. The explanation registered in his brain, but he still couldn’t feel any real anger over it.</p><p>His mate squatted down next to him and spoke to him in a kind, sympathetic-sounding voice, not that he could understand a word of it. Kyle thought he might even be speaking Lycan—the words flew around in the air around him like familiar, bright butterflies, but he couldn’t seem to grab onto any of them long enough for them to register and make any kind of sense. He nodded anyway and was rewarded by a beautiful smile and a caress on the side of his face.</p><p>He leaned into the warm hand and looked up at his gorgeous mate, who then bent over to brush a kiss against his dry, cracked lips. His mate took off his own shirt and tied it around his waist, and Kyle gazed up at him with gratitude. He stood up and tugged gently at the chain, and Kyle got awkwardly to his feet, holding both hands out to the side for balance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His handsome mate nodded at him with approval and tugged again at the chain, slowly leading him from the room. Kyle looked down at his bare feet, trying to concentrate on putting one foot in front of the other, and it was far from easy. From time to time a wave of blackness overcame him and he stumbled. Each time, his mate stopped walking and allowed him to recover before moving slowly forward again. A part of his mind registered that other people were walking past them, but he couldn’t spare them any attention. All of his focus had to be on making his feet move to follow his mate.</p><p>After what seemed like a very long time, he was helped into a seat, and strapped in. His head lolled back against the soft leather seat and Kyle felt the blackness trying to steal over him again. His physical condition must have been worse than he thought or else Tarr had loaded him up with drugs, but this time, the darkness wasn’t quite as absolute. It had a softer quality, more like natural sleep, and when his mate reached over to put an arm around his shoulders, Kyle gave in to it and sank gratefully down in its depths.</p><p>Taz Bonnet was furious with his brother, Tarr. He’d asked Tarr to help him find a nobyo a few weeks before and had actually almost forgotten about it until he received the message from his twin brother telling him Tarr had a surprise for him and asking him to be on the docks when he arrived.</p> <p>Taz had been there, of course. He loved his brother, and owed him everything, though they were very different people despite their looks. As identical twins, they’d been told all their lives how much they resembled each other. So much so that Tarr often went without shaving and let his hair grow unruly and too long to avoid looking just like Taz. Tarr loved his brother, but always said he wanted to feel unique. He also sometimes affected the rough clothing of the Jolly Rogers he worked with, as well as their lack of interest in personal hygiene.</p><p>When Tarr jumped down on the docks and ran over to take him in a bear hug, Taz had returned the embrace good-naturedly, though to be honest, it offended his dignity somewhat. As a Tygerian senator, he had to be careful of his personal image. Pulling away after a moment, he smiled at his brother.</p><p>“I’m glad to see you too—what could possibly have been so important I had to take a day away from my schedule to come down here to the docks?”</p><p>“I told you—I have a surprise for you.” Tarr grabbed his elbow and began ushering him back toward the ship.</p><p>“What kind of surprise? I warn you, if it’s another one of those animals you keep bringing me, you can take it right back where you got it from—the last one ruined my floors.” Tarr seemed to think Taz spent too much time alone, so he continually brought him exotic pets from all over the known galaxies. The last one had been a Kraponian bear, which, despite being a bear, was only a little over a foot high, with snowy white fur and quite possibly the longest tongue Taz had ever seen.</p> <p>He kept it rolled up in his mouth most of the time, but occasionally he would unfurl it to snag a treat from the dining room table from halfway across the room. The creature was adorable, really, but steadfastly withstood any and all attempts at housebreaking. By the time Taz found him another good home, he’d had to replace almost all of his carpets.</p><p>“No, not any animal, exactly, though he will be a pet.” Tarr laughed at the expression on Taz’s face. “Your nobyo, remember? You asked me to find one for you.”</p><p>Taz stopped walking and pulled sharply away in surprise. “A nobyo? But I’m not prepared. Gods, Tarr, you could have given me some warning—now I’ll have to try and get some time away from work to train him properly. I don’t suppose he’s already been trained? That would be too good to be true.”</p><p>“You might need to take a little extra time off. This one is going to be difficult to train, but he’ll be totally worth it once you do.” Tarr took his arm again and began pulling him toward the entrance to the ship, but once again, Taz pulled back, hesitating.</p><p>“I don’t like the sound of this,” Taz said, a hint of a frown forming on his face. “What do you mean, ‘difficult to train’? What kind of nobyo have you brought me? He’s handsome, I hope, and suitable to rear my children.”</p><p>“He’s very handsome—beautiful, really. And he comes from a very good family on his home planet. Very respectable, I assure you.”</p> <p>“And just where is his home planet? Is he from Earth?”</p><p>“Earth?” Tarr made a scoffing sound. “No, brother, not Earth. You and I are too bold and strong for such puny creatures. You’d have been bored with such a one in only a short time. No, I’ve brought you a real challenge, one that will be a delight for you to tame for many cycles to come. And if you succeed in making him submit to you, you’ll be the envy of all who see him.”</p><p>Taz began walking again and climbed aboard the ship, but slowly, still suspicious. “Exactly who is this paragon, then? Where is he from?”</p><p>Tarr came to a stop in the by-now mostly deserted passageway and turned to gaze at him with a twinkle. “He’s a Lycan.”</p><p>Reeling back from him, Taz felt his breath catch in his throat at the word. “Lycan?” he croaked the word harshly, his mouth suddenly dry. “Are you crazy? You know how I feel about Lycans.”</p><p>Tarr stepped in front of him, crowding him back against the wall. “Calm down, brother. Yes, I know how the Lycans mistreated you when they held you captive, but this is your chance to avenge yourself. Imagine having one of the arrogant bastards under your complete control. You can beat him, fuck him, make him suck your dick, treat him any way you like and no one will say a word. Just think of it!”</p><p>Taz pushed his brother away. “Don’t be ridiculous. You’ve purchased this person to be my nobyo, and we take our nobyos for life. To care for them—not to treat them like back-alley whores. You’ve been with the Rogers too long if you think I would ever abuse a nobyo under my care, even a Lycan.”</p><p>Tarr grinned ruefully. “Well, about purchasing him. It wasn’t exactly a purchase.”</p> <p>Taz mouth fell open in amazement. “Gods, you kidnapped him.”</p><p>“Kidnapping is such a harsh word. I prefer to say I temporarily denied him his freedom to bring him to a good home.”</p><p>“He’s not an animal, Tarr—he’s a person!”</p><p>“He’s a fucking Lycan, and they’re little better than animals.” At the look on his brother’s face, Tarr held up a hand. “Besides, we’re at war with the bastards. Technically, he’s a prisoner of war, and I captured him. He was trying to take me, brother. I’d have wound up in one of their damn prisons if I hadn’t taken him first.”</p><p>“And just how do I prevent him from shifting and eating my child?”</p><p>Tarr chuckled. “He won’t eat your child. He’s one of the noble Balanescus, and once you have him trained, he’ll be suitable to be around your baby. And the medicine I’ve been giving him will prevent him from shifting until you have him properly trained.”</p><p>“Medicine? You mean you have him drugged out of his mind.”</p><p>“Just come with me to see him,” Tarr said, taking his brother’s hand. “I told you, he’s really beautiful, even with his red eyes. They’re a dark color, almost black, and his hair will be lovely once you make him grow it out. His body is really magnificent and muscular, but he’s not quite as large as the others in his family. I think you’ll be pleasantly surprised.”</p><p>Taz pulled away and began walking back down the passageway. “I’ll see him, since you’ve gone to so much trouble, but I’ll have to find him another master. I won’t have a Lycan in my home, not the way I feel about them.”</p><p>Tarr said nothing more, just nodded knowingly, in his usual irritating manner. He led Taz down the passage to a metal door at the end. When he opened the door, Taz was shocked to see rows of metal cages, barely large enough for an Earthan to sit in comfortably, let alone a much larger Lycan. “Gods, how long have you kept him in a cage like this?” he asked, pity for the Lycan flooding him, despite his negative feelings for the race.</p><p>Two cycles before, he’d been captured by Lycans while he was traveling back to Tygeria after a diplomatic trip to one of the planets in what the Alliance called Bode’s Galaxy, though the Tygerians had their own name for it, of course. He had hitched a ride home to Tygeria with a freighter to make it back in time for an important congressional vote, and their ship had been attacked by Alliance forces.</p><p>The entire crew, along with Taz, had been taken to the planet Lycanus to one of their prisons. They’d been treated with a kind of casual cruelty, receiving very little food and rough handling from the Lycan guards. He’d seen several of the younger crew raped and beaten by these guards, and the only thing that saved him from similar treatment was the fact that he had been carrying diplomatic papers.</p><p>Still, the experience had been a nightmare of maggoty food, freezing cells and sneering Lycan faces peering in at him through the bars. The Lycans were a handsome people, and prior to his capture, Taz had always admired their fierceness and courage in battle. Those guards were brutal, however, and even cruel. He’d begun to fear for all their lives.</p><p>Taz had been interrogated twice and beaten both times when he refused to divulge any information. Finally, the entire crew was transferred to a more permanent facility on the sister planet of Lycanus 2. During the transfer, he and the others been rescued by his brother in a daring, dangerous raid. Most of the Lycan crew had been killed after putting up a vicious fight. The entire episode had taken him a long time to recover from, both mentally and physically, and he still harbored a host of negative feelings about Lycans.</p><p>Tarr ignored his question about the cages and kept moving steadily toward a back cage where Taz could see a man sitting hunched up in a corner. He was naked, and his muscular body was smeared with dirt and what looked like dried vomit. His thick, shaggy black hair hung down across his face, and he seemed to be only semi-conscious. Tarr reached through the bars and shook his shoulder, shouting at him in Lycan. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Wake up, Lycan! Your new master is here to see you!”</p><p>The Lycan’s head rose only fractionally, as the bars were too close to the top of his head for him to straighten up. He twisted his head to the side and peered up through strands of his filthy hair. Taz caught a glimpse of eyes that reminded him of a summer storm over the vast Tygerian plains, when the black clouds were lit up briefly from within by powerful lightning, and then went dark again just as quickly.</p><p>“Gods, Tarr, what have you done to him?” He reached in to brush the thick hair from the Lycan’s eyes and the poor thing flinched away fearfully. Taz pulled back his hand and rounded on his brother. “Have you been beating him too? You bring me this poor, broken creature and expect me to keep him as my nobyo? My beloved? You’ve ruined him!”</p> <p>Tarr made a sound of impatience. “No, not at all. He’s been drugged, that’s all. No one’s beaten him, though he didn’t exactly come easy when we captured him. You know what dangerous creatures they can be—I had to drug him. I’ve tried to keep him hydrated, so he’s not in bad shape at all, though he’s probably a little hungry and tired.”</p><p>“You think so?” Taz shook his head angrily. “There’s nothing I can do with this poor man.”</p><p>“At least look at him,” Tarr said, and reached in to pull the Lycan’s head around and get the hair off his face.</p><p>Almost reluctantly, Taz looked down and was struck at once with the Lycan’s beauty. His skin was tanned and smooth, and his lips were full. The Tygerians believed this indicated passion. The pretty lips were parted slightly and the tip of his pink tongue showed slightly between his white teeth. Taz found himself wanting a taste of that tongue. The Lycan’s eyes were as beautiful as he’d imagined from the glimpse he’d had of them through the fringe of thick hair, with long, sweeping eyelashes and that curious blood-red color. Taz felt unable to pull his gaze away and continued to stare down at him for a long time. Finally, he nodded at his brother. “He is beautiful. Please get him out so I can see him better.”</p><p>Tarr called on his communicator for two of his service slaves, who came in right away and unlocked the cage to pull the Lycan out. When the Lycan was on his knees before him, Taz didn’t feel the satisfying vengeance he should have felt. Instead he was entranced by those soul-searing eyes staring up at him.</p> <p>Unable to stop himself, Taz leaned over to pet the Lycan’s head. At the first touch of his hand, the Lycan fell backwards, as if frightened. Taz shook his head. He’d take a lot of work if he’d been broken so badly that the slightest touch frightened him, but one good look at his beautiful face had convinced Taz he might be totally worth it.</p><p>“What’s his name?”</p><p>Tarr looked puzzled and shrugged. “I have no idea. I took him on Leeria from the bar. The Leerians told us we couldn’t touch the Lycan ship, but they didn’t say anything about the crew. All we knew was that some important Lycan family called the Balanescus were bringing in a shipment of bauxite, but other than that, I don’t know anything about him. Call him whatever you like.”</p><p>As Taz gazed down at him, the beautiful man got on his knees and shuffled forward, then wrapped his arms around Taz’s legs.</p><p>Shocked, Taz turned to Tarr who was almost goggling at the Lycan in surprise.</p><p>“What the hells, Taz? He fought us like a demon when we first took him. It took two injections just to put him down on the floor.”</p> <p>One of the slaves stepped forward then to pull him sharply away and harness him, and Taz shouted at the man without thinking. “How dare you put rough hands on my nobyo? I’ll have you flogged for such insolence!”</p><p>The slave cringed and apologized, but Taz spared him barely a glance. Instead he looked over at his brother who was grinning from ear to ear. “I knew you’d like him. The moment I saw him I knew he was special.”</p><p>Taz ignored his brother’s gloating and accepted the leash now attached to his nobyo’s harness. It was a cheap leather one that Taz would replace as soon as possible. He’d buy a halter lined with a soft material for his nobyo, and attach a silver leash. He couldn’t wait to get him home to bathe him and groom him properly. Before he took him, he wanted to hide his nakedness from the prying eyes on the docks. He took off his shirt and wrapped it around the Lycan.</p><p>He stood back up and glanced over at his brother. “Is he an alpha?” he asked his brother, and received a huge grin in response.</p><p>“I think so. The Leerians said all the Balanescus are alpha. Once the drugs clear his system, he’ll give you a lot of entertainment. I thought about plugging him for you, but figured you’d prefer to do it yourself.”</p><p>“Yes, of course. He’s a virgin, isn’t he? I’ll have to prepare him carefully and plug him as soon as I get him cleaned up.”</p><p>Tarr adjusted his trousers. “Damn, I think I really do envy you, brother. Perhaps I should have taken his cousin for myself—he was a handsome devil too—but I did make promises to the Leerians. As it was, I had a hard time getting your boy off the planet. His family was beside themselves.”</p><p>“However you managed it, I’m grateful. I have him safely now, and he’ll never have to go back to those animals again, will you, darling?” He leaned over and caressed the side of his nobyo’s face and spoke to him soothingly in the few words of Lycan he remembered, telling him he would care for him now.</p> <p>His poor nobyo didn’t seem to understand, but he’d teach him everything he needed to know once he got him home. The babies his female spouse was having weren’t due for over a quarter cycle yet. At that time, his wife and her companion would keep the girl child and send the male to Taz. By that time, he hoped to have this nobyo trained enough to at least help his servants care for the child. Then later, he could take over complete charge himself.</p><p>The Lycan certainly had a great deal of intelligence in that expressive gaze, and once the drugs had cleared from his system, he’d be able to teach him the Tygerian language—the language of the people, which he would, of course, have to teach the children. He petted his nobyo’s head in satisfaction again, and pulled on his leash to lead him down the passageway and take him safely home.</p><p>Chapter Three</p><p>Kyle awoke some time later to softness and warmth, though he became aware the air around him was chilly. He was lying naked on a soft rug on the floor, and wrapped in some kind of furry blanket. He stretched a little, trying to wake up and clear the fuzziness from his head. He tried hard to remember where he was, but he couldn’t quite grab hold of the memory.</p><p>A sudden image of golden eyes flashed into his brain, and a rush of happiness came over him. He’d found his mate. It was Tarr—or no, that wasn’t exactly right. Someone who looked like Tarr, but smelled totally different. He was cleaner too, and more beautiful. Kyle sat up, rubbing his eyes. Where was his mate? He was suddenly afraid that finding his mate had all been in his mind—some kind of drug-induced dream. In a panic, he threw the covers off and tried to stand up, but was stopped by a chain around his ankle. He pulled at it viciously but the length of chain remained firmly bolted to the wall, holding him so that he had a range of motion of only a few feet in any direction.</p><p>Furious, he tried to shift, but to his horror, nothing happened. He fell back down on his ass, rubbed a hand over his face and tried again—and again. Nothing happened, not even the releasing of his incisors from his gums. He shook his head to clear it, but it didn’t help. The drugs they’d given him must have something powerful in them that prevented his shifting. He had to get free—he had to find his mate.</p><p>He was aware enough intellectually to know he should calm down and try to figure a way out of this—a part of him even wondered why he was so freaked out about finding his mate instead of worrying about being kidnapped away from his family and his home. Fuck, he didn’t even know where he was or even if he was really still back in that filthy cage and dreaming all of this. He knew he should try to figure all that out, but he wasn’t feeling very logical. Despite his efforts to calm himself, he slipped more deeply into agitation and confusion.</p><p>He fell down on the rug and began tearing at the cuff on his ankle. It was tight and made of some stiff, animal hide material, but lined with soft, black fur. He pulled and tugged at it, even tried biting it with his teeth, but it wouldn’t give at all. His growls and whimpers grew even louder until he knew he was making a lot of noise, and the damn guards would be in soon to shut him up, but he didn’t care.</p><p>A door opened behind him and he never even turned to see who’d come in, figuring it was the asshole guards, come to hit him again or pour more water down his throat. He resolved to fight them this time, now that he could think a little more clearly. He wouldn’t allow them to put him back in that cage—they’d have to kill him first.</p><p>When the rapid footsteps got right behind him, he turned and scooted backward, thinking he could make his stand better with his back to the wall. It was then the scent that had been assailing his nostrils since the door opened finally registered on him, and he went completely still, his mouth falling open a little.</p><p>It was his mate, crouching down beside him, a look of concern on his beautiful features. It wasn’t Tarr. That was definite now, and Kyle couldn’t figure out how he’d ever mistaken the two. There was a strong resemblance, to be sure, but the exotic creature beside him was much more beautiful. He was huge, the sleeveless vest-like garment covering his chest doing nothing to hide his muscular chest and arms. His skin was exquisitely marked with faint, thin tiger stripes running just under the golden skin, and his hair was a golden-red color, as were his eyebrows and eyelashes. His eyes were as golden as his hair, and he was simply the most delicious thing Kyle had ever seen.</p><p>He said something rapidly in his language, Tygerian, of course, and then seemed to concentrate hard on the next words, which he spoke in Earthonian, a mixture of several of Earth’s primary languages and the official language of the Alliance.</p><p>“Don’t be frightened, nobyo. You’re safe now. I had to chain you to keep you from trying to escape and hurting yourself. Do you understand me? You do speak Earthonian, don’t you?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kyle nodded. Then, because his beautiful mate seemed to be waiting for him to say more, he cleared his throat and tried again. “Yes, I speak Earthonian. I understand what you’re saying.” His voice sounded rusty and hoarse to his ears, but a lovely smile lit up his mate’s face.</p><p>“Good. You’ve been asleep so long I was beginning to be afraid my brother damaged your brain with his drugs.” He caressed Kyle’s face with a warm hand and Kyle couldn’t stop himself from leaning into the soft touch.</p><p>“What’s your name, sweet one?”</p> <p>“Uh...” Gods, what was the matter with him? He couldn’t even think of his own name. What kind of drugs had they given him? Then suddenly, the words popped up in his mind and he sighed with relief. “It’s K-Kyle. Kyle Balanescu.”</p><p>He nodded. “I’ll put that on your papers, but of course, I’ll call you Nobyo, and you must always answer to that. Understand?”</p><p>His mate’s nearness was intoxicating to Kyle, and he pretty much felt like agreeing to anything he said. Not that he clearly understood more than half of it. Everything was so fuzzy and muddled up in his head. What did he mean by his papers? He nodded anyway.</p><p>“Use words, sweet one. My name is Taz, but you should address me as Taz-lan. It’s a sign of your respect for me.”</p><p>Kyle nodded again, and his mate gripped his chin firmly, pulling Kyle’s face up to his. “Speak, Nobyo. Say, yes, I understand, Taz-lan.”</p> <p>“Yes, I understand. Taz-lan.” He didn’t, of course, but it seemed to please his mate, so he repeated the words.</p><p>Kyle was rewarded with a beautiful smile and a much-too-quick kiss on his lips. Kyle lifted his face toward him, chasing more, but his mate straightened up. “Thank you, Nobyo. Now let’s get you out of this shackle and get you cleaned up. I’ve been waiting for you to wake up before I bathed you.”</p><p>Bathed him? Well, the gods knew he needed it—he was filthy from rolling around in those cages, and he could even smell himself. But he wasn’t sure about being bathed, even by his mate. Still, his mate certainly had been kind and even loving toward him so far, and it wasn’t like he didn’t want his mate’s hands on him—or all over him, for that matter. Maybe it would be better not to fight him on the small issues, in case something much more burdensome came up later.</p><p>He didn’t struggle at all when Taz took off his shackle, and helped him stand up. The drugs still in his system made him feel terribly weak, so he had to lean heavily on Taz to get to the bathing chamber.</p><p>Taz opened the door to a small room that contained a large pool, almost filling the space. Gentle steam was rising from it, and Taz stepped up beside it and began pulling off his clothes.</p><p>Though still feeling dizzy and groggy, Kyle perked up when he saw that golden flesh being revealed to him. Taz’s body was magnificent, long and lean with well-defined muscles everywhere. The tiger stripes were all over his body, even his big cock, which was lined with the stripes right up to the mushroom-shaped head, which, to Kyle’s surprise, was totally black in color. It was striking and outlandish and totally enticing.</p> <p>Kyle took a half-step towards Taz’s cockwith his hand outstretched. Before he could stop himself he tripped over absolutely nothing at all. His mate turned and caught him in his arms, drawing Kyle’s body up to his. The feeling of being in his mate’s arms for the first time was so blissful, he closed his eyes and sighed. His mate chuckled in his ear. “Be careful, Nobyo. The drugs are very strong. You’ll have to let me help you for a while.”</p><p>“A while? No, I don’t want these drugs. They make me feel so...”</p><p>“I know, but they’re necessary to keep you from shifting until we fully bond. After we bond, you won’t want to leave me, and I can stop giving the drugs to you.”</p><p>Kyle looked up at him and shook his head. “No, I won’t leave you—I won’t ever leave you.” He tried to look him in the eye. His mate simply didn’t understand. “You’re my mate. I can’t leave.”</p><p>“That’s right, darling. But we say nobyo. It’s all right. You’ll get used to it all soon.”</p><p>He began pulling Kyle gently toward the pool, and Kyle went willingly enough until he put the first foot in the water. It was hot and tingly, and he quickly jerked his foot away.</p><p>“It’s a little warm, but it will help to soothe the bruises you have on your body. I had the servants put in some medicine to help them heal more quickly. Come, Nobyo.” He pulled at Kyle’s hand and Kyle followed him down the steps into the water, wincing at the temperature.</p><p>After a few seconds, though, his body adjusted and the heat of the water seemed to seep into his bones. Taz pulled him close and they simply stood together in the water for a few moments, wrapped in each other’s arms. Kyle felt Taz’s hard cock pressed against his stomach, and he rubbed against it with his own, causing Taz to groan and catch his breath sharply. He lowered his mouth to Kyle’s ear and whispered to him.</p> <p>“I knew you would be something special the first moment I saw you, but this...” He kissed Kyle voraciously, leaning him backward and moving his hands down to cup his ass. He ground against Kyle, and Kyle felt his wolf trying to emerge again, so he could properly claim his mate. Taz drove his tongue deeply into Kyle’s mouth, sweeping across the inside of it, tasting and claiming him. Kyle brought one hand down between them to clench Taz’s cock, pulling at it frantically, wanting to pleasure his mate. Taz groaned again and arched his back, driving his hips forward. A slight noise behind them made Taz break off with a muttered curse. He whirled to face the door, pushing Kyle protectively behind him.</p><p>A servant stood there, holding a tray in trembling hands, his head bowed. “I’m so sorry, sir. I didn’t mean to interrupt. You asked me to bring you these soaps.”</p><p>Taz sighed and nodded. “Yes, of course. Put them down, please, by the side of the pool.”</p><p>The young man, Tygerian from the look of him, set the tray down and bowed his way out the door. Taz released his grip on Kyle’s arm and moved over to the tray, then sat down on one of the steps leading into the pool.</p><p>He picked up a bottle and uncapped it, then motioned for Kyle to come closer. “This is a soap I have made especially for my household. Come closer, Nobyo.”</p><p>Kyle moved between his legs and Taz poured a little of the soap in his hands and started to rub it first on Kyle’s hair. He’d never had his hair shampooed by anyone before, and he was surprised at how intimate and sensual the experience was. Taz stared straight into his eyes and Kyle leaned forward to bask in his delicious scent.</p><p>The soap smelled a little spicy and musky, reminding him of his mate, so he didn’t mind having the soap rubbed over his body. He enjoyed the feel of Taz’s hands on his chest and stomach. He moved farther down and his hand closed over Kyle’s rigid cock, and Kyle gasped with pleasure. This close, his mate’s scent was driving him wild, and would continue to do so, he knew, until they had mated properly.</p><p>The wicked hand continued down to his balls, which got the same close attention, and then Taz was turning him around, rubbing more of the soap over his back and buttocks. He reached his crease and ran his fingers along it, finding his hole and massaging the soap in gently, but thoroughly, with one of his fingers. He slipped in another finger, and began to stretch him slowly. Kyle flinched at the burn and tried to pull away.</p><p>“Be still, Nobyo. I need to prepare you for our mating.”</p><p>Kyle tried even harder to pull away. “No—I’ve never done this. Not there. I don’t want it.”</p><p>The fingers stilled and Taz’s voice sounded right by his ear. “You don’t wish to mate with me?”</p><p>Kyle turned in his arm and put his hands on Taz’s waist. “It’s not that. Of course, I want to mate with you. Just not...I’ve never done that before.” He tried to speak clearly and distinctly, though he heard the words slurring. The drugs must still be working on him, and he felt a bit floaty and like all of this was a dream.</p><p>“I want to do that to you,” he said, putting his head on Taz’s big chest.</p><p>Taz gave him a beautiful smile, and twisted him back around so quickly it made him dizzy. He bent him over. “No, baby. That’s not how it’s done.” Kyle felt the blunt head of something hard pushing against his entrance and he tried to stand back up straight, but Taz pushed him down again. It wasn’t his cock, surely. It was too hard and unyielding for that.</p><p>“Relax, Nobyo. Push back against the burn—I promise to be gentle. We can take our time.” He moved his hand over Kyle’s shaft, sliding his hand rapidly up and down its length. Kyle surprised himself by lifting his ass higher in the air, then pushing back forward, fucking himself on Taz’s hand. Taz caught his breath and moaned in Kyle’s ear.</p><p>“You’re so tight, Nobyo.” He pulled the thing he was pushing in him out partway and then pushed in again. He was easing it in farther each time, and Kyle arched back against him.</p><p>“I’ve—I’ve never done this before, Taz-lan. I don’t like it.”</p><p>“You’ll be doing it often in the future, sweet one. You’re mine now, Nobyo, and I will enjoy your beautiful body as much as I want. I’m putting a plug inside you to stretch you for our first time. It will help you, you’ll see.”</p><p>Kyle heard himself moaning. Taz’s plug was pressing into him harder, and he felt it breach the tight ring of muscles at his hole and slide deeper inside him. Kyle growled at the burn, and tried to pull away. He felt a none-too-gentle slap on his ass.</p><p>“Oh gods,” he groaned, and heard Taz give a satisfied chuckle. He shifted the plug a little and rubbed against something inside Kyle that made him cry out in surprised pleasure. What was that? It burned and felt like heaven all at once. Taz pulled the plug back out and then moved it in again, hitting the spot over and over, until Kyle was almost mindless with pleasure. He was afraid to move in case he was encouraging his mate, and surely he shouldn’t be enjoying this. At the same time, he was afraid the feeling might stop. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s it, Nobyo. Submit to me—give me your body.” He wrapped his hand around Kyle’s cock again and with only three hard pulls, Kyle came hard, his cum surging out into the water in front of him. Taz hummed with pleasure and kept stroking him until he’d wrung every drop from him. Kyle hung in his arms, his body limp with exhaustion, and feeling a little humiliated that he’d come so easily from the movement of the plug inside him.</p><p>Taz pulled him back so he was sitting on his lap, still impaled by the plug. He tried to catch his breath, and he could hear Taz doing the same, even as he rubbed and caressed Kyle’s body with his hands.</p><p>Taz leaned toward him, concern in his voice. “Are you all right, Nobyo? Did I hurt you?”</p><p>Taz tried to speak, to shake his head, but he couldn’t. His breath wouldn’t come, and he felt dizzy and confused. Everything in him ached and he let his head fall back onto Taz’s shoulders, suddenly wanting only to be taken care of. A part of his mind told him something wasn’t right, but his body soaked up the warmth and pressure of Taz’s skin against his. His body felt like it was melting into Taz’s. He was forgetting who he was, becoming little more than this alien’s creature, and he had to put a stop to it.</p><p>“I-I can’t-can’t do this. I have to...I need to c-contact m-my family...”</p><p>“I’m your family now, sweet one. I will be your whole life from this point on, along with our babies. Don’t fight it, darling. We’ll bond soon and then you won’t feel so unsettled.” Taz’s hand began to work his hand on his cock again, even though it was almost painful, since Kyle had just come. He whimpered a little and felt Taz’s tongue sliding along the side of his throat, leaving a trail of fire. Trying hard to hold onto his consciousness, he blinked his eyes, but it was no use. The darkness enveloped him, and he slid helplessly into it as it wrapped itself around him.</p><p>Taz was alarmed when his nobyo collapsed in his arms. Damn Tarr and his carelessness. He should have been more careful in dosing his nobyo with the drugs to keep him from shifting. They’d been developed by the prison system on Tygeria to contain the huge tiger shifters on the planet. Though Tygerians usually shifted only at the full moon, which occurred only four times a year, they were capable of shifting at any time.</p><p>A prison full of fourteen- to sixteen-foot long tigers would have been impossible to contain. Years before, Tygerian scientists had developed a chemical that inhibited the ability to transform by blocking neuro-transmitters in the brain. It was sometimes used for years at a time with the more violent prisoners, but it kept them a little weak and confused.</p><p>The problem was it was developed for Tygerians, not Lycans. He didn’t know how big a dose his brother had given his nobyo, but before he administered any more, Taz would call his personal physician to check his nobyo over.</p><p>Taz picked him up and carefully dried his body before carrying him into the bedroom. He laid him on his back and stared down at him while he used his communicator to call for the healer. After receiving assurances that the healer was on his way, Taz sat down beside his nobyo and took his pulse. Not that he had any idea what the pulse of a Lycan should feel like, but he wanted to do something.</p><p>He tried to remember the physiology charts of the Lycans he’d studied in the few hours since he’d brought him home, but nothing about heart rate came to mind. He pulled a leather thong from the drawer and put it around his nobyo’s waist, tying it in front to preserve his modesty in front of the healer. A thin flap of leather went down between the legs to cover his cock and balls and then pressed tightly against his hole to help him keep in the new plug. He’d only have to wear the plug for a while, until they’d made love several times and stretched him enough. Tygerians were large and he had no wish to harm his nobyo.</p><p>He looked down at him again and put a hand over his chest to feel his heartbeat. Lycan hearts were closer to the center of their chests than Tygerian hearts were. Thankfully, he saw his nobyo’s eyelids fluttering already, and he leaned over to kiss his lips.</p><p>“Wake up, Nobyo. I’ve called for the healer and he’ll be here soon. Can you drink some water?”</p><p>He nodded and Taz reached for the pitcher by the bed and poured him a glass, then helped him to a sitting position so he could drink. He pushed him back down again afterwards and smoothed his still damp hair off his forehead.</p><p>“Do you feel pain anywhere, Nobyo?”</p><p>“No, I’m just feeling weak and so confused. I can’t think straight. I-I can’t seem to catch my breath either. I’m worried too, about my family. They’ll be frantic by now. I have to get word to them.” Kyle tried to sit up, and Taz pushed him gently back down.</p><p>“That life is behind you now, Nobyo. I’m never giving you up, so they’ll have to accept it.”</p><p>“No, I don’t want you to give me up—that is, I want you for my mate, so they’ll understand that, but I have to explain it to them. So they’ll understand. Otherwise they’ll never stop looking for me. They’ll come for me.” He was becoming agitated again, rolling his head back and forth on the pillow, so Taz soothed him by caressing his jaw and murmuring to him.</p><p>“Of course, baby. You can talk to your family. But later. Now stop worrying and close your eyes. No one will take you from me. No one.”</p><p>He finally seemed to drop off to sleep, and Taz hovered over him while he waited for the healer. His breathing seemed to be getting harsher and Taz was worried. He paced the floor until finally he heard the healer arrive. Pulling on a robe, he went to answer the soft knock on the door.</p><p>“Come in quickly, Healer, please,” Taz said to the older man. He quickly explained that his nobyo was a Lycan shifter and about Tarr giving him the drug developed for Tygerians. “Did it harm him in some way? He says he feels very weak.”</p><p>The man gazed down at the sleeping young Lycan. “He’ll no doubt feel weak, so long as he’s on the medication, but it shouldn’t have bothered him so much, unless your brother gave him too much of it. His humanoid physiology is much the same as ours, with a few significant differences, but still...let me examine him.”</p> <p>For the next few minutes, Taz stood by tensely as the healer checked his nobyo. He’d heard all his life about how intense the bond was between a man and his nobyo, but had never given the idea much credence or paid much attention to it at all, really, and they hadn’t even bonded yet. What would he feel like after they’d made love?</p><p>He was only beginning to discover how deep the bond could be, and for the first time he understood how much his father mourned when his own nobyo had passed away. He and Tarr had been teenagers and really distressed and grief-stricken, but his father had been downright inconsolable.</p><p>The healer began to examine his Lycan, murmuring to him in a low tone, though his nobyo still seemed to be unconscious. Taz watched carefully. After a few minutes, the healer pulled Taz aside. “Has he said if he thinks you’re his mate?”</p><p>Surprised, Taz nodded. “Yes, he did. I thought that was strange. He said I was his mate and he couldn’t leave me. I haven’t even bonded with him yet.”</p><p>The healer nodded. “Yes, but he’s Lycan. That would account for this lovesickness.”</p><p>“Lovesickness?”</p><p>“Yes. Lycans have a very strong mating instinct. Once they’ve found their mates, they bond instantly, at a touch, and they mate for life. Did he react strangely the first time you touched him?”</p><p>“Yes, now that you mention it.” Taz looked surprised. “He fell back on his backside and looked up at me strangely, then wrapped his arms around my legs.”</p><p>“And has he made love to you yet? Completed the mating?”</p><p>Taz looked a little surprised. “No, of course not. He’s my nobyo, not the other way around. I will make love to him.”</p><p>The healer shook his head. “Yes, but you have a Lycan, and they’re all very dominant. His wolf hasn’t been allowed to claim its mate and that’s what’s making him lovesick. You may have to allow him to top you, though there can be side effects.”</p><p>“What kind of side effects?”</p><p>“As a Lycan mate, you wouldn’t be able to make love to anyone except your Lycan, no matter how much you might want to. If you were separated from him, the effects would fade over time, but it would take a while. You’d be physically incapable of mating. And if you, as a Lycan mate felt your Lycan was angry with you, you would get terrible stomach cramps. There’s a bio-chemical connection, you see, injected by their sperm.”</p><p>Taz looked affronted. “Ridiculous. No! We’ll find another way. I will make love to him, as is only proper with a nobyo. I’ll stop giving him the drug to prevent his shifting and perhaps that will help. I hate to restrain him, but that’s what I’ll have to do, I suppose. I can’t have him getting sick, and I don’t want him to shift. If he does, I’ll punish him. He’ll soon learn to obey his master.”</p><p>The healer nodded. “Yes, restraints and a firm hand should do the trick. Fuck him often and tame his wolf if you can. That will help too. You might try the silken flogger on him, but wait until the chemicals from the drugs have cleared his system.”</p><p>The silken flogger was an instrument of mild torture, though it certainly sounded tame enough. The silken strands contained chemicals that caused extreme sexual excitement for the victim. He would do anything, agree to anything, to get sex.</p><p>“Thank you, Healer. I don’t think I’ll have to resort to chemicals, but I’ll keep it in mind in case he’s particularly resistant to training.”</p><p>“Yes, he looks stubborn.”</p><p>Taz smiled. “Yes. Well, so am I.”</p><p>“Good.” The healer nodded and started for the door before turning back. “Your Lycan will make you an excellent nobyo once you train him, I think. Be careful—he has sharp teeth and claws.”</p><p>“Then he’ll find himself muzzled with his claws trimmed, and his ass sore. Have no fear, Healer. No matter how fierce he might be, I can handle him.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The healer smiled. “Unless you fall in love with him. Be very careful—you may have met your match in this one.”</p><p>Chapter Four</p><p>Kyle dreamed that he was drifting underwater. It was peaceful and calm and in the distance he could just make out a little house with a low red roof and white walls. He almost opened his mouth to laugh. Why would there be a little Lycan house underwater? Then he remembered as a boy when the rains came for nearly two weeks and a small community on the outskirts of town flooded. The river overflowed its banks and completely covered the houses there.</p><p>A dam was built and the place became a huge lake. He and his cousins drifted in the water there sometimes in the next few months and took turns peering under the clear water to see the strange sight of the road and the houses with the doors sitting open underneath all that water. He started to swim down to one of them, when someone caught his arm and pulled him back.</p><p>He looked around curiously and saw that it was his cousin Blayde along with his alpha Lucas, swimming alongside him now in the crystal water. Blayde was shaking his head at him and motioning for him to turn back. Kyle shook his head. He wanted to swim down and go inside the house, but his cousins wouldn’t let him. They both kept pulling at his arm and shaking their heads over and over. Lucas pointed below and shook his head frantically. What was it?</p><p>He finally pulled away and looked a little closer to see, and then he spied his mate, Taz, swimming just below and beckoning to him to follow. His long golden hair spread out in the water around him. Kyle wanted to go down to him, but Lucas was in front of him now, blocking the way. And suddenly his brother Nikolai was there too, grabbing him from behind. He struggled with them both to get to Taz, who was drifting farther and farther away from him. He had to get to him before it was too late.</p><p>“Nobyo, Nobyo, wake up. You’re having a bad dream.”</p><p>Kyle opened his eyes in a panic and found Taz leaning over him, his eyes lit up with concern. Kyle looked around wildly, trying to figure out where he was. He was so weak and disoriented. He and Taz were in a large bed together in what must have been the Tygerian’s bedroom. The room had stark white walls with no decorations of any kind, yet it seemed rich and even opulent. Part of it was the gleaming richness of the few pieces of massive, dark furniture, including the big square bed in the center of the floor, which seemed to consist mostly of large, soft pillows on a flat wooden frame.</p><p>Kyle was currently sunk down deep in the feathery pillows, but he had trouble moving his feet. He peered down at them and found both ankles attached to a chain that stretched between them. The chain wasn’t very long—about as long as his hand and forearm together. He could move, but his movements were severely restricted. And what the hell was stuck up in his ass? He turned an incredulous gaze on Taz.</p><p>“You seemed frightened, baby,” Taz said in Earthonian. “Don’t be afraid. Nothing will ever harm you here with me. You’re safe.”</p><p>“Safe?” Kyle rubbed his eyes and focused on his mate’s handsome face. Taz needed to shave, and he had a little soft, blondish red stubble on his chin and his upper lips. Kyle wanted to nuzzle it with his nose, but he stopped himself. He was furious and wanted to hold onto that fury a little longer. The drugs were making him too calm and placid, and he hated the damn floaty feeling they gave him.</p><p>“You have me chained up! And what the hells do you have up inside me?” He twisted to pull at himself, noticing for the first time there was some kind of leather thong thing wrapped around his waist and covering his genitals. Taz caught his wrists and held on tightly.</p><p>“Stop, Nobyo. I have you plugged until we make love later. I’m quite large, and the plug will help you to be ready for me.”</p><p>Kyle stared at him incredulously. He tried to speak, almost choking on the words. “You have me plugged! Oh, gods no, that is not going to happen. Get this out of me! We’ll mate, yes, but I’ll make love to you.”</p><p>Taz actually had the nerve to look affronted and made no move to release his wrists. “You forget your place, Nobyo. You’re mine now. Your body belongs to me. Now no more foolishness or I’ll chain your wrists as well.”</p><p>“Let me go, Taz-lan. And take these damn chains off my ankles! I demand it!”</p><p>Taz got a damn patient, I’ll-humor-the-poor-thing look on his face. Kyle wanted to mash it right off—with his lips, preferably. Damn him.</p><p>“Nobyo, you don’t make demands with me. I’m trying very hard to be patient, because I know this is all new to you. But you are no longer in charge of anything, darling. You belong to me now, and I’ll make all your decisions in the future. As for the chains—well, they’re not chains—exactly. The device is called a hobbler, and designed specifically for training our nobyos—the difficult ones who try to run away. You can walk, but just not quickly. It will prevent you from trying to leave me, now that I’m following the healer’s orders and backing off your drugs a little. If you promise to calm down, I’ll release your wrists.”</p><p>Kyle thinned his lips and nodded, so Taz would let him go. Immediately after Taz took his hands away, Kyle reached down to grab the chain and tug on it. He pulled so violently, the cuffs on his ankles dug into his flesh, but he didn’t care. He would not be chained up like a dog! “I’m not trying to run away, damn it! And I won’t be chained like this!”</p><p>“Stop that right now or I’ll have to punish you,” Taz said in a loud, commanding voice. Kyle stopped pulling at the chain, or hobbler, or whatever he’d called it, and looked up at him in surprise.</p><p>“Make no mistake, I will spank your ass and chain your wrists if I have to. Then chain you to the wall until you learn how to behave. Now will all that be necessary or are you going to calm down?”</p><p>Furious, Kyle could feel his chest heaving. It was getting harder to breathe, and he wondered briefly if the air on the planet had enough oxygen for him.</p> <p>“Spank me!” he yelled furiously. He bent down and tore at the chain again, and his mate grabbed his wrists and pushed him to his back, rolling on top of him. Now he really couldn’t breathe, and though he wrestled with Taz a little, he couldn’t keep it up for long.</p><p>The fact that his gorgeous mate was naked and on top of him wasn’t helping, despite the fact that he was so angry at him at the moment. He bit his lip and finally nodded. “All right. I won’t fight you. For now,” he said with a snarl. Had this not been his mate, he’d have never complied in any way, but he realized that if they fought, even in his weakened state, he might hurt his mate. And that was completely unacceptable.</p><p>“Good,” Taz said, smiling at him and kissing his cheek. He rolled off beside him, though he kept his leg slung over both of Kyle’s. “Your training begins today, darling, but don’t worry. I’ll make you into the perfect nobyo in no time.”</p><p>Kyle growled and ran a hand over his face, still trying to clear away the grogginess. Most of the drugs in his system seemed to have worn off, but his reactions were still slower than normal. And why couldn’t he catch his breath properly? Since it was worse with agitation, he made a conscious effort to calm himself and his breathing eased a little. He decided not to pull on the chains anymore. It was getting him nowhere fast and making his ankles sore in the process. He glared over at Taz.</p><p>“On top of everything else, I’m starving. Am I allowed some food before we start this training of yours, or is your plan to starve me into submission?” he asked in a waspish tone. He was never in a great temper when he was hungry, and this time was proving to be no exception. He wondered just how long it had been since he’d had any real food. Probably days from the way his stomach felt.</p><p>“How long has it been since your brother kidnapped me?”</p><p>“Today makes four sunrises.”</p><p>“Four? No wonder I’m starving! You’re trying to kill me!” Kyle put his head in his hand, trying to remember just what he’d eaten last, but couldn’t even remember.</p><p>“Don’t be so dramatic, Nobyo. They couldn’t very well feed you when you were unconscious. They gave you water, I believe, to keep you hydrated. You’ve been mostly sleeping since I brought you home.”</p><p>“Half-drowned me with it, you mean! I remember a little of that, I think. And stop making them sound so solicitous. They kidnapped me, damn it!”</p><p>“Nobyo, I realize you’re upset, but I won’t allow you to yell at your master. Now be good and I’ll get us some food.” Taz ignored Kyle’s gasp of outrage at the word master and pressed a switch on the wall by his head. The door opened in mere seconds to reveal a servant, who bowed deeply at the waist.</p><p>Taz spoke to him in rapid Tygerian and sat up, holding out an impatient hand. “Come, Nobyo. The servants are bringing us our first-meal.”</p><p>Kyle tried to scoot to the foot of the bed, but got caught up in the damn pillows. The chain between his ankles snagged the corner of one of the massive things, and he was unable to get it unsnagged.</p><p>“Damn it!” He glared up at Taz. “Get this fucking thing off me, now!”</p><p>Taz folded his arms and frowned down at him. “I don’t think I like your tone, Nobyo. I’ve already explained why the hobbler is necessary.” He hauled Kyle to the edge, before picking him up in his arms and carrying him to the table and chairs in a corner of the room.</p><p>Kyle was large and not used to anyone carrying him around. He struggled a little and grabbed onto Taz’s neck, afraid he’d drop him.</p><p>Taz walked briskly over to deposit him on a chair by the table, not even breathing hard. The second he put Kyle in the chair, the damn plug shifted inside him and he made another grab for it, only to have his hand slapped away.</p><p>“Stop, Nobyo. The plug will stay in until I make love to you and we bond. Behave yourself or I’ll chain your wrists while I feed you.”</p><p>Kyle stiffened in outrage. “I’m not a damn child!”</p><p>“Then stop acting like one,” Taz said calmly, seating himself across from Kyle.</p><p>Kyle glared at him as a knock sounded on the door and it opened to admit two servants, both carrying large trays of food. Kyle felt weak at the sight and smell of the hot food, most of which he didn’t recognize, but any port would do in a storm. Gods, had he ever been so ravenous? Taz took a plate and filled it with a variety of foods and handed it over to him. “Normally, I would have you serve me, Nobyo, but this is a special occasion. Our first meal together.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kyle nodded, too intent on the plate of food in front of him to really pay attention. Still, hungry as he was, he waited to see if the Tygerian observed any religious rituals before eating they did on some planets. Taz gazed over at him approvingly.</p><p>“Thank you for waiting for my permission. You may eat, darling. I know you’re very hungry.”</p><p>Kyle gave him a resentful glare. He hadn’t been waiting for permission, only trying to show good manners. Since his resentment was being ignored, however, he began eating some kind of bread with a spicy kind of butter on top. He found it to be delicious. There were small meat pies and what looked like yams too, piled high on his plate. Kyle gave each dish his attention until he’d cleared it all away. He finished with a mug of sweet-tasting milk and leaned back in his chair to find Taz watching him carefully.</p><p>Taz smiled at him. “You have nice manners. That’s good. It’s very important as my nobyo that you be able to teach our children how to act properly.”</p><p>Kyle narrowed his eyes. “Our, uh, children? We—I mean—you have children?”</p><p>“Of course, darling. Well, our first son will be here soon, anyway. I must have you properly bonded and trained by the time he gets here.” He smiled and picked up his own mug of milk and took a sip.</p><p>The conversation Kyle had with his cousin, Blayde—could it have only been a few days before—suddenly came back to him. What was it he’d said? That’s one reason the Tygerians purchase love slaves. The love slaves rear their babies for them...They call their captives their nobyos. To them, it’s almost like a spouse and another father for their children. They keep them very submissive...</p><p>Kyle felt stunned. He’d joked with his cousin about it—now it didn’t seem to be funny in the least. So this was why he kept insisting on calling him Nobyo instead of his name.</p><p>“You-you really want me to be your damn nanny? I thought Blayde was exaggerating.”</p><p>Taz frowned at him. “I don’t know who Blayde is, and I don’t understand this nanny, but I don’t like your tone. As I have explained, we call our love slaves our nobyos, and they are like our mates, as I believe you call it. Our nobyos are very special to us—we trust them with our children. This is a very great honor.”</p><p>“I-I don’t know anything about children! Especially babies!”</p><p>“The servants will help at first, Nobyo, and you’ll soon learn. You worry too much. Are all Lycans like this?” He stood up and came around the table toward Kyle, whose mouth suddenly went dry at the sight of his naked body. His brain went tilt and whatever they’d been discussing suddenly didn’t seem all that important anymore.</p><p>His wolf, who had been sleeping inside him, suddenly stirred and Kyle felt his cock thicken. His mate was so damn beautiful. Kyle stood to meet Taz and reached for him without thinking, drawing him into his arms.</p><p>Taz came willingly, smiling down at him. “You’re beautiful too, Nobyo.” Kyle looked up in surprise to meet his twinkling gaze. Gods, had he said that aloud?</p><p>“Now that you’ve eaten, I don’t think I can wait any longer to bond with you,” Taz told him. “Are you feeling well enough, darling?” Taz held him tightly in his arms, rubbing his hands over his naked ass.</p><p>“Gods, yes,” Kyle said, pulling Taz’s head down toward him. He took his lips fiercely, thrusting his tongue inside his sweet mouth and rubbing his cloth-covered erection against Taz’s naked groin.</p><p>Taz made a wordless sound and picked him up again by holding him tightly around his waist and walking backwards toward the bed with him, still ravishing Kyle’s lips with his own.</p><p>As Taz carried him toward the bed, he thought how nice his nobyo felt beneath his hands, and he couldn’t imagine how he’d managed to wait so long to claim him. He tumbled him back on the bed and dropped down over him to continue their interrupted kiss. His lips were soft and warm, and he enjoyed the feel of his nobyo’s tongue inside his mouth. This wasn’t a custom of the Tygerians, but he found that he quite liked it. He would encourage his nobyo to service him this way in the future.</p><p>Taz pulled back to look down at him. He was so pretty, with his tanned skin and golden-red hair. And those eyes and eyelashes. Taz thought he’d never seen any prettier, even on the females he’d known. He ran his hands over the muscles on his nobyo’s chest and stomach. All his and everyone he knew would be envious of this beauty and strength under his command. Taz bent down to nip at his neck, marking him. He wanted to cover his baby in bruises that would show everyone exactly who he belonged to.</p><p>Taz felt his nobyo’s rigid cock beneath him and quickly untied his thong and ripped it off, throwing it down beside the bed. His Lycan’s beautiful long cock sprang out, hard and hot.</p><p>He touched it and his nobyo groaned, pushing up into his hand. He answered him with a groan of his own and fell down on top of him, rubbing their pricks together. His nobyo’s lovely cock leaked pre-cum copiously, and he was grinding back against him. Taz pulled his wrists above his head and held them there so he could bite his neck again.</p><p>His lover squirmed beneath him and struggled a little. “N-no. Not like this, Taz-lan.”</p> <p>“Yes, sweet one, exactly like this.” Taz moved up to cover his lips again, tracing them with his tongue. He moaned and practically attacked Taz, trying to fuck Taz’s mouth with his tongue. Instead, Taz grabbed his tongue with his lips and sucked it hard into his mouth, taking control away from his nobyo. His eyes opened wide and though he didn’t try to pull away, Taz could hear the growls start up in his chest.</p><p>He pulled away, laughing. “You like to fight, yes, Nobyo? Go ahead. It will make my victory over your body even sweeter.” His nobyo made an angry sound as Taz moved his lips down to his nipples. Complaints and curses in what must have been his own Lycan language filled the air, but Taz ignored them, holding tightly to his wrists and biting now at his nipples. He worried one nipple with his teeth and his tongue until his nobyo was groaning and begging.</p><p>“P-please stop, Taz. Gods, stop!”</p><p>“That’s right, beg me,” Taz said, smiling down at him. Even though his nobyo was complaining and cursing, he still pushed his hips up and ground against Taz’s cock restlessly. Taz knew he was enjoying this much more than he was letting on.</p><p>He smiled down at him again. “Of course,” he said, “if you really don’t want me to make love to you, I will let you up. I have no wish to force myself on you.” He lifted his body up a little by his elbows and knees, still holding his nobyo’s wrists, but denying him the friction on his cock now. His nobyo bucked up wildly beneath him, trying to touch him again and gave a little cry of dismay.</p><p>“No, no, I want...I want you, Taz-lan. I do want this.”</p><p>He lowered his body back to cover his nobyo, who immediately ground up into his groin. His cock was jerking and swelling beneath Taz. Taz bit his nobyo’s shoulder and then licked the hurt away. He leaned up on one elbow and started stroking his nobyo’s cock in long, slow pulls that make him cry out and beg for more. His shaft was red and swollen, leaking more and more pre-cum, and Taz let his hand drift down to the flesh beneath the Lycan’s balls. He felt the plug there. It had been held in by the tight thong, but was sliding slowly out, so he pressed the heel of his hand against it to push it back in.</p><p>His Lycan tensed and cried out, looking up at him with those big, beautiful, scared eyes. Taz kissed him again. “Will you let me bond with you now, darling? I want you so much.”</p><p>The Lycan hesitated a long time—so long Taz thought he might refuse him, and he wouldn’t force this on him. He’d have to want to bond with him for the full effect to take place. Tygerians also secreted certain chemicals in their semen that, with males at least, created a strong, unbreakable bond. It was why Tygerians had to be careful to whom they made love, and never fucked anyone except their chosen nobyos, though oral sex or mutual masturbation was permissible. Young Tygerian males frequently used each other’s bodies for that. True bonding, however, was reserved for their chosen ones.</p><p>After an achingly long time, his lover gazed deeply into his eyes and nodded. “Yes, Taz-lan. I want you to make love to me.”</p><p>Taz caught his breath at the depth of emotion in his nobyo’s eyes. He kissed him tenderly. “I will always care for you, darling. I will keep you safe. You have my vow.”</p><p>“You’re my mate,” he answered simply. “I have to be with you. If this makes you happy, then I’ll give it to you.”</p><p>The sweetness of the reply struck a chord in Taz’s heart, and he covered his nobyo’s face with kisses. Tenderly, he reached down and pulled the plug gently from his nobyo’s sweet hole and placed it on the table beside the bed. He found some oils he had left there and spread them liberally over his cock. Then he put some of the oil on his fingers and gently inserted one finger in his nobyo’s ass, carefully checking to see if he was in any pain.</p><p>His nobyo held himself rigid, but the plug had done its work well, and stretched him properly. Seeing how stiff his nobyo’s shoulders had become—he was gritting his teeth as if this was something he must endure but not enjoy—Taz crooked his finger up to touch the small bundle of nerves he knew was there. He and his friends had been taught that this spot would make their nobyos feel good so they practiced, locating this spot on the anatomy charts, so they could pleasure their nobyos one day.</p><p>When he found the spot on the Lycan, he swiped over it gently with his finger and enjoyed the look of surprise and pleasure on his face.</p><p>“Oh, gods!” his nobyo cried out, and his eyebrows rose. Taz continued to rub his finger over it. His nobyo’s eyelids got heavy and he licked his lips. Taz thought him very beautiful. He fell down between his legs, pulling out his fingers and nudging his cock against his nobyo’s sweet hole. “Sweet boy,” Taz murmured to him, and eased his shaft inside him. His hole clenched around him like a fist, despite the stretching by the plug, and Taz was almost overcome by the heat and the sensations. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Deeper,” his nobyo cried out, and Taz wanted to shout in triumph. Instead he gave him what he wanted and began to set up steady strokes, each angled so that it brushed over the place inside him that gave him so much pleasure. He was so tight that Taz was still afraid he’d hurt him, but his lover was making little whimpering sounds and his cock, when Taz wrapped his hand around it, thrust up strongly into his grasp, hard and rigid.</p><p>Taz undulated his body over his nobyo’s, pushing in and going deeper to make this bonding strong and solid.</p><p>“You’re mine, Nobyo. Say it. Tell me no one else will ever have this body.”</p><p>The Lycan thrashed his head on the pillows and gave him a needy little sound, but he was stubborn. Taz pulled all the way out—just the tip of his cock poised at his entrance and heard his nobyo gasp. He thrust his hips upward for more, but Taz held himself up out of his reach. “Say it, Lycan. Say you belong to me. Only me.”</p><p>He looked up at Taz resentfully and finally seemed to sag—his whole body going limp. “I-I’m yours. Yours.”</p><p>“Say you belong to me. Say it.”</p><p>“I belong to you! Only you.” He shouted the words almost angrily, his whole body blushing a delightful pink color.</p><p>Taz smiled down at him. “Yes, darling. That’s right. And I’ll never let you go—never let you leave me.”</p><p>He thrust back down into him and pushed in hard, pounding against him. The muscles wrapped around Taz’s prick were squeezing him tightly. Taz moved his hand harder and faster, catching the same rhythm. It was then he felt his boy’s body clench and tighten. He cried out Taz’s name and came hard, the white spunk hitting his own stomach. Taz squeezed him harder, milking him for every drop. He managed a few more thrusts before he was coming too. He arched his back as his cum shot into his nobyo, injecting him and filling him up with the semen that would ensure their bonding. His nobyo felt it because he opened his eyes wide and cried out, not in pain but in surprise.</p><p>His boy had been claimed—well and truly claimed and the wolf had been tamed, made to lie down and roll over on his back while the tiger spunk left its mark inside his nobyo’s body. “Mine,” Taz exulted as he kept pounding into him, long after the Lycan wolf had given up and fled, leaving only his sweet nobyo.</p><p>Chapter Five</p><p>Kyle was about to go out of his mind with boredom. After several days with him, Taz had left to go back to work, leaving Kyle with too much time on his hands. He’d tried reading, exercising, even lying on the bed staring up at the ceiling, and he was still slowly but surely going out of his mind. Taz seemed to want to keep him as much in the dark as he possibly could about what he did for the Tygerian government, but Kyle had gleaned enough information to know that he was a pretty big deal. That morning a special transport had arrived to take him to wherever he was going, and as Kyle watched out the window, the driver had seemed very deferential.</p><p>The transport had some kind of official Tygerian symbol on the side as well. Taz had been wearing a pair of dark trousers and a longish red coat, buttoned all the way up and reaching almost to his knees. The material looked rich and expensive, and Kyle thought he looked really handsome, his face solemn and businesslike. To look at him, you’d never know he kept Kyle up half the night fucking him in positions Kyle hadn’t previously thought possible.</p><p>In order to watch out the window, Kyle had to first pull a chair over and climb up on it, because the windows in this house at least were some ten feet high on the walls and seemed to be designed to let in light, but not expose any views. As a result, the rooms seemed claustrophobic to Kyle and little better than a luxurious prison.</p><p>After Taz left that morning, Kyle had mostly rested and tried to regain his strength. The drugs were mostly out of his system by now, but they’d taken their toll, leaving him feeling drained and weak. The first few days, when Taz hadn’t been making love to him, Kyle had done little else besides eat and sleep. There was no doubt in Kyle’s mind that the bonding Taz spoke of had taken place, because he never wanted Taz to be away from him. The bond was already intense, even before they made love, but now it seemed overpowering and simply took his breath away.</p><p>This morning, however, with his strength almost back to normal, and Taz leaving to go back to work, Kyle needed something to do or he’d soon be climbing the walls. He was even feeling some separation anxiety, which he firmly told himself was ridiculous. He refused to succumb to this thing—he’d fight to keep his own identity and not lose himself to this bonding. His own mating urge was strong enough. Coupled with this Tygerian’s so-called bonding, it would be enough to overpower him if he wasn’t careful.</p><p>Pacing up and down like a trapped animal, he remembered what Taz had told him only the night before. “Your situation has changed, Nobyo, and you must learn to accept that fact. If you can, you can find peace and happiness here with me and my children, but if you can’t, if you continue to fight this, it will eventually destroy everything we have between us.”</p><p>“I don’t want that, Taz. You’re my mate, but I’m also a Lycan. I can’t accept your domination. In my world, this wouldn’t happen.”</p><p>Taz stared steadily back at him. “You’re no longer in your world, Nobyo. Whether or not you like to admit it, I am your master. I’ll never give you up. And I’ve told you before to call me Taz-lan.”</p><p>Kyle glared at him. He refused to even try to understand how Kyle felt. “What’s that about anyway? Is it part of your name?”</p><p>“No. The suffix means ‘master’ in my language. It is the proper way a nobyo addresses his owner.”</p><p>Kyle had snorted and pulled away. “My owner? Fuck that, Taz. No one owns me! I’m here because your brother kidnapped me.”</p> <p>“You’re a prisoner of war. He captured you. And my brother tells me you came to kidnap him.”</p><p>“To arrest him! It’s not the same thing at all!”</p><p>“Arrest him? Oh whose authority? The Alliance? We’re at war with the Alliance, Nobyo, as you well know, and we care little about what they think. What crimes did they say he had committed?”</p><p>“Tarr Bonnet traffics in love slaves—he works with the Jolly Rogers and they’re a bunch of thugs. Surely you know what Tarr does.”</p><p>“Of course. But doesn’t your home planet also have love slaves? Along with other planets in the Alliance?”</p><p>“That’s different.”</p><p>“How so?”</p><p>Kyle stood up and started pacing back and forth. “It just is! Our love slaves put themselves up for sale. They have contracts, and they get paid a lot of money. No one is forcing them!”</p><p>Taz nodded. “So do ours—except for captives of planets with which we’re at war.” He gave Kyle a long look. “Like you, Nobyo. Do you feel as if you’re being forced to submit to me?”</p><p>“Of course I do!” At Taz’s steady look, he backed off a little. “Okay, so you’re not exactly forcing me.”</p><p>“If you hate this so much and feel that you’re being taken advantage of, then I’ll let you go. I’ll find a way to send you home—perhaps a prisoner exchange.”</p><p>“No!” Kyle shouted. “That’s not what I want. Not unless you come with me.”</p><p>“You know that’s impossible. I have a child about to be born. My life is here on Tygeria, and I can’t leave it. I want you here with me, but we’re at war with the Alliance. It’s an ancient war and our scars are deep. The only role for you in my life—the only future we have—is for you to remain here as my nobyo.”</p><p>“So I’m basically spoils of war? Just a prisoner?” He stopped pacing and glared at Taz. “If I’m only a prisoner of war, why am I not in one of your prison camps? Why did you come for me in the first place?”</p><p>Taz sighed and shook his head. “You know the answer to this, Nobyo. Why do you persist in being so stubborn? My brother thought I would like you. I did. I wanted you from the first moment I saw you. If I hadn’t taken you, then yes, you would now be in a prison camp. Do you want me to put you aside? Let you go home?”</p><p>“No, of course not. I told you that you’re my mate. Once I saw you—touched you—I can no longer be without you. My family has a biological imperative to be with their mates.”</p><p>“Then why are we always discussing this?” Taz snapped. “Damn it! Even if you asked to leave me, I don’t know if I could really let you go!” He stood up and crossed the room to catch Kyle up in his arms and drag him over to the bed to make love to him. Most of their arguments ended the same way, actually, with Taz exerting his dominance over Kyle and trying to prove to him that he was in charge. Taz actually believed that he had vanquished Kyle’s Lycan wolf in some way, deep inside him. Actually, nothing could have been further from the truth.</p><p>Kyle’s wolf was still there, still very aware of what was happening. He was willing to submit to his mate, though not necessarily pleased about it. Still, in some ways he responded to Taz’s extreme dominance. Did his wolf recognize a true alpha in Taz and wish to submit? It was the only possible explanation for why he mostly wanted to obey his mate, and why he responded with so much excitement to their lovemaking.</p><p>Though he still badly needed to complete the mating by biting and claiming him as well, his wolf had been pacified by the almost constant lovemaking they’d been engaged in, and that was unusual for a true alpha. His cousin Lucas or Blayde would have gone insane by now. Perhaps he really was a beta, and thus, while he sometimes balked at his mate’s domineering behavior, he mostly responded to his orders.</p><p>Taz had been careful so far never to allow Kyle to top him or be anywhere close enough to the back of his neck to bite him when they made love, but Kyle knew it was only a matter of time until he let down his guard. Until then, he was enjoying his mate and playing a kind of waiting game. The most he could hope for with the extremely dominant Tygerian would be a kind of partnership of equals. Kyle even thought he could allow him to be in charge, to a certain extent, but in order to accomplish either of those things, he had a lot more work to do. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kyle needed to convince his lover that he was as brave and as strong as he was, and that he needed no protection. He’d be willing to submit to him, if that was what he needed, but he had to stop treating Kyle like some delicate, not-too-bright pet. And that was going to take a lot of persuasion.</p><p>In the meantime, Kyle was worried about his family back on Lycanus 3, and determined to let them know he was alive and not being tortured or mistreated in any way. They had to know Tarr Bonnet was involved and would naturally think the worst. They must all be frantic by now. He had to let them know that he’d found his mate, and wanted to stay with him.</p><p>That wasn’t even the only reason he needed to contact them. He was worried about their feelings, of course, and how worried they’d be, but most of all he wanted to prevent any ill-advised rescue attempts that would ultimately be unsuccessful and might even lead to some of them being hurt or even killed. He knew Lucas and Kyle’s own brother Nikolai—hells, the entire family— would never rest until they found him. Taz was equally unwilling to give him up. It could prove to be a dangerous situation.</p> <p>Restlessly, he got up and walked to the door. When he tried the door knob, it opened for him right away, and he was a little surprised. Taz really had become complacent about him in the last few days. Kyle had no doubts the servants had been told to watch him, and if he tried to leave the house, he’d be quickly stopped, but he seemed to have freedom of movement within these walls.</p><p>He could hear some of the servants outside working on the grounds, and the others were in the kitchen from the sounds of it. He slipped as silently as he could down the hallway to Taz’s office and surprisingly found it unlocked. He knew Taz had a compnet, and worked on it most evenings. He wondered if he’d be lucky enough to be able to get on and send a message to his family.</p><p>Taz had promised he’d do it for him, but so far he’d never asked for their contact information, and Kyle thought he was still just putting him off, perhaps thinking they’d forget about Kyle eventually. If so, Taz had no idea how fiercely loyal Lycans were, especially to their families.</p><p>He found the compnet with no problem, and it wasn’t even password protected, so he was able to get on soon enough. The problem came when he tried to send a message to Lycanus 3 or anywhere else outside Tygeria. A warning of some kind popped up—in Tygerian, so Kyle had no idea what it said, but the red, flashing border around the message gave him a pretty good clue that the network wasn’t wishing him a good day.</p><p>An idea occurred to him and he quickly wrote a message to send to the embassy of the planet Jayron. He was able to look up its address on Tygeria and hit the send button before he could second guess himself. Jayron was the planet his brother-in-law, Jagger, came from and had diplomatic ties to both Tygeria and the Alliance. Kyle had met Jagger’s mother and father, the king and queen of Jayron, and he thought that maybe the embassy would at least recognize his name and pass on a message to his family for him—if the message wasn’t ignored or filed away by some bureaucrat as spam. All he could do was write the message and send it to through the diplomatic channel he found online and hope for the best.</p> <p>He turned off the compnet and stole quietly back out of Taz’s office. On his way out, he stopped for a moment to look at Taz’s trophy case, near the door. Like most young Tygerian males, Taz competed in the Gladiator games, a popular, if bloodthirsty sport that took place in the arenas. The wealthy young men on the planet loved to fight in the Exhibition Games, arena-type games held from time to time, and usually fought by slaves or prisoners. Though it was forbidden by Tygerian law, young warriors like Taz would sometimes take part, with officials turning a blind eye to it in the name of higher television ratings.</p><p>The games were always performed in front of large crowds, and broadcast to a huge audience on Tygeria and its allied planets. A warlike people, the Tygerians liked nothing better than a good fight, and sometimes, especially when they were fighting condemned prisoners, the fight was to the death. If the prisoner showed exceptional courage, he might even win his freedom, as the crowd decided the outcome with a raised fist if they wanted to spare the prisoner’s life. They admired courage and bravery more than any other trait. However, if the prisoner showed fear by cowering or running away, the crowd would scorn him, and he would be dispatched quickly. Taz had shown Kyle his many trophies won in the games proudly, along with Tarr’s. He kept them in this special case by the door.</p><p>Because of his participation in the games, Taz liked to stay physically fit. He had a well-equipped gym in his home and Kyle headed that way now. He spent the next hour or so using the weights and Taz’s machines, then went and took a long hot soak in the bathing chamber. Later in the afternoon, he studied some of the Tygerian language books Taz had obtained for him, just trying to pass the time until Taz came home.</p><p>It was late in the afternoon when he finally heard the door open and Taz walked in, looking tired and a bit subdued. Kyle put down his book and smiled at him, knowing he liked it when he made a big deal of his arrival.</p><p>“What have you done today, Nobyo?” Taz asked, gazing at him somberly.</p><p>“Not much. I slept late. Exercised a while, then studied the language books after that. Did you have a good day?”</p> <p>“It was...interesting.” Taz slipped off his jacket and sat down at the table. The door opened within a minute or so and servants began bringing in the evening meal. Kyle sat down across from Taz, wondering if something had happened at work to make him upset.</p><p>In the meantime, the food smelled good and he filled his plate to begin eating. It was some kind of stew with a bit of a strange flavor, so Kyle decided not to even ask what it might be. He was hungry and concentrated on his food for a while before he noticed that Taz wasn’t eating, but just sitting there watching him.</p><p>He touched a napkin to his lips and leaned back in his chair. “Is everything all right?”</p><p>“Perhaps you should tell me.”</p><p>Kyle cocked his head. “Sure, I guess so. I was bored all day, but whatever...” he shrugged.</p><p>“Really? So bored you had to ask the Jayronian ambassador for help?” Taz spoke quietly, staring across the table at him.</p><p>“Shit,” Kyle said, throwing his napkin on the table. “They contacted you.”</p><p>“Yes.” He nodded. “The Jayronian ambassador is a good friend of mine. As soon as your message crossed his desk, he messaged me.”</p> <p>“Well, hells, Taz.” Kyle lifted his chin defiantly. “I’ve told you from the first day I needed to contact my family, and you’ve refused to help me.”</p><p>“I’ve told you your life in Lycanus is over. You’re with me now. You belong to me, and you’re my family.”</p><p>“Yeah, well, it doesn’t work like that, Taz. I won’t just forget all about the family I’ve had all my life.”</p><p>“You’d rather be with them than me.” His voice was flat and emotionless, his eyes cast down at the table.</p><p>“No!” Kyle slammed his hand down on the table. “I’ve told you that you’re my mate. You must know by now what that means to Lycans and to my family in particular. I’ll never leave you, Taz, and I don’t know why you don’t believe that. Have I made any attempt to escape? Have I even asked you to let me go?”</p><p>Kyle stood up, too angry to sit still, and pointed his finger in Taz’s face. “Do you honestly think I would stay around here letting you make me into your little bitch if I hadn’t been in love with you? If I could bear to leave you behind? I’d have made you kill me first. I’d have killed myself!” He glared across at Taz, full of all the pent-up rage he’d felt since he was taken in the bar back on Leeria.</p><p>Taz jumped to his feet and slapped Kyle’s finger away. “You forget who you’re speaking to, Nobyo! I should beat you for going behind my back this way and embarrassing me. This stubbornness of yours is coming between us and it has to stop. I’ve told you before that your situation has changed and if you want to stay with me like you say you do, then you have to accept it.”</p><p>Kyle stormed across the room and sat down on the side of the bed, crossing his arms over his chest and refusing to look at Taz. He was afraid he’d take a swing at him and they’d have to fight. Taz followed him over to the bed and stood next to him, trying to intimidate him with his nearness.</p><p>“I told you I’d contact your family, and I did. I sent them a message that you were alive and well on Tygeria. I told them you were training as my nobyo and that you were no longer any of their concern.”</p><p>Kyle rolled his eyes dramatically. “Well, you may as well have issued a direct challenge to them! Why not just spit in their faces while you’re at it? They’ll be coming for me, don’t you see? And if they do, you’ll fight them. Whether you kill them or they kill you, it’s all the same—it will destroy me! Can’t you see that?”</p><p>Kyle covered his face, horrified to feel tears prickling the backs of his eyes. Taz sat down beside him right away and took him in his arms, tipping his head back to make him look directly at him.</p><p>“I would never harm your family, Nobyo, but I have to break down this resistance you have to your new life. I think that worrying about them and what they might think about us has hampered you. I will break this resistance, Nobyo. Make no mistake about it. I have to become your whole world in order for that to happen. Your loyalty has to be solely for me.”</p><p>Taz bent and took his mouth passionately. Kyle allowed it, even kissing him back, but pulled away and pushed at him until he backed off.</p><p>“No, you can’t just command me to forget my family and think I’ll do it. I have a brother, a twin like you do, though we don’t look that much alike. And all of my cousins are almost as close. I’d do anything for them as they would for me, and they’ll understand if I tell them you’re my mate. Most of them are mated themselves and they know how strong the bond is. Once they know I want to stay, it’ll be all right.”</p><p>“It will be all right? I’m so glad to have their permission.” Taz stood up and started pacing. “I think I have to punish you for this insolence, Nobyo. I can’t allow you to dictate to me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kyle jumped to his feet. “I don’t want to fight you, but I will if you try to do this. I’m warning you, Taz.”</p><p>“You’re warning me? Really?” He took a step toward him and clenched his fists, raising his face to the ceiling. “I’d like to have you in the arena for a while. I would show you who’s in charge here!”</p><p>“Put me in the arena then!”</p> <p>Taz looked at him in surprise. “You don’t know what you’re saying. You’d never survive it.”</p><p>“Oh, you think so? Try me then. Let me face you in the arena.”</p><p>Taz snorted. “Don’t be ridiculous.”</p><p>“Scared of me? Afraid I’ll win? Wouldn’t that be embarrassing? A noble Tygerian warrior beaten and humiliated by his own nobyo?”</p><p>Taz glared at him, his fists slowly clenching and unclenching. Kyle was a bit afraid he’d pushed him too far, but he had to keep on. If he could get him to agree, he might have a chance to win and tell his family to back off.</p> <p>“Come on, if you’re so sure you can win this, then make a wager with me. Bet me that if you win it, I’ll drop this subject and become your loyal little nobyo.”</p><p>“And if I lose?” Taz asked, his tone of voice clearly revealing he didn’t think it possible.</p><p>“Then I get to visit my family and explain that I’ve found my mate and that I’m happy living here on Tygeria. I return as your equal partner, and you forget this nobyo shit.”</p><p>“Visit them?” Taz’s voice dripped with scorn. “You honestly expect me to believe you’d come back to me?”</p><p>“I would come back. You have my word. I don’t want to live somewhere without you.”</p><p>Taz stared down at him with disbelief. Kyle got to his feet to face him. “Make a decision, damn it. Will you give me a chance to fight?”</p> <p>“You wouldn’t last five minutes.”</p><p>“If that’s what you believe, then what do you have to lose?”</p><p>“All right, Lycan,” Taz said, his voice cold with fury. “I’ll fight you. I’ll arrange some sparring time in the arena as soon as I can get it.”</p><p>“Good,” Kyle said, nodding firmly. “The sooner the better.”</p><p>Taz narrowed his eyes at him for another few seconds before turning on his heel and striding to the door. Kyle called after him. “Where are you going?”</p><p>“To my office. I wish to be alone tonight.” He slammed the door behind him with only one more scornful backward glance. Kyle walked over and tried the door. It was locked.</p><p>“Asshole,” he whispered and went back across the room to fall on the bed. “Stubborn, unmitigated asshole.” He stared up at the ceiling and tried his best to calm down. It was going to be a long night.</p><p>Three long, mind-numbing days passed before Kyle even saw Taz again. He spent those days locked in the bedroom, with his meals delivered to him. It wasn’t exactly uncomfortable—he had full access to the bathing chamber and bathroom, and of course, the room was luxurious. But with no books, no vids, nothing to do except study those damn Tygerian language books, Kyle was going stir-crazy.</p> <p>For spite, he refused to even look at the language books, and instead tore the pages out and used a pen to make a deck of playing cards. He’d learned about playing cards when years before he had seen an Earthan bounty playing a game he called Solitaire for hours on end. To pass the time on the long voyage to deliver him to prison, he’d asked the prisoner to show him the game. He even sent away for his own decks of cards. It had come in handy many times since then to pass the time on long, lonely voyages through space.</p><p>He knew Taz was staying away from him on purpose, probably because he was angry, but he also knew that he was probably suffering as much if not more than Kyle. After all, since he’d brought Kyle home, he’d wanted to make love every night, sometimes for hours at a time. So Kyle was determined not to be the first one to cave in and beg him to come back.</p><p>It was on the morning of the fourth day that the door opened to admit Taz, who walked in and sat down at the table as if it had only been a few hours instead of a few days since they’d seen each other.</p><p>Kyle, seated on the bed with his makeshift cards spread out between his legs, never even looked up. He wouldn’t give Taz the satisfaction.</p><p>Taz cleared his throat. “Ignoring me, Nobyo?”</p><p>“You should know. It’s what you’re good at.”</p><p>A long silence passed as he watched Kyle with a moody expression on his face. “What are you doing?”</p><p>“Playing solitaire. I thought it was appropriate—me being in solitary confinement and all.”</p><p>Kyle got a sharp look for that remark, but he continued to play, his body very aware of Taz’s presence in the room. He fervently hoped Taz was suffering too. A surreptitious glance at the way his pants were bulging at the sight of the nearly naked Kyle with his legs spread out on the bed told him he was.</p><p>“Is that paper you’ve torn from the books I gave you? Your language books?” Taz’s voice had risen in outrage with every word.</p><p>Kyle continued his slow shuffling through the deck. “Why, yes, it is. Thought I could put them to some good use.”</p><p>“Do you have any idea how expensive and hard to obtain those books were? They’re very old—some of them date back to the time when the Alliance actually had an embassy on Tygeria. Over one hundred cycles ago!”</p><p>Kyle lifted one shoulder in a shrug. “All right. They were just old used books, then.”</p><p>Taz glared at him. “Do you want me to beat you, Nobyo? Is that what this is all about?” Taz took a menacing few steps toward him. Kyle put the little stack of papers down on the mattress and gazed back at him, keeping his face as blank as possible.</p><p>“You can try.” He scooted to the edge of the bed and stood to face Taz. “Go ahead. Give it your best shot. I’m right here.”</p><p>Taz seemed to be barely able to control himself. Furiously, he turned his back on Kyle and strode back to the door. “Three hours,” he said over his shoulder. “In three hours we’ll go to the arena to spar and settle this once and for all. I’m granting you your wish, Nobyo. You can face me in the ring and prove to me just how strong you are. But if you lose...” He turned and pointed a finger at him. “Be prepared to become my nobyo in more than just name. You’ll submit to me and show me the proper respect from now on, or I’ll beat you every day.”</p><p>He stormed through the door and banged it behind him, leaving Kyle a little stunned. Submit to him. Was he really ready to do that? His legs suddenly shaky, Kyle sat back down on the edge of the bed. This had seemed almost like a game for the past few days, and now it was all too real. He’d made the wager and would have to live with it. The words Blayde had spoken to him what seemed like so long ago came back to him. They call their love slaves their nobyos. They keep them very submissive...</p><p>He remembered how horrified yet amused he’d felt, thinking about the poor bastards who became the Tygerian love slaves. That seemed like a long time ago now. For the first time in days, he tried to shift and found that his incisors dropped down and he bulked up a little, but the shift still wouldn’t fully come. They were still drugging him some then—probably in his food. Still, even if he shifted, would he be able to fight what was happening to him? He couldn’t harm his mate, plain and simple. He wouldn’t harm him, ever. That only left submission.</p><p>The way out of this was clear, if unlikely. He had to win the fight. He paced a little by the bed, trying to remember everything he knew about the Exhibition Games in the arena.</p><p>He’d seen an old vid once, the film grainy in black and white. The Tygerians were using old style video camera technology at the time, probably seventy or eighty cycles before, and had filmed one of the Exhibition Games to broadcast to their people. The Alliance had been sent a copy to taunt and humiliate them, since some of their captured prisoners were on the film.</p><p>Some fifteen or twenty survivors, crewmen and soldiers from a downed Alliance ship circled a huge, dusty ring, as a Tygerian crowd jeered and threw things at them from the stands. The prisoners wore loincloths, and looked completely worn out, their bruised and battered bodies showing the results of their ill treatment up to this point.</p><p>A loud horn sounded and the gladiators, young Tygerian warriors, emerged from behind gates on all sides of the arena. They towered over the prisoners, wearing animal skin leggings and vests over their naked chests. Each of them carried what looked like chains and maces. A mace, Kyle had since learned, was a type of club with a metal or stone end used to smash in body armor. He could only imagine the kind of damage a weapon like that could do to flesh.</p><p>The young warriors played to the crowd, mocking and toying with the prisoners as they dispatched them one by one. It was a cruel and vicious display, and only three of the Alliance prisoners were spared at the end, not because they’d won, but because the crowd thought they’d fought bravely and spared their lives to fight again.</p><p>The Exhibitions were fought at night, and this was not such a trial by fire. This was more of a friendly game, wasn’t it? Taz had mentioned a sparring session, so there’d be no jeering crowd of spectators watching them. Kyle didn’t delude himself that he could win this thing easily. Taz would be a formidable opponent. As for Kyle, he would be waging an entirely different kind of attack than Taz’s, because he would have to be careful not to harm his mate. He wasn’t so sure if Taz would be quite as careful. He’d want to humiliate Kyle and teach him a lesson.</p><p>Kyle knew he didn’t have the physical prowess to win a fight between them on strength alone. Taz had big advantages of height and weight on him, not to mention the fact he hadn’t gone through the ordeal Kyle had experienced in Tarr’s cage, half-starved and drugged out of his mind. He’d only begun to recover his strength from it.</p><p>He thought, though, that he just might have the advantage of speed, coupled with some training in hand to hand combat. If he could gain even a slight advantage, he could count on Taz’s unwillingness to badly hurt him to help him succeed. All he would need was a little luck, and he might be able to gain the upper hand long enough to make Taz lose the wager. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>If Taz attacked him with everything he had, there was no way for Kyle to win. There was also no way he’d ever seriously harm his mate, no matter the provocation, so he sent up a few silent prayers to his gods and sat down to prepare himself mentally for what was to come. If he could win this thing, he’d become more of an equal partner in their relationship and he’d be able to at least talk to his family and try to make them understand. The stakes, then, were high for Kyle.</p><p>A few hours later, he was waiting quietly for Taz to come for him. The door opened and Taz came in, dressed much like the warriors in the old vid Kyle had watched, with leggings, loin cloth, and a vest. He threw a loin cloth and leggings to Kyle. “Put these on,” he said tersely. “I have a transport waiting for us outside.”</p><p>Kyle pulled on the clothing and tied the cloth around his waist. He’d seen the almost predatory look on Taz’s face as he’d pulled off the thong-like covering, exposing his groin, and it warmed him. Taz’s gaze never left Kyle as he got ready.</p> <p>He walked past Taz, unable to resist giving his hips an extra twist and out into the corridor. From there he could see the light from the twin suns of Tygeria streaming brightly through the glass door, his first real glimpse of sunlight in days. His window in Taz’s room was heavily shaded by the dense grove of trees growing just outside, even if he’d felt like climbing up on a chair to look out it.</p><p>It seemed strange to travel through the streets of the bustling city after being cooped up inside Taz’s home for so long. He glanced over at Taz, who was staring straight ahead, expressionless. Neither of them said a word to each other, and Kyle wondered if he really would be able to defeat him. If not, the ride back home might be entirely different. It made his pulse race faster to think about becoming Taz’s submissive nobyo. Could he do it? He’d given his word he would.</p><p>Taz glanced over at him. “You know I won’t be easy on you, just because you’re my nobyo.”</p><p>“I know,” Kyle said softly. “I don’t expect you to be.”</p><p>He seemed to want to say more, but turned his head back to stare straight ahead. “It’s not too late to back out. We don’t have to do this. You can stop all your foolishness and apologize.”</p> <p>Kyle looked at him sharply before turning his head to stare out the window. Was he having second thoughts about fighting him? He knew he’d been a disappointment to Taz in a lot of ways, and he wanted to please his mate, but Taz had to listen to him. He had to realize the real danger his attitude was putting them in. No matter that the planet of Tygeria was like an impenetrable fortress. His family would find a way to get to him—Kyle had no doubts about that. It terrified him to think that Taz might get caught in the crossfire when that happened, or that some of his well-loved family members might be injured, all because of Taz’s stubborn refusal to allow him to talk to them.</p><p>“No. No, I want this. I have to have the chance to speak to my family.”</p><p>Taz couldn’t resist a huff of breath. “I’m your family.”</p><p>The transport arrived at the arena, and they disembarked. Kyle followed Taz into the building, walking through cavernous halls to get to the dressing rooms, where several Tygerians were in various stages of undress. Several of them gave Kyle a long, slow look, before glancing up at Taz. He glared back at them until they turned around, and then he unlocked and slammed open a large bin containing his weapons. He jerked out a mace, along with a long length of chain.</p><p>Kyle was surprised when he turned and held them out to him. He held his hands up in front of him. “No, I don’t want those. What would I do with them?”</p><p>“Defend yourself,” Taz growled at him.</p> <p>Kyle refused to be intimidated and shook his head. “No, I won’t use those.”</p><p>Taz looked at him, nodded and put them back in the bin. “Bare hands, then.” He motioned toward the arena and Kyle turned to the door, with Taz right behind him. As they exited a side door, a large, sweaty young man came in and stood aside to let them pass. Kyle nodded at him and he smiled suggestively, practically leering at Kyle. The young man teasingly raised Kyle’s loin cloth to pinch his ass as he passed him. Kyle whirled to face him, but before he could make a move, Taz had the man by the throat, pressed up against the wooden door.</p><p>“How dare you lay a hand on my nobyo? I’ll kill you!”</p><p>“I-I’m sorry—I didn’t know! I thought he was a prisoner!” The young Tygerian stammered out an apology but Taz was in no mood to listen. The young man’s feet weren’t even touching the floor and he was gasping for breath as Taz held him effortlessly up in the air with one hand. Before Taz could do him any further damage, some of the young man’s friends rushed over to help him and calm Taz down. They looked at Kyle curiously, speaking rapidly in Tygerian. Because of his truly limited efforts with the language books, Kyle couldn’t understand a word.</p><p>Kyle had taken a few steps back from the altercation, amazed at Taz’s show of strength. He realized again how little chance he really stood against his mate and wondered if he should save himself the bother and the bruises and just concede now before this went any further.</p><p>After a few minutes of furious shouting back and forth, Taz pulled himself away from the group of young men and stormed over to where Kyle was standing, taking him by the arm and practically dragging him outside. His grip tight on Kyle’s upper arm, he jerked him forward to the arena, and once there he pulled Kyle around to face him. “Must you always flaunt yourself like that in front of every man you see?”</p><p>Kyle’s mouth dropped open. “What are you talking about? I wasn’t flaunting anything and I never said a word to that guy! Can I help it if all you people are sex-crazed?”</p><p>“I saw you smile at him. Once you lose this challenge, I might take you home and lock you up until you’re too old to attract anyone!” He whirled him back around and gave him a two sharp smacks on his ass.</p> <p>Shocked, Kyle fell away from him and looked up at him in outrage. “Did you just spank my ass?”</p><p>Furious, Taz yelled back at him. “That’s nothing compared to what I’ll do when I get you home.”</p><p>Leaping forward, Kyle jumped on Taz, bearing him down to the ground. He tried to pin his hands by his head, but Taz quickly recovered and jerked out of his grasp, bucking him off and rolling to his side and back up to his feet. Taz’s entire body language changed as if someone had flipped a switch inside him. He tensed his muscles and a feral gleam came to his eyes. He loomed over Kyle, who was still lying on the ground at his feet and snarled with menace.</p><p>“Get up!” he said, but barely gave Kyle a chance to scramble to his feet before he was on him, his volatile temper snapping, he caught Kyle on the chin with a quick left hook. Kyle staggered back, stunned, and Taz came at him again, but this time when he swung, Kyle swung with him and managed to deflect the blow a little, catching some of it on his shoulder. He awkwardly jabbed his elbow into Taz’s midsection and both of them grunted in pain.</p><p>They each fell back a little, and Taz began to circle. Kyle still hadn’t had a chance to fully recover from the two stunning blows when Taz charged him again, bending at the waist and plowing into Kyle before he could dance out of his way. It knocked the breath clean out of him and he hit the ground hard, pain slicing through his shoulder where he landed. Instinctively, he rolled and felt Taz land next to him on the ground. He knew he’d had a narrow escape. If Taz had landed on him, this thing would have been over almost before it started. Kyle would have been pinned under his weight and would have had no choice but to surrender.</p><p>Kyle jumped back up to his feet and kicked at Taz’s hip, but Taz turned and caught his foot in his hands, twisting it and bringing Kyle crashing back down to the ground. He could feel the pain shooting through his back and knew he’d have plenty of bruises to show for this tomorrow. He knew that he should give up now, but his pride wouldn’t let him. If he gave up meekly, Taz would never have any respect for him. It already looked pretty certain he was going to wind up as Taz’s bitch, but at least he could keep a little of his self-respect intact.</p><p>With no warning, Taz lunged for him again, and this time Kyle couldn’t get out of the way quickly enough. He braced for Taz’s weight to crash down on him, but at the last second, Taz caught him in his arms and rolled with him, keeping him on top so he wouldn’t be crushed by his weight. Kyle knew he was going easy on him, trying not to hurt him too much, and the idea made him furious. Taz pushed Kyle’s arms behind his back and held them there. “Do you yield?” he shouted at Kyle, but he stubbornly shook his head and snarled back at him.</p><p>“Never!”</p><p>With a loud snort, he released Kyle, pushing him to the side and allowing him to roll away as Taz got to his feet, not even out of breath. Kyle rushed toward him and latched onto his wrist, pulling his arm over his shoulder and then jamming his body into the larger man to launch him head over heels to the ground. Kyle was surprised to hear a smattering of applause. He spared a quick glance to the stands and saw a few of the warriors who’d been sparring alongside of them stopping now to watch.</p><p>Taz actually laughed, letting out a huge whoosh of air before springing back up to his feet. He smiled at Kyle in surprise and almost pleasure, and Kyle realized he was enjoying this.</p><p>Kyle, however, was getting tired. Throwing Taz’s big body over his shoulder had taken up some of his last reserves and when Taz leaped at him, he was barely able to dodge out of the way in time. Taz landed behind him rolling to miss the brunt of the kick Kyle aimed at his ribs. Kyle’s mouth opened in surprise as Taz twisted and grabbed both of Kyle’s ankles, giving them a tug, and spilling Kyle onto the ground. He sat down hard on his ass, biting his tongue and feeling pain shooting up into his lower back. Damn, Taz was going to kill him if this went on much longer.</p><p>Taz stood a few feet away, motioning at him to get back up. Kyle got the strong impression he was only toying with him and could end this whenever he wanted. Wearily Kyle got back up to his feet again, raising his fists as he did. He refused to back down. If Taz wanted to end this, he’d have to do it himself. He lunged forward, striking out with his right fist and hitting Taz in the jaw. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Again, the applause started up, and Kyle lost his focus just long enough to stagger back as Taz came at him with blinding speed and a hard fist to his stomach, doubling him over. A quick uppercut to the nose, and Kyle was lying on his back again, looking up. The back of his head had cracked the ground a little when he fell, so he was seeing a few stars along with the clouds in the sky. He felt blood trickling down the back of his throat and out of his nose. He wiped at his nose absently with the back of his hand. Maybe the worst thing was that Kyle knew Taz had been pulling his punches.</p><p>Taz loomed over him again. “Stay down!” he shouted, but Kyle was already dragging himself back up and trying to steady himself. His knuckles were skinned, his back was in agony, his whole face hurt and his head felt like someone was on the inside trying to hammer their way out. If Taz came at him now, he wouldn’t even be able to get out of his way. He stood swaying on his feet, blood dripping from his nose. Taz stepped up to him and grabbed two handfuls of his vest, pulling Kyle toward him and up onto his toes.</p><p>“Are you done?” he asked harshly and Kyle doggedly shook his head. Taz made a sound of impatience and then kissed the shit out of him, sliding his tongue inside his mouth and sweeping it around before pulling away with a little bite to Kyle’s lower lip. He shook Kyle a couple of times, so hard his head flopped backward on his neck. “I said, are you done? Stop this—you’re hurt. Now answer me!”</p> <p>“Y-yes,” Kyle said this time, too wiped out to fight him any longer.</p><p>“Tell me that you yield.”</p><p>“I yield,” Kyle said, his eyes closed and slurring his words.</p><p>Taz nodded, hoisted him up to throw him over his shoulder and strode with him from the ring.</p><p>The five huge Lycan males made the room seem small as they crowded around Kai and Lucas’s main living area. Kai, Lucas’s mate, stood with his back against the counter in the adjoining kitchen. He could see the vid screen from where he was standing, but he’d watched the slightly out of focus film several times now, and he had no wish to see it again. He kept his eyes on the floor as Lucas, his brother Blayde and the cousins watched the short vid that Lucas had received the evening before.</p> <p>The only sounds in the room were an occasional sympathetic or furious gasp as they watched the smaller figure, dressed, according to Lucas, in traditional Tygerian gladiator gear and being tossed around in some kind of arena setting.</p><p>His opponent was much taller and heavier, and it was hard to believe how often the smaller man that had to be Kyle kept getting back up after being slammed to the ground. Near the end of the short vid, when Kyle was viciously punched in his midsection, Nikolai, Kyle’s brother jumped to his feet with a wordless cry. Lucas put a hand on his arm to pull him back down beside him, and the vid ended a few seconds later with the Tygerian male pulling Kai up by the front of his vest. His back was to the camera, but it looked like he was yelling in Kyle’s face before throwing him over his shoulder and carrying him out of the ring.</p><p>As the vid ended, there was a short, heavy silence in the room. Then an alarming series of snarls and growls filled the room as at least three of them started shifting into their beasts. Konnor let out a string of Lycan curses and punched the wall near where he was standing with a huge, clawed hand, while Blayde cursed. Nikolai just seemed stunned after his earlier outburst, and Larsson hovered near the vid screen looking like he might be thinking of kicking it in.</p><p>“Okay, everyone calm down a minute,” Lucas said, pulling Larsson out of the way just before his big foot connected with the innocent screen. Kai straightened up uneasily. He was glad he’s sent the baby over to Ryan’s house before all this started. He’d known they would be angry, but he’d never seen them all so out of control. Even though it wasn’t directed at him, it was a little frightening, and several of them had ripped right out of their clothes when they turned. Lucas glanced over at him and sent him a brief, reassuring nod before turning back to the others.</p><p>“I know you’re all upset, but we have to try to assess this situation calmly or we’ll do something rash.”</p><p>“Calmly?” Nikolai shouted, jumping to his feet to stand next to Larsson’s looming beast. “After watching that son-of-a-bitch almost kill my brother? How do you expect me to be calm?”</p> <p>“I know,” Lucas said. “I watched the thing ten times at least last night, and it makes me sick, too, but that’s not helping Kyle.”</p><p>Blayde lowered his hands and spoke in a surprisingly quiet voice. “Lucas is right. He called me over last night to see it with him, and I lay awake half the night trying to figure out how we can get to him.”</p><p>Larsson, the youngest of the cousins, spoke up angrily, though his body was beginning to resume its normal shape. “We just go in and get him, that’s all. And kill any tiger asshole that tries to stop us!”</p><p>“You know we can’t do that,” Lucas said, shaking his head. “We show up in Tygerian airspace, and they’ll shoot us out of the sky before we have a chance to even negotiate. We can’t sneak in either—their planetary detection radar is too good.”</p><p>“Negotiate, hells!” Larsson yelled. “We take him by force. Surely the Alliance will back us on this!”</p><p>“Not for only one man,” Lucas replied. “They’ll include him in the list of prisoners they’ve been negotiating for, but that’s it. I’ve already talked to them, and I’m afraid we’re on our own in this thing.”</p><p>“We’ve been there before,” Nikolai said. “How soon can we leave?”</p><p>“To do what, Nikolai? Get ourselves captured too, or killed? We have to be smart about this. I’ve given it a lot of thought, and there may be another way.”</p> <p>Konnor had been quietly brooding on the side of the room since his outburst. Kai glanced over at the wall behind him now, wondering what Lucas was going to do to get that dent out. Maybe they could hang a picture over it? Konnor’s shirt was hanging around his shoulders in tatters, but he was still the first to answer Lucas.</p><p>“Tell us what you have in mind, Lucas. We’ll do anything to get him back home.”</p><p>Lucas nodded. “Our contact on Tygeria, the one who sent us the vid he took on his communicator, says the Tygerian’s name is Taz Bonnet.”</p><p>“Taz Bonnet?” Blayde said in surprise. “You mean that’s not Tarr?”</p><p>“No, even worse. It’s his twin brother, and he’s an important person on Tygeria. Some kind of senator, and we can’t underestimate him. According to our source, he’s not much like Tarr, except physically. The man’s mate is expecting a child, so it’s more than likely he bought Kyle as his...” Lucas glanced up at Kai again, as if he gathered strength by looking at him. “Kyle is probably his love slave.”</p><p>“Shit!” Konnor said softly. “You mean just like Nikolai?”</p><p>“No, not like Nikolai at all. Nikolai was just playing around with Jagger, and it wasn’t like Nikolai was being abused by his mate,” Lucas said. Kai had to smother an inappropriate smile at the idea of the huge, muscular Nikolai being abused by Jagger, who, though fierce and exotically handsome, was the smallest of any of the mates, barely coming up to his own shoulder.</p><p>“No,” Lucas continued. “Kyle is being physically abused as we can see on this vid. He’s probably being raped, beaten and forced to be this Tygerian’s slave.”</p><p>“Why didn’t he shift? And why was he fighting in gladiator gear? This doesn’t look like an Exhibition.” Nikolai had started the vid again, and everyone was watching it intently.</p><p>“No,” Lucas replied. “They must be giving him drugs to prevent the shift. And according to our source, they were sparring in the ring—practicing, I guess. Taz Bonnet participates in the Exhibition Games.”</p><p>“So it’s not enough to drug him and abuse him at home,” Nikolai said bitterly. “He also has to take him to the arena and beat him up?”</p><p>“Get back to what you were saying, Lucas,” Konnor said, breaking in. “Tell us your plan.”</p><p>Lucas sighed. “This man who has Kyle is Tarr Bonnet’s brother. Tarr makes frequent trips off planet to trade in love slaves, along with the Rogers. I think we have to go back to Blayde’s original plan—we have to take Tarr into custody. Once we have him, we can use him as a bargaining tool. We can offer his brother a trade—Kyle for Tarr.”</p><p>A short silence fell over the room and then Blayde cleared his throat. “I think that will work. They’re known to be very close.” He glanced over at Nikolai. “Like most twins.”</p><p>Nikolai and Kyle were twins, and though not identical, their connection was strong. Nikolai dropped his head in his hands, unable to watch the vid any longer. “The only problem is how to take him,” Blayde continued. “He hangs out a lot at his club on Leeria, so if we could find a way to stake it out—we could wait for him and then move in.”</p><p>“We’ll attract too much attention to go in where we can be seen. The Leerian officials were furious with him when he took Kyle and now Leeria’s lost all their Alliance trade agreements. I think if we made them certain promises, they’d cooperate with us. They might even arrest him themselves.”</p><p>“Only one problem,” Blayde said, laying a hand on Nikolai’s shoulder. “We’ll have to be patient for that to work. Tarr’s smart and he knows the Leerians aren’t happy with him. It may be a quarter cycle or more before he lands on Leeria again.”</p><p>Lucas shook his head. “Too long. Kyle could be dead if we wait much longer.”</p><p>Larsson made a growling sound. “Who knows what kind of abuse that bastard is subjecting him to?”</p><p>Silence fell over the room again, as each man became lost in dark, violent thoughts.</p><p>“Then we find him, wherever he might be in the galaxies. We’re not without resources of our own, and we have many friends and customers who trade with us. We’ll put out the word that we want Tarr Bonnet taken alive and offer a reward.” Lucas looked around at each of the cousins in turn. “I, for one, won’t rest until we find him.” Angry sounds of agreement and support echoed loudly in the room. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kai sighed and turned around to make a pot of the hot Lycan tea Lucas liked so much. Poor Kyle—he was the sweetest of all the cousins and always seemed to have a smile on his face. Kai felt a pang like a real physical discomfort as he imagined the tortures Kyle must be going through, even as they sat here discussing him. He sent up a quick prayer to whatever gods might be listening to spare Kyle any further pain.</p><p>Chapter Six</p><p>Kyle shifted uneasily, trying to get comfortable, as he lay naked on his stomach, sinking down in the big feather pillows on the bed. It had been two days since their fight in the arena and Taz still had to help him walk from the bathing chamber to the bedroom.</p><p>Taz was rubbing more medicine on the bruises on his back. “Stubborn, willful, hardheaded.” Taz punctuated each harsh word with a kiss to his shoulder, as he massaged Kyle’s upper back.</p><p>“Why do you defy me so? And why did you fight me so long in the arena if you were being hurt? Were you showing off to that bunch of idiots watching us? They were looking more at your ass than at how well you fought, you know.” He moved his hand down to caress the ass in question. “You were fighting me so hard I thought you were enjoying yourself. I had no idea you Lycans bruised so easily. It wasn’t until I saw the blood that I knew you were really hurt.”</p><p>“Bruise easily?” Kyle grumbled, looking at him over his shoulder. “You almost killed me in that ring.”</p><p>Taz rolled his eyes. “I’d hit my baby cousins harder than I hit you if I faced them in the ring. In the future I’ll remember how delicate Lycans are. But I hope you got that all out of your system, Nobyo, because that will never happen again.”</p><p>“Thank the gods,” Kyle muttered.</p><p>“And I hope you got some of the defiance out of your system too. The more you fight me, the more resistant I think you become. It takes us farther apart, and I don’t like it. No more, Nobyo. From now on, you must assume your proper role. You’re not my sparring partner, and I didn’t bring you home to fight and argue with me all the time. We Tygerians hold our nobyos in high esteem, and we take great care in choosing them. The first time I saw you I made a quick decision that I had to have you, and I don’t regret it. But I want a willing partner—a true lover. Our mating bond must be forged more completely.”</p><p>Kyle turned and sat up, gazing at him defiantly. “How? By locking me up until I’m too old to attract other men’s attention, like you threatened in the arena? Or maybe you can just beat me into submission.”</p><p>“We made a wager, Nobyo. I would have hoped you’d honor it,” Taz said quietly.</p><p>Kyle blushed, but stiffened defiantly. “I want to be your mate, an equal partner. I can play the game in front of the Tygerians, if you need that, if your laws require it, but I can’t be what you want me to be. No more than you could if the situation were reversed.”</p><p>Taz was silent for a long moment and then his voice hardened. “Do you forget that you made a promise?”</p><p>When Kyle remained silent, staring back at him, his lips pressed tightly together, Taz shook his head. Kyle felt a momentary pang at the look in his eyes. He looked a little hurt. Kyle was drawn to Taz as his mate and always would be, but he was struggling. He’d made a vow to himself that he would keep his pride intact and never let his family down. How could he debase himself in their eyes by kneeling to anyone—even to his own mate? He didn’t think he could do this.</p><p>“Fuck this, Taz. No! I can’t do it.”</p><p>“Is your Lycan honor so weak that you can break your word so easily? You promised me that you’d submit and take your place as my nobyo.”</p><p>Kyle shook his head wordlessly and turned away. He’d been furious since they got home from the arena, both for losing the damn fight and for underestimating just how strong these tiger shifters were. He’d relied all his life on his own size and brute strength, and for the first time both of them had been irrelevant. Up until that day in the ring, he’d figured Taz was a little stronger, but he actually thought he could hold his own.</p><p>Now it was painfully clear to both of them that his strength was puny in comparison and Kyle wasn’t sure how he felt about that. Actually he was sure—he hated it and resented Taz for it. He hated himself even more for making the damn bet. He remembered all too well what he’d said. Bet me that if you win, I’ll become your loyal little nobyo. Did his word have any value? He knew he was going to have to submit to this thing, and he resented Taz for making him do it.</p><p>Was this how Ivan felt so long ago when Kyle’s grandfather captured him and made him his love slave? The legends said he’d been so attracted, almost against his will that he was incapable of harming Gunnar, even though his powers were strong enough to do real damage. Gunnar had made him suffer, but he couldn’t stop loving him. Instead, he’d cursed all his descendants, partly the reason Kyle was in his present predicament.</p><p>Kyle raised his chin and gazed into Taz’s eyes. “I’m not breaking my word—I’ll be your nobyo. But don’t make me hate you, Taz. I don’t want that to happen.”</p><p>“Hate me?” Taz’s face flamed and he got up angrily and paced the room. He looked furious, and it was obvious that he was giving himself a little time to calm down before he spoke to Kyle again. Finally, he turned and faced the bed. He was still naked from his bath earlier and almost took Kyle’s breath away. Suddenly, Kyle was so tired from the fighting and tension of the past few days he thought he might be able to sleep for a week if Taz would just lie down beside him and let all this go. He wanted to curl up around his mate and rest in his arms and be soothed by his presence. Instead he could feel the gulf between them widening.</p><p>“I’ll make you the offer again, Nobyo,” Taz said, his voice dead and cold. “And this is the last time I ever will. If you’re so unhappy, then I’ll release you. I’ll find a way to send you home to your precious family.” When Kyle started to speak, he held up a warning hand. “But if you decide to stay, then all this foolish, stubborn pride of yours is finished. It has no place between us and keeps us apart. Make your decision. Either stay with me as my nobyo, or go back to the Lycans.”</p> <p>Kyle dropped his face in his hands. How could he leave him? He needed him now like he needed to breathe. They hadn’t completed their mating in the true Lycan sense—Kyle had never given him the mating bite, never topped him. Yet the bond was strong between them. He might be able to survive without his mate, but did he want to? Kyle had no more strength to fight. If his family thought less of him for it, then so be it. The need he felt for Taz was even stronger than the love he had for his family.</p><p>“I want to stay with you,” he said quietly, dropping his head. He was aware of Taz stepping closer to the bed and felt his hand on the back of his neck, stroking it gently.</p><p>“Then rest, darling. We’ll speak no more of this.”</p><p>Kyle leaned into him, drawing strength from his nearness. He thought it might still make him feel ashamed to want to be with Taz instead of going back home, but all his surrender had brought him was a profound sense of relief.</p><p>“I don’t want to rest,” he replied, his breath hitching in his throat. “Make love to me. Remind me why I need to do this. Show me.”</p><p>Taz groaned and pushed Kyle to his back, following him down. His hands traveled over Kyle’s body, and his cock grazed Kyle’s stomach, making him gasp and roll his hips toward the touch. Taz answered with a slow grind of his own and bent to kiss and lick at Kyle’s nipples, teasing the pink nubs with his lips and teeth so he could suck them. Kyle moved mindlessly under him, feeling the teasing in his groin, as if there were an invisible string directly attached.</p><p>He moved restlessly under his mate, needing him to touch his dick, trying to make him move more quickly and get to the main event. “What is it you want, nobyo? Are you so eager?”</p><p>Taz had raised himself on his arms and was smiling down at Kyle. “Is this what you need?” He bent to drag a hot tongue slowly up the length of Kyle’s shaft. His tongue was long and slightly rougher than a Lycan’s. The sensation against the smooth skin of Kyle’s cock was making him crazy. He ended with a rough swirl over the head and lifted his head to smile down at him. “Or perhaps this?”</p><p>He put both hands under Kyle’s hips and raised him off the bed a little. Then he bent between his legs and licked up Kyle’s crease to find his hole. Kyle screamed Taz’s name as he rimmed him with that rough, hot tongue. Kyle tightened his legs around his head, unable to stand so much sensation and pleasure. He bucked his body almost involuntarily, but Taz only chuckled and held onto him, making it clear Kyle wasn’t in charge of any of this. When Kyle finally surrendered to it and let the orgasm overtake him, he thought he might be dying. He felt the hot cum spurting up on his stomach—he’d never had an orgasm without direct stimulation before, and this one had left his body limp and lifeless.</p><p>Taz raised his head to gaze at him. “This is mine, Nobyo. I’ll never give you up now. Mine forever.”</p><p>“Yes,” Kyle breathed out softly, the word only a soft hiss.</p><p>“Don’t go to sleep, baby. I’m not through with you yet.”</p><p>Kyle felt Taz push back his legs and then felt his huge cock bury itself inside him. Wearily he opened his eyes as Taz began to push into him. Kyle’s body began to rock a little with the force of his thrusts. Then he changed his angle a bit and was landing each thrust on the spot inside Kyle that always made him lose control. Steadily, relentlessly, he hit the sensitive bundle of nerves until Kyle was moaning continuously. Taz was claiming him, marking his territory, leaving Kyle with no doubt as to whom he belonged.</p><p>After only a few minutes, he reached his climax and filled Kyle with his cum. Kyle could feel it inside him, the hotness seeming to fill him and bathe every inch of him inside. Unwilling to move, Taz collapsed down between his legs and pressed his lips to Kyle’s chest. He lay there for a long time, softening inside him, before he finally rolled to the side. Kyle could feel his cum dripping from him, but Taz wouldn’t let him get up. He threw one big leg over him and pulled him up close. “Mine,” he said, satisfaction coloring his voice. “No more defiance, yes?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes,” Kyle agreed softly. “No more.”</p><p>“No more, Taz-lan,” Taz reminded sleepily.</p><p>“No more, Taz-lan.”</p> <p>“Good,” he murmured. “I’ll give you a spanking in the morning for forgetting to show me proper respect. I’m too tired right now.”</p><p>“What?” Instantly awake, Kyle struggled to sit up and stare down at an almost asleep Taz.</p><p>He opened one eye and chuckled, pulling him back down beside him. “Just a little one, baby. I’m a kind master. You’ll see.” He leaned over and kissed Kyle on the lips, nuzzling his nose against his face.</p><p>His nobyo had slept badly. For an hour or so after they went to bed, he’d tossed and turned restlessly, and Taz thought it might be the stickiness of his skin. He got out of bed and obtained a warm cloth, coming back to tenderly wash the dried cum from his nobyo’s stomach and the backs of his legs. The entire time he cared for his nobyo, he’d looked steadily up at him with those beautiful, strange eyes.</p><p>When Taz got back in bed, he’d scooted his ass up to him and sighed like a tired child, but he’d still been uneasy the rest of the night, having bad dreams, from the way he squirmed and reached back for Taz. Taz held him tightly in his arms the rest of the night.</p> <p>Taz wondered if he was worried about the spanking he’d promised him and smiled to himself. He’d been mostly teasing the night before, but the more he thought about it, the harder his dick became. Not because he had any desire to humiliate or hurt him, but because he thought it might add spice to the sex that already far exceeded any of his expectations.</p><p>His poor nobyo was so confused, and it hurt Taz to watch his struggles. His nobyo still thought submission was a sign of weakness, and he longed to show him it was more a sign of deep trust. If his nobyo could only learn to trust him with everything—his fears, his embarrassment, his doubts—then they could begin to build their future. He only wanted to care for his nobyo and give him a perfect life.</p><p>Taz knew the main obstacle was that he worried too much about what his Lycan family might think of him, instead of just relaxing and letting things happen. He’d been aware from the beginning that his nobyo wasn’t a true alpha. He’d met these Lycan alphas when he was held in their prisons. Many of them had been his guards, and they were an arrogant, domineering bunch. Not so with his nobyo, who was gentler and much more reasonable. He was strong and brave too, and would make an excellent life partner. If only Taz could kick the other alphas in the family out of their bedroom. He decided there was no time like the present to start that process.</p><p>“Wake up, sweet one.” He bent over his face and kissed his cheek. “Time to wake up. Shall we have your punishment before breakfast and get it out of the way?”</p><p>His nobyo widened his eyes and stared up at him. “My-my...punishment?”</p><p>“Yes, darling.” Taz stretched and scooted up so that his back was against the massive headboard of his bed. He made himself comfortable by pulling the pillows behind his back, then patted his lap. “Come here, Nobyo.”</p> <p>He saw his lover take a long look at the door, wondering perhaps if he could make it. His face was so expressive that he clearly saw the realization that even if he did, he’d only be brought back. He crawled slowly toward Taz and knelt beside him, looking down at his lap. “Is this really necessary? Can’t I just stand?”</p><p>“No, you can’t. This will be much more comfortable for both of us.”</p><p>“For you, maybe.” He cut his eyes up resentfully and then sighed. “Sorry, Taz-lan. Just-just give me a minute.”</p><p>“I’ll help you,” he said, smiling. Taz reached for him and hauled him over his lap so that he was lying face down. His naked cock lay against Taz’s thighs, and he was glad that it was not entirely soft at all. He reached beneath him and rubbed a thumb over the head. Pre-cum had begun to dampen it, and his nobyo moved restlessly. He got up on his elbows, but Taz pushed him back down.</p><p>“No, lie still.” He smoothed his hand down his ass slowly and trailed a finger down his crease.</p><p>“Can you tell me why this is necessary, darling?”</p><p>His nobyo shook his head. “No idea.”</p><p>Taz gave him a little smack to the roundest part of his ass. It couldn’t have hurt, and Taz smiled to see him jump. “Okay, okay. I guess something about me not showing proper respect.”</p> <p>“What about it?” Taz asked, stroking his ass.</p><p>His nobyo gave a resigned sigh. “You want me to do it. To say Taz-lan when I talk to you.”</p><p>“And why is that?”</p><p>“Because it means...” He made a little choking sound on the word. “Master.”</p><p>“Do you know that I’m your master, sweet one?”</p><p>“Um...yeah, sure.”</p><p>Another smack. His nobyo rose partially up, only to be pushed back down. “Stay still.” Taz spread his legs so his nobyo’s cock fell down between his thighs and then clamped his thighs together, drawing forth a huge intake of breath from his nobyo.</p><p>“What? I said yes, damn it—I mean, Taz-lan.”</p><p>“Hmmm...I didn’t believe you. It was in your tone. Very unconvincing.”</p><p>His nobyo blew out a frustrated breath and Taz smiled. It was fun teasing him like this. He stroked up and down his lover’s ass for a long time, enjoying the feel of his skin. He found his puckered hole, wet a finger and began to draw little circles around it.</p><p>His nobyo groaned and banged his head against the soft pillows of the bed. “Hells, Taz-lan. Just get on with it.”</p><p>Taz gave him another slap, enjoying the sight of his pink hand prints on the smooth, white skin. “I’ll decide when to get on with it, as you say. I assure you, I’m in no rush at all. Are you uncomfortable?”</p><p>“What do you think?”</p><p>Smack! “Do you really wish to be so impertinent considering your position across my lap? It’s not your business what I think. Answer the question.”</p><p>“No. No, Taz-lan. Damn it!”</p><p>Another slap landed on his cheeks, accompanied by Taz’s sigh. “Baby, why do you make me hurt you? No cursing. I think I’ll make that a rule for you, because you really do use shockingly bad language. Not a good example for our little one when he comes.”</p><p>Taz caressed his nobyo’s ass with one hand while he slipped the finger in and reached up to find the little place inside his nobyo that made him so excited whenever he touched it. As he swept his finger over it, his nobyo’s hips rose and then slammed back down, apparently enjoying the friction of Taz’s thighs on his cock. He was breathing hard, and Taz allowed him to fuck himself for a few seconds before pushing his hips back down.</p><p>“No, this is supposed to teach you a lesson, Nobyo. I think you’re enjoying it too much.”</p><p>His nobyo turned a shocked gaze up to him over his shoulder. “I am not!” His face, however, turned an interesting shade of pink.</p><p>“One or two more then, and we can go have first-meal. Unless, of course, you are enjoying it and wish to stay in bed with me for a while longer.”</p><p>“I’m not.”</p><p>“So your hard cock between my legs means what, exactly?”</p><p>“Just please get on with this, Taz-lan.”</p><p>“Do you think you might be able to come just from a spanking, darling?” He slipped another finger inside, crooked them both up and gave his spot inside a wickedly hard rub while he slapped his ass a little harder with the other hand.</p><p>His nobyo surged down with his hips to get away from the mixture of pleasure and pain, and Taz tightened the muscles of his thighs to give him maximum stimulation. He rose back up with a little gasp to meet another smack and another internal rubdown, and that did it. With a shudder, his nobyo climaxed long and hard, shooting his cum between Taz’s thighs before collapsing back down, breathing hard and groaning.</p><p>“Gods, I hate you...”</p><p>“No, you don’t.”</p><p>A little silence, then, “No...I don’t.”</p><p>Taz pulled him up sharply, surprising a little noise out of him. He positioned him so that he was facing him, with his legs on either side of Taz’s body. He settled him right on top of his own aching cock and pushed him down firmly on top of it, eliciting another sharp intake of breath.</p><p>His cheek pressing against his nobyo’s, Taz turned his head so that he brushed their lips together. “I think our first-meal will have to wait after all, baby,” he said, and began to thrust his hips.</p><p>The servants fiddled with the camera equipment as Kyle waited impatiently for them to set it up and start filming. This wasn’t at all what he’d envisioned a few days before when Taz told him he could finally contact his family back on Lycanus, but he would take what he could get. Taz would film his message and send it electronically to Lycanus 3 through government channels.</p><p>Since Tygeria was at war with the Alliance, no direct channel could be opened to them by law. Taz said some people still managed to download vids or contact relatives on other Alliance held planets through illegal channels, but as a representative of the Tygerian Senate, he had to set a proper example.</p><p>A couple of days before, Taz had surprised him with this gift as they lay in bed together.</p><p>Kyle had just awakened and was stretching his arms over his head when he winced from an old bruise he’d received in the arena when he sparred with Taz.</p><p>“What’s the matter, Nobyo?” Taz leaned up and solicitously and put a hand on Kyle’s hip.</p><p>Kyle smiled down at him. “Nothing really. Just some sore muscles still from that beat-down you gave me in the ring.”</p><p>“I’m sorry, baby. I really thought you were only playing around at first. When I saw the blood, I stopped at once.”</p><p>Kyle sighed and lay back down to snuggle into him. “It’s my own fault. I probably never should have challenged you, and I should have quit sooner. I just wanted you to respect me.”</p><p>“I do respect you, darling. You were very courageous to fight me, and everyone remarked on how lucky I was to have such a brave, handsome nobyo. I had three offers for you before we got back home.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Good ones, I hope.”</p><p>“Yes, very good.”</p><p>“So when do I leave?”</p> <p>“Never.” Taz tightened his arms around Kyle, and he was careful not to touch any of the bruises on Kyle’s back. “I told them you weren’t for sale at any price.” Kyle smiled until Taz’s next remark. “Even though you are too much trouble.” He smiled down at Kyle’s frown. “I’ve decided to let you contact your family,” he said.</p><p>“What? But I lost the bet. I thought you said...”</p><p>“I know, I said a lot of things because I was angry. But I don’t want you to be unhappy. If contacting your family means so much to you, then it’s a small enough thing to do for you. I’d planned to let you speak to them anyway at some point, but I wanted you to settle in first, and begin to think of me as your family.”</p><p>Kyle swung his leg over Taz’s hips to get in close and grind his cock against Taz’s. “I do think of you as my family. You’re my mate, and the closest person in the world to me. But I have to reassure them that I’m happy. That I’m okay, or else they’ll come to rescue me.”</p><p>He put a finger on Taz’s lips to stop his outraged reply. “I know—I don’t need rescuing, but they don’t know that.”</p> <p>Taz nodded. “We’ll contact them then, if you want to.” He pulled Kyle back down on the pillows as he tried to get up. “I’ll make the arrangements after you take a nap. And stop rubbing against me like that, or neither of us will get any sleep.”</p><p>Kyle settled back beside his mate, knowing he wouldn’t be able to talk him into contacting them any sooner. Taz’s cock was still rigid as it lay alongside his own, and he moved restlessly against Kyle. With a little smile, Kyle slid out of his arms and down to kneel between Taz’s legs, licking Taz’s cock from base to tip. Taz raised up on his elbows and drew in a rough breath as he gazed down at him.</p><p>Kyle smiled and licked him again. “Sleep really is highly overrated, don’t you think?”</p><p>Now, a few days later, Taz was sitting rather impatiently beside him as the servants set the focus and fooled around with the camera interminably. Finally, they had it ready and signaled to Taz.</p><p>Sitting in his chair behind a gleaming, massive desk, Taz fixed the camera with an imperious glare and began to speak.</p><p>“I am Taz Bonnet, of Tygeria, Imperial Senator of the Tygerian Ruling Council. Beside me...” He held out a hand, and Kyle stepped up beside him to take it. “Beside me is my nobyo. He wishes to give you a personal message.”</p> <p>Kyle cleared his throat nervously. “I wanted to let you know that I’m alive and doing well. I’m happy here with Taz—he’s my mate.” Kyle tried to give as much emphasis as he could to the word, so they would understand. “Don’t try to come for me. I don’t need rescuing.” He glanced down at Taz as he squeezed his hand. “Please understand, Lucas. And Nikolai, don’t worry about me. I’ll explain everything later when I see you again, and I’m sure I’ll be seeing you soon. Things are tricky now with the war, but this thing can’t last forever, can it? I know this will be hard for you to understand, but please try.”</p><p>“That’s enough, Nobyo,” Taz said, and the servants pointed the camera back over at him. “As you see, he has no need of any assistance from you. Any foolish attempts to come for him would only be the cause of your destruction. If you have any emergency messages for him, you may send them through official channels.”</p><p>He nodded at the servants and they ended the filming. Kyle hoped the message would be enough. His family could be a bit...intractable at times. At least the message would let them see he was still alive and unharmed. He’d told them Taz was his mate, so maybe they’d understand. It was all he could do. Taz stood up and pulled him into his arms. “There, Nobyo, I hope this will ease your mind a bit. They’ll be able to see that you’re well and happy, yes?”</p><p>Kyle shrugged and smiled back at him. Really, Taz had no frame of reference when it came to his family. Taz and his brother Tarr were close, but it wasn’t the same kind of thing at all. Maybe it had to do with their beasts—tigers were, by nature, social but solitary animals, whereas Lycan wolves naturally organized themselves into packs to maintain stability and assist each other. The hierarchy in a pack was of primary importance, one reason why Kyle had slowly but surely been adjusting to Taz as the more alpha male in their relationship. He was thinking and acting more and more like a beta every day, and he was surprised at how natural it felt to him.</p><p>Though he still needed to claim his mate, he was much more content than he had been in the early days. When he first came back from the fight in the arena, he’d expected Taz to treat him more or less like a slave. Instead, the show of dominance and Kyle’s acceptance of it had soothed his need to prove himself over and over. As a result, their relationship had become more loving and even closer.</p><p>“You know the baby will be coming soon, Nobyo. Are you ready to be a father?” Taz’s fingers drifted over the skin on his back, coming to rest over his hips.</p><p>Kyle shook his head. “Not really, seeing as how I know nothing about babies. It’s kind of terrifying.”</p><p>“We’ll care for the child together, and of course, the servants will help. You know, I’ve decided to name the baby Kylon, after my father. I also like it because it’s a little like your name,” he said off-handedly, his hand still teasing around his crease.</p> <p>Kyle’s mouth fell open a little as he stared at his mate. “I didn’t even think you knew my name. You never use it.”</p><p>Taz rolled his eyes. “Of course I know the name of my own nobyo,” he said dismissively. “But in Tygeria, we never use our nobyo’s names.”</p><p>“Why is that, anyway, Taz-lan?” Kyle asked, in an irritated tone. “It makes me feel...almost generic. Like I could be anybody.”</p><p>Taz lifted one shoulder. “That’s the point.”</p><p>At Kyle’s sharp gaze, Taz smiled. “No, I can see you don’t understand. Let me try to explain. The gods of our religion can be a bit jealous. If you love something too much, the gods may try to take it from you, so it’s best if they don’t know your children or your nobyo’s names too well. When the baby gets here, you may call him by his name, of course, because the gods take little notice of aliens.” He kissed away the little frown on Kyle’s mouth. “However, I will call him son, just as I call you simply Nobyo, in the hope that the gods will become confused with so many and leave me the dearest things in my life.”</p><p>Kyle nodded, a little overcome with the unexpected emotion he felt at Taz’s words and slipped his hand inside Taz’s, who gave him a sweet smile. “So I’ll record the baby’s new name on his papers.”</p><p>“About these papers. What are they exactly? You said the same thing to me when I first got here.”</p><p>“Your birth papers. We don’t consider you to have been properly born until you arrived here on Tygeria to join the people.”</p><p>“Oh, so that makes you way too old for me, right?”</p><p>“Very funny. I hope you manage to curb this unseemly sarcasm when you’re around our child.”</p><p>“I’ll see what I can do. So we’ll do his room together?”</p><p>“Yes. What color do you think we should have the servants paint his room?”</p><p>Kyle shrugged. The sum total of his knowledge about babies was very small, limited mostly to the sparse contact he’d had with Lucas’s child. “I don’t know—blue, maybe?”</p><p>Taz frowned. “Blue? What a silly color for a warrior-child. No, it must be bold and strong. Perhaps red—a shade like your beautiful eyes.”</p><p>A knock on the door of Taz’s office interrupted them, and Taz called out impatiently for whoever was outside to enter. It was one of the older servants, all of whom had learned at their peril to always knock on any closed door since Kyle had arrived. The poor man, stooped a little with age, looked frightened and upset.</p><p>Taz straightened in his chair. “What is it, Wyn? Has something happened?”</p><p>“A message for you, sir. Very urgent, about your brother.”</p><p>“My brother?” Taz was already on his feet and reaching for the paper the servant held in a trembling hand. He scanned it quickly and turned an incredulous and shocked gaze on Kyle.</p><p>“Y-your family has my brother. They’ve taken him prisoner and are holding him on your home planet. They say that I have only a few days to contact them with a decision.”</p><p>Kyle shook his head, still trying to understand. “But why? A decision about what? Are they angry because he kidnapped me? What do they hope to accomplish by it? What do they want?”</p><p>Taz looked up at him, his face drained of color, so that the tiger stripes under his normally golden skin had never before looked so striking. His eyes turned more gold in color and took on a feral glow. His voice was shocked and harsh. “You, of course. They want to trade my brother for you. They say if I refuse to make the exchange, they’ll send him back to one piece at a time. Gods, they’re monsters!”</p><p>“Taz, listen to me,” Kyle said softly. “We’ll have to contact them right away. I can talk to them.”</p><p>Taz shook his head. “They’d never believe it,” he said, his voice thick with emotion. “They’d think I coerced you. Forced you to say you don’t want this exchange.” He looked up sharply at Kyle. “You don’t want this, do you?”</p><p>“No! How can you even ask me that question? I told you I never want to leave you.” Kyle took his hand and gazed into his eyes, trying to show him how sincere he was. Taz glared back at him for moment before his eyes softened, and he drew Kyle close to him, holding him tightly in his arms. “I’ll never give you up! No one can make me!”</p><p>Kyle allowed himself to be held for a moment, trying to soothe his mate, but then pulled gently away. “Taz-lan, there’s a simple solution to this. I have to go see them. Agree to the exchange to get Tarr back unharmed, and then once I explain things to them, I’ll come back.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Taz drew back and then flung Kyle away from him, his face mottled with fury. “I knew it. I knew you’d choose them over me. You’re lying about wanting to stay with me. You want to go to them, don’t you?”</p><p>Kyle could see Taz’s eyes changing again. He’d never seen Taz’s beast before. Usually the Tygerian beasts were well-controlled and came out only at times of great need or really strong emotion, but now his eyes were becoming those of a cat, the pupils growing large and elongating. A few times during the year, Taz had told him their moon was at its fullest point and their beasts roamed all over Tygeria. On those nights, he would lock his nobyo away, he said, for his own safety. Unlike the Lycan wolves, the tigers became fully bestial, and once they were completely transformed, they no longer had the thought processes of a humanoid creature.</p><p>Still, Kyle stood his ground, growling back at him when Taz made the low, inhuman noise in his throat. “Listen to me, damn it! I’ve told you over and over that I want to be with you. I don’t know how to say it any other way. You have to trust me, Taz. You can exchange me for Tarr and then I’ll come back to you as soon as I can. I give you my word.”</p> <p>Taz shot him a disbelieving glare and started pacing rapidly back and forth in front of his desk, reminding Kyle of the Earthan tigers he’d seen in zoos back on Lycanus. “The word of a Lycan! Bah! You haven’t been away from them long enough for me to teach you yet how to be honest. You’d say anything to get away from me and go back to your precious family. No, I don’t believe you. How can I? I’ll find out where they’re holding him and attack them. Violence and a show of force are the only things a Lycan understands.”</p><p>He turned on his heel and walked rapidly from the room, leaving Kyle behind. He was stunned and fell down in Taz’s big chair. His family had Tarr. He had no doubt they would carry out their threats if Taz didn’t comply with their demands. Worse yet, Taz would attack the planet and many innocent lives could be lost. His family could be lost. Even...his mind skittered over the possibility that his family might kill his mate, an image too horrible for him to hold onto for long. There was simply no good outcome for this. The only way to avoid any bloodshed was for Kyle to go to them.</p><p>Thinking he might be able to wait until Taz calmed down a bit and speak to him again, he got wearily to his feet as the door to Taz’s office reopened. Wyn stood in the doorway apologetically.</p><p>“I’m sorry, sir. But Taz...I mean to say Taz-lan wants you locked in your room. I’m supposed to take you there now and make sure you’re locked securely inside.”</p><p>Kyle’s lips thinned to a grim line. Taz, as usual, was completely overreacting. Arrogant, suspicious bastard.</p> <p>Wyn’s slight slip of the tongue over Taz’s name reminded Kyle that it was far from the first time the servant had used the name in his presence. Taz had never reacted with impatience or anger, hinting to Kyle that they must have a closer relationship than he knew.</p><p>“Wyn,” he said, a sudden idea occurring to him. “You’ve known both Taz and Tarr a long time, haven’t you?”</p><p>“Oh yes, sir. Since they were born. Their nobyo, who was a fine person, even though he was a human, had to travel frequently with his master, their father. He was a diplomat, you see, and he wanted his nobyo with him. In their absence, I often cared for the children.”</p><p>“I see. So you might say you care a great deal for both of them.”</p><p>“Of course,” he said, stiffening a little. “I’d do anything for either of them.”</p><p>“Anything?” Kyle said, moving closer and putting an arm around Wyn’s shoulders. “Then I have a proposition for you. If it works, and I think it will, it could save both Tarr and Taz. You know what’s happened to Tarr, don’t you? I saw your face when you came into the room to tell Taz.”</p> <p>“Yes, sir, and I’m worried. I don’t know what Taz is going to do. He was frantic when he left here a little while ago.”</p><p>“I know,” Kyle said grimly. “And he’ll blame himself if anything happens, because he always does. And he’ll wind up hating me for it too, because it’s my family, even though I’ve been telling him that something like this was going to happen. He’s a stubborn man, Wyn.”</p><p>Wyn nodded. “Yes, but he’s always been that way, even as a small child. He tries to take care of everyone. It’s one of the reasons I was so happy when he found you, sir. Since you’ve been here, you’ve made him very happy.”</p><p>“Look Wyn, I have an idea. I know I can convince my family that being here with Taz is my choice. It is my choice, you know. He offered me my freedom, but he’s my mate. I can’t live without him now.”</p><p>Wyn nodded. “But as you say, he’s stubborn. And I think he doesn’t believe you won’t try to leave him, despite what he might have offered you. He would be heartbroken if he lost you, I think.”</p><p>“He won’t lose me. I promise you that. If you’ll help me, I think there’s a way out of this for all of us. But it means I have to get to my family and make the exchange before Taz attacks them. I need help, Wyn.”</p><p>The old servant looked alarmed and pulled away. “I-I can’t do that, sir. He would never forgive me.”</p><p>“He doesn’t have to know. You must know some of Tarr’s associates here on Tygeria. Maybe some of the Rogers? I know Tygeria has offered the Nilaniums asylum, and they have a camp here. If I could get a message to them, I think they might help me. My family could give them a reward, plus they’d be liberating Tarr. C’mon, Wyn. Just please think about it. But quickly, before Taz does something rash. He could kill my family, or get himself and his brother both killed or badly hurt. You don’t want that, do you?”</p> <p>Lost in thought, the old man stared at him for a long time before slowly nodding his head. “I know someone. He’s a friend of Tarr’s. Perhaps he can help, but you must never tell Taz-lan I did this. He would be...” He shook his head and Kyle remembered Taz’s eyes.</p><p>“Don’t worry, I’ll never tell him. You’re doing the right thing, Wyn. This will work, and then I’ll come back and we can be happy together—you’ll see.”</p><p>“I hope you’re right, sir. But I’m an old man, and if I’ve learned anything over the years, it’s this. Most things don’t go as you plan them, and sometimes, there simply is no good ending to a problem.”</p><p>A shiver traveled down Kyle’s spine at the words, but he shook himself, and refused to believe it. This would work because it had to. There simply was no other choice.</p><p>Chapter Seven</p><p>Kyle looked nervously out the porthole of the inter-space transport and wondered what Taz was doing right at that moment. He’d been heartsick and miserable since that morning when the captain of the transport had allowed him to try to contact Taz, but Taz had refused to take the call. Refused! Kyle could only imagine what that must mean.</p><p>The “escape” from Taz’s house had gone so smoothly, it was hard to believe it. The day after he’d spoken with Wyn, there was a knock on his bedroom door and Wyn opened it to admit a large, swarthy Nilanium who gave him an interested look before nodding civilly at him. Taz had left early that morning after a restless night, still adamantly refusing to speak to Kyle about an exchange of prisoners.</p><p>In a matter of moments, the Nilanium, whose name was Robosium Jex, had agreed to Kyle’s plan and even refused the reward Kyle told him his family would pay.</p><p>“Tarr Bonnet has been my friend for many cycles,” Jex said. “And a good friend to my people. I’ll help you, Lycan, even though if Taz Bonnet finds out, he’ll have my head. Literally.” He shook his head and gave Kyle the ghost of a smile. “Well, I’ll figure it out. If you come back, he’ll get over it. If not...” he shrugged. “A permanent home is not for me, anyway. Life here on Tygeria is making me soft. I’d rather be traveling through space, I suppose, like my people have done for centuries.”</p><p>“I will come back, I promise you. This is the only thing I can think of to save Tarr and make my family understand.”</p><p>Jex nodded. “If you’re ready, we’d better go now. I have the ship waiting.”</p><p>A little startled at how quickly things were moving, Kyle nodded and found some clothes that belonged to Taz in his clothing drawers. They were too big, but better than the thong he had on, so he quickly dressed, rolling up the trouser legs and tying the shirt around him. He looked odd, but it was the best he could do. He took one last look around and then pulled out the note he’d written the day before where he’d hidden it under the mattress. Wyn had told him things might move quickly once he contacted Tarr’s friend, so he had the note ready.</p><p>The note told Taz how much he loved him and promised him he’d be back. There wasn’t much more to say really. He wondered if Taz would even read it or just rip it up in a rage when he found out Kyle was gone. Propping the note up on his pillow, Kyle followed Jex to the front door.</p><p>That had been almost a day ago, and now Taz was refusing to even speak to him. Kyle felt like some winged creature was inside his stomach, beating its wings and trying to batter a hole through it. He’d never felt so discouraged.</p><p>Someone cleared their throat behind him and he turned to see Jex standing by the hatch into the room. “We’ve entered Lycanus 3 airspace, and been contacted by your people. We told them we had you on board, and they agreed not to shoot us down and eat us. A fair trade, I think.”</p><p>Kyle tried to smile, but he couldn’t quite pull it off. Jex gazed at him and shook his head. “Don’t worry so, Lycan. Taz Bonnet will come around. His pride is hurt now, and he thinks you betrayed him. He’s never trusted Lycans, and he probably thinks this only proves his point.”</p><p>Kyle turned back to the porthole. “Well, that makes me feel a lot better, Jex. Thanks for that.”</p><p>Jex chuckled and came to stand beside him, clapping a big hand on his shoulder. “An ancient Nilanium poet once said, ‘The course of true love never did run smooth.’” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kyle quirked an eyebrow at him. “I think that’s an ancient Earthan poet, William Shakespeare.”</p><p>“Oh? Well, he must have stolen it from our man.” He nudged Kyle with his shoulder. “Come on and get strapped in your seat. We’ll be landing soon and then you can get all of this straightened out and go back to your big Tygerian. They are a handsome people. A little crazy, but very handsome.”</p><p>“Will you stay in our airspace and take me back with you?”</p> <p>He shook his head. “Your people said in and out—quick-like. They’ll have Tarr on the docks waiting for us. We push you out the door to their waiting arms, grab Tarr and take off. But don’t worry,” he said, at seeing Kyle’s crestfallen expression. “Your family will take you back to him once you explain. Or to some neutral ground where he can come for you.”</p><p>Kyle shook his head. “I don’t think Taz wants anything more to do with me. He wouldn’t even answer when I tried to contact him earlier.”</p><p>“Hmm...maybe. But I’d hate to get between you and him if you showed up at his front door. He may beat you a little, but he’ll get over it in a year or two. Maybe three.”</p><p>Kyle laughed in spite of himself, and punched Jex on the shoulder. “Thanks, Jex. I’ll go sit down and get ready for the landing. Things will probably be wild for a few minutes once we land, so I want to thank you now for helping me. I know you did it for Tarr, but I still appreciate it.”</p><p>Jex blushed and turned away, mumbling something under his breath that may have been a thank you. Kyle liked him a lot, even though he was an unabashed thief and a scoundrel.</p> <p>Some twenty minutes later, the transport was coming in low over his home planet for a landing. Through the window, Kyle could see the desolate hills of his home planet. Kyle got a sudden pang as he thought about how very far away from Taz he was, and wondered if he’d ever get back to him again. He knew he could convince his family to let him go—that wasn’t the problem. It was Taz himself, and his damnable pride. Kyle hadn’t counted on the fact that he might be feeling too damn angry and betrayed to let him come home to him. Still, there had been no other solution that he could see to recover Tarr safely. Not when everyone involved were such asses.</p><p>The transport hovered briefly right over a tiny spaceport landing dock, as the pilot prepared to land. It looked like it had been raining recently and the ground looked muddy. Kyle could see what looked like all the alphas standing on the docks, along with a slightly larger form, wearing shackles. It was Tarr Bonnet and he looked much the worse for wear. Bruised and battered, he’d lost his shoes at some point and his clothes hung from him in tatters. Kyle realized he must have shifted to his tiger sometime during his capture or subsequently. He was waiting patiently enough now though as they came in for a landing. Kyle glanced out the side window again and saw his brother and his cousins, their faces tense, their hands on their weapons. They must still suspect some kind of trick.</p><p>He unbuckled himself and hurried to the door of the transport, which was slowly rising. When he came into view, he saw his family’s face light up and he started to jump down and greet them, when he felt Jex’s hand on his arm.</p><p>Lucas, who was standing closest to him snarled and started forward, but Jex took out a gun and held it to Kyle’s head, whispering in Kyle’s ear. “I’m not going to hurt you, boy, but they don’t know that. All I want is Tarr, and I’ll let you go.”</p><p>Nikolai made a move to rush forward, but Lucas grabbed his arm. “Let him go, asshole.” He pulled his own gun and stuck it to Tarr’s head. “I’ve got your man, too.”</p><p>When Lucas put the gun to Tarr’s head, Kyle noticed Larsson, way at the back of the group, gave what sounded like an involuntary sound of anger. Tarr glanced back at him and shook his head. What the hell was that about?</p> <p>“Wait a minute, now, Lycan,” Jex said quickly before things escalated even further. “I have no wish to double cross you. Why don’t we both put down our guns and let our boys go at the same time, hmm?”</p><p>Lucas bared his teeth into what might have been a smile. “You first.”</p><p>Jex shrugged and lowered his gun, removing his hand from Kyle’s arm. Before he did, he gave him a final squeeze. “Go on, boy. Go to your family.”</p><p>Kyle jumped down from the door and Lucas released Tarr to step forward. As he passed Kyle, he gave him a dark look, but Kyle grabbed his arm and made him turn around. Kyle could hear the uneasy movements around him as the others tried to figure out what he was doing.</p><p>Tarr looked down at his hand contemptuously, but Kyle leaned in toward him. “Tell Taz I only did this to get you released. I want to go back to him.”</p><p>Tarr looked surprised, and stared back at him without acknowledging what he’d said. Kyle released his arm, and saw him glance once more at Larsson, who was watching them both. Tarr turned back to the ship and Kyle took another few steps before he was caught in a massive hug by Lucas. He passed him over to Nikolai next for more mauling. Blayde was slapping him on the back and the other cousins were crowding around him, shouting questions at him, when Kyle heard the transport powering up behind him. He glanced up at it as it hovered above them for a moment before shooting off at a rapid speed. He was happy to be home—happy to see his family again. But what in the name of all the gods was he going to do next?</p><p>Nikolai insisted on taking Kyle home with him, and of course, all the others trooped along with them, despite Kyle’s need to crawl in a bed somewhere and go to sleep. The gorgeous Jagger met them at the door, and threw his arms around Kyle’s neck. It was good to see him, but his presence only reminded Kyle of his own mate, so different from little Jagger, yet the way he felt about Taz was the same as Nikolai felt about Jagger. Yet they were here together, and his own mate was light years away. In more ways than one.</p><p>Kyle was exhausted, depressed and heartsick. All he wanted to do was slink off to lick his wounds, not be subjected to an enthusiastic homecoming. He appreciated the sentiment, but he’d be back on Tygeria right this minute if not for their well-meaning meddling in his affairs.</p> <p>He laid his head back on the sofa in Nikolai’s main living area, closing his eyes. He knew he wasn’t being fair—they had no idea Taz was his mate. There hadn’t been time for them to receive that last message he and Taz had recorded for them.</p><p>A sudden memory of that day, when afterward they’d talked about the baby’s name hit Kyle hard and a wave of sorrow and loss washed over him. He may never even see the baby now, not if Taz chose to freeze him out and never forgive him. He felt a hand on his knee and opened his eyes to see Lucas leaning towards him.</p><p>“I’ve called the doctor, Kyle. I think he should check you over.”</p><p>Kyle shook his head wearily. “No, I don’t need any doctor. You don’t understand the situation.”</p><p>Konnor, leaning against the wall next to him, spoke up. “What’s to understand? They kidnapped you, abused you, raped...uh...took advantage of you.” He made a growling sound low in his throat. “This thing isn’t over yet, damn it! We’ll make that bastard pay for what he did to you!”</p><p>Nikolai sat next to him, with Jagger perched on the arm of the sofa beside him. Nikolai threw an arm around his shoulders and squeezed him so hard Kyle thought he might be in danger of a dislocated shoulder. “Damn right. Don’t worry, little brother, we’ll get revenge for what he did to you.”</p><p>Kyle rolled his eyes. Nikolai was older than he was by exactly six minutes, but had acted like this their whole lives. Little brother, indeed. Like he needed someone to look after him. Had Nikolai known all along Kyle wasn’t the same as he was? That he wasn’t a true alpha? Had everyone known except for him?</p><p>Shrugging him off, Kyle turned on him. “I don’t want revenge. I want to go back home to my mate.”</p><p>A stunned moment of silence followed his words. When it went on for a bit too long, he realized they were all embarrassed for him. Lucas, who was the only one who seemed to be able to meet his gaze, looked at him sympathetically. “Kyle,” he said in the tone of voice people used to talk to mental patients or people about to jump from a ledge. “When people are kidnapped and held for a long time, there’s a condition that makes them identify with their captors. That’s what this is. It’s perfectly understandable and...”</p><p>“No!” Kyle yelled, dry-washing his face with his hands. “It’s not any fucking condition and I’m not crazy, damn it, so everybody stop acting weird.” He glared around at each of his family members in turn. “Taz Bonnet is my mate. I know it’s crazy, but that’s how it usually works with this damn curse of ours, doesn’t it? It just happened the moment I saw him. And he feels the same way about me as your mates feel about you. Except that now he thinks I betrayed him and chose you over him. I had to sneak away and get friends of Tarr’s to help me because he didn’t want to risk losing me!” He put his face down in his hands. “Now he probably hates me—he thinks I betrayed him.”</p><p>Another brief, shocked silence met his words, but then Konnor shook his head. “No, wait a minute. That can’t be right. We saw the tape of you in the arena with him on Tygeria. He almost killed you!”</p><p>“What? How did you see that?”</p><p>Nikolai spoke up beside him. “The Alliance has some undercover contacts on Tygeria. Lucas had them following Taz Bonnet once we found out he had you. We saw the whole thing, Kyle. It was brutal.”</p><p>Kyle shook his head doggedly. “No, you don’t understand. I initiated that whole thing. I’d been asking him to contact you to let you know I was fine and that he was my mate, but he was suspicious and afraid it was too soon. I insisted and made him an offer—if I could beat him in the ring, he’d let me come back for a visit.”</p><p>“Beat him in the ring?” Blayde said from his chair next to Lucas. “Kyle, he’s huge. It took two of us to put Tarr Bonnet down when we captured him—I’m surprised you lasted as long as you did.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I wouldn’t have if he’d actually been trying to hurt me. Don’t you see? He was just fooling around—when he realized I was hurt, he put a stop to it fast. He’s bonded with me. He’s my mate, don’t you get it?”</p><p>Lucas leaned back on the sofa looking thoughtful but Nikolai persisted. “No, I don’t believe it. You couldn’t have left him if that had been the case, not once you’d claimed him. And the same goes for him! Nothing would have made me let Jagger go, unless maybe...”</p><p>He broke off with an astonished expression and Kyle nodded, his lips thinned out to a furious line. “Unless some maniacs were threatening to cut your brother up in little pieces and ship him home to you one piece at a time? And I haven’t claimed him—not exactly. He’s claimed me plenty, though, and I-I love him.”</p> <p>Lucas’s face was a little red, and he was shaking his head. “We had no idea, Kyle.”</p><p>Kyle sagged, feeling worn out. “I know. He’s just as stubborn as all of you. He didn’t believe me when I told him you’d try something to rescue me. Arrogant fool.”</p><p>Larsson, standing behind Lucas, had been quiet throughout all of this. He spoke up quietly now. “So you never needed rescue at all. And all this was for nothing.” Everyone in the room gazed at him sharply, but he shook his head and gripped the back of the sofa, looking down. “I’m sorry, Kyle. It’s not that I regret anything, you know that.” He looked back up. “I’d do anything for you. But if I understand what you’re telling us, then letting Tarr go was...”</p><p>Kyle looked back and forth among his family. “What’s going on? What are you talking about, Lars?”</p><p>Lucas was the first to reply, and his tone was grim. “Larsson thinks he imprinted on Tarr Bonnet, of all people.”</p> <p>Larsson turned abruptly and stormed into the adjoining kitchen, walking over to the counter and slamming his hand down on the counter. “I told you, damn it! I told you he’s my mate! I can’t help the way I feel about him. But I’ll get over it. I have to!”</p><p>Kyle’s mouth fell open as he stared at Larsson. Konnor, Larsson’s brother, was studiously ignoring him, his mouth tight and angry. Everyone else just looked uncomfortable.</p><p>“Are you telling me...? Have you mated with him?”</p><p>Larsson shook his head. “Of course not. I couldn’t have let him go, otherwise. But he’s my mate. He felt it too—I know he did, even though he tried to deny it.”</p><p>Kyle felt completely astounded. “So you wouldn’t have allowed them to really hurt Tarr, would you? It was all a bluff.”</p><p>Lucas nodded. “Apparently, this whole thing has been a fuck-up from the start.”</p> <p>“It’s the godsdamned curse. It has to be. Nothing else had ever messed up our lives like this.” Kyle folded his arms across his chest and fell back against the sofa. Everyone was quiet for a long moment and then Jagger, who up to this point hadn’t said a word, leaned across Nikolai to touch Kyle’s hand, lying limp on his thigh.</p><p>“Kyle, you all call this thing a curse, but is it really? You’ve all found your perfect mate now—every one of you, from all over the galaxies. There had to be a little supernatural help in all that. Would you really wish it away? Are any of you sorry that you met your mate?”</p><p>He glared at Nikolai, who grinned up at him. “No, baby. You’re absolutely right. It’s never been a curse at all, has it? Old Ivan gave us a gift.” He stood up and rubbed his hands together. “Now let’s stop fighting about all this and get down to business. How are we going to get Kyle and Larsson’s big kitties back for them?”</p><p>Kyle smiled despite himself at the idea of the fierce Taz as a ‘big kitty.’ For the first time since he left Tygeria, he was feeling a little better about things. His family would help him, and Taz Bonnet didn’t stand a chance.</p><p>Taz put down the papers he’d been reading at his desk and leaned back in his chair. It had been almost a full quarter cycle since he’d last seen his nobyo. The heartbreak just didn’t seem to go away, and he remembered how his father was after his poor nobyo had passed away so unexpectedly. It was a different situation, of course. His father’s lover hadn’t wanted to leave him.</p><p>Kyle’s betrayal still filled him with rage. Oh, not at first. When he’d first come home and found him missing, Taz had been stunned and broken. He’d read the letter he’d left on the bed telling Taz he loved him over and over, looking for some kind of message or code to tell him it was all a joke—he was really hiding in another room and would come back in any minute, laughing at him, his pretty eyes sparkling.</p><p>He knew it wasn’t true, though, and his nobyo—Kyle—was really gone. No use in not saying his name now. The gods had found out Taz’s secret and had spirited Kyle away. When the ship’s captain had contacted him, saying Kyle wanted to speak to him from the transport, Taz couldn’t bring himself to talk to him. He was afraid he’d break down and beg him to come back home, and he couldn’t chance that. It was better to let his nobyo remember him as strong and confident. He’d keep his pride that way at least.</p><p>Then once he had Tarr back home safely—a strangely chastened, downcast Tarr, who refused to speak of his time with the Lycans—Tarr had told him of Kyle’s message to him. Tarr said he told him that he’d only done it to get Tarr released and that he wanted to come back home. So Taz had waited impatiently for his message, asking to return. He’d already decided to play a little hard to get—maybe deny him permission a few times to teach him a lesson, then when Kyle had begged him enough, he’d finally allow him to come home. When he got back, Taz would be cold and stern. He may even have to punish him a little. His nobyo had to learn to obey him and never question his judgment.</p> <p>Except it never happened like that. No messages were received. Kyle never tried to contact him. Once he got back home with his family, he’d completely forgotten Taz even existed, just as Taz had told him he would. For once, being proved right didn’t make him feel better in the least.</p><p>His office door opened to admit Tarr, who strode over to the chair in front of his desk and threw himself down in it. Tarr had been staying with Taz since his return. He wouldn’t talk about what had happened to him on Lycanus 3, but it had Taz worried. Since he came back, he hardly went out any more, preferring to stay mostly in his room. He seemed distracted and angry too, and when Taz questioned him, he’d said he had something on his mind, but that he’d handle it. Apparently, he hadn’t been able to handle it very well so far. He was looking more morose and more like he’d been dragged behind a speeding land transport every day—wounded, beaten up and like he ached all over.</p><p>Taz waited patiently for him to indicate why he’d come in, but nothing seemed to be forthcoming. Tarr stared down at the desk in front of his chair as if the secret to something important was carved into it.</p><p>“What now? Is it something with the baby?”</p><p>Taz’s son had arrived two weeks before. The servants were caring for him and Taz tried to spend as much time with the beautiful child as possible, although all he could think of was how he and Kyle were supposed to be doing this together. Tarr had offered to help, since he was staying with him, though he hadn’t been much help yet. He was too distracted, his mind seeming to be miles and miles away.</p><p>“Huh? Oh no, no, the baby is fine. Wyn’s feeding him and putting him down for a nap.”</p><p>“Then what’s the matter? Got something on your mind?”</p><p>Tarr straightened in his chair. “As a matter of fact, I do. I’ve been thinking about those damned Lycans.”</p><p>Taz winced a little, but nodded. “What about them?”</p><p>“We need to make them pay, that’s what!”</p><p>“Pay how, exactly?” Taz asked quietly.</p><p>Tarr jumped to his feet and began to pace. “By going after them, that’s how! They humiliated me in front of my men, and the only way I got released was by an exchange for your nobyo. That’s unacceptable, damn it. If we don’t fix this and soon, we’ll be a laughing stock.”</p><p>Taz nodded, feeling a little excited by the idea of making Kyle pay. “What do you have in mind?”</p><p>“Getting your nobyo back for one thing. I know you’re miserable without him.” He held up a hand to stop Taz’s protests. “Don’t even bother to lie. I know you too well. You bonded with him, didn’t you?”</p><p>Taz nodded dejectedly. “For all the good it did me.”</p><p>“Then I say we go after him! And maybe, since we’re there anyway, we’ll grab another one of them and make him pay too.”</p><p>“Another one?” Taz looked blank. “Who?”</p><p>Tarr threw himself back down in the chair. “His cousin, damn it. Larsson.”</p><p>“Larsson? Why him in particular? Was he cruel? Did he hurt you in some way you haven’t told me about?” Taz jumped to his feet. “Gods, Tarr, did he...rape you?”</p><p>Tarr growled at him. “Hells, no. Give me a little credit. No, he did something even worse.”</p><p>Taz’s eyes opened even wider. “What? What did he do to you?”</p><p>“He kissed me, okay? And—did other things. He came in my cell while I was chained to the wall and he-he...the son-of-a-bitch made me like it. I need more of him, damn it.”</p><p>Taz was stunned for a moment before falling back in his chair laughing. Tarr glared at him until he finally had himself under control, wiping his eyes. “You’ve found your nobyo, haven’t you? And it’s Kyle’s cousin!”</p><p>“Laugh all you want. It is funny, I guess. I never thought I’d find a Lycan attractive, but the bastard’s gorgeous, okay? There’s just something about him.”</p><p>“But they were going to hurt you. Cut you up!”</p><p>“I think it was all a bluff. Though I wouldn’t have put it past that Blayde or Konnor. Larsson stood up to them, though. Told them they’d have to come through him first. They backed off after that.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Taz still stared at him in amazement. Finally, he seemed to find his voice. “So, did you and this Larsson...”</p><p>“No, not exactly. I wanted to, though. I still do. It’s all I can think about, damn him. When I finally do get hold of him, I’m going to bend him over every piece of furniture I can find. I’ll make him my nobyo and take him with me on my trips around the galaxies. He’ll make a nice little bedwarmer for those long voyages.”</p><p>“Yes, good luck with that. Those sound like the plans I had for his cousin. It didn’t work out exactly that way.”</p> <p>“It will for me. He needs a strong hand, and he’ll find one in me.”</p><p>“You talk as if you already have him. Just how are you planning to get your hands on him? On both of them?”</p><p>“I have my sources watching them now. Larsson used to go after bounties a great deal with his brother, only occasionally transporting bauxite. Now it seems that has changed. He’s been doing runs of bauxite with his cousin, Kyle...your nobyo.”</p><p>“Yes, I know who he is, Tarr, thank you. But why the change? Could it be some kind of set-up?”</p><p>“For what? They seem to have forgotten we even exist,” he said bitterly. “Kyle has even been seen with other men at the bars on Lycanus 3 lately.”</p> <p>Taz stiffened. “I’ll kill him,” he said, his voice menacing.</p><p>“Better yet, get him back and remind him who he belongs to. The two of them, Larsson and Kyle are set to leave on a transport tomorrow, according to my sources. I say, we attack. We’ll take a small, fast ship, latch onto their starship then dock. We can get in fast and take them, leave a few of my men to pilot the ship back to Tygeria and bring them home.”</p><p>Taz’s blood was already racing through his veins at the idea of having his nobyo back in his bed. He might just chain him to it for a few days—or weeks. Other men, huh? He might have to give him daily spankings then too, until he never even so much as looked at another man again. The memory of the last spanking was still as fresh in his mind as the day it happened. Taz groaned at the thought and adjusted himself. Naked, and in his lap was where his nobyo belonged. Tarr was right. It was time to bring him home.</p><p>Chapter Eight</p><p>Kyle sat behind the comm of the transport, wondering if the blip on the screen showing a fast-moving object coming alongside his starship could finally be what he’d been waiting and hoping for. As the small ship came more fully into view on his screens, he spotted the tell-tale skull and crossbones on the side—the sign known as the Jolly Roger. He pressed a button on the comm deck in front of him to warn Larsson to come up quickly. Then he made a quick maneuver to bring down their speed. The last thing he needed was a collision with the smaller ship and it was headed toward them at an incredibly fast rate.</p><p>Its captain, however, was skilled. Kyle wondered if it was Tarr himself. At the last possible moment he brought the smaller ship alongside and powered up his side engine stabilizers to bump the two hulls together, while matching his speed to Kyle’s. Powerful magnetic grapplers attached the smaller ship to the hull of the starship like a barnacle to a whale and a hailing frequency opened up on his command screen. It was Tarr all right, looking a great deal like the pirate he was as he grinned into the monitor.</p> <p>“Open your loading doors, Lycan, or we’ll blow them open.”</p><p>Kyle heard the door behind him as Larsson came running in, skidding to a stop beside his chair, and staring into the monitor. “Tarr,” he said quietly, and Tarr’s grin became even wider.</p><p>“Hello, Larsson. Did you think you’d seen the last of me? I believe I told you once that I’d make you and your family sorry they ever messed with me. I think that day has come, boy.”</p><p>Larsson grinned back at him. “Is this where I’m supposed to beg for my life?”</p><p>“Oh, you’ll beg before I’m through with you,” Tarr said. “Now do I blast your doors open or are you going to be sensible and open up?”</p><p>Larsson and Kyle looked at each other and Larsson nodded, flipping a switch on the comm desk. Tarr nodded approvingly. “Good boys. Maybe I’ll let you puppies share a juicy bone in your cages tonight.” He smiled at Larsson again. “There’s a bad joke in there somewhere. Throw down your weapons and no one will get hurt.”</p><p>When both Kyle and Larsson just stared at him, he raised his voice. “I said, throw down the damn weapons. Now!”</p><p>Kyle unbuckled his sidearm and let it drop to the floor, but Larsson stared into the screen and shook his head. “Not me. You’ll have to come and get it.”</p> <p>“Don’t mind if I do,” Tarr said smoothly and the screen went dark. They could hear the sounds of the scraping on the side of their ship as the smaller ship settled closer against theirs, sealing the gap.</p><p>Larsson glanced over at Kyle. “Get ready. When that hatch opens, I’m betting Tarr and Taz will be coming through and things will start to happen fast.”</p><p>Kyle nodded, his heart racing. The hatch door flew open then and Taz was the first one through, his eyes never leaving Kyle. He looked like a pirate himself, big and dangerous as he rushed toward him and swept him up in his arms. “Don’t fight me, boy. You’re coming with me!”</p><p>Tarr had been right behind him, followed by at least three other Tygerians, their huge bulk filling up the deck area. Out of the corner of his eye, Kyle saw Tarr and Larsson grappling together. He’d already disarmed Larsson and was picking him up to throw him over his shoulder when the door to the command deck opened and the other four Balanescus, along with five of their men, came surging into the room. Taz pulled Kyle behind his back and turned to face the men coming toward him. He was swarmed by three of them and went down hard, kicking and biting.</p><p>Tarr didn’t fare much better. He’d almost made it back out the hatch door with Larsson when Lucas pulled him around and swung at him. He dodged mostly out of the way, only catching part of the blow and then, as they backed him up toward the door, he threw Larsson at them and ducked behind the door, slamming and locking it behind him. By the time the Lycans picked themselves up off the floor, Tarr had made it back to his ship, along with two of his men. They managed to quickly disengage and take off before the Lycans could stop them. But Taz and the other Tygerian were putting up a vicious fight.</p><p>Afraid he’d be injured, Kyle reached for the tranquilizer gun in his console and shot a single dart into Taz’s hip. It still took almost five minutes before he collapsed under the weight of his attackers. Kyle quickly knelt down beside him and checked his pulse. He found it steady, if a little fast. He nodded at Lucas, who was standing by staring down at them, still trying to catch his breath.</p><p>“He’s good. Help me take him down to my quarters.” He got an arm around his waist and Lucas helped him pick Taz up from the other side, but it took three of them to get him down to Kyle’s room. They left them alone and Kyle quickly stripped his clothes off and secured his wrists and ankles to the chains already in place. He stood back up and stared down at his mate. He could only imagine how furious he’d be when he woke up.</p><p>He’d only given him a very light dose of the tranquilizer and he was already waking up, moaning and trying to pull his arms down from above his head. Kyle sat down on the side of the bed next to him and waited for him to wake up. He didn’t have long to wait.</p><p>Taz’s eyes flew open all at once. One second he was out and the next second he was staring up at Kyle, his eyes wild and fierce.</p><p>He pulled frenziedly at the cuffs and chains holding him in place and snarled up at Kyle. “What is this shit? Let me out of it!”</p><p>“No, I don’t think I will.”</p><p>“Kyle! Don’t do this!” Taz had made his voice firm and deep, but his eyes were a little panicked, and his voice cracked a little. Kyle wanted to soothe him, so he sat closer to his side and ran his hands over his chest.</p><p>“Shhh...calm down, baby. You’re all right. No one’s going to hurt you.”</p><p>Despite his attempts to calm him, Taz’s eyes opened wider and he began to struggle so hard, Kyle was afraid he’d do himself an injury. He climbed up on top of him and stretched out, holding him down until he exhausted himself.</p><p>“Stop it, Taz,” Kyle said when Taz finally stopped struggling for a moment to catch his breath. “I said no one will hurt you.”</p><p>Taz snorted. “I’m not afraid of you hurting me,” he yelled, “I’m not afraid of any damn Lycan!”</p><p>Breathing hard, his gaze wide and golden, he glared directly into Kyle’s eyes. “I’ll kill myself before I let you do this to me,” Taz growled dramatically.</p><p>Kyle raised his eyebrows. “Really? And just how do you think you’ll do that when you’re cuffed and chained?”</p><p>He pulled wildly at the cuffs. “You can’t keep me chained forever.”</p><p>“Yes, I think I could,” Kyle said, rubbing his hand soothingly over his sides. “But I won’t. I only have you tied down so I can get some answers.”</p><p>“Answers? What are you talking about?”</p><p>“You knew why I left, but then you didn’t want me to come back. I want to know why.”</p><p>“I told you not to go!”</p><p>“Because you didn’t think it would work. But it did. You got Tarr back safely, and you would have gotten me back if you hadn’t been such an ass.”</p><p>“It doesn’t matter. It’s over between us.”</p><p>“Then why are you here?”</p><p>Taz got a surprised look on his face, and he turned his face to the wall. “I...uh...”</p><p>“You’re here to get me, right?”</p><p>“No.”</p><p>“I believe when you came in the door to the comm deck you said, ‘Don’t fight me, boy. You’re coming with me.’ Isn’t that right?”</p><p>“I don’t remember. Let me out of this, Kyle.”</p><p>Ignoring him, Kyle continued. “This was my cousin Lucas’s idea, you know. Larsson and I have been traveling back and forth on transports for weeks trying to see if you and Tarr would come for us. He said that you wanted me to beg, but if I ignored you, you wouldn’t be able to stand it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I have no interest in what he said. Or what you say, for that matter.” Taz practically spat the words at him.</p><p>Kyle slid off him and sat on the bed beside him, still gazing down at him.</p><p>“So you have no interest in having me come back to be your nobyo?”</p><p>He was silent so long Kyle didn’t think he was going to answer. Finally he growled out an angry reply. “You left me. You left our child.”</p><p>“Technically, I only left you. The baby hadn’t arrived yet.”</p><p>Taz glared at him and then turned his head away, his body language making it clear he wasn’t going to dignify that with an answer.</p><p>“If you don’t want me to be your nobyo, I can still let you go. I haven’t claimed you, you see. So while I’d be sad, and it would take me a long, long time to get over you, I might still be able to do it. Find another mate. If that’s what you want.”</p><p>He glanced over at Kyle with a bitter, angry expression. “You just can’t help yourself, can you? You want someone else? I heard you were seen in bars with other men.”</p><p>“Oh, that got back to you, huh? Lucas said it would. What would you think if I said yes, I would like someone else who treated me more like an equal?” Kyle asked, tilting his head.</p><p>“I’d think you were a whore! And I’d be right. You belonged to me. And you were very well treated!” Taz pressed his lips together bitterly and cast an accusing glance at Kyle.</p><p>“Well, you don’t want me anymore. What difference does it make to you? And in my culture, I wasn’t cheating on you at all. I haven’t properly mated with you yet.”</p><p>“I’ve mated you, as you say, in every possible way.”</p><p>“But I haven’t mated you. That’s what forms our bond. That and the bite.”</p><p>“What do you mean?”</p><p>“Once I make love to you and give you the mating bite, then I would never be able to leave you—never be able to be away from you or ever want another man.”</p><p>Kyle saw Taz listening carefully, but he still kept his face turned away. Sighing heavily, Kyle got up to leave. “I’ll have someone come in and release you, and send you back to Tygeria.”</p><p>He got as far as the door before Taz spoke again. “I guess it wouldn’t be so bad, this mating thing. If that’s what you need to keep you from being a whore.”</p><p>Stopping with his hand on the door, Kyle smiled a little before he turned back around. “You’re a sweet talker, I’ll give you that.” He took a step closer to the bed. “So are you saying you’d like me to give you the mating bite? You want me to make love to you?”</p><p>“If that’s what it takes to get you to come back home where you belong...and take over your responsibilities. I guess I could make that sacrifice. The baby needs a nobyo, I suppose.”</p><p>“What about you? Do you want me to be your nobyo?” Kyle asked softly.</p><p>Taz rolled his eyes. “Isn’t that what I just said?”</p><p>Kyle sat down on the bed beside him again. He took a key from his pocket and released Taz from the cuffs. He leaned over and kissed his forehead, his cheeks, his lips. Taz squirmed under his attention, and put a hand on his chest to push him gently away.</p> <p>“Stop—I don’t like it.”</p><p>Kyle wrapped a hand around his rapidly filling cock. “Really?”</p><p>Taz ignored him. “Well, how do we do this? Let’s get on with it.”</p><p>“Lie down—face down.” Kyle took his shoulder and urged him to turn over in bed. Grumbling, he moved to his stomach and rose on one hand to look over his shoulder at Kyle, but Kyle pushed him back down. “No, just relax. Stay down.”</p><p>Taz let out a long, put-upon breath, but did as he asked and turned back around, holding himself up on his elbows. “Hurry this up, will you?”</p><p>Kyle smiled and took off his pants with hands that trembled with desire. He didn’t want Taz to see how much he wanted this, and he didn’t trust his voice right now. He shoved his pants and underwear down and stepped out of them, went to the small table beside his bed, and pulled out a small bottle of oil. He drizzled the cool, slippery liquid onto his hand and down between Taz’s ass cheeks, stopping for a moment to admire the rounded ass. He massaged the lube into the crease, finding Taz’s hole and enjoyed the needy little sounds coming from Taz’s throat, the ones he was trying so hard to hold back.</p><p>“Like that?” Kyle dipped a well-lubed finger inside. “Does that feel good?”</p><p>Taz’s back stiffened, but his breathing rate had increased noticeably. He nodded, keeping his face turned away. Kyle couldn’t resist smacking his bottom. Taz jumped and cast an angry glare back at him.</p><p>“Such a beautiful ass,” he murmured appreciatively, and Taz shrugged a bit.</p><p>“Of course,” he said, immodestly. “Tygerians have the most beautiful bodies of any species in the galaxies.”</p><p>“Prettier than mine?” Kyle teased.</p><p>At first Kyle thought he wasn’t going to answer, but he finally lifted one shoulder again. “Yours is quite—nice—for a Lycan.”</p><p>Grinning, Kyle added another finger and pumped in and out, twisting every few strokes and ignoring the squirming Taz began doing. Putting one hand down on the small of his back to keep him still, he searched gently with his fingers until he found what he was looking for, rubbing his fingers hard over the spot. Taz cried out and almost came off the bed. It was all Kyle could do to keep him on it.</p><p>“What was that? What did you do to me?”</p><p>“That’s the spot inside you that makes the pain worth it. Don’t tell me you never felt that before. You showed it to me.”</p><p>“No,” he replied sullenly. “How would I know how it felt?”</p><p>“But didn’t you ever...”</p><p>“No,” he said firmly. “I knew it was there, but that’s for nobyos.”</p><p>“See what you’ve been missing?”</p><p>Taz’s eyes widened a bit and he slowly nodded. “It might have its merits. Perhaps when you come back home where you belong, I may allow you to touch me there again with your fingers. Now are we finished?”</p><p>Kyle grinned. “Not by a long shot, baby. Get up on your knees.”</p><p>Grumbling, Taz rose to his knees and patiently moved his legs apart. “Get on with this, Nobyo. I grow weary of it.”</p><p>Kyle noticed the name he called him, and thrilled to hear it again, but he said nothing. Instead, he moved up to kneel behind him and poised the head of his cock against Taz’s hole. “Ready, baby?” Kyle asked, rubbing his hand over Taz’s hip.</p><p>Taz nodded, tense again. He glanced over his shoulder and his voice was so quiet, Kyle had to strain to hear it. “Will...will it hurt?” His voice sounded a bit ragged.</p><p>Kyle hesitated. “A little. But I’ll try to make it good for you.”</p><p>He kissed Taz’s back and then slid inside him, the velvety tightness gripping his cock and squeezing it until Kyle gasped and he pulled out a little. “Let me in, baby. You’re so tight. Push out, okay? I don’t want to hurt you.”</p><p>Taz was breathing rapidly, his whole body trembling with the effort to stay still and both hands gripping the sheet beneath him so hard Kyle figured his sheets would be torn to shreds before this was over. “Relax, sweetheart. I want you to enjoy this.”</p><p>Taz nodded and relaxed the tiniest bit. Kyle kissed his back and rubbed his hands down his sides, keeping his cock just inside, letting him adjust to it. Gradually, Taz began to relax his death-grip on the sheets.</p><p>Kyle reached beneath his body and took hold of Taz’s softened cock, gently stroking it as it filled out in his hand. Taz groaned and a wave of tenderness washed over Kyle. “Let me love you, baby. I only want to make you feel good.”</p><p>Taz nodded, and Kyle continued stroking him. When he was hard, Kyle began pushing gently into his tight, little hole. Matching his movements to that of his hand, he set up a slow, gentle rhythm, and was able to push deeply inside Taz as his muscles relaxed. Kyle pressed his cheek to Taz’s back. “So good, Taz,” he said softly, and Taz pushed his butt back against Kyle’s groin. He shifted his angle, found the sweet spot, and brushed over it again and again. Taz groaned loudly and arched his back.</p><p>Kyle began to move faster, unable to resist thrusting harder against him, and Taz reached behind him to put his hand on Kyle’s hip. “More, Nobyo,” he said softly.</p><p>Kyle moaned, thrusting in and out as his hand curled around Taz’s cock, moving over it faster. With a guttural cry, Taz came, spilling over Kyle’s hand. Kyle’s own orgasm rushed over him, and he thrust hard hard into Taz’s ass, squeezing his cock at the same time. Kyle pulled Taz up so that his back was against his chest and bit him deeply on the back of the neck, sinking his fangs in his flesh. The orgasm intensified for both of them as Kyle came so hard he thought he might pass out. He put his head back and a howl ripped from his throat before he could stop it.</p><p>Taz’s knees gave way and he collapsed to fall down on the bed. Kyle went with him, still inside him, and not really wanting to ever pull out. He sucked the blood as it seeped out, then licked the back of his neck where the blood was trickling down, kissing the spot over and over. Taz rolled on his side so that Kyle could spoon him, and they both lay still, trying to catch their breath. The bite mark had already started to heal over but it would leave a scar, marking Taz as his mate. He had made the bite mark high on his neck so it would always show that he’d been claimed by his Lycan mate.</p><p>Kyle gazed over at that mate now. Taz was reacting to Kyle’s bite and was already intoxicated by the venom and the force of his orgasm. His eyes were half closed, and he was breathing fast. Kyle knew that he would run a high fever now for at least a couple of hours, depending on his Tygerian metabolism. The venom wouldn’t harm him, just change his body chemistry a bit. Most mates became stronger and even more beautiful from the effects. Damn, if Taz got any stronger or more handsome, Kyle wasn’t sure if he’d be able to stand it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He eased over to his back and pulled the blanket over both of them. Wrapping an arm around his mate’s waist, he sighed and decided to try and take a short nap until Taz awoke. For the first time in a long while, his wolf was content inside him, having finally staked his claim on this man. Kyle nuzzled his face in the back of Taz’s neck and drifted down into sleep.</p><p>Hours later, he awoke to kisses on the side of his face and turned sleepily toward the source so that one fell directly on his lips. Kyle’s eyes sprang open to see Taz leaning over him. He smiled up at him and stretched contentedly. “How do you feel, Taz-lan?”</p><p>Taz’s eyebrows rose. “So now you call me Taz-lan? A little late for that, isn’t it?”</p><p>Kyle lifted his head up and stole a quick kiss. “Never. I claimed you as my mate, but I recognize you as my alpha.”</p><p>Taz got a frown mark between his eyes. “Your alpha, huh? So you finally plan to be my obedient nobyo?”</p><p>“Yes, Taz-lan. I’d like to go home with you and try, anyway. And I’m dying to see our baby.”</p><p>“He is quite handsome, of course. And very strong, though I think he needs his nobyo.” He dropped another kiss on his lips and gazed down into Kyle’s eyes. “I think I need my nobyo too. If my nobyo thinks he can stay with me this time...” He smiled, but his eyes still held a hint of pain.</p><p>Kyle slid his arms around Taz’s neck, pulling his head back down. “Always,” he murmured against his lips. “Forever.”</p><p>Taz nodded. “Good,” he said with satisfaction. “Now let’s see about going home where you belong.”</p><p>“Maybe we could wait until morning,” Kyle said. “I can think of ways to pass the time till then.” He pulled Taz down to him and proceeded to show him exactly what he was talking about for a long, long time.</p><p>Epilogue</p><p>Larsson was alone on the command deck, having volunteered to pilot the ship while the others got some rest. Kyle was below decks with his mate, and Larsson was glad things had worked out for them. He couldn’t help being envious and wishing that he’d been able to keep Tarr with him, but he tried not to think about it and put it out of his mind. He’d been so close—he almost got his hands on him again, only to have him slip away. He’d find him again, though. He had to.</p><p>A sudden ding from the computer in front of him made him look down at the screen to see a message coming in addressed to him. They were in deep space, far from any space port. His entire family was with him onboard. There was only one person who could be sending him a message and his heart began to thump with excitement.</p><p>Trembling, he opened the message and saw at once that it was from Tarr.</p><p>Don’t think this is over, Lycan. If my brother is harmed, I’ll hold you personally responsible. I’m coming for you, and once I have you, I’ll never let you go. You can run from me, but you can’t hide. It’s only a matter of time.</p><p>Larsson grinned. “My sentiments exactly, sweetheart,” he said softly, and he tapped out a brief message in reply.</p><p>Bring it.</p><p>Sinking back against his chair, he smiled softly to himself and relaxed for the first time that whole long day.</p><p>*THE END* </p> </body></html>"]