["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A shiver ofdeja vu crawled down Ash’s spine as he walked along an eerie, fog-filled hallway he’d hoped to never see again. The nether realm ofTartarus was reserved for those who were being punished in the afterlife for crimes committed in a human lifetime.</p><p>The screams of the damned echoed off walls as black as Ash’s own soul. He would give Hadescredit, the ancient Greek god definitely knew how to make people suffer.</p><p>Moments like this, Ash hated being a god. It was unbearable to know he had the power to stop and change things, and the profound responsibility to let nature take its course. Human free will should never be altered.His own damnation was a constant reminder of exactly why.</p><p>Still the reality of it ate at him constantly. How he envied Artemis, Hades and many of the other gods who could shrug off human suffering as par for the course.</p> <p>But having once been human, Ash wasn’t immune to it. He understood what caused people to make the bad decisions they would spend the rest of eternity paying for. And that human part ofhimself wanted</p><p>desperately to ease their pain</p><p>It was a bittersweet gift his mother had given him when she had made the decision to hide him in the human world. To this day he wasn’t sure if he should thankher or curse her for it.</p><p>Today, he wanted to curse her.</p><p>“You don’t have to do this.”</p> <p>He ignored Artemis’s voice in his head. He did have to do this.</p><p>It was time.</p><p>Ash stopped at a doorway that was covered with an iridescent slime. It shimmered like a rainbow oil slick in the dim light. To his surprise, there was no sound coming from inside. No movement. It was as if the occupant was dead.</p><p>But unlike the others who lived inTartarus , this particular person couldn’t die.</p><p>At least not until Ash did and since he was a god...</p><p>He used his powers to open the door without touching it.</p> <p>It was completely black inside the small, dingy room. Horrifying images of his human past slammed into him at the sight. Long-buried emotions ripped at him with daggers of pain that lacerated his heart.</p><p>He wanted to run from this place.</p><p>He knew he couldn’t.</p><p>Grinding his teeth, Ash forced himself to take the six steps that separated him from the man who was curled into a ball in one corner. An identical replica ofhimself , the man had long blond hair that was gnarled from the time he’d spent here and hadn’t brushed it.</p><p>But Ash never willingly wore his hair blond. It was a wretched reminder of a time in his past that he wanted hisdamndest to forget.</p><p>The man on the floor wasn’t moving. His eyes were clenched shut like a child who thought that if he made no sound, no moves, the nightmare would end.</p><p>Ash had lived a long time in just such a state, and like the man before him, he had prayed for death repeatedly. But unlike his prayers that had gone unanswered,Styxx’s would be answered.</p><p>“Styxx,” he said, his low tone echoing off the walls.</p> <p>Styxxdidn’t react.</p><p>Ash knelt down and did something that had disgustedStyxx when they had been human brothers in ancientGreece. He touched his brother’s shoulder.</p><p>“Styxx?” he tried again.</p><p>Styxxscreamed as Ash broke through the brutal memories of horror thatMnimi , the goddess of memory, had given toStyxx as punishment for trying to kill his brother. It was a punishment Ash had never agreed with. No one needed the memories of his human past. Not even him.</p><p>He could hearStyxx’s thoughts as they left Ash’s past and returned toStyxx’s control.</p><p>Knowing his brother would be disgusted by him, Ash let go and stepped back.</p><p>As humans, he andStyxx had never been close.Styxx had hated him with an unreasoning passion. For his own part, Ash had aggravated that hatred.</p><p>Ash’s human rationale had been that if they were going to hate him anyway, then he would give them all good cause for it. He’d gone out of his way to repulse them.Out of his way to antagonize them.</p><p>Only their sister had ever given him kindness.</p><p>And in the end, Ash had betrayed her...</p><p>Styxxstruggled to breathe as he became aware of the fact that he wasn’t Acheron.</p><p>I amStyxx .Greek prince. Heir to...</p><p>No, he wasn’t the rightful heir to anything. Acheron had been. He and his father had stolen that from Acheron.</p><p>They had taken everything from him.</p><p>Everything.</p><p>For the first time in eleven thousand years,Styxx understood that reality. In spite of what his father had convinced him, they had greatly wronged Acheron.</p><p>The Greek goddessMnimi had been right. The world as PrinceStyxx had seen it had been whitewashed by lies and by hatred.</p><p>The world of Acheron had been entirely different. It had been steeped in loneliness and pain, and decorated with terror. It was a world he’d never dreamed existed. Sheltered and protected all his life, Styxx had never known a single insult.Never known hunger or suffering.</p><p>But Acheron had...</p><p>His body shook uncontrollably asStyxx looked around the dark, cold room. He had seen such a place in Acheron’s memories.</p><p>A place they had gleefully left Acheron to face alone. Only this place was cleaner.Less frightening.</p><p>And he was a lot older than Acheron had been.</p><p>Styxxcovered his eyes and wept as the agony of that tore through him anew. He felt Acheron’s emotions. His hopelessness.His despair. </p><p>He heard Acheron’s screams for death.His silent pleas for mercy—silent because to voice them only made his situation worse.</p><p>They echoed and taunted him from the past.</p><p>How many times hadStyxx hurt him? Guilt gnawed at him, making him sick from it.</p><p>“I’ll take them away from you.”</p><p>Styxxflinched at the voice that sounded identical to his own, except for the soft lilting quality that marked Acheron’s from the years he had spent in Atlantis.</p><p>YearsStyxx wished to the gods that he could go back and change.Poor Acheron. No one deserved what had been handed to him.</p><p>“No,”Styxx said quietly, his voice shaking as he gathered himself together. “I don’t want you to.”</p><p>He glanced up to see the surprise on Acheron’s face.</p><p>It was something Acheron hid quickly behind a mask of stoicism. “There’s no reason for you to know all that about me. My memories have never served anyone well.”</p><p>That wasn’t true andStyxx knew it. “If you take them from me, I will hate you again.”</p><p>“I don’t mind.”</p><p>No doubt. Acheron was used to being hated.</p><p>Styxxmet that eerie swirling gaze of his levelly. “I do.”</p><p>Ash couldn’t breathe from the raw emotions he felt as he watchedStyxx push himself to his feet.</p><p>They were so muchalike physically and yet polar extremes when it came to their past and their present.</p><p>All they really had in common was that they were both longed-for heirs.Styxx was to inherit his father’s Greek kingdom while Acheron had been conceived by anAtlantean goddess to destroy the world.</p><p>It was a destiny neither of them had ever fulfilled.</p><p>To protect him from the wrath of theAtlantean gods who wanted him dead, Ash’s true mother had forced him into the womb ofStyxx’s mother and then tied their life forces together to protect Ash. Ash had been born human against his will...and against the will of his human surrogate family, who had somehow sensed he wasn’t really one of them.</p><p>And they had hated him for it.</p><p>“How long have I been here?”Styxx asked, looking around his dark prison.</p><p>“Three years.”</p><p>Styxxlaughed bitterly. “It seemed like forever.”</p><p>It probably had. Ash didn’t envyStyxx having to suffer the memories of Ash’s human past. Then again, he envied himself even less for having lived them.</p><p>He cleared his throat. “I can return you to the Vanishing Isle again, or you can stay here in the Underworld. I can’t take you into the Elysian Fields, but there are other areas here that are almost as peaceful.”</p><p>“What did you have to bargain with Artemis and Hades for that?”</p><p>Ash looked away, not wanting to think about it. “It doesn’t matter.”</p><p>Styxxtook a step toward him,then stopped. “It does matter. I know what it costs you now... what it cost you then.”</p><p>“Then you know it doesn’t matter to me.”</p><p>Styxxscoffed. “No. I know you’re lying, Acheron. I’m the only one who does.”</p><p>Ash flinched at the truth. But it changed nothing. “Make your decision,Styxx . I don’t have any more time to waste here.”</p><p>Styxxtook another step forward. He stood so close now that Ash could see his reflection inStyxx’s blue eyes. Those eyes pierced him with sincerity. “I want to go toKatoteros .”</p><p>Ash frowned at him. “Why?”</p><p>“I want to know my brother.”</p><p>Ash scoffed at that. “You don’t have a brother,” he reminded him. It was somethingStyxx had proclaimed loud andclear throughout the centuries. “We only shared a womb for a very short time.”</p><p>Styxxdid something he had never done before. He reached out and touched Ash’s shoulder. That touch seared Ash as it reminded him of the boy he’d been who had wanted nothing more than the love of his human family.</p><p>A boy they had spat on and denied.</p><p>“You told me once, long ago,”Styxx said in a ragged tone, “to look into a mirror and see your face. I refused to then. But nowMnimi has forced me to look at my own reflection. I’ve seen it through my eyes and I’ve seen it through yours. I wish to the gods that I could change what happened between us. If I could go back, I would never deny you. But I can’t. We both know that. Now I just want the chance to know you as I should have known you all those centuries ago.”</p><p>Angered at his noble speech and at a painful past that no mere handful of words could ease, Ash used his powers to pin him back to the wall, away from him.Styxxhovered spread eagle, above the floor, his face pale as Ash showed him his powers. He could tell byStyxx’s thoughts that he was aware of exactly what he could do. Even though they were linked together, Ash could kill him with a single thought. He could</p><p>shred him into pieces.</p><p>Part of him wanted to. It was the part of him they had turned vicious.The part of him that belonged to his real mother, the Destroyer.</p><p>“I am not a god of forgiveness.”</p><p>Styxxmet his gaze without flinching. “And I’m not a man used to apologizing. We are linked. You know it and I know it.”</p><p>“How could I ever trust you?”</p><p>Styxxwanted to weep at that question. Acheron was right. How could he trust him? He’d done nothing but hurt his brother.</p><p>He’d even tried to kill him.</p><p>“You can’t. But I have lived inside your memories for the last three years. I know the pain you hide. I know the pain I caused. If I stay here, I will go mad from the screams. If I return to the Vanishing Isle, I’ll languish there alone and in time I will probably learn to hate you all over again.”</p><p>Styxxpaused as grief swept through him at the truth. “I don’t want to hate you any more, Acheron. You are a god who can control human fate. Is it not possible that there was a reason why we were joined together? Surely the Fates meant for us to be brothers.”</p><p>Ash looked away as those words echoed in his head. It was a divine cruelty that he could see the fate of everyone around him, except for those who were important to him or those whose fates were intertwined with his own. He held the fate of the entire world in his hand and yet he couldn’t see his own future.</p><p>How screwed up was that?</p><p>How unfair?</p><p>He looked at his “brother.”Styxx was more likely to skewer him than he was to speak to him.</p><p>And yet he sensed something different about him.</p><p>Forget it. Erase his memory of you and leave him here to rot.</p><p>It was kinder than anythingStyxx had ever done to him. But deep inside, down in a place that Ash hated was that little boy who had reached out for his brother.That little boy who had cried out repeatedly for his family only to find himself alone.</p><p>Should Ash deny that boy, too?</p><p>He setStyxx back on the ground.</p><p>Ash didn’t move as memories and the emotions they reawakened assailed him. He could senseStyxx was approaching. He tensed out of habit. Every timeStyxx had ever drawn near, he had hurt him.</p><p>“I can’t undo the past,”Styxx whispered. “But in the future, I will gladly lay my life down for you,</p><p>brother.”</p><p>Before he realized whatStyxx was doing,Styxx pulled himclose.</p><p>Still Ash didn’t move as he feltStyxx’s arms around him. He’d dreamed of this moment as a child. He’d ached for it.</p><p>The angry god inside him wanted to shatterStyxx into pieces for daring to touch him now, but that innocent part of him... that human heart, shattered. It was the part that he listened to.</p><p>Ash wrapped his arms around his brother and held him for the first time in their lives.</p><p>“I’m so sorry,”Styxx said in a ragged tone.</p><p>Ash nodded as he pulled away. “To err is human, to forgive divine.”</p><p>Styxxshook his head at the quote. “I don’t ask for your forgiveness. I don’t deserve it. I only ask for a chance to show you now that I’m not the fool I was once.”</p><p>Ash only hoped he could believe it. The odds were against them both. Every timeStyxx had been given an opportunity to assuage their past, he had used it to hurt him more.</p><p>Closing his eyes, Ash teleported them out ofTartarus and intoKatoteros , the realm that had once been home to theAtlantean gods.</p><p>Styxxpulled back to gape at the opulent foyer where they stood. Everything was white and crisp, almost sterile. “So this is where you live,” he breathed, awed by the beauty.</p><p>“No,” Acheron said as he folded his arms over his chest, and indicated the tall, gilded windows that looked out over the tranquil water that stretched toward the horizon. “I live across the RiverAthlia , on the other side of theLypiShores. There is noCharon to ferry you across the river to my home so don’t bother looking.”</p><p>He was completely confused by that. “I don’t understand.”</p><p>Acheron took a step back from him andStyxx was puzzled by the suspicion he saw in his brother’s silver eyes. “I will see to it that you have servants and all you could ever desire here.”</p><p>“But I thought we were going to be together.”</p><p>Acheron shook his head. “You made your choice and you wanted to come here. So here you are.”</p><p>But this wasn’t what he wanted. He’d thought...</p><p>Styxxtried to approach him only to find his pathway cut off by an invisible wall. “I thought you said to err is human, to forgive divine.”</p><p>Those swirling, silver eyes burned him. “I’m a god,Styxx , not a saint. I do forgive you, but trusting you is another matter. As you said, you shall have to prove yourself to me. Until then, you and I shall take this one step at a time and then we shall see what is to become of us.”</p><p>And as soon as those words were spoken,Styxx foundhimself alone. </p> </body></html>"]