["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>It was always the same when you were looking for something in amongst a big pile of some things—the something you were after was at the bottom of that big pile of some things. I finally dropped the last box on the other side of the room and wiped a streak of sweat from my forehead.</p><p>When I’d moved in with Adam three months ago I’d promised him that all the boxes of junk that I put in his spare room would be sorted out and tidied away within a couple of weeks. I’d unfortunately reneged on that promise and wasn’t ashamed to say I was still leaning on my tumor scare to get me out of the admonishment that should have followed. I’d been diagnosed with my benign—and yet still terrifying—brain tumor eight months ago, a diagnosis that not only traumatized my family and friend, Joss, but had kicked Adam, my brother’s best friend, swiftly up the behind. He’d finally admitted to everyone he was in love with me, and we’d hardly spent a day apart since. Although our relationship had changed, we were still us and Adam tried not to treat me like I was made of glass. However, I’d noticed he let me away with things he wouldn’t have before—such as cluttering up his clutter-free, swanky duplex with all my rubbish—and I didn’t know if this was because of the scare or because we were a couple now and he was compromising.</p><p>I swooped down on the last box with a grunt of triumph and ripped off the packing tape.</p> <p>Inside I found exactly what I was looking for and smiled. I’d already upended the box and sent my old diaries cascading across Adam’s hardwood floors before it occurred to me that upending a box of diaries might cause scratches. Wincing, I did this silly little dance over the falling journals as if this would somehow, magically, soften the impact of their rapid descent.</p><p>It didn’t.</p><p>I dropped to my knees and picked up the books, checking the floors. Nothing. Thank God.</p><p>Adam was an architect and that meant he liked his space a certain way, and he liked that space in pristine condition, especially when it cost him a fortune. Hardwood flooring wasn’t cheap. Adam had already changed his life for me, doing a three-sixty from the ultimate player to devoted boyfriend, from bachelor and proud clutter-free homeowner, to doting partner and proud owner of a stylish duplex covered in weird crap his quirky, overly-romantic girlfriend picked up in random places, including charity shops. He’d allowed me to put my stamp in every room, so damaging his floors wasn’t exactly a nice way to pay him back. I kissed the tips of my fingers and pressed them against the floor in a gesture of apology.</p><p>“Els, what was that noise? You okay?” Adam’s deep voice could be heard from across the hall. He was in his office working on his and Braden’s current project.</p> <p>“Uh-huh,” I called back, flipping through the diaries to make sure I had every single one of them. I was so lost in what I was doing I didn’t hear Adam’s footsteps.</p><p>“What are you doing?” His voice was suddenly right above me and I jumped, startled, only to lose my balance, falling onto my bottom with an “oof.”</p><p>I heard him smother a snort and glared up at him. “I need to get you a bell.”</p><p>Ignoring me, Adam crouched down onto his haunches, his eyes taking in the diaries. As always when I studied him I got a little flutter in the pit of my stomach, and my skin tingled.</p><p>With his thick, dark hair and great body (honed from daily visits to the gym) Adam was a good-looking guy but the kind of good-looking that immediately transformed to hot when you started to talk to him. He had a toe-curling wicked smile, intelligent dark brown eyes that twinkled when he was interested in what you were saying, and a rich voice that took direct pathways to a woman’s erogenous zones. Those gorgeous eyes of his lifted to smile into mine. “I haven’t seen you with one of these in a while.”</p><p>“My diaries?” I nodded, trying to sort them into chronological order. “I stopped writing.”</p> <p>“Why?”</p><p>“I stopped after we got together. There didn’t seem to be any point in them any more since they were basically just an outlet for my feelings for you.”</p><p>His lips quirked up at the corner. “Baby,” he murmured and reached over to tuck a length of short hair behind my ear. I frowned at the reminder my hair was short. Before the tumor, I had a head of long, pale blonde hair. I’d loved my hair, and I knew Adam had loved my hair.</p><p>But the surgeons had shaved a patch of it off my head to cut into my brain unobstructed. I’d covered the patch with a headscarf but had eventually stopped wearing them as the hair grew back out, and I allowed my mother to talk me into getting “a chic pixie cut”.</p><p>I was horrified when I walked out of the hair salon, and only somewhat appeased when Adam told me he thought my new hair was sexy and cute. I was completely appeased when Joss told me anything was better than a tumor.</p><p>She was right. If my tumor had taught me one thing about life it was to not sweat the small stuff. That didn’t mean it wasn’t damn annoying waiting for my hair to grow back in. At the moment it was barely to my chin.</p><p>“So why are you looking at these?” Adam asked, picking one up and absentmindedly flicking through it. I didn’t mind. I was a pretty open person anyway, but especially with Adam. I wasn’t embarrassed by anything I wrote. I trusted him with the very depths of who I was.</p><p>“For Joss,” I replied brightly, feeling giddy about the whole thing.</p> <p>Last night, Joss and I had been hanging out at her and Braden’s flat—my old flat on Dublin Street—and she’d told me her manuscript was coming along nicely. Joss was American, a writer, and she’d come to Edinburgh to escape a tragic past. Her story broke my heart. When she was fourteen she’d lost her entire family in a car accident. I couldn’t even begin to imagine what that must have been like for her. I just knew it had a left a deep mark.</p><p>I’d liked Joss immediately when I interviewed her to be my flatmate, but I’d known then there was something broken about her, and I’d decided I wanted to help somehow. She’d been pretty closed-off but when she started dating my big brother, Braden, I watched her slowly change. She said Braden and I both changed her, but really it was him. He’d helped her so much that she’d even begun to write a story based on her parent’s relationship. That was a huge step for her, and she’d told me last night she couldn’t believe how much she was enjoying writing it. It had given me an idea for her next project.</p><p>“Why for Joss?”</p><p>“Because inside these diaries is the history of us.” I grinned at him. “It’s a good romance story. I think it should be her next novel.”</p><p>I could see Adam was dying to laugh and I had no idea why so I ignored it. “Next romance novel?”</p><p>“Next as in follows the previous romance. The story about her parents is a romance.”</p><p>“Still, I’m pretty sure Joss wouldn’t classify herself as a romance writer. In fact, I’ve heard her say as much.”</p><p>“So have I.” I tossed my first diary back in the box since it wouldn’t aid Joss’s research considering I was seven when I scribbled in it. It was mostly about my Barbies and Sindy dolls and my issues with Sindy’s flat feet and the impossibility of her and Barbie sharing shoes. It used to drive me nuts. “And I do believe the lady doth protest too much. She’s definitely a romance writer. I’ve primed her to be a romance writer, subjecting her to so many romantic dramas it would be a miracle if she didn’t become a romance writer.”</p><p>He chuckled at me and lowered himself to the floor so he was sitting with his knees bent, my diary still open in his hands. His eyes scanned the pages. “So you wrote about me in all of these?”</p><p>Yes, yes I had. I’d had a big old crush on Adam since I was ten and he was seventeen.</p><p>That big old crush had transformed into an even bigger crush when I was fourteen and then had just snowballed from there. I threw another diary from my childhood in the box and reached for the next one in the pile. “I’ve loved you for a long time, my friend,” I murmured.</p><p>“I want to read about it,” he replied softly, the solemnity in his tone bringing my head up, my eyes to his. They glittered at me, full of tenderness and emotion that never failed to make me breathless. “I want every piece of you. Even the stuff I missed without even knowing I was missing it.”</p><p>I felt myself melt. I was a romantic to the very bone and although it would surprise anyone who knew him, Adam catered to my romantic side with a dedication that thrilled me. He had a way with words that turned me to mush... and then usually turned me on so it was a complete win-win for him.</p><p>Giving him another soft smile I turned to the diaries and quickly flicked through them until I discovered the one I wanted. Skimming it, I found the exact entry I was looking for and then held it out to him, holding its place open for him. “Here, start with this. I was fourteen.”</p><p>Adam raised an eyebrow, I assumed at the thought of reading my fourteen-year-old thoughts, and took the diary from me. I knew what he was reading. I remembered it like it was yesterday.</p><p>Monday, March 9th It’s been a really strange day. It started like every other day. I got up just as Clark was rushing out to work, I helped Mum with Hannah since she’s got her hands full with Dec at the moment, and I tried to feed myself as I fed Hannah. This meant I had to change my school shirt because Hannah thinks porridge is for decoration only. I wish that had been the only incident today, but it wasn’t. As soon as I caught up with Allie and June at the school gates, I just knew something was wrong... As soon as the bell rang for lunch break I launched myself out of my seat and hurried out of Spanish class as if the hounds of hell were nipping at my feet. I tried to hold in the tears, I really tried, because I didn’t want any of these idiots to know they’d gotten to me, but as I burst out of the school main entrance, the flood gates opened.</p><p>All the whispering and name-calling... it was horrible. I’d never had that happen to me before. Not like that. People generally liked me. I was nice! I wasn’t... well for one I wasn’t a “whore”. I cried harder as I heard boys in the year above me laugh at me as I passed them at the gates. Fingers trembling, I pulled out the phone Braden had bought me for Christmas and called my big brother. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Els, you okay?”</p><p>As soon as I heard his voice another sob burst forth.</p><p>“Ellie?” I could hear his immediate concern. “Ellie, what’s going on?”</p> <p>“Bri—” I struggled to draw in a breath through my tears. “Brian,” my cries continued to interrupt me, “Fairmont... he-he’s a fifth year and he-he told everyone he had s-s-sex with me at Allie’s birthday p-party on Saturday night.” I stopped and huddled against a garden fence now that I was far enough away from the somewhat expensive prep school my absentee father paid for me to attend every year. It was only a twenty minute walk from my parent’s home on St. Bernard’s Crescent and I was more than tempted to cut school and hide in the house for the rest of the day.</p><p>“That little shit,” Braden hissed, his anger actually radiating down the phone and into my hand.</p><p>“They’re all calling me a whore and a slut, and whispering and laughing at me. Now June isn’t speaking to me.”</p><p>“Why the hell is June not speaking to you?”</p><p>“She fancies Brian. I didn’t even... Braden I spoke, like, four words to him on Saturday night. He asked for a snog and I said, “In another reality maybe.””</p> <p>“Was there an audience when you said that to him?”</p><p>“His friends were there, yeah,” I sniffled.</p><p>“So you turned the little perv down and he started a rumor.” Braden cursed again. “Okay, where are you just now?”</p><p>“I’m going to go home. I can’t take another three hours of this.”</p><p>“Sweetheart, you can’t go home. Braebank Prep doesn’t like its pupils to cut class. Wait at the gates just now. I’ll get this sorted out.” I could tell by his tone that Brian Fairmont was about to learn you did not mess with Braden Carmichael’s little sister.</p><p>I hung up and wiped at my face, glad for once that Mum wouldn’t let me wear mascara, or any kind of makeup for that matter, until I turned fifteen. Even then, she said I was allowed to wear mascara and concealer but no foundation, and definitely no lipstick until I was sixteen.</p> <p>My friends thought she was weird.</p><p>Waiting on Braden, I felt a little better knowing he was coming to my rescue. My big brother was really just my half-brother. We shared the same father—Douglas Carmichael.</p><p>Dad was a big deal in Edinburgh, he owned an estate agency and restaurants and a lot of property that he rented out to people. He was loaded, and although he gave time to Braden, he seemed to think spending money on me was a good enough apology for neglecting me the entire fourteen years I’d spent on the planet. His neglect hurt. A lot. But I had Braden, who’d practically helped raise me with Mum, and my step-dad Clark. Mum married Clark five years ago, and since the moment he’d come into Mum’s life he’d made it clear he wanted to be my dad. And he was. More than Douglas Carmichael ever would be.</p><p>I sometimes wondered how it was possible me and Braden were spawned from him. We were both too nice to be Douglas’s kids. Take Braden for instance. After purposefully avoiding working for our father, a few years’ ago he suddenly decided he wanted to take a role in the Carmichael ‘empire’, which meant he worked his bloody arse off to make our father happy. Not only did he work a lot, he was wrapped up in this girl he was dating.</p><p>Analise. She was an Australian student and they’d just started dating. Braden seemed to really like her. Still, he always found time for me. Say, to rescue me from hideous situations like the one I was in.</p><p>“Ellie,” a familiar voice, and not the one I was expecting, caught my ear and I turned my head as a car door slammed. My eyes widened as Adam Gerard Sutherland rounded the hood of his six year old Fiat— a car Braden said was a stupid drain on Adam’s finances considering Adam was a student at Edinburgh University and getting parked in the city was a nightmare.</p><p>Adam Gerard Sutherland, by the way, was Braden’s best friend.</p><p>I’d had a wee bit of a crush on him since I was ten so I was more than a little mortified that Braden had sent him to rescue me from this situation. Not that I should have been surprised. The two of them had traded that job back and forth since I was tiny.</p> <p>“Adam,” I blanched, wiping at my face to make sure I’d gotten all the tears.</p><p>The way his dark eyes studied me and his jaw clenched, it didn’t matter. My eyes felt puffy and red and obviously were. “Braden’s sorry. He’s in a meeting he can’t get out of,” he said as he approached. He wore a clean, wrinkle-free t-shirt and faded jeans. Adam was too clean and neat to become a typical grungy student. Even his old banger of a car was clean and tidy inside. “He phoned me. I have a free afternoon. Come here, sweetheart.” Without asking, he pulled me into him and I immediately nestled my cheek against his chest and held on tight, trying not to cry.</p><p>“So where is this little shit?”</p><p>I pulled back from him, suddenly wary now that he was here and obviously furious. “What are you going to do?”</p><p>“He’s fifteen?”</p><p>“Sixteen.”</p><p>“Sixteen.” He curled his lip in anger. “I can’t hit him, but I can scare the absolute fuck out of him.”</p><p>Braden and Adam cursed a lot, and they’d always cursed a lot in front of me. Mum would kill them if she ever found out how much they cursed. Luckily for them it had been drilled into me since the age of zero that you didn’t curse in front of Elodie Nichols, and I’d never repeated the words Braden and Adam used around me. To be fair they limited their curse words to the basics—I’d heard way worse at school. Today in fact, and they’d been directed at me.</p><p>I felt my eyes start to water again.</p><p>Adam saw and his eyes narrowed. “Els, where is this boy?”</p><p>I sighed heavily. “Around the back of the building, behind the lunch room.”</p><p>“Right.” Adam strode in through the gates and I hurried after him, ignoring the curious gazes of my fellow students, and the excited chatter as they guessed that the clearly older Adam was here on my behalf and something was about to go down.</p><p>My cheeks burned with embarrassment, while my heart pounded in anticipation for a little retribution for the worst morning in the history of my entire school career.</p><p>When we rounded the corner of the building, Adam stopped and stared into a crowd of seniors. The fourth and fifth years gradually turned their heads towards us, their eyes widening at the sight of me with Adam.</p><p>“Which one?” Adam asked flatly.</p><p>“Brian is the one with his blazer tied around his waist.”</p><p>“The tall, blond kid with the bottle of juice in his hand? The one that looks like a prick?”</p><p>“That would be the one.”</p><p>“Little...” Adam growled under his breath and marched toward Brian, hands clenched into fists at his side. Brian’s friend nudged him and he turned toward Adam and instantly paled at the sight of him. When Adam reached him, he towered over Brian by at least five inches. He bent his head, his face close to Brian’s, and whatever he said made the seniors around him grow wide-eyed.</p><p>“Well?” Adam suddenly asked loudly.</p><p>Brian mumbled something.</p><p>“Louder, you lying little shit.”</p><p>“I didn’t have sex with her,” Brian cried. “I didn’t touch her!” He turned and caught sight of me watching and his eyes seemed to plead with me to call Adam off. “I’m sorry! I lied, alright!”</p><p>A murmur from the crowds drew my eyes past Brian to the lunchroom doors and my stomach dropped when I saw Mr. Mitchell standing there watching Adam. Adam must have seen him too because his head came up. He didn’t, however, back away from Brian.</p><p>“Who are you?” Mr. Mitchell asked in a belligerent tone, walking toward Adam. “You’re not allowed on school grounds.”</p><p>“I was just having a word with Mr. Fairmont here. We’re all good.” Adam shrugged as if he wasn’t a twenty-one year old who’d just gotten through threatening a sixteen year old.</p><p>“Brian, are you okay?” Mr. Mitchell asked.</p><p>“Uh, fine, Mr. Mitchell,” he gulped and took a step back from Adam toward the safe proximity of the geography teacher.</p><p>“Adam,” I called now, wanting Adam gone before he got into trouble.</p><p>I drew Mr. Mitchell’s gaze and his face clouded over. “Miss Carmichael, you know quite well you aren’t allowed visitors during school hours.”</p><p>“Sorry, Mr. Mitchell.”</p><p>“I’m just leaving.” Adam shot Brian one last warning look and then turned and casually strode toward me. Taking his time. Adam didn’t like to be told what to do. When he reached me, he put an arm around my shoulder and had me walk him back to the school gate. No one was whispering or giving me dirty looks now as we passed. They were all looking at me as if I was extremely cool. I mean, I must be right, if I had Adam Sutherland’s arm around me and he’d shown up at school to scare the truth out of Brian.</p><p>I grinned and Adam caught it, his soft laughter making me all warm and fuzzy.</p><p>“Feel better then?” he asked as we came to a stop.</p><p>“Yes. Thank you.”</p><p>“What were you doing at a party anyway on a Saturday night?”</p><p>I frowned at his proprietary tone. “I’m fourteen, Adam. It was a friend’s birthday.</p><p>Anyway, I didn’t know seniors were going to be there.”</p><p>He nodded. “Just be careful, eh.”</p><p>“Yeah.” I lowered my eyes, feeling bad that he’d been dragged into my teen drama.</p><p>“Come here.” Adam pulled me to him again and pressed a soft kiss to my forehead before he hugged me close. Now that I wasn’t bemoaning my morning and crying on his chest, I was suddenly fully aware of being crushed against him. He smelled amazing and his body was hard with lean muscle. It felt good against mine.</p><p>A weird, tingling feeling erupted in my lower belly and my skin suddenly grew incredibly flushed. I jerked back and tried to cover my awkwardness with a tremulous smile and a goofy wave. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Adam gave me a quizzical smile and then said, “Anytime you need me, you call, okay?”</p><p>I nodded.</p><p>“Okay, sweetheart. I’ll see you later.”</p> <p>“Bye.”</p><p>He grinned at me again and his grin caused another wave of weird tingling to spread over me. As I watched him get into his car and drive away it occurred to me that my crush on Adam had just intensified. My brain was no longer the only thing attracted to Adam. My hormonally-charged teenage body was now too.</p><p>Chapter 2</p><p>Adam’s brow was puckered as he lifted his head from the diary but he gave me a small, amused smile. “I don’t know how I feel about sexually awakening a fourteen year old. It’s all a bit Lolita-like.”</p><p>I laughed at his discomfort. “It’s not as if you felt the same way about me back then.</p> <p>Anyway, now that I’m yours, would you really have preferred if some other guy gave me my sexual awakening?”</p><p>Now his brow knit together completely and he glanced back down at the pages. “Good point,” he muttered.</p><p>“Here.” I handed him another diary, open to more than half-way through, and took the one with my fourteen year old thoughts out of his hands. “This is from the year after that.”</p><p>Saturday, September 23rd I am this close to screaming at Adam to stop treating me like a sister. I’m not his sister! I wish he’d just get that already... I took a deep breath, holding the mascara wand away from my eyelashes. Staring at myself in my dressing table mirror, I exhaled slowly and mentally coached myself to calm down. As much as I tried, I could not stop the wild flutter of butterflies in my belly. I gave up and leaned back into the mirror to liberally apply mascara since it was the only makeup Mum would let me wear. I had long fair eye-lashes so no one could tell how long they were until I started wearing black mascara. They were long and now that they were black they made my pale blue eyes even bluer.</p><p>Hopefully the mascara also made me look a little older because, even though I was tall, I was still skinny with small boobs and had a smattering of freckles across the bridge of my nose that made me feel about five years old instead of fifteen.</p><p>I had a date tonight. My first date. With Sam Smith who was a sixth year, meaning he was two years older than me and he was cute and cool and I really, really liked him.</p> <p>As much as I could like any boy who wasn’t Adam.</p><p>Not that Adam was a boy any more.</p><p>A knock sounded at my bedroom door as I ran a brush through my long hair for the hundredth time. “Come in!” I called, somewhat agitated since I thought it was probably my Mum, who seemed to be at once both more excited than me about the date, and also more concerned.</p><p>To my surprise, the head that popped around the door wasn’t Mum’s but Adam’s.</p><p>My heart did this little flippy thing in my chest that it did every time I saw him and I smiled brightly at him. “What are you doing here?”</p><p>He stepped inside and closed the door, his brows drawing together in consternation as I stood up to greet him. His eyes travelled the length of me and I saw a muscle tick in his jaw.</p><p>I was wearing a white sleeveless shift dress. It had a modest neckline and I was wearing a cardigan to cover my arms, and black tights to cover my bare legs, but I was guessing the short hemline still pissed him off. The reminder that he thought of me as a little sister he needed to protect pissed me off. I crossed my arms over my chest, and the movement brought his eyes back up to my face.</p><p>“Clark told Braden you had a date tonight. We both wanted to drop by for the momentous occasion. Who is he?”</p> <p>I rolled my eyes at his overbearing tone. “Just a boy.”</p><p>“And how old is this boy?” Adam asked softly as he took a few steps toward me.</p><p>“Where’s Braden?”</p><p>“Downstairs. Don’t dodge the question. How old?”</p><p>“Sam is seventeen.”</p><p>“What?” he inhaled sharply. “And Elodie agreed to this?”</p><p>He didn’t mention Clark, since Clark was far more laid-back about these things than Mum.</p><p>“She’s excited for me actually.”</p><p>“She’s chirping like a nervous chicken downstairs.”</p><p>“That’s because Sam will be here any minute.” I avoided his eyes, not liking that stubborn tilt to his chin.</p><p>“Where is he taking you?”</p><p>“Cinema, then dinner.”</p><p>“You’ll be home before eleven?”</p><p>I grabbed my purse up off my bed and threw out an exaggerated sigh. “Yes-uh.”</p><p>“And you won’t let him touch you.”</p><p>It wasn’t a question.</p><p>I froze at his command and narrowed my eyes on him as he took the last remaining steps toward me until he was standing right in front of me, so close I had to tilt my head back to meet his gaze. “It’s a date, Adam,” I whispered. “Touching is supposed to be involved.”</p><p>“Not when you’re a fifteen year old girl. Not when you’re you.” I flinched back, taking that as an insult and Adam immediately grimaced. “Els, I didn’t mean it like that. I just mean... you’re not just some girl.”</p><p>“Look, Braden gave me this speech three hours ago on the phone.”</p><p>“Ellie,” Adam gave me a look that clearly said “shut up”. “You’re special. You deserve a boy who understands that, and a boy who understands that won’t try any funny business tonight, okay?”</p><p>“Funny business?” I raised my eyebrows at him. “I’m pretty sure Sam won’t try any funny business.”</p><p>“Els, you’re a romantic, and you’re young. Boys his age... they’re not romantic. They have one thing on their mind and one thing only. And the little swine isn’t getting it from you.”</p><p>Annoyed at his suggestion I was some naïve little girl, I brushed past him. “Don’t you have a comatose date waiting somewhere for you?”</p><p>“You cheeky little bugger,” he grumbled behind me as I walked out of my room and started heading down the stairs. “I preferred you when you were wee and cute and didn’t talk back.”</p><p>I grunted at that and then inhaled on said grunt, choking, at the sound of the doorbell.</p><p>“I’ll get that,” Adam announced determinedly, but I flung out my arms and legs in a star- shape, blocking his passage.</p><p>Unfortunately, I didn’t have enough limbs to stop Clark, who hurried out of the living room wearing a glower the likes I’d never seen before.</p><p>Uh oh.</p><p>So perhaps Clark wasn’t as cool about my whole first date thing after all.</p><p>“Dammit,” I breathed, hurrying down the last few steps as Braden came out of the living room with a bottle of beer in hand. Eyes wide at his sudden appearance and the darkening of his expression when he saw my dress, I raced by him and collided against Clark’s back as he finished greeting my date at the door.</p><p>“She’s right here,” Clark said as I stumbled around him, giving him a questioning look. He was all glaring and intimidating. It was weird.</p><p>“Sam,” I breathed, feeling my butterflies explode into a flurry again at the sight of him.</p><p>Sam was as tall as Braden, although lanky and slim, and he had messy light brown hair that seemed to have a life of its own. He was famous at school for that hair. All the girls wanted to be the girl who got to run her fingers through that hair. I was hoping after tonight that girl would be me.</p><p>Sam finished eyeing Clark warily and then threw a dimpled smile my way. “Hey, Ellie.</p><p>You look great.”</p><p>“She does not.” Braden suddenly appeared behind me and Clark, and I closed my eyes in actual pain after watching Adam squeeze in beside him. They were both trying to fry Sam’s arse with the power of their eyeballs. “She looks fifteen. You remember that.”</p><p>Oh God. Kill me. Kill me now.</p><p>“If you touch her, I’ll make sure you lose all sense of feeling. Permanently,” Adam warned darkly.</p><p>“What he said,” Braden growled.</p><p>When I dared to open my eyes, my heart in my throat, it was to find Sam’s face was ashen as he stared at Braden and Adam as though they were Viking marauders come to cut off his head.</p><p>“What is all this?” Mum’s voice sent a rush of relief through me. “Get away from the door.” Adam and Braden were jerked backwards, followed by Clark, until my mum, Elodie Nichols, was left standing alone. Tall and willowy, my mum was still gorgeous, and right now she was an angel.</p><p>“Thank you,” I breathed gratefully.</p><p>She took one look at my expression and threw a dirty look over her shoulder at the retreating men. It appeased me somewhat to know that when I left on my date with Sam, the three of them would get a verbal tongue-lashing that would make their threats to Sam seem like child’s play.</p><p>When she turned back she held a hand out to my date. “Elodie Nichols, it’s lovely to meet you, Sam.”</p><p>“You too, Mrs. Nichols,” Sam replied quietly, clearly not recovered.</p><p>“Well, I’ll let you two get on.” Her eyes glistened as she tucked my hair behind my ear and leaned in to press a kiss to my cheek. “Have a great time, darling. Be back before eleven.”</p><p>“Thanks Mum.”</p><p>“You’ve got your phone?”</p><p>I nodded and quickly stepped out onto the front stoop, gently pressing Sam toward the street. He didn’t say a word as we walked away, heading for the bus stop.</p><p>“Just ignore them,” I finally advised. “They’re just messing with you.”</p><p>He gave me a weak smile and then checked his watch. “Film’s starting soon. We better hurry.”</p><p>*** I slammed the door shut behind me, trying to mentally decimate the angry tears that were determined to spring to my eyes.</p><p>“Is that you, darling?” Mum called from the living room.</p><p>Miserable and needing a mum-hug, I moped down the hall and entered the room only to draw to a surprised halt.</p><p>It was ten-thirty and Braden and Adam were still here.</p><p>Mum and Clark were in their armchairs, Braden and Adam on the couch, and all four of them were no longer looking at the television but at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I took one look at them and knew why they were here and angry tears began to fill my eyes.</p><p>“How did your date go?” Mum asked, her question faltering as she took in my expression.</p><p>“Awful,” I bit out and returned my glare to Braden and Adam. “He’s not asking me out again because of these two idiots.”</p> <p>“Good,” Braden responded flatly. “You’re too young to be dating.”</p><p>Mum sighed. “She’s not too young.”</p><p>“She’s too young,” Adam agreed. “And look at what she’s wearing.”</p><p>“There’s nothing wrong with what she’s wearing. She’s got tights on.”</p><p>“She’s fifteen,” Braden argued. “She’s got plenty of time to go on dates. She should concentrate on school.”</p> <p>“Oh you sound like an old fart, Braden.”</p><p>“I can’t believe your attitude, Elodie,” Adam sighed. “I thought you’d be more careful about this stuff.”</p><p>“Careful,” Mum spluttered. “It was a date.”</p><p>As they squabbled on, my anger had time to grow and seethe, and the humiliation to fester.</p><p>The nicest, cutest, coolest guy at our school had asked me out on a date and my brother and his best friend had ruined it for me. “I liked him,” I suddenly informed them, quietly but with an edge that halted their conversation. They all looked at me and a tear slipped down my cheek as I said, “I really liked him. You both ruined it and you don’t even care.” Chest aching with the pressure of my hurt, I whirled and raced for the stairs, ignoring Braden calling my name.</p><p>“I’ll get her,” Adam told him which made my legs move faster up the stairs. I banged my bedroom door shut behind me and threw myself on my bed, hiding my face in my pillow as I cried into it.</p> <p>I heard the knock over the sound of my muffled sniffling and lifted my head just enough to growl, “Go away.”</p><p>I tucked my head back into the pillow and waited.</p><p>Since I knew how tenacious Adam was it didn’t surprise me when he ignored my command. I heard my door open and the creaks of the floor as he walked over to the bed. The bed dipped on my right side and I heard Adam sigh.</p><p>“I’m sorry,” he apologized, his voice deep with sincerity. “Sweetheart, I’m sorry.”</p><p>I didn’t say anything, my throat burning even deeper when it occurred to me this was the first time Adam had ever hurt me.</p><p>“Els.”</p><p>I turned my face on the pillow so I could see him. I ignored the worried look on his young, gorgeous face and told him stonily, “Just go away, Adam.”</p><p>He ran a hand through his hair, turning more fully toward me. “Look, I feel like shit, Els. I didn’t mean to ruin your night. Neither did Braden.”</p> <p>“Oh I’m sure when you threatened sensory deprivation you had no intention of ruining my chances with Sam.”</p><p>“Jesus,” Adam huffed. “You are too smart for your age. It’s like arguing with a grown woman.”</p><p>“How would you know what it’s like to argue with a grown woman? You never stick around long enough to do something to piss them off.”</p><p>His mouth twitched at my response and he shook his head. “Jesus,” he repeated.</p><p>After a minute of silence, Adam turned his head to look down at me again. His expression was no longer amused. In fact he looked deadly serious. “If this kid dumped you because he’s not man enough to deal with some familial concern, then he’s not the kind of boy you want to be with.”</p><p>The word “familial” pushed that little button inside of me and I knew when I glared at him this glare was colder than any that had come before it because it made him stiffen with surprise. “You’re not my brother, Adam.” I snapped. “Stop acting like it.”</p><p>I felt a slash of pain across my chest at the hurt expression in his eyes, guilt instantly making me want to cry even more. “I know that, Ellie.”</p><p>Our eyes met and held, and my awareness of him caused my skin to flush. “Do you?” I murmured a little breathily.</p><p>Something flickered in his gaze and he stood up, looking uncomfortable. “I’ll leave you alone for a bit. I just wanted you to know I would never intentionally hurt you.”</p><p>When I didn’t say anything, Adam exhaled wearily and left.</p><p>As he was closing my door I heard Braden’s voice right outside it. “She okay?”</p><p>“She’s pissed off. Let’s just leave her alone for a while.”</p><p>“I want to speak to her.”</p><p>“Braden—”</p><p>“I’ll get you downstairs,” he cut him off, opening my door and closing it behind him as he stepped inside. Braden’s concerned eyes locked on me as he strode toward my bed.</p><p>“Els, sweetheart,” his voice was gruff as he sat down. “I’m so sorry.”</p><p>At that I burst out crying and launched myself against his chest, letting his strong arms hold me tight and his soothing murmurs calm me.</p><p>Chapter 3</p><p>“You forgave Braden?” Adam frowned, holding the diary out to me.</p><p>I shrugged, taking it back and putting it next to the one from the year I was fourteen. “You hurt me more. Not intentionally, of course, but I wanted you to see me as a woman, not a girl.”</p><p>Adam gave me a look that suggested I was daft in the head. “You were a girl. You were fifteen.”</p><p>“So you never saw me that way then? Not that night... in my little dress,” I teased.</p><p>“Not then,” he admitted softly as if worried he’d hurt my feelings. “You were still Braden’s wee sister then.”</p><p>I wasn’t hurt. I had retrospect on my side, and frankly I’d find it somewhat concerning if Adam had fancied my lanky, boob-less fifteen year-old self. Still, I was curious. “When did it change for you?”</p><p>I was treated to another “are you daft?” look. “I’m not telling you that.”</p><p>“Why not?”</p><p>“Because it’s a guy thing that you won’t get and it’ll probably piss you off.”</p><p>Okay, now I was definitely intrigued. “I won’t get annoyed. Just tell me. Please,” I begged sweetly.</p><p>“Fine.” He eyed me warily. “It was the morning after your eighteenth birthday.”</p><p>My eyes widened as I remembered. Seriously?</p><p>“The morning on which you oh so casually told me you’d just lost your virginity.”</p><p>That was the moment he realized he had feelings for me? Jeezo... Joss was right. Men were such cavemen. As that morning came back to me in vivid detail I gave a huff of laughter as I now replayed the whole thing but with the realization that Adam had been jealous. Wow.</p><p>That was not how it had appeared to me at the time. “I knew you were mad at me but I thought it was another overprotective “big brother” moment.”</p><p>“Nope.” Adam shook his head grimly, leaning back on the palms of his hands. “It was an “I’m looking at my best friend’s wee sister who’s just told me she had sex for the first time and I can see her swollen mouth and her bed hair and I’m getting fucking turned on”</p><p>moment.” His eyes locked on my mouth as he remembered. “My body reacted to what you’d said before my brain did. I suddenly wondered what your lips felt like, how you’d taste, what it would feel like to have your long legs wrapped around my back as I thrust into you...” I squirmed, feeling my skin heat at the knowledge that Adam was thinking those very appealing thoughts so long ago and I hadn’t had a clue. “Then I got pissed off. At myself for feeling that way about you. And then at the guy for having tasted you. And then at you... for letting him taste you.”</p><p>Our eyes locked and I felt my breathing grow shallow.</p><p>I knew if I didn’t say something else we’d end up making love in his spare room before we could finish our trip down memory lane and frankly I was enjoying the trip. I cleared my throat and grabbed up the next diary, hurriedly flicking through it.</p><p>I found the entry I was looking for and handed it to Adam. “You should know,” I murmured softly, “That it all comes back to you.”</p><p>Sunday, April 30th I lost my virginity last night. To Liam. It wasn’t how I’d wanted it to be. It hadn’t been with who I wanted it to be with. It hadn’t been with someone I loved like I’d always promised myself it would be. And it hurt. And then it didn’t. In fact it wasn’t bad at all. But something else hurt last night, and unlike sex it didn’t stop hurting. It hasn’t stopped hurting... The function room at the Marriott Hotel was absolutely packed and as I looked around I realized that I didn’t even know some of these people.</p><p>Still, it was some turn out and Allie had pronounced my eighteenth birthday party a total success and it wasn’t even over yet. Braden had hired the room at the hotel as well as a DJ and caterer. My family had invited more family as well as their friends who invited their friends, and I invited my friends who invited their friends who seemed to have invited their friends. It was a crush, the buffet was almost gone, and the dance floor was full.</p><p>I watched catering staff come out of the back room with fresh trays of food and I scowled as one of the pretty girls was stopped by Adam as she passed. Whatever he said made her laugh and tilt her head flirtatiously. I watched them, ignoring the burn of jealousy in my throat.</p><p>“Have I told you tonight how sexy you look?”</p><p>I was pulled back into a warm body and I lifted my chin, turning my head slightly to look up into Liam Fenton’s handsome face. He was smiling down at me, his eyes glittering a little.</p><p>He was buzzed, but not drunk like Adam who’d started “getting happy” an hour before the party even began. As per usual he’d turned up alone. From the cracks I’d heard Braden making for years, Adam was a total player and I’d never met a single girl he’d dated.</p><p>Probably because he didn’t “date”.</p><p>Liam on the other hand appeared to be trying to keep his wits about him. I think I knew why. He was nineteen, a student at Napier University, and we’d met when I’d toured the university last year. We’d kept in touch, chatting online, until seemingly out of the blue Liam asked me out on a date six weeks ago. We’d messed around a little bit (and he’d given me my first orgasm) but I’d been reluctant to have sex with him. I’d filled my head with so many romance novels and movies I was convinced that my first time would be with someone I was in love with. Although I liked Liam and I was attracted to him, I wasn’t in love with him yet. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>However, I think he thought because I’d turned eighteen that tonight was going to be the night. Hence why he was trying to stay as sober as possible.</p><p>I felt a little nervous about how I was going to disabuse him of that notion.</p><p>Smiling up at him, I gave him a shy nod. “You may have mentioned it once or twice.”</p><p>Liam grinned, his hands sliding down to rest on my hips. “It’s worth mentioning more than once. Every guy in here thinks I’m a lucky bugger and they’d be right.”</p><p>His lips touched mine and it was nice. Really nice. But since my first kiss with Pete Robertson at a Friday bowling night with friends a few months after my disastrous date with Sam, I’d never felt what all the romance books talked about. I’d kissed five guys since then and not one of those kisses made my skin hot and my body vibrate and my stomach flutter. I was beginning to think romance novels might be leading me astray... “Don’t mean to interrupt but I’d like a dance with the birthday girl.”</p><p>I immediately broke away from Liam at the sound of Adam’s voice and turned fully to find him standing in front of me, giving Liam a “you have five seconds to get your hands off her before I break your face” look. It had been two and a half years since I started dating and Adam and Braden still rejoiced in scaring the crap out of my boyfriends. Thankfully, Liam didn’t scare easy.</p><p>He squeezed my hips. “I’ll go get you another drink. I’ll be over with Allie and the guys.”</p><p>I nodded at him, watching him saunter away through the crowds.</p><p>A warm hand on my wrist drew my gaze back and Adam was grinning at me as he pulled me into him. As soon as my body brushed his I felt that familiar tingling again, the feeling descending between my legs as Adam’s arm caught me around the waist while his other hand caught my hand and laid it against his chest. I rested my other hand on his shoulder and swayed with him. Being this close kind of hampered my breathing and I tried very hard not to let him see that. His fingertips brushed the bottom of my back and since I was wearing a backless dress it was a skin to skin touch. My body reacted to it in a way I recognized and I ducked my head, unable to look at him.</p><p>I’d been in Liam’s dorm room two weeks ago and we’d been making out and touching.</p><p>The touching got a little more involved than I was used to but I was curious so when he slid his hand under my skirt and pushed his fingers under my underwear to touch me there I’d almost come off the bed. I felt it between my legs and I felt it in my breasts. He’d settled a thumb on my clit and played me as my body slowly started to fracture until it eventually broke into this amazingly pleasurable explosion.</p><p>Adam didn’t even need to put a hand between my legs. All he needed to do was touch me and those familiar tingles were vibrating throughout me.</p><p>“Enjoying your birthday?”</p><p>I turned to gaze at him now, my face close to his. I was five foot nine so usually only a couple inches shorter than Adam, but tonight I was wearing four inch heels so I was actually just little bit taller than him. That thought seemed to occur to him too because he gave me a quick once over and grinned, shaking his head as I replied, “Yeah, it’s been good.”</p><p>“Have you opened any presents yet?”</p><p>“No. I was going to later but I think everyone is a bit too drunk to care. Including you.”</p><p>“Pfft, I’m not drunk. I’ve got a buzz going that’s all.” His eyes narrowed. “You’re not drunk are you?”</p><p>I rolled my eyes. “Adam, I’m legally allowed to drink now.”</p><p>“Is that a yes or a no?”</p><p>“I’ve had a couple of shots, that’s it.”</p><p>We were quiet a moment and I actually allowed myself to relax against him. That was until he flexed his fingers against my back and an involuntary shiver rippled over me. Adam tensed, as if he’d felt my reaction, and I quickly looked at his face for confirmation. His dark eyes glittered in a way I’d never seen before.</p><p>I gulped.</p> <p>He studied me a moment and I found myself pressed even tighter against him. My fingers curled into his shoulder. His next words almost blew me off my feet. “You’re the most beautiful thing I’ve ever seen, Els,” he said, his voice thick with emotion.</p><p>My eyes grew round with shock at his announcement, my heart beginning to thud against my chest. Adam thought I was beautiful? No, not just beautiful... “the most beautiful thing he’d ever seen”.</p><p>Wow.</p><p>Okay.</p><p>My chest began to rise and fall a little rapidly. “Adam...” I replied softly, unsure whether he meant that in a strictly platonic sense or if he was finally opening his eyes up to see I wasn’t a little girl anymore. For a start I had boobs now.</p><p>“I worry about you all the time,” he confessed. “You’re so sweet and kind, too kind sometimes. I worry someone will hurt you and I won’t be there to stop it.”</p><p>It was true I had a tendency to look for the best in everyone, and I had a bit of a hero- complex (I wonder where I’d picked that up from), but I wasn’t incompetent. And I was a woman now. I could take care of myself, and I told him so.</p><p>Adam frowned. “That’s not what I mean. You get a lot of male attention, Ellie, and sometimes it’s difficult to weed out the wankers. For instance the kid you came with tonight.</p><p>He flirts a lot... with everything that has tits and a pair of long legs.”</p><p>Glowering at the insult to Liam, I tried to press back. “Liam is a nice guy.”</p><p>“Liam is after one thing. I should know—”</p><p>“Right, you’ve been hogging her enough.” Braden was suddenly standing beside us, grinning. “I want a dance with the birthday girl.”</p><p>Adam tightened his hold on me and then as if it occurred to him what he was doing, he threw Braden a grin and let me go. We shared one last look and then he was gone and I was in Braden’s arms.</p><p>What the hell had just happened? Had Adam Sutherland... was he... was that more than friendly advice? The way he touched me, the things he’d said, the way he’d looked at me. It had felt different. My heart was racing, a bubble of giddy hope starting to float up inside of me. Poor Liam was forgotten as I got lost in my longing and fantasies.</p><p>“I’m proud of you,” Braden told me gruffly, bringing me out of my head where I was already picking wedding dresses and deciding who would be my maid of honor. I guessed it would have to be Allie since I’d known her the longest.</p><p>I smiled at my big brother, feeling my chest expand at his declaration. “What for?”</p><p>“For many reasons. For getting into Edinburgh Uni. For taking care of Elodie and Clark, and for being a good sister to Hannah and Dec. And for being a great wee sister to me. It’s been a tough year, Els, and I’m grateful for all your help.”</p><p>I hugged him close for a second, my heart hurting all over again for him. After falling for and marrying his Australian wife, Analise, Braden had filed for divorce when he walked in on her and his old school friend having sex in one of Braden’s empty developments in New Town. The bitch had put him through the ringer for the last nine months of his marriage and then she’d cheated on him with his friend. It was the ultimate betrayal. Worse, our dad had been the one who’d cottoned onto it and he’d set Braden up to find the traitorous couple. That was dad’s way. Rather than pulling his son aside and letting him down easy, he’d let Braden walk into that. Braden didn’t seem to mind. In fact he was grateful to our father. I, on the other hand, thought he was an insensitive arsehole. Then again, I didn’t exactly have fluffy feelings toward Douglas Carmichael at the moment (or ever).</p><p>As if he’d read my mind, Braden sighed. “Dad’s sorry he couldn’t be here, Ellie. I’m sorry too.”</p><p>“Don’t apologize for him.” I turned my face away, screwing it up to stop the tears. You would think after eighteen years of complete neglect I’d be over the hurt by now.</p><p>Unfortunately, the hurt never went away. I just couldn’t understand what Douglas found so unloveable about me that he’d deliberately shun me time and time again. It was my eighteenth birthday for God’s sake and he couldn’t get up off his rich arse for half an hour to pop into offer me birthday wishes.</p><p>Braden sighed again and I heard him curse under his breath. He had a fairly good relationship with our dad now and I didn’t want to be the cause of any problems between them so I gave him a squeeze and smiled at him. “I’m fine. I’m more than fine. I’m surrounded by friends and family who care about me, Braden. And that’s all I care about.”</p><p>We shared a smile and another hug seconds before the music changed to up tempo again, and mum and Clark descended on us. I had a dance with the two of them, giggling as they pulled out moves that hadn’t been seen in at least two decades.</p><p>As the night continued on, I mingled with friends and family but my eyes kept wandering through the crowds in an attempt to find Adam again. My stomach was a riot of butterflies, and I couldn’t get his voice out of my head.</p><p>“You’re the most beautiful thing I’ve ever seen, Els,”</p><p>I smiled at something Allie said to Liam and watched it crack him up but I had no idea what the conversation was about. My head was stuck in rewind.</p><p>When the room began to feel too hot, I ordered a bottle of water from the bar and slipped out of the back of the room and found directions to the exit. It was the fire exit and it led out to the back of the hotel where all the rubbish bins were stored. I crept outside quietly, sucking in a huge gulp of air and enjoying the peace. It could give me a moment to wrap my head around what had happened and if what I thought had happened had actually happened.</p><p>I felt a giddy smile start to stretch my lips when a grunt followed by a moan made me freeze. The large wheeled bins were situated between me and an alcove of the building, and the sounds were coming from there. My heart picked up a little bit as I guessed what the sounds meant and what I’d stumbled upon. When another grunt sounded I covered my mouth with my hand to keep in the giggle that was threatening to erupt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes,” a female voice groaned. “Adam, oh my God.”</p><p>The giggle instantly died as the blood rushed in my ears. I felt a burn in the bottom of my throat as some devil, some masochistic thing inside of me, made me tiptoe silently around the bins.</p><p>All the hope I’d been feeling exploded and disintegrated around me.</p> <p>As I watched Adam screw one of the female catering staff against a brick wall, I realized what an idiot I was. What a childish, naïve idiot.</p><p>And then the anger settled in. The frustration. The pain... that somehow I wasn’t good enough. Not good enough for Adam. Not good enough for my father.</p><p>My eyes narrowed. There was one person who thought I was good enough, so what was I holding out for? For flowers and sonnets and a man on bended knee? That wasn’t going to happen. This was reality. Sex was sex. There was nothing magical about it.</p><p>Clearly.</p><p>I wasn’t naturally an angry person, but the burn of jealousy fueled it and I turned silently back to the hotel. As soon as I was inside, the image of Adam moving against the catering girl kept flashing before my eyes. I felt sick. Chugging back more water, I made a decision. I needed to wipe that image out of my brain.</p> <p>I found Clark talking to his brother in the function room and thankfully Mum wasn’t anywhere around because what I was going to ask she’d probably not be happy about.</p><p>“Els, what do you want to do with all these presents?” He asked, pointing to a table that had been set up at the back.</p><p>“Can I ask you and Mum a big favor?”</p><p>He smirked, guessing what that favor was. “You want us to take the presents back home for you?”</p><p>“My friends and I want to go onto a club, if that’s okay?”</p><p>Clark studied me for a moment and then finally sighed, “Go on before your Mum sees you. And be careful.”</p> <p>I nodded and gave him a quick kiss on the cheek. Leaving him to it, I pushed my way through the dance floor and found Liam and Allie dancing together. I pulled Liam off to the side with an apologetic smile thrown Allie’s way.</p><p>“What’s up?” he asked, giving my hip a squeeze.</p><p>I looked into his eyes, feeling my stomach flip as I said meaningfully, “Let’s go.”</p><p>His body tensed and his eyebrows drew together. “Just me and you?”</p><p>“Yeah.”</p><p>“Where do you want to go?”</p><p>I pressed close to him, making my intentions very clear. “Where do you want to take me?”</p><p>Liam’s breathing stuttered. He seemed to swallow hard. “I could get us a room.”</p> <p>“Okay then.”</p><p>We left quickly, slipping from the party before Mum or Braden could see me. My nerves kicked in as we made our way through the hotel to the reception, and I fought hard not to throw up as Liam booked us a room.</p><p>Every inch of me was trembling as the lift took us up to the first floor and as soon as we were inside the room and Liam started kissing me he could feel me shaking against him.</p><p>“Are you sure about this?” he whispered against my mouth.</p><p>The image I was unsuccessfully trying to bleach from my brain flashed before me again. I wanted tingles and excited butterflies, I wanted flushed skin and passion. I wanted trust and safety, I wanted affection and laughter. I wanted loyalty and friendship. I wanted love.</p><p>Unfortunately, life had played a cruel joke on me and I’d fallen in love with the one person in the whole world I couldn’t have.</p><p>Just because I couldn’t have him, however, didn’t mean I shouldn’t live. None of my friends were virgins any more. What was it really but a nuisance? It used to be a gift. Or at least I liked to romanticize that it was a gift. I supposed what it really used to be was a mark of ownership. But this was the 21st century. No one owned me. And my virginity was something I could give to whoever I pleased.</p><p>“Yeah,” I whispered back, reaching up to unknot the halter tie on my dress. “Yeah, I’m sure.”</p><p>Liam thankfully took his time. He made me come before he put on a condom and pushed inside of me so I was as ready as I could be. Still, it hurt. After a while the pain diminished and it felt okay. Liam enjoyed himself. He tried to hold off until I came again but I didn’t. I couldn’t stop thinking over and over again as he moved inside me that I’d well and truly buggered everything up for myself.</p><p>I’d promised myself since I was fourteen years old that the first time I made love I’d be in love.</p><p>Instead I was lying in some hotel room while a boy I merely liked casually took the gift I offered, and I casually let him. I felt a heaviness settle on my stomach when Liam was finished.</p><p>I stayed awake listening to him snore beside me and cursed myself to hell for letting anger and jealousy get the better of me.</p><p>*** I lay there for a couple of hours but eventually decided I couldn’t stand to stay in the hotel room. At the back of four in the morning I snuck out of there and had reception call me a taxi.</p><p>The woman on reception took one look at my mad hair and revealing dress and knew exactly what I’d been up to. The smirk she gave me made me feel cheap, and I realized quickly that the only reason I felt cheap was because I thought I’d acted cheap.</p><p>I tried not to cry as the taxi took me home, and I definitely tried not to cry as I quietly let myself inside. I was just creeping toward the stair when a head popped out of the kitchen and gave me heart failure. I sucked in a breath, clutching a hand to my chest in fright.</p><p>Adam stood in the light from the kitchen doorway. He crooked a finger at me and as I approached him I saw that image again of him and caterer girl, and the anger returned.</p><p>I followed him into the kitchen and he closed the door behind me. I studied his face and saw his eyes were bloodshot. The smell of coffee filled the air and I noted cheese toasties sitting on a plate. He was obviously hungover and trying to diminish the affects. I was so busy noting these things that I didn’t notice his anger.</p><p>“Where the hell have you been?” he hissed at me.</p><p>I glowered at him, momentarily blaming him for the loss of my virginity. “Out.”</p><p>“Where?”</p><p>“Just out.”</p><p>He narrowed his eyes. “With who?”</p><p>“Liam.”</p><p>Adam’s face instantly darkened and he took a step toward me, his eyes moving over my messy hair and then coming to rest on my mouth. They stuck there until I touched my lips, wondering what was so fascinating about them. “What were you doing?” he finally asked, his voice gruff.</p><p>And that was the point in the interrogation I lost my temper. My loss of temper transformed into blasé petulance. “I’m eighteen, Adam. I can have sex with my boyfriend.”</p><p>His body jerked, like I’d shot him. “Sex?” he choked out.</p><p>I shrugged as if my heart wasn’t hammering against my ribcage. “It was a present to myself.”</p><p>He swallowed, his eyes roaming over me again. “Are you telling me... you lost your virginity last night?”</p><p>I nodded slowly, hearing an edge in his words I was a little bit afraid of.</p><p>Adam’s eyes flared after my confirmation and I stood there squirming as he drank me in from head to foot. I flushed at his appraisal, not quite sure what was happening. And then he made it clearer by turning on his heel and throwing the kitchen door open. Without a care to those sleeping, Adam stormed out of the house, the front door slamming in his wake.</p><p>I let out a shaky breath, realizing what the edge was now.</p><p>Adam thought of himself like my big brother. No big brother wanted to hear that their little sister had “gotten herself some”. More than that, I wondered if he was as disappointed in me as I was in myself. He knew me. He knew I believed in stars and sunsets and “happily ever afters”. I’d compromised my own beliefs by having casual sex with a boy I barely knew.</p><p>The tears came then and I hurried to my room with blurry vision. I grabbed some fresh underwear and pajamas and took them into the bathroom with me. For half an hour I remained in the shower, crying the entire time.</p><p>At least, I told myself, I’d learned a huge lesson.</p><p>I’d learned there were some things in life you could never take back.</p><p>Chapter 4</p><p>Adam put down the diary and looked up at me, something like regret in his eyes. I didn’t want him to feel regret, I just wanted him to know that even if my first time hadn’t been with him, I’d always wanted it to be.</p><p>“Baby, I’m sorry,” he whispered.</p><p>I frowned and shook my head. “Don’t. That’s not what... I just wanted you to know that it’s always been you.”</p><p>“But your first time should have been special, Els. It should have been romantic.”</p><p>I shrugged. “In the grand scheme of things it’s not the worst thing that happened. Dad—”</p><p>“Douglas died a few days after your birthday,” Adam murmured, finishing my sentence.</p><p>“Yeah,” I whispered back, remembering how mixed up I’d been over my dad’s death. I’d grieved, but I couldn’t work out if I was mourning the idea of a dad or if I was mourning Douglas Carmichael. To make matters worse he left me a boatload of money and it took me a while to come to terms with how that made me feel. Not to mention, “I was mad at him and he died with me mad at him.”</p><p>Adam slid across the floor and put his arm around me, hugging me close. “Ellie, I thought you stopped feeling guilty about that. He was a shit dad. You had a right to be angry at him, no matter what happened.”</p><p>I nodded and snuggled closer to him, inhaling the scent of him and his aftershave. He smelled good. He always smelled good.</p><p>We sat in silence for a while until Adam said, “Just so you know, I barely remember what I did with the catering girl. And I had no idea I said that to you at your party—calling you beautiful and telling you I worried all the time about you. Fucking mixed signals. I was pretty drunk that night.”</p><p>“I know. But in the end you were right about Liam. He ended up cheating on me with Allie.”</p><p>Adam tensed. “That’s why you stopped talking to Allie? Why didn’t you tell me?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Because you would have beaten the shit out of Liam.”</p><p>“True.”</p><p>I snorted. “Always fighting my battles for me.”</p> <p>“With you, baby. With you, not for you.”</p><p>Liking that a lot, I turned my head and kissed him, loving the now familiar press of his mouth against mine. I pulled back and cocked my head in thought. “I thought the year you started to see me differently was the one after my eighteenth.”</p><p>“The one after...?” Adam’s eyebrows drew together in thought for a minute and then instantly cleared as he remembered. “The almost kiss.”</p><p>While he’d been reading the last entry, I’d found the entry I’d expected him to allude to as to the moment he started to see me as more than Braden’s little sister. I held the diary out to him and he took it with a small smile as the memories flooded him.</p><p>Friday, July 5th Tonight I had my first truly grown-up, sophisticated and, well, HOT, date. I’m just not sure who I had it with... As Christian helped me out of the taxi I had to wonder if this was going to be “it”.</p> <p>Christian was handsome, charming, a total gentleman and he had class. He had yet to make me laugh but I was sure that would come as we became more comfortable with one another.</p><p>He smiled at me again as I pushed the hem of my black dress back down. It had shimmied up while I was sitting in the taxi. “You look stunning.”</p><p>I flushed. When he looked at me like that I felt stunning. I was wearing a plain black sleeveless dress that should have been somewhat modest considering its high neckline and mid-thigh hemline. However, the dress hugged every inch of my body leaving little to the imagination. It was a sophisticated dress with a splash of “hot”.</p><p>I’d bought it earlier that day specifically for Christian.</p><p>We’d met a week ago in the student union. Christian was pre-law, two years older than me and from an obviously wealthy and well-to-do family. They had an actual “estate” in the highlands. That had nothing to do with what attracted me to him of course. I was attracted to him and how he’d acted upon our first meeting— with a fresh and open honesty that really appealed to me. It made me feel like I could be just as open with him. It made me feel like I could be myself.</p><p>Christian had told me that although his family had the estate, they also had a home in Corstorphine, a busy suburb out in the west of the city. His parents had bought it when his sister had moved to Edinburgh and started popping out children. She was pregnant with her third and the entire family was living in Edinburgh to be closer to her. I thought that spoke volumes about them and was more than a little excited to meet them already.</p> <p>To my delight, Christian had booked us a table at La Cour for our first date. I didn’t even get a chance to tell him it was Braden’s restaurant. He inherited it from our father. As we entered I opened my mouth to tell him but Christian started speaking about the menu and what he thought I should order. I was going to tell him I knew what I wanted to order, since I’d eaten at La Cour more times than I could count, when I heard Adam call my name.</p><p>Christian and I drew to a halt as the maitre’d led us to our table, and I turned my head to see Adam sitting in the center of the restaurant across a small table from a gorgeous brunette.</p><p>I ignored the flare of jealousy, squashing it, and reminded myself I was on a date with a fabulous man, and that the gorgeous brunette was just one of many sexual partners for Adam.</p><p>He was a manwhore.</p><p>But he was my manwhore, and I couldn’t help but walk over to him, Christian at my side, with a huge smile on my face, because as always I was delighted to see him.</p><p>Adam grinned up at me, his smile dimming slightly as his gaze flickered to Christian. He gave Christian a once over and then turned those beautiful eyes of his back on me. He perused me with a small smile and when his eyes hit mine they were full of tenderness. “You look absolutely stunning, Els.”</p><p>I didn’t just flush at his compliment, I burned. “Thank you,” I murmured and then gave his date a polite smile. “Hullo.”</p><p>She glared at me.</p> <p>Oh well.</p><p>“Adam, this is Christian.”</p><p>Adam gave Christian a taut nod and then flicked his hand to his date. “This is Megan.”</p><p>“It’s Meagan,” she corrected him waspishly, pronouncing it like ‘mee-gan’ instead of ‘meh-gan’.</p><p>I saw Adam stifle a long-suffering sigh. Uh oh. His date obviously wasn’t going well.</p><p>“We better get to our table.” Christian gently pulled on my elbow.</p><p>I gave Adam another smile. “Enjoy your evening.”</p><p>“You too, sweetheart.” I moved to follow Christian but had only taken a step to walk away when I felt a tug on the hem of my dress. I glanced down, frowning, and watched Adam pull off the price tag. I blushed as he winked at me.</p><p>I closed my eyes briefly. I’d left the price tag on. I was always doing stuff like that. God, I hoped Christian hadn’t seen it. Opening my eyes I deliberately ignored Adam’s date and mouthed a heartfelt “thank you”. He grinned at me and I smothered a laugh at myself before hurrying to catch up with Christian at our table across the room.</p><p>“Who was that?” Christian asked casually as we were seated.</p><p>“My brother’s best friend,” I replied equally casually. “We grew up together.”</p><p>Christian nodded and then ordered us white wine. I preferred red.</p><p>We chatted as we waited for the waiter to return, and Christian told me all about a charity he was organizing. He stopped talking when the waiter came back and he began to order my food for me. Deciding to think this was charming rather than overbearing I informed him this was my brother’s restaurant and that I knew what I wanted. He was impressed that Braden owned La Cour and for five minutes I told him about Braden’s other businesses.</p><p>After that we were back onto Christian.</p><p>By the time the second course arrived, my hope for this being “it” was diminishing rapidly. Not once did my date appear to take any real interest in me, and the more I realized how self-absorbed he was, the more aware I became of Adam sitting across the room from me. Adam whose eyes glittered with interest every time I opened my mouth.</p><p>I had just picked up my fork to take a bite of my steak when a phone rang. Debussy.</p><p>Really? Even his ringtone was pretentious.</p><p>Yes, by this point the shine had definitely worn off.</p><p>Christian pulled the phone out of his pocket and answered it, his eyes going wide. “I’ll be right there.” He put the phone back in his pocket and stood up.</p><p>I stared up at him in absolute shock. Was he about to leave me here? In the middle of a date?</p><p>“My sister just went into labor,” he explained, and I watched as he threw a wad of cash on the table. “Stay, finish your meal.” He leaned down and pecked my cheek. “I’ll call you.”</p><p>And then he was gone.</p><p>I couldn’t exactly hate him because he’d abandoned me on our first date to go be by his pregnant sister’s bedside. At that thought I slumped against my chair. Christian was obviously a good person. He just also happened to be incredibly self-involved. It occurred to me he’d been the same way at the student union last week but I’d twisted it in my overly romantic little head and called it open and honest.</p><p>I looked at my food glumly.</p><p>A hand came down on the back of my chair and a shadow appeared above me. I glanced up to find Adam bending over me, a scowl on his face.</p><p>“Where the fuck did he go?” he growled.</p><p>God, I loved him.</p><p>“His sister went into labor.”</p><p>Adam relaxed but didn’t move.</p><p>“I’m okay,” I promised him. I wasn’t okay. I wanted to cry. And he knew it.</p><p>He straightened and called out to one of the waiters by name. “Can you move us to a larger table?”</p><p>“Of course, Mr. Sutherland.”</p><p>“Adam, no,” I protested. “I’m not crashing your date.”</p><p>He grabbed my hand and pulled me up. “You got all dressed up, sweetheart. At the very least you’re going to get to finish your meal.”</p><p>Holding my hand, Adam led me to the new table and gave a jerk of his head to his date to tell her to come to us. He sat next me as Meagan took the seat across from him, her green eyes flashing with annoyance.</p><p>“Ellie’s joining us,” Adam informed her, his tone brooking no argument “Sorry,” I mumbled apologetically to her.</p><p>“Don’t apologize,” Adam replied firmly. “You’ve nothing to apologize for.”</p><p>The waiters quickly brought over our plates and as we dug in Adam asked me about Christian.</p><p>“Well.” I sighed after swallowing a piece of tender meat. “Up until forty minutes ago I thought he was perfect. Forty minutes ago I didn’t know he’d try to order my food for me or talk incessantly about himself.”</p><p>Adam grinned. “Was it about his hair? I bet he could get a good forty minutes out of how long it took him to get that quiff just right—what styling mousse he uses and why, the amount he uses in order to get just the right amount of height and curvature...”</p><p>I was giggling like an idiot as he continued to tease me. It was true. Christian had a rather large quiff. Forty minutes ago I’d thought it spoke of his individuality and style. Now, I was guessing Adam was right. The man probably spent more time on his hair than I did and that was never a good thing.</p><p>Throughout the meal Adam made me laugh until I forgot all about my ruined evening. It wasn’t until the waiter came to take our plates away and offer us the dessert menu that I remembered Meagan was even there. She reminded us by scraping her chair back and glaring at Adam. “I just remembered I have an early morning. Thanks for dinner, Adam. I’ll see you around.”</p><p>Before Adam could say anything she’d turned on her designer heels and stormed out of the restaurant.</p><p>I instantly felt terrible. Adam and I hadn’t included her in our conversation at all. It was such a shitty thing to do.</p><p>Adam must have recognized my guilty expression because he shook his head at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Don’t feel bad, sweetheart. She started complaining the moment I picked her up. If I was rude, it was only in retaliation.”</p><p>I gave him a sympathetic smile. “Looks like we saved each other from crappy dates then.”</p><p>He grinned. “Looks like.” His eyes dropped to the menu. “Now, what are you having for dessert?”</p> <p>“We don’t need to,” I told him quietly. “We could just pay up and I’ll go home and let you get on with your night.”</p><p>His eyes rose to meet mine and he gave me an “are you daft?” look. “Els, shut up and pick a dessert.”</p><p>I swallowed a smile and lowered my eyes to the menu.</p><p>*** We stepped out into the warm summer night, and Adam took my arm and tucked it in his.</p><p>“Where to next?”</p> <p>I blinked in surprise. We’d finished our meal and I’d just assumed I’d be going home.</p><p>“Um, where do you fancy?”</p><p>“The Voodoo Rooms is only a five minute walk away and I know the bartenders so we’ll get a seat.”</p><p>I nodded, trying to stop my heart from taking off. Adam was taking me out for a drink.</p><p>He’d never taken me out for a drink just the two of us before. Recently he, Braden and I would meet up for a drink or two but never just Adam and I.</p><p>As I walked down the street with him, arm and arm, I allowed myself the fantasy that we were a couple. That’s what other people would see when they passed us. My chest squeezed with utter longing.</p> <p>Unrequited love wasn’t nearly as romantic as the books made it seem.</p><p>“Who don’t you know in this city?” I teased in an attempt to appear normal around him.</p><p>Adam grinned. “There are a few people I’ve yet to meet.”</p><p>I snorted at that. Adam and Braden called Edinburgh “their city” and they almost meant that literally. They had acquaintances everywhere and anytime I was out with one of them we spent half our time greeting people they knew. Some might say that Adam would never have had that kind of relationship with the city if he hadn’t grown up as Braden’s best friend.</p><p>Unlike us, Adam didn’t come from a well-off family. His mum and dad were ordinary folks who never really gave the impression that they’d wanted to be parents. Adam had been an accident. Although they’d never been neglectful or cruel, his parents had been distant, and he’d spent most of his childhood hanging out at Braden’s and bemoaning the summers when Braden was off in Europe with his mother. As soon as Adam turned eighteen and moved into student housing that put him into a lot of debt, his parents had gotten on a plane and moved to Australia. He heard from them once a month. Incidentally, Braden had paid off Adam’s student debt as a graduation present, something he proudly wouldn’t accept until Braden had gotten him drunk and recorded his slurred acceptance on his iPhone. I’d heard the recording.</p><p>He’d said “Love you, mate, you’re beautiful” so many times to Braden I’d almost peed my pants with laughter.</p><p>I knew Adam well enough to know his difference in background didn’t mean anything.</p><p>Even if he hadn’t had Braden there opening all these doors, I believed with his charm and charisma he’d still be a guy that a lot of people knew, liked, wanted to be or wanted to sleep with.</p> <p>When we got to the bar and restaurant, dinner service was just finishing up and the place was crowded.</p><p>“Adam,” a bartender called to him as soon as we walked in and Adam gave him a chin nod. “I’ll get you a table.”</p><p>We followed him as he claimed a table a couple was leaving, wiping it down with a wet dishrag. The guy eyed me as I slid into the booth and then he gave Adam a smile of approval that made me blush to my roots.</p><p>“What can I get you?”</p><p>“I’ll have a Macallan and ginger ale. Sweetheart, what do you want?”</p><p>“I’ll have a mojito, please.”</p><p>Adam settled into the booth with me, his arm sliding along the back of the seat behind my head. For some reason I felt incredibly awkward and I struggled to find something to say.</p><p>“Sorry your date was rubbish.”</p><p>Adam shrugged. “I’ll just celebrate with you.”</p><p>“Celebrate?”</p><p>He gave me a small grin, looking boyishly pleased about something. I felt that look hit me between my legs. I needed help. “I’m now a registered architect.”</p><p>My lips parted on a silent exclamation and I impulsively threw my arms up and around him. “Congratulations!”</p><p>He chuckled against my ear and I shivered, loving the press of those strong, creative hands against my back. “Thanks, sweetheart.”</p><p>“Does Braden know?” I asked, pulling away.</p><p>“Yeah. He congratulated me by giving me a permanent contract.”</p><p>I laughed. That was so Braden.</p><p>Adam had gotten his practical experience to complete his qualification by working alongside Braden’s architect. This last year, however, he’d been doing the work himself and having now achieved all the qualifications and experience he required, he’d applied to ARB (Architects Registration Board UK).</p><p>“I’m really happy for you.”</p><p>“I know. That’s why I’d much rather be here with you than with Megan.”</p><p>“Meagan,” I corrected.</p><p>“Whatever,” Adam muttered.</p><p>Our drinks came and I asked him about the project he and Braden were working on now.</p><p>Adam then asked about my classes. I had chosen to study History of Art and Fine Art with grand hopes of becoming a gallery curator one day, but now that I was in the course, at the university, I was falling in love with the idea of a career in academia. Clark, who was a professor of classical history at the university, was extremely proud and excited that I wanted to follow in his footsteps. When I told Braden I was thinking of doing a phD in Art History he’d given me Adam’s “are you daft?” look, but then kissed me on the forehead and told me to do whatever made me happy.</p><p>The night seemed to speed away from us and before I knew it I was on my third mojito and snuggled much deeper into Adam’s side, laughing as he regaled me with his and Braden’s antics at work and elsewhere.</p><p>To the outside world the two of them were extremely mature young men in their mid- twenties.</p><p>I knew better.</p><p>I wiped tears of laughter from my eyes and reached for another sip of my drink. “You two are idiots.”</p><p>“Ssh, that’s a secret.”</p><p>I grinned back at him and the smile he gave me suddenly froze.</p><p>“What?” I breathed, my heart stopping.</p><p>He swallowed and shook his head. “I just sometimes wonder where the time has gone.”</p><p>“I know. We’re all grown up now,” I teased.</p><p>His eyes searched my face, his expression enigmatic. “Yes, we are,” he murmured and something about the way he said it made the air between us grow suddenly charged. I swore I stopped breathing altogether. His eyes were dark and focused and I felt the heat of his look slide sensually down the center of my body. Nervously, I licked my lips and his gaze dropped to my mouth.</p><p>My gaze dropped to his.</p><p>I don’t know which one of us moved. Me to him, or him to me? Both of us moved?</p><p>Whichever one of us it was, our faces were so close our lips were almost brushing. I could feel his breath on mine and he obviously could feel mine on his. The smell of Macallan and Adam played chaos with my hormones. My chest began to rise and fall with excited nerves and hopeful anticipation.</p><p>I moved my head that little bit closer and our lips brushed. Infinitesimally. Still, that slightest touch sent a bolt of lust straight through me.</p><p>Adam made a sound in the back of his throat and I swore he was about to close the distance between us... ...but I’d never know for sure. His phone rang in his jacket pocket throwing a bucket of ice cold water over the moment. I jerked back and watched his face cloud over as he realized what had almost happened. Jaw clenched, he reached into his pocket and pulled out his phone but it had already stopped ringing. He lifted his eyes to me and told me darkly, “Braden.”</p><p>I guessed he meant that Braden had been the one who’d called him, but I also guessed it had a double meaning. I knew I was right when he quickly paid for our drinks and put me in a taxi, abruptly ending our night together.</p><p>I was Ellie, Braden’s little sister. To Adam I would always be Braden’s little sister, and that meant I was off limits.</p><p>When I laid in bed that night I cursed Adam Sutherland to hell and back. If he hadn’t already ruined things for me before, he definitely had after tonight.</p><p>A lip brush.</p><p>One tiny lip brush and I felt that spark I’d been waiting on since I was fifteen and I kissed Pete Robertson on bowling night. Whatever guy came next had a lot to live up to.</p><p>Chapter 5</p><p>“I was freaking out,” Adam admitted. He threw me a wicked smile. “I’ve never been so hard in my life from a lip brush. I wanted to fuck you every time I saw you after that.”</p><p>I shoved him playfully, blushing. Adam was often deliberately crude because he knew it made me equal parts embarrassed and turned on. I’d always hated when people used the “f- word” to describe sex, thinking it emotionless and casual. But after Adam and I became a couple I’d discovered that when you were in love with someone and you knew they loved you back there were different levels to sex. At one end of the spectrum there was the tender, sweet, slow sex that I would call “making love” and at the other end of it there was the rough, wild, can’t-get-enough-of-you sex that was definitely the “f-word”. Adam was more than proficient in both kinds.</p><p>I thought about what he’d said and frowned. “You did a good job of hiding it.”</p><p>He harrumphed. “I don’t know about that.” He looked back at the diary and frowned.</p><p>“What ever happened to that Christian guy, by the way?”</p><p>“I let him down gently when he called to reschedule our date.”</p><p>“I would say “poor guy” but I had to endure five years of wanting you and not having you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That was entirely your own fault.” I searched for the diary I wanted and once finding it, found the entry easily since it was a night I would not likely ever forget, “Nine months before Joss showed up... it’s a perfect example of it being entirely your own fault.”</p><p>Sunday, October 23rd That’s it. I give up. I’m humiliated. Confused and humiliated. And hurt. God... hurt doesn’t even cover it... I was supposed to be spending my Saturday evening with Jenna and a few girls from uni sipping cocktails and talking about anything else but our degrees. Instead, I was in a taxi heading to Adam’s duplex apartment in Fountain Bridge. I could have walked there, but I felt a sense of urgency to get there and make sure he was okay.</p><p>And I really needed to thank him for having my back, like he always had my back.</p> <p>The last week had not been a particularly good one. That was putting it mildly.</p><p>I’d been betrayed. Again. But this time it was worse than ever. For the last five months I’d been dating Rich Stirling. For the last five months I’d thought I was dating a nice guy who worked in Glasgow for a recruitment agency. I’d only just discovered that in actuality he was a corporate spy for a competitor of Braden’s in Edinburgh. This property developer was so desperate to outbid Braden on a piece of coveted land down by Commercial Quay that they’d enlisted Rich to get close to me, to get close to Braden, to unearth Braden’s bid and offer more money for the land.</p><p>I wasn’t in love with Rich but I’d let the sleazeball into my life, into my bed, and I’d given him a piece of me. I don’t think I’d ever felt so completely stupid in my entire life. All of my friends and family kept telling me I was too nice, that I didn’t have good intuition when it came to people, that I let a-holes into my life, and I was finally starting to believe they were right.</p><p>I could close down, refuse to let people close, be smarter, more selective... but that wasn’t me, and that was somehow letting Rich win. So I refused to change and there was a tiny sense of victory in that, at least.</p><p>It still stung like a mother that I couldn’t do anything, couldn’t take some kind of retribution. So when Braden turned up at my flat — this gorgeous property on Dublin Street that he’d renovated and then allowed me to stay in rent-free — to tell me he and Adam had bumped into Rich out on the town the night before, I’d held my breath, knowing exactly what was coming. Sure enough, Braden had had to haul Adam off of Rich and take him home to calm him down and ice his knuckles. Apparently, Adam had let the whole world know how he felt about anyone betraying me. He didn’t like it. And when he didn’t like it, he’d acquaint your face with his dislike.</p> <p>As soon as Braden left I buzzed around my flat in a tizzy, wondering what I should do.</p><p>Should I call Adam and thank him? Should I go to his place and thank him in person? Should I berate him for using violence to make a point? No, that last one definitely wouldn’t wash with him. He wasn’t a violent person. In fact, although he could be intimidating and had warned off a number of bullies when I was younger, this was the first time I knew of that he’d actually gotten physical with someone on my behalf. I’d half expected him to go after Rich. Adam had exploded and stormed out of my mum and Clark’s house when Braden relayed the news to them all. Braden had told them after he told me but my throat was still tight with tears as I had to hear it a second time.</p><p>After Braden’s departure, I finally made the decision to cancel my night out with the girls.</p><p>I jumped into the shower, blow-dried my hair straight, and threw on a long skirt with a low waistband, my Uggs, and a wooly turtleneck with a cropped hem. I wanted to be casual, of course, but whenever I knew I’d be seeing Adam, I liked to remind him in some way that I was a woman with a woman’s figure. Not that it made any real impact. Despite evidence that he checked me out sometimes, Adam had been carefully platonic in our interactions since our lip brush three years ago. I had dated three guys in a bid to get over him. It never worked.</p><p>The guys just paled in comparison to him and the relationships fizzled out.</p><p>With a mind to the cold, I’d thrown on a short wool jacket over my top, along with a scarf, and I’d flagged down a taxi outside my flat. It was only as the cab was pulling up to Adam’s place that I thought maybe I should have called to warn him I was coming over. It was a Saturday night. He might have company.</p> <p>My stomach lurched unpleasantly at the thought. The last time I’d visited Adam unannounced had been four months ago, and I’d walked in on him with a girl called Vicky.</p><p>Not only was I horrified once more to play witness to one of his sexual interludes, but I’d been shocked to realize that he and my brother shared women. Not at the same time, thank God. I knew they shared (and I didn’t want to know if it was a reoccurring thing) because Braden had been seeing Vicky for three months. In an effort to soothe my severely bruised romantic notions, Adam had explained Braden and Vicky were really casual and when Vicky had said she fancied Adam, Braden had mentioned it to his friend and Adam had—la, la, la, la, la, la, la! I didn’t hear the rest of the explanation because I had indeed stuck my fingers childishly in my ears and “la, la-ed” at him.</p><p>Sex was not casual to me. Not only was I annoyed that my brother, who had once been a secret romantic, had turned into a serial monogamist, I was even more annoyed at Adam for encouraging it. I couldn’t even describe how angry I was at Vicky.</p><p>After asking the cab driver to wait a second, I pulled out my phone and called up to Adam.</p><p>“Hey, Sweetheart,” he greeted me, his rich voice filled with concern. He was clearly still worried about how I was coping with Rich’s treachery.</p><p>“Hullo,” I replied quietly, letting the warmth of hearing his voice fill my chest. “I’m downstairs. Are you okay for me to come up?”</p><p>“Of course. I’ll buzz you in.”</p><p>I hung up, paid the taxi driver and hopped out, my heart racing as I hurried to the entrance doors just as Adam let me in. My palms began to sweat as the lift took me up to his floor. It was strange but my reaction to being alone with Adam had only gotten worse over the last few years. Every time was like a first date, and yet I knew him better than I knew practically anyone.</p> <p>When the lift doors opened my eyes met Adam’s. He was standing in his doorway across the hall, his arms crossed over his chest as he leaned his shoulder against the doorjamb. He wore a plain white T-shirt and a pair of old jeans, his feet bare, his hair mussed, and he needed a shave.</p><p>He was so bloody hot it was a wonder I didn’t start hyperventilating on the spot.</p><p>I crossed the hallway to him and held out the bottle of wine I’d brought him. He took it with a quizzical smile and I sighed. “It was either a bottle of wine or a slap on the wrist.” I eyed his bruised knuckles pointedly.</p><p>Adam’s lips twitched. “Wine will do.”</p><p>I followed him into the duplex, my eyes drinking in the space as always. A large open staircase greeted you at the front entrance, leading up to two spacious bedrooms, a bathroom and an office. Beyond the staircase on the ground floor was just wide open space—a massive sitting area with floor-to-ceiling glass windows covering one wall, and at the very end of the room a stylish kitchen with an island, breakfast bar, and a dining table and chairs.</p><p>It was a luxurious property and one he could more than afford. Not only did Braden pay him extremely well, Adam had invested in his own rental properties these last two years and it supplemented his income nicely.</p><p>I took another look around the large space, smirking. Unlike my flat, Adam’s was completely clutter-free. All items were carefully chosen and had their place. In fact, if I didn’t know first-hand that he was the straightest straight guy ever (well, with the exception of Braden), Adam’s duplex might convince me otherwise.</p><p>“I think I’ll crack this open... I feel a lecture coming on.” His voice was teasing as he wandered toward the kitchen.</p><p>As I shrugged out of my jacket and took off my scarf, I tilted my head and watched his delicious arse walk away from me. The man had the most perfect bottom in the history of all bottoms. Laying my jacket over his huge corner sofa, I wandered toward the kitchen, watching as he pulled two glasses out of a cupboard and began to pour wine into them. Adam turned just as I reached him and I saw his eyes flicker over the bare skin between the hem of my top and the waistband of my skirt before quickly shifting away. I gave myself a secret smug smile. Good wardrobe choice.</p><p>“Here,” he said somewhat gruffly, handing me a glass.</p><p>Our eyes met as we each took a sip of wine, and as I lowered my glass I told him solemnly, “I came here to thank you.”</p><p>Adam shook his hand. “Ellie, you don’t need to thank me.” His face darkened. “It was my pleasure, believe me.”</p><p>“Braden said he had a hard time pulling you off of Rich.”</p><p>“He fucked with you, Els. I mean he really fucked with you.”</p><p>“Literally,” I murmured and Adam stiffened.</p><p>“Don’t,” he warned me. “I’m this close to finishing the scumbag off.”</p><p>I felt a small thrill go through me at the sincerity in his voice. I loved that Adam cared this much. He might not be willing to see me as anything but Braden’s wee sister, but it was a nice consolation prize to know he had some feelings for me. “I should be reprimanding you.”</p><p>I reached for his free hand, using his wounds as an excuse to touch him, and lifted it closer to me for inspection. His knuckles weren’t just bruised, they were swollen, and the middle one had a small, healing gash in it. I hissed in a breath. “How many times did you hit him?”</p><p>Adam stepped closer, staring at his hand in mine. “I hit the wall next to his head as a warning shot. He didn’t heed the warning, said shit he really shouldn’t have, and I think I got in four really good hits before Braden pulled me off.”</p><p>I lifted my gaze to his face, no longer feeling the thrill. “Did you leave him conscious?”</p><p>“Barely.” Adam’s eyes narrowed. “Do you care?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I don’t want you to get in trouble.”</p><p>His expression softened and he gently tugged his hand free from mine. “Don’t worry, sweetheart, according to sources I was nowhere near New Town or Rich last night. We’ve got a dozen witnesses who will all claim that I was at Bar Khol last night at the time of the said attack.”</p><p>I nodded but worried my top lip with my teeth.</p> <p>“Els, how are you really?” Adam asked softly, tentatively.</p><p>Instead of answering right away, I turned around and slowly made my way toward his comfy sofa, listening to him follow behind me. I settled on the couch and Adam sat down close to me, relaxing his arm along the back of it. Finally, I met his gaze and shrugged. “I’m an idiot.”</p><p>Adam’s eyebrows puckered and his mouth got tight. “You’re not an idiot.”</p><p>“I’m an idiot,” I insisted. “I’m stupid and naïve and... humiliated.”</p><p>He slid closer to me, his fingers touching my wrist gently in comfort. “You have nothing to be humiliated about. He’s a prick who played you. He’s the idiot. He’s the stupid fuck who’s going to look back and realize that for five months he was the luckiest bastard on this planet to be with you. He’ll regret this, baby.”</p> <p>Baby.</p><p>For a moment I forgot how to breathe. Adam had never called me “baby” before. There was something somehow intimate about the endearment. I liked it. I liked it a helluva lot.</p><p>I smiled at him. “You always know the exact right thing to say.”</p><p>“Because I only ever tell the truth. You’re one of a kind, Els. Any guy would be lucky to have you.”</p><p>I gazed into his eyes feeling his words like a caress across my body and as I stared his gaze flickered over me again, surreptitiously checking me out before he took another sip of wine. It occurred to me that perhaps all Adam needed was a push. Yes, I was Braden’s wee sister, but I was also Ellie, the girl he apparently thought the world of and admitted he thought was beautiful. Blame it on the wine or the fact that he’d stood up for me once again, I wanted him and had decided impulsively that I was tired of hiding the fact.</p><p>I let Adam make me feel better as we finished off our glasses of wine. An hour had passed before I knew it and I had kicked off my Uggs and curled up on his sofa, sitting close to him.</p> <p>His arm still rested along the back of the sofa and every time I laughed I touched his bicep or squeezed his knee. I was an affectionate person, tactile and open, but it was more than that, and Adam knew it. I could see it in his eyes as we chatted and I hoped my plan was working.</p><p>You would think hurt and betrayal would make me shy away from opening myself up and laying it all out there but I just didn’t have it in me to close myself off. It wasn’t who I was, and I definitely didn’t want to be that way with Adam.</p><p>As the hour drifted into two, I became more determined than ever that tonight things were going to change between me and Adam. I was sick of dating guys I couldn’t seem to fall in love with, and even sicker of being duped by them.</p><p>Adam was in the middle of telling me about the Skype chat he’d had with his mum a week ago and his parent’s plans to return to the UK for a few weeks in April, when I stretched my arms up, pretending to need to crack my back. The movement pulled the hemline of my top up, baring my flat stomach, and it also pushed my breasts out. When I brought my head back down and relaxed, Adam had stopped talking and I could see a muscle ticking in his jaw.</p><p>“Ellie, what the fuck are you doing?” he asked hoarsely, his voice quiet.</p><p>Although my face burned with the possibility of rejection I shrugged nonchalantly.</p><p>“Stretching.”</p><p>His gaze drifted down my body and I watched his own tense. “You know what I’m talking about. The touching, the flirting, the stretching...”</p> <p>Heart pounding I shifted closer to him on the couch until my knees touched his outer thigh. I licked my lips, nervous but completely turned on just by the mere thought of him touching me back. “I think you know,” I whispered.</p><p>Our eyes met... and clung. The air thickened between us. Adam swallowed hard. “Ellie,”</p><p>he breathed.</p><p>Holding his gaze I reached a trembling hand out and placed it on his thigh and slowly I moved it up, caressing him. It had almost reached the heat of his crotch where to my utter satisfaction and delight I watched his erection strain against his zipper, when his strong hand grabbed mine tightly.</p><p>I’d barely let out a surprised gasp when he tugged on my wrist, yanking me against him. I collapsed on him and he used my momentary disorientation to his advantage— he gripped the nape of my neck and slammed my mouth hungrily down on his.</p><p>I melted against him. Just melted.</p><p>My fingers sank into his hair, and I rearranged my legs so I was straddling his lap. My body sank into his. My mouth sank into his.</p><p>It was everything and more than I’d always imagined.</p><p>My skin burned and my nerve endings sparked and I was tingling all over. Adam tasted of wine and heat and... home. I moaned into his mouth and Adam’s arms tightened around my waist, somehow drawing me even closer, the kiss changing from passionate to dirty in a nanosecond. It was suddenly biting and wet, our tongues tangling and licking and learning every inch of one another’s mouths.</p><p>It wasn’t close enough.</p><p>As we continued to kiss, everything lost in a fog of sexual chemistry so electric I would never again doubt romance novels, I felt his rough hands on my ankles, coasting along the skin of my calves, and up the back of my thighs as he drew my skirt free of our tangle and bunched it around my waist. Those hands of his caressed my bottom, giving me a squeeze that sent a streak of heat between my legs and made me gasp into his mouth.</p><p>Adam groaned and put pressure on my hips, pushing me down on his lap so his hard-on rubbed me directly between the legs, nothing between us but denim and the thin cotton of my underwear. I sought the delicious friction, riding him until our mouths parted in brief increments to catch our breaths.</p><p>Needing closer, needing him inside of me I sank down on him and dug my fingers into his shoulders as I rubbed harder.</p><p>Adam growled and broke away from me to tug my top off. I raised my arms, our movements hurried and frantic as he divested me of my top and then my bra. He cupped my breasts in his hands and I arched my back into his touch.</p><p>“So perfect,” he murmured hoarsely, “So fucking perfect.” He captured my nipple into his hot mouth and I cried out at the rush of pleasure that coursed through me, pushing me closer and closer to orgasm.</p><p>My being so turned on seemed to fire Adam up. After I cried out I found myself flat on my back on the length of the couch and watched threw hazy, lust-blurred vision as Adam whipped off his shirt and pulled down my skirt and pants. The muscles of his ripped abs flexed deliciously and I felt another rush of wetness between my legs.</p><p>He was so goddamned beautiful it wasn’t fair.</p><p>Our lips met again as he braced himself over me, my hard nipples brushing his naked chest, my legs spread to fit him between them. He still wore his jeans, and the coarseness of the denim was sensual torture against my naked skin.</p><p>As our kisses grew even more desperate I sought what I wanted from him, finding the button and zipper on his jeans and undoing it. I pushed at his boxers, my hand sliding inside to grasp him and tug him out. He was throbbing and hot and hard and I couldn’t believe this was actually finally happening. Now I knew everything about him.</p><p>“Fuck,” he groaned against my lips, his hips thrusting as I pressed the mushroomed head of him against my clit. I let go of him to grasp his lower back, tilting my own hips up as he teased me. He kissed me again, hard, and I felt his erection slide down... I spread my thighs wider and smoothed my hands down his muscular back to push his jeans further down. I grasped his buttocks and pulled him to me. “Adam, please,” I begged.</p><p>“Adam...”</p><p>He froze. Instantly. His name on my lips bringing him out of the magical sexual fog.</p><p>Our eyes met as he pulled his head up, his body hovering over mine, his muscles trembling with tension. While I imagined my expression was one of confusion, Adam’s was one of horror.</p><p>It was a look that made me want to crawl inside of myself.</p><p>It hurt like nothing I’d ever experienced before.</p><p>He scrambled off of me, pulling his boxers and jeans up and then tossing my skirt at me to cover me somewhat. “Ellie, we can’t.” He shook his head and practically jumped off the couch, grabbing his T-shirt and yanking it back on.</p><p>I was feeling a mixture of things—confusion, hurt, sexual frustration—and so I was slow in sitting up.</p><p>“For fuck’s sake, Ellie, get dressed,” Adam snapped harshly and it took everything within me not to flinch... not to cry.</p><p>As I pulled on my clothes with trembling hands Adam exhaled. “Sweetheart, I’m sorry, I didn’t mean to...” his voice was heavy with regret.</p><p>I didn’t say anything, I just straightened my clothes and reached for my Uggs, trying to hold myself together. I couldn’t fall apart in front of him. I just couldn’t.</p><p>“Ellie?”</p><p>Finally I looked at him as I stood. He looked as heartbroken as I felt. It was a small kind of consolation.</p><p>“Ellie, your Braden’s wee sister. I can’t... we can’t...” he gestured helplessly to the couch before running a hand through his hair.</p><p>And that’s when I realized something absolutely tragic. While I thought what was happening was something borne out of affection, attraction and, yes, love, to Adam what had almost happened was something borne out of lust. He didn’t want to make love to me. He wanted to screw me.</p><p>Pain lodged itself in my throat and I knew I was five seconds from bursting into big, fat, hopeless tears. I spun away from him and rounded the couch, my long hair covering my face as I grabbed at my jacket, heading to the door.</p><p>“Ellie,” Adam called out in panic but I was already yanking his front door open. “Ellie.</p><p>Fuck!” I heard him curse as I slammed the door shut behind me and bolted down the stairwell, knowing the lift might not arrive in time for me to make my quick escape. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The tears were pouring down my cheeks as I raced down the stairs, trying to hold in the gusty sobs that were ready to blow.</p><p>“Ellie, please!” Adam was suddenly in the stairwell, his footsteps pounding hard behind me.</p><p>I ran faster, ignoring his shouts for me to come back and talk to him.</p> <p>By the time he made it out of the building I was already racing across the street toward a bus that was about to pull off. I got on it and the doors closed behind me. I sagged in relief and glanced absentmindedly at the route number.</p><p>I didn’t care where it was going as long as it took me far, far away from the biggest mistake I’d ever made.</p><p>*** There had been a few times in my teen years I’d cried myself to sleep. A couple of those times had even been over Adam. But when I was a teenager, like most teenagers, anything remotely negative seemed like the complete and total end of the world. Thankfully that flair for the drama usually disappears as you enter adulthood. It did for me anyway. So when I say I sobbed myself to sleep that night, it was without a sense of faux melodrama. The pain inside of me was real. It was genuine. It was raw.</p><p>For a good eight hours I believed that not only had I been given 100% proof positive that Adam Sutherland didn’t love me the way that I loved him, I also believed that I’d ruined us and destroyed one of my favorite things in the whole world —my friendship with him.</p><p>I barely slept and woke up early to make myself tea, sitting in my big flat alone and puffy- faced wearing mismatched socks on my feet and a broken crocodile clip in my hair.</p> <p>A pounding on the front door made me jump and sent hot tea over the rim of my mug and splashing onto my skin. I bit back a curse and placed the mug carefully on the table, scurrying out of the room and into the darkened hall.</p><p>“Ellie, open up!” Adam shouted through the thick wood. “Ellie!”</p><p>I wanted to talk to him. I wanted to somehow fix things and rewind the clock, but I knew if I let him inside the flat he’d take one look at my face and realize that I, Ellie Nichols Carmichael, was completely and utterly in love with him and that last night had devastated me.</p><p>So I didn’t open the door. I leaned against the wall in my hallway and slid down until I was sitting on the cold hardwood floor. I listened as Adam pounded my door and called my name. I listened as my phone rang in my bedroom. I listened as Adam left a message on it. I listened as he walked away... When I woke up I was curled up on the cold floor. I blinked, trying to get my bearings and as I did, everything came flooding back. I didn’t have time to dwell on it, however, because I realized what had woken me up was my phone ringing. I got to my feet with a groan, my back and neck hurting from my awkward sleeping position, and I ran into my room to pick it up. According to the clock on my phone I’d been asleep for just over two hours.</p><p>My stomach flipped at the sight of the picture of Adam on my phone. I sucked in a deep breath and answered it.</p><p>“Ellie, thank fuck,” he breathed in relief and I could just imagine him tugging at his hair in anxiety. “I came by earlier.”</p> <p>“I was sleeping. I had more wine last night so I was kind of dead to the world,” I lied.</p><p>“Els, I don’t even know where to start. I’m so sorry. God, I’m so sorry.”</p><p>“Adam—”</p><p>“I can’t lose you, Els. I can’t believe I fucked up like this but you have to forgive me. I can’t lose you.”</p><p>When he said stuff like that it made it hard to hate him. Worse it made it harder to get over him. But I knew from now on that I really needed to try. And not just say that I was going to try. I had to try. I couldn’t live my life pining after him. So I made my decision to do just that. “Adam, it’s okay,” I promised him softly. “It was a mistake. We got carried away in the moment. And I’m sorry for running out on you. I was just embarrassed, that’s all.”</p><p>I heard his heartfelt sigh of relief and attempted to force the sting of tears out of my nose.</p><p>“Els, you’ve nothing to be embarrassed about, okay.”</p><p>“Okay.”</p> <p>“So...” his voice grew even quieter. “We’re good. We’re still us?”</p><p>“We’re still us,” I managed, blinking back tears.</p><p>“I don’t want there to be any awkwardness between us.”</p><p>“There won’t be. I won’t let there be if you won’t.”</p><p>“Good, Sweetheart. Good. We’ll just forget this. It didn’t mean anything.”</p><p>I choked back the pain. “Right. It didn’t mean anything.”</p><p>Chapter 6</p><p>“It’s like a car crash,” Adam sighed, scrubbing a hand over his face as he handed me back the diary. “It’s painful reading this from your perspective but I can’t look away.” He pointed to another diary. “I want to know more.”</p><p>Not liking the strain etched into his features I shook my head. “Adam, we’re past all this. I didn’t mean for this to be painful. I just thought... well now that I have you I can take a step back and look at the pieces of our history without it hurting. And you know me.” I shrugged.</p><p>“The angst of it all seems romantic.” Then I frowned. “But you’re obviously not taking it that way so I’m going to put these away.”</p><p>He clamped a large hand down on mine as I moved to lift the diaries. I glanced up at him and he shook his head with a small smile. “It’s painful to read how my stupidity hurt you at the time, but I like being inside your head. I like knowing that while I was struggling with the fact that I had fallen in love with my best friend’s little sister, she loved me back more than I could ever hope to deserve.”</p><p>I grinned at him. “One: you deserve it. And two,” I gestured to the diaries, to the story of us, “It is totally romantic, right?”</p><p>Adam laughed, shaking his head at my single-minded determination to turn us into a romance novel. “Maybe. But don’t tell anyone I said so. It’ll ruin my reputation.”</p><p>I pushed through the diaries looking for the familiar purple leather of the last one. “Baby, you ruined that reputation when you told Braden Carmichael you were in love with me.”</p><p>“Cocky bastard knew all along,” Adam muttered unhappily. “Could have saved us a couple of months of worry.”</p><p>“You mean,” I found the diary and paged through it, “A couple of months of you being a mercurial pain in my arse.”</p><p>“Such a nice way to put it. But let’s not forget I wasn’t the only pain in the arse.”</p><p>“All I did was start dating again, and it took me ten months to do it after our little couch scene. You got off easy.” I thrust the diary at him and he took it with a scowl.</p><p>“I was staking my claim.”</p><p>“No, you were peeing all around your territory without actually staking a claim.”</p><p>He chuckled and bent his head over the latest page without responding... because he knew I was bloody right.</p><p>Sunday, August 13th I haven’t had time to write anything down for a few days, partly because of studies and partly because my seething anger has been taking up quite a lot of my time. You see, it all started on Friday afternoon when a casual conversation with Nicholas ended in me wanting to strangle Adam... As Joss and I walked toward The Meadows where we were meeting Braden, Adam, Jenna and Ed for a picnic, I considered telling her what I’d discovered about Adam yesterday while I was having coffee with my fellow student and friend, Nicholas. I didn’t get the chance to tell her yesterday because she’d been working at Club 39. I knew Joss would be pissed off for me and I needed that fire, I needed motivation to put Adam at an arm’s length and see how he liked it.</p><p>It had taken me and Adam a few months to get past the awkwardness of almost having sex, and even then things weren’t the same. If I thought about it, things hadn’t been the same for a while. I think maybe since the lip brush incident when I was nineteen.</p><p>Anyway, I knew obviously that Adam had slept with other girls since he’d had me on his couch and it hurt worse than I could ever explain. The whole incident made it difficult for me to move on and I hadn’t. I hadn’t been on a single date in ten months.</p><p>That was all about to change, however. After making a crack to Nicholas about my dry spell he’d told me maybe I’d have better luck getting a date if my friend Adam would stop going around intimidating men out of asking. Surprised and to say the least, confused, by this comment I’d asked him to elaborate only to discover that Nicholas had wanted to ask me out months ago. Knowing how close I was to Braden and Adam, but feeling Adam the safer choice, he’d called Adam and asked him for advice on where to take me out. Adam’s response had been, “Stay away from Ellie or I’ll break your face.”</p><p>What the hell was that?</p><p>Seriously?</p><p>I couldn’t even begin to process how not cool that was. He was warning perfectly nice guys away from me? So he was allowed to manwhore his way through Edinburgh but I wasn’t allowed to go on a single date? I didn’t think so.</p><p>I wanted to tell Joss all that. Despite being incredibly secretive about her past, Joss had proven herself straightforward. I needed her to tell me if it was okay or not to play a little dirty with Adam. Honestly, I was just so tired of being the nice girl that he could just walk all over, knowing I’d still love him in the end. His actions had proven that he could be possessive of me, which meant he thought of me as “his” in some small way. Well, I wanted to show him that I wasn’t his. I wouldn’t ever be his unless he decided he wanted more than a one night stand.</p><p>All this I wanted to confide in Joss that sunny Saturday as we strolled to The Meadows but Joss was distracted by something so I decided it wasn’t a good time. I was curious whether Joss’s distraction had something to do with Braden. She’d been acting strangely around him, strangely enough for even me to notice during the aftermath of one of my headaches. We’d been book shopping with Hannah when it happened. The headache hit me out of the blue like it had been doing for the last couple of months. It was horrible and usually accompanied by tingling and numbness in my arm. When it passed I was exhausted. In fact, lately my energy levels hadn’t been great. I kept meaning to go to the doctor but every time I got this ominous churning in my gut, and I put it off, promising myself I’d make an appointment the next day. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Anyway, the headache hit and Joss was concerned—she didn’t fool me with her ‘I don’t care about people’ rubbish—and taking me to get some food in me. We bumped into Braden and Vicky. While I was pissed off that Braden had slept with her again and brought her back into our lives (and Adam’s orbit), I still noticed the tension between Joss and Braden.</p><p>Admittedly when they’d first met I’d had hopes of playing matchmaker but recent revelations had spoiled my hopes. However, Braden still asked an awful lot of questions about Joss and he stared at her (a lot), and I was beginning to suspect that, despite denials from both of them, something was going on. I didn’t know how to feel about that now that I knew Joss wasn’t keen on being in a relationship. It was difficult to pin down her true feelings about anything and I didn’t want either Braden or her to get hurt.</p><p>Deciding to bite my tongue about a lot of things I kept our conversation cheerful as we approached our friends. Braden, Adam, Jenna and Ed were already there, sitting on a large chenille blanket with two picnic hampers beside them. My eyes immediately went to Adam and then quickly moved to Braden when I discovered Adam was watching me.</p> <p>I laughed as Joss teased Braden upon our arrival, something not many people outside of our family dared to do and I loved that Joss did. I think secretly my big brother did too.</p><p>Without thinking about it I flopped down onto the blanket beside Adam. His strong arm came around me instantly and he squeezed me affectionately against his side. “Nice to see you, Els.”</p><p>The whole point of the picnic was to catch up with Adam and Braden since they’d been working so hard on the new development we’d barely seen them these last few weeks. I missed them both, I did. I missed Adam, and inhaling the familiar smell of him and feeling his strength pressed against my right side, I almost forgot for a moment my earlier resolve.</p><p>Almost.</p><p>“Yeah, you too.” I gave him a half-hearted smile and pulled casually out of his embrace. I turned to Jenna and Ed to greet them properly, ignoring the sudden tension radiating from Adam. He knew me too well, and he immediately understood something was wrong.</p> <p>Good.</p><p>Hearing Joss tell Braden she needed to take a rain check on the picnic, worry brought my head around to her. I gazed up at her in concern, suddenly wondering if there had been more to her distraction earlier than I’d previously thought. “Is everything okay? Do you need me to come?”</p><p>Joss shook her head, and waved her phone at me. “No, I’m okay. Rhian just really needs someone to talk to. It can’t wait. Sorry.” She was avoiding Braden’s eyes for some reason and when I glanced at my brother I found him studying Joss in a weird way. Did he not believe her? Why not? Rhian was Joss’s best friend. She stayed in London and had been having personal problems lately, so it was completely plausible that she needed to talk. “See you later.” Joss walked away, her long ponytail swaying across her back. Looking back at Braden I watched him watch her in a way that unnerved me. It wasn’t just the fact that he had that determined, focused expression he got on his face when he was going after something— usually a development and never a woman—it was the glimmer of excitement in his eyes.</p><p>I’d never seen him look at anybody that way. The romantic side of me sighed happily. The practical side of me (and believe it or not I had one) worried her lip between her teeth, thinking Joss and Braden were either the perfect match or a freaking disaster waiting to happen.</p><p>Later, after having frozen Adam out to the point of seriously pissing him off, my suspicions over Braden’s interest were confirmed when he pestered me all the way home about Joss. I knew by the time he’d dropped me off on Dublin Street that he was going after her, and I knew from having grown up with him that when Braden really wanted something he was absolutely relentless, even when he was reaching for the impossible. I could only hope Joss didn’t hurt him while he tried to reach for her.</p><p>*** I’d spent the picnic catching up with Jenna and laughing at Braden and Ed’s jokes. Maybe once in the entire three hours we hung out did I speak directly to Adam, and I avoided his gaze at all costs. That was difficult, considering he was constantly trying to catch it.</p> <p>Thankfully there wasn’t a quiet moment for him to ask me what the hell was wrong with me, so my form of torture worked out even better than I’d planned it.</p><p>I was gratified to discover it was a form of torture because by the time Braden and I left him, Adam’s expression was black with ill humor. Normally, Braden would have noticed our behavior, but much like Joss he was kind of distracted.</p><p>I was even more gratified to discover later, after having a discussion with Joss regarding Braden —I was still unsure of where Joss stood on that one since I thought she was protesting her disinterest just a wee bit too much—and then confiding in her about Adam, that she agreed with me: Adam needed to be taught a lesson. If he didn’t want to be in my life in a romantic sense, then he needed to butt out of my romantic life. I was going to continue my torture that evening.</p><p>Joss was working at the bar while Braden, Adam and I were going out for drinks with Darren, the manager of Braden’s nightclub Fire, and Darren’s wife Donna. I wore a black top that was backless. It was held together by a silk ribbon across the middle of the back, while the front was demure with a high neckline and draped chiffon panel that fell a good three inches past my waist. I’d matched the top with black skinny jeans that were so tight they might as well have been painted on. My hair was pulled up into a messy bun to give maximum impact to the top, and I was wearing four inch silver heels to match the silver tear drop earrings I was wearing.</p><p>It was a little more femme fatale than I usually went for but it did the trick. Adam’s eyes flared when I turned around after greeting Donna, his gaze burning as he took in the full effect of the outfit.</p><p>That just pissed me off.</p><p>What pissed me off even more was Braden’s announcement that we were going to Club 39. Knowing what he was up to regarding Joss, I didn’t feel comfortable letting him unleash his plan while she was busy working. However, Braden wouldn’t listen to me and Donna wanted to check out the bar.</p><p>My annoyance levels increased when Adam held me back as we walked along George Street.</p> <p>“Are you going to tell me what’s wrong or am I going to have to guess?” he asked, his words clipped.</p><p>I shrugged, not looking at him. “I don’t know what you’re talking about.”</p><p>“Ellie, don’t. Being a bitch doesn’t suit you.”</p><p>I flinched but kept walking. “You know what else doesn’t suit me? Being single. But apparently that’s not my choice.”</p><p>“What the hell are you talking about?” he hissed, his voice low since we’d gotten closer to Braden.</p><p>I kept my voice low too as I illuminated him, snapping my head around to glare at him.</p><p>“You know exactly what I’m talking about, you overbearing arsehole.”</p><p>“Everything okay?” Braden turned around to frown at us.</p><p>I nodded sharply and hurried forward to walk beside him. As we approached Club 39, I sighed, “Braden, I hope you know what you’re doing.”</p><p>He shot me a wicked smile. “Always do. You know, Darren knows the doorman here.”</p><p>Turning to Darren, Braden set his devious little plan in motion. “Darren, why don’t you go on in ahead and gets us drinks. We’ll find a table.”</p><p>Darren nodded and ignored the complaints from people standing in line as he shoved his way down the narrow steps to the basement bar. He greeted the big guy at the door and they spoke for a few minutes. He turned and pointed up to the street where we were standing and the next thing was we were being waved down the stairs. Darren disappeared inside the club and I watched Braden take Donna’s arm.</p><p>I glowered at his back. Donna was an attractive brunette and Braden was hoping to use her to make Joss jealous. I knew how Braden worked. He liked this idea because it meant that he could use a woman to make Joss jealous without actually getting entangled with another woman. My brother liked reaction, and I was guessing he wanted a big reaction from Joss.</p><p>Part of me hoped she’d deal with it with her usual admirable self-possession.</p><p>Unfortunately my hopes were dashed. As soon as we got inside Club 39 my eyes swung to Joss and I watched her expression harden as Braden leaned down to whisper in Donna’s ear.</p><p>He looked right through Joss and I saw a flicker of something I didn’t like pass in her eyes before she quickly turned away.</p><p>I really wanted to bash my brother’s head against Adam’s.</p><p>More than anything I just wanted to leave the two of them to it. But Adam wouldn’t let me. He pressed me forward as Braden managed to clear us a table and I brushed off his hand, still playing it cool. I strode after Braden and stopped as he and Donna, followed by Adam, slid onto a couch. Standing over them I couldn’t decide which one I wanted to glare at more.</p><p>“Ellie, sit your arse down,” I heard Adam snap over the music.</p><p>I narrowed my eyes and shook my head.</p><p>Adam’s expression darkened and before I had a chance to maneuver away from him, he reached up, grabbed my arm and yanked me down beside him. At the feel of his body pressed flushed to my side, I struggled to get away from him but was halted by the sensual brush of his fingers across my bare back as his arm wound around my waist. His hand clamped down on my hip and he forced me closer, his mouth at my ear. “If you stop acting like a petulant child, I’ll stop being overbearing.”</p><p>I stopped struggling against him but held myself tense so he’d know I was still angry with him. For the next hour he kept me held against him, his grip possessive and definitely more than friendly.</p><p>Braden didn’t even notice. His eyes were burning holes in Joss and her colleague Craig who had started the night off by sharing a kiss and spent the last hour flirting and having fun.</p><p>I liked this side of Joss.</p><p>Braden apparently didn’t. No. He did. He just didn’t like that she was doing it with another guy. The mini-drama playing out before me almost kept my mind off my own, but when Braden, who’d clearly finally had enough, got up and approached the bar when Joss went on break and somehow managed to talk the other bartender into letting him into the staffroom, I was brought back to my own problem with no escape. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Darren and Donna were up at the bar getting more drinks.</p><p>Adam and I were alone on the couch.</p><p>He caressed my hip soothingly, obviously trying to get me to relax. “So,” he spoke into my ear again, reinforcing the feeling that we were in our own little bubble inside the bar.</p> <p>“Are you going to tell me why you’re being a bitch to me?”</p><p>“Stop calling me that,” I snapped, turning my head so our noses were almost touching. I stared into his dark eyes and lost my breath so badly I had to look away.</p><p>“Stop acting like one.”</p><p>“I’m annoyed,” I explained. “I get to be annoyed.”</p><p>“Would you fill me in?”</p> <p>I turned to him again, and this time I don’t think I managed to mask my hurt and confusion over his actions because his own expression softened with concern. “Why did you threaten Nicholas with physical violence when he came to you for advice about asking me out?”</p><p>Understanding dawned in his eyes and he sighed heavily. “He’s not good enough for you.”</p><p>“That’s not up to you to decide.”</p><p>His fingers dug into my hip as they curled in reflex to my response. “It’s up to me to protect you.”</p><p>I closed my eyes, his words hurting me. “I’m not yours to protect.”</p><p>Adam’s body grew solid next to mine and we sat in awful silence for a moment.</p> <p>The silence was broken when his arm loosened its hold around my waist. I was just turning my head to look at him questioningly when I felt the touch of his fingers against my upper back. Slowly, torturously he skimmed them down my spine and I flushed feeling my nipples harden visibly against the fabric covering my chest. “You sure about that,” he murmured hoarsely in my ear.</p><p>My eyes widened as I stared into his, a flurry of confusion and questions rioting in my head, none of which I had time to voice before Donna and Darren took a seat next to us with our drinks. Adam’s arm came back around, his hand resting gently on my hip, and I sat there in stunned silence wondering what the hell he’d meant by that.</p><p>Chapter 7</p><p>Adam winced as he looked over at me. “I really did send you some pretty mixed signals.”</p><p>I snorted. “You think?”</p><p>He smiled sheepishly. “I’m sorry, Els. You pissed me off. I was trying to make a point that you were mine. It wasn’t fair.”</p><p>I shrugged. “You were torn. I forgive you. Especially since it makes a really good story.”</p><p>He laughed as I reached for the diary again, flipping through the pages to find the next entry.</p> <p>“That night at Club 39 wasn’t nearly as bad as the night at Fire.”</p><p>Adam groaned. “Damn, I don’t know if I want to read this from your point of view.”</p><p>“I get quite detailed.”</p><p>He quirked an eyebrow at me. “Detailed?”</p><p>I nodded, blushing.</p><p>He saw the blush and grinned, pulling the diary out of my hand. “Baby, that’s hot.”</p><p>Sunday, September 16th I’m done. It’s over. I don’t care what history lies between me and Adam... it’s finally over... I hadn’t been looking forward to the night at Fire because it meant being stuck in a club, watching Adam flirt with everything that moved, but it was a big night for Braden as he was holding a special event for Fresher’s Week, and I promised him I’d be there.</p><p>As per usual he and Joss were so wrapped up in their own stuff they didn’t notice the tension between me and Adam. It was this horribly awkward tension, mixed with sexual frustration, and it had sprung up between us after our clash a little while after the eventful night at Club 39.</p><p>It had happened when I accepted a date with a guy called Jason that I met in Starbucks.</p><p>Jason was hot and seemed nice and I saw no harm in grabbing a drink with him. Except, Braden had informed Adam of my plans and Adam had spent the entire night calling me up with stupid questions. He ruined the date. It was immature and completely outrageous.</p><p>Even more so was the fact that, as Joss so bluntly pointed out, I had rudely kept answering the phone instead of switching it off. The truth was I’d been enjoying Adam’s reaction to my date. Somewhere along the line I had forgotten my vow to move on from him after the night at his apartment, and I was playing our stupid game again. I wanted a reaction from him and I got it. But after chewing him out at my parent’s Sunday lunch the next day, Adam had gone from hot to ice cold. He tried not to be alone with me and when he was alone with me he spoke to me about things you’d chat to a perfect stranger about. It had been wearing on my nerves for weeks, and that along with my worries about school and the recurring headache I couldn’t seem to get rid of, I found myself wanting to lay my frustrations at his feet.</p><p>Everyone else would get nice Ellie, sweet Ellie, the Ellie everyone knew and liked. Adam would get crabby Ellie, tired Ellie, the Ellie with the bitter, broken heart.</p><p>While Braden detained Joss after a small skirmish about her dress (my brother was such an alpha-male idiot sometimes) Adam led me up to a private booth across from the bar. I slid in one side and was surprised when Adam sat down quite close to me.</p><p>“Careful,” I warned him dryly, “I think you’re breaking your one meter distance rule with me.”</p><p>He curled his lip, unimpressed. “Don’t start. Not tonight.”</p><p>“Not any night.”</p><p>His eyes flashed. “You know why I don’t date, Ellie? So I don’t have to put up with this shit. It’s like being in a fucking relationship without the benefits.”</p><p>Hurt, I gave him the dirtiest look I could muster. “No, it’s like being in a friendship you broke.”</p><p>Having successfully spread my hurt to him, I felt awful, and feeling awful made me even angrier at him. I didn’t want to care that I hurt his feelings.</p><p>Adam was about to respond when movement drew our heads up and we saw Joss trying to escape our argument. He gave her a look that told her to plant her bottom down beside us and save him from me.</p><p>I was almost as relieved as he was when she sat down on my other side.</p><p>“Braden’s having drinks sent over,” she said, her eyes taking in all the guests. “I didn’t realize he had other friends appearing tonight. I thought it was just us and random people.”</p><p>“No,” I replied absentmindedly, my bad mood causing the rope bridge between my brain and mouth to snap. “Some of his exes as well as his previous friends-with-benefits girls love clubbing. He invited them and a few of his guy friends.”</p><p>It wasn’t until Adam snapped, “Ellie, what are you playing at?” and I turned to see him gazing pointedly at Joss that I followed his gaze and saw Joss had frozen at my careless comment.</p><p>Mortified, I hurried to assure her apologetically, “Oh crap, Joss, I didn’t mean anything. I mean, those girls don’t mean anything...”</p><p>“Let’s get drunk,” she announced overly cheerily and I felt unbelievably guilty for making her feel uncomfortable and uncertain of Braden.</p><p>“I don’t think that’s a good idea. Let’s just wait for Braden,” Adam insisted.</p><p>However, Braden spent an awful long time flirting and chatting with guests and the tension at our table grew so thick we all sought to escape it. Joss and I headed for the dance floor, and I kept her company for a while until I headed to the bar to get some water. As I approached I caught sight of Adam and felt that oh so familiar burn in my throat. He was wearing a black shirt, rolled up at the sleeves, with black dress trousers. It was simple, it was hot. He always looked hot. And tonight he looked hot as he leaned into a girl who was sitting on a stool at the other end of the bar. She had her head tilted back while Adam braced one hand on the bar and leaned in to whisper in her ear. She laughed and he lifted his face so they were almost close enough to kiss. Whatever he murmured to her made her laugh soften to a flirtatious smile and I felt that burn in my throat transform into a lump of tears.</p><p>As if he sensed my gaze Adam’s head lifted and our eyes met. I’d never found it easy to hide my emotions when I was feeling something particularly deeply and I hurried to look away before he caught it.</p><p>“What can I get you?” One of the bartenders finally approached me.</p><p>“Bottle of water,” I replied, my voice hoarse with pain and he had to lean in for me to repeat the order. Just as I handed him money for the water, I felt a hand on my lower back and his cologne hit me seconds before his mouth brushed my ear.</p><p>“Els,” Adam said quietly, his voice thick with emotion.</p><p>I didn’t know how to respond. My eyes fixed downward on the bottle as I tried to control myself, knowing that every day I was getting closer and closer to forcing our situation into some kind of resolution by putting the truth out there.</p><p>“Sweetheart, look at me.”</p><p>I did as he asked, searching his face for answers I knew he wasn’t ready to give me, answers he may never be ready to give me.</p><p>He lifted his hand from my back and brushed his knuckles tenderly along my jaw, his eyes following their movement. “The prettiest thing I’ve ever seen,” he murmured.</p><p>The words stung because they signaled another round on this merry-go-round of mixed signals. I reared back from his touch, grimacing. “Don’t.”</p><p>He dropped his hands. “Ellie—”</p><p>I gestured to the girl at the other end of the bar who was now throwing invisible daggers my way. “Did you say that to her?”</p><p>“El—”</p><p>A surge of shocked murmurs and shouts interrupted him and we both turned to look over his shoulder to see Braden rearing back from hitting... “Gavin,” I gasped.</p><p>Adam immediately took off to be by his friend’s side and I followed, my heart racing for Braden. Gavin had been his and Adam’s friend at school, but he’d grown up into a prize arsehole. Braden, for some reason, felt loyalty to him and kept him around. That was until five years ago when he’d slept with Analise and betrayed Braden.</p><p>Now he was in his nightclub?</p><p>“That is Gavin.” Braden threw Joss a disgusted look. “The friend who fucked Analise. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Why the hell were you talking to him like you know him?”</p><p>Oh dear God, Joss knew him? For a moment I felt absolute panic take over me at the thought of history repeating itself for my brother. But I remembered this was Joss, and despite her flaws, she would never be disloyal. I only had to watch the shock fall across her features at the discovery of who Gavin was to realize that whatever this was, it was a big misunderstanding.</p><p>Well, at least on Joss’s part. I sneered at Gavin.</p> <p>“He’s a trainer at my gym,” Joss explained. “He helped me once.” She looked up at Braden and as she promised him she had no idea who Gavin was she let her feelings for my brother all hang out. I knew she probably didn’t realize it, would even be mortified if she thought for one second she was making herself transparent. However, I was glad to see it and wished Braden wasn’t so riled up because he didn’t even notice it.</p><p>“Looks like you moved on to better things, Bray.” Gavin peered at Joss in a way that made my skin scrawl and I saw Adam’s shoulders tense in front of me. “Here’s hoping history repeats itself because I’ve wanted between her legs for fucking weeks. How about it, Joss? You fancy shagging a real man?”</p><p>I’d never witnessed my brother hit someone but he was on Gavin before anyone could stop him. Adam tried his best, but I knew there was a part of him that didn’t want to pull Braden off the sleazy little traitor. But he did, only just managing to keep a grip on Braden when Gavin said something so crude I almost threw a punch.</p><p>By the time security came to drag Gavin out, I thought Adam was going to let Braden go just so his own arms were free to start swinging. And poor Joss. I watched with concern as Braden, bristling with adrenaline and anger the likes I’d never seen in him before, hauled her out of the main club and up the stairs into his private office.</p><p>I didn’t even want to know what was about to happen in there.</p> <p>Instead I stood there, still shaking from the whole thing, as the excited customers and guests returned to enjoying their night. Adam and I were just standing on the dance floor staring at one another. I reckoned we were both trying to work out where we were at, and what the hell had just happened.</p><p>The girl from the bar strolled over to him in a tight jersey dress that showcased a bombshell figure. She was shorter than I was but like Joss she had more hips and ass. I suddenly felt dowdy in my shapeless, shimmery shift dress. Stopping beside Adam, the girl placed a proprietary hand on his arm. “Let me buy you a drink after that.”</p><p>Adam glanced up from her to look to me and desperate not to bleed as openly as I had earlier, I closed my features down and told him flatly, “Go. I’m leaving anyway.”</p><p>I brushed past him before he could reply, pushing through the crowds, and carefully making my way downstairs to the street level. A hand suddenly curled around my bicep as I was about to step outside and I looked up in surprise to see Adam was there with his jacket on.</p><p>“I’m making sure you get home okay.”</p><p>“You don’t need to.”</p> <p>He didn’t reply and he didn’t let me go. I was too tired to struggle so I let him manhandle me into a taxi and I sat in absolute silence with him as the cab drove us to Dublin Street.</p><p>He paid for the taxi and followed me out and up the front stoop. He waited patiently as I got out my keys and let us in to the dark flat. I took a few steps into the hall, flicked the light switch and turned around, kicking off my heels. “You can go now.”</p><p>Instead Adam slammed the front door shut behind him and stared at me sullenly.</p><p>I sighed softly, tired of fighting. Mum had always joked I wasn’t a fighter, I was a lover.</p><p>She’d even bought me a T-shirt that said it. “You can leave now, Adam. Thank you for seeing me home.”</p><p>“What do you want from me?” he suddenly asked, his voice husky with anger.</p><p>I backed up at his tone, hitting the wall, watching warily as he stalked me. My chin tilted, my lips parting in surprise as he placed his hands above my head on the wall and caged me against it. He lowered his head, his nose sliding along mine until his mouth rested just above my lips. I swallowed, finally finding my voice. “What do you want from me?”</p><p>His answer was to crush my lips beneath his.</p> <p>Like the last time he’d kissed me like this, the world just disappeared, taking reality and all the important stuff with it. I wrapped my arms around his neck, my fingers curling into his hair, my breasts pressed hard against his chest as we devoured one another.</p><p>After a while Adam eased our carnal kiss, releasing my swollen mouth to press soft kisses along my jaw and down my neck as his hand slid up the inside of my thigh. I sank against the wall with a sigh, my eyes closed as he kissed my lips again, his tongue teasing mine. His fingers slipped under the fabric of the lacy lingerie I was wearing under my sweet dress and I groaned into his mouth at the pressure of his fingers pushing inside of me.</p><p>Adam pulled back, his breathing as shallow as mine as he toyed with me. I closed my eyes again, the pleasure tightening. I gripped his arm as he pushed me toward it. “Adam,” I pleaded.</p><p>“Look at me,” his words rumbled over my mouth and I immediately opened my eyes to find his blazing into mine. “I want to watch you come.”</p><p>I felt my cheeks flush even harder at the demand but I held his gaze as his fingers worked me, my hips undulating against his hand, my gaze turning drowsy. Adam’s breathing grew harsher and harsher as he watched me, and when he pressed down on my clit with his thumb and I broke apart, clinging to him through my orgasm, he swore loudly and rested his head in the crook of my neck.</p><p>My legs were trembling as I came down from my high, reality settling in. Confusion overwhelmed me and I felt tears prick my eyes. Adam’s warm breath caressed my skin as he lifted his head to whisper in my ear, “I almost came just watching you.”</p><p>I shivered, tingling all over again.</p><p>“You make me so goddamn hard,” he confessed and he gently lifted my hand to press it to his erection straining against his trousers. Triumph melted the confusion away for a second, a powerful feeling of victory taking over me as I caressed him and felt his groans of pleasure against my ear. At least he wanted me. At least he was in torment over that.</p><p>“You don’t stop, baby,” he peeled my hand away with a regretful sigh, “I’m going to blow.”</p><p>When he lifted his head our eyes met and he saw the tears shining in mine and pushed away from me with another curse. Running his hand through his hair, Adam sighed heavily, “I shouldn’t have done that. Els, I’m sorry.” His face crumpled and I saw the self-flagellation in his expression.</p><p>“Why?” I asked softly, needing to know once and for all what was happening to us. “Why shouldn’t you have done it? Why can’t we be together?”</p><p>Those gorgeous dark eyes of his lifted to mine in surprise, as if he couldn’t believe I didn’t understand. “Because of Braden, Els. He’s my best friend. He’s family. I can’t take the risk that he won’t forgive me for...” he gestured helplessly to me.</p><p>The warmth from the aftermath of the orgasm he’d given me was destroyed by the chill his words created in me. I stood up from the wall and tried to control that burning lump in my throat. “But I’m willing to. I’m willing to because I’m in love with you. You know I’m in love with you.”</p><p>The lack of surprise on his face was confirmation.</p><p>I shook my head, laughing bitterly as I wiped at tears that had begun to fall. “All these years, even now, you’ve told me all you ever wanted to do was protect me from getting hurt.</p><p>And yet you say things and do things to confuse me, to make me think you might feel the same way that I feel about you, and then in the next second you’re cold and you flaunt other women in front of me.” The tears fell fast now and I could see Adam’s own eyes starting to shimmer with pain. I didn’t care. I had to get this over with. “The only person who’s ever really hurt me is you. And I keep letting you.”</p><p>“Ellie,” he sounded in pain as he took a step toward me. He stopped though, the pain transferring to his eyes when I moved away from him. “I do love you,” he admitted and instead of feeling joy at those words, the last piece of me holding onto hope crumbled.</p><p>I shook my head. “But not enough.”</p><p>“You know that’s not true. Els, you of all people have to understand. If you and me start something and it all goes south, I lose Braden too. I’ll lose the two people in the world who mean anything to me.”</p><p>I wanted to understand him. I tried to understand the reasons behind people’s actions because I wanted to believe the best in everyone. But all I knew was that I loved him enough to risk it all—to risk our history— for something more, and the fact that he wasn’t willing told me he couldn’t possibly feel the way I felt about him. I didn’t want to be in a relationship with someone I loved more than he’d ever love me.</p><p>“Go home, Adam,” I replied softly. “We’re done.”</p><p>His eyes widened in shock. “Ellie—”</p><p>“I’ll pretend for Braden. When we’re all together, I’ll pretend for Braden that nothing has changed between you and me.” I held his gaze, attempting to be strong as I ended us. “But whatever this is, it’s over. Everything. Don’t call me, don’t visit... just don’t. I don’t want you near me when you don’t have to be. It hurts too much, and if you care about me even just a little bit, you’ll stay away from me.”</p><p>I didn’t let him reply. I couldn’t. I turned and strode down the hall and into my room, closing the door behind me and leaning against it while I tried to catch my breath.</p><p>There was silence in the hallway for what seemed like forever, and then finally I heard the front door open and close quietly.</p><p>The burn in my throat burst out into sobs, and I slid down the door panting for breath through the pain...</p><p>Chapter 8</p><p>“Most miserable bloody weeks of my life after that.” Adam turned the pages, scanning my sparse entries after that night. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I slid my hand around the nape of his neck and gave it a squeeze. “Me too, honey.”</p><p>He lifted my hand from his neck and brought it around to give my knuckles an absentminded kiss. “The night at Jenna and Ed’s wedding was fucking torture.”</p><p>Agreed. We’d both taken dates. I’d taken Nicholas just to be particularly annoying and Adam had taken some random girl with him. Although I’d flitted around the wedding acting my cheery self and steadfastly refusing to look Adam’s way, it was one of the most painful experiences of my life.</p> <p>Adam threaded my fingers through his and rested our hands on his lap. “Here it is.” He held the diary up.</p><p>“What?” I frowned, trying to read my writing.</p><p>“I’m fast forwarding to my wake up call.”</p><p>Monday, December 17th I’m writing this as quickly as I can because I can see Adam is about to rip the pen from my hand and use whatever means at his disposal to bring my attention back to him. Since I like the means he will use I need to get this down. It’s been an utterly exhausting weekend but today I woke up feeling stronger than I have in a while. This morning I woke up to something beautiful, and I swear after the last week I’ve had, I didn’t think that was possible... Focusing on a crack in my ceiling I determinedly attempted to push the fear and desperation back. There was this buried part of me that kept trying to push up and grip my chest from the inside out to pull me to it to whisper desolately, “I’m not ready to die.”</p><p>Stop it, stop it, stop it, stop it, stop it, stop... I couldn’t think like that.</p> <p>But it was what I’d been hiding from for months. When my doctor told me I needed glasses I’d ignored my own instincts and grabbed onto that solution with utter relief.</p><p>Still, the headaches kept coming, the exhaustion worsened as the anxiety I kept hidden from everyone built and built.</p><p>Ten days ago I’d had a seizure in my kitchen. I was terrified but also strangely relieved as I sat in the hospital and waited for my turn on the MRI—sick to my stomach with fear but relieved that I was going to know once and for all what the hell was wrong with me.</p><p>A tumor, though. A brain tumor.</p><p>I tried to catch my breath. We’d waited ten days for the results and it was a brain tumor and they wouldn’t tell me anything else. I had twenty four hours of waiting to find out if I had brain cancer or not.</p><p>I wanted to handle it graciously, not just for me but for Braden and Mum and Clark and Hannah and Declan. I wanted to handle it graciously for Joss, knowing it would be difficult for her. However, her reaction... A tear slid down my cheek as I thought on her reaction only a few hours ago. I’d watched the panic in her face and then she just... shut down. She just left me. When I needed her the most, she just... left me.</p> <p>Braden was furious and panicking about me and about her and trying not to. His anxiety was making me worse so I told him to go and speak to Mum and Clark. Understanding I needed just a little time to myself he gave me it.</p><p>I couldn’t think of the worst. I wouldn’t be like Joss. I mean, I wanted to be prepared but I wasn’t a pessimist. And surely, I was too young to... You never think something like this will happen to you. It feels like a dream, it’s so surreal, like you’re watching someone else’s life play out in a movie.</p><p>My phone rang and I turned my head on my pillow to eye it on my bedside table.</p><p>Adam Calling.</p><p>I breathed through the tightness in my chest and reached for the phone. Since I landed in the hospital ten days ago, Adam had reneged on his unspoken promise to stay out of my life.</p><p>He called me every day and came by the flat as much as he felt I’d let him get away with it.</p><p>Too exhausted to fight him, I did let him get away with it.</p><p>“Hullo,” I answered and even I could tell I didn’t sound like myself.</p> <p>There was a crackle down the line as he let out a heavy sigh. “Braden just called.”</p><p>I tensed, hearing the roughness in Adam’s voice, the choked brokenness in his tone.</p><p>“Yeah.”</p><p>“God, Ellie,” he groaned as if in agony. “Sweetheart—”</p><p>“Don’t.” I shook my head even though he couldn’t see me, and I bit my lip to try and stem the flow of tears. As soon as I felt I could speak without crying, I continued, “We don’t know anything yet.”</p><p>“I know I need to come to you. I’ll be there in ten minutes.”</p><p>“No, don’t,” my voice was sharp as I sat up, my heart pounding at the thought of having him here to hold me through this. “I don’t want you to.”</p><p>“Fuck, Els.”</p><p>I winced at the hurt in his voice. “Please, Adam.”</p><p>“I need to. I need to be with you. I love you, Ellie. I’m fucking in love you.”</p><p>He was crying.</p><p>I’d never heard or seen him cry before. At his tears and outright confession I started to cry too and collapsed back on my pillow, squeezing the phone tight to my ear. Finally I whispered, “Just stay on the line with me, okay.”</p><p>Adam cleared his throat, his voice breaking as he replied, “Anything, baby.”</p><p>I sighed and snuggled deeper against my phone. “We don’t know anything,” I repeated.</p><p>“It could be nothing,” he added.</p><p>“Whatever it is, I’m going to fight.”</p><p>“I’ll fight with you.”</p><p>“Ssh,” I hushed him softly. “No promises. Not like this.”</p><p>“I’m done wasting time, Els.”</p><p>I smiled sadly, too weary to go there. “Just waste a little more time for me. Please.”</p><p>He was a silent a while and then he replied quietly, “Only a little, baby. Only a little.”</p><p>*** Adam’s phone bill would be ridiculous but I doubted he cared. He stayed on the phone with me for two hours and we hardly spoke. I just listened to him breathe as he listened to me breathe. We finally hung up when Braden returned, but Adam refused to let me say the words goodbye and it was the first time I heard undiluted fear in his voice when he begged me not to say that word.</p><p>It was a lot. It was huge. But it was one thing for him to admit to me again that he loved me and an entirely different thing for him to admit that to Braden. I needed to get through this crisis before I could deal with me and Adam.</p><p>I watched television with Braden for a while, snuggled up into his side as he stroked my hair soothingly. Mum and Clark had gotten into a huge fight with him because they wanted to come to me but Braden insisted there was nothing they could do right now and while I was stuck in limbo it would be best if I had peace and quiet and didn’t have to worry about how they were coping with this. I appreciated it but I also gave them a quick call so they could hear my voice and I could ask them to take me to my appointment the next day. They were okay at first but then suddenly Clark had to say a quick goodbye when Mum started to sob.</p><p>Of course that set me off for a while, and then I calmed, and then as it got darker outside and the evening began to pass, the fear over what I’d hear tomorrow hit me.</p><p>Braden laid me back on my bed and curled my hand around a mug of hot water and whiskey. He sat on my bed as I drank it and he watched me until my eyes finally fluttered closed.</p><p>They slammed open at the sound of my bedroom floor creaking. I was curled up in a ball on my bed in the dark, and through the moonlight spilling in through the large window I saw Joss standing at the bottom of my bed.</p><p>Surprised that she had come to me but still gripped by hurt at her defection earlier, I just gazed at her with round eyes.</p><p>At a breathy gasp, my eyes grew wider as I realized Joss was crying. Joss was crying.</p><p>Joss. I knew she’d run earlier because of the baggage she carried around about her family’s deaths. I’d known that on some level that fear had sent her running from me, but actually witnessing her tears, I realized it all meant that she cared about me. She was frightened of losing me.</p><p>The tears slipped down my cheeks and moved Joss to action. She crawled up onto my bed and as she settled in beside me I turned on my back. Joss immediately rested her head on my shoulder and shifted closer to me. She took my hand and held it between both of hers.</p><p>“I’m sorry,” she whispered.</p><p>“It’s okay,” I promised her and meant it. “You came back.”</p><p>“I love you, Ellie Carmichael. You’re going to get through this.”</p><p>I’d won the love and affection of someone as lost as Jocelyn Butler? For me that was a whole lot of light in a whole lot of dark and it overwhelmed me. I tried to swallow past an answering sob as I whispered the truth back to her, “I love you too, Joss.”</p><p>*** Braden had woken us up that morning and he’d made us breakfast. Even with the appointment with the neurosurgeon looming over me that afternoon, I could tell something had gone horribly wrong with Joss and Braden. Upon asking them, I discovered they’d broken up and attempted not to feel guilty. I failed.</p><p>They’d clearly broken up because of me... because of Joss’s reaction to what was happening to me. Hearing Braden’s deadly cool voice with her and seeing the flinch of pain in Joss’s face, I wanted to intervene, I wanted to fix what I had inadvertently helped break, but they wouldn’t have it and I was ushered out of the room and into a shower.</p><p>At one point I heard their escalated voices over the spill of water and then a plate crashing followed by more shouting. Worried, I switched off the shower and clambered out but the voices had quieted to a murmur. Still, I hurried getting dried and pulled on a bathrobe, ready to put myself between them if need be.</p><p>Instead as I walked quietly down the hall I heard Braden confessing that he loved her and that he wasn’t going to stop fighting for her. He promised her in his way that he would be relentless. The romantic in me almost passed out on the spot.</p><p>“You’re insane,” Joss hissed back.</p><p>“No,” I disagreed, coming to a stop in the kitchen doorway, giving them a smile. “He’s fighting for what he wants.”</p><p>“He’s not the only one.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I turned my head in shock at the sound of the familiar voice, and watched with a pounding heart as Adam strode into the flat toward me. He looked like hell with dark circles under his bloodshot eyes, and it looked like he hadn’t shaved in a couple of days.</p><p>He was still absolutely beautiful, and the way he was gazing at me, like I was something precious just dancing out of his arm’s reach, was absolutely beautiful.</p><p>When he stopped before me he took my hand and raised it to his mouth, squeezing his eyes closed as he pressed a kiss against it. My breath caught as he opened his eyes and I saw the tears from yesterday were back again, shimmering in their depths. I also knew from the determined fire blazing in his eyes that he had really meant it when he said he’d only waste a little more time for me. As in less than twenty four hours.</p> <p>That’s why when he tugged me by the hand and drew me into the kitchen as he faced up to Braden, I let him. Because in a few hours I’d discover whether or not I had the biggest fight of my life on my hands, and even after everything, the only person I wanted fighting by my side was Adam Gerard Sutherland. We had a history, and I wanted to keep adding years to that history.</p><p>“I need to tell you something,” Adam faced Braden and I could feel the tension vibrating from his body.</p><p>He was doing it. He was really willing to risk it for me. I squeezed his hand tighter.</p><p>Braden crossed his arms over his chest, his eyes moving from Adam to me and then back to Adam again and I knew he knew but he wasn’t going to make it easy. “Go on.”</p><p>“You’re like a brother to me. I would never do anything to hurt you. And I know I haven’t been what a brother would consider good material for his wee sister, but I love Ellie, Braden.</p> <p>I have for a long time now, and I can’t not be with her. I’ve wasted too much time as it is.”</p><p>I don’t think either of us took a breath as we waited for Braden’s response. After a minute’s contemplation he finally turned to me, his gaze softening. “Do you love him?”</p><p>Adam looked back at me and I was surprised to find a glint of insecurity in his eyes. Silly man. I gripped his arm tighter to reassure him and then smiled at my brother. “Yes.”</p><p>And then quite casually, as if Adam and I weren’t tied up in knots over his possible reaction, Braden just shrugged and leaned over to switch on the kettle. “About bloody time.</p><p>You two were giving me a headache.”</p><p>My muscles tensed in reaction. All this time he’d known? Adam and I had put ourselves through pain and heartbreak these last few months and Braden had known all along how we felt about one another.</p> <p>“You really are a know-it-all pain in the ass,” Joss said for us all. She pushed past him in annoyance and stopped to say more softly, “I’m happy for you,” to me and Adam before she flounced down the hall to the bathroom.</p><p>Braden laughed softly. “She loves me really.”</p><p>The bathroom door slammed at that and Braden laughed again. Adam narrowed his eyes on him. “I hope she puts you through hell, you cocky bastard.”</p><p>Braden smirked and shifted his gaze to me. “I had to make sure you were willing to fight for her. She’s worth the fight.”</p><p>Adam sighed and put his arm around my shoulder, drawing me into his side so he could kiss the top of my head. “I know that better than anyone.”</p><p>I closed my eyes and inhaled him, thanking whatever divine being out there that had added another blast of light into my darkness.</p><p>*** For a moment I just lay there, my smile pressed into my pillow. Not only had I awoken to the heat of Adam curled into my back, his forehead pressed against my nape in sleep, his heavy arm draped across my waist and his right leg caught in between mine, but I’d awoken to the lightness of remembered relief. I’d awoken feeling stronger than I had done in what had felt like a very long time.</p><p>Yesterday, although I knew from the look on his face he wanted to come with me, Adam had, along with Braden, Joss, Hannah and Dec, quietly remained at my flat while Mum and Clark accompanied me to my appointment with the neurosurgeon. Dr. Dunham was a pleasant man in his early forties who shunted the fear of God out of me and my parents with five words, “There’s nothing to worry about.” He assured us that the cause of the physical symptoms was actually a large cist attached to two very small tumors, and the cist was causing pressure. He told us it had to be removed and because of its placement—on the surface of my brain—there was very little risk to the surgery. Like two percent risk. He’d also told us that there was little chance of the tumors proving to be cancerous but that they’d be sent off for biopsy to make sure. He’d scheduled me in for surgery in two weeks’ time, and although now that I had time to think about it I was scared as all hell about going under the knife, the relief of knowing that there was a massive chance I was fighting a small fight and not one for my life was overwhelming and draining.</p> <p>When I’d returned home to give everyone the optimistic news, Adam had surprised me by kissing me right there in front of my parents. I was even more surprised to discover they weren’t the least bit surprised. Afterward we’d all gone next door to the pub to gather our thoughts and try to unwind from what had been the most horrendous twenty fours I’d ever remembered experiencing. I sat in the pub with Adam on one side and Hannah curled into me on the other, and, despite everything, I felt incredibly lucky as I gazed around at my friends and family.</p><p>Mum and Clark eventually took Hannah and Dec home, Braden reluctantly left to give Joss some space and Joss disappeared into her room to give me and Adam some space. We ordered take away, which I ravenously ate since I hadn’t eaten anything for what felt like forever, and hung out on my bed. We talked for a little while, but there was so much to talk about it and I was too exhausted to give us the focus we needed. It seemed Adam was too because he disappeared with our leftovers and returned only to cuddle up to me in the bed and reach out to switch off the light.</p><p>Now I was awake with soft morning sun pouring in through my curtains, I was feeling strong and ready to take on anything, and Adam Sutherland was spooning me.</p><p>It was kind of beautiful.</p><p>I felt his hair tickle my neck as he moved and his arm tightened across my waist. “You awake, baby?” he murmured, sleep making his voice extra sexy.</p><p>My grin got bigger. “Yeah.” I lightly caressed his forearm. “You know in all the years I’ve known you I’ve never slept near you. You make noises.”</p><p>I felt his chest move behind me in laughter. “Noises?”</p><p>Twisting now, so I could look into his eyes, I grinned up into his face as he leaned over me. “You make ‘mmm’ noises.”</p><p>Adam grinned back at me. “What are ‘mmm’ noises?”</p><p>“You know ‘mmm’ noises. ‘Mmm’... when something tastes or sounds good.”</p><p>He grimaced. “Like ‘yum’ noises?”</p><p>“Exactly but you know, ‘mmm’...”</p><p>“I think I just took a hit to my masculinity.”</p><p>I burst out laughing and turned around so we were face to face, my hands reaching up to stroke his jaw. “Don’t worry. I liked it. I just imagined the ‘mmm’s’ were for me.”</p><p>Wrapping his arms tighter around me and pulling my leg over his hip so we were crushed together, Adam’s eyes grew drowsy and heated as he stared at my mouth. “They were for you.”</p><p>“How could they be for me if you didn’t even know you make them?”</p><p>“Because I dream about you,” he answered instantly and I stilled in surprise. He felt it and gave me a squeeze. “I’ve been having these dreams about you for a few years now.”</p><p>“What am I doing in them?” I asked somewhat breathlessly. There was a rising tide of warmth in my chest, and an even hotter heat tingling between my legs at his confession.</p><p>His hand slid down my waist to caress my bum and then he pulled my lower body against his and I could feel his morning erection pressing against me. I felt my nipples tighten in reaction, and drew in a shuddery breath. “Sometimes we’re making love, other times we’re fucking.”</p><p>I lifted my eyes to his, my smile dimming. “I don’t like that word.”</p><p>His mouth twitched. “You think it’s unromantic.”</p><p>He knew me too well. I shrugged unsurely.</p><p>“Els, wanting to fuck you doesn’t mean I don’t love you.”</p><p>Needing more clarification, I slid my hands down from his face and settled them lightly on his chest. “What does it mean?”</p><p>His voice was hoarse now, “When I want to fuck you it means I’m in the mood for rough and hard.”</p><p>To my utter shock his words were turning me on. I squirmed a little against him and felt my cheeks flush. “I don’t think I’ve ever been...” I still wasn’t sure if I could say the word.</p><p>I’d admonished Joss so many times for using it because it was so tawdry sounding but when Adam put it like that... “Say it,” he whispered across my mouth. “I want to hear it from your sweet mouth, baby.”</p><p>I gulped and bravely met his eyes. “I’ve... I’ve never been fucked,” I whispered.</p><p>If it was possible he grew even harder against me and when his hand slipped between our bodies and under my pants, his fingers thrusting gently but easily into me, Adam groaned.</p><p>“Baby...” he leaned into me, his mouth brushing mine, his tongue just touching the tip of mine. “I think you like the thought of me fucking you.”</p><p>In response I kissed him. It was a deep kiss, one I meant to encourage the whole “f-word”</p><p>thing but instead it turned soulful and desperate.</p><p>Adam rolled me onto my back, pressing my legs apart so he could settle between them, and when he broke our kiss it was to look into my eyes with such adoration I couldn’t breathe. “I’m not going to fuck you this morning, baby. This morning I’m going to make love to you. We’ll leave the rest until you’re recovered and at full strength.” His eyes darkened with promise. “You’re going to need it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I grinned up at him, suddenly realizing that Adam was here, in my arms, talking about our future together. It was a thirteen year old dream come true. “You have no idea how much I love you.”</p><p>He nodded slowly, pushing my dress up my body. “As much as I love you.”</p><p>It was the first time he’d said it at a time I could allow myself to feel it. Those three words poured out of him and pooled into my chest and as I raised my dress over my head, lying almost naked for his perusal I smiled shyly up at him. “You know, I don’t mind what we do this morning. You can do whatever you want to me.”</p> <p>To my surprise this caused Adam to groan and he dropped his head on my shoulder.</p><p>“Baby?”</p><p>He turned his cheek and pressed a kiss to my bare skin, his hands coasting up my ribs to cup my breasts. I arched into his touch with a sigh as he replied, “How did I get so lucky? Smart, funny, sweet, beautiful, passionate and she tells me I can do anything I want to her.”</p><p>He chuckled now. “There has to be a catch.” I blushed deeply and Adam raised his head to witness it, laughing. “Fuck, I forgot modest.”</p><p>“Stop it.” I pushed playfully at his shoulders but really I needed him to stop or I was going to start crying.</p> <p>He laughed again, the rumbling against my chest doing happy things to me down south.</p><p>Giving my shoulder another quick kiss, Adam sat up, straddling me as he pulled off his t- shirt. I drank my fill, biting my lip as my eyes took him in. I’d forgotten how beautiful he was—broad shoulders and lean muscles. Abs to die for.</p><p>His eyes never left me as his hands went to the buckle on his belt. I shivered with anticipation as he undid it and drew his jean’s zip down. “This morning I’m making love to you because our first time should be about that. Plus, no matter how great you’re feeling, and I can tell you’re feeling a lot better, your body must still be exhausted. We’re taking it nice and slow.” He pushed down his jeans and underwear and my breathing stuttered as his erection sprang free, jutting up and out, hard and throbbing. Now I knew why the bugger was so confident. He was walking around with that in his trousers.</p><p>“You’re making ‘mmm’ noises,” Adam told me with laughter in his voice as he turned to shimmy his jeans clean off.</p><p>“I am not!” I protested, blushing again, and realizing I’d been so lost in staring at him that there was a great possibility I had been making ‘mmm’ noises.</p><p>“You were. It’s fucking adorable.” He turned back to me only to reach for my underwear.</p> <p>I tilted my hips to help him ease them down my legs, and as he did he stopped every now and then to kiss my bare skin. When the underwear was off, he pushed my left knee up and I watched him with growing heat coiling in the pit of my stomach as he trailed kisses up my calf, across my knee, and along my inner thigh. “Your legs go on forever,” he whispered, his eyes lifting to meet mine. “I can’t wait to have them wrapped around me while I’m inside you.”</p><p>“Adam,” I breathed completely at his mercy.</p><p>I repeated his name on an even breathier breath when his head descended between my legs and his tongue licked gently at my clit. He worked me with his mouth, kissing and licking and sucking until I came fast and hard against him.</p><p>I was still crying out to God as Adam kissed his way up my stomach and then stopped to draw my nipple into his hot mouth. He played with me a while, all the time murmuring compliments and love words, until eventually I was wound so tight I begged him to come inside me.</p><p>At the pressure of him between my legs I tensed and feeling it Adam threaded his fingers through mine and held my hands down on the bed while he stared into my eyes, anchoring me to him in every way he could. His lips parted on exhalation as he pushed inside me and sank deep. I gasped and lifted my hips in instinct causing a delicious frisson of pleasure through us both. Adam’s eyes grew lidded as he studied me, his expression tender. “I love you, Ellie Carmichael,” he whispered, his words heavy with sincerity.</p><p>I nodded and moved my hips again, panting slightly as I replied, “I love you, Adam.”</p><p>His grip on my hands became almost painful and he slid out of me nearly entirely before gliding back inside. I undulated against him, and we caught a wave, a slow rhythm that built and built until I was desperate for the finale. My legs were wrapped around him now, my thighs squeezing him tighter, begging for more.</p><p>“Adam,” I cried out, pushing against his hands, wanting to touch him, wanting to grasp him against me. “Harder, please.”</p> <p>He growled low in his throat and he pulled out only to slam back into me. I started murmuring nonsense, mostly saying the word “yes” over and over again as he continued to slam into me.</p><p>“Come for me, Els,” he demanded, his eyes on my face. “Come for me, baby.”</p><p>And like I’d been prone to doing for years, I gave him what he wanted. The rhythm hit its crescendo and I broke apart on a scream as Adam pressed his cheek to mine and tensed. I floated up around in post-orgasmic space and he shuddered hard against me as he came.</p><p>We were both panting heavily, both clammy with sweat, and I imagined we were both a little jellified. I grinned at the ceiling. That was what happened when you had the most amazing sex of your life. “Wow,” I whispered, sliding my arms around his back now that he’d let my hands go.</p><p>Adam lifted his cheek from mine, his features relaxed with satisfaction. His dark eyes, however, were glittering intensely. “Wow doesn’t even cover it,” he replied. “Been waiting my whole life for that.”</p><p>I bit my lip because that was so nice I wanted to cry.</p><p>Sensing that, he smiled and gave me a soft kiss. When he pulled back he frowned. “That was a bit of both.”</p><p>“What?” I frowned back at him in confusion.</p><p>“I started out making love to you but it’s your fault I ended up fucking you.”</p><p>“My fault?”</p><p>“Adam,” his voice went amusingly breathy as he imitated me, “Harder, please.” He shook his head as I laughed. “I’m a man of great self-control but that...”</p><p>I squeezed my thighs around him again in delight. “Are you admitting I have power over you, Adam Gerard Sutherland?”</p><p>His eyebrows puckered together as he shook his head in denial, a shake that quickly turned to a nod as I giggled beneath him. He closed his eyes in what appeared to be pleasured pain and suddenly he captured me around the waist and flipped us so he was on his back and I was lying on top of him. He held me close and I relaxed against him, understanding dawning. He just needed to hold me for a moment and remember I was okay.</p><p>Once again I was overwhelmed by the realization that he was in love with me. I smiled against his skin and snuggled closer.</p><p>After a while he murmured, “You’re on the pill, right?”</p><p>I snorted at the unexpected question and lifted my head with a raised eyebrow. “Shouldn’t you have asked that before you took me oh so wildly?”</p><p>He grinned up at me. “I wasn’t really thinking about anything but the need to take you oh so wildly.”</p><p>“Well, not to worry. I’m on the pill,” I assured him and settled back on his chest.</p><p>“Wouldn’t have mattered anyway,” he murmured, stroking my hair.</p><p>I tensed. “Meaning?”</p><p>“Meaning if an accident happened it wouldn’t matter. An accident with you is a kid with you.”</p><p>Shock held me completely frozen as I processed this. How many times had I heard Braden joking with Adam about how terrified he was of getting a girl pregnant? It was one of the reasons Braden suspected Adam never slept with the same girl twice. In his twisted male logic he thought it meant it lessened the chance of an accident, or at least it lessened the chance of a girl liking him so much she’d force an accident.</p><p>“You want a baby with me?” My throat croaked on the question.</p><p>I felt his knuckles brush down my spine in a caress that made me shiver to the tips of my toes. “Ellie, I want everything with you.”</p><p>Tears glimmering in my eyes I lifted my head and replied softly, gratefully, “I never knew you could be so romantic.”</p><p>Adam’s lips twitched in response and he shook his head against the pillow. “I’m not, but I reckon I’d do anything for you and since that has included sitting through more romantic comedies any man should have to endure, I know you’re a romantic... and I just want you happy. I’ve got a lot to make up for.” He brushed my hair back from my face. “And you make it easy.” He pulled lightly on a strand of hair, his expression suddenly serious. “But if you breathe one word of it to your brother, or anybody for that matter, there will be consequences.”</p><p>I smiled and shook my head. “I won’t tell, I promise. I like knowing something about you no one else does.”</p><p>“Then we’re even.”</p><p>“How do you mean?”</p><p>He flipped me again and I squealed with laughter as he wrestled me back on the bed. Once he had me captured with my legs wrapped around his waist, he kissed me and drew back to murmur, “I’m the only one who knows sweet ‘butter wouldn’t melt in her mouth’ Ellie Carmichael likes it when I talk dirty.”</p><p>Once again I felt my skin flush with embarrassment but I didn’t contradict him. I couldn’t because he was so damn right.</p><p>Last First Chapter “Okay, I’ve decided you can’t give these to Joss.” Adam slammed the diary closed. “In fact, you may have to burn them.”</p><p>I took it off of him and added it to the pile. “Why?”</p><p>“Because you go into a lot of detail, Els. Not just about sex but also about what I say to you before, during, and after sex.”</p><p>I tried not to laugh and failed miserably. “You mean the romantic stuff?”</p><p>He gave me an unimpressed look. “You are not giving that to Joss. She’ll tell Braden and I’ll never hear the end of it.”</p><p>“You know Joss tries to be considerate since Braden’s my brother but sometimes things slip and what slips is that he can be a romantic too.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Adam’s eyebrows rose and I saw his mouth start to curl mischievously at the corners.</p><p>“Romantic how?”</p><p>I grunted at him. “As if I’m going to tell you and give you ammunition to torture him.”</p> <p>“It’s only fair if you’re going to give him ammunition to torture me.”</p><p>Chuckling at his fear that my brother would discover Adam’s softer side, I shook my head slowly and answered casually. “I’m not.”</p><p>“What do you mean you’re not?”</p><p>“I’ve decided not to give Joss the diaries.”</p><p>Cocking his head in confusion Adam’s eyes asked the question for him.</p> <p>I shrugged. “I was going to up until that last entry. Reading it all just reminded me how much we felt, how much we feel, and how much a part of us it is. It doesn’t belong to anyone else and I guess I don’t want it to. It’s ours. Our history. Our story. And in a way our future too. As much as I love her, you’re right. I can’t give that to Joss. I can’t give these to her. ” I gestured to the diaries and then got up on all fours over the scattered mess in a move to put them away. I was abruptly stopped by the pressure of Adam’s hands on either side of my hips.</p><p>I looked back over my shoulder, my eyes widening slightly at the sight of him on his knees behind me with the most carnal and possessive look on his face. My lips parted as he pulled my arse into him and I felt his erection rub against me. “What are you doing?” I asked on a whisper.</p><p>In response he slipped his hand around to the zipper on my shorts and tugged it down as his other hand tugged the zipper down on his jeans. “In a little while we’ll go upstairs to make love, but right now I’m going to fuck my future wife on top of our history.”</p><p>Somehow Adam managed to get the “f-word” into the most romantic sentence ever, and I didn’t care. Instead I gasped as he rocked against me and hoarsely replied, “What about the floor? We might scratch it.”</p><p>He stroked his hands up my spine and brought them back down to grip my hips and he hauled me harder against him. “Do you really think I give a shit about the floor right now?”</p><p>I shook my head, already flushing with anticipation. “I’m guessing not.”</p> <p>Adam grinned wickedly. “Let’s start the next chapter, baby.” </p> </body></html>"]