["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>April 26, 2007</p><p>Dear King Alexander,</p><p>My name is Nicole Krenski, and I am your illegitimate daughter. My mother was Tanya Krenski; she was formerly a bartender at the Suds Bucket, which is where you met. You saw her socially for about three weeks before you married Queen Dara. (She—Mom, not the queen—used the money you gave her to finish paying for her journalism degree, moved to America, and we lived in Los Angeles for many years while she worked as a reporter for the Times. Not the queen, Mom.)</p> <p>I’m sure you get these kinds of letters all the time, so I’ve enclosed my DNA results, as well as most recent blood work. If you prefer your own physicians to examine me, tough nuts...I hate needles.</p><p>My mother passed away recently without ever telling me who you were. When her attorney read me her last will and testament, I was pretty shocked, and it’s why I had to write to you.</p><p>To tell you a little about myself, I am five foot seven, with blue eyes and dark brown hair. My birthday is March 20, 1972. I enjoy tennis, cooking, and the collected works of Pat McManus and Carl Hiaasen. I work as a hunting and fishing guide for the Outer Banks Co. out of Juneau, and in my spare time I punch up scripts for Hollywood. The former is infinitely more satisfying, but the latter pays the rent.</p><p>I don’t expect to hear from you, so don’t feel bad. To be blunt, I can understand how a bastard popping up out of nowhere would be awkward for you and the rest of the royals. I just wanted you to know about me, but I understand you have many responsibilities, both family and professional.</p><p>I’ve attached my contact information in case you want a lackey to reach me. But if I don’t hear anything, no hard feelings.</p> <p>Sir, I hope this letter finds you in all good health.</p><p>Sincerely yours,</p><p>Nicole</p><p>Part One</p><p>BASTARD</p><p>Chapter 1</p> <p>“H oly mother of God!” King Alexander II yowled. Jeffrey Rodinov, who had been casually leaning against the closed door of the king’s office, instantly sprang back, then went through the door. He didn’t open it and run through. He went through the door, his nine mil in his left hand. The safety was off. It was always off.</p><p>“Sir, get down!”</p><p>“I’m having a heart attack here, Rodinov, so don’t point that thing at me.” The king had a piece of paper crumpled in a large fist. “Holy Jesus! My God!”</p><p>Jeffrey snatched his two-way from his right hip, pressed the Call button, and barked, “Code seventeen, the Boss’s office, yesterday.” In other words, Dr. Hedman, get your ass up here pronto.</p><p>“Can you believe this? I can’t friggin’ believe this.” The black-haired, blue-eyed king, head of the Royal House of Baranov, was normally the picture of ?orid health. Right now he was as pale as the paper he was clutching.</p><p>Jeffrey had never seen him like that, not even after he’d been shot four years ago. (The first, and last, vacation Jeffrey had ever taken. Left the country for one damn month and the whole place fell apart.)</p><p>“Sir,” Jeffrey began, only to be interrupted as Edmund Dante, the king’s majordomo, galloped through the shattered doorway, then screeched to a halt in front of the large mahogany desk.</p><p>“My king,” Edmund gasped. “How may I assist you?”</p> <p>It was a day for surprises; Jeffrey had never seen Mr. Dante so rattled. The king’s special assistant was as tall as His Majesty, but thin as a stick. He had served the Baranovs since time out of mind and as such, had no fear of any of them.</p><p>He also had two master’s degrees, one in Alaskan history, the other in Alaskan literature. The princesses had nicknamed him Ichabod Brain, something no one—not even the king—would dare say to his face.</p><p>Edmund Dante ruled the royal family with equal parts love and uncompromising ruthlessness. The RST (Royal Security Team) had as much respect for Dante as they did for any of their charges. They also took bets on whether Mr. Dante had ice water for blood or nothing at all.</p><p>“Is anyone going to tell me what’s going on?” Dante asked mildly.</p><p>Jeffrey shook splinters out of his hair. “He yelled. I came. Nobody’s here; it’s clean. Doc’s on the way.”</p><p>“I don’t need a damned doctor!”</p><p>Edmund stared critically at the doorway. “No, but you certainly need a carpenter. At the risk of wasting time by repeating myself, my king, how can I be of service?”</p><p>The king gargled in reply and thrust the smushed paper at his assistant. Edmund read it in four seconds, then read it again.</p><p>“Hmmm.”</p><p>“That’s it? Hmmm? I’ll hmmm your scrawny butt, Dante.”</p><p>“I tremble before your wrath, my king. May I see the envelope?”</p><p>“I thought you screened all the king’s mail,” Jeffrey asked, dying to know what was in the mysterious letter, but too proud to ask.</p><p>“Ninety percent,” Edmund replied absently, glancing at the envelope, which had been neatly slit by one of the battalion of royal secretaries.</p><p>“Yeah, and I keep telling you to ramp it up to ninety-five,” the king said, gesturing to the piles of paper all over his desk.</p><p>Mr. Dante ignored the king; he was probably the only person in the country who could get away with it. “A few things slip by. Perhaps one of the admins read it and felt it was for the king’s eyes only.”</p><p>“Ya think?” The king ran his blocky fingers through his thick black hair. Although in his early sixties, he looked fifteen years younger, with very little gray in the hair he had passed on to nearly all of his children. “I got another kid running around?”</p><p>“Or not.” Edmund was now looking at a piece of paper that was still in the envelope. “DNA tests can be faked. This entire thing may be a fake. You have not forgotten you are the seventh richest man on the planet, I trust.”</p><p>“Well, holy old cripes, I guess it slipped my mind.”</p><p>“Mr. Rodinov, will you kindly holster your weapon? Goose season is several months away.”</p><p>“Yes, sir.” Jeffrey didn’t bother to point out that a nine mil would be a poor weapon for hunting geese. “Majesty, if you don’t need me, I’ll be at my post.”</p><p>“Thanks, Jeff.” Only the king got away with that; he hated the nickname. “And thanks for the response time. Sorry I scared you. Cancel the doc, okay?”</p><p>“Quite all right, sir. And I will.” Jeffrey bowed but, as Baranov royal protocol was much less rigid than most other royal protocols, was able to turn his back on the king and walk out.</p><p>He canceled the code seventeen, then took up his usual position, but since there was no longer a door, could hear everything. That was fine. That was more than fine. He liked being invisible. It made his job infinitely easier.</p><p>The Boss and Mr. Dante’s voice drifted into the hallway. Jeffrey took it as a mark of trust that neither of them bothered to lower their voices. “My king, there is one question on my—”</p><p>“Yeah, you know I had doubts about marrying Dara.”</p><p>“I was always surprised you went along with an arranged marriage.”</p><p>“Hey, my dad was sick and it was what he wanted. And you know how it is—a crown prince without heirs makes everybody nervous. But I still felt like they were jamming that wildcat down my throat. So I had a fling before the wedding. Nice gal. Really nice gal. Bartender, like the letter said. The woman made a mean Rusty Nail and that’s no lie.”</p><p>“Fascinating.”</p><p>“We had a good time. She knew who I was and didn’t give a ripe shit. I liked that. Hell, I loved it.”</p><p>“And then...?”</p><p>“And then I got married. She knew the score; we had a nice good-bye and that was that. She never told me about any baby. Why didn’t she tell me?”</p><p>“I’m still trying to deduce why she bedded you,” Edmund admitted.</p><p>“Shaddup. Not a peep. Never asked me for a thing, never wrote me, never called. I just thought...you know. A nice memory and that was it. Then Dara got knocked up right away with David and we were off to the races.”</p><p>“So you’re saying it is biologically possible.”</p><p>“You kidding? I was barely out of my teens. I could go all night in those days. And we did, believe me.”</p><p>“Majesty, could you hand me that trash can? I’m feeling the uncontrollable urge to vomit blood.”</p><p>“Knock it off, tight ass. First thing we gotta do is find out if this, uh—”</p><p>“Nicole, Majesty.”</p><p>“Yeah, if this Nicole is the real deal. And then—”</p><p>“Perhaps it’s best if we take it one thing at a time, my king.”</p><p>“Yeah, perhaps.”</p><p>“I will contact the lab that did these tests. If they verify the blood work, I will make arrangements for our own tests.”</p><p>“Yeah, but she says she doesn’t want any more needles.”</p><p>Jeffrey heard a short silence, and then a distinctive sound: Edmund snorting. “You are her king, sire, and your will is Alaska’s will. Her wishes have no bearing on the situation.”</p><p>“Great, Edmund. Spoken like a true Nazi.”</p><p>“I live to serve, Majesty.”</p><p>Chapter 2</p><p>N icole Krenski, bastard princess of Alaska, daughter of a bartender and a king, counted to ten.</p><p>“Hey, I almost got that one,” her client chirped, yanking on his fishing rod with all his might.</p><p>“That’d be great, Jim, if we were fishing for pine trees. Give that to me.” Before I stick it up your ass. With a few practiced tugs, the Daredevil lure freed itself from the tree and plopped into the water. Nicole slowly started reeling it in, and felt a nibble. “Okay, you got a bite. Now remember what I told you.” Twenty-five times. “Carefully set the hook and—”</p><p>He snatched the rod from her hands and gave a mighty yank, which only ripped the lure out of the fish’s mouth.</p><p>“Hey, I think I’m getting the hang of this!”</p><p>Nicole scowled at the short (her height) balding stock broker on vacation from New York City. “Jimmy?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah, babe?”</p><p>“Do not call me babe. And if you ever take a fishing rod away from me without my permission, you’ll be shitting five-pound test line for three days.”</p><p>Jimmy gulped and managed a smile. Nicole knew full well that clients hit on her when they got a look at her tits and eyes and whatnot, and gave up when she proved she had nothing in her veins but river water. At least as far as her customers were concerned, she’d sooner lay a grizzly than someone who paid her bills.</p> <p>Jimmy sketched a mock salute. “You got it, boss lady. Ready to try again?”</p><p>“Sure.” One. Two. Three. Four. Five. “Nice and easy. Use your wrist, not your arm.” Six. Seven. Eight. “Release the bale. And—you’ve caught another tree.”</p><p>Meekly, Jimmy handed back his rod. “Could you get that out of the branch for me, please?”</p><p>“My pleasure,” she groaned. Oh God, please save me from tourists. Especially big city tourists.</p><p>“Maybe we should try a different spot.”</p> <p>“Maybe I should try a different client.”</p><p>“That’s cold, babe. I guess we really are in Alaska.”</p><p>“You don’t know what cold is. And don’t call me babe.”</p><p>Chapter 3</p><p>E xhausted—more from Jimmy’s refusal to learn anything other than any real physical exertion—Nicole dropped him off at the Juneau branch of the Outer Banks Co. office and drove to her trailer, faking a cheerful wave as she sped off in her pick-up. At least this one hadn’t tried to grab her boobs when she bent over to tie on a sinker. And when did that guy get out of the hospital? Her boss had told her but she’d forgotten.</p><p>As always, her spirits lifted at the sight of the neat brown and cream mobile home at the far edge of the Juneau town limits. It was small, but she didn’t need much space, and the large shed held all her hunting and fishing equipment.</p> <p>Best of all, the trailer backed up to 500 acres of wilderness. She’d had deer, possums, raccoons, snakes, rabbits, bears, and moose in her yard. Sparrows, woodpeckers, blue jays, hummingbirds, chickadees, plovers, and terns visited the dozen birdfeeders she kept full. And occasionally, Great Gray Owls swooped down and helped themselves to a plover or chickadee. Ah, well. Nature red in tooth and claw and all that.</p><p>Once a gut-shot deer had staggered into the yard and she’d put the poor thing out of its agony with a quick shot to the head with one of her rifles. The doe had never had a chance; it had been trailing viscera through her yard. She’d then called the Game Warden; when he showed up, he’d offered her the venison. She had declined, having a freezer full of wild game. She hoped the idiot who hadn’t bothered to track his kill would contract malaria in the near future.</p><p>Nicole carefully put her equipment away, locked the shed, then went through her front door. The place was immaculate, as usual, and sparsely furnished, as she liked it. Perfect order, perfect solitude. Her CDs and books were alphabetized; all the cans and boxes in the pantry were lined up. If only her mother had—</p><p>But her mother’s death was too recent and raw, and she shoved the thought away, hard. Her mother had left her enough money to buy the trailer new, for cash, and not much else. Oh, and her mother had also left her a favor. A last wish, as it were.</p><p>Her answering machine was blinking. She knew it wasn’t the office; they didn’t guide at night. She knew it wasn’t her dead mother. She had no friends, only acquaintances, and hadn’t been laid since her mother had gotten sick. Therefore...</p><p>Dammit.</p><p>She stabbed the Play button and heard a cultured, cool voice say, “Miss Krenski, my name is Edmund Dante and I am calling from the Sitka Palace regarding a letter you sent King Alexander. His Majesty the king requires an audience with you at once, as well as an examination by the royal physician. Please call me at 907-263-9331 at your earliest convenience. Thank you.” Click.</p><p>Nicole chewed her lip and thought about it. And thought about it some more.</p> <p>And then she erased the message.</p><p>Chapter 4</p><p>N icole erased the new message the next day.</p><p>And the next.</p><p>And the next.</p><p>Chapter 5</p><p>N icole dropped her client, a perfectly pleasant family practitioner named Sandra Dee, of all things, at the Outer Banks Co. and pocketed the generous tip.</p><p>Sandra Dee, also from New York City, had caught on at once and spent the afternoon kicking ass and filling the live well. The small redhead nearly staggered under the weight of the fish on her stringer. Nicole unhitched the boat trailer, mentally promising her boss she’d come back first thing in the morning and hose it down.</p><p>Nicole couldn’t help but laugh as her giddy client bounded up the steps to the office with one final wave over her shoulder. These were the best days for her: showing someone a skill they had not known they possessed. Showing a stranger the utter and mystifying beauty of the Alaskan wilderness and recognizing the look on their face, the awe of someone at a stirring church service.</p><p>She swung by Chicken Lickin’ for a three-piece meal, hold the biscuits, extra gravy. Mmm...gravy. She’d drink it by the glass if she could. The thought made her grin.</p><p>Her smile faded as she saw the long black car parked in her driveway and the two men loitering on her front lawn. She didn’t slow and didn’t look in that direction again. She stared straight ahead—nope, nothing wrong here, and I certainly don’t live there, which is why I’m not looking at you two—and kept going past her trailer.</p><p>She found the back trail leading into the woods, got out of her truck and locked the hubs, then got back in, engaged the four-wheel drive, and bounced and jounced until she was only half a mile from the south side of her property.</p><p>Muttering under her breath, Nicole popped open her glove compartment and pulled out the .38. A poor weapon at long range, but she had every expectation of getting nice and close. Besides, the rest of her guns were in the shed. She cursed herself for not installing a gun rack in the truck. Well, maybe next week.</p><p>Nicole locked the truck (some of her rods were custom made) and stole through the forest on foot, noisy as a salamander. She came up on her trailer from behind, knelt, and carefully slid aside the panel to the left of the back door. She belly crawled beneath her trailer until she was beside her porch.</p><p>One of the men was sitting on her porch; the other one—the armed one, no mistaking the bulge on his hip, even from the road—was standing beside him. In fact, he was standing about nine inches in front of her face.</p><p>She supposed most single women might wonder why armed strangers were waiting for her in her yard, but she’d never been one to sweat the why of things.</p><p>She noiselessly slid the panel back, reached, clutched his ankles, and yanked. The man hit the ground face first and in a flash she vaulted from cover, sat on him, and pressed the barrel of her gun to the back of his head.</p><p>“That’s a .38,” she informed him. “Normally a pea shooter, but at this range, it’ll ruin your week.”</p><p>“Ow,” the man said calmly into the grass.</p><p>She relieved him of his sidearm, a spotless nine millimeter, and tossed it behind her, beneath her trailer. “When you get it back, you might want to break it down and hit it with some gun oil. It’s pretty dirty under there. Also, I don’t like surprises.”</p><p>“I never would have guessed,” the stranger mumbled into the turf.</p><p>“Oh, for God’s sake,” the man on the porch said in a deep voice, sounding exasperated and charmed at once. She turned her head, not moving the gun.</p><p>“You!”</p><p>“Me,” the King of Alaska replied agreeably. He was dressed in jeans and a blue oxford shirt with the sleeves rolled up to the elbows. He had his chin cupped in his hand (he needed a shave) and took her in at a glance: the brunette hair, the blue eyes, the dirty shirt and jeans, the gun.</p><p>“Yep,” he said, sounding almost...cheerful? “You’re one of mine, all right. Nice to meet you, Nicole.”</p><p>Chapter 6</p><p>“G o away,” Nicole said warmly.</p><p>“Aw, don’t be like that, kiddo. And would you mind putting away the pea shooter? You’re hurting Jeff’s feelings.”</p><p>“Not to mention my kidneys,” the man mumbled into the ground.</p><p>She carefully got off the man but kept the gun at her side.</p><p>“That’s better,” the king said as Jeff climbed slowly to his feet. “So, I’m Al, your dad. And we know who you are. That’s Jeff, head of my detail.”</p><p>She smirked. “And you’re not dead yet?” She was being nasty because she was so completely distracted by the bodyguard’s size. When he stood, he went up and up and up. Well over six feet and probably 220, none of it fat. He was built like a linebacker. He hadn’t looked so big from the road. Or so gorgeous.</p><p>No. She did not think that. Sure, he had lush, curly black hair—true black, not dark brown—and pale blue eyes. Sniper’s eyes. He had a built-in tan (was he part Akiak? or maybe Ekok?) and the muscular definition of a champion lifter. His head and hands were blocky, like they had been carved by a skilled craftsman who was in a hurry. He filled out his black tailored suit—a man his size couldn’t buy off the rack—superbly.</p><p>Gorgeous? Please. She was just distracted because she hadn’t been laid in 29 months and 18 days.</p><p>“Sire,” he was saying, “I apologize. I will tender my resignation at—”</p><p>“The hell. I didn’t hear a thing either. Serves us right for showing up on her turf without calling. Oh, wait. Edmund’s been leaving her messages all week.” The king beamed at her. “Should have had the palace guards drag you to my place instead.”</p><p>“Dead palace guards,” she informed him. “Mutilated subjects. Body parts all over the Sitka Palace.”</p><p>“I see you inherited none of your mother’s charm. Just my mouth. Oh, and my fabulous good looks,” he added modestly.</p><p>“Like you knew a thing about my mother.” It made her angry, it enraged her, to hear this pampered cheating bastard talk about her dear dead mom. “She was a fling, a one-night stand that lasted for a week or two.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“She was lovely and sweet and funny, and you will watch your tone when you speak to me, Nicole.”</p><p>She almost took a step backward. He hadn’t been smiling. He hadn’t been fucking around. He had sounded like—well, like a king.</p><p>“Sorry,” she muttered.</p> <p>The king cheered up instantly. “That’s all right. It’s been a weird week for everybody. So if you’ll just hop in the car, we can go back to the palace and—”</p><p>“No.”</p><p>“What?”</p><p>“No, King Alexander.”</p><p>“Bad idea,” Jeff said quietly at her left shoulder.</p> <p>Without turning her head, she snarled, “Nobody hit your buzzer, Jeff.”</p><p>“Please don’t call me Jeff,” he whispered in her ear. Annoyingly, all the hairs on her left arm stiffened to attention, and she jerked her head away from his mouth.</p><p>The king coughed. “Uh, Nicole, I’m sorry we got off on the wrong foot, but I wasn’t exactly asking.”</p><p>“I’m not going and I do not submit to your authority, sir.”</p><p>“Uh.” The king shot Jeff a look and coughed again. “You sort of don’t have a—”</p><p>“How quickly we forget, King Cheats-on-His-Fiancée. You might want to reread my letter. My mother and father were Alaskan citizens, but I was born in Los Angeles.”</p> <p>The king scowled. “Dual citizenship.”</p><p>“Right-o.” Under Alaskan law, merely residing in Alaska did not mean you were a subject of the king. You needed to be Alaskan on both sides and born in the country. Any deviation resulted in dual citizenship, and the gentleman (or bastard princess) in question could claim the other country as her own. “So thanks for stopping by, ta-ta, so long, get lost.”</p><p>The king stood and, like Jeff, he went up and up and up. Of course, he was standing two steps above her, but still. She craned her head to glare up at him. “Go away now.”</p><p>“I don’t get it,” he complained.</p><p>“I’m not surprised. Mom didn’t like you for your keen intellect.”</p><p>The bodyguard actually flinched, but the king didn’t move. Instead, he scowled down at her. “I’m gonna let that one go by.”</p><p>“Thanks gobs.”</p><p>His black brows caromed together and his eyes were dark blue slits. But she would not be intimidated! Well, not much.</p> <p>“If you didn’t want to see me,” he bitched, “and you don’t want to come to the palace, why the hell did you write me that letter?”</p><p>“Because my mother asked me to. It was in her will. She told me about you and she asked me to get in touch, and that was all she asked.” And it was damn sure all she was going to do. “It was the only thing she ever asked of me in twenty years.”</p><p>“Oh.” Then, quietly, “I’m sorry about your mother. She was wonderful.”</p><p>Tears stung her eyes; on the whole, she preferred him kingly and commanding and generally acting like a jerk. “Go,” she said. “Please.”</p><p>The bodyguard—Jeff—reached under her trailer with a long arm and retrieved his gun. He gave her a look she couldn’t figure as the king thumped down her steps.</p><p>“Well,” the king said after an awkward pause.</p><p>“Good-bye,” she said.</p><p>Without another word, they left.</p><p>Nicole fumbled for her door, ran into the trailer, collapsed on the couch, and wept for fifteen minutes. Then she got up, walked to the bathroom, washed her face, and kicked a hole in the cupboard under the sink.</p><p>Chapter 7</p><p>A lexander Baranov, descendant of Russian rebels who took a country for themselves, bounded into his office, with Jeff right on his heels. Edmund was spreading out various paperwork for him to sign, which on any other occasion would have dampened his mood and made him contemplate loading a shotgun.</p><p>“Good heavens,” Edmund said, eyeing the rumpled Jeff. For Edmund, that was the equivalent of “Holy hell!” “What happened to you, Jeffrey?”</p><p>“My kid,” Al couldn’t help bragging. “She got the drop on both of us.”</p><p>Edmund blinked slowly, like a gecko. This was the equivalent of anyone else yelling, “Oh my God!”</p><p>“My king, I remind you that we have yet to verify our own DNA testing and—”</p><p>“Yeah, yeah, but I’m telling you. She’s the spitting image of Alex and Kathryn. She’s got the Baranov blue eyes and the dark hair.” Al plopped into his chair as Jeff took up his position just inside the doorway. Al knew Jeff’s humiliation was a live thing, a stinging thing, and he would stay closer than usual until the sting wore off. Although he was pleased with Nicole, he felt for his proud bodyguard and made no comment when Jeff didn’t leave the office.</p><p>“Mouthy, too,” Al continued, trying not to grin and failing. “I didn’t see much of her mother in her, to tell the truth. But I know it like I know how to gut a salmon: Nicole Krenski is my daughter.”</p><p>“Pure poetry as usual, my king. May I meet her?”</p><p>“Uh.” Al glanced at Jeff, who remained a stone. “Well, she refused to come with us.”</p><p>Edmund, tidying still more paperwork, froze. This was the equivalent of anyone else yelling, “What the holy hell are you talking about?!?”</p><p>After a long silence, Edmund straightened and put his fingers together, Mr. Burns style. The only thing missing was a drawn-out “Ehhhxxxceleeent.”</p><p>Edmund took a breath and let it out. “She...refused?”</p><p>“Flat out.”</p><p>“But she cannot. She may be royalty, but she is also your subject, and as such, she—”</p><p>“Nope, dual citizenship.”</p><p>“Dual...ah.” Edmund tapped his long, skinny fingers together. “But if she refused to return with you, then why did she bother to—ah. Perhaps her mother asked her to? A, erm, dying wish, perhaps?”</p><p>“Right on the nose, Eddie.”</p><p>“Sire, if you call me that again I shall instantly tender my resignation, and then disembowel you.”</p><p>“He threatened the king,” Al told Jeff. “That’s worth prison time. My great granddaddy signed the bill himself.”</p><p>Jeff didn’t move, or speak. It was the rare week Edmund didn’t threaten to resign or slaughter the royal family, or both.</p><p>“God, what a kid,” Al continued, leaning back in his chair and lacing his fingers behind his head. He sighed happily. “Got the drop on us, jammed that .38 in the back of Jeff’s head—”</p><p>There was the dull thud as Jeff banged the back of his head on the wall, his eyes closed. Politely, Al and Edmund ignored it.</p><p>“—sassed me like you wouldn’t believe, then kicked us off her property. It was unbelievably wonderful.”</p><p>“It, er, sounds unbelievably wonderful.”</p><p>Jeffrey banged his head again.</p><p>With a worried glance at the head of his detail, the king finished, “Nobody’s talked to me like that since Christina joined the family.”</p><p>“She certainly sounds like a Baranov,” Edmund admitted. “Sire, it is vital we verify her bloodline. You realize the ramifications.”</p><p>Al did. He wondered what his eldest son, David, would think about all this. What all the kids would think.</p><p>“D’ you think I should tell the kids now or wait until we have proof?”</p><p>Edmund hesitated. “My king, I would not presume to advise you on such a personal matter.”</p><p>Jeffrey made a strangled sound that he managed to turn into a cough; Al laughed outright. “Since when? You got a fever or something, Edmund?”</p><p>Jeff cleared his throat. It sounded like gravel in a blender. “Let me go back, Majesty.”</p><p>Surprised, Al glanced at his bodyguard. “What? Jeff? Did you hit your head too hard on the wall?”</p><p>“Sire, let me go back and try again.”</p><p>“Jeez, I dunno...I thought we’d give her a little space before trying again.”</p><p>“My king, you know that is unacceptable!” Edmund was as upset as Al had ever seen, and that was saying something. He had actually raised his voice. “We cannot let this sleeping dog lie!”</p><p>“Try to resist referring to my kid as a dog.”</p><p>“I require proof she is your kid, my king. And you know why. And you know we cannot delay.”</p><p>The king shifted uncomfortably in his chair. “Yeah, but—”</p><p>“Sire, forgive the interruption, but let me go back,” Jeff urged. “First thing tomorrow. I’ll switch detail with Reynolds. I can do this. Please let me do this.”</p><p>“Jeez, Jeff...”</p><p>“With all do respect, Jeffrey, if the king could not persuade her, I fail to see what—”</p><p>“Hush up, Edmund. Give me a second here.”</p><p>Al thought about it. The two men let him. Finally, he said, “I don’t see the harm. And if you’re willing, it’s fine by me, Jeff.”</p><p>“Thank you, sire.”</p><p>“Wait.” This time Edmund was thinking, and the two others let him. After a short silence, Edmund made a suggestion, showing his usual cool good sense, and Al instantly accepted the advice. Then he gave Jeff his instructions.</p><p>“My king,” Jeff acknowledged, and bowed. Then he did something Al had never seen him do: he grinned.</p><p>Chapter 8</p><p>G ulping the last of her coffee, Nicole swung into the driveway of the Outer Banks Co. She was surprised to see a strange car beside her boss’s and the other guides’. She nearly always beat the clients in. Who’d bother showing up at 6:30 A.M. if they didn’t have to?</p><p>She hopped out of her truck, locked it, then crossed the damp lawn, enjoying the spring sunshine. Winter had a pretty good grip every year, but it always eased up, and she was always surprised when it happened. It was finally jacket weather, which meant in hot southern places like North Dakota it was shorts weather.</p><p>Spirits high, Nicole bounded up the steps and into her boss’s office.</p><p>And groaned.</p><p>“We meet again, Nicole,” the bodyguard told her. He was decked out for fishing—old jeans, faded flannel shirt, work boots. His curly black hair was rumpled, as if he’d spent the time waiting for her running his fingers through it. She wanted to run her fingers through it, to see if the texture was as silky as it looked. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>No, she did not.</p><p>“Nicole, this is Jeffrey Rodinov—”</p><p>“We’ve met,” she said shortly.</p> <p>“Who works at the Sitka Palace,” her boss, Mike Freeborg, continued excitedly. A Minnesotan who had moved to Juneau fourteen years ago, Mike looked quite a bit like his Norwegian forebearers: large, broad-shouldered, blond hair, green eyes. The other guides called him The Viking. And although he looked fierce, he had the temperament of a pampered kitten. “And he asked for you personally.”</p><p>Nicole groaned again.</p><p>“You okay?”</p><p>“No.”</p><p>“Diarrhea?”</p> <p>“I wish.”</p><p>“Oh.” Mike shrugged his massive shoulders. “Well, anyway, show him a good time.”</p><p>“I will not.” She felt her face getting hot, which made her mad, which made her redder.</p><p>Oblivious, Mike continued. “Fill the boat—not that you’re taking the boat—so he goes back to the palace and tells them all about our little outfit here.”</p><p>“I quit,” Nicole said.</p><p>“You can’t quit,” her boss yawned, showing his back fillings. Nicole quit three or four times a month. “Sandra Dee’s coming back next month and she also asked for you personally. That was a five-hundred-dollar tip, right?”</p> <p>“Then I’m on vacation effective this minute.”</p><p>“Ha! We both know you have no life at all. This job is your vacation.”</p><p>She cursed his perfect estimation of her character.</p><p>“Now get going.”</p><p>Nicole glared at the bodyguard, who smiled back. “Prepare for a day in the darkest depths of hell,” she informed him.</p><p>“Oh, I’m prepared,” he replied. “I’m bristling with weapons and pepper spray, not to mention my rape whistle.” Courteously, he opened the door for her. “After you, Nicole.”</p><p>Chapter 9</p><p>J effrey landed the fish, deftly worked the hook out of its lower lip, and then tossed it back into the river.</p> <p>Nicole was sitting beside him on the bank, her head in her hands. “You know how to fish,” she mumbled into her palms.</p><p>“Could be I went out a time or two with my dad,” he admitted, baiting the hook and casting again.</p><p>“And you sound like a local.”</p><p>“As local as you can get,” he admitted. “Russian on my dad’s side, Ekok on my mom’s.”</p><p>“That explains the blue eyes and the built-in tan. You’re sure as hell not a tourist. You don’t need me to take you out.”</p><p>“Maybe I haven’t been able to get you out of my mind since you shoved your gun into my head.” This, unfortunately, was nothing but the truth.</p><p>Nicole jerked her head up and glared at him. He froze, mesmerized by the Baranov blue eyes. Funny how he knew six other people with eyes that exact same shade, none of which had the same effect on him. “Very funny. You can go back and tell the king he’ll die of old age before I show up and get poked and prodded, and then play princess for him and those other weirdos.”</p><p>“Those other weirdos,” he said mildly, “are your family.”</p><p>“Maybe I’m lying. Maybe it’s a hoax.”</p><p>He laughed.</p><p>She jumped up and stomped her foot. “You don’t know. So don’t pretend blue eyes and dark hair is a ticket into the royal family. You’ve got blue eyes and dark hair.”</p><p>He yawned. “My family has been taking care of the royals for three generations. I know a Baranov when I see one. And so does the king.”</p><p>“The king,” she muttered, pacing back and forth on the bank. She cursed as she stepped into some mud, shook her foot, then nearly overbalanced into the river, and cursed more. Jeffrey listened with admiration; she knew swear words he didn’t, and he’d done a stretch in the AAF (Alaskan Air Force). “Did he tell you he cheated on his fiancée with my mom, and then dumped her to get married?”</p><p>“Lucky for you,” he pointed out.</p><p>She actually gurgled with rage and her hands snapped into fists. He faked a cough so she wouldn’t see him grin or hear him laugh.</p><p>“Do you always do that?” she demanded.</p><p>“What?”</p><p>“Make unanswerable observations?”</p><p>“Only with you.”</p><p>“Oh, how romantic,” she mocked, fluttering her long black lashes. “It gets me right here.”</p><p>He certainly hoped so. Because she was really something. Gorgeous, mouthy, smart, knew her way around a fishing pole. Killer body...slim, but muscular; doing guide work kept her in good shape. Trim-hipped in blue jeans, a red T-shirt, and a bright blue windbreaker; the spring breeze had kissed roses into her cheeks and made her eyes sparkle. Or perhaps glitter with rage; it was hard to tell.</p><p>Jeffrey tried to understand why this particular Baranov had such an effect on him. He certainly hadn’t been attracted to Kathryn or Alex. Of course, he’d known them since they were kids. And God knew he wasn’t attracted to the king, or the other Alex. Of course, he wasn’t gay or bi. So why this one?</p><p>Because Nicole was different. She had royal blood in her veins but was raised by a commoner. The two of them against the world, no doubt. He doubted she had the slightest idea of the effect she had on men. Those magnetic blue eyes alone—</p><p>He felt a nibble, waited with the patience of a python, and then at a firmer bite set the hook and reeled it in, unhooked it, tossed it back into the river with a plop, and then baited his hook again.</p><p>“Plus you’re doing catch and release! You don’t even need me to clean them for you. There’s no reason for me to be here at all.”</p><p>“There’s every reason.”</p><p>“Oh, please, can we stop with the Obi-Wan speak? What’s your game plan, slick?”</p><p>“To charm you into coming back to the palace with me.”</p><p>“Ha!”</p><p>“Why not? You had to know this would happen when you wrote what you wrote.”</p><p>“When I wrote what I wrote?” She stopped pacing and stared down at him. “You didn’t read it?”</p><p>“Of course not. And I would never ask. It was the king’s personal correspondence.”</p><p>“Oh. Uh, I didn’t think about it that way. That you didn’t—sorry,” she said, looking like the apology tasted bad. Again, he had to force a cough. “Well, I wrote him who I was, reminded him about my mom, left my phone number, and that was about it.”</p><p>“Well, as I said, you had to know there would be consequences.”</p><p>“It’s not like I had a choice, did I?”</p><p>“Your mother’s dying wish?”</p><p>“Now how did you know that?”</p><p>“Edmund Dante guessed, and the king confirmed. Mr. Dante is the man who has been leaving messages for you. He pretty much runs the palace, and the royal family.”</p><p>“Swell. He tries to run me and I’ll break both his ankles.”</p><p>“Tough to do from a riverbank.”</p><p>“Oh no you don’t! I’m wise to you, Mr. Bodyguard.”</p><p>Oh no you aren’t, sweetie.</p><p>“I have another bite,” he said smugly.</p><p>“And I,” she announced, “have a migraine.”</p><p>Chapter 10</p><p>W ell! She handled yesterday pretty well, considering.</p><p>Considering the fact that she wondered what he looked like with his shirt off.</p><p>No, she did not.</p><p>Oh yes, you did, liar. Can’t you be honest with yourself ever?</p><p>“Shut up,” she snapped at herself. She occasionally had entire conversations with herself. Most of the time she attempted to keep them inside her brain.</p><p>But! She had handled him just fine. Refused to head back to the, God forbid, Sitka Palace. Sent him on his merry way. Ignored Freeborg’s insistence she give him a blow-by-blow recap. Drove home. Had McNuggets. Didn’t think about him once.</p><p>Liar!</p><p>“Shut up!” she yowled, slamming on her brakes and wincing at what the spraying gravel was doing to her truck’s ruby red paint job. She shut it off, shoved the door open, fairly leaped to the ground, and then darted into the office.</p><p>And groaned.</p><p>“Nicole!” Freeborg yodeled when he saw her. “He’s back! And he brought—”</p><p>“I know who the crown prince is, Mike, Gawd.” She ignored Prince David Baranov’s outstretched hand and scowled. “Everybody who reads People or The Juneau Empire knows who he is. Got an overwhelming urge to fish, Prince David? Not enough protein up at the palace?”</p><p>“Actually, I need some food for my penguins, but that’s not why I’m here.”</p><p>“Well, don’t let the door hit you between the eyes on your way out.”</p><p>By reply, the prince turned to Jeffrey and said, “Uh-huh. I see what you mean.”</p><p>“Talk about me like I’m not here again and you’ll be a neutered crown prince. And then where would we be?”</p><p>“Nicole!” her boss screamed, horrified.</p><p>Prince David grinned and pointed a finger at her. “Jailable offense! Maybe a month or two behind bars will make the palace look like a better option.”</p><p>“Try it.”</p><p>“Uh, Your Highness, she tends to go about heavily armed.” Jeffrey was nervously eyeing her windbreaker.</p><p>“What, ‘heavily’? It was a lousy .38.”</p><p>“Did you really get the drop on him? Dad said it, but it was still kind of hard to believe.” David jerked a thumb over his shoulder at Jeffrey. His eyes, the same shade as hers, twinkled at her. She wondered if he could make them do that on purpose. “He’s kind of got a reputation, y'know.”</p><p>“Uh—what’s going on?” her boss asked, the color leaking back into his face. He was glancing from her to the prince and back again. “Do you know His Highness?”</p><p>“No.”</p><p>“But I know her,” Prince David said cheerfully. “Only by reputation, of course. So, what is it? Why won’t you come back? Hate needles? Doctor-o-phobic?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Iatrophobia,” she corrected him. “And no.”</p><p>“Uh-huh. You know a word I’ve never heard before—and I’m a PhD,” he added modestly. “But noooo, you’re not scared.”</p><p>“Of course I’m scared. Do you have any idea how weird you all are? Your brother Nicholas was in all the papers—again—for pulling that prank that cost Prince Henry a broken ankle!”</p> <p>David winced. “Don’t remind me. Dad took a ration of shit from the Queen of England for that one. Don’t sweat it, though. Nicky’s safely confined to the palace until his twenty-fifth birthday.”</p><p>“What a relief for the planet. And the Windsors.”</p><p>“Oh, like Henry wasn’t in on the whole—”</p><p>“Look, my mom asked me to do something. I did it. It’s done. We’re. All. Done. Now, buh-bye.”</p><p>“But you’re supposed to take me salmon fishing,” the prince whined.</p> <p>“According to some, I’m supposed to do a lot of things.”</p><p>Her boss was banging his blond head on his blond-wood desk. “Nicole, you’re killing me. Please stop. I’m begging. I’m groveling. I’m—”</p><p>“No worries, Mr. Freeborg. I promise your business won’t be penalized as a result of anything my sister says.”</p><p>The blond head jerked up. Nicole closed her eyes. “Your what?”</p><p>“Well.” Nicole opened her eyes in time to see the Crown Prince of Alaska wink at her. “Half sister.”</p><p>Chapter 11</p> <p>D avid Baranov, Crown Prince of Alaska, plopped down in the chair in front of the king’s desk. Relieved to have a break from reading tedious legislation, Al all but shoved the paperwork away from him. “Come in! Sit down! Spend some time with your old man.”</p><p>“Dad, you’ve got to finish that stuff up sooner or later.”</p><p>“Shut up, you.”</p><p>“It’s a wonder anything gets done. If you’re not stalling, you’re sneaking out to go fishing.”</p><p>“Put your mouth in Park, boy.”</p><p>His son mimed locking his lips shut, then tossed an imaginary key over his shoulder.</p><p>“Well?”</p><p>David shook his head. “No go, Dad. And for the record, no one has ever spoken to me like that in my life. Except for you. And...well. Is it just me, or does she remind me of Christina?”</p> <p>“She reminds me of every one of you brats,” the king growled.</p><p>“Yeah, the resemblance was hard to miss. And not just on the physical side.” David paused. “Have you, ah, told the other sibs about this yet?”</p><p>“No.”</p><p>“Oh.” Pause. Al fought the urge to roll his eyes. Here comes the moral assurance that I haven’t gone down in his estimation. “Listen, Dad. I had all last night and all day today to think about it. And I don’t—I mean, I know you and Mom weren’t exactly thrilled with each other a hundred percent of the time, and I’m sure Nicole’s mother was what you needed at just the right time. I just, you know. Understand.”</p><p>“What a relief. I love you, boy, but I require neither your permission nor your assurance.”</p><p>“Sieg heil, Your Majesty.”</p><p>His eldest son stretched out long legs and yawned. He had the distinct air of fish guts about him and was dressed casually. Al was always startled to see how much his boy looked exactly like a younger version of him. It was like looking into a sneaky mirror.</p><p>Hell, it didn’t seem so long since he’d been David’s age. Objectively, it had been decades. Subjectively, it felt like maybe five years. Hell, he was a father by the time he was David’s age.</p><p>Of course, David was a father now, too. The king smiled, thinking of his granddaughter, Dara.</p><p>“Oh, and she’s only the best angler I’ve ever seen,” his son teased, bringing Al back to the conversation.</p><p>“Second best,” the king grumped. “And don’t you forget it, boy. You’re not too big to spank.”</p><p>“Actually, I really sort of am. Think of how Dara would be scarred to see her grandfather assaulting her father! She could be the Queen of Alaska someday, and yet psychologically crippled.”</p><p>“Meh.” So, he mused. David had obviously gone fishing. Nicole had agreed to take him out, as she’d taken Jeffrey out. Maybe there was a way to crack this egg yet. “You get anything else out of her?”</p><p>“Yeah, she knows the technical term for an uncontrollable fear of doctors.”</p><p>“Who doesn’t?” he bluffed.</p><p>“Iatrophobia,” his son kindly supplied.</p><p>“If that kid’s scared of anything, I’ll eat sushi.”</p><p>“Please, Dad,” his son mock-begged. “Don’t befoul your gourmet palate. Hamburgers will never taste the same.”</p><p>“I got to take shit from every one of my kids. Every one.”</p><p>“It’s your curse,” his son agreed happily.</p><p>“Iatrophobia,” Al mused.</p><p>“I don’t think it’s that simple. In fact, I think it was a feint.”</p><p>“A faint?”</p><p>“She’s trying to throw us off the trail. Which is exceedingly weird. She writes us about her, when she could have clammed up, and then refuses to cooperate.”</p><p>“You could refuse my dying wish so easily?”</p><p>His son colored, but doggedly continued. “Who wouldn’t want to be one of us? She passes the DNA, she’s got a claim to one of the biggest fortunes on the planet. She’ll never have to worry about money again, nor any of her kids, or grandkids. Plus, we have a pretty good time around here.” David spread his palms. “What’s not to love?”</p><p>Al smiled at his son. David was young. And he thought his family’s way was the only way. Although Al strongly suspected his son was quite a bit more intelligent than he was, he lacked experience. Al had been walking around on the planet long enough to know just how much people feared change.</p><p>David, born and reared a prince, could not conceive of any other lifestyle, nor understand why a stranger would turn it down.</p><p>“It was her and her mama for her whole life,” Al said. “And now she’s all alone. Maybe she likes her solitude.” Except scratch the maybe.</p><p>There was a discreet rap on the door. “C’mon in, Edmund!” they called in unison.</p><p>“Majesty. Highness.” Edmund fairly staggered under the load of paperwork. Al made a conscious effort not to cringe. “May I presume to ask how it went, Your Highness?”</p><p>“Do you see her anywhere, Edmund?”</p><p>“Watch the tone, boy,” the king said absently, drumming his fingers on the desk. One thing he had insisted on before any of his children could walk: hired help were also subjects, and subjects deserved respect. Always. Except, of course, for one. And he’d straightened her out, by God. Sent her packing with a flea in her ear. Again.</p><p>“Sorry, Edmund,” David was saying. “My morning was equal parts aggravating and amusing. Didn’t mean to mouth off.”</p><p>“I know not to what you refer, Highness. Will you permit me a suggestion?”</p><p>“Don’t you hate when he pretends he doesn’t control our every move?”</p><p>“With all my black heart,” Al replied. “Spill, Edmund.”</p><p>“I think the time for gentler tactics have passed.”</p><p>“You don’t mean?” the prince gasped.</p><p>“The big guns?” the king guessed.</p><p>“Exactly.” Edmund paused a beat. “Princess Christina.”</p><p>“Dear God,” king and prince said in unison.</p><p>Chapter 12</p><p>“S o!” the Crown Princess of Alaska greeted her as she entered the office. “You’re the numbnut who won’t submit to a blood test.” She stuck out an unmanicured hand. Startled, Nicole shook it. “Nice to meet you. I’m Christina.”</p><p>“Uh, yeah. I read about your wedding in People. And your daughter’s birth in—”</p><p>“News of the Weird?” the princess guessed. Nicole’s hand shot up, too late.</p><p>“My God,” Jeffrey-the-annoying gasped. “Was that...a smile?”</p><p>“Shhhh, Jeff. Don’t scare her off.”</p><p>“Jeff-rey, Your Highness. As we’ve discussed, only His Majesty—</p><p>” She spun on him and said, “We’ve been over this a zillion times. You call me Christina, I’ll call you Jeff-rey.”</p><p>“Your Highness—”</p><p>“Yes, Jeff?”</p><p>“He can’t,” Nicole interrupted, smiling again and praying neither of them would comment. “Generations of duty to the royal family. Familiarity is beaten out of them at an early age.”</p><p>“Well, screw,” the princess muttered.</p><p>“I’ll call you Christina. I’ll also call you ‘see you later’ and ‘thanks for stopping by.’”</p><p>“They said you were never at a loss for words,” the perfectly cool, tall, blond woman said. Like every royal she had met so far, she was dressed casually: tan shorts (a bold move in forty-five-degree weather), a T-shirt (another bold move) with the logo I’M THE PRINCESS OF ALASKA, WHO THE HELL ARE YOU?, and a buttercup yellow sweater knotted around her waist. “They also said you looked extraordinarily like Alex and Kathryn, and that’s true, too.”</p><p>“Super duper. Well, what’s up? Salmon fishing? Hiking? There’s not much in season if hunting’s your thing...”</p><p>“No, thanks. Uh, could you cool out your boss a little? He looks about ten seconds from a stroke.”</p><p>Nicole was embarrassed; she’d been so distracted by Jeffrey (who was in his black tailored suit; duh, she should have known this one wasn’t going fishing) and the Crown Pr—Christina that she hadn’t even noticed Freeborg was at his desk.</p><p>And Christina was right. He was as pale as the belly of a trout.</p><p>“Mike? Mike!” She waved a hand in front of his glazed eyes. “It’s okay. I’m not in any trouble.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re one of them,” he accused, pointing a trembling, banana-sized finger at Christina. “Her husband said! Yesterday!”</p><p>“Oh, no,” Nicole assured him, but she was looking at Jeffrey as she said it. “Not ever.”</p><p>“Blood will tell, honey.”</p> <p>Then, in unison, she and Christina said, “Don’t call me honey.”</p><p>Alone, Christina added, “See, see? Your reputation precedes you!”</p><p>“Is that so?”</p><p>“Yup.”</p><p>“And you think I’m an in-law.”</p> <p>“Don’t think. Know.”</p><p>“So, if you were trying to talk one of them into something they absolutely did not want to do, how do you think it would go?”</p><p>Christina opened her mouth. Then closed it. Then opened it again, looking remarkably salmon-like. Then she glared. “Don’t confuse me with facts.”</p><p>“That’s a valid warning,” Jeff added.</p><p>“Pipe down, Jeff-rey. One thing I’ve learned living with some of the richest people in the world is that everyone has a price. So what’s yours?”</p><p>“What?”</p> <p>“What’s it gonna cost to get you to come with me and submit to our DNA test?”</p><p>“Are you implying that you can pay me?” To turn my back on my mother and everything she ever did for me? God! They were all the same! “You bitch!” Then she socked her. Almost. Jeffrey moved like lightning, so she actually socked him in the throat (she’d been aiming for Christina’s left eye).</p><p>“Hey!” Christina yelled as Nicole’s boss clawed for his wastebasket and started retching. “Rule number one: Nobody roughs up the help!”</p><p>Then Nicole saw black stars explode as Christina socked her back.</p><p>Chapter 13</p><p>“O w ow OW!” Nicole yelled, regaining consciousness. She opened her eyes, then groaned in equal parts pain and horror. About a hundred people were crouching over her.</p><p>“—didn’t mean for her to hit her head!”</p><p>“Christina, for Christ’s sake. We sent you to be a diplomat—ever heard of the word?”</p> <p>“Ma’am,” a paramedic said, ripping the blood pressure cuff off Nicole’s arm, “can you tell me where you are?”</p><p>“The seventh circle of hell,” Nicole answered.</p><p>Christina elbowed two other Baranovs out of the way and peered down anxiously. “I’m so sorry, Nicole. I only meant to give you a black eye.”</p><p>“That’s an apology?” the crown prince demanded.</p><p>“I didn’t mean for you to hit your head on the boss’s desk when you fell!”</p><p>“How—how did you all get here so fast?” She was looking around, and in addition to two paramedics, she recognized Princess Kathryn, Prince Nicholas, Crown Prince David, Prince Alexander, Princess Alexandria, King Alexander, and her brand-new nemesis, Christina. “Does the palace have a teleporter pad?”</p><p>“You’ve been out cold for twenty minutes,” Prince Alexander, a shorter, younger version of his brother David, told her. “We had tons of time to get here. I’m Alexander, by the way.”</p><p>She clapped a hand over her eyes. “I know who you are. I know who you all are.” Her head was on the firmest pillow ever. Who knew Freeborg kept—</p><p>“Are you okay, kiddo?” the king asked anxiously. “How many fingers am I holding up?”</p><p>“How many fingers am I holding up?”</p><p>“Now that’s rude,” Prince Alexandria said approvingly.</p><p>“All of you back off and give her some air,” Jeffrey ordered from—ulp—directly above her. She realized with equal parts heat and cold that the pillow was him, and her head was in his lap.</p><p>As one, the royal family took three steps back.</p><p>“Your vitals are fine,” the other paramedic was telling her, “but with such a long loss of consciousness I think we should run her to the hos—”</p><p>“No hospital. No doctors. No way.”</p><p>“Ma’am—”</p><p>“I’ll sign the NMA.”</p><p>“NMA?” she heard the youngest, sixteen-year-old Nicholas, whisper to his sister Kathryn.</p><p>“No Medical Attention,” Kathryn replied. “Means if she falls down the stairs and breaks both legs while barfing up blood, she can’t sue.”</p><p>Nicole almost laughed at the mental image, but managed to mask it as a groan of pain as she sat up.</p><p>“If you come to the hospital, you could get a prescription...” one of the paramedics wheedled.</p><p>“First someone tries to bribe me with money, now Vicodin? Do I have ‘weak loser’ written on my forehead?”</p><p>“Christina Baranov!” the king roared.</p><p>To Nicole’s vast enjoyment, Christina backed away from the red-faced king so fast she nearly tripped and went sprawling. “I didn’t try to bribe her with money! I just said everyone had their price!”</p><p>“Oh, I can see how that wasn’t offensive,” Prince Alexander snarked.</p><p>“Shut the hell up, Alex. I meant like how I got the run of the kitchens when I got here. I just thought maybe she’d like her own lake or something.”</p><p>“A fine plan,” Alexandria observed, squinting down at Nicole. “Good job, Christina. Really. Hey, Dad, let’s put her in charge of defusing the situation in China.”</p><p>“Hand it over,” Nicole told the paramedics, who were packing up.</p><p>“What?”</p><p>“The blood you stole while I was conked.”</p><p>The paramedics looked at each other with superbly faked expressions of confusion. “Blood we—”</p><p>“Nicole!”</p><p>“Stop yelling, it hurts my head!” she yelled back.</p><p>Half the light was blotted out when the king pointed a finger at her. “The Baranovs do not steal. Apologize at once.”</p><p>“I’m so sorry,” she said sweetly, “that you’re sensitive about being called thieves after your ancestors stole the country from its rightful owner, Mother Russia.”</p><p>There was a long, awful silence broken by Nicholas saying, “Screw the blood test. I’m convinced.”</p><p>“If she doesn’t have a legitimate DNA test supervised by our own docs in the palace, Edmund will murder us all in our beds,” David explained to his siblings.</p><p>“Hold your breath waiting for that to happen.”</p><p>“Which part?” Kathryn asked.</p><p>“Will you all keep it down?” Jeffrey rumbled from behind her. He was still sitting behind her, like she might (ha!) get dizzy and fall back in his lap again. “You’re upsetting her.”</p><p>“She punched you in the larynx, Jeff.”</p><p>“Is that why he sounds so dreadful?” Kathryn whispered to her brother Alexander.</p><p>David knelt beside her, and when he spoke, it was with so much sympathy she could hardly bear it. “It will happen, Nicole. It has to. See, if you’re really a Baranov, which everyone in this room knows you are, that means you’re first in line for the throne.”</p><p>“But—but you and Christina Quickknuckles are the crown prince and—”</p><p>“Nicole, you’re older. Think about it.”</p><p>She did. Then she crawled to her boss’s wastebasket and threw up.</p><p>Chapter 14</p><p>“O h dear,” Edmund said.</p><p>“Then she hit her head and got knocked out.”</p><p>“Oh.”</p><p>“For twenty minutes.”</p><p>“Uhm.”</p><p>“And wouldn’t go to the hospital.”</p><p>“Naturally.”</p><p>“Then David laid it out for her.”</p><p>“‘Laid it out’?”</p><p>“Don’t play dumb.”</p><p>“Oh, never, my king. But at times it seems to me you have your own code. And I left my secret royal decoder ring in my other pants.”</p><p>“You know, how she’s now first in line for the throne.” Alaska was famous for doing it by birth order, not sex.</p><p>“Ah.”</p><p>“Then she barfed.”</p><p>“A reaction I myself have nearly every week.”</p><p>“Then Jeff kicked us all out. I think in his heart she’s one of us, so he thinks he’s her bodyguard,” the king said approvingly. It was early that afternoon, and the king was enjoying a beer. Edmund drank coffee and played with the oft-neglected paperwork.</p><p>“Oh, is that what he thinks?”</p><p>“Sure. Then Jeff took her home and we all came back here. I think Christina’s still sulking in her suite.”</p><p>“Majesty, is there a question of lawsuit against—”</p><p>“No, because Nicole threw the first punch.”</p><p>“Very well.”</p><p>“Of course,” the king mused, taking a swig of Bud, “that might be leverage. You know, ‘cooperate or we’ll tell the world you tried to coldcock the crown princess.’ I get the feeling she’d hate publicity.”</p><p>“My king, you have read none of the newspapers I so carefully laid out for you.”</p><p>“Yes, I have.”</p><p>“No,” Edmund said, holding up that morning’s edition of The Juneau Empire. “You haven’t.”</p><p>BASTARD PRINCESS FOUND WORKING FOR</p><p>OUTER BANKS CO.</p><p>Sitka Palace denies comment.</p><p>The king hurriedly drained his beer. “Oh, fuck me,” he groaned.</p><p>“With regret, I do decline.”</p><p>“I’m gonna barf.”</p><p>“Then it must be Thursday. And, my king, you have yet one more worry.”</p><p>“Nothing can be worse than this.”</p><p>“Think hard,” Edmund advised.</p><p>“I’m in no mood for riddles, Edmund, so just—”</p><p>His office door was slammed open and his arch enemy, Holly Bragon (“rhymes with dragon”), stood framed in the doorway. She waved that day’s newspaper at him and crowed, “Bastard Princess! I fucking love it!”</p><p>“Get me another beer,” he said. “Get me a six pack. Get me three six packs.” Then, to the Dragon, “I fired your ass last week.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh, I know, King Grumpy. But I’m baaaaack!”</p><p>Chapter 15</p><p>E dmund was still smiling as he drove to his family’s summer home fifty miles outside Juneau. His duty was a never-ending joy...especially on days like today.</p> <p>The story of the fistfight had been amazing enough. Really, the entire Krenski/Baranov saga had been amazing enough. But the look on the king’s face when Miss Holly made her ill-timed return was worth a whole month of “Eddies.”</p><p>Off-duty, as he was now, he normally stayed in his rooms at the palace. But spring was here, and it was time to do his annual check on his grandfather’s home to get it ready for summer.</p><p>Not that he made much use of it himself, but his dear sister would require it for much of the summer, and he wanted it in tip-top shape for her.</p><p>She would also be a frequent guest at the palace, where all the children were fond of her. (Must stop thinking of them as children, a voice in the back of his brain whispered for the hundredth time. His Highness the Crown Prince is thirty-four!)</p><p>A lovely, charming woman in her fifties with Down syndrome, Edmund’s sister greeted the annual house’s opening with the unbridled delight of a precocious child.</p> <p>He would die for her. And if she understood death, Geraldine would have died for him. Since he expected to precede her in death by some time (she had been a late-in-life baby for his parents, a true Lost Boy who had never grown up), he had made generous arrangements for her care as long as she lived.</p><p>And if he hadn’t been able to do this thing, the king, with typical generosity (while claiming to be heartless and indifferent), had assured him many times that Geraldine would never have to worry about paying bills or cooking meals.</p><p>No matter when he passed on (hopefully via a brain aneurysm while scolding one of his beloved Baranovs), Geraldine would want for nothing.</p><p>To his surprise, as he drove up the long, tree-lined driveway, he saw another parked car. He hit the high beams and saw someone waiting for him on the wrap-around porch. In all his years of service, that had never happened.</p><p>His chest tightened; he prayed nothing had gone seriously wrong at the palace. Please no one is sick or hurt. Please no one is sick or hurt. Please no one—</p><p>He nearly leaped out of his car and ran to the porch—not much fun at his age—and his heart rate slowed dramatically when he saw who it was.</p> <p>“Good evening, Miss Krenski,” he tried not to gasp. “I trust you are well.”</p><p>Chin in her hand, she squinted up at him. “You okay, slick? You’re not gonna keel over on me, are you?”</p><p>“Hopefully not.”</p><p>“How’d you know who I was?”</p><p>“Who else could you be?” he said warmly. “And it grieves me to point out you have not answered me. Are you quite well, Miss Krenski? No ill effects after this afternoon’s, ah, misunderstanding?”</p><p>“Well, I’ve had a bitch of a headache all damn day, and the next time I see the crown princess it is awwwwn. Oh, and I’m gonna be the next fucking Queen of fucking Alaska. Other than that, I’m great.”</p><p>After decades of practice, Edmund had the best poker face on the planet. O, my king, you were so right. She is of your blood. “I see. Please, come in. I’m afraid I can offer you nothing in the way of refreshments—”</p><p>“I know. This is your family’s summer home. You just came up to check it out.”</p> <p>“And how did you know that?” he asked, holding the door for royalty as he had done thousands, no millions of times before.</p><p>“Vee haff ways,” she said, and grinned at him. His heart did a little flip-flop in his chest, and he realized anew what the king and the new princess did not: Jeffrey Rodinov was not sticking close because he wanted to be her bodyguard.</p><p>“I brought take-out,” she said absently, preceding him. “Heard you get weak in the knees at the thought of bad Chinese food.”</p><p>“We all have our vices,” he admitted, and closed the door.</p><p>Chapter 16</p><p>“S o lay it out for me, Mr. Dante,” Nicole said to the tall, neatly dressed, skinny guy she pegged to be in his early seventies. Guy moved like a matador, though, and she guessed that running around after the royals kept him in good shape. And he sure got over a surprise in a hurry. Another occupational hazard. “Let’s say I lose my tiny mind and go to the palace tomorrow and get this damn DNA test. What happens then?”</p><p>“Assuming it’s positive—”</p><p>“It’ll be positive,” she said glumly, poking at her beef and broccoli with a chopstick. “Unless this is my mom’s idea of a disgusting practical joke.”</p><p>He spooned more rice onto his plate. “Your status will be confirmed to the press. Arrangements will be made for you to move into the palace. Training will commence at once. Prince David has a thirty-year head start on you in terms of learning how to run a country.”</p><p>“And then I wait around for the king to die, and—”</p><p>“Assume the throne, yes.”</p><p>She pushed her plate away. She didn’t want to throw up again. “But wait a sec. I read somewhere that the king wants his kids to be co-kings and co-queens. He got the idea from reading The Lion, the Witch, and the Wardrobe.”</p><p>“Yes, he did, and, yes, that is his wish. But Miss Krenski...” Mr. Dante’s sad bulldog eyes blinked slowly at her. “There must be a High King. Or a High Queen.”</p><p>“In this case, me.”</p><p>“In this case, yes. But of course your brothers and sisters would assist you in any way they could.”</p><p>“Half brothers and sisters,” she couldn’t resist adding.</p><p>Mr. Dante tactfully ignored that. “Quite frankly, you cannot be everywhere at once, which His Majesty discovered in his early twenties, and you would be unwise to try. If I may impart a confidence to you, Miss Krenski—”</p><p>“Nicole.”</p><p>“Thank you, Miss Krenski, but no thank you. This is the best I can do until your status as an HRH is confirmed, at which point I—”</p><p>“HRH?”</p><p>“Her Royal Highness. Are you all right?”</p><p>“It’s nothing,” she said, trying to stifle her gag reflex.</p><p>“As I was saying, the king has always regretted being an only child and has taken nothing but joy at the birth of each successive son or daughter. You wrote in your letter that you thought he might be embarrassed by you. Nothing could be further from the truth. He is most anxious to begin the process of knowing you.”</p><p>Nicole grunted. “Well, he’s gonna get his wish, starting tomorrow. But this whole shitstorm? It’s gonna be on my terms.”</p><p>Mr. Dante, who seemed like a helluva nice guy in spite of his overly formal demeanor—how did you sit at attention?—shook his head. “Oh, my dear. At this moment, several of your blood relatives are thinking the exact same thing.”</p><p>She absently cracked her knuckles. “Well, we’ll see.”</p><p>“Miss Krenski, if I may make bold to ask—”</p><p>“You ate all the rest of my rice, so you might as well stay bold.”</p><p>“What on earth has changed your mind? I had a private wager with myself that you would have (a) held out for six more months at least or (b) fled to America.”</p><p>Her headache, which had finally been receding, gave a tremendous throb, and she nearly barked, “Fled?”</p><p>Weirdly, Edmund seemed pleased. “I beg your pardon, I meant no offense. I only thought you might have taken advantage of your dual citizenship.”</p><p>“Yeah, well. That’s over now.”</p><p>“Over?”</p><p>She couldn’t tell whether he was being super-tactful or playing dumb. But didn’t it come down to the same thing?</p><p>“It’s in the papers. Local at first, but the wires have jumped on it now. It’s spreading all over the world like Ebola squared. My boss blabbed the whole thing.”</p><p>“I see. Sweet and sour sauce?”</p><p>“No, I’ll puke again.”</p><p>“Something we must avoid at all costs.”</p><p>“This morning when I came to work there were a zillion reporters and even more civilians.” She still had trouble understanding the fact that all those strangers wanted to take her picture. Among other things.</p><p>“That is to be—”</p><p>“Wanting my autograph, you believe it? I’ll never have a private life again. Everything’s—” She heard her voice crack and hated herself for it. She cleared her throat and quietly continued, “Everything’s over for me, now. So there’s no point in fighting it for another week. Or even another day.”</p><p>For some reason, Mr. Dante was on his feet and patting her on the shoulder. “Oh, Highness, don’t cry. It’s just another beginning. Nothing at all to fear.”</p><p>It was only then that she realized her face was wet.</p><p>And it was only hours later that she realized what he had called her, quite unaware, while comforting her.</p><p>She would spend the rest of her life internally flinching at the title, but would never forgot that the first time she heard it it wasn’t so bad.</p><p>Chapter 17</p><p>“O ut!” the King of Alaska roared, his hands running across his desk and finally seizing something that wouldn’t give him a paper cut. He hurled a paperweight in Holly Bragon’s general direction, but as usual, she didn’t take the hint. Normally he would never treat a lady in such a fashion, but of course, the Dragon was no lady.</p><p>“So!” Holly said as if a glass weight hadn’t shattered two feet (he had been careful to aim wide) from her left ear. “Tell me about the bastard princess.”</p><p>“If you give her that name in my God-be-damned memoirs, I will give you a nose job with a chainsaw.”</p><p>“Already had one, sans chainsaw,” she said, clicking forward on her high heels and sitting in the chair to the left of his desk. “Can’t you tell? Don’t I look glorious?”</p><p>He fought the urge to plunge his hands in his hair and yank. He still had every strand, by God, at an age when lots of men were bald as billiard balls. He wouldn’t let her drive him to Rogaine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The awful thing was, the Dragon did look glorious. About fifteen years younger than him, she was a fine-looking, brown-eyed redhead with the lush figure of a fifties pinup girl. None of that anorexia chic for the Dragon.</p><p>The only concession to her age were her purple-rimmed bifocals. Her tailored suit was the same shade. When she crossed her legs, he observed that she had not given up the odd habit of wearing tennis shoes with designer suits.</p><p>“You look like a Goddamned eggplant in that thing.”</p> <p>“Oh, Big Al, every word out of your mouth is pure honeycomb.” Hun-ahh-cooom.</p><p>“And you sound like pure cornpone. When are you going to ditch that awful accent?”</p><p>“Big Al, I’m gonna give your funeral service in my cornpone accent, and every fellow Texan is gonna cheer me on.” Give yer fun’rul sur-vuss. Gone cheer me awn.</p><p>He slumped back in his chair and massaged his temples. “God, I think my ears are actually bleeding.”</p><p>“It’s that high-cholesterol lifestyle you lead, big guy. So tell me about the new girl. Word on the wires is, she’s a bit older than Davey.”</p> <p>“Prince David.”</p><p>“O’course, Big Al.”</p><p>“That’s King Al!” Fucking Americans. Too casual by far. Right now, he could stand a little awe.</p><p>“Whatever you say, Big Al.” She crossed her legs and even the whisper of her pantyhose rubbing together got on his nerves. “Anyhoo, that puts her in line for your job after you fall overboard and drown on one a’your clandestine fishin’ trips that don’t fool no one no how. Right?”</p><p>“Are you speaking English? At all?”</p><p>“Ah can speak anuhthin.” She occasionally tortured him by deepening her already annoying Texan accent, and could keep it up for hours.</p> <p>She had been fired nine times.</p><p>She had been escorted out by Jeffrey seventeen times.</p><p>She had reduced him to shouting at her so many times he lost count after her second visit. But like roaches and disco, she kept coming back.</p><p>And far, far worst of all? The Dragon was his official biographer. She had a doctorate in Alaskan history, gotten published at age nineteen, and written four books on the history of Alaska.</p><p>And as usual, the royal family had chosen a foreigner for the job of chronicling the current monarch’s life. Subjects tended to be a little too overawed to ask the tough questions.</p><p>“So? It’s true, raht?”</p><p>He rubbed his eyes. “Yes, it’s true. I had a—a relationship before I married the queen. Forget it, not tellin’.”</p><p>“Aw, Big Al, an’ here I was on the edge of my seat waiting to hear about your naked shenanigans.”</p> <p>“Shenanigans? Did you just curse me in Texan? Never mind. Point is, yeah, I wasn’t exactly a virgin on my wedding night.” Then again, neither was my bride. “And Nicole Krenski Baranov was the result.”</p><p>The Dragon didn’t write any of that down in her ever-present notebook. “Why, Big Al, I’ve never known you to go out on a limb. I hear the DNA ain’t been confirmed.”</p><p>“Hasn’t been confirmed, you illiterate twit!”</p><p>“Thay-ets Daktuh Illiterate Twee-it, Big Al,” she corrected him sweetly.</p><p>“Okay, okay, stop it, you’re killing me. You hear me? After I fired you the fourth time my doctor said my blood pressure was ten points higher than normal! You are literally killing me!”</p><p>“All part of the big plan, Big Al,” she said, easing up on the accent. “I’m the Texan Secret Weapon, sent up here to kill you.”</p><p>“I fucking knew it!”</p><p>“Anyway, like I said, DNA hasn’t been confirmed. So why take the risk of telling me?”</p><p>“Because I’m old and tired and it’s been a weird damned week.”</p><p>She laughed at him. He made a mental note to check with Parliament to see if he could bomb Texas. “You! Old!” She laughed so hard she almost fell out of her chair. Unfortunately, no such luck. “You! Oh my Gawd! Haw haw haw!”</p><p>He surreptitiously checked to make sure his ears hadn’t begun to bleed. “You really were sent by America to kill me, weren’t you?” he asked gloomily.</p><p>“Big Al, the grand ole You Ess of America don’t need me. They could turn Juneau into a smokin’ pile of cinders with no trouble a’tall. Now. Tell me about the new girl.”</p><p>“No.”</p><p>“Aw, Al. You know I’m gonna get it out of you even-’chally.”</p><p>“Shut up. You will not. Where the hell were we when I last fired your ass?”</p><p>She leaned over in her chair and slapped a thigh. “My extremely shapely ass, don’t pretend you never noticed, and we were talking about how you flew fighters in Korea.”</p><p>“Right. Okay. So...”</p><p>Chapter 18</p><p>J effrey had driven her to Mr. Dante’s house, waited silently and patiently in the car—Mr. Dante had never even seen him—then had driven her back home. He had taken in her swollen eyes at a glance and, thank God, said nothing.</p><p>She didn’t speak a word for forty miles, but weirdly, it wasn’t awkward. Jeffrey hummed along with the fifties oldies station he played softly and seemed content to let her think. Or (what she was really doing) stew.</p><p>“Come in for a moment?” she asked when he pulled up to her trailer.</p><p>“That depends. How’s your artillery?”</p><p>“Oh, that’s hilarious.”</p><p>“I prefer the word cautious.”</p><p>When they were inside, she offered him a drink, which he declined. Oh...duh. He probably considered himself on duty.</p><p>“Uh, can you give me a ride to the palace tomorrow?”</p><p>He had been glancing around her living room, and spun around so fast she nearly took a step backward. For a big guy, he was quick on his feet. “The palace? You want to go to the palace? Our palace?”</p><p>“No, Buckingham Palace,” she snapped. “Of course our palace. Can you give me a ride? And get me in to talk to the king?”</p><p>“Of course. But as the head of his detail, I’d like to know your intentions. You realize that killing him will only—”</p><p>“I’m not going to kill him! My intentions are to submit to a DNA test.”</p><p>“You’re taking a DNA test?”</p><p>“Are you partially deaf with that earpiece clogging up your left ear? Yes.”</p><p>She observed his eyebrows knit together. “Tomorrow?”</p><p>“Yup.” Gorgeous, but slow on the uptake, this guy.</p><p>“And then it will be official. You will be, to the world, Her Royal Highness, Crown Princess Nicole.”</p><p>“I guess.”</p><p>“Oh. Then I better do this now.”</p><p>“Do what?”</p><p>But he was moving with that lithe speed again and before she knew it, he was holding her in his arms and kissing her on the mouth. She was so surprised she forgot to bite.</p><p>And then she pretty much forgot everything else, too, for the first time since this crazy shit started up.</p><p>He was holding her firmly, but she had no sense of being restrained. He was taking her mouth without permission, but she had no sense of being violated.</p><p>Best of all, he wasn’t stopping, and she had no sense of being not in control of the situation.</p><p>Because the truth was, she was kissing him back just as hard as he was kissing her.</p><p>Finally, after a time that might have been ten seconds or ten minutes, he let go of her and spun away, leaning on the counter between the kitchen and the living room. Clutching the counter, really. She saw with some astonishment that his knuckles were white.</p><p>“Why—why did you do that?”</p><p>“Because tomorrow you’ll be Princess Nicole, and I won’t be able to do it. I’ll never be able to do it again.”</p><p>“But—”</p><p>“Good night, Nicole.”</p><p>She was so amazed she forgot to stop him.</p><p>Chapter 19</p><p>A discreet rap on the door. King Al, grumpy after a long session spilling his life to the Dragon, and five more Buds, and four hours of sleep, massaged his temples. The discreet rap sounded like a giant was pounding on the wood with a ball-peen hammer.</p><p>His breakfast sat before him, untouched. At the moment, he doubted he’d ever be able to eat again. And he was swearing off beer! Again!</p><p>Another discreet rap.</p><p>He made a bet with himself. It would be Edmund, with the morning mail.</p><p>“Come in, Edmund.”</p><p>Only Edmund’s head came in; he had opened the door and stuck his head through. “Your Majesty? Drink your juice.”</p><p>“I fucking hate tomato juice! It’s like drinking red snot.”</p><p>“A master of poetry, even during the largest of hangovers. Majesty, I have a surprise for you.”</p><p>“Edmund, if I have one more surprise this week, I’m firing you.”</p><p>“Do not tease, Majesty. Are you ready?”</p><p>“Oh God,” he sighed. Then, “Hit me.”</p><p>Edmund’s head disappeared, and then Nicole walked in.</p><p>“Holy mother of God!”</p><p>“It’s nice to see you too, Al.” Nicole had a wry expression on her face. Cute as a bug, too, and—was she wearing a dress? A perfectly lovely dress with black tights and sensible black flats?</p><p>“Wh—what—how—why—”</p><p>“A man of letters, just like Mr. Dante said. Awesome.”</p><p>“I have a brain tumor, so please stop yanking my chain,” he begged.</p><p>“It’s just a headache, you infant. Look, I went over to Mr. Dante’s house yesterday and talked it over with him and here I am, so shut up about it now.”</p><p>“But how the hell did you even know where he lived?”</p><p>“Who cares? I’m here, right?”</p><p>“Damn right! Hell, it’s great to see you again, kiddo!” He got up and practically ran around his desk, holding his arms out without thinking.</p><p>He would have bet the east wing that she had no idea how horrified she looked at that moment, so he dropped his arms and stuck out a hand instead. Thawing an inch or two, she shook it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Edmund, you are a fuckin’ miracle worker!”</p><p>“Yes, Your Majesty.” The crumb didn’t even bother looking smug. Just took it as his due. “All in a day’s work, Your Majesty.”</p><p>She jerked a thumb in Edmund’s direction. “I bet that gets annoying.”</p> <p>“Hon, you have no idea. Nice dress,” he said, motioning for her to sit down.</p><p>“Thanks. It’s the only one I have. Wore it to Mom’s memorial service.”</p><p>“Oh.” That would explain the severe black and the long sleeves. And what message was she sending, anyway? Reminding him he couldn’t take her mother’s place? That was fine. He’d never intended to try. “Well. Ah. Say, how did you get in here, anyway? You’re not anywhere on my schedule.” He was pretty sure.</p><p>“Jeffrey brought me here.”</p><p>Fine, but why did that make her blush? Well, it was a stressful moment for her. And not likely to get much better in the months to come. He tried to harden his heart against the sympathy he felt for her (for the good of the country!) and failed. He had never been able to harden his heart against a child. Any child.</p> <p>“Jeffrey switched with Reynolds this morning,” Edmund added. “Which is on your schedule.”</p><p>“I knew that,” he bluffed. “So, uh, kiddo—Nicole—if you don’t mind, I’d just as soon we got that test out of the way before you change your mind and shoot us all in the face.”</p><p>Nicole remained a stone. “That’s probably a good idea.”</p><p>“Edmund, will you get doctor—”</p><p>“ETA four minutes, my king.”</p><p>“Oh.” Annoying bastard. And thank God. “Great. Nicole, you had anything to eat yet?” He suddenly remembered the paramedics, the ambulance, and felt bad about all the hangover bitching. “How’s your head?”</p> <p>“Yes, and fine.”</p><p>“Oh.”</p><p>She just sat there like a lump, a pretty lump, and looked at him. Her hands, already tan from being outdoors, rested limply on the chair’s armrests. Her long, slender fingers didn’t move.</p><p>“I’m sure glad you’re here,” he said again, totally at a loss. He could deal with kids. He could deal with his kids. He could deal with his grown-up kids. But a grown-up kid he’d known only for a week? That was breaking new territory.</p><p>Al mentally spat on his hands. The blood of rebels ran in his veins, and they had made an art form of breaking new territory.</p><p>It did not occur to him until much later that the blood of rebels ran in her veins, too.</p><p>“You don’t want anything? Cup of coffee? Tea? Milkshake? Soy shake? Latte? A beer and a ball?”</p><p>“It’s a little early for me, so never mind the booze, but I’d kill for a cup of coffee,” she admitted. “Where is it? I’ll get it myself.”</p> <p>“No, no, Edmund will get it.”</p><p>One of her fingers twitched. Her trigger finger, he noticed. Her eyes narrowed a bit and her mouth thinned. “I’m not gonna be waited on hand and foot, King Alexander. So you can get that idea out of your pounding head right now.”</p><p>“Of course not, we’d never dream of radically altering your lifestyle,” Edmund broke in. “How do you take it, Miss Krenski?”</p><p>She sighed and he figured she’d already guessed there was no arguing with the man. “Black.”</p><p>“Atta girl,” he couldn’t help but say. “She takes it like a man,” he couldn’t help bragging to Edmund.</p><p>“Your exquisite notions of chauvinism are as fascinating as they are maddening, my king.”</p><p>Nicole laughed for the first time that day.</p><p>“Shaddup,” he told them both.</p><p>Chapter 20</p><p>“M atch,” the doc whose name Al couldn’t remember told him. “Match. And match.”</p><p>“Don’t talk in your medical jargon, doc; just spell it out.”</p><p>“Oh.” The doctor frowned. “I thought I was being fairly clear. Miss Krenski is a direct blood relation of yours, Your Majesty, a sibling or a daughter. And due to the age difference and the fact that your parents are—”</p><p>“Right. So it’s official. She’s my daughter.”</p><p>“She is, Your Majesty. There is no doubt.”</p><p>“There never was, doc.”</p><p>He was so excited to get the ball moving, he didn’t notice his youngest, Nicholas, motioning to the doctor. He went out the door of the lab without another backward glance, to his son’s great good fortune.</p><p>Part Two</p><p>BASTARD PRINCESS</p><p>Chapter 21</p><p>SITKA PALACE CONFIRMS BASTARD PRINCESS</p><p>NEXT IN LINE FOR THRONE</p><p>N icole walked into yet another ridiculously grand room, one she could have fit four of her trailers in. Her (ugh) siblings and (ugh ugh) father were already seated.</p><p>“Hey, Nicole,” Nicholas, the youngest, called to her. He was the only blonde among them. She’d heard the rumors, of course.</p><p>The official story was that Queen Dara was killed in a car accident on the way to a hairdresser appointment. Unofficially, she had been en route to meet her lover—Nicky’s real father.</p><p>But even when things were at their worst—when David and Christina were king and queen pro tem while King Alexander was in a coma—David did not permit a DNA test for the youngest Baranov.</p><p>“You made the front page this morning,” Nicholas was saying. “Again.”</p><p>“No reading at the table,” King Al ordered. “Ditch the rag, boy. How’d you sleep, Nicole?”</p><p>“Fine.” A lie. “But if I’m going to live here, is there a chance I could pick a different bedroom?”</p><p>“You can have any room—rooms—you want.”</p><p>Excellent.</p><p>“You hungry? You must be. I didn’t see you eat a thing all day yesterday.”</p><p>“Sure.” There was one empty spot at the table—to the king’s right. David sat at his left. “Thanks for waiting for me. Let’s eat.”</p><p>“Hallelujah, brothers. And sisters,” Alexander, the middle son, said. “Nicole, can I ask a personal question?”</p><p>“Sure.”</p><p>“What happened to your mama?”</p><p>Before Nicole could reply, Kathryn, the youngest daughter, hurled a croissant across the table, catching Alexander neatly on the upper lip. “Dumbass! Don’t ask her that.”</p><p>“Cancer,” Nicole replied, struggling to remain straight-faced.</p><p>“Was she in any pain at the end?” the king asked quietly, which neatly quashed her urge to laugh.</p><p>“No, at the end—she never knew anything.”</p><p>“Asshole!” Alexandria, the eldest daughter (besides Nicole herself, she supposed), hissed at her brother. “Our first meal as a family and you had to go bring that up! Throw something else, Kathryn.”</p><p>“I’m sorry, I’m sorry!” Alexander was cowering behind his saucer. “I was curious, that’s all. I would have liked to have met her. That’s all.”</p><p>“She got the diagnosis about two years ago,” Nicole elaborated, helping herself to an English muffin. “I took care of her as long as I could.”</p><p>“You took care of her?” Christina asked.</p><p>“No, I slammed her ass in a nursing home so I wouldn’t be bothered,” Nicole snapped, feeling her cheeks get warm.</p><p>“Please don’t kill my wife,” David said calmly, spooning up oatmeal. “It’ll ruin Christmas.”</p><p>Nicole laughed; she couldn’t help it.</p><p>“You’re, uh, kinda mercurial, aren’t you?” Kathryn asked.</p><p>Nicole shrugged, and as a footman discreetly poured her coffee, she thanked him and took a sip.</p><p>Her first night in the palace had been strange. She’d known it would be, of course, but still wasn’t prepared.</p><p>For one thing, the palace was ginormous. Easily the largest building she’d been in in her life—and she used to live in L.A. With hallways and rooms and corridors and multiple kitchens and nine thousand fireplaces, and it went on and on and on.</p><p>For another, she had a real glimpse of the kindness of the king. Her father. There had been a press conference, but she hadn’t attended. Mr. Dante and her dad had handled the whole thing.</p><p>He had told her to explore and gave her a cell phone so small and thin it looked more like a fat credit card than anything else.</p><p>It had a very specific function; it summoned intermediaries at a beep, particularly Edmund.</p><p>So she had walked around and occasionally bumped into a sibling and introduced herself to at least a hundred staff members, and by the time she went looking for David, he was long gone and not due back until after midnight. She and Christina had exchanged a few stiff words, she’d declined to meet her niece, and left.</p><p>Exhausted, she had gone to bed in a palatial (no pun intended) room that screamed “anonymous guest bedroom.”</p><p>Well, at least they didn’t already have a suite in her name all set up. They were arrogant, but not that arrogant.</p><p>And now they were, day two, at breakfast.</p><p>She had hoped to talk to David alone, then realized it might be a thing better spoken in front of all of them, so she spoke her piece.</p><p>“I’m sorry about usurping the throne from you,” she said, taking another sip of the excellent coffee. “That’s not why I wrote the letter.”</p><p>“Usurp means to seize or commandeer,” Alexander-the-younger said, “implying you had no right to it. When, in fact, you have every right to it.”</p><p>David was nodding. They—they were all nodding. That was a shock. “Still. I’m sorry.”</p><p>“I’m sorry, too, Nicole, but not for the reasons you think. None of this can be easy for you. We’ll all do our best to make the transition as painless as possible.”</p><p>“Ha,” she murmured, looking down at her plate.</p><p>“As for not being king...I haven’t really had a chance to wrap my brain around that one.” He smiled, but the smile didn’t climb into his eyes. “But who can predict the future? Who knows? Maybe Dad has another kid running around and he or she is older than you are. Then you’re off the hook.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She smiled. “Tease.”</p><p>“I’m sitting right here, kids.”</p><p>“Sorry, Dad,” David replied. “But you’re not exactly lily white on this one.”</p> <p>“I gotta take shit from a punk like you?”</p><p>“I know!” Nicky said, squeezing his muffin so hard it imploded in a spray of crumbs and blueberries. “The day Dad dies, Nicole can abdicate! Then everything will go back to the way it was.”</p><p>“I’m sitting right here.”</p><p>“My mother didn’t raise me to shirk my responsibilities,” Nicole said quietly, and that was the end of that.</p><p>Chapter 22</p> <p>“H i!” a cheerful redhead about ten years older than Nicole said. “I’m Holly Bragon, rhymes with dragon. I’m the king’s official biographer.”</p><p>“Hi.” Nicole shook hands with the woman.</p><p>“I don’t suppose you’re in the mood to talk about your mother.”</p><p>“Not hardly.”</p><p>“Or how all this feels right now?”</p><p>“Nuh-uh.”</p> <p>“Or what it’s like to go from a commoner to first in line for the throne, set to inherit one of the world’s largest fortunes?”</p><p>“Nope.”</p><p>“I figured.” The redhead looked around the suite of rooms. “Is this gonna be yours, then?”</p><p>“Guess so.”</p><p>“A taciturn girl, I like that. The others can be a bit of a handful.”</p><p>“Not me. I’m a pussycat.”</p><p>“Yeah, and I’m an amoeba.”</p><p>Holly pushed past Nicole—a relief from bowing and “Your Highness” this and “Your Highness” that. Nicole pegged her accent as deep South United States, Texas or Georgia or someplace like that.</p> <p>Holly peered out the five-foot-high windows. “Hmmm. It looks like we’re three stories up, but the south pavilion roof is right down there, ain’t it? And from there it’s not much of a drop for a tall girl like you.”</p><p>Nicole raised her eyebrows. Holly “rhymes with dragon” was a quick one. “Really? I hadn’t noticed.”</p><p>“My big ole Texan butt you hadn’t.” She slapped herself on the flank. “Ain’t it great?”</p><p>“Uh...it’s very nice.”</p><p>“But if I had to make that drop, I’d mess up my fabulous underwear. Heights give me the creeps. But not you, I bet.”</p><p>“I once followed a bear over a cliff.”</p><p>“I’m making a memo to me to follow up with you on that story. But why?”</p><p>“Well, I shot him but didn’t kill him, so I was morally obligated to—”</p><p>“No, no. Why this suite, why the setup so you can slip off the grounds? You’re not a prisoner, like Rapunzel in her tower.”</p><p>“I like to come and go as I like. Do you have any idea how long it takes just to arrange to go into town for, I dunno, a cup of coffee?”</p><p>“I got an idea.”</p><p>“First you gotta tell Edmund. Then he tells your security detail. Then they waste tons of time getting organized. Then, an hour or two later, finally, you can leave. Except you’re not alone, of course. And with all the bodyguards and royal cars and all, everybody stares. And you can’t pay for anything; the store owner comes out and practically genuflects. Then, finally, you come back to the gilded cage.”</p><p>“Prob’ly easier to stay in and have someone bring you a cuppa joe.”</p><p>“That’s not the point. The point is, I used to be able to come and go as I please, and now I can’t.” She resisted the urge to kick something. “Rapunzel’s got nothing on me.”</p><p>“Poor baby,” the Dragon yawned. “How do you find the strength to go on?”</p><p>“Now you’re just messing with me.”</p><p>The Dragon turned and beamed at her. “It’s what I do, darlin’. Excuse me: Princess Darlin’. So if you don’t mind my asking, what’s next for you?”</p><p>“Princess lessons, I guess. Maybe smashing champagne bottles on a few cruise ships.”</p><p>“Well, there’s worse royal families to end up in, you ask me.”</p><p>“That’s hard to imagine.”</p><p>“Ha! Honey, I’m a history major and a writer. Know what that makes me? The biggest snoop you ever met.”</p><p>“With a wonderful ass.”</p><p>“Well, yeah. And historically speaking, most princesses were ugly and dumb from all the inbreeding.”</p><p>“What a lovely thought,” she said, appalled.</p><p>“History ain’t lovely, honey. At least in this country, they don’t much care if you marry one a’ the hoi polloi.”</p><p>“I have noticed they’re all ridiculously good looking,” she admitted. “Guess it pays not to keep marrying your cousin.”</p><p>“Check your mirror sometime, honey, speaking of ridiculous.”</p><p>“Well, biggest snoop I ever met, expert on the royal family, I have to admit I’m curious about something.”</p><p>“Shoot, darlin’.”</p><p>“What’s your theory about Prince Nicky’s parentage?”</p><p>Holly snapped her notebook shut and gave Nicole a look over her bifocals. “That’s generally considered the rudest question you can ask in these here parts. You want to get along with your new family, I wouldn’t bring it up. Ever.”</p><p>“Thanks for the advice.”</p><p>The sunny smile returned. “All part of the service, darlin’.”</p><p>Chapter 23</p><p>J effrey had spent the last two hours guarding Nicole’s closed bedroom door, then went to stroll the grounds on a break. And like a lovesick school boy, he was standing on the lawn beneath Nicole’s suite, staring up at the windows.</p><p>Get it together, man.</p><p>He’d had flings before. He’d even been in love before. But no one had ever made him feel like this. Hot and cold and urgent and lusty and protective and angry and happy all at once or one right after the other.</p><p>It was...disconcerting.</p><p>He doubted Nicole had a clue. He prayed she didn’t have a clue. It was too embarrassing, almost a cliché; he was not in a Whitney Houston movie, for the love of God. And he outweighed Kevin Costner by forty pounds.</p><p>While he watched the window, he thought about the kiss. Thought about her scent—she smelled like the outdoors, fresh and cottony—and her sweetly yielding mouth. Thought about how he almost took her on the floor of her living room like a—like a—</p><p>He tried to shake it off. Never had he been so easily distracted while on duty; it was shameful. He was doing her no good if all he could think about was how she looked without her—</p><p>Now what the hell was this?</p><p>The darkened window was silently swinging open and he grabbed for his gun out of pure ingrained training. Which would have been fine if someone was going in.</p><p>Instead, a lithe figure in dark clothes climbed out, hung from her hands by the sill, and dropped almost noiselessly to the roof of the pavilion. Swung over again, hung until her legs only dangled about four-and-a-half feet above the ground, and dropped yet again. Then stood, looked around, and walked away without the slightest trace of a limp.</p><p>He holstered his gun and nearly fell to his knees, his relief was so great. The twit could have broken every bone in her body! Talk about your personal and professional disasters. He could imagine the conversation: “My king, the first night I was in charge of Princess Nicole’s detail, she broke both her legs. Very sorry.”</p><p>He stepped out of the shadows to intercept her. “Going somewhere, Your Highness?”</p><p>“Gaaaaah! Jeez! Don’t do that!”</p><p>“So very sorry, Your Highness.”</p><p>“Jeffrey, you bum, were you watching my window?”</p><p>“Of course. You didn’t think we just hung around in doorways, did you?”</p><p>Hands on her hips, she advanced on him. He wondered how heavily armed she was. “I just want to take a walk, get it? And I don’t want to bring the whole damn circus along, either.”</p><p>“How about just me, Your Highness?”</p><p>She chewed on her lip, which made him want to chew on her lip, and finally said, “Well, I s’pose. Let’s hit the bricks.”</p><p>“Thank you, Highness.”</p><p>“Like you wouldn’t rat me out if I didn’t let you tag along.”</p><p>“So astute, Your Highness.”</p><p>“And that’s another thing. I saw you yesterday. On your break.” They were walking across the vast lawn, staying out of the pools of brightness cast by the floodlights. “Doing the New York Times crossword.”</p><p>She saw him? Well, that seemed fair, as he was acutely aware whenever she was within twenty yards of him. “Yes?”</p><p>“In ink.”</p><p>“I was all out of chisels.”</p><p>“But I’ve seen footmen treat you like your knuckles drag on the ground when you walk.”</p><p>“I know. Isn’t it splendid?”</p><p>She stared at him, then laughed. “Ah. Ah-ha! I get it. Me big dumb bodyguard, me easily tricked, come into my web said the spider to the fly.”</p><p>“Or words to that effect,” he agreed, hands in his pockets so he wouldn’t grab her for another kiss. “Let them think what they like. Let them assume a man my size is slow and/or stupid. I like it when they can’t see me coming.”</p><p>“Now that’s a philosophy I can get behind,” she said approvingly, and he grinned in the dark. “So where’d you learn to fish?”</p><p>“My dad, when he wasn’t guarding the late king and queen. His dad before him. How about you?”</p><p>“I found guides and they taught me. I’ve spent more of my life in Los Angeles than Alaska, but I was always...I don’t know...pulled?”</p><p>“Pulled,” he agreed. It was as fine a word for duty as any. Duty to country, or to self.</p><p>“I always wanted trees and rivers and green. I feel like there’s a plan when I’m in the forest instead of all this—this”—she gestured vaguely and he wondered if she realized she was pointing at the palace—“chaos.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“They’re a noisy bunch,” he said quietly, “and they’ve got tempers like you wouldn’t believe. Or perhaps you would. But they’re good people. There’s a reason nobility comes from the word noble. The Baranovs showed me that when I was still a child.”</p><p>“Wow, Jeffrey, sounds like you’ve got a serious case of man-love,” she teased.</p><p>He didn’t crack a smile. “They take nothing for granted; not their wealth, not our service. Nothing. And if someone shot me, he’d have his hands full with my king. I can dedicate my lives to them because they have dedicated theirs to mine.”</p> <p>She chewed on that one for a moment, then added, “Really noisy. Hair-trigger tempers.”</p><p>“Pot, meet kettle. Kettle, meet pot.”</p><p>“Oh, hush up. You and your unanswerable observations.” She was cupping her elbows and he realized that she was wearing only black leggings, flats, and a black T-shirt, and the sun had set two hours ago. He unbuttoned his suit jacket and slung it over her shoulders.</p><p>“Thanks. Stupid not to bring a jacket. Except I didn’t have a black one.” She pushed her arms into the sleeves and huddled into it. “Hey, maybe I would have frozen to death and then wouldn’t have to worry about any of this.”</p><p>“How nice that my career would have ended on a note of personal disaster, not to mention total disgrace.”</p> <p>“Hey, nobody asked you to skulk outside my window.”</p><p>“I’ve been transferred to your detail,” he said, not telling her he’d slammed the paperwork through himself. Not telling her that the thought of someone else guarding her made him physically ill. “You don’t have to ask me to skulk. Skulking is what I do.”</p><p>“Great.” She kicked at a tuft of grass. “What, you get demoted? That’s a bummer.”</p><p>“Not...quite demoted, Highness.”</p><p>“Nih. Cole. Nicole. Nicole! You’re wasting your time, you know. I thought you realized when we met that I could take care of myself.”</p><p>“Nicole Krenski, private citizen? No question. Her Royal Highness the Princess Nicole? The world is a big place, and there are an awful lot of people who wouldn’t mind seeing you hurt. Or ransomed.” Or dead.</p> <p>“I’m the same person I was two weeks ago,” she argued.</p><p>“Yes, Princess Nicole. To that end, you’re the same person you were thirty years ago: Princess Nicole.”</p><p>“My mom was right not to tell me,” she muttered. “She was right to protect me from all this.”</p><p>“Your mother kept you from your rightful inheritance, from your destiny. And for what? To keep you to herself.”</p><p>Nicole swung around and even in the near-gloom he could see her blue eyes blaze. “Do not ever shit on my mother, Jeffrey, unless you’d like a pistol-provided enema.”</p><p>“If I have angered Her Highness, I apologize.”</p><p>“And stop talking about me in the third person!”</p><p>“A thousand apologies.” He paused and swallowed a snicker. “To Her Highness.”</p> <p>This time the kick landed on his left shin, after which she spent a full minute hobbling in a small circle and groaning, “Ow my God, oh ouch oh ow ow ouch ouch ouch ouch!”</p><p>“Do you require a doctor, ma’am?”</p><p>“No fucking doctor! Jeffrey, you are driving me batshit.”</p><p>“A thousand apologies.”</p><p>“Well, that’s two thousand for me, then. And we’re never going to talk about it again, are we?”</p><p>“Talk about what?” he said, playing dumb, which he did almost as well as Edmund.</p><p>“This,” she said, and caught him by the hair and pulled him down to her for a kiss that he thought might burn his mouth.</p><p>Chapter 24</p><p>T hey grappled, groped, and danced back and forth on the lawn, their mouths together, their tongues dueling, until Nicole lost her balance, Jeffrey lost his trying to grab for her, and they both rolled all the way down the south lawn.</p><p>How steep is this hill? she had time to wonder before fetching up against the trunk of a tree, hard.</p><p>She groaned.</p><p>“Nicole?” His face peered anxiously down at her, feeling her limbs, the back of her skull. “Are you all right? Do you need a doc—”</p><p>“No...fucking...doctors,” she moaned, wondering if he’d even realized he’d dropped the “Her Highness” crap. “Had my fill while I was watching my mom die.” She sat up and observed the line of pine trees marking the edge of the lawn. “Oh, man, I hope you’ve got a crane in one of your pockets. I don’t think I can get back up that hill on my own.”</p><p>“Why—why did you do that?”</p><p>“Because I’m clumsy and I don’t know the lay of the land.”</p><p>“Not that. Why did you kiss me?”</p><p>She extended a hand, more to feel his than anything else, and he pulled her easily to her feet. “Why did you kiss me?”</p><p>“I told you why. Once you’re officially a princess—”</p><p>“Screw that, Jeffrey. Do you know how long it’s been since I got laid?”</p><p>He gaped at her.</p><p>“Well?”</p><p>Still he stared.</p><p>“Going on two years, buddy boy. And if you think I’m gonna be The Celibate Princess, your tailor’s been cutting your suits too tight.”</p><p>“I—I—I—”</p><p>“Put it this way. You can do me, or you can find someone to do me. Y’know, vet their credentials, make sure they’re not a security risk. That sort of thing. Either that or I keep sneaking out of the castle at odd times of the day and night looking for lurrrrrv.”</p><p>Even in the gloom, she could see him whiten. “You—you—you—”</p><p>“Are you sure you’re the smart one?”</p><p>“My IQ is 157,” he snapped, brushing pine needles out of his hair, “and you’re telling me I’ve got to fuck you or pimp you?”</p><p>“Wow, that’s quite a turn of phrase, Big Brain. But, yeah. That’s what I’m telling you.”</p><p>He threw up his hands and walked around in a small circle. “You’re just as bad as any of them!”</p><p>“Oh, hey. No need to get nasty.”</p><p>“My way or the highway.” Now he was kicking grass. “It ought to be on the Baranov coat of arms.”</p><p>“What is on the Baranov coat—”</p><p>“Nicole, I can’t.”</p><p>“Oh. Old war injury?” She swallowed a giggle as she saw him flush.</p><p>“I didn’t mean I physically can’t—couldn’t—I mean I’m perfectly capable—that is, the ladies have said—not that there have been a lot, but—oh, fuck.”</p><p>That was it; it was too much. Overload. She sank to her knees, laughing like a loon on uppers.</p><p>“I remind Her Highness,” he said grimly, hands jammed wrist-deep into his pockets, “that I am heavily armed.”</p><p>“Prove it, stud. And stop talking about me in the third person; I’m not warning you again. But first get me up this hill.”</p><p>“I’ll do the latter, but we’re not done discussing the first.”</p><p>“How about if I make it a royal command?”</p><p>“You couldn’t issue a royal command if I stuck my gun up your nose.”</p><p>“Oooh, is that your idea of foreplay?”</p><p>Muttering, he turned his back to her and brushed more pine needles off his suit. She leaped on his back and wrapped her legs around his waist. He was so surprised he nearly fell down again.</p><p>“Let’s ride, cowboy,” she said, then kissed him on the right earlobe.</p><p>He took the gradual slope at a dead run, clutching her legs so she wouldn’t fall off, and she rode him all the way to the top, whooping and giggling.</p><p>They were having so much fun, in fact, that they nearly knocked Edmund down the same slope they’d just come up.</p><p>Chapter 25</p><p>J effrey had his gun out, but whether it was to shoot himself, Nicole, or Edmund he didn’t know.</p><p>Disgrace. Dishonor. Death?</p><p>Edmund’s question, “Did you two lose something besides your minds?” was still hanging in the air.</p><p>Nicole hadn’t climbed down. She just glared at Edmund over Jeffrey’s left shoulder. He could feel the glare.</p><p>“What are you doing out here? It’s practically the middle of the night!”</p><p>“It’s nine-thirty,” Edmund said mildly. “Prince Nicholas went looking for you, Princess. He is still looking. So I suggest, Your Highness, that you get back inside. Now.”</p><p>It was amazing. He sounded totally polite, even deferential, but she knew it wasn’t a request.</p><p>Jeffrey, the bum who was supposedly watching out for her physical safety, dropped her like she was hot, and she hit the lawn ass-first.</p><p>“Ow, dammit!” Nicole reacted. Then, “Fine, we’re going.”</p><p>“Mr. Dante—”</p><p>“Jeffrey, your...ah...devotion to duty is commendable, but I am perfectly capable of escorting Her Highness back to the palace if you need to...ah...walk the perimeter. That is what you were doing, yes?” He speared Jeffrey with a laser-beam gaze. “Walking the perimeter?”</p><p>“Yes.”</p><p>“Very well. Good night.”</p><p>“Good night,” Jeffrey said glumly. There was no point in wondering whether Edmund had seen them kissing. The man saw everything.</p><p>“Hey.” Nicole was handing him back his jacket. “You’re not in trouble, right? Because I take full responsibility. I was the one who climbed out of my window and—”</p><p>“I enjoyed our walk, Highness,” he said loudly, drowning out her confession. “Reynolds will relieve me at the top of the hour, and I’ll see you tomorrow.”</p><p>“Oh.”</p><p>Incredibly, she seemed almost hurt. But that couldn’t be right. He was saving her reputation at the cost of his own. It was for her own good. Surely she realized that.</p><p>“Fine. See ya,” Nicole said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She fell into step with Edmund and walked with him without once looking back.</p><p>He knew, because he was watching.</p><p>Chapter 26</p> <p>P rince Nicholas, last in line for the throne, was giving serious thought to playing baseball with the jade chess pieces the Emperor had given his great-grandfather when Edmund finally walked in with Nicole.</p><p>Edmund, of course, looked as he always did: starched and proper. Edmund was never-ending, like the tides, and never-changing, like the face of the moon, or his father, or Kathryn’s aim.</p><p>But Nicole looked like she’d been run over by a truck. Her hair was all over the place, there was something sticky (sap? mud?) on her left cheek, pine needles all over her leggings, a bloody scratch on her right arm, and her mouth looked weird, like the lips were slightly swollen or something.</p><p>“Holy crap! What happened to you?”</p><p>“A midnight hike,” she said. “Thanks for the escort, Edmund. Buh-bye.”</p> <p>“Highnesses.” Edmund bowed and left.</p><p>Nicole looked around the room, noting the several dozen chess boards. “Oh, boy. The boredom generated in this room alone is trying to sap my will to live.” She turned her gaze—so like his other sisters—on him. “You were looking for me?”</p><p>This was a pleasant surprise. His other siblings took their sweet time when he needed one of them or were busy on one royal duty or another. He was the baby; he was used to the teasing and, worse, being ignored.</p><p>And Nicole was really old, older even than David! Mid thirties! That was old, man. He couldn’t believe he had to wait only ten minutes for her to show up.</p><p>“I knocked on your door but you didn’t answer, so I thought you were sleeping. But Edmund said he knew where you were. It’s kind of cold out for hiking, isn’t it?” he asked, puzzled.</p><p>“That depends,” she replied, “on who you’re hiking with. What’s up, blondie?”</p> <p>“Nothing.”</p><p>“That’s why I got hauled into the Room of Perpetual Yawns? For nothing?”</p><p>“I just—I was just hoping you were doing okay.”</p><p>She gave him an odd look and sat down across from him. They both ignored the chess board between them. “As well as can be expected, I guess.”</p><p>“If I had to go live in a strange place, I might be scared. And I prob’ly wouldn’t tell anybody if I was scared. And it’s okay. If you’re scared, I mean.”</p><p>“I’m fine.”</p><p>“Also,” he added, holding out a CD case, “there’s this.”</p><p>She took it and examined it. “What is it? Did you burn me a mix CD? Because I have to tell you, I’m all eighties rock, all the time.”</p> <p>“Wow, you really are old.”</p><p>“What a wonderful conversation we’re having,” she muttered, and he felt bad because he forgot old people didn’t like being reminded they were old. “If this isn’t The Greatest Hits of Teena Marie, then what is it?”</p><p>“The nineteen ways I’ve found to get safely out of the palace without being seen. You keep going over the ledge like that and off the pavilion, you’re going to break an ankle.”</p><p>She stared at him. “Does everyone know that’s why I picked that suite?”</p><p>“Just me and Edmund. And probably your security detail. And maybe the Dragon. Probably the Dragon.”</p><p>“If he didn’t, he sure does now,” she muttered, which he didn’t quite get. “Does the king know?”</p><p>“No, our father doesn’t know. Are you kidding? He still thinks Kathryn’s a virgin.”</p><p>Her eyes nearly bulged out of her head. “Thaaaat’s a bit of an overshare. Let’s not do that again, okay? Okay.”</p><p>“Now I’m the only virgin in the family,” he added glumly.</p><p>“You just did it again!”</p><p>“Well, I am.”</p><p>“Don’t sweat it. Sex is overrated.”</p><p>“Really?” His brothers and sisters never talked to him about this stuff. Why would they? To him, he was always going to be the six-year-old mischief maker who didn’t look like any of them. “You don’t like it?”</p><p>“I didn’t say that, I just said it’s overrated. Look, when you’re a virgin, losing it is the most important thing in the world. It’s all you can think about, right? But once it’s gone, once you’ve got that whole awkward weird first time out of the way, it’s never going to be as big a deal again.”</p><p>Except she had an odd look on her face as she told him this, almost like she wasn’t sure she believed what she was saying.</p><p>“Hard to imagine,” he sighed.</p><p>“Trust me, this aged ancient knows of what she speaks. Dammit! Now I’m referring to myself in the third person.” She bounced the case up and down in her hand like a baseball. “Thanks for this. I owe you one.”</p><p>“Damn right! So keep it in mind.”</p><p>“Don’t sweat it, Curly. I never forget a favor.”</p><p>“Of course you don’t. You’re one of us. And don’t call me Curly.”</p><p>“Or what?”</p><p>“Or I’ll blow up half of your personal belongings.”</p><p>“Yeah, listen, what is it with you and incendiary devices? Is it the typical youngest-seeking-attention thing? Or do you, uh, need to be speaking to someone? Someone with many degrees in psychiatry?”</p><p>“Not telling.”</p><p>“You’ll tell, Curly.”</p><p>“Don’t call me Curly.”</p><p>“Oh, never again, Curly.” Then she hauled him out of the chair, bounced him to the floor, and tickled him until tears were streaming down his face and he was begging her to stop.</p><p>“This might not entirely suck,” she announced as he staggered to his feet. “I never had a little brother before.”</p><p>“I’m three inches taller than you are!”</p><p>“Yeah, but your muscle mass hasn’t caught up with your height. So until then I can beat you with impunity.” She shoved him and he nearly went sprawling, scattering chess pieces like confetti. “And I shall.”</p><p>“This does entirely suck,” he informed her, lying like mad. “The last thing I needed was another older sibling.”</p><p>“Suck it up, Curly.”</p><p>“Don’t call me—don’t tickle! No! I mean it! Quit! Nicooooooole!”</p><p>Chapter 27</p><p>K ing Al tiptoed through the outer room leading to his office, not an easy thing for a man of his height, or weight. Moving as stealthily as he could ever remember in his life, he eased the door open and slipped inside. This early, no one was likely to—</p><p>“Howdy, Big Al!”</p><p>Shit. “You! I fired you yesterday. Again! I made sure Reynolds got you on that flight! You’re supposed to be in Dallas right this second.”</p><p>“Honey, I’m from Houston. And o’course your man saw me get on board. But we refueled in Minot, and I hopped a flight back.”</p><p>“Shit.”</p><p>“Once we were back in the U.S. of A., your men didn’t have any authority over me. But you knew I couldn’t stay away, else why all the pussyfooting at this ungodly hour?”</p><p>“I was hedging my bets. Now get lost, you hideous scribe of a she-devil.”</p><p>“Dragon,” she said, smiling. She was wearing the usual purple glasses, this time with a red suit and white jogging shoes. She jiggled her left foot like mad. “And congrats; I didn’t know you knew a great big word like scribe.”</p><p>“How big can it be? It’s one syllable.”</p><p>“Talked to the new girl yesterday,” she added, apropos of nothing. “Seems like a nice enough gal.”</p><p>“You talked to Nicole?” He gestured to a chair. “Sid-down, what’s your rush? How’s she doing? What’d she say?”</p><p>“You’re askin’ me? You’re the daddy.”</p><p>“I’m—I’m trying to give her some space. We’ve asked a lot of her this week. I don’t—I don’t want to make things worse.”</p><p>The Dragon’s mouth, normally set in a jeering smile, softened. “She’ll come around, Big Al. Who’d resist your charms?”</p><p>“Very funny,” he grumped. “So what’d she say?”</p><p>“Oh, we mostly talked about the historical prevalence of inbreeding among royalty.”</p><p>Al groaned.</p><p>“Well, not in your family, o’course.”</p><p>He groaned again. “Thanks for that.”</p><p>“And we talked about her new digs. She sure looks like you guys. And acts like you guys. But—”</p><p>“Yeah?”</p><p>The Dragon appeared, of all things, to be choosing her words carefully. “She’s still missing her mama, o’course.”</p><p>“Well, naturally.”</p><p>“And that’s why you’ll have a hard time. Not because of all this.” She gestured to the magnificent office, and the king knew she meant all of it—the money, the status, the property. “But because she lost the only family she ever had. So why would she ever dare let any of y’all get close?”</p><p>The king stared at her. “You’re pretty smart, for a psychopath.”</p><p>“Aw.” The Dragon winked. “That’s what all the cute boys say.”</p><p>Chapten 28</p><p>“J effrey, would you mind?”</p><p>“Not at all, Highness.” Her bodyguard stepped back and kicked in the door to the Outer Banks Co.</p><p>“Thanks, Jeffrey.”</p><p>“My pleasure, Your Highness.”</p><p>Nicole brushed splinters off her shoulders and marched inside. “Freeborg, you scumbag!”</p><p>Her former boss had shoved his chair back as far as he could go without actually going out the window. He was pale, even for him. “Nicole, what—you—I mean, Your Highness—”</p><p>“You ratted me out! You blabbed to the press! You ruined my life!”</p><p>“But Nicole—I mean, Your Highness—it was going to come out anyway! We had royalty in here two days in a row! I just thought—” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You thought you’d give this tin-shit operation some much-needed publicity. Never mind that you sold me down the river at the same time.”</p><p>“But they all—I mean, the royal family all knew you were—”</p><p>“Yes, but they couldn’t prove it unless their own doctor did the test. Something I was managing to avoid very neatly, by the way. Until you wrecked any chance I had of a normal life.” She was leaning over his desk now, and he was cringing back in his chair. Since he had seen her shoot, this was a wise move. “So I figure the least you deserve is a wrecked door and the penalty of my displeasure.”</p> <p>Jeffrey whispered in her ear. She smiled. Her former boss went, if possible, whiter. “The penalty of our displeasure. That’s the royal ‘our,’ by the way.”</p><p>“Nic—Your Highness, give me a break. Except for the occasional Sandra Dee, we’re struggling to stay out of the red. Now I’ve got bookings through the end of next year!”</p><p>“And all you had to do,” she said sweetly, “was sell us down the river.” Hmm. She could get used to the “royal we” thing. “Well, enjoy your success, Mike. You’ve earned it. By the way, don’t be surprised if you’re audited every month until the end of time.”</p><p>“You wouldn’t.”</p><p>“Hello, have we met? Jeffrey, we’re out of here.”</p> <p>“Hey, you were never exactly Employee of the Month!” Freeborg yelled back. “With that mouth?”</p><p>“Feel better?” Jeffrey murmured, tapping his earpiece.</p><p>“Loads,” she said, and smiled at him.</p><p>Chapter 29</p><p>B ack in the car, Jeffrey tapped his earpiece again. “Rodinov and Hunter en route to the palace.” He listened, then tapped it again.</p><p>Nicole figured it was a two-way communication piece, kind of like the ones they used in the old Star Trek: The Next Generation episodes. Tap to open broadcast, tap to close. Neat.</p> <p>“Hunter, huh?”</p><p>“That’s your call sign.”</p><p>“Why not just use my name?”</p><p>“Because then the bad guys will know who we’re talking about.”</p><p>She mused in the passenger seat. She had flatly refused to ride in the back like an invalid. “What’s the king’s call sign?”</p><p>“Warrior.”</p><p>“Alexander’s?”</p><p>“Poet.”</p> <p>Poet? Weird. “Alexandria’s?”</p><p>“Sleepwalker.”</p><p>Weirder and weirder. “David’s?”</p><p>“Mini-Me.”</p><p>“Oh, that’s good. Christina’s?”</p><p>“Cookie.”</p><p>“Kathryn’s?”</p><p>“Mime.”</p><p>What the blue hell? Those were some pretty fucked up call signs. “Nicholas?”</p><p>“Rebel.”</p><p>“Well, all you have to do is read People to figure that one out.” She was forgetting someone, she just knew—ah! Alexandria had married an American two years ago, but he was currently out of the country. In fact, Alex herself was leaving tomorrow to be with him, according to the schedule.</p><p>Yeah, the schedule. She got one of her very own, first thing in the morning, along with all the major newspapers. Every little thing any of the family had to do was spelled out in excruciatingly dull detail. Every morning. With hourly updates.</p><p>“So!” she said brightly. “Given any thought to our little chat last night?”</p><p>“You mean the chat and the piggyback ride that almost got me fired?”</p><p>“Nobody’s firing you without my say-so. Wait a minute. If I fire you, will you sleep with me?”</p><p>“Do you hear yourself?”</p><p>“All too well. Never mind, that’d mean you could sue me for sexual harassment. I’d hate to inadvertently bring a lawsuit against the royal family my first week in residence.”</p><p>“You’ve never done anything inadvertently.”</p><p>“Well, thank you. Neither have they.”</p><p>“The royal family. Them. They.”</p><p>“What? Did you skip breakfast? Blood sugar a little low?”</p><p>“Your royal family. Us. We.”</p><p>“Yeah, well, give me time. Anyway, quit trying to change the subject. Have you thought about our chat or haven’t you?”</p><p>Jeffrey, who usually drove like a robot, actually took his gaze off the road and looked at her. “It’s all I’ve thought about. I didn’t sleep a wink last night.”</p><p>“Really? That’s odd. I slept great.” And she had, because she hadn’t slept a wink the night before. “So? What’s it going to be?”</p><p>“Ni—Your Highness, there’s a car behind us with two more bodyguards in it. You want me to just—to just pull over and do you?”</p><p>“In a perfect world,” she admitted, “yes.”</p><p>“In a perfect world...”</p><p>“What?”</p><p>“Never mind.”</p><p>“Come on, spit it out.”</p><p>“In a perfect world you wouldn’t be a princess and I wouldn’t be your subject,” he said in a rush of words.</p><p>“Jeez, take a breath or you’re gonna pass out at the wheel.”</p><p>He did as she asked, he took a deep breath and tightened his grip on the wheel. She was surprised the wheel didn’t creak from the pressure.</p><p>“And for the record,” she added, “I agree one hundred percent. But we’re not in a perfect world. If we were, my mom would be alive and French fries would help you lose weight.”</p><p>He barked a laugh.</p><p>“But we’re not. And she isn’t. And they don’t. So what’s the plan?”</p><p>“The plan is, I drive you back to the Sitka Palace, Princess, and then you do as you will.”</p><p>“Like that, is it?”</p><p>“Yes, it’s like that.”</p><p>“Too bad. I get the feeling we would have been pretty good between the sheets.”</p><p>“I, too,” he said quietly, and wouldn’t speak to her for the rest of the drive.</p><p>Chapter 30</p><p>“Y ou sure you’re ready for this, kiddo?”</p><p>“Sure, Al.”</p><p>“Because we can put it off for a few more days. It’s no problem.”</p><p>“It’s a huge problem; they’re already waiting for us.”</p><p>The king snorted. He was actually dressed up in a tailored navy blue suit, sky blue shirt, and red-and-blue-striped tie. “Believe me, they’ll come back.”</p><p>“Dad, she wants to do it,” David said, equally dressed to the nines. “Let her do it.”</p><p>“It’s fine, Al.” “Al” was as close as Nicole could come. She had dropped the “king” but couldn’t bring herself to call him Dad, or even Father. “Let’s go.”</p><p>They were in a spacious salon, and sun streamed through the Eastern windows. The king was there, she was there, and David was there. And their bodyguards were there, of course. Also the redhead who, wonderfully, seemed to irritate the piss out of Al.</p><p>The other royals had other duties or had gotten out of this one.</p><p>Nicole also was dressed in a suit; her closet had mysteriously filled overnight with clothes that fit perfectly. She was dressed in black, with a white blouse and her mother’s gold earrings.</p><p>The Alaskan Olympic Ski Team marched in, fresh from two silvers and a gold at the Winter Olympics in Gstaad. Nicole, David, and Al were supposed to pat them on the back, have a nice lunch, and in general tell them they were the pride of Alaska.</p><p>Which, to be fair, they were.</p><p>Nicole sighed and prepared to be bored.</p><p>She wasn’t bored. Not at all. Because the Olympian on her left—Yanos somebody—and the one across the table from her—Thomas somebody—were both excellent flirts with truly marvelous physiques.</p><p>They were full of charming questions about her status as the bastard princess (The papers had given her the nickname, and it had stuck...and she didn’t mind. It was better than just princess.) and what she had been up to and how she was coping.</p><p>“Truly remarkable,” Thomas somebody was saying. “And how are you adjusting to life at the palace?”</p><p>“Oh, you know. Good days and bad. Hey, don’t hog the last roll.”</p><p>“As my princess commands,” Thomas teased, and tossed it to her.</p><p>“Very funny, Skier Boi. So what do you guys do when you’re not shushing down mountains?”</p><p>“Beguile beautiful women,” Yannos teased.</p><p>“And beg for their favors,” Thomas added.</p><p>“Beg for their favors? What century do you live in?”</p><p>“Any century where you are, Highness.”</p><p>“Really?” Hmm. She was eating with two men who were literally the best in the world at what they did, who had the bodies of gods and, one hoped, appetites to match. “I don’t suppose one of you guys would be open to a royal command, huh?”</p><p>“We would be open to anything Your Highness wishes.”</p><p>“Some things more than others,” Thomas asked, giving her a wicked grin.</p><p>Now this she could get used to. “Oh! In that case, I—shit! I dropped one of my eight forks.”</p><p>“Here, Princess, you can use mine to—”</p><p>“Code twenty-nine!” Jeffrey bellowed. Then he yanked Thomas’s chair away from the table, yanked Thomas out of said chair, and tossed him four feet through the air. The skier hit the wooden floor with a spectacular slam.</p><p>Nicole saw that the other royals had been hauled away from the table and their guards were standing protectively in front of them.</p><p>“What the hell?” the king roared, spraying soup.</p><p>“He was trying to stab the princess,” Jeffrey replied stonily.</p><p>Nicole was on her feet. She didn’t remember pushing her chair back or standing. “He was lending me his fork.”</p><p>Six more bodyguards came out of nowhere and they were all pointing their guns at Thomas, who was lying on his back like a stunned beetle.</p><p>“Are you all right?” David asked sharply, peeking around his bodyguard. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She raised her voice. “He was lending me his fork. Of course I’m all right!”</p><p>“Weapons check?” somebody said.</p><p>“Clear.”</p> <p>“Perimeter?”</p><p>“Clear.”</p><p>“Code canceled. Comply?”</p><p>“Complied.”</p><p>“Are you well, Highness?” Jeffrey had the nerve to ask, holstering his weapon.</p> <p>“You big bag of—come with me!”</p><p>“Princess—”</p><p>“Right now!”</p><p>“Wait a minute,” the king started, but by then she was out of the dining hall.</p><p>Jeffrey followed her into the next room, which Nicole saw was a hallway.</p><p>“You prick! You did that because he was flirting with me.”</p> <p>“And trying to stab you.”</p><p>She nearly choked on the urge to punch him in his smug face. “He was not trying to stab me and you know it! You saw us getting cozy, and for whatever weird reason, you didn’t like it.”</p><p>He frowned at her. “Weird reason?”</p><p>“You’ve made it clear you don’t want the job, so now...what? You’re gonna immobilize any decent prospect that comes along?”</p><p>He folded his arms across his massive chest and didn’t reply.</p><p>“Answer me, Jeffrey.”</p><p>“They’re waiting for you at the luncheon. And I need to get back to reassess the threat.”</p><p>“You’re impossible. Try that again and I’ll shoot you with your own gun. Now get lost!”</p> <p>“Princess, I’m currently on duty and—”</p><p>“Am I being unclear? Slurring my words? I want you out of my face. Go away. Run away. What the fuck ever. Just get in the wind, buddy boy, and you can consider that a royal command.”</p><p>She ignored the stricken look on his face. She was completely immune to it. It didn’t make her feel bad at all. Nope. Not one bit.</p><p>Fuming and heart sore, she went back to the luncheon just in time to hear the king scream, “Well, somebody better tell me what the hell is going on!”</p><p>“Shut up, Al. Eat your soup.”</p><p>He pointed his spoon at her, then seemed to think better of it and didn’t say anything.</p><p>The rest of the conversation was strained, to say the least.</p><p>Chapter 31</p><p>J effrey knocked on the door he had leaned against thousands of times.</p><p>“Come!”</p><p>He opened it but stayed on the threshold. “You wished to see me, my king?”</p><p>“Yeah, come on in, Jeff.”</p><p>Jeffrey walked into the office. “Majesty?”</p><p>“Have a seat, Jeff.”</p><p>For the first time in his career, Jeffrey took the seat opposite the king. “How may I assist you, my king?”</p><p>“You can settle down and unclench. Want a drink? Something to eat?”</p><p>“No, sir.”</p><p>“How about a vacation?”</p><p>“No, sir!”</p><p>“Calm down, you’re so tense you’re making me nervous. Granted, your last vacation wasn’t much fun—”</p><p>“You nearly died. By the time the border patrol eased up enough for me to get back into the country, it was all over.”</p><p>“—but your last vacation was also four years ago. I think, after what happened at lunch, that you’re a little overdue.”</p><p>“Does the king require my resignation?” he asked stiffly.</p><p>“Shit, no!” The king looked honestly stressed, and even worried. Jeffrey had often wished someone would try something on his watch, just so he could have the pleasure of taking a bullet for Alexander Baranov II. And he always felt guilty when he had such thoughts. “I’m just worried about you, Jeff. Nicole popping up out of the woodwork has been stressful for all of us—”</p><p>My king, you have no idea.</p><p>“—everybody’s on edge and—”</p><p>She talked to me like she hated me.</p><p>“—stressful, sure, and—”</p><p>Hated me.</p><p>“—a handful, but she’s had to adjust to a lot—”</p><p>I couldn’t bear it if she felt the way she sounded.</p><p>“Okay?”</p><p>“Of course, my king.”</p><p>“Okay.” King Alexander beamed. “So it’s settled. Effective tomorrow, you’re on vacation for the rest of the week.</p><p>“What?”</p><p>“Okay, okay, take two weeks. See what a softy I am?”</p><p>He cursed himself for not paying more attention. Then he realized: the king was right. He couldn’t even focus on orders from the sovereign. What good was he to Nicole in this state?</p><p>“That, ah, that won’t be necessary, sir. I’ll see you Monday morning.”</p><p>“Take ’er easy, Jeff. Oh, and Jeff! Where’s the Dragon right now?”</p><p>He consulted his Palm Pilot. “Third floor, north wing. I would guess she’s taking more pictures of the family portraits.”</p><p>“Great. That’s fine. Thousand of feet away. Okay. Thanks. Enjoy your time off. You’ve earned it.”</p><p>Then why did it feel more like a punishment than a reward?</p><p>Chapter 32</p><p>C hristina Baranov, once Crown Princess of Alaska, now just plain Princess, came at once to answer her daughter’s cries.</p><p>She cursed Dara’s grandfather for letting the almost-four-year-old watch Lord of the Rings. This was the third night in a row Dara had dreamed of catapulting severed heads. She soothed her daughter, named for a dead queen, David’s mother. And soon enough, the child drifted back to sleep.</p><p>David hadn’t come to help her. And when David was home, he always came when Dara cried.</p><p>Christina was hot tempered, but a good wife who loved her husband beyond all reason, and she said nothing to David when she returned to their bedroom.</p><p>“She okay?” David said, not looking away from the television. That in itself was super weird; David never watched television. He never had time. If he wasn’t tending the penguins or speaking at an aquarium or studying law or history, he had almost as much paperwork to juggle as Al, or Edmund.</p><p>Not anymore.</p><p>“Another nightmare about flying severed heads. Remind me to kick your dad’s butt up to his shoulder blades tomorrow.”</p><p>David smiled, clicking rapidly through the channels. “You know he can’t refuse her anything.”</p><p>“He’s spoiling her rotten and giving her nightmares. The worst of both worlds.”</p><p>“Don’t bug Dad. He’s got enough on his mind. Especially after that balls-up of a luncheon.”</p><p>Shockeroo number eighty-seven, and it had already been a helluva week. David didn’t normally talk crude; he left it to her.</p><p>She sat on the edge of the bed, trying for noncommittal. “Yeah, I heard Jeffrey had kind of an overreaction. But all those guys are wound so tight I can’t believe it hasn’t happened before.”</p><p>“Mmm.”</p><p>“So how’d it go? Nicole’s first official thingamabob?”</p><p>“Before or after our gold medalist nearly got concussed?”</p><p>“Right. So. Uh. What are you doing?”</p><p>“Nothing.” Click click click click click. “At all.”</p><p>“Yeah, uh, we haven’t really talked about this.”</p><p>“Talked about what?”</p><p>“How you’re suddenly out of the job you’ve been training for since you were in diapers.”</p><p>At last, at last he looked at her. “There’s nothing to discuss. It’s just as much my duty to step aside for the true heir as it was my duty to learn how to—to run things after Dad. You know.”</p><p>She threw up her hands. “Duty! If I hear that word again this week I’ll puke! Fuck duty, how do you feel?”</p><p>“Fine.” Click. Click. Click.</p><p>She jerked the remote out of his hand, shut off the television, and tossed the remote across the room.</p><p>“Oh,” her husband observed, “now that’s mature.”</p><p>“David! Stop being such a damn guy and talk to me! Tell me you’re pissed, tell me you’re sad, tell me you’re thrilled to be off the hook. I don’t give a shit, just speak.”</p><p>Nothing.</p><p>“Speak!”</p><p>“Arf.”</p><p>“I hate you,” she muttered, getting up from the bed, but he rolled across the mattress, grabbed her arm, and pulled her back down.</p><p>“You worship the very ground I walk on and we both know it.”</p><p>“Don’t press your luck.”</p><p>“Chris, I can’t tell you how I feel because I don’t know how I feel. I really don’t. I’m just—” He groped for words, seemingly at a loss. Or perhaps actually at a loss.</p><p>“Well, I don’t really care if I’m ever queen. You know that. You always knew that.”</p><p>“Yes.”</p><p>“But you’ve got to have feelings about not being the king.”</p><p>“I do have feelings.” He paused. “I just have no idea what they are.”</p><p>She understood. She had spent her time as a royal dreading Al’s death, dreading the crown. And now that she never had to worry about it again, she wasn’t sure if she was relieved or out of sorts. And if she, who’d only been in the royal family a little over four years, didn’t know, how could David possibly know?</p><p>“You want something? An omelet?” Their suite was the only one equipped with a kitchen; Christina had been a cook in her old life. “Coddled eggs?”</p><p>“I’m sick of eggs. I’d rather have you.”</p><p>“Oooooh,” she said, letting him drag her across the bed and into his lap. “Now if only you had the remote back, you’d be the happiest guy in the country.”</p><p>Chapter 33</p><p>“U h, hello.” Nicole blinked at the stranger standing opposite her door. “Who are you?”</p><p>“Natalia Burdenov, Your Highness. I’m new to your detail, effective 0800 today.”</p><p>Nicole blinked harder. Yesterday had been a disaster—the botched luncheon, her screaming at Jeffrey—complete and total nightmare. She’d spent the rest of the day hiding in a library she’d found. No one had disturbed her, and she’d worked her way through four Hardy Boys books. She had declined to eat with the royal family and had hit the sheets early after someone sent up a sandwich and decaf. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her favorite sandwich: rare roast beef, mustard, tomatoes, on a sourdough roll.</p><p>She wondered how the palace staff ferreted stuff like that out.</p><p>Resolved to make a fresh start and hash this thing out with Jeffrey, her plan had been foiled by sleeping late. And now—</p> <p>“Where’s Jeffrey?”</p><p>“Off duty for the rest of the week, Your Highness.”</p><p>She squinted at Natalia, who looked as far from a bodyguard as anyone she’d ever seen: big dark pansy eyes, pale skin, long blond hair in a Valkyrie braid that hung over her left shoulder. Black suit. Armed to the teeth. Sensible flats.</p><p>“He’s gone?”</p><p>“Yes, Highness.”</p> <p>“Did I get him in trouble?”</p><p>“No, Highness.”</p><p>“Would you tell me if I did?”</p><p>“Yes, Highness.”</p><p>Great. They’d assigned her a cyborg.</p><p>She sighed. “Well, what’s the plan for today, Natalia?”</p> <p>“You’ll be presenting awards to the GSA—”</p><p>“What?”</p><p>“Girl Scouts of Alaska. Then lunch. Then—”</p><p>“Then nothing. I’m off duty then, too.”</p><p>Natalia didn’t blink. Perhaps she hadn’t been programmed to. “Yes, Princess.”</p><p>“And one more thing.”</p><p>“Yes, Princess?”</p><p>“Where’s Nicky?”</p> <p>Chapter 34</p><p>A fter dealing with several giggling preadolescents, all who wanted to know what it was like to be “a real live princess, like Sleeping Beauty!” she made her escape and tracked down the youngest prince. She found him exactly where Natalia had told her he’d be, which was a good trick.</p><p>Because when it was just family, the detail left them pretty much alone. They only stuck close at official luncheons and the like. And they were positively leechlike when the royals left the palace grounds. And yet, they always knew where each royal could be found, day or night.</p><p>Anyway, Nicky was watching the new Harry Potter movie, which she knew for a fact wouldn’t be out in theaters for another six weeks, and munching popcorn in the small theater.</p><p>Munching alongside him was Princess Christina.</p><p>“Hi, Nicky.”</p><p>He turned and smiled when he saw her. “Hi, Nicole. Lights!”</p><p>The gloomy theater instantly brightened, and the movie shut off.</p><p>“Sorry. I didn’t mean to interrupt—”</p><p>“He’s seen it three times already.” Christina was studying her with a cool, calculating gaze. “Did you come to rumble? Get payback for that bump on the noggin?”</p><p>“Don’t flatter yourself.”</p><p>“To meet your niece?”</p><p>“Uh, sorry about that. Sure, but maybe later? I mean, doesn’t she have a schedule, too?”</p><p>“I’m pretty sure Al is sneaking her Ding-Dongs and ruining her supper,” Christina said dolefully. “Why don’t you have supper with us? David and me and her, I mean, in our suite? I’ll cook.”</p><p>Oh, right. She had read that Christina Baranov, née Krabbe, had been a cruise line chef before meeting the king, and then David. “Sure, sounds good.”</p><p>“Are you allergic to anything?”</p><p>Amused, Nicole asked, “You don’t have paperwork on that?”</p><p>“Sure. But who can find it in that haystack?”</p><p>“No, no allergies. But I hate green beans.”</p><p>“Three helpings of haricots vertes coming up.” Christina tossed another handful of popcorn in her mouth. “So what’s on your mind?”</p><p>“Actually, Christina, I’m here for him.”</p><p>“You are? I mean, of course you are.” Christina looked surprised. Nicky looked smug. “Listen, I’m sorry about the other day. Even though you started it.”</p><p>“You really suck at apologies,” Nicky told his sister-in-law.</p><p>“I’m just saying—no hard feelings, okay?”</p><p>“I,” Nicole replied, “have no other kind of feelings, on the off chance you hadn’t noticed. Now if you don’t mind, I’d like to talk to Nicky alone.”</p><p>“What are you going to do to him?” Christina asked suspiciously, not budging from her seat.</p><p>“I’m going to probe his diabolical mind.”</p><p>“Seriously.”</p><p>“I am being serious.”</p><p>Christina turned to the only other blonde in the family. “Do you want me to stay?”</p><p>“What for?”</p><p>“She’s probably got some piano wire on her somewhere. Possibly a crossbow.”</p><p>“You think I’m in danger because she tried to punch you? You’re in danger because she tried to punch you. Why don’t you go take care of David’s penguins or something?”</p><p>“You mean it’s true?” Nicole said. “There really are penguins living inside the palace? I thought that was an urban legend.”</p><p>“Don’t we all wish.” The tall blonde shuddered but got to her feet. “Why don’t I go take care of the smelly things? Because I have a life? I’m gonna go make pea soup from scratch.”</p><p>“Pea soup,” Nicky said, shivering. “Why not just vomit into a bowl and call it good?”</p><p>“God, you’re disgusting.” Christina moved up the aisle. “Later, Nicole.”</p><p>“Maybe.”</p><p>“Even ‘maybe’ sounds ominous coming from you.” But Christina was talking to herself; Nicole had focused her attention on Nicky.</p><p>She sat beside him and said, “If I wanted to find out where a staff member lived while at the same time not making a big deal of it, how would I—”</p><p>He handed her a computer printout. It had one name on it, and one address.</p><p>Jeffrey Rodinov.</p><p>She stared at him. “What are you, a witch? How’d you know what I wanted? How’d you know I’d show up here looking for it?”</p><p>“Well, everybody knows Jeffrey was sort of forced into a vacation.”</p><p>“Forced?” she said sharply. Here she’d been thinking he had gotten himself transferred to another detail, and who could blame him?</p><p>“Well, yeah. He’s really overdue. It’s stressful, watching out for us.”</p><p>“I can imagine.”</p><p>“No, Nicole, you can’t. Our detail is bored 99.9 percent of the time, and the other tenth of a percent, people are shooting at them—or us—or trying to blow us up.”</p><p>“I guess I didn’t think about it like that.” Mostly, she mused, she thought of the detail as grossly invading her privacy as much as they could.</p><p>“And he was on Dad’s detail for years. That’s probably the most stressful detail of all.”</p><p>“I can imagine.”</p><p>“No, you can’t.”</p><p>“Okay, okay, we’ve established I’m the detail dumbass. But you still haven’t explained how you can see into the future. Is that your royal superpower?”</p><p>“I just figured you’d want to check up on him. Whenever one of our detail is sick or whatever, we usually stop by their place at least once. They’re trained to take a bullet or a knife; the least we can do is visit them when they’re sick or whatever.”</p><p>“Okay.” Sick or whatever had nothing to do with nothing, but she had no plans to enlighten the Prince of Darkness. “I’m with you so far.”</p><p>“And I figured you wouldn’t know who to ask—Edmund, by the way, when in doubt, always ask Edmund—so I pulled Jeffrey’s address out of one of our databases, printed it, and stuck it in my pocket. I figured I’d have to find you, but you tracked me down.”</p><p>She stared at him. “You’re kind of terrifying, you know?”</p><p>He arched blond brows at her. “Sure.”</p><p>“Didn’t you blow up the bathrooms at—”</p><p>“Nicole!” He grinned. “Don’t tell me you believe everything you read.”</p><p>“Just give me a chance to kill myself if I ever get on your bad side.”</p><p>“Please. I’m glad you’re here. Uh.” He colored. “I mean, I’m sorry about your mom and all, but I’m really glad you’re here. It’s been so boring lately.”</p><p>“Anything to brighten your weird little life.” She pocketed the printout. “Thanks for this.”</p><p>“Please. Next time give me something hard.”</p><p>“I’ll try to stump you.”</p><p>Chapter 35</p><p>J effrey sat in his living room, drinking Scotch.</p><p>This was a horrible idea, for several reasons.</p><p>One: He didn’t drink.</p><p>Two: If he did drink, it wouldn’t be Scotch, which tasted like rubbing alcohol to him, no matter how good or how old. And this had been a Christmas gift from the king; he knew it went for at least three hundred bucks. Still, it tasted like a doctor’s office.</p><p>Three: At the rate he was going, he was looking at a real bitch kitty of a hangover tomorrow.</p><p>And four: It wasn’t helping. He was still ashamed, and horny, and mad.</p><p>He drained the glass.</p><p>At least Nicole was in good hands. Natalia may have been the youngest agent on the detail, but what she lacked in experience she made up for in cold-blooded efficiency. And she had been an Olympian-level sharpshooter. Quite a catch for the detail and an impeccable military background, too.</p><p>But, oh God, he wished he was the one watching out for Nicole. Who knew what mischief that mouthy, gorgeous, irritating princess would get up to? For that matter, who knew what—</p><p>There was a tap on the door.</p><p>Jeffrey cursed. That would be a palace rep, asking him to return to duty for whatever reason. Except he couldn’t, because he’d been drinking.</p><p>He got to his feet and walked to the door, stooping to look through the peephole.</p><p>“Oh my God!” He yanked the door open. “Tell me Natalia knows where you are.”</p><p>Nicole brushed past him. “Natalia of the Borg thinks I’m asleep in my bed. Jeez, nice fumes, did you fall into a brewery on your way home?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Nicole!” he howled.</p><p>“Please come in, Nicole. So nice to see you again, Nicole.”</p><p>“Nicole! Sneaking out to walk around the palace property is one thing. But you can’t leave the palace proper, for God’s sake!” He fought the urge to gouge out his own eyes in horror. “The detail is going to shit.”</p> <p>“Only if you rat me out.” She was looking around his slightly messy apartment with interest. “So this is where you live when you’re not driving me crazy.”</p><p>“I drive you crazy?” He tried to drink more Scotch but realized anew that the glass was empty. “That’s funny, that’s hilarious, I would have bet large amounts of currency that it was the other way around.”</p><p>“Nice place.”</p><p>“Thanks.” He tried to see it through her eyes: the living room comfortably furnished with an oversized chair and a sectional couch. The fireplace. The kitchen, with dinner dishes still stacked in the sink. A serviceable bathroom with an extra-large whirlpool tub; he got kinks in his back and neck from being alert every moment of every hour he was on the job, and the tub did wonders for his muscles.</p><p>And the—the—</p> <p>“Nicole, what are you doing here?”</p><p>“Well.” She shrugged out of her jacket and tossed it over the back of the couch. “You’re off duty for the rest of the week. And I’m off the grounds. So I figured, what better time for us to have sex than now? You’re not a bodyguard. And I’m not a princess.”</p><p>Clearly, the stress of palace living had driven her insane, poor girl. “Of course you’re a princess, how could you ever not be a—”</p><p>“I’ll rephrase. I don’t feel it here.” She lightly touched her left breast and he clutched the glass so hard he thought it would break. “People can ‘Her Highness’ me until they pass out, but it doesn’t feel real. None of this feels real.”</p><p>“You have to give it time. More time than a week. Like it or not, you’re a princess born. You don’t have to feel it. You just are.”</p><p>“Nice speech.”</p> <p>“Thank you.”</p><p>“No, seriously. I’m all tingly and stuff.”</p><p>Then, incredibly, she was stripping her T-shirt over her head. “Okay, that wasn’t quite true,” she went on conversationally. “You feel real. I think about you all the time. And we’ll never have a better chance than this one.” She was shucking out of her jeans.</p><p>“Please stop undressing!” he croaked.</p><p>“I was kind of hoping you would start undressing.”</p><p>“Nicole—I—your father would shoot me with my own gun. And then several of his.”</p><p>“Aren’t we a little old to worry about what Daddy thinks?”</p><p>“But I—you—we—I—”</p> <p>“Oh.” She blushed to her eyebrows. “You don’t want to. Oh, boy.” She covered her eyes. “I don’t normally misread a situation this badly. I don’t suppose you’ve got a bottomless pit I can throw myself into.”</p><p>Silence.</p><p>“Jeffrey?”</p><p>Then she felt his hands on her wrists, pulling her fingers away from her face. He had moved with that silently, spooky speed.</p><p>And then, oh thank God, he was kissing her and yanking at the buttons on his shirt.</p><p>Chapter 36</p><p>S he tried to help him with his shirt, but he was in a hurry and it tore. She hadn’t realized a good quality men’s shirt could rip like a Kleenex. She fumbled at his belt and, oh boy, was there a sexier sound than a man’s belt coming undone?</p><p>He yanked at his pants and they staggered back and forth while he tried not to trip, and finally he kicked free of them. Then he was pushing her bra cups down and sucking greedily at her nipples.</p><p>She arched against him and groaned, “Feels like you’re doing that between my legs.”</p><p>“Wait,” he said, voice muffled against her flesh.</p><p>She did what she had wanted to do for days: plunged her fingers into his black, curly hair, stroking, touching. His hair was coarse and soft at the same time, crackling beneath her fingers like a cat’s fur.</p><p>He fumbled for the middle of her back, fumbled more, then muttered, “Fuck it,” and yanked. She grinned as he relieved her of her (now useless) bra.</p><p>“You know, those hook and eye things are a pain to get back into—”</p><p>“Nicole, hush.”</p><p>“House rules, huh?”</p><p>“Something like that.” He scooped her up in his arms and practically ran to what she hoped was a bedroom.</p><p>And...it was! He dropped her on the bed and pulled down his boxers. She wriggled out of her panties, trying not to stare at him. His chest was furred with dark hair, tapering down his stomach and into his pubic hair. His sex jutted out at her and she could see how the tip gleamed.</p><p>Now she was really trying not to stare. Although why she was surprised, she didn’t know. Why wouldn’t a guy with big hands and broad shoulders be big...in all ways?</p><p>She was so busy trying not to stare at him, she didn’t realize he was staring at her. “Oh my God,” he breathed. “You look—”</p><p>“Bloated?” she suggested. “My monthly visitor is due in four or five days.”</p><p>He considered for a moment. “Incredibly, that did not ruin the mood. And the word I had in mind was beautiful.”</p><p>“Come here.”</p><p>He obliged, which was very fine. She couldn’t get enough of his mouth, she felt like devouring him. Then he trailed kisses down her breasts, lingered on her nipples, then moved to her stomach. He put his hands on her knees and slowly spread her legs; then he was kissing her where she had longed to be kissed.</p><p>“Oh God!”</p><p>He was parting her lower lips with his tongue again and again, teasing and licking and kissing. She pumped her hips against his mouth in pure unconscious reaction, and then he was—oh he was—he was fucking her with his tongue.</p><p>“Please please get up here!”</p><p>He obliged and kissed her hard. He tasted like salt and fresh grass and her. She heard the bedside table drawer slide open and realized he was finding a condom by touch while kissing her so hard she was having trouble finding her breath.</p><p>She broke the kiss and said, “Let me.” She ripped the corner of the foil with her teeth, pulled out the condom, and grabbed his stiff dick. He shuddered like a horse and she eased her grip, then rolled the condom on.</p><p>He fell upon her like a starving animal, slid into her up to the hilt with no further formalities, and she wrapped her legs around his hips and pumped back at him stroke for stroke.</p><p>They surged together, kissing and scratching and writhing, and she was astonished to feel her orgasm closing in on her. It normally took quite a bit longer.</p><p>“Dry spell’s over,” she gasped, and in reply he pressed his face to her neck and thrust harder.</p><p>Then she was flying—or, at least, it always seemed like that to her. Flying and free and soaring and going wherever she wanted to go.</p><p>“Jeffrey,” she whispered, still feeling the internal quakes.</p><p>“Nicole.”</p><p>“Do it again.”</p><p>For reply he took a deep breath and she realized he was breathing in the scent of her hair, and the thought of such tenderness from a man who looked like a brute was all it took; she fell over the edge again, swooping and soaring.</p><p>Then he was stiffening in her arms, and then she slowly settled back to the planet.</p><p>Chapter 37</p><p>“N o. No! No damned way!”</p><p>“Aw. Don’t be like that, Big Al.”</p><p>“Out! I mean it! The detail has orders to shoot to kill.”</p><p>“It’s nice to feel wanted.”</p><p>He gave her the scowl that sent most people scurrying for cover, but that just made her grin widen. “Bad enough I have to put up with you during the course of my business day. But I refuse—refuse—to put up with you during my own time.”</p><p>“But you’re in your office.”</p><p>“News flash, Dragon: I can be in any of these rooms I want. It’s my fucking house. Plus, this is my time off.”</p><p>“Not so, Big Al. Kings don’t get time off. Neither do their biographers, and let me tall ya, that’s something they didn’t mention in grad school. What’re you doing, anyhow?”</p><p>“Looking up porn on the Internet.”</p><p>“Haw! Like you don’t have a battalion of underlings to fetch you all the porn you want. C’mon, you know I’ll drag it out of you after a while. Cough up, big guy. Watcha doing?”</p><p>“Reading Nicole’s scripts.”</p><p>“Really?” She came around the desk and peeked at his laptop. Today’s suit was navy blue; the shoes were red Keds. He got a whiff of—cookies?—when she bent over to look.</p><p>“Die Hard: Enough Is Enough,” she read aloud. “She wrote this?”</p><p>“Rewrote. It’s her—it was her other job. Punching up scripts for Hollywood.”</p><p>“How many d’you find so far?”</p><p>“Twenty-eight.”</p><p>“That’s nice work, if you can get it. Hollywood’s got the bucks t’spare.” Her hand was resting on his shoulder; he doubted she realized. Her soft, slim hand. The hand of a scholar. His hands were too big, too blocky, and riddled with calluses. “I still can’t believe she didn’t skedaddle for L.A. when the shitstorm began.”</p><p>“Because she’s a Baranov,” he said simply. “We don’t run.”</p><p>The Dragon was now drumming her fingers on his shoulder. “That’s of historical significance, doncha know.”</p><p>“Not running.”</p><p>“Well, yeah. But the other, too. We’ve had royal poets and royal songwriters, but never a royal script writer.”</p><p>“You’re a plague on me, not her.”</p><p>“Well now, that’s true enough, Big Al.” She was staring down at him. Her curls framed her face in a dark red cloud. “I guess I can wait until you kick it before being a plague on her.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah, well, the way this month is going, that’s gonna happen sooner rather than later.”</p><p>“Now that,” she said, taking off her glasses, “would be a pure d-shame.”</p><p>And then she leaned down and kissed him softly on the mouth.</p> <p>Chapter 38</p><p>T he Dragon, well used to being tossed out of the king’s office, took the whole thing with her usual equanimity. The important thing was, she had finally done what she’d fantasized about for the past three years.</p><p>Al was gonna be a tough nut to crack. Scuttlebutt had it he was still in love with the late, treacherous Queen Dara. But she was a historian, and took the long view. He’d come around eventually.</p><p>Besides, who’d be able to refuse a chance at her? She was smart, she was sexy, she had the ass of a twenty-five-year-old.</p><p>Hmm. Perhaps she was getting a little obsessed with her own ass. Something for her shrink to work on; they could forget about her traumatizing freshmen year of college for a while.</p> <p>“No, no, no,” Al had said, escorting her out of his office with a firm hand in the middle of her back. “We’re not doing this.”</p><p>She tried to drag her feet, but the sucker was as strong as he was big. “Why the hell not, Big Al?”</p><p>“Because it’d be like the Road Runner doing the Coyote. A crime against all the laws of nature. Also, you’re fired again.”</p><p>Then the detail drove her back to her hotel.</p><p>“You’re mine, Big Al,” she said aloud, chowing down on fairly awful barbecued ribs. Why she bought BBQ North of Missouri she didn’t know. The Daily Show was on—fake history! Hurrah!—and she was sitting cross-legged in her lonely bed.</p><p>Did the big oaf think she kept coming back to write his memoirs, for the luvva Pete? She’d been gone the day she met him. Big, gruff, great-looking, with the energy of a man half his age and the vocabulary of a sailor. She’d been gone at that moment; her love only deepened with each firing.</p> <p>Because the Dragon was tired of being alone.</p><p>And Big Al was, too. Poor sucker just didn’t know it.</p><p>“It’s only a matter of time.”</p><p>Then she ordered another platter from room service. Scheming always made her hungry.</p><p>Chapter 39</p><p>“N icole?”</p><p>“Mmmmm?”</p><p>“You have to go.”</p> <p>She stretched, then curled back against him like a sleepy kitten. “Too tired.”</p><p>He stroked her hair, running his fingers through the silky strands. He was still having trouble digesting the events of the past forty minutes.</p><p>Nicole—the Princess—had snuck out. Again. Had come to him. Tried to persuade him to the absurd notion that this week she wasn’t royalty and he wasn’t a bodyguard. And then she’d—and then he’d—</p><p>But she was still here. And that was a problem.</p><p>No, it wasn’t.</p><p>Yes, it was.</p><p>“Nicole.” He shook her gently. “You have to get dressed. I have to take you back. If they notice you’re gone, everyone will go right out of their minds.”</p><p>She yawned, rolled over, and stroked his penis, which went from sleepy to extremely interested in about two seconds. “So? Oh, hey, is this for me?”</p><p>He gritted his teeth and pulled away from her. “You’d frighten your family just to get laid again?”</p><p>She jerked away from him and sat up. “They don’t feel like my family,” she said sullenly. “My mother was my family. My father was just a two-week party for her.”</p><p>“Even so.” He rose, strapped on his wristwatch, then walked around the room gathering the clothes that hadn’t been ruined. “Get dressed.”</p><p>“That’s it? You fuck me—”</p><p>“I think you fucked me.”</p><p>“—and then kick me out? Jeffrey, your pillow talk sucks.” “Sucks” was punctuated as she hurled a pillow at his chest.</p><p>“You have to go back,” he said stonily, ignoring the inner voice that begged to differ. Ignoring the urge to take her back to bed and never, ever let her go. “Right now. We’re done talking about it.”</p><p>“Damn right we are,” she hissed, and climbed out of his bed.</p><p>He tried to help her with her clothes, but she slapped his hands away and nearly burned his eyes out of his skull with the force of her glare.</p><p>He drove her back, his heart growing heavier the closer they got to the palace. She was fuming in the passenger seat, arms folded over her chest, scowling at the road.</p><p>He got her as close as he could to her suite without actually driving across the lawn. As she got out, he leaned over and said, “Don’t do this again, Nicole.”</p><p>“Don’t...worry!” “Worry” was punctuated with the door slamming.</p><p>He rested his head on the steering wheel, and it was a good five minutes before he could turn the car around.</p><p>Chapter 40</p><p>N icole found her way into the palace via a little-used servants’ entrance. Oh, Nicky’s digital map had been a godsend. She was able to slip inside and make it back to her suite in fifteen minutes.</p><p>Where an astonished Natalia watched her approach her own closed door. “Your Highness! I didn’t—what are you—how did you—?”</p><p>“Some things,” she said, her body still tingling from Jeffrey’s urgent touch, “will never be told.”</p><p>“But how did you—”</p><p>“Good night, Natalia.”</p><p>The blonde bowed. “Highness.”</p><p>Nicole shut the door behind her, taking in the three-room suite at a glance. Private bathroom, sitting room decorated in shades of gold and red, deluxe bedroom decorated in gold and blue. Stuffed with furniture so old and expensive she was afraid to use any of it.</p><p>Except the bed. The bed might be an antique four poster, too, but it was sturdy enough. And a good thing, too, because she had every intention of throwing herself on it and crying for an hour or so.</p><p>Chapter 41</p><p>E xhausted from a sleepless night and too tired for breakfast, Nicole staggered into the hall outside her room.</p><p>Natalia bowed. “Good morning, Your Highness.”</p><p>“Oh, God. Cof—” Natalia was already handing her a cup. “Natalia, whoever programmed you did a helluva job.”</p><p>Natalia didn’t twitch. “Yes, Highness. The king would like to see you, Highness.”</p><p>“I gotta see the king? Now? Great. I have no friggin’ idea how to get there from here.”</p><p>“You don’t, Highness?”</p><p>Nicole stared at her bodyguard suspiciously. Natalia didn’t blink. In fact, Nicole’s eyes were watering with sympathy as the seconds ticked by and Natalia still didn’t blink. “You got something on your mind, Natalia?”</p><p>“Certainly not, Highness.”</p><p>“Well, super. You mind walking me over there?”</p><p>“Not at all, Highness.” The blonde tapped her earpiece. “Hunter to see Warrior.”</p><p>“How too fucking G.I. Joe,” she muttered.</p><p>“Thank you, Highness.”</p><p>A few minutes later, they were in the hallway outside the king’s office. She was pretty sure. All the damn hallways looked the same to her.</p><p>A man she’d never seen was leaning on the wall, arms crossed, but he stood straight and tall when she approached, then bowed.</p><p>“Hi.”</p><p>“Your Highness.”</p><p>“I’m supposed to talk to the king.”</p><p>“Yes, Princess Nicole, he’s expecting you.”</p><p>“Handing off Hunter,” Natalia said with cool formality.</p><p>“Acknowledged. Go get an early lunch, Natty.”</p><p>“Sir. Highness.”</p><p>“Handing off?” she asked the man. He sure didn’t look like a bodyguard: slim, shorter than she was, soberly dressed, small hands. He looked like he was Edmund’s assistant or something. “What am I, a relay baton?”</p><p>He smiled. “Hardly, Princess.” He touched his index finger to the corner of his left eyebrow. “Have a nice day.”</p><p>She rapped on the door with her knuckles and at the harried, “Come in, quick!” opened the door and walked in.</p><p>The king was on his feet, staring anxiously over her shoulder. “Are you alone? Is she out there?”</p><p>“Yes. Who?”</p><p>“The Dragon! I know she’s lurking around here somewhere, just waiting to—never mind.”</p><p>“Well, she isn’t lurking in the corridor. Are you okay? You look a little stressed.”</p><p>“Stressed,” he mumbled, “is not the word. You’re sure nobody’s out there?”</p><p>“Just some guy I never saw before. What can I do for you, Al?”</p><p>“Aw, come on, kiddo.” He slumped back into his chair. “Is ‘Dad’ so hard? Pop? Papa?”</p><p>She yawned and sat across from him. “Is that why you called me up here?”</p><p>“No, you look like shit.”</p><p>“Is that why—”</p><p>“Naw, naw.” He waved away her irritation. “Just an early morning observation.”</p><p>“Well, thanks so much. You’re not exactly looking your best, either.”</p><p>“I’m in the best shape of any one of you guys,” the king bragged.</p><p>“You’d have to be,” she admitted, “to run this funny farm.”</p><p>“If you’re having trouble sleeping, maybe you should see Doc Hedman. Alexandria was having terrible insomnia a couple years ago and he was able to help her out. This was before she got married to Sheldon.”</p><p>“That’s it!” she cried, and was surprised when the king flinched. She didn’t think he could flinch. “Sheldon Rivers. That’s the American who married Alexandria. She’s with him now, right? At some aquarium or whatever?”</p><p>“Yeah, and he didn’t marry her, she married him.”</p><p>“You say tomato, I say toe-maw-toe. Anyway, it was driving me nuts, trying to remember another relative’s name. You’re a big bunch to keep track of.”</p><p>“What can I say, I’m a fertile son of a bitch.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She covered her eyes. “Please, Al. I’m begging you. We’re headed for overshare country.”</p><p>He laughed. He had a great laugh, booming and kingly. She looked up at him and smiled in spite of herself. Then took a closer look and lost her smile. “You look more than a little stressed. Is everything all right?”</p><p>“No, but it’s nothing for you to worry about. I called you up here for two things—thanks for coming so quickly, by the way. Thing one, how are you doing? Do you need anything? To put it another way—”</p> <p>“Thanks, because English is my ninth language.”</p><p>“—shaddup—are you not getting something you need?”</p><p>“The food’s great, everybody’s nice, I don’t need anything.”</p><p>“Because speaking of Sheldon, you might want to talk to him. The last thing that guy ever wanted was to be a prince. But he sucked it up. And you think Christina wanted to be the Queen of Alaska? Ever? You could learn a lot from those two weirdos.”</p><p>“Thanks. I’ll keep it in mind.” She sipped her coffee.</p> <p>“We were, ah, surprised when you didn’t dine with us.”</p><p>“I needed some time alone.” In fact, she’d skipped the dinner with Christina, too, and felt horribly guilty. Well, she’d track her down today and apologize.</p><p>She leaned forward, rattled by the hurt look in his eyes. That’s all she seemed to do these days: hurt the men in her life. “You gotta try to understand, Al. It was me and mom, and then it was me. I fish and hunt for a living. I like the quiet. I love the solitude. And here, I don’t have either. I didn’t think it was possible to feel claustrophobic in here, but I do. I really do.”</p><p>“Sweetie, how can we do better?”</p><p>“That’s a nice offer, but it’s me, not you guys. I’m the one who has to adjust. I’m the one who has to change. I wouldn’t have sat for the DNA test if I wasn’t reconciled to that. And none of it’s your fault.”</p><p>“It could be argued that all of it’s my fault.” She opened her mouth, but he rushed forward. “Nicole, I friggin’ hate seeing you unhappy.”</p> <p>“Well, it’s not much fun on this end, either.” But she took the sting out of her words with a small grin. “You said you had two reasons.”</p><p>“Yeah, you’ve really got a gift. I’ve been reading some of the scripts you’ve—”</p><p>“No!” she practically screamed. Al reared back in his chair. “Oh, God, tell me, tell me you didn’t read any of the dreck I wrote for Hollywood.”</p><p>“But you saved a bunch of movies! Killing Cardinals had a totally different, sucky ending according to the trades. And you single-handedly rescued the dialogue for I’m Okay, You’re Insane.”</p><p>“It’s just to pay the bills, Al. It’s not art.”</p><p>“Well, I thought it was pretty nifty, swifty.”</p><p>“God, the humiliation never stops around here, does it?”</p><p>“Guess not. You know, if you ever thought about writing a book...”</p> <p>A book. A fishing guide. Her mother’s story. Her story. Sure, she’d thought about it. But who had the time?</p><p>“You’re not implying I’d have all this leisure time to write, are you?”</p><p>“I’m just saying. If it’s something you wanted to do, there’s not much in your way. It’s not like you have to spend your creativity fixing other people’s words. Not anymore.”</p><p>She raised her eyebrows. “That’s...an interesting perspective.”</p><p>“I got tons of perspective,” he bragged. “I got it running out of me like...stuff that runs out of me. By the way, three American movie studios have called here looking for you. They want to buy the rights to your story.”</p><p>“Oh, sure. When I was a lonely hack they wouldn’t return my calls. Now they want to toss money at me and make a movie out of my life. Pass.” She rose from her seat. “Still, you’ve given me something to think about.”</p><p>“I’m good at shit like that,” he said, lacing his fingers beside his head. “G’wan, get out of here.”</p><p>“Later, Al.”</p><p>“Wait!” He was leaning forward in his chair and looking anxious. “Look first and tell me; is the Dragon out there?”</p><p>Nicole opened the door and checked both ends of the corridor, waving to the short bodyguard. Then she went back inside. “Coast is clear.”</p><p>“Great. I’m dying for some scrambled eggs. Had a conference call so I didn’t eat with the kids today.”</p><p>“Well.” She took a deep breath. “I haven’t eaten yet. We could eat together. Unless it’s a working breakfast or—”</p><p>“No no no! It’s not a working breakfast. Yeah, that’d be great. Come on, I’ll show you one of the prettiest rooms in the palace.”</p><p>“Don’t you have to sign bills into law or something?”</p><p>“Fuck it.”</p><p>“You’re an inspiration to us all,” she said dryly. “I assume this means that when I’m queen, I can constantly blow off my work.”</p><p>“What do I care? I’ll be worm food by then. Come on, let’s get out of here before Edmund brings me more work.”</p><p>“That bastard,” she agreed, and followed him out the door.</p><p>Chapter 42</p><p>T he king watched Nicole pick at her eggs and ham, and drink cup after cup of black coffee. Something was wrong, and he didn’t think it was just the events of her birthright coming to light.</p><p>No, it was something else.</p><p>“If you don’t like the eggs, we can get you something else.”</p><p>She forced a smile. “I’m just not very hungry, I guess.”</p><p>“Still, you gotta eat.”</p><p>“You were right,” she replied, obviously anxious to change the subject. “This is the prettiest room in the palace.”</p><p>“This” was a solarium on the east side, second floor. The entire east wall was one big window. It was warm in there even in the middle of January. It was one of the few rooms that didn’t have a fireplace. Thanks to the greenhouse effect, it didn’t need one.</p><p>“Yup. Used to do my homework in here when I was a kid.”</p><p>“It’s hard to picture you as a little boy,” she teased. “I bet you were more of a handful than Nicky is.”</p><p>Al groaned. “That kid is the punishment for all my sins. Karma’s a bitch, y’know?”</p><p>“You should write greeting cards. That’s quite a poetic touch.”</p><p>“Hey, we can’t all be professional writers-for-hire.”</p><p>“Mmm. Speaking of writers, what’d the Dragon do to freak you out? And didn’t you fire her?”</p><p>“I’ve fired her eleven times,” he said gloomily, still running hot and cold every time he remembered her mouth on his, her hands pressing his shoulders, her skirt riding up as she sat in his lap. “She keeps coming back.”</p><p>“Yeah, but you could make her stay away if you really wanted to.”</p><p>“Yeah, I—I suppose.”</p><p>“She likes you, you know.”</p><p>He stared at her.</p><p>She shrugged and forked up some egg. “Just sayin’.”</p><p>“I’m her project, not her—her—”</p><p>“Sorry, Al, I’m calling bullshit. You think she keeps coming back for the privilege of writing down your old war stories?”</p><p>“It doesn’t matter. We’re not talking about this. Besides, I—in my heart, I’m still married.”</p><p>“Queen Dara.”</p><p>“Yes.”</p><p>“Do you—did you love her?”</p><p>“She was the first person I loved more than myself. And then she gave me amazing children. Even if I hated her, I’d honor her for that alone.”</p><p>“But, Al. It’s been so long. Fifteen years or so, right?”</p><p>“Give or take,” he admitted.</p><p>“Why do you want to be alone?”</p><p>“Why do you?”</p><p>He could see he’d shocked her with the observation. She stammered for a few seconds, then said, “It’s not the same thing.”</p><p>“It’s not?” he asked quietly.</p><p>“You can get married again. But in my whole life, I’ll only have one mother.” She bowed her head. “She knew me better than anyone. She could have gotten me through this. I’d give everything I had, and everything you have, just to talk to her one more time.”</p><p>“Nicole—honey—”</p><p>“Oh, God, I just miss her so much!” she cried, and sobbed into her hands.</p><p>Al was out of his seat in half a second, patting her on the shoulder. “Nicole, honey, it gets easier, I promise it does. Not just adjusting to us. The grief. It won’t always be a killing thing. I swear to you, you’ll miss her forever, but eventually you’ll only think of the good, never the bad.”</p><p>She leaned against his hip. “It’s just so hard, Dad. I didn’t think it would be so hard.”</p><p>So he comforted her, as he had comforted the tears of all his children. And though Nicole never remembered the first time she called him Dad, the king never forgot.</p><p>Chapter 43</p><p>“T here you are, Big Al!”</p><p>The king’s hands jerked. Papers flew. “Gaaahhh!” he screamed.</p><p>“Don’t scream, my king, we only just got your office door fixed,” Edmund begged. He turned. “Good morning, Ms. Bragon. No, no, everything’s fine,” he told the out-of-breath bodyguard. “Thank you very much.” He shut the door. “Something to drink, Ms. Bragon? Coffee? Juice?”</p><p>“I’ll just drink in the sight of the glorious king of Alaska, if y’all don’t mind.”</p><p>Al rested his head on his desk.</p><p>“I don’t mind,” Edmund admitted, “but frankly I can’t imagine anyone being that thirsty. I’ll leave you to your work, ma’am. Sir.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah, you do that, Edmund darlin’.” The door closed behind Edmund and the Dragon grinned down at him. “Ain’t you glad to see me?”</p><p>His head jerked up off his desk and he scowled. “Hell, no! You’re fired. And banned! And fired. Go away or I’ll yell rape.”</p><p>“You’d never.” She plopped down in her usual seat. “I can’t believe you’re passing up the incredible opportunity I’m throwing in your kingly lap. You out of your mind, boy?”</p> <p>“I haven’t been a boy since I was four. And complications like that, I do not need. Besides, I have to focus on Nicole. And David! Poor kid’s out of a job and he doesn’t know whether to shit or go blind. And Nicky. He’s been way too quiet lately; I don’t trust that budding psychopath. And—”</p><p>“Sounds like you’re takin’ care of ever’body, Al. ’Cept yourself, o’course.”</p><p>“Spare me your hideous brand of psychology.”</p><p>“Okey-dokey. How about I just plant another smacker on that kingly snoot?”</p><p>He actually cringed back. Her grin widened. Oh, this was gonna be fun. She’d held her feelings in for three years before realizing that was no way to catch the King of Alaska. Now he was going to pay for every soulful look she’d given him, every natural impulse she’d squashed, every time she’d betrayed her feelings.</p> <p>“Please don’t molest me again,” he begged. “I can’t take any more this week. I absolutely can’t.”</p><p>“Then tell me about Nicole’s mama.”</p><p>“That’s blackmail, you horrible horrible thing!”</p><p>“A-yup. It’s also called getting the job done.” Impersonal as a secretary, she took out her notebook. “So, talk. You’re s’posed to be getting married. You take off. You go to a bar and order a drink. Or maybe your detail does. Either way, you meet the bartender. And...”</p><p>“And none of your damn business!”</p><p>“Did you put your big, smelly, fishy hands all over her boobs and make her moan like a donkey?”</p> <p>“Stop it, stop it!” he screamed.</p><p>“Did you hit her with the old ‘hey, baby, mind if I knock you up with an illegitimate daughter’ line?”</p><p>He was actually banging his head on the desk. “Hate you. Hate you. Hate you.”</p><p>“Haw! You love me, Big Al. You just won’t admit it. Anyway, back to Nicole’s conception. When the condom broke, did you pretend you’d had a vasectomy? Or did you just—”</p><p>“Die! Die, die!”</p><p>She jotted it all down and managed to needle him for another ten minutes before he gave up and threw her out.</p><p>Chapter 44</p><p>“D amn, Christina, you can cook! Here all I thought you were good for was throwing sucker punches.”</p> <p>Christina, who had been starting to smile, changed tactics and frowned. Dara gurgled with joy as she watched the play of emotions on her mother’s face.</p><p>“Eat your applesauce,” she told her daughter. To Nicole, “F-U-C-K Y-O-U-R-S-E-L-F.”</p><p>“Mama, what’s fook yr lelf?”</p><p>“Never mind. Eat.”</p><p>“I told you,” David said, not bothering to hold back his laughter, “she’s already starting to read. Spelling out your colorful vocabulary will work for maybe another six months.”</p><p>“I can see all the parent–teacher conferences now,” Nicole teased. She forked in more linguine with clams—clams that had been in the ocean that very morning—and chased it with a glass of milk. “Your Highness, the littlest Highness called me a B-I-T-C-H today, and while I’m obliged to obey her, I feel she—”</p><p>“Oh, just stop,” Christina groaned, sitting back down. “You’re giving me a migraine.”</p><p>“Then my job here is done. Seriously, this is the best pasta I’ve ever had.” Christina and David waited for the follow-up insult.</p><p>“No, really. That’s all I was gonna say.”</p><p>“Oh. Thank you.”</p><p>“Thank you!” Dara sang, big blue eyes gleaming, applesauce drooling down her chin. She blotted it with her own napkin. “N’cole, are you going to live here forever?”</p><p>“I’m afraid so. I’m trapped, just like you.”</p><p>“We all are,” David assured her.</p><p>“Hooray!”</p><p>“Ow. Dara, you’ve got your mother’s lungs but, fortunately, your father’s intelligence.”</p><p>“Why did I invite her to dinner?” the princess asked the prince.</p><p>“Because essentially, you’re a good person.”</p><p>Christina sighed. “I was afraid that was why.”</p><p>Chapter 45</p><p>A t ten o’clock that night came the long-awaited knock on his door.</p><p>Jeffrey didn’t get up to answer it. “Go back to the palace, Nicole!”</p><p>More knocking.</p><p>“I’m not letting you in, Nicole!”</p><p>Insistent pounding. He ignored it and sipped his milk. No Scotch tonight, by God. Once this week was enough. She’d eventually take the hint and go away. Find another lover. And he didn’t care. Not even remotely.</p><p>The knocking stopped and he gritted his teeth so he wouldn’t leap out of his chair, kick his own door down, haul her into his apartment by the hair, and do her on the living room carpet.</p><p>It had been a mistake. And he never made the same mistake twice. No matter how delectable. No matter how softly she moaned his name in his ear. No matter how—</p><p>No matter.</p><p>He had decided she had taken the hint when the car battery crashed through the sliding glass doors leading to the back lawn.</p><p>“Hello,” Nicole said cheerfully, picking her way through the broken glass. “Did you know your neighbors have the most interesting garbage? I don’t think you’re supposed to put those in the garbage.”</p><p>“Freeze!” he roared, and she froze. Then he set down his milk glass, crunched across the glass, picked her up in his arms, and carried her to the glass-free zone. Then he set her down. Or tried to. The trouble was, she’d been kissing his ear while he carried her, and the throbbing between his legs told him he had about five seconds before he gave up the battle.</p><p>“Nicole, I never make the same—”</p><p>“I had to take care of myself with my fingers this morning,” she whispered into the ear she’d been kissing. “That’s how much I missed you.”</p><p>He ran with her into the bedroom.</p><p>Chapter 46</p><p>T hey didn’t make it as far as the bed. They made it as far as the hallway. Then he lowered her to the carpet and commenced yanking her clothes off.</p><p>Nicole did her best to help, and supposed she should be frightened by his urgency, but the truth was, it thrilled her, warmed her to her toes and—and other places. It kindled her own lust, made her feel closer to him, closer to him than she had been with anybody. She’d had one-night stands. In college she had dated the same guy for a year and a half. In her twenties, the occasional dalliance or relationship doomed to fail.</p><p>But all of it together couldn’t equal the passion the two of them were generating in a cramped, dark hallway on a first-floor apartment in Juneau, Alaska, twenty-two miles from her ancestral home.</p><p>He pulled. She tugged. He yanked. She pressed. He kissed her again and again, her eyes, her throat, her breasts. She begged. He shoved. Then he was inside her, sliding in with sweet, delicious friction, and she came almost at once, bucking and jerking against him; then he was shuddering over her, and then he collapsed on top of her.</p><p>“Ulf,” she managed, before his weight drove all the air out of her lungs. Quietly suffocating, she beat him on the shoulder until he rolled off her with a groan. “Oh, sweet Jesus! I can breathe again!”</p><p>“Shut up,” he growled.</p><p>“Isn’t that ‘shut up, Your Highness’?” she teased.</p><p>“Not in my apartment. Here, it’s Nicole.”</p><p>“Finally, he unclenches!”</p><p>“Also, if you take another lover, I’ll kill him, then you, then myself.”</p><p>“How sweet!”</p><p>He pressed his palms to his eyes. She could see the sweat gleaming on his body, could smell his good clean smell, and wanted him all over again.</p><p>“What is it?”</p><p>“I don’t know if I hate you or love you.”</p><p>“Aw.” She snuggled against him. “Can’t you do both?”</p><p>Chapter 47</p><p>“B ig Al! Where you been hiding all day?”</p><p>Holly had to stifle a laugh as she saw the Alaskan monarch flinch away from her. It felt like she’d been prowling around the palace half the night. The detail didn’t tell her shit; they viewed her as some sort of extra-annoying reporter.</p><p>“Get lost,” Al said rudely. “I got enough on my plate without you getting even more annoying. Which I didn’t think was possible, until this morning.”</p><p>“Rack ’em up,” she told him. “Bowling’s no fun for just one.”</p><p>So he did. And then he beat her ass so badly at bowling she fumed for ten minutes before challenging him to a rematch.</p><p>“Holly.”</p><p>“Not now, Big Al, I’m lining up a split that will humiliate the Alaskan monarchy until the end of time.” She was holding up her bright purple bowling ball and measuring the distance. She let fly and knew the second the ball left her hand that it was good. She jumped up and down as the last four pins went over with a clatter, giving her the game. “Boo-ya! That’s what a good ole Texas whuppin’ feels like, Big Al.”</p><p>“Don’t remind me,” he said sullenly, marking down the score.</p><p>“That’s one for you and one for me.”</p><p>“Thanks, I can count.”</p><p>“You wanna go for the tie breaker? U. S. of A. versus Alaska, winner take all?”</p><p>He brightened. “What are the stakes?”</p><p>“Wellllll...tell you what. I win, I get to take you to bed.”</p><p>He reddened, but his blue eyes narrowed and he studied her with a look she had seen a thousand times from men of all ages. “And what do I get if I win?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why, the very same thing!”</p><p>He threw his head back and laughed. She loved his laugh. Finally, he was able to choke it off and said, “It’ll never work, Holly.”</p><p>“Don’t know ’til you try, ain’t that so?”</p> <p>“But, Holly, I hate you with every molecule in my body.”</p><p>“That’s why there’s all them sparks between us.”</p><p>“Sparks? That’s one word for it. Germs is what I was thinking.”</p><p>“Big Al, you know you can’t hold me off forever. A man like you has needs.”</p><p>“That’s what I always say! But the kids always tell me to shush up.”</p> <p>“They don’t see you like I do, Big Al. And thank goodness.”</p><p>He rested a finger on her nose. He leaned in and whispered, “Did you know your accent gets thicker when you’re nervous?”</p><p>“Nuh-uh, does not. I’m from Texas; nothin’ has scared us since the Alamo.”</p><p>“Is that right?”</p><p>“Bet your royal ass.”</p><p>“Holly, the queen and I—our relationship was very complicated. And I owe the mother of my children some—”</p> <p>“The queen is dead,” Holly said. “Long live me. Now rack ’em up.”</p><p>Chapter 48</p><p>E dmund Dante smoothed his perfectly smooth suit jacket, patted his unmussed hair, flicked imaginary lint off his shoulder, then left his rooms and strolled toward the west kitchens.</p><p>He courteously greeted every staff member by name and received battalions of “Good morning, Mr. Dante,” and “Hi, Edmund,” and “Good morning, sir,” greetings as he went. He stopped one of the chambermaids, fresh from maternity leave, and asked after the baby. He stopped one of Prince Alexander’s footmen and asked how his ailing mother was doing.</p><p>He knew everyone. He knew everything. The smallest detail did not escape him. All was right with the world.</p><p>After observing the kitchen staff for a minute, it was obvious there had been no last-minute disasters and breakfast would be served on time, which today meant 8:00 A.M. That gave him an hour and a half to read everyone’s schedules, wake the king, and be debriefed by the detail.</p><p>Yes, it would be close.</p><p>He turned to leave, only to hear, “Edmund!”</p> <p>He turned back, and deftly caught the orange one of the cooks had tossed him. “Put it in your pocket for luck,” she said, smiling. “Knowing you, it’s all you’ll eat today.”</p><p>“Thank you, Carrie. And good morning.”</p><p>He found his way to the king’s chambers, picking up the schedules from his office on the way. Nothing out of the ordinary here, either, and that was very well. In fact, a refreshing change—no outside visitors, except for Miss Holly Call-Me-Dragon. Ah, poor King Alexander. She was his cross to bear.</p><p>“Good morning, Mr. Dante.”</p><p>“Good morning, Mr. Reynolds. All well, I trust.”</p><p>“A quiet night,” Reynolds replied. He looked exceptionally cheerful for a normally stone-faced detail man. “For the most part.”</p><p>“Oh? Glad to hear it.”</p><p>“Yes, sir. Quiet. For the most part.”</p><p>“Mr. Reynolds, are you quite all right?”</p><p>“Quite, Mr. Dante.” Reynolds fished out his two-way. “Bookman to see Warrior.”</p><p>“May I have your permission to enter, Mr. Reynolds?” Not that he needed it. There wasn’t a single room in the palace off limits to him; he had played here as a child and they all knew it. Still, the courtesies must be observed. That was no surprise, either.</p><p>“Yes, sir.”</p><p>Edmund sighed with satisfaction. No surprises. A place for everything and everything in its place. The sun rose in the east and set in the west. The schedules were constantly updated but always correct.</p><p>He rapped twice and opened the door.</p><p>And froze.</p><p>And did something he had never done in the service of his king: He shouted, “Oh my God, what are you two doing?”</p><p>Chapter 49</p><p>N atalia was new to the detail and wasn’t sure she liked it. Granted, it was the highest honor offered by the Alaskan military. And granted, she had worked hard to get here.</p><p>But her charge, Princess Nicole, was sneaking out at night. The king had, inexplicably, begun sleeping with the Dragon. Jeffrey, the detail’s rock, was on vacation.</p><p>And the woman in charge of Christina’s detail confided that she suspected the Crown Princess was pregnant. Like any of them wanted to go on that wild ride again. She hadn’t been there at the time, but she’d heard all the rumors.</p><p>The detail was famous for it; one man’s gossip was another woman’s way to better protect her charge.</p><p>Now here came Mr. Dante, looking—say it isn’t so—rattled.</p><p>“Natalia.”</p><p>“Sir.”</p><p>“The king—the king—”</p><p>“Has there been a schedule update, sir?” she asked, playing dumb.</p><p>“Damn right there has!” the man nearly screamed, then got hold of himself. “Forgive me. I—I haven’t had breakfast yet. My blood sugar is low.”</p><p>“You might try eating that orange in your pocket,” she said helpfully.</p><p>“Yes, I might. Is the princess in?”</p><p>And that was the sticky spot. Because she had no idea whether Nicole was in there or not. She hadn’t heard her leave. But she never did. And Nicole hadn’t come past her to get back in. It was shameful to be ready to open a door and have no idea whether her charge was in there or not.</p><p>“I...think so.”</p><p>The sweaty, stressed Edmund started to snap a response, then took a deep breath. “Natalia, please don’t worry. The princess can take care of herself, as she has demonstrated again and again. And she’s sneaking off to visit Jeff. So even when you don’t know where she is, she’s in good hands.”</p><p>Natalia felt her mouth pop open in surprise and almost broke Rule Number One with a whispered, “How...” Because nobody ever asked how Mr. Dante knew everything. He just did.</p><p>And he was kind enough to pretend he hadn’t noticed her blunder.</p><p>So she didn’t announce him or anything when he tapped on Princess Nicole’s door and at the clear, “It’s open!” entered.</p><p>She spoke into her two-way. “Bookman to see Hunter.”</p><p>“Acknowledged.”</p><p>Then she leaned against the wall, wondering what else was in store for the detail in the weeks to come. God knew, it had been a madhouse since the king got the famous letter.</p><p>She wondered what was in store for them all next, and found she couldn’t wait to see.</p><p>That was the trick, the others had told her. That was how they got you. They were a big, merry bunch of troublemakers, and they pulled everyone into their madness.</p><p>Natalia checked to make sure the corridor was empty, then smiled, something that would have shocked the already shell-shocked palace inhabitants.</p><p>Chapter 50</p><p>N icole was surprised to see a clearly rattled Mr. Dante walk into her room. At least she’d been in her room.</p><p>She’d gotten smart after her first visit to Jeff and went to the most diabolical source she knew.</p><p>Somehow, within twenty minutes, Nicky had procured a three-story rope ladder that would hold up to 320 pounds. So she no longer had to walk past Natalia when she returned; she just scurried back up the black ladder, which was downright invisible at night.</p><p>She was still wearing last night’s outfit. Hopefully, Mr. Dante wouldn’t notice.</p><p>Oh, who was she kidding? He noticed everything.</p><p>“Hi, Mr. Dante.”</p><p>“Your Highness.”</p><p>“You want something? Natalia rustles up a mean cup of coffee, no matter how many times I tell her to quit it.”</p><p>“No, Highness.”</p><p>She gestured for him to have a seat, but he ignored her. She couldn’t help but be curious; what was he doing here? And what was wrong? “What’s up?”</p><p>“I—ah—that is—the king—I have—I have been—”</p><p>“Whoa! You’d better sit down. You look like you’ve seen a ghost.”</p><p>“Infinitely worse,” he said darkly. “And I pray I never see such a sight again. Princess, I have been remiss.”</p><p>She was having a hard time following the conversation. Well, it was early. And Edmund was clearly in the middle of a cerebral hemorrhage. “You’ve what now?”</p><p>“I neglected to explain the nature of your security detail.”</p><p>“Okay.”</p><p>“Do you think you’re the only one who needed to leave the palace for an assignation?”</p><p>She stared at him. “Uh...”</p><p>“For one thing, do you think you would be here if royals couldn’t sneak away for a little fun now and again?”</p><p>“That, um, hadn’t occurred to—”</p><p>Wonder of wonders, he actually interrupted her. “Let your detail help you. If you wish to visit Jeffrey, Natalia will take you. And she would never tell the king. Just as the king would never—never mind.”</p><p>There was no point in playing dumb, so she didn’t bother. “But Jeffrey is my detail.”</p><p>“Yes, that poses a problem, doesn’t it?”</p><p>Suddenly she felt the urge to unburden herself. To tell him everything. She spoke to him like she would her mother. “He says while I’m in his apartment I’m just Nicole. But what about when he comes back from vacation? He won’t be with me while he’s on duty...and the detail considers themselves on duty twenty-four/seven.”</p><p>“You mustn’t begrudge them their devotion.”</p><p>“Who’s begrudging? It just makes my life more difficult, that’s all.”</p><p>“As opposed to what you’re doing to Natalia,” he said dryly.</p><p>“Hey! I didn’t ask for any of this, and you know it.”</p><p>“Tough nuts.”</p><p>“And—what?”</p><p>“You didn’t ask. You didn’t want. You weren’t ready. Nicole Krenski, are you a Princess of Alaska or are you a coward?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Call me that again,” she said, “and spend the rest of the spring learning how to grow back your lungs.”</p><p>“Then act like one, for pity’s sake,” he snapped. “One day, every man, woman, and child will depend upon you for their economy, the quality of their education, the health of the military budget. Lives will depend on the smallest decisions you make...or don’t make.”</p><p>“I’m not calming down, Mr. Dante.”</p> <p>He ignored her. “You fulfilled a dying wish. Then you agreed to a proper DNA test, knowing the consequences—I explained them to you myself. For better or for worse, you’re here now. So be a Baranov, or not. But stop straddling the line.”</p><p>He took a breath. She waited. Then, “You done?”</p><p>“I think so.”</p><p>“Shit or get off the pot, huh?”</p><p>“You share your father’s gift for the perfect turn of phrase. Also, fire Jeffrey.”</p> <p>“What?”</p><p>“Fire him. Then he will no longer feel conflicted between duty and desire. And you’re a woman in your mid-thirties; you’re entitled to take any lover you wish.”</p><p>“I could never do that to him! His family’s been doing this work for generations. It’s all he knows.”</p><p>“Then you have a problem. I suspect you will turn your mind toward solving it.”</p><p>“Gee, thanks. Any other pearls of wisdom you want me to trip on?”</p><p>“None that come to mind,” he admitted. “Please excuse me. I don’t know what has gotten into me today.”</p> <p>“Hey, that’s okay. Nobody’s perfect.”</p><p>“Least of all your father,” he said cryptically, then marched out.</p><p>Chapter 51</p><p>“M y God, woman, I think I threw my back out last night.”</p><p>“Big Al, you don’t fool me. Under all that bullshit is a big old teddy bear.”</p><p>He was in his office chair and the Dragon was sitting on his lap, her feet dangling inches off the floor. “I think we took ten years off Edmund’s life this morning.”</p><p>“Well now, you were the one who wanted to try it with me on top.”</p><p>“I told you, by then you’d already thrown my back out. What choice did I have?”</p> <p>“Excuses, excuses. I wonder where this scene fits into my memoirs.”</p><p>“Don’t you dare!”</p><p>“Chapter fifteen,” she mused, “‘I Bone The King.’”</p><p>“You’re fired.”</p><p>“You already fired me today.”</p><p>“Well, you’re fired again.”</p><p>She ran her fingers through his graying hair. “Is that a fact?”</p><p>There was a rap on his door and he heard Alexandria call, “Dad? Can I come in?”</p><p>He shoved the Dragon off his lap and she went willingly enough. Then he yelled, “You harpy, get the hell out of my office!”</p><p>“Don’t be like that, Big Al. All I want to know is how you met Princess Nicole’s mother. You gotta admit that’s historically significant.”</p><p>“No way! There’s historically significant and there’s none of your damned business! Guess which this is?”</p><p>Alexandria walked in. “You two aren’t fooling anyone. We all know you did the beast with two backs last night.”</p><p>The king and the Dragon gaped at the princess.</p><p>“Well, we do,” she said mildly, perching on the arm of one of the chairs. “Dad’s detail knew, then Edmund knew, then the whole detail knew, and Nicky’s been patching into their two-way since he learned how to hack, and he told all of us at breakfast, at which you were conspicuously absent, Dad, and I shudder to think why.”</p><p>“Remind me to strangle my youngest,” he said grimly.</p><p>“Hey, Dad. It’s only such a big deal because we’re happy for you. You’ve been alone too long.” Alexandria, a breathtaking brunette with the standard-issue Baranov blue eyes, smiled at Holly. “Granted, your choice was kind of a surprise, but still...”</p><p>“No goddamned privacy in my own house,” he grumped.</p><p>“Well, Dad. Did you think she kept coming back to write more deathless prose about signing the Conservation Act?”</p><p>“Why did everyone know why you kept coming back except me?”</p><p>“’Cuz you’re a dumbass, Big Al.”</p><p>“Do you want me to kick this broad out, Alex? Is this private business?”</p><p>“It is, but she’ll have to know eventually. Get ready to be a grandfather again.”</p><p>“Really?” He jumped up and swung his daughter around in a hug that left her breathless. Then, “Oh shit! Sorry. You’re not gonna puke, are you?”</p><p>“Eventually, I imagine so.”</p><p>“Congratulations, Alex,” Holly said, smiling broadly.</p><p>“Just when I thought I couldn’t take one more surprise, you lay this egg in my lap.”</p><p>“Almost literally,” Alex added, then giggled. “Another kid who’ll think nothing of their grandpa being on all the money.”</p><p>“How long have you—”</p><p>“Two days. I flew to the States to tell Sheldon, then hopped a transport back here. Shel will be here later today. Anyway, I’m due in November.”</p><p>“Why’d you tell that bum first?”</p><p>“Because he’s the father, Dad. I’m pretty sure. Kidding! Don’t throw anything at me. In fact, I’ll leave you two alone so you can have more old people sex.” She shivered all over. “You know what? Maybe I will throw up.” Then she left, closing the door firmly behind her.</p><p>“Congratulations, Grandpa,” Holly said.</p><p>“If you ever call me Grandpa again, I’ll fire you. Again.”</p><p>“I think I’ll chance it.” She plopped back into his lap. “So, what’s on today’s agenda?”</p><p>“Fire. Brimstone. Worlds colliding. I mean, I’m doing the Dragon. Isn’t that a sign of the Apocalypse?”</p><p>“Could be, Al,” she laughed, leaning down and planting a kiss on his mouth. “Could be.”</p><p>He started to kiss her back, then pulled away and looked her right in her big brown eyes. “I’m not getting married again, Holly. Never, ever again.”</p><p>“Who’s askin’?”</p><p>“So you’ll never be queen.”</p><p>“Who’d want the job?”</p><p>“And here I thought you were after me for my money. Or you were looking for a crown.”</p><p>“Al, I’m after you, there’s no doubt about that. Stop shivering! But your money and your crown don’t have nothin’ to do with it.” She kissed him again. “You’ve got, ah, other qualities.”</p><p>“What I’ve been saying,” he said smugly.</p><p>Chapter 52</p><p>N atalia was escorting Nicole to the nearest coffee shop—she was hungry to get out of the palace—when her two-way beeped. She spoke into it, then turned to Nicole.</p><p>“Rebel wants to meet with you. It sounds urgent.”</p><p>“Is he okay?”</p><p>“I don’t know, Highness, but if he had been hurt, I would know.”</p><p>“Okay. We’ll go out some other time. Where is he?”</p><p>“His rooms.”</p><p>“You’ll have to take me there; I have no idea where they are.”</p><p>“At once, Highness.”</p><p>“Thanks, Natalia. Bet you can’t wait until Jeff gets back.”</p><p>“I’m counting the seconds, Highness.”</p><p>“You’re a weird one, Natalia.”</p><p>“Thank you, Highness.”</p><p>And in twenty minutes, she was knocking on Nicky’s door.</p><p>“Nicky? It’s Nicole. Okay if I come in?”</p><p>At the muffled, “Yeah,” she turned the knob and entered.</p><p>The sixteen-year-old was clearly waiting for her; the television was off and he wasn’t playing video games. Just sitting on the couch and waiting, his hands dangling in his lap. He was growing so quickly his cuffs were an inch above his wrists.</p><p>“What’s up?”</p><p>“Dad’s having sex again.”</p><p>“You, um, didn’t have to tell me that. Ever.”</p><p>“I think—I think he’s ready to let my mother go.”</p><p>“Okay. Listen, Nicky, I know it’s awful and revolting to think about, but grown-ups have needs, even ancient doddering grown-ups like our father. It doesn’t mean he loved your mother any less.”</p><p>“I know. But I think he’s officially over her now. So I can finally talk to you.”</p><p>She sat down in the easy chair across from him. “Hon, I’m not up to a birds and bees chat. Last time was bad enough.”</p><p>He snorted. “I’m sixteen, not six. I know all about sex.”</p><p>“Really,” she said, amused.</p><p>“But I wanted to show you this.” He handed her a piece of paper, one that looked awfully familiar. She had seen one just like it not long ago, it was her—</p><p>“These are the results from my DNA test,” Nicky explained.</p><p>“You—oh. How did you—”</p><p>“You’ve heard the rumors. Everybody has. Dad just won’t hear them, and won’t let anyone talk to me about them, or him. He was the guardian of her memory, I guess. But she’s gone, and I’m too old to be taken care of anymore.”</p><p>“I hear you on that last one,” she said fervently, still trying to make sense of the numbers and words on the paper. “I’m thirty-five and I’m way way too old to be taken care of.”</p><p>“Great, Nicole, and this is about me, not you.”</p><p>“So sorry. Please continue.”</p><p>“Anyway, Dr. Hedman had to take Dad’s blood. And your blood. And then I cornered him and ordered him to take my blood and run the same test. See, always before, Dad wouldn’t allow the test. He sure wouldn’t cough up any of his blood for one.”</p><p>“So you bullied Dr. Hedman—”</p><p>“I didn’t bully,” he corrected her sharply, sitting up straighter and looking like the prince he was. “I commanded. And he did as I asked. That piece of paper says I am not a blood relation to the king. None.” He paused, obviously struggling to keep his composure. “My mother was a queen. And she was a liar and a betrayer.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nicole bit her lower lip. “I see.” She cleared her throat. “Well, two things. We can’t ever know what was going on with Queen Dara. Maybe she fell in love. Maybe she was lonely. Maybe she made a mistake and was sorry later. Don’t let that stupid piece of paper ruin your good memories of her. My—our father told me that the pain of a loved one’s death goes away, leaving good memories. And that’s what you have of your mom, Nicky. The good memories.”</p><p>Impassively, he said, “You said two things.”</p><p>“I’m sure you understand that in Dad’s heart you’ll be his son until the planets cave in on themselves.”</p> <p>He smiled thinly. “That’s the second time.”</p><p>“What?”</p><p>“The second time you’ve called him Dad since you came in here.”</p><p>“Was it? I hadn’t realized.” Hmm. That was weird. It had sort of slipped out without her noticing.</p><p>“But see, it’s okay.”</p> <p>“It is?”</p><p>“I’ve always felt like a changeling child, and now I know why. But it’s okay. I think it was time for me to stop wondering and find out for sure. And I could only do that because of you. I think...I think I was meant to find out the king wasn’t my father because part of me knew you were coming. With you here he still has the same number of children, you see.”</p><p>“No, Nicky, he doesn’t. He’s got one more, that’s all. Even if he knew, he’d never disown you, never cast you out. You’re his son and that’s all there is.”</p><p>“I just don’t know—” The boy clenched his fists and tried to lock back the tears. “I don’t know what to do. I don’t know if I should tell him or not. But since you went through this kind of thing not long ago, you’re the only one I can talk to. The bastard princess. But what does that make me?”</p><p>“His son, Nicky. That’s what it makes you. As for this?” She crumpled it in her fist and tossed it into the fireplace; then she got up, lit a match from the gold box on the mantel, and incinerated the DNA test into ash. “It’s your business, Nicky, and no one else’s. And I swear to you by my mother, I’ll never tell. The bastard princess is a coward, but not a liar.”</p><p>Nicky wiped his cheeks and said, surprised, “You’re not a coward. I think you’re very brave.”</p> <p>“Well, I’m not. But I’m going to try to be. Damned if I’ll be shamed by a child.”</p><p>“I’m not a—”</p><p>“I know, I know, sorry. Anyway, come on, Prince Nicky. I was headed into town for coffee when you beeped Natalia, but now I feel the need for Dairy Queen. Let’s go drown our sorrows in thousands of calories.”</p><p>Shyly, he took her hand, and brother and sister left the suite of the youngest Baranov, the bastard prince.</p><p>Chapter 53</p><p>J effrey Rodinov rose in the middle of the morning with his mind made up. He shaved, showered, dressed, and called the super to report the damage Nicole had done to the sliding glass door.</p><p>Then he drove to the palace, found Edmund, and tendered his resignation.</p><p>“Absolutely not,” was the reply, to his shock.</p> <p>“Mr. Dante, there are circumstances—you don’t understand—my duty is conflicting with—”</p><p>“The desire to impregnate Princess Nicole; yes; I gathered as much. Your resignation is not accepted.”</p><p>“But sir! I—”</p><p>“I can’t take it, Jeffrey; I absolutely can’t take it!” Edmund (horrors!) yelled. Jeffrey thought, The king died and nobody told me. That’s the only reason Edmund Dante would ever raise his voice or forget to comb his hair.</p><p>“Sir, maybe you’d better—”</p><p>“Go on a killing spree,” he snapped. “I am surrounded by people having irresponsible sex!”</p><p>Shocked, Jeffrey had no reply.</p><p>Edmund visibly calmed himself. “Your resignation is not accepted. For heaven’s sake, Jeffrey, look around you. This is Alaska. The royals marry subjects all the time. The greatest queen our country has ever seen used to be a maid. Also, there is no rule that says a princess may not bone her bodyguard.”</p><p>Jeffrey was shocked into silence by Edmund’s use of the word bone as a verb.</p><p>“Now, the king will give you nine kinds of holy hell about it, but that’s your problem, not mine. Do you see the bags under my eyes, man? I cannot take another upheaval to the schedule. You will not quit.”</p><p>“But Nicole—I mean, Her Highness—”</p><p>“—is at the Dairy Queen with the youngest prince. If you hurry, you can catch them.”</p><p>Jeffrey turned, already groping in his pockets for his car keys. “With all respect, this isn’t over, Mr. Dante.”</p><p>“With zero respect, it certainly is, Jeffrey. Best of luck.”</p><p>“Sir, are you all right?”</p><p>“I am a thousand yards from all right. Run along now.”</p><p>Jeffrey ran along.</p><p>Jeffrey saw two detail automobiles parked in the driveway, and judging by all the citizens pressed to the windows, deduced Nicole was eating her ice cream inside one of the sedans.</p><p>He rapped on one dark window, which slowly slid down.</p><p>“Hi, Jeffrey!” Prince Nicholas called. Nicole was sitting beside her brother, closest to the window. “Want a cone? Is your vacation over already?”</p><p>“Yes,” he said grimly.</p><p>“What are you doing here?” Nicole asked, clearly surprised.</p><p>“I’ll get to that in a moment.”</p><p>“Guess what?” Nicholas continued. “Dad’s having sex and Alex is pregnant. And Christina’s been such a bitch lately we think she is, too. Isn’t that the most terrifying news you’ve ever heard?”</p><p>“Not this week, Highness. I—wait. The king is what?” He mentally shook himself. “Never mind. Please excuse me.” He pressed a button on his two-way and the locks disengaged. Then he opened the door and yanked Nicole out.</p><p>“Hey! My Peanut Buster Parfait!”</p><p>He took her hand in his and led her to the other sedan, rapped on the driver’s side window, and said to Natalia, “Out.”</p><p>“Yes, sir.” She got out.</p><p>“Don’t talk to Natalia like that! Natalia, I’m sorry. He’s an asshole.”</p><p>“Yes, Your Highness.”</p><p>“You. In.”</p><p>Nicole took a steadying breath, shrugged, and climbed into the backseat. He turned to Natalia and said, “I’ll need a few minutes of privacy.”</p><p>“For what?” was her almost-but-not-quite-sarcastic request as he got in and shut and locked the doors.</p><p>“There’s easier ways to get a bite of my parfait,” she informed him. Then she was juggling the plastic tub of ice cream as he crushed her to him and kissed her until he thought he might bruise her. Then he eased up.</p><p>“Not that I mind, but this isn’t exactly discreet, and I thought you were all about being—”</p><p>“Be my wife.”</p><p>“Huh?”</p><p>“Marry me. Make me a prince.”</p><p>“You mean you’re in love with me for my title?” she teased, but he could tell she was rattled.</p><p>“All this time I’ve been coming at it from the wrong end.”</p><p>She reddened. “If you’re talking about what we tried later last night, I told you, that happens to every guy now and—”</p><p>“I’ve been trying to reconcile my duty with one-night stands with the Crown Princess of Alaska. But I don’t want a number of one-night stands, Nicole. I want you, for the rest of your life. And mine. Marry me and make me a prince, and as long as I’m by your side, you’ll never want for family again.”</p><p>“Actually,” she said quietly, “I’m kind of getting used to them. My family.”</p><p>“Oh.” He felt his heart actually shrink in his chest. Of course, the famous Baranov bounce: They came back from every shock, every disaster, stronger than ever. He should have known. She didn’t need him. She had never needed him.</p><p>And he was a fool.</p><p>“I see,” he said stiffly, leaning away from her. “Then you have no need of me, or my proposal, so I—”</p><p>“Hold on, Jeffrey, I didn’t say no, did I?”</p><p>“Nicole,” he said stonily, “don’t play with me like this.”</p><p>“Who’s playing? You’re the one who keeps jumping to conclusions. Yes, I’ll marry you. Yes, I’ll make you a prince, and later, much much later by the grace of God, the King of Alaska.”</p><p>She took another bite of her ice cream, chewed, and swallowed while his heart slowly resumed something resembling a normal rhythm. “You will? I mean, you do?”</p><p>“At first I thought it was because you didn’t sulk after I got the drop on you that first day. Then I thought it was because you kept coming back to my old fishing guide job. Then I thought it was because you’re really really good in bed. But now I think—”</p><p>“What?”</p><p>“I think,” she said, pausing to lick the spoon, “it’s because it’s something my mother would have wanted for me. And I think it’s because you’re the best angler I’ve ever seen. I’m pretty sure I fell in love with you when I watched you tie on that sinker the day we went fishing.”</p><p>He slumped back in the seat with relief. “Thank God.”</p><p>Then he gathered her in his arms, ignoring her squealed, “I’m spilling my parfait!” and kissed her until they were both panting and covered with ice cream.</p><p>“By the way,” he said, pulling back to catch his breath. “Who is the king having sex with?”</p><p>“Don’t even ask, Jeffrey. You wouldn’t believe it if I told you.”</p><p>Chapter 54</p><p>“Y ou’re what?” the king screamed.</p><p>“Getting married. Oh, and having gobs of sex,” Nicole added helpfully, ignoring Jeffrey’s horrified groan.</p><p>“But you’ve only known each other a fucking week!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Funny you should use the word fucking. From what I hear—”</p><p>“Never mind about me, young lady.”</p><p>“Young lady? Dad, I’m almost ready for bifocals.”</p> <p>“How can you possibly know—no offense, Jeff—how can you know this guy is the love of your life in a measly seven days?”</p><p>“Oh, I don’t,” she assured her father. “I’m marrying him for his great big dick.”</p><p>The king and Jeffrey groaned in unison.</p><p>There was a knock on the door, and the king screamed, “Go away!”</p><p>“Uh, Dad? You okay in there?”</p> <p>“Aw, fuck. Come in, David.”</p><p>The prince entered cautiously. “Hi. What’s—”</p><p>“Your sister has been boning her bodyguard like some awful American movie script she rewrote, and now she’s got the idea in her teeny brain that she wants to marry him!”</p><p>David didn’t miss a beat. “Really? Congratulations, Nicole. Welcome to the family, Jeffrey.”</p><p>“No, no, no!”</p><p>“Dad, you’re hardly in a position to—”</p> <p>“Don’t tell me what I’m in a position to or not to do. I’m the goddamned King of goddamned Alaska.”</p><p>“Maybe you should get that on a T-shirt like Christina has,” Nicole suggested, “because you seem to think nobody remembers.”</p><p>“You guys, you’re killing me.” The king buried his face in his hands. “You’re all out to get me. Don’t think I don’t know. I know things.”</p><p>“Actually, David, I’m glad you’re here. I really need to talk to you about something.”</p><p>“You do, Nicole? Is there something you need help with? Because I—”</p><p>Another knock. “Big Al? You in there?”</p><p>“Go away!” he shouted. “Go away and die!”</p><p>The door opened and the Dragon sauntered in. “Aw, music to my ears, darlin’.”</p> <p>“Don’t call me darlin’, you horrible horrible thing. I’m having the worst week. No offense, Nicole. Jeffrey.”</p><p>“None taken, Majesty.”</p><p>“Don’t you mean ‘Dad’?” Nicole teased, laughing out loud as the king and Jeffrey flinched in unison.</p><p>“Looks like I missed all the excitement.” The Dragon smelled news; she came into the room with her eyes wide and her ears perked up. “Congratulations.”</p><p>“Don’t congratulate them! I haven’t given my permission yet.”</p><p>“I don’t need the permission of the sovereign and you know it,” Nicole said coolly. “Neither of us do. This isn’t England.”</p><p>“Can’t you pretend you’re a little in awe of me?” the king begged.</p><p>“Aw, we all are, Big Al.”</p><p>“You hush up. All you people are trying to drive me to a—”</p><p>“Also, I’m seriously thinking about abdicating to David.”</p><p>The king pounded on his chest with a fist. “Ack! Here it comes! The fatal coronary!”</p><p>David turned to stare at her, ignoring his father’s cries of distress. “You’re what?”</p><p>“David, think about it. I’m not ready for this job. Dad’s ancient, he could keel over any second. And there I’d be, jammed into a job I’ve had minimal training for. That’s not good for the country.”</p><p>“I’m keeling over right now!” the king gurgled.</p><p>“Although I think Jeffrey would make a fine king,” Nicole added thoughtfully, nodding approvingly at the Dragon as she solicitously pounded the king on the back.</p><p>“No, I wouldn’t,” he replied. “I’m too used to seeing the job from the other side of the desk.”</p><p>“That’s why you’d—”</p><p>“Nicole, I thought we agreed we were going to spring these things on your father one at a time.”</p><p>“You planned this? To assassinate me by speech?”</p><p>“I know, Jeffrey, but then David walked in and it was kind of the perfect moment to—”</p><p>“Am I still in the goddamned room?”</p><p>“Nicole.” David was frowning at them. “I don’t understand. You’re the eldest. The crown is yours by right.”</p><p>“Will you stop being so damn noble? I don’t want it. Worse, I’m not ready for it. Even worse? I’m not worthy of it. You’ve got twenty IQ points on me, and more than thirty years of experience. There’s no contest. At all.”</p><p>“But you’re the eldest,” David repeated.</p><p>“I don’t give a shit!”</p><p>“Hello, King of Alaska in the room. Maybe we should, I don’t know, PRETEND I’M IN CHARGE AND DISCUSS IT WITH ME?”</p><p>It took twenty seconds for everyone’s ears to stop ringing. And when they did, it was the Dragon who spoke. “I know how to settle this.”</p><p>“Don’t listen to her,” Al warned. “She’s dangerously insane.”</p><p>“I think you should take care of this the American way.”</p><p>“What? Have a revolution? Loosen the gun laws? What?”</p><p>“Have a poll. Ask the Alaskan people who they want running their lives when Al kicks it.”</p><p>“But this isn’t a democracy,” David said.</p><p>“Yeah, an’ you know how many monarchies aren’t around anymore because people decided family lineage was no way to decide who ran the country? I could give you a list. Hell, David, you could probably give me one. So why don’t you put it out there for the people? I’m not saying you should let ’em decide. But the figures might help y’all decide what’s really best for the country.”</p><p>They argued. They swore at each other. The king disinherited Nicole, then fired Jeffrey, then disinherited David. The Dragon laughed her ass off. The king begrudgingly took it all back.</p><p>Then Nicole asked the Dragon, “How does one conduct a poll, anyway?”</p><p>Part Three</p><p>PRINCESS NICOLE KRENSKI</p><p>Chapter 55</p><p>BASTARD PRINCESS GIVES FIRST PRESS CONFERENCE</p><p>ANNOUNCES LEGAL TITLE TO THE WORLD</p><p>ABDICATES THRONE TO CROWN PRINCE DAVID</p><p>“S o that’s what it is?” Nicholas asked. “Your title is HRH Princess Nicole Krenski? Like Krenski was your middle name?”</p><p>“It’s the best way I can reconcile my Baranov side with my mother’s memory. I know the general consensus around here is that she was selfish to keep me to herself her entire life, but the bottom line is, I owe everything to her.”</p><p>“Nobody at this table,” the king said mildly, pretending it was a comment and not a command (no one was fooled), “has one bad thing to say about your dear mother.”</p><p>“Agreed,” David said. He raised his water glass. “To Ms. Krenski, mother of the bastard princess.”</p><p>The other siblings and in-laws raised their glasses and thundered “To Ms. Krenski!” so loud the chandelier tinkled.</p><p>“And you’ll never ever be queen?” Nicky persisted.</p><p>“God willing,” Nicole said fervently. “David’s cut out for it. I’m not. Everybody at the table was nice to pretend otherwise.”</p><p>There was an awkward silence, broken by, “Jeffrey, will you stop standing in the corner and go eat lunch with your fiancée?” the king demanded. “You’re not on her detail anymore.”</p><p>“With all respect, Your Majesty, I am until the wedding day.”</p><p>The king brightened. “Then that means—I knew your father, and your grandfather, so that means—”</p><p>“No sex until I’m a married woman,” Nicole said glumly. “Fucking sense of duty.”</p><p>“Language, kiddo.”</p><p>“Hey, am I the eldest or am I the eldest?” she demanded, smiling up at the footman who refilled her milk glass.</p><p>“Trust me,” David said, “you don’t get any special treatment. And you’ve got to put up with gobs of annoying younger sibs.”</p><p>Kathryn sneered and threw a buttered roll at her brother, who, from years of practice, ducked handily.</p><p>“Y’all’s dinner manners remind me o’ this family of monkeys I saw in a zoo once. The head monkey, who was by far the smelliest—”</p><p>“That’s it, Dragon. You’re fired!”</p><p>“Let me finish my soup, at least. Christina made it herself. Tastes like spring, darlin’,” she added to Christina.</p><p>“Thanks. Listen, Nicole, I feel terrible that we got off on the wrong foot. I know what it’s like to lose a mother. I just—” To everyone’s shock, she burst into tears. “I handled it all wrong and I’m so sorry!”</p><p>“Jeez, stop it, okay, okay, I forgive you.” Nicole had rarely been so alarmed. On the whole, she preferred her sister-in-law to come out of the corner swinging, not sobbing. “It’s not a big deal. We’re family, right?”</p><p>“Yes, yes, we are! And, Holly, I love you. I really really love you. Al’s been alone too long.”</p><p>“We’re not discussing my sex life at the dinner table,” the king commanded.</p><p>“Sorry, Al, I—” Christina grabbed her napkin...and threw up in it.</p><p>“Oh, guh-ross!” Kathryn and Nicholas screamed in unison.</p><p>“Hey, I almost barfed myself. I sure don’t want to discuss Dad’s sex life,” Nicole said.</p><p>“My wife is indisposed,” David sighed. “Honey, I think it’s way past time you went to the doctor.”</p><p>“You mean I have to share my first pregnancy with Pregzilla?” Alexandria demanded as her husband, Shel, laughed like a hyena. “Chris, how late are you?”</p><p>“Five weeks,” she mumbled, accepting with thanks several clean napkins.</p><p>“See? Not fair! I’m two weeks behind you! You’re gonna be first...again!”</p><p>“What the hell are you bitching about?” Alexander-the-younger snapped. “The rest of us are putting up with two pregnant sociopaths.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>Nicole caught Jeffrey’s eye and winked. Without changing expression, he winked back.</p><p>They were noisy. They were obnoxious. She had zero privacy. She had less solitude. There was a new emergency every day.</p><p>She sighed happily and buttered another roll.</p> <p>The bastard princess was home at last. </p>  </body></html>"]