["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Every day for hundreds of years the goddess had visited hell and every day Geryon had watched her from his station, desire heating his blood more than the flames of damnation beyond his post ever had. He should not have studied her that first time and should have kept his gaze downcast all the times since. He was a slave to the demons, spawned by evil; she was a goddess, created in light.</p><p>He could not have her, he thought, hands fisting. No matter how much he might wish otherwise. This...obsession was pointless and brought him nothing but despair. He did not need more despair.</p><p>And yet, still he watched her this day as she floated through the barren cavern, coral-tipped fingers tracing the jagged stones that separated underground from underworld. Golden ringlets flowed down her elegant back and framed a face so perfect, so lovely, Aphrodite herself could not compare. Eyes of starlight narrowed, a rosy color blooming in those cheeks of smooth alabaster.</p><p>\"The wall is cracked,\" she said, her voice like a song amid the hiss of nearby flame.</p> <p>He shook his head, positive he had merely imagined the words. In all their centuries together, they had never spoken, never deviated from their routine. As the Guardian of Hell, he ensured the gate remained closed until a spirit needed to be cast inside. That way, no one and nothing escaped - and if they tried, he rendered punishment. As the goddess of Oppression, she fortified the physical barrier with only a touch. Silence was never breeched.</p><p>Uncertainty darkened her features. \"Have you nothing to say?\"</p><p>She stood in front of him a moment later, though he never saw her move. The scent of honeysuckle suddenly overshadowed the stink of sulfur and melting flesh, and he inhaled deeply, closing his eyes in ecstasy. Oh, that she would remain just as she was...</p><p>\"Guardian,\" she prompted.</p><p>\"Goddess.\" He forced his lids to open gradually, slowly revealing the glow of her beauty. Up close, she was not as perfect as he had thought. She was better. A smattering of freckles dotted her sweetly sloped nose, and dimples appeared with the curve of her half-smile. Exquisite.</p> <p>What did she think of him? he wondered.</p><p>She probably thought him a monster, hideous and misshapen. But if she did, she did not show it. Only curiosity rested in those starlight eyes. For the wall, he suspected, not for him. Even when he'd been human, women had wanted nothing to do with him. Sometimes he'd wondered if he'd been tainted at birth.</p><p>\"Those cracks were not there yesterday,\" she said. \"What has caused such damage?\"</p><p>\"A horde of Demon Lords rise from the pit daily and fight to break out. They have grown tired of their confinement here and seek living humans to torment.\"</p><p>\"Have you their names?\"</p><p>He nodded. \"Violence, Death, Lies, Doubt, Misery. Shall I go on?\"</p> <p>\"No,\" she said softly. \"I understand. The worst of the worst.\"</p><p>\"Yes. They bang and they claw from the other side, desperate to reach the mortal realm.\"</p><p>\"Well, stop them.\" A command, laced with husky entreaty.</p><p>In that moment, he would have given up the last vestiges of his humanity to do as she wished. Anything to repay the daily gift of her presence. Anything to keep her just where she was, prolonging the sweetness of her scent. \"I am forbidden to leave my post, just as I am forbidden to open the gates for any reason but allowing one of the damned inside. I'm afraid I cannot grant your request.\"</p><p>A sigh slipped from her. \"Do you always do as you're told?\"</p><p>\"Always.\" Once he had fought the invisible ties that bound him. Once, but no longer. To fight was to invite pain and suffering - not for him, but for others. Innocent humans who resembled his mother, his father and his brothers were brought here and tortured in front of him. The screams...oh, the screams. Had the pain and suffering been heaped upon him, he would not have cared. Would have laughed and fought all the harder. But Lucifer, brother to Hades and prince of the demons, knew exactly how to strike to ensure the desired results.</p><p>\"I expected differently. You are a warrior, so strong and assured.\"</p><p>Yes, he was a warrior. He was also a slave. \"I am sorry.\"</p> <p>\"I will pay you to help me,\" the goddess insisted. \"Name your price. Whatever you desire shall be yours.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Whatever you desire shall be yours, she had said. If only, Geryon thought. He would ask for a single taste of her lips. But he would not risk the suffering of the innocent - why do you bother with them? - simply to sate his craving for the lovely goddess.</p><p>The question that had drifted through his mind had him gritting his teeth. He bothered because without good, there would only be evil. And he had seen too much evil.</p><p>\"I am sorry, goddess. As I said, I cannot help you.\"</p><p>Her delicate shoulders sagged in disappointment. \"But...why? You want to keep the demons inside of hell just as much as I do.\"</p> <p>Geryon didn't want to tell her his reasons for refusing her, was still ashamed after all these centuries. Tell her, however, he would. Perhaps then she would return to the old ways and pretend he did not exist. As it was, his craving for her was growing, intensifying, his body hardening. Readying. She's not for you.</p><p>\"I sold my soul,\" he said. He had been one of the first humans to walk the earth. He'd been content with his lot and enraptured by his mate, even though she'd been chosen by his family and had not desired him in return. She had grown sick, and he had despaired. He had cried out to the gods for assistance, but they had ignored him. Then Lucifer had appeared before him.</p><p>To save her and finally win her heart, Geryon had willingly given himself to the dark prince - and found himself transformed from man to beast. Horns had sprouted atop his head, and his hands had become claws. Dark, carmine fur covered the skin on his legs, while hooves replaced his feet. In seconds, he'd transformed, more animal than human.</p><p>His wife had healed, as his contract with Lucifer stated, but she had not softened toward him. No, she had left him for another man. His hands fisted, claws digging deep into his palms, as he refocused on the goddess. \"Though I wish otherwise, my actions are no longer mine to command.\"</p><p>The goddess studied him, her head tilting to the side. He shifted uncomfortably, such scrutiny unnerving given his sickening appearance. To his surprise, revulsion did not darken her lovely gaze as she said, \"I will see what I can do.\"</p> <p>Inner Corridors of Hell</p><p>\"Lucifer, hear me well. I demand to speak with you. You will appear before me. This day, in this room. Alone. I will remain exactly as I am.\" Kadence, goddess of Oppression, knew to state her wants precisely or the demon prince would \"interpret\" them however he wished. Were she simply to demand an audience, he might whisk her to his bed, her arms and legs tied, her clothing gone, a legion surrounding her.</p><p>Several minutes ticked by and there was no response to her summons. But then, she'd known there wouldn't be. He enjoyed making her wait. Made him feel powerful. She used the time to eye her surroundings. Rather than stone and mortar, the walls of Lucifer's palace were comprised of flames. Crackling, orange-gold. Deadly.</p><p>She hated everything about this place. Plumes of black smoke wafted from the blazes, curling around her like fingers of the damned. So badly she wanted to wave her hand in front of her nose, but she did not. She wouldn't show weakness - even with so small an action.</p><p>Did she dare, she knew she would find herself drowning in the noxious fumes. Lucifer loved nothing more than exploiting vulnerabilities.</p><p>Kadence had learned that lesson well. The first time she had visited, she'd come to inform both Hades and Lucifer that she had been appointed their warden. As one who embodied the essence of subjugation and conquest, there was no one better to ensure that demons and dead alike remained here. Or so the gods had thought, which was why they'd chosen her for this task.</p> <p>She had not agreed, but refusing them would have invited punishment. Many times since accepting, however, she'd thought perhaps punishment would have been better. She spent her days sleeping in a nearby cave - not a true sleep but a watchful one, her mind's eye drifting over the different demon camps. She spent her nights surveying the wall. Every so often, she had to come to the palace and report an infraction.</p><p>How could I not have known what was happening this time?</p><p>Had Lucifer blocked her visions? If so, what did he hope to gain?</p><p>She'd never felt more helpless.</p><p>No, that wasn't true. During her first visit, Lucifer had sensed her trepidation - and he'd since ceased every opportunity to nurture it. A fire-coated touch here, a wicked taunt there. She had wilted under his attentions.</p><p>That had disappointed the gods. They would have called her home, she was sure, had they not already bound her to the wall, an act that had been meant to help with her duties, not hinder them. But not even the gods had known just how deeply the bond would go. Rather than simply sensing when the wall needed fortification, she'd realized it was her reason for living. Her blood now sang with its essence.</p><p>The first time one of the demons had scratched it, she'd felt the sting and had gasped, shocked. Now, it no longer shocked her, though she still felt every contact. When a soul brushed it, her skin felt tickled. When the inferno licked at it, she felt burned.</p><p>You can do this. The outcome of this meeting was more important than any that had come before it. You can.</p> <p>Would the guardian care how much she risked for him?</p><p>From outside the palace she could hear the crazed laughter of the demons, the moans of the tortured and the sizzle of flesh pouring from bone. And the smell...it was a hell all its own. It was difficult, remaining stoic amidst such vileness. Especially now. The past few weeks, her body had been draining of strength, little by little, pains shooting through her. Now, at least, she knew why. Bound as she was to this dark underworld, that crack in the outer wall was literally killing her.</p><p>The pound of footsteps suddenly echoed and the flames several feet in front of her parted. Finally. In strolled Lucifer, as carefree as a summer day.</p><p>\"I've been waiting for your return,\" he said in the silkiest of voices. He even grinned, the expression pure wickedness. \"What can I do for you, my darling?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kadence didn't allow herself to shudder. Lucifer was tall, muscled like a warrior and sensually handsome despite the dark inferno raging in his eyes. But he did not compare to the beast who guarded his domain. The beast whose face was too rough to be considered anything other than savage. The beast whose half-man, half-monster body should have disgusted her but didn't. Instead, his haunted brown eyes captivated her; his protective nature intrigued her.</p><p>She might never have become interested in the guardian, might have assumed he was like every other hated creature here, but then he saved her life. Sadly, even immortal goddesses could be slain - a prospect that had never been clearer as the outer gates had parted to welcome a spirit and a minion slipped free. It should have been afraid of her, should have bowed to her, but had probably sensed her fear and reacted, racing straight for her, hungry for her living flesh.</p><p>She'd frozen, but still it had not reached her.</p><p>The guardian - what was his name? - had intervened, destroying the fiend with one swipe of his poisoned claw. He hadn't spoken to her afterward, and she hadn't spoken to him, her belief that he was like all the other creatures in this underworld shaken but not yet completely broken. She had begun to study him, though. Over time, she'd become fascinated by his complexities.</p> <p>He was a destroyer, yet he'd saved her. He had nothing, yet he hadn't asked for anything in exchange.</p><p>Did he favor her in return? Sometimes when he looked at her she would swear she saw white-hot flames that had nothing to do with the damned.</p><p>Lucifer regarded her silently as he settled atop his throne of swirling, ghostly souls. A bejeweled goblet materialized, already clutched in his hand, and he sipped from it. A drop of crimson slid down the corner of his mouth and trickled onto his stark white shirt.</p><p>Revulsion besieged her, but she kept her expression neutral.</p><p>\"You are disgusted by me but do not show it,\" he said with another of those wicked smiles. \"Where is the mouse who usually visits? The one who trembles and stumbles over her words? I like her.\"</p> <p>Kadence raised her chin. He could call her all the names he wished, but she wouldn't comment. \"Your walls have been compromised, and a horde of demons fight to escape.\"</p><p>The prince quickly lost his smile. \"You lie. They would not dare.\"</p><p>His agitation was understandable. Without his legions, he would have no one to rule. \"You're right. Your band of thieves, rapists and murderers would not dare disobey their sovereign.\"</p><p>His eyes narrowed in a show of anger. Then he gave a casual shrug to counteract the telltale sign. \"So they're compromised. What do you want from me?\"</p><p>Always he made things difficult. \"The guardian. He can help me stop the ones responsible.\"</p><p>Lucifer snorted. \"No. I like him where he is. My last guard fell victim to a demon's lies and almost allowed a legion to escape. Geryon is impervious to their wiles.\"</p> <p>She barely stopped herself from running her tongue over her teeth. Was this a game he played? He needed the wall repaired as much as she did; his refusal grated. Well, not as much, she mused. Unlike her, he would not die if the wall crumbled. \"I am your sovereign,\" she said. \"You will - \"</p><p>\"You are not my sovereign,\" he growled in another display of anger. A deep breath in and out, and he calmed. \"You are my...observer. You watch, you advise and you protect, but you do not command.\"</p><p>Because you are too weak, he did not say. But then, he didn't have to. They both knew it was true.</p><p>Very well. She would go about this a different way. \"Shall we bargain?\" she asked.</p><p>He nodded, as if he'd merely been waiting for the question. \"We shall.\"</p><p>Gates of Hell</p><p>\"I do not understand,\" Geryon said, refusing to leave his post. He even crossed his arms over his chest, an action that reminded him of his human days, when he'd been more than guard, more than monster. \"Lucifer would never have agreed to release me.\"</p><p>\"I promise you, he agreed. You are free.\" The goddess cast her gaze to her sandaled feet, saying no more.</p> <p>Did she hide something? Plan to trick him, for whatever reason? It had been so long since he'd dealt with a female, he wasn't sure how to judge her actions.</p><p>She was paler than usual, he noted, the rosy glow in her cheeks gone, her freckles stark. Her golden ringlets tumbled down her shoulders and arms, and he could see soot woven throughout the fine strands. His hands ached to reach out, to sift those tresses through his fingers.</p><p>Would she run screaming if he did so?</p><p>Today she wore a violet robe and matching necklace - a necklace that boasted a teardrop amethyst as large as his fist and as bright as the glistening ice he had not seen in hundreds of years. She had never worn such a thing before; usually she draped herself in white, an angel among evil, with no adornment.</p><p>\"How?\" he persisted. \"Why?\"</p><p>\"Does it matter?\" Her gaze lifted, boring into him with the precision of a spear and cutting just as deep.</p><p>\"To me, yes.\"</p><p>She gave a little stomp of her foot. \"To save the wall, I need your help. Let that be enough for now.\" Her fingers beckoned him. \"Come. I can show you the damage that has been done.\"</p><p>The goddess did not await his reply. She turned away from him and walked to the far corner of the wall. No, not walked. She glided, a dream of falling stars amid shimmering twilight.</p><p>Geryon hesitated only a moment before following her, breathing deeply of her honeysuckle scent along the way. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>To Geryon's surprise, no one jumped from the shadows as he walked; no one waited to punish him for daring to leave his post. Was he truly free? Dare he hope?</p><p>The goddess didn't face him when he reached her, but traced a fingertip along a thin, jagged groove in the middle stone. A groove that branched into smaller striations, like tiny rivers flowing from a churning ocean.</p><p>\"It's small, I know, but already it has grown from what I saw yesterday. If the demons continue their abuse, it will continue to grow until the rock splits completely in two, allowing legions to enter the human realm.\"</p><p>\"Were a single demon released upon the unsuspecting world,\" he muttered, \"death and destruction would reign.\" Whether or not a punishment would be delivered to him, he would help her, Geryon decided. He could not allow such a thing to happen. Innocence should never be taken from the undeserving. It was too precious. \"What would you have me do?\"</p> <p>She gave a startled gasp. \"You'll help me? Even knowing you are no longer bound to the prince?\"</p><p>\"Yes.\" If she spoke true and he was free, he had no place to go. Too many centuries had passed, his home gone. His family, dead. Besides, he might crave the very freedom the goddess promised but he feared trusting her. She might not intend malice, but Lucifer certainly would.</p><p>With the prince, there was always a catch. Free today did not necessarily mean free tomorrow.</p><p>No, he dare not hope.</p><p>\"Thank you. I didn't expect - I - Why did you sell your soul?\" she asked softly, tracing the crack again.</p> <p>There was a beat of silence.</p><p>\"What would you have me do?\" he repeated rather than answer. He did not wish to admit the reason for his folly and the subsequent humiliation.</p><p>Her arm dropped to her side, and her expression softened. \"I am Kadence,\" she said, as though he had asked for her name rather than instruction.</p><p>Kadence. How he loved the way the syllables rolled through his mind, smooth as velvet - gods, how long since he'd touched a material so fine? - and sweet as wine. How long since he'd tasted such a drink?</p><p>\"I am Geryon.\" Once, he'd had a different name. Upon arriving here, however, Lucifer had dubbed him Geryon. Guardian of the Damned, it translated to, which was what he was and all he would ever be.</p><p>Some legends, a demon had once jeered at him, proclaimed him to be a three-headed centaur. Some, a vicious dog. Nothing compared to what he was, so he did not mind the stories.</p> <p>\"I am yours to command,\" he said, adding, \"Kadence.\" Tasted even better on his tongue.</p><p>Breath caught in her throat; he heard the hitch of it. \"You say my name like a prayer.\" There was astonishment in her tone.</p><p>Had he? \"I am sorry.\"</p><p>\"Don't be.\" Her cheeks flushed prettily. Then she clapped her hands and brought the conversation back to what should have been their primary concern. \"First we must patch these cracks.\"</p><p>He nodded but said, \"I fear the wall is already compromised. Patching will merely strengthen it for a time.\" But might not prevent an eventual fall, he did not add.</p><p>\"Yes. Knowing demons as I have come to, they will return and inflict more damage.\" Once more she turned to him. Once more she lifted her gaze to him, kernels of fear swirling where there should only be satisfaction. A crime. \"Geryon,\" she began, only to press her lush lips together.</p><p>What was left of his heart skidded to an abrupt stop. She was just so lovely, her gentleness and goodness setting her apart from everything he represented. He wanted to duck his head, hide his ugliness from her. \"Yes?\"</p><p>\"I should not ask this of you, but I know not what else to do.\"</p> <p>\"Ask me anything you desire.\" He would see it was done, no matter the consequences. \"It will be my pleasure to aid you.\"</p><p>\"I pray you remember those words. For after we've repaired the wall, we must enter hell - and hunt the demons who would destroy it.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For hours Geryon worked at repairing the wall, pleading with Kadence all the while to remain behind. Demons were dangerous, he said. Demons liked their prey alive and fresh, he said. What he did not say was that she was fragile, breakable. No, he did not need to say it; she read the thoughts in the ever-growing warmth of his eyes.</p><p>Through it all, she refused to allow him to go alone. She had not bartered something that would surely earn her the wrath of the gods, only to send him on a mission he could not hope to win without her.</p><p>While the demons were not hers to command, she could force them to bow to her. She hoped. Besides, she might appear fragile and breakable, but she possessed a core of iron.</p><p>Something she'd finally proven to Lucifer earlier.</p> <p>As a child, she had been an indomitable force. A whirlwind that trampled anything and everything in her path. It had not been intentional. She'd simply followed the quiet urgings inside her head. Dominate. Master. When she'd realized she had chipped away at her own mother's strength of mind, turning the once vibrant goddess into a lifeless shell, she had retreated inside herself, afraid of who and what she was. Afraid of what she could do, unintentional though it was.</p><p>Sadly, with those fears came others, as if she'd opened a doorway in her mind and placed a welcome mat out front. Fear of people, places, emotions. For centuries she had acted like the mouse Lucifer had called her.</p><p>Underneath the fears, however, she was still the goddess she'd been born to be: Oppression. She conquered. She did not cower. Please, do not let me cower. Not any longer.</p><p>Only a few moments ago, Geryon had reluctantly pried apart the boulders blocking the cavern from a yawning pit - only a small slit - flames and scaled arms instantly reaching out. He had entered first, commanding both to recede. To her surprise, they had obeyed the instant she came through. Part of her wanted to believe they had done so because they'd been afraid of her. The other part of her knew they'd feared Geryon.</p><p>\"Ready, goddess?\" he anchored himself on a ledge of the wall. He was to the left of the gate, she on the right. \"Ready?\" he insisted, reaching toward her. To protect her? Aid her? They were hanging onto a massive rock, after all, a fiery pit waiting to catch them should they fall.</p> <p>\"Yes.\" Finally, I will know his touch. Surely it will not be as divine as my body expects. Nothing could be. But just before contact, he lowered his arm and inched further away from her. She sighed in disappointment and tightened her grip on the wall, balancing her feet on the thin ledge as best she could.</p><p>\"This way.\" He motioned toward the crack with a tilt of his chin.</p><p>\"All right. And Geryon? Thank you. For everything.\" Usually she whisked herself to Lucifer's palace without ever opening the gate, too afraid to fall into this smoldering pit and explore the wasteland waiting below. Not today. She couldn't.</p><p>\"You are welcome.\" He pushed the stones back together.</p><p>She waved her hand over them, leaving traces of her power there. Because there was no longer a guardian stationed out front, the extra fortification was needed - despite the fact that providing it weakened her.</p><p>As fragments of her power adhered to the stones, she was careful to maintain distance from them. Supposedly Geryon was the only one who could touch the gate without consequence. Well, besides Hades and Lucifer. Anyone else, the stones heaped untold pain and horror upon.</p> <p>She had never dared test the supposition.</p><p>A thought occurred to her, and she tilted her head, studying her companion. Without Geryon at the gate, who would open the stones to allow damned souls inside? Perhaps Lucifer had already appointed another guardian. Perhaps? She chuckled without humor. He had. He couldn't leave the gates unguarded. The knowledge that Geryon would not be the man she saw every day...saddened her. For when the wall was safe, Geryon could leave but she would be stuck here.</p><p>Do not think about that now. She glanced around. The air was smokier here, she noticed, hotter. So hot, in fact, sweat instantly beaded on her skin, trickling down her temples, between her breasts. And as Geryon climbed over her to position himself in front of her, widening the distance between them, no longer did she smell the decadent scent of powerful male; she smelled only the pungent odor of decay. Screams and curses assaulted her ears.</p><p>Something fiery brushed the back of her neck, and she yelped.</p><p>Geryon jumped into immediate action, growling and swiping out his claw. But the flame receded, and she would swear she heard it laugh.</p><p>No, they were not intimidated by her.</p><p>\"Are you all right?\" Geryon asked her.</p><p>\"Yes,\" she said, but gods, what had she gotten herself into?</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Perhaps the wall is not as damaged as I feared,\" Kadence told Geryon. Maintaining a firm grip, she used the jagged stones to edge along, ever conscious of the seemingly endless void awaiting her should she lose her balance. \"A goddess can hope, at least.\"</p><p>\"Yes, a goddess can hope.\" Geryon kept a steady pace in front of her, remaining as close as possible every inch of the way without actually touching her.</p><p>She yearned to slide against him, drink in his strength, belong to him if only for a moment, but she did not, too afraid of startling him. And not even when a rock tumbled from the small ledge on which she had placed her foot did she relent. Sadly, neither did he.</p><p>\"Do not show the flames fear,\" he said. \"They feed on it, will try to increase it.\"</p> <p>\"They are alive?\"</p><p>\"Some of them.\"</p><p>Dear gods. How had she not known? \"I did not imagine such a climb would be necessary. I assumed we would flash wherever we needed to go. Silly of me.\"</p><p>\"Flash?\"</p><p>\"Yes. The ability to move from one location to another with only a thought.\"</p> <p>\"Would be difficult to flash along this wall. You might end up in a spot without a ledge. When we finish here, can you flash us to the bottom of the pit? Once there, we can search for the demons on foot.\"</p><p>\"No,\" she said on a sigh. \"I wish, but no. I've never taken this route. I would not know where to stop, and might very well cause us to materialize underground.\"</p><p>He did not show any disappointment. \"Still, it is a handy power to possess. I envy you.\"</p><p>Poor man. He'd been stuck at the gates of hell for more years than she could count. \"If you could flash to anywhere in the world, where would you go?\" Once they'd destroyed the demons trying to escape, perhaps she would take him there.</p><p>He grunted. \"I do not wish to lie to you, goddess, therefore I will not answer your question.\"</p><p>Curiosity bombarded her. Why would he not answer such a question? Unless...did his answer embarrass him? If so, why? She desperately wanted to know, but let the matter drop. For now.</p> <p>When they reached the far side of the wall, he somehow angled himself behind her. Still he didn't touch her, yet she felt the heat of him pressing into her back, holding her steady. It was not a heat she minded, even amidst the smoldering furnace that was hell. His was...heady.</p><p>\"I'm sorry to say it's worse than I thought it would be.\" His breath trekked over her.</p><p>\"Wh - what?\" she asked, horrified. Being near her was worse than he'd thought?</p><p>\"The wall. What else?\"</p><p>Thank the gods, she thought, expelling a breath. Foolish woman. Her life depended on this wall. She should not care whether a man found her attractive. Or not.</p><p>She forced her gaze straight ahead, her mind centered on her job, not the intriguing man behind her. At least somewhat. Thick claw marks abounded. And what had appeared to be thin grooves on the other side were massive craters here. Hope abandoned her.</p><p>\"They are more determined than I realized,\" she said, voice trembling slightly.</p><p>Geryon adjusted his grip, his arm just over her shoulder. A tremor raked her. If she stood on her tiptoes, she would feel his skin against her chimation. Though it had been hundreds of years since she'd had a man, she remembered the comfort such simple contact could offer.</p> <p>\"Do not worry. I will not allow them to hurt you.\"</p><p>\"And I will not allow them to hurt you,\" she vowed.</p><p>Chuckling, he latched onto her waist. She gasped. Finally. It was amazing and wonderful...wild and intense. But there was no comfort in it, as she'd expected. No, instead she experienced white-hot, searing arousal.</p><p>\"Geryon?\"</p><p>\"Time to fall, goddess,\" he said, and then he released the rocks, taking her over the edge with him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They seemed to fall forever. Geryon retained an iron-edged grip on the trembling Kadence, her hair whipping around them like angry silk ribbons. She didn't scream, something he'd expected, but she did wind her legs around him, something he had not.</p><p>It was his first taste of heaven.</p><p>\"I've got you,\" he said. Her body fit perfectly against his, soft where he was hard, smooth where he was callused.</p><p>\"When does it end?\" she whispered, but still he caught the undercurrents of panic in her voice.</p> <p>They were not twirling, were merely dropping, but he knew the sensation could be harrowing. Especially, he reflected, for one used to flashing ly from one place to another. \"Soon.\" He'd fallen like this only once before, when Lucifer took him to the palace to explain his new duties. But he had never forgotten.</p><p>Like before, flames kindled all around them, pinpricks of gold in the shuddering darkness. Except before, those flames had flicked like snake tongues, licking at him. That they didn't now...did they fear him? Or the goddess?</p><p>She was more everything than Geryon had realized. More courageous. More determined. Every minute he spent with her, his desire for her intensified. She was the break of dawn in the bleakness that was his life. She was refreshing ice in smoldering heat.</p><p>She is not for you.</p><p>Ugly as he was, she would run fast and far if she knew the many fantasies his mind had begun to weave of them. Him, laying her on the ground, stripping her, dancing his tongue over every delicious inch of her. Her, moaning in pleasure as he tasted her core. Crying out in abandon as he filled her with his shaft.</p> <p>\"What's wrong?\" she asked, her still-rising panic evident.</p><p>\"Nothing's wrong,\" he lied. \"Just a little farther and we'll hit. Landing will jar you, but I'll absorb most of the impact.\" He moved one of his hands up and onto the base of her neck. Offering comfort, he told himself. He'd tried not to touch her, had fought it, but there'd been no other way to protect her inside the pit.</p><p>What was the harm in adjusting a single hand?</p><p>\"But you stiffened.\"</p><p>More so than she probably realized, he thought dryly. I must stop craving her. Her skin was soft, so soft, and he felt little bumps rise under his palm as he gently massaged.</p><p>To his delight, her muscles relaxed under his ministrations. \"Tell me what's wrong,\" she said. \"You're hiding something, I can tell. I know this pit is made for souls, not breathing, flesh and blood bodies. Are we going to - \"</p> <p>\"No. I swear it. We will live.\" The conversation seemed to calm her, so he said, \"Tell me about you. About your childhood.\"</p><p>\"I - all right. But there's not much to tell. I was not allowed out of my home as a child. For the greater good,\" she added, as though the line had been fed to her many times before.</p><p>He hugged her tight, understanding. Because of her nature, she'd been as much an outcast as he was. \"Goddess, I - \" The air was thickening around them, the flames spraying what looked to be molten teardrops. He recognized the signs; the end was near. \"Drop your legs from me, but do not let them touch the ground.\"</p><p>\"All rig - \"</p><p>\"Now!\"</p><p>Boom. They smacked into the ground and Geryon planted his feet as the impact vibrated through him. He tried to remain upright to keep the goddess from the ground, but his knees soon gave out and he collapsed backward.</p><p>Kadence remained in his arms, though she had unwound her legs as he'd asked, so his back took the brunt of the fall, breath knocking from his lungs. He lay there for a moment, panting.</p><p>They were well and truly inside hell.</p> <p>There was no going back now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Geryon? Are you all right?\"</p><p>The muted darkness of the pit had given way to bright light, fire illuminating every direction. Kadence hovered over him, like the sun he sometimes glimpsed in his dreams, bright and glorious. \"I am...fine.\"</p><p>\"No, you're not. You're wheezing. What can I do to help?\"</p><p>He was surprised to note she did not scramble off him, now that they were safe. Well, as safe as a person could be inside hell. \"Tell me more about yourself. While I catch my breath.\"</p> <p>\"Yes, yes, of course.\" As she spoke, her delicate hands wisped over his brow, his jaw, his shoulders. Searching for injuries? Offering comfort? \"What should I tell you?\"</p><p>\"Anything.\" He was growing stronger by the second, but he did not admit it. Rather, he luxuriated in the sensation of her touch. \"Everything. I want to know all about you.\" Truth.</p><p>\"All right. I...goodness, this is hard. I guess I'll start at the beginning. My mother is the goddess of Happiness. Odd, I know, that such a woman could give birth to one such as me.\"</p><p>\"Why odd?\" When looking at Kadence, hearing her voice, breathing in her scent, gave him more joy than he'd ever known?</p><p>\"Because of what I am,\" she said, clearly ashamed. \"Because of the damage I can cause.\"</p> <p>\"I have known nothing but - \" pleasure, hunger, desperation \" - kindness at your hands.\"</p><p>Her ministrations ceased, and he could feel her gaze boring into him. \"Truly?\"</p><p>\"Yes, truly.\" Do not stop touching me. Centuries had passed since he'd last enjoyed even the slightest hint of contact. This was nirvana, paradise and a dream all wrapped into one delightful package. \"My head,\" he found himself saying on a moan.</p><p>\"Poor baby,\" she cooed, massaging his temples.</p><p>He nearly smiled. Now was not the time for this. They were inside hell, out in the open, possible targets. But he could not help himself, was too desperate, greedy. Just a little longer. \"Your story,\" he prompted.</p><p>\"Where was I? Oh, yes.\" Her honeysuckle scent enveloped him, chasing away the odor of rot. \"I was a mean little girl. I didn't share my toys, and I frequently made the other children cry, unintentionally compelling them to bend to my will. All right, perhaps a few of those times it was not so unintentional. I think that's one of the reasons I was sent to hell as warden, though it was never said aloud. The gods wanted to be rid of me.\"</p> <p>How forlorn she sounded. \"Every living creature has made a mistake at one point or another. Besides, you were a child. Not yet sensitized to the feelings of others. Do not blame yourself.\"</p><p>\"What of you?\" she asked, and this time she sounded more buoyant.</p><p>He'd relegated his human memories to a far corner in his mind, never to be considered again. Before, thinking of those days had stung, for he'd known they were forever lost - but he reminded himself that with his wife's desertion, that was a good thing. Today, however, with the essence of Kadence all around him, he experienced only a thrum of sadness for what might have been.</p><p>\"I was a wild child, untamable, a roamer,\" he said. \"My mother despaired, thinking I would worry her and every member of our family to death.\" He laughed, her sweetly aged face flashing in his mind. \"Then they introduced me to Evangeline. She calmed me, because I wanted to be worthy of her. We married, as both our families desired.\"</p><p>Kadence stiffened. \"You are...wed?\"</p><p>\"No. She left me.\"</p><p>\"I am sorry,\" she said, but there was relief in her tone.</p><p>\"Don't be.\" Had he not given his soul for Evangeline, she would have died. And had she not left Geryon, he might have fought Lucifer when the time came to become guardian. And had he fought, he might not have met Kadence.</p> <p>Suddenly a frenzied snarl echoed through the distance. Giving up all pretense of being winded, Geryon popped to a stand, lifting the goddess with him and searching the distance.</p><p>A demon was racing straight for them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Geryon shoved Kadence behind him. Another touch - warmth, satin skin, perfection - and he yearned to revel in it. He didn't, couldn't. He'd agreed to come with her to save the human realm, yes, but also to keep her safe. Not because she was a goddess and not because she was the most beautiful thing he'd ever beheld, but because, in this single day, she had made him feel like a man. Not a beast.</p><p>\"Remember that I swore to let no harm befall you,\" he told her. A minute, perhaps two, and the creature would reach them. Fast as it was, there was still a great distance to cover, the streets of hell stretching endlessly. \"I will keep my word.\"</p><p>\"Geryon. Perhaps I can - \"</p><p>\"No.\" He didn't want her involved in this fight. Already she was trembling in fear. She was so scared, in fact, she had yet to realize her hands were resting on his back, twin conductors of inexorable pleasure. Had she known, surely she would have jerked away. \"I will fight it.\" Should she try, it would feed off her fear, becoming more crazed.</p> <p>As did most minions, the creature coming at them possessed a skeletal face and a muscled body covered in green scales, its forked tongue flicking out as if blood already coated the air. Glowing red eyes glared at them, a thousand sins resting where pupils should have.</p><p>Warrior instincts demanded Geryon stride forward and meet the bastard in the middle. Fight there, like true soldiers. Yet his every male instinct demanded he stay where he was. To put any distance between himself and Kadence was to place her in further danger. Another demon could be hiding nearby, waiting for the chance to pounce on her.</p><p>\"This is my fault,\" she said. \"No matter that I had begun to relax, my fear of this place is bone-deep. And that fear is like a beacon to them, isn't it?\"</p><p>He chose not to answer that, too afraid of scaring her further by acknowledging the truth of her words. \"When he reaches us, I want you to run backward. Press against the wall and scream for me if you see any hint of another demon.\"</p><p>\"No, I want to help you. I - \"</p> <p>\"Will do as I said. Otherwise, I will defeat him and leave this place.\" His tone was uncompromising. Already he regretted bringing her here, whether the wall needed defending or not.</p><p>She stiffened against him, but didn't offer another protest.</p><p>A cry of, \"Mine, mine, mine,\" rent the air.</p><p>The creature closed in, faster...almost...there. Claws raked at Geryon as he grabbed his opponent by the neck. Multiple stings erupted on his face, followed by the trickle of warm blood. Flailing arms, kicking legs. Only when the temptation of Kadence's hands fell away did Geryon truly begin to battle. He tossed the creature to the ground and leapt upon it, knees pinning its shoulders. One punch, two, three.</p><p>It bucked, wild and feral. Saliva gleamed on its fangs as curses sprang from its bony mouth. Another punch. Still another. But the pounding failed to subdue it in any way.</p><p>\"Where is Violence? Death? Doubt?\" he gritted out.</p> <p>The struggling continued, intensified, terror leaping to life in those red eyes. Not fear for what Geryon would do, he knew, but terror for what its brothers-in-evil would do if they learned of any betrayal.</p><p>Though Geryon hated for Kadence to see him kill - again - it could not be helped. That's what they had come here for, after all. He raised his hand, spread his elongating, dripping nails and struck. The poison that coated his nails was a \"gift\" from Lucifer to aid in his duties and acted swiftly, without mercy, spreading through the creature's body and rotting it from the inside out.</p><p>It screamed and screeched in agony, its struggling soon becoming writhing. Then the scales began to burn away, smoking, sizzling, leaving only more of that ugly bone. But the bones, too, disintegrated. Ash coated the air, blowing in every direction.</p><p>Geryon stood to shaky legs. He kept his back to Kadence for several minutes, waiting, hoping - dreading - that she would say something. What did she think of him now? Would there be any more of her tending? Finally curiosity got the better of him and he pivoted on his heels.</p><p>She stood exactly as he'd commanded, her back pressed against the rocky wall. Those glorious ringlets cascaded around her. Her eyes were wide and filled with...admiration? Surely not.</p><p>\"Come to me,\" she said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kadence had been unable to hold back her entreaty. Geryon stood several feet away, panting shallowly, his cheeks cut and bleeding, his hands dripping with his opponent's lifeblood.</p><p>His dark eyes were more haunted than she'd ever seen them.</p><p>\"Come to me,\" she said again. She motioned him over with a wave of her fingers.</p><p>The first time, he'd given no reaction. As though he hadn't believed he'd heard her correctly. This time, he blinked. Shook his head. \"You wish to...punish me for my actions?\"</p> <p>Silly man. Punish him? When he'd saved her? Yes, part of her was angry that he'd kept her from the fight, that he'd threatened - vowed - to leave without doing what they'd come here to do. But part of her was relieved. I am not a coward. Not anymore. Next time, I will act. No matter his wishes, no matter mine.</p><p>\"Kadence,\" Geryon said, and she realized she had been staring at him, silent.</p><p>\"I would never punish you for aiding me.\"</p><p>Again he blinked. \"But...I killed. I hurt another creature.\"</p><p>\"And you were injured in the process. Come, let me attend to your wounds.\"</p> <p>Still he resisted. \"But you would have to put your hands on me.\"</p><p>He said it as though the thought should be loathsome to her. \"Yes, I know.\"</p><p>One hesitant step, two. At that pace, he would never reach her. Sighing, she closed the rest of the distance herself, twined their fingers - experienced a powerful jolt, gasped - and led him to the rocks. \"Sit. Please.\"</p><p>As he obeyed, he tugged his hand from her and rubbed where they'd been connected. Had the same jolt pierced him? She hoped it had, for she did not want to be alone in this...attraction. Yes, attraction, she realized. Physical, erotic. The kind that prompted a woman to leave her inhibitions and invite a man into her bed.</p><p>Whether that invitation was accepted or not was a different story.</p><p>Reluctant as Geryon was, she was positive he would turn her down. And perhaps that was for the best. Her lovemaking tended to scare men away. Because when the pleasure hit her, she could not control her nature. The chains she'd erected broke, unleashing her will with a vengeance.</p> <p>Physically, her lovers became her slaves. Mentally, they cursed her, knowing she had stolen their freedom of choice, unwitting though it had been. She had never bedded the same man twice, and, after three tries, had stopped altogether. One she had considered bad luck. Two, a coincidence. Three, undeniably her fault.</p><p>How would Geryon respond? Would he hate her? Probably. Already he knew the horrors of being bound to someone else's will. She would not doubt if freedom was the most precious commodity in his life.</p><p>Sighing, she tore several strips of cloth from the bottom of her robe and knelt in front of him, between his legs. His shaft was hidden by a short skirt of leather and metal filigree. A warrior's cloth. Perhaps it was wanton of her, but she wanted to see him there. She licked her lips, thinking maybe, perhaps, what if she ̈C</p><p>As if he could read her mind, he sucked in a breath. \"Don't,\" he said.</p><p>\"I'm sorry. I - \"</p><p>\"Don't stop.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Don't stop. Did he mean for her to move his armor out of the way? Or simply to clean him as she'd promised? Already he was nervous, on edge, and had resisted even the slightest of handling. Afraid to risk a mistake, she leaned in, reached up and mopped the blood from his face with one of the strips of cloth. Acting the coward again, are we?</p><p>His delectable scent filled her nose, a midnight breeze that inexplicably reminded her of home. A sprawling, opulent home she had not been able to visit since reluctantly agreeing to oversee the fortification of hell. How she missed it.</p><p>\"In all the years I have known you,\" she said, carefully avoiding the deepest gash, \"you have never left your post at the gate. Do you eat?\" At first contact, he had jumped. But she maintained a steady, casual rhythm and he gradually relaxed.</p><p>Perhaps one day he would allow her to do more. Would she enslave him, though, as she had the others?</p> <p>\"No. There's no need.\"</p><p>\"Really?\" Even she, a goddess, needed food. She could survive without it, yes, but she would waste away, becoming a mere shell of herself. \"How, then, do you survive?\"</p><p>\"I'm not sure. I know only that I stopped needing food the day I was brought here. Perhaps the fire and smoke sustain me.\"</p><p>\"So you don't miss it? The tastes and textures, I mean?\"</p><p>\"It's been so long since I've seen even a crumb that I rarely think of food anymore.\"</p> <p>She wanted to feed him, she thought. Wanted to sweep him out of this nightmare and into a banquet hall with tables piled high, food of every kind gracing their surfaces. She wanted to watch his face light in ecstasy as he sampled one of everything. No one should be forced to go without such nourishment.</p><p>When his face was clean, she switched her attentions to his right arm. Angry claw marks glared at her, and she knew they had to be hurting him. Not by word or deed did he betray it, though. No, he actually seemed...blissful. \"I'm sorry I do not have the proper medicines to ease your pain.\"</p><p>\"You have no reason to be sorry. I'm grateful for what you're doing and hope to repay you in kind some day. Not that I desire you to be injured,\" he added quickly. \"I do not.\" Horror blanched his features. \"I would hate such a thing. Truly. I only want to see you healthy and whole.\"</p><p>Her lips curled into a slow smile. \"I understood your meaning.\" Finished with her ministrations, she settled her hands in her lap. She didn't move from her position between his legs, because an idea had taken root in her mind. Perhaps he wasn't ready for her to remove his armor - he was so sensitive about his appearance, after all - but that did not mean he would refuse her...other things. And he'd seemed to enjoy having her hands on him. \"May I ask you a question, Geryon?\"</p><p>He nodded hesitantly. \"You may do anything you like to me.\"</p><p>Had he meant the words to emerge so sensually? So husky and rich? \"Are you...do you like me?\"</p> <p>He looked away from her and gave another nod. \"More than I should,\" he muttered.</p><p>Her pulse fluttered madly. \"Then I would like very much if you would kiss me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kiss her? \"I shouldn't. I can't.\" Though gods, Geryon wanted to, desperately, and found his gaze straying to her lips. They were lush and red. Glistening. His mouth watered for a taste of them. His horns, sensitive to his emotions as they were, throbbed.</p><p>Those pretty lips dipped into a frown. \"Why not? You said you liked me. Did you lie to spare my feelings?\"</p><p>\"I would never lie to you. And I do like you. You are beautiful and strong, the finest thing I have ever known.\"</p><p>\"You think me beautiful? Strong?\" Pleasure lit her expression. \"Then why won't you kiss me?\"</p> <p>\"I will hurt you.\"</p><p>Her face scrunched adorably in her confusion. \"I don't understand. You've never hurt me before.\"</p><p>\"My teeth...they are too sharp.\" He didn't add that his hand were too toxic, his strength too mighty. Were he to lose control of himself and squeeze her, which was a possibility considering how much he desired her, she would be hurt. Scared, too. Perhaps even irreparably damaged.</p><p>\"I'm willing to risk it,\" she said, placing her palms on his thighs and burning him soul-deep.</p><p>He both hated and loved his half-armor at that moment. Hated because it kept him from skin-to-fur contact. Loved because it blocked her gaze from parts of his monstrous form. \"Why?\" What reason could she possibly have for wanting to place her luscious lips on something so...disgusting? Mere curiosity would not drive a female to such an act. Evangeline had vomited the moment she'd first spied his changed appearance. \"I could tolerate what you were, but I can not tolerate...this,\" she'd thrown at him.</p> <p>\"Because.\" Twin pink circles painted Kadence's cheeks, but she didn't turn her gaze.</p><p>\"Why?\" he insisted. He placed his hands atop hers. Gulped at the headiness, the silkiness.</p><p>\"You saved me.\"</p><p>So she was grateful. His shoulders sagged in disappointment. Did you truly expect her to desire you? No, he hadn't expected it - but he had hoped. \"It would be dishonorable to kiss you for such a reason.\"</p><p>Though she remained on her knees, she rose until they were merely a whisper apart. \"Then do it because I'm desperate, needy. Do it because I've suddenly realized how quickly something can be taken from me, and I wish to know some part of you before I'm - \"</p><p>\"Before you're...\" he managed to choke out. She was desperate? Needy?</p> <p>\"Do it,\" she pleaded.</p><p>Yes. Yes. Geryon could no longer resist, dishonorable or not. He would be careful, he vowed. So careful. He bent the rest of the way, softly pressing his mouth against hers. She didn't pull away. She gasped, lips parting, and he swept his tongue inside. Her taste...so sweet, like a snowstorm after a millennium of fire.</p><p>\"More,\" she said. \"Deeper. Harder.\"</p><p>\"Sure?\"</p><p>\"More than I've ever been.\"</p><p>Centuries had passed since he'd kissed a woman and never while in this form, but he began thrusting his tongue against hers, rolling them together, retreating, then going back for more. When he felt his teeth scrape hers, he stiffened. And when she moaned, he tried to pull away. But her arms slid up his chest, one anchoring around his neck, the other caressing a horn. So sensitive was the protrusion, he had to grip his thighs, nails sinking deep, to keep his claws off her.</p><p>\"Like?\" she asked.</p><p>\"Yes,\" he managed to grit out.</p> <p>\"Good. Me, too.\" Her lush breasts pressed into his chest, her nipples hard and searching.</p><p>She enjoyed his kiss? Tremors rocked him, their tongues beginning another dance, his muscles tightening against the strain of remaining exactly as he was. With every moment that passed, every breathy sound that emerged from her, his control snapped a little more. He yearned to toss her down, climb atop her and pound, pound so hard he would brand himself on every inch of her. Inside every cell.</p><p>\"Stop,\" he finally said. \"We must stop.\" He jerked to his feet, away from her, already mourning the loss of her taste. He kept his back to her, panting, his heart racing.</p><p>\"Did I do something wrong?\" she asked softly, and there was a catch in her voice.</p><p>Oh, yes. You stole a heart I could not afford to give. He'd promised never to lie to her, however, so he merely said, \"Come. We have waited long enough. We have demons to hunt.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They stopped at the first building they came to: a tavern. An actual, honest-to-gods tavern, where blood was served rather than alcohol. Kadence had known such things existed down here, but it still struck her as odd. Demons, acting as humans.</p><p>They'd had a two-mile trek from the pit's entrance to here. A two-mile trek she had spent remembering Geryon's earth-shattering kiss, cursing him for stopping it and fretting about his reasons.</p><p>Throughout her endless life, she had welcomed only those three lovers into her bed, and all three had been gods. If gods had not been able to handle her, there was no way Geryon could. But she had hoped. For once she'd had no thoughts of controlling her nature, only enjoying. Yet Geryon had walked away from her, just as the others had. Am I so terrible? So horrible a person?</p><p>More than the others, she had wanted Geryon to find pleasure with her because he meant more. She liked who she was with him. Liked how she felt when he was near. Instead, she had...disgusted him? Repelled him? Failed to arouse him in even the slightest way?</p> <p>\"Stay by my side,\" he said as he shoved open the tavern's swinging double doors. They were the first words he had uttered since reminding her of their quest. \"And keep your hood over your head. Just in case. Actually, are you versed in glamour?\"</p><p>His voice was deep and rough and caressed every one of her weeping senses. Surely she did not disgust him. Surely she did not repel him. He had held himself back during their kiss, had stopped it, but when he looked at her, he made her feel as if she were the only woman in the world. The most beautiful, the most desired. A treasure, something to cherish.</p><p>He paused before entering. \"Kadence?\" Cleared his throat. \"Goddess?\"</p><p>\"I will glamour myself and stay by your side,\" she told him, though inside she beseeched, Tell me why you continually push me away.</p><p>He didn't. He nodded and stepped forward. She stayed close, as promised, mentally projecting the image of bones and scales. Anyone who glanced in her direction would think they saw one of their own. She could only hope her fear was masked as well.</p> <p>Taunting laughter and pain-filled cries immediately assaulted her ears. Gulping, she sent her gaze around the room. So many demons...they came in every shape and size. Some were like the image she projected, bones and scales. Some were half man, half bull. Some were winged like dragons with snouts to match. Yet all of them crowded a stone slab. A moving slab?</p><p>No, not moving, she realized, horror claiming her in a bruising grip and nearly crushing her lungs. Human spirits were atop the slab. The demons were ripping them apart, eating their insides. Unfortunately, there was no peace for the damned. Only endless torture.</p><p>\"Gods,\" she couldn't help but breathe. \"How can we defeat a horde of these?\"</p><p>\"Over here.\" Geryon edged them to the side and out of the way, and she knew it was so that they could observe the happenings without drawing notice. \"The creatures you see here are minions, soldiers and servants. They are not what we will be fighting.\"</p><p>That's right, she thought, stomach sinking. Violence, Death and the like were Demon Lords. While minions enjoyed their prey's agony, their main focus was the fulfillment of a basic need: hunger. The Lords cared only for the agony. Prolonging it, increasing it to the depths of insanity. And the more agony they inflicted, the more screams they elicited, the stronger they became.</p><p>Oh, yes. They were far worse than anything here.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Smell good, like fear,\" something suddenly growled beside Kadence. \"Mmm, hungry.\"</p><p>Startled, she gasped. Geryon tried to pull her behind him, but she resisted. This time, she wouldn't sink into the background, forcing him to do all the work, take all the risks. This time, she fought. \"Move away or die,\" she told the demon.</p><p>It frowned at her. \"Look like me. Why you smell so good?\" It licked its lips, saliva dripping from the corners of its paper thin mouth. It was covered in yellow scales and only reached her navel. And while it appeared lean, she suspected unyielding strength rested underneath those scales.</p><p>A tremor moved through her. Remember who you are. Remember what you can do.</p> <p>It stepped closer.</p><p>\"You were warned,\" she said, bracing herself.</p><p>\"Wait outside, Kadence. Please.\" Geryon tried to move in front of her.</p><p>She blocked him, not facing him. \"No. You will not fight them alone.\"</p><p>As they spoke, the demon continued to inch toward them, its claws lengthening.</p> <p>\"Please, Kadence.\" Geryon tugged at her. \"I need to know you're safe. Otherwise, I'll be distracted and a distracted warrior is a defeated warrior.\"</p><p>\"I cannot act the coward. Not anymore. Besides, if this works, you will not have to fight him at all.\" She was hell's warden; it was past time she acted like it. Past time she ruled rather than merely observed.</p><p>\"If isn't good enough. Not when it comes to your safety.\"</p><p>Any moment the creature would cease its stalking and spring. She knew it, felt it. Kadence reached inside herself as she angled her chin to stare deep into its eyes, surprised to find her power easily accessible. She shouldn't have been surprised, though. She might try and suppress it, but it was always there, never silent, a churning sea inside her.</p><p>\"Stay,\" she said, and the creature locked in place, its mind still active but every part of its physical form hers to command.</p><p>For a long while, she simply drank in her handiwork, amazed. I did it. Not once did the fiend try and approach her again - even though murder gleamed in those beady eyes.</p> <p>\"Something's happened,\" Geryon said, sounding confused.</p><p>\"I happened,\" she said, proud of herself. \"Watch.\" To the demon she said, \"Raise your arms over your head.\"</p><p>Instantly, it obeyed, shooting both arms into the air without a word of complaint. But then, she had possession of its mouth, as well. Clearly, it had not wanted to comply with her demand, for its gaze continued to translate its hatred of her.</p><p>Joy burst through her. For once, she had used her ability for good: to save someone she greatly lo - admired. Dear gods. Did she love Geryon? She loved being with him, loved the way he made her feel: cherished, protected. But did that mean she had given him her heart? Surely not.</p><p>\"Look, Kadence.\" Geryon pointed to the slab. \"Look what's happened.\"</p><p>She followed the direction of his finger and gasped. Every demon had frozen in place, their hands in the air. Even the spirits had stopped writhing. There was no laughter, no cries. Only the sound of her own breathing could be heard.</p><p>\"You did this?\" Geryon asked.</p><p>\"I - yes.\"</p> <p>\"I am amazed. Awed.\"</p><p>Her joy intensified. \"Thank you.\"</p><p>\"Can they hear me?\" When she nodded, he slowly grinned and shouted to the creatures, \"Hear me well. Go forth and tell every Demon Lord the guardian is here and that I plan to destroy them.\" To Kadence he added, \"Release them.\"</p><p>Though she wanted to protest, Kadence did as he'd asked. In less than a blink, the creatures were racing from the building as fast as possible, leaving her and Geryon alone. \"Why?\"</p><p>His grin widened. \"Now we wait. They will come to us.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Geryon fortified the building against attack as best as he was able, given the lack of supplies and tools. Kadence remained at his side, lending a spiritual touch whenever needed, forcing the planks and stones to bow to her will. He noticed she grew paler with every minute that passed.</p><p>\"What's our battle plan?\" she asked when they finished, settling against the far wall. The only place without blood or...other things on it.</p><p>Keeping you alive, by whatever means necessary. He joined her, careful not to touch her. One touch, and he would pull her back into his arms. He needed to be alert, on guard. \"You'll lock them in place and I'll slay them.\"</p><p>\"Quick and easy,\" she said with a ring of hopefulness in her tone. \"How long do you think we have?\"</p> <p>\"A few hours. It will take a while for news of my arrival and intentions to spread. Longer still for the Lords to gather their forces and plan an attack.\" Geryon raked a claw across the floorboard to mar the curse etched there, stone shards flying into the air. \"I understand why Lucifer wishes you to destroy the demons trying to leave hell and thereby prevent all other demons from following them, but why does it matter so much to you?\"</p><p>She shrugged. \"When I agreed to enter this realm, I became...connected to it. If the wall crumbles, I die.\"</p><p>She would die? \"Why did you not tell me before now?\" he growled. \"And why would you connect to such a thing? Why would you come here willingly?\"</p><p>\"Had I remained in the heavens, I would have been punished every minute of every day. No one is crueler in that respect than the gods. They wanted me here, so here I came. But I had no idea how permanent the bonding would be. How powerful. As to why I didn't tell you...\" She shrugged. \"You had permission to finally leave your post yet you chose to help me. I didn't want to burden you further. Now you've saved me, again, and I don't wish to lie to you.\"</p><p>\"Kadence,\" he said, then shook his head. \"I should have remained at the inside of the gate, without you, and slayed the Lords as they approached. Now the wall is without protection, and you are in more danger than ever.\"</p> <p>\"They would have seen you and stayed away, for there is no place to hide above the pit.\"</p><p>\"And that would have been fine with me. That would have kept you safe.\"</p><p>\"Yet that is no kind of life for you, simply lying in wait.\"</p><p>\"It is the life I am used to.\"</p><p>\"But you deserve more!\" Looking away from him, she traced a fingertip over the area he had clawed. \"We had to do this. Or rather, I did. But I want you to know that if I fall, the wall will remain as it is, for it isn't bound to me. I have been hurt many times over the years, yet it did not show signs of damage.\"</p><p>\"I don't care about the damn wall!\"</p> <p>Her eyes widened. Then she gulped and continued as if he hadn't spoken. \"Without me, there will be no one who senses when something is wrong. The gods will have to find someone new. I know you are now free, but would you remain there, vigilant, until that person is found? Even if Lucifer has already appointed a new guardian?\"</p><p>\"You are not going to die, damn it. Now tell me why Lucifer allowed you inside? He needs you outside.\"</p><p>Color fused her cheeks. Embarrassment? Guilt? \"He also needs his wall protected.\"</p><p>Guilt, most definitely. It was there in her voice, echoing off the walls. \"He could have destroyed or imprisoned the Demon Lords.\"</p><p>\"If he could catch them.\"</p><p>\"I'll give you that.\" Geryon tapped two fingers against his chin, pondering the situation. \"But Lucifer allows nothing, even those things he needs, without demanding some form of payment. What did he demand of you? And why did he allow you my services? Why release my soul? And where is my soul now, if Lucifer no longer has it?\" Even as he asked the questions, a few of the answers shaped in his mind. He snarled low in his throat. \"You bought me from him.\"</p><p>That color in her cheeks deepened. \"Yes,\" she whispered. Her eyelids fluttered shut, the length of them casting spiky shadows over her cheeks. One of her hands rubbed at the amethyst dangling between her breasts. \"I'm not sorry, either.\"</p><p>Was his soul inside? \"Did you buy me with...yourself?\" If so, he would slay the prince before allowing one evil finger to touch this woman's precious body.</p> <p>A pause, her eyes slowly opening. Then, \"No.\"</p><p>\"Tell me.\" Anger was building inside of him. Anger with her, with Lucifer, with himself that this could have happened. What had this prized woman given up? Why had she given it up? He placed his hand over hers, not to hold her in place - powerful as he now knew she was, he doubted he could have done so - but to offer reassurance. He was here, he wasn't leaving. \"Please.\"</p><p>Her chin trembled. \"I gave him a year on earth, unimpeded, to do as he wished.\"</p><p>\"Oh, Kadence,\" Geryon said, knowing the other gods would have to honor her bargain - and would make her suffer for it. Everything inside him rebelled at the thought. \"Why would you do such a thing?\"</p><p>\"To save you. To save me. To save the world beyond our reach. I could think of no other way. A single year to wreck his havoc seemed a small thing to trade in comparison to an eternity of demons roaming free.\" Her mouth opened, but rather than words she gave a pained cry. Quick as a snap, her skin bleached of color and she doubled over.</p><p>Concern instantly rocked him. \"What's wrong, sweet? Tell me.\"</p><p>\"The demons...they're at the wall. They're...they're killing me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Had Lucifer told the demons of her bond to the wall? Kadence wondered, pain slicing through her. Rather than come here to fight, they had gone there. Knowing she would weaken, die? Or, perhaps they had hoped to draw Geryon to them, leaving her here, alone and seemingly vulnerable to ambush. Or did they want her to come to them? So many alternatives.</p><p>The prince probably found the entire situation vastly amusing. He probably - a thought took root in her mind, nearly paralyzing her. If she were killed, he could have more than the agreed upon year on the earth, bartering for souls, causing untold havoc. He could have forever, if he so desired, and he could bring his demons with him, ruling his minions and humans.</p><p>He was a god, a brother to the sovereign. There was no guarantee he would be captured and sent back.</p><p>Of course, his betrayal of her hinged on whether or not he thought he could force his demons to obey him out in the open. Unless...was she the payment for their cooperation? If they didn't know she was bound to the wall, Lucifer could \"kill\" her when it fell to prevent her from chasing them. They'd be grateful to him, might in turn pledge their continued allegiance to him.</p> <p>Oh, gods. The possibility sickened her, for if it was true she had unwittingly helped him every step of the way.</p><p>He desired the wall's protection, she reminded herself. At first, common sense piped up. That doesn't mean he desires it now.</p><p>For reasons that had nothing to do with her internal pain, she couldn't quite catch her breath. What kind of fool am I? She was so ashamed. So foolish.</p><p>\"Kadence, speak to me. Tell me what's wrong,\" Geryon insisted. He popped to his knees and swung around, kneeling between her legs. One of his claws gently, tenderly brushed away the damp hair clinging to her brow.</p><p>Her gaze lifted to his. Seeing him with so much concern in his beautiful brown eyes, she could not regret the choices she'd made. No matter what happened, he would be free. This proud, strong man would finally be free.</p> <p>\"I...am...fine,\" she managed to gasp out. Gods, she felt shredded inside, as though her organs were being ripped to ribbons.</p><p>\"No, you're not. But you will be.\" He scooped her into his arms and carried her to the back. To a room the owner must have used. He laid her on a thin pallet. \"May I?\" he asked, lifting the amethyst that housed his soul.</p><p>She had planned to present it to him once their mission was completed, a gift for his aid, but she nodded. Right now, there was a good chance she would not complete anything.</p><p>Slowly, carefully, he worked the stone from around her neck and placed it over his heart. His eyes closed. He was probably unsure what would happen. And at first, nothing did. Then, in gradual degrees, the jewel began to glow. A frown pulled at Geryon's lips, and he grunted. \"Burns.\"</p><p>\"I'll hold it for y - \"</p><p>The glow exploded into a thousand pinpricks of light, and he roared, loud and long.</p> <p>After the last echo sounded, everything quieted. The lights faded. Only the chain that had held the jewel remained in his hand.</p><p>His frown was lifting into a smile as his eyes opened. But when he studied his arms and then his body, the frown returned, deeper, more intense. \"I should have...I did not...I had hoped to return to my former visage.\"</p><p>\"Why?\" She loved him, just as he was. Horns, fangs, claws and all. Wait - loved? Oh, yes. She loved him. She had considered it before, but had discarded the idea. Now, there could be no discarding. The emotion was there, undeniable as Death stared her in the face.</p><p>No man had ever been more perfectly suited for her. He was not disgusted by her nature, he reveled in it. He did not fear what she could do, but found pride in it. He delighted her, amused her, tempted her.</p><p>\"It is my hope that...that...\" He gulped. \"If you bond with something else, something besides the wall, perhaps your ties to it will lessen and your strength will return. Perhaps the pain will ease.\"</p><p>Something else? \"You?\" she asked, suddenly breathless for reasons that had nothing to do with pain.</p><p>\"Yes. Me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Geryon looked away from her. \"I know I'm ugly. I know the thought of being with me in such a manner is abhorrent, but I - \"</p><p>\"You aren't ugly,\" Kadence interjected, \"and I do not like that you think so. I do not like when you demean yourself like that.\"</p><p>He blinked over at her, astonishment shining in his expression.</p><p>She continued, \"The thought of being with you is welcome. I promise you.\"</p> <p>Now his mouth opened and closed. \"Welcome?\"</p><p>\"Yes. But I don't want you to bond with me simply to save me.\" She had once been too afraid to admit she craved his body, had pretended merely to be grateful to get a kiss. There would be no more pretending. \"I want you to want to do this. Because I...I want you inside of me, becoming part of me, more than I want another tomorrow. I want to be your woman, now and always.\"</p><p>Before he could respond, another pain slicked through her, raining like poisoned hail and curling her into a ball. Another crack had just slithered through the wall; she saw it in her mind.</p><p>\"Geryon?\" she panted.</p><p>His gaze bore into her. \"I once swore that were I ever lucky enough to regain my soul, I would never, for any reason, trade it again. I have just realized that I would willingly trade it for you, Kadence. So yes, I want to do this.\"</p> <p>Geryon slowly divested Kadence of her robe, careful not to hurt her with his razor-sharp nails. She was already in pain and he doubted she could bear much more. Beautiful, precious woman. She deserved only pleasure.</p><p>For whatever reason, she desired him. Desired forever. Together. She had given him the thing he'd thought he valued most - his soul - but he had not known until he'd watched her curl into a ball that he valued her more. He'd longed to take her pain into himself. For her, anything. She cared not that he was a beast. She saw to the heart of him, and liked it.</p><p>When she was naked, he drank her in. Alabaster skin dusted with the sweetest hint of rose. Lush breasts, a curved waist, a navel his mouth watered to sample. Legs that stretched for miles. He bent and licked one of her nipples, laving his tongue around the delectable tip, his hands traveling all over her body.</p><p>The closer his fingers came to her core, the more she purred a deep sigh of satisfaction, her pain seeming to melt away. \"The pleasure, it's replacing the pain,\" she said, confirming his thoughts.</p><p>Thank the gods. He moved his attention to her other nipple, sucking, allowing the tip of a fang to graze it ever so gently. \"Still helping?\" All the while his fingers teased just above her clitoris, not touching, only teasing.</p><p>\"Still helping. But I want to see you,\" she said, giving his armor a pointed stare.</p> <p>He lifted his head and peered into her eyes. \"Are you sure? I could take you without removing a single piece of armor.\"</p><p>\"I want all of you, Geryon.\" Her features were luminescent. \"All.\"</p><p>\"Whatever you desire, you shall have.\" He only hoped she did not change her mind when she saw him.</p><p>\"Do not fear my reaction. You are beautiful to me.\"</p><p>Such sweet words. But...he'd lived with his insecurities so long, they were a part of him. \"How can I be? Look at me. I am a beast. A monster. Something to be feared and reviled.\"</p><p>\"I am looking at you and you are something to be praised. You may not bear the appearance of other men, but you have strength and courage. Besides,\" she added, licking her lips, \"animal magnetism is a very good thing.\"</p><p>Slowly he grinned. \"All right. I will show you the rest of me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Geryon removed his breast plate and tossed it aside, his too-corded chest with its scars, fur and over-large bones revealed. His hands shook as he then unwound the leather wrapped around his waist, slowly revealing his hardened shaft, his scarred and fur-lined thighs. He tensed, waiting for the inevitable gasp of horror, even though she'd assured him of his \"animal magnetism.\"</p><p>\"Beautiful,\" she said reverently. \"A true warrior. My warrior.\" She reached up and ran her fingertips through that fur. \"Soft.\"</p><p>Breath seeped from his parted lips, breath he had not realized he'd been holding until just then. \"Kadence. Sweet Kadence,\" he rasped. What had he ever done to deserve her? If he hadn't fallen in love with her already, he would have fallen then.</p><p>As the hottest thrum of desire he'd ever experienced pounded through him, he kissed his way down her stomach, stopping only to dip his tongue inside her navel. She trembled. When he reached the apex of her thighs, he worshipped her, and the trembling became writhing.</p><p>\"Amazing,\" she gasped, fisting his hair.</p><p>He wanted to devour her, possess her, but he held back, her taste like the sweetest ambrosia. Only when she came apart, screaming her pleasure, did he rise above her. He was proud and honored to have given her such ecstasy. But he was trembling now, his body on fire. Desperate. For her, only her.</p><p>Her legs wound around him, and she cupped his cheeks, staring deep into his eyes. \"I need more of you.\"</p><p>He entered her an inch, one blessed inch. Stopped, gave her time to adjust. He'd go slowly if it killed him. Make it good for her, the best.</p><p>\"Why do I not feel the need to master you?\" she purred into his ear. She bit the lobe.</p><p>Sweet fire. \"That's how it was, before?\"</p><p>She nodded, arching her hips to take more of him. Another inch.</p><p>He had to cut off a groan. \"Perhaps because my heart is so completely yours, there's nothing left to master.\"</p><p>\"Oh, Geryon. Please.\" She stroked his horns, circling a fingertip over the hard points. \"Take me all the way. Give me everything.\"</p><p>He could deny her nothing. Releasing his fierce grip on control, he pounded forward and she cried out. Not in pain, but in joy, he realized. Over and over he filled her, giving her all of him. Their wills intermingled so completely, it was impossible to tell who wanted what.</p><p>His nails raked the floor beside her head, his teeth even nipped her, but she loved it all, urging him on, begging for more. And when he spilled his seed inside her, her inner walls clutching him in her own surge of satisfaction, he shouted the words that had been building inside of him since the moment he'd met her. \"I love you!\"</p><p>To his surprise, she gave a shout of her own. \"Oh, Geryon. I love you, too.\"</p><p>They quickly dressed. Kadence was still weak, but at least the pain had stopped.</p><p>\"Are they still at the gate?\" Geryon asked.</p><p>\"Oh, yes. They're working it feverishly.\"</p><p>He kissed her lips, and she reveled in another taste of this man she so loved. \"Whisk us there, lock them in place, and I will do the rest.\"</p><p>\"I hope this works,\" she said, because she couldn't bear the thought of being parted from him.</p><p>\"It will. It has to.\"</p><p>Otherwise, she feared they were both doomed.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She flashed them as promised, and it took Geryon a moment to orient himself, inside a tavern one moment, in front of the wall the next. When he comprehended the carnage around him, he couldn't quite believe his eyes. The demons had worked so fervently, they had bled all over the stones - stones that had been shredded, almost paper thin. A hole was imminent.</p><p>Worse, the horde of Demon Lords was still there. They were huge, all of them at least seven foot, their bodies so wide that even Geryon, massive as he was, would not be able to stretch his arms wide enough to measure them. Skeletons were visible underneath the translucent skin. A few had wings, and all were grotesque in their evil. Red eyes, horned like Geryon and fingers like knives.</p><p>He must have made a noise, for one of the...things spotted them. Laughed a sound that raised every hair on his body. \"Now,\" he shouted to Kadence.</p><p>She glared over at them - nothing. Pointed her hands at them - nothing. Groaned with the force of her will - but still nothing happened. The Lords did not freeze in place.</p> <p>\"I can't,\" she gasped out.</p><p>\"What's wrong?\" He glanced at her, even as he moved in front of her, keeping his arm around her waist. She had paled, and her trembling had returned. Had his arm not been around her, he knew she would have fallen. Had the bonding not worked, then? \"Talk to me, sweetheart.\"</p><p>He watched the demons as they rallied together, watching him. Laughing. Imagining how they would kill him?</p><p>\"I'm bound to you and the wall. I can feel your strength, its weakness, and it's tearing me apart,\" she cried. \"I'm sorry. So sorry. All of this was for nothing, Geryon. Nothing!\"</p><p>\"Not nothing, never nothing. I have you.\" But for how long?</p> <p>Slowly the demons stalked forward, predators locked on prey. Eerie delight radiated from them.</p><p>\"You are the best thing that ever happened to me,\" Kadence said weakly, leaning her cheek against his back. \"I do not care about my demise anymore, but I hate that I've placed you in grave danger.\"</p><p>No. No! \"You will not die.\" But even as he said it, the wall, so badly damaged, began to crack, to crumble, a hole appearing. Widening.</p><p>Kadence's knees finally gave out, and he turned, roaring, easing her to the ground. I failed her. Damn this, I failed her!</p><p>\"Kadence.\"</p><p>No response. No rising and falling of her chest, no moaning in pain. She was as still as death.</p> <p>\"Tell me how to help you, Kadence. Please.\"</p><p>Again, nothing.</p><p>Tears burned his eyes. He had not cried for the wife that left him, had not cried for the life he'd lost, but he cried for this woman. I need you. She would want him to stop the demons from leaving this realm, but Geryon couldn't bring himself to move from her side.</p><p>Something sharp scraped at his neck, and he jerked his head to the side. The Lords flew around them, cackling with glee. \"Leave us,\" he growled.</p><p>Kill her.</p><p>Destroy her.</p><p>Maim her.</p><p>Too late. She's gone. More laughter.</p> <p>One of them swooped down and raked a claw over her cheek, drawing blood before Geryon realized what was happening. The rest scented the lifeblood and attacked in a frenzy.</p><p>Geryon roared, throwing himself over her to take the brunt of their assault. Soon his back was in tatters, one of his horns chewed loose, a tendon severed. All the while he swung out his arm, hoping to slay as many as he could with his poison, but only one failed to dodge his blow.</p><p>On and on the laughter and abuse continued.</p><p>\"I love you,\" Kadence whispered in his ear.</p><p>His muscled spasmed in shock and relief at the sound of her voice. She was still alive. \"I love you. Stay with me. Don't leave me.\"</p><p>\"I'm...sorry.\"</p><p>He never would have brought her into hell had he known this would happen. He would have spent his entire existence at the gate, fighting to protect it. Her. \"Go,\" he screamed to the demons. \"Leave this place. The mortal realm is yours.\"</p><p>As if the wall had merely been waiting for his permission, it finally toppled completely. Which meant - \"No,\" he screamed. \"I did not mean for you to collapse. I only meant for the demons to fly through.\" But it was too late, the damage was done.</p><p>Gleeful, the Demon Lords flew into the cave, then disappeared from view. A new stream of tears burned Geryon's eyes as he gathered Kadence in his arms. What did he care about the mortal realm without this woman?</p><p>\"Goodbye, my love,\" she said, and died in his arms. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She was dead. Kadence was dead. And there was nothing he could do to save her. He knew it as surely as he knew he would take his next breath. An unwanted, hated breath. Those stinging tears slid down his cheeks, mocking reminders that he lived - and she did not.</p><p>She had wanted his help to save the wall, to save her. She had wanted his help to keep the Demon Lords inside hell, yet he had failed her on all counts.</p><p>\"I am so sorry, Geryon.\"</p><p>At this newest sound of her voice, he blinked. What the - as he watched, her spirit began to rise from her motionless body. Hope fluttered inside his chest. Hope and joy and shock. Her body was destroyed, but her spirit would live on. Of course. He should have known. Every day he encountered such spirits, though none had been as pure as hers.</p> <p>He pushed to his feet, facing her, heart drumming madly. She smiled sadly at him.</p><p>\"I'm so sorry,\" she repeated.</p><p>\"Why?\" When he'd never been happier? She was here, with him. \"You have nothing to be sorry for.\"</p><p>\"I failed you. Had you been stationed at the gate as you had wanted, this would not have happened.\"</p><p>\"That isn't so. The demons would have ruined the wall, and thereby ruined you, but I would not have had the opportunity, no, the pleasure, of bonding with you. I cannot regret what happened.\" Not anymore. Not with her spirit just in front of him. \"What of the demons?\"</p> <p>\"I suppose the gods will attempt to gather them, bemoaning me as a failure forevermore.\"</p><p>He shook his head. \"You are not a failure, love. You did everything within your power to stop them. Most would never even have entered the gates.\" His head tilted to the side as he studied her. She was as lovely as ever, like a dream of her former self. Before her, his life had been a wasteland. A moment without her would have been...well, hell.</p><p>\"Thank you, sweet Geryon. But even if the wall is repaired, even if the demons are somehow captured, I fear the gods will be unable to contain those demons here.\" She sighed. \"They will always fight to escape.\"</p><p>\"The gods will find a way,\" he assured her. \"They always do.\" He reached out to hug her to him, but his hand misted through her and he frowned, some of his happiness draining. Touching her was a necessity; he would not be able to live without her warmth, her softness.</p><p>That's when realization hit him. He closed his eyes for a moment, steeped in quiet agony. \"You are free, Kadence. Free from hell, free from the gods' commands. You can go anywhere you desire, do anything you wish.\"</p><p>\"Yes. But I do not have you.\" Tears filled her eyes. \"I will leave you and wander the earth alone,\" she said with a firm shake of her head. Those tears splashed onto her cheeks. \"I know gods and goddesses are allowed to choose where they wish to reside in the afterlife, but I have no desire to return to heaven or stay in hell. Unless...are you staying here? Would you like me to stay with you?\" she asked hopefully. \"If you would rather not have me, a being you cannot ever hope to feel, I will understand, but...\"</p> <p>As she spoke, an idea sprang into his mind. A wild idea he did not discard, but rather embraced. \"When I bonded to you, it was forever and another eternity. I will not give you up now.\"</p><p>\"But you will never again be able to touch me. You will never - \"</p><p>\"I will. I promise.\" And with that, he sank his own poisoned claws into his chest, felt the toxin burn him, blistering, scorching. He screamed at the anguish, black winking over his eyes.</p><p>When the pain eased, the blackness faded. His eyelids fluttered open and he saw that his body was gone, a pile of ash, his spirit floating beside Kadence. So many times over the centuries, he'd considered taking just such an action. Anything to end the monotony of his existence. But he had clung to life, for Kadence. To see her, to imagine caressing her and hope for the chance.</p><p>Now, that chance was a reality.</p><p>\"I, too, am now free,\" he said. \"Truly free.\"</p><p>\"You gave up your life for me,\" she sputtered through tears - and a grin she could not hide.</p><p>\"And I would do it again.\" He jerked her into his arms, grinning, too, because he could feel her again. \"You are my everything. I am lost without you.\"</p> <p>\"I love you so much,\" she said, raining little kisses all over his face. \"But whatever will we do now?\"</p><p>\"Live. Finally, we will live.\"</p><p>And they did.</p><p>When the gods realized that the wall between earth and hell had been breeched and a horde of Demon Lords let loose upon earth, they sent an army to repair the damage - but no one could catch the fiends. And even if they could, the gods knew that locking them back inside hell would merely invite another rebellion.</p><p>Something had to be done.</p><p>Though the stone barrier had fallen, the goddess of Oppression's body was still bound to the wall of hell. And so the gods built a box-sized prison from Kadence's bones, confident that the powers she had tapped into hours before her death still resided deep in the marrow.</p><p>They were proven right. Once opened, the box drew the demons from their hiding places, holding them captive as even hell had been unable to do.</p><p>The gods were pleased with their handiwork. If only they had not given the box to Pandora for safekeeping...but that is a story for another time. </p> </body></html>"]