["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Irish countryside, 1808</p><p>I walked along the path</p><p>that night, as I often did. Bone- tired from working in my father's fields, coated in a layer of good Irish soil spread fine on my skin and held fast by my sweat. My muscles ached, but 'twas a good sort of pain. The sort that came of relishing one's own strength and vigor. Of late, I hadn't done so any too often. I'd been taken with bouts of weakness, my head spinning sometimes until I passed out cold as a corpse. But today hadn't been like that at all.</p><p>Today I'd felt good, certain whatever had plagued me was gone. And to prove it I'd worked like a horse in Da's fields. All the day through I'd put my brothers and cousins through their paces, darin' them to keep up with me, laughing when they couldn't. And I'd kept on wielding my hoe long after the others had called it a night. So 'twas alone I was walking.</p> <p>Autumn hung in the air, with the harvest beneath it and crackledl under my feet and sent their aromas up to meet me as ll walked by the squash patch, with its gray-blue hub bards asl big as Ma's stew pot, and orange-yellow pumpkins clingingi to their dying vines. We'd have to gather them in tomorrow. Gram said there would be a killing frost before nextl Sabbath. A killing frost. A little chill snaked up the back of my neck as the words repeated themselves, for some reason, in my mind. Foolishness of course.</p><p>I'd spent too many nights as a lad, curled! on a braided rug before the hearth listenin' to Gram spin I her yams. This time of the year, her tales tended toward i the frightening, with ghosties and ghoulies her favorite subjects. I supposed some of those tales had stuck in my mind. I Though a man grown now, and all of twenty years plus three, I still got the shivers from Gram's tales. The way her : voice would change as she told 'em, the way her ice-blue \" eyes would narrow as if she were sharing some dark secret while the firelight cast dancing shadows on her dear careworn face.</p><p>\"Twas a night just like 'this one, boy. When all seemed peaceful and right.</p><p>But any fool ought to know better than ^ to walk alone after dark during the time of the harvest. For the veil between the world of the living and that of the dead is thinning... and parting... and... \" Hush, Gram,\" I whispered.</p><p>But a chill breeze caressed my neck and goose bumps rose there to mark its passing. I thrust my hands into my pockets, hunching my shoulders, walking a little faster. Something skittered along the roadside, and my head jerked sharply to the right.</p> <p>\"Only the wind,\" I said, and then I began to whistle. Any fool ought to know better. Are you a fool, Donovan O'Roark? I shook myself and walked still faster. There were eyes on me. someone watching from the crisp, black night. Or perhaps something. A wolf or even an owl. I told myself 'twas nothing, that I'd no reason to fear, but my breath began to hitch in my throat before puffing out in great clouds, and my heart to pound too quickly.</p><p>Then the dizziness came.</p><p>The ground buckled and heaved before me, though I know it never truly moved at all. I staggered sideways, would have fallen into the weeds along the edge of the path, had I not managed to brace my hand against a nearby tree.</p><p>Palm flat to the warm, soft trunk, head hanging low, I fought to catch my breath, to cling to my consciousness.</p><p>The tree spoke.</p><p>\"Alas, boy, I thought to wait... but I can see the deed must be done tonight.\"</p> <p>I jerked my head up, then snatched my hand away, not from a tree, but from a man. Yet. not a man. His dark eyes swirled with the endless black of the very night, and his hair was black as soot, gleaming to midnight blue where the moon's rays alighted. His lips, cherry red, and full. Yet the pallor of his skin shocked me. Not sickly-looking, not like death. But fair, and fine, as if he were some fine work of art chiseled of pale granite. As if he were a part of the moonlight itself.</p><p>I took a step backward, leaves crunching, the breeze picking up to tease my hair. The wind grew stronger all of a sudden. almost as if it knew something dire was about to take place this autumn night. . the veil between the world of the living and the world of the dead is thinning.</p><p>parting. I backed away more quickly.</p><p>The creature only shook his head.</p><p>\"Don't try to run. It will do you no good.\"</p><p>\"Who are you?\" I managed.</p><p>\"What do you want with me?\"</p><p>His smile was sad, bitter.</p> <p>\"Many things, Donovan. Many things. But for now... just the one.\" He reached out, though I never saw his hands move. They were simply there before him one moment, moving expressively as he spoke--and in the next instant they clasped the front of my homespun shirt. I struggled against him, but he pulled me easily to him, and my fighting amounted to nothing at all. I am not a small man, nor a weak one, despite my recent illness. I stood fully a head taller than my da, and half that much above any other man in our village. My shoulders were broad and well formed by a lifetime of hard work. I'd never met a man I wasn't certain I could whip, should the need arise.</p><p>Yet this one, this thing, dragged me to him as if I were a child.</p><p>Closer, inexorably closer, even as I twisted and tugged and fought for my freedom. He bent over me. Fear clutched at my heart, nearly stopping its frantic beat. Pain shot out through my chest, and down my left arm, and I couldn't draw air into my lungs.</p><p>Then I felt his mouth on my neck. lips parting, and the shocking pain as his teeth sank deeply into the skin of my throat, piercing me. Pain that faded almost as quickly as it appeared. And as it faded, so did everything else.</p><p>Everything around me, from the soft singing of the crickets to the smell of the decaying leaves. I no longer felt the chill autumn air. There were three things of which I remained aware, three things that filled all my senses. Darkness.</p><p>Silence. And the feel of his mouth on my throat, draining the very life from me.</p><p>Then even those things disappeared.</p><p>\"Donovan! Donny-boy, wake up! Wake up!\" Someone shook my shoulders.</p><p>Da's voice shouted in my ears, sounding like it never had. Raspy, panicky, afraid. There was a taste in my mouth, salty and rich. I wiped my lips with the back of my hand, as I fought to open my eyes. When I looked at my hand, I saw blood, glittering in the moonlight. What had I done? What.</p><p>Da scooped me up into old arms that shouldn't have had the strength to lift me. And staggering under my weight, he carried me toward the village, shouting for help. It was only moments before others came, my neighbors, my friends. Alicia with her flowing auburn curls and cat's eyes as green as Ireland itself, the girl I dreamed about at night. My ma, and sisters. My body was jostled as neighbor men relieved Da of the burden, and bore me swiftly into my home. They lowered me to a pallet, while Ma shouted questions. But no one could answer her. No one knew what had befallen me out there on the path this night. Only me, and one other soul. A monster, a creature of nightmares and Gram's tales.</p><p>Gram. Gram would know what had happened, what this meant. I listened for her voice among the others, but it was a long while before I heard it. And its grimness did nothing to reassure me. \"It can only be evil,\" she all but whispered. '\"Tis the Eve of All Hallows.</p><p>Foolish lad, out walking alone tonight of all nights! \" Ma hushed her impatiently, but I saw the way she stiffened at Gram's words. She snatched up a lamp, elbowing the men aside and leaning over me as if to see for herself. Then Ma gasped and drew slightly away, her loving eyes going wider.</p><p>\"Lord a' mercy, there be blood on his lips.\"</p><p>\"Aye,\" Da said.</p><p>\"But what does it mean?\"</p><p>My mother said nothing. Gently, her hands pushed my shirt aside as she searched for injuries. I forced my eyes to remain open, though sleep. Or is that death?</p><p>called to me, drew me closer just as the stranger had done. I couldn't fight much longer.</p><p>Ma looked down at me, fear growing large in her eyes, though I could see her trying to keep it concealed from me.</p><p>\"You'll be all right, my boy. I'll see to that. You'll be\" -- As she spoke, she pushed my hair aside.</p><p>\"Twas long, my hair. Hung well past my shoulders, thick and darkest brown.</p><p>My Ma lifted the heavy locks, and her eyes changed.</p><p>As if the light of love flickered. a guttering candle. She snatched up a cloth, muttering a prayer in the old language as she dabbed the blood away from my throat with' one hand and lifted her lamp higher with the other.</p><p>And then my mother screamed.</p><p>\"Devil! Demon spawn! Get the children out of this house, 'tis the mark of Satan!\"</p><p>I felt my eyes widen as her face turned hateful. I lifted a hand toward her as she backed away.</p><p>\"Ma, what's wrong with you?</p><p>\"Tis me, your son, Donovan\" -- But she shook her head, her eyes fixed to the place on my throat where that creature had feasted, and she continued to back away.</p><p>\"Die, Lucifer,\" she whispered to me. Her son, her firstborn. And I couldn't believe she said it, couldn't believe the hatred in her eyes.</p><p>\"You're not my son, nor worthy to be there in his poor body. Die, or I vow I'll kill you myself.\"</p><p>I'd been fighting to hold on. But her words. the shock they sent through my body. twas all it took to shake my tenuous grip on life.</p><p>And I sank into darkness. Into death.</p><p>This time, the darkness lasted longer, though I was never aware of the passing of time. I only knew I felt clean when I began to surface toward life once more. My body, my clothing. were fresh. I smelled of heather and honeysuckle. The clothes I wore were not the scratchy, rough weave I wore every day, either. Ma had dressed me in a fine suit of clothes she'd made for me herself, and only allowed me to wear on the most important occasions.</p><p>I heard voices, smelled the familiar scent of tallow candles and lamps. And flowers. So many flowers. Someone played a fiddle, drawing the bow 'cross the strings in a slow and mournful wail. I heard the clink of glasses, and smelled good beer, and food. Slowly, I managed to get my eyes open.</p><p>I never should have done that. For I found that I lay in a coffin.</p><p>Homemade, likely by my da's own hand. The coffin had been set upon a table at 0\"Connor's tavern. Women walked past, heads low, tears damp on their cheeks. Men stood still, drinking beer from tin tankards.</p><p>Sean Ryan stood in a corner with his fiddle tucked under his chin, eyes closed. Alicia, the girl I'd often kissed when her da wasn't looking, sat by herself in a chair, staring straight ahead, but seeing nothing.</p><p>Father Murphy stood up front, right beside the coffin, his back to me, his prayer book opened, and by clearing his throat he got everyone to look his way.</p><p>\"Donovan O'Roark was a good man, but evil struck him down in the prime of his youth...\"</p><p>Lord a' mercy, they were givin' me a funeral!</p><p>\"No, Father,\" I cried as loud as I could manage.</p><p>\"I'm alive... Da, Ma, I'm...\" I struggled to sit up.</p><p>Someone screamed, and then the room went dead silent. Father Murphy faced me, white as a specter, wide-eyed as he crossed himself. Alicia leapt to her feet and shouted, \"Kill it! Kill it before it destroys us all!\"</p><p>\"No!\" I cried.</p><p>\"I'm not evil!\"</p><p>\"Tis me, Donovan O'Roark ... won't someone listen...?\"</p><p>\"Get the women and children out,\" Father Murphy shouted, and for the first time I thought he sounded like some mighty prophet of old. His voice fairly shook the walls. Or perhaps 'twas my hearing that was altered, for indeed it seemed every voice was sharper, clearer to me. And the fiddle. No time to dwell on that now, for my best friend Sean and some of the other young men began urging the women out of the tavern. My ma stayed behind, glancing at me, then at my da.</p><p>\"You know what must be done.\"</p><p>Da nodded, and Ma fairly ran from the room then.</p><p>I braced my hands on the sides of the coffin, making as if to get myself out, thinking how they'd all laugh once they realized how foolish they were being, and-- Da shoved me back. Hard. Cruel. Never had he handled me so roughly.</p><p>I blinked in shock. Then froze--literally felt the ice creeping through my veins--as I saw Father Murphy take a wooden stake from somewhere nearby, muttering, \"Your wife was right, O'Roark. Tis good we were prepared for this.\" He pressed the tip of the stake to my chest, and my da, my own beloved da, handed him the mallet.</p><p>From outside I could hear my mother sobbing softly and the girl I planned to marry one day shouting \"Kill it! Kill it now!\" Father Murphy lifted the mallet.</p><p>I don't know where the strength came from--or, I didn't know then. I suppose I blamed it on panic or fear, rather than anything preternatural. But when I shoved against the hands that held me--my father's hands--I felt little resistance. I surged from that coffin with the force of a tidal wave, and landed on my feet beyond the two of them. My trusted confessor and my flesh-and-blood sire. My would-be executioners.</p><p>\"Da, how can you do this? What have I done to deserve\" -- \"He's not your son,\" Father Murphy said.</p><p>\"He's evil, the same evil that took your son away. Do not heed him.\"</p><p>\"But I am your son! Da, look at me!\"</p><p>Da turned away.</p><p>\"Get thee behind me, Satan.\"</p><p>\"Da, 'tis me, your firstborn...\"</p><p>He faced me again with blood in his eyes. Yanking the stake and mallet from the priest's hands, my father surged at me, and suddenly there was no doubt in my mind he meant to do murder. I spun away and ran. Out the front door, the only door, and right through the midst of that crowd of mourners who'd called themselves my friends. My family. My woman.</p><p>\"Get it!\" someone cried.</p><p>\"It mustn't escape!\"</p><p>And I fled. Shoving them aside easily, I ran, faster than I'd known I could run. I heard the pursuit. Some had fetched dogs, others had mounted their horses. I saw the flickering of yellow-orange torchlight coming closer as I ran for my very life. And they kept coming.</p><p>Someone yanked me off my feet and into the bushes alongside the path.</p><p>I looked up, and saw the creature who'd brought all of this upon me, and I opened my mouth to curse his very existence. He easily covered it, stilling me and drawing me deep into the cover of the greenery. A second later the mob thundered past, shouting and cursing me, promising to destroy me in the most horrible ways imaginable. Calling me \"Satan.\"</p><p>My captor no longer needed to hold me still, for I had no will to move. I relaxed to the ground, lowering my head as tears burned my eyes. My pursuers were gone. My assassin remained, but I no longer cared.</p><p>\"Kill me if you will,\" I offered.</p><p>\"I've no reason to wish to live.\"</p><p>\"You have it all wrong, Donovan,\" he told me, and gripping my arms, he pulled me to my feet. Strong hands, gripping me hard, but no pain as a result.</p><p>\"You were dying before. The weakness, the dizziness, the blackouts.\"</p><p>I looked up sharply.</p><p>\"Oh, yes, I've been watching you. You'd have been dead within a few more days, at most. But you.. you didn't want death.\" He lowered his head, shook it.</p><p>\"Rarely have I come upon a man as vividly alive and in love with life as you, my friend.\" I frowned, shook my head.</p><p>\"Then why did you try to kill me?\"</p><p>\"I wasn't trying to kill you, Donovan. I was giving you life. You'll never die now. You can't.\"</p><p>\"I ... I can't...?\"</p><p>\"Well, there are ways, but... listen to me, lad. I took your blood, drained you to the point of death. And then I fed you from my own veins and filled you once again. It's how the dark gift is shared, how it's given.\"</p><p>\"Dark gift. I don't know\" -- \"Immortality,\" he told me.</p><p>I stood there, blinking in confusion and staring up at this man. His dark head silhouetted by a Halloween moon, and bordered by the clawlike, leafless branches of slumbering trees. A pumpkin patch at his back. An owl singing of my death in the distance. And I think I sensed then, finally, just what he was about to say. \"My name is Dante, and I am a vampire.\"</p><p>I gasped, but he took my hand in a firm grip and shook it. \"Your name is Donovan,\" he told me, patient as if he were a teacher instructing a slow student.</p><p>\"And as of tonight, you are a vampire, too.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rachel Sullivan waltzed into O'Mallory's pub as if she'd never been gone, and ignored the hush that fell as she passed. Glasses stopped clinking, men stopped spinning their yams. Eyes followed her when she sashayed to the back of the room and snatched a white apron from a hook.</p><p>Behind the gleaming mahogany bar, Mary folded her arms over her plump middle and smiled. Rachel tied the apron on and turned around, eyeing the round, wooden tables and the familiar faces at each one.</p><p>\"An' what's got you all so tongue-tied?\" she asked, tossing her head.</p><p>\"I told you I'd come back, and now I have. So stop your gaping and drink your ale.\" She turned briskly back to the bar, snatching up a tray with two foaming pints on it, and then unerringly spotted the pair who had empty glasses before them, and delivered their refills.</p> <p>The talk started up again. Mostly directed at her now. Unshaven men who'd known her father, welcoming her home. Curly-headed women asking her about the States as she hustled back and forth with her laden tray. For the first time in what seemed like a long time, Rachel released a long, cleansing breath, and felt the tension drain from her spine.</p><p>She -was home, truly home. And it felt good. Better than the degree she'd worked so hard to earn. Better than anything had since. since before she'd left.</p><p>She'd been afraid, half expecting the locals to be wary of her now, but the rapid return to normalcy in the pub told her that fear had been unwarranted.</p><p>The people of Dun- kin ny didn't like outsiders, that much was true. Oh, tourists occasionally found their way to the isolated village, particularly the ones with Irish surnames out to discover their roots. The locals were polite enough, but always reserved. Wary. Rachel, though, had been born and raised here.</p><p>Orphaned here, and taken under the collective wing of these villagers.</p> <p>They'd been sad when she'd left them, but not angry. With one exception--Mamey Neal, who'd been so determined to marry her. But he wasn't here tonight, she noted with relief. And the others welcomed her back into their midst without a second thought. Eight years away, but they didn't see her as an outsider. \"Welcome home, Rachel.\" Mary, who'd owned this place and the boarding house attached to it for as long as Rachel could remember, hugged her hard, slapping her back with enthusiastic blows.</p><p>\"I've kept your old room for you. I can already see you'll be takin' your old job back.\"</p><p>Rachel didn't have the heart to tell her it was only for a short time. Only until she got her thesis written, the final step in earning her doctorate.</p><p>And then she'd. What? Become the world's leading social anthropologist? Teach at an Ivy League university in the States?</p><p>She closed her eyes and inhaled the scent of Russell Fin- negan's stale pipe smoke, fresh beer, and the sheep manure on Mitch Marley's boots. When she opened them again, she faced the window, and stared out at the worn track that passed for a road in this tiny village, and the rolling emerald hills, and the crumbling castle--Castle Dante--in the distance. It stood amid a ghostly mist as haunting as the tale that went along with the place--the tale she was basing her thesis on.</p><p>Beyond the castle were the cliffs, and the green-blue sea far below.</p> <p>And that was the other reason she'd come back. To see that castle one more time.</p><p>As a child, she'd believed in the tales. But in her heart, she'd never accepted the villagers' condemnation of the men who'd once lived there. One of them, she swore, had come to her. Twice in her childhood she'd met him, or so she'd believed for a long time. The first time had been when she'd nearly drowned in the river one night long ago. A dark stranger had pulled her from the water, breathed into her lungs, cradled her gently until others arrived, and then disappeared before she'd even had a chance to thank him.</p><p>The second time was after her parents' deaths, when she'd lain awake and afraid in her bed, unable to sleep, feeling more alone than any being ever had. He'd come to her, held her hand, and told her she wasn't alone at all.</p><p>That she had a guardian who would watch over her, protect her always, and that she must never fear. She'd barely seen his face in the darkness, but in her mind, she'd believed him to be Donovan O'Roark, or his ghost. And she'd loved him.</p><p>Always, she'd loved him. Even later, when she'd realized her childhood memories were only dreams, and that there were no such things as vampires, she'd nurtured a tender place for the fictional legend in her heart. And while she was home, she'd visit that castle once more. perhaps just to assure herself that he wasn't truly there, awaiting her return.</p><p>She'd been home for two weeks when he came. The air was brisk, with the cold taste of winter on its f the pub were propped open all the same, to let the pipe smoke out and the fresh air in. And the fire snapping in Mary's cobblestone hearth kept the chill at bay.</p><p>When the silence fell this time, it was uneasy, rather than the friendly hush that had fallen upon Rachel's unexpected return. Then, she'd felt the smiling eyes, the welcome. Now she felt a fris son of something icy slipping up her spine. And when she turned to follow the curious gazes, she saw the stranger walking along the darkened road.</p><p>He paused, and stared off in the distance, toward the dark hulking silhouette of the castle. Mitch Marley gasped. Rus- sell Finnegan gaped and his pipe dropped from his lax mouth to the table, unnoticed.</p> <p>The tension that filled the room, filled her, was ridiculous, and unnecessary.</p><p>\"I'd forgot,\" she muttered, \"just how superstitious you all are. Look at you, gawking at that fellow as if he's Donovan O'Roark come back from the dead!\"</p><p>Mary crossed herself.</p><p>\"You saying you don't believe the old tales now that you're educated, Rachel Sullivan?\"</p><p>\"Old tales are just that. Old tales. Nothing more. I'll prove it, too.\"</p><p>Rachel stepped into the open doorway, hands braced on either side, and leaned out.</p><p>\"I don't know where you're going, stranger, but if it's food and a warm bed you're lookin' for, you won't find it anywhere but here.\"</p><p>\"Lord preserve us from that saucy girl,\" Mary murmured. \"Feisty as she ever was,\" someone agreed.</p><p>But Rachel ignored them, because the man was turning, looking at her.</p><p>It was dark tonight, no moon to help her explore his face. She could only see dark eyes gleaming the reflection of the soft, muted light spilling out of the pub. Firelight and lamp glow. Mary detested bright electric lights at nighttime, though Rachel often suspected it was the bill she truly disliked.</p><p>\"Come inside,\" Rachel said again, more softly this time because she sensed he could hear her very well.</p><p>\"Warm yourself by the fire. And show these friends of mine that you're not the monster from their favorite folktale.\"</p><p>I stood there, stunned to my bones. Amazed first that she'd spoken to me at all, for I knew the people of Dunkinny to be a superstitious lot, un trusting of strangers. Or they had been when I'd first left here, nigh on a hundred years ago, and they had been so still each time I'd returned since.</p><p>But people in solitary villages like this one never tend to change overmuch.</p><p>She was different, though. She'd always been different.</p><p>I fancied it ironic; I'd been one of them once, and that wariness, that mistrust of strangers, was still with me. But I'd been betrayed too often to let it go. It was, in fact, stronger than ever. So then, why did I stop?</p><p>Why did I turn and look at her when she spoke to me, when my natural reaction would have been to keep walking, never so much as pausing in my gait.</p><p>But I did pause. Partly because of her voice, pure and silken, with the lilt of Ireland, of this very village to it. So familiar and dear to me, that accent. And frightening at the same time.</p><p>\"Twas the voice of my own people, the ones who'd called me evil and tried to kill me.</p><p>The ones who'd later murdered the best friend I'd ever had. But 'twas also the voice of the little girl I'd watched over long ago, but grown up now.</p><p>And somehow, still the same.</p><p>She spoke again, her tone haughty, mischievous, almost taunting. And then I looked, and saw her silhouetted in the doorway, surrounded by a golden glow. Raven hair, long and wild. I'd seen Gypsies less mesmerizing.</p><p>She held out a hand to me.</p><p>\"Come,\" she said.</p><p>And as if her words held some sort of power over me, I went. She clasped my hand as soon as I came within reach, and she drew me inside. She had long sharp nails. Red nails. I liked them, and the warmth of her small, strong hand. And the tingle of sensual awareness I felt passing through her body.</p><p>I liked that, too. Knew better than to indulge it this close to what would soon be my home. again. But liked it all the same.</p><p>Over the years, I had changed, but not drastically. My skin was paler, yes.</p><p>It hadn't felt the touch of the sun in nearly two centuries, after all. But its pink, healthy glow remained intact for several hours once I'd fed.</p><p>And I'd fed well tonight.</p><p>So when she drew me inside, there were no gasps of shock at my appearance.</p><p>She settled me into a wooden chair near the fire, and that's when I realized this pub was in the exact place that other one had stood long ago.</p><p>O'Connor's tavern. The site of my funeral. The place where my father had tried to murder me.</p><p>A lump came into my throat, but I forced it away. \"There, you see?\"</p><p>the girl was saying, hands on her hips, which moved enticingly whenever she did. She waved a hand toward me.</p><p>\"Just a tourist, not a legend come to life.\" She faced me again.</p><p>\"Tell us, stranger, what's your name?\"</p><p>I cleared my throat.</p><p>\"O'Roark,\" I said, waiting, curious to see their reactions.</p><p>The plump woman dropped a tankard of ale and it crashed to the floor, spewing amber liquid and odorous foam around her feet. The girl stared at me, searching my face with an intensity that shook me. But she couldn't recognize me. She'd never seen my face clearly enough to know it again now.</p><p>And finally she grinned, a twinkle in her eye, and tilted her head to one side.</p><p>\"O'Roark, is it? Another one? Tell me, Mr. O'Roark, have you come travelin' from the States in search of your family history?\"</p><p>I smiled very slightly, unable to help myself. Such a spirited girl, she was.</p><p>\"Has my accent faded so much that I sound like an American to you?\" I asked her.</p><p>She gave me a sassy shrug.</p><p>\"I only know you're not from Dunkinny. For I know everyone in this town.\"</p><p>\"You've lived here that long, have you?\"</p><p>\"Born here, as were my parents and theirs before them for five generations.\"</p><p>\"Mine, too.\"</p><p>She frowned at me, and I took my time studying her face. Small features, fine bones. But her lips were full and her eyes large in that small face.</p><p>\"You're saying you're descended from our O'Roarks?\"</p><p>\"So much so that I've inherited the castle.\"</p><p>At last, I'd shaken her. The others had been uneasy from the moment I'd set foot inside, but not her. Now, though, I saw it. The widening of her deep green eyes, the loss of blood's glow in her cheeks.</p><p>\"You're making it up,\" she accused, but softly.</p><p>I shook my head.</p><p>\"He'll be wantin' to know about the legend then,\" Mary called. \"Aye, tell him the legend, Rachel! Stranger he may be, but no man ought to risk dallying about that place un- warned.\" Rachel. She'd grown into the name.</p><p>A name as untamed and tempting as the woman she'd become.</p><p>She tilted her head to one side.</p><p>\"He already knows,\" she ventured, studying me, watching my every reaction.</p><p>\"How can you be sure?\" I asked her.</p><p>\"Tell me, Rachel. What is this legend that seems to make everyone here so I nervous? Every one... but you, that is.\" She recovered quickly, regaining the bounce in her step as she snatched two steins of ale from the bar, and brought them to the table. One, she thumped to the table before me.</p><p>The other, she drank from deeply, before wiping her mouth with the back of her hand and leaning back in the chair she'd taken.</p><p>Behind her the fire snapped and danced.</p><p>\"Long ago Donovan O'Roark, a farmer's son loved by all, was walking home from the fields. Alone, he walked, and well after dark, on the Eve of All Hallows.\" I got a chill up my spine, and was reminded, briefly and vividly of my gram, and the way she'd spun her tales before the fire at night. Tales I'd never believed in.</p><p>\"But poor Donovan never made it home unscathed that night, for a creature attacked him.\" She paused, looking around the room. I did likewise, seeing the rapt attention on every face--though they'd likely all heard the tale a hundred times by now.</p><p>\"A vampire,\" she said in a long, whispery breath.</p><p>I lifted my brows high, an attempt to show them my skepticism.</p><p>\"A vampire,\". I repeated.</p><p>\"Indeed. The young man died that night, but he didn't stay dead long.</p><p>He rose from his casket at his own funeral! No longer mortal, but a creature like the one who'd created him. The villagers tried to kill him, but he was too strong, and he escaped into the night and vanished. \"</p><p>I lifted the mug to my mouth, pretending to sip the beer, and licking the taste of it from my lips when I set the glass down again.</p><p>\"I still don't see what this has to do with the castle. \"</p><p>\"Ah, so you're an impatient one, are you?\"</p><p>I only shrugged and let her continue.</p><p>\"Donovan wasn't seen again. Not for a hundred years. But everyone knew his tale. Then, something happened. The lord of that castle,\"</p><p>here she pointed in the castle's general direction, \"was a rich Italian man, some said a nobleman. His name was Dante. Now how do you suppose his castle ended up in the hands of the family O'Roark?\" I smiled and said nothing.</p><p>Rachel went on.</p><p>\"No one had ever suspected Dante of anything evil. He simply kept to himself, and that was the way the villagers liked it.\"</p><p>\"He being an outsider, and all,\" I put in.</p><p>She gave me a curious glance.</p><p>\"One night a young girl, who'd been hired to work sometimes at the castle, came running down from the cliffs, hysterical. Screaming and crying, she was. With blood runnin' down her neck in twin streams, and two tiny punctures in her pretty throat.\"</p><p>I didn't interrupt her, though the words near choked me trying to escape.</p><p>Dante had never harmed the girl. He'd adored her, loved her to distraction, and in the end, done the one thing he'd warned me over and over never to do.</p><p>He'd trusted her.</p><p>Rachel sipped her beer.</p><p>\"The girl said Dante was a monster who slept in a coffin by day, and fed on livin' blood by night. He'd attacked her, tried to drain her dry, but she'd got away.\"</p><p>\"Did anyone wonder,\" I asked, unable to keep still any longer, 'how a young thing like that could get away from a creature like him? \" She frowned at me.</p><p>\"You want to hear the rest or not?\" I nodded. She spoke.</p><p>\"The girl said Dante wasn't alone up there. She said he had another with him, and that companion was none other than Donovan O'Roark.\"</p><p>Around the room everyone nodded, muttering in agreement. \"The villagers discussed what needed to be done, while young Laura begged them to destroy the monsters. Finally, they agreed. At just before dawn they marched to the castle armed with torches and oil, and they set the place alight.\"</p><p>When she said it, I thought she suppressed a shudder.</p><p>I remembered it all too well. The flames, the sickening realization that the woman Dante had loved had betrayed him in the worst possible way. His pained expression as he realized it, too. I knew that pain so well, because I'd felt it when my own family, and the girl I'd loved, had done the same to me.</p><p>\"The vampires were forced to flee, and when they did, the sun was already coming up. And the castle has been owned by an O'Roark ever since.\" She stopped. I felt her hand on my arm.</p><p>\"Mister O'Roark?\" I opened my eyes, just realizing I had squeezed them shut.</p><p>\"Are you all right?\"</p><p>\"It... it's a frightening tale. Gruesome.\"</p><p>\"But just a tale, as I've been trying to tell these good people.\" I nodded.</p><p>\"Go on, finish it. What became of the two victims?\" She tilted her head.</p><p>\"Victims?\" Lowering her gaze, her voice softer, she said, \"I never thought anyone else would see them that way. But you're right, 'tis exactly what they were.\" She met my eyes again, her voice more normal.</p><p>\"At any rate, they ran off in separate directions, but smoke could be seen curling from their clothes as they went. The villagers believed they both died, burned to cinders by the sun.\" She shook her head, almost sadly.</p><p>\"But not long after that, a crew of men arrived to begin working on the castle, and when they were questioned they would only say a man named O'Roark had hired them. The villagers believed it was Donovan, back from the dead a second time. They all said he'd return one day to seek vengeance on the people of Dunkinny for the murder of his friend.\"</p><p>She sighed deeply, and for a long moment no one spoke, still under the spell of her story. But Rachel broke the silence a moment later.</p><p>\"I'm sure most of the locals are speculating as to whether you be him. Tell them your given name, O'Roark. Ease their superstitious minds.\"</p><p>I smiled very gently, and laid money on the table to pay for my unfinished beer. Then got to my feet and turned for the door.</p><p>\"My given name,\" I said softly, \"is Donovan.\" And then I stepped into the night, away from all of them and the dread on their faces. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Someone was following me.</p><p>I slowed my pace slightly, keeping to the shadows, moving in utter silence.</p><p>My mind open, probing, tracking the curious fool. Only one.</p><p>No threat to me.</p> <p>I never should've done it; taunted them the way I did. I knew better, and to this day I've no idea what possessed me to tell them my name, watch them go pale, and then walk away. I'd frightened the fools, deliberately frightened them. But it was no less than they deserved.</p><p>They'd built themselves up a hefty debt over the generations. Turning on one of their own the way they'd turned on me so long ago.</p><p>Murdering Dante. I paused along the roadside where the heather bloomed its last and its scent was heavy in the air, lowered my head as the pain swept over me along with the autumn wind. They'd surrounded the castle, and brutally put their torches to our home, our sanctuary, forcing us to run for our lives. But we'd only found the rising sun awaiting our desperate flight. Its golden rays, so beautiful, so deadly. I remember the searing, the blistering of my flesh, the horror that surged within me as I saw thin tendrils of smoke rising up from my own body. I'd been the lucky one that cold morn. By burrowing deep into a haystack in a field--a field I'd once worked at my father's side--I found shelter. But for Dante. knew him to be dead. For I never saw him again after that day, and I've no doubt he'd have contacted me somehow if he'd survived.</p><p>Lifting my head, I sent my senses out, realizing that in the flood of memories this place evoked, I'd lost track of my follower. But the stalker had stopped as well, and stood now several yards away, just watching, and thinking herself protected by the darkness. I almost smiled at her innocence, turned, and began walking again, wondering how far her courage would take her.</p><p>I'd left this place after the attack. Traveled, saw the world, lived in so many places I barely remember them all. But of people, of others like myself and mortals the same, I saw little. I can list the name of every person I've ever had words with in the past two hundred years, and that's how few they've been.</p> <p>Dante drilled it into me, again and again.</p><p>\"Trust no one, Donovan. No one. And most especially, no mortal.\"</p><p>I could hear the sea in the distance now, and the road ran away from the farmers' fields and began to slope sharply upward, among rises too steep, and far too rocky, to be tilled. She was still following.</p><p>So long as we'd lived by Dante's words, we'd been fine. A lonely life, it was. But safe, peaceful. Satisfying in so many other ways.</p><p>The time we had, endless time--or so we believed then--to learn of music and art, to read and to write, to experience and to savor the things our mortal lifetimes would never have given us time to know.</p><p>But then Dante had fallen in love, and it had all ended. He'd told the girl the truth, and it seemed to me she must have run all the way back to that ignorant mass of villagers, so eager was she to tell our secret and see us destroyed.</p> <p>Dante had been right from the start. Trust no one, and particularly, no mortal.</p><p>As I crested the hill, the wind blew in from the sea more fiercely, and I loved the feel of it. My wind, my sea. So familiar despite the bitterness I'd known here. I sat down amid a small outcropping of boulders along the roadside. not because I was tired. The castle towered before me, no sign of the fire that had nearly killed me a century ago. Dante had willed the place to me, and I'd had it restored, or partially so. I kept it up, always, ready for his return. I'd long ago given up hope he'd ever come back . but somehow I couldn't let go of this place.</p><p>My good friend was gone, and I was alone in the world. There was no room to doubt that. And yet some foolish sentimental urge had drawn me back here to the very place where he'd been brutally murdered.</p><p>Back to this place, to the castle, to my ancestral home--to her. I'd been drawn to see her again, to assure myself she was still safe and well.</p><p>She was nearly upon me now, the wind whipping her hair into wild chaos. Her eyes narrowing as she squinted into the darkness, trying to see where I'd gone. She thought she was stepping lightly, but I heard every footfall. Not that it would have mattered. She had a scent about her, one that was sharply different from the others--from any other mortal I'd encountered. Dante had told me that some did, and he'd told me what it meant.</p><p>Among other things, vital things, it meant that I was forbidden to harm her. By whose decree, I never knew. Never asked. Besides, I never was much for rules. But I couldn't have harmed her if I'd tried.</p><p>She came closer. Her long skirt snapped in the sea wind, whipping her ankles. Her blouse. sinfully snug-fitting, and molding to her breasts as if trying to squeeze them. She stood there a moment, so close I could feel her there. And after a fruitless search for me, she lowered her head in defeat.</p><p>But still she remained, letting the wind buffet her body, and I do believe she was thoroughly enjoying its vicious embrace. But then she turned to go.</p> <p>I stood slowly, silently.</p><p>\"Are you looking for someone?\" She sucked in a loud, violent gasp, spinning toward me, her hands flying to her chest as if to keep her heart from leaping out. Then she paused, blinking at me in the darkness, drawing several open mouthed breaths.</p><p>\"Lordy, you near scared the life out of me!\" I smiled then. Her accent was no longer as pronounced as it used to be, and I knew that was because she'd been away for a time. But it remained enchanting to me. My own had faded until it was barely discernible anymore.</p><p>\"I was beginning to think,\" I told her, \"that nothing frightened you.\"</p><p>She gave a tilt of her head and a shrug.</p><p>\"Well, it takes a good deal more than an old folktale and a stranger showin' up in the village, claimin' to be a ghost.\"</p><p>\"I never claimed to be a ghost.\"</p><p>\"You said you were Donovan O'Roark.\"</p><p>\"Because I am.\"</p><p>She narrowed her emerald eyes on me. She had witch's eyes, Rachel Sullivan did.</p><p>\"Can you prove it?\"</p><p>My gaze dipped to the pale, slender column of her throat, and impulsively, I put my fingers there and felt the blood churning beneath her skin.</p><p>\"I could...\"</p><p>Her eyes sparkled. It was true, nothing frightened her. She smiled at me, and it took my breath away.</p><p>\"Going' to bite my neck, are you?\" she asked.</p><p>\"If I did, would you run screaming to the villagers, and return with a mob bent on doing me in?\"</p><p>Tipping her head back, she laughed softly, a deep husky sound. Her neck. so close, so smooth. She brought her gaze level with mine, obviously amused.</p><p>\"I'd be more likely to bite you back, Donovan O'Roark, and don't you forget it.\" I could say nothing. She robbed me of words, of the power of speech, of coherent thought, with that flippant reply.</p><p>\"But the proof I had in mind,\" she went on, \"was running more along the lines of paperwork. A driver's license, you know, or something of that sort.\"</p><p>Swallowing hard, I retrieved my wallet from my back pocket, extracted my identification and showed it to her. A man in my position did well to keep things such as these up-to-date, and there were many ways of doing so, none too complex. She took it, her fingers brushing mine, perhaps deliberately.</p><p>She had to squint and finally pulled a cigarette lighter from her deep pocket and, turning her back to the wind, used it to see by.</p><p>Nodding sagely, she handed it back to me.</p><p>\"So you really are a descendant--named for your most infamous ancestor, no less.\" She bit her lower lip.</p><p>\"Is this your first visit to Dunkinny, then?\" She asked it as if trying to hide the question's importance to her. I thought it best not to answer.</p><p>\"Why were you following me, Rachel--it is Rachel, isn't it?\"</p><p>\"Indeed, Rachel Sullivan, with a few notorious ancestors of my own.\"</p><p>The back of my neck prickled to life at the mention of her ancestors.</p><p>Treacherous women, women I'd known too well. She went on.</p><p>\"The Sullivan women are somewhat known for scandals. Perhaps I ought to warn you of that right off.</p><p>\"Twas one of my own who four generations ago screamed accusations against Lord Dante, and got him killed, or so the legends have it.\"</p><p>It was true, Laura Sullivan had been her name. My throat went dry.</p><p>\"An' they say another Sullivan woman was promised to marry Donovan O'Roark himself--the first one, that is. But when he rose from his coffin, she cried for his blood.\"</p><p>\"Yes,\" I said softly, hearing her shrill voice again in my mind, shouting, \"Kill it! Kill it before it destroys us all!\" \"Alicia,\" I muttered.</p><p>\"Really? I never heard her given name before.\"</p><p>I only shrugged.</p><p>\"So have you come to pick up where your forebears left off, Rachel? To destroy me?\"</p><p>She slipped her arm through mine, and turned us toward the castle, walking slowly.</p><p>\"You're a funny man, Donovan. But you know as well as I those are only silly tales. No truth to 'em, or at least, so little 'tis barely recognizable anymore. No, I have a far different mission.</p><p>But I'll be needin' your help. \"</p><p>\"My help?\" She had my curiosity piqued. And yet I feared her. It was too uncanny to be mere coincidence, and a shiver worked up my spine as I wondered if perhaps it was the destiny of the Sullivan women to destroy me--if they'd keep coming, generation after generation of them-- until they saw the task completed.</p><p>And now I was thinking as foolishly and superstitiously as my people.</p><p>\"Tell me of this mission, then. What is it?\"</p><p>She looked up at me and smiled, eyes wide and green as the sea, full of innocence and mischief like the eyes of the child I remembered.</p><p>\"I've come to learn all your secrets, Donovan. All the secrets of Castle Dante, and the truth behind the legend.\"</p><p>My heart tripped to a stop in my chest. My voice hoarse, I said, \"If I told you all of that, pretty Rachel, I'm afraid I'd have to kill you.\"</p><p>Pressing closer to my side, clapping her hand to my arm and leaning her head on my shoulder, she laughed. A husky, deep sound, genuine amusement ringing in its voice.</p><p>\"I do love a man with a sense of humor,\" she said.</p><p>\"I can tell we're going to get along, Donovan. Why, we'll be best friends 'fore we're done.\"</p><p>She was warm at my side, and far too close to me. And I relished her nearness. for the lack of human companionship wears a man down over the years.</p><p>She was here to destroy me. I had no doubt of that. And yet I couldn't bring myself to send her away. She couldn't force me to tell her anything, I told myself. She couldn't learn anything I didn't wish her to know. What harm would it do to let her accompany me to the castle?</p><p>Inside me, I heard Dante's dire warnings: Don't do it, Donovan. Don't spend another second with her. She's dangerous! She's a Sullivan, dammit. Send her away, or kill her now and be done with it. We stopped, the wind blocked now by the towering mass of the castle itself. Before us two massive doors made of broad beams, and held together by black iron bands, stood like sentries awaiting the password.</p><p>\"Ever since I was a little girl, I've wanted to see inside this castle,\" she said, so softly it was as if she were that little girl again, right now.</p><p>\"But my parents forbade it, and filled my head with so many foolish old tales that for a time I was frightened to death of sneaking up here the way the older ones did.\"</p><p>\"For a time?\"</p><p>\"Aye. Later I changed my mind. He was no monster, the man who lived here.</p><p>I crept around this place often, once I'd made up my mind to that. So childish, hopin' for a glimpse of a man long dead.\"</p><p>\"But you didn't go inside?\"</p><p>\"I couldn't. I always felt...\" She drew a deep breath, let it out all at once.</p><p>\"You'll laugh at me.\"</p><p>\"No,\" I said.</p><p>\"I won't. Tell me.\"</p><p>She looked up, right into my eyes, and hers were honest, sincere, beautiful.</p><p>\"I always thought this place seemed... sacred, somehow.</p><p>And. and it was my own blood kin that denied it, ruined it. So to me, my setting foot inside would have been. a sacrilege. \" \" And now? \"</p><p>She eyed the castle doors, shivered a little.</p><p>\"Maybe I was wrong.</p><p>Maybe I'm the one who'll make it all right again, somehow. \" She lowered her head, sighing.</p><p>\"I'm different from the others, you know.\"</p><p>\"Yes, I know.\"</p><p>\"They tell the tale, again and again, and they all shudder with fear of the creatures they claim lived here once.\" She placed a palm against the chiseled stone, closed her eyes.</p><p>\"But not me. The first time I heard the tale I was all of three years old, and I cried. For hours, no one could comfort me. To me, it wasn't a horror story, it was a tragedy. One man, rising from the dead only to be driven out of the village by his own family. Another, murdered only because he dared to love.\" She met my eyes and smiled.</p><p>\"To tell you the truth, back when I was still child enough to believe in the old tales, I thought of your ancestor as... as a friend. My own guardian angel.\"</p><p>\"And now?\" I asked her.</p><p>\"And now I'm an adult, who knows better than to believe in fairy tales. But it does seem like Providence that you're here now. Just when I've returned home from the States. Just when I'm planning to write my thesis based on the legend, its sources, and its effects on the community to this day.</p><p>Just when I'm wondering how I'll ever learn all I I need to know about Castle Dante and the original Donovan O'Roark--here you are. I think it's a sign.</p><p>\" She was enchanting me, mesmerizing me. Both with her scent, and with her beauty, but mostly with that enthusiasm I and charm and slightly skewed view of the universe. J She had the belladonna antigen, and that was part of the ; attraction--had always been drawing me to her, urging me \\ to watch over her. I could smell it in her blood, could sense it there. Every immortal had that antigen before they received the dark gift. If not, they wouldn't trans- form ... they'd simply die. Dante had told me these things, and he'd warned me as well of the allure mortals with the antigen had for us... the attraction. And it was said to run both ways.</p><p>I knew all this. But knowing it did nothing to dampen its effect on me. As a child she'd been harmless, no threat to me at all, just a little girl in need of a protector. But now. She stared up at me from emerald green eyes.</p><p>\"Will you take me inside, Donovan? With you fulfill my childhood dreams and show me your castle?\"</p><p>And like a man held prisoner by a Gypsy enchantress's spell, I nodded, searched for my key, and opened my haven up to my enemy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There was something about him. No, it was only her imagination playing games with her. Yes, he was pale, but only slightly so. And that grace about him, the way his every movement seemed as fluid as a part of a dance. it was simply his way. It didn't mean a thing.</p><p>He wasn't the guardian of her imagination. Her savior. He gripped the iron ring and opened the doors, waiting and allowing her to enter first. Taking a single step into the looming, echoing blackness, she stopped, battling a shiver of unease that kept tickling at her spine.</p><p>\"I can't see a thing,\" she said, reaching into her pocket for the lighter once again.</p><p>She felt him enter behind her. He stood close to her back as she fumbled in her pocket, and the deep moan of the door closing behind him made her heart skip a beat. Closing her hand around the lighter in her pocket, she pulled it out and promptly dropped it on the floor.</p> <p>\"It's all right,\" he said.</p><p>\"Wait here.\"</p><p>\"As if I could do anything else,\" she replied, and hoped he didn't detect the tremor in her voice.</p><p>He moved past her then. She never heard his footsteps, and it seemed they should echo endlessly here, the way her every whisper did. There was a flare of light, a glow that illuminated his face for a moment, making it come alive with light and shadow as if he were some sort of undulating demon. But then he leaned over, and in a moment the glow spread as he touched the match to the tapers in a silver candelabra, lighting them one by one. And lifting it, he moved around the room, lighting others. It seemed to Rachel there must be candles everywhere in this place. By the time he returned to her side, the entire room glowed with them, shadows leaping and dancing, soft yellow light spilling over everything.</p><p>He took her hand. Drew her forward. Rachel went with him, her fear dispelled as her curiosity leapt to the fore. The room was as big as a barn, and high, high above her, she saw something glittering in the candle glow \"Is that a chandelier?\"</p> <p>Donovan looked up, then nodded.</p><p>\"The entire place is equipped with gas lights, but I'll need to connect the main line and open the valves before they'll be of any use.\"</p><p>\"What I wouldn't give to see this place in the daylight,\" she breathed. She felt him tense and wondered why.</p><p>Twin fireplaces stood at opposite walls, each one laid ready, waiting only to be lit. Each one had a huge stone mantel, and above them tapestries hung.</p><p>Breathtaking tapestries. She moved closer to the one nearest her, covering Donovan's hand with her own to lift the candelabra higher.</p><p>\"They must be ancient,\" she muttered. \"Quite old, medieval, or so Dante said.\"</p> <p>Her spine prickled.</p><p>\"Dante said that, did he?\"</p><p>Donovan looked down at her rather quickly.</p><p>\"Or so the story goes. I'm only repeating what's been told to me.\"</p><p>She tilted her head, studying his face in the soft glow.</p><p>\"Are you, now?\"</p><p>Nodding, he moved her to the left of the fireplace, lifting the light again and nodding toward the wall, where two crossed swords hung.</p><p>\"The broadswords are medieval as well, but Irish, whereas the tapestries are Italian.\"</p> <p>\"This Dante must have been quite a collector.\"</p><p>Donovan shrugged and moved on, pointing out other relics fastened to the walls, a suit of armor standing in a corner, looking ridiculously short, and the furnishings. Large chairs with embroidered cushions and elaborately carved, utterly straight backs, were grouped around the fireplaces. A large, ornate table with smaller, less elaborate chairs surrounding it held the room's center, each of its legs the size of a small tree. And there were weapons everywhere. Lances, maces, shields with their crests emblazoned across the front. And every so often, they'd pass an archway of darkness, leading off into some other part of the castle. Each time, she'd peer into the blackness, eyes narrow, eager to see more.</p><p>But each time, she saw nothing.</p><p>When they'd walked round the entire room, he led her to one of the cushioned chairs, setting the candles on a marble stand at its side.</p><p>Then he turned and knelt before the fire, and a second later it blazed to life, though she'd never seen him strike a match. She let the warmth rinse through her, chasing the chill of autumn away. And Donovan settled himself in the chair beside her. \"I'd offer you something to drink, but\" -- \"I know,\" she said.</p><p>\"You've only just arrived. I can't very well be expectin' your cupboards to be fully stocked so soon.\" She smiled at him. '\"Twill be cold... lonely, living here in this place, don't you think?\"</p><p>He nodded.</p><p>\"Yes. But there's a history here I needed to... touch. I had to come back.\"</p><p>\"Come back? You have been here before, then?\"</p><p>He blinked slowly, averting his eyes.</p><p>\"Long ago.\" \"In your childhood?\"</p><p>\"Something like that.\"</p><p>She nodded, not pushing him further, though she was fully aware he hadn't really answered her. He couldn't have been the man who saved her from the river. That was twenty years ago. He was far too young.</p><p>\"Is this--this great hall--the only room you're willing to show me, then, Donovan?\"</p><p>\"For now,\" he told her.</p><p>\"It wouldn't be safe to take you farther...\"</p><p>A long pause as his gaze burned into hers.</p><p>\"Without more light.\" Her throat went dry. She tried to swallow, and found she couldn't. He had a hungry look about him, a predatory look that shook her. \"Perhaps I should go then. Leave you to get settled in.\"</p><p>\"Perhaps,\" he said.</p><p>Nodding, she got to her feet. He rose as well.</p><p>\"I ... I'd like to come back. To talk to you about the legend.\"</p><p>\"I don't know much about that. You'll be disappointed.\"</p><p>\"I get the feelin' you know more about it than anyone else, Donovan O'Roark.\"</p><p>She turned and walked toward the door, and he trailed her. She sensed he was eager for her to go.</p><p>But when he pushed the huge door open, a blinding flash of lightning cut a jagged path across the sky. The rain slashed in at them, and thunder rumbled in the distance.</p><p>Closed within the huge stone walls, they hadn't even been aware of the change in the weather, and there wasn't a window to be seen in this room, she realized for the first He stood motionless. Said nothing. Well, then, there was no way around it. She lowered her head and took a step out. only to feel his hands closing on her shoulders, drawing her back inside. She nearly sighed in relief.</p><p>\"You can't walk back to the village in this.\" He said it as if he regretted it right to his bones.</p><p>\"I could. I'm not sugar, Donovan, and I won't melt in a wee bit of rain.\"</p><p>He closed the door, lifted a hand and swiped the droplets from her face, and then her hair.</p><p>\"Not melt, but get soaked through and take sick, at the very least. Or worse, get crushed beneath a falling tree, or struck down in your tracks by a bolt of lightning. No, I can't let you leave.\"</p><p>\"You sound sorry about that.\"</p><p>He nodded, surprising her by not denying it.</p><p>\"I like my privacy, Rachel. You'll do well to remember that about me.\" \"Oh.\"</p><p>He frowned at her.</p><p>\"What?\"</p><p>Shrugging, she lifted her brows.</p><p>\"I guess I was thinkin' there might be some other reason my being' here disturbed you so much. No matter though.\"</p><p>She was only half teasing him, and she thought he knew it. She was drawn to the man, in a way she didn't understand. It was as if some sort of spell were being worked on her, to make her. She closed her eyes, gave her head a shake.</p><p>\"I believe I must be more sleepy than I realized.\"</p><p>\"There should be some bedrooms made up,\" he said, his voice gentle.</p><p>Did she detect a slight tremor in it?</p><p>\"Lead the way, then.\"</p><p>He nodded, picking up the dancing candles once more \"Best stay close to me, Rachel. I've no idea how safe the entire castle is, since only parts of it have been kept up. Besides, you could get lost very easily in these halls.\"</p><p>She nodded her assent, and as he led the way into the dark, vaulted corridors, she held tighter and tighter to his arm, aware that with every step she took she was leaving safety farther behind. Not that she feared him.</p><p>Oh, but she did.</p><p>The halls twisted, turned, veered off in countless directions. He took her up spiraling stairways that felt like tunnels, they were so narrow and dark.</p><p>And then down more hallways.</p><p>\"Donovan?\"</p><p>He paused, and turned to look at her there in the darkness. \"Are you deliberately leading me round and round, only to keep me from knowing my way out?\"</p><p>Solemnly, he shook his head.</p><p>\"Just the opposite, Rachel. The room is near a back exit. So you can leave first thing in the morning.\" ' \"And why would I wish to do that, when you could just as easily lead me out of here yourself?\"</p><p>\"I ... I won't be here. I have a pressing engagement, I'm afraid. Very early. So by the time you wake up, I'll be gone.\" Tipping her head back, she studied him.</p><p>\"Will you\" now? \" \" Yes. And Rachel, I want your promise that you'll do as I ask. Leave here in the morning. No snooping, or exploring. I've already told you, it could be dangerous. \"</p><p>Studying him a long moment, she said, \"Is there something here you don't want me to see?\"</p><p>He shook his head.</p><p>\"You have as big an imagination as those locals at the pub, don't you?\"</p><p>She smiled.</p><p>\"Bigger. You wouldn't doubt it if you knew what I was thinkin' just now.\"</p><p>\"And what was that?\"</p><p>She lifted her brows and shoulders as one.</p><p>\"That perhaps the reason you won't be here in the morning is because you have an adverse reaction to daylight. And that perhaps the reason you don't want me snooping about, is so I won't stumble upon the coffin where you rest.\" She threw her head back and laughed at her own foolishness, and the sounds of it echoed endlessly, long after she stopped.</p><p>\"I guess I still have a bit of that gullible child in me after all. Or maybe 'tis simply livin' in Dunkinny that's made me so imaginative.\"</p><p>But he only stared at her until her smile died. She bit her lip, and her hand trembled slightly as she lifted it to touch his face.</p><p>\"I've hurt your feelin's now, have I? I don't really think you're a vampire, Donovan. But just a man. A... a beautiful man.\" She lowered her gaze, not quite believing she was about to say what she was.</p><p>\"I hope you don't think it bold of me to tell you this. But I-- I'd like to see you again. Not because of the legend, but just . just because. \" And still he said nothing. Lowering her hand, she rolled her eyes ceiling ward and drew a short, sharp breath.</p><p>\"Landsakes, Donovan, say something, will you? Am I makin' a total fool of myself, or...\"</p><p>\"No.\" He reached out to brush a curl off her forehead.</p><p>\"In fact, I've been trying very hard not to ... feel anything toward you, all evening.\"</p><p>She felt the blood rush to her face.</p><p>\"Oh.\" Then, licking her lips, meeting his eyes again, she whispered, \"Why were you trying so hard not to feel that way, Donovan?\"</p><p>\"Because nothing can come of it.\" Her heart squeezed.</p><p>\"You're married, then.\"</p><p>\"No. Of course not. It's just...\" He shook his head.</p><p>\"You'll have to trust me, Rachel. Nothing can come of this. I ... I probably won't even be here very long, and besides that, I\" --He sighed deeply.</p><p>\"It doesn't matter. Here, this is your room.\"</p><p>He pushed a door open and stepped inside.</p><p>Rachel followed, drawing a deep breath as the candlelight spilled on a canopied bed draped in sheer fabric of softest ivory. \"\" Tis beautiful. \"</p><p>\"It's been restored. This is the room Dante had made ready for Laura Sullivan, the woman who betrayed him.\"</p><p>\"My... my heartless ancestor slept here?\"</p><p>\"No. No, she killed him before she ever saw it.\" Rachel turned toward him, a new idea creeping into her mind.</p><p>\"Are you puttin' me here, Donovan, so you won't forget whose blood runs in my veins?\"</p><p>He didn't answer, only lowered his head.</p><p>\"But you can't possibly blame me for what my forebears did.\"</p><p>\"No. And I don't. I simply thought...\" He shook his head.</p><p>\"I honestly don't know what I thought.\"</p><p>She took a step closer, drawn to him beyond reason, and driven by more than her usual boldness. She felt as if she knew him, as if she'd always known him, and there was no hint of shyness, and no earthly reason to temper her actions. Simply being near him seemed to have stripped her inhibitions away.</p><p>\"I can tell you what I think, Donovan O'Roark,\" she said. And when he looked up, she moved still closer.</p><p>\"I think you haven't the nerve in you to kiss me goodnight.\"</p><p>His lips quirked, as if he wanted to smile and was fighting it.</p><p>\"Do you? Is that meant as a challenge, Rachel Sullivan?\" \"Indeed, it is.</p><p>I don't like this idea of you fightin' so hard to dislike me. An' I know that if you kiss me once, you'll forget about all that nonsense my ancestors did to yours, and simply see me. Not Alicia, nor Laura, but me. Rachel Sullivan. \"</p><p>He started to shake his head.</p><p>\"I dare you,\" she whispered.</p><p>\"But I don't think you've the nerve.\"</p><p>His eyes darkened and she knew she'd won. He set the candelabra down on a nightstand and he came toward her, a distinct purpose glowing in his midnight eyes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I moved closer to her, compelled by some force I couldn't begin to understand. But my lips merely brushed across hers, their touch light, fleeting. For her mouth was not my goal. Not yet. Part of me wished to frighten her, I think, but there was more. To taste her. I longed for it with a hunger more powerful than the preternatural bloodlust I'd lived with for so long. And for a moment--only a moment--perhaps I forgot where I was.</p><p>Perhaps part of my mind slipped backward to the time when Dante and I lived like kings, feared by the villagers. The times when we dared walk among them at night, before they understood what we truly were. Those times when, should a maid strike our fancy, we were free to take her, to drink our fill from her pretty throat, and use the power of our vampiric minds to make her remember it only as a dream. Those times before we were fully aware just how dangerous it was to interact with mortals in any way.</p><p>I reverted, I think, in my mind that night. So my lips brushed across hers, and then across her cheek, and over her delicate jaw, and she knew.</p><p>She knew on some level. Her head tipped back, to give me access to what I wanted. Her chin ceiling ward as the breath shivered out of her. My lips found the skin of her neck; the spot where a river of blood rushed just beneath the surface. Its current thrummed louder, overwhelming my senses.</p> <p>Her scent, her texture. my head whirled. And my lips parted, and I tasted her then. The salt of her skin, warm on my tongue. Her pulse, throbbing faster against my lips. I drew the skin into my mouth, just a little, suckling her, allowing my teeth to press down ever so slightly. Shuddering, she pushed herself closer to me, her body tight to mine--from the spot where my mouth teased her throat, to her breasts, straining against my chest, to her hips, arching forward, rubbing softly against mine and making me hard with wanting her. My arms were around her, one hand cradling her upturned head, one cupping a softly rounded buttock and pulling her harder against me.</p><p>Hers were on my head, fingers twisting and tugging at my hair as I sucked at her throat. I wanted to pierce her flesh. She wanted it too, I sensed that in everything she did, every soft sigh that whispered from her lips. But she didn't know what it was she was craving. She would though. She would.</p><p>I bit down harder, my incisors pinching, pushing against the soft flesh, preparing to break through that luscious surface to the nectar it concealed.</p><p>She gasped. A harsh, startled sound louder than the blast of a cannon to my ears, so focused was I on the taste of her. But it was enough to bring me back to myself, to make me realize what I'd been about to do.</p><p>The desire burned through me like a flame, and I trembled all over, a quake that utterly racked me as I forced myself to step away from her--to raise my head from her throat, and lower my arms to my sides and step away.</p> <p>She didn't react immediately. And I knew too well why; could see it in the wide and slightly dazed look in her eyes. The allure of the vampire--and something more, too. Perhaps she'd felt the impact of this force between us as powerfully as I. Even I didn't understand it fully. To her, it would be even less comprehensible. She came back to herself within a moment, blinking as if to clear her vision, and then staring up at me.</p><p>\"I don't think P we ever been... kissed... quite that way before.\" Lifting a hand, unaware she did so, she ran her fingertips slowly over the spot where my mouth had been- \"I... shouldn't have done that.\"</p><p>\"Why did you?\" she asked me.</p><p>I shook my head.</p><p>\"I'm not sure, Rachel. Perhaps for the same reason you allowed it.\"</p><p>Tilting her head to one side to study me, she frowned. Her hair slid away, revealing her neck to me again, and I felt a rush of renewed desire as I saw the redness forming there, and the moisture, and the way her fingers kept touching the spot and drawing away. \"Go to sleep,\" I whispered, but it was more than a whisper. I flexed the astral muscle, the one that didn't exist physically but was there all the same, the one that sent my wishes out to the minds of others.</p> <p>\"Forget this happened.\" I caught her eyes with mine, sending the force out to her, the command that must be obeyed.</p><p>\"Forget the kiss, Rachel. It never happened. Go to sleep, and when you wake\" -- \"Oh, I doubt I'll sleep at all, Donovan O'Roark,\" she whispered with a soft, shaky smile. A bit of the mischief returned to her pretty eyes.</p><p>\"But forgettin' that kiss is certainly not an option whether I do or not.</p><p>I'll either lie awake thinkin' about it, or go to sleep and dream it up again.\"</p><p>Her smile broadened. '\"Twas a rather nice kiss, you know.\" I stepped backward, an instinctive act, rather like reeling in shock, I thought later.</p><p>She didn't react to the mind control at all. It hadn't . it hadn't even given her pause.</p><p>I realized I was standing in the hall now, when she reached for the candelabra and offered it to me.</p><p>\"You should take this with you, to find your way.\"</p> <p>\"No,\" I blurted, still trying to puzzle out her lack of a reaction to my commands, too much so to censor myself, fool that I was.</p><p>\"I see perfectly well in the dark.\" I could have kicked myself the moment the words left my lips.</p><p>\"Can you, now?\" She drew the glowing tapers back to her side.</p><p>\"I'll leave you to it, then. Good night, Donovan.\"</p><p>And she closed the door.</p><p>I stood there, trembling. Never had I been so drawn to a mortal before. And never, not ever in two hundred years, had I been so ineffective in influencing the thoughts of one of them. Making them forget. This told me two things. That her will was very strong, and that she didn't want to forget.</p><p>And she was here, in my home, my haven. God, what if she learned more than she should? What then?</p><p>Rachel closed the door, leaned against it, lowered her head and closed her eyes. She was shaking so hard she could barely stand, and she'd been terrified he'd see it before he left. She'd hidden it, she thought. Pulled the mask into place in time. Assumed the demeanor of the flirtatious, irreverent, and slightly cocky barmaid to conceal the depth of her reactions to him.</p><p>My God. The way he'd kissed her . the way his mouth had, not just caressed, but devoured her. and then the feel of those. Those teeth!</p><p>She stood bolt upright, still shaking, but no longer weak.</p><p>Her hands flew to her neck once more, fingers searching, feeling, terror creeping over her soul. Had he.</p><p>Diving into her deep pockets, she extracted a compact, struggled to open it, dropped it, and scrambled to snatch it up again. Finally, she leaned over the glowing candle flames, staring into the small, round mirror at the red mark on her neck. But there were no telltale puncture wounds, and there was no blood. Just a small patch of bruised skin. What her friends in the States called a hickey.</p><p>\"Lord a' mercy,\" she breathed, snapping the compact shut, sagging once more.</p><p>\"I don't know whether to be weak with relief or to question my sanity for thinking...\" Shaking her head, she drew herself upright, turned and went to the bed, taking the candles with her. She set them on a nightstand, and well away from the bed curtains that draped down from the canopy to swathe the thing in luxury. Beyond the sheer fabric, a red satin comforter swelled from the stacks of pillows beneath it, and when she pulled it back it was to find sheets of the same fabric, only black, not red. The pulse in her throat beat a little harder. She had no nightclothes here. But the bed hardly seemed made for such things.</p><p>Glancing quickly back toward the door, she saw the lock there, waiting to be turned. She saw it, licked her lips, and turned toward the bed once more.</p><p>This time, to begin undressing.</p><p>And she slid naked into that decadent satin nest, felt its cool softness caressing her heated flesh, surrounding her in sensual pleasure. Cushioned and covered and enveloped within it. And when she fell asleep it was to dream of things more carnal than she'd ever done before.</p><p>She woke to the morning sunlight streaming through the window and bathing her face--and she was more curious about the man than ever before.</p><p>She flung the covers aside, got to her feet, naked in the chilly bedroom.</p><p>Her clothes lay folded on a chair, just as she'd left them.</p><p>She glanced at the unlocked door. He'd said he would be gone by the time she woke. But it was still early. Maybe. She dressed quickly. Over and over his voice rang in her head. Don't snoop. Leave by the back door as soon as you wake. I value my privacy.</p><p>It would be wrong to go against his wishes, after he'd been so kind to her, letting her in when he obviously didn't want to. Letting her stay when he'd seemed almost afraid to.</p><p>Why?</p><p>She finished dressing, ran her fingers through her hair in lieu of a comb, and checked her appearance in the compact mirror since there were none to be found in the bedroom itself.</p><p>No mirrors?</p><p>She shook the thought away and examined her reflection. She looked storm-tossed. Wild. Hardly studious, much less virginal, and probably more like a barmaid than she ever had.</p><p>Why?</p><p>Him. His kiss, and a night spent reliving it beneath the caress of satin sheets that reminded her of his eyes.</p><p>\"Damn,\" she whispered, and quickly made the bed before heading out the door, into the hall. Light now. Dim, for lack of windows, but enough light made its way in to see by. The door that led out of here was obvious. At the end of the hall to her right stood a tall, wooden door, with light glowing from beyond its thick pane of glass.</p><p>Swallowing hard, stiffening her spine, mustering her willpower, she marched toward it, found it unlocked, and pulled it open. Warm Irish sun bathed her face, her eyes. Stretching before her, like the crooked, graying teeth of a very old crocodile, were the crumbling stone steps, curving intimately down this tower's outer wall and disappearing round its other side. From here she could see the sea, glittering blue- green, with white froth roiling as the waves crashed against the rocky shore. The cliffs were almost directly below her. The steps were probably perfectly safe.</p><p>\"But he kept going' on about the place perhaps being' dangerous,\" she muttered to herself.</p><p>\"No, I really do believe he'd want me to go out the front way. Indeed, if he were here, he'd likely insist.\" She stepped back inside and closed the door.</p><p>Then she put her back to it, and faced a long, twisting corridor lined with doors, and open archways leading into other halls, or stairways going up or twisting downward. Shrugging her shoulders and battling an excited smile, she whispered, \"I suppose I'll just have to search until I find a safer way out, won't I? \" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She got lost. Hopelessly, frighteningly lost. Lord, but she'd never realized how large this castle was, or how its corridors writhed about upon themselves like serpents in ecstasy. And so few windows!</p><p>She no longer had any sense, even of what floor she might be wandering. Her only means of navigation was to try to go toward lighter areas, and away from the darker ones. But even this plan had its flaws, for she could only go so far before the light began to fade. Her choice then became, walk into the darkness or go back to where she'd already been. And going back would serve no purpose. She made many discoveries that day. Some pleasant ones, but mostly unpleasant in the extreme. She discovered how thirsty she could become in a single day. How gruesome it was to walk face first into a sticky spider's web in the dark. How much she valued a good breakfast when one was unavailable.</p><p>Some of the more pleasant discoveries diverted her from her misery for short spans of time. She spent hours exploring rooms full of fascinating antiques, and when she was tired, took a nap on a satin chaise fit for a queen. Later, she stumbled upon the music room, where a harpsichord rested, dusty and old. The soft cushioned window seats built into the stone wall.</p><p>She sat on one to rest, and caught her breath as she gazed out over what surely must be all of Ireland. She was up so high. She'd been up and down so many stairways that she'd lost track, and truly had no clue where she'd ended. Now she knew, though the knowledge did her little good, except to tell her she ought to be going down. And down some more. And doing it soon, for from this vantage point she could see that the sun now rested on the very edge of the horizon, and would soon sink out of sight. She must have napped longer than she realized.</p> <p>She lingered there only a short time. She might have stayed longer, despite the late hour, but she made the mistake of leaning over the old instrument, her fingers just lightly caressing the keys. And it let out a belch of sound that nearly stopped her heart. After that she had to be out of the room.</p><p>Ridiculous, the feeling that pervaded her senses then, but no use denying it.</p><p>She had the distinct sense that she must get out before Donovan learned she was here. And that blast from the harpsichord might have given her away, even told him exactly where she was, had he heard it.</p><p>She ran from the room, back into the snake pit of corridors, and took the first set of stairs she found that led downward.</p><p>Only they led into darkness. Or perhaps it was that night was falling now.</p> <p>She kept going down, and the stairs twisted, circling and spiraling, lower and lower. She kept one hand pressed to the walls on either side to keep from falling as she continued endlessly downward.</p><p>And yet there seemed no end. She began to feel stifled, constricted by the walls at her sides, and even imagined them narrowing. Tightening. Squeezing in on her as if she'd been dropped into a funnel.</p><p>The stone step beneath her foot crumbled, and she drew back quickly, listening as the bits of it clattered and echoed into the darkness.</p><p>She could no longer see at all. And that might have meant full night had fallen, or perhaps it was only that no light could penetrate this narrow spiraling staircase, all encased in stone. \"Enough,\" she muttered.</p><p>\"I'm going' back.\"</p><p>And she turned, but her foot slipped, as a still larger chunk of the stone step fell away. It bounded down, crashing like the feet of a giant. And then there was another sound. Soft at first, light. Like the gentle beat of wings and a timid cry. And then louder.</p> <p>Screaming.</p><p>The air above her filled with rapidly beating wings and piercing shrieks as the bats that falling stone had startled awake swarmed above and around her.</p><p>Blind beasts! Her scream joined their unearthly voices as she flailed her arms, but they battered her, colliding with her one after another, only to bound off in another direction. She felt them hitting her. Their small, furry bodies wriggling, and those rubbery wings pumping madly. Tiny clawed feet, scraping her face and moving on. Wetness--God alone knew what that was.</p><p>She screamed and beat at them, turning in circles and covering her face with her arms.</p><p>And then she tumbled.</p><p>Head over heels, her body hurtled down the staircase, bounding up and crashing down onto the uneven stone again and again. Smashing against the curving wall, only to rebound from it and follow the downward spiral. No bats now. She'd fallen past them and their mad flight.</p><p>And for a single moment she thought the fall would be endless.</p><p>She came to a stop some seconds before she realized it. Her head still spun and her body screamed in pain from a hundred bruises, each one throbbing as if it were being beaten anew. But gradually, the sense of motion faded, and she realized she was still. She lay on her side, more or less, though her limbs were twisted and bent in unnatural angles.</p> <p>Slowly, she pulled herself upright, into a sitting position. Every movement hurt. Every spot on her body cried out in protest at her cruelty in moving it at all. But gradually, she did, getting her arms and legs into a more natural state, checking them to be sure they still functioned properly.</p><p>Nothing seemed to be broken. At least, she could move everything.</p><p>God, but it hurt!</p><p>Slowly, inch by inch, her hands on the wall nearest her, she pulled herself to her feet. Her trouble, she realized, had not ended simply because her fall had. She still needed to find her way out of this castle. For the first time it occurred to her that she might be trapped here indefinitely.</p><p>She could starve, or die of thirst before anyone found her.</p><p>And somehow the thought didn't frighten her as much as the thought of being found. But that was foolish.</p><p>The stairs had ended, and she was now on a level floor, more or less, though there were chips and breaks in the stone that made walking precarious at best. Still, she made her way forward, wishing for nothing so much as a candle to see by. The lighter.</p><p>She quickly dipped into her pocket and praised her lucky stars, it was still there. She lit it, held it out in front of her, and saw that she was in a long, wide corridor of stone and utter darkness--very much like a cave. But in the distance, doors stood, silent and closed. Perhaps one would lead to. to somewhere.</p><p>Her footsteps echoed--unevenly, since she was limping now--as she made her way down the hall, and paused before the first doorway.</p><p>Pushing it open, she found only an empty room. So she moved on to the second. And of course, an empty room greeted her there, as well. Only one door remained. Her heart in her throat, tears of frustration beginning to burn in her eyes, she touched the handle. Locked.</p><p>A sob welled up to choke off her breath, and she lowered her head to the wood to cry.</p><p>But then there was a sound. A soft creaking sound. a sound that came from beyond that door.</p><p>Like another door of some kind, opening. slowly opening. Straining to hear, she pressed closer, listening with everything in her. Gentle taps upon the floor. Someone moving around. Then a flare of light from beneath, one that grew brighter.</p><p>The steps came closer. And something. something made her back away.</p><p>The door opened with a deep, forbidding moan of protest. She looked into the eyes of Donovan O'Roark, saw them widen with shock and something that might have been fear--perhaps even panic. And then she managed to tear her gaze from his to look past him into the room, where candles glowed now. There was nothing there. nothing except a large, gleaming coffin, its lid standing open, its satin lining aglow in the candlelight.</p><p>Black and red, the satin inside that box. Black and red like the satin in which she'd slept.</p><p>She backed away.</p><p>He reached for her.</p><p>She whirled, the lighter falling from her hands, and then she ran.</p><p>\"Rachel! Rachel, wait!\"</p><p>Panic bubbled in her chest, larger and larger, expanding until she felt the bubble would burst and she'd die, right there, from the force of the fear that possessed her. She fled, headlong, having no idea where she was going, what she would do.</p><p>But she knew he pursued her. She knew he'd catch her soon, and Lord help her, what would she do then? What?</p><p>The hallway ended. Abruptly, and without a hint of warning in the pitch blackness. She heard Donovan's voice shout a warning--one she ignored--and then she felt the solid, skin-razing wall of stone stopping her heedless flight with a single blow. Her head, her body, the impact rocked her to the teeth and to the bone. But the head was the worst, and she felt the warmth of blood running from the wound and stinging her eyes as she sank slowly to the floor. \"My God, Rachel...\"</p><p>He was upon her like a wolf on an injured lamb, and she knew she no longer had a chance. She'd die here in this dungeon or whatever it was. She'd die here, bloodless and- pale, and the vampire would have his vengeance on the females of the Sullivan clan at last. He knelt beside her, gathering her into his arms and leaning over her. She felt his breath on her face. His fingers, probing the pulsing wound on her forehead.</p><p>\"Damn fool woman, you could have got yourself killed!\"</p><p>As if he wasn't planning to finish that job himself, she thought, groggy now, fading fast.</p><p>He got to his feet and carried her back down the hall, through one of the other doors, where she'd seen nothing, and right up to the wall.</p><p>She tried weakly to leap from his embrace, which likely would have resulted in cracking her head again, this time on the floor, but his arms tightened around her.</p><p>\"Be still, Rachel.\"</p><p>\"Let me go... let me go...\" She twisted, pulled against him, but his arms were like steel. He paused there beside the wall, lifted one hand, holding her captive quite easily with the other. He touched something and the wall moved, backing away and leaving a two-foot gap on either side. Donovan carried her through that gap, and she caught her breath as the wall closed off again. He moved left, up a single flight of stairs, these ones broad and solid, rather than narrow and crumbling like the ones where she'd fallen.</p><p>Then he touched another wall, this one at the top of the staircase, and it opened like a door.</p><p>He stepped out, and lowered her down onto a soft set tee and then he turned to a wall, and did something. Moments later a soft light suffused the room from above, growing brighter until the place was perfectly well lit.</p><p>The light above her was, she realized, the gas-powered chandelier.</p><p>And the room around her was the great hall.</p><p>\"So close...! was ... so very close...\"</p><p>\"To what, Rachel? To escape?\"</p><p>She closed her eyes, touched her throbbing head. He ignored her for the moment, intent on lighting first one fire and then the other as she lay there. She felt the heat, saw the light.</p><p>\"If it was escape you wanted, why didn't you leave by the back door when you awoke this morning? Why did you insist on doing the one thing I asked you not to do?\"</p><p>He turned to face her, she saw as she peered at him, but the sight of the flames in the fireplace, reflected in his dark hair and deep blue eyes, only made her head hurt more, so she quickly closed her eyes once again.</p><p>\"I wasn't snooping. I... the back stairs looked unsafe. I was only tryin' to find a saner way to leave this ruin.\"</p><p>He was closer now. Right beside her.</p><p>\"You're lying,\" he whispered.</p><p>\"No\" -- He gripped her shoulders, lifting her slightly, and readying, she thought, to do her in. But his hands closed on bruised flesh, and she winced in agony.</p><p>Donovan went utterly still. Then, frowning, he pushed her hair aside, eyeing her face, her neck.</p><p>\"My God, you're more injured than I realized.\"</p><p>That he was choosing to ignore the fact that she'd all but seen him rise from a coffin would have been amusing, if she hadn't been so certain her death was imminent.</p><p>\"I fell,\" she told him.</p><p>\"Down a long flight of stairs... the bats frightened me, and I lost my footing...\"</p><p>She bit her lip as the memory of it came up to choke off her words.</p><p>Sighing deeply, he gripped her shirt at its hem, and without even asking her consent, he tugged it over her head. Then he touched her, with his eyes as well as his hands, examining the bruises and scrapes she'd suffered.</p><p>\"I'm all right,\" she told him.</p><p>\"Nothing's broken.\" He nodded as if in agreement, but took a handkerchief, spotlessly white, from a pocket and pressed it to her wounded head.</p><p>\"I'll find some ice for this.\"</p><p>\"I don't want ice. I just want to leave. Please...\" He shook his head slowly.</p><p>\"Why? I thought you wanted to know all my secrets.\"</p><p>She clamped her mouth closed, swallowing hard. His gaze moved, heating as it did, over her body. She felt naked, wearing no more than a bra and skirt.</p><p>And the look in his eyes made her feel even more vulnerable and exposed.</p><p>\"I've changed my mind. I'll find some other subject to write about. I just... just want to leave this place.\"</p><p>\"And me, isn't that right, Rachel? Because you've discovered the monster of your nightmares. The demon of your childhood. The legend you refused to believe.</p><p>All true, all real. All alive . in me. \"</p><p>She met his eyes.</p><p>\"It's true, isn't it?\"</p><p>\"What do you think?\"</p><p>She only shook her head.</p><p>\"I never believed you were evil. Tell me I wasn't wrong.\"</p><p>He said nothing, just stared at her.</p><p>\"Don't kill me,\" she whispered.</p><p>\"I swear, I'll never tell a soul.\"</p><p>His smile was slow, and almost sad.</p><p>\"I'm not going to kill you, Rachel. And I already know you won't tell my secret.\" She blinked, hope washing over her like a flood of warmth and sunlight.</p><p>\"You can trust me. I swear it, Donovan\" -- \"No,\" he said.</p><p>\"I can't trust you. That's why you're going to have to stay here.\"</p><p>Her brows rose high, eyes widening.</p><p>\"Stay here? But ... but...\" She didn't understand, couldn't comprehend.</p><p>\"For how long?\" He said nothing, but she could see his meaning in his eyes, could hear his deep voice tingle up her spine even though he never spoke the word.</p><p>She heard it, in her soul.</p><p>Forever. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ohe was as bruised and battered as if I'd beaten her. I felt her pain, in spite of myself, as I bathed each spot in cool water. But she drew away, her eyes partly angry, but mostly afraid. \"Don't touch me. I won't stay, do you hear me? You have to let me go.\"</p><p>With my simple glance, an icy one, she stilled. And I resumed pressing the cool cloth to the bruises.</p><p>\"You will stay,\" I said.</p><p>\"They'll worry about me in the village. They'll come looking.\" Her breasts strained against the bra she wore. A small purple welt formed on one of them, and I pressed the cloth gently over it, not taking my hand away, but keeping it there. Feeling her warmth seeping into my palm. And the heat of desire flaring up from within. She went utterly still, staring at my hand where it rested upon her breast. Her breaths coming shallow and quick.</p> <p>\"Be honest, Rachel. You didn't tell a soul where you were going.\" She blinked, and I knew I was right.</p><p>\"You'll send a note... to Mary at the pub, telling her you've gone traveling and don't know when you'll return.\"</p><p>\"I'll do no such thing.\" And she pulled free of me, leaping to her feet, snatching her blouse from the set tee and struggling into it.</p><p>\"You will do exactly as I tell you, Rachel.\"</p><p>\"Never.\" She surged toward the door, and I stood still, letting her make her foolish attempt. When she tugged, she found the entryway sealed tight.</p> <p>Locked. She went still, her back to me, hand still on the door, and her head slowly lowered. Softly, she whispered, \"What are you, Donovan O'Roark? And what are you going' to do with me?\"</p><p>\"I think you know what I am.\"</p><p>She turned very slowly, and I felt her gaze burning into me, searching my soul.</p><p>\"No.</p><p>\"Tisn't possible. Tis...\" tis some elaborate hoax. \"</p><p>\"It's not only possible, but true. And I think you know it.\" Her eyes narrowed, a little of the fear leaving them. She came nearer, studying me so closely I felt exposed to my bones. But she stopped before she reached me.</p> <p>\"There are no such things as vampires,\" she whispered.</p><p>\"And the tale of Donovan O'Roark is but a legend. Not real.\"</p><p>I stood very still, wondering why I felt so vulnerable, why I was waiting in secret dread of her reaction when she finally realized the truth.</p><p>\"That's it, isn't it? This is your idea of a joke. You're but tryin' to teach me a lesson.\" One step, then another, and she stood very close.</p><p>\"You're only trying to scare me, and for a time, you succeeded. But I've come to my senses now, Donovan. So why don't you simply tell me the truth rather than playing out this game and pretending you won't let me leave?\"</p><p>Raising my hands, I let them rest gently on her shoulders.</p><p>\"It is no game, Rachel. Tell me, why should I- let you go the way Dante let Laura Sullivan go a century past? So you can run screaming through the village the way she did? So you can lead a mob back here at the break of dawn to end my miserable life?\" Closing my eyes very slowly, I whispered, \"Perhaps if I were wise I'd do just that.\" But I instantly regretted that impulsive declaration. When I opened my eyes again I saw her frowning at me.</p><p>\"I won't believe any of it. If you're a vampire, prove it to me.\"</p> <p>Lowering my head, I shook it slowly.</p><p>\"You have the talk of the villagers. The way they look at me when I pass...</p><p>as if the devil himself is in their midst. What more proof do you need, lass?\" She shrugged her shoulders.</p><p>\"Turn into a bat,\" she suggested. I looked up quickly, sensing the edgy humor creeping into her voice. God, did she really believe this was all a joke?</p><p>\"I'm afraid that's not a skill I've mastered. I've heard that shape-shifting is possible to the truly ancient ones among us. But I'm only two centuries old.\"</p><p>\"Barely old enough to drive,\" she mocked.</p><p>Closing my eyes, sighing deeply, I muttered, \"Do you have a mirror, Rachel?\"</p><p>\"A mirror?\"</p><p>I nodded, not looking at her. She hesitated. Then, \"Look, d-don't you think you've carried this joke far enough? You knew I wouldn't leave as you told me, so you pulled that prank with the coffin, and your timing was perfect. Though how you could be sure I'd find you in this maze of crumbling stone--I mean, I could've been killed and it really wasn't all that amusing, and\" -- \"Get the mirror.\" I met her eyes, stared into them.</p><p>\"Get the mirror, Rachel, and let's get this part of it over with, shall we?\"</p><p>\"You're a lunatic.\" She dug into her pocket.</p><p>\"This isn't going to prove a thing. I swear, you've made your point. I learned my lesson, my snooping days are over, and I...\" She drew a compact out of her pocket, fingered it slowly, and I knew her fear was coming back.</p><p>She fought it, but it was returning in spite of her skepticism. \"Open it,\" I told her.</p><p>\"And then you can go back to hating me the way the rest of them do.\"</p><p>\"Don't be silly,\" she said.</p><p>\"They don't even know you.\" She opened the compact.</p><p>\"They've known me for two centuries,\" I said.</p><p>\"I was one of them once.\" I took the mirror from her hands, bit my lip slightly.</p><p>\"Look, Rachel. See me for the monster everyone else does.\" And I held the mirror before my face.</p><p>She drew a deep breath, and moved around beside me. And then she gasped, and backed away.</p><p>\"It can't be... it can't be true.\" I only stood where I was, snapping the despicable mirror closed and tossing it to the set tee \"Oh, it's true.\"</p><p>\"And the legend? The tale of how you sat up in your own coffin and the priest tried...\"</p><p>\"Tried to kill me. My own father handed him the mallet and stake. My own mother called me a demon. And the girl I'd planned to marry screamed for my blood.\"</p><p>I heard her try to swallow, and the way she struggled to breathe.</p><p>\"And the rest of it? The belief that you'd return one day to destroy the village and take revenge on the Sullivan women?\" I lowered my head.</p><p>\"Do you believe that's why I've come home, Rachel?\"</p><p>She blinked, and looked up into my eyes.</p><p>\"You said I couldn't leave.</p><p>What do you intend to do with me? \"</p><p>\"I don't know.\"</p><p>\"Am I in danger here?\"</p><p>\"If I said no, would you believe me?\"</p><p>Her throat convulsed.</p><p>\"Let me leave, Donovan.\"</p><p>\"You weren't so eager to leave me last night, Rachel. Or have you forgotten that kiss in your chamber?\"</p><p>\"That was before...\"</p><p>\"Before what? Before you knew the truth? That I'm a monster, bent on destruction and revenge? You know nothing about me, and yet you readily believe the worst.\"</p><p>For a moment she was silent. Then sighing, she said, \"You're right.</p><p>I'm behaving just the way the others do. Judging you, when I swore I never would. Exactly the way you believe the worst about me. \" And her words rocked me.</p><p>\"That I'd betray you simply because my ancestors did. That if you let me go, I'd shout your secrets to the world.\" I lowered my head. She was right, that was exactly what I thought. \"So we're at an impasse.\"</p><p>She huffed. Folded her arms across her chest.</p><p>\"Are you going to kill me?\"</p><p>\"No.\" Then I met her eyes.</p><p>\"Do you believe that?\"</p><p>\"I shouldn't, but for some reason I do.\" \"Good.\" I literally sighed in relief.</p><p>\"Don't celebrate, Donovan. Part of the reason I believe it is because I want to. I'm only too aware that I'm likely kidding myself.\"</p><p>\"I won't hurt you, Rachel, you have my word on that.\" \"Will you let me go?\"</p><p>\"I can't. Not ... yet.\"</p><p>\"When?\"</p><p>\"I don't know.\" I pressed both hands to my head and turned in a slow circle.</p><p>\"I have to think.\"</p><p>She stood still for a long moment. Then she blinked and looked at the ceiling.</p><p>\"I'm having some trouble believing all this. I should be screaming or running for my life, or fainting, shouldn't I?\"</p><p>\"You already did those things.\"</p><p>Her mouth quirked very slightly, a tremulous hint of a smile.</p><p>\"So how do most women react when you tell them you're a vampire?\"</p><p>\"I've never told another woman.\"</p><p>I didn't look at her when I said it. Instead I turned and walked toward the blazing fireplace, then lowered myself into a chair close to it, seeking the warmth.</p><p>\"But if I had, I imagine they'd have reacted the same way you did. First with horror, then disbelief, and now...\" I turned to look back at her, where she still stood.</p><p>\"What are you feeling now, Rachel?\"</p><p>She moved closer, taking the opposite chair.</p><p>\"I'm mad as hell at you, for keeping me here against my will. As for the other...\" Shaking her head quickly side to side, she shrugged.</p><p>\"I'm not sure I know what to make of it. And there's one other thing I'm feeling, Donovan O'Roark.\"</p><p>A hint of panic tickled at my nape.</p><p>\"What?\"</p><p>\"Hunger.\"</p><p>She watched him, still battling an eerie sense of having fallen into some dream world. Dizzy with the weight of his revelations, not sure she believed what her own eyes had shown her, she was dazzled. But not terrified--or not as much as she had been at first. He went away, leaving her to explore on her own, and she did, thumbing through the books in his bookcase, taking a closer look at the tapestries on his wall. She recalled last night. The kiss. The way his lips had trailed over her throat, and he'd tasted her skin there. The incredible sensations the touch of his mouth had evoked in her.</p><p>Sensations she'd never felt before. Just at a kiss. What had he been thinking? Was it the way it was depicted in fiction? Had he been battling some kind of mad bloodlust? Barely restraining himself from taking her life? And why wasn't she paralyzed with fear?</p><p>But she wasn't. She was curious now that the fear was beginning to ebb. And more. Still drawn to him as she'd always been. And only now beginning to realize that what she'd believed as a child. might very well be true. It was no longer impossible, was it? She'd never feared the shadowy figure she saw as her protector when she'd been a child. And she wasn't afraid of him now. Nervous, uncertain, angry, curious. But not afraid.</p><p>She must be losing her grip on reality, for she certainly should be.</p><p>He appeared then, a bowl of soup steaming in his hands, a glass of something red beside it. As her gaze fell on the scarlet liquid and widened, she heard him mutter, \"Wine,\" and immediately felt foolish.</p><p>Of course it was wine. What else would it be?</p><p>He set the soup on a marble stand, then moved it closer to her chair.</p><p>She returned to her seat, eyeing the meal.</p><p>\"It was the best I could do. The workers left a few supplies in the cupboards when they left this last time.\"</p><p>She tilted her head to one side.</p><p>\"And... what about you?\" He lowered his head.</p><p>\"Don't ask questions if you aren't prepared for the answers, Rachel.\"</p><p>\"I don't think anyone can be prepared for something like this. Were you?\"</p><p>His head came up quickly.</p><p>\"What do you mean?\"</p><p>\"Well... I mean, when you first... how did it happen to you?\" \"Why do you want to know?\"</p><p>She shrugged.</p><p>\"I ... I just do. You're holding me prisoner here, the least you can do is make conversation.\"</p><p>\"It isn't conversation, it's interrogation.\"</p><p>She scowled at him.</p><p>\"It's curiosity. Nothing more.\"</p><p>\"It's a girl after a story. That paper, my secrets, as you said.\" He cleared his throat, staring at a spot just past her.</p><p>\"However, maybe it's for the best that you still want to know. I believe I've come up with a solution to our mutual problem here. A compromise.\"</p><p>\"Oh?\" She sipped soup from her spoon, and dipped in for more. It was hot, tasty.</p><p>\"A bargain, you mean? \"</p><p>\"Yes.\"</p><p>\"Well, this is interesting. How can you make a bargain with me when you've already made it clear I'm stuck here whether I like it or not?\"</p><p>\"At least this way you'll get something in return.\" \"What?\"</p><p>\"Everything you want to know, Rachel. Stay with me, give me time to make certain... arrangements. Do this, and I'll tell you my story.</p><p>And when I've done the things I need to do, I'll let you go. \" She tilted her head to one side.</p><p>\"What kinds of arrangements are you speaking of, Donovan?\"</p><p>I shrugged, unable to take my eyes from hers, openly curious, the fear fading bit by bit.</p><p>\"I'll need to change my name, establish a new identity, prepare a place for myself to live, a new place, where no one has seen me before.\"</p><p>Shaking her head slowly from side to side, she whispered, \"But why?\"</p><p>\"Because you'll know all my secrets. And when you write your paper, others will know. They'll flock here in droves, some merely curious, others...</p><p>others intent on my destruction.\"</p><p>\"I think you're overreacting. No one would even believe it was true...\"</p><p>\"The locals already believe it.\"</p><p>s She lowered her head.</p><p>\"This isn't 1898, Donovan. The angry mobs you envision are in your imagination.\"</p><p>\"No,\" I said softly.</p><p>\"They're in my memory. I saw the best friend I'd ever had driven to his death, Rachel. I have no intention of ending my life that way. I won't.\"</p><p>She lifted her gaze to mine, probed my eyes.</p><p>\"I don't suppose I blame you.\" Then she set her bowl aside, still half filled, as if she'd lost her appetite.</p><p>\"You seem to have given this a lot of thought.\" \"I have.\"</p><p>\"I believe there's one thing you haven't considered, Donovan.\" I looked at her, waited. She rose and paced to the hearth. Bracing her arms on the mantel she stared into the flames. Their light bathed her face, gleamed in her eyes.</p><p>\"You haven't credited me with an ounce of humanity. So it will come as a surprise to you to learn I am, indeed, human, since you seem to believe I'm the same sort of monster you keep calling yourself.\"</p><p>\"I never implied\" -- \"I would never write a paper that would drive a man from his home, force him to give up his entire life. Why would I? For a degree?</p><p>\"Tis hardly a fair exchange.\"</p><p>I searched her eyes, looking for the lie. But I didn't find it. \"None of this is necessary, Donovan. I'll simply find another subject for my paper.\"</p><p>My eyes narrowed. I almost wanted to believe her. \"Lord, but you think I'm lyin' to ya, don't you, Dono- van?\" I had to look away.</p><p>\"You might be lying,\" I said.</p><p>\"Or you might be telling the truth. I can't be sure. And I'm afraid I can't risk taking you at your word.\"</p><p>\"I've never broken my word in my life!\"</p><p>She declared it with such fierceness it nearly shook my resolve. Lowering my head, unable to face her, I whispered, \"I'm sorry.\"</p><p>She faced me, then glanced beyond me toward the door, and when I managed to look at her again, there were tears building in her eyes.</p><p>\"You really are going to keep me here--like a prisoner--aren't you?\"</p><p>\"I have no choice, Rachel.\"</p><p>\"The hell you don't, Donovan O'Roark. The hell you don't. You've been right about one thing, I'll grant you that. You truly are a monster.</p><p>And not because you're a vampire, but because you have no heart. No trust.</p><p>Nor a care for anyone besides yourself. Make your arrangements if you must.</p><p>An' when you're ready to set me free, come fetch me. \"</p><p>Her anger washed over me like a tempest, and I actually staggered backward under its force. Then she whirled and stomped up the stairs, intent, I was certain, on finding her room, slamming its door and throwing the lock. And it would have been a very dramatic exit, too, if she hadn't paused, panting, halfway up the stone staircase.</p><p>Without looking back she said, \"Kindly guide me back to my room, O'Roark. I've no desire to become lost in this mausoleum again.\" I nodded, and slowly mounted the stairs. When I got to her, I touched her elbow, cupped it in my hand, and she pulled away.</p><p>\"I am the way I am because I have to be,\" I said slowly as we moved up the stairs.</p><p>\"It's a matter of self-preservation. If Dante didn't teach me another thing, he taught me this. We're meant to be alone. To live alone. To trust no one. It's the only way we can survive. He forgot his own most important lessons. And he died because of it.\"</p><p>She'd stopped walking, and when I glanced down to see why, she was staring at me, still angry, but there was something else in her eyes as well.</p><p>\"Alone,\" she whispered.</p><p>\"An' just how long have you been living by those words, Donovan?\"</p><p>\"Ever since Dante died,\" I told her softly.</p><p>\"A hundred years...\"</p><p>I shrugged and started walking again, touching her elbow, propelling her upward.</p><p>\"One gets used to it.\"</p><p>\"No, I don't believe one does.</p><p>\"Tis little wonder you've no idea how to behave toward another.\"</p><p>I turned at the head of the stairs, stopped before a large door.</p><p>\"I think you'll like this room better, Rachel. I. I had it decorated myself. \"</p><p>She blinked.</p><p>\"For whom?\"</p><p>I looked at her.</p><p>\"I... for no one. It was a whim. A foolish whim.\" I pushed the door open, turned a knob affixed to the wall, and watched as the gaslights slowly came up. I'd connected the lines while she slept, ignited all the pilots, even cleaned the glass globes. I hadn't really expected her to leave as I'd ordered. But I hadn't expected her to find my resting place either.</p><p>She stepped past me into the room I'd had built for no imaginable reason. I remembered more than Dante's betrayal at the hands of a woman, and subsequent death. I also remembered my friend's happiness, the glow about him when he'd been in love, and believed himself loved in return. Even I had been hesitant to berate Dante or speak my doubts of Laura Sullivan's loyalty aloud. There must be no other happiness in the world like that of love.</p><p>And while I'd existed in utter solitude all this time, my mind had opportunity to wander. To wonder. To dream. What would it be like?</p><p>What if it happened for me?</p><p>And that fantastical dream had inspired me to build these rooms. The suite I'd created for a dream lover I would never know. The rooms I would give to her if she were real. The rooms we would share. Empty.</p><p>They stood empty and likely always would.</p><p>Except for Rachel. For a few nights, they'd be filled with a woman whose beauty was worthy of them.</p><p>\"Lordy, but this is lovely...\" She stepped inside, twirling in a slow circle to take in the sheer mauve fabric draped from the bed's canopy to form curtains. The carpet, a similar color and so thick her feet left imprints as she moved. The glass doors, that opened out onto a stone balcony fit for a princess. The elaborately hand-tooled woodwork, painted gold to match the trim on the velvety wallpaper, and the tiebacks for the mauve drapes.</p><p>Her smile came, despite the situation. And I secretly relished it. The rooms were wasted with no one to enjoy them. That they gave her pleasure pleased some secret part of me.</p><p>\"There's more,\" I told her, taking her hand and drawing her toward one of two doors.</p><p>\"The bath, here.\" She gasped at the sunken tub, the golden fixtures. Plump towels in deep green lined every rack, and deep rugs the same shade covered the floor. Bottles of expensive oils and fragrances lined the shelves.</p><p>\"Who did you dream of entertaining here, Donovan? A queen?\" My lover.</p><p>The one I would never know. But I didn't tell her that. \"There's a sitting room as well,\" I said, going back to the bedroom and pushing open a second door to reveal a room lined with bookshelves, two window seats, a small pedestal table with a pair of cushioned chairs, and a set tee sofa, and rocker. A fireplace laid ready, but unlit, and gas lamps lined the stone walls.</p><p>But she wasn't looking at the room. She was looking at me.</p><p>\"Why all this?\" she whispered.</p><p>\"Why go to all this trouble if you truly intended to live your life alone, Donovan O'Roark?\"</p><p>I shook my head.</p><p>\"As I said, a foolish whim.\"</p><p>\"No, I don't think so.\" She came closer, tipping her head back, searching my eyes.</p><p>\"You're lonely. And tired of being, I think.\"</p><p>\"That has nothing to do with...\" I lowered my eyes, my voice trailing off.</p><p>\"With what? With why you're keeping me here?\" She blinked and looked around her.</p><p>\"You might believe that, Donovan, but I don't think it's true. I think you built this room with every intention of bringing someone here to fill it. To fill... you.\"</p><p>I turned fully now, glancing at the fireplace as if it fascinated me and trying not to tremble in fear at her words.</p><p>\"Thinking that way will only confuse you, Rachel. I need no one. I share my life with no one. You're here because I cannot let you leave. But I will, the moment my arrangements are made and it's safe for me to do so. That's all. There is no more to it than that.\"</p><p>I felt her staring at my back.</p><p>\"All right. If you say so.\" I turned to go. She stayed silent as I stepped into the hall and closed the door. And then I stood there, trembling. God, could she be right? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>All the modern conveniences,\" she muttered, alone in her suite of rooms. He'd gone, left her here on her own, and he probably believed she preferred it that way.</p><p>She didn't. This place was too large, too hollow and quiet. Like a tomb.</p><p>She soaked in a tub brimming with steamy water, and sprinkled some of the aromatic oils in with her. Her bruises needed the pampering, and the heat did ease her aches somewhat. But she'd have to put her torn, dirty clothes back on when she got out, and the idea didn't appeal. She didn't suppose he'd let her go long enough to rush back to her room above the pub and fetch her own things. So would he expect her to spend her entire time here in the same clothing?</p><p>Moreover, did he expect her to spend it alone, in these rooms? He couldn't.</p> <p>She wouldn't stand for that.</p><p>When the water began to cool, she got out, wrapped herself in a thick green towel, and stepped back into the bedroom. The double doors of a built-in wardrobe beckoned, and she went slowly toward them, hesitantly reached out, and pulled them open. \"Lordy...\" The closet nearly spilled over with clothing.</p><p>Satins, silks and lace in a hundred shades cascaded from hangers. To one side were drawers built into the wall, and as she- tugged them open she found nightgowns almost too fragile to touch, and underthings.</p><p>\"But why?\" She touched the garments, pulled the hangers along the rack one by one, saw that the sizes varied as widely as the colors and fabrics did.</p><p>She paused at a long full skirt, paired on the hanger with a white off-the-shoulder blouse. It looked like something a Gypsy might wear.</p> <p>\"Take anything you like.\"</p><p>She caught her breath and whirled, automatically clutching at the towel around her.</p><p>\"Donovan. I didn't hear you come in.\" \"I expected the door to be locked.\"</p><p>She blinked, saying nothing. But as she searched his eyes this time, she saw the pain there. The loneliness. He'd built these rooms on a whim, he'd said. But it was obvious to her he'd prepared them for a woman. Was she real? she wondered. Or only some distant wish he'd allowed himself to indulge in secretly?</p><p>When she still didn't speak, he took a step backward, his hand still on the doorknob.</p><p>\"I'm sorry. I'll leave you alone.\" \"No, don't go.\"</p> <p>He stopped abruptly, looking at her. And she saw his gaze dip beyond her face, very briefly touching on her body, covered only by a towel.</p><p>And she knew her bruises showed, and her hair was damp and tangled, hanging over her shoulders. And still she felt some deep reaction to that gaze.</p><p>As if it were truly admiration in his eyes, and not only surprise.</p><p>\"You... want me to stay?\"</p><p>She turned back to the closet, removing the clothes she'd been drawn to, not looking at him.</p><p>\"If you're going to keep me here, Donovan, the least you can do is entertain me. I'll go crazy if I'm to spend all my time in these rooms alone. Lovely though they are, I'd soon die of boredom.\"</p><p>He lowered his head.</p><p>\"I... thought you'd want to rest.\"</p> <p>\"It's too early to rest. Besides, if I'm to sleep all night and you're to sleep all day...\" She blinked, and tilted her head to one side.</p><p>\"You do, don't you?\"</p><p>He only nodded.</p><p>\"Well, then how are you going to keep to our bargain? When will you have time to tell me all your secrets, Donovan?\" He brought his gaze level with hers quickly, and a frown marred his brow.</p><p>\"So you've decided to write the paper after all?\" She shrugged, draping the clothes over her arm and heading toward the bathroom.</p><p>\"You can believe what you wish. You will anyway. The truth is, I'm curious.\"</p><p>\"That's all?\" he asked.</p><p>She paused in the doorway to glance back at him.</p><p>\"Yes. That's all.</p><p>I'll only be a minute. \" And she closed the door. Quickly, she donned the skirt, long and loose, and moving around her like a spring breeze. Then the blouse, its sleeves dipping low on her shoulders, and the elastic waistline clinging high enough so that a bit of her midriff was visible. She ran a brush through her hair, frowning at the lack of a mirror in the room.</p><p>No mirrors. As if, even in his fondest fantasies, he hadn't allowed himself to imagine a mortal woman filling his loneliness. Only another creature like him.</p><p>She didn't fit the bill in the least, did she?</p><p>She blinked, and then frowned hard. It didn't matter! What made her think such a thing? Oh, but she knew. Was knowing more and more with each moment that passed. He was that gentle soul who'd pulled her from the river, he was that dark angel who'd comforted her when she'd cried in her bed, alone and afraid. And she'd loved him all her life.</p><p>He didn't trust her. She wasn't even certain she could blame him for that.</p><p>She was a Sullivan.</p><p>But she was meant to set it right, she sensed that. She was meant for him.</p><p>Finally, clearing her throat and gathering her wits about her, she stepped back into the bedroom.</p><p>Donovan looked her up and down, blinking as if in surprise. \"It's hardly modern,\" she said, fingering the fabric of the skirt. \"It's lovely. You're lovely.\"</p><p>She averted her face, feeling the heat creeping into her cheeks. ' \"These rooms are so different from the rest of the castle... so is the great hall.\"</p><p>\"Actually, it's only the north wing that's still in disrepair.</p><p>Unfortunately, that's where you ended up earlier. Most of the place has been restored, updated. \" He reached out to move her hair off her forehead, and gingerly examined the bump there, a result of her collision with the wall.</p><p>\"There's even electricity.\" \"But you use the gas lamps?\"</p><p>\"I prefer them. Are you hurting much, Rachel?\"</p><p>\"I'm sore, but only a wee bit. I'll be fine,\" she told him. She eyed the soft golden glow emanating from the fixtures in the room and nodded.</p><p>\"I agree, the gas lamps are far nicer. Will you show me around, then? Um ... the restored parts, I mean. I've no interest in seeing the north wing again.\"</p><p>\"That's good. I'm afraid that wing is off-limits while you're here, Rachel.\"</p><p>She searched his face.</p><p>\"So there are some secrets you won't be sharing with me?\"</p><p>His eyes hooded, he shook his head. The north wing is unsafe, as you've already learned. Stay out of it, Rachel. \" Her curiosity rose to new heights.</p><p>\"All right,\" she said. She didn't think he believed her.</p><p>\"Come.\" He offered his arm.</p><p>She took it. Closed her hand around his upper arm, and felt him.</p><p>Warm, not cold as one might expect. He felt real. He felt like a man.</p><p>Not a monster.</p><p>He had, she mused, the deepest, bluest eyes she'd ever seen, and hair a soft, dark brown, nearly black. She'd been incredibly attracted to him at first.</p><p>And she still was.</p><p>He led her through the main hall of this wing. Showing her other bedrooms, none in use, but many ready for company. Odd, for a man who expected to be alone forever. Then he guided her back down the stairs, where he showed her the library, a huge room lined with books on shelves that towered to the ceilings. Leather chairs sat in pairs by the towering windows.</p><p>\"\" Tis a sad room,\" she said, speaking in muted tones as if she were at a funeral.</p><p>\"Sad? Why do you say so?\"</p><p>She walked forward slowly, pausing between two chairs beside a tall window that was completely enshrouded by heavy velvet drapes.</p><p>\"The seats... they're in pairs. All of them. But you've no one to sit in them with you.\"</p><p>When she glanced back at him, he only shrugged. She turned forward again, and fingered the deep honey velvet.</p><p>\"It's as if the world is a place you'd rather not see. But it's too beautiful to shut out, you know.\"</p><p>Stepping forward, he pulled the cord and opened the drapes.</p><p>\"Yes, I know.\"</p><p>She glanced out, then drew a surprised breath. The windows looked out on a flagstone path that meandered amid lush shrubs and bushes she couldn't identify. In the center, the moonlight glistened on a fountain, ancient, but completely restored. A stone image of some pagan goddess stood on a pedestal, spilling clear water from her outspread palms to splash into the pool spreading below her. '\"Tis beautiful,\" she whispered, but then she drew her gaze away, staring in confusion at the other windows, their draperies drawn tight.</p><p>\"They're only drawn by day, Rachel. As soon as darkness falls, I part them.\"</p><p>He looked past her, into his garden.</p><p>\"I love the night.\"</p><p>\"And the daylight?\" she asked, in a voice that emerged as a bare whisper.</p><p>\"It would kill me. The way it killed Dante.\" He turned to face her.</p><p>\"Would you like to walk in my garden?\"</p><p>\"Yes. Yes, I'd like that very much.\"</p><p>He reached for her hand. He seemed to make a habit of doing that. She let him take it, though, and followed as he led her to the far end of the library, to yet another set of drapes. These parted to reveal French doors, that opened onto the garden.</p><p>\"It's larger than I could tell from the window.\" Nodding, he cradled her hand in his, perhaps unaware of doing so. Or maybe not.</p><p>\"It stretches out on this side, and around to the rear of the castle, reaching nearly to the cliffs.\"</p><p>She fingered a delicate-looking vine that clung to the castle wall.</p><p>Narrow green buds nodded heavily from it.</p><p>\"I've never seen this before.\"</p><p>\"Wait,\" he told her.</p><p>\"We'll sit. Here.\" He pointed to a stone bench with claw feet and lion's heads for arms. They went to it, sat down.</p><p>\"Is that why you rest by day? Because you can't be exposed to sunlight?\"</p><p>He turned toward her.</p><p>\"Not entirely.\"</p><p>She only waited, willing him to answer while he searched her face for.</p><p>something. Her true evil intent, she imagined. \"As daylight approaches our functions begin to slow. By dawn we're usually unconscious, whether we want to be or not. And it's not the sort of sleep from which one can be roused.\"</p><p>\"Like... death?\"</p><p>\"Not so deep as death, I imagine. But far deeper than any mortal's sleep.\"</p><p>\"So if someone were to poke you, or shake you or shout in your ear.....\"</p><p>\"Or set me aflame or drive a stake through my heart,\" he finished for her.</p><p>\"I'd be aware of it, but likely unable to react enough to defend myself.\"</p><p>\"That must be frightening.\"</p><p>\"It's the reason for the coffins, hidden in the bowels of the castle.</p><p>I'm most vulnerable while I rest. and why I'm telling you any of this I can't say. \"</p><p>\"Maybe you're starting to trust me?\"</p><p>\"I trust no one, Rachel. Beautiful mortal females least of all.\" She blinked.</p><p>\"You... find me beautiful?\"</p><p>He stared at her for a long moment, and his eyes seemed to heat as they moved lower, raking her before slowly meeting hers again. Then he simply turned away, facing the castle, and the curious vines. \"Look.\"</p><p>She looked. Then she caught her breath as one by one, the green buds seemed to split. Bit by bit they opened, milk-white petals unfurling, their faces turning up to the moon as if in welcome. Welcoming the night.</p><p>\"I've never seen anything like them.\"</p><p>\"They're very rare. Moon lilies. I had them imported.\"</p><p>\"They're beautiful.\" As she looked around, she noticed other plants in bloom.</p><p>\"I have no flower that closes up by night. Everything either remains open through the dark hours, or only blooms in darkness.\"</p><p>\"It makes sense. Day lilies or morning glories would be wasted here.\"</p><p>He nodded. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rachel yawned, quickly covering her mouth with her hand. \"It's late,\" he said.</p><p>\"You've had an exhausting day. You should rest now.\"</p><p>She tilted her head to one side.</p><p>\"I can always sleep late in the morning.</p> <p>\"Tis not as if I'll miss anything.\"</p><p>He nodded, getting to his feet as she did, and guiding her back along the paths. She trailed one hand through the water of the fountain as they passed, and he watched a little oddly as she did. Then they were at the doors, and he was ushering her inside. He pulled the doors closed behind them. Reached for the lock, one that would have to be opened with a key.</p><p>\"Donovan,\" she asked, and he paused, and turned to face her instead. \"Have you truly been alone all this time?\"</p><p>He frowned.</p><p>\"I deal with others only when I'm forced to.\"</p> <p>\"Well, that's not exactly what I meant.\"</p><p>\"What then?\"</p><p>She lowered her gaze.</p><p>\"I ... I mean ... have you been... you know.</p><p>Without a woman? All this time? An entire century? \" He blinked, gave his head a shake.</p><p>\"What odd questions you ask, Rachel,\" he said.</p> <p>\"Why do you want to know?\"</p><p>She shrugged, and realized she'd been breathlessly awaiting his answer.</p><p>\"I... perhaps I shouldn't have asked something so personal.\"</p><p>She met his gaze, though, battling the turmoil in her belly.</p><p>\"But you did say you'd tell my anything I wanted to know.\"</p><p>\"I did, didn't I?\" His voice was no longer gentle. In fact he seemed angry.</p><p>He gripped her arm, his touch careful, but firm and possessive, as he led her onward. And she noticed that he seemed to have forgotten all about locking that door.</p><p>But she wasn't sure what had replaced it in his mind, and that frightened her more than anything ever had.</p> <p>\"You didn't tell me, Rachel. Why did you ask what you did?\" She lifted her chin.</p><p>\"I apologized for that,\" she said.</p><p>\"I was only curious.\"</p><p>\"I think it was something more than that.\" I took a step toward her, but stopped when she backed away.</p><p>\"I don't know what you mean.\"</p><p>\"Yes, you do. You're playing a dangerous game, Rachel. Perhaps you don't realize how dangerous.\"</p><p>She shook her head.</p><p>\"I didn't mean\" -- \"Since you're so curious about sex, I'll tell you. It's very different, sex with a vampire.\"</p><p>Lowering her head, her cheeks flaming, she closed her eyes.</p><p>\"I don't want to hear this.\"</p><p>\"You asked. You'll hear the answer. Look at me, Rachel.\" Her jaw tight, she did as I asked. And I sent my will into her mind, took control, as easily this time as flicking a switch.</p><p>\"Come here.\" She opened her mouth as if to refuse, then blinked in shock as her body disobeyed. Her feet, scuffing the floor, propelled her forward.</p><p>\"Closer,\" I told her, and she came. She stood very close to me. Head tipped back, eyes frightened, but aroused, glistening with a titillating mixture of fear and desire as she waited. And I knew why she responded this time when she hadn't before. Because it was what she wanted.</p><p>I lifted a hand to her face, touched her cheek very lightly, and trailed my fingers downward. Over her jaw, and chin, and then gently down her neck, pausing to feel the heady beat of her pulse there.</p><p>Desire rushed through me. It wasn't supposed to. I hadn't planned it this way.</p><p>My fingers trailed lower, touching delicate collarbones, tracing her sternum, and then flitting lightly over one breast. I felt her response, the soft breath she drew, the tightening of her nipple beneath my fingers. But more than that, I felt my own reaction. She'd angered me. her power over me, the danger that power represented. My own apparent inability to remain untouched by her, to resist her allure. I'd meant to frighten her away, to show her how dangerous I could be so she'd stop tempting me with her eyes, and her words, and every damned breath she drew.</p><p>Instead, I was only making it worse.</p><p>\"Please....\"</p><p>It was a whisper, a plea. I drew my hand away, but my fingertips tingled still. I wanted her.</p><p>\"Playing on my desires is a risky game, Rachel,\" I told her.</p><p>\"Because I can touch your mind with mine.\" I stared down into her eyes.</p><p>\"Kiss me, Rachel.\"</p><p>She leaned up, her lips trembling, but parting, as they touched mine.</p><p>Then touched them again. I stood motionless for a moment, but then shuddered and bowed over her, taking her mouth, possessing it, invading it, as she pressed her body tight to mine. She tasted like honey. Her effect was like that of some addictive drug, and my craving for her more powerful than anything I'd ever known.</p><p>When I finally lifted my mouth away from hers, I was breathless, my heart pounding. But hers was as well.</p><p>Drawing a steadying breath, I delivered the final lesson.</p><p>\"Do you want to know the worst of it, Rachel? The bit of knowledge that will frighten you the most?\"</p><p>She nodded, only once.</p><p>\"Even with this power, I couldn't make you do anything you didn't truly want to do. Your will is too strong for that.\" And with that, I released her, closed my mind off again, broke the connection. She stood there, staring at me, but the fire in her eyes came as much, I thought, from anger as from the desire that still lingered there.</p><p>\"You... you bastard.\" It was a whisper.</p><p>\"I thought I behaved with a great deal of restraint. I didn't want to, Rachel. I don't think you did either.\"</p><p>She looked away.</p><p>\"Are you enjoying this, Donovan? Trying to humiliate me?\"</p><p>\"I was only making a point. Don't try to seduce me into letting you go, Rachel. I won't be played that way. I won't be manipulated. I may desire you but I'll never care for you. Never. I'm incapable of it.</p><p>But if you insist on arousing my desires, I won't be denied. I'll have you.</p><p>\"</p><p>She glared at me, her eyes snapping with a fire I thought I'd extinguished by now.</p><p>\"If the only way you can have a woman is by taking control of her mind, then I pity you, Donovan O'Roark.\" I opened my mouth to reply, only to find myself unable to find words.</p><p>\"And if you think what you've accomplished is so impressive, you're a blind man.\" Without another word, she gripped the elastic waistband of her blouse and tugged it over her head. And then she stood there, breasts bared and perfect, plump and firm, swelling toward me like some forbidden fruit of Eden.</p><p>She moved closer to me.</p><p>\"Go on,\" she whispered.</p><p>\"Touch me.\" She gripped my hand, and drew it upward, pressing my palm to her breast.</p><p>I closed my eyes as the warmth of her filled my hand. Air hissed through my teeth, and I felt the heat stirring, bubbling up inside me like a volcano, long dormant, about to erupt. I told myself to turn away, to leave the room, but I couldn't. My hand moved, caressed, squeezed. And then my other hand rose to do likewise, and my eyes fell closed as the desire became overwhelming.</p><p>Her breath stuttered out of her, her head tipping backward. Exposing her neck, satin-soft and utterly tempting.</p><p>Lying before me like an offering to a dark god. An offering I wanted to take.</p><p>\"So you see?\" she whispered.</p><p>\"This power you have over me... it isn't only you who wields it. I can as well. And if it was seduction I had on my mind, Donovan, I'd have done more than ask a simple question of you.\"</p><p>And with that she took a quick sharp step backward, away from me, and left me standing there, panting, aroused to a state near madness, wondering if she had a clue what she had done.</p><p>\"You're a fool.\" I snagged her waist, and jerked her closer, one hand pushing her head backward as my mouth parted.</p><p>Her body crushed to mine, I bent over her and sank my teeth into her tender throat. She gasped, stiffened, but then as I suckled her, extracting the precious fluid from her body, she uncoiled. Her body melted in my arms, and her head fell back farther. She arched her neck, pushing against my mouth.</p><p>\"Yes,\" she whispered.</p><p>\"Oh, yessss...\"</p><p>I drew away, not sated, only having sampled the barest taste of her. wanting more. Panting with wanting more.</p><p>Her hand stroked me, caressing the throbbing hardness between my legs, and in spite of myself, I arched against her touch. But I couldn't do this.</p><p>Couldn't take her the way my body was screaming for me to do.</p><p>Because there was something more than desire here, something that frightened me. This entire demonstration of mine had backfired, hadn't it? She was the one who was supposed to be frightened. I gazed down into her eyes, and knew she wasn't. Not really. Oh, there was some fear in her eyes, but it only served to enhance the wanting there.</p><p>As if she could see the indecision, my hesitation and my need to leave this room, she reached for the skirt, unfastened it, began to push it lower.</p><p>I closed my eyes, turning my back to her.</p><p>\"This... is not going to happen.\"</p><p>\"You want it, too.\"</p><p>\"Yes. I want to pierce your body with mine and take you. Just as I want to drain every drop of blood from your succulent throat, Rachel.\"</p><p>\"You wouldn't hurt me.\"</p><p>I spun around.</p><p>\"What if hurting you is exactly what I want to do?\"</p><p>\"You don't.\" She shoved the skirt to the floor, stepped out of the panties, and came to me again, her hands sliding up the front of my shirt.</p><p>I gripped her wrists and stared down at her. Naked, aroused, all but begging me to take her. So aroused she barely knew what she was doing. I stilled her hands when she started unbuttoning my shirt.</p><p>\"Stop it, Rachel.\"</p><p>She froze, blinking up at me. When I released her hands she lowered them to her sides, and I noticed her trembling, head to toe. She turned her back to me, and not knowing what else to do, I left the room.</p><p>What had she done?</p><p>Oh, God. Rachel flung herself onto the bed, hiding her face in the satin coverlet, battling tears of utter shame.</p><p>\"It was him,\" she muttered.</p><p>\"He made me behave that way. He...\" But she knew it wasn't true. He hadn't forced anything on her. She'd acted on her own, except for that one brief interlude when he'd meant to demonstrate his alleged power over her. And she'd had to reciprocate--to salvage her pride by showing him that she had power, too. Feminine power to bend the man to her will.</p><p>And she had. Perhaps too much, because he'd lost control. She'd felt it, sensed it. And understood it because it had happened to her as well.</p><p>She'd behaved like a well-trained whore. Who was this woman in her body? Not her, not Rachel Sullivan. She'd never act that way with any man. Never.</p><p>But he wasn't any man. He was her guardian.</p><p>Wasn't he? What if she was wrong?</p><p>She had to get out of here. Now, tonight. She couldn't trust herself to remain near him, couldn't think straight this close to him. What was this thing she was feeling, this certainty that he was meant to be hers, now and forever? Was it foolishness? A childish dream? She sat up slowly, wiping her eyes and scanning the room for her clothes.</p><p>Heat flooded her face when she spied them thrown carelessly on the floor.</p><p>She'd done that. Undressed for him, unashamed, brazen. No, it wasn't her, but some wild woman who'd been living silently inside her. Hiding, and choosing now to emerge--the worst possible time.</p><p>No, she had to leave. She tugged on her clothes, paced to the door and cracked it open, just slightly. He was nowhere in sight. But loud, crashing music came up from below--the great hall. Beethoven, she thought. Violent in its power.</p><p>She crept into the hall and toward the stairs, then down them only a bit.</p><p>Just enough so she could see him in the great hall. He stood near the blazing hearth, head lowered, eyes closed. Utterly still as the music smashed over him.</p><p>Licking her dry lips, she moved lower, reaching the bottom of the stairs, not taking her eyes off him until she slipped around the corner. He never moved, never flinched, or even raised his head.</p><p>She'd moved in near silence, but somehow she'd expected him to know.</p><p>To be aware of her, as if crediting him with some sixth sense he couldn't possibly . Or maybe he could. But he didn't notice her.</p><p>She'd planned to make her escape tomorrow while he . slept. But she couldn't wait, not now. He was too confusing. and too angry at her for her feelings.</p><p>Her hand rose to touch the spot where he'd fed at her throat, and she felt the tiny wounds there. Not sore, but tingling with erotic awareness, so tender now, so sensitized. Just touching them reawakened the memory of his kiss, his touch. his mouth working her there.</p><p>She had to pause, lean back against a cool stone wall and draw deep breaths into her lungs. She wanted him. She desired a man she truly didn't know, though it felt as if she'd always known him. A vampire, but that made no difference to her.</p><p>She couldn't stay, because Lord only knew what she might do if she stayed.</p><p>If he came to her room again, kissed her again. But he wouldn't. He didn't want to care for her, he'd made that clear.</p><p>Straightening, she squared her shoulders, and followed the corridor to the library. Then with one last glance behind her, to confirm he hadn't followed, she went inside. The French doors remained as they'd been before.</p><p>Closed, but unlocked, and a moment later she was outside the castle. Free, in his beautiful garden of night.</p><p>For a moment she hesitated. It was such a contradiction, a man like him, having a place like this. As S he was capable of appreciating pure beauty.</p><p>As if he had the soul of a poet, and not a determined hermit.</p><p>Shaking that thought away, she walked around the castle, each step faster than the one before, until at last she was running. Her hair blowing in the night wind as she pushed her muscles to their limits, racing through the darkness along the path, ever farther from the castle and toward the road that led to it. A road that meandered among woods, and later fields, and the village itself. Free. She was free at last.</p><p>And that was when she heard the hounds. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Hounds? She didn't understand. Not at first. But then she heard the men's voices in the distance, village men. And then the hounds drowned them out. Crying, baying in a horrific cacophony of noise that chilled her blood.</p><p>Mamey Neal's hounds, she thought vaguely, knowing the animals were trained hunters. But they didn't hunt game, they hunted men. Mamey trained them for that purpose. So if they were out tonight they must be after some criminal.</p><p>Then why were they heading toward the castle?</p><p>Donovan?</p> <p>She swallowed hard, but her throat was dry. And then she stood there, frozen in fear, as the hounds rounded a curve in the road and came into sight.</p><p>Running, bearing down on her. A horde of galloping, baying death. She whirled, panic taking hold as she surged into the woods, even knowing they'd offer no protection. But the dogs were too fast, too determined. One leapt, and his forelegs clawed her back, propelling her forward. Instinctively she rolled to her back, but the beast was upon her, teeth flashing. And then, suddenly the dog was hurled away.</p><p>Donovan. He stood above her, surrounded by the dogs, wielding a club as they lunged and snapped at him.</p><p>\"Go,\" he shouted.</p><p>\"Run for the castle. Go!\" One snatched his arm in horrible teeth. She heard fabric tearing, saw blood as Donovan clubbed the animal uselessly.</p> <p>Shaking, dirty and terrified, she struggled to her feet. And then she staggered toward the road. But she stopped as Donovan went down and the dogs leapt in for the kill. Screaming, she crouched low, scooping up hands full of debris and hurling it at their tawny bodies to get their attention.</p><p>\"Here, you filthy beasts! Here! Come!\" One dog turned toward her snarling.</p><p>\"Come for me then,\" she cried, and then she turned to run, knowing they'd follow.</p><p>And they did. She made it to the road with the hounds on her heels, now.</p><p>But the men were in sight, and she cried out to them.</p><p>\"Marney Neal, call off your hounds! Call them off!\"</p> <p>\"Sakes, 'tis Rachel!\" someone said. But then the dogs were on her, knocking her down once more.</p><p>One of the men raced forward, shouting commands at the dogs.</p><p>Thankfully, they were trained well enough to obey at once. The dogs fell away from her as one, and sat as docile as pups, awaiting the word of their master. And then Mamey himself, beer on his breath, was leaning over her, helping her to her feet.</p><p>\"Rachel, fer the love of God, where've ye been? We've been worried to death for you! Are you harmed, girl? Are you harmed?\" She let him help her to her feet.</p><p>\"What in the name of God were you thinking, turning those killers lose on me like that, Mamey Neal! I should have you jailed!\"</p><p>i \"Nay, 'twas for you I done it, child. You disappeared! and we feared the murderin' O'Roark had taken you to his : lair!\"</p><p>\"What utter foolishness!\" She brushed the dirt and twigs i from her clothes, and sent a furtive glance toward the j woods where Donovan must still by lying. Perhaps dead, ; already.</p><p>\"Is it, Rachel?\" Mamey eyed her suspiciously.</p> <p>\"I take , the hounds through these woods every night since that bastard has been in residence. Just to be sure he stays within his castle walls, and doesn't venture out to make victims of my neighbors.\"</p><p>\"You're a superstitious fool. Donovan O'Roark is harmless.\" \"Then what are you doin' here wandering these godforsaken lands? And where have you been these past two nights, Rachel?\" She lifted her chin, met his eyes. ' \"Had I agreed to wed you as you wanted, I'd feel that to be your business, Mar- they Neal, but since I turned you down I've nothing to say.\"</p><p>\"You've been at the castle. As his lover?\" he asked. \"As a guest, Mamey.</p><p>No more than that. Mary knows full well my interest in the legends associated with Dono- van's ancestor. He's offered to help me with my research.\"</p><p>\"Indeed!\" Marney huffed, and eyed the castle as if it were something demonic.</p><p>\"Well, you're found now. Come with me, back to the village.</p><p>Mary will be relieved to see you there, and well. \" She glanced again toward the woods, then quickly at Mamey again.</p><p>\"No. I'll return to the castle tonight. Tell Mary I'm fine and will contact her shortly.\"</p><p>He set his feet, hands on his hips.</p><p>\"I'll not have it.\" ; \"You have no say in it. Now kindly take your hounds and go home, Marney, before I decide to inform the all1 thorities about this deadly pack you set on me. They nearly ', killed me. No doubt the law would see them all shot just to preserve the safety of the citizens.\"</p><p>\"You wouldn't\" -- \"I will, I swear on my mother's grave. Unless you leave now, I will.\"</p><p>His eyes held hers only for a moment. Then lowered.</p><p>\"You've changed, Rachel Sullivan. The States have done this to ya, no doubt.</p><p>Or perhaps 'twas that monster in the castle.\"</p><p>\"I've grown up. I won't have you or anyone running my life for me.</p><p>Not anymore. \"</p><p>\"Fine. Ye deserve whatever fate befalls ye. But mark my words, Rachel, the man of that castle is no human being'. He's a monster, and more dangerous to you than my dogs ever could be.\" He turned to go, with his dogs leaping up to follow, tails wagging. Harmless pets.</p><p>Rachel waited until they were out of sight. Then she turned and ran back into the darkness of the trees, falling to her knees beside the dark shape on the ground.</p><p>\"Donovan?\"</p><p>He opened his eyes, his face pain-racked and pale in the night.</p><p>\"You could have gone with him,\" he whispered.</p><p>\"Aye, I could have.\" She tore strips from her skirt and tied them tight round the wounds to stanch the bleeding. She'd never seen so much bleeding.</p><p>\"Can you stand? Walk?\"</p><p>He tried to get up, faltered, and Rachel gripped him quickly, helping him to his feet. Then, pulling his arm around her shoulders, she propelled him forward, through the woods toward the castle. The road would be easier, but she'd prefer they not be seen by prying eyes.</p><p>Especially Marney Neal's.</p><p>\"There's a trail to the left,\" he managed, though he spoke through gritted teeth.</p><p>\"A shortcut.\"</p><p>She took him that way, found the trail and followed it, but felt his eyes on her face.</p><p>\"Why?\" he asked her, breathless, still bleeding.</p><p>\"Don't ask foolish questions, Donovan O'Roark.\"</p><p>He leaned on her heavily, and when he spoke, his words were slurred.</p><p>\"Is it foolish to ask why? You were free. It's what you said you wanted.\"</p><p>\"I wanted my freedom, yes,\" she said.</p><p>\"But not at the . cost of your life.\" She shook her head.</p><p>\"You jumped into the midst of those hounds as if you thought yourself invincible. You could've been killed.\" He said nothing, and she tugged him faster.</p><p>\"Don't be telling me again how you can care for no one besides yourself, Donovan O'Roark, for 'tis a bald-faced lie an' you know it.\"</p><p>\"No\" -- ' \"No? No, you say? Why, then, would you risk your own life to save mine?\"</p><p>He shook his head. She couldn't see his face, because he kept it so low. Or perhaps he had no choice, too weak to hold it upright.</p><p>\"You're no more selfish than you are a hermit,\" she said.</p><p>\"You're selfless, and more lonely than you even realize. An' I'll tolerate no more of your nonsensical lies. I've seen through this mask you wear, Donovan, and you can't don it again.\"</p><p>\"You're seeing what you want to see.\"</p><p>Her hand felt damp, and she looked down to see the blood dripping from it where she clung to him.</p><p>\"Damnation, why do you bleed so?\"</p><p>\"It... it's part of what I am. Bleeding to death is one of the few ways I can die.\"</p><p>\"That and sunlight,\" she whispered, glancing at the sky between the trees.</p><p>\"There's plenty of time before dawn, Rachel. More's the pity. It is only with the day sleep these wounds will heal. Until then\" -- \"Until then I'll stay beside you and be sure you don't bleed to death,\" she told him.</p><p>It shocked me. Astounded me, really. But that was precisely what she did.</p><p>My unwilling captive vanished, the rebel was gone. Her stubborn determination, her boundless energy, was directed toward helping me now, rather than escaping me. She eased me onto the set tee in the great hall, then ran back toward the door. For the briefest of moments I thought she would run from me now that she'd seen me safely back to the castle. I was utterly bewildered when, instead, she turned the lock.</p><p>\"What\" -- \"For Mamey Neal and those narrow-minded fools like him,\" she said, back at my side now.</p><p>\"Those hounds were meant for you, not me, Donovan. You must know it. An' those men would have stood gladly by an' let them tear out your heart had it been you and not me on that road.\" She knelt on the floor beside me, shoving her hands through her hair, her cheeks pink with exertion, or frustration, or anger.</p><p>\"Lordy, how do you live like this?\"</p><p>It wasn't a question she expected me to answer. Already she knelt beside the set tee tugging my shirt away to reveal the jagged tear in my side. Tearing the skirt she wore, until little remained but shreds, she packed the wound, and wrapped strips around my waist, tying them so tightly I could scarcely breathe. Her every touch brought on the most intense pain--and the most excruciating pleasure-- I'd ever known. I thrilled at her hands on me, no matter the reason.</p><p>\"Why do you come back here at all, Donovan,\" she asked.</p><p>\"There must be places in the world where you're safe.\"</p><p>\"There are.\" I looked around the hall, my gaze straying to the hearth where Dante and I used to sit and talk for hours on end, or read in companionable silence while the fire danced.</p><p>\"But this place is... dear to me.\"</p><p>\"Then move it.\"</p><p>I only frowned at her.</p><p>'\"Tis done all the time. Rich folk buying castles and having them moved stone by stone to the place of their choice.\" I shook my head slowly.</p><p>\"It wouldn't be Ireland.\" \"No.\"</p><p>\"You came back, Rachel. Despite the narrow- mindedness, despite the unwanted attentions...\"</p><p>Her head came up sharply.</p><p>\"An' what would you know of that?\"</p><p>\"I know. Mamey Neal would do well to know when to give up.\" I smiled slightly, despite the burning pain in my side.</p><p>\"Before you do him bodily harm.\"</p><p>\"Aye, an' he's lucky I didn't tonight.\" She eyed my skin, shaking her head at all the blood.</p><p>\"You've watched me, haven't you?\" So she knew.</p><p>I'd sensed it before. That she was aware somehow of my presence those nights when I'd drawn near to her, pulled as if by some irresistible force.</p><p>\"There was a time, long ago,\" she whispered, dabbing now at the blood with a dry bit of crumpled fabric, 'when I nearly drowned in the river near my home.</p><p>Someone plucked me out, breathed into my lungs, and brought me back. But even as I lay there, choking, he vanished. \"</p><p>She stopped wiping and met my eyes. \"\" Twas you, wasn't it? \" I lowered my head.</p><p>\"And later, after my folks passed on. When I lay awake, frightened and alone, someone came to me in the darkness.</p><p>Just a dream, I thought when I was older. But 'twas no dream, was it, Donovan?</p><p>\"Twas you, the man who told me he was my guardian angel, that I'd be safe, always.\"</p><p>I released a long, slow breath.</p><p>\"It was.\"</p><p>\"Did you ever know what that meant to me? Did you know how I slept soundly, how I believed it, how I clung to it? My parents were gone, but I had someone, still. Someone watching over me as my dear ma had, protecting me as my da had done.</p><p>\"Twas the second time you saved me, you know.\"</p><p>\"No,\" I said.</p><p>\"I didn't know.\"</p><p>\"Now you do. Quite a thing for a self-servin' monster to do, wasn't it, Donovan?\"</p><p>\"You don't understand,\" I began. But I wasn't certain I could explain. I didn't understand it either. Not fully. \"Make me understand then.\"</p><p>Nodding, I shifted to one side, so she could sit beside me on the edge of the set tee I saw her gaze shift quickly to the wound again, as if to assure herself my movement hadn't started the bleeding up again.</p><p>\"Dante told me of our nature, long ago. He told me that only certain mortals can become... what we are.\"</p><p>Her intense expression told him how interested she was in hearing more.</p><p>\"As a mortal, I had a rare antigen in my blood. It's known as belladonna.</p><p>That made me one of those few, one of the Chosen, as we call them.\"</p><p>\"That's fascinating. I had no idea...\"</p><p>\"I know. Vampires are... aware of mortals with the antigen. We sense them, just as Dante sensed it in me. And there's more. There's a ... a connection. For each vampire there's a mortal somewhere, one with the antigen, for whom that connection is stronger. So strong that we're drawn to them.\"</p><p>\"And... were you that mortal for Dante?\"</p><p>I 'i I nodded.</p><p>\"Yes. I never knew it, but he watched overj me for most of my life. If trouble had come, he'd have protected me. And if I'd needed help, he'd have sensed it, wherever he might have been, and he'd have come.\" ; She lowered her head, made a noise of disbelief in her throat. I \"You don't believe me,\" I stated. Slowly, she raised her eyes to mine.</p><p>\"If the legends are 3 true, Donovan, he attacked you as you walked alone one: night. He made you into what he was. If you call that protection, then\" -- \"I was dying.\"</p><p>She blinked fast. Her eyes widened.</p><p>\"I didn't know it, of course, but Dante did. I'd been feeling the symptoms for weeks. Weakness, dizziness, blacking out for no reason.</p><p>I had no idea what was wrong, and I'd thought it was something that would pass. But it wasn't. \"</p><p>\"How do you know?\"</p><p>I didn't answer that. Couldn't. Not yet. It would be too cruel to give her so much to deal with all at once. I couldn't tell her that mortals with the antigen always suffered the': same fate--an early death. I'd been very close to my end. ; \"I simply do,\" I told her instead.</p><p>\"There's no doubt.\" I She stared down at me.</p><p>\"Then... you'd have died if he hadn't... done that to you.\"</p><p>\"Without a doubt.\" : She nodded, deep in thought.</p><p>\"But he could have given you the choice. He never asked you to decide.\"</p><p>I smiled slightly, remembering.</p><p>\"Dante was never one to take time about acting. He was impulsive. Action first, thought later. But there were other reasons too. Had he told me, I likely would have repeated it to my parents, or the village priest. And some secrets simply must be kept, Rachel.\"</p><p>She drew my bloody shirt down over my body, deep in thought. I saw the moment she made the connection, because her eyes widened and met mine.</p><p>\"I have the antigen, don't I?\"</p><p>I nodded.</p><p>\"You are the mortal I'm driven to watch over, Rachel. It's a part of who--of what I am. Don't go attaching any noble motivations to it. It's simply an irresistible urge. I couldn't ignore you if I tried.\"</p><p>\"So saving me from the hounds...?\"</p><p>\"A reflex. Nothing more.\"</p><p>She lowered her eyes.</p><p>\"I'm not sure I believe you.\" \"Why not?\"</p><p>She shrugged.</p><p>\"I think there's an element of choice involved, Donovan.</p><p>You can't tell me that it was impossible for you to choose not to put yourself into the jaws of those hounds. \" She tilted her head to one side.</p><p>\"Or not to come back here at all. But you did. You came back because of me, didn't you, Donovan?\"</p><p>I lowered my head.</p><p>\"Perhaps that was part of it. But I also came back because of Dante.\"</p><p>\"Dante is dead.\"</p><p>\"Yes. But I don't know where...\"</p><p>Frowning, she studied me.</p><p>\"Where? Where he-lies, you mean?\" Sighing, I absently ran one hand over the wound in my side.</p><p>\"When they came for us, put their torches to the castle walls, the sun was just beginning to rise. We had no choice but to run. Flames... devour our kind very quickly, you see. We both knew our only hope was to make for the relative shelter of the woods, where the sun's light wouldn't penetrate quite as quickly. And perhaps that would give us time to find shelter. A few minutes, at best, but perhaps enough.\" She nodded, urging me with her eyes to go on.</p><p>\"When we emerged, they were waiting. We could have stood and fought, and likely defeated them all.\"</p><p>\"But... I thought there were dozens...\" I nodded.</p><p>\"We're very strong, Rachel. We could have fought, but the sun allowed no time. We had to run. They pursued us, though, and we had no choice but to split up. t I ran in one direction, Dante in another. The mob... they went after him.\" \"And what happened to you?\" ' \"I made it to the forest, and the hay field beyond. I saved myself by burrowing deep into a haystack and remaining there until nightfall. It offered thin protection, but I survived. Weak, burned in many places, but I lived.\" ; \"And Dante didn't,\" she said softly.</p><p>\"I returned to the castle ruins by night... for weeks. Knowing that's where he would look for me if he were : alive. Even after I left the country, I came back periodically to wait for him here. I had the place rebuilt, just in case. \" , But he never came. Now I only want to know where he ; died. \"</p><p>\"Will you put a marker there?\" she asked, her voice quiet. \"A garden,\" I told her.</p><p>\"Something as alive as he was.\"</p><p>\"You loved him very much. Yet you claim you care for no one.\" \"I loved him,\" I said.</p><p>\"He was the last person I ever let myself care for. The lesson his death taught me was too hard won to forget.\"</p><p>I felt heavy. Tired.</p><p>\"If you can't love,\" she asked, \"then how can you live?\" \"It isn't so hard.\"</p><p>She closed her eyes.</p><p>\"I'm like you,\" she said.</p><p>\"In more ways than I realized.\"</p><p>\"How?\"</p><p>But she only shook her head as I slipped into slumber. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ohe didn't realize the time until he went still, and his eyes fell closed. It wasn't like death, this slumber of his. More like a very deep sleep.</p><p>She'd told him she was like him. Only now did she realize how much.</p><p>She hadn't loved, either. With one exception. Since her parents had died there had been, only one being she'd truly loved. And as she'd grown older, she'd convinced herself that love had only been a dream.</p><p>But the love for that dream angel had remained.</p> <p>And now she knew he was real. Her savior, her dream, was real. And damp with his own blood, in torn, dirty clothes. He'd watched over her as a child. Taken care of her more than once. She could do no less for him.</p><p>But she could never tell him. He must never know how much she'd loved him in her youth. The fantasies she'd had. Because he was afraid of love. She'd never known anyone so afraid.</p><p>Slowly, Rachel got up off the set tee and headed to her own rooms.</p><p>She found clean washcloths and soft towels, and fetched a basin of warm water. Then she returned to Donovan. He'd object to her caring for him this way if he were awake. But he wasn't awake. She took off his shirt, moving him carefully, half afraid doing so would jar him awake, or worse, start him bleeding again. She eyed the bandaged wound. No red trickle emerged. Good.</p><p>But her gaze slid slowly upward, over his flat belly, and muscled chest.</p> <p>His dark nipples intrigued her.</p><p>Her throat went dry. She looked away. Dipping the soft cloth into the water, squeezing it out, she pressed it to his skin. But she could feel him underneath it. Taut and hard. Masculinity was like an aura emanating from his flesh. Almost a scent, it drew her. She leaned closer, over his chest, her face near enough so she could feel the heat rising from him and touching her. Closing her eyes, she inhaled deeply. And something stirred down in the pit of her belly. Something she knew, recognized, because she'd felt it before. Whenever this man was near her she felt it.</p><p>But she had no business feeling desire for a man incapable of feeling anything beyond desire in return.</p><p>She felt it all the same.</p><p>\"God, help me,\" she whispered.</p><p>\"But I do want you, Donovan O'Roark.\"</p> <p>She closed her eyes, tried to get herself under control. Dipping the cloth in the now pink-tinted water, she squeezed it out again, and carefully took away her makeshift bandages from his wound, to clean it properly.</p><p>Then she squinted, dabbed the blood away, and looked again. It. it was smaller.</p><p>It was shrinking. Amazed, she watched as, in slow motion, the wound's edges pulled together like some kind of experiment in time-lapse photography. It took several minutes, but bit by bit the skin seemed to regenerate.</p><p>Leaving a pucker, and then even that smoothed itself out and faded away.</p><p>Blinking in shock, she washed the spot clean, searching for traces of the tear, but it was gone. Gone. In something like awe, she drew her fingers over the new, healthy skin.</p><p>\"It's unbelievable,\" she whispered, and flattened her palm against his warm flesh. When his hand fell atop hers, she jumped and quickly looked up at his face.</p><p>But his eyes remained closed, his breathing shallow, barely discernible. But his hand closed around hers in his sleep. A sleep in which he'd told her he was beyond responding to any stimulus. He'd been wrong.</p><p>And now the hand of this man, who claimed he didn't need or want anyone in his life, clung to her own, and for the life of her, she wouldn't have taken hers away.</p> <p>I woke to a feeling of warmth spread upon my chest. And then as my senses sharpened, I knew that warmth was her.</p><p>Rachel was on the floor, her legs curled beneath her, while her head rested upon my chest. Her lips. barely touching the bared skin of it. One arm spanned me, hand on my shoulder. Her other hand was tucked beneath her, held tightly in my own.</p><p>I flexed and relaxed my fingers, to confirm what seemed unlikely. But it was true. I was the one holding her hand like a lover. Not the other way around.</p><p>I couldn't lie like this. not for much longer. Her soft breaths whispering over my skin were driving me to the edge of madness. I was hungry. And she was too near. Too. Her fingers spread on my shoulder, then kneaded like a happy cat's claws. She moved her face, as if burrowing, only my chest didn't give, and her lips brushed over it like fire. The groan that rose up from the depths of me was a rumble.</p><p>A warning. The same rumble one might hear from a volcano as the pressure within builds. An eruption was dangerously near.</p><p>She stirred, satin hair tickling my skin as she sat up, batting huge dark eyes at me, myopic until she blinked the sleep haze away and brought me into focus. Then she smiled.</p><p>\"It healed,\" she told me.</p><p>\"I told you it would.\"</p><p>\"I know, but seeing it with my own eyes. twas amazing, Donovan.\" I nodded, trying to ignore the fresh-wakened glow in her cheeks and the moisture making her sleepy eyes gleam. The tousled hair. She must look just like this when she's been thoroughly satisfied by a skilled lover, I thought. Just like this.</p><p>I tried to sit up. She noticed, and got off me so I could, and I instantly regretted the loss of her so near. But when she got to her feet, it was to press her hands to the small of her back and arch.</p><p>She grimaced, groaned and rubbed, so I realized she'd spent a horribly uncomfortable day on the floor when she'd had a bed fit for a queen only yards away.</p><p>\"Rachel, why on earth didn't you go to your room?\"</p><p>She kept her hands where they were, fingers massaging herself. But her head came up fast.</p><p>\"An' leave you here by the front door, unconscious and unprotected? Not likely!\"</p><p>I lowered my head. The smile that wanted to come to my lips was a dangerous one, I knew. No sense encouraging her foolish notions.</p><p>\"You'd already locked the door.\"</p><p>\"Mamey Neal could make quick work of that lock, and '{wouldn't be the first time.\"</p><p>I went still, sought her eyes, but she kept them averted.</p><p>\"You say that as if you know.\"</p><p>\"Aye.\"</p><p>The bastard.</p><p>\"What lock was it he made quick work of, Rachel?\" ' \"The one on my room at the pub. Eight years ago, before I left for the States.\"</p><p>Her voice didn't break at all. Mine would if I spoke again. It would break or emerge as the growl I felt building up. I'd kill the bastard. I'd rip out his heart and-- \"You're lookin' rather murd'rous, Donovan,\" she said softly, studying my face.</p><p>\"An' truly, there's no need. Mar- they's a thorn in my side, but a harmless one. He'd never have gone so far if he hadn't had a wee bit too much ale.</p><p>An' I daresay he sobered up some about the time I shoved him out my window.\"</p><p>I blinked, then slowly reached out, hooking one finger under her chin and tipping her head up so I could see her face. She seemed to be telling the truth.</p><p>\"You pushed him out your window?\" '\"Twasn't hard.</p><p>Mamey didn't have much balance that night anyway, as I recall. So he kicks in my door and starts groping at me like a ruttin' buck, going' on about marriage and love and other such nonsense. I simply turned so his back was to the window, and gave him a bit of a shove. \"</p><p>I couldn't help it. I smiled.</p><p>\"But your room is on the second floor.\"</p><p>\"Aye. He broke his arm in two places when he landed. Good for him our main road isn't paved, wouldn't you say?\"</p><p>I felt an odd feeling welling up for Rachel Sullivan, in the center of my chest.</p><p>\"No man alive ever got so much as a kiss from me without my consent, Donovan. Tis not something I'd tolerate.\" My gaze faltered.</p><p>\"Are you trying now to take the blame for what I did before?\"</p><p>\"I'm only saying you spoke true when you said that if I hadn't wanted it to happen, it wouldn't have. And not only because I'd have prevented it, but because you would.\"</p><p>I met her eyes, my own narrowing.</p><p>\"Don't start again tonight crediting me with qualities I don't possess.\"</p><p>She shrugged.</p><p>\"I'm starving. Aren't y\" -- She broke off there, bit her lip, and sent me a quick, hot glance. Her trembling hand shot to her neck, but the wounds there were gone now. Would have healed with the daylight. As if they'd never been there.</p><p>\"Do you ... would you...\"</p><p>\"Don't.\" I looked away, forcibly, from her tender throat.</p><p>\"Why don't you go to your rooms, Rachel. You must want a shower, a change of clothes.\"</p><p>\"But... how do you get... What I mean is, where do you...?\" I looked at her again, unable to help myself.</p><p>\"I don't kill, if that's what you're asking. I have stores. Cold, stale, sealed in plastic bags.\" I swallowed hard, as one of my hands rose up to stroke her hair, arranging it behind her shoulder. My fingers touched the soft skin there. Felt the pulse thudding endlessly, the river of her blood, flowing there. Warm, living blood. \"You ... you drank from me ... before.\"</p><p>\"I shouldn't have done that.\"</p><p>\"It was...\" She swallowed hard, but her eyes heated, and the flame singed me.</p><p>\"It was ecstasy,\" I finished for her.</p><p>\"I know. That's the danger, Rachel. That's the allure. What makes us so clan e what could end in your own destruction.\"</p><p>She lifted her chin.</p><p>\"You'd never hurt me.\" \"Don't be so sure of that, Rachel.\" I turned away.</p><p>\"But I am sure of it,\" she said to my back. I'd been walking toward the kitchens, but I stopped then and stood motionless.</p><p>\"Perhaps you're the one who needs convincing She moved forward very slowly. When she slid her palms slowly up the length of my back, curling her fingers on my shoulders, I stiffened, inhaled sharply.</p><p>\"I'm not afraid of you, Donovan. I've no reason to be and you know it, I think. But you're afraid of me, aren't you?\"</p><p>\"Don't be a fool.\"</p><p>\"I'd only be a fool if I were asking' you to trust me,\" she said, and she moved her hands slowly, caressing my neck, fanning her fingers up into my hair.</p><p>\"Or to love me. But I'm not, Donovan. I'm not asking' for anything like that.\"</p><p>She was, she knew she was. All her life she'd dreamed of this man. He was meant for her, she knew that. Somewhere deep inside her, she'd always known.</p><p>She'd never been with a man. Even believing her guardian angel, her immortal Donovan O'Roark to be a fantasy, she'd saved herself for him. Only for him.</p><p>He didn't turn, didn't speak.</p><p>She lowered her hands to her sides. Defeated. Maybe her dreams were as foolish as she'd once convinced herself they'd been. Maybe she'd been wrong after all.</p><p>\"I'm sorry. I thought ... I thought you wanted me, too.\" Turning away, she went to the stairs, climbed them slowly, and found the haven of the rooms he'd created for some fantasy woman--a woman he must have dreamed of. A woman he'd never let in.</p><p>I stood where I was for a full minute. No longer. I ached for her, craved her with a force beyond endurance. And she was right, I feared her too. She could destroy me, if I gave her the power. I went to the foot of the stairs, gazing up them, wanting with everything in me to go after her. I wanted her.</p><p>It wasn't love. It wasn't trust. It was only need. a need I knew she felt as well. I put my foot on the first step. Closed my eyes, swallowed the trepidation welling up in my throat. Told myself this was a bad idea. Very bad. I took another step, and another. And I could hear the shower running now. In my mind, I could see her standing beneath it, wet and beautiful, utterly naked, mine for the taking. What man alive would deny her?</p><p>\"Not me,\" I whispered, and the words emerged deep and throaty.</p><p>\"No, not me.\"</p><p>I took the rest of the stairs by twos. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The door stood open. in invitation, I thought. Her clothes lay tattered on the floor, and I recalled the hounds surrounding her. The fear in her eyes. The courage that surged in spite of it. My fingers fumbled with the trousers I wore, and I stepped out of them, and into the bathroom. Nothing between us now but the flimsy shower curtain.</p><p>Her naked on one side, beneath the pounding spray. Me naked on the other.</p><p>Suddenly the water stopped flowing. Her fingers curled around the edge of the curtain, and it slid open. And then she stood there, still, silent.</p><p>Wide eyes sliding up and down my body, before finally meeting mine, holding them.</p> <p>She stepped out, one foot lifting over the edge of the tub, lowering to the floor, then the other. She didn't reach for the towels stacked nearby.</p><p>Instead she merely stood there, head tilted back, eyes dark and stormy.</p><p>I stared back at her, drinking her in with my eyes. Water beaded on her skin, her shoulders and arms. Her tight belly. Rivulets formed, trickling from her long, wet hair down over slick, perfect breasts. She waited. Up to me, I knew. But did she really think I could turn away now?</p><p>Reaching out, I touched her. Ran one hand slowly over her hair, and followed the water downward, absorbing it into my palm as I skimmed her delicate throat, her tender breast, her narrow waist and rounded hip. I tugged her closer. And she came so easily, at the merest nudge of my hand. She pressed her body to mine with a soft sigh, twining her arms around my neck and tilting her head back for my kiss. I shuddered in reaction to the feel of her in my arms, wet and so warm, as I touched my mouth to hers. My arms closed tight around her, one hand cupping her buttocks while the other cradled her head. When her lips parted, I tasted heaven, and the fire inside me flared hotter.</p><p>With my tongue, I delved inside, to touch and stroke hers. I felt her shaking. Warming until her flesh was hot against my hands. Feverish.</p> <p>I arched hard against her, and she pushed back. No hesitation, no shyness.</p><p>My hands slid up and down her shower-damp body, unable to get enough of the feel of her as I fed from her mouth. She was sweet.</p><p>And my mind floated away, until all that remained was sensation.</p><p>Desire. And the taste of her. I moved my lips away, licking the moisture from her jaw, and her throat. She arched backward, and I slid lower, drinking every droplet from her skin, from her breast.</p><p>Taking the hard little nipple into my mouth and suckling, gently at first, but harder when her hands tangled in my hair. Scraping and nipping with my teeth, making her whimper in need, a sound that added fuel to the fire.</p><p>I wanted her. all of her, everywhere. Lower, I moved, dropping to my knees and kissing the wet path down her belly, nuzzling my face in the nest of damp curls, and then pushing deeper. Parting her secret folds with my tongue, I tasted her, and she cried out, fists clenching in my hair and tugging it.</p> <p>Hurting me so deliciously that my knees nearly buckled. Then she stepped back, just a little, urging me upward again, until I was standing. Her arms encircled my neck, and she lifted herself. I helped her, clasping the backs of her thighs and lifting them, positioning them around my waist. I felt her, warm and ready, teasing at the very tip of me, and closed my eyes at the flash of desire that nearly blinded me. And then she lowered her body over mine, took me slowly, so slowly inside her. Deeper. and deeper still, and when I felt the resistance, wondered at it, she pushed harder. A soft gasp, a small sound of pain.</p><p>I went still. Throbbing inside her, feeling her body's tightness pressing around me, holding me, I closed my eyes and knew the secret she hadn't told me. The gift she'd just given me.</p><p>\"Rachel...\" \"Shh,\"</p><p>she whispered, and then she moved over me, lifting away, lowering again.</p><p>Slowly, excruciatingly, her breasts sliding against my chest as she did, taut nipples caressing my skin. Slowly, I told myself.</p><p>Gently.</p><p>She nestled her head in the crook of my neck, kissed me there, suckled me there. Moved faster. Her breaths hot and quick on my skin.</p><p>I pushed her back to the wall, gripped her buttocks and held her there, thrusting into her deeply, again and again.</p> <p>She gasped, and clung to me, head thrown back, mouth open. I kissed her, took her mouth as I took her body, but the need wasn't sated.</p><p>Even as my passion neared release, I knew it wouldn't be. And it was as if she knew, sensed it somehow, because she clasped my head and drew it lower, pressed my face to her neck, tilted her chin upward, so the tender skin pressed to my lips. I felt the pulse pounding there, tasted the warmth and salt of her skin, knew it would be as good for her as for me, told myself there was no reason to deny what she offered. \"Take me, Donovan,\" she whispered.</p><p>\"Taste me...\"</p><p>I shivered. I hungered. I neared release more with every thrust, and craved as I'd never craved before.</p><p>With a trembling sigh, I parted my lips, closed them over her thudding pulse and, quickly, pierced her throat. She drew a harsh breath, but her hands pushed my head closer, clung to me and she pressed her neck to my greedy mouth. And I fed. Suckled, devoured the very essence of her, and heard her short staccato cries as she neared climax. And then I heard nothing but the thunder of my own heart beating in time with hers as I exploded inside her.</p><p>She screamed my name, shuddered around me, and slowly went limp in my arms.</p><p>I lifted my head, kissed the wound I'd left in her neck, and then her cheek, and her hair, and her lips.</p><p>She opened heavy-lidded eyes, and stared up at me. And something about that look made me realize the enormity of my mistake. It wasn't simple desire I felt for her. Not need, not physical longing. I felt something for her.</p><p>Something powerful and older than time. I always had.</p><p>I'd done it, then. I'd put the power to destroy me squarely into her hands.</p><p>All that remained was to see what she would do with it. But not now. Not yet.</p><p>As I lowered her gently to her feet, she stared up at me, and her deep green eyes gleamed like emeralds in moonlight. She whispered, \"Come,\" and she took my hand. Drawing me with her back into the shower, turning on the water.</p><p>Standing with me beneath the spray. She wrapped herself in my arms and kissed me. Lingeringly. almost. lovingly.</p><p>She couldn't tell him how she felt, wasn't sure there were words for it even if she tried. Completed, somehow. As if a goal she'd been striving for all her life had finally come within reach. As if the very essence of her had been touched, shared, poured out into another soul. She was happy, truly happy for the first time in her memory. He didn't feel the same. Couldn't love her. Wouldn't trust her. But she refused to dwell on those things right now. There would be time. So much time.</p><p>She'd get her wish, her dream. The man she'd loved all her life. She lowered her eyes, tried to believe he would return that love.</p><p>Eventually.</p><p>\"What is it?\" he whispered, stroking her hair as he held her.</p><p>They'd moved from the shower to the bed, where they snuggled now like lovers.</p><p>Tough to believe he felt nothing for her. Impossible, in fact.</p><p>She shook her head.</p><p>\"Nothing, Donovan. I was just thinking...\"</p><p>\"Thinking about what?\"</p><p>Shrugging, she brushed away her doubts.</p><p>\"I'd like to walk outside,\"</p><p>she told him.</p><p>\"In the moonlight.\"</p><p>\"Were you always such a night person, Rachel?\"</p><p>She smiled at him, ignoring the wariness, the uncertainty in his eyes. '\"Tis growing on me.\" She sat up, sensing his growing discomfort with the intimacy of holding her in bed this way, now that the desire was spent. For her part, she'd have just as soon remained like that through the night, but. She walked to the closet, pawed the clothes and chose carefully. A dress of white, so he couldn't help but focus on her out there in the darkness. With a full, soft skirt that would dance in the slightest breeze, and a plunging neckline to remind him of how much he still wanted her. She hoped.</p><p>\"I've always wondered what lies beyond this fence of yours,\" she said as we walked side by side in the moonlit night. Her hair, dried during lovemaking and untouched by a comb, hung in natural, careless curls, giving her the look of a wild thing of the forests. A fairy, or a nymph. She enchanted me.</p><p>I should never have made love to her. Never.</p><p>\"I can show you,\" I heard myself tell her. \"But... there's no gate.\"</p><p>Frowning, I tilted my head, watching her study the tall, sturdy fence.</p><p>\"And how do you know that, Rachel?\"</p><p>She looked at me quickly, then averted her eyes.</p><p>\"I... used to come here. As a child.\"</p><p>\"Often?\"</p><p>Meeting my gaze, her own hooded, she shrugged.</p><p>\"As often as I could slip away. I knew 'twas you, even then, you see. My secret protector.\"</p><p>I lowered my head to hide my reaction to her words. My stomach clenched tight, twisted and pulled.</p><p>\"Do you still want to see inside?\"</p><p>She nodded.</p><p>\"Come here, then.\"</p><p>Frowning, she came closer. I scooped her up into my arms, bent at the knees, and leapt the tall fence. I heard her delighted squeak as I came down on the other side. And then she went silent, seemingly content to remain in my arms as she scanned the woods to her left, and the rolling meadow in which we stood. Well-worn paths meandered among the lush sweet grasses, and into the wood lot \"Look,\" I whispered, turning with her, pointing.</p><p>In the distance a doe lifted her head to glance our way briefly. Then she went back to nibbling.</p><p>\"Donovan, there. Beyond the doe,\" Rachel whispered.</p><p>\"Yes,\" I said, \"I see them.\" Twin fawns frolicked in the deep grasses. Gently, I set Rachel on her feet.</p><p>\"The fence keeps hunters--men like Mamey Neal and his hounds--away. The deer can leap the fence easily though. Come and go as they please. Most of them seem content to stay here.\"</p><p>\"So you've made a haven for the deer.\" She continued watching, laughing softly, a sound more disturbingly beautiful than a night bird's song, at the twins' antics.</p><p>\"Not only the deer.\" I turned toward the fence, crouching low and pushing the deep grasses aside.</p><p>\"There are hidden places like this one, where the smaller creatures can get underneath. And the game birds fly over to find safety. Come,\" I said, extending my hand. Her delight in this place so pleased me, I couldn't resist showing her more.</p><p>When she closed her hand around mine, a feeling of warmth suffused me. And for a moment, it seemed perfect, natural. Until I reminded myself that it was fleeting. She'd leave here, one day soon. I led her over the meadow, to the place where wildflowers spread like a patchwork carpet in every direction. And beyond that, to the pond, fed by two streams. It glittered in the moonlight. Geese swam on the silvery water, undisturbed by our intrusion. Rachel sank into the grass on the pond's bank, and in spite of myself, I sat down beside her. Closer than I needed to, and yet not close enough. \"It's as if they know you're no threat to them.\"</p><p>\"They should,\" I told her.</p><p>\"They've been safe here for generations.\"</p><p>I felt her eyes on me.</p><p>\"Why, Donovan?\"</p><p>I shrugged.</p><p>\"Why not?\"</p><p>\"Tell me.\"</p><p>I looked at her, half reclining now. Like a goddess in her paradise.</p><p>\"All right,\" I said softly.</p><p>\"I created this haven for the animals because I understand them.\" I looked again at the geese, who swam further from shore as a fox came slinking slowly to the water's edge for a sip.</p><p>\"I know how it feels to be hunted,\" I told her.</p><p>I met her eyes. She nodded as if she understood. But she couldn't.</p><p>Or. I refused to believe she could.</p><p>\"You're truly a special man, Donovan O'Roark.\"</p><p>I shook my head slowly, but as she curled into the cradle of my arm and rested her head upon my shoulder, I felt special. Cherished. God, I was a fool to feel the things she made me feel.</p><p>We stayed there, in my own private paradise for most of the night.</p><p>Walking hand in hand, spotting and observing the wildlife. Like young mortals in love. Like some idealistic fantasy. And I relished every moment of it, in spite of the knowledge that doing so was a fool's dream. I only suggested we return to the castle when I knew dawn was on the rise, and Rachel still hadn't eaten.</p><p>But when we entered through the library doors, it was to the sound of urgent pounding, and shouts from the front. And even before I went to the great hall to answer the noisy summons, I sensed my brief time in paradise was coming to an end.</p><p>Mary O'Mallory stood at the door, breathless, red in the face. Her frantic gaze slid from me to Rachel, then relaxed slightly in relief.</p><p>\"Rachel,\" she sighed.</p><p>\"Lordy, girl, what took you so long?\"</p><p>Rachel frowned, ushering her inside, one arm supporting the woman, and I knew she cared for Mary. Genuinely cared. I saw the worry in her eyes.</p><p>\"We were outside,\" Rachel explained.</p><p>\"Come, sit down before you faint dead away. Whatever is the matter?\"</p><p>Mary sat, though on the edge of the set tee As if ready to spring and run should the need arise.</p><p>\"I need to speak with you, Rachel. Alone.\"</p><p>She slid a sideways glance toward me, and I knew what she thought of me.</p><p>That I was a monster. They all believed that.</p><p>All. except for Rachel. She'd never seen me that way, had she?</p><p>\"There's nothing you can't say to me in front of Donovan.\" Mary pursed her lips.</p><p>\"He's my friend, Mary.\"</p><p>\"Never mind. I'll give you your privacy,\" I offered. But I slanted a long look Rachel's way. Would she run now? Should I lock the door?</p><p>No. No need sending Mary into a panic. They wouldn't be long. \"I'll call you when we've finished,\" Rachel said. And I knew it was her way of promising she wouldn't run off. But she would, eventually. It was inevitable. And it was going to hurt.</p><p>I only nodded and left the two alone.</p><p>Rachel sat beside Mary and clasped the older woman's hands.</p><p>\"Now tell me, what's wrong?\"</p><p>\"The very fact that yer here, with that... that\" -- \"He's a man, Mary.</p><p>Just a man. And he's been nothing but kind to me. \" \" Lordy, child, tell me you're not in love with him! \" Rachel only lowered her eyes.</p><p>\"Why don't you simply tell me why you've come.\"</p><p>\"\" Tis the villagers, girl. Mamey Neal, above all. He's stirred them up until I fear history is about to repeat itself. An' I want you safe away from this place before it does. \"</p><p>A bird of panic took wing in Rachel's chest.</p><p>\"What are you saying?\"</p><p>\"Mamey claims the beast has you under some sort of spell, child. That you're his prisoner, but too enchanted to realize it. He's convinced them you're in need of rescue, Rachel, and even now the men are gathering at the pub.</p><p>\"Twas all I could do to slip away unnoticed, to warn you.\"</p><p>Rachel lowered her head, closed her eyes.</p><p>\"So they'll come here.\"</p><p>\"Aye,\" Mary said.</p><p>\"An' I fear violence will be done this night, child. Ye must come away with me now.\"</p><p>Facing her squarely, Rachel nodded.</p><p>\"I'll come. But I'll speak with Donovan first.\"</p><p>\"Rachel, you mustn' t\" -- \"I must. I can't leave him here, unprepared.</p><p>Unwarned. I can't go without telling him goodbye or explaining... No, you go on. I'll be along shortly, I promise.\"</p><p>Mary looked as if she were about to argue, but when she met Rachel's eyes, she seemed to change her mind.</p><p>\"I can see you're determined.</p><p>What's between you two, Rachel? \"</p><p>\"Nothing that need concern you. Go, now. Try to hold the men off until I get there.\"</p><p>Sighing, Mary left. Rachel stood at the door, watching her go. Then she turned, wandered back to the hall that led to the library, and called Donovan's name. She heard his steps coming toward her, felt his essence touching her even before he came into sight. He only looked into her eyes, standing very still, then nodded.</p><p>\"You're leaving tonight, aren't you Rachel?\"</p><p>\"I must. You have to let me go, Donovan. It's\" -- He held up a hand.</p><p>\"I won't stop you. My... arrangements are in place, for the most part. I can leave here right after you do.\" She tilted her head, frowning hard at him.</p><p>\"My God, Donovan, do you still believe that's necessary? After what we've shared? The way we've talked ... you really think I'd leave here only to tell your secrets to the world?\"</p><p>He lowered his head.</p><p>\"What I believe,\" he whispered, \"is that I'm as big a fool as Dante was. But I've no wish to suffer the same fate.\"</p><p>She looked up at him, stared deeply into his eyes, and what she saw there was pain.</p><p>\"If you leave... I'll never be able to find you again. Will I?\"</p><p>He averted his eyes.</p><p>\"That's the entire point.\" \"No,\" she said softly.</p><p>\"It's not even close to the point.\" \"Then what is?\"</p><p>She stepped closer, gripped the front of his shirt in trembling fists.</p><p>\"Must I throw my heart at your feet and wait for you to kick it aside? I will then. You mean more to me than my pride.\" I \"Don't, \" I love you, Donovan O'Roark. I've loved you all my life, and I will until I die. \"</p><p>His face seemed to crumple in pain.</p><p>\"I'm leavin' you tonight, yes. Because I must. But only tonight. I'd have come back. I'd have come back here, for you.\"</p><p>\"Rachel...\"</p><p>\"You'd do well to leave, too, Donovan, for there's danger to you here tonight. But it's up to you where you go. Far away, where I can never set eyes on you again. Or close by... close enough so that I can find you... or you can find me.\"</p><p>Slowly, he shook his head.</p><p>\"You don't understand. It's the curse of my kind to live our lives alone, Rachel. It's how it has to be.\"</p><p>\"No.</p><p>\"Tis how you've made it. You have a choice now, Donovan. But it's up to you.\" Tears choked her. God, she didn't want to leave him. To lose him.</p><p>To never see him again. But if she didn't, she might lose him anyway. To an angry mob, just the way he'd lost Dante. Impulsively, tears streaming over her cheeks, she pressed her lips to his, clung to his neck for a brief, passionate kiss. Then she turned and fled, through the front door and into the waning night. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When she left it was as if my heart had been torn apart. I should leave as well, I knew. I should pack up the few belongings I'd need, and make my way out of here. I didn't know what Mary had told her, but I didn't disbelieve Rachel when she said I'd be in danger here tonight. I should hurry.</p><p>I should. But I couldn't.</p><p>She said she'd come back, and damn me for a fool, I believed her.</p><p>More than that, I wanted it to be true. This place had never been more alive--I'd never been more alive--than when she was here.</p> <p>Lighting my darkness. A blazing sun shining her warmth on my endless night.</p><p>She might betray me, as I'd spent so much time convincing myself she would.</p><p>If she did, I'd be damned. But I couldn't leave until I knew.</p><p>I went to the set tee lowered myself to it, bowed my head, and sat there, very still.</p><p>Who was I kidding? She wasn't going to betray me. I'd lost my heart to the woman, and when she came back I'd be here waiting. And I'd tell her, at last. My heart was in her hands. Rachel sailed into the pub as if she hadn't a care in the world, though her heart was heavy. He'd be gone when she went back.</p> <p>He'd be gone, and she'd never see him again.</p><p>Still, she feigned surprise when she saw the men crowding the room, with Mamey standing at the front of them all.</p><p>\"My,\" she whispered.</p><p>\"Business is better when I'm away, isn't it? And what's the celebration tonight that has half the village in attendance?\"</p><p>\"Tis no celebration, Rachel.\" Mamey stepped forward, clutching her hands as if she were his property.</p><p>\"But 'tis glad I am that you've returned. You'll be out of harm's way when we storm that damnable castle.\"</p> <p>She frowned, and drew her hands from his.</p><p>\"An' why is it you're plannin' to attack an empty ruin?\"</p><p>\"Empty?\"</p><p>\"Aye,\" she said with a nod.</p><p>\"Donovan has gone. Only came for one last look at the place before leaving it for good.</p><p>\"Tis a shame you didn't make him feel more welcome here, you know. He's a kind man.\"</p><p>\"He's a beast!\" someone yelled.</p><p>\"Oh, I don't think that's true. He was kind enough to help me with my research before he went on his way.\" She walked behind the bar, reaching for her apron.</p> <p>\"I think you're lyin', Rachel,\" Mamey said, eyeing her.</p><p>\"I think you're trying to protect him, an' you wouldn't be if you weren't under his spell.\"</p><p>\"Spell?\" she asked, wide-eyed.</p><p>\"Don't tell me you're fool enough to believe he's more than just an ordinary man?\"</p><p>\"You know he is.\"</p><p>She did. He was above and beyond ordinary and ten times the man of any in this room. But instead of telling them so, she only shrugged.</p><p>\"I know no such thing. But I do know this, Mamey. I'll not allow you to harm him.\"</p><p>\"Then he is still there!\" Mamey shouted, banging a fist on the table.</p><p>\"I didn't say\" -- \"You didn't have to. You've been naught but cold to me since your return, Rachel. An' everyone knows you'd planned to marry me before you left. Tis that beast who's swayed yer mind.\"</p><p>\"I never planned to marry you. The plans were all on your side,\" she told him.</p><p>\"And 'twas indeed a beast who made up my mind, Mamey, but the beast was you.</p><p>Not Donovan O'Roark.\"</p><p>\"We're going' up there, and when we leave there'll be nothing left but rubble. He'll not escape us... not alive, at least.\"</p><p>He turned and the other men rose. They piled out the door, Mamey leading them. Rachel surged after them all, but they moved quickly, and though she caught hold of several of the men, tugging at them, pleading with them, they were too frenzied to listen to her. When they turned onto the curving castle road, Rachel ducked into the woods and raced for the shortcut Dante had shown her, so she could come out ahead of them.</p><p>But when she got to the frenzied men again, it was to see the castle door opening to their pounding summons, and Donovan stepping out. He eyed the crowd, shook his head slowly. He looked utterly calm, but she knew what he must be thinking. That she'd done this to him, just as her ancestor had done to his best friend. That she'd left him only to lead this crowd back , here.</p><p>That she'd betrayed him. Then he lifted his head.</p><p>\"Where is Rachel?\" he asked.</p><p>\"Have you harmed her?\"</p><p>She blinked in surprise, unable to speak. He thought they'd harmed her?</p><p>Then. \"Rachel's no longer your concern,\" Mamey told him.</p><p>\"We all know you've bewitched her somehow, or she'd never defend you the way she has. Once you're gone, she'll be fine again.\"</p><p>\"Defended me, did she?</p><p>I'm not surprised,\" Donovan said, and she could have sworn he battled a gentle smile.</p><p>\"Once I'm gone, you say,\" Donovan went on.</p><p>\"So you intend to kill me, do you?\" \"Aye,\" Mamey growled.</p><p>\"Just so long as you're honest about your reasons,\" Donovan went on.</p><p>\"You want me gone because of Rachel. Because it's me she loves and not you.\"</p><p>The men grumbled, and someone yelled, \"Is that true, Marney?\"</p><p>\"So will you drive me out into the sunrise, Neal,\" Donovan went on, \"or simply kill me here and now?\"</p><p>\"Here and now,\" Mamey whispered.</p><p>\"Are you sure you can?\"</p><p>Marney's eyes narrowed and he lifted his rifle. Rachel screamed and lunged from the woods, slamming her body into Marney's, and groping for the gun.</p><p>But-she never found a hold. Mamey staggered backward under the weight of her assault, and the shot cracked so loudly her eardrums split. Then she felt the burn. the heat. The rapid pulse of life from her body.</p><p>Blinking in shock, she would have fallen to the ground, had not Donovan lunged forward to gather her into his arms.</p><p>\"Damn you!\" he shouted.</p><p>\"Damn you, look what you've done! Rachel? Rachel!\" She opened her eyes, studied his face. Then she turned to Marney. \"Go,\"</p><p>she told him.</p><p>\"Go away. If I see you again....\" Marney backed away.</p><p>Already the other men were scattering shocked from their fury, perhaps, to realize just what they'd been about to do. What had happened as a result of their foolishness. Cradling her in his arms, Donovan bent over her, kissed her face. And Mary crowded through the retreating men, made her way forward while Mamey stood in the road, blinking in shock. She leaned over Rachel, parting her blouse, and looking at her chest, where the pain throbbed and burned. Grimly, Mary lifted her gaze to Donovan's.</p><p>\"You can help her,\" she whispered.</p><p>\"Can't you?\"</p><p>Through her fading vision, Rachel saw him nod. Then Mary turned away.</p><p>'\"Tis only a flesh wound,\" she called to Mamey.</p><p>\"But I vow unless ye leave here now I'll inform the authorities an' have you arrested for attempted murder. An' if you ever bother these people again, I'll do it. Now go!\"</p><p>Nodding, muttering that it wasn't his fault, Mamey turned and ran away like the coward he was.</p><p>Mary faced the two of them once more.</p><p>\"I don't imagine I'll see you again, will I?\"</p><p>Rachel said nothing, unsure what Mary meant. \"Goodbye, child. Be happy.\"</p><p>Then she was gone.</p><p>Rachel stared up into Donovan's eyes.</p><p>\"I was afraid you'd think I brought them...\"</p><p>\"I knew better.\"</p><p>\"Did you?\"</p><p>\"You know I did. I kept telling you I couldn't trust, couldn't care even when I already did. I doubted you, Rachel, from the start, and I'm more sorry than I can tell you. You didn't deserve that. But you never gave up on me, did you?\"</p><p>\"How could I? You're in my soul, Donovan O'Roark. You have been since I was but a wee girl.\"</p><p>\"And you in mine,\" he told her.</p><p>\"You made me believe d vowed it was something I'd never do. I love you, Rachel Sullivan. Do you hear me? I love you.\"</p><p>\"Of course you do,\" she whispered.</p><p>\"You always have.\" He smiled very gently.</p><p>\"I'm dying,\" she whispered.</p><p>\"Yes.\"</p><p>\"But you can prevent it, can't you, Donovan? You can make me... like you.\"</p><p>\"Tis not an easy way to live, child. Never again to see the sunlight.</p><p>Always knowing there are those who would hunt you, kill you simply for being what you are.\"</p><p>\"Wandering hand in hand beneath the moonlight, spending every moment in your arms,\" she said weakly. \"\" Tis the life I want, so long as I can live it by your side. That's the dream I've always had, Donovan.</p><p>To be with you. as we're meant to be . together. \" \" Then together we shall be, Rachel. Always. \" He lowered his head and kissed her, and she knew she'd found her dream come true, at last. </p> </body></html>"]