["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bored, I crossed the carpet in five steps, climbed up on Sinclair's desk, and kissed him. My left knee dislodged the phone, which hit the floor with a muffled thump and instantly started making that annoying eee-eee-eee sound. My right skidded on a fax Sinclair had gotten from some bank.</p><p>Surprised, but always up for a nooner (or whatever vampires called sex at 7:30 at night), my husband kissed me back with enthusiasm. Meanwhile, due to the aforementioned knee-skidding, I slammed into him so hard, his chair hit the wall with enough force to put a crack in the wallpaper. More work for the handyman.</p><p>He yanked, and my (cashmere! argh) sweater tore down the middle. He shoved, and my skirt (Ann Taylor) went up. He pulled, and my panties (Target) went who knew where? And I was pretty busy tugging and pulling at his suit (try as I might, I could not get the king of the vampires to not wear a suit), so the cloth was flying.</p><p>He did that sweep-the-top-of-the-desk thing you see in movies and plopped me on my back. He reached down, and I said, \"Not the shoes!\" so he left them alone (although I noticed the eye roll and made a mental note to bitch about it later).</p> <p>He tugged, pulled, and entered. It hurt a little, because normally I needed more than sixteen seconds of foreplay, but it was also pretty fucking great (literally!).</p><p>I wrapped my legs around his waist, so I could admire my sequined leopard-print pumps (don't even ask me what they cost). Then I grinned up at him, I couldn't help it, and he smiled back, his dark eyes narrow with lust. It was so awesome to be a newlywed. And I was almost done with my thank-you notes!</p><p>I let my head fall back, enjoying the feel of him, the smell of him, his hands on my waist, his dick filling me up, his mouth on my neck, kissing, licking, then biting.</p><p>Then my dead stepmother said, \"This is all your fault, Betsy, and I'm not going anywhere until you fix it.\"</p><p>To which I replied, \"Aaaaah! Aaaaah! AAAAAAH-HHHHHH! \"</p> <p>Sinclair jerked like I'd turned into sunshine and spoke for the first time since I swept into his office. \"Elizabeth, what's wrong? Am I hurting you?\"</p><p>\"Aaaaaaaaaaaahhhhhhhhhh!\"</p><p>From my vantage point, my dead stepmother was upside down, which somehow made it all the more terrible, because, contrary to popular belief, you can't turn a frown upside down.</p><p>\"You can fuss all you want, but you've got responsibilities, and don't think I don't know it.\" She shook her head at me, and in death, as in life, her overly coiffed pineapple-blond hair didn't move. She was wearing a fuchsia skirt, a low-cut sky blue blouse, black nylons, and fuchsia pumps. Also, too much makeup. It practically hurt to look at her. \"So you better get to work.\"</p><p>\"Aaaaaaaaaahhhhhhhhhh!\"</p><p>Sinclair pulled out and started frantically feeling me. \"Where are you hurt?\"</p> <p>\"The Ant! The Ant!\"</p><p>\"You - what?\"</p><p>Before I could elaborate (and where to begin?), I heard thundering footsteps, and then Marc slammed into the closed office door. His scent was unmistakable - antiseptic and dried blood.</p><p>I heard him back off and grab for the doorknob, and then he was standing in the doorway. \"Betsy, are you - oh my God!\" He went red so fast I was afraid he was going to have a stroke. \"I'm sorry, jeez, I thought that was a bad 'aaaaahhhh,' not a sex 'aaaaahhh.' \"</p><p>More footsteps, and then my best friend, Jessica, was saying, \"What's wrong? Is she okay?\" She was so skinny and short, I couldn't see her behind Marc.</p><p>\"The Ant is here!\" I yowled, as Sinclair assembled the rags of his suit, picked me up off the desk, and shoved me behind him. I don't know why he bothered; Marc was gay and a doctor, and so couldn't care less if I was mostly naked. And Jessica had seen me naked about a million times. \"Here, right now!\"</p><p>\"Your stepmother's in this room?\" I still couldn't see her, but Jessica's tone managed to convey the sheer horror I felt at the prospect of being haunted by the Ant.</p><p>\"Where else would I be?\" the Ant, the late Antonia Taylor, said reasonably. She was tapping her Paylessclad foot and nibbling her lower lip. \"What I'd like to know is, where's your father?\"</p> <p>\"Yeah, that's all this scene is missing,\" I fumed. \"If only my dead dad were here, too.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After Marc decided a Valium drip probably wouldn't work on a vampire, he brought me a stiff drink instead. Could he even tap a vein? I was over a year dead, after all. Would an IV take? Someday I was going to have to sit down and figure all this shit out. Someday when I wasn't plagued by ghosts, serial killers, wedding planning, rogue werewolves, mysterious vampires bursting in on me, and diaper changing.</p><p>It was sweet of Marc to bring me a gin and tonic (which I loathed, but he didn't know that), but I was so rattled I drank it off in one gulp, and it could have been paint thinner, for all I knew.</p><p>\"Is she still here?\" he whispered.</p><p>\"Of course I'm still here,\" my dead stepmother snapped. \"I told you, I'm not going anywhere.\"</p> <p>\"I'm the only one who can hear you,\" I shrilled, \"so just shut up!\"</p><p>\"Bring her another drink,\" Sinclair muttered. We were still in his office, but Jessica had kindly brought robes to cover our shredded clothes. \"Bring her three.\"</p><p>\"I don't need booze, I need to get rid of you know what.\"</p><p>\"Very funny,\" the Ant grumped.</p><p>She and my father had been killed in a gruesome, stupid car accident a couple of months ago. Where she had been since her death, and why she had shown up now, I didn't know. There were so many things about being the vampire queen I didn't know! And I didn't want to know.</p> <p>But I was going to have to find out, because the ghosts never, ever went away, until I solved their little problems for them.</p><p>And where was my dead dad, anyway? I sighed. Nonconfrontational in life as well as in death.</p><p>\"What do you want?\"</p><p>\"I told you. To fix this.\"</p><p>\"Fix what?\"</p><p>\"You know.\"</p> <p>\"This is so weird,\" Marc murmured to Jessica, forgetting, as usual, about superior vamp hearing. \"She's having a conversation with the chair.\"</p><p>\"She is not. Quiet so I can hear.\"</p><p>\"I don't know,\" I said to the chair - uh, the Ant. \"I really, really don't. Please tell me.\"</p><p>\"Stop playing games.\"</p><p>\"I'm not!\" I almost screamed. Then I felt Sinclair's soothing hands on my shoulders and sagged into him. Like our honeymoon hadn't been stressful enough, what with all the dead kids and Jessica and her boyfriend crashing it and all. This was a hundred times worse.</p><p>\"If you could just - \" I began, when the office door crashed open, nearly smashing into Marc, who yelped and jumped aside.</p><p>A bloody, stinking horror was framed in the doorway, then darted right at me like a goblin in a fairy tale. Since I was a tad keyed up from the Ant popping in, my reflexes were in excellent shape. I slugged the thing - it was a man, a big, bearish, shambling man - so hard I knocked him halfway across the office. He hit the carpet so hard, buttons popped off his shirt, which looked about ready for the ragbag anyway.</p><p>He was on his feet in a flash and looked wildly from Sinclair to me and back again. And he was - there was something familiar about him. Something I couldn't put my finger on.</p> <p>Sinclair and I started toward him in unison, and he backed up, pivoted, and dived out the second story window.</p><p>\"What the blue hell - ?\" I began.</p><p>The office door crashed open, and I felt like clutching my heart. I couldn't stand many more of these shocks to my system.</p><p>Garrett, the Fiend formerly known as George, stood in the doorway, panting. Since he was seventy-some years old and didn't need to breathe, I knew at once something was seriously wrong.</p><p>What fresh hell was this?</p><p>\"They're awake,\" he gasped. \"And they want to kill you.\"</p><p>\"Who?\" Sinclair, Jessica, Marc, and I asked in unison. It could be anyone. The guys who delivered pizza from Green Mill. Other vampires. The Ant's book club. Werewolves. Zombies. And, of course, the uninvited guest who'd jumped out the window. So many enemies, so little -</p><p>\"The other Fiends. I've been feeding them my blood, and they're pissed.\"</p><p>\"You've what, and they're what?\" I asked, horrified.</p><p>Garrett couldn't look at me - never a good sign. \"They - they sort of 'woke up,' and now they want to kill you.\"</p><p>\"It's this lifestyle you lead,\" the Ant said smugly. \"These things are bound to happen.\"</p><p>\"Oh, shut up!\" I barked. I actually had to clutch my head; which problem to tackle first? \"You couldn't have crashed into the office tomorrow? Or yesterday?\"</p><p>\"You'd better sit down and tell us everything,\" Sinclair said, reminding me he was the vampire king. \"The queen has just been attacked... and now you come bearing tales of murder.\" Bam. Decision made. We'd deal with what Garrett had done first.</p><p>So take that, dead stepmother. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Like I wasn't dreading the coming winter already. These days I was always cold, even on the hottest day in July; November was going to suck rocks. What I wanted to do was adjust to married life, set up house (well, the house had been set up for more than a year, thanks to Jessica and her big bucks, but I was still finding places for our wedding gifts), finish writing thank-you notes (yawn), and settle down to the job of raising BabyJon, my half brother and legal ward. (You remember, the whole my dad and the Ant being dead thing.)</p><p>Yep, yep. Everything was normal. I was a newlywed and would-be parent. Nothing wrong or weird here. Nope.</p><p>\" - felt responsible,\" Garrett was yakking, which in itself was hard to get used to. He'd gone from slobbering Fiend to monosyllabic boyfriend (Antonia-the-werewolf's stud... more on that later) to verbose old vampire. The fact that he looked about twenty-three didn't fool anybody. \"So I began visiting them. It didn't seem right that I was back to myself while they were - were - well. You know.\"</p><p>Fine time for his newfound vocabulary to fail him! But we knew. The old king - the one I'd killed to take the crown - liked to torture newly risen vampires by refusing to let them feed. After a few months of this treatment, they went crazy. Worse than crazy - feral. Forgot everything they ever knew, or could know, about being human. Think dangerous, rabid wolves, wearing L.L. Bean.</p> <p>Sinclair and his major domo, Tina, had asked me again and again to stake the Fiends through the heart.</p><p>But I couldn't. It'd be like stomping puppies. Bloodthirsty, feral, dangerous puppies, yes, but still - puppies. Had I made the puppies? No. Was any of it the puppies' fault? Nope. Was I going to kill - worse yet, order to kill, wouldn't even have to get my hands dirty - innocent puppies, no matter how many buckets of blood they drank a day?</p><p>No.</p><p>And now the puppies were going to eat out my soft human heart. You'd think I'd have learned the essential Rule of the Undead by now: cuddly undead are still undead.</p><p>\"How come nobody tried feeding them their own blood before?\" Marc asked. \"Why the buckets of animal blood?\"</p> <p>\"They're too dangerous to be allowed to hunt. They'll kill anyone they can find.\"</p><p>\"Yeesh.\"</p><p>\"I don't think we have time for a recap,\" Garrett said, nervously cocking his head to one side. \"Recap,\" that was very good; man, he was sharp! Picking up slang like no tomorrow. To think, six months ago he couldn't even purl, much less knit.</p><p>\"But Garrett fed them his blood. 'Live' blood - so to speak. So, how come nobody tried that before?\"</p><p>\"Nobody,\" Sinclair said, the corners of his mouth drawing down, \"cares to get near them. No offense, Garrett.\"</p><p>\"None taken, my king,\" he said stiffly, not looking at my husband.</p> <p>And there it was. The Fiends were the untouchables, the unwashed. In a society built of nonhumans, of monsters, these guys were considered a level below that. A good trick, if you sat down and thought it over.</p><p>I smacked my forehead with the palm of my hand. \"I knew I recognized that guy! He's one of the Fiends? Jesus, he's really out?\"</p><p>\"Did somebody break a window?\" Tina asked, walking into the office with what appeared to be a ream of paperwork waiting for Sinclair's signature. Privately, my husband was the king of the vampires; publicly, he owned several companies, tracts of land, and office buildings and was ridiculously wealthy. Half mine now, under Minnesota law. I think. Or - wait. Were we a community property state or - I guess I'd blocked out most of my mom and dad's divorce -</p><p>\"Garrett brought the Fiends back to life like some kind of moody 1920s Frankenstein, and now they're on their way here to kill Betsy,\" Marc said in one breath, looking pleased at his ability to spit out several words without passing out. Of all the nights for him not to be on call at the ER! There'd be no shaking him off our heels tonight. Normally, we tried to keep the respirating roommates out of vampire biz, for their own safety if nothing else.</p><p>\"They're what? Who's here to what?\" Tina's jaw sagged; papers fluttered. She was a doll of a woman with waist-length blond hair and enormous pansy eyes. She looked delicious in knee-length shirtdresses and nonprescription glasses she didn't need. She was wearing both, in navy and tortoiseshell. \"Why are you all standing around? Why - \"</p><p>\"Also, the Ant has started haunting me.\"</p><p>\"I was wondering when you'd remember I existed,\" the wretched woman snapped.</p><p>\"Did you remember to pick up tampons?\" Jessica asked, and now the men looked appalled. That was a good question, actually. I sure didn't need them anymore, ergo Tina didn't. Jessica's cycle had been all over the place since the cancer. Did Antonia - any female werewolf, for that matter - need them? The ghost definitely didn't.</p> <p>And what did it say about my life that I was living (again) with two women named Antonia? Most people went their entire lives without running into an Antonia. When one of them died, I figured I was home freaking free! Really, it was all -</p><p>\"Majesty, will you focus!\"</p><p>\"Huh? Why?\"</p><p>Sinclair actually laughed out loud while Tina stomped a tiny foot. \"Angry vampires are on their way here to kill you.\"</p><p>\"It's hard to get worked up,\" I said truthfully as my husband bit back another laugh, \"when the Ant is breathing over my shoulder. So to speak. And it's not exactly the first time unwelcome guests have been on the way.\" I turned to Jessica. \"Remember homecoming 1996?\"</p><p>She shuddered. \"I never thought you'd get the Dewar's out of the curtains.\"</p><p>\"But I guess we'll just have to - \"</p><p>Bam! Ka-Bam! BAM! BAM! BAM!</p><p>\"What the - ?\" Jessica wondered.</p><p>\"That would be hordes of the ravenous undead, kicking in the front door,\" Tina said, dropping the rest of the paperwork and whipping off her glasses. I waited for her to do a Wonder Woman twirl (Wonder Vamp!), but she just looked alert and ready to flee.</p><p>Sinclair sighed, looking greatly put upon. But men who have interrupted sex tend to get that look. \"Shall we flee, or fight?\"</p><p>Tina glanced at Jessica, who glared. \"Ah. Flee, I think. At least until we know more about this particular threat.\"</p><p>\"Don't run off on my account,\" Jessica warned. But of course, that's exactly why we were choosing flight over fight. We couldn't risk Marc and Jessica's lives until we knew more about what was going on. \"I mean it, you guys.\"</p><p>Sinclair ignored her. \"Very well. Let's take the tunnel.\"</p><p>Tunnel? We were taking a tunnel? We had the king, the queen, Tina, a former Fiend - the odds were okay, I thought. But Tina had an excellent point - we had a couple of humans to watch out for, too.</p><p>Tina led the way to one of the many doors leading to the basement, and I had to jog to keep up. \"What? We have a tunnel?\"</p><p>\"Betsy, come on!\" Marc said, grabbing an elbow and giving such a yank I nearly fell down the stairs.</p><p>\"Not without me, you're not,\" the Ant said triumphantly, and marched (Marched? Couldn't she float?) behind me just as the door closed, leaving all of us in pure darkness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Well. Not pure. I could see fine, as could Garrett, Tina, and Sinclair. But from the moans and whimpers coming from farther down the stairs, the humans were having more trouble.</p><p>\"Stop that sniveling, Marc Spangler, or I'll detesticle you,\" Jessica snapped. When she was scared, she got pissed. Man, you should have seen her the day she got a false positive on an EPT. We were buying new dishes for days.</p><p>\"I can't see a fucking thing,\" he snarled back. There was an abrupt silence, a - I know how this sounds, but I could hear it - a flailing, and then a rattle of thumps, followed by moans of pain.</p><p>\"Getting eaten alive by the Fiends can't be worse than this,\" Marc groaned from the floor. Ouch. He must have fallen at least ten steps. Onto cement.</p> <p>\"Be careful,\" Tina said.</p><p>\"Thanks. At least someone cares.\"</p><p>\"You could have broken your ankle on the way down and slowed our escape.\"</p><p>\"I hate vampires,\" he replied. \"So much.\"</p><p>I eased past Jessica on the stairs, went to Marc, and picked him up. \"This is so romantic,\" he cooed, modestly kicking his unbroken foot.</p> <p>\"Shut up, or I'll use you for Fiend chum.\"</p><p>\"Why,\" Jessica demanded, \"have we decamped to the basement?\"</p><p>\"And why haven't we turned any lights on?\" I asked.</p><p>\"Tina, take Jessica's hand. Elizabeth, keep carrying Marc.\" Sinclair groaned softly in the dark, as if he couldn't believe he'd said such a thing. \"Everyone else, follow me.\"</p><p>It took a long time. The basement was as long as the house, which was a mansion on</p><p>Summit Avenue</p> <p>. And we had to wander around various tables and chairs, in and out of mysterious rooms - I could count on one hand how often I'd been down here since we moved a couple of years ago. I had never liked it, not even - especially even - when Garrett was living down there, knitting afghans and learning to crochet.</p><p>The journey wasn't improved by the occasional yelps, as Jessica stubbed a toe or cracked an elbow. Marc just snuggled deeper into my arms (ridiculous - he had thirty pounds of muscle on me) and waited patiently for me to make him safe.</p><p>Story of my life, since I'd died. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>We could hear faint crashings from upstairs; the Fiends, making a mess because they couldn't find us. Chewing on my drapes; defecating on my carpet, ripping up my graphic novels in their bloodthirsty rage. But surely they could follow their noses?</p><p>That's when Sinclair stopped walking and began tapping his knuckles on what looked like a solid cement wall.</p><p>\"I don't think you should do that,\" I said nervously. \"They might hear.\"</p><p>\"Over the sound of their own nonsense? Doubtful. \"</p> <p>I opened my mouth to object again (quietly) when the solid cement wall suddenly swung wide to the left, revealing a narrow, dimly lit (with fluorescents, blinking on one by one even as we stared) tunnel.</p><p>\"Tunnel?\" I asked, peering.</p><p>\"Tunnel,\" Marc confirmed, peering with me. His grip tightened around my neck. \"Did this come with the house, or did you put it in after?\"</p><p>Good fucking question, which, I couldn't help notice, my husband didn't bother to answer.</p><p>\"The lights and heat are motion activated.\" Sinclair turned to me, smiling with all his sharp teeth. \"Usually, in our case, heat activation would do little good. After you, my queen.\"</p> <p>Wondering what else about the Vampiric Mansion of Mystery I didn't know, I went. </p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'm tired,\" I whined after we'd been walking for a hundred years.</p><p>\"It's only a bit farther,\" my lying bastard husband said.</p><p>\"You keep saying that, and we keep not being there.\"</p><p>\"I keep dreaming about divorce and not being divorced.\"</p> <p>\"Oh, very nice!\" I raged, running to catch up with them, ignoring Marc's yelps as he was jolted in my arms. \"Married not even a season, and you're looking for the door, such a typical guy, I knew you - hey!\"</p><p>I had been lifted easily, effortlessly. \"Now shush, Your Majesty,\" Tina said, shifting my and Marc's combined weight with no effort. \"And we really are almost there.\"</p><p>\"This,\" Marc announced over the distinctive gagging noise of Jessica stifling laughter, \"is too much. My masculinity could stand being carried by Betsy, but - \"</p><p>\"The gay guy has concerns about masculinity?\" Jessica managed, then broke down completely.</p><p>\"I'm gay, not a eunuch. Have you ever seen me in drag? Or even mascara? I'm a regular guy in every way - \"</p> <p>\"Except you like to put your penis in weird places,\" I said primly.</p><p>\"Can we please have one midnight getaway without having to talk about Marc's penis?\" Tina asked, aggrieved.</p><p>We all shut up as we navigated another set of stairs... and then another. I'd been living here for months and months, and nobody had told me about the secret vampire escape tunnel.</p><p>I remembered that Sinclair had steered Jessica toward this house when we had to upgrade. Back in the days when I thought I hated him. And here I thought it had been because he was a history buff and liked old houses!</p><p>\"I've never been bored, and scared, at the same time,\" Marc commented.</p><p>\"What do you want me to do with that information?\" Tina asked.</p> <p>\"Just put us down,\" he grumbled, and Tina did, hard enough to rattle my teeth. Marc and I groaned in unison.</p><p>Sinclair pressed another button, another wall raised, and I suddenly could hear flowing water. He walked out into what must have looked like pure darkness to the others, except I could hear his heels clanking on the boards of the dock. He sounded like a sheriff from the Old West.</p><p>\"We walked all the way to the Mississippi?\" Marc goggled.</p><p>\"What 'we'?\" Jessica asked. \"And it was, what? Seven, eight whole blocks?\"</p><p>We heard Sinclair start up the Evinrude, and as he hit the lights Jessica and Marc cheered.</p><p>\"Get the rope, will you, darling?\" he asked casually, as if he didn't look, at that moment, like the coolest guy in the universe.</p><p>The dock was a memory a few seconds later, and when Sinclair opened 'er up, I decided I wasn't mad anymore and allowed him to put his arm around me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"All right, Garrett,\" my husband said about half an hour later. I had no idea where we were, but we were out of the Fiends' reach, at least for now. He'd powered down the motor, and we were floating between a couple of islands. City lights were visible, but far off. I'd always sucked at geography; the lights could have been St. Paul or Minneapolis for all I knew. \"Suppose you tell us everything.\"</p><p>I realized that during our tunnel getaway and subsequent penis discussion, Garrett hadn't said word one. And at some point, the Ant had disappeared. Thank goodness for small etcetera.</p><p>Garrett, a slim, tall blond with hair almost as long as Marc's, was sitting low in the bow, staring at his hands.</p><p>\"Garrett? Helloooo? Time, if you didn't notice by the whole Fiends breaking down the door and the tunnel escape, is not on our side.\"</p> <p>\"I am shamed,\" he said at last, still staring at his hands. \"I feel ashamed.\"</p><p>\"Well,\" Marc said reasonably, swiveling around in one of the captain's chairs, \"what'd you do?\"</p><p>He looked up at me, the moonlight bouncing off his face and making his eyes seem to gleam. \"You should kill me, dread queen. Right now.\"</p><p>\"Blech! I mean, uh, no way, Garrett, you're one of the family.\" The giant extended family I neither wanted nor asked for. To think, three years ago I was living in a two-bedroom in Apple Valley, bitching because I hadn't had a date in over a month. My biggest problem had been fixing the copy machine at my day job - management would try to fuck with the machines, and often there was no hope afterward. \"Besides, if I didn't kill you when you were a Fiend, I'm sure not going to now and risk your girlfriend's wrath.\" Antonia-the-werewolf was a high octane bitch when she was in a good mood. I never, never wanted to see her when she was really mad.</p><p>\"Antonia,\" Garrett said, almost sighed. \"As you know, my mate has to leave me. Often, she leaves. More so, now that you changed her.\"</p> <p>We nodded, like we'd been cued. We did know this. Antonia had to pop over to Cape Cod now and again - the seat of werewolf power, pardon me while I snigger - and tend to pack business. We assumed she didn't take Garrett, because traveling with a vampire could get tricky.</p><p>Also, up until two months ago, she was a werewolf who had never changed during the full moon. I had done something to her, something we all still didn't like to talk about, and now she did change. The meetings on Cape Cod had increased as a result, but those of us in the manse weren't talking about it.</p><p>\"I stay,\" he continued, \"because I'm afraid.\"</p><p>\"Of what?\" Jessica asked.</p><p>\"The world,\" he replied simply. \"The last time I went out in the world, I was captured and bound like a slave.\"</p><p>Thank you, Marjorie, you kidnapping fuck, may you roast in Hell for a zillion billion years.</p> <p>\"The time before that, I was killed. The monster got me. I don't go out in the world anymore.\"</p><p>It occurred to me (it was going to be a night of discovering things that had been under my nose) that except for going after Antonia last summer (and getting captured, as he put it, and bound like a slave), I couldn't remember the last time he had left the mansion.</p><p>I imagined he fed on Antonia, but such things were none of my business, so I didn't ask. As long as he wasn't hurting innocent people, I had no interest in where he was getting his liquid diet.</p><p>\"An agoraphobic vampire?\" Marc asked, and I could tell he was trying very, very hard not to laugh.</p><p>\"It's more common than you might think,\" Tina said, pacing the small deck. She was so light on her feet, the boat didn't even rock. \"Particularly when the vampire in question had a bad death.\"</p><p>\"Uh, excuse me, but don't you guys have to kill somebody for them to come back? Aren't all vampires, by definition, murder victims? They all sound like bad deaths to me.\"</p><p>\"Point,\" Jessica said, actually sticking her left index finger in the air to mark the point.</p><p>\"So, didn't you guys all have bad deaths? Except for Betsy?\"</p> <p>\"Call me the day after you get run over by an Aztec, and then we'll talk,\" I grumbled.</p><p>\"We are not here to discuss such things with - with guests,\" Sinclair said, correcting himself so smoothly Tina and I were probably the only ones who knew he'd been about to say \"outsiders\" or \"humans.\" \"And you were telling us about Antonia.\"</p><p>\"Other than my mate, I have no peers. All of you, even the humans, are smarter than I.\"</p><p>\"What 'even'?\" Marc said. \"I'm a doctor.\"</p><p>Jessica put a soothing hand on Marc's arm. \"Garrett, don't be so hard on yourself. You've been out of it for, what? Sixty, seventy years? Crack a few modern history books, you'll be up to speed in no time.\"</p><p>Garrett waited patiently until Jessica was finished. \"It is not my place to befriend a queen, or a king. So when Antonia leaves me, I am lonely.\"</p><p>I was beginning to see where this was going. Oh, it'd be a lovely children's book: Garrett the Fiend Finds Friends!</p><p>\"And it seemed to me that I was - that I was the way I am now - because the good queen and the devil's daughter allowed me to feed off them. I thought perhaps if I gave my old comrades my blood...\"</p><p>Okay. This is a little embarrassing to explain, so I'm just gonna plunge in and get it over with. See, I had let Garrett feed from me, ages ago. And as a sort of punishment, I'd ordered the devil's daughter to do the same thing.</p><p>The devil's daughter being my half sister, Laura.</p><p>(I know. Bear with me.)</p><p>See, the Ant was possessed by the devil years back, only she was so fucking nasty nobody noticed. And the devil didn't care for child rearing, so she dumped Laura and took off back to Hell. Laura was adopted by (seriously, don't laugh) a minister and his wife.</p><p>How do you rebel against the evilest nastiest yuckiest entity in the universe (who looks like Lena Olin and has an amazing shoe collection)?</p><p>You go to church. You teach Sunday school. You don't touch a drop of booze until your twenty-first birthday.</p><p>And you conceal a hateful, murderous temper. Laura was going to blow one of these days, but I just didn't have time to worry about it right now. Among other things, I had slavering Fiends on my tail and thank-you cards to finish.</p><p>\"So I began to visit them and let them feed off me.\"</p><p>\"Eh?\"</p><p>\"Pay attention, Elizabeth.\"</p><p>\"They didn't try to puree you or anything?\" Marc asked.</p><p>Garrett shook his head. \"Even though I had... changed, they still knew me as one of them. They would never have hurt me. Or so I thought, until tonight. And I felt... bad. To see them. I had everything, and they were drinking buckets of cow blood.\"</p><p>I was suddenly interested in studying my feet. I wouldn't have credited Garrett with a guilty conscience. But then, I scarcely thought about him at all.</p><p>\"I was not sure what would happen, but I kept trying. I had found so much happiness in - \"</p><p>\"Your agoraphobia,\" Marc prompted.</p><p>\" - in my new life, I felt it cost me nothing but blood to try to help my old friends. And Antonia is generous with her blood. She regenerates quickly, as is part of her superior genetic heritage.\"</p><p>\"Superior genetic - \" Tina began, equal parts outraged and interested (until a very short time ago, neither she nor Sinclair believed in werewolves), but Sinclair shook his head, and she shut up without another word. God, I'd love to learn that trick. I'd only use it for fighting evil, though.</p><p>\"It worked. My friends were helped by my blood. The effect wasn't all at once. It took many visits. It was - was - \"</p><p>\"Accumulative?\" Jessica and Marc asked in unison.</p><p>Garrett nodded.</p><p>\"But they weren't really friends, right?\" I asked anxiously. \"You guys didn't even know each other in life, right? Once in a while, ole Nostril would take it in his teeny brain and toss another one of you into the snake pit and that was about it. Right?\"</p><p>\"We were prisoners together,\" Garrett said quietly, \"for decades.\"</p><p>\"Right, right, got that, sorry.\" I was so embarrassed I couldn't look at him. So I went back to studying my toes. \"So, you had good intentions, right?\"</p><p>\"Exactly so, my queen,\" he said eagerly. \"I only wished - \"</p><p>\"And in your loneliness and self-exile, you put the queen's life in danger,\" Sinclair said coldly. \"You put her friends in danger, and my friend.\" I noticed he didn't include himself in the pack. \"I should have ignored Elizabeth's soft heart and staked you myself.\"</p><p>I heard Tina flip open the seat on the stern (you could sit on it, but it held life jackets and things... sort of like a padded cedar chest), rummage around, and produce - ack! - a stake. The boat that had everything!</p><p>Garrett sank to his knees. \"All you say is true, bold king,\" he said to the deck.</p><p>\"Marc, Jessica, step to the back. You don't want to get splashed.\"</p><p>\"Now wait just a fucking minute!\" I slapped the stake out of Tina's hand so hard she nearly plunged overboard. (And what other nasty implements of death were in that chest?)</p><p>I marched over and hauled Garrett to his feet. The book rocked alarmingly, then steadied. \"This is a monarchy, right, Sinclair? And if the Book of the Dead is right, I outrank you. I was born the queen; you had to fuck me to get your crown.\"</p><p>And oh, boy, I still got pissed if I thought that one over too carefully.</p><p>\"So I'll be the one to say who gets staked.\" I shook Garrett, who drooped at the end of my arm. \"Stand up straight! Defend yourself! Be a man of the early twentieth century, for God's sake - ignorant yet sure of your superiority.\" (We were sure he'd been killed in the thirties or forties.)</p><p>\"Ever the graceful hostess,\" Sinclair commented.</p><p>\"Besides, smart guy, you didn't even notice that every time Antonia left town, Garrett was leaving the house and feeding other vampires. Too busy looking for new companies to buy?\"</p><p>\"Touche,\" Tina muttered, not looking happy about it. Watching over the estate, including the Fiend farm, was part of her job, but she knew I preferred to yell at Sinclair rather than her.</p><p>\"So, Garrett, where were we? What's the rest of the story?\"</p><p>\"My plan worked,\" he continued miserably. \"Too well, I fear... my comrades wanted to know where they were, what had happened to them. Unlike me, they were - were displeased to find themselves - \"</p><p>\"Stuck on an abandoned farm full of animal blood?\" Jessica suggested.</p><p>\"Exactly so. I tried to emphasize the queen's goodness in letting them live, tried to explain that she had set us free by killing our jailor, but they only became more enraged. Essentially, they could not understand - \"</p><p>\"Why you and not them?\" Marc asked.</p><p>\"What?\" I cried. \"So this is my fault?\"</p><p>\"Looks like,\" Jessica replied.</p><p>\"They were so angry,\" Garrett said dolefully.</p><p>\"Angry? After you saved them? Ungrateful brutes. Besides, with Nostro dead, what's to be mad about?\" Marc asked.</p><p>\"Ah, let me count the ways,\" Sinclair purred. And he did just that, ticking the points off on his long, slender fingers. \"They are angry because they are old vampires with no real power. Deprived of live blood for so long, like Garrett, they will never have real power. They are angry about, as they see it, being dumped on a farm, and never mind that it was for the public's safety.\"</p><p>\"But it was!\" I cried.</p><p>\"The vampire queen puts vampires first, my dearest. As I have repeatedly told you. Next - \"</p><p>\"I don't wanna hear any more,\" I groaned.</p><p>\" - they are angry that a new queen has been in power for two years and done nothing to help them - \"</p><p>\"Nothing! I stopped you from killing them about nine times!\"</p><p>\" - angry that the new queen knows she could have 'cured' them at any time (case in point, the happily married, articulate Garrett), and, finally, extremely angry that they've been given silly nicknames.\"</p><p>\"That wasn't the queen,\" Tina said loyally. \"That was Alice.\"</p><p>\"Alice is dead,\" Garrett said.</p><p>\"Happy, Skippy, Trippy, Sandy, Benny, Clara, and Jane killed her?\" I said, horrified.</p><p>\"I tried to stop them, but they are many, and I am one. I only barely escaped myself. Alice...\" He looked away, out over the water. \"Died cursing me.\"</p><p>\"And then you led them straight to the queen.\"</p><p>Garrett shivered. \"I had not - thought of that. My only thought was to return to safety. One of them followed me. He must have picked up the queen's scent - from my clothes, I think - and - \"</p><p>\"Blown past you, beat you to the mansion. You fell for the oldest trick in the book,\" Marc said, not unkindly. \"Leading the bad guys to the good guys.\"</p><p>\"I am a coward. I was afraid to be alone, and now I have endangered you all.\"</p><p>\"Well, now, uh, that's a little harder to defend,\" I admitted, \"but you didn't set out to do bad.\"</p><p>Sinclair made a disgusted sound and threw his hands up in the air. \"Elizabeth, really!\"</p><p>\"If I went around killing everyone who made a mistake, I'd be pretty damned lonely,\" I snapped back. I actually patted the trembling Garrett. \"Nobody's going to kill you, Garrett.\"</p><p>\"Well, maybe some of his old friends,\" Jessica said helpfully.</p><p>\"Yeah,\" I sighed. \"There's that. Ideas?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We (Sinclair) decided to go to the farm to check out the scene of the crime. We (Sinclair) figured it was best to see if things were as bad as Garrett intimated. And no one was in a rush to get back to the mansion.</p><p>Nostro had, once upon a time, owned this property, and I had been, once upon a time, a prisoner here. And getting here had taken no time at all... once Tina's cell got a signal, she made a call, Sinclair docked the boat at some teeny marina, and an empty, idling SUV was waiting for us.</p><p>\"It's good to be the king,\" Marc murmured in my ear, as we all climbed in, making me giggle.</p><p>Under no circumstances would Jessica and Marc allow themselves to be dumped somewhere safe. The argument got so heated that Sinclair pulled over on a quiet corner of Minnetonka (at this hour, every corner in Minnetonka was quiet) so we could disembark onto the sidewalk and discuss (read: shriek) it without endangering nearby traffic.</p> <p>It was only when I saw Sinclair gliding behind Jessica when I realized (a) she couldn't hear him, and (b) what his plan was.</p><p>\"Don't you dare knock her unconscious!\"</p><p>\"I wasn't going to!\" Marc yelled back, flinching away from me.</p><p>\"Or him, either,\" I added, noticing Tina sidling up to Marc.</p><p>\"It would have been for their own safety,\" El Sneako grumbled.</p> <p>\"We're perfectly safe,\" Marc said, but then, he would. He loved all things vampire. Given that he'd been about to hurl himself from a tall building to escape his boring life when I met him, I couldn't entirely blame him. \"We've got the king and queen of the vampires with us and, a, um, shell of a vampire to bring up the rear.\"</p><p>For Garrett had been no good at all since we got off the boat. He shivered, he shook, he tried to curl up. It was obvious that, since we weren't going to kill him, being outside made him miserable. For the first time I noticed how torn his clothing was, though his injuries had healed. Old, Sinclair had said, and that was certainly true. But not powerful. Never powerful. There had been a time after I brought him home like a stray when we thought... but no.</p><p>Old, but not powerful. Poor guy.</p><p>As we grumpily climbed back into the SUV, I wondered again about power. What, exactly, made a vampire powerful? Not age, certainly (I was two!), or at least, not just age. I had been told that, like me, Sinclair had risen strong. Most vampires went through a ten-year phase where they'd do anything for blood and couldn't remember their own names.</p><p>Was determination a factor? Anger, hate, vanity? Hmm, that last could explain my meteoric rise to power...</p><p>\"We're here,\" Sinclair said abruptly, braking hard enough to make my seat belt lock (force of habit; no real reason to wear the thing these days). \"And you two will stay here. I mean it, Marc. Jessica. Remain in this vehicle, or I will be cross.\"</p> <p>\"Excuse me, captain my captain,\" Marc said, \"but do you know how many horror movies start out like this?\"</p><p>\"We probably shouldn't split up,\" Jessica agreed. \"Besides, if you really thought the Fiends were still here, you'd never have let us come. You'd have clocked Betsy, too, if it had come to that.\"</p><p>Sinclair muttered something that the chime of the \"door open\" light drowned out; sounded like \"wretched woman.\" We all solemnly clambered out with him, knowing that even if Marc and Jess had won a victory, it was nothing to celebrate. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We were okay until we found Alice's body. Sure, there had been an obvious fight, the fence had been torn open in several places, there were splashes of blood on the ground, but... really, I was okay until we found her head.</p><p>While Marc supported Jessica as she threw up in the chokecherry bushes (he was pale, but had seen so much death as a doctor, even this couldn't make him sick) and I swayed dizzily on my feet,</p><p>(don't faint don't faint don't faint QUEENS DON'T FAINT!)</p><p>Tina and Sinclair prowled the area like vampiric bloodhounds, finding arms, legs, both halves of a torso.</p> <p>\"This is maybe a dumb question,\" Marc began, smoothing Jessica's tight black cap of curls and letting her lean on his shoulder.</p><p>(don't faint don't faint don't faint)</p><p>Tina shook her head. \"There's no chance of regeneration. Absolutely none. Frankly, I'd be amazed if the queen could handle this kind of punishment. My queen?\" Her voice sharpened. \"Are you all right?\"</p><p>\"Of course she's all right,\" Sinclair said, squatting to examine another body part. \"Queens don't faint.\"</p><p>\"Damn right! Look, Alice is obviously dead. What are you poking around for?\"</p> <p>\"Oh, this and that,\" he said vaguely. \"I'm a little puzzled by the condition of the corpse.\"</p><p>\"I was thinking that exact thing,\" Tina added.</p><p>\"What are you talking about?\" I asked, but they were ignoring me and having their own conversation.</p><p>\"Did you call - \"</p><p>\"Already done, my king.\"</p><p>\"Excellent.\"</p> <p>\"Ah, and a mysterious van of vampires will show up and dispose of all the evidence,\" Jessica managed, wiping her mouth.</p><p>\"More or less.\"</p><p>\"I think we should go back now, can we please go back home now?\"</p><p>Sinclair looked at Garrett with obvious distaste. \"What makes you think it's safe?\"</p><p>\"I-I don't think they'd stay. Not if they couldn't find... her.\"</p><p>Okay, so Garrett wasn't exactly being the stand-up guy you read about in romance novels. But I felt sorry for him - it couldn't have been much fun getting the crap stomped out of him by half a dozen pissed off vampires, vampires he'd tried to help, and then come home to tell Sinclair what he'd done.</p><p>Sinclair didn't understand about fear, how it ate your guts, and how nobody came off like they did in the movies. He'd claimed, on occasion, to have feared for my safety, but frankly, I doubted it.</p><p>\"Even if they are still there, it's our home, and a bunch of jerkoff vampires aren't keeping me out of it. I mean, you explained that to me once already, Sinclair. How we're not worthy of our crowns if our people can't find us.\"</p> <p>\"Yay, Queen Betsy,\" Jessica said.</p><p>\"But they're sure as shit keeping you two out of it,\" Marc teased.</p><p>\"Boo, Queen Betsy.\"</p><p>The argument raged all the way back home. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marc and Jessica's apparent casual attitude toward death was partly my fault. Make that totally. I'd saved their butts so many times (from suicide, murder, cancer) they just naturally felt impervious around me.</p><p>It didn't help that none of us were talking about it in any real detail. See, I'd always been different from other vampires. So different than even Tina (the oldest vampire I hadn't killed; she had made Sinclair way back when) didn't know much about me, or what I could do.</p><p>I had, completely by accident, cured Jessica's cancer and killed an eight-hundred-year-old vampire librarian. And I'd done it without laying a finger on the librarian. I just sort of - pulled her into me. What was left wouldn't have filled an urn.</p><p>That didn't bother Sinclair or Tina especially, since I'd saved Sinclair at the time. What did bother them was that I had no idea how I'd done it and had been unable to do so again. Not that I'd tried. God, no. I figured somebody would have to die for me to try out my nifty new power. Pass.</p> <p>Sinclair had been spending some time in the library perusing the Book of the Dead. He thought I didn't know. But I understood his puzzlement, and I knew he was being careful.</p><p>Read that thing too long - written on human skin with blood by a centuries-dead insane vampire - and you went crazy. Upside was, it was always right. Downside, there was no index or table of contents. You just opened it and took your chances that you'd actually read something, y'know, useful.</p><p>Worst of all, it always came back to me. It had been set on fire and thrown into the Mississippi River (on two separate occasions!). It always showed up wherever I was. Fucking creepy thing that I didn't dare read and couldn't get rid of.</p><p>Or tell Sinclair I knew he was reading it. How could I bring that up without mentioning Jessica's cure, or what I did to Marjorie?</p><p>And don't even get me started on what I did to the Ant and my dad. I'd wished for a baby, and I got one - because they had been killed. It wasn't my fault, it was a Monkey's Paw situation. I'd been wearing a cursed engagement ring at the time. One gruesome car accident later, and I was the sole guardian of my half brother, BabyJon.</p> <p>Thank God he'd been spending the weekend with the devil's daughter and didn't get ripped to pieces by the Fiends!</p><p>(I can't believe I just said that. This, this is what my life had become.)</p><p>What was worse, that my distant dad and bitchy stepmother were dead, or that I didn't feel too broken up about it? Let's face it, he'd never been there for me, and she was a stiff-haired nightmare.</p><p>Who, last I checked, had been haunting me. Maybe I'd get lucky - maybe instead of an actual ghost, that vision of her was just a hallucination, the onset of permanent brain damage.</p><p>I sighed as we pulled into the driveway. I should be so lucky, I told myself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"This is an inopportune time,\" my husband pointed out as I knocked on the door at</p><p>1001 Tyler Street</p><p>, a small, neatly kept gray and white house.</p><p>\"No shit,\" I muttered. The mansion had been trashed; it was the next evening, and Jessica had called in an army of fixer-uppers. Even now, after sunset, they were still working on the house. No sign of the Fiends, and Tina had promised to get Marc and Jess into the tunnel at the first sign of trouble. She even thoughtfully provided flashlights by the entrance to the mansion basement. Even better: Marc's ankle was much better. No break, thank God.</p> <p>\"Then why are we here?\" Sinclair asked, looking around the tidy suburban neighborhood. Inver Grove Heights was famous for their tidy suburban neighborhoods.</p><p>\"Because he's been incarcerated for months, and this is the first time I've seen him since I got married.\"</p><p>\"And... ?\"</p><p>\"I want my bigoted, angry, dying grandfather to meet my dead husband. Now slap on a smile and feel the family joy!\"</p><p>Sinclair managed a friendly grimace, as the lady who ran the hospice ushered us in. It wasn't really a hospice; she was a registered nurse who owned the house, and she had three patients, including my grandpa. She could give meds and change dressings, and knew when to haul in an MD.</p> <p>In return she made a reasonable living and managed not to smother my grandpa with a pillow. For their part, they were living in an actual home and not dying in an impersonal hospital ward.</p><p>\"Get lost,\" my beloved maternal relative said warmly.</p><p>\"Hi, Grandpa. Just dropped by - \"</p><p>\"Did you bring me a Bud?\"</p><p>\" - to say hi and tell you I got married.\"</p><p>He squinted at me with watery blue eyes. His hair was lush and entirely white - it thrived on Budweiser. His eyebrows looked like angry albino caterpillars. He was in his wheelchair by the window, dressed in sweatpants and a blue checked flannel shirt, feet sock-less in the heel-less slippers.</p> <p>He didn't need a wheelchair, but Mr. Mueller in the next room had one, and my grandpa broke every plate he could find until Nurse Jenkins relented and ordered one for him. Mueller also had a colostomy bag, but my grandpa graciously decided not to go after that as well.</p><p>Next to the Ant, and maybe the devil, he was the most evil person I'd ever known. Come to think of it, most of the male influences I'd had growing up had either been -</p><p>\"Your mom still fat?\"</p><p>\"She's at the perfect weight for her height and age, you bony smelly man!\" I snapped. Great, a new record. I'd been in the same room with him for eight seconds, and already I was screaming. \"It's a miracle she isn't a sociopath, raised by a rotten old man like you!\"</p><p>\"Hello,\" Sinclair said. \"I'm Eric Sinclair, Elizabeth's husband.\"</p><p>Gramps scowled at the vampire king. \"You look part Indian. You got any Injun in you, boy?\"</p><p>\"It's possible,\" Sinclair said mildly, as I moaned and chewed on a throw pillow. \"I never knew my biological father.\"</p><p>I spit out some feathers and stared at him. \"You never knew your father?\"</p> <p>\"He could be part black!\" my darling, dying relative howled. \"He could be - he could be Catholic!\"</p><p>\"I believe I may be Californian,\" Sinclair added helpfully.</p><p>\"Anyway, I got married, this is the guy, nice to see you again, don't drop dead anytime soon, because I couldn't handle another funeral this year, good-bye.\"</p><p>\"Yup,\" Grandpa said, smacking his teeth (he still had them all... a chronic drinker and smoker with gorgeous hair and perfect teeth). \"Hope that witch is having a good time screwing the devil in Hell.\"</p><p>\"I don't think the devil swings that way,\" I said truthfully. I had finally remembered the one reason I hadn't wrung the old buzzard's neck twenty years ago.</p><p>Sinclair cleared his throat. I prayed he wasn't eyeing my grandpa and trying to figure out which one of the two of them was older. \"Oh, you knew the, ah, late Mrs. Taylor?\"</p><p>\"Knew her? Beat the shit out of her.\"</p><p>\"How sweet.\"</p><p>\"Twat stole my girl's husband.\" A cat wandered near, and Grandpa kicked it away, sending his slipper flying. Sinclair snatched it out of the air and courteously handed it back. \"She had to go down.\"</p><p>\"Go... down?\"</p><p>\"Fistfight. The Halloween I was fifteen. The cops came,\" I sighed reminiscently, \"and everything.\"</p><p>\"Bitch went to her grave with fewer teeth than I have,\" my warm, friendly grandfather cackled.</p><p>\"You engaged in a physical fight with a woman?\"</p><p>\"Slut should have kept her legs closed round a married man. 'Course,\" he added, looking at me, \"your father always was a worthless bastard.\"</p><p>\"As I recall, he got a fist in the face that night as well.\"</p><p>\"And woulda got a boot in the ass! If the cops hadn't cuffed me by then.\"</p><p>\"The arresting officer gave me a Charms Blo-Pop,\" I reminisced, \"and took me over to stay with my mom. She got to read the police report.\" I stooped and kissed his wrinkled forehead. And handed him the Cub grocery bag, which was full of cans of Bud. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Who's here?\" I asked, yawning as I strolled into the kitchen. Sinclair, once done laughing, had been in a rush to get back to the manse, for which I could not blame him. He'd snuck into the library to read the Book of the Dead, and I'd come to the kitchen to pretend I didn't know, and also for a smoothie.</p><p>\"Here, what? Here here?\" Marc was yawning, too, and scratching his ribs; he smelled like cotton balls, antiseptic, and was wearing last night's scrubs. His hair, shaved nearly bald when I met him, was now shoulder length, dark, and fell into his eyes a lot. It was a wonder how he examined anyone at the hospital. \"I hate your creepy vampire superpowers.\"</p><p>\"Liar.\"</p><p>\"It's Nick,\" Jessica announced, shutting the fridge and turning around, a pomegranate (a pomegranate! She ate 'em like oranges, I swear to God) in her left hand.</p> <p>\"Oh.\"</p><p>I'd probably better leave. I had recently discovered that Detective Nick Berry, who was in love with my best friend, hated me. And not \"hate\" like \"I hate boogers.\" Hated me like plague. Hated me like famine. The fact that I deserved it didn't make things any easier. \"You guys have a date?\"</p><p>\"No,\" she said cryptically, which made me want to strangle her. When Jess didn't want to cough up, you could stick a gun in her ear, and she'd laugh at you. Must be from growing up rich. Sinclair was the same way. Stick a gun in my ear, and I'd talk until your pants fell down.</p><p>Then: \"How's your grandpa?\"</p><p>\"Still worried that your blackness will infect me.\"</p> <p>\"That's the plan. First you, then all the other blondes, and then on to brunettes and redheads. Once we have the womenfolk, all the babies will come out black, too. We all voted on the plan at the last Black Conspirators meeting.\" Ignoring Marc's choking, she added, \"Bet Sinclair had a good laugh.\"</p><p>\"To put it mildly. He was all soft and nostalgic at first, talking about how it was nice to have live in-laws, but my grandpa wiped the smile off his face soon enough. But never mind that. What's Nick doing here?\"</p><p>\"Meh,\" the Cryptic One replied.</p><p>\"He's a carpenter by night? Not that we need one anymore; that gang you hired did a pretty good job.\" And they did. Except for the smell of sawned wood and fresh paint, you'd think nothing had happened.</p><p>\"Yeah, thanks, Jessica. What do we owe you?\" Now that I was married to a rich guy, I could say something like that and not have Jessica burst into derisive laughter. But as usual she just waved a hand: don't worry about it. I was so used to her money I hardly noticed it was there. Shit, she hardly knew it was there. But she was never obnoxious about it, seeing it as something permanent and unchangeable, like her skin color and taste in music.</p><p>\"So,\" I continued, \"not to go on and on about something - \"</p> <p>\"You?\" Marc asked.</p><p>\"Never,\" Jessica declared.</p><p>I scowled at them both. \"What is Nick doing here?\"</p><p>\"What do you care?\" Marc asked, plucking an apple out of the basket on the counter and taking a wet bite. \"He'd rather see you dead than in last year's Blahniks.\"</p><p>I shuddered and wiped masticated apple off my cheek. \"That was mean. Even for you.\"</p><p>\"Obviously,\" Marc continued, shaking his hair out of his eyes (and into Jessica's pomegranate), \"he and the richest woman in the state - \"</p><p>\"Richest person,\" Jessica corrected gently.</p><p>\" - have a hot sloppy date. FYI, girlfriend, you're aware he's using you for your money, right?\"</p> <p>\"His grandpa was one of the Deeres.\"</p><p>We gaped at her. This was a tidbit we hadn't heard before.</p><p>\"Shut... up!\" Marc nearly screamed.</p><p>\"Nuh-uh.\" Jessica popped another pomegranate seed into her mouth and tried not to look smug. She sucked at it, as usual.</p><p>\"As in the John Deere tractor company?\" I advanced cautiously. (As in, anyone who wanted a tractor, trailer, thresher, or combine usually bought 'em from the John Deere Company.)</p><p>\"Yup. He's got money falling out of his butt.\"</p><p>\"Yum,\" Marc said absently.</p><p>I tried to speak for a couple of seconds and finally choked out, \"Why didn't you tell us?\"</p><p>\"Why would I? What difference does it make if he's got a seven figure trust fund?\"</p><p>\"Well, it certainly makes him a more attractive man,\" Marc blurted before he could stop himself. \"Also, money makes a guy's dick huge.\"</p><p>\"Go fuck yourself,\" she said congenially enough.</p><p>\"If only I could,\" he mourned. \"It'd be the only way I'd get any, that's for sure.\"</p><p>The thing is, as exasperated as Marc and I were to be the last ones in on this incredibly juicy gossip (me more than him, probably, I mean, we were best friends), Jessica really meant what she said. She wouldn't know what difference it made, and wouldn't care.</p><p>It occurred to me that Sinclair had probably found this out ages ago and had also neglected to tell me. Must be a rich guy thing. Excuse me. Rich person. Not to mention, definitely the week for me to find out shit I should already have known.</p><p>\"I'll get the door,\" I said gloomily, because I knew neither of them could hear Nick coming up the walk, and also because I decided the quickest way to find out why he was here was to let him in. As I started to leave the kitchen I nearly ran into my husband.</p><p>\"I'm getting the door,\" I explained, trying to sidestep him.</p><p>He resisted, which made it like trying to sidestep a barn. \"I'll accompany you.\"</p><p>I stared up at him. He must have died clean shaven. At least, I never saw him shaving, and there weren't any shaving - what was the word? accoutrements? - in his bathroom. God, he was gorgeous. Gorgeous and distant, like the sunrise he could never see. There were times I looked into that perfect, impassive face and wondered what he was thinking. Sometimes I was truly mystified: Out of all the vampires in all the world, why'd he want me?</p><p>We were still sidestepping each other in the hallway. \"Why d'you want to come with me?\"</p><p>\"I'm unable to be outside of the goddess-like presence that is you?\"</p><p>I heard Marc making vomiting noises as the kitchen door swung shut behind us. \"No, seriously.\" Except with Sinclair, I never knew when he was serious.</p><p>\"I miss you, and I want to be with you?\"</p><p>\"Come on.\"</p><p>\"I am coming,\" he said, falling into step behind me.</p><p>\"Yeah, this stopped being cute about five seconds ago.\"</p><p>\"If only,\" my husband sighed.</p><p>\"Sinclair, what the hell is up?\"</p><p>\"You have a meeting with Detective Berry, who has in the past threatened you with a firearm, and thus I will be in attendance as well. That is all.\"</p><p>\"That is all?\"</p><p>\"Oh. Also, if he points a firearm anywhere near you, I shall pull off his arms and stuff them down his throat.\"</p><p>He said that just as I was swinging the front door open. \"You will not! Jessica will be impossible to live with! (More impossible.)\" Then: \"Wait a damned minute! You knew about Nick coming to see me before I did, even if he tried to kill me?\"</p><p>\"Of course.\"</p><p>\"You prick.\"</p><p>Nick, all annoying blond good looks and broad shoulders, smirked at us. For the first time, I noticed he dressed pretty damned well on a cop's salary. That was an Armani hanging off his swimmer's shoulders, if I wasn't mistaken.</p><p>\"Did I come at a bad time?\" he asked, grinning, and it took all I had not to slam the door in his stupid, rich, cop face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I should explain that before I died, Nick and I had been almost friends. When I'd been attacked by the Fiends outside Kahn's Mongolian Barbecue (the heavy garlic I'd used had saved my life; the Fiends had nibbled and fled instead of really going to town on my gizzard), he'd been the cop to take my report. We'd occasionally shared a candy bar and, if not friends, had at least been friendly.</p><p>Then I'd risen from the dead and, completely unaware of my undead sex appeal, left Nick panting after me. Sinclair had to mind-wipe him, including the part about me dying.</p><p>Trouble was, it wore off. Or my mind-wipe had been stronger than the king's. Either way, we found out a couple months ago that he knew what we were, knew what we did, knew what we had done to him, and pretty much hated us.</p><p>So out of guilt, I usually try to be super nice and accommodating whenever he came around.</p> <p>Except, of course, right now.</p><p>\"Nobody's having any meeting until you two jerks tell me when you set this up!\"</p><p>Nick arched his brows at my husband. \"You didn't tell her?\"</p><p>\"I was hoping,\" he said stiffly, \"she would be out shoe shopping.\"</p><p>\"Well, the joke's on you, asshat! Ha! I went shoe shopping last week! So there!\" I jerked my pointing finger away from my husband and jabbed it at Nick, who flinched. \"So talk! Are you here to kill me?\" (Man, the number of times I had to ask this question in a month... )</p> <p>\"No, my captain said I couldn't, unless I could prove in court you were a vampire.\"</p><p>I nearly fell down in the foyer. \"What?\" I gasped, barely hanging on to the doorknob.</p><p>\"Kidding. Come sit down before you stroke out.\" Nick pushed past us and, like robots, we followed him into one of the parlors. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"So!\" he said with faux brightness. \"Set up a meeting with your wife, which you didn't share with your wife. I love open marriages, don't you?\"</p><p>Since I'd been having some doubts in that area myself, all I could do was scowl at Sinclair while smiling at Nick, which gave me an instant migraine. \"How can I help you, Nick? Did you want to see Jess? Oh, wait - \" I should offer him a drink. But what did he drink? Was it Sprite, or Coke? Wait. I drank Coke. I -</p><p>\"Detective Berry,\" Tina said demurely. She entered, eyes lowered, and offered him a tray on which were a tall glass full of Sprite, another glass full of ice, a silver ice picker-upper, a small bowl of sliced lemons and limes, and a big, thick, cloth napkin. Also, there was -</p><p>\"My queen,\" she said in a soft voice, gaze on the carpet. I took the iced Coke (with a wedge of lime, just the way I liked it), and Tina managed to somehow glide away while not looking at anyone, yet giving the impression of instant service, should anyone need a refill. This, I had since learned, was the height of vampiric etiquette. It's tough to do the vampire mojo and work your will on the poor human if you're not looking them in the eye.</p> <p>I thirstily slurped my Coke, amazed all over again at Tina's unflagging efficiency. Super secretary, maid, waitress, Sinclair's right hand, and she'd been loyal to me from the moment the vampires threw me into Nostro's pit of despair. I couldn't help but admire her, but I never forgot the basic fact: her loyalty, always, was to Sinclair first. Her loyalty to me was because I was his wife.</p><p>The day I forgot that might be a short damn day.</p><p>\"Good service around here,\" Nick said, slurping his Sprite and chewing enthusiastically on his lemon wedge.</p><p>\"Oh, like you're not used to it at the Deere family compound,\" I snapped, chomping into my own lime slice. Yerrgh, sour! Even for a lime. I reached into my left pocket and pulled out a Cherry Blo-Pop. Unwrapped it, dipped it in the Coke, then contentedly sucked the Coke off the Pop.</p><p>\"How disgusting,\" Sinclair commented.</p> <p>\"Which? That I'm slowly getting addicted to suckers, or that Nick comes from the Deeres?\"</p><p>\"Finally bothered to find out about someone besides yourself, huh?\"</p><p>\"Jam it up your ass!\" I snarled, a not auspicious beginning to our meeting. And why were we meeting? He hated me, I was scared of him (but not for the reasons he thought), and Sinclair would just as soon he dropped dead (he took a dim view of cops shoving their service revolvers into his wife's face). \"On the way out the door!\"</p><p>\"Hmm.\" Nick checked his watch. \"Four minutes... a new record for us. Actually, Betsy, as I explained to the king of all suckheads over there, I need your help in tracking down a bad guy.\"</p><p>\"You - me? Tracking down a--what?\"</p><p>\"English really is your second language, isn't it? And your suckhead is here because he's got this nutty idea that I'm going to try to shoot you in the face. Maybe twice!\" he added cheerfully, slurping the last of his Sprite.</p> <p>\"Have a seat, Detective Berry.\" Sinclair looked up at me and patted his lap, and I ignored the tug between my legs because a meeting with a homicide detective while curled up in the arms of the vampire king would not be the severe business mien I was hoping for. Bad enough I was wearing faded blue sweatpants and a sweatshirt that read EVERYTHING YOU'VE HEARD IS TRUE.</p><p>Instead, I plopped on the couch across from Nick (ignoring the plume of dust I accidentally raised), parallel to Sinclair.</p><p>\"What's up, boys?\" I asked, sniffing my Coke glass.</p><p>\"Murder, of course.\" Crunch, slurp. He was really going to town on those lemons. \"Check it.\"</p><p>He spun open several folders, and suddenly there were (gag) autopsy photos all over the Victorian-era mahogany coffee table. Thankfully, none were of children, but in all other ways they were different: race, sex, age, hairstyle.</p><p>\"And how can the house of Sinclair help the Minneapolis Homicide Department?\"</p><p>I opened my mouth (momentarily forgetting the lollipop; the thing almost fell on the floor), but decided I kind of liked that. House of Sinclair. Like House of Pancakes! Without so much syrup.</p><p>\"Guess what all these guys (and gals) have in common? \"</p> <p>\"They all need a set and shampoo,\" I said, examining one photo and putting it down with a grimace. I wiped my fingers on my sweatpants, as if the picture had actually been dirty.</p><p>A year ago, I'd be sprinting from the room and vomiting. That was before Nostro, and Marjorie, and Alice, to name just a few. The guy who said \"the more things change, the more things stay the same\" had a major frigging head injury. Because I, Betsy, the vampire queen, am here to tell you that the more things change, the more things change.</p><p>\"Close,\" Nick said, still looking abnormally cheery, \"but no Kewpie doll for you, blondie.\"</p><p>Sinclair was also examining the photos. \"They certainly weren't killed by vampires.\"</p><p>\"True.\"</p><p>\"Do we have to do the guessing thing?\" I whined. \"Just tell us.\"</p><p>\"They all had records.\"</p><p>\"Like, prison records?\"</p><p>\"Like, they were all thieves, rapists, killers.\"</p><p>No wonder he was so happy. Cops loved it when bad guys got killed.</p><p>\"This is how you spend your evenings?\" the Ant said behind my left shoulder, causing me to yelp and spill my ice all over Nick. \"Looking at disgusting pictures? This is worse than when you were modeling for the Target catalog.\"</p><p>\"Go away. I'm working.\"</p><p>\"Gaaahhh,\" Nick gah'd, frantically scraping ice out of his crotch. \"What's gotten into you, blondie?\"</p><p>\"Private family business,\" Sinclair said smoothly.</p><p>\"My dead stepmother is haunting me,\" I snapped. \"Now get lost, Antonia!\"</p><p>\"Oh, that.\" Nick looked unimpressed. \"You see dead people. Jess told me all about it.\"</p><p>\"Well, that's super. Remind me to strangle her when I see her again.\"</p><p>\"Touch her,\" Nick said pleasantly, \"and I'll empty my nine into your nose.\"</p><p>\"Children,\" Sinclair warned. \"It seems the late Mrs. Taylor has a gift in death, as in life, of getting on my wife's nerves and distracting us from our point.\"</p><p>\"Just like your wife!\"</p><p>\"Shut up,\" I insisted. \"Tell us what you want, or get lost. Or both.\"</p><p>\"Fine,\" the Ant huffed, and vanished.</p><p>Well! That was unexpected, and welcome.</p><p>\"Guess what else all these guys have in common,\" Nick said, rattling my empty Coke glass. Tina appeared from nowhere, refilled it, and glided away. He absently handed the glass to me, and I didn't know whether to be flattered he'd noticed I needed a refill, or annoyed he was treating the brilliant Tina like she was a waitress. \"Go on. Guess. You'll never guess.\"</p><p>\"Since we'll never guess,\" Sinclair said, \"why don't you just tell us?\"</p><p>\"Just one teensy guess?\"</p><p>\"Niiiiiick,\" I whined.</p><p>\"Um. Ah. Hmm. They were all killed by a rogue cop or cops?\" Sinclair inquired innocently.</p><p>We both stared at him.</p><p>\"Goddammit,\" Nick cursed. He ignored, or didn't notice, Sinclair's flinch. \"You gotta tell me how you knew that. I know for a fact there's no suckheads on the force.\"</p><p>\"No, but there are sources available to the suckheads. As you well know, Detective Berry, nothing leaks more quickly or messily than a police station.\"</p><p>\"So cops are tracking down bad guys and executing them?\" I stared at the pictures. Gunshot wounds, all of them.</p><p>\"The ones we can't put away legally, yeah. This guy.\" Dave tapped the photo of a pale, brown-eyed man who looked extremely pissed off, either because or in spite of the bullet wound over his left eye. \"This guy was a burglar, and worse. He'd rape whoever was asleep in the house - we think he was getting the security codes from someone inside the security company, but he, uh, died before we could prove anything.\"</p><p>\"Charming,\" Sinclair said coldly.</p><p>\"Anyway, after the rape, he'd take everything out he could carry. We know he did it seven or eight times, but couldn't ever prove it. No ID. No prints. No semen. Nothing. Then - bam. He shows up deader than hell.\"</p><p>\"And your problem with this is... ?\" Sinclair's dark brows arched.</p><p>\"Because the cops are good guys,\" I said before Nick could reply. \"I mean, it sucks if they can't catch a rapist, jeez, you won't hear me argue that, but we have laws. We have rules. The good guys can't all of a sudden throw the Constitution out the window and strap down and shoot people.\"</p><p>I looked at Sinclair and Nick, who had identically blank looks on their faces. \"Well. They can't.\"</p><p>\"As it is, I agree with the psycho vampire queen. Which brings me here.\"</p><p>\"Why does the house of Sinclair have to clean up your mess?\" my husband asked quietly.</p><p>\"It's like your wife said. We make various promises and pledges when we get our badges - I won't bore a sociopath like you with them - but what it boils down to is, we follow the law. And boys and girls, Sherri's boy Nicky loves the law.\"</p><p>\"Don't you have a special team or task force or whatever working on this?\"</p><p>\"Yeah. I'm it.\"</p><p>\"You? Just one guy? I mean, I know you're good at your job, Nick, but - \"</p><p>\"Well, let's say I have some influence with the captain.\" Nick mimed driving a tractor.</p><p>\"No doubt. And, could it be, the police do not necessarily wish for these people to be caught?\"</p><p>\"It could be,\" he admitted. \"But they're gonna get caught. 'Cause I've got a secret weapon.\" He pointed at me.</p><p>\"What makes you think - oh, shit, never mind, you know I'll do it.\"</p><p>\"That's true.\" Nick smirked. \"I did know it.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"You should let him solve his own problem,\" Sinclair said in a low voice, as Nick let himself out. \"He's playing on your misplaced guilt.\"</p><p>\"Misplaced? We raped his brain. And lied about it. To his face. For over a year.\"</p><p>He shrugged. He'd been a vampire too long; his conscience went right out the window sometimes.</p><p>\"Have you ever considered - \"</p> <p>\"Yes.\"</p><p>\"Don't be a wiseass. Have you ever thought that the guy hates us and knows how to kill us, but hasn't?\"</p><p>\"I credit Jessica with that more than Detective Berry's good sense.\"</p><p>\"Point,\" I conceded. \"And yeah, it's a little obnoxious that he came over all expecting me to say yes right away - \"</p><p>\"Also, you're flattered.\"</p> <p>\"I am not! Okay, a little. Listen, this is our chance to win him back!\"</p><p>\"And why,\" he sighed, rubbing my shoulders, while I tried not to purr and lean into him, \"would we want to do that?\"</p><p>\"Listen. Oooh, don't stop. The whole reason you pushed Jess to go out with him was because you wanted a source in the police department.\" I paused. \"Another source, I mean. That reminds me. You've been keeping secrets. More than usual, I mean.\"</p><p>\"Oh?\" he said silkily, tightening his grip. My collarbones groaned under the pressure. Or maybe that was me groaning. \"Because there are one or two things I would like to discuss with you as well, if you're opening that door.\"</p><p>\"Ahhhh... well, that's, um - \" Fortunately, I was saved by the sound of splintering wood, and then Nick skidded down the foyer, his face a mask of blood.</p><p>\"Face us, false queen!\"</p> <p>\"Oboy,\" I said, nearly tripping as Sinclair grabbed me and thrust me behind his back. \"That doesn't sound good.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They streamed in, stepping smoothly over Nick's unconscious body. They moved like cats and had the hungry, feral look of same. At least, as far as I could tell from peeking over Sinclair's shoulder; I kept trying to elbow him out of the way, and he kept jamming me behind him.</p><p>\"Uh, hi. You'd be, um, Garrett's friends, right?\"</p><p>Happy, Skippy, Trippy, Sandy, Benny, Clara, and Jane glared at me as one. Somewhere, they'd clothed themselves - probably at the farm, I was seeing an awful lot of flannel - but still had the rank smell of the unwashed. They were all too thin, even bony. Their hair was varying colors and degrees of snarled.</p><p>\"Well,\" I plunged, \"I'm sorry I wasn't here when you stopped by the other night - \"</p> <p>They weren't moving. Perhaps I was dazzling them with my ineptitude. It had happened before.</p><p>\"But at least this gives me a chance to, um, explain and even, um, apologize - \"</p><p>\"Do not apologize to them,\" Sinclair snarled. \"One such as you should not even speak to them.\"</p><p>\"Shush! He's cranky,\" I explained, \"no blood tonight, you know how it is.\"</p><p>\"We know exactly how it is,\" Clara said.</p> <p>\"Oh. Right.\" Awkward. What was interesting wasn't their reaction so much as Sinclair's. He wasn't angry so much as - as - offended, that was the word. Their presence offended him. I guess the Fiends were the vampire untouchables.</p><p>\"Anyway, the thing is, it has been a crazy couple of years. For me, I mean. First there was the whole 'you are the queen' thing, which I was so not prepared for. And, I might point out, a lot of people were telling me to kill all you guys when Nostro - when you ate Nostro - but I didn't. In fact, I saved you.\"</p><p>\"For imprisonment and slow starvation.\"</p><p>\"I'm getting to that.\" I lowered my voice. \"Okay, so then there was a serial killer - more than one, come to think of it - and then my half sister turned up, who was the daughter of the devil. The devil! I mean, please!\"</p><p>\"Yes, please,\" one of them said. \"Let us end this.\"</p><p>\"But I'm not finished! And then - before then, actually - all these ghosts started showing up looking for favors, like in that movie? Never mind, you didn't see that movie.\"</p> <p>One of them was rubbing her temples. I sped up the This Is My Life portion of our program. \"Then my friend got sick, lethally sick, and I had this wedding to plan, and all these werewolves showed up, and my dad and step mom died because I wanted a baby, and I had to kill a librarian, and it was just - just a crazy, crazy time. I mean, totally nuts.\"</p><p>\"So. Essentially,\" Sandy - or was it Benny? - said, \"you forgot about us.\"</p><p>\"Well.\"</p><p>\"Do not,\" Sinclair said through gritted teeth.</p><p>\"Kinda,\" I admitted. \"But I had all these really good reasons! I - yeek!\" Sinclair had shoved me into the curtains as seven enraged vampires launched themselves at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It's hard to even describe the fight. With enhanced strength, speed, and reflexes, everything happened so fast, and then it was all over but the bandaging.</p><p>The first one that got near Sinclair dropped, and so did the next one. One got past him and got a good grip on my hair (must have been a female killed in the 1920s... that was the hair-pulling era, right?), but I brought my head forward in a blur of coolness and broke her nose with a satisfying crunch. The blow made me stagger, and I wiped her blood off my forehead... sluggish, nasty dark stuff.</p><p>And the screaming! All the screaming! Wait. Only one person was screaming. Marc was screaming.</p><p>I shoved Hair Puller at the fireplace, peripherally noticing the ceramic tiles rain down on her stupid face as she hit the floor. Then I ran toward the shrieking Marc, who was on his back fighting off flashing fangs and teeth (Clara? Benny? It was going so quickly I couldn't tell).</p> <p>Before I could get to them, Tina leaned over them, grabbed Clara/Benny by the hair and yanked him (ah, a guy, I saw it now) off Marc. She had something long and shiny in her other hand, and I recognized it, as she swung the Wusthof butcher knife (Jessica's pride and joy, she had a whole collection in the butler's pantry, and they were wicked sharp), hard enough to decapitate Benny. His headless body fell with a thump, and Marc scrambled back on his hands, so the thing wouldn't fall on him.</p><p>Tina had dropped the head and was turning to see who else she could decapitate, when a wooden spoon burst through her chest.</p><p>\"This?\" the Ant demanded. \"This is how you spend your time? Squabbling with people who don't bathe?\"</p><p>\"Not... now!\" I ran to Tina, nearly tripping over the body of a Fiend Sinclair had killed, and yanked the serving spoon out of her heart. Then I grabbed her head and screamed into her eyes, which had begun to gloss over. \"Don't you dare die on me, you efficient bitch, don't you dare!\"</p><p>\"I - I'm fine. I'm all right, my queen.\" We both looked down. The wooden serving spoon, about nine inches long, was now ash. I had turned it to ash. And Tina was all right.</p> <p>No, I didn't know how.</p><p>And then the door was slamming, the other Fiends were gone, and the fight was over. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We'd killed two of them: Sinclair had killed Trippy; Tina had killed Benny. Marc was wounded, bleeding like the proverbial stuck pig, but it looked mostly superficial. Jessica, who had been keeping a terrified Garrett from fleeing down the tunnel, drove Marc to the ER. Marc's last delirious comment was, \"Will I become a vampire now? Cool!\"</p><p>By then, the rest of the Fiends had fled, and Nick had regained consciousness. \"Yeah, that'll show 'em,\" he said groggily, as he caromed from one wall to another, trying to stagger out the door. It looked like he had a broken nose, but I hoped that was the worst of it. We offered to call an ambulance, but he tagged along with Jessica, who I knew would tell him the whole story.</p><p>Sinclair carried Tina upstairs to the hot tub room, dunked her in (over her protests; we were pretty sure I'd cured the wound), and, after ten minutes, let her out.</p><p>About the water thing: for some reason, when vampires are grievously hurt, water speeds up the healing process. I had no idea why. Maybe because our undead bodies didn't have much moisture? I didn't know. So much of being a vampire was like magic to me. And not the cool kind, either.</p> <p>Tina shook the wet hair out of her eyes and grinned at me. \"Two down. Five to go.\"</p><p>\"You were nuts, launching yourself at that guy.\"</p><p>\"You and the king had your hands full,\" she said dryly. I handed her a robe, and she snuggled into it. Not a mark on her, thank God.</p><p>\"But you were stabbed with wood,\" Sinclair said, looking ashen. \"I saw it.\"</p><p>Tina looked at me, and I winked. So she shrugged and said to the king, \"It must have missed my heart.\"</p> <p>Oooooh, she's actually lying to the king of the vamps! Somebody write down the date and time. And I had to admit, it was nice to be the one keeping secrets for a change.</p><p>\"But I saw - \"</p><p>\"Come on,\" I sighed. \"Let's make smoothies. Or something.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We visited Marc later that night. Sure, two o'clock in the morning isn't considered optimum visiting hours, but this wasn't the first late-night trip to this hospital for me. Or even the tenth. I knew who to sidestep, who to put the vampire mojo on, and who didn't give a tin shit if Bin Laden was on the floor, as long as he or she could snag an extra hour of sleep in the on-call room.</p><p>\"Disgusting,\" Marc informed me cheerily from his bed, as he played with the tilt settings and television remote control at once. \"This hospital's about as secure as the men's rooms in the Target Center. But thanks for coming to see me so fast.\"</p><p>\"After my second smoothie, you were all I could think about.\"</p><p>\"Tell the truth,\" he said soberly. \"My hair looks awful, doesn't it?\"</p> <p>\"Well...\" If he considered most of the hair on the right, which was clotted with blood and hopelessly snarled to be awful, then... \"At least you've got your health. Oh, wait.\"</p><p>\"Aren't you funny.\" He stretched out his bandaged arms and looked at them. After being stitched up (fifteen stitches in his left arm, twenty-six in his right, thirty-one in his right leg, eighteen in the muscle just below his right nipple, seven stitches to the left of his belly button) , he'd been admitted for overnight observation. \"It looked worse than it was, in case you were wondering.\"</p><p>\"Actually, I was wondering if you could pull the blanket up a little more.\"</p><p>\"Oh.\" Marc was still staring down at himself, but had yet to notice he was naked.</p><p>\"I'll, uh, just do that.\" I bustled around the bed, trying to make myself useful.</p> <p>He looked pleased. \"Now I'm tucked in!\"</p><p>For the first time I realized his green-eyed gaze was a little cloudy. I peered closer. So did he. Our faces were about an inch apart but, again, Marc didn't seem to think this was at all unusual.</p><p>\"Jeez,\" I said, so close my breath (if I had any) would have fogged his glasses (if he wore them). \"How much medication are you on?\"</p><p>\"Well, let's see. I had some Valium at the house, and some more on the way to the hospital. (I offered some to Nick, but he said no thanks.) Then in the ER, the intern said - \"</p><p>\"You know what? It doesn't matter. As long as you're okay is all.\"</p><p>\"Oh, sure! I'm great! You know, for someone who was trying to kill me, he mostly just knocked me down and got me dirty. I mean, did you see those guys? Covered with mud!\"</p> <p>\"Yeah, that's annoying.\" I fought not to roll my eyes or sneak a peek at the clock on the wall.</p><p>\"I think he wanted to kill you and was mostly trying to get me out of his way. I'll be sore and itchy for ages, and I'll have spectacular bruising, and maybe a couple of really butch scars, but that's the extent of it. I feel pretty lucky.\"</p><p>\"I'm - I'm glad, Marc.\" He had been lucky, but I was mostly too tormented by guilt. And hunger pangs. I was so thirsty, and the smells generated by the hospital were making me drool. As the queen, I didn't have to feed every night like all the other vampires, and sometimes I made the mistake of pushing it. It had been at least four days. \"Also, don't come back.\"</p><p>He absently cracked his knuckles; they sounded like Rice Crispies. \"Yep, after tonight it'll be smooth - what?\"</p><p>\"You can't come back until we take care of this Fiend situation.\"</p><p>\"Take care of the situation? You're talking like it's a termite infestation!\"</p><p>\"If only,\" I muttered. \"Look, I feel crummy that you got hurt, but you were lucky, and I'm not enough of a twit to put you right back in danger.\"</p><p>He blinked at me slowly, like an owl, and I could tell he was trying to muster an argument. After a long silence he said, \"But we have the Super Secret Vampire Tunnels to escape to.\"</p> <p>\"Yeah, except every one of the Fiends is faster than you and Jess, and what if they cut you off next time? What if Sinclair and I, God forbid, aren't even home next time?\"</p><p>\"But we can - \"</p><p>\"Marc, I'm sorry, I guess I didn't realize... you think this is a debate. It's not. You could run to the tunnels, Sinclair and I might be able to protect you, the Fiends might come back but not try to hurt you... whatever, man. Too many maybes for me - you're out.\"</p><p>\"But Betsy...\" His eyes filled, and he shook his head savagely, making the tears fly. Then he was glaring at me with wet cheeks. \"That's my home, same as it is yours. Where can I go?\"</p><p>\"Yeah, about that.\" Marc wasn't seeing anyone right now (he'd had a fling a month or so ago, but otherwise was something of a dateless wonder), and no family - at least, none he would ever live with ever again. \"Where do you want to go? You pick the place, and Sinclair will pay for it. Sinclair and I,\" I corrected, since technically it was now my fortune, too.</p><p>\"I don't want to pick anything,\" Marc began, still pissed, but then I could see the possible advantages of the situation begin to trickle past the fog of drugs. \"Uh. Anywhere I want?\"</p><p>\"Anywhere. Until we fix this. The day the Fiends pack it up and go home\" - Yeah, sure, that's how this would end - \"is the day you move back in.\"</p><p>An expression of vague alarm crossed his features. \"But what if the Fiends stay out of sight for, I dunno, two years? Before they make their move? Are you going to keep me out of my home for years?\"</p><p>\"It won't come to that.\" And try as I might, I just couldn't picture it. Not to be all egotistical or anything, but I couldn't imagine the Fiends could do much of anything until they'd settled with me. Laying back in the buckwheat for a couple of years was definitely not their style. \"It absolutely won't. But right now it's too dangerous for you. Of course it's your home, and the day the Fiends are taken care of is the day you come back. But until then...\"</p><p>I tucked another blanket around Marc and left him sleepily murmuring, \"The Radisson? No. The Millennium? No. Sofitel? I know! The Grand! Will they do turndown service for me... ?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As Marc's door was wheezing shut behind me, I heard Jessica trotting toward me. I was able to pick up the sound of her footsteps over everyone else's in the hall (granted, at this hour, there weren't many, but still - my very own stupid pet trick!) and turned in time for her to wave to get my attention.</p><p>It seemed to take a very long time for her to get to me. Sinclair and I had talked about this phenomenon once or twice, after making love. It was starting to seem more and more natural, taking advantage of my vampiric senses and all. In the beginning, they either overwhelmed me (especially when I was hungry) or I had to sit still and make a conscious effort to hear, to smell, to whatever outside the range of normal human activity. Now I could probably pick Sinclair or Jess or Mom out of a Metrodome crowd.</p><p>Now her mouth was moving, verrrry sloooooowly. I squinted at her and then yelped when she pinched me.</p><p>\"Sorry, but you had a very goofy look on your face. How is he? Is he sleeping?\"</p> <p>\"He's a little out of it.\"</p><p>\"Oh.\" She stared at the closed door as if she had suddenly developed X-ray vision and could, y'know, actually see what was happening on the other side. \"Do you think I should go in? It's so late. Think he'd be mad if I didn't come in tonight? I don't think he'd be mad. And I'll see him tomorrow. I'll bring him some Bruegger's for breakfast. Let's walk. Can we walk? Come on.\"</p><p>I didn't say a word, just fell into step beside her. It wasn't hard to figure out why she was nervous - she had, after all, spent many days in this very hospital as a terminal patient. That'd take the shine off your night, even if the other events hadn't.</p><p>I cut through her nervous chatter as we headed to the hospital parking ramp. \"Actually, you could help me out and radically reduce your trips to the hospital.\"</p><p>\"Sing it.\"</p> <p>\"Well, we're putting Marc up somewhere nice, sort of as a treat, you know? I mean, he's been through a lot. He was finally starting to date again but he had that bad breakup last month... and he's been picking up so many extra shifts... and he really got torn up tonight.\"</p><p>\"Yeah,\" Jessica said slowly, \"I guess you could say he's had a crummy few weeks.\"</p><p>\"Right!\" She was falling for it! The puny human had no hope whatsoever of overcoming the mightiness that was me, Betsy, vampire queen and recovering Miss Congeniality. \"So maybe you could go with him, wherever he picks, and sort of settle him in, you know? Make sure he's got everything he needs, and - \"</p><p>Jessica had stopped walking, which was awkward, as I didn't immediately notice, and I have long legs and walk fast, so I had to walk all the way back across the skyway if I wanted to keep participating in the conversation. Which, judging by her thunderous expression, I did not.</p><p>\"Betsy. Oh my God. How - \"</p><p>did I know that was just what Marc needed? How could we best help him get settled? How did I manage to say the right thing time and time again?</p> <p>Naw. I knew the tone and I knew it wasn't going to be good.</p><p>\" - fucking dumb do you think I am?\"</p><p>\"You mean, on a sliding scale, or - \"</p><p>\"You've gotten rid of one human, and now you're trying to ditch the other.\"</p><p>\"Oh, say, hey now! I think 'ditch' is a little - ow.\"</p><p>She had jammed her index finger into the middle of my chest and now poked to emphasize her words. With each poke a cloud-colored fingernail jabbed me. It was like being pricked over and over again with the world's dullest needle. We'd had so many fights like this, I practically had scars there. \"I'm. Not. Going. Anywhere. Besides, it's my house! You can't kick me out of - \"</p><p>\"Also, Sinclair wants to buy it from you. I mean, we want to buy it. The house. We totally do. Together. It's not just him alone. We want to.\" Because that's what married couples did, right? Bought real estate together and drank each other's dark, dead blood?</p><p>\"Oh, I'll just bet you do.\" She pulled her small, sleek head back, like a snake getting ready to bite. It was silly, kind of: I was a foot taller, I was thirty pounds heavier, I had legions of the Undead at my command (sorta) and vampiric strength, and I was scared to death of her. I tried not to cower as she ranted, \"Well, you can't have it! For one thing, it's not for sale, and for another, it's my house!\"</p> <p>\"Jessica, we almost lost you this summer, and - \"</p><p>\"Betsy, even if you couldn't cure cancer, I wouldn't be afraid of the Fiends. But hey! Since you can? I can't say I'm worried about something as silly as a few bites.\"</p><p>We started walking again, only she was stomping toward the elevator, and I was doing the Igor Shuffle (\"Yes, master, right away, master, I am not an animal, master.\") right behind her. \"A few bites? That's like calling the cost of the War on Terror a few dollars. And I know you're not afraid, it's not about you being afraid, it's about taking the sensible precaution of being elsewhere when the bad guys come back, doy!\"</p><p>She snorted and jabbed the elevator button. \"Listen to you. 'Sensible precautions.' \"</p><p>\"And don't forget the 'doy.' Jess, how many scary movies have we seen where the heroine does something really dumb like hang around in a hallway when she knows the bad guys are, like, a room away?\"</p><p>\" 'Bout a zillion,\" she acknowledged.</p><p>\"We got off real lucky this time - Marc with a few scratches, and you not even hurt - and I think it's completely nuts to push it. So how about you don't be an asshole about it and just stay with Marc until we kill all the bad guys?\"</p><p>\"Oh, someone's being an asshole,\" she agreed, practically leaping into the elevator in her agitation, \"but it's not this girl.\"</p><p>I leaned against the wall and closed my eyes. Mostly against the awful fluorescents in the elevators; there were about eight too many. \"I knew you were gonna be like this.\"</p><p>\"But you had to open your yap anyway.\"</p><p>I squinted at her. \"Don't come crying to me when a Fiend tears your head off.\"</p><p>She smiled a little, and I knew that was partly because she thought she had won the argument. She hadn't, but she was forcing me to do something I really, really, really didn't want to do.</p><p>I was gonna tell on her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>l nearly walked through the Ant on my way from the bathroom to the bed, and neither of us were very happy about the near miss.</p><p>\"Must you ignore everyone's personal boundaries? \"</p><p>\"Yeeeeeggghh! Stop doing that, you disgusting horrible dead wretch!\"</p><p>Sinclair, all the way across the room, looked guilty and bent down to untie his other Kenneth Cole, as opposed to just yanking it off and tossing it in the general direction of the closet.</p> <p>\"You might think about what would happen to me if you got your silly self killed.\"</p><p>\"Yeah, I should have realized what a terrible thing that would be, Ant. For you.\" I ran the six steps from the bathroom, jumping into the middle of the bed, so nothing hiding under it could grab my feet. \"And I wasn't talking to you,\" I added to my husband, \"but it's nice to see you treating your shoes with more respect. \"</p><p>The Ant was looking in our direction with rabid suspicion. Which, since she'd been heavily Botox'd before her death, came across as slightly raised eyebrows and rapidly blinking eyes. \"What are you two doing? You're not going to bed now?\"</p><p>\"We've been up all night, you pineapple-colored idiot.\" Pineapple referring to her hair, which was stiff and yellow. \"Dawn's about an hour away.\"</p><p>\"Well, in that time you could be - \"</p> <p>\"Having nasty sex with my husband. Nasty,\" I added, ignoring Sinclair as he picked up a pillow, calmly pressed it over his face, and barked laughter into it. \"With, um, probes and things. We like to role-play. I'm the alien, and he's the helpless probed human. Now get lost, because it's going to get messy in here.\"</p><p>Ah! It worked. She'd popped out while I was horrifying her with lurid descriptions of my imaginary sex life. I wish she'd just tell me what she wanted and go back to Hell already.</p><p>\"Thank\" - I searched for a word that wouldn't make Sinclair cringe - \"goodness she's gone.\"</p><p>\"Help, help, I'm being probed!\" The pillow sailed at my head, and I knocked it away, trying not to grin. Beside me, Sinclair tried his best to look horrified. \"If only I didn't feel a sick, wrong sexual attraction to these alien invaders. If only I had listened to my mother's warnings about loose alien women!\"</p><p>\"Pal, you are so not getting any tonight.\"</p><p>\"If only,\" he continued dolefully, \"they didn't keep telling me to turn my head and cough.\"</p> <p>That was it; I lost it. I shrieked and laughed and kicked at the covers until the bed looked like what I told the Ant we'd be up to.</p><p>\"That was slightly... hysterical.\"</p><p>\"Hey, it's been a long night.\"</p><p>\"Indeed it has, my darling alien intruder.\" Sinclair yanked the remaining sheets and blankets off the bed and threw them to the floor with a theatrical flourish. Then he pounced on me while sheets billowed all over the place.</p><p>He kissed me for a wonderfully long time, then pulled back and cocked an eyebrow. \"Want to see my probe?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The next evening started off nice and quiet. Marc wasn't around, of course, Garrett was probably still cowering in the basement, and I didn't look too hard for Jessica.</p><p>Almost as soon as I'd gotten up, Tina and Sinclair had left for the library. This made sense, as the former librarian, Marjorie, had kept extensive files on every vampire she knew of, heard of, or could track down.</p><p>Information, as far as the late, unmourned Marjorie believed, had been power.</p><p>They had politely asked if I wanted to come, pretending I'd actually be of use to a couple of near geniuses trapped in a warehouse disguised as a library. They probably thought hours of research on computers and - and whatever you did research on would be a good time, poor morons. Of course I'd said no.</p> <p>But even if I'd lost all my cool points and was a hopeless, helpless virgin weirdo geek who wanted to spend half the night in a vampire library, I couldn't.</p><p>I, after all, had serious work to do for the Minneapolis Police Department. Make that Homicide Department. Yeah, that's right, we vampire queens are in constant demand all over the place for -</p><p>\"Are you actually going to get in my car?\" Nick Berry demanded, shaking his keys at me. \"Or just keep staring off into space like that? Because it is fuckin' creepy, Betsy, you look like the Exlax is about to kick in.\"</p><p>\"Huh? Oh. That was mean. And I'm coming, don't nag.\"</p><p>\"I'm a grown man,\" he forced out through gritted teeth, \"and we don't nag.\"</p> <p>\"You were! You were nagging!\"</p><p>\"Betsy, I swear to God, if you don't shut your fucking yap and get in the car, I'm going to pull out my gun and blow your - \"</p><p>\"Ha! You said 'blow.' \"</p><p>The gun had cleared the holster. Hmm, Nick was a short-tempered fellow these days. \"I'm gonna count to ten. One. Seven. Nine. T - \"</p><p>\"Hold it right there!\"</p><p>We both jumped like we'd been caught doing something nasty, and looked. Jessica the Terrible was stomping down the porch and across the driveway toward us.</p> <p>Quick as thought, Mr. Gun was back in his house, Mr. Holster.</p><p>\"Hi, babe, I thought you were sleeping.\"</p><p>\"Oh, Jess. I didn't know you were up.\"</p><p>\"Well?\" She stopped, slightly out of breath. She must have sprinted when she figured out Nick was here. \"Which is it? I'm in bed asleep because I have a human boyfriend, or I'm wide awake because my best friend is a vampire?\"</p><p>\"Uh - \"</p><p>\"You're so great,\" Nick said warmly. \"It's both.\"</p><p>Man, I could never pull that off.</p><p>\"You sneaky lying sack of shit.\"</p> <p>Apparently Nick couldn't, either.</p><p>\"You're sneaking off with him to - well, I don't know what, but I don't like it. And you!\" She rounded on Nick, jabbing with the dreaded index finger (which was now painted eggplant). \"I know damn well you don't like being alone with Betsy anymore. So what are you up to?\"</p><p>He didn't tell her?</p><p>\"You didn't tell her?\" I tried to hide my delight at Nick's look of consternation... and the fact that it bummed me out, hearing Nick was scared to be alone with me. At least I wasn't the only one who was scared to death of Pissed Off Jessica - hell, he was armed, and he looked ready to sidle around the corner and hide. \"That's awful. Why wouldn't you tell her?\"</p><p>\"Because she'll jump to the conclusion that I'm trying to get you killed,\" he snapped.</p><p>\"Yeah, she's funny that way.\"</p><p>\"What? Get killed? Why might you get killed? Betsy, you can't go off doing something dangerous with Nick, when those disgusting Fiends could be back any minute and try to finish what - \" Then she shut her mouth with a snap.</p><p>Nick and I looked at each other, then at Jessica. I felt sorry for her. She really did try to keep Nick out of the vampire stuff, telling him only what she absolutely thought he needed to know.</p><p>And of course, she didn't get into the gory details of Nick's terror and hatred of me, just made the occasional reference to it. She was a good dancer. And it was too bad she had to dance at all. I mean, more than the normal amount any best friend does when balancing a lifelong friendship with a new love affair.</p><p>\"Why don't we get in the car,\" I suggested, \"and Jess goes back in the house, and the three of us pretend the last forty-five seconds never happened.\"</p><p>\"Deal.\"</p><p>\"Deal.\"</p><p>Nick started up his SedanMobile as I waved to Jess, who was back on the porch and anxiously waving back.</p><p>\"Betsy! Let's go!\"</p><p>\"Your car,\" I told him, gingerly climbing into the front seat, \"smells like ass.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Man, that was bad. We coulda handled that one better. A lot better.\"</p><p>\"What are you talking about, 'we'? I'm not the one who completely screwed that one up. Hey, Jess gets full disclosure from me, pal.\"</p><p>\"Oh fucking bullshit,\" he snapped, almost running down a squirrel. He turned onto Grand Avenue, where he'd have better luck with hapless pedestrians. \"You told me yourself after that - after that business around your wedding that you kept her out of the vampire stuff.\"</p><p>\"After I cured her terminal illness, you mean? Is that what you're referring to?\" My voice was so sugary it would have given a diabetic an instant attack. I normally wouldn't bring it up, especially since I had no idea how I'd done it, but hey, Nick was bigger than me, and smarter. And armed. And he hated me. \"Sure, Sinclair and I keep her out of it - keep her out in the sense of actually, physically keeping her out of it. But I still tell her everything.\"</p> <p>\"Nnmph,\" he grunted. Then, \"Put on your seat belt.\"</p><p>\"Please. Would you really give a gold-plated crap if I was launched screaming through your windshield?\"</p><p>\"State law.\"</p><p>Oh. Right. I, the Minnesota law-abiding vampire queen, obediently buckled up.</p><p>\"She's got enough to worry about,\" he finally (lamely) said.</p> <p>\"You big liar! You're using me to ramp your solve rate, and I might get hideously mangled or killed. That's what you don't want her to 'worry' about.\"</p><p>\"Ramp my solve rate?\" He slid over two streets and merged onto I-94. \"Betsy, stop watching NYPD Blue reruns.\"</p><p>\"I don't! On purpose.\"</p><p>He groaned. \"Please don't explain that.\"</p><p>\"But Marc has a big crush on Sipowicz, and he's always hoping to see the man's butt again, and I can't help it if every time I go into the TV room or his room or one of the parlors, he's playing the DVDs.\"</p><p>\"Well, if you're so damn sure I'm up to no good, how come you're here?\"</p> <p>\"You know why.\"</p><p>\"Enlighten me.\"</p><p>\"Stop it.\"</p><p>\"C'mon, I'm serious.\"</p><p>I stared at him. He stared back with his blank cop's face. Truth? Lie? Somewhere in between? I bet he could take a polygraph and never, what was the cop phrase? Never bounce a needle.</p><p>\"I'm here to prove to you that I'm no danger to you, that we could be friends if you didn't shrivel with horror at the thought, that vampires can be good guys, too.\" I said it all in a rush, and it came out sounding like my drunken Marilyn Monroe impersonation.</p><p>\"Yeah, you're going to have to slow that one down and run it by me again.\"</p><p>\"I'm. Here. To. Prove. That. I'm. No. Danger. And. We. Can. Be. Friends. If. You. Didn't. Shrivel.\"</p> <p>\"That's okay, I think I can piece together the rest. Trouble is, blondie, why should I ever believe anything you tell me, ever again?\"</p><p>\"Oh, jeez!\" I threw my hands up in the air. \"How long are you going to hold that one thing against us? I've told you and told you, I was a new vampire and didn't know the rules!\"</p><p>\"Yeah, so you fucking mind-raped me.\"</p><p>I noticed that, like me, he tended to swear more when he was nervous or mad.</p><p>\"Anything sounds bad when you say it like that,\" I conceded sulkily, staring out the passenger window.</p><p>He made a sound that might have been a snort, or a muffled laugh. When I looked, he had his cop face back on.</p><p>\"So where are we going?\"</p><p>\"What a tactful, yet subtle way to change the subject.\"</p><p>\"Fine. Don't tell me. Keep being the biggest, most gigantickest asshole - \"</p><p>\"Gigantickest?\" he said, delighted. \"Are you using word-a-day toilet paper again? Okay, okay, don't pout. And don't enlighten me about vampire toilet habits, I don't think I could stand it. I've managed to run down a couple of leads and thought I'd bring my favorite dead enforcer with me to see what's what.\"</p><p>\"I thought you said your vigilante killer was a cop? Or cops, plural?\"</p><p>\"I did.\"</p><p>\"So how can we check on them without, I dunno, scaring them? Tipping them off?\"</p><p>\"Very carefully. I've been running down when the murders took place - best as the M.E. can tell us, anyway - with the duty logs of the ones I think might be capable of something like this.\"</p><p>\"Oh.\" That was really smart. And just laced with common sense. Exactly why I never would have thought of it. God, I'd be the worst police officer. I knew that about myself, had always known it, which was why it was kind of a thrill to be in a police car (the front seat, anyway), helping solve murders. Well. Coming along for the ride while someone else solved murders. \"Huh. Okay.\"</p><p>\"Do you know much about guns, Betsy?\" He indicated his service piece. \"If you're ever in a situation where you need to shoot a guy to save my ass, could you do it?\"</p><p>\"Wait. Do you hate me now because I'm a ruthless vampire who has killed before, or do you hate me because I'm a careless dimwit who can't be trusted with this power?\"</p><p>\"You mean, right now? Right this minute, why do I hate you?\" he asked in a voice that was almost - so close! - teasing. \"Do I have to choose? God, so many choices...\"</p><p>\"I don't have a lot of use for handguns,\" I said after a glance at the pistol at his waist. \"Mostly I know about shotguns from goose hunting with my mom, and rifles for target practice.\"</p><p>\"The professor hunts?\"</p><p>\"The professor can shoot the eye out of a squirrel at two hundred yards. I'll tell you who knows a ton about guns - Tina. She's an expert. You should get with her sometime.\"</p><p>\"No thanks,\" he said curtly, and just like that, our fragile whatever it was came to an end. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nick dropped me off at about two-thirty in the morning, not remotely discouraged, although it looked to me like his leads hadn't panned out. At least he was being (relatively) friendly again, so I didn't say anything to wreck it. I just waved good-bye and trudged into the mansion.</p><p>Where a grim Sinclair and a fretful Jessica were waiting for me.</p><p>\"Whaaaat?\" I whined, moodily pulling off my Herrera boots. \"What'd I do? I didn't do it. I'm pretty sure it was Marc. No, wait. Cathie!\" Cathie, the ghost-gone-walkabout, who I could actually use to help me with the hunt. She was usually convenient for blame. Of course, if she'd been there, I never would have gotten away with it.</p><p>She'd been killed by a serial killer (who was later killed by my sister, Laura, who had a spectacular temper tantrum in the killer's basement) and, even after his death, had hung around being my ghostly secretary of sorts. If ghosts showed up needing help, Cathie would try to help them herself... and only if she couldn't would she then let the ghost bother me. Plus, she was super funny and nice. I missed having her around. Even more so now that the Ant was pestering me.</p> <p>\"Sinclair told me,\" Jessica said without preamble.</p><p>\"About what?\" I asked, totally at a loss. Man, I'd have to drink some blood soon. I was getting dumber by the hour.</p><p>\"About Nick's little murder project,\" she said grimly, and I winced.</p><p>\"That wasn't nice,\" I said to Sinclair, the reproach quite clear in my tone.</p><p>\" 'Nice' is the least of my concerns, or interests. He is trying to get you killed, or at least cares not if you're hurt. If I could tell his superior without jeopardizing our secret, I would.\"</p> <p>\"You'd tattle to his boss! Oooh, that's really mean.\" I walked into the parlor and carefully flopped down onto a fainting couch, which someone had probably lugged over on the Mayflower.</p><p>\"I'll deal with him later,\" she swore, and I almost felt sorry for the guy. \"I just wanted to make sure you got back all right.\"</p><p>\"Sure I did. Heck, it didn't even pan out. It was an evening of driving around, basically. Feel bad for him, he was the one trapped in a car with me.\" In fact, a couple of times he had rolled his window down and hung out his head like a dog, screaming into the wind. Heh.</p><p>\"And I,\" Sinclair said, \"wished to attempt to convince you, once again, to leave police matters to the police. We have other things to attend to.\"</p><p>\"Oh, like I would have been any help to you and Tina tonight.\"</p><p>Sinclair lifted his left shoulder up about half a centimeter, which, for him, was the same as a shrug of agreement.</p> <p>\"Like I said, it was one big safe boring evening. No problems. And,\" I added, looking around the small, peach-colored parlor, \"I assume the Fiends haven't been back?\"</p><p>\"No, thank God.\"</p><p>\"Did you and Tina learn anything?\"</p><p>\"Oh, this and that,\" Sinclair said vaguely, which either meant (a) he had gobs of tidbits he didn't want to spill in front of Jessica, (b) he had nothing, or (c) he had plenty, but didn't want to worry me.</p><p>\"So. Let's go to bed?\"</p><p>\"Do that,\" Jessica muttered, turning around like a soldier doing an about-face and marching out of the parlor. \"I've got to call Nick.\"</p><p>\"Very, very mean,\" I told my husband, as I followed him up the stairs. \"Ratting Nick out like third graders squealing about who stole the chocolate milk. Nice!\"</p><p>Sinclair shrugged again. I pulled our bedroom door shut and jumped on his back.</p> <p>\"Ah?\" he managed, looking around for his suit hanger.</p><p>\"I'm starving,\" I purred into his left ear.</p><p>The hanger, which he had just picked up, went sailing over our right shoulders. Then he reached back, got my coat in a fist, and yanked me off of him, over him, and flopped me onto the bed.</p><p>\"Then let's eat,\" he said, and fell upon me like a scary fairy-tale monster, only a whole lot sexier and, let's face it, better dressed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sun fell down the next night, but I'd been awake for about an hour by the time it was full dark. Still wasn't taking my increasing resilience to sunlight for granted, and still not trying to rub it in to Tina and Sinclair who were, after all, much older than I was.</p><p>I knew it was a real treat to be able to go for a walk outside in the late afternoon. I'd paid for it, though, thanks to the Faustian bargain that was the Book of the Dead. (Sinclair lost a bet once when he didn't think I knew what Faustian meant; but there's more than one way for a girl to Google a cat.)</p><p>I got dressed, then remembered what I'd forgotten last night. Amazing what good sex and half a pint of vampire king blood could do to jog your memory.</p><p>I flopped onto the bed, picked up the bedside phone, and dialed Nick.</p> <p>\"Homicide, Detective Berry.\"</p><p>\"This is the woman,\" I purred in my throatiest voice, \"who is going to make all of your dreams come true.\"</p><p>\"Aunt Marian?\"</p><p>\"Gross!\" I nearly dropped the phone. \"Nick, that's disgusting!\"</p><p>\"So is your sexy voice. You sound like Patrick Warburton with a head cold. What's on your microscopic mind?\"</p> <p>\"I forgot to tell you something last night.\"</p><p>\"Of course you did. You're a dimwit.\"</p><p>\"It's something that will make you extremely happy,\" I wheedled.</p><p>\"You're moving, and you can't remember your forwarding address.\"</p><p>\"You wish.\"</p><p>\"The mailman left a hand grenade in your slot?\"</p> <p>\"Do you want me to tell you, or do I have to listen to more dumb comments?\"</p><p>\"They are not dumb. So. What is it?\"</p><p>\"Nothing much. A cadre of old vampires is ticked at me, has already tried to kill me once, and won't stop until I'm dead or they are, and there's, like, twenty of them and only one of me. Also, we're out of milk.\"</p><p>\"Really?\" Nick sounded like he'd won the lottery. \"You wouldn't tease me, would you?\"</p><p>\"I swear on every one of Marc's stitches that it's true. Not a drop of milk in the whole house.\"</p><p>\"Marc's stitches - hmm. Interesting that Jessica hasn't mentioned any of this. You'd better tell me.\"</p><p>So I gave him the whole story, thinking, You only think Jessica's in hot water, you poor bastard. She must not have reached him last night. He had no idea the storm was about to break over his head.</p><p>\"Uh-huh.\" I'd assume he was taking notes, only Nick never wrote anything down. Not like the cops on TV, that was for sure. \"Uh-hmm. And you don't know where they are?\"</p> <p>\"Not yet, but Sinclair and Tina are doing hours of drudgery research to figure that out.\"</p><p>\"And Marc's at the General?\" he asked, using the slang we used for the local hospital.</p><p>\"Yeah, but he'll get out today. They ended up keeping him for a couple of nights, but not because anything wrong popped up. I think it was probably because he's big-time popular on the staff. But we're moving him to The Grand Hotel tonight.\"</p><p>\"Where he'll stay indefinitely.\"</p><p>\"Yeah, and the thing is, Jessica won't go. I mean, flat-out refuses.\"</p><p>\"Yeah?\"</p><p>\"Yeah. Sic her!\"</p><p>\"Doesn't she have, I don't know, a fucking Swiss chalet or something? Some other property besides the mansion where she can stay?\"</p><p>\"No, she doesn't care for Europe unless it's Tuscany, but surely you've got a chalet up your sleeve, John Deere Boy.\"</p><p>\"Well, she doesn't have to stay there,\" he said grimly. \"Not in Vampire Central.\"</p><p>\"Yeah, so sock it to her.\" I didn't mention that Jessica wasn't staying at the mansion because she had nowhere else to go. He knew why she was staying, too, but didn't want to admit it, at least out loud. \"Go tell her who's boss, by God.\"</p><p>\"Oh, shut up,\" he said, and clicked off his phone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My semi-good deed done for the day, I rolled over, thumbed off my phone, dropped it on the bedside table (Sinclair was already bitching about the marks my phone and keys were leaving on various antiques around the house), and examined my feet.</p><p>There were advantages to being a vampire. I had refused to admit that for a long time and, even now, wasn't very happy when forced to make such an admission. The strength thing, and the speed. The hearing, of course.</p><p>More than once I'd been grateful for all three, usually while some psycho was trying to kill me. (Although if I hadn't been undead in the first place, said psycho would not have been trying to kill me, but screw it.)</p><p>And, although there were far more drawbacks than advantages to being queen, that had its high points, too.</p> <p>But there were plenty of disads to being dead. One of the many was, you couldn't change your looks. I mean, you could, but whatever you did - paint your fingernails, cut your hair, curl your eyelashes - was undone when you rose the next night. I had no idea why, just like I didn't know how we could walk around with a heart rate of seven, or how we didn't need to breathe more than a couple of times an hour.</p><p>Thus, I always - always - needed a pedicure. (Thank God I had died only a few days after a cut and highlights!) It was depressing and a fact of life (or death, if you will), but there it was.</p><p>No time to mope. (Well. There was always time to mope. But I wasn't in the mood tonight.) I decided to do a quick one, myself, and twenty minutes later I was admiring my pink, newly smooth feet, and the wiggling toes with their coat of \"Bitterness,\" which was actually a lovely soft gray.</p><p>Energized with the gorgeousness of my feet, I darted into the bathroom, rummaged around in the counter under the sink, and extracted a box of Crimson Tide, a wash-in/wash-out hair color. Stayed in for up to twelve shampoos. If you were alive, anyway.</p><p>When I got out of the shower, I couldn't help grinning at myself in the mirror. My hair was a dark, unnatural red; the shade made my skin paler than usual and my eyes seem green (they tended to fluctuate between blue and green, depending on what I was wearing and the quality of the light). And the box only cost twelve bucks. Since I'd be blond again tomorrow night, it wasn't worth going to the salon and dropping a hundred bucks for a custom dye job.</p> <p>I dried off and got dressed, then opened my bedroom door, briefly wondered where my husband was (Sinclair only had to rest on occasion and, likely after sex, had waited until I conked out and then gone to the library or the fax machine or the local Kinko's to make color copies of something - wait, he had Tina to do that), furtively checked for unwanted ghosts, then bounded down the steps.</p><p>I could hear the fight long before I got to the kitchen door. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I can't believe you're staying! You know, and you're fucking staying!\"</p><p>\"Well, what about you, white boy?\" Hmm. Jessica must be mega-pissed... \"white boy\" and \"white girl\" tended to come out only when she was furious, or scared. \"You somehow forgot to mention that you're using my best friend to help you look good for the chief.\"</p><p>Wait. What?</p><p>\"Not to mention, you expect her to take bullets for you if things get nasty. Slip your mind?\"</p> <p>\"I'm not taking bullets for anyone,\" I announced, pushing open the door, \"unless it's Beverly Feldman.\"</p><p>\"Stay out of this, Betsy.\"</p><p>\"Yeah, fuck off, blondie.\"</p><p>Sinclair's head came up with a jerk (he'd been seated at the counter, pretending to read the Journal), and he opened his mouth to hiss or roar something, but I overrode him with a breezy, \"And a verrrrrry pleasant good evening to all of you, too.\"</p><p>The pleasantness of my greeting appeared to take the wind out of everyone's sails, not just his. I poured myself half the pitcher of orange juice and sat my ass down just like I belonged there.</p> <p>It could be tricky, busting in on a fight. There was the \"oh my God, I'm so sorry you didn't see me, I'll just scuttle back out the way I came\" method, always popular with roommates of the female persuasion.</p><p>And there was my \"hey, you're doing this in a public place - sort of, our kitchen - and you're fighting about me, so guess what? I'm staying\" method, which I normally didn't have the nerve to try.</p><p>Jessica was eyeballing my head. \"Nice hair.\"</p><p>\"Thanks.\"</p><p>\"It's very,\" Sinclair said carefully, \"bright.\"</p><p>\"Felt like a change.\"</p> <p>\"Mmmm. Detective Berry,\" Sinclair tried again, in a much calmer tone, but no less frightening, if you knew him, which we all did, \"please do not speak to my wife that way in her own home.\"</p><p>\"It's my girlfriend's home,\" Nick said, sounding sulky, but at least he was quieting down, too.</p><p>\"Yes, so you delight in reminding me, and as I said earlier, I would be delighted to purchase the place from her at a fair market price. She could then move in with you, or not, as she liked, and as you liked, and several of your so-called problems would be over.\"</p><p>Nick had nothing to say to that, of course, and why would he? Sinclair was only telling the truth. In fact, I could see on Nick's face how very, very badly he wanted that option for Jessica.</p><p>Too bad he'd have about as much luck making her do anything she didn't want as I'd had in the past. Put it this way: I'd had more luck persuading the Ant not to wear so much polyester.</p><p>In fact, the only way he could maybe get her to leave would be if she moved -</p><p>Abruptly, Nick was on one knee. This startled Jessica, who kept her finger pointed at the space where his chest had been two seconds earlier. \"I don't like you talking like - what the hell are you doing?\"</p><p>He looked up at her soulfully, grabbed the hand that wasn't stabbing the air above him, and clutched it to his chest. \"Jessica, will you marry me?\"</p> <p>\"What?\"</p><p>\"Or at least move in with me? Right now?\"</p><p>\"Tr ̈ ̈s romantic,\" Sinclair muttered, and I winked at him. I noticed his green teacup was empty, rose, and poured him a fresh cup, ignoring his raised eyebrows. It was possible I had never done such a thing before. Damn, I was in a good mood tonight! It could only mean doom was on the way. Doom, or the Ant.</p><p>\"How sweet of you to ask.\" She yanked her hand out of Nick's no doubt sweaty grip. \"And I'm only being half sarcastic when I say that, because you do think you're protecting me. But what a rotten way to begin living together or being engaged - so you can move me out of my best friend's house.\"</p><p>\"It's your house!\"</p><p>\"That's true,\" I said, guzzling more juice. \"It is.\"</p><p>\"And you,\" he said, rounding on me. Definitely should have stayed out of this one. \"Jessica's in mortal fucking danger - again! And this one is one hundred percent at your door, Oh Great Queen of the Suckheads! \"</p><p>\"You quit it,\" Jessica ordered, as the three of us pretended he wasn't one hundred percent right. \"You were chortling over the possibility of the Fiends eating my friend - except if those things take out Sinclair and Betsy - \"</p><p>\"Actually,\" I said, \"we prefer 'Betsy and Sinclair.' \"</p><p>\"We certainly do not.\"</p><p>\" - just what do you think they'll do to the rest of us?\"</p><p>\"Force us to buy time-shares in Cabo San Lucas,\" Tina suggested in a low voice, passing the local newspapers to Sinclair. I stifled a snicker.</p><p>\"If they take out Sinclair and Betsy, who's gonna be safe?\" Jessica asked. \"Don't you get it, white boy? Half the time, those two walking wood ticks are the only thing between us and the real monsters.\"</p><p>\"That was wonderful,\" Tina said, scuttling in with her head down, as if Nick and Jess were throwing frying pans in addition to words, \"except for walking wood ticks. Good morning, Majesties. Good morning, Detective. Jessica.\"</p><p>They ignored her. Nick was still on his knees, but at least Jessica had stopped pointing at air. \"Yeah, but you have to admit, most of the stuff they 'save' us from wouldn't be threatening us if not for them in the first place.\"</p><p>Oooh, ouch, good one. I certainly had no come-back.</p><p>\"Yeah, well, with rank comes responsibility. Or is it with great power comes - anyway, that's what happens when you decide to shack up with dead monarchs, or even just a friend, something I knew long before Betsy and I were shacking up here, my come-lately lover.\" That was as close, normally, as Jess would come to \"good point, you're right.\" \"I remind you that she's been on the scene a lot longer than you have.\"</p><p>\"You think I don't know that?\"</p><p>\"And that I wouldn't be on the scene if it hadn't been for her,\" she continued quietly. \"I'd be a month dead by now. But she saved my life. Better: my appendix grew back, and so did my tonsils, and I've never felt better.\"</p><p>\"Say what?\" I asked, choking on my juice. Tina had frozen in the act of handing several faxes to Sinclair. And he just looked at me with those dark, expressionless eyes and said nothing. \"Stuff that got cut out of you grew back?\"</p><p>\"Of course I'm grateful to her, she's alive, isn't she?\" he snapped. \"She's walking around not arrested, right? I didn't mention her secret to any of the thirty-some Pioneer Press reporters I know. Did I?\"</p><p>\"Yikes. Thanks.\" Reporters? Arrested? Man, I was getting an awful lot of new information to process at once. Time for more juice.</p><p>\"You haven't done any of those things, because you don't want me to dump your sorry ass, not out of gratitude to Betsy.\"</p><p>Oh, and the quarterback scores!</p><p>Nick slowly got up off the floor, brushed off his knees, and turned to me. \"You know this is your fault.\"</p><p>\"I do know. I'm sorry, Nick. I tried to make her leave.\"</p><p>\"I can make her leave,\" Sinclair said pleasantly, watching Nick.</p><p>\"No, no,\" I said, pouring the rest of the pitcher into my glass and draining it in three gulps. Other liquids didn't kill the thirst for blood - nothing but, well, blood could do that - but they helped a little. The household was used to watching me go through a gallon of juice at breakfast. Though breakfast tended to be at ten o'clock at night these days. \"Nobody's gonna make Jessica do anything, I think we got that established in the seventh grade. And Nick's right. The Fiends thing - it's my fault. I just - I just sort of forgot about them for a while.\"</p><p>\"Typical,\" Guess Who sneered.</p><p>I could feel my good mood draining away, sort of like the OJ out of the pitcher. Because I made this mess, I made it happen - or allowed, through inaction, it to happen. I felt shitty about it, but it was way beyond late for that. Feeling shitty wasn't going to solve the problem. Probably more people dying would, and I absolutely hated that.</p><p>The really awful thing was, the thought of the deaths to come didn't depress me so much as it made me tired. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Officer, I would like to report a crime. Several crimes.\"</p><p>Ah, the perfect touch to destroy the last of my good mood. I sighed and rested my forehead on the counter. \"He's a detective, you dimwit; note the plain clothes and the holster. And he can't hear you.\"</p><p>\"What?\" Nick said.</p><p>\"Never mind that,\" the Ant snapped. She was standing in the middle of the stove. That was surprising. Usually the ghosts behaved like they were still alive and tried not to walk through things unless they absolutely had to - say, through a door that was shut (because, natch, they couldn't grasp the knob). The center burners came up to the bottom button on her too-tight lime green blouse. It clashed awfully with her bright yellow hair and made her skin look positively greenish. \"Tell him about how you're keeping me prisoner.\"</p> <p>My head snapped up so quickly I nearly overturned my chair. \"I am not! You're here of your own free will, Antonia, and the sooner you figure that out the happier I'll be.\"</p><p>\"Make that all of us,\" Jessica added. \"Get lost, Mrs. Taylor.\"</p><p>\"You should tell the help not to speak to me,\" she said triumphantly, thrilled that someone else was acknowledging her presence.</p><p>\"You know damned well that's Jessica!\"</p><p>\"Is that bigoted bitch slamming me from beyond the grave? Where is she?\"</p> <p>\"What difference does it make?\" I sighed. \"You can't touch her.\"</p><p>\"No, but I can throw things through her. Make me feel better, anyway.\" She darted to one of the tables, snatched up a plate, and hurled it toward the fridge. Where it fluttered to the ground, since, to save on dish washing, we tended to use paper plates for breakfast.</p><p>\"Stop that, and she's in the stove, okay? The stove!\"</p><p>\"What the fuck is going on?\"</p><p>\"Betsy's dead stepmother is haunting her,\" Jessica told him.</p><p>\"Oh, that's - \" Nick threw his hands up in the air and walked around in a tight little circle.</p> <p>\"The last straw?\" Sinclair suggested. \"I quite agree. So snatch up your girlfriend and flee for your lives.\"</p><p>\"That's it,\" Jessica said. \"I just doubled your rent.\"</p><p>\"Everything in the whole world sucks.\" I rested my chin in my hand and stared past Sinclair's shoulder at the window over the sink. \"Every. Single. Thing.\"</p><p>\"A pity,\" Sinclair replied. \"And you were in such a charming mood, too. Although a little warning would be appreciated the next time you do something drastic to your hair.\"</p><p>\"Oh, it'll be blond again tomorrow, who cares? What was I thinking, when I said I could do this job? I must have been out of my mind!\"</p><p>\"That's the spirit,\" Nick said, instantly cheering up.</p><p>\"Stop that,\" Sinclair and Jessica ordered in unison. They looked at each other in surprise, almost laughed, and then Jessica continued. \"You're doing the best you can. Nobody expects more.\"</p><p>\"Ha!\" I pointed to her boyfriend. \"He does.\"</p> <p>\"And I can't be the only one,\" Nick added.</p><p>\"Well, what's she supposed to do, smart guy? By all means, enlighten all of us. How would you help run the vampire kingdom?\"</p><p>\"I'd start,\" he replied sweetly, \"by rounding up all my 'subjects' and blowing their faces off.\"</p><p>Sinclair snorted. \"Then let us say, for the sake of argument, that you were the king, and you did that. I'm sure you can see the consequences.\"</p><p>I could feel the confidence I'd gained after defeating Marjorie draining out of me. Whatever I'd done to Marjorie had been, like most of the great events of my life/death, both a fluke and dumb luck. I was lucky to be alive (ahem), and it was nuts to read any more into it than that.</p><p>\"I'm guessing I can't abdicate,\" I said to Tina.</p><p>She looked more than a little taken aback. \"Ah... no.\"</p><p>\"That's quite enough,\" my husband said coolly. \"You've let this silly little man rattle you and for no good reason.\"</p><p>\"Yeah, but the Fiend thing really is my fault.\"</p><p>\"And none of mine?\"</p><p>\"Hey, yeah!\" Nick said. \"It's both your faults!\"</p><p>Sinclair ignored him. \"I knew, as you did, that they were out there in Minnetonka. I chose, as you did, to do nothing.\"</p><p>\"Yeah, but if I'd done like you wanted, they'd all be dead, and we wouldn't be in this mess.\"</p><p>\"And if wishes were horses, beggars would ride.\"</p><p>\"What?\"</p><p>\"An old saying of my mother's.\"</p><p>\"Very old,\" Tina said, almost - but not quite! - smiling.</p><p>\"Elizabeth, it's far too late to play the 'what if' game. We have a situation. We are dealing with it. The opinions of the occasional passing human are of no import. I am the king, you are the queen, so shall it be forever.\"</p><p>\"Or, at least,\" Jessica added, \"for a thousand years.\"</p><p>\"Passing human?\" Nick asked.</p><p>\"I noticed you put yourself first.\" I slid my empty glass over to him. \"Pour me something, will you? Something. Anything.\"</p><p>\"Why don't you snack on Detective Berry?\" Tina suggested. \"That would make us all feel better.\"</p><p>\"You assholes stay away from me,\" Nick warned, backing up until his butt hit the kitchen door.</p><p>\"Then do not,\" my husband said, \"let us keep you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Well, that was - \"</p><p>\"Can you believe the nerve of that guy?\" Jessica bitched, plunking down in the chair opposite Sinclair. \"Asking me to marry him just so I'd move.\"</p><p>\"Perhaps it was the right question under the wrong circumstances,\" Sinclair suggested, which I thought was an elegant way of looking at it.</p><p>\"And perhaps he's losing his damn mind.\"</p> <p>\"There is always that,\" he admitted.</p><p>\"Are we all going to pretend that he didn't make some really good points?\" I demanded.</p><p>\"Oh, right,\" Jess replied. \"I forgot: this is all about you.\"</p><p>\"Well, it kind of is,\" I grumbled, chastened.</p><p>\"When you are older,\" my husband said, folding up his newspaper (I don't know why he didn't read them online), \"you will see the futility of second-guessing yourself and wasting time with it.\"</p> <p>\"Great. I can't fucking wait. Hey, when I'm older, do you think I'll turn into an emotionless robot like someone we all - \"</p><p>\"Betsy!\" The kitchen door swung open, and Nick stuck his head inside. \"There's a vampire here to see you. I think she's a vampire. She fucking stinks, man.\"</p><p>\"Great. A new subject to disappoint! Let's go see her, so I can let her down right away.\"</p><p>\"Can someone let me off of the pity train now?\" Jessica asked, getting up and following me. \"This is my stop.\"</p><p>I thought I heard Sinclair snicker, but when I glanced at him, he was as smooth-faced as usual. And, thank God, the Ant wasn't following us. Perhaps she'd popped out again. I'd hope it was permanent, except I wasn't that dumb.</p><p>\"Thank you, Detective Berry, you would make a fine butler. Now run along.\"</p> <p>\"Like I want to stay?\" he retorted, falling into step beside us. I wondered who the new vamp was. Maybe a straggler of sorts who had just heard about the new king and queen. Now and again a vampire from the middle of nowhere would show up to pay tribute (gag). \"Besides, I gotta get back to work.\"</p><p>\"He did,\" I whispered to Jessica, \"get here really quick. He must have hung up and rushed right over. That's pretty sweet, doncha think?\"</p><p>\"Hey, that's right! You called him and told him about the Fiends!\"</p><p>Oh, shit.</p><p>Jessica was shaking her head. \"The things I'm gonna do to you when we have a little privacy - I think it's time to pour vinegar on your Jimmy Choos again.\"</p><p>\"No!\" I practically screamed, beyond horrified. \"Once was enough!\"</p><p>\"Obviously not, since I've done it twice.\"</p><p>I'd probably put up a psychological block the size of the Great Wall.</p> <p>\"Anyway, here she is,\" Nick was saying. \"I put her in the, uh, other parlor.\" He meant the one that was the least presentable of the four we had. Or was it five? Anyway, the wallpaper was faded and even torn in some places; the rugs were worn. And it smelled musty, like old books in an attic. We hardly ever spent any time in there. In a mansion this size, it was no trouble to ignore the less comfortable rooms and stick with the ones you liked. \"She, uh, really stinks pretty bad.\"</p><p>\"Maybe she got caught out late and had to pop into the sewer,\" Tina suggested. \"That's happened to me a time or two.\"</p><p>\"I'll see you later,\" Nick said, giving Jessica a noisy smack on the lips.</p><p>\"To be continued,\" she warned him, but at least she kissed him back.</p><p>\"Hello,\" Sinclair said. \"I am King Sinclair, and this is Queen Elizabeth.\"</p><p>The vampire, who had been huddled by the fireplace, turned to face us. \"I know who you both are.\"</p><p>Tina took one look, shrieked, \"Clara the Fiend!\" and launched herself at the smaller, smellier vampire. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Which was unbelievably startling, to say the least. Before I could move, or think, or react in any way, Sinclair's hand shot out almost faster than I could track, and he caught Tina by the back of her sweater. He held her in midair, her short legs kicking back and forth.</p><p>Clara the Fiend had backed into the nearest corner and was pressing herself into it as if she could shove herself through the wall and disappear. Given Tina's sudden viciousness, I could hardly blame her. \"Please, I came alone! Please, I just want to talk!\"</p><p>\"Eric, put me down.\" Tina was practically spitting. And she'd used his first name... oooh, he was in trouble now. \"Put me down right now so I can - and you! You get out of my master's house, you wretch! You pathetic creeping thing, you disgust us all, and you insult their majesties with your very presence! How dare you come to their home! Get out, before I kill you!\"</p><p>\"Tina, it's okay - \" Jessica started.</p> <p>\"Oh, Jesus.\" Nick had his gun out and was standing in front of Jessica. The gun barrel kept wavering between Clara and Tina.</p><p>I couldn't blame him. I'd never seen Tina so out-of-control furious. I mean, I was scared of her, and I knew that under ninety-nine-point-nine percent of the circumstances, she not only wouldn't hurt me, she'd give her life to save me. Even Sinclair, much bigger and stronger, had to hang on to her with both hands. \"Jesus, Jesus, these are the guys that clocked me in the nose the other day. These are the Fiends?\"</p><p>\"They are,\" Sinclair replied, turning pale at the reference to God's son. \"Tina, calm yourself. She appears to have come in peace.\"</p><p>\"And she'll leave in pieces!\"</p><p>\"Good one,\" Jessica piped up from behind Nick, \"if a bit cliched.\"</p> <p>\"Out, out now, you vile bitch! You get out of our house!\"</p><p>\"Holy shit,\" Jessica muttered. \"I have no idea which one to be more scared of.\"</p><p>\"Makes two of us,\" I whispered back. Maybe somebody should slap her? It always worked in the movies. And after you clocked them, they always said, \"Thanks, I needed that.\"</p><p>I didn't really see Tina saying anything of the sort, so I reached up - Sinclair had hoisted Tina pretty high - and grabbed a flailing fist. \"Tina, relax. If Clara tries anything, you can kill her all over the place.\"</p><p>The mad frenetic kicking stopped. \"You swear it? Swear it on your crown,\" she ordered, then instantly changed her mind. \"No: swear it on the king.\"</p><p>\"I swear on my husband's testicles that if Clara tries even one sneaky thing, you can play soccer with her head.\"</p> <p>Tina abruptly stopped struggling. Sinclair, just as abruptly, set her down. He didn't seem particularly concerned for his genitals, despite my promise. Maybe he thought this would all end up okay. I sure as hell didn't know that for sure. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"All right,\" he said to the huddled, smelly vampire. (Nick was right: she reeked.) \"Suppose you tell us why you're here, Clara.\"</p><p>\"That's not my name,\" she said. \"My name is Stephanie Connor. Thank you for seeing me, dread king.\"</p><p>I heard a commotion and turned to see Nick trying to haul a very reluctant Jessica out of the room. She kept yanking her hand out of his and hissing at him to hush up, she wanted to hear.</p><p>\"Detective Berry, perhaps you could escort Jessica somewhere safer?\" Sinclair asked, soooo politely, so I knew he was really sticking the knife in. \"Anywhere outside of Ramsey County would be preferable.\"</p> <p>\"Dread king, may I - ?\"</p><p>\"Nick, let me go.\"</p><p>\"It's a little chaotic right now,\" I told Cl - uh, Stephanie. \"Give us a minute.\" I turned to Jess. \"You know I'll tell you all about it later. Why don't you am-scray for now?\"</p><p>Giving me an \"I'll deal with you later\" glare, Jessica allowed herself to be herded out. Nick shot me a look, too, one I found startling: pure gratitude.</p><p>Tina was panting and patting her hair back into place. Thank goodness she'd worn a ponytail. I hated to think of the masses of blond hair flying all over the place. \"Would you,\" she managed through gritted teeth, \"like a refreshment?\"</p> <p>Cl - uh, Stephanie looked shocked, like it was a trap. The trap of the Coca-Cola products. Ah, I'd fallen into that sweet, sweet trap a time or two myself. \"Uh, no. No thank you, ma'am.\"</p><p>\"My name is Tina.\" Still forcing the words out through teeth ground so tightly, I could hear them rasping against each other. \"I am the adjutant to their majesties.\"</p><p>Adj-u-what? Was that, like, a super secretary or something? I was pretty sure I'd never heard that word out loud before. Maybe I'd read it, but it was spelled completely differently. I made a mental note to ask about it later. Sinclair would know. He knew pretty much everything.</p><p>\"Why don't you come out of the corner,\" I said, crossing the room and offering my hand, \"and have a seat? Oh, and unless this is a trap, thanks for coming out to see us all peacefully and stuff.\"</p><p>Sinclair had stiffened when I'd moved toward Stephanie, but relaxed when all she did was meekly follow me and look down at one of the couches. \"I'm... dirty. I'll stand, if that won't, um, offend.\" Another nervous glance at Tina, who was examining the rips in her sweater. I tried, and failed, not to raise my eyebrows: she'd been struggling so hard to get away from Sinclair she'd torn the seams out from under both arms. And wool was tough. Cripes.</p><p>\"No, please, take a seat. A little dirt won't kill anyone.\" Oh, shit, I said kill. Reminding her of what the Fiends had tried to do to us. \"Um, I mean hurt anyone.\" Oh, shit! \"Um, just sit the hell down, okay?\"</p> <p>She sat on the far, far edge, looking like she wanted to leap away at any second. And I could see why she smelled - her clothes were filthy, and the mingled odor of dirt, dog poop, and blood came off her.</p><p>I wondered where they were sleeping during the day. They had no money or resources unless they killed or robbed or both.</p><p>In the past, when a vampire came back to him- or herself, they could go to the library in Minneapolis and find out who they were, if they owned property, if they still had a bank account... like that. And Marjorie, the dead betrayer, would give them a hand. It occurred to me that we needed a new system in place... like two months ago. Because right now, a vampire who wasn't an out of control newborn had few options. Just feed and hide, feed and hide.</p><p>While you live in luxury on Summit Avenue.</p><p>I shoved that thought away, hard.</p><p>\"Now,\" Sinclair was saying, \"what brings you to us, Ms. Connor?\"</p><p>She picked at the knees of her torn, stained jeans. \"I, uh, thought maybe we could talk.\" She had a mild southern accent - Virginia, maybe? Missouri? Not a drawl, but almost. Of course, anyone who sounded like they weren't from the set of Fargo or Drop Dead Gorgeous sounded southern or eastern to me. \"About our, um, problem.\"</p><p>\"Do you represent the interest of your companions, or only your own?\"</p> <p>She blinked at that one, then seemed to decode it in her mind. \"Oh. Um, I'm here by myself. I mean, the others don't know I've come.\"</p><p>I listened hard for the sounds of ambush, but could only hear the usual household noise. Then I yowled as the furnace kicked on, which sounded at the moment like a jet plane taking off from inside my skull.</p><p>Startled, everyone twitched or looked in my direction. \"Sorry,\" I said. \"I just remembered that 30 Rock is a rerun this week.\"</p><p>Stephanie looked more confused than before, but that was all right. I noticed neither Sinclair nor Tina took a seat, so I did - straight across from our visitor. \"You came by yourself,\" I said, \"that seems pretty obvious now. Sorry about Tina jumping on you like that. She had a flashback to the Civil War.\" I ignored Sinclair's snort. \"So what's on your mind?\"</p><p>\"And why should we think anything you say is the truth?\"</p><p>I shot a look at Sinclair - that sounded a little too much like Nick to suit me.</p><p>\"I don't - I can't prove I'm telling the truth,\" she said, a little desperately. \"I guess the others could be parked a mile away, and this is step one in some elaborate, I dunno, plan? But it's not. We're - we're not well organized.\"</p><p>\"You looked pretty organized when you hurt our friends,\" I said mildly. \"They had to go to the hospital.\" A minor exaggeration - once Nick's nosebleed had cleared up, he'd been fine. It was a measure of his contempt for our lifestyle that he hadn't thought twice about strange vampires punching him in the face and then attacking us. It was only when I'd given him the gory Fiend details that he had realized exactly what had happened - and what it meant for Jessica. \"We were pretty bummed about that.\"</p><p>\"Well. The others are - they're mad at you.\"</p><p>\"But not you,\" Sinclair said, soooo silkily.</p><p>\"I am. I mean, I was. How could you - I dunno.\" She had an interesting way of speaking... not slowly, exactly, and maybe it was the accent. But it was almost like she was searching for each word and found it almost every time, in the unused corners of her mind. I reminded myself that last week she'd been batshit crazy. No idea who she was, where she was, what she was.</p><p>\"Did you guys sort of 'wake up' all at once, then?\"</p><p>Stephanie looked, if possible, even more uncomfortable. Clearly not a subject she wanted to discuss. Too bad.</p><p>\"Well, each time Garrett came we felt - I dunno, better? We felt more. And then, a few days ago, it was like - like I'd been asleep for a long time, only now, right now I knew, I remembered I was Stephanie. I don't...\" She shook her head. \"I don't know who killed me. And I couldn't tell you where I grew up, or the name of my first boyfriend, or even where I went to middle school. I remember some things - my first job out of high school, and the name of the man I almost married, but - mostly I remember the blood. Drinking all of that... that dead blood. For years and years and years.\" She cleared her throat and worked her jaws like she wanted to spit, but didn't dare.</p><p>I glanced at Sinclair and Tina, then took the plunge. \"The thing is, Stephanie, it was kind of our only option.\"</p><p>\"Once we took killing you off the table,\" Sinclair said pleasantly.</p><p>\"I didn't want to kill you guys, but I couldn't set you free, either.\"</p><p>\"Why?\"</p><p>\"Oh, boy.\" I thought about the best way to explain this. \"Stephanie, you have no idea how scary you guys were.\" Was scary the right word? I probably shouldn't have told her that. Fuck it. \"The few times you got out, you ripped people just to pieces. There was no way we could let you have live blood. You would have killed the donor every time.\"</p><p>\"Oh. Yes, I see that now.\" Except she sounded like she didn't, not exactly. \"I should go now.\"</p><p>\"You don't believe me,\" I said.</p><p>Her eyes betrayed her emotion: trapped. I had seen through her lie, and now all she could imagine was that she was in fantastic trouble.</p><p>\"Stephanie, I'm not saying I've treated you and the others perfectly. I think I had the right idea when I began to feed Garrett, regardless of the danger. And I think Garrett had the right idea, when he began to feed all of you. I'm glad - \"</p><p>\"Glad?!\"</p><p>\"Yes, glad, Tina, that he did so. And I hope you and the others can forgive me, and see that I really did start the awakening for all of you. Just not fast enough, or well enough. I can do better, if you give me the chance.\"</p><p>I warned Sinclair, with a look, from saying a word. Stephanie was plainly trying to digest what I had told her. For all I knew, she was still trying to understand some of the words. Or maybe she had one of those 1970s game shows playing in a loop in her mind (\"Things you kill. Things you maim. Things you wish you could drink instead of blood! YES, YOU'VE WON THE $64,000 PYRAMID!\").</p><p>\"Thank you, Your Majesty,\" she finally said. \"I have to get back. The others will miss me. They'd kill me if they knew I was here.\"</p><p>\"Then why are you here?\" Tina asked.</p><p>\"To find out more. To learn if what the others say is true.\"</p><p>\"What do the others say?\"</p><p>\"That we are the queen's wolves, bred for her wars, and the foreshadow of what the world will become under her reign.\"</p><p>We all took that in for a moment. It was so horrible, so preposterous... I didn't know whether to laugh or cry.</p><p>\"Perhaps you could educate your colleagues,\" Sinclair suggested, \"as to the true nature of this queen.\"</p><p>\"Well, I would try to talk to them, but it wouldn't work.\" Stephanie shrugged. \"And I couldn't try too hard, or they might kill me.\"</p><p>I was trying not to gape at her, and failing. In my efforts to apologize and see her point of view, I had missed how fearful she still was... and how undependable an ally she would be.</p><p>\"You have overstayed your welcome,\" Sinclair said, which felt a bit harsh to me, but I had no idea how to correct him.</p><p>\"All right, but...\" She licked her lips. \"I am afraid we will come back soon.\"</p><p>\"Not if you obey your queen,\" Tina pointed out.</p><p>\"I cannot stop them.\"</p><p>\"If you cannot stop them,\" Sinclair pointed out, \"then you cannot help us. And if you cannot help us, we cannot let you go back.\"</p><p>I stared at Sinclair, trying to see where this logic train was going to end. Nowhere happy, I told myself.</p><p>\"We cannot let you stay here, any more easily than we can let you go back. The effort to watch over you securely, combined with the potential costs if we fail, lead to only one solution. Tina,\" he ended calmly, \"kill her.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"No no no no no no no!\" Only just in time did I leap from my seat and jump in front of the cringing Stephanie, who had shoved herself so far back she had nearly disappeared into the couch.</p><p>Tina slammed into me hard enough to make me stagger - she'd launched herself the moment Sinclair got \"kill\" out of his mouth. Like she'd been ready the whole time. Like she was waiting for it.</p><p>\"Bad, Tina! Down!\"</p><p>\"Elizabeth, do not - \"</p> <p>\"Keep her away from me!\" Stephanie squealed, scrambling off the couch.</p><p>I managed to grab Tina by the shoulders and hold her at arm's length. At least she wasn't trying to kick me. \"You guys, you guys! We are not killing her, she came in peace, and she's leaving the same way.\"</p><p>\"Like hell,\" Tina managed through gritted teeth.</p><p>\"Don't listen to her! You can go. Good-bye, Stephanie. I'm sorry about what happened to you.\"</p><p>\"Do not,\" Tina snarled, \"apologize. To that thing.\"</p> <p>Meanwhile Stephanie was halfway out the door. \"Thankyouforseeingmegoodbye.\"</p><p>I let go of Tina, and we all listened to the rapidly retreating footfalls.</p><p>\"Soft,\" was my husband's verdict. \"Much too soft. Even now. Hmm.\"</p><p>\"And you're too hard,\" I shot back with my own judgment. That's right - two could play the judge-and-jury game! \"And too stupid. And don't be siccing Tina on people, like she's your own personal pit bull!\"</p><p>\"But I am,\" she replied at the exact moment Sinclair said, \"But she is.\"</p><p>\" 'Kill her,' my God! Haven't you ever heard of a flag of truce? These Fiends are growing. Maybe they can grow emotions beyond hate and fear. Maybe they can become... like Garrett. Like us. Why is that so hard for you two to see?\"</p> <p>They'd flinched when I'd broken the commandment, but now they were both giving me that look.</p><p>\"There will come a time when you will regret having let her leave,\" my bloodthirsty psycho husband said.</p><p>Tina was shaking her head. \"You should have let me kill her, Majesty. If for no other reason than the audacity she showed in coming here, soliciting an apology, and giving nothing in return! Not even an offer to try to lift a finger to stop the others.\"</p><p>\"She'll remember I was nice to her.\"</p><p>\"Mercy,\" Sinclair lectured, \"is a poor weapon.\"</p><p>I stared at him. Sometimes - many times - I didn't know him. At all. \"It's the only one I'm using right now.\"</p><p>\"You don't have to use a weapon at all,\" Tina pointed out. \"I would take care of these problems for you.\"</p><p>I think what finally made me snap was seeing Tina degrade herself - describe herself as nothing but a deadly vessel, when I knew she was so much more. Or maybe I was just pissed at my fucking arrogant husband.</p> <p>\"The only problem I have,\" I hissed, \"is a couple of subjects who don't think I have what it takes to be queen! Perhaps if they'd sit down, shut up, and listen to her, they'd learn something!\"</p><p>Yuck, did I just refer to myself in the third person? Even weirder, Tina looked embarrassed beyond belief, and quickly sat down. Sinclair also sat down, much more slowly, with an odd expression on his face - a cross between outrage and pride.</p><p>Well. Now what?</p><p>\"So.\" I started to pace. \"Let's figure this out. Where are the Fiends staying during the day?\"</p><p>\"I would be more interested in how and where they are feeding,\" Sinclair said. \"I would ask Detective Berry to look for any unusual homicides, but he is not our friend at the moment. His loyalty is solely with Jessica. Perhaps another source can help us.\"</p><p>\"He'd look for vampire attacks in two seconds, regardless of how he feels about you, me, and Tina.\"</p><p>I was about to elaborate, when the front door was slammed open and an all-too-familiar voice greeted us with, \"What the hell is going on? I leave this shitheap for three days, and the fuckin' Fiends are loose, my boyfriend's practically catatonic, and the smelliest bitch I've ever fuckin' seen practically ran me down on the porch! Not to mention I nearly got into a fender bender with the devil who looks like Miss Fuckin' February! Jesus fucking Christ, what the hell is going on?\"</p><p>Antonia the werewolf was home.</p><p>\"Oh, gosh, Antonia, you know you shouldn't talk like that.\"</p><p>As well as the devil's daughter. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Two ridiculously beautiful women hurried into the parlor, and I sighed. I often felt like the homely judge at a swimsuit competition; all the women in our house were just so pretty.</p><p>Antonia Wolfton, current werewolf and former psychic, was a lean, tall brunette (almost as tall as me), with striking dark eyes and the palest, softest skin I'd ever seen on someone alive. She was like a foulmouthed milkmaid.</p><p>The waves of her hair crashed and bounced halfway down her back. Her lips were rosebud pink, and when her hair was pulled back by a red ribbon, as it was now, she looked like Snow White.</p><p>\"I thought you were gonna get the fucking driveway fixed,\" she griped. \"And what'd you do to my boy toy while I was gone, you rotten bitch?\"</p> <p>I didn't laugh - barely - but then, I was used to it. For Antonia, that was a downright warm greeting. It was just so weird, those excellent good looks, that amazing figure, that perfect mouth... and then the words that kept coming out over and over again. It was as if God had fused a swimsuit model with a teamster.</p><p>\"Oh, now, stop it,\" the devil's daughter (really!) said with gentle reproach. \"The driveway's not that bad, and I'm sure Sinclair and Betsy have lots more important things on their minds.\" Laura Goodman (don't laugh) looked like, as Antonia had put it once, \"a dirty old man's wet dream,\" with long, butter-scotch blond hair, big blue eyes, and long strong limbs. Her nose was a sculpted delight, her mouth wide and generous.</p><p>She had never had a pimple.</p><p>I think I mentioned before that Laura had a unique way of rebelling against her mother. When your mother was the devil, the devil, there wasn't much you could do for rebellion; after all, how do you rebel against the embodiment of evil?</p><p>You go to church. You teach Sunday school. You volunteer for soup kitchens. You are kind to children and small animals. You constantly watch your language. You pray.</p> <p>That's how.</p><p>\"What are you guys doing here?\"</p><p>\"Ha!\" Antonia brayed. \"I knew you'd play dumb. Actually, you can't not play dumb, huh, Bets? My boyfriend called, and he's a gibbering wreck. Something about his 'foul behavior' and 'base betrayal' and how there can be no forgiveness 'n' shit, then I got bored, so I kind of tuned him out.\"</p><p>\"And yet,\" Sinclair said dryly, \"here you are.\"</p><p>\"Shit, yeah. Apparently everything's going to hell around here. You dummies need me.\"</p><p>\"You don't especially need me,\" Laura said, almost apologetically. \"But I got worried when you canceled our lunch.\" From anyone else, that would have sounded reproachful. Laura was too tenderhearted to pull something like that, even though it hadn't been one lunch I'd blown off, it had been two. \"I apologize for dropping by without calling, but I was beginning to worry.\"</p> <p>There was a method to my madness, and I wasn't at all happy to see my sister here. Bottom line? I didn't want her anywhere near the Fiends, especially since we didn't know when they'd come calling again. Part of the reason they'd gotten better so quickly was because they had drunk a combination of my blood... and hers.</p><p>It wouldn't be understating the point to say I wished she'd leave the state until this was all straightened out. I was just too chickenshit to tell her.</p><p>\"It's been really crazy around here,\" I managed.</p><p>\" 'Really crazy'?\" Antonia sneered. \"Oh, okay. That's not the Betsy play-it-down machine getting into gear, is it?\"</p><p>\"My gosh,\" Tina said mildly, \"what happened to your arm?\"</p><p>\"Oh. That.\" Antonia gleefully rolled up her sleeve and displayed her disgusting injury to all of us. What I hadn't noticed turned out to be a hideous blackish red bruise running from her wrist to past her elbow. \"Jumped from one of the bluffs and miscalculated the distance.\"</p><p>\"Antonia, you've got to take better care of yourself,\" I scolded. \"You're not used to changing into a wolf, and besides, last night wasn't even the full moon... what are you doing jumping off bluffs?\"</p><p>\"Quickest way to get where I wanna go. Anyway, tomorrow night is the full moon, and then we'll have fun fun fun.\" She was positively gleeful, and I couldn't blame her.</p> <p>\"One of these days you'll miscalculate and break your rotten little neck.\"</p><p>This was true, despite Antonia's glare. See, when she first came to us, Antonia was a very special kind of werewolf. She was born into the pack, had a werewolf mom and dad, but had never changed. Never become a wolf during the full moon.</p><p>Instead, she could see the future. It wasn't always clear, and sometimes only after the fact could we figure out exactly what she'd been trying to warn us against. (Like most supernatural abilities, it sounded better on paper than the real deal.) But she was never wrong - just oblique.</p><p>Until Marjorie the librarian came along - in addition to giving me a cursed engagement ring and snatching my groom, she'd locked up Antonia as well - and Garrett. Do you have any idea how claustrophobic werewolves are? They dealt with enclosed spaces the way I did with knockoffs. Just a bad, bad situation all around.</p><p>Anyway, while I was busy killing Marjorie and soaking up all her evil energy, I let Antonia have a blast of it (most of the rest I saved to revive Sinclair and cure Jessica's cancer). It was the first time she had ever changed into a wolf, and she'd been enjoying it ever since.</p><p>As I said, she had lived her whole life among werewolves while being unable to change into a wolf herself. Now she saw herself as complete, and didn't seem to mind the loss of her psychic abilities as a trade-off.</p><p>But, as Laura pointed out, she was taking too many risks. Nothing we would say would talk her out of it, either; she thought she was invincible even when she wasn't in wolf form.</p><p>\"So what'd you dimwits do to my boy toy?\" she demanded, rolling down her sleeve. I noticed for the first time that she was wearing one of my oxford shirts, and stifled a groan. Antonia had the table manners of Boss Hog. Assuming I ever got the blouse back, I'd probably have to chuck it. \"He's practically fetal with wretchedness.\"</p><p>\"You could tell that over the phone?\" Sinclair asked, amused.</p><p>\"Enhanced senses,\" she sneered, staring him straight in the eye - the height of rudeness for a werewolf. \"Way better than anything a dead guy can do.\"</p><p>\"It's really none of my business,\" Laura said, fiddling with a lock of her hair and looking at the assembly of personalities in the room, \"but something certainly seems to be going on. Are you all right?\"</p><p>\"As rain,\" I said heartily.</p><p>Antonia and Laura stared at me.</p><p>\"Well.\" I coughed. \"There have been a few things going on...\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We ended up sitting down in the kitchen and telling the girls everything. If for no other reason than they had to be warned - Antonia lived there most of the time, after all, and Laura was famous for the pop-in.</p><p>Antonia's face got darker; Laura's became more concerned. When I finished (after frequent interruptions from the love of my life and his personal pit bull), there was a long silence, broken by Antonia bawling, \"Garrett! Get your ass up here!\"</p><p>\"But you could have been killed!\" Laura said, rubbing her ear as Antonia disappeared in the direction of the basement. \"Why didn't you call me?\"</p><p>\"It would be unsafe to have you near such dangerous vampires at this time,\" Sinclair said bluntly.</p> <p>\"What? I could help,\" she said, hurt.</p><p>I glared at Subtle Boy. \"Honey, it's not personal. It's just - the Fiends are like this because of my blood and your blood.\"</p><p>\"But you're the one who made me - \"</p><p>\"I know, I know. Like I said, it's not personal. But I can't take a chance of one of them attacking you, getting a mouthful, and getting even more dangerous. And, no offense, sometimes your temper gets the better of you.\" To put it very freaking mildly.</p><p>\"It does not!\"</p> <p>\"Hon. It so totally does.\"</p><p>\"That was one time!\"</p><p>\"Are you talking about the time you beat the shit out of Garrett, or the time you killed the serial killer?\"</p><p>Laura's mouth thinned, but before she could reply, Garrett came skidding into the kitchen on his back, as if someone was using him to play shuffleboard. We heard footfalls, and then Antonia slapped the door open.</p><p>\"It's one thing to want to help your comrades in arms,\" she told him as he climbed slowly to his feet. \"But something else to put your friends in danger and then hide from what you've done. Literally hide - have you even been out of the basement since you called me?\"</p><p>\"No,\" Garrett said.</p> <p>\"And you're living under her roof! Calling for me to come save you, calling from her phone! You made this mess, Garrett, and much as I love you, you'll fix it, or I'll pull all your limbs off.\"</p><p>\"It's not his fault.\" Sure, she'd been saying things I had secretly been thinking, but I could have cried at the expression on poor Garrett's face. He was trying to shake the long hair out of his face, and was too ashamed to look at any of us. \"He didn't know what would happen. He's only been speaking English for two damn months!\"</p><p>\"It is my fault,\" he said dully, looking at the floor.</p><p>Antonia's tone gentled about a fraction, and she bent to help him to his feet. \"I know we have different backgrounds - and the age thing - I'm not stupid, I know we're different. Shit, we're not even the same species; needless to say we weren't brought up the same way. But I can't be with someone who puts his friends in danger and then hides to save himself.\"</p><p>\"The Fiends are my responsibility and no one else's,\" I said, resisting the urge to step between Antonia and Garrett. \"This isn't a debate we're having, okay? The Fiends are my problem. How they got on the radar is irrelevant. Does everyone understand that?\"</p><p>This, as I knew it would, put Antonia in a major bind. A creature of pack leaders and strict hierarchies, when she was under this roof, I was her pack leader pro tem. She could tease me, mouth off, borrow my clothes without asking (though she knew better than to touch my shoes), and give me untold rations of shit, but it was very, very difficult for her to out-and-out cross me.</p><p>In a strange way I knew I could count on Antonia's obedience and support more than anyone else's in the room. Of course, I had no power over the devil's daughter, except her willingness to please a sister.</p><p>Tina obeyed me in superficial matters (while you're up could you get me a glass of orange juice? Could you show Officer Berry the door? Could you hit Sinclair over the head with the fax machine?), but on matters like this, her allegiance was clearly to Sinclair.</p> <p>I had zero power over Sinclair.</p><p>\"If you're taking responsibility, I guess it's none of my business,\" Antonia said with a shrug. \"But holler next time one of them comes calling. Might be fun. As for you...\" She pointed to Garrett, and he followed her, slump-shouldered, toward the basement door.</p><p>\"I hope she isn't too hard on him,\" Laura worried.</p><p>\"Ha,\" I said sourly. Already I could hear things crashing. \"She'll be hard on him. But at least they'll kiss and make up.\"</p><p>\"You think?\"</p><p>\"Who else could stand to be with either one of them?\"</p><p>\"Point,\" my sister conceded, and we both laughed.</p><p>I asked after BabyJon, whom Laura had been watching, before dropping him off at my mother's for the day.</p><p>\"She'll be underwhelmed,\" she pointed out diplomatically, when I suggested BabyJon might need to stay there longer.</p><p>\"Laura, I know she thought her baby-rearing days were long over - \"</p><p>\"And don't forget BabyJon is a constant reminder of her late ex-husband's infidelity.\"</p><p>\" - and I respect that. But she still loves BabyJon, kind of, and she won't want him harmed. If we laid it out for her, told her he could either stay here and maybe get nibbled by Fiends, or stay with her and spit up on her Civil War bullet collection, you know which one she'd pick. But please don't tell her why BabyJon needs to stay. She'll just worry.\"</p><p>\"I'll come up with something,\" Laura promised at once. God, she was so low maintenance. When she wasn't in the grip of a simmering, murderous rage. \"It wouldn't be such a big deal, but I think your mother is still taking your father's death kind of hard. Harder than - I mean, hard.\"</p><p>Laura had corrected herself because she'd been about to say \"harder than you,\" which was nothing but the truth. I'd been fairly indifferent about my dad in life and wasn't sure how I felt about him dying. It was even partly my fault he was dead and I wasn't sure how I felt.</p><p>When I had died and come back as a vampire, he'd essentially told me to stay away. Seemed only fair that I return the favor... to seem like I didn't care if he was gone forever. But then, that sounded so cold and mean, I couldn't stand it. He was my father.</p><p>\"Which reminds me,\" I sighed, slumping in my seat, \"you won't even guess who's been hanging around.\"</p><p>\"Umm... Detective Berry?\"</p><p>\"Well, yeah, but also my stepmother... and your birth mother.\"</p><p>Laura had been polishing an apple on her immaculate buttercup yellow wool blazer, but stopped. \"She's haunting you?\"</p><p>\"Yeppers.\"</p><p>\"What does she need you to do?\"</p><p>\"That's the super fun part. She won't tell me.\"</p><p>Laura shook her head; gorgeous blond strands flew about her face and then settled perfectly. \"That does it. I can no longer stay away from your house for more than a week. I miss too much!\"</p><p>\"It's not always like this,\" I sighed.</p><p>\"In fact, I'm going to stick to you like cow poop on a Furragrammo.\"</p><p>\"It's Fair-uh-gahm-oh... and don't even say it!\" I begged, but it turned out she wasn't exaggerating. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I still don't understand why Midwestern Barbie is along for the ride,\" Detective Nick whined as we pulled onto the highway.</p><p>\"One of the three of us in this horrid little car has my sister's best interests at heart. One of them isn't you,\" Laura said sweetly, \"and the other isn't her.\"</p><p>I forced a cough. \"Any luck with that, um, errand Jessica asked you to run?\" After some discussion, Tina, Sinclair, and I had agreed Jessica was the best person to ask Nick to keep an eye out for unusual murders.</p><p>\"You mean have your runaway pets mangled any citizens? Not that we can tell. Yet. And again, if I didn't make this clear: nice one, doorknob.\"</p> <p>\"I said I was sorry,\" I grumped, slumping against the backseat. (Yes, he'd dumped me in the back - at least it was a plain car and not a cruiser.)</p><p>\"You stop picking on her,\" Laura ordered. \"She's doing the best she can. Although when she shuts out family members it only makes things - \"</p><p>\"I'm sitting right behind you. I can, sorry to say, hear everything. Where are we going, anyway?\"</p><p>\"Got a tip that our bad guys might be meeting down here.\"</p><p>\"Wait, 'bad guys' the Fiends? Or - \"</p> <p>\"No, my bad guys, dummy. I hate to break this to you for the twentieth time, but it's not always about you, Betsy.\"</p><p>I disagreed, but let it pass. \"And a fellow cop showing up isn't going to scare the alleged bad guys away?\"</p><p>\"We think they're actually contracting out - giving the info to one of their perps, a guy (or gal) they can count on to pull the trigger. Do a few of those, and the triggerman disappears.\"</p><p>\"So... wait. You think they aren't just killing bad guys, they're getting other bad guys to kill bad guys, and then killing those bad guys?\" Laura sounded truly horrified, but I had to admit it was fiendishly logical.</p><p>\"Hey, I know it sounds bad, but our stats look great. Crime's down across the board almost eighteen percent.\"</p><p>\"Nick Berry!\"</p> <p>\"I know, I know.\" He slumped against the steering wheel. Luckily he'd gotten off the highway and we were at a red light. \"We gotta put a stop to it. Tell me something I wasn't the first to figure out. Why do you think the chief's been riding my ass?\"</p><p>\"The entire force should be out on this, not just you,\" Laura continued, snug in her cocoon of moral superiority. \"It dishonors all of you. Your chief should understand that.\"</p><p>\"The last thing we need is the papers getting ahold of this tidbit. So it's on the down low for now.\"</p><p>\"You worry too much about the papers. Also, nobody says down low anymore,\" I announced.</p><p>Nick sighed. \"Bad enough you have to come along. Next time,\" he said, catching my gaze in the rearview mirror, \"Pollyanna stays home.\"</p><p>I shrugged. \"See if you can make her.\"</p><p>We were in a fairly beat-up Minneapolis neighborhood, one of those places that might have been pretty a few decades ago, but had suffered from a few too many absentee landlords, and not quite enough good jobs.</p><p>Nick parked, and we all got out. The street was dimly lit, and clumps of teenagers and twenty-somethings stood out like mushrooms sprouting on various corners. We got a few looks, but nobody came over - or appeared to recognize Nick as a cop.</p> <p>The storefronts were all empty, some with windows soaped over. The sidewalks were a mess; paper, beer bottles, and cigarette butts all over the place. If I hadn't been dead (or with the devil's daughter), I never would have gotten out of the car.</p><p>At least it wasn't too cold out yet; it was nearly seventy degrees, not too shabby for nighttime in September. It was funny; I'd always had contempt for California and Florida transplants who bitched about how cold the weather got in my home state. Shoot, I used to wear shorts in February and sneer at the whiners.</p><p>That was all over with, now. O, irony, you are a harsh mistress. I actually had a pair of gloves in my Burberry handbag... how was that for wimpy?</p><p>\"I've just got a tag number,\" Nick was saying, \"but I don't know if it ties in to - \"</p><p>I didn't hear the rest, because I was distracted by rapidly approaching footfalls and turned just in time to get slammed off my feet. The chilly sidewalk rushed up to smack into my back, and I cracked my head hard enough to see black roses.</p><p>Then someone with truly awful breath was yanking me off the ground by my purse strap, which, to my amazement, held. I had no idea if I was mad or glad. It had been a gift from Jessica. It was my only designer handbag. But then, if it had snapped free, I wouldn't have a stranger's hands around my neck right now. Decisions, decisions.</p><p>\"Leave her alone!\" Laura shrieked, while around her, teens fled. \"Let her down! Detective Berry! Do something!\"</p><p>\"Freeze?\" he suggested.</p><p>Bad Breath Boy and I were spinning around on the sidewalk in a tight little dance, and the stench of fresh, drying, and old blood was making me nuts.</p><p>\"A Fiend,\" I managed, trying to break his grip - he was much taller, much broader. \"It's a Fiend, don't get too close.\" Here? Now? What the fuck? Had they followed me from the house? Worse, had they followed Laura? That could be extremely awful.</p><p>\"I could shoot it, but might kill Betsy by mistake. Ah, well,\" Nick said cheerfully, and I could hear him unsnap his holster. \"A risk I'm willing - hey!\"</p><p>There was a blinding light, like someone was holding a bolt of lightning, and then the light swung through both of us. It didn't do a thing to me but make me blink furiously.</p><p>But the effect was devastating on the Fiend, who didn't so much burst into flame as burst into ash. This was actually really weird for a vampire - unlike in the movies, where most vampires, when killed, just laid there, dead forever.</p><p>Not this one; he was a puddle of ash inside filthy clothes. Oddly, there was no smell, and no real flash of heat, just that blinding, gorgeous light. This made sense, as it wasn't real heat that had demolished the Fiend.</p><p>I coughed explosively, spitting dead Fiend out of my mouth and wiping it out of my eyes.</p><p>\"Holy shit!\" Nick said from the sidewalk where Laura had shoved him. \"What the hell did you do?\"</p><p>\"Hell being the right word,\" I muttered, straightening out the kinks in my back, groaning and spitting. I was pretty sure Nick didn't know Laura was the spawn of Satan, so I kept the explanation brief, yet truthful. \"That's her hellfire sword.\"</p><p>\"You said that like 'that's her third cup of coffee.' \"</p><p>\"You know how some girls get pearls for their sweet sixteen? Laura's mom gave her weapons made of hellfire.\"</p><p>\"You guys never tell me anything. I should have guessed your sister would be a freak like you,\" he bitched, climbing to his feet - only to get kicked over on his back by Laura, who was still holding her sword made of light.</p><p>\"Now, Laura,\" I started, trying to swallow my nervousness.</p><p>\"She was in trouble, and you just stood there,\" my sweet, good-natured, murderously dangerous sister hissed. \"She might have been hurt or killed! Protect and serve, my ass!\"</p><p>Uh-oh. She'd said ass instead of butt. Really mad, then.</p><p>\"That was a Fiend! She said that was a Fiend! You led us down here, and a Fiend jumped her! Did you plan it? Do you have something up your sleeve besides catching rogue cops?\" She jammed her sword under his chin, and his eyes watered at the light. It was pure bluff; her sword only disrupted unnatural magic: vampires, werewolves, spells. And only when she wanted them to, which is why it didn't work on me.</p><p>But Nick didn't know that.</p><p>\"Get that thing out of my face,\" he snarled, not quite daring to bat it aside. \"Think I would have brought a damn witness if I was trying to eighty-six your sister? Or are you as dumb as you look?\"</p><p>\"Stop it, that's enough, just - quit!\" I gently pulled my sister away. \"Laura, put that thing away before half the street sees it.\"</p><p>Laura sullenly complied, sheathing her sword into... well, nothing, as far as I could tell. Nobody knew where her weapons went when she wasn't wreaking havoc with them.</p><p>\"And you!\" Nick, climbing to his feet, nearly fell over when I rounded on him. \"She makes a good point, you know. A Fiend just happens to burst out of nowhere and try to kill me, and you just stand there?\"</p><p>\"What the fuck do I know about killing vampires? My bullets won't kill you. I don't think.\" The truth was, we didn't know. His bullets had killed a vampire... once. On my honeymoon, no less. \"Why would they kill that thing? Do you think we have a police training course on arresting the undead? Do you think I've got Fiend Hunter tattooed on my forehead? \"</p><p>\"No, you've got Brutal Imbecile tattooed on your forehead,\" Laura interrupted.</p><p>\"When I want your opinion, Barbie, I'll pull the string on your back.\"</p><p>\"Give it a try,\" she snarled. \"See how many fingers you pull back.\"</p><p>\"You wanna go, Barbie? Because we'll go.\"</p><p>\"Shut up!\" I howled. \"I'm not a queen, I'm not a wife, I'm not a big sister, I'm a WWF referee! Sorry, Nick. This expedition is over. Everyone get in the car right now!\"</p><p>Meekly, they did. This was more like it - Eric and Tina never did a damned thing I asked them to. But first, Nick carefully eased my purse off my shoulder... I guessed he was going to try to get some fingerprints off it. We sure couldn't print the pile of ash on the sidewalk. I warned him not to use any of my credit cards and to leave the strawberry Blo-Pops alone. Sometimes I went through a dozen a day. It helped keep the blood craving down.</p><p>\"Heir to the John Deere fortune, remember? I've got more money than you do, honey.\"</p><p>\"Good. Then you can bring me to Wendy's,\" I commanded, all queen-like. \"Being the victim of assault and battery gives me a craving for a chocolate shake.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"That is strange,\" Sinclair admitted. After Wendy's, we'd ended up going back to the mansion and telling him and Tina what had happened. It was the first night of the full moon; Antonia was running around somewhere on all fours. Garrett had probably gone with her.</p><p>Jessica was visiting Marc at his new digs at The Grand, and I hoped he'd be able to come home soon. Things weren't the same without him. Besides, people disappearing out of our house brought back bad memories of last summer, when I was all alone.</p><p>Shoot, I even missed BabyJon's shitty diapers.</p><p>\"Which part is strange?\" Nick said dryly, bringing me back to my consideration of Sinclair's comment. \"The part about my receiving a call and being sent to a bad neighborhood on what might have been a phony tip? The part where a Fiend just happened to run into us? Or the part where your wife's sister pulled a fucking flame brand out of thin air and killed said Fiend, before threatening to do the same thing to me?\"</p> <p>Hearing that Laura had threatened the officer didn't seem to perturb Sinclair one bit. \"You say the chief is the one who gave you this assignment?\"</p><p>\"Yeah. And don't go there, pal, he's a stand-up guy.\"</p><p>\"Oh, Nick.\" I shook my head sorrowfully. \"Nobody says 'don't go there' anymore. Seriously. I'm so embarrassed for you right now. More so than usual, even.\"</p><p>He ignored me. \"The chief's a year away from forced retirement - it's no time for him to fuck up a perfect record. It'd be the closest thing to suicide - this guy's job means everything to him. That's why Chief Hamlin wants these rogue cops caught, but he doesn't want to trash the police department's rep at the same time. Hell, he's the one who figured out the pattern - and the killings have been going on less than a month.\"</p><p>\"I would think the reputation of his house would be the least of his problems,\" Tina ventured.</p> <p>\"Yeah? Come on, they're still making jokes about the LAPD, and how many years ago was Rodney King?\"</p><p>\"Some might say,\" I said carefully, \"that there've been one or two incidents in that department since the King videotape.\"</p><p>Laura beamed at me. \"You're right, Betsy. Some police departments deserve the reputations they have.\"</p><p>I shrugged under Nick's withering stare. \"I don't have a problem with cops,\" I said apologetically. \"But I've been known to channel Jessica's point of view, from time to time.\"</p><p>\"Getting back to the issue at hand,\" Sinclair suggested, \"I wonder why this Fiend came alone. Did any of you get a look at which one it was?\"</p><p>\"Skippy,\" I said immediately.</p> <p>\"Skippy?\" Nick asked, incredulous. \"Friggin' Frankenstein was named Skippy? He was almost seven feet tall!\"</p><p>I was embarrassed to hear the nickname repeated; what had at first sounded fun now seemed stupid, careless, and immature. Worse, nobody'd ever know the dead guy's real name now. The least I could have done when they came by was ask their real names. Mistake number 1,429 in what was turning into a shitty week.</p><p>\"I am in your debt, Ms. Goodman, for the assistance you rendered my wife.\"</p><p>Laura blushed to her eyebrows. \"Oh, no, Eric, it's fine. We're family. I'm just happy I was there to help.\" She sharpened her words by narrowing her eyes at Nick.</p><p>\"Hey, hey,\" he protested. \"The whole thing happened in about two seconds. I could have got a shot off, but I might have blown a hole in your pretty wife's head. I mean, I could have lived with it, but - \"</p><p>Sinclair silenced him with a wave of his kingly hand, which I could tell irritated Nick to no end.</p><p>\"So what are you going to tell your boss? The chief?\"</p><p>\"That I couldn't find the tag, but I'll go back and look again.\"</p> <p>\"Alone,\" Sinclair said. We all noticed it wasn't a request. \"You will go back and look again alone.\"</p><p>\"You think I want those two PMS poster babies along for the ride? Ha!\"</p><p>\"Then allow me to escort you out,\" Tina said politely, getting up from the table.</p><p>\"I'll see my own damned self out. In fact, I'm gonna start hanging out at The Grand instead of this house of freaks.\"</p><p>\"The door can stick a bit,\" Tina yawned. \"Make sure you pull it shut all the way behind you.\"</p><p>\"Me-yow,\" I smirked as the door swung fully shut a few moments later.</p><p>Tina's bored expression vanished, nearly startling me into a yelp. \"Curious.\"</p><p>\"I was thinking the same thing.\"</p><p>\"What?\" I resisted the urge to yank my hair out by the double handful. \"Oh, God, what now?\"</p><p>\"He insists the queen assist him in a delicate matter. He seems determined to put her in harm's way. He has made no secret of his contempt for and fear of her. And now, tonight - a Fiend happens to show up.\"</p><p>\"You're not thinking - wait. What are you thinking?\"</p><p>\"But Nick couldn't be the rogue killer,\" Laura said - and thank goodness someone else was catching on. \"He's the one killing all the bad guys, and he tells us all about it, and brings Betsy in to help him? You're saying it's an elaborate trap so he can kill her?\"</p><p>\"No way.\" I was shaking my head, though it did make a sneaky amount of sense. \"He wouldn't dare.\"</p><p>\"He does seem to dislike you a lot,\" my sister said thoughtfully.</p><p>\"Yeah, but you guys are forgetting the Jessica factor. He wouldn't dare risk their relationship just to get me. I don't think he'd risk anything if it meant Jessica would toss him like hot vomit.\"</p><p>\"An appealing image,\" Tina said, stifling a giggle. \"But I still suggest we take a closer look at the good detective. A pity the body was essentially vaporized; I would love to have gotten his fingerprints.\"</p><p>\"Why?\"</p><p>\"Knowing who they used to be would be helpful, I'm sure. If nothing else, Detective Nick could see if they had priors, when they were born - like that.\"</p><p>\"Sorry,\" Laura said. \"That's the trouble when hellfire meets vampire. Poof!\"</p><p>\"Yeah, it's cool, but then you've got dead vampire in your hair for hours. But Nick might have some luck with my purse. I'd better get that back from him, the crumb bum. Which reminds me, if the festivities are over for the night, I'm gonna shower.\"</p><p>\"And I,\" Sinclair said, rising, \"shall assist you.\"</p><p>He chased me all the way to our room. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sinclair was as good as his word; he soaped my back, washed my hair for me, and pretty soon we were groaning and biting each other under the pounding water. Sex in the shower didn't always work for people, but I was a tall girl.</p><p>And while he pushed, pushed, pushed into me, I watched the blood from my bite trickle down his back and swirl down the drain. Then the universe went away for a few seconds, while my orgasm took over my brain. Thank God Sinclair had a good grip, or I would have gone down like a sawed Sequoia.</p><p>We were relaxing in the second or third afterglow - we'd gone from the shower to the bed, and the sheets had completed the job of drying us - and I was grinning like a monkey. Sure, there were still problems, but now we were thinking about solutions. Maybe we were turning a corner on this. Maybe we -</p><p>From far below us, the front door boomed open, and I heard the very distinctive sound of Antonia's growl, followed by Tina's shrieked, \"Majesties!\"</p> <p>\"It never ends,\" I moaned, reaching for a robe. Sinclair had slipped into a pair of pants and was already out the door. \"It never ends!\"</p><p>I beat him to the foyer, but only because he had too much dignity to vault the banister and bypass the stairs. Ha! Score one for - aggh! I had nearly skidded in the blood.</p><p>Antonia was in her werewolf form - I glanced at the bigass clock at the far end of the hall and saw that dawn was still at least ten minutes away.</p><p>She had dragged a dead Fiend in with her.</p><p>\"Um. Good dog?\"</p> <p>Garrett was shivering behind her. He clearly hadn't cared for the night's fun-filled activities, but knew he looked bad enough already in his lover's eyes.</p><p>I felt sorry for him. Anybody who says good guys never get scared and do stupid things has watched too many action movies. Yeah, he'd shown the less noble half of the human condition these past few days, but I could never forget what he'd gone through, and how far he'd come.</p><p>The man had never asked to become a vampire, or a Fiend, or anything else. He just woke up one day in a world full of pain, and wondered why. Just like the other Fiends.</p><p>I couldn't even look to myself as a better example of how to act. Any poise I had, I was sure, was a function of my ignorance of what I truly faced as queen. To put it more bluntly, I was so clueless about the magnitude of my new job, I was too dumb to be scared.</p><p>Antonia was sitting on her haunches, seeming to laugh at us with her wide mouth and eight zillion teeth. Her coat was the color of her hair, rich and dark. Interestingly, she had a white splotch on her chest, roughly diamond shaped. The splotch had a dark red smudge on it, and blood still trickled down her panting tongue.</p><p>Tina was examining the dead (again) Fiend. \"This one appears to be the one Betsy named Sandy.\"</p> <p>He was a large man, built like a farmer with thick shoulders and long, powerful legs. Not as tall as Skippy, but still formidable. Shirtless, with ripped jeans. No shoes or socks. His feet were filthy; God knew how long he'd been running around like that.</p><p>His throat had been torn out. Among other things.</p><p>\"She found his scent in the garbage pile out back - the stuff the contractors left after they fixed the house,\" Garrett said. \"We've followed it all night. She caught him alone and - well. You can see.\"</p><p>\"Sure can.\"</p><p>Okay, there was another corpse in my foyer, and that was, under any circumstances, bad. But Marc and Jessica were out, and untouched by this. So I was at a total loss as to how to react: Great job? Naughty werewolf? Thanks? Don't run off ever again on a murderous rampage, or I'll kick your ass? Murder bad? Murder good?</p><p>I finally settled on concern for my friend. \"For crying out loud, Antonia! You could have been killed! Bad, bad werewolf!\" I was towering over her, shaking my finger (but not getting it too close to all those teeth). \"This is the sort of thing that can get you killed, and then where would Garrett be without you? You were really sweet to try and solve our problem, but I don't want you going off alone like that ever again!\"</p><p>Bored, Antonia licked blood from her left paw.</p><p>\"I mean it!\"</p> <p>The werewolf yawned.</p><p>\"If you have more to add to your lecture,\" Sinclair said, his lips twitching, \"you had better hurry. I estimate the sun will be up in less than five minutes.\"</p><p>\"Dammit!\" While I could withstand sunlight, the coming of dawn was still a narcoleptic trigger for me. Worse so than for other vampires; apparently, this was part of the price of being queen.</p><p>I tried to end my lecture quickly, but Sinclair had been (unintentionally, I'm sure!) mistaken: sunrise was in less than ten seconds.</p><p>\"There she goes,\" Tina commented, as the floor rushed up to my face and everything went dark. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Someone had considerately carried me up to bed (I prayed it was Sinclair), and I woke up with a large Post-it stuck to my forehead.</p><p>I snatched it away and read: Developments! Come down as soon as you get rid of your horrible vampire breath. Also, your mom wants to know how long she's going to be stuck with BabyJon; I guess he's teething again.</p><p>Oh, goody. Jessica was back. And my poor baby brother! He drooled like a beast when he popped a new tooth; I'd seen him soak an entire quilt. He was impossibly cute most of the time, with his shock of black hair, amazing blue eyes, and sweetly chubby limbs, but I could hardly bear to look at him when he was slobbering his way through the tooth of the week.</p><p>I couldn't help it; I grinned, picturing my mother's horror at watching BabyJon soak one of her antique quilts.</p> <p>I hopped out of bed, shrugged out of yesterday's outfit, and brushed my teeth and hair. Then I changed into gray leggings, a dark blue PROPERTY OF RENFEST sweatshirt, and black flats - no socks. Then I hurried downstairs to the kitchen.</p><p>\" - took him down so easy,\" Antonia was bragging. \"Look! Not a mark on me.\"</p><p>\"Anymore,\" Sinclair corrected her politely. \"You don't fool me, dear.\"</p><p>\"Okay, maybe El Fiendo got in a few good ones, I admit it. But I'm all healed up and he's roasting in hell. That puts it in the win column for me.\"</p><p>\"It was foolish of the two of you to go after him by yourselves. You might have run into all of them.\"</p> <p>All of them - I wondered how many were left. Jeez, even when I knew they were running around pissed at me, I couldn't keep track of them.</p><p>\"Hey, think I'm gonna sit around on my ass while the fuckin' Fiends pop up without warning whenever they want? Who needs the pressure? Besides, I hate pop-ins. I hate this whole stupid situation.\" Except she appeared to be thriving on it.</p><p>\"So where is the dead guy who was in our foyer?\" I asked, gratefully accepting a glass of grapefruit juice from Tina. It wasn't nearly as good for me as Sinclair's blood, but I'd had enough from my husband to keep me going for a while. \"Not that I mind that he's gone.\"</p><p>\"The body,\" Sinclair said carefully, knowing how I felt about such icky things, \"is in the basement, in the walk-in freezer.\"</p><p>I shuddered, and juice slopped over the rim of my glass. Among other things, when the mansion had been modernized thirty years ago, the old owners had put in a giant freezer for entertaining. Luckily, we kept it empty. Most of the time.</p><p>\"We don't know if we will need access to the body again,\" Tina said apologetically. \"I staked it after you fell asleep, just to be sure.\"</p> <p>\"Do we know his real name?\" I wasn't expecting a good answer here, but I had to ask.</p><p>I got a pleasant surprise from Tina. \"Nick was here, and printed him. He's going to run it through privately - \"</p><p>\"Why privately?\"</p><p>Antonia gave me a \"you poor dumb bitch\" look, as Tina patiently explained, \"What if the dead man was born in 1910? And he looks like a man in his late thirties? That might bring up questions we would find awkward to answer.\"</p><p>\"Does Nick have enough juice to run prints - twice - without anybody else finding out?\"</p><p>\"We will see.\"</p><p>I had to be happy with that. I knew dick about police procedural. But if he was getting secret assignments from the chief, he probably had some clout.</p><p>\"Thank you for your assistance, Antonia,\" Sinclair said over my musings. \"We are grateful.\"</p> <p>\"Why do you think I beat feet to get back here from the Cape? You guys'd sit around and talk it to death. You need a werewolf to get shit done.\"</p><p>\"Are all werewolves as insufferable as you are?\" I asked sweetly, \"or are you a genetic anomaly?\"</p><p>Before she could answer, I looked around and said, \"Hey, where's Laura? I'd think she'd want to be in on all this stuff now that she knows what's going on.\"</p><p>\"She called while you were sleeping; she's teaching her church youth group tonight,\" Tina said with a barely repressed shudder.</p><p>\"Okay, how about Jess? She left me a sticky note.\"</p><p>\"You just missed her; she went to Detective Berry's house, complaining bitterly that it had been 'ages and ages' since they'd had some alone time.\"</p><p>\"Why didn't she just go with him?\"</p><p>\"Oh, it's kind of dumb. She doesn't like to be stuck at anybody's house without a getaway car. It's one of her things. But it's great that she gets to see him tonight... he must have the night off.\"</p><p>Tina was opening her laptop. \"Yes, yes, the poor deprived things. Let them stay gone for a month.\"</p><p>I was unwrapping a blue raspberry Blo-Pop. \"Tina,\" I said reproachfully, then popped it into my mouth and sucked enthusiastically.</p><p>\"Sorry, Majesty, you know I'm fond of Jessica. It's him I can't stand. And if he deliberately places you in harm's way once more, I may not be responsible for my actions.\"</p><p>\"You shush. Just check your e-mail.\"</p><p>\"Actually,\" she said, not looking up, \"I'm checking Nick's e-mail.\"</p><p>I nearly gagged on the sucker. \"Boo! Unless you've got a warrant. And vampires can't get warrants, I bet.\" I paused. \"Can we?\"</p><p>\"You're so adorably naive, I may vomit,\" my husband said from behind the Washington Post.</p><p>\"And you're so - \" My cell phone chirped \"Living Dead Girl\" and I snatched at it. I was sure it was my mom, bitching about baby duty. But there was no way BabyJon was coming back here until we - \"Hi, Mom?\"</p><p>\"It's Jessica!\" I winced and held the phone away from my ear. \"You've got to come, quick! All of you! Nick's gone, but the Fiends have been here!\"</p><p>\"Whoa, whoa, calm down.\" I was trying to take my own advice and not hyperventilate. \"How d'you know the Fiends took him?\"</p><p>\"Who else would break in and attack him? Please, please come right now! There's blood all over the place!\"</p><p>\"But - but - \" I was so panicked I couldn't think, much less speak. \"But why did they take Nick?\"</p><p>\"Because,\" Tina said, not looking up from her laptop, \"the fingerprints came back. Forensics notified him by e-mail, but he hasn't actually gotten this message yet, so they had to move fast. And so will we.\"</p><p>\"What? Why?\"</p><p>\"The Fiend's name was Edward Hamlin.\"</p><p>Hamlin? Why did I know that name? So much had been happening in a short time, I -</p><p>\"Nick has been working on a little project for Police Chief Hamlin,\" Tina added, helping me out.</p><p>\"We're coming!\" I shrieked into the cell, then snapped it shut so hard I broke it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nick lived in a great-looking bachelor pad in Minneapolis, overlooking the Mississippi River. The view was terrific, which made up for the fact that the yard was the size of a Post-it note, and just as yellow.</p><p>I'd never been there - luckily, Tina's laptop was stuffed with all sorts of interesting tidbits, including addresses she had no business knowing. She had MapQuested it, and here we all were.</p><p>Jessica had the place wide open for us, and I could see it was full of rich-guy toys: an extra truck, skis, a snowmobile, a Jetski. And that was just the garage. The house itself was brick, with dark green trim and a short, crack-free driveway.</p><p>Inside, the place was a complete shambles - we could practically follow the progress of the fight by observing the broken furniture and shattered glassware. He clearly hadn't gotten to his gun, which was too bad for him. I couldn't blame him - he'd been relaxing at home, getting ready for a date with Jessica, with no way of knowing his boss, the chief of police, had fed him to the wolves - almost literally.</p> <p>Jessica was waiting for us in the living room, which looked like a bomb had detonated from beneath the carpet. He might not have had his gun, but he'd put up a helluva fight. It made me remember why I'd liked him a couple of years ago.</p><p>\"Ballsy bastard,\" was Antonia's comment.</p><p>FALSE QUEEN was written on the biggest wall, the one without any windows. Sinclair leaned close, sniffed, then reported quietly, \"Detective Berry's blood.\"</p><p>\"But not so much that he's dead, right?\" Jessica begged. \"Not enough to kill him, right?\"</p><p>Sinclair put an arm around my trembling friend. \"No, dear one. Not nearly enough.\"</p> <p>\"She cannot go,\" Tina said firmly.</p><p>\"Indeed, no.\"</p><p>\"What are you two talking about?\" I tried to keep my voice low and authoritative, when it wanted to go high and squeaky.</p><p>Tina shook her head, but Sinclair came right out with it. \"This is an ancient challenge among vampires - \"</p><p>\"So how do Fiends who have been out of it for six decades know anything about it?\" I asked, trying not to sound hysterical.</p><p>\"It's important to keep in mind they are remembering more and more every day - and in fact may have lied to us about what they do remember, at any rate.\" Sinclair glanced at the bloody letters again. \"Regardless of how they know, they know. Such a step is usually taken to settle a grudge or, occasionally, determine ability to rule. This message means that if you value your crown, you will rescue Nick and defeat the Fiends.\"</p> <p>\"But how would I even know where to - \"</p><p>\"He'll be where it began for them,\" Garrett said quietly. I jumped; he hadn't said a word since we'd left the mansion.</p><p>\"Nostro's house,\" Tina added.</p><p>\"Well, then, I'm outta here!\"</p><p>Cue huge squabble fest. Not even Jessica was sure I should go, and, needless to say, Tina and Sinclair weren't keen on the idea at all. Antonia was practically foaming at the mouth to come with me; she'd had a taste of Fiend already and didn't mind getting wet. I had a momentary flash - thank goodness Laura had her youth group tonight; she'd just be one more person trying to stop me.</p><p>Don't get me wrong, I sure as shit didn't want to go. I predicted a messy death and Nick's curses being the last thing I ever heard in this life. But, like it (I didn't) or not, I was the queen. Did I think a hideous mistake had been made somewhere along the way? You bet. Was I going to welsh out of my obligation? Never in life. (Or death, I s'pose.)</p><p>The rules were, I go alone. So, I go alone. Besides, the Fiends would spot the others, and then they'd play kickball with Nick's head. How could I face my best friend if I got her lover killed 'cause I was too chickenshit to show up alone?</p><p>\" - absolutely out of the question - \"</p> <p>\" - but she's the only one who - \"</p><p>\" - can't leave Nick to - \"</p><p>\" - not open for discussion, as far as I am concerned - \"</p><p>\" - her responsibility - \"</p><p>\" - not going to let her essentially commit suicide - \"</p><p>The argument was escalating in both intensity and volume (I noticed no one was much interested in my opinion), and there was no time, Goddammit, no time at all.</p><p>\"Shut up, shut up, shut the fuck up! We have no time, don't you get it? Now I'm going.\"</p><p>\"Not at all,\" Sinclair said calmly.</p><p>\"Tradition dictates she do exactly that,\" Tina said reluctantly, correcting her sovereign for maybe the fourth time in eighty years - a real toughie for her, since she wasn't too keen on me going in the first place.</p><p>\"They'll kill you!\" Jessica cried.</p><p>\"Yes,\" Garrett said. \"They will.\"</p><p>\"The fuck they will! They can't take the king and queen and a fellow Fiend and me. We'll eat 'em for dinner! Let's go! Right now!\" And I noticed an odd thing; all the fine hairs on Antonia's arms were standing straight up. If she'd been in her wolf form, she'd be bristling all over.</p><p>\"We had practically the same group the first time the Fiends came, and we ran away,\" Jessica said. \"What's changed?\"</p><p>\"A challenge written in your lover's blood,\" Sinclair said, kindly enough.</p><p>\"Come on, you chickenshits!\" Antonia barked. \"We can take those fuckers.\"</p><p>\"Maybe. And then Nick will be fish food,\" Tina said, biting her lip.</p><p>\"My alpha's not going alone, and that's how it is!\"</p><p>\"Shut up, Antonia, all of you shut up! Just - shut up!\" My head was pounding, like it was going to split down the middle of my forehead; I was clutching my temples and wondering why it was so damned hot in here. It seemed like the heat was battering at me, trying to get in, and all at once I dropped my hands and let it, let it all in, let it burn me alive.</p><p>Instantly, the room went quiet, a quiet broken by the thuds of my friend's bodies hitting the floor. I stood over them, shocked. Knelt quickly and found Jessica's pulse, realized Tina and Sinclair were as alive as they could be, just unconscious. Antonia, too, was out cold - and so was Garrett. I was the only one still standing.</p><p>And I felt like a million bucks. I felt like I could jump across the Mississippi. And I loved the sudden peace and quiet - I could finally hear myself think. I felt almost - what was the word? Euphoric. Yeah. I felt - I felt an awful lot like the way I'd felt when I'd sucked Marjorie dry, only not so frenzied and out of control.</p><p>I'd done it again! The chill in my bones subsided as I realized I had not killed anyone this time. In fact, they were safe and sleeping and, did I mention, safe? How did that work? Was it something I could control? If I didn't, what did?</p><p>I had no more time to think about it. If any of my friends woke up while I was still here, the trick I'd pulled (can I call it a \"trick\"?) would have been for nothing. Knowing exactly where I had to go, I got the hell out of there, casting a last guilty look at my unconscious husband.</p><p>No sex tonight, that was for sure. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After borrowing (okay, stealing) Sinclair's Lexus SUV, I made the trip in less than half an hour. Nostro's old digs were a combination of farm and what Jessica called a McMansion. Most of the houses in the neighborhood, while in the low seven-figure range, still looked a lot alike. They came with your standard pool, your standard half-acre backyard, your standard ballroom.</p><p>For an extra five figures, you could get either a gazebo, or a chicken coop. \"Wholesome country living with the convenience of city living,\" that's what the brochure said. I knew, because my dad and the Ant had lived in one. It had been left to BabyJon, along with all their dough and the condo in Florida; some lawyer I'd only met once was keeping everything in a trust for him.</p><p>The McMansion was brown, with cream-colored fake shutters (what exactly was the point of shutters that didn't open or close, anyway?) and a big, crimson-colored front door. The walkway and patio were brick; the grass was starting to get a little shaggy. There was a tall hedge that went around the side of the house that I could see, and a few baby trees in the front yard. In a hundred years they'd be gorgeous elms. It was weird to think that I might be around to actually see that.</p><p>I brazenly parked on the front lawn (yeah, that's right, the queen of the vampires is here!), giving thanks that the nearest neighbor was on the other side of the lake.</p> <p>I walked up the sidewalk and knocked on Nostro's front door, remembering the last time I'd been dragged through this very door. I'd been a vampire for about two days, no idea what was going on (as opposed to, you know, now), and almost before I knew it, people were bowing and calling me queen. It had been more bizarre than senior prom.</p><p>Nobody answered, so I tried the knob - unlocked. Ah, a welcoming killer mob. Good times.</p><p>I knew my way around a little, but proceeded cautiously. Frankly, tracking them in the bland-smelling house was pretty easy - even from a floor away I could smell their reek.</p><p>I passed a sitting room, a library, a bathroom, two bedrooms, and an office on the way. Unlike our mansion, the McMansion had much larger rooms (older houses tended to have tons of little rooms).</p><p>In fact, the place seemed too big and rather empty; there was dust on a lot of the tables and countertops. Of course, Alice had been the only one staying here... before she was killed and dismembered, the poor girl...</p> <p>There weren't any paintings or pictures on the walls and, weirder, no books. No books anywhere. The bookcases held wine bottles and lamps that looked old-fashioned but operated on electricity. No magazines, even.</p><p>At least all the lights were on, which made the whole thing seem less scary - I don't know why. I sure as shit knew that things went bump in the night even with all the lights on.</p><p>The carpet was so thick in each room that my footsteps made no noise, but I didn't much care, because I wasn't trying to sneak in. Instead I walked straight into the upstairs living room and was greeted with, \"Who the hell invited you, blondie?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>l blinked, more than a little surprised. Mostly at the fact that there was an upstairs living room; I'd never seen that before. Just more proof of Nostro's essential nuttiness. And I'd had more pleasant greetings. Shoot, the IRS guy had been nicer.</p><p>Focus, Betsy!</p><p>A bloody and battered Nick was slumped in a dining room chair. There was a row of floor-to-ceiling windows behind him and, weirdly, three of them were open. There was quite the breeze whipping through the room - I guess the Fiends, used to living outside, didn't much notice the cold.</p><p>Then I remembered that they'd been kept outside all year round, like dogs you didn't mind having around but didn't want to spend much time with, either.</p> <p>They ripped up anything they got near; it's not like they were aware enough to sleep in beds, or even on a carpeted floor. You're acting like they were POWs and you were a Viet Cong!</p><p>Nick wasn't tied to the chair or anything - why would they? But he sure was pissed.</p><p>\"Well, uh, they sort of did,\" I answered, gesturing to the Fiends. \"Invited me, I mean.\"</p><p>\"You just had to come and save the day, didn't you?\"</p><p>\"Alone,\" one of the Fiends said - it was Stephanie, and she wasn't bothering to hide her surprise. \"She came alone.\"</p> <p>\"Of course I came! What, you think I'd stop for cocktails instead?\" The Fiends stared at me, unblinking, while I bragged, \"You have no idea who you're dealing with.\" Okay, to be fair to them, I had no idea who they were dealing with. \"You think you can get what you want by grabbing my friend - \"</p><p>\"I'm not your friend,\" Nick whined.</p><p>\"Fine, you grabbed my best friend's boyfriend, and now you think you're going to get what you want. But you don't even know what you want, do you?\"</p><p>The Fiends looked at each other, while Nick, looking thoroughly disgusted to be there, rolled his eyes.</p><p>I examined them as closely as I could without making it obvious I was staring. Happy, Jane, and Clara looked a little better - something in the eyes, I guess. They didn't seem as savage or as confused.</p><p>Wonder of wonders, although they didn't appear to have showered, they were at least wearing clean clothes. It occurred to me that the bedrooms in the McMansion probably still had dressers with clothes in them. And these guys had eventually fed enough, or remembered enough, to realize that.</p> <p>Jane had long, dirty blond hair - it hung halfway down her back in greasy strings. Her mouth was a thin line, and her fingernails were filthy, but, incongruously with the rest of her, she had bright blue eyes, definitely her best feature.</p><p>Clara and Happy also had long hair but of course Happy, being a guy, towered over them both. He was one of those fellas who are so big they slump to try to look smaller, which only drew attention to his sheer bulk.</p><p>Happy had the tip-tilted eyes of an Asian American and would have been pretty good looking, if not for the hate-filled expression on his face. His jeans and shirt were clean, but he needed to wash the dried blood off his chin.</p><p>I wondered if anything was driving the Fiends now besides hate for me.</p><p>\"Look, guys, let's talk about this. I think there's been enough killing, don't you?\"</p><p>\"No,\" Happy said.</p><p>\"Because this could get a lot worse, you know. Before it gets better.\"</p><p>\"It will never be better,\" Clara - also known as Stephanie, but I wasn't going to let on - said sadly. \"I thought maybe - \" She cut herself off, and I knew why. Even now, she couldn't let on to what she had been up to earlier. She was as much a prisoner as Nick. \"Not ever.\"</p> <p>\"Then what's your goal?\"</p><p>\"You must pay for what you've done,\" Jane said.</p><p>\"Pay as in kill? I didn't kill you, I didn't make you vampires and starve you - I tried to help you. You know what your problem is? The one you really want to hurt is dead. Nostro's out of your reach, and you can't fucking stand it.\"</p><p>\"Stated with Kissingerian diplomacy,\" Nick snarked.</p><p>\"Quiet, Chair Boy. Look, I'll apologize again, okay?\"</p><p>\"No,\" Happy said.</p><p>\"Then what do you want? You want to go back in time? Because that's the only way to - wait.\" I thought for a second. And then another one.</p><p>I thought about Jessica, and how much she loved Nick. I thought about these Fiends, and the lives they had before they became my subjects - yes, my subjects. And even if the old king, Nostro, had done this to them, I was still responsible for them.</p><p>So what would a queen do, for her subjects? What kind of queen did I want to be?</p><p>\"Okay. Let Nick go, and I'll stay, and you can have at me.\"</p><p>The three Fiends glanced at each other.</p><p>\"Maim, kill, fold, spindle, mutilate. Whatever. Just let Nick go.\"</p><p>\"You offer yourself in his place?\" Stephanie/Clara seemed genuinely shocked by the offer.</p><p>\"Yup.\"</p><p>\"This is not a trick?\"</p><p>\"Uh, I don't think so.\"</p><p>\"You are not setting a trap?\"</p><p>I lifted my bare hands. \"If this were a trap, wouldn't I have sprung it by now? I'm here alone. I'm not here to trick you. I don't want to kill you. I want you to get better. If the only way you can get better is to deal with me alone, then this is your chance. So what the hell are you waiting for?\"</p><p>Happy moved in and sniffed the air around me. \"You are serious.\"</p><p>I made an effort not to lean away from him; yeesh, he stank. \"Yes.\"</p><p>\"It may be painful.\"</p><p>\"It might be.\" I tried not to shake. I tried to sound brave. I guess I didn't, though, because he almost smiled.</p><p>\"We give you no guarantees,\" he warned. \"We may come after your friend here, anyway, after you're gone.\"</p><p>I thought of Sinclair. \"My friend,\" I sighed, \"will be the least of your problems, if you kill me.\"</p><p>\"We are afraid of no one. Not even our queen.\"</p><p>I shrugged. \"Obviously not.\"</p><p>Happy looked over his stooped shoulders at the other two. They gave no sign, but he seemed to understand them anyway.</p><p>\"We accept. Your friend can go.\"</p><p>\"No fucking way!\"</p><p>The four of us stared at Nick.</p><p>\"Oh no you don't,\" he hollered, white-faced with blood loss. \"You don't get to save me, no way, uh-uh. They kill me, and you feel like shit for, what is it? A thousand years? That's the way it's supposed to be. You're supposed to live with failure, not be the hero. Hear that? You're not the hero, Betsy Taylor! So hit the bricks! Get lost! Crawl back into your mansion basement and hide again!\"</p><p>\"He does not want to go,\" Happy observed after a short silence.</p><p>\"Yeah, no shit.\"</p><p>\"Are you sure you wish to take his place?\"</p><p>\"I'm having second thoughts,\" I admitted grimly.</p><p>\"Perhaps he is not the friend to her we thought he was,\" Stephanie told the others.</p><p>\"Damn right we're not friends!\" Nick hollered.</p><p>\"Will you stop screaming? And no,\" I sighed. \"We used to be, sort of, but no, not anymore. But the offer still stands. Let him go, and I'll stick around, and we'll see what we'll see.\"</p><p>\"I have doubts,\" Stephanie told her comrades. Aha! I silently congratulated myself for stopping Sinclair and Tina from killing her.</p><p>\"What d'you mean?\" Jane asked. Happy looked like he was wondering the same thing. Both of them had a little suspicion in their eyes, and I prayed Stephanie would be careful with her next words, so she wouldn't give herself away.</p><p>\"She is not what we expected.\" Stephanie circled me and Nick. \"Nothing about her. Not her friends, not those she calls her friends but are not - \" She stopped and sniffed Nick, who made a batting motion at her with his hands, like he was shooing away a fly. \"She is not the queen we thought. She is not smart, or powerful, or terrifying. Not like a real queen.\"</p><p>\"More like a commoner,\" Happy added.</p><p>\"Thanks?\" I called out.</p><p>\"She might help us,\" Stephanie added.</p><p>\"How?\" Jane asked, shaking tangled hair out of her face. \"If she is not like a real queen, what can she give us?\"</p><p>\"We could start with your names,\" I suggested, still hoping to avoid hostilities. \"I'd like to know them.\"</p><p>My request confused them, until Stephanie cleared her throat. \"My name is Stephanie,\" she told me, as if for the first time.</p><p>Happy licked his lips. His tongue was weirdly long. \"Richard,\" he finally said.</p><p>\"Jane,\" the third one said.</p><p>Huh, I told myself. Jane's name is actually Jane! What are the chances? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>l took a shallow breath and let it out. Okay. Things were going - if not exactly well, at least it wasn't the disaster on wheels I'd been envisioning five minutes ago. Names were a good start. Now to keep the lines of communication open.</p><p>\"Stephanie. Richard. Jane. I... well, I can't say it's wonderful to meet all of you, just like I know you weren't exactly thrilled about meeting me. But I can say I'm glad I've learned who you really are. I, uh, felt bad about the silly nicknames.\"</p><p>\"You did?\" Jane asked, open skepticism in her voice.</p><p>\"Well, sure. See, I - \"</p> <p>\"Don't be fooled!\" Nick warned them. \"She's got this annoying weird charm thing going on. It's hideous. Like head lice. Everything she touches turns to shit.\"</p><p>\"Would that include Jessica?\" I snapped.</p><p>\"Well,\" he snarled, \"she didn't have cancer before she moved in with you and a bunch of other mutant bloodsucking freaks.\"</p><p>I didn't even want to respond to that. Emotionally exhausted, I sat on the arm of the couch next to him and waited to see what the Fiends would do.</p><p>And for the first time, I noticed Nick was bleeding - from the inside of his elbows, his neck. There were more serious cuts up and down his arms - from the fight at his house, I assumed. Maybe he'd rolled on some of the broken glass on the carpet? Maybe he'd -</p> <p>Oh, God, his neck. They'd - they'd fed on him while waiting for me. His skin must still be crawling.</p><p>I imagine he felt raped and suddenly couldn't look at him.</p><p>\"We have to deal with this one before we do anything else,\" Richard said, hauling Nick out of the chair. \"They don't care for each other, so he's officially become useless.\"</p><p>\"Useless?\" Nick yelped, outraged.</p><p>\"Hey, a minute ago you were ready to die just to make me feel like shit for the next thousand years. Now you're all mystified because you might be executed? \"</p><p>\"We should kill him,\" Richard decided.</p> <p>\"What about the queen?\" Stephanie asked, looking around nervously as if the queen's guard was going to burst out of the walls at any moment. Ha! If only. I could use a last-minute rescue. Dammit, why, why wasn't my life more like a movie?</p><p>Richard squinted at me, and I got a decidedly distrustful vibe from him. \"We should kill her anyway.\"</p><p>Then I got a stroke of real luck. Nick tried to pull away from Richard and briefly succeeded, separating himself for a bare second from his supernaturally strong grasp. Quick as thought, I stood up, snatched Nick by the back of his neck and the seat of his pants, and tossed him out the bank of windows.</p><p>\"You biiiiiiiitch,\" he yowled all the way down. Then, thank God, I heard him cursing as he thrashed around in the hedges.</p><p>\"She lies!\" Jane shrieked, and came at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>God, I was so sick of people just launching themselves at me without warning. Big-time rude, not to mention hell on my nerves. I backpedaled like mad, physically and verbally.</p><p>\"I didn't do anything to - \"</p><p>Her fist was a blur, and I took a teeth-rattling punch in the mouth, which wasn't fun at all, and threw an elbow into Richard's throat before he could do the same.</p><p>I chastised myself immediately: I was fighting like a human, but Fiends didn't need to breathe. He did cough and grab his throat, which I figured was good enough, so I turned my back on him, seized Jane by the hair, and spun her across the room.</p> <p>Richard recovered faster than I expected. He delivered a blow to my right kidney, which hurt - oh, man, getting punched in the back was no fun at all - and then delivered a roundhouse kick to my left kidney, which hurt even more.</p><p>\"You told us you would not try to trick us!\" he seethed, hurting me some more with his fists. Kick, kick. Stomp. Best I could tell, Richard was apparently quite the kickboxing champion in his former life. \"You swore!\"</p><p>\"I said,\" I gasped between blows, \"that after Nick left... ooof... I would let you have at me. Feels like... ow, ow, oh God ow! . . . I'm keeping my end of the bargain. Shame... aggh!... you couldn't keep yours.\"</p><p>\"My end of the bargain,\" he hissed in my ear, \"is to survive. That's all you taught me to do.\"</p><p>The fire inside me kindled, and I felt a surge of power, as something made Richard stagger back. It didn't knock him unconscious, much less kill him, but it did give me enough space to get up and straighten myself to my full height.</p> <p>And yes, I was still wearing my Marc Jacobs heels, which helped.</p><p>\"Maybe you're not as good a student as you think.\" I couldn't help the disdain in my voice, though normally I tried not to sound like such a snob. What was wrong with this man? His queen had spared his life from the wrath of her husband, offered an apology, reached her hand out in friendship - and he had slapped it down?</p><p>What was wrong with him? Who the fuck did he think he was?!</p><p>My blood ran super-hot again, and he shrieked as if I had struck him. Again, he seemed too strong to suffer worse than a blow - or maybe the fact that he shared my blood spared him from the worst I had to offer - but it didn't matter. His kickboxing career was over.</p><p>\"On your knees!\" I snarled at him. When he didn't move, I ignited my blood again - yes, I think I was controlling it now, at least somewhat - and made him get down. And I won't lie. I wouldn't deny it felt good to see him submit. To make him submit.</p><p>I turned long enough to ensure that Stephanie and Jane were not coming at me - they weren't, since they, too, were on their knees - and then I gave Richard my full attention again.</p> <p>Nick's chair had been upturned in the fracas; I reached down and snapped a leg off the bottom. \"You and I will come to terms of peace,\" I suggested, \"or you will die.\" A dim thought that this wasn't exactly the best way to enforce peace was immediately shoved to the back of my brain.</p><p>Richard's body was beaten, but his eyes were still full of defiance and distrust. \"I see your true colors. No peace, my queen.\"</p><p>\"My true colors. My true colors!\" I felt my fangs spring from my gums and resisted the urge to bite him on the face. I raised the stake and brought it down faster than he could possibly move...</p><p>... right into his throat.</p><p>I don't know what made me miss his heart. Maybe it was poor aim - swinging a stake in lavender pumps is harder than it looks. Maybe the part of me that wanted him dead wasn't as strong as the part of me that just wanted him to shut the hell up.</p><p>Pulling the bloody stake from his throat, I turned to the others, who were still (willingly) on their knees. His body made a soft thump on the plush carpet behind me. Yes, he'd be out of action for hours. \"And now, what to do with you two,\" I said grimly, hands on hips. Richard's black blood dripped slowly onto my - oh no! - Ann Taylor linen pants. I quickly rearranged the stake.</p><p>\"I, um, think we should let her go,\" Stephanie managed with her head down.</p><p>\"Perhaps there can be... forgiveness,\" Jane said, also not looking up.</p> <p>\"Maybe,\" I agreed. \"I guess that'th up to each of you.\"</p><p>\"What?\"</p><p>\"Never mind.\" This was no time to let the Fiends know that I lisped whenever my fangs came out. It wouldn't exactly strike terror in their heart of hearts.</p><p>I could hear the squeal of brakes outside the windows, familiar voices, the front door opening, and pounding footfalls.</p><p>\"In the thort time we have left alone together,\" I suggested, \"you two thould probably do everything you can to look ath - as - unthreatening as you possibly can.\" Thank God, my fangs were retracting. I was still pretty thirsty, but it would appear that the energy I'd gotten from my family, as well as from Richard, were keeping the worst of the pangs away. \"Because if you think I'm bad? You should see my husband in action.\"</p><p>They swarmed into the room like a pack of wolverines. I relaxed, smiled at the first face I saw, and felt some of the fire leave my blood.</p><p>\"Don't you bitches touch - oh.\" Antonia skidded to a halt, then nearly went sprawling, as Sinclair almost ran her down. \"Oomph! Um, we're here to save you.\"</p><p>\"Go save Nick,\" I suggested. \"He's in the bushes on this side of the house.\"</p><p>\"You will pay for - oh,\" Sinclair said, straightening as he took in the three prostrate forms around me. The others piled in behind him and did the same. \"Hmm.\"</p><p>\"Yeah, so, thanks for showing up, but I took care of things. Pretty much. Of course, in the last week you guys whittled down their numbers for me. That was,\" I decided, \"a big help.\"</p><p>Tina and Antonia each nodded. Garrett, hiding behind Antonia, swallowed with what looked like a mixture of relief and lingering fear. He tried a shy smile, and I smiled back.</p><p>\"Stake 'em all!\" Nick hollered, limping through the doorway and waving his arms like the Winter Carnival grand marshal. \"Betsy, too!\"</p><p>Jessica rushed to Nick, clearly relieved that he was unharmed (well, it was possible he had a sprained ankle, and that was a helluva scratch on his forehead... and he seemed to be favoring the ribs on his left side... ).</p><p>\"Agreed,\" Sinclair said, sighing at the three Fiends. \"Well, not agreed about my wife. But the others must die now. In fact, it is long overdue.\"</p><p>\"As you wish.\" Tina pulled out a thin mahogany stake from somewhere within her navy blue wool sweater and skirt set (truly frightening efficiency), and stepped forward.</p><p>\"Forget it!\" I said, holding up my hands. \"We are going to be magnanimous in victory.\"</p><p>\"Magnanimous equals pussy,\" Antonia commented.</p><p>\"Again?\" Tina whined. \"We're going to let them live again?\"</p><p>\"Elizabeth, they are too dangerous to simply - \"</p><p>\"I didn't say we were going to set them free. They'll have to earn their freedom.\" I turned to the three Fiends - well, okay, the two that were conscious. \"You had a grievance with me. You should have stuck with me. Had all seven of you done that, seven of you might be alive now. I'd like it if you three, at least, stayed alive. It's up to you.\"</p><p>\"What - \" Stephanie swallowed, then tried again. \"What do we have to do?\"</p><p>\"You guys can be the queen's personal bodyguards and doers of annoying chores. Or I can leave the room, right now, and my husband and friends will chat with you. A lot. Until you have cavernous facial wounds.\" I tilted my head toward the exit and not coincidentally to the people who would stay behind. \"Your choice.\"</p><p>\"Pick the stake,\" Nick suggested, wiping streaks of blood from his face. God, that made me even hungrier. And wouldn't he just shit? \"You don't want to spend the next thousand years doing that twit's dirty work.\" He turned to me. \"You almost killed me, you numb fucking twat! Again!\"</p><p>\"I did not! I saved you.\"</p><p>\"You threw me out a fucking window!\" Nick was actually going purple with rage.</p><p>I tried to hide my amazement. Unlike occurs in the movies, Nick clearly hadn't suddenly forgiven me and been warmed by my selfless act. We weren't going to ride off into the sunset together (so to speak) and get Blizzards from Dairy Queen.</p><p>Frankly, I didn't get it. In the movies, when the heroine did something heroic and cool, everybody loved her at the end. Okay, I didn't really expect life to be like the movies... uh. That was maybe a lie.</p><p>\"You are a menace, and if I could make it stick, I'd throw your ass in jail for the next hundred years.\"</p><p>\"Nicholas J. Berry!\" Jessica gasped. \"What is the matter with you?\"</p><p>\"With me? You should have seen this psycho bitch in action.\"</p><p>\"That is enough,\" she snarled, hands on scrawny hips. \"When are you going to get it through your head that Betsy isn't the cause of all your problems?\"</p><p>I was frantically trying to signal to Jessica, making a slashing motion across my throat, the universal gesture for \"shush!\" Although it made me sad, I felt Nick's rage was a perfectly appropriate reaction to the evening's festivities. I appreciated Jessica sticking up for me - she always stuck up for me - but she didn't have all the facts.</p><p>He had been attacked. Again. Violated by vampires... again. I was amazed he hadn't gone fetal in the hedges.</p><p>\"How many times do I have to say it,\" Jessica was saying. \"How many times do you have to see it? She's a good guy!\"</p><p>\"No, Jess, it's okay, he - \"</p><p>\"She drinks blood, because she's dead,\" he said, spitting on the floor - spitting blood, I might add, and I was ashamed, because my fangs were out again. I didn't dare speak anymore; I didn't want him to know I wanted to drink and drink and drink. \"She's a killer, and you know it.\"</p><p>\"I love her, she's the sister I never got, and you know that.\"</p><p>\"Ah, perhaps we could, ah, step into another room and discuss, ah, the new terms for surrender,\" Tina said, because even the Fiends looked uncomfortable to be witnessing the lovers' quarrel.</p><p>\"Or maybe you could talk about this later, when everybody's calmed down,\" I tried.</p><p>\"Don't make me choose,\" Jessica warned, ignoring us. For her, the only person in the room was Nick.</p><p>\"I'm not making you choose. I'm choosing. We're done.\" He wiped his face again, and we all pretended not to notice how his hand shook and how he couldn't look at her.</p><p>\"That's right,\" Jessica replied coolly. \"We are.\"</p><p>And just like that - it was over. They were over. We could all practically hear the snap. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Stephanie and Jane were sullen, but agreeable - apparently being the doers of the queen's scut work was more appealing than being staked.</p><p>I gave them permission to live on Nostro's property (by vampire law, when you killed a vampire all his stuff came to you, so technically, it was my property), and they agreed to be at my beck and call, as it were.</p><p>I'd probably put at least one of them to work in my nightclub, Scratch. Another vampire property that had come to me by law - long story. Actually, that wasn't true. I had killed another badass vampire, and her property went to me about the time her soul went shrieking into Hell.</p><p>Unlike their lives before, the Fiends wouldn't just frolic in the moonlight like undead puppies, but they'd live and read and watch TV like real people... which should be fun, since for all I knew Jane and Stephanie had no idea what a TV was.</p> <p>They could feed on each other - if they were comfortable with that - or they could snack on bad guys. We would help them figure out who it was all right to bite and who was off-limits. Yep, they could make new lives for themselves, be almost like normal people.</p><p>Unless I needed them, of course. Then they'd come on the run, or I'd know the reason why. Shit, with all the bad guys popping out of the woodwork these days, I needed bodyguards.</p><p>Of course, we weren't going to just leave them to their own devices... Sinclair and I would have to think about who could keep an eye on them, maybe even live in the McMansion with them. For now, they were cowed enough by recent events that I felt safe leaving them there for the next few nights.</p><p>\"That was pretty anticlimactic,\" Antonia bitched on our way out.</p><p>\"What can I say? It can't be bloody revenge and near-death experiences every day.\"</p> <p>\"You're about to have a near-death experience,\" Sinclair promised grimly as we climbed into his Lexus (I noticed Nick's truck was also there and deduced they'd grabbed it when they woke up at his house after I'd put the whammy on them). \"Specifically, you will never, ever sucker punch me like that again and run off into mortal danger.\"</p><p>\"I didn't do it on purpose.\" Not quite a lie.</p><p>\"Irrelevant.\"</p><p>\"I'm not getting laid tonight, am I?\"</p><p>\"Probably not.\"</p><p>I batted my eyes. \"What if I let you punish me?\"</p> <p>He paused, and his step actually faltered; I imagine he was thinking about my drawer full of scarves and our four-poster bed. Then he straightened up and went back to being Sir Pissypants. \"Do not change the subject. You must promise to never, ever - \"</p><p>\"I won't!\" Strangely, I felt my blood start to heat up again. And I won't do that again, either. At least not right now. Who knew if my friends could take it again? Besides, I really had no right to their - their life essence, maybe? Whatever it was that I could feed on without touching them. It wasn't mine. And I wasn't a thief.</p><p>With that in mind, I struggled to hold my temper, something I wasn't especially good at. \"Sinclair, enough with the promises to stay safe and hidden from the world. It didn't suit me when I was alive, and I certainly can't comply now.\"</p><p>\"I will not tolerate - \"</p><p>\"Are you listening, schmuck? You almost died this summer. Had I acted then like you wanted me to act this time, what would have happened? You'd be a pile of fucking ash, and you'd still be full of shit!\"</p><p>\"Aw, that's romantic,\" Antonia piped up.</p><p>\"Damn right it is.\" I turned back to my idiot husband. \"I love your arrogant ass, numbnuts, and I'm not going through something like this summer ever again. Besides, there are going to be times when we'll have to deal with problems alone... I mean, jeez. If I can figure that out, you can, too. You're just going to have to get used to the idea.\"</p><p>He sighed, and I could tell he wanted to smile at me but was forcing himself to remain stone-faced. The better to intimidate you with, my dear. Too bad it didn't work on me. Never had. \"I love your arrogant ass as well, my own, but I meant every word I said, and you will mind me, Elizabeth. In this one thing, you will mind me.\"</p> <p>\"Fuck you, lover. I'm the queen, and I'll do as I please.\"</p><p>\"I am the husband, and you will do as you're told.\"</p><p>\"Hi, I'm Betsy. Nice to meet you.\"</p><p>\"Do not sass me.\"</p><p>\"Do not piss me off.\"</p><p>He stomped his foot. Actually stomped it (clad in a Kenneth Cole loafer), like a kid having a tantrum. I managed not to laugh. Just barely. \"This argument is over!\"</p><p>I stomped my heel, nearly staggering - damned vampire strength! If I ruined these pumps I'd never forgive myself. \"You're fucking right it is. Go suck on a turnip.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We got out of the car, still not talking to each other. Even more awkward, Jessica and Nick had tagged along in his truck - I would have thought he'd had enough of me for a lifetime, but there wasn't room in Sinclair's SUV for me, Sinclair, Antonia, Garrett, and Jessica. Is there anything worse than being trapped in a car immediately after you've just broken up with your boyfriend? Eeesh.</p><p>Worst of all, the Ant was waiting for me on the porch, knockoff-clad toe tapping impatiently. \"It's not over yet,\" she warned.</p><p>\"Tell me about it,\" I snarled. \"It'll never be over, until you cough up why you're sticking around.\" I walked through her, shivering (it was like walking through a curtain of freezing water) and opened our front door. \"Why can't you go to hell like any other - \"</p><p>Suddenly I was shoved so hard, I smacked into the wall and fell down. The impact forced a shower of plaster to rain down on me. There was the deafening boom of a pistol being fired several times over my head. We were trapped in the doorway like ants in a straw - nobody had any room.</p> <p>\"That girl,\" a new voice said, \"had amazing reflexes. I haven't missed a shot in forty-six years.\"</p><p>\"Chief Hamlin?\" Nick asked, horrified.</p><p>I slowly sat up. The Minneapolis police chief, less than a year from retirement, was standing at the end of the foyer, smoke curling up from the barrel of his pistol. He was a tall, gray-haired man in a neat dark blue suit, with wrinkles cutting deeply into his face, kind blue eyes, and a smoking gun.</p><p>\"My father told me about you over three weeks ago,\" he said to (ulp) me. \"How you left him for dead on that God-awful farm.\"</p><p>\"Wh-what are you - ?\"</p> <p>\"I was just a boy when he disappeared - and died the first time, best I can tell. By the time he came back years later - last month, in fact - I was a police chief.\"</p><p>\"But I don't understand why you - \"</p><p>He was staring at me with exhausted eyes. \"You were all he could think of. He was the gentlest man I'd ever known, and all he could think of was hurting people. Hurting you.\"</p><p>\"So you set him to work,\" Nick said shakily. \"You sicced him on perps we couldn't put away. Pretended to figure out the pattern - which I bought, because you've got a great rep as a detective. Gave your dad cold guns, so we wouldn't think it was a vampire.\"</p><p>\"But these guys had a caretaker at the farm/mansion place.\" I was having a terrible time puzzling this out. \"She never noticed your dad kept slipping off the property?\"</p><p>\"Silly boy. They killed her a month ago.\"</p> <p>That explained why Tina and Sinclair couldn't puzzle out Alice's remains. They hadn't been fresh. And it was entirely possible they had known and kept the info to themselves. It would be typical behavior. I bit the inside of my cheeks, so I wouldn't start shrieking at them.</p><p>Secrets, secrets. Cripes. My life was stuffed with them.</p><p>\"Jeez, jeez,\" Nick was saying, his hand on his hip. I could see his fingers wanted to pluck at a gun he wasn't wearing. \"Your only mistake was sending him to me when you gave me the fake tags to check.\"</p><p>Chief Hamlin shook his head. \"I didn't send him. He had been following your Betsy. And when he saw her on the street - \"</p><p>\"He snapped, and - \" I almost said, \"My sister killed him,\" but rapidly rephrased. I didn't want any of this fallout to poison Laura's life. \"I killed him. But you didn't count on Nick getting his fingerprints off my purse strap. Once he had that info, it wouldn't have taken long until he knocked on your door.\"</p><p>The chief's lip trembled. \"He was my father. He would not have hurt me.\"</p><p>I shook my head. \"Oh, man, you're so wrong. Like, the earth is flat kind of wrong. I don't even know how to explain it to you. You don't understand what he had become.\"</p><p>\"He was my father,\" the chief repeated. It was clear he was trying to convince himself, more than anyone else. \"Back - miraculously - from the dead. And only I could help him.\" He shuddered at whatever memories of his father he had and looked past my shoulder. \"A shame about your friend. I've never seen anyone move that fast in my life.\"</p> <p>I didn't dare turn to find out whom he was talking about. \"She'll be okay,\" I said bravely, hoping that was true. \"And you won't get a second chance.\"</p><p>\"No,\" he said politely. \"She won't be okay. I used twenty-two longs, you see. But you're right about me. I won't get a second chance. I have only the one gun, you see - and by my count, one bullet left. I figured I'd never get the chance to reload, given the size of your entourage.\" He looked down at his gun. \"I wish I had hit you and finished what my father started. I'll have to settle for hurting you. I hope your friend was important to you. Very, very important.\"</p><p>I still refused to turn around. Tears began to well in my eyes. \"You're going to regret what you've done, asshole.\"</p><p>\"No, I'm not. I have no intention of letting you turn me into what my father was.\"</p><p>Then he tucked the barrel under his chin and pulled the trigger.</p><p>Nobody tried to stop him. In fact, before his body hit the floor, I was already turning to find out who had taken the bullets meant for me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I first realized who it was when I saw the cascade of black waves blowing in the chill Minnesota wind - our front door was still open. The body lying face-down beneath that hair did not move.</p><p>Tina was lifting one pale hand, checking for a pulse. Garrett was holding the other.</p><p>\"Why isn't she getting up?\" I asked, rushing to Tina's side. \"What kind of bullets were these? Were they silver?\"</p><p>\"They didn't have to be silver,\" Tina guessed as she examined Antonia's body. She knew more about guns than anyone I'd ever met. \"Twenty-two longs, as he said, quite perfect for the job. They ricocheted around her skull but didn't exit. That particular ammunition lowers the innocent bystander rate. He may have expected civilians - or perhaps Detective Berry - to be near you when he shot you.\"</p> <p>\"But she's a werewolf!\" I shook Sinclair's comforting hand off my shoulder.</p><p>Tina looked up at me, eyes almost black with sympathy. \"Her brains are all over the floor, Majesty. There will be no coming back from this.\"</p><p>I barely noticed Garrett get up and slip out of view.</p><p>\"But she - she's Antonia!\" Foulmouthed and smart and strong and invulnerable. And alive - always so vibrantly, shockingly alive. \"She can't be - I mean, shot? It's such a mundane way for someone like her to - \"</p><p>\"No.\" Jessica staggered as if the shock was going to knock her on her ass, and Nick steadied her. \"No, she can't be. You're wrong. She's not.\"</p> <p>And the worst part was - \"She jumped in front of me. She - saved me.\"</p><p>\"Everybody saves you,\" Nick said neutrally. He tried to slip his arm around a sobbing Jessica, but she knocked it away.</p><p>Then we heard the splintering crash come from the stairwell.</p><p>I stood, trembling at the subsequent silence, and peered into the foyer. I choked back a sob at what Garrett had done to himself.</p><p>The regretful Fiend-turned-vampire had kicked the banister off a stretch of curved stairs in the foyer, leaving a dozen or so of the rails exposed and pointing up like spears. Then he had climbed to the second floor to a spot overlooking the stairs and swan dived onto the rails, which had gone through him like teeth.</p><p>\"See?\" the Ant said sadly as we stared down at the second body of a friend in less than a minute. \"I warned you.\"</p> <p>\"Yeah, well.\" I wiped my face. \"You could have been a lot more specific.\"</p><p>\"I didn't know exactly. But I had a feeling. This stuff is pretty inevitable around you.\"</p><p>\"Please go away.\"</p><p>\"Yes, I think so. You wouldn't believe how depressing all this is. Good-bye, for now.\" And like that, she was gone.</p><p>\"We'll take care of the bodies,\" my husband told me quietly.</p><p>Jessica kicked the wall and wiped tears from her cheeks. \"Take care of the bodies? Just like that? It's not that easy, Eric. You can't just snap your fingers and make vampire minions clean up the crap. Not this time. What about Chief Hamlin? How are we going to explain that?\"</p><p>\"Don't worry about it,\" Nick said, clearly uncomfortable. \"I can fix that.\"</p><p>\"You can fix that,\" I spat. \"Like you helped us fix things with the Fiends. Like you wanted me to fix your problems. You're going to fix this.\"</p> <p>Sensing my lack of faith, he coughed and softened his tone. \"Yeah. I can. I promise. Um, Betsy. You've had a rough - I mean, maybe you should, uh, go lie down.\"</p><p>\"I agree,\" Sinclair said, too quickly. \"Elizabeth, let us handle this for you.</p><p>I wanted to leave. God help me, I wanted to run away from this house and never, ever come back.</p><p>But I'd settle for fleeing to my bedroom and dropping the mess in my husband's lap. And the cop who hated me.</p><p>\"It was all just so - so stupid,\" I said. And preventable , my conscience whispered. If only you'd been paying attention to business...</p><p>I trudged up the stairs. Nobody went with me, which suited me fine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sinclair came upstairs hours later and cuddled me into his side. I sighed, and he stroked my shoulder and then kissed that same shoulder. I closed my eyes and breathed in his scent... warm, clean cotton. And dried blood, of course. Mustn't forget that. Not ever.</p><p>\"She died well.\"</p><p>\"I don't give a fuck. I want her back. I want her here.\"</p><p>\"As do I, Elizabeth. But I will honor her memory forever, for the sacrifice she made. It might have been your brains all over the foyer.\"</p> <p>\"Well, what if it was? Why should I be alive and Antonia be so much cooling meat?\"</p><p>\"I do not know, dear one. But I am fervently glad it worked out the way it did, for all I was fond of Antonia.\"</p><p>I mulled that one over for a minute or two while Sinclair sat up, slipped off my shoes, and rubbed my feet. I wiggled my toes against his palms and almost smiled. Then felt bad for thinking it'd be okay to smile, even for a second.</p><p>\"I just don't get it,\" I said at last.</p><p>\"Get it?\"</p> <p>\"When stuff this awful happens, you're supposed to learn something. Look Both Ways Before You Cross The Street. Be Kind To Children And Small Animals. Something. Jeez, anything. But there was all this death, all this waste, and for what?\"</p><p>Sinclair was quiet for so long I assumed I'd stumped him, a rare and wonderful thing. But he was just trying to figure out how to break it to me. Should have known.</p><p>\"It is that to be queen,\" he said at last. \"There will be times when you will see an ocean of blood and despair. So it says in the Book of the Dead, and so it shall be, dear wife.\"</p><p>\"You suck at cheering me up. You're not telling me there's gonna be worse days than this?\" To say I was appalled would be putting it mildly. \"What else did that rotten Book of the Dead tell you?\"</p><p>He paused for a long time. Then: \"Elizabeth, I can promise nothing, save that I will always be by your side.\"</p><p>I noticed he didn't answer the question. \"Oceans of blood,\" I said.</p> <p>\"Possibly. Yes.\"</p><p>\"We'll just see about that.\"</p><p>\"Elizabeth, if you'll forgive a pun, do not bite off more than you can chew.\"</p><p>\"That's been the story of my life since I woke up in that funeral home wearing the Ant's shoes. Oceans of blood? Shit on that. Shit all over that.\"</p><p>I had no idea what I was going to do, or how. But I was going to work real hard to make sure my friends and I never had to go through a week like this again.</p><p>This was going to sound dumb, but the empty crib in the next room was practically calling my name. I had to stop fobbing my brother on other people.</p><p>I wondered if the Ant ever visited him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was a day later; Garrett had been respectfully buried. Sinclair owned several farms and lots of land; what with Alice's remains, among others, we were starting quite the little private cemetery out on Route 19. It was awful and interesting at the same time.</p><p>The police chief's body had been found in his home, dead from an apparent suicide. Many cops went on record saying he had been deeply depressed about retiring but had rejected counseling.</p><p>Deeply depressed. Yeah. They didn't know the half of it.</p><p>\"I have to tell Antonia's pack leader what happened. They deserve to know what happened to her, how she died. How she - how wonderful she was. I got the impression her pack never appreciated her, didn't you guys?\"</p> <p>They all nodded. Sure, we knew. Her ability to tell the future (and not turn into a wolf) had given all the other werewolves the creeps. They had been happy to see her go. And when I had \"fixed\" her, the fact that she hadn't rushed back home meant so much to me. She chose to stick it out with me.</p><p>I'd never get the chance to thank her. As far as a recall, I don't think I ever thanked her for anything.</p><p>My chest hitched once... twice... then settled. No, I was done crying for a while.</p><p>\"Anyway, I want them all to know how she saved me. Hopefully they can guide us in how to treat... what's left of her.\"</p><p>Poor Antonia was in our basement freezer until I learned more about werewolf rituals for their dead. I wasn't looking forward to telling the boss werewolf that I'd gotten his pack member killed (Michael Wyndham had a wicked temper and a terrifying left cross), but it was something that had to be done.</p> <p>Jessica didn't say anything, just poured herself another cup of tea. I'd told her my plan the night before in a lame attempt to distract her from breaking up with Nick. I felt tremendously guilty that she'd picked me over him. Of course, I would have felt a lot worse if she'd gone the other way.</p><p>Maybe someday they could patch things up. I'd see if I could do something about that. He'd been hurt and scared and said things he didn't mean. I had tried to explain it to Jessica last night, but had no idea if she really heard me. Maybe... in time...</p><p>But maybe it was for the best if they never got back together. It would sure cut down on the vampire attacks he had to endure... the price of admission when you hung out with the people in Monster Mansion. And I truly didn't know how much more Nick could endure. He seemed like a rubber band, stretched almost - but not quite - to the breaking point.</p><p>I shook my head, then noticed Marc was shaking his head. \"I spend one Goddamn week in a hotel and then this.\" He was feeling as guilty as I was; he was convinced he could have done something for Antonia if he'd been here.</p><p>\"Mathematically,\" Tina began gently, \"given the age and abilities of our opponents, we got off rather lightly. And Garrett made his own choice. I - \"</p><p>\"That's enough,\" I said coldly, and Tina shut up.</p> <p>\"When?\" my husband asked, mildly enough. \"I'll need to clear my schedule.\"</p><p>\"Tomorrow.\"</p><p>\"As you wish.\"</p><p>\"I'll come with, if you like,\" Laura offered. She'd been agog all evening, listening to our tale of the awful events of the night earlier. \"It's not trouble at all.\"</p><p>I was glad she had missed it (yay, church youth group!), to be honest. No telling what the body count would have been if she'd lost her temper. Or where the chief's bullets might have gone if he'd known who had really killed dear old dad. Just the thought of it gave me the willies.</p><p>In fact, it was safe to say that her temper was hanging over my head like a friggin' broadsword. Someday I was going to have to really sit down and figure out just what the deal was with the devil's daughter.</p><p>But not today. Not even this month. I was just so fucking tired.</p><p>\"I'd be glad to come,\" my sister was continuing, eager to help. \"I've got a Toys for Tots meeting, but it's no problem to postpone - \"</p> <p>\"No, I need you to stay here and hold down the fort. And Tina - Richard, Stephanie, and Jane need looking after. Move them here while we're out of town, if that helps. Or you can move out to the McMansion until we get back. It's just temporary, until we can figure out something more permanent.\"</p><p>Tina nodded and jotted a note to herself on the notepad she always kept nearby. \"As you wish, Majesty.\"</p><p>\"I'll keep BabyJon for you,\" Laura volunteered.</p><p>I smiled at my sister and shook my head, then turned to my husband. \"Actually, I'd like to bring him to the Cape with us, if you don't mind. I've been spending too much time fobbing him off on other people, which is no good. I'm the only mother he's got now.\"</p><p>Sinclair tried to hide the wince (not a baby guy, my husband), but nodded. \"As you like, Elizabeth. I do agree, we should probably get used to the idea of being\" - he didn't quite gag on the word - 'parents'.</p><p>\"A fine thing, my son being brought up by vampires,\" the Ant said.</p><p>\"I suppose you're coming, too.\"</p><p>\"Of course,\" my dead stepmother said, amused.</p><p>\"That reminds me,\" I told my puzzled friends. \"I figured it out. Why the Ant's here.\"</p><p>\"To find a cure for bad dye jobs?\" Jessica joked.</p><p>\"Not hardly. See, she lived for making me miserable, she got off on setting my dad against his only kid, she loved irritating me in a thousand small ways.\"</p><p>\"You make it sound as if that was my only purpose in life,\" the Ant sniffed.</p><p>\"It was.\"</p><p>\"What was?\" Jessica asked.</p><p>I kept forgetting no one could hear her or see her but me. Lucky, lucky me. \"Never mind. Point is, she's not done yet,\" I finished. \"Not near done. So she's not going anywhere. She can't.\"</p><p>\"Believe me, I've tried,\" she said sourly.</p><p>\"So we're stuck with her indefinitely.\"</p><p>\"That's right!\" the Ant said triumphantly. \"No more Mrs. Nice Guy!\"</p><p>Exactly. Things were going to be very, very different from now on.</p><p>But the Ant didn't know me. Not the new me, the me that forced Fiends to their knees and broke necks and cured cancer. She was going to have her hands full.</p><p>For that matter, anyone who got in my way, who hurt my friends, who tried to stop me from making the world better, was going to have their hands full.</p><p>They didn't know this queen. Not like I did. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"You again.\"</p><p>\"Me again,\" I agreed, plonking the six-pack of Budweiser into my grandpa's lap. He let out a yelp and gave me a look like he'd like to burn me alive. I'm sure if he'd had a can of gasoline and a box of matches, he would have tried.</p><p>He slipped a can free, popped the top, took a greedy swig, then let out a satisfied belch. \"Ahhhh. You're not entirely useless.\"</p><p>\"Aw, Grandpa. That gets me right here.\"</p> <p>He grunted and almost smiled - almost. \"Where's the new guy? The Injun you married?\"</p><p>\"It's Native American, you old jerk.\"</p><p>\"Oh, fuck me and spare me that PC crap.\"</p><p>I could see we weren't going to get anywhere unless I worked around to my topic of conversation a lot faster.</p><p>\"To answer, he's looking after his business and junk like that.\" Truth was, I had no interest in involving myself in Sinclair's business affairs. One, it would have bored me near to death. Two, he'd been making himself rich for decades. He sure didn't need any help from me.</p> <p>I settled myself into the chair across from the bed. He was in his wheelchair (the one he didn't need) by the window. It had been full dark for half an hour.</p><p>\"So what's on your brain, Betsy?\"</p><p>\"I distinctly remember you telling me on several occasions that I didn't have one,\" I teased gently.</p><p>\"Yeah, well, you never come over without a purpose. Introducing the new guy. Telling me about that twat and your dad when they died. So what do you want? There's a Sandford and Son marathon starting in twenty minutes.\"</p><p>\"How d'you do it?\"</p><p>\"Do what?\" he said impatiently, then slurped up more beer.</p> <p>\"Kill people. And then not worry about it.\" I was speaking with a world war veteran, a man awarded the Bronze Star. Fourth highest award in the armed forces. It was hanging on the wall above my head.</p><p>His platoon had run into some bad luck, had been in the wrong place at the wrong time... a not unusual occurrence in wartime, I was sure. Grandpa had grabbed his Lee Enfield sniper rifle, found scant cover, and picked off Germans one by one while his buddies were scrambling to get away. As sergeant, he had ordered them to get away.</p><p>He took four bullets: two in his left arm, one just above his right knee, and one had clipped off his left earlobe. Two of his men had dragged him away, as he protested bitterly that he was just fine, fine, Goddammit, let go, you jackasses, I've got work to do!</p><p>I had work to do, too.</p><p>Meanwhile, my grandpa had finished the beer (barf... words could not describe how much I hated the taste of beer) and was holding an unopened can in his left hand. \"Kill people? Izzat what you said? And then not worry about it?\"</p><p>\"Yeah.\"</p><p>\"What happened, idiot?\"</p><p>I shook my head. \"It's a really long story, and I come off pretty bad in it.\"</p> <p>Grandpa shrugged, instantly losing interest in what brought me here, what had happened to make me ask that question. As Margaret Mitchell wrote about Scarlett O'Hara, he could not long endure any conversation that wasn't about him.</p><p>\"It was wartime,\" he said at last. \"They were the bad guys. It wasn't like it is now. Things were a little more black and white back then. They were killing every Jew they could find. I think those little black beanie things the men wear are pretty stupid, but it's no reason to pick 'em off like Goddamned mosquitoes.\"</p><p>I had to admit, I was surprised. Among other things, my darling maternal grandfather was a major bigot. I found it distinctly interesting that he'd fought because he saw a minority in trouble.</p><p>He was staring out the window now, and I had the very strong impression that if I spoke to him before he'd gotten all of it out, he'd clam up and take it to the grave.</p><p>The secret.</p><p>\"Yup, they were doing terrible things,\" he mused. \"And we were fools to wait until after Pearl Harbor to kick some ass. But once we were there, we were there. We did the work, and we didn't bitch about our feelings the whole time, either. God, I hate that 'tell me how that makes you feel' touchy-feely bullshit.\"</p><p>I nodded. I knew that, too.</p><p>\"And when my guys got in a tight spot - why, I looked out for 'em just like they'd been looking out for me. I just kept that in my mind. Keeping my guys alive and sending as many of the bad guys to Hell that I could. That's all I thought about.\"</p><p>He looked straight at me, his eyes - my eyes - green and gleaming. \"And then I never thought about it again. What for? Dead's dead, honey. You don't know that by now, I wash my hands of you.\"</p><p>\"Thanks for the tolerance and acceptance,\" I said dryly. Thinking, there's a trick or two I could tell you about death, Grandpa. Things you never, ever dreamed of. Things that would turn your hair white, if it wasn't already.</p><p>But of course I wouldn't.</p><p>\"What it comes down to is this, Betsy: you do what you need to, and then you haul ass out of there. Every single time.\"</p><p>\"And never think of it again.\"</p><p>He nodded and popped the second Bud. \"I didn't say it was an easy road. Shit, I lost plenty of my own fellas over there. I still miss Leary, that Irish fuck. But he died for a reason - a good one. Maybe the best one - kicking ass to keep the bullies out of the sandbox.\" He was looking at me almost sideways, a sly look. \"So whether you killed somebody or someone got killed 'cause a you - oh, I can see it all over your face, girl, aren't you my own flesh and blood? Just... never think of it again. Life's messy, honey.\"</p><p>So's death, I thought, and turned the conversation to other things. </p> </body></html>"]