["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>I was ten feet from the office door of Cutting Edge Investigations, when I heard our phone ring inside. Unfortunately the key to the office was in my sweatshirt pocket, which at the moment was full of pale pink slime dripping from the tentacles resting on my shoulders. The tentacles weighed about seventy pounds and my shoulders really didn't like it.</p><p>Behind me Andrea, my best friend and partner in crime solving, shifted the bulbous mass of flesh that was the rest of the creature, rearranging it. \"Phone.\"</p><p>\"I hear it.\" I dug in my pocket, all but glued shut by slime. Cold wetness slipped through my fingers. Ew.</p> <p>\"Kate, it could be a client.\"</p><p>\"I'm trying to find the key.\"</p><p>Clients meant money and money was in short supply. Cutting Edge opened its doors three months ago, and while we were getting a trickle of paying jobs, most of them were lousy. Despite a good recommendation from the Red Guard, the premier bodyguard outfit in the city, clients weren't knocking down our door in a rush to hire us.</p><p>Our world was beset by magic waves. They flooded us at random, smothering technology and leaving monsters in their wake. One moment you had rogue mages spitting fireballs and lightning, the next the magic would vanish, and the cops would gun down said mages with their now operational firearms.</p><p>Sadly the consequences of the magic waves didn't always vanish with them, and Atlanta by necessity had spawned many agencies to deal with magic hazmat. All of them had been in business a lot longer than us: the cops, the Mercenary Guild, a slew of private companies, and the big gorilla, the Order of Merciful Aid. The Order and its knights made it their mission to guard humanity against all threats and they did just that, on their terms. Both Andrea and I had worked for the Order at some point and both of us left under less than amicable circumstances. Our reputations weren't stellar, so when we got a job, it was because everyone else in town had already shot it down. We were quickly turning into Atlanta's business of last resort. Still, every successful job was a check mark by our name.</p> <p>The phone rang, insistent.</p><p>Our latest job had come courtesy of the Green Acres Home Owners Association, who showed up at our door this morning claiming that a giant levitating jellyfish was roaming their suburb and could we please come and get it, because it was eating local cats. Apparently the translucent jellyfish was floating about with half-digested cat bodies inside it, and the neighborhood children were very upset. The cops told them that it wasn't a priority, since the jellyfish hadn't eaten any humans yet, and the Mercenary Guild wouldn't get rid of it for less than a grand. The HOA offered us $200. Nobody in their right mind would do the job at that price.</p><p>It took us all damned day. And now we had to properly dispose of the cursed thing, because dealing with corpses of magical creatures was like playing Russian roulette. Sometimes nothing happened, and sometimes the corpse did fun things like meting into a puddle of sentient carnivorous protoplasm or hatching foot-long blood-sucking leeches.</p><p>The weight of the jellyfish suddenly vanished from my shoulders. I rummaged in my pocket and my fingertips slid against the cold metal. I yanked the key out, slipped it into the lock, and swung the heavy reinforced door open. Aha! Victory.</p><p>I lunged through the door and made a break for the phone. I reached a second too late and the answering machine came on. \"Kate,\" Jim's voice said. \"Pick up the phone.\"</p><p>I backed away from the phone like it was on fire. I knew exactly what this call was about and I didn't want any of it.</p> <p>\"Kate, I know you're there.\"</p><p>\"No, I'm not,\" I said.</p><p>\"You will have to deal with this sooner or later.\"</p><p>I shook my head. \"No, I won't.\"</p><p>\"Call me.\" Jim hung up.</p><p>I turned to the door and watched Andrea walk through it. Behind her, the jellyfish squeezed through the doorway on its own. I blinked. The jellyfish kept coming. It cleared the door, turned, and I saw Curran carrying it in his hands, as if the three hundred pound mass of flesh was no heavier than a plate of pancakes. It's good to be the Beast Lord.</p><p>\"Where to?\" he asked.</p><p>\"Back room,\" Andrea said. \"Here, I'll show you.\"</p> <p>I followed them and watched Curran pack the jellyfish into the biohazard container. He slid the lid in place, locked the clamps, and closed the distance between us. I held my slimy arms out to keep from getting him covered in ooze, leaned forward, and kissed the Beast Lord. He tasted like of toothpaste and of Curran, and the feel of his lips on mine made me forget the lousy day, the bills, the clients, the two gallons of slime drenching my clothes. The kiss had lasted only a couple of seconds, but it might as well have been an hour, because when we broke apart, it felt like I had come home, leaving all my troubles far behind.</p><p>\"Hey,\" he said, his grey eyes smiling at me.</p><p>\"Hey.\"</p><p>Behind him Andrea rolled her eyes.</p><p>\"What's up?\" I asked him.</p><p>Curran almost never came to visit my office, especially not in the evening. He hated Atlanta with all the fire of a supernova. I didn't have anything against Atlanta in theory - it was half-eroded by the magic waves and it burned a lot - but I had a thing about crowds. When my workday was over, I didn't linger. I headed straight for the Keep, where the Atlanta shapeshifter Pack and His Furry Majesty resided.</p><p>\"I thought we'd go to dinner,\" he said. \"It's been awhile since we've gone out.\"</p><p>Technically we had never gone out to dinner. Oh, we had eaten together in the city but usually it was accidental and most of those times involved other people and frequently ended in a violent incident.</p><p>\"What's the occasion?\"</p><p>Curran's blond eyebrows came together. \"Does there have to be a special occasion for me to take you out to dinner?\"</p><p>Yes. \"No.\"</p><p>He leaned to me. \"I missed you and I got tired of waiting for you to come home. Come grab a bite with me.\"</p><p>Grabbing a bite sounded heavenly, except Andrea would be stuck here by herself. \"I have to wait for the Biohazard to get here to pick up the jellyfish.\"</p><p>\"I've got it,\" Andrea offered. \"Go, there is no use in the two of us sitting here. I have some stuff I need to take care of anyway.\"</p><p>I hesitated.</p><p>\"I can sign forms just as well as you,\" Andrea informed me. \"And my signature doesn't look like scratches of a drunken chicken in the dirt.\"</p><p>\"My signature is just fine, thank you very much.\"</p><p>\"Yeah, yeah. Go have some fun.\"</p><p>\"I need a shower,\" I told Curran. \"I'll see you in ten minutes.\"</p><p>It was Friday, eight o'clock on a warm spring night, my hair was brushed, my clothes were clean and slime-free, and I was going out with the Beast Lord. Curran drove. He did it very carefully, concentrating on the road. I had a feeling he learned to drive when he was older. I drove carefully too, mostly because I expected the car to fail on me at any second.</p><p>I glanced at Curran in the driver seat. Even at rest, like he was now, relaxed and driving, he emanated a kind of coiled power. He was built to kill, his body a blend of hard, powerful muscle and supple quickness and something in the way he carried himself telegraphed a shocking potential for violence and an entitlement to use it. He seemed to occupy a much larger space than his body permitted and he was impossible to ignore. This promise of violence used to scare me, so I'd bait him until some of it came out. Now I just accepted him, the way he accepted my need to sleep with a sword under my bed.</p><p>Curran caught me looking. He flexed, letting the carved muscles bulge on his arms, and winked. \"Hey baby.\"</p><p>I cracked up. \"So where we're going?\"</p><p>\"Arirang,\" Curran said. \"It's a nice Korean place, Kate. They have charcoal grills at the tables. They bring you meat and you cook it any way you want.\"</p><p>Figured. Left to his own devices, Curran consumed only meat, punctuated with an occasional desert. \"That's nice for me, but what will your vegetarian Majesty eat?\"</p><p>Curran gave me a flat look. \"I can always drive to a burger joint instead.\"</p><p>\"Oh, so you'd throw a burger down my throat and expect making out in the back seat?\"</p><p>He grinned. \"We can do it in the front seat instead, if you prefer. Or on the hood of the car.\"</p><p>\"I'm not doing it on the hood of the car.\"</p><p>\"Is that a dare?\"</p><p>Why me?</p><p>\"Kate?\"</p><p>\"Keep your mind on the road, your Furriness.\"</p><p>The city rolled by, twisted by magic, battered and bruised but still standing. The night swallowed the ruins, hiding the sad husks of once mighty, tall buildings. New houses flanked the street, constructed by hand with wood, stone and brick to withstand magic's jaws.</p><p>I rolled down the window and let the night in. It floated into the car, bringing with spring and a hint of wood smoke from a distant fire. Somewhere a lone dog barked out of boredom, each woof punctuated by a long pause, probably to see if the owners would let him in.</p><p>Ten minutes later we pulled into a long empty parking lot, guarded by old office buildings that now housed Asian shops. A typical stone building with huge store-front windows sat at the very end, marked by a sign that read Arirang.</p><p>\"This is the place?\"</p><p>\"Mhm,\" Curran said.</p><p>\"I thought you said it was a Korean restaurant.\" For some reason I had expected a hanok house with a curved tiled roof and a wide front porch.</p><p>\"It is.\"</p><p>\"It looks like Western Sizzlin.\" In fact, it probably used to be Western Sizzlin.</p><p>\"Will you just trust me? It's a nice place...\" Curran braked, and the Pack Jeep screeched to a stop.</p><p>Two skeletally thin vampires sat at the front of the restaurant, tethered to the horse rail with chains looped over their heads. Pale, hairless, dried like leathery jerky, the undead stared at us with mad glowing eyes. Death had robbed them of their cognizance and will, leaving behind mindless body shells driven only by bloodlust. On their own, the bloodsuckers would slaughter anything alive and keep killing until nothing breathing remained. Their empty minds made a perfect vehicle for necromancers, who telepathically navigated them like remote controlled cars. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Curran glared at the undead through the windshield. Ninety percent of the vampires belonged to the People, a weird hybrid of a corporation and a research institute. We both despised the People and everything they stood for.</p><p>I couldn't resist. \"I thought you said this was a nice place.\"</p><p>He leaned back, gripped the steering wheel and let out a long growling, \"Argh.\"</p> <p>I chuckled.</p><p>\"Who the hell stops at a restaurant while navigating?\" Curran squeezed the wheel a little. It made a groaning noise.</p><p>I shrugged. \"Maybe the navigators were hungry.\"</p><p>He gave me an odd look. \"This far away from the Casino means they're out on patrol. What, did they suddenly get the munchies?\"</p><p>\"Curran, ignore the damn bloodsuckers. Let's go and have a date anyway.\"</p> <p>He looked like he wanted to kill somebody.</p><p>The world blinked. Magic flooded us like an invisible tsunami. The neon sign above the restaurant withered and a larger brilliant blue sign ignited above it, made from hand-blown glass and filled with charged air.</p><p>I reached over and squeezed Curran's hand. \"Come on, you, me, a platter of barely seared meat, it will be great. If we see the navigators, we can make fun of the way they hold their forks.\"</p><p>We got out of the car and headed inside. The bloodsuckers glanced at us in unison, their eyes like two smoldering coals buried beneath the ash of a dying fire. I felt their minds, twin hot pinpoints of pain, restrained securely by the navigators' wills. One slip up and those coals would ignite into an all consuming flame. Vampires never knew satiation. They never got full, they never stopped killing, and if let loose, they would drown the world in blood and die of starvation when there was nothing left to kill.</p><p>The chains wouldn't hold them - the links were an eighth of an inch thick at best. A chain like that would restrain a large dog. A vamp would snap it and not even notice, but general public felt better if the bloodsuckers were chained, and so the navigators obliged.</p><p>We passed the vampires and entered the restaurant.</p> <p>The inside of Arirang was dim. Feylanterns glowed with soft light on the walls, as the charged air inside their colored glass tubes reacted with magic. Each feylantern had been hand-blown into a beautiful shape: a bright blue dragon, an emerald tortoise, a purple fish, a turquoise stocky dog with a unicorn horn... Booths lined the walls, their tables plain rectangles of wood. In the center of the floor four larger round tables sported built-in charcoal grills under metal hoods.</p><p>The restaurant was about half full. The two booths to our right were occupied, the first by a young couple, a dark-haired man and a blond woman in their twenties, and the second by two middle-aged men. The younger couple chatted quietly. Good clothes, relaxed, casual, well groomed. Ten to one these were the navigators who had parked the bloodsuckers out front. The Casino had seven Masters of the Dead and I knew them by sight. I didn't recognize either the man or the woman. Either these two were visiting from out of town or they were upper level journeymen.</p><p>Both of the older guys in the next booth were armed. The closer one carried a short sword, which he put on the seat next to him. As his friend reached for the salt shaker, his sweatshirt hugged the gun in his side holster.</p><p>Past the men in the far right corner, four women in their thirties laughed too loud - probably tipsy. On the other side a family with two teenage daughters cooked their food on the grill. The older girl looked a bit like Julie, my ward. Two business women, another family with a toddler, and an older couple rounded off the patrons. No threats.</p><p>The air swirled with delicious aroma of meat seared over open fire, cooked garlic, and sweet spice. My mouth watered. I hadn't eaten since grabbing some bread this morning from a street vendor. My stomach actually hurt.</p><p>A waiter in a plain black pants and a black T-shirt led us to a table in the middle of the floor. Curran and I took chairs opposite one another - I could see the back door and he had a nice view of the front entrance. We ordered hot tea. Thirty seconds later it arrived with a plate of pot stickers.</p><p>\"Hungry?\" Curran asked.</p><p>\"Starving.\"</p> <p>\"Combination platter for four,\" Curran ordered.</p><p>His hungry and my hungry were two different things.</p><p>The waiter departed.</p><p>Curran smiled. It was a happy genuine smile and it catapulted him from attractive into irresistible territory. He didn't smile very often in public. That intimate smile was usually reserved for private moments when we were alone.</p><p>I reached over, pulled the band off my still damp braid, and slid my fingers through it, unraveling the hair. Curran's gaze snagged on my hands. He focused on my fingers like a cat on a piece of foil pulled by a string. I shook my head and my hair fell over my shoulders in a long dark wave. There we go. Now we were both private in public.</p><p>Tiny gold sparks danced in Curran's grey irises. He was thinking dirty thoughts and the wicked edge in his smile made me want to slide next to him and touch him.</p><p>We had to wait. I was pretty sure that having hot sex on the floor of Arirang would get us banned for life. Then again, it might be worth it.</p><p>I raised my tea in a salute. \"To our date.\"</p><p>He raised his cup and we clinked them gently against each other.</p><p>\"So how was your day?\" he asked.</p><p>\"First, I chased a giant jellyfish around through some suburbs. Then I argued with Biohazard about coming and picking it up, because they claimed it was a Fish and Game issue. Then I called Fish and Game and conferenced them in on the Biohazard call, and then I got to listen to the two of them argue and call each other names. They got really creative.\"</p><p>\"Then Jim called,\" Curran said.</p><p>I grimaced. \"Yes. That too.\"</p><p>\"Is there a particular reason you're avoiding our chief of security?\" Curran asked.</p><p>\"Do you remember how my aunt killed the head of the Mercenary Guild?\"</p><p>\"Not something one forgets,\" he said.</p><p>\"They're still squabbling over who will be in charge.\"</p><p>Curran glanced at me. \"That was what, five months ago?\"</p><p>\"My point exactly. On one side there are the older mercs, who have experience. On the other side there is the support staff. Both groups have roughly an equal share of the Guild as a result of Solomon's will and they hate each other. It's getting into death threat territory, so they're having some sort of final arbitration to decide who's in charge.\"</p><p>\"Except they are deadlocked,\" Curran guessed.</p><p>\"Yes, they are. Apparently Jim thinks that I'm supposed to break that tie.\"</p><p>The Guild's now dead founder was a closet shapeshifter. He left twenty percent of the Guild to the Pack. As long as the Mercenary Guild remained deadlocked, nobody was getting paid and the Pack alphas wanted that income stream to start flowing again. They put pressure on Jim, and Jim put pressure on me.</p><p>I did enough years in the Guild to be viewed as a veteran. Jim did enough years just as well, but unlike me, he had the luxury of keeping his identity semi-private. Most mercs didn't know he was high up in the Pack.</p><p>I had no privacy. I was the Pack Consort. It was the price I paid for being with Curran, but I didn't have to like it.</p><p>His Majesty drank his tea. \"Not looking forward to settling the dispute?\"</p><p>\"I'd rather eat dirt. It's between Mark and the veterans led by the Four Horsemen, and they despise each other. They aren't interested in reaching a consensus. They just want to throw mud at each other over a conference table.\"</p><p>An evil light sparked in his eyes. \"You could always go for Plan B.\"</p><p>\"Pound everyone to a bloody pulp until they shut up and cooperate?\"</p><p>\"Exactly.\"</p><p>It would make me feel better. \"I could always do it your way instead.\"</p><p>Curran raised his blond eyebrows.</p><p>\"Roar until everyone pees themselves.\"</p><p>A shadow of self-satisfaction flickered on his face and vanished, replaced by innocence. \"That's bullshit. I'm perfectly reasonable and I almost never roar. I don't even remember what it feels like to knock some heads together.\"</p><p>The Beast Lord of Atlanta, a gentle and enlightened monarch. \"How progressive of you, Your Majesty.\"</p><p>He cracked another grin.</p><p>The male necromancer in the booth next to us reached under the table and produced a rectangular rosewood box. Ten to one, there was some sort of jewelry inside.</p><p>I nodded at Curran. \"Your turn. How did your day go?\"</p><p>\"It was busy and full of stupid shit I didn't want to deal with.\"</p><p>The blond woman opened the box. Her eyes lit up.</p><p>\"The rats are having some sort of internal dispute over some apartments they bought. Took all day to untangle it.\" Curran shrugged.</p><p>The woman plucked a golden necklace from the box. Shaped like an inch and a half wide segmented collar of pale gold, it gleamed in the feylanthern light.</p><p>I poured us more tea. \"But you prevailed.\"</p><p>\"Of course.\" Curran drank from his cup. \"You know, we could stay over in the city tonight.\"</p><p>\"Why?\"</p><p>\"Because that way we wouldn't have to drive for an hour back to the Keep before we could fool around.\"</p><p>Heh.</p><p>A scream jerked me to my feet. In the booth, the blond necromancer clawed at the necklace, gasping for breath. The man stared at her, his face a terrified mask. The woman raked her throat, gouging flesh. With a dried pop, her neck snapped, and she crashed to the floor. The man dove down, pulling at the necklace. \"Amanda! Oh my god!\"</p><p>Past him two pairs of red vampire eyes stared at us through the window.</p><p>Oh crap. I pulled Slayer from the sheath on my back. Sensing the undead, the pale blade of the enchanted saber perspired, sending wisps of white vapor into the air.</p><p>The dull carmine glow of vampire irises flared into vivid scarlet. Shit. The restaurant just updated its menu with fresh human.</p><p>Flesh boiled on Curran's arms. Bone grew, muscle twisted like slick ropes, skin sheathed his new body and sprouted fur. Enormous claws slid from Curran's new fingers.</p><p>The vampires rose off their haunches.</p><p>Curran stood up next to me, nearly eight feet of steel-hard muscle. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I gripped Slayer's hilt, feeling the familiar comforting texture. Bloodsuckers reacted to sudden movement, bright lights, loud noises, anything that telegraphed prey. Whatever I did had to be fast and flashy. The blood alone wouldn't do it, not when every table was filled with raw meat.</p><p>The window exploded in a cascade of gleaming shards. The vampires sailed through, like they had wings. The left bloodsucker landed on the table, the remnant of the chain hanging from its neck. The right skidded on the slick parquet floor and bumped into another table, scattering the chairs.</p><p>I screamed and dashed to the left, pulling Slayer as I sprinted. Curran snarled and leaped, covering half the distance to the right bloodsucker in a single powerful jump.</p> <p>My vamp glared at me. I looked into its eyes.</p><p>Hunger.</p><p>Like staring into an ancient abyss. Behind the eyes, its mind seethed, free of the chain. I wanted to reach out and crush it, like a bug between my fingernails. But doing that would give me away. I might as well give the People a sample of my blood with a pretty bow on it.</p><p>\"Here!\" I flicked my wrist, making the reflection of feylanterns dance along Slayer's surface. Look. Shiny.</p><p>The bloodsucker's gaze locked on the blade. The vamp ducked down, like a dog before the strike, front limbs wide, yellow claws digging into the table. The wood groaned. The chain slipped along the table's edge, clinking.</p> <p>No way for a neck cut. The chain loop would block the blade.</p><p>A high-pitched female scream slashed my eardrums. The vamp hissed, jerking in the direction of the sound.</p><p>I jumped on the chair next to the table and thrust sideways and up. Slayer's blade slid between the vamp ribs. The tip met a tight resistance and sliced through it. Hit the heart. Banzai.</p><p>The bloodsucker screeched. I let go of the saber. The vamp reared, the Slayer up to the hilt in its rib cage, staggered as if drunk, pitched over, and crashed to the floor, flopping like a fish on dry land.</p><p>To the left, Curran thrust his claws through the flesh under his vamp's chin. The bloody tips of the claws emerged from the back of the bloodsucker's neck. The vamp clawed at him. Curran thrust his monstrous hand deeper, gripped the vamp's neck and tore its head off the body.</p><p>Showoff.</p> <p>He tossed the head aside and glanced at me, checking if I was okay. The whole thing took about five seconds and felt like an eternity. We were both in one piece. I exhaled.</p><p>The restaurant fell silent, except for the male necromancer sobbing on the floor and the hoarse hissing from the vampire, convulsing as my saber liquefied its innards, absorbing the nutrients into the blade.</p><p>In the far corner a man swiped his toddler from the high chair, grabbed his wife's hand, and ran out. As one, the patrons jumped. Chairs fell, feet pounded, someone gasped. They rushed out of both doors. In a blink the place was empty.</p><p>I grasped Slayer and pulled. It slid from the body with ease. The edges of the wound sagged and dark brown blood spilled from the cut. I swung and beheaded the vamp with a single sharp stroke. You should always finish what you started.</p><p>Curran's arms shrank, streamlining, grey fur melting into his skin. A normal shapeshifter would've needed a nap after changing shape twice in short time, but Curran didn't exactly play by the regular shapeshfiter rules. He walked over to the male necromancer, pulled him upright, and shook him once, an expression of deep contempt on his face. I could almost hear the guy's teeth rattle in his skull.</p><p>\"Look at me. Focus.\"</p><p>The necromancer stared at him, shocked eyes wide, his mouth slack.</p><p>I knelt by the female navigator and touched her wrist, keeping away from the neck and the gold band on it. No pulse. The necklace clamped her throat like a golden noose, its color a dark vivid yellow, almost orange. The skin around it was bright red and quickly turning purple.</p> <p>I picked up her purse, pulled out a wallet and snapped it open. A People ID. Amanda Sunny, journeyman, Second Tier. Twenty years old and now dead.</p><p>Curran peered into the journeyman's face. \"What happened? What did you do?\"</p><p>The man sucked in a deep breath and dissolved into tears.</p><p>Curran dropped him in disgust. His eyes were pure gold - he was pissed off.</p><p>I went to the hostess desk and found the phone. Please work... Dial tone. Yes!</p><p>I punched in the office number. Chances were, Andrea was still there.</p><p>\"Cutting Edge,\" Andrea's voice said.</p><p>\"I'm in Arirang. Two navigators were having dinner. The man gave the woman a gold necklace and it strangled her to death. I'm looking at two dead vampires and one human corpse.\"</p><p>\"Sit tight. I'll be there in thirty minutes.\"</p><p>I hung up and dialed the Casino.</p><p>\"Kate Daniels, for Ghastek. Urgent.\"</p><p>\"Please wait,\" female voice said. The phone went silent. I hummed to myself and looked at the ID. I didn't know which of the Masters of the Dead Amanda answered to, but I knew Ghastek was the best of the seven currently in the city. He was also power-hungry and he was making his bid for taking over Atlanta's People office. He was very much in the limelight at the moment and I could count on a rapid response.</p><p>A moment passed. Another.</p><p>\"What is it, Kate?\" Ghastek's voice said into the phone. He must've been doing something, because he failed to keep exasperation from his voice. \"Please keep this quick, I'm in the middle of something.\"</p><p>\"I have one dead journeywoman, one hysterical journeyman, two dead vampires, one pissed off Beast Lord with bloody hands, and a half a dozen terrified restaurant staff.\" Quick enough for you?</p><p>Ghastek's voice snapped into brisk tone. \"Where are you?\"</p><p>\"Arirang on Greenpine. Bring a decontamination unit and body bags.\"</p><p>I hung up. Our waiter edged out of the doors and approached our table, looking green. The rest of the staff were probably huddled together in the back room, terrified, not knowing if the danger had passed.</p><p>\"Is it over?\"</p><p>Curran turned to him. \"Yes, it's over. The People are on their way to clean up the mess. You can bring everyone out, if it will make them feel better. We guarantee your safety.\"</p><p>The waiter took off. Someone shouted. A moment later the doors opened and people poured out: an older Korean man, the older woman who had greeted us, a woman who looked like she could be their daughter and several men and women in waiter and chef garb. The younger woman carried a boy. He couldn't have been more than five.</p><p>The owners piled up into the booths around us. The boy stared at the two vampires with dark eyes, big like two cherries.</p><p>I sat into the chair next to Curran. He reached over and pulled me close. \"I'm sorry about the dinner.\"</p><p>\"That's okay.\" I stared at the dead woman. Twenty years old. She barely had a chance to live. I'd seen a lot of death, but for some reason the sight of Amanda laying there on the floor, her boyfriend weeping uncontrollably by her body, chilled me to the bone. I leaned against Curran, feeling the heat of his body seep through my T-shirt. I was so cold and I really needed his warmth.</p><p>Chapter Two</p><p>A caravan of black SUV's descended onto the parking lot, their enchanted water engines belching noise. Magic-powered cars didn't move very fast and sounded like a rock avalanche hitting a speeding train, but it was better than nothing.</p><p>We watched the SUVs through the broken window, as they parked at the far end, killed the noise, and vomited people, vampires, and body bags. Ghastek emerged from the lead vehicle, ridiculously out of place in a black turtleneck and tailored dark pants. He came through the door, surveyed the scene for a second, and headed to us.</p><p>Curran's eyes darkened. \"I bet you a dollar he's running over to assure me that we're in no danger.\"</p><p>\"That's a sucker's bet.\"</p><p>The Pack and the People existed in a very fragile state of peace. None of us wanted to do anything to jeopardize that.</p><p>The People were efficient, I gave them that. One crew went for the vampires, the other headed for the woman's body, the third for the despondent journeyman. Two women and a man in business suits made a beeline for the booth where the owners sat.</p><p>Ghastek came close enough to be heard. \"I want it to be clear: this was not an attempt to kill either of you. The journeymen weren't supposed to be here and the guilty party will be harshly reprimanded.\"</p><p>Curran shrugged. \"Don't worry, Ghastek. If this was an attempt, I know you'd bring more than two vampires.\"</p><p>\"What happened?\" Ghastek asked.</p><p>\"They were having dinner,\" I told him. \"They seemed happy together. The boy handed her a necklace and it choked her to death.\"</p><p>\"Just so I understand, Lawrence himself wasn't personally injured.\"</p><p>\"No,\" Curran said. \"He was in shock from watching his girlfriend die in front of him.\"</p><p>Ghastek looked over the scene again, looking like he wanted to be anywhere but here. \"Once again, we're dreadfully sorry for the inconvenience.\"</p><p>\"We'll live,\" Curran said.</p><p>One of the People stepped away from Amanda's body. \"The necklace adhered to her skin. There doesn't appear to be any locking mechanism. It's a solid band of gold.\"</p><p>\"Leave it,\" Ghastek said. \"We'll remove it later.\"</p><p>If I were them, I'd cut it off during tech and stick it into a hazmat container.</p><p>A middle-aged man shouldered his way inside the restaurant, followed by a young woman and a boy who looked about seven. I glanced at the woman and had to click my mouth shut. She was in her late teens, right on the cusp between a girl and a woman. Her body, full in the bust and hips, slimmed to a narrow waist. Her long slender legs carried her with a natural grace. Her hair streamed from her head in a shimmering cascade so precisely matching the color of gold, I would've sworn it was gold if I didn't know better. Her face, a pale oval, was angelic. She glanced at me in passing. Her irises were an intense deep blue and her eyes were decades older than her face.</p><p>She was beautiful.</p><p>She was also not human. Or she had bargained with something not human for that body.</p><p>Curran was watching her. His nostrils flared a little as he inhaled, sampling the scents and I felt a punch of jealousy right in the gut. Well, this was a new and unwelcome development. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ghastek focused on the woman as well, with a kind of clinical interest usually afforded to an odd insect. \"Here come the grieving parents. I've met them before.\"</p><p>\"Is that her sister?\" I asked.</p><p>\"No, that's Mrs. Sunny, her mother. The boy is Amanda's brother.\"</p> <p>Not human.</p><p>The middle-aged man saw the female navigator, whose body the People had just loaded on the gurney. \"Amanda! Jesus Christ, Amanda! Baby!\"</p><p>\"No!\" The woman cried out.</p><p>He dashed to Amanda. \"Oh God. Oh God.\"</p><p>The golden-haired woman chased after him, the boy in tow. \"Don't go near her!\"</p> <p>The man grasped Amanda's hand. The golden band of the necklace popped open. An eerie soft light ignited within the necklace, setting the gold aglow.</p><p>\"Oh Go-\" Amanda's father fell silent in the middle of the word, transfixed by the necklace.</p><p>His hand inched toward it.</p><p>\"Stop!\" Curran barked. The man froze, arrested by the unmistakable command in that voice.</p><p>I was already moving.</p><p>The golden woman pushed past him, yanked the necklace from Amanda's neck, spun, and thrust it at the boy's throat. The gold band locked on the child's neck, adhering to his skin. I missed it by half a second.</p> <p>The boy gasped. His father shook his head, as if awakened from a dream.</p><p>The golden-haired woman stared at me with her old eyes and smiled.</p><p>\"Are you out of your mind?\" I snarled. \"That necklace just killed your daughter.\"</p><p>\"This isn't your affair,\" the golden-haired woman said.</p><p>\"Take it off. Now.\"</p><p>She sneered. \"I can't.\"</p><p>She knew exactly what that necklace did. She made a conscious choice between her husband and her son.</p><p>The boy dug his fingers into his neck, trying pry the necklace loose. It remained stuck. The skin around the band of gold was turning pink. We had to get that thing off of him.</p> <p>The man stared at her. \"Aurellia? What's going on? What's the meaning of this?\"</p><p>\"Don't worry about it,\" the woman told him. \"I'll explain it later.\"</p><p>\"No, you'll explain it now.\" Curran moved next to me.</p><p>\"I have to concur,\" Ghastek said.</p><p>The woman raised her chin. \"You have no authority over me.\"</p><p>\"Aurellia, what is going on?\" her husband asked.</p><p>\"On the contrary. We have all the authority we need.\" Ghastek snapped his fingers. A woman in a business suit and glasses popped up by his side as if by magic.</p><p>\"The necklace caused the death of a journeywoman in our employ,\" the woman said. \"We've expended a considerable amount of money training her, not to mention the cost of the two vampires that were terminated as a result of her death. That necklace is evidence in our investigation of the incident. If you obstruct our investigation by withholding this evidence from us, we will obtain a court order requiring you to surrender the necklace to us. Should we choose to pursue this matter further, you will find yourself in a very actionable position.\"</p><p>Some people had attack dogs. Ghastek had attack lawyers. If he got his hands on the boy, he'd find a way to remove the necklace. Even if he had to behead the child to get it.</p><p>I couldn't let the People get the boy.</p><p>\"That's nice,\" I said. \"I have a simpler solution. Take the necklace off the child now and I won't kill you.\"</p><p>\"Wait a God damned minute.\" Amanda's father moved to stand between me and his wife. \"Everyone calm down. Just calm down.\"</p><p>\"Give me the boy and nobody gets hurt,\" I told them. \"Nobody here will stop me.\"</p><p>\"That child is wearing our evidence,\" Ghastek said.</p><p>Curran's eyes lit up with gold. He leveled his alpha stare on the woman. She flinched.</p><p>\"Give me the child,\" Curran said, his voice a deep inhuman growl.</p><p>\"Fine.\" Aurellia shoved the boy toward us. \"Take him.\"</p><p>Curran swept the boy off the floor and picked him up. Ghastek's face fell. We'd won this round.</p><p>\"Give me back my son!\" the man demanded.</p><p>Curran just looked at him.</p><p>\"It's in the boy's best interests to stay in our custody,\" Ghastek said. \"We have better facilities.\"</p><p>\"It's not your facilities I doubt,\" Curran said. \"It's your ethics and your intentions.\"</p><p>\"What does that supposed to mean?\" Ghastek narrowed his eyes.</p><p>\"It means the necklace is more important to you than the boy,\" I said. \"You'll slice the flesh off his neck to get it.\"</p><p>\"That's a gross exaggeration.\" The Master of the Dead crossed his arms. \"I've never murdered a child.\"</p><p>\"Oh it's never murder when you do it,\" I said. \"It's a regrettable accidental casualty.\"</p><p>\"You can't do this!\" Amanda's father thrust himself before Curran. \"You can't take my son.\"</p><p>\"Yes, I can,\" Curran said. \"We'll keep him safe. If your wife decides to explain what's going on, I'll consider returning him.\"</p><p>\"Go fuck yourself,\" the golden-haired woman said. \"Crawl back into whatever dark hole you came out of. I have no care for you or your kind.\" She turned and walked out of the restaurant.</p><p>Her husband froze, caught for a moment between his son and his wife. \"This isn't over,\" he said finally and chased after Aurellia.</p><p>\"Give us the boy,\" Ghastek said, his tone reasonable.</p><p>\"I don't think so,\" Curran said. \"If you want to examine him later, you're welcome to visit the Keep.\"</p><p>Around us the People tensed. In the corner two vampires leaned forward.</p><p>I unsheathed Slayer. I had a lot of practice and I did it fast. The lawyer woman jerked back. The opaque blade smoked, sensing the undead. Come on, Ghastek. Make our night.</p><p>Ghastek sighed. \"Fine. I'll make the necessary arrangements later.\"</p><p>Curran headed out through the door. I waited a second and followed, walking backward for the first two steps to make sure that no undead would come leaping out of darkness at Curran's back.</p><p>The door of Arirang swung shut behind us. Ghastek's voice called out, \"Alright, people, back to work. Let's process the scene tonight.\"</p><p>\"What's your name?\" Curran asked.</p><p>The boy swallowed. \"Roderick.\"</p><p>\"Don't be afraid,\" Curran told him, his voice still laced with snarls. \"I'll keep you safe. If anything threatens you, I'll kill it.\"</p><p>The boy gulped.</p><p>A giant scary man with glowing eyes and inhuman voice just took you from your parents, but don't be afraid, because he'll kill anything that moves. Kick-ass calming strategy, Your Majesty.</p><p>\"He might be less scared if you stopped snarling and turned off the headlights,\" I murmured.</p><p>The fire in Curran's eyes died.</p><p>\"It will be okay,\" I told Roderick. \"We just want to take off that necklace, and then you can go back to your parents. It will be okay. I promise.\"</p><p>If the necklace snapped his neck, there wasn't a damn thing I or Curran or anybody else could do about it. We had to get him to the Keep's infirmary.</p><p>We headed into the parking lot just as Andrea pulled up in a Pack Jeep.</p><p>Chapter Three</p><p>Doolittle bent over the boy, studying the necklace with a magnifying glass. Dark-skinned, his hair salted with grey, the Pack medic looked to be in his early fifties. Doolittle was the best medmage I had ever met. He brought me back from the edge of death so many times, we stopped joking about it.</p><p>There was something so soothing about Doolittle. Whether it was his manner, his kind eyes, or the soft Southern accent, tinted with notes of coastal Georgia, I didn't know. The moment he walked into the room, Roderick relaxed. In thirty seconds they had struck a bargain: if Roderick stayed on his best behavior, he would get ice-cream.</p><p>Not that Roderick had to be bribed. It took us almost an hour to get to the Keep and the entire ride over, he did not say a single word. He didn't move, didn't fidget, or do any of the normal things a seven year old kid would do in the car. He just sat there, quiet, his brown eyes opened wide, like he was a baby owl.</p><p>Doolittle pressed his thumb and index finger just above the necklace, stretching the skin. A vein stood out, burrowing from the gold band under the skin into the muscle of the neck like a thin root.</p><p>\"Does it hurt when I press here?\" he asked.</p><p>\"No,\" Roderick said. His voice was barely above whisper.</p><p>Doolittle probed a different spot. \"And now?\"</p><p>\"No.\"</p><p>The medmage let go and patted Roderick's shoulder. \"I do believe we're done for tonight.\"</p><p>\"Ice-cream now?\" Roderick asked, his voice quiet.</p><p>\"Ice-cream now,\" Doolittle confirmed. \"Lena!\"</p><p>A female shapeshifter stuck her red head into the room.</p><p>\"This young gentleman is in need of ice-cream,\" Doolittle said. \"He's earned it.\"</p><p>\"Oh boy!\" Lena made big eyes and held out her hand. \"I better pay up then. Come on.\"</p><p>Roderick hopped off the chair and took her hand very carefully.</p><p>\"What kind of ice-cream would you like?\" Lena asked, leading him through the doorway.</p><p>\"Chocolate,\" the boy said quietly, with a slight hesitation in his voice.</p><p>\"I've got loads of chocolate...\"</p><p>The door swung shut behind them.</p><p>Doolittle looked at the door and sighed. \"The necklace is rooted in the sternomastoid. If I try to cut it out, he will bleed out. You said his mother put this atrocity on him?\"</p><p>\"Yes,\" Curran said.</p><p>\"The collar glowed when the husband came near,\" I said. \"He was reaching for it and she yanked it away from him and snapped it on the boy.\"</p><p>\"So it was probably intended for her husband,\" Doolittle said.</p><p>\"That or it's an equal opportunity offender,\" I said. \"Any neck will do and the boy was the closest.\"</p><p>\"And it killed the girl instantly?\" Doolittle asked. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Pretty much,\" Curran said.</p><p>\"Strange. It doesn't seem to be actively harming the boy at the moment beyond rooting in.\"</p><p>\"Does it hurt him?\" I asked.</p> <p>\"Doesn't appear so.\" Doolittle leaned against the chair. \"The 'roots' shift under pressure so any attempt to cut the necklace will likely cause it to contract. I don't want to fool with it.\"</p><p>\"The woman,\" Curran said.</p><p>I thought out loud. \"She was unaffected by the glow, so either she's immune or she knows how it works.\"</p><p>\"The boy didn't cry when you took him from his mother?\" Doolittle asked.</p><p>\"No,\" I said.</p> <p>The medmage glanced at the door again. \"The child is very passive and compliant. He doesn't speak unless spoken to. He doesn't take initiative. This boy is doing his best to be invisible. Sometimes this is a sign of shy nature. Sometimes it's a sign of emotional abuse or neglect.\" Doolitle crossed his arms. \"Such an accusation can't be made lightly. This is just something to keep in mind in dealing with her. If she is emotionally distant, she may not have any attachment to him. Let me run some tests. The sooner we will identify what the necklace is, the better.\"</p><p>We left the infirmary and walked down the long hallway, heading toward the stairway leading up to the top of the tower, to our rooms. The Keep's hours were skewed toward the night. For most people ten pm meant evening and probably bedtime - both electricity and charged air were expensive and people tended to make the best of daylight. For shapeshifters ten pm was closer to four in the afternoon. The hallways were busy. Random shapeshifters ducked their heads as we passed them.</p><p>Something had occurred to me. \"When the journeyman handed Amanda the necklace, did it seem paler to you?\"</p><p>Curran frowned. \"Yes. Almost white gold.\"</p><p>\"And now it's almost orange.\"</p><p>\"You think it feeds on the host?\"</p> <p>\"It would make sense. Maybe it develops hunger. The girl died instantly, because the necklace was hungry. Now it's satiated, so it's biding its time.\"</p><p>\"We'll need to talk to the journeyman,\" Curran said. \"And the woman.\"</p><p>\"Yes, the woman. The supernaturally beautiful woman with long flowing hair... Can't forget her.\"</p><p>Curran turned his head to look at me.</p><p>\"What?\"</p><p>\"That's what I would like to know.\"</p><p>I shrugged. \"I will speak to the journeyman tomorrow.\"</p><p>\"I'll come with you.\"</p> <p>And why would he want to do that? I pictured trying to conduct an interview in the presence of the Beast Lord. The journeyman would take one look at him and run for the hills screaming.</p><p>\"No.\"</p><p>\"You always say that word,\" he said. \"Is it supposed to mean something?\"</p><p>\"It means I don't want you to come with me. The moment you muscle your way into the room, he'll clam up out of sheer self-preservation. Let me handle this.\"</p><p>We started up the stairway. Our quarters were at the very top and I really could've used an elevator right about now.</p><p>Curran kept his voice even. \"Somehow I have managed to deal with the People just fine for almost fifteen years without your help.\"</p><p>\"As I recall, without my help you almost had yourself a war. And I won't be dealing with People. I'll be dealing with one specific journeyman facing sanctions and scared out of his mind.\"</p><p>\"If you really think Ghastek will let you anywhere near him without me you're crazy,\" Curran said.</p><p>I stopped and looked at him. \"I will take my boudas and the personal guard, dress them in black, put them on horses, and ride up to the Casino. Then I will pick the scariest looking shapeshifter in the bunch and send him in to announce that the Consort seeks an audience. Do you really think the People will keep me waiting for long?\"</p><p>It's good that we didn't have any kindling or paper around or the sparks flying from our butting heads would set the Keep on fire. We were both tired and pissed off.</p><p>Above us Jim rounded the corner on the landing and came to a dead stop, obviously thinking if he could get away with turning on his foot and going into a completely different direction. Curran turned to face him.</p><p>That's right, you're busted.</p><p>Jim sighed and headed toward us at a brisk pace.</p><p>Tall, with the skin the color of rich coffee, and dressed all in black, Jim looked like was carved from a block of solid muscle. Logic said that at some point he must've been a baby and then a child, but looking at him one was almost convinced that some deity touched the ground with its scepter and proclaimed, \"There shall be a badass,\" and Jim sprung into existence, fully formed, complete with clothes, and ready for action. He was the alpha of Clan Cat, pack's Chief of Security, and Curran's best friend.</p><p>He braked near us.</p><p>\"Have you vetted the Wolves of the Isle yet?\" Curran asked.</p><p>\"No.\"</p><p>\"Who are the Wolves of the Isle?\" I asked.</p><p>\"It's a small pack from Florida Keys,\" Curran said. \"Eight people. They're petitioning to join us and for some odd reason our Security Chief is dragging his feet on the background checks.\"</p><p>Jim waved the stack of paper in his hand. \"The Security Chief has two thefts, four murders, and an abandonment of post to deal with.\"</p><p>\"Murders?\" I asked.</p><p>Jim nodded.</p><p>\"I gave my word to the wolves,\" Curran said.</p><p>\"I'm not opposed to admitting them.\" Jim spread his arms. \"All I'm saying is let me make sure people we have are safe before we add any more to them. By the way, Kate, did you review the Guild documents I sent you?\"</p><p>Deflecting the attention, are we? I gave him my tough stare. It bounced off Jim like hail from the pavement. \"Somewhat. I was busy.\"</p><p>\"See?\" Jim pointed to me. \"Your mate is doing the same thing I'm doing. Prioritizing.\"</p><p>I would get him for this. Oh yes.</p><p>Curran looked at Jim. \"Do you need my help with the background checks?\"</p><p>A muscle in Jim's face jerked. \"No, I've got it.\"</p><p>Ha! He didn't want Curran in his hair either. \"Don't worry, he's coming with me to investigate things.\"</p><p>\"In the city?\" Jim asked.</p><p>\"Yes.\"</p><p>\"That's a great idea. You both should go. To the city.\"</p><p>Curran and I looked at each other.</p><p>\"He's trying to get rid of us,\" I said.</p><p>\"You think he's planning a coup?\" Curran wondered.</p><p>\"I hope so.\" I turned to Jim. \"Is there any chance you'd overthrow the tyrannical Beast Lord and his psychotic Consort?\"</p><p>\"Yeah, I want a vacation,\" Curran said.</p><p>Jim leaned toward us and said in a lowered voice, \"You couldn't pay me enough. This is your mess, you deal with it. I have enough on my plate.\"</p><p>He walked away.</p><p>\"Too bad,\" Curran said.</p><p>\"I don't know, I think we could convince him to seize the reins of power.\"</p><p>Curran shook his head. \"Nahh. He's too smart for that.\"</p><p>We finally made it up the stairs, through the long hallway, up the second flight and into our quarters. I dropped my bag down, shrugged off the leather sheath with my sword in it, and took a deep breath. Aahh, home.</p><p>Generally tackling someone from behind is very effective, because the person doesn't know you're coming. However, after being tackled a dozen times, the victim becomes accustomed to it. Which is why when Curran made a grab for me, I danced aside and tripped him. He grabbed my arm, then we did some rolling on the floor, and I ended up on top of him, our noses about an inch apart.</p><p>He grinned. \"You're jealous.\"</p><p>I considered it. \"No. But when you stared at that woman like she was made of diamonds, it didn't feel very good.\"</p><p>\"I stared at her because she smelled strange.\"</p><p>\"Strange how?\"</p><p>\"She smelled like rock dust. Very strong dry smell.\" Curran put his arms around me. \"I love it when you get all fussy and possessive.\"</p><p>\"I never get fussy and possessive.\"</p><p>He grinned, showing his teeth. His face was practically glowing. \"So you're cool if I go over and chat her up?\"</p><p>\"Sure. Are you cool if I go and chat up that sexy werewolf on the third floor?\"</p><p>He went from casual and funny to deadly serious in half a blink. \"What sexy werewolf?\"</p><p>I laughed.</p><p>Curran's eyes focused. He was concentrating on something.</p><p>\"You're taking a mental inventory of all people working on the third floor, aren't you?\"</p><p>His expression went blank. I'd hit the nail on the head.</p><p>I slid off him and put my head on his biceps. The shaggy carpet was nice and comfortable under my back.</p><p>\"Is it Jordan?\"</p><p>\"I just picked a random floor,\" I told him. \"You're nuts, you know that?\"</p><p>He put his arm around me. \"Look who is talking.\"</p><p>We lay together on the carpet.</p><p>\"We can't let the necklace kill that boy,\" I said.</p><p>\"We'll do everything we can.\" He sighed. \"I'm sorry about the dinner.\"</p><p>\"Best date ever. Well, until people died and vampires showed up. But before that it was awesome.\"</p><p>We lay some more.</p><p>\"We should go to bed.\" Curran stretched next to me. \"Except the carpet is nice and soft and I'm tired.\"</p><p>\"You want me to carry you?\"</p><p>He laughed. \"Think you can?\"</p><p>\"I don't know. Do you want to find out?\"</p><p>It turned out that carrying him to our bed wasn't necessary. He got there on his own power and he wasn't nearly as tired as he claimed to be.</p><p>Morning brought a call from Doolittle. When we got there, Roderick was sitting on the cot, the same owlish expression on his face. The necklace had lost some of its yellow tint during the night. Now it looked slightly darker than orange rind.</p><p>I crouched by the boy. \"Hi.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Roderick looked at me with his big eyes. \"Good morning.\"</p><p>His voice was weak. In my mind the necklace constricted around his fragile neck. The bone crunched...</p><p>We had to get a move on. We had to get it off him.</p><p>Doolittle lead us toward the door and spoke quietly. \"There is a definite change in the color of the metal. He's beginning to experience discomfort.\"</p> <p>\"So that thing is getting hungry,\" Curran said.</p><p>\"Probably.\" Doolittle held up a small print out. A pale blue stripe cut across the paper. The m-scan. The m-scanner recorded colors of magic: purple for vampire, green for shapeshfiter, and so on. Blue stood for plain human magic: mages registered blue, telepaths, telekinetics. It was your basic human default.</p><p>\"Is that the necklace or Roderick?\" Curran asked.</p><p>\"It's the boy. He has power and it's obscuring whatever magic signature the necklace is giving out.\" Doolittle pointed to a point on the graph. I squinted. A series of paler sparks punctured the blue.</p><p>\"This is probably the necklace,\" Doolittle said. \"It's not enough to go on. We need a more precise measurement.\"</p> <p>We needed Julie. She was a sensate - she saw colors of magic with more precision than any m-scanner. I stuck my head out into the hallway and called, \"Could someone find my kid please and ask her to come down here?\"</p><p>Five minutes later Julie entered the medward. When I found her, she had been half starved, skinny, and had anxiety attacks if the protective layer of grime was removed from her skin. Now at fourteen, she had progressed from skinny to lean. Her legs and arms showed definition if she flexed. She was meticulously clean, but recently she decided that invention of brushes was a waste of time, so her blond hair looked like a cross between a rough haystack and a bird nest.</p><p>I explained the necklace. Julie approached the boy. \"Hey. I'm going to look at the thing on your neck, okay?\"</p><p>Roderick said nothing.</p><p>Julie peered at the metal. \"Odd. It's pale.\"</p><p>\"Pale yellow? Pale green?\" Any tint was good.</p> <p>\"No. It looks colorless, like hot air rising from the pavement.\"</p><p>Transparent magic. Now I had seen everything.</p><p>\"There are runes on it,\" Julie said.</p><p>\"Can you read them?\" Curran asked.</p><p>She shook her head. \"It's not any runic alphabet they taught us.\"</p><p>Dolittle handed her a piece of paper and a pencil and she wrote five symbols on it. Runes, the ancient letters of Old Norse and Germanic alphabets, had undergone several changes over the years, but the oldest runes looked the way they looked because they had to be carved into a hard surface: all straight lines, no curves, no tiny strokes. These symbols definitely fit that pattern, but they didn't look like any runes I'd seen. I could spend a day or two digging through books, but Roderick didn't have that long. We needed information fast.</p><p>Curran must've come to the same conclusion. \"Do we know any rune experts?\"</p><p>I tapped the paper. \"I can make some calls. There is a guy. Dagfinn Heyerdahl. He used to be with Norse Heritage Foundation.\"</p> <p>Norse Heritage Foundation wasn't so much about heritage as it was about viking, in the most cliché sense of the world. They drank huge quantities of beer, they brawled, and they wore horned helmets despite all historical evidence to the contrary.</p><p>\"Used to be?\" Curran asked.</p><p>\"They kicked him out for being drunk and violent.\"</p><p>Curran blinked. \"The Norse Heritage?\"</p><p>\"Mhm.\"</p><p>\"Don't you have to be drunk and violent just to get in?\" he asked. \"Just how disorderly did he get?\"</p><p>\"Dagfinn is a creative soul,\" I said. \"His real name is Don Williams. He packs a lot of magic and if he could have gotten out of his own way, he would be running the Norse Heritage by now. He's got a rap sheet as long as the Bible, all of it petty stupid stuff, and he's the only merc I know who actually works for free, because he's been fined so many times, it will take him years to get out of Guild's debt. About two years ago, he got piss-drunk, took off all of his clothes, and broke through the gates of a Buddhist meditation center on the South side. A group of bhikkhunis, female monks, was deep in meditation on the grounds. He chased them around, roaring something about them hiding hot Asian ladies. I guess he mistook them for men, because of the robes and shaved heads.\"</p><p>\"And why didn't anybody pointed the error of his way to this fool?\" Doolittle asked.</p><p>\"Perhaps because they are Buddhists,\" Curran said. \"Violence is generally frowned upon in their community. How did it end?\"</p><p>\"Dagfinn pulled a robe off one of the nuns and an elderly monk came up to him and hit him in the chest with the heel of his hand. Dagfinn did some flying and went through the monastery wall. Bricks fell on his face and gave him a quickie plastic surgery. Since the old monk had raised his hand in anger, he went into a self-imposed seclusion. He still lives near the Stone Mountain in the woods. He was greatly revered and the monks got pissed off and went to see the Norse Heritage Foundation. Words were exchanged and the next morning the Foundation gave Dagfinn the boot. The neo-Vikings will know where he is. They kicked him out, but he's still their boy.\"</p><p>Curran nodded. \"Okay, we'll take a Jeep.\"</p><p>\"They don't permit any technology past fourteenth century AD in their territory. You'll have to ride a horse.\"</p><p>Curran's face snapped into a flat Beast Lord expression. \"I don't think so.\"</p><p>\"You can jog if you want, but I'm getting a horse.\"</p><p>A low rumble began in Curran's throat. \"I said we'll take the Jeep.\"</p><p>\"And I said they will put an axe into your carburetor.\"</p><p>\"Do you even know what a carburetor is?\" Curran asked.</p><p>I knew it was a car part. \"That's irrelevant.\"</p><p>Doolittle cleared his throat. \"My lord, my lady.\"</p><p>We looked at him.</p><p>\"Take it outside my hospital before you break anything.\" It didn't sound like a request.</p><p>A careful knock echoed through the door. A young woman stuck her head in. \"Consort?\"</p><p>What now? \"Yes?\"</p><p>\"There is a vampire downstairs to see you.\"</p><p>Chapter Four</p><p>The vampire sat on his haunches in the waiting room, a thin emaciated monstrosity. Vampires were midnight predators. Daylight burned their skin, but the People had recently gotten around it by applying their own patented brand of sunblock. It dried thick and came in assorted colors. This particular vampire sported a coat of bright lime-green. The sunblock covered the undead completely, every wrinkle, every crevice, every inch. The ffect was vomit-inducing.</p><p>The undead turned its head as I walked in, its eyes focusing on me with intelligence of a navigator sitting in an armored room miles away. The nightmarish jaws opened.</p><p>\"Kate,\" Ghastek's dry voice said. \"Curran. Good morning.\"</p><p>\"What are you doing here?\" Curran asked.</p><p>The vampire folded itself, perching in the chair like some mummified cat. \"I have a direct interest in discovering the nature of that necklace. We have suffered great loses, we must account for them. Have you found a way to remove it?\"</p><p>\"No,\" I said.</p><p>\"So the boy's life is still in jeopardy,\" Ghastek said.</p><p>Thank you, Captain Obvious.</p><p>\"It's being handled,\" Curran said.</p><p>\"I would like to be involved in that handling.\"</p><p>\"I'm sure you would,\" Curran said. \"It's hard to believe, but I go whole days without worrying about your likes and dislikes.\"</p><p>The vampire opened its mouth, imitating a sigh. It was an eerie sight: his jaws unhinged, his chest moved up and down, but no air came out.</p><p>\"I believe in civil discourse, so please forgive me if I sound blunt: you took a child away from his parents against their will. In other words, you abducted him by force. Last time I checked that constituted a kidnapping. I have a very capable staff, which, should I give the word, would present a very compelling case to the PAD.\"</p><p>\"The PAD can bite me,\" Curran said. \"I also have a very capable staff. I'll drown you in paper. How would you like to be sued?\"</p><p>\"On what grounds?\" The vamp looked outraged.</p><p>\"Reckless endangerment.\" Curran leaned forward. \"Your journeymen dropped two vampires in the middle of a crowded restaurant.\"</p><p>\"There were extenuating circumstances and you were unharmed.\"</p><p>Curran's eyes acquired a dangerous glint. \"I'm sure the public will take that into account, especially after my people steamroll the sordid horror story of the Arirang Massacre over every newspaper they can find.\"</p><p>The vamp bared its fangs.</p><p>Curran's upper lip trembled in a beginning of a snarl.</p><p>I stabbed a throwing knife into the table between them.</p><p>The man and the undead fell silent.</p><p>\"There is a child being slowly choked to death upstairs,\" I said. \"If the two of you could stop baring your teeth for a second, you might even remember that.\"</p><p>Silence stretched.</p><p>\"I simply wish to help,\" Ghastek said.</p><p>Yeah right.</p><p>Curran's face looked set in stone. \"We don't need you.\"</p><p>\"Yes, you do,\" Ghastek said. \"You have the necklace, but I have Lawrence. He dated Amanda for over a year. I think you will be interested to know that Colin Sunny, Amanda's father, has a sister. She is married to Orencio Forney.\"</p><p>\"Orencio Forney, the DA?\"</p><p>\"Precisely,\" Ghastek said. \"After yesterday's affair, the Sunnys are staying in Forney's house. I trust you understand the implications.\"</p><p>I understood them, alright. The Sunnys had just became untouchable. If the Pack attempted to pick a fight with the DA, the tide of negative publicity would drown us, not to mention that every cop in the city would make it their personal mission to complicate shapeshifters' lives whenever possible.</p><p>Curran's face hardened into that blank, unreadable expression. He saw the writing on the wall as well, and he didn't like it. \"Have you asked for an interview?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"In the politest terms possible. We were extremely persuasive, but they are unavailable for comment.\"</p><p>\"They aren't asking for Roderick?\" What the hell?</p><p>\"No, they are not,\" Ghastek said. \"I found it extremely odd as well. The DA has circled the wagons. If you want any background on the boy and his mother, our Lawrence is your best bet. Give me access and I will share.\"</p> <p>I looked at Curran. We needed that background.</p><p>His face was unreadable.</p><p>Come on, baby.</p><p>\"Fine,\" he said.</p><p>A wise man once told me that a man's house said a lot about his soul. Over the years I had come to the conclusion that it was complete bullshit. The Keep, with its foreboding, grim towers and massive fortifications, might have indicated something about Curran's need to protect his people, but it said nothing about how much responsibility he dragged around. It said nothing about the fact that he was fair and generous. And it sure as hell gave no hint that underneath all that Beast Lord's roaring, he was hilarious.</p> <p>The Casino, on other hand, looked like a beautiful mirage born of desert heat, sand, and magic. White and so elegant, it nearly floated above the ground of the large lot decorated with fountains, statues, and colored lamps. All that beauty hid a vampire stable. Undead, forever hungry and gripped in the steel vise of navigators' minds, haunted its slim minarets. A casino milking money from the human greed occupied its main floor, and deep inside it, the People brewed their schemes and machination with ruthless precision of a high-tech corporation, interested only in results and profits.</p><p>I parked the Jeep in the parking lot and peered at the Casino palace through the windshield. I didn't want to go in. Judging by the surly look on his face, Curran didn't want to go in either.</p><p>We opened our doors at the same time and headed toward the Casino.</p><p>\"We're doing this for the child,\" Curran said.</p><p>\"Yes.\" It was good to remember that. \"We're just going to go in and talk to them.\"</p><p>\"And not kill anybody,\" Curran added.</p> <p>\"Or anything.\"</p><p>\"And not break things.\"</p><p>\"Because we don't want a giant bill from the People.\"</p><p>\"Yes.\" Curran's face was grim. \"I'm not giving them any of the Pack's money.\"</p><p>I nodded. \"We'll be good, we won't have to pay any damages, and then we'll come out and take a nice shower.</p><p>\"Wash the stench off. I can smell the bloodsuckers from here.\"</p><p>\"I can feel them from here.\"</p><p>I could - the sparks of vampiric magic tugged on me from the white parapets.</p> <p>\"Thanks for doing this,\" Curran said.</p><p>\"Thank you for coming with me.\"</p><p>Get in, get out, not cause a giant war between the Pack and the People. Piece of cake.</p><p>We passed through the tall arched entrance guarded by two men with curved yataghan swords. The guards wore black and looked suitably menacing. They very carefully didn't look at us.</p><p>Inside a deluge of sound assaulted us: the noises of slot machines, refitted to work during magic, metal ringing, music, beeping, mixing with shouts from the crowd surrendering their hard-earned money for the promise of easy cash. Lemon-scented perfume drifted through the cold air - the People were keeping their customers awake, because the sleeping couldn't gamble.</p><p>Curran wrinkled his noise.</p><p>\"Almost there, baby,\" I told him, zeroing in on the service entrance door at the far end of the vast room.</p><p>A large overweight man spun away from the machine and ran into Curran. \"Hey! Watch it!\"</p><p>Curran sidestepped him and we kept walking.</p><p>\"Asshole!\" The man barked at our backs.</p><p>\"I love this place,\" Curran said.</p><p>\"It's so serene and peaceful, and filled with considerate people. I thought you'd enjoy the ambiance.\"</p><p>\"I adore it.\"</p><p>We passed through the service entrance. One of the journeymen, a man in a black trousers, black shirt, and dark purple vest rose from behind the desk.</p><p>\"How can I help you?\"</p><p>\"It's alright, Stuart.\" A woman descended the stairway on the side, walking into the room. She was five two and looked like anatomical impossibility made of adolescent boys dreams. Tiny waist, generous hips, and an award-winning chest, wrapped in dusky silk. Her hair fell down past her butt in red wavy locks, and when she smiled at you, you had a strong urge to do whatever she asked. Her name was Rowena and she ran the People's PR and piloted undead for a living.</p><p>She was also in debt to the witches, which in a round-about way caused her to be in debt to me. If I asked a favor, she had to do it, the fact which we both hid from everyone.</p><p>\"Mr. Lennart. Ms. Daniels.\" Rowena fired off a beautiful smile. \"Lawrence is waiting for you upstairs. Follow me, please.\"</p><p>We followed, Rowena's shiny perfect butt shifting as she walked the stairs two feet in front of us. Curran heroically didn't look at it.</p><p>She led us to a small room with a two way mirror. One would've expected a table, severe grey walls, and chairs bolted to the floor, but no, the room's walls were cream with a delicate pale lattice carved at the top and the furniture consisted of a modern sofa and two soft chair set with a coffee table between them. Lawrence sat in the corner of the sofa. He looked pale and his eyes were bloodshot.</p><p>We sat in the chairs.</p><p>\"Do you know who we are?\" Curran said quietly.</p><p>Lawrence nodded. \"I've been briefed. I'm supposed to cooperate.\"</p><p>I pulled out a notepad from my pocket. \"How long did you know Amanda?\"</p><p>Lawrence swallowed. \"Three years. She was admitted as an apprentice right after her high school graduation.\"</p><p>\"How long have you dated?\" I asked.</p><p>\"Thirteen months next week,\" he said. His voice was hoarse. He cleared his throat.</p><p>\"Tell us about her family,\" Curran said.</p><p>Lawrence sighed. \"She didn't like them.\"</p><p>\"Why not?\" I prompted.</p><p>\"She said her mother was very cold. Aurellia would go through the motions, make sure that Amanda and her brother were fed and appropriately dressed. She was very specific about their schedule. The Steel Calendar, Amanda called it. If they had to have a doctor's appointment or a school trip, it was put on the calendar and there was no deviation from it. Amanda had perfect attendance the entire four years in high school. No matter how sick she was, her mother would send her to school. Never late. But there was never any love or real warmth there.\"</p><p>\"And her father?\" Curran asked.</p><p>\"Colin worships the ground Aurellia walks on.\" Lawrence gave a bitter laugh. \"It's like he is blind when she's in the room. The only time Amanda could talk to him was when her mother was otherwise occupied. She couldn't wait to get out of there. She told me that's why she enlisted with People. The apprentices qualify for room and board in the Casino.\"</p><p>\"Was her mother upset because Amanda did this?\" I asked.</p><p>\"Aurellia doesn't get upset. She is like a pretty robot,\" Lawrence said. \"Never screams. Never loses her temper. I don't think she cared one way or another.\"</p><p>\"Have you ever interacted with the parents personally?\" Curran asked.</p><p>\"Yes. We went to a dinner once. Colin seemed normal. Aurellia didn't speak, except when she ordered her food. I got a feeling she does only what is required of her, and talking to me or Amanda wasn't required.\"</p><p>\"What about the necklace?\" I asked.</p><p>Lawrence took several shallow rapid breaths.</p><p>We waited.</p><p>\"It was a gift,\" he finally said. \"It arrived to the house one Christmas, addressed to Colin. He took it out of the box - it was in a glass case - and tried to open it, and then Aurellia took it out of his hands. They put the necklace into a glass box and hung it on the wall in their foyer really high up. Amanda was about fifteen at the time. She loved it. She said she used to stand there and look at it, because it was so beautiful. She was never allowed to touch it. They had a break-in six months ago. The burglars took some jewelry, money, and somehow got the necklace down and made off with it. She was really upset about it.\"</p><p>Lawrence looked at his hands. \"I saw it at a pawnshop a week ago. I bought it for her. I... I killed her. She was so nice, so beautiful. She would sing little songs sometimes to herself when she was thinking about something or when she made coffee. And I killed her. She put it on and she just... she just died. I was right there and I couldn't do anything...\"</p><p>We stayed with him for another ten minutes, but Lawrence was done.</p><p>Ghastek waited for us in the hallway.</p><p>\"Please tell me he's on suicide watch,\" Curran said.</p><p>\"Of course,\" the Master of the Dead said. \"He is under the care of a therapist, he's given access to the priest, and he is watched even when he sleeps. However, if he truly wants to kill himself, there is nothing any of us can do. It is unfortunate. He is nearing the end of his five-year journeymanship. We've invested a lot of money and time into his education.\"</p><p>Of course. How silly of me to forget: People didn't employees, they had human assets, each of which with a price tag attached.</p><p>\"I've examined your drawing of the writing on the necklace,\" Ghastek said. \"You said it appears to be a runic script of some sort but the characters are unfamiliar to me. How accurate is this drawing?\"</p><p>\"As accurate as humanly possible,\" I told him.</p><p>He raised his eyebrows. \"Are you familiar with term 'human error?'\"</p><p>Are you familiar with the term knuckle sandwich? \"The person who copied the runes from the necklace is an expert at what they do. Just because you don't recognize the script doesn't mean it's not runic in origin. The Elder Futhark alphabet had undergone many modifications over the years.\"</p><p>Ghastek took out copy of the Julie's drawing. \"I've studied this subject extensively and I've never seen a rune like this.\" Ghastek pointed to a symbol that looked like a X with a double left diagonal arm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Well, of course. He didn't know it, therefore it couldn't possibly be a rune. \"Both Fehu and Ansuz runes have double arms. Why couldn't this rune have one? If you tossed it into a collection of runes and told a layman to pick out one that doesn't belong, he wouldn't grab that one.\"</p><p>Ghastek gave me a condescending look. \"The term layman refers to a non-expert by its definition. Of course a non-expert wouldn't be able to single out this rune, Kate. We could throw stars and spirals into the mix and he would be unlikely to pick those out either.\"</p><p>You conceited ass.</p> <p>Curran cleared his throat.</p><p>I realized I had taken a step toward Ghastek. No killing, no punching, no destruction of property. Right.</p><p>\"We're taking this matter to an expert,\" Curran said.</p><p>\"I think it's prudent, considering the circumstances.\"</p><p>Oh well, so good of him to give us his permission.</p> <p>\"Where is the expert?\" Ghastek asked.</p><p>\"At the Norse Heritage,\" I told him.</p><p>Ghastek wrinkled his face into a semblance of a disgusted sneer, as if he'd just stuck his head into a bag of rotten potatoes.</p><p>\"You're going to see the neo-Vikings?\"</p><p>\"Yes.\"</p><p>\"They're ignorant loud buffoons. All they do is sit in their mead hall, get drunk, and punch each other when their masculinity is threatened.\"</p> <p>\"You don't have to come,\" I told him.</p><p>Ghastek let out a long-suffering sigh. \"Very well. I'll get my vampire.\"</p><p>Chapter Five</p><p>I was riding a horse called The Dude. The Dude, who also apparently answered to Fred if he was feeling charitable, was what the Pack stables had called a \"Tennessee Walker Blue Roan.\" The blue roan part was somewhat true - the horse under me was dark grey, with the colors nearing black toward the head and the ankles. The Tennessee Walker part... Well, some Tennessee Walker was probably in there, but most of it was definitely a coldblood horse. A massive coldblood horse, close to twenty five hundred pounds. I was betting on a Percheron. Sitting atop The Dude was like riding a small elephant.</p><p>The presence of a vampire presented Curran with a dilemma. He refused to ride a horse, but he refused to let me travel in a company of an undead without backup either, so a compromise had to be reached. We stopped by Cutting Edge office to get Andrea. Unfortunately, she was out. Apparently some shapeshifters were murdered and Jim pulled her in to head that investigation, the fact that he, of course, neglected to mention. We kidnapped Derek and Ascanio instead.</p><p>Derek was our third employee. Once my sidekick, then Jim's spy, then a chief of Curran's personal guard, he was now working for the Cutting Edge to acquire experience and figure out what it was he wanted to do. When I first met him, he was barely eighteen and pretty. Now he was close to twenty. Some bastards had poured molten silver on his face. The bastards were now dead, but he'd never healed quite right.</p><p>Ascanio was our intern. He was fifteen, he was pretty as an angel, and he was a bouda, a werehyena. Bouda children rarely survived adolescence - many of them lost the fight for their sanity and went loup - and Ascanio was treasured, babied, and spoiled beyond all reason. Unfortunately, he'd gotten in trouble one too many times and was given to me, because it was decided I was the least likely to kill him.</p><p>Derek and Ascanio rode behind me, bickering quietly about something. Ahead of me the lime-green nightmare that was Ghastek's vampire trotted along the road in a jerky, looping gait. Most vampires eventually lost their ability to run upright, reverting to quadruped locomotion as the Immortus pathogen reshaped its victim's body into a new nightmare predator. I had come across very old vamps before. They didn't even resemble their former human shapes. But the vamp Ghastek piloted was only a few months old. It loped forward, scuttling along the ground, and shambling two thirds upright the next like some grotesque puppet on the strings of a drunken puppeteer.</p> <p>Next to the vampire cantered a freakishly large black poodle. His name was Grendel, he was my dog, and while he wasn't the sharpest tool on the shed, he loved me and he was handy in a fight.</p><p>A few dozen yards behind us, an enormous lion trotted. When shapeshifters transformed, their animal forms were always larger than their natural counterparts, and Curran the Lion wasn't just large. He looked prehistoric. Colossal, grey, with faint darker stripes staining his fur like whip-marks, he moved along the road at an easy pace, seemingly tireless. Which was why I ended up with The Dude. I had walked into the stables and told them I'd be traveling between a vampire and a lion the size of a rhino and I needed a horse that wouldn't freak out. True to the stable master's recommendation, The Dude seemed unflappable. Occasionally, when Curran flanked us, he would flare his nostrils a bit while the other two horses shied and made panicked noises, but mostly The Dude just pounded his way in a straight line, convinced that the lion was a figment of his imagination and that the vampire ahead of him was just Grendel's deformed mutant brother.</p><p>We were our own three ring circus. Sadly we had no audience: to the left of us forest rose in a jagged line and to the right a low hill climbed up, rocks and grass, before running into another line of trees at the apex.</p><p>\"I've never met the neo-vikings,\" Ascanio said.</p><p>\"A good portion of them are mercs,\" I said over my shoulder. \"They're a rowdy lot and not really what you would call true to tradition. Some are, but most are there because they saw a movie or two in childhood and think viking is a noun.\"</p><p>\"It's not?\" Derek asked.</p><p>\"No. Originally it was a verb as in to go viking. The Norse Heritage guys wear horned helmets, drink beer out of a giant vat, and start fights. As neo-Viking communities go, they are better off financially than most so they can afford to have some fun.\"</p><p>\"Where do they get their money?\" Derek asked.</p><p>I nodded at the curving road. \"Around that bend.\"</p><p>A couple of minutes later we cleared the curve. A vast lake spread on our left. Blue-green water stretched into the distance, tinted with bluish haze. Here and there green islands ringed with sand thrust through the water. To the right, an enormous mead hall built with huge timbers rose from the crest of a low hill like the armored back of some sea serpent. As we stood there, two karves, the longboats, slid from behind the nearest island, their carved dragon heads rising high above the lake's surface.</p><p>Ascanio raised his hand to shield his eyes.</p><p>\"Lake Lanier,\" I told him. \"The Norse Heritage has built a river fleet of Dragon Ships. They're not the only neo-Vikings in the region. There are several Norse groups along the Eastern seaboard and quite a few of them want to cruise up and down the coast in a proper boat. The Norse Heritage sells them boats and trains these wannabe raiders for shallow water sailing. They also give vacationers a ride for the right price. They're kind of touchy about it, so I wouldn't ask if they do children parties.\"</p><p>Ascanio cracked a smile. \"Or what, they'll try to drown us in their beer vat?\" \"Try being the operative word.\"</p><p>We started toward the mead hall. Midway up the hill, the vampire paused. A man walked out in the middle of the road from behind a birch. Six and a half feet tall, he stood wrapped in chain mail. A cape of black fur billowed from his shoulders. His war helm, a near perfect replication of Gjermundbu Helmet, shielded the top of his head and half of his face. The stainless steel had been polished until the sun rays slid off of it, as if he wore a mirror on his head. The man carried an enormous single axe on a long wooden handle. I'd tried to pick up the axe once and it weighed about ten pounds at least. He was slower than molasses in January with it, but it looked impressive.</p><p>Derek focused on the big man. \"Who is that?\"</p><p>\"That's Gunnar. He's the Norse Heritage's idea of security detail.\"</p><p>\"What, all by himself?\"</p><p>I nodded. \"He's sufficient.\"</p><p>Ghastek's vampire stared the giant Viking, motionless like a statue, while the Master of the Dead mulled the situation over. The bloodsucker turned, scuttled toward us, and fell back in line behind my horse. Apparently, Ghastek decided that his vamp was too precious to risk.</p><p>We drew close.</p><p>Gunnar took a deep breath and roared, \"Vestu heill!\"</p><p>Ow. My ears. \"Hello, Gunnar.\"</p><p>He squinted at me through his facemask and dropped his voice down. \"Hey, Kate.\" He sounded slightly out of breath.</p><p>\"Good to see you.\"</p><p>He leaned on his axe, pulled the helmet off and wiped sweat off his forehead, revealing reddish hair braided on his temples. \"You heading up to see Ragnvald?\"</p><p>\"Yep.\"</p><p>\"All of you?\"</p><p>\"Yep.\"</p><p>\"Even the lion?\"</p><p>The lion opened his mouth, showing his big teeth. Yes, yes, you're bad. We know, Your Majesty.</p><p>\"Even the lion.\"</p><p>\"What about?\" Gunnar asked.</p><p>\"Dagfinn. You've seen him around?\"</p><p>Gunnar took a moment to spit into the dirt, making a big show of it. \"Nope. And all the better for it.\"</p><p>Bullshit. \"Too bad.\"</p><p>\"Yeah.\" Gunnar waved me on with the helmet. \"You're good to go.\"</p><p>\"Thanks.\"</p><p>We rode on.</p><p>\"He lied,\" Ascanio said.</p><p>\"Yep.\" Gunnar knew exactly where Dagfinn was. He took his clues from Ragnvald, and since he wasn't talking, the jarl probably wouldn't be talking either. This would not go well.</p><p>We rode up through the wooden gates to the mead hall. The rest of the settlement sat lower down the hill, past the mead hall: solid wooden houses scattered here and there. People walked to and fro, men in woolen tunic and cloaks, women in ankle length gowns and hangerocks, woolen apron-dresses. They were an assorted crew: some were white, some were black, some were Hispanic. A couple to our right looked Chinese. Norse Heritage took everyone in. Viking wasn't a nationality - it was the way of life. As long as you thought you were a Viking, you had a place at their table.</p><p>People gaped at Curran as we passed. The vampire and the rest of us got significantly less attention. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As we dismounted before the horse rail, I saw a familiar black Shire stallion in the pasture, segregated by himself. The huge horse stood almost eighteen and a half hands tall, the white feathers at his huge feet shaking every time he moved. A pale scar snaked its way up the horse's left shoulder. Hello, Magnus. Where is your master?</p><p>The stallion stared in my direction and bared his teeth. Now horses were giving me crap.</p><p>\"Mind your manners,\" I murmured.</p> <p>\"Best behavior,\" Ascanio assured me.</p><p>Mentioning that I was talking to a horse who couldn't hear me would've totally cramped my boss style, so I nodded and walked up to the mead hall.</p><p>A large, raw-boned woman barred my path. A large gun hung on her right hip and a small axe hung on her left.</p><p>\"Hrefna,\" I acknowledged her. We had run into each other in the Guild before. She was good with both knife and sword and rarely lost her temper.</p><p>\"Kate.\" Her voice was quiet. \"The lion has to stay outside.\"</p> <p>\"He won't like it.\"</p><p>The lion shook his mane.</p><p>\"I can't let him inside,\" Hrefna said. \"You bring him in, someone's going to make trouble just to see if they can put his head on their wall. I've got to do my job. It's your call.\"</p><p>I looked at Curran. The lion melted. Skin stretched, bones twisted, and human Curran straightened. He was completely nude. Gloriously nude.</p><p>Hrefna raised her eyebrows.</p><p>Curran pulled jeans and a shirt from my saddlebag.</p> <p>\"Well,\" Hrefna said. \"I always wondered why you went all shapeshifter. Explains things.\"</p><p>The vampire next to me rolled his blood-red eyes.</p><p>We walked inside the mead hall. The vampire, shapeshifters, the dog, and the lion man followed me.</p><p>A huge room greeted me. Twin rows of evenly spaced out tables ran parallel along the chamber. Originally the Vikings had tried to have the tables joined in two lines, but they couldn't sweep under them, so they went to plan B, which made their mead hall resemble a barbarian cafeteria. People mulled around the tables. Some ate, some talked, some oiled their weapons. The tables ran into a raised platform at the opposite end of the hall. On the platform a man sat in a large chair carved from driftwood and lined with furs. His shoulders stretched his blue woolen tunic. His face, framed by a glossy black mane of hair, was dark and carved with sharp precision. A narrow gold band sat on his head.</p><p>He glanced at us. Dark eyes took our measure. He noted Curran, frowned, and looked away pretending he didn't see us. Curran preferred to stay anonymous. Not many people besides the city heavyweights knew what he looked like. Ragnvald was trying to decide if the polite thing to do was to acknowledge Curran or pretend he wasn't there.</p><p>Before we left on this fun trip, we had discussed our strategy, and I volunteered to take the point. If Curran came in his official Beast Lord capacity, there would be ceremony and the whole thing would take much longer than needed. Besides, I knew the neo-Vikings better than he did, so it made sense for me to take the lead. Curran decided to go as a redshirt. Apparently it was some sort of disposable attendant term from some old TV show.</p><p>\"Is that the jarl?\" Ascanio whispered behind me.</p><p>\"Yes.\"</p> <p>\"But he's an Indian.\"</p><p>\"Choctaw,\" I told him. \"The vikings don't care how you look. They care how well you swing your axe.\"</p><p>I headed down between the tables with my little parade at my back. This would have been so much easier if I had come by myself.</p><p>About ten feet from the platform Ragnvald decided he couldn't ignore us any longer. \"Kate! Vestu heill! Long time no see.\"</p><p>Not long enough. \"Hello, Ragnvald. These are my associates.\" There. I didn't mention Curran by name. That should clue him in.</p><p>Ragnvald pushed himself off the chair. Upright he was over six feet tall. He took a step off the platform and nodded to me. \"I was just thinking of you.\"</p><p>\"It's probably because you saw me walk through the door and then pretended I wasn't here for the last couple of minutes.\"</p><p>Ragnvald's face split in a grin. \"I just couldn't believe my eyes. Alpha of the shapeshifters popping in unannounced. I'm shocked.\"</p><p>Oh you sonovabitch. He was still trying to turn this into some sort of spectacle. \"I'm not here in that capacity.\"</p><p>Ragnvald tapped his band. \"This never comes off. Best to remember it now. But come on, we'll talk business.\" He raised his voice, shaking the nearby cups. \"Someone bring drinks to our guests.\"</p><p>Why did everyone have to be so damn loud all the time?</p><p>Ragnvald nodded to a side table. \"Please.\"</p><p>He took a seat and I sat across from him. Curran joined me. The vampire tried to follow but a large woman in chain mail barred his way.</p><p>A girl half my age swept by and slammed two giant tankard filled with beer on the table. Ragnvald held his up. I smashed my tankard against his. Beer splashed. We raised the tankard and pretended to take much bigger gulps than we did.</p><p>Curran drank his beer. Apparently my taking the lead meant he went mute.</p><p>The young woman sashayed over to Ascanio and Derek and led them to a neighboring table. Judging by how hard her hips were working, she was open for business.</p><p>\"So, what brings you to our mead hall?\"</p><p>\"I'm looking for Dagfinn.\"</p><p>Ragnvald grimaced. \"What has he done now?\"</p><p>\"Just got some weird runes I need him to translate for me.\"</p><p>Ragnvald spread his arms. \"We haven't seen the man. You should talk to Helga about the runes.\"</p><p>I had made some calls this morning. \"We did talk to Helga. Talked to Dorte and old man Rasmus, too. They can't help us. Dagfinn is our best lead for now.\"</p><p>A huge older man staggered into the hall. Thick through the shoulders and slabbed with what my adoptive father had called hard fat, he moved in that peculiar careful way drunks do when they have trouble putting one foot in front of the other and don't want to pitch over. His leather vest sat askew on his large frame, his face was ruddy from cold or too much booze, and his long greying hair hung down in two braids, tangling with a mess of a grey beard.</p><p>It's all fun and games until the drunk Viking Santa shows up.</p><p>\"I don't know what to tell you.\" Ragnvald drank a tiny swallow of his beer. \"He isn't here. We expelled him months ago.\"</p><p>\"Is that so?\" Curran said.</p><p>\"It is,\" Ragnvald insisted.</p><p>The soused Saint Nick zeroed in on the vampire sitting on the floor by the table where the shapeshifters were looking at their beer. The drunk blinked his bleary eyes and shambled toward the vamp.</p><p>\"I hear the Guild is having a meeting soon,\" Ragnvald said.</p><p>\"That's what I've been told,\" I said.</p><p>The older Viking pointed at the vampire. \"What is this shit?\"</p><p>Nobody answered.</p><p>Santa upped his voice a notch. \"What is this shit?\"</p><p>\"Settle down, dad,\" a younger man said from the corner.</p><p>Santa pivoted to the speaker. \"Don't tell me to settle down, you stupid son of a whore.\"</p><p>\"You don't talk about mom that way.\"</p><p>\"I'll talk about her... I'll... what is this shit?\"</p><p>\"I also hear that the Pack has been called in to mediate.\" Ragnvald looked at me for a long moment so I'd register that it was important.</p><p>\"Aha.\"</p><p>\"We have fifteen full time members in the Guild,\" Ragnvald said.</p><p>I nodded. \"I know. You put in what, eight years?\"</p><p>\"Seven and some change.\"</p><p>Santa rocked back, took a deep breath and spat on the vamp.</p><p>Awesome. \"Are you going to do anything about that?\"</p><p>Ragnvald glanced over his shoulder. \"That's Johan. He's just having a bit of fun. About the mediation, Kate.\"</p><p>\"What about it?\"</p><p>The vamp unhinged his maw. \"Only a fool fights with drunks and idiots,\" Ghastek's voice said.</p><p>\"Are you calling me an idiot?\" Johan squinted at the vamp.</p><p>People at the other tables stopped eating and trickled over to watch closer. They smelled a fight coming and didn't want to miss the show. This wasn't going well.</p><p>The vampire shrugged, mimicking Ghastek's gesture. \"If a certain drunk spits on my vampire again, he will regret it.\"</p><p>Johan leaned back, a puzzled expression on his face. Apparently, Ghastek managed to stump him.</p><p>\"Which way are you leaning?\" Ragnvald said.</p><p>Nice try. \"Where is Dagfinn, Ragnvald?\"</p><p>\"I've told you twice now, he isn't here.\"</p><p>\"You've got to be kidding me. His house is here, his mother still lives here, and his stallion is out in the pasture.\"</p><p>\"He gave him to his mother,\" Ragnvald said.</p><p>\"He gave Magnus to his mother?\"</p><p>\"Yes.\"</p><p>\"That horse is a bloody beast. Nobody can ride him except Dagfinn. The only reason Magnus hasn't bitten Dagfinn's hand off by now is because every time he tries, Dagfinn bites him back. And you're telling me Dagfinn gave him to his mother? What is she going to do with him?\"</p><p>Ragnvald spread his arms. \"I don't know, use him for home protection or something. I'm not a psychic. I don't know what goes through that man's head.\"</p><p>\"You mean me?\" Johan roared. \"You mean I'll regret it?\"</p><p>Oh no. He finally got it.</p><p>\"Do you see any other fat old drunks making a spectacle of themselves?\" Ascanio asked.</p><p>Johan swung over to Derek. \"You! Slap a muzzle on your girlfriend.\"</p><p>Derek smiled. It was a slow controlled baring of teeth. I fought a shudder. The couple of guys to the left of us grabbed their chairs.</p><p>\"Derek, we're guests,\" I called out.</p><p>Curran chuckled quietly to himself. Apparently he found me amusing.</p><p>\"They need a lesson in hospitality,\" Ghastek said.</p><p>\"I'll show you hospitality.\" Johan sucked in some air.</p><p>\"Don't do it,\" Ghastek warned.</p><p>Johan hacked. The gob of spit landed on the vamp's forehead. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Suck on that!\" Johan pivoted to Derek. \"You're next!\"</p><p>Ascanio shot from his seat in a blur and punched Johan off his feet. Vikings swarmed. Someone screamed. A chair flew above us and crashed into the wall. Grendel bounced in place, barking his head off.</p><p>Ragnvald heaved an exasperated sigh. \"Which way are you leaning, Kate? Veterans or Mark?\"</p> <p>\"Are you going to tell me where Dagfinn is?\"</p><p>\"No.\"</p><p>Bastard. \"Then I guess I don't know which way I'm leaning.\"</p><p>Ragnvald looked at Curran. \"Seriously?\"</p><p>Curran shrugged his broad shoulders. \"It's her show.\"</p> <p>A tankard hurtled through the room and crashed against Ragnvald's back. He surged to his feet roaring. \"All right you fuckers, who threw that?\"</p><p>The second tankard took him straight in the forehead. He staggered and lunged into the full-out brawl raging in the middle of the mead hall. Fists flew, people growled, and above it all, Ghastek's vamp crawled up the wall to the ceiling, its left paw gripping pissed off Johan by his ankle.</p><p>I sighed, jumped on the table, and kicked some viking in the face.</p><p>My butt hurt, because some viking woman kicked me from behind while I was busy and the motion of my horse wasn't doing me any favors. The red spot on my shoulder promised to bloom into a baseball-sized bruise but other than that I got away scot-free. Derek sported a cut across his chest and Ascanio, whose shirt somehow got mysteriously ripped to shreds in the heat of the battle, was black and blue from the neck down. It wouldn't last more than a couple of hours and by the evening the lot of them would look like new, while I would be nursing a sore shoulder.</p><p>The wind brought a whiff of hops from Ghastek's vamp loping next to me. The vikings had tried to drown it in the barrel of beer and most of the green sunblock had come off, so Ghastek ended up rolling him in some mud to keep the skin damage to a minimum. The mud had dried to a nasty crust and the vamp looked like something that would come out of Grendel's tail end.</p><p>Grendel had spent most of the fight barking and biting random people and was now smeared with someone's vomit.</p> <p>Curran escaped unscathed, mostly because when people tried to assault him, he punched them once and then they didn't get up. He walked now next to my horse in his human form, a big smile on his face.</p><p>\"What?\" I asked him.</p><p>\"Good thing you took the lead on that one,\" he said. \"It could've gone badly and degenerated into a huge brawl.\"</p><p>\"Screw you.\"</p><p>\"Oh I hope you do, baby.\"</p><p>In your dreams.</p><p>\"And that's why I don't like visiting the neo-Vikings,\" Ghastek said, his voice dry. \"They're an uncivilized, idiotic lot and nothing good ever comes from it.\"</p><p>\"They started it,\" Ascanio said.</p> <p>\"Of course they started it,\" I growled. \"They're Vikings. That's what they do.\"</p><p>Ghastek cleared his throat. \"I can't help but point out that now Dagfinn knows we're looking for him. He may go into hiding.\"</p><p>\"Dagfinn doesn't do hiding. If he isn't involved in this mess, he'll show up on my doorstep demanding to know what's going on. If he is involved, he'll show up on my doorstep, waving his axe and trying to crush skulls. Works either way.\"</p><p>\"So we wait?\"</p><p>It made me grit my teeth. I'd hoped we'd get a hold of Dagfinn today. Roderick was running out of time, but there wasn't anything else we could do. \"We go home and wait.\"</p><p>Chapter Six</p><p>We parted ways with Ghastek and the four of us, Curran, Derek, Ascanio, and I, made our way back to the Keep. Jim waited for us on the stone steps as we rode into the courtyard.</p><p>\"What happened to you?\"</p><p>\"We went to see the Vikings,\" I told him.</p><p>\"This is nothing,\" Curran said. \"You should've seen what happened to the vampire.\"</p><p>Jim smiled.</p><p>I dismounted and gave The Dude's reigns to a shapeshifter kid from the stables.</p><p>\"Some people are here to see you,\" Jim told me.</p><p>\"What people?\"</p><p>\"From the Guild.\"</p><p>Argh. \"Fine. How's the boy?\"</p><p>\"Doolittle says he's the same. Your guests are in the conference room, second floor, third door on the left.\"</p><p>I marched to the second floor. Grendel decided to accompany me. Five people waited in the small reception hallway by the third conference room, guarded by a female shapeshfiter. One of them was Mark, the other four were Bob Carver, Ivera Nielsen, Ken and Juke, collectively known as the Four Horsemen. Most mercs were loners. Sometimes, when the job demanded it, they paired up the way Jim and I did, but groups of more than two were rare. The Four Horsemen were the exception to the rule. They made a cohesive, strong team, they took rough jobs and finished them efficiently and mostly above board, and they were respected by the rest of the mercs.</p><p>The two parties stopped glowering at each other long enough to contemplate my dog.</p><p>\"What the hell is that?\" Bob asked.</p><p>\"It's my attack poodle. Did you agree to come here at the same time?\"</p><p>\"Hell no,\" Juke said, shaking her head with spiked black hair. \"We were here first. He just showed up.\"</p><p>\"I made an appointment,\" Mark said. \"Once again, you're bringing your bully tactics to the table.\"</p><p>\"You're an asshole,\" Ken told him.</p><p>\"And you're a thug.\"</p><p>Why me?</p><p>This was the first time I heard about an appointment. I made a mental note to ask Jim about that and pulled a quarter from my pocket. \"Heads.\" I pointed to the Four Horsemen. \"Mark, you're tails.\"</p><p>I flipped the coin into the air and slapped it onto the back of my wrist.</p><p>\"Tails.\" I nodded at Mark. \"Let's go.\"</p><p>We stepped into the conference room, I shut the door, and we sat a large table of knotted wood.</p><p>\"What can I do for you?\"</p><p>Mark leaned forward. He wore a crisp business suit and a conservative burgundy tie. His dark brown hair was cut in that executive/politician style: not too long, not too short, conservative, neat. His nails were clean and manicured, his chin showed no stubble, and he smelled of masculine cologne. Not overpowering, but definitely detectable.</p><p>\"I'd like to talk to you about the Guild arbitration,\" he said.</p><p>And here I thought he made the trip to chat about the weather. \"I'm listening.\"</p><p>Mark looked at the dog. Grendel gave him an evil eye.</p><p>\"I'll cut to the chase: I'd like to take over the Guild.\"</p><p>Ambitious, aren't we? \"I kind of gathered that.\"</p><p>\"I'm not popular. I don't wear leather and I don't carry guns.\" He braided the fingers of his hands into a single fist and rested it on the table. \"But I make the Guild run. I make sure the customers are happy, the profits are made, and everyone gets paid on time. Without me the whole thing would collapse.\"</p><p>I had no doubt it would. \"I'm waiting for my part in this.\"</p><p>\"Your vote will be the deal breaker,\" he said. \"I'd like us to come to some sort of arrangement.\"</p><p>He just dug a lovely hole for himself. I waited to see if he would jump into it.</p><p>\"Of course, I understand that sufficient compensation is in order and our arrangement would have to equitable and mutually beneficial.\"</p><p>And he did. I sighed. \"Mark, the problem isn't that you can't run the Guild. The problem is that you think 'white collar' is a noble title.\"</p><p>He blinked, obviously taken aback.</p><p>\"In your world, everyone has a price,\" I said. \"You don't know what mine is, but you think you can afford it. It doesn't work like that. You could've gone many ways with this. You could've argued that with the Guild being in limbo, nobody is getting paid. You could've pointed out that the longer this goes on, the more talent Guild will lose, as experienced mercs move onto new jobs to feed their families. Offering to bribe me was the worst argument you could've made. My opinion isn't for sale.\"</p><p>\"I meant n offense,\" he said.</p><p>\"But you did offend and you've demonstrated that you have no idea how to relate to me. A lot of guys are like me, Mark. Yes, you make the Guild run, but you lack the elemental understanding of what makes mercs tick, probably because you never were one. If I wanted to endorse you, which I don't, I'd have to defend my position before the Guild, which I find difficult under the circumstances.\"</p><p>He chewed on that for a long minute. \"Fair enough. So you'll vote for the Horsemen then?\"</p><p>\"I don't know yet.\"</p><p>\"Thank you for seeing me.\" Mark got up and left.</p><p>The door barely had a chance to swing open when Bob shouldered his way in and dropped into one of my client chairs. Ivera followed, uneasy, watching me.</p><p>Bob was the leader of the Horsemen. If our world had spawned any veteran gladiators, he would be it. He was on the other side of forty and built with that mature strength and endurance that would make him a tough opponent even for people half his age. He might not be as fast as he used to be, but he had plenty of experience and he used it. Ivera was a tall, large Hispanic woman. She was nasty in a fight and a firebug - fire mage - on top of it.</p><p>The other two members of the Horsemen remained outside. Ken, a Hungarian mage, measured out words like they were gold and Juke, well, Juke was barely twenty and made up for the lack of experience in natural viciousness and hot temper. She was fast and she liked to talk trash. I understood the urge. I liked to talk trash too, but twenty year old me would've chewed Juke up and spat her out.</p><p>I looked at the two veterans. \"What can I do for you?\"</p><p>Bob leaned forward. The chair creaked and I almost winced. He was a big guy and the chair was none too sturdy.</p><p>\"I'll come right to the point,\" he said. \"Solomon was one of us. A merc. A working stiff.\"</p><p>\"Actually Solomon only worked as a merc for the first three years of forming the Guild, and given that he's been underground for a few months, we can drop working from his description.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bob plowed on ahead. \"All the same, he knew what it's like to be out in the field. He knew how to take care of the guys. The man had a heart, unlike that prick. He'll bleed us dry if we let him.\"</p><p>\"By that prick you mean Mark?\"</p><p>\"Who else?\"</p> <p>I nodded. \"Just checking.\"</p><p>Bob knocked on my desk with his scarred knuckles, making a point. \"That pencil neck wants to run the Guild. Between the four of us, we'll do better. Someone's got to look out for the guys.\"</p><p>I spread my arms. \"Full power to you. What do you want from me?\"</p><p>Bob scooted forward. The chair groaned. \"For a while Solomon, you, and Mark are the only people with any sort of official designation other than Guild member, except for the clerk and the payroll ladies. You were the first of us to make it into the Order and you did good work as a liaison. People remember that. And now you're Beast Lord's...\" He groped for a word.</p><p>\"Mate,\" Ivera told him.</p> <p>\"Yes, that. You have street cred. The mercs will never follow Mark. You know it, I know it, Ivera knows it.\"</p><p>I glanced at Ivera. \"What do you think?\"</p><p>\"What he said,\" she said grimly.</p><p>I leaned back. They wouldn't like it, but it had to be said. \"Three mercs go on a gig. One bails midway through the fight, the second dies, the third loses a hand. Are they eligible for the Guild disability pay?\"</p><p>Bob thought about it. \"The guy that ran off gets nothing, that's abandonment in progress. The dead guy's next of kin gets thirty percent. The guy without a hand gets disability.\"</p><p>I sighed. \"The first question to ask is how long any of them have been in the Guild. You have to hit the five year mark to qualify for disability and seven year to qualify for the death benefit. Until then, you die, your family gets a flat ten grand from your standard life insurance. The next question is, when did the first guy take off? If he did it once the fight started and the danger was evident, the Guild is entitled to garnish his wages, because his abandonment in progress becomes abandonment in imminent danger. How much do we garnish, Bob?\"</p> <p>Muscles played on his jaw. \"I don't know.\"</p><p>\"Then we move on to disability. How much do we pay? What's a hand worth? Does it matter if he was right or left handed?\"</p><p>\"I don't know,\" Bob said again. His eyes told me he didn't like where I headed.</p><p>\"Neither do I. But you know who does? Mark. I can call Mark right now and he'll rattle it off the top of his head. Let's talk contracts. Who provides the ammo for the Guild supply room? How much of a discount we get from them? The Guild has a deal with Avalon Construction to clear the magic hazmat at the prospective construction sites. It's a sweet contract, so you know there were perks. Bribes. Gifts. How much and to whom?\"</p><p>Bob growled a bit. \"All this stuff can be learned.\"</p><p>I nodded. \"Sure. But how long will it take you? The Guild has been without a leader for what, six months now, and you still haven't learned any of it. Would it even matter by the time you finished learning?\"</p><p>Bob crossed his arms. \"You could do it.\"</p><p>\"No, I can't. First, it's not my job. I've got my hands full with the shapeshifters and my own business. Second, what little I know I've learned only because it came up during my tenure as a liaison. It would take me ages to find it in the Guild's Manual. For better or worse, Solomon made Mark the sole brain behind this operation and Mark has years of experience. You don't have the knack for wheeling and dealing, Bob. You're a good solid tactician. You know what the gig needs and you're good at picking the right people and getting it done. The mercs look up to you. But bargaining isn't your thing.\"</p> <p>Bob's eyebrows crept closer together. \"You'll be backing Mark then?\"</p><p>\"I will tell you what I told him. I don't know yet.\"</p><p>Bob nodded and handed me a piece of paper. I scanned it. Formal summons with my name on it. Top left corner boasted code X in bold. Priority ten. Either I made this meeting, or the Guild would suspend me.</p><p>\"Not that it would matter,\" Bob said. \"But we did all manage to agree that you need to pick somebody by Monday.\"</p><p>Ivera got up and put her hand on Bob's shoulder. \"We should go.\"</p><p>He started to say something and changed his mind. I watched him get to his feet. He nodded to me. \"Later.\"</p><p>I dragged myself upstairs to the infirmary. Roderick was playing checkers with a shapeshifter boy. The collar on his neck had gone from orange to canary yellow.</p><p>I climbed the million stairs to our quarters, asked the guards to order some food from the kitchen, and took a shower. When I came out, Curran sprawled on our giant couch, his eyes closed.</p><p>I flopped next to him. \"Help.\"</p><p>The blond eyebrows rose a quarter inch. \"Mmm?\"</p><p>\"The mercs aren't going to reach a consensus.\" I lay next to him on my side, propping my head up with my hand. \"No matter who I pick tomorrow, they won't like it. Marc can run the Guild, but the mercs despise him. The mercs can do the jobs, but the admin stuff leaves them clueless.\"</p><p>\"Make them work together,\" Curran said.</p><p>\"Not going to happen. They hate each other.\"</p><p>\"If fourteen alphas can meet in the same room every week without killing each other, so can Mark and the mercs. The Guild has been without leadership for months. The people are tired and they want a strong leader. Not a tyrant, but a leader who inspires confidence. You need to walk in there and roar until they cringe. Demonstrate that you are strong enough to be take away their freedom to choose, make sure it sinks in, and then give some of the choice back to them on your terms.\"</p><p>Hmm.</p><p>\"Tie it back to Solomon Red, too,\" Curran said. \"It's basic psychology: under Solomon things ran, when he died, they broke. The more time passes, the more rosy times of Solomon look to an average merc. So if you attack them from 'Let's go back to the good old days' angle, they will fold. Make them think that following you is what they want to do.\"</p><p>\"You scare me sometimes,\" I told him.</p><p>He yawned. \"I'm totally harmless.\"</p><p>Someone knocked on the door. A bit early for food.</p><p>\"Yes?\" Curran called.</p><p>Mercedes, one of the guards, entered. \"There is a man outside, my lord. He is big, he's wearing a cape, and he's got a giant axe. We're also pretty sure he's drunk.\"</p><p>Dagfinn.</p><p>\"What does he want?\" Curran asked.</p><p>\"He says he wants to fight the Beast Lord.\"</p><p>Chapter Seven</p><p>Curran and I stood in the arched entrance to the Keep's courtyard. Dagfinn stood in the clearing outside. He was six feet eight inches tall, and he weighed a shade above three hundred pounds. None of it was fat. Dagfinn looked hard. His broad shoulders strained his tunic, his biceps had trouble fitting into the sleeves, and his legs in worn out jeans carried enough muscle to make you wince at the thought of him kicking you. His curly hair fell over his shoulders in dense reddish wave. He'd trimmed his beard, but his red eyebrows overshadowed his eyes.</p><p>He stood brandishing a battle axe etched with runes that matched tattoos on his arms. The blade of the axe flared at the toe and heel, its razor-sharp edge spanning full twelve inches. Combined with the four foot haft for extra power, the axe sheared flesh and bone like an oversized meat cleaver.</p><p>\"Look, I fought this guy before. Maybe you should talk him away from the cliff. He's drunk and isn't in his right mind.\"</p><p>\"He challenged me,\" Curran said. \"There will be no talking.\"</p><p>\"Suit yourself,\" I told him. Mr. 'Make fun of my leadership' wanted to have it his way. Well, he'd get it.</p><p>Around us the shapeshifters were piling out on to the battlements. Every balcony and parapet facing in Dagfinn's direction was occupied. Great. An audience was just what we needed.</p><p>\"Anything I should know?\" Curran asked me.</p><p>\"The axe is magic. Don't touch it. Dagfinn is pretty magic too. If you kill him, I'll be really mad at you. We need him to read the damn runes.\"</p><p>Curran stretched his shoulders and walked out into the clearing.</p><p>\"I heard you were looking for me,\" Dagfinn growled. His voice matched him, deep and torn about the edges.</p><p>\"She has some runes she wants you to look at.\"</p><p>Dagfinn leaned to the side to look at me. \"Kate? What the hell are you doing here?\"</p><p>\"I live here.\"</p><p>\"Why?\"</p><p>\"Because I'm with him now.\"</p><p>Dagfinn looked at Curran. \"You and her are...?\"</p><p>\"She's my mate,\" Curran said.</p><p>Dagfinn swung his axe onto his shoulder. The runes sparked with pale green. \"Well how about that? You know what, I don't care, I'll still beat your ass, but I like her so I won't kill you.\"</p><p>Curran's eyes turned gold. \"Thanks.\"</p><p>Dagfinn waved his arm at him. \"Well, go on. Do your transforming thing.\"</p><p>\"No need.\"</p><p>\"Oh there is a need,\" Dagfinn assured him.</p><p>\"Are you going to talk all day? I'm a busy man,\" Curran told him.</p><p>\"Fine. I'll get to it.\" Frost condensed on Dagfinn's hair. His skin turned dark. He grew, gaining half a foot of height, his shoulders spreading wider.</p><p>\"Have fun, baby,\" I called.</p><p>Pale tendrils of cold spilled from Dagfinn's body. The icy mist danced along his skin, clutched at the runes tattooed on his arms, and drained down in a brilliant cascade onto his axe. The weapon burst with bright green.</p><p>I braced myself against the stone wall. Dagfinn swung his axe.</p><p>Curran jumped aside. A flash exploded to the left of him, blinding white and searing. Thunder slapped my ears. An air fist slammed into me. Curran flew a bit and rolled up to his feet.</p><p>A three foot hole smoked in the grass where Curran had stood. Dagfinn roared like an enraged tornado. A blast of frigid air whipped from him, striking at Curran. The Beast Lord dodged again.</p><p>Dagfinn remained firmly planted. The last two times we fought, he moved at me and I took him down. There were dozens of ways to use an opponent's movement against him: trip him, knock him off balance, gain control of a shoulder or a leg, and so on. Dagfinn must've decided not to give Curran that chance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Dagfinn spun the axe. A barrage of frost missiles shot out. Curran leaped back and forth, circling Dagfinn. On the battlements the shapeshifters roared and howled.</p><p>\"How are we doing, baby?\" I called out. Serves you right, Your Furriness. Next time, listen to me.</p><p>\"Trying not to show off,\" Curran yelled.</p> <p>Dagfinn brought the axe down. A sonic boom smashed into me. Curran flew backward.</p><p>\"Bring it!\" Dagfinn roared.</p><p>The shapeshifters booed.</p><p>Curran bounced back up and dashed forward.</p><p>Dafinn spun, but the Beast Lord was too fast. He dodged left, right, and collided with Dagfinn. The huge Viking staggered back from the impact, whipped around, picking up momentum, and charged, roaring, gripping the axe with both hands, and bringing it up for an overhead blow.</p> <p>Move, honey. Move.</p><p>Curran lunged forward.</p><p>What the hell was he doing?</p><p>Dagfinn chopped down with all his strength.</p><p>Curran caught the axe with his right hand.</p><p>Dagfinn stopped.</p> <p>Holy shit.</p><p>The viking strained, right leg forward, left leg back. Muscles rippled on his arms. Frost ate at Curran's hand, but the axe didn't move.</p><p>\"Done?\" Curran asked.</p><p>Dagfinn snarled.</p><p>Curran raised his left hand. His fingers curled into a fist.</p><p>\"Not in the head!\" I yelled. \"We need his brain.\"</p><p>Curran yanked the axe forward. Dagfinn jerked back, trying to regain his balance, and Curran swept his left leg from under him. Dagfinn crashed down like an oak chopped at the root.</p><p>Curran tore the axe out of his hands and tossed it aside. Dagfinn swung at him with his right fist. Curran leaned out of the way and sank vicious punch straight down into Dagfinn's gut.</p> <p>Ow. I hurt just from looking. The shapeshifters on the wall made sucking noises.</p><p>Dagfinn curled into a ball, trying to suck in a lungful of air, which was suddenly missing.</p><p>Curran pulled Dagfinn up, swung him over his shoulder, and carried the viking toward me.</p><p>Oh you crazy sonovabitch.</p><p>Curran dumped purple-faced Dagfinn by my feet. \"Here is your expert, baby.\"</p><p>The shapeshifters on the wall whistled and howled. Why me?</p><p>\"Thanks, showoff,\" I told him. \"Let me see the hand.\"</p><p>\"It's fine.\"</p><p>\"The hand, Curran.\"</p><p>He held it out. Blisters covered his right palm. Frostbite, probably second-degree. It had to hurt like hell. Lyc-V would fix it in a day or so, but meanwhile he'd have to grit his teeth.</p><p>\"I said don't touch the axe.\"</p><p>He leaned over and kissed me. The shapeshifters on the walls cheered.</p><p>Dagfinn finally manage to remember how to breathe and swore.</p><p>I leaned over him. \"He won. You're going to read my runes now.\"</p><p>\"Fine,\" Dagfinn growled. \"Give me a minute. I think something's broken.\"</p><p>According to Doolittle, nothing was actually broken. Dagfinn treated the diagnosis with open suspicion, but given the circumstances, he decided to deal with it. Curran, on other hand, got a plastic bag with some sort of healing solution tied around his hand. He liked it about as much as I expected.</p><p>\"This is ridiculous.\"</p><p>\"With the bag, the hand will be usable in two hours,\" Doolittle informed him. \"Without the bag, it may be usable by tomorrow. It's your choice, my lord.\"</p><p>Curran growled a little, but kept the bag on.</p><p>I put Julie's drawing in front of Dagfinn.</p><p>He squinted at it. \"Whoa. Was this on a weapon?\"</p><p>\"No, it's on a gold necklace that's killing a child. Looks like Elder Futhark, but not exactly. Is this a spell?\" I asked.</p><p>\"This isn't Elder Futhark.\"</p><p>\"What is it?\"</p><p>\"It's dvergr.\"</p><p>I sat down into the nearest chair. \"Are you sure?\"</p><p>Dagfinn pulled back the sleeve of his tunic, displaying his tattoos. \"Look here.\"</p><p>The last two characters on his shoulder matched the last two characters on Julie's paper. Dagfinn drew his fingers along the tattoo. \"This says, Wielder of Axe Aslaug born from blood of Earth shaped by hands of Ivar.\" He tapped the paper. \"This says, 'Apprentice of Ivar.' Yeah, I'm sure.\"</p><p>\"What is dvergr?\" Curran asked me.</p><p>\"Dwarf,\" I told him. \"Old Norse dwarf: magic, powerful, skilled with metalwork. Makers of weapons for the gods. They're often portrayed as embodiments of greed - they lust after power, women, and most of all gold.\"</p><p>\"Hey now!\" Dagfinn raised his hand. \"Most experts believe this to be a later development. The dwarf myths probably take their root in nature spirits...\"</p><p>\"Dwarves like in Tolkien?\" Curran asked.</p><p>I wish. I dragged my hand over my face. \"One time four dwarf brothers, the sons of Ivaldi, created some magical gifts for the gods. Two other dwarf brothers, Brokk and Eiti, became jealous of all the praise and bet Loki, the trickster, that they could make better gifts. He wagered his head. The dwarves won and then wanted to murder Loki. The gods wouldn't let them do it, so Brokk sewed Loki's lips shut with wire. These are not jolly, drink beer and go on adventure type of dwarves.\"</p><p>\"The one I met was a good guy,\" Dagfinn said.</p><p>\"You think it's the same Ivar who made your axe?\" Curran asked.</p><p>Dagfinn nodded. \"I was about fifteen or fourteen. I was wild back then, not like now.\"</p><p>Curran and I looked at each other.</p><p>\"So my uncle Didrik, he was a viking, took me to the mountains to this valley. We met a smith there and my uncle talked to him and then left me there for the summer. It didn't go well at first, but Ivar and me got along finally. I liked it there. When Didrik came to get me, Ivar made me this axe and put the runes on me. Right arm,\" he slapped his right biceps \"controls the axe. Left arm is my oath. I can't ever kill a defenseless person or force myself on anyone, or the axe will turn on me.\"</p><p>\"I heard you broke into the monastery looking for the Asian ladies,\" Curran said.</p><p>\"Asian ale,\" Dagfinn said. \"I wasn't looking to rape anybody. I was looking for the beer. None of them would talk to me, so I kept trying to grab them to make them still so I could ask where the beer was. I had a bit to drink that evening.\"</p><p>The light dawned on me. \"Dagfinn, they are Buddhists. They don't brew beer. You needed the Augustine Brothers two miles to the south. You went to the wrong monastery, you dimwit.\"</p><p>\"Tell me something I don't know,\" Dagfinn growled. \"Anyway, can I see this collar?\"</p><p>We took him in to see the boy. Roderick shrank a little. \"Don't be scared,\" Dagfinn said. He examined the collar for a little while and we returned to the other room. Dagfinn sat into his chair, while Curran leaned against the wall, watching him and emanating menace.</p><p>\"Could be Ivar's work,\" Dagfinn said. \"I just don't understand why. The dwarf I knew wouldn't hurt a child.\"</p><p>\"Can you find the valley again?\" I asked.</p><p>He shook his head. \"There is a trick to it somehow. I'd meant to ask Didrik about it, but he died. I've tried to find him on my own. I've been all over the Smoky Mountains and nothing.\"</p><p>He was holding something back, I could feel it. \"What are you not telling me, Dagfinn?\"</p><p>He hesitated.</p><p>\"It's going to kill the kid,\" Curran said.</p><p>\"He might know,\" Dagfinn said.</p><p>\"He who?\"</p><p>\"You know. He.\"</p><p>My heart took a dive. This was getting better and better.</p><p>\"He who?\" Curran demanded.</p><p>I stepped closer to him and lowered my voice. \"The Vikings know of a creature. He's been trapped on their land for a very long time. They don't like to say his name, because he might hear and kill them at night.\"</p><p>\"Don't tell me you're thinking about it,\" Dagfinn said.</p><p>I spread my arms. \"I'm out of ideas.\"</p><p>\"Kate, please tell me you haven't been to see him before, right? Right?\" Dagfinn asked.</p><p>\"No. This will be my first time.\"</p><p>\"Why?\" Curran asked.</p><p>\"He catches your scent when you go to see him,\" Dagfinn said. \"It takes him awhile, but once he learns the scent, he never forgets it. People who go to see him twice don't come back. Their bones stay on that hill.\"</p><p>\"We're going to need back-up,\" I said, thinking aloud.</p><p>\"Don't look at me,\" Dagfinn said. \"I like you and all, but I've been once. I ran like a little girl and barely got out. I can't go again.\"</p><p>\"Backup won't be an issue,\" Curran said.</p><p>I shook my head. \"We can't bring anyone we can't afford to lose.\"</p><p>\"She's right,\" Dagfinn said. \"I hired a crew. Six people. I was the only one who got out and only because he ate them first. My advice, hire someone you don't know and tell them upfront it's a fight to the death. They're just flesh speed bumps for him.\" He looked at me. \"You need to talk to the Cherokees.\"</p><p>\"Yes, I know.\" Thinking of going to see Håkon sent ice down my spine.</p><p>\"Well, I'm out,\" Dagfinn rose. \"Thank you for the fight, I had fun, we should do it again sometime. It was nice knowing you.\"</p><p>Curran pushed from the wall. \"I'll walk you out.\"</p><p>\"I can find my way,\" Dagfinn said.</p><p>\"I'm sure you can. I'll save you the trouble.\" Gold rolled over Curran's eyes.</p><p>Dagfinn sighed and they left.</p><p>I went upstairs onto the roof. We had set up a small dining area there, two chairs and a table. Lately every time we sat down to eat in our kitchen, someone would knock on the door with some bullshit emergency, so when we didn't feel like being interrupted, Curran and I would go up to the roof and eat in peace. His Furry Majesty was threatening to drag a grill up there and \"cook meat\" for me. Knowing him, \"grill\" meant a giant pit and \"meat\" stood for half a deer.</p><p>I sat on the low stone wall bordering the top of the roof. It was late afternoon, and the sun was slowly rolling to the west. The stone wall was nice and hot under my butt. Summer was coming. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I sat, enveloped in warm air. It felt nice, but not hot enough to chase away the ice built up on my spine. I didn't want to visit Håkon. Several people I knew had gone to see him. Only two came back, and Dagfinn was one of them.</p><p>The world blinked. The magic vanished, snuffed out, like a candle by the draft. A mixed blessing: as long as the magic was down, the necklace wouldn't constrict Roderick's neck any further, but we couldn't see Håkon without it.</p><p>Voron, my adoptive father, had always warned me that friends would make me soft. When you cared about people, you forged a bond, and that bond made you predictable. Friends weren't for me. Greg, my now dead guardian, took that a step further and added lovers to that ban. When you loved someone, your enemies would use it against you.</p> <p>Neither of them had predicted that being in love and being loved in return made you value your life much higher. I liked my life. I had a lot to lose now.</p><p>Curran emerged from the door, pulled the bag off his hand, and tossed it into the garbage can we kept up here for the times we ate outside. He walked in complete silence, like a tiger stalking through the forest, quiet and confident. I liked to watch him, provided he didn't know about it. His ego was threatening the ozone layer as it was.</p><p>Curran sat next to me and put his left arm around my shoulders and kissed me. There was a slightly possessive edge to the kiss.</p><p>\"Through the Guild and no.\"</p><p>\"Hm?\" he asked.</p> <p>\"You were about to ask how I know Dagfinn and if we ever were more than friends. We never were friends, actually. I got suckered by the Guild into bringing him in twice. He was wanted for the fines and destruction of property.\"</p><p>Curran grimaced. \"No, it never crossed my mind that you'd be with Dagfinn. He's undisciplined idiot. Give me some credit. I know you better than that.\"</p><p>I shrugged and leaned closer against him. \"This is fucked up.\"</p><p>\"Yes, it is. Can you think of any other way to find Ivar?\"</p><p>\"No. Maybe Doolittle can try removing the collar during tech?\"</p><p>Curran shook his head. \"I asked. He says it will kill the boy. He says we have thirty six to forty eight hours, depending on how long the magic lasts. There is a good chance the next magic wave will be the boy's last.\"</p> <p>Two days before Roderick with his owlish eyes died, choked to death.</p><p>\"Do you remember a few years ago a detachment of PAD disappeared? Eleven cops, armed to the teeth? It was in the papers?\"</p><p>\"Yes.\"</p><p>\"That was Håkon.\"</p><p>\"Is that his name?\"</p><p>I nodded. \"I didn't say it in front of Dagfinn so he wouldn't freak out. Whoever we take will die. If we don't take anybody, the boy will die.\"</p><p>\"We explain it and ask for volunteers.\" Curran drew me closer. \"Those are the choices we make.\"</p><p>\"I'm tired of those lousy choices.\" If you put all the people I killed together, their blood would make a lake. I was wading through it and I had no desire to make it any deeper.</p> <p>We sat next to each other, touching.</p><p>If Curran asked for volunteers, the Pack would cough some up. I would have to look at their faces, I would witness their deaths, and then I would have to tell their families about it, assuming I survived. Assuming Curran survived.</p><p>The thought pissed me off. We'd do it. There was a child on the other end of that equation, so yes, we would grit our teeth and do it. But it made me so mad. I could've strangled Aurelia if I got my hands on it. She knew what the collar did, and she deliberately chose between her husband and her son.</p><p>\"Can Håkon be killed?\" Curran asked.</p><p>\"No. The Cherokees have tried for years. All they can do is contain him on that hill. If he's destroyed, he just reassembles himself.\" I growled. \"I don't want to do this.\"</p><p>\"I know,\" he said.</p><p>\"Do you think less of me?\"</p><p>\"No.\" Curran stroked my back. \"Like I said, these are the choices we make, and sometimes every choice is bad, and then you sit by yourself and remember all the horrible shit you had to do and have done, and you deal with it. It will eat you alive if you let it.\"</p><p>I straightened and touched his cheek. \"Well, you don't have to sit by yourself anymore. We'll sit together.\"</p><p>He caught my hand and kissed it. His eyes turned dark. His fingers curved into a fist. He looked predatory. \"I wish I could rewind to that second and crush her skull before she put the necklace on the kid.\"</p><p>\"I know. I wish there was a way to get to her.\"</p><p>He looked at me. \"I thought about it. If we approached Forney's house at night...\"</p><p>\"Curran, we can't break into the house of the DA. The fallout for the Pack would be enormous.\"</p><p>\"I know, I know.\" Muscles played along his jaw. He hated to have his hands tied and so did I. \"But if we use someone outside of Atlanta for the DA job...\"</p><p>\"It's a bad idea. Even I know it's a bad idea.\"</p><p>He looked at me. He was still thinking about it.</p><p>\"No,\" I told him.</p><p>Curran swore.</p><p>Screwing with the DA would get us a witch hunt in a hurry. He knew it and I knew it. No, there had to be another way. Some way where the boy survived and our people didn't die.</p><p>I sighed. \"I envy navigators sometimes. All they do is sit in the Casino and drink coffee, while the bloodsuckers run into dang-\"</p><p>I stopped in mid-word.</p><p>Curran's eyes lit up.</p><p>\"You think he would go for it?\"</p><p>\"Oh yes. Yes, he will go for it.\" He jumped off the wall. \"Come with me.\"</p><p>\"Shouldn't we have some sort of a plan? Ghastek isn't an idiot. We can't just call down to Casino and tell him, 'Hi, we're going on a suicide mission, wanna bring some vampires to be our bullet meat?'\" Bloodsuckers were expensive. The very idea of taking four or five of them into danger with miniscule chances of survival would give Ghastek an aneurism.</p><p>\"I have a plan.\" Curran grinned at me.</p><p>\"Please enlighten me, Your Majesty.\"</p><p>\"I'm going to make Jim figure it out,\" Curran said.</p><p>\"That's it? That's your plan?\"</p><p>\"Yes. I'm brilliant. Come on.\"</p><p>I hopped off the wall and we went down the stairs.</p><p>If anybody could figure out how to rope Ghastek into this scheme, Jim would be the man. Served him right for all those times he pushed me into the line of fire.</p><p>Payback is a bitch.</p><p>We trapped Jim in one of the conference rooms and explained our brilliant plan.</p><p>\"This is payback, isn't it?\" Jim glared at me.</p><p>\"Don't be ridiculous,\" I told him. \"As the Consort of the Pack, I'm far above petty revenge.\"</p><p>Jim tapped the clipboard with several pieces of paper on it against his forearm. \"I'll do it if you go to the Guild tomorrow.\"</p><p>\"You'll do it, because I asked you to,\" Curran said.</p><p>Jim turned to me. \"Will you do the Guild thing?\"</p><p>I had a dying kid on my hands and all he cared about was Guild idiocy. \"Maybe. I don't know yet. I'm kind of busy at the moment.\"</p><p>Green flashed in Jim's eyes. He yanked a piece of paper from the clipboard and thrust it at me. It looked like a long list.</p><p>\"What is this?\"</p><p>\"This is the list of all the phone calls I've gotten about this shit in the last week and a half. The mercs have gotten every damn member to call me here.\" He shook the list in Curran's direction. \"You want to know why your background checks aren't done? This is why! I could get it done if your mate would stop dicking around and just dealt with it.\"</p><p>Oh it's like this then. \"Then I have a great idea. Since they're all calling you, why don't you stop dicking around and deal with the Guild. You have the same time in as I do.\"</p><p>\"I have a job!\"</p><p>\"So do I! Why is your time more important than mine?\"</p><p>The clipboard snapped in Jim's fingers. He dropped it on the ground and raised his hands. \"You know what, I'm done. I quit.\"</p><p>\"Oh my God, seriously?\"</p><p>Jim wiped his hands one against each other and showed them to me.</p><p>\"Is that you washing your hands off?\"</p><p>\"Yes.\"</p><p>\"Really? So what, you're going to retire and open that flower shop you always wanted?\"</p><p>Jim's eyes went completely green.</p><p>\"Enough,\" Curran said. An unmistakable command saturated his voice. Jim clicked his mouth shut.</p><p>I crossed my arms. \"I'm sorry, is this the part where I fall to my knees and shiver in fear, Your Furriness? Silly me, I didn't get the memo.\"</p><p>Curran ignored the barb. \"What's your problem with the Guild?\"</p><p>\"The only way to resolve it involves me being entangled in running it and I don't want to do it.\" I waved my arms. \"I have the Consort crap and I have the Cutting Edge crap and whatever other bullshit the two of you throw my way. I don't want to go to the Guild every month and deal with their crap on top of everything else.\"</p><p>Curran leaned toward me. \"I have dress up and meet with those corpsefuckers once every three months and be civil while we're eating at the same table. You can deal with the Guild.\"</p><p>\"You, dress up? Wow, I had no idea that putting on your formal sweatpants was such a huge burden.\"</p><p>\"Kate,\" Curran snarled. \"They're not sweatpants, they are slacks and they have a belt. I have to wear shoes with fucking laces in them.\"</p><p>\"I don't want to do it! I hate the policy crap.\" I so didn't need the Guild politics in my life. It was complicated enough, damn it. \"I don't have time for it.\"</p><p>\"Everybody hates the policy stuff,\" Curran growled. \"You will do it.\"</p><p>\"Give me one reason why.\"</p><p>\"Because you know those people and some of them are your friends. The Guild is sinking and they're losing their jobs.\"</p><p>I opened my mouth and clamped it shut.</p><p>\"Also, because I'm asking you to do it,\" Curran said. \"Will you please resolve this, baby?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I would punch him. I would punch him straight in the face, hard. \"Fine. I'll need a lot of back-up for the Guild.\"</p><p>Curran looked at Jim. \"Make sure she has everything she needs.\"</p><p>\"Okay,\" Jim said. He picked up the pieces of his clipboard, pulled a piece of paper out and handed it to me with the pen. \"Write it down.\"</p> <p>I did and gave it back to him.</p><p>Jim read it. \"I'll take care of it, Consort.\"</p><p>\"Thank you, alpha.\"</p><p>If it had been raining, our voices would've frozen it into hail.</p><p>\"Is there anything else?\" Jim asked Curran.</p> <p>\"No.\"</p><p>Jim nodded and left.</p><p>\"I hate you,\" I told Curran.</p><p>He chuckled. \"You'd hate me more if Jim quit. We'd have to find a replacement. I don't trust that many people. Just think how much more shit you'd have to put up with.\"</p><p>\"Don't,\" I warned him.</p><p>\"Mmmm, Kate, the Chief of Security. Sexy. Who better to guard my body then the woman who owns it?\"</p> <p>\"Curran, I will punch you.\"</p><p>\"Rough play.\" Curran pretended to shiver in excitement.</p><p>I raised my fist and tapped his biceps lightly.</p><p>\"You knew it was inevitable,\" he said.</p><p>I knew. The moment Jim sent me the file I had known exactly how it would end. But I put up a valiant fight. \"Yes, but I don't have to like it. Can we eat now? I'm starving.\"</p><p>\"Oh so I am forgiven?\" he asked.</p><p>\"Sure. The next time you decide to flex your claws and come up with a plan to invade a home of a high-ranking civil servant, I'll bark, 'Enough!' and expect to be obeyed, how about that?\"</p><p>\"You told me no,\" he said.</p> <p>\"And?\"</p><p>\"And I didn't like it.\"</p><p>\"You can't assault the DA's house, you crazy bastard!\"</p><p>\"And you can't check out of the Guild's mess. We both have to do things we don't want to do. I consider us even.\"</p><p>I rolled my eyes and we went upstairs to our cold food.</p><p>\"I know what that ass is getting from me next Christmas,\" I said.</p><p>\"What?\"</p><p>\"Clipboards. Lots and lots of clipboards.\"</p><p>Chapter Eight</p><p>Before the Shift and the start of magic waves, a person's power could be readily judged by the kind of car they drove, by the clothes they wore, and the company they kept. In post-Shift Atlanta visual clues were still proved true in some cases, but not nearly often enough. A bum in tattered jeans and ragged cloak could walk out into the crowded street, raise his arms, and the sky would tear open and weep a rain of lightning and hail the size of coconuts, leveling everything in a three mile radius.</p><p>That's why post-Shift Atlanta evolved a new concept: a show of power. It was a decisive, showy demonstration of abilities and power, designed to intimidate.</p><p>When I woke up in the morning, a pair of grey jeans, grey T-shirt, and grey leather jacket waited for me, folded on top of a grey cloak edged with fur. Grey was the Pack color. I was going to put on a show for the Guild and this was my costume for it. I put the clothes on, added my boots, my saber in the back leather sheath, my throwing knives, and my wristguards filled with silver needles. I braided my hair away from my face and examined myself in the mirror. I was broadcasting badass loud and clear. Normally I stayed away from clothes like that. The less attention I drew when I worked, the better. Today was different.</p><p>I marched into the bathroom, where Curran was brushing his teeth. His blond eyebrows crept up. \"That's your Council meeting outfit from now on.\"</p><p>I laughed. \"Cloak or no cloak?\"</p><p>\"Definitely cloak,\" he said.</p><p>I tried the cloak on in front of the mirror.</p><p>Curran came up behind me and nuzzled my neck.</p><p>\"Is that your gun or are you just happy to see me?\"</p><p>\"Mmm, a challenge.\" He nipped the skin on the back of my neck, sending electric aftershocks down through me. Some men got excited by white lace and a translucent negligee. My love muffin got excited by a woman dressed to murder. There was probably something deeply twisted about that. Lucky for me, negligees were never my thing.</p><p>He kissed me again. \"You're finally getting the hang of this whole badass thing.\"</p><p>\"I was always badass.\"</p><p>\"No, you thought were badass and talked a lot of crap.\" He wrapped his arms around me.</p><p>Aha. \"Let me go.\"</p><p>\"You have time.\" He kissed my neck again. Every nerve in my body came to attention.</p><p>\"No, I don't. I have people waiting.\" I pulled free from him and kissed him back. He pulled me close, locking me in with his arms. Mmm, Curran. I really didn't want to leave.</p><p>\"Come on.\"</p><p>\"No. Have to go.\"</p><p>\"It won't take long.\"</p><p>\"Who would that be fun for, exactly? Your seducing techniques need work.\" I untangled myself and escaped, before he thought of something else to say to change my mind.</p><p>It took me ten minutes to stop by the medical ward.</p><p>Roderick's collar has faded to lemon yellow. The skin around it had turned bright red, inflamed. It hurt just to look at it. I crouched by him. \"How are you doing?\"</p><p>\"I'm okay, thank you.\"</p><p>\"Does it hurt to eat?\"</p><p>\"A little,\" he said.</p><p>\"I'm going to see someone today to figure out how to take that thing off.\"</p><p>He just looked at me with his big eyes. Deep down, he must've been scared. His sister died. His parents were gone. But he held it all inside and he wasn't about to let me in.</p><p>Before I left, Doolittle drew me aside. His face was bleak. \"You must hurry.\"</p><p>\"I'll do my best,\" I told him.</p><p>When I walked into the morning light, ten Pack vehicles waited for me. The crews of the vehicles stood in front of them wearing identical grey. Jim stood to the side, surveying the troops. I approached him.</p><p>\"Satisfied, Consort?\"</p><p>\"How long are you going to be pissed off?\" I asked him. We both kept our voices low.</p><p>He stared straight ahead.</p><p>\"Jim, we had a verbal disagreement. I was an ass, but you withheld information. The way you're acting, you'd think I got some guys to jump you and work you over until you woke up with bites on your legs and bruises all over your body.\"</p><p>\"It's different now, because we're both Pack. I've told you I was sorry about that. Are you going to keep dragging it out every time?\"</p><p>\"It was a shitty thing to do.\"</p><p>He locked his teeth, making his jaw muscles bulge.</p><p>I sighed and started toward the cars. \"Suit yourself.\"</p><p>\"I always do,\" he called out.</p><p>I turned around and flipped him off.</p><p>He glared at me.</p><p>I kept walking.</p><p>\"Kate!\" he called out.</p><p>I turned.</p><p>\"Eduardo is your second. You need to talk to him. He wants you to practice something.\"</p><p>I nodded.</p><p>\"Kate!\"</p><p>I turned around.</p><p>Jim approached me. \"Do you need me to watch your back for this Guild thing?\"</p><p>\"I got it. Thanks,\" I said.</p><p>\"Any time.\"</p><p>I went in search of Eduardo. Jim was an ornery bastard, but he did have my back. At least he wasn't mad anymore. I would probably have to make a peace offering all the same. The werejaguars were difficult creatures.</p><p>I'd have to get Dali to help me pick a gift. That way there would be no misunderstandings.</p><p>The Mercenary Guild made its HQ in a converted Sheraton Hotel on the edge of Buckhead. In another life the hotel, built as a hollow tower, had a solid glass front, complete with a rotating glass door. Now massive steel gates marked the entrance. As our procession rolled up to the hotel, I could see a few mercs mulling about and smoking. Most of the Guild personnel were probably inside already. Perfect.</p><p>Next to me, Eduardo leaned forward in the Jeep's driver seat. A werebuffalo from Clan Heavy, he was over six feet tall and layered with thick muscle. His hair fell down his back in a black mane. His face with a square chin and deep set eyes said that he would rather die than back down. That impression was one hundred percent correct. I had a problem with a part of his plan and argued with him about it until I turned purple in the face, but he wouldn't budge, which was probably why Jim had assigned him to be my second for this venture.</p><p>\"Wait a moment until we line up, before you go in, Consort,\" he murmured.</p><p>\"Kate.\" We've been on first name basis for a while now.</p><p>\"Not today, Consort.\"</p><p>The ten Jeeps turned in unison, parking next to each other in front of the building. The mercs at the entrance forgot to suck at their cigarettes and stared.</p><p>The car doors opened. The shapeshifters stepped out, forming two lines with a military precision, their faces solemn. I glanced at Eduardo.</p><p>\"Not yet,\" he said.</p><p>The shapeshifters marched into the Sheraton, looking like they would chew through anybody dumb enough to stand in their way.</p><p>\"I'm going to get out and go ahead. Derek will open your door. When you exit, keep walking, like you own the place,\" Eduardo said. \"We've got your back.\"</p><p>\"Watch it, bison,\" Jezebel growled from the back seat. She was one of the two bouda bodyguards Aunt B, the alpha of the werehyenas, attached to me. \"You talk to her like she's a child.\"</p><p>I held up my hand. \"It's okay. I got it.\"</p><p>\"No worries,\" Eduardo said. \"You will do fine.\"</p><p>There were few things I hated more than being the center of attention. Especially if the crowd was large.</p><p>Eduardo stepped outside. The passenger door behind me opened and Jezebel and Derek got out. Jezebel was six feet tall, moved like a predator, and had enough hard muscle on her to make me think twice about trying to take her on. Derek was leaner and younger, but his face and bearing made an instant impression.</p><p>Derek opened the door. \"My lady.\"</p><p>The face of my aunt flashed before me. I would be Erra for today.</p><p>Eduardo stomped toward the Sheraton like a mountain with a \"make-my-day\" face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I stepped out and marched on the Guild, imagining there was an army at my back.</p><p>Eduardo cleared the iron gates, sucked in a lungful of air, and roared. \"Make way for the Consort!\"</p><p>Oh boy.</p> <p>Eduardo stood to the side. I strode through the gates and the lobby. Eduardo fell in behind me.</p><p>Before the Shift, the hotel was a many-star establishment, complete with an on-the-premises restaurant, a coffee shop, and a happy hour area raised on a three-foot platform. Mercs filled the main floor now. The twin lines of the shapeshifters had sliced through the crowd and stopped, forming an empty corridor leading toward the platform, standing like statues, hands behind their backs, feet together. A lone table waited for me. Mark sat on the left, his face pale. On the right Bob Carver and Ivera gawked at me with owl eyes.</p><p>I walked to the platform with my head held high, my cloak flaring. The entirety of the Guild focused on me. Super.</p><p>At the platform Eduardo sped up, drawing even with me. He took a knee, locked his left fist on his right wrist, and offered me the makeshift step.</p><p>Do not fall, do not fall, do not fall...</p> <p>Without breaking my stride, I stepped onto his arms and then onto the platform.</p><p>We'd practiced it at least two dozen times before we had left for the Guild.</p><p>The three shapeshifters, Derek, Eduardo, and Jezebel, turned, their backs to the platform and glowered at the crowd. Derek carried a large wooden box. The two lines of shapeshifters stepped to the left as one, snapping into a wider stance.</p><p>Someone gasped.</p><p>Showtime.</p><p>\"I speak for the Pack,\" I said, putting all my power into my voice.. \"We hold twenty percent of the Guild. The admin group holds forty. The veterans hold another forty.\"</p> <p>You could hear a pin drop.</p><p>\"You've had months to choose a leader. You have failed and asked the Pack to break this deadlock. This is my proposal to the Guild. Listen well, because there won't be another.\"</p><p>They were listening. Thank you, Universe, for small favors.</p><p>\"Solomon Red envisioned this Guild as a place for independent men and women to earn their living in the way they see fit. We must continue the course he plotted for us.\"</p><p>It was bullshit. Solomon Red didn't have that grand of a vision but Curran suggested it, so I plowed on ahead.</p><p>\"Point One. The Guild will appoint a Chief Administrative Officer to oversee day to day operations and financial security of the Guild. I nominate Mark for this post. Point Two. The Guild will appoint a Chief Personnel Officer to protect interests of its members, oversee zoning of scores, and the assignment of gigs. I nominate Bob Carver for this post. Point Three, the Guild will create the post of the Pack Liaison Officer who will represent Pack's interests in the Guild as its third largest shareholder. I will be taking over this post. Together the Chief Administration Officer, Chief Personnel Officer, and Pack Liaison Officer will form the Guild Committee, which will meet on the fifteenth of every month. All matters of policy concerning the Guild will be resolved by vote of the committee members.\"</p><p>I looked down. The shapeshifter at the end of the left line stepped forward and unfolded a small table. The shapeshifter from the end of the right line placed a tall stack of index cards and three pens on the table. Derek stepped forward and put his wooden box in the center of the table.</p><p>\"The Guild will now vote,\" I announced. \"Each of you will write your merc ID on the card, add one word: YES or NO, and drop it into this box. I give you this last chance to save the Guild and your jobs. Don't blow it.\"</p> <p>Two hours later, the two hundred and forty-six mercs voted yes, thirty-two voted no, and sixty one dropped blank cards with their ID's into the box, abstaining. I made a show of congratulating Bob and Mark and got the hell out of there.</p><p>Chapter Nine</p><p>I went to see Immokalee, a Cherokee medicine woman, after leaving the Guild. She spent half an hour making supplies for me and another half-an-hour trying to convince me that going to see the draugr was a Bad Idea. I knew it was a Bad Idea. I just didn't see any way around it.</p><p>I got to the office just after noon. The Dude and a cart containing one very sedated deer waited for me in the parking lot. A female shapeshifter I didn't know sat on the cart with a sour expression on her face. It took me only a moment to figure out why. Next to the cart, hiding in the shade, crouched a vampire. It was thin, wiry, and covered in purple sunblock from head to toe, as if some giant bubble of grape bubblegum had exploded over it.</p><p>Jim had done it. I felt like jumping up and down. Instead I gave the vamp my flat stare.</p><p>\"There are more inside,\" the female shapeshifter informed me.</p><p>I stepped into the office. Curran sat at my desk, drinking a Corona from my fridge. In front of him, four vampires sat in a neat row in the middle of the floor. Two matched the purple delight outside, one was Grinch green, and the last one blazed with orange.</p><p>\"I get the sunblock,\" I said. \"But why do you have to paint them like skittles?\"</p><p>The orange vamp unhinged its jaws. \"The bright color helps to make sure they're completely covered,\" an unfamiliar female voice explained. \"It's easy to miss a spot. When they're young, they have a lot of wrinkles.\"</p><p>Ugh. \"What the meaning of this?\"</p><p>\"Kate,\" the green vamp spoke with Ghastek's voice, \"It has come to my attention, that you are planning to see a creature in the Viking territory with the purpose of finding a means to remove the necklace from the child. An undead creature. That explicitly violates the terms of our agreement to resolve this matter jointly.\"</p><p>I looked at Curran. He shrugged.</p><p>\"And how did you know this?\" I asked.</p><p>\"I have my methods.\"</p><p>How in the world did Jim pull this off? I'd have to buy him all the clipboards in the world.</p><p>\"Ghastek, this is not a fun trip,\" Curran said.</p><p>\"You can't go,\" I added.</p><p>\"Why ever not?\"</p><p>\"Because the undead will murder your vampire hit squad and I have no desire to get that bill,\" Curran said. \"Do yourself a favor. Sit this one out.\"</p><p>Wow. He went there.</p><p>The vamp's red eyes bulged, struggling to mirror Ghastek's expression.</p><p>\"Kate, perhaps you need to explain to your significant other that he is in no position to give me orders. Last time I checked, his title was Beast Lord, which is a gentle euphemism for a man who strips nude at night and runs around through the woods hunting small woodland creatures. I'm a premier Master of the Dead. I will go where I please.\"</p><p>Once again I rode The Dude. Curran chose to drive the cart. We travelled side by side. Ghastek took point, while three of his journeymen flanked us. The fourth, the orange vampire, trotted next to me. It was piloted by Ghastek's top journeywoman. Her name was Tracy and as navigators went, she wasn't too bad.</p><p>Ghastek's vampire reached Gunnar's fork, marked by an old birch. Predictably, Gunnar lumbered out. \"Come to see Ragnvald again?\"</p><p>\"Going to the glade.\" I nodded at the cart. The deer's moist dark eyes stared at the viking.</p><p>Gunnar's spine went rigid. \"To see him?\"</p><p>I nodded.</p><p>\"Don't \"go,\" he said.</p><p>\"I have to.\"</p><p>He shook his head and stepped aside. \"It's been nice knowing you.\"</p><p>I touched the reins and our small procession rolled on.</p><p>Ghastek dropped back, drawing even with The Dude. \"Why the secrecy?\"</p><p>\"The vikings don't like to say Håkon's name. The glade isn't that far from here and he might hear.\"</p><p>\"What is he?\"</p><p>He and Curran had that in common. Wave a secret in front of them and they would foam at the mouth trying to learn it. \"He's a draugr.\"</p><p>The vamp hopped on the cart and peered at me, its eyes only a couple of inches from my face. \"A draugr? A mythical Norse undead that supposed to guard the treasure of its grave?\"</p><p>\"Get off my cart,\" Curran growled.</p><p>The undead hopped down. The vampire's grotesque face twisted into an odd expression: the corners of its cavernous mouth pinched up, while its lips gaped open, displaying its fangs. It stared at me with blood red eyes and bopped its head forward and back a few times.</p><p>\"What are you doing?\"</p><p>\"I'm laughing at you.\"</p><p>Kicking the vampire in the face with my foot would be counterproductive at this point.</p><p>\"When I was a journeyman, I spent eighteen months in Norway, looking for draugar. I've camped in the cemeteries in sub-zero temperatures, I've scoured the fjords, I've dived into sea caves in freezing water. It was the worst year and a half of my life. In those eighteen months I didn't find any credible evidence of draugar's existence. Trust me when I say this: they don't exist. Hence, my use of the word mythical. As in not real.\"</p><p>I briefly contemplated punching the vampire in the nose. It wouldn't hurt Ghastek any, but it would be immensely satisfying. \"This draugr exists. Plenty of people have met him.\"</p><p>\"Oh, I have no doubt that they had met something, but it wasn't a draugr. Don't you see the signs? The mysterious glade the path to which is guarded by a giant. The legendary undead with magical powers, whom you can only meet once and those who disobey that rule die a gruesome death.\" The vampire waved his front limbs, fingers spread. \"Woo-ooo. Frightening.\"</p><p>\"Do you have a point?\"</p><p>\"Those bearded horn-helmeted bandits are conning you, Kate.\"</p><p>\"You've got to be kidding me.\"</p><p>\"There is no need to feel bad about this. You're a capable fighter, proficient with a blade and you have intelligence and tenacity, but you don't work with the undead. You have very little familiarity with the basic principles of necromancy, beyond its most practical applications. You lack the tools to recognize the hoax.\"</p><p>The urge to grab the mind of the nearest vampire and use it to beat Ghastek's bloodsucker to a bloody pulp was overwhelming. Perhaps, that's why Voron insisted on steering me away from necromancy. He knew there would be times the temptation to show off would be too much. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"No worries. It's a forgivable mistake,\" Ghastek said. \"However, it will cost us a day and the use of five vampires.\"</p><p>\"Humor me.\"</p><p>\"Oh I intend too. I've had a stressful day and breaking this farce open will prove a wonderful way to vent the pressure.\"</p> <p>The vampire sauntered off.</p><p>\"He doesn't like to be wrong.\" Tracy's vamp said. I caught a hint of humor in her voice.</p><p>I couldn't care less if he liked it. As long as his vampires stood between me and the draugr, it would buy me a couple of extra seconds to get away.</p><p>The old road led deeper and deeper into the forest. The trees grew taller and thicker, their long limbs thrusting at each other, as if trying to push their neighbors out of the way. Mist swirled between the trunks, first an ethereal haze shimmering along the ground, then a thicker blue fog that hugged the road, laying in wait. It swallowed the sounds: the hoof beats of the horses, the creaking of the cart, the occasional sigh from the deer in the back, all seemed muted.</p><p>Ahead a stone arc rose above the path, grey slabs of rocks tinted with moss. I halted The Dude. The cart rocked to a stop.</p> <p>\"There is a path leading north just past the arc. We go on foot from here.\" I hopped off the cart. \"I need one of you to carry the deer.\"</p><p>A purple bloodsucker crawled up on the cart. Sickle claws sliced at the rope securing the animal, and the vampire pulled the deer off and slung it over its shoulder.</p><p>\"Which way will you be coming?\" Curran asked.</p><p>\"The glade is north east from here.\" I pointed to a tall oak to the left.</p><p>Curran pulled me close.</p><p>Ghastek's vampire rolled his eyes.</p> <p>\"Remember the plan?\" Curran said in my ear.</p><p>\"Get in, get the information, and run like hell out of there.\"</p><p>\"See you in a few hours.\"</p><p>I brushed his lips with mine. \"See you.\"</p><p>I grabbed my backpack and headed up the path.</p><p>The mist grew thicker. Moisture hung in the air, tinted with the odor of rotting vegetation and fresh soil. Somewhere in the distance a bird screamed. No movement troubled the still woods. No squirrels chattered in the canopy, no small game scurried away at our approach. Nothing except for vampires gliding alongside the path, their emaciated shapes flashing between the trees.</p><p>The path veered right and opened into a small glade. Tall pines framed it, the enormous dark trunks scratching at the sky. A carpet of dark pines needles sheathed the ground. Here and there rocks trust from the forest floor.</p><p>\"Put the deer right there.\" I pointed to the center of the glade. The vampire unloaded the deer and hopped aside.</p> <p>\"I suppose we wait until the magic?\" Ghastek inquired.</p><p>\"You got it.\" I sat on a fallen pine.</p><p>The vampire's shoulders rose up and down. Ghastek must've sighed. \"I suppose we might as well treat this seriously.\" The vampire raised his left forelimb. A long yellow claw pointed at a tall birch on the left. \"OP there.\" A claw moved to the right to a pine on the other side of the glade. \"OP there. Give me a perimeter assessment.\"</p><p>Two purple vampires scattered took a running start and scrambled up the tree. The third dashed into the bushes. Only Ghastek and Tracy remained. His vampire sat on my right, her vampire sat on my left. Peachy.</p><p>A minute passed. Another.</p><p>Ghastek's vamp lay down. \"If half of the things they said about draugar were true, it would revolutionize necromantic science. According to legend, they're the spirits of warriors who rise from the grave to guard their buried possessions. They see the future, they control the elements, they shapeshift into animals. They turn into smoke and become giants.\"</p><p>\"Not at the same time,\" I told him.</p><p>\"What?\"</p><p>\"You said they turn into smoke and become giants. Not at the same time. They're solid in giant form.\"</p><p>\"You're still clinging to this fallacy?\"</p><p>I leaned forward. \"What would you have done if you had found a draugr in Norway, Ghastek?\"</p><p>\"I'd try to apprehend it, of course.\"</p><p>\"Suppose you live in a small village in Norway and you know a draugr is nearby. You bring him live game once in a while and you hope to God he leaves you the hell alone. Now some geeky hotshot foreigner shows up on your doorstep and explains to you how his going to go annoy this terrible creature for the sake of 'necromantic science'. You try to explain to him that it's a not a good idea, but he treats you as if you're a childlike idiot.\"</p><p>\"I never treat people like infantile idiots,\" Ghastek said.</p><p>I looked at him.</p><p>Tracy cleared her throat carefully.</p><p>\"Go on,\" he said.</p><p>\"Would you take this foreigner to this undead monster and risk pissing it off or would you steer him as far away from the draugr as possible and hope he'll go away eventually?\"</p><p>\"That's a sound theory, with one exception. I'm not that gullible.\"</p><p>Fine. \"Bet me.\"</p><p>The vampire stared at me. \"I'm sorry?\"</p><p>\"Bet me. If the draugr is a hoax, I'll owe you a favor.\"</p><p>\"And if he's real?\"</p><p>\"Then you will bring me a quart of vampire blood.\"</p><p>\"And why would you need vampire blood, Kate?\"</p><p>Because I need it to experiment with making armor out of it, that's why. \"I want to calibrate the lot of new scanners the Pack bought.\"</p><p>A hint of suspicion slid into Ghastek's voice. \"And you need a quart of blood for that?\"</p><p>\"Yep.\"</p><p>The bloodsucker became utterly still as Ghastek mulled it over.</p><p>\"If I win this silly game, you will tell me why Rowena came to see you after the Keepers affair.\"</p><p>Sucker. \"Deal.\"</p><p>\"Excellent.\" He put emphasis on the x and the word came out slightly sibilant.</p><p>\"You need a fluffy white cat. That way you can stroke it when you say things like that.\"</p><p>Tracy's vamp made a small noise that might have been a clearing of a throat or a choked up laugh.</p><p>A purple vampire popped out of the bushes, dragging something behind it. The bloodsucker strained, tight muscle flexing across its back, and heaved what seemed like a large collapsed leather tent into the open.</p><p>\"We found human bones,\" the vampire reported.</p><p>\"In the ravine?\" I asked.</p><p>\"Yes, ma'am.\"</p><p>I knew about the spot. Immokalee had described it to me this morning trying to scare me into not going. A few dozen yards to the north the ground dropped sharply into a narrow fissure lined with human skeletons. Some still held their weapons. When a draugr sucked the flesh off your bones, he did it quick, like jerking a shirt off a body.</p><p>\"We also found this.\" The vampire indicated the tent.</p><p>Ghastek's vampire raised the top edge, exposing a dark opening and vanished into it. The leather shifted, mirroring vampire's movement inside it. The bloodsucker emerged into the clear air. \"The design is ill-conceived. It is clearly too large for one person, but it has no structure or method of remaining upright as a tent, and besides this side is completely open to the elements. Perhaps it's some sort of communal sleeping bag?\"</p><p>\"It's not a sleeping bag,\" I told him.</p><p>\"Would you care to enlighten me?\" Ghastek said.</p><p>\"Look at it from above.\"</p><p>The purple vampire leapt onto the nearest tree and scurried up into the branches. A long moment passed and then it dropped on the ground next to me without a word.</p><p>\"What is it?\" Tracy asked.</p><p>The vampire's face was unreadable, like a blank wall. \"It's a glove.\"</p><p>The wind stirred the tree branches. The world blinked, as the tech vanished, crushed under the onslaught of a magic wave. Cold froze the glade. The other vampire burst from the bushes and came to rest by Tracy.</p><p>In the distance something wailed in inhuman voice, its forlorn cry rising high above the tree tops.</p><p>Gloom claimed the clearing. It came slowly, like molasses, from the dark spaces deep between the roots, washing over trees, leaching color from the greenery, drenching it in shadows, until the shrubs and foliage turned dark, almost grey. Behind the gloom, mist rose in thin wisps, tinted with an eerie bluish glow.</p><p>A crow cried overhead, its shrill caw impossibly distant.</p><p>\"They are putting on quite a show,\" Ghastek said.</p><p>\"Yep.\" I nodded. \"Going all out. Viking special effects are out of this world.\"</p><p>I pulled a canvas bundle out of my backpack and untied the cord securing it. Four sharpened sticks lay inside, each three feet long. I picked up a rock and hammered the first of the sticks into the ground at the mouth of the path. That was the way I'd run when it came time to get the hell out of here.</p><p>I moved along the edge of the clearing, sinking the sticks in at regular intervals.</p><p>\"What is the purpose of this?\" Ghastek asked.</p><p>\"Protection.\"</p><p>\"Have I've given you a reason to doubt my competence, Kate?\"</p><p>\"No.\" I pulled a black box out of my backpack, took a black cloth out of it, and extracted out an old pipe out of it. The medicine woman had already packed it with tobacco.</p><p>\"What is this?\"</p><p>\"A pipe.\" I struck a match, puffed to get the pipe going, and got a mouth full of smoke for my trouble. The pungent tobacco scraped the inside of my throat. I coughed and started to circle the clearing, blowing smoke as I went.</p><p>\"What sort of magic is this?\" one of the journeymen asked.</p><p>\"Cherokee. Very old.\" If life was perfect, I'd have Immokalee herself do the ritual. It took years of training for the medicine woman to reach her power, but none of the Cherokees would go near the draugr. Unlike me, they had common sense. All the chants over the sticks and the pipe had been said already. All I had to do is follow the ritual and hope Immokalee's magic was potent enough to work when an incompetent like me activated it.</p><p>I'd finished the circle, put the pipe away, and sat back on the log.</p><p>A pair of tiny eyes ignited by the roots of an oak to the left. No iris was visible - the entire eye was an almond-shaped slit of pale yellow glow. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Left,\" Tracy said. Her voice was perfectly calm.</p><p>\"I see it,\" Ghastek said.</p><p>Another pair sparked to the right, about a foot off the ground. Then another, and another. All around us the eyes fluoresced, clustered around tree trunks, staring from the underbrush, peering from behind rocks.</p> <p>\"What are they?\" Tracy asked.</p><p>\"Uldra,\" Ghastek said. \"They're nature spirits from Lapland. They live mostly underground. I wouldn't provoke them. Stay in the clearing.\"</p><p>The eyes stared at us, unblinking.</p><p>An blast of icy cold ripped through the clearing. The uldra vanished as one. On the ground, the deer moaned.</p><p>Here we go.</p> <p>I reached into my backpack and pulled out a small leather satchel, a small plastic bear full of honey, and a canteen. No turning back now. I got up off the log and walked over to the center of the glade where a large stone waited. Ghastek's and Tracy's vampires trailed me.</p><p>I brushed the leaves from the stone. The inside of the rock had been hollowed out into a stone basin, large enough to hold about three gallons of liquid.</p><p>\"When the draugr appears, don't talk to him,\" I said. \"The longer we talk, the more time he has to lock onto our scent. We'll have to fight to get clear anyway. No need to make things harder.\"</p><p>No response.</p><p>\"Ghastek? Do you understand me?\"</p><p>\"Of course,\" he said.</p> <p>\"The Cherokee's have set protective wards on the mountain. If we make it to the pillars by the road, we're safe.\"</p><p>\"You said this before,\" Ghastek informed me.</p><p>\"I'm just reminding you.\" This wouldn't go well.</p><p>I set the canteen on the ground and pulled the drawstring cord securing the pouch. It opened into a square of leather in the palm of my hand. Inside lay six runestones chiseled from bone, a handful of beat-up silver coins: two with the etching of sword and hammer and four with the viking raven.</p><p>I cast the runes into the basin. They clicked, rolling from the stone sides. It took me a second to unscrew the canteen. Ale splashed on the runes, drenching the bone in liquid amber. The scent of malted barley and juniper wafted up. The mist snapped at it like a striking snake.</p><p>\"Patience, Håkon. Patience.\"</p><p>I poured the rest of the ale out, emptied the honey into the basin and stirred it with a branch. Magic spread from the runes into the honey and ale. I reached in and took the runes out, all except two: the rune of enemy binding and Þjófastafur, the rune that prevented theft.</p><p>The mist hovered by me.</p> <p>I took a deep breath, grabbed the deer by the head and heaved it onto the basin. Moist brown eyes looked at me.</p><p>\"I'm so sorry.\"</p><p>I pulled a throwing knife out and slit the animal's throat in a single quick swipe. Blood gushed into the basin, hot and red. The deer thrashed, but I held its head until the blood flow stopped. The basin was a third of the way full. I stepped back and hefted the coins in my hand. They jingled together, sparking with magic.</p><p>\"I call you out, Håkon. Come from your grave. Come taste the blood ale.\"</p><p>Magic pulsed through the glade, ice-cold and shockingly powerful. It pierced my skin, ripping its way all the way into my bones. I recoiled. Panic crested inside me like a huge black wave. Every instinct I had screamed, \"Run! Run as fast as you can.\"</p><p>I clenched my teeth.</p><p>The air reeked of fetid, decaying flesh. It left a sickeningly sweet patina on my tongue.</p><p>The mist congealed with an eerie moan and a creature stepped forth to the basin. A thick cloak of half rotten fur hung off his shoulders, shielding the chainmail that covered him from elbow to the knee. The fur had thinned to long feathery strands, smeared with dirt. Long colorless hair spilled from his head in tangled mess. His skin was blue, as if he had an intense case of argyria.</p><p>The draugr dropped by the basin, dipped his head, and lapped the blood like a dog. Death had sucked all softness from his flesh. His face was a leathery mask of wrinkles, his nose was a misshapen nub, and his lips had dried to nothing, baring a mouth full of long vampiric teeth. His eyes were awful: pale green, and completely solid, as if made of frosted glass. No iris, no pupil, nothing. Just two dead eyes behind an opaque green membrane.</p><p>I gave him a couple of seconds with the blood and squeezed the runes. They warmed my skin, forging a link to the two left in the blood ale. \"That's is plenty.\"</p><p>The undead raised his head. Blood dripped from his chin. A voice came, hoarse, like the creaking of trees in the wood. \"Who are you, meat?\"</p><p>Not good. \"I've come to trade. Fair trade: fresh meat for an answer.\"</p><p>The draugr dipped its head toward the blood. Magic pulsed from the runes. The creature let out a long sound half way between a sign and a growl.</p><p>Ghastek's vampire moved to stand next to me.</p><p>The undead swiveled to the bloodsucker. \"You bring me dead meat?\"</p><p>\"No. Dead meat guards me. Dead meat has no power over the ale. If you want to talk to dead meat, that's between you and it.\"</p><p>The draugr rose above basin, shoulders hunched over. \"Dead meat speaks?\"</p><p>Ghastek shifted the vampire another step.</p><p>\"I wouldn't,\" I told him.</p><p>The vamp halted. \"Who are you?\"</p><p>Would it kill him not to screw with my thing?</p><p>The draugr leaned on the stone. \"I'm Håkon, son of Eivind. My father was a jarl and his father before him was one. The blood ale calls to me. Who are you, meat, that you interrupt my feeding?\"</p><p>\"I'm Ghastek Sedlak, Master of the Dead.\"</p><p>The draugr's mouth gaped wider. The creature rocked back and forth. \"Dróttinn of the dead. I am dead. Do you style yourself my master too, little dead meat?\"</p><p>Full stop. \"Don't answer that. Your ale is getting cold, Håkon. Have a taste.\"</p><p>The runes in my hand cooled. The undead took a step toward me, then turned, as if drawn by a magnet, dropped on his knees and drank deeply, sucking up the blood in long greedy swallows.</p><p>\"How did you come to be here?\" Ghastek asked.</p><p>Damn it all to hell.</p><p>The draugr turned its unblinking eyes to the vampire and raised his head from the blood for a moment.. \"We came for gold.\"</p><p>\"All the way from Norseland?\"</p><p>The draugr shook its head and drank.</p><p>\"Kate,\" Ghastek said. \"Make him talk. Please.\"</p><p>How do I get myself into these things? I gripped the runes. The draugr ducked down, trying to lick the blood, got within two inches of the red surface and stopped.</p><p>\"From Vinland. The north skrælingar had brought us gold to trade for weapons. They told us they bartered with the southern tribes for it. They said the southern skrælingar were soft. They were farmers, they said. Our seers had scryed the source of the gold, in the hills, not far from the coast. We took two ships and went looking for it.\"</p><p>\"Did you find the gold?\" Ghastek asked.</p><p>The draugr reared back, his teeth on display. \"We found woods, and giant birds, and skrælingar magic. We were retreating when a skrælingar's arrow found me.\"</p><p>\"Is that why you rose? To punish the native tribe?\" Ghastek asked.</p><p>He just wouldn't stop talking.</p><p>The draugr's clawed hands scratched the stone of the basin. Magic snapped from him, flaring like a foul banner. The hair on the back of my neck rose.</p><p>\"To punish them? No. I rose to punish the ingrate dogs who threw me into a hole in the ground like a common thrall. Not one of them bothered to even place a stone to mark my grave. I killed some of them and ate their flesh, but a few still lived. I've searched for them, but I can't find them.\"</p><p>\"You can't find them, because they've been dead for a thousand years,\" I told him. Damn it. Now Ghastek had me doing it.</p><p>The wrinkled mask of the draugr's face twisted in derision. \"So you say.\"</p><p>Ghastek's vamp leaned forward. \"If you're so powerful, why don't you just leave?\"</p><p>\"He can't. The Cherokee wards are locking him in. No more questions.\"</p><p>\"In that case-\"</p><p>I brought my fist down on the vamp's bald head. God, that felt good.</p><p>The vamp whipped around, glaring at me in outrage.</p><p>\"Shut up,\" I told him and turned to the draugr. \"Blood ale, undead. If you want any more, you will give me my boon.\"</p><p>The draugr rose, slowly. His fur mantle closed about him. Cold spread from him. My breath turned into a wisp of vapor.</p><p>\"Ask.\"</p><p>\"How do I find Ivar The Dwarf?\"</p><p>\"He lives in a hidden valley,\" the draugr said. \"Travel to Highlands and find Cliffside lake. At the north edge of the lake, you will see a trail leading you to the mountain scarred by lightning. Make the offering of gold, silver, and iron, and the dwarf will permit you to enter.\"</p><p>I released the runes and backed away. \"The blood ale is yours.\"</p><p>\"It's grown cold.\"</p><p>I kept backing up.</p><p>Magic accreted around the draugr like a second cloak. \"I do not want it. I want my blood hot.\"</p><p>Mayday, mayday. \"That's not the deal we made.\"</p><p>I passed the stick guarding the road.</p><p>\"I make deals and I break them.\"</p><p>The wooden stick between us shivered in the ground.</p><p>\"There is no escape, meat.\"</p><p>The cocoon of the draugr's magic burst with icy fury, snapping at me with dark fingers. The stick shot from the ground and pierced the draugr's head.</p><p>I ran.</p><p>Behind me a wail of pure fury tore through the forest and Ghastek's voice barked, \"Secure the creature!\"</p><p>Magic exploded with mind-numbing intensity. My eyes watered. The breath in my lungs turned into a clump of ice. The path veered right. As I took the turn at a break neck speed, I saw the draugr, towering over the trees, a mantle of dark magic streaming from his shoulders as he ripped a vampire in a half with his colossal hands.</p><p>\"I have your scent,\" the giant roared. \"You won't escape!\"</p><p>The translucent flood of magic crested the edge of the glade and rolled down, chasing me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The forest turned into a blurry smudge of green. I flew, jumping over the roots. Weeds slapped me.</p><p>The harsh stench of rot filled my mouth. Around me the trees groaned, as if pulled upright by an invisible hand. My throat burned.</p><p>I could almost see the road through the shrubs.</p> <p>The path turned left and I leapt straight down, praying the old injury to my left knee would flare up. The brush snapped under my weight and I tore down the slope, squeezing every last drop of speed out of my body.</p><p>A deep roar shook the ground.</p><p>No way to dodge, no direction to take but down.</p><p>A shadow fell over me. I threw myself forward. I rolled once, twice, catching a glimpse of a colossal clawed hand raking the forest behind me, flipped to my feet, and burst onto the road.</p><p>The pillar loomed to my right. I sprinted to it.</p> <p>The air whistled. Something large crashed on the road ahead of me, bounced, and sprung to its feet. Ghastek's vampire. Deep gashes scoured its flanks, oozing thick undead blood onto the sunblock. It looked like it had gone through a shredder.</p><p>The trees creaked behind me. The draugr had made it onto the road.</p><p>I ran like I've never ran before in my life.</p><p>The vampire froze for a fraction of an instant and galloped to the pillars.</p><p>My feet barely touched the ground. In my head my bad leg snapped like a toothpick.</p><p>The draugr's magic whipped at me, slashing at my back. I went airborne, rolled, and hit the ground hard. My head swam. I rolled to my feet</p> <p>Taller than the trees, the enormous undead towered above me, his eyes spilling icy green mist. Ragged chainmail hung from his torso. Colossal iron pauldrons guarded his shoulders. Huge chunks of his flesh were missing, and bone glared through the holes.</p><p>Holy shit.</p><p>The draugr raised a foot the size of a car. His magic swirled about him in a stormy cloud.</p><p>Curran in a warrior form shot out of the tree top, flying through the air like a grey blur.</p><p>I stood still, presenting a clear target for Håkon.</p><p>The draugr stomped forward.</p><p>Curran smashed into the back of the undead's neck. Bone crunched. The draugr spun, and I saw Curran ripping into the space between the neck vertebrae with his claws. Undead gristle flew.</p><p>The draugr roared, trying to swat at the Beast Lord. His head began to droop.</p> <p>Two ribbons of green magic snapped backward from the draugr, aiming for Curran.</p><p>Oh no, you don't. I opened my mouth and barked a power word.</p><p>\"Ossanda.\" Kneel, you undead sonovabitch.</p><p>The magic burst from me. It felt like someone had sunk claws into my stomach and tore out the muscle and my innards. The world went black for a tiny moment. I'd sank a lot of magic into it.</p><p>A horrible creak of bone snapping rolled through the air. The draugr's bony knees hit the road. The forest quaked.</p><p>I took a running start and sprinted at him.</p><p>The dazed undead raised its huge hands, trying to grab me. I veered left, avoiding the gnarled bone fingers, and scrambled up the giant's body, climbing the chain mail.</p><p>Above me Curran snarled.</p><p>The draugr slapped his chest, missing me by a couple of inches.</p><p>I pulled myself onto his shoulder and ran down the iron plate to his neck. Curran was ripping into the gristle. The undead flesh tore under his claws, and snapped back, regenerating.</p><p>I pulled Slayer and chopped at the gap he'd made. My saber smoked from the contact with undead flesh. The gap widened.</p><p>Curran grasped the edge of the two vertebra and forced them apart. I cut into the cleft, slicing through the connective tissue.</p><p>Cut. Cut. Cut.</p><p>Cartilage crunched.</p><p>Magic stung me, weaving about me in green strands.</p><p>\"Wait!\" Curran growled.</p><p>I stopped my sword in mid-strike. Curran jumped into the gap, his clawed feet on the edge of one vertebra, his hands on the other. He strained, pushing them apart. Steel-hard muscle bulged on his frame, shaking with effort.</p><p>The draugr howled.</p><p>Curran snarled, a vicious, short sound born of strain.</p><p>With a sickening screech, the draugr's head fell and rolled off his body. The colossal torso toppled. I jumped and landed on the road, my sword in my hand. Curran dropped down next to me.</p><p>We ran. We sprinted to the pillars.</p><p>Behind us an eerie, unnatural noise announced the draugr reassembling himself.</p><p>The green vampire that had fallen on the road picked itself up and chased after us.</p><p>We were almost to the pillars.</p><p>A shadow fell over us.</p><p>Curran spun. His head melted, reshaping into a lion's head. The Beast Lord roared.</p><p>The sound was like thunder. Deep, primeval, arresting, it froze the marrow in my bones. My instincts screamed and tried to drop me to the ground in a small quivering ball.</p><p>The draugr screeched to a halt.</p><p>We dashed forward.</p><p>The pillars flashed by our sides. I ran to a stop and turned around, my ribs hurting.</p><p>The undead giant strode toward us.</p><p>The pillars flashed with deep amber.</p><p>The draugr smashed into an invisible wall. Streaks of orange lightning clutched at his flesh. A deafening wail slapped my ears.</p><p>\"I will kill you! I will gnaw the flesh off your bones! I will pick my teeth with your femurs!\"</p><p>I vomited onto the ground.</p><p>Next to me Curran patted my back, his breath coming in ragged gasps.</p><p>The vampire next to me collapsed. The gashes on its body knitted together. A new pale skin slid over the cuts and began to smoke.</p><p>\"You owe me vampire blood,\" I told him.</p><p>\"Yes, yes.\" Ghastek sounded sour. \"Do hand me that canvas before he burns to death.\"</p><p>I jerked the canvas off the cart and held it up. \"I just want to hear you say it.\"</p><p>The vamp squirmed.</p><p>I shook the canvas a bit.</p><p>\"Fine. The draugar do exist.\"</p><p>\"And I was right.\"</p><p>\"You were right. The canvas, Kate.\"</p><p>I draped it over the vampire and looked at Curran. \"Did you hear that?\"</p><p>\"I heard that.\" Together we picked up the vampire and heaved the bloodsucker into the cart. \"I still don't believe it, but I heard it.\"</p><p>Two vampires dashed past the raging draugr, one purple, one orange. The remains of Ghastek's super-squad.</p><p>\"Over here,\" I waved. \"Run to safety!\"</p><p>\"Could the two of you gloat a little more?\" Ghastek said.</p><p>\"Oh I could,\" I said. \"I definitely could.\"</p><p>The vampire pulled the canvas back and peeked out, staring in the direction of the glade. \"Double or nothing.\"</p><p>\"What?\"</p><p>\"Double or nothing, Kate. I can take him.\"</p><p>Ghastek was a gambler. Knock me over with a feather. I sat on the cart.</p><p>\"Knock yourself out,\" Curran told him. \"We'll wait right here.\"</p><p>\"Don't take too long,\" I told him. \"We have a child to save.\"</p><p>Chapter Ten</p><p>I knew that something was wrong by the look on the face of the werewolf who had opened the door to the Pack's safe house. The Pack owned several properties in the city, and after we were done clapping and cheering at the sight of Ghastek's complete an utter failure, Curran and I had made a beeline for the nearest one to wash the undead nastiness off. The magic had fallen and the technology once again reasserted its grip on the world, and Curran was eager to trade the cart for a Pack Jeep.</p><p>A male werewolf had opened the door and his eyes had that particular look to them that meant some catastrophe had happened.</p><p>\"What is it?\" Curran growled.</p><p>The werewolf licked his lips.</p><p>\"Out with it,\" Curran said.</p><p>\"Andrea Nash has been seen in the city, interviewing business owners.\"</p><p>\"She is frequently in the city,\" I said. \"And interviewing is her job. She is investigating some murders for the Pack.\" Which I would look into as soon as we got Roderick out of that damned necklace.</p><p>The werewolf took a small step back. \"She's doing it in her beastkin shape.\"</p><p>\"Come again?\"</p><p>\"She's walking around in her beastkin shape. And some clothes.\"</p><p>All unaffiliated shapeshifters within the Pack's borders were required to present themselves to the Pack within three days. Until now, the Pack was able to successfully ignore the fact that Andrea was a shapeshifter, mostly because Curran made a very public point of ignoring it and nobody cared to bring it up.</p><p>Well, he couldn't ignore it any longer. Andrea pretty much made sure of that.</p><p>It made no sense. Andrea almost never used her beastkin shape. In fact, she pretended to be human most of the time. Going out in her fur and claws for her would be equivalent to me taking off my clothes and parading through the city naked.</p><p>Something had happened. Something really bad.</p><p>I looked at Curran. \"I guess we better go back to the office.\"</p><p>I walked through the office doors carrying a vampire's head smeared in green sunblock. I had picked it up after the draugr had punted it out of the ward zone. It was beginning to smell and needed to be buried in ice ASAP.</p><p>Andrea sat at her desk. She was wearing her beastkin shape, a perfect meld of human and hyena. It was the shape that could get her killed. Andrea's father was a hyenawere, an animal who turned into a human. That made her beastkin and many older shapeshifters would want to murder her on sight.</p><p>Want would be the operative ward. Andrea could take care of herself, I would help her, and Curran has made it plain that this was a prejudice he would not tolerate. He was waiting outside now in a parking lot a block away. I had asked him to give us a few minutes.</p><p>Andrea's feet were on the table. Her T-shirt was torn, her pants were in tatters, and a mess of blood and tissue stained both. She wiggled her clawed toes at me.</p><p>\"Hey.\"</p><p>\"Hey!\" Andrea raised her hand. There was a bottle in it. She was drinking.</p><p>I went into the kitchen, got a ceramic dish from under the sink, and deposited my vampire head. Then I came back, shrugged out of my sword sheath, and sat in the chair.</p><p>\"What are you drinking?\"</p><p>\"Georgia Peach Iced Tea. Want some?\" Andrea shook the bottle at me.</p><p>\"Sure.\" I sipped it. FIRE. \"What the hell is in this?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Vodka, gin, rum, sweet and sour, and peach schnapps. Lots of peach schnapps.\"</p><p>I've never seen her drink before. \"Do you actually get a buzz from this?\"</p><p>\"Sort of. It lasts for about thirty seconds or so and then I need another gulp.\"</p> <p>I tried to think. Derek was back at the Keep, but I was pretty sure Ascanio should have reported to the office this morning. \"Where is the bane of my existence?\"</p><p>\"In the shower, freshening up.\"</p><p>Damn it all to hell. \"Oh God, who did Ascanio screw now?\"</p><p>\"No, no, he's covered in blood.\"</p><p>\"Oh good.\" Wait a minute. \"The kid is covered in blood and we're relieved. There is something wrong with us.\"</p> <p>\"Tell me about.\" Andrea eyed me. \"Not going to mention my beastkin appearance?\"</p><p>\"I like it. The torn pants and gore-stained T-shirt is a nice touch.\"</p><p>She pointed her foot at me. \"I was thinking of painting my claws a nice shade of pink.\"</p><p>Those claws were three inches long. \"That would take a lot of nail polish. What about some golden hoops in the ears instead?\"</p><p>Andrea grinned, baring a row of sharp fangs. \"It's a definite possibility.\"</p><p>Okay, you know what, screw this. \"What happened?\"</p> <p>\"I saw Raphael this morning. I'd called him last night, because Jim put me on some shapeshifter murders and I needed to interview him. I asked for a chance to apologize.\"</p><p>Raphael, you spoiled moron, what the hell did you do?</p><p>I took her bottle and drank from it. I needed some alcohol for the next part. It tasted vile. I swallowed it down anyway. \"How did it go?\"</p><p>\"He replaced me with a better model.\"</p><p>\"He what?\"</p><p>\"He found another girl. She is seven feet tall, with breasts the size of honeydew melons, legs that start at her neck, bleached blond hair down to her ass, and her waist is this big around.\" She touched her claws together. \"They are engaged to be engaged.\"</p><p>Of all the stupid, idiotic things... \"He brought her here?\"</p><p>\"She sat in this chair right there.\" She pointed at a chair. \"I'm thinking of burning it.\"</p> <p>Andrea loved Raphael the way birds loved the sky and until a minute ago I would've sworn that he would run into the fire for her. \"Did you punch him?\"</p><p>\"Nope.\" Andrea shook her head. \"After he told me that his new sweetheart's best quality is that she isn't me, it didn't seem like it would make any difference.\"</p><p>\"Is she a shapeshifter?\"</p><p>\"A human. Not a fighter. Not that bright either.\" The false cheer evaporated form her voice. \"I know what you'll say - it's my own fault.\"</p><p>I wish I knew the right words to say. \"Well, you did check out of his life. You checked out of my life for a while. It still makes him an asshole.\"</p><p>\"Yeah, yeah.\" Andrea looked away.</p><p>Raphael was spoiled. He was handsome, and treasured by both his mother and Clan Bouda in general, but he was never mean or cruel. He was also the male Alpha of Clan Bouda. He had to know exactly what sort of risks he faced by bringing another woman and shoving her at Andrea. He had to have done it to provoke a reaction. The next time we met I'd pound his face into ground beef.</p><p>Still, I couldn't believe that there was no method in his madness. He'd chased Andrea for months and he'd won her. Perhaps this was some sort of stupid attempt to make her chase him.</p><p>\"Are you going to fight for him?\"</p><p>Andrea stared at me like I was crazy.</p><p>\"Are you going to fight for him or are you going to rollover on your back and take it?\"</p><p>\"Look who is talking. How long did it take you and Curran to have a conversation after that whole dinner mess? Was it three weeks or more like a month?\"</p><p>I arched my eyebrow at her. \"That's different. That was a misunderstanding.\"</p><p>\"Aha.\"</p><p>\"He brought his new main squeeze here after you called him with a peace offering. That's a slap in the face.\"</p><p>\"You don't have to tell me that. I know.\" Andrea growled.</p><p>\"So what are you going to do about it?\"</p><p>\"I haven't decided yet.\"</p><p>I wasn't sure she felt Raphael was worth fighting for. But once, when I was in a really bad place, Andrea told me that she felt like being with Raphael had healed her. She said he was picking up broken pieces of her and putting them back together. Well, all the pieces had fallen now, and Andrea was trying to reassemble herself on her own.</p><p>I'd seen Andrea fight. I saw her in unguarded moment, taken over by bloodlust and rage. Raphael would have to tread very carefully, because whether she decided that she wanted him or revenge, nothing would stop her.</p><p>I tried to pick my words carefully. \"Nothing is free. If you want it, you have to fight for it.\"</p><p>\"I'm thinking about it,\" she said. \"How did your day go?\"</p><p>I nodded at the vampire head.</p><p>\"That good, huh.\"</p><p>\"Yup.\"</p><p>\"I have a vamp body for you,\" Andrea said. \"It's in the freezer.\"</p><p>I gave her a nice smile. \"You shouldn't have.\"</p><p>\"It's a bribe for putting up with my psychotic break.\"</p><p>The car motor came on. Curran got tired of waiting.</p><p>\"That's my ride,\" I said.</p><p>The door swung open, and Curran walked in. I held my breath. Having Andrea and him at each other throats would be more than I could take.</p><p>Andrea got up.</p><p>A show of respect for the Beast Lord. I decided that breathing was a good thing.</p><p>Curran nodded to Andrea. I got up, too, walked over to him, and kissed him, just in case he was entertaining any violent thoughts. He winked at me.</p><p>\"Hold on, let me grab the vamp head.\" I went to the back and got my head.</p><p>When I came out, carrying the head in a plastic bag, Andrea and Curran were still in one piece and joined by a freshly washed Ascanio.</p><p>I waved at Andrea and Curran and I went to the car. Ascanio tried to linger, but Curran looked at him, and the kid decided to follow us.</p><p>We got into the car and pulled away.</p><p>\"And how did your day go?\" I asked Ascanio.</p><p>He turned to me, a dreamy look on his pretty face. \"We killed things. There was blood. Fountains of blood. And then we had barbecue.\"</p><p>Why me?</p><p>When we walked through the doors of the Keep, Doolittle waited for us. Roderick's necklace had turned the color of white gold. He was having trouble breathing. The next magic wave would be his last.</p><p>Ten minutes later we rode out of the Keep in a Pack vehicle. Curran drove. I sat in the passenger seat, holding a bowl of jewelry and bullets for our offering. Doolittle and the boy sat in the back. Roderick whistled with every breath, and Curran drove like a maniac to the north leyline, his hands locked on the wheel, his face a grim mask. We reached the leypoint in record time and he didn't slow down as he drove the Jeep off the ramp into the invisible magic current. The magic clutched the car and dragged it north to the mountains. Magic or technology, the leylines flowed always and I was damn grateful for their existence.</p><p>The current carried us to Franklin, spitting us out at a remote leypoint, and from there we drove up a winding road to the Highlands. It used to be a ritzy destination, beautiful lakes and waterfalls, wrapped in emerald-green forests that spilled from the sheer cliffs. Million dollar homes, leisure boats, play-ranches with pampered horses... But the magic had wrecked the infrastructure and the residents quickly learned that the mountains in winter are much less fun without electricity and take-out. Now the homes lay abandoned or taken over by die-hard locals. Little villages sprung here and there, small remote communities whose residents peered suspiciously at us as we drove by.</p><p>Cliffside Lake was beautiful, but we had no time for sightseeing. Eight hours after we had left the Keep, we stood by a mountain scoured with white lightning whip marks.</p><p>I had expected an altar, or some sort of mark to show the right spot, but there was nothing. Just a cliff.</p><p>I dumped a bowl full of jewelry and bullets onto the rocks. They scattered clinking. \"Ivar?\"</p><p>Nothing happened.</p><p>Doolittle's face fell.</p><p>\"Ivar, let us in!\"</p><p>The mountains were silent. Only Roderick's hoarse breathing broke the quiet.</p><p>We should've gotten here sooner. Maybe the offering worked only during magic, but as soon as magic hit, the necklace would snap Roderick's neck.</p><p>\"Let us in!\" I yelled.</p><p>No answer.</p><p>\"Let us in, you fucking sonovabitch.\" I hit the mountain with the bowl. \"Let us in!\"</p><p>\"Kate,\" Curran said softly. \"We're out of time, baby.\"</p><p>Doolittle sat down on a rock and smiled at Roderick, that patient calming smile. \"Come sit with me.\"</p><p>The boy walked over and scooted onto the rock.</p><p>I sagged against the mountain wall.</p><p>\"It's pretty up here,\" Roderick said.</p><p>It wasn't fair. He was only a boy... I put my face into Curran's shoulder. He wrapped his arms around me.</p><p>\"Can you hear the birds?\" Dolittle asked.</p><p>\"Yes,\" Roderick said.</p><p>\"Very peaceful,\" Doolittle said.</p><p>I felt Curran tense and turned.</p><p>A man walked up the path. Broad and muscular, built like he had to wrestle bears for his living, he had a wide face, lined with wrinkles and framed with a short dark beard and long brown hair. He wore a pair of soot-stained jeans and a tunic.</p><p>His gaze fell on Roderick. Thick hairy eyebrows crept up above the pale blue eyes.</p><p>\"What are you guys doing up here?\" he asked.</p><p>\"We're looking for Ivar,\" Curran said.</p><p>\"I'll take you to him.\" The man looked at Roderick and held out his hand. \"Come, little one.\"</p><p>Roderick hopped off the rock and walked over. The dark-haired man took his hand. Together they walked up the steep mountain path. We followed.</p><p>The path turned behind the cliff, and I saw a narrow gap in the mountain, its walls completely sheer, as if someone had sliced through the rock with a colossal sword. We walked into it, stepping over gravel and rocks. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Where are you folks from?\" The man asked.</p><p>\"Atlanta,\" I said.</p><p>\"Big city,\" he said.</p> <p>\"Yes.\" Neither of us mentioned the necklace choking the boy's throat.</p><p>Ahead the sun shone through the gap. A moment and we passed through and stepped into the light. A valley lay in front of us, the ground gently sloping to the waters of a narrow lake. A watermill turned and creaked on the far shore. To the right a two-story house sat on the lawn of green grass. A few dozen yards to the side a smithy rose and behind it a garden stretched up the slope, enclosed by a chain-link fence. Further still, pale horses ran in a pasture.</p><p>The necklace clicked and fell off Roderick's neck. The dark-haired man caught it and snapped it in a half. \"I'll take that then.\"</p><p>Roderick drew a breath. Tiny red dots swelled on his neck, where the necklace had punctured skin.</p><p>\"No worries,\" the man said. \"It will heal in the next magic wave.\"</p> <p>A shaggy grey dog trotted up to us, spat a tennis ball out of his mouth, and pondered Roderick with big eyes.</p><p>\"That's Ruckus,\" the man said. \"He'd like it if you threw the ball for him.\"</p><p>Roderick picked up the tennis ball, looked at it for a second, and then tossed down the slope. The dog took off after it. The boy turned to us.</p><p>\"Go ahead,\" Doolittle told him.</p><p>Roderick dashed down the slope.</p><p>\"So you're Ivar,\" I said.</p> <p>\"I am.\"</p><p>It finally sunk in. The necklace was gone. Roderick was safe. My legs gave a little bit and I leaned against the nearest tree.</p><p>Ivar studied me. \"Oh now, that's not good. Why don't y'all come down to the house? Trisha was making iced tea before I left. It should be about done.\"</p><p>As if in a dream I followed him down to the house. We sat on a covered porch, and Ivar brought a pitcher of tea and some glasses.</p><p>\"Why make the necklace that would strangle a child?\" Curran asked.</p><p>\"It's a long story.\" Ivar sighed. \"I take it you know what I am?\"</p><p>\"A dverg,\" I said.</p><p>\"That's right.\" Ivar looked at his hands. They were large, out of proportion to his body. \"I work with metal. As long as I remember myself, the metal spoke to me. Some things I make are harmless. Plows, horseshoes, nails. Some are not. I have made a blade or two in my time. The thing is, once the blade is out of your hands, you can't control what it's used for. I try.\"</p> <p>\"Like with Dagfinn?\" I guessed.</p><p>Ivar nodded. \"How is that boy doing?\"</p><p>\"Well,\" Curran said.</p><p>\"Good to hear. He had a bit a temper, that one.\" Ivar looked out, at the river's shore where Roderick and Ruckus chased each other. \"Trisha is my second wife. My first one, Lisa, well, she was... The best I can figure, she was elfen. No way to know for sure, of course. She showed up on my doorstep one day and stayed. She was beautiful. We had a daughter, but the valley life wasn't for Lisa, so one morning I woke up and she was gone. Left the baby with me. I did my best to raise her. She had hair like gold, my Aurellia. But I did a lousy job raising her. There was never any warmth in her, no empathy. I don't know why. She was fully grown, when a young man came down to the valley. He said he wanted to apprentice himself to me. To learn about smithing. I don't take apprentices, but the boy had talent, so he and I made a bargain. He would stay with me for a decade.\"</p><p>\"Ten years is a long time,\" I said.</p><p>\"It's enough to learn how not to do harm,\" Doolittle said.</p><p>Ivar threw him a grateful look. \"You understand. You can't teach the craft in ten years. I'm sixty and I still learn new things every day. But I thought a decade would be long enough to teach them what one should make and what on shouldn't and when. Can't just hand that kind of power to a man and let him loose in the world without guidance. So Colin and I made a bargain. He would wear the collar and stay here in the valley to learn all I could teach him. If he left the boundary of the valley before the time was up, the collar would kill him. He understood that there was no turning back. Once he put on the collar, he has to stay here for ten years.\"</p><p>\"Aurellia decided to leave?\" Curran asked.</p><p>Ivar nodded. \"She had no skills. There is a school down in Cashiers, and I tried to take her there, but she quit. Didn't care for it. Didn't care for the metal work either. Thought it coarse and common. It's my own fault: I had explained money to her and that in the outside world one can't just live off the land and barter the way we do here. So she decided Colin would take care of her. One day I went up in the mountains to the old Cooper mine, and when I came down, they were gone. I had warned Colin that if he'd managed to take the collar off, it would try to find him again and he wouldn't be able to resist. The way I figure, Aurellia got it off him somehow and they must've sold it. There was a lot of gold in that collar.\"</p><p>Now things made sense. Colin made the money. She needed him alive to take care of her. Roderick was just incidental.</p><p>\"Colin doesn't do metal smithing anymore,\" I told him. \"He's an accountant. I don't think he even remembers his time here. They way he acted when he saw the collar, I don't think he knew what it was. He and Aurellia had a daughter. The necklace killed her. That's their son.\" I pointed down toward the valley where the boy and dog played. \"Aurellia had put the necklace on him to keep it off Colin.\"</p><p>Ivar's face jerked. \"The necklace was never meant to follow the blood. It was only meant to keep Colin here.\"</p><p>Roderick came up the stairs. His face was flushed. \"We don't have to go yet, do we?\"</p><p>I would not take him back to that bitch.</p><p>Ivar looked at his grandson. There was a sadness there and regret. A lot of regret. I could see the resemblance between them now: same dark hair, same serious, somber look in the eyes.</p><p>\"Do you like it here?\" Doolittle asked.</p><p>Roderick nodded.</p><p>The medmage looked at the dwarf. \"Second chances don't come about often.\"</p><p>Ivar's face went slack.</p><p>\"He's right,\" Curran said.</p><p>Ivar took a deep breath and smiled at Roderick. \"Roderick, I'm your grandfather. Would you like to stay here for a while? With me?\"</p><p>Roderick looked at Doolittle.</p><p>\"It's your choice,\" the medmage said. \"You can come back with me, if you would like.\"</p><p>Roderick mulled it over.</p><p>\"I never had a grandfather before,\" the boy said.</p><p>\"I never had a grandson before,\" Ivar answered.</p><p>\"Can I go swimming?\"</p><p>\"Yes,\" Ivar said. \"Your grandmother will be back from the market soon. We'll have us some lunch and you can go swimming. The water's cold but you might enjoy it. Our kind does.\"</p><p>Roderick smiled. It was a tiny hesitant smile. \"I would like that.\"</p><p>Ivar got up and offered the boy his hand. \"Would you like to see my smithy?\"</p><p>Roderick nodded. The two of them walked off the porch together, hand in hand.</p><p>The three of us sat on the porch, watched the river, and drank the iced tea.</p><p>\"What about Aurellia?\" I asked.</p><p>\"She's still married to DA's brother,\" Curran said. \"A woman told me it would be a bad idea to do anything about that.\"</p><p>\"I wouldn't worry about Aurellia,\" Doolittle said, watching Ivar and Roderick but the smithy. \"I have a feeling she'll get what's coming to her.\"</p><p>Epilogue</p><p>\"Atlanta Avery hospital reported an extremely troubling case: a local woman, Aurellia Sunny, has aged forty years overnight. The medmage professionals theorize that accelerated aging had occurred due to a gold ring that had arrived in the mail and was left on Mrs. Sunny's front porch. The ring has since dissolved into her skin and is impossible to remove. The aging process is continuing and the family has been advised to make the proper arrangements. PAD detective Tsoi, the lead investigator on the case, had the following advice to the genral public, 'Don't accept gifts from anonymous parties. If you don't know who the package is from, don't open it.'\"</p><p>Atlanta Journal-Constitution</p><p>THE END </p> </body></html>"]