["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>1</p><p>Chris</p><p>She's asking for it and she knows it, I think to myself as I stare down at her barely legal pussy. She should know better than to taunt me, which is what she’s done all day.</p><p>The moonlight shines through her window, giving me a perfect view of her. Not that I need one. The image of her is branded into my brain, just like everything else about her. She’s an obsession that seems to grow more and more every day.</p><p>Lying on her back, her legs are spread just enough to get a nice peek at the pussy into which I’m going to unload all my cum. My balls ache, they feel so full. Reaching down, I pull myself from the black gym shorts I've already leaked a little cum into, the head of my cock glistening. I grab my balls and give a little tug, but it does nothing to stop the ache. No, but her pussy will.</p><p>Why shouldn't it? She’s the reason for it. Since she came stumbling into my life a little more than four days ago she's been taunting me. Well, she’s about to learn what happens when you taunt a man. I'm not one of those dipshit high school boys she's used to, the ones who probably do everything she asks in hopes of getting her into bed. I’ll take what I want from her, and she really needs to understand the difference between a boy and a man.</p><p>Her chest rises and falls with soft breaths as she lies there sleeping, her big tits straining against her tee, her hard nipples trying to break free. She looks like a sexy innocent angel that was sent to bait a man’s will, and she has. She has no clue of the predator standing over her while she sleeps. Maybe she thought she was safe from me because her parents are asleep down the hall in their own bed.</p><p>I’m on her before she can react, one hand over her mouth, the other around her throat. I can’t chance her parents catching me in the act if they hear her. Her legs spread wider for me, and I feel her pulse pick up in her throat, but she doesn’t try to scream. My cock is already rubbing against her pussy, the wetness turning me on even more. It takes me a moment to catch it, but I realize that it’s too wet to just be my cum leaking from my cock—something that seems to happen when she’s near me.</p><p>She’s wet. No, she’s fucking primed and ready for me. I tighten my grip around her throat a little more, and I growl in her ear, her soft blonde curls tickling my face, “You better have been dreaming about me.” The idea that she could’ve been thinking about someone else drives me fucking nuts. I didn’t know jealousy until she came into my life.</p><p>When I feel her nod in agreement, I release my hand around her throat and replace it with my mouth. The need to leave a mark on her rides me hard. She moans into my hand, making me suck her harder. Yeah, that will definitely leave a mark. Look at me, like a fucking high school kid leaving a hickey, sneaking into her room at night. I’d never marked a woman in my life. I can’t wait to walk past her tomorrow and see it on display. Everyone will know she belongs to someone.</p><p>Using my free hand, I push her tee up to grab onto one of her tits. I didn’t know an eighteen-year old could have tits as big as hers, but the proof is in my hand. I knead and pull on one, making the nipple even harder. Her legs spread wider for me, begging me to take her.</p><p>I should make sure she's completely ready to take me, eat her sweet cunt until her juices cover my face, but I can't. I have no control left. It all left the second her phone rang after dinner tonight while we were cleaning up the dishes. Her parents were still in the room so I couldn't react. I had to stand there and listen to her take a call from the high school quarterback, Croy, and agree to go to the Homecoming dance with him because, as she put it, “No, I'm not going with anyone already. I don't have anyone in my life right now.” I knew the last part was just for me. She stood there with a smirk on her face, one of her perfect little dimples showing, but her eyes were pissed. They had been for the past three days.</p><p>It's like my cock knows where it belongs. Slipping through her pussy lips as it slides right home, thrusting to the hilt and her tight little pussy clenching around my dick. I close my eyes, trying to get myself under control, but she pushed me too far. I’m afraid I’ll fuck her so hard she won’t be able to walk tomorrow.</p><p>I look down into her eyes. Not even a trace of fear. Here I am, looming over her in the middle of the night, and I think I just played right into her hands. Not that I can blame her. I had pushed her away, but I think she thought I meant pushing her away for good. I hadn’t. No, I was just trying to get my head back on straight, figure out how I was going to get us out of this mess we’d made before it crashed down all around us.</p><p>“You’re mine. Have been from the moment I laid eyes on you, since I sank into you Saturday night, took your cherry and claimed you. Do you understand me?”</p><p>She nods her head again, removing my hand from her mouth. I don’t give her the opportunity to speak because I know questions will pour from her mouth. I still don’t know what’s happening, or what is going to happen. All I know is that she is mine. I take her mouth with mine. Slow and sweet, letting her know this is more than just getting off, that I’ve missed her, and that she has driven me to the edge. She soon takes over, thrusting her tongue into my mouth, clinging to me like she never wants to let go.</p><p>I feel her trying to move her hips, wanting me to move with her. I’m barely hanging on to my control, and it doesn’t help when she comes at me like she’s starved. I release her mouth and flip us over, but before she can protest, I plunge my cock inside her.</p><p>“Ride me. Show me how much you want me.” I’ve never sought out a woman’s attentions before. I didn’t have to, and I never craved the need to know one wanted me, but with her I need it. I love seeing how much she wants me. It’s like an addiction. I feel like a puppy begging for a scrap. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her hand lands on my chest, and she stares down at me wide-eyed, probably because she’s never done this. The first and only time we’d ever had sex, when I took her cherry, I was on top, the one in control. Now I’m giving it to her. Not that she really has it. I grip her wide hips, my fingers digging into her soft skin, and I move her. I love that she has no idea what she’s doing. Who knew that could be such a fucking turn on? I’ll teach her everything she’ll know about sex.</p><p>It doesn’t take her long to see how I want her to move. She slides back and forth on my cock, her juices coating me more. She looks like a goddess on top of me. Her hips sway, her tits softly bouncing, her nipples hard and begging for my attention, her head thrown back, her curly blonde hair so long it brushes my balls as she rides me.</p><p>Releasing one of her hips, I slide my fingers between her pussy lips, finding her hard little clit. Her body jerks in response, her juices covering me, making me wish I’d had the control to have eaten her cunt before I took her. I could have her taste on my mouth right now.</p><p>“Tell me you're mine. No one else touches you.” I need her to reassure me after the little stunt she pulled tonight.</p><p>She responds instantly. “I’m yours, only yours.”</p><p>I strum her clit a little faster, her words almost sending me over the edge. I need her to cum, for her to milk my release out of me.</p><p>“Then cum for me. Work all that cum out of my cock. Take me deep inside you,” I grunt. I marked her neck, now I want to make that same mark inside her; cover the walls of her pussy with me.</p><p>I feel her pussy tighten, and I know she is going to go off. I rise and pull her to me, catching her mouth with mine, swallowing the sounds of her orgasm. Her body jerks against me as I cum hard, deep inside her. Just when I think I’ve emptied all I can into her, my cock jerks again, releasing a little more inside her.</p><p>She collapses onto my chest, and I wrap my arms around her. “I missed you so much,” she says so quietly I almost don’t hear her. I’m not even sure she knows she said it. Her breaths grow deeper, and I know she has fallen fast asleep.</p><p>I’d thought I could just touch her a little, give her what she wanted, but not fully take her. I was fucking shocked that first night when I’d gotten her sweet pussy underneath me, only to realize it was untouched. It wasn’t bad enough I was fucking my friend’s barely legal daughter in his own house while he was sleeping down the hall, but I was also taking her cherry.</p><p>I should have walked away, but it was too late. I’d already tasted her, and nothing would have stopped me from seeing her virgin blood coat my cock as I pumped in and out of her, filled her with my cum until it dripped down her ass and covered my sheets—sheets I stripped from my bed afterwards and kept.</p><p>I was past the point of no return, and I don’t know why I ever tried to fight it. I’ll never forget the day she walked into my life and flipped it upside down.</p><p>2</p><p>Chris</p><p>4 days earlier</p><p>“Can I help you with something?” I ask Phil on my way out to the back deck, taking a long swig from my beer. He’s grilling steaks for a family cook out. His daughter Megan is set to come home any minute, having spent the summer at a creative writing camp.</p><p>“I think I’m all set, Chris. Just ready for Megan to get home. I hate that the camp fell on her eighteenth birthday, but at least we get to celebrate it now that she’s coming home. Her friend’s mom is dropping her off soon. Hopefully she’ll like the party,” he says flipping the steaks on the grill.</p><p>Sitting on one of the patio chairs, I stretch my legs out. The beer is perfect after having spent the whole day out in the heat. Two days on the football field can be killer in the Texas heat. I’m just glad I have a place to crash, and I’m not sitting in some hotel room after a long day at work.</p><p>Phil and I have been friends since I was in college. I played football at Texas Tech, and met Phil when he was doing his clinicals. Part of his job was to see to the football players, and my knee wasn't the best so we spent a lot of time together. He and I hit it off right away, even though he was ten years older than me. He always gave me great tips on how to keep my body in working condition.</p><p>After I graduated from college, I went on to the pros, playing center for the Houston Texans. I played until my knee finally blew out. Phil did the best to try to get my knee back in shape, but we both knew I was playing on borrowed time as it was. If it wasn't for him, I wouldn't have lasted as long as I did. He fixed me as best as he could, but I’d done some real damage. There was too much wear and tear, and if I went back on the field, I was taking a chance of never being able to walk again. It was a tough decision, but retiring was the right choice. I’d made a lot of money in my years there, saving and investing the best I could. I knew my knee could’ve gone at any minute, and it was time to hang up my jersey.</p><p>“Thanks for being here with us today. I know you’re ready for your place to be finished.”</p><p>I was, but Phil and Janet’s home wasn’t a bad place to crash for a while. It was huge, plus I got to talk football every night, and I could bounce ideas off him. Better than going home to an empty house, something that had been bothering me lately.</p><p>“I’ve enjoyed the summer with you and Janet, and I know you’re both probably ready for me to get out of your hair,” I joke, knowing they would have had the house all to themselves this summer if I hadn't been staying here.</p> <p>“Are you kidding me? It’s been awesome having someone to talk football with nonstop. I’m looking forward to seeing what you’re going to make of the Wildcats this season.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I raise my beer and knock it against his. “Here’s hoping my first year as a high school football coach is a winning season.”</p><p>I had been talking to Phil one day, telling him how much I missed being a part of the sport, even though I didn’t have the urge to play anymore. He told me his local high school was looking for a new head coach and I would be a perfect fit. Not soon after, I interviewed, got the job instantly, and made the move. Only my new house wasn’t finished so Phil offered to let me crash with them this summer while I waited.</p><p>“I’ll drink to that. Oh, and to your house being finished next week,” he laughs and we clink bottles.</p><p>“Remind me never to build again. It’s taken them a month longer than they said, but they’ve guaranteed it by next Friday. Either way, I appreciate you letting me stay with you this summer. It’s clear those boys needed me here as soon as possible; they were a fucking mess. I thought I was going to have to do three a days if that’s even possible.”</p> <p>Phil lets out a laugh as he closes the grill lid. “No problem. Megan was gone the whole time, so someone needed to fill the silence.”</p><p>“Ha ha. Whatever,” I say, rolling my eyes. He and his wife have been far from quiet. I’m not sure if they always go at it like that or if it is because their kid is out of the house. “I’ll go check out front and see if she’s back. Wouldn’t want you taking your eyes off the grill. Remember the last time you got distracted?” I say this as Janet comes up behind him and puts her arms around his waist.</p><p>“I remember having to order out because the steaks were so burned. Good thing I didn’t marry you for your grilling skills.”</p><p>Phil turns around and scoops her up, kissing her lips. I take that as my cue and walk out. I’ve tried to give them their privacy this summer, but I can’t help but see them in moments like this and feel a spark of envy. I’ve never felt that way about a woman before. Never had a single thought of wanting something like that.</p><p>They are older than me, so I keep telling myself I have time, but at thirty years old, one would think I’d have felt something close to love. As it is right now, I just fuck to get off, and the women I’ve been with know the score. When I played college and pro, I kept my head in the game, even when it was off-season. I knew after I was done playing football I could try for something like that, maybe have a family, but it’s been a year since I left and I’ve still not felt any pull to want that with a woman.</p> <p>As I walk through the living room, I look at all the birthday decorations, eyeing a Star Wars cake in the middle of the table. What kind of eighteen-year-old girl would have a Star Wars cake? Maybe there was a mix-up at the store. Taking a step closer, I see Megan’s name written across it in pink icing. The last time I saw her was when she was eight years old, trying to get me to buy her Girl Scout cookies. I’m happy I get to see her again after all this time. I wonder if she looks like her mom. If so, I’m sure Phil has his hands full. It’s probably why he sent her off to that creative writing thing. Janet is tall, with legs for days, tanned skin, dark hair and bright blue eyes that stand out against her complexion. If Megan looks even a little like her mom, Phil is in trouble with the boys from school.</p><p>I walk around the corner, thinking about their little family, and run into straight into a woman. The collision knocks us both down on the ground, and I land on top of her. I brace myself, trying to make sure she doesn't take the impact of my weight. I’m not a small guy, and I still carry all of the muscle I needed playing center in the NFL.</p><p>“Oh shit, I’m so sorry,” I say, pushing up on my arms and looking down at her. Suddenly, my cock goes hard as a rock as I see this knock-out under me. It's like I’ve never had a chick this close before. Blonde waves frame her face as ice-blue eyes look up at me through thick-framed glasses. Her soft full curves press against me in the best way possible, and all I can think about is how she’s so soft.</p><p>She raises an eyebrow and spreads her legs a little wider. It’s then that I realize our position, me between her legs and her spread out under me. “Wow. Don’t apologize,” she says, her cheeks turn a little pink, but a smile forms on her face, showing two perfect dimples.</p><p>This must be the friend who was dropping off Megan, and though I want to stay in this position, I don’t want Phil's daughter walking in and seeing us this way. I sit up, pulling her with me and helping her off the hardwood floor. Her arms go around my neck instantly, like she misses being pressed up against me. Who am I to turn down an invitation like this from the hottest woman I’ve ever seen in my life? That’s saying a lot with all the groupies and jump-offs I had running around me when I played pro. I turn us both so we are in the shadows in the hallway, blocked off in case anyone happens to walk by. She presses her hips to my groin, pushing her body against my hard cock. Her softness fits me perfectly. She’s so tiny compared to me in height, but her curves let me know she could handle me. Like I said, I’m not a small guy, so I could grab onto her and not have to worry.</p><p>I feel the heat between us light up fast, and I need to know more about this chick. “So I shouldn’t apologize for knocking down a gorgeous woman?”</p> <p>“Not if you’re going to greet her like this,” she breathes, rubbing her body against mine a little more. Her actions are bold, but her cheeks redden even more. Shit, she looks innocent like that.</p><p>Jesus, who is this chick? Fuck if I’m not harder than I have ever been in my life, and that’s just from being pressed up against her. Her smell, her softness, everything is pulling me in. I feel like I’m drowning in desire. Maybe it’s been too long since I’ve been with a chick. My mind has been so focused on my new job that women haven't even been a blip on my radar. Some of the teachers have been trying to throw themselves at me since I started, but I didn’t have time or inclination. But this little curvy bundle of softness has got my attention. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Megan?” I hear Phil calling from the back of the house. I feel the woman in my arms freeze, no longer rubbing up against me.</p><p>“Hey, we better get out there before Megan walks in. Give me your number. I want to see you again,” I say, looking down and searching her eyes, but her big-framed glasses hide them from me. Shit. I can’t remember the last time I asked for a chick’s number. Normally they are slipping them to me, but no way am I letting this one get away. Something about her feels different. Feels right.</p><p>The woman giggles and leans up on her tip toes, licking my neck and giving it a small bite, like she needs a taste of me. I nearly cum in my pants, and just as I’m about to, she pulls back, ducks under my arm, and walks down the hallway. I watch her go, feeling like I just got hit by a linebacker, and before I know it, I’m following behind her, watching her ass wiggle.</p><p>“Megan! There you are!” I see Phil scoop up the woman, giving her a big hug. Then I hear Janet scream “Megan!” while wrapping her arms around the two of them. The family of three embrace, and I’m just standing there with my jaw on the floor.</p> <p>Well, fuck.</p><p>After a second I shake the fog away and grit my jaw, making sure I wipe the confused look off my face before anyone notices. I think about what could have just happened. I should apologize to Megan, to her family, but I can’t find the will right this second to mean it. I’ve never been so struck by a woman before, and it’s laughable considering she literally struck me.</p><p>Phil and Janet turn to look at me. “Megan, do you remember Chris, an old friend of mine? He took the head football position at your high school.”</p><p>Her nose scrunches at Phil’s words. I step forward and hold my hand out and she takes it. “Good to see you again, Megan.” I rub the inside of her wrist with my finger, feeling her pulse pick up.</p><p>“Hmm, it’s good to see you too. Not sure I remember you, though.” I study her for a second, not really shocked she doesn't remember me. It was over ten years ago and we only met once. I never hung out with Phil at home because I was usually on the road.</p> <p>“Megan doesn't care much for football, or sports for that matter so she might avoid you like the plague,” Phil jokes, and I almost want to laugh at his words. If he only knew what happened moments ago. That was definitely not avoidance.</p><p>Regretfully, I release her hand, and Janet pulls Megan toward the back deck. As they go, she looks back over her shoulder at me, one of her dimples showing, and her blush returns. My dick twitches, and I curse under my breath. I storm to the bathroom and splash some cold water on my face, trying to get my head straight. I look in the mirror and give myself a pep talk. ‘Jesus, Chris, she’s your best friend's daughter, and she’s barely eighteen. Get it together.’ I reach down and adjust my cock, trying to hide the fact that the thick bastard is hard as a rock and ready to fuck.</p><p>When I make my way out back with the family, I look over and see Megan saying hello to everyone who’s come to celebrate her homecoming and birthday. I grab my beer from the patio table, retake my chair and just watch her.</p><p>It’s then I realize how young she really does look. When she was pushed up so close against me I couldn’t see all of her, more just feel her.</p><p>Her long blonde hair hangs in waves to her ass. Her bright blue eyes are partially hidden behind her oversized glasses, so I can only catch a glimpse of them here and there. She wears a shirt that fits tight to her tits and reads: I never received my acceptance letter from Hogwarts, so I'm leaving the Shire to become a Jedi! Whatever the fuck that means, I have no idea. She has on loose jeans that she’s rolled at the cuff, and simple white tennis shoes.</p><p>If she wasn’t so curvy I would think she was trying to downplay her looks. It’s almost like she rolled out of bed and just threw something on. Not something that typical of a young woman. I can't keep my eyes off her as she moves around the backyard, talking to people and saying her hellos. She glances over at me every so often and as time goes on she gets bolder whenever she looks, her glances lingering.</p> <p>I try not to stare at her, but it’s hard. Looking around, I start to notice that everyone here is my age or older. Shouldn’t this place be loaded with other teenagers? I just push it to the back of my mind, thinking maybe it’s just for adults, and Megan will have another party with her friends later.</p><p>“Coach Burns.” I pull my eyes away from Megan at the sound of my name. I see Croy, my starting quarterback, standing in the doorway of the back porch. “You said I could stop by and grab that playbook,” he says before I can ask what he needs.</p><p>“Yeah, I’ll go grab it.” I completely forgot he was stopping by, and I’m sure that has something to do with the woman I can’t seem to keep my eyes off of. “Wait here. I’ll be right back.”</p><p>Making my way upstairs, I grab the playbook off the desk in my room, but stop outside Megan’s door. I’ve never had the desire to open it before, but I find myself pushing it open now. I’m not sure what I expected to find, maybe pink walls, fluffy pillows, and posters of teenage heartthrobs on the wall, but what I get is something completely different. Her walls are a bright green, with a model of the solar system hanging from the ceiling. Books cover every free space. Three computer monitors sit on her desk, a screensaver of the periodic table divided across the screens. Her walls are indeed covered in posters, but I don’t understand half of the slogans and phrases emblazoned across them. The one that says \"Dear Nasa, Your Mom Thought I Was Big Enough” gets a bark of laughter from me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She’s a dork. And fuck, why does that turn me on even more? Get it together, Chris. Shutting her door, I try to push all thoughts of Megan out of my head. Off limits. I tell myself again. When I get back to the deck, I look around for Croy, and my jaw tightens when I spot him. Megan has her back pushed to the wall of the house, and I see Croy leaning into her, his hand resting beside her head. She’s smiling at whatever he is saying.</p><p>I have the sudden urge to punch him right in the face, which is contrary to what I’ve been doing all summer: making sure his ass doesn’t get hurt so our season doesn't go to shit. Wouldn't look too good if the coach punched the starting quarterback right in his pretty-boy face.</p><p>“Anderson!” I snap his last name like we’re at practice, and it achieves the effect I want. He snaps to attention, looking like a deer in headlights. “Here’s your book. Now get your ass home and get some rest. We had a long day today.”</p><p>“Sure thing, Coach,” he says, but not before he turns and tugs a strand of Megan’s long hair. “See you Monday.”</p><p>My grip tightens on the playbook, but he releases her hair and makes his way over to me before I can snap at him again. Handing it over, I resist the urge to tell him to stay away from Megan, who’s just staring over at us. I wish I knew if it was me or Anderson she had that dreamy look in her eyes for.</p><p>Croy makes his departure, and Megan continues to stare at me. Fuck, I can’t do this. I break eye contact and walk back over to where I was sitting. I go through the motions for the rest of the night—staying long enough to eat and sing happy birthday so I don’t seem like a dick for bouncing out too soon.</p><p>I make the excuse of a long day out on the field with the boys, and head to bed. I debate masturbating; my cock is still hard from watching Megan bounce around the backyard all night. She would sometimes huff out a laugh that would turn into a snort, making her blush with embarrassment, and fuck me, if that didn't get me hard too. I decide against rubbing one out. I know I’d think about her while I did it, and that wouldn't help the urge I was struggling to keep away. I’ll just go without as a little self-punishment. Stripping out of my clothes, I climb into bed, letting images of a curvy blonde play through my mind as I slowly drift off.</p><p>It’s not long after when I hear a click, and my eyes pop open, unsure of what the noise was. I wait a second, and when I don’t hear anything else, I start to drift back off.</p><p>Moments later, I feel the blanket shift, and my eyes fly open. I see Megan standing beside the bed, her hand creeping under the bedclothes.</p><p>Reaching out, I grab her wrist, pulling her close to me. A gasp escapes her lips, and she’s probably shocked by my fast movement. My heart starts racing, but I want to be quiet so her parents don’t hear us.</p><p>“What are you doing?” I whisper, looking over to the door. I see that it’s locked. Megan must have flipped the lock when she snuck in. Her parents are just down the hall, and they could hear us if we’re too loud.</p><p>She leans in and whispers just as quietly into my ear. “I couldn’t sleep. I thought maybe...”</p><p>Her words trail off, but I feel her hand run across my naked chest and down my stomach. It’s then I realize where her hand is headed, and I’m not wearing any underwear. I like to sleep naked in the summer, and I’m thinking that wasn’t the best decision with her in the house, but my cock has been hard all night, pressed against my pants, and I’d wanted to let it breathe.</p><p>“You need to go back to your room,” I say through gritted teeth, but I don’t let go of her wrist or push her away. I look down and see she’s wearing an oversized t-shirt with the neck cut out, so it hangs off one shoulder, exposing her collarbone to me. I’m so fucking hard at being this close to her, seeing her skin, and smelling her sweetness. I breathe deeply and I catch a hint of something more, something that smells like desire. I close my eyes tightly and try to be strong. “Leave, Megan, or you’ll be sorry you stayed.”</p><p>Her hand pushes forward under the covers, and I feel her fingertips touch my dick. Cum starts to seep out of the tip at this slight touch, and I have to hold it back to keep from cumming.</p><p>“Megan,” I warn, but she doesn’t stop. Instead, she leans closer to me, putting her neck against my mouth and grabbing my cock under the covers. I moan at the sensation, but lean back to try to break free. As I do, she puts a knee on the bed, making her t-shirt rise, and opens herself to me. I can smell her pussy, and my mouth starts to water. Her juices must be coating her legs, and I look down, seeing her teenage cunt open and ready, begging to be taken.</p><p>“Please, Coach Burns. I need this. I know you want me. I want this too.” She pauses for a minute, as if she’s looking for the right words. “I want to get off, and get you off too.”</p><p>I look into her eyes, and scoot back in the bed. I’ve never been tempted like this before, and goddamn do I want to sink inside her. I look to the door, double checking that it’s locked, and think it over. I could do this. I can just get her off and she can leave. I’ll jerk off about a dozen times after, but I can make this quick. It’s the only way to get her to go, and we don’t want to be caught. I’ll do this for her and she’ll go, I lie to myself. “Fine. But you’ll be quiet. I don’t want your parents finding out. And this stays between us, right?” I look into her eyes. They’re finally free of her glasses and look so much bigger and brighter now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I promise not to tell.” She puts her other leg on the bed, and gets in, lying down beside me. I pull the covers back, exposing my naked body, and she pulls up the hem of her t-shirt, showing me her wet cunt. “You can take me if you want to. That can be our little secret too.”</p><p>“Fuck.” Her words make more cum leak out of me, and all I can imagine is dumping a load inside her young pussy. I want to wear her cunt out and make her remember who's been there. I have this urge to mark her like she’s mine, but I know I have to hold myself back. She might be eighteen and legal, but I still work at the school she goes to, and her father is a good friend to me. “I’m getting you off. That’s it.” I shoot her a hard look so she knows that’s all we’ll be doing.</p><p>Megan bites her lip and nods her head, reaching down between her legs, spreading her swollen lips open for me. She’s baiting me. Her clit is soaked with her sticky cream, and I move to get between her thighs, my mouth watering. Before I put my mouth on her I look up into her eyes. “Our secret, right?”</p><p>She nods her head, and I latch onto her cunt, sucking up her sweetness and eating her out. She starts to moan, and I reach up, putting a hand over her mouth. She puts her hands over mine to help muffle her cries as I drink down her juices, licking inside her cunt to get it all. I want every last drop of her. She’s the sweetest thing I’ve ever tasted, and the more I eat her, the harder I get. I’m humping the sheets, trying to find relief, but the more I taste, the more I want.</p><p>While sucking her clit, I brace her thigh open with one hand, still holding the other over her mouth. It doesn’t take me long before she starts to grind against my face, her back bowing off the bed. I feel her cum against me, and like an animal I want more. I pull back and lick my lips. “Another.” I whisper, and go back to sucking on her cunt. I want to see her cum again.</p><p>She gives me another orgasm moments later, and before I know what I’m doing, I’m on top of her, the tip of my cock at her opening. I wonder if that Croy fucker has ever seen her like this before. The thought almost sends me over the edge. She’s been so forward with me that I can’t imagine her lacking for male attention.</p><p>I’ve become possessed by the need to mark her as mine so that no one else can ever touch her again. I want her for me and me alone from this day forward. I’m beyond caring that she’s off limits. I need to fuck her. Now.</p><p>“You're going to take me inside.” I mean it as a question, but it comes out more like a statement. I can’t seem to get myself under control with her.</p><p>“Yes, Coach. I need you.” She pushes her hips up a little, inviting me in.</p><p>I lean down and kiss her full lips, letting her sticky juice slide between our tongues. She moans at her flavor. Knowing the taste of her own pussy turns her on. It turns me on too. I thrust hard inside her, giving us both what we want, and as soon as I plunge all the way inside her, I pull back to look at her, my eyes wide. I felt a barrier break as I thrust in, and it hits me.</p><p>“Goddamn it, Megan. You’re a virgin?”</p><p>Red blossoms on her cheeks, and she nods her head slightly. I can see little tears start to form in the corners of her eyes, and it nearly breaks my heart.</p><p>“Oh God, baby, don’t cry. I’m so sorry.” I feel like an asshole. I should have been gentler. I never thought she could be a virgin with the way she’s been acting, but knowing I’m the only man to have been inside her makes me almost cum on the spot.</p><p>I lean down and kiss her cheeks, holding her to me, trying to comfort her and doing my best to keep myself from embarrassing myself by unloading all my cum into her. Fuck, I shouldn’t be doing this. I’m balls-deep in untouched pussy, and I can’t make myself pull out. She’s squeezing me tighter than anything I’ve ever felt, and all I can think about is fucking her hard and deep to try to break her in.</p><p>I look into her eyes, and she gives me a little smile. “You want me to pull out, baby? This should’ve been better for you. We shouldn’t be doing it like this.”</p><p>Her eyes get big, and she shakes her head. “Please don’t stop. I want this. I want you. Don’t you feel it?” She puts her hand on my heart, and I know what she means. The connection between us is real.</p><p>“You’re not on any birth control, are you?” I can’t believe I didn’t remember to put on a condom, something I'd never done in my whole life. Fuck, she has me twisted.</p><p>She has the decency to blush again, and shakes her head.</p><p>“Fuck.” My dick twitches at that answer, the image of her, swollen with my child, fills my mind. The sudden urge to breed her and make her mine drives me crazy. Everyone would know without a doubt that she belongs to me. But I think better of it and decide not to cum in her. “Fine. I’ll fuck you, but I’ll pull out.”</p><p>“I want you inside me. All of you,” she pleads, and I’m not sure she knows what she’s asking for.</p><p>“No,” is all I say in response, because it’s all I can say. If we keep talking about me cumming in her virgin pussy, this is going to be over before it starts.</p><p>I pull out a little and push back in, letting her feel how much I want it. She tilts her hips up, inviting me inside her tight body, and when I thrust hard, I feel myself hit her cervix. If I push up against that and cum, I know she’ll get pregnant. Cumming right inside her would breed her instantly.</p><p>That thought makes me cum inside her a little, and I feel my seed spreading against her virgin walls, making the thought of pulling out that much harder.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her pussy clenches me so tightly, and I reach down to rub her hard clit, wanting to pull another orgasm from her body. It only takes a few strokes of my thumb and a couple of thrusts from my raw cock before her cunt is singing for me. She squeezes me harder, and I feel a flood of cunt juice run down my balls.</p><p>“Goddamn it. I’m gonna cum.” I go to pull out, but her legs lock around my ass and pull me further into her. I could probably break free if I tried, but I don’t want to. I want to cum in her bare cunt. “Megan, I could get you pregnant.”</p><p>She moans and pushes me deeper inside her.</p><p>“Fuck.” Shoving my face in her neck, I thrust hard, pulling her hips against me with both hands, and I feel the tip of my cock nudge her cervix again. I close my eyes and empty into her.</p><p>“You’re mine now,” I say, feeling her nod against me.</p><p>I still can't believe that was only Saturday. She passed out before I even pulled myself from her body, so I had to carry her back to her room. I hated leaving her, but what choice did we really have? I cleaned between her legs before returning to my own room, where I stared down at the bed. Her virgin blood and my cum were mixed together on the sheet. I pulled it from the bed and folded it up, hiding it away in my dresser. What I really wanted was to hang it out the window for all the world to see. It now made sense when I heard tales of kings hanging sheets smeared with their virgin bride’s blood out for all to see.</p><p>Glancing over at the clock, I see it’s 1 a.m., and she’s fast asleep on top of me. I came in here to talk to her, but seeing her sleeping like that got the better of me. We both have to be up early for school, and I know I need to talk to her, reassure her of what’s happening here. I’ve been avoiding and ignoring her as best I can.</p><p>Sunday, I spent the day with her father, but she came into the room, and I could tell she wanted to talk, so I stuck close to Phil. Once school started back on Monday, I had to pass her in the hall, and it was the worst feeling in the world. Wanting to reach out and grab her, but knowing I couldn’t, and it’s why I’ve been staying away. Tuesday and today were the same, not being able to talk to her or touch her drove me to the edge of insanity. It’s somewhat easier to show no expression, but clearly that was hard on her. I started locking my bedroom door to keep my distance, but every night I waited for her to break in. I’m moving out Friday since my place is finally ready, and I’m sure that’s probably freaking her out too.</p><p>When I heard her on the phone tonight, it got the best of me, and I needed to feel her again. Remind myself of what we have, and remind her body that I own it. I just have to figure out how we’re going to do this. How we can do this without fucking up her life? I want her, and I have to have her, but I want to do it the right way. It’s time we sat down and had a talk.</p><p>3</p><p>Chris</p><p>“Take a lap, Anderson.”</p><p>It’s Thursday afternoon, and we’ve got our first game tomorrow against the Badgers. Their defense is going to kill us if my quarterback doesn't get the plays down.</p><p>After a hard practice, the boys are tired but ready. I think we are all feeling the adrenaline of the first game of the season and I’ve got my fingers crossed. It’s my first ever game as coach. I send them all to the showers as I talk to the assistant coaches, making sure everyone is ready, giving them assignments to go over tonight. This isn’t just a big game for the school, it’s also a big game for me too. I want to show everyone that these boys have what it takes. With this being my first coaching job, some of the media is bound to be here, and if there are scouts watching, I want these boys to have the best opportunity to show off.</p><p>When I walk through the double doors of the locker room, I head to my office, which is off to the side. I pass a row of lockers, and stop short when I hear the Megan’s name.</p><p>“Who knew little dorky Megan would sprout up like that? Never knew a Harry Potter shirt could give me a woody. I bet that pussy of hers is cherry tight.”</p><p>“Oh yeah, nobody’s gotten in there yet. I plan on getting it first Saturday night after the Homecoming dance. She’s gonna be all mine.”</p><p>It takes everything in my body not to rip apart the lockers separating me from the boys on the other side. I heard one of the juniors, Atkins, talking, but I know Croy Anderson is the one talking about fucking her. I should go over there and break it up, but my fists are clenched and I’m gripping the playbook so hard I’m about to rip it in half. I can’t beat a student, I can’t beat a student, I can’t beat a student, I keep chanting in my head over and over.</p><p>“I saw that hickey you left on her neck. Nice way to mark your territory, Anderson.” I hear a slap on the back.</p><p>“Oh yeah. Gotta let everybody know she’s claimed property. Can’t let anyone get that cherry before I do. She fucking loves it when I suck on her. She likes it everywhere, if you know what I mean.”</p><p>My eyes go blurry and I blink a few times, trying to remove the red from my vision. I’ve had all I can stand, so I stomp around the lockers to the other side. When I round the corner, everyone looks at me, but my eyes are locked on Croy.</p><p>“Anderson! On your feet!” My voice echoes through the locker room, and he pops up off the bench looking like a scared little shit. Good. He should be scared. I want to rip his lying face off, but I control it. I can’t go to jail, because then I’d be without Megan, and he’s not worth it. “I don’t want to hear that kind of talk in here again. Do you understand me, boy?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He nods his head nervously, but I wait for a response. “Yes, Coach Burns.”</p><p>“I want you back out on the field. You’re running laps with Coach Evans, and once he feels like you’re done, you’re going over the playbook front to back. Then you’ll come in early to go over it with him. We clear?”</p><p>“Yes, sir.” He looks defeated as he walks past me, back out of the locker room, but I don’t give a flying fuck.</p><p>I turn to the other players, and slam my playbook on the bench. “I don’t know what kind of locker room crap your last coach put up with, but that’s done and over. If I hear anything like the conversation I just heard ever again, you’ll all be warming the bench come game day.” They all look at me with wide eyes, but I’m beyond enraged. I know it’s because they were talking about Megan. This kind of talk always happens when guys get together, not just in locker rooms. But I’m blinded by my anger, and I don’t care. “Everybody clear on this?”</p><p>“Yes, Coach Burns,” they say in unison.</p><p>I pick up my playbook and storm into my office, throwing it down on my desk. She’s gotten so deep under my skin that the mention of her name is all it takes to send me over the edge. That little fucker claims he gave her that mark. That mark is mine. She’s mine. I laid claim to that body first. I am the one who broke in her pussy nice and sweet. She’s only had me inside of her. Not some skinny little fucker just trying to get a nut. I’m working myself up, but I can’t stop it. I check my watch and see that her last class is done for the day. I looked up her schedule on the school computer system, memorizing it, and I know she should be nearly home. I grab my keys off my desk, having already made up my mind.</p><p>I bust out of the locker room and out on the field, and I see Coach Evans running Anderson. I give him a chin lift as I approach, and he walks over with his arms folded. “How many does he need?”</p><p>“Enough to make him remember what happened in there, but not enough that he can’t play tomorrow.”</p><p>“Fair enough.” Coach Evans turns back to the field and watches Anderson make a lap.</p><p>I go out to my truck and slam the door, cranking it up and hitting the gas. I’ve got to get to Megan. I’ve got to see her right this fucking second to calm this beast inside me.</p><p>I take the back roads to get to Phil and Janet’s house, driving as fast as I can. When I pull up to the driveway, I thank God neither of them is home. They shouldn’t be back for a few hours, but one can’t be too careful. I jump out and pass Megan's red Honda in the garage as I jog into the house to look for her. I blow through the kitchen and living room, taking the stairs two at a time. When I get to her door, I don’t bother knocking, I just push it open.</p><p>She’s standing there in a loose t-shirt that reads, ‘I run because Gandalf told me to’ and baggy cut-off shorts. She has a pencil through a messy bun in her hair, and her big glasses are nearly falling off the end of her nose. She’s more gorgeous every time I see her, and right now, I want nothing more than to take what someone said isn’t mine.</p><p>Kicking the door shut behind me, I reach back and lock it, just in case. She slowly backs away from me, until the backs of her legs hit her bed. I stalk towards her, my steps careful. I want her to see me coming. This isn’t sneaky and this isn’t a surprise; I came here to take her.</p><p>“Chris, what’s wrong?”</p><p>“That little prick Croy Anderson was spreading rumors about you two today, and I happened to overhear him.”</p><p>I take another step, and she tries back away further, but she’s run out of room.</p><p>“What did he say?” she asks, her eyes widening.</p><p>“Said he gave you that mark on your neck. Said your pussy was still cherry, and he was going to get it Saturday after the dance. Know anything about that?”</p><p>She squares her shoulders and puts a hand on her hip. “Are you seriously asking me that? You’re the one who put the hickey on my neck for the whole damn world to see. And I’m pretty sure we were both there the night we first...um...when I lost my...you know...” She loses steam as she tries to say I got in that tiny cunt first.</p><p>“You mean when I got inside you first? You mean the night you came to my room, and I popped your cherry, and got your virgin blood all over my dick?”</p><p>Her face turns bright red and she looks away, nodding her head.</p><p>I get in front of her and grab her chin, making her look at me. “Best night of my fucking life, baby.”</p><p>I lean down and take her mouth, devouring her with my kiss. I reach down, pulling at her shorts and panties, pushing them off her hips to the floor. I break the kiss long enough to take off her t-shirt and bra. Getting her naked as fast as possible is my only goal. When she’s completely bare to me, I push her hips, causing her to fall back on the bed. I grab her legs and pull her to the edge, throwing her feet over my shoulders, and use my fingers to spread her pussy lips open for me. I dive in, rubbing her ripe cunt all over my face. I want her scent all over me when I fuck her, so I rub her sweet honey all over my mouth and nose. I want to be covered in her sticky sweetness so I can smell her pussy as I fuck her. I push two fingers inside her, rubbing her sweet spot as I lick and suck. She needs one quick orgasm, and then she’ll be soft and ready for my dick. I want her squirting on my cock as I fuck her hard, and she needs at least one orgasm first.</p> <p>I stroke her g-spot and suck her clit as she rides my face hard. She’s got my hair gripped in both her hands, humping my face like a horny slut. Knowing she’s never been like this with anyone else before turns me on even more. Only I get to see her like this. I work her harder, moaning against her sweet cunt. It doesn’t take long before she’s cumming on my face, leaking out her sweet honey and coating my fingers. When I pull them out, I see they are covered in sticky juice, so I lean up and rub it across both her nipples. I want her titties tasting like her pussy too. She’s too fucking good to only have that flavor in one spot. I wish her whole fucking body tasted like that sugary cunt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I strip quickly, keeping Megan’s ass hanging off the edge of the bed. Once I’m naked, I push her knees up, opening all of her to me. I line my cock up and thrust home inside her warmth. She’s still virgin tight, and I keep thinking at some point she’ll loosen up. But so far it’s almost as if she gets tighter every time I get in her. Her cunt is primed and my strokes make loud smacking sounds. “Goddamn, Megan. You’re so tight and sweet. Tell me who you belong to, baby. I’ve gotta cum in you again. I need you to tell me who owns this pussy.”</p><p>“You do, Coach. You own me.”</p><p>I lean down, sucking a fat nipple into my mouth, tasting her cunt juice all over it. I moan around it and thrust hard, bottoming out against her cervix. I know she’s still not on anything, and we are both riding bare. Her unprotected pussy is sucking up my cum, begging to be bred. The thought nearly has me going off. If I get her pregnant, there is no way she wouldn't be mine.</p><p>“You want me to breed you, don’t you?” The smacking sounds get louder as she gets wetter. My words are making her leak out honey down her ass and onto her bedroom floor. “Fuck, you just started gushing when I talked about getting you pregnant. Didn’t you? Oh, you want it bad, baby, don’t you? I should probably pull out, though.” I grit out, gauging her reaction.</p><p>She moves her legs, locking them around my waist, and pulls me deeper inside her. I look down and she pushes her fat tits together, offering me her nipples, begging me to suck her pussy cream off them. “I’ve heard if I cum while you’re in me, it will open up my cervix and I can take more of your cum.”</p><p>“Fuck.” Her words are my undoing, and I lean down, sucking one of her nipples into my mouth, tasting her pussy on it as I thrust hard one final time. It’s enough to throw her over the edge, and I feel her pussy pulsing, milking my cock and sucking my seed into her. I grab her by the waist, scooting us further onto the bed, but not breaking our connection. We don’t have much time, and I want to be inside her for as long as possible.</p><p>She holds me to her chest and strokes my hair. I could sleep like this, but I try not to. I want to enjoy the few quiet moments we have together, just being us. No one else to disturb us, and no one else to worry about. I kiss her body and pet her gently. I’m still hard inside her, and I move slowly, lacking the urgency I had before.</p><p>Propping up on my elbows, I look down into her clear blue eyes and brush a few blonde strands away.</p><p>“Whose are you?”</p><p>“Yours, Chris. Always.”</p><p>“And who do I belong to?”</p><p>She smiles so big both dimples show on her cheeks. “Me.”</p><p>“That’s right, baby. It’s just you and me. The rest of this bullshit we can figure out. I know I’ve been distant, but it’s not because I didn't care. I just needed to have a plan for what we need to do. I still don’t know, but staying away from you isn’t the answer. We just need to be careful a little longer. I’ll have my own place and it will make things easier.”</p><p>“I’ll be graduating early, so that will help too.”</p><p>I nod my head, already knowing that is coming up in December. “We just need to be careful and watch our steps until then.”</p><p>She nods her head in agreement, leaning up to take my lips. I kiss her back, deepening it, and thrust inside her. I want her at least once more before her parents get home.</p><p>Megan breaks the kiss and looks into my eyes, a blush creeping across her cheeks.</p><p>“What’s that look for?”</p><p>“Can we do it doggy-style? I hear that’s an easy way to get pregnant too.”</p><p>Her words have my already-hard cock getting even harder. He’s twitching inside her, ready to breed my baby into her womb. I hate to leave her warmth, but I pull out and quickly turn her over, pulling her ass up in the air and pushing her head down on the pillow. “Hold it up like this after I cum so it slides down your cervix.”</p><p>She nods into the pillow, and I push in, her pussy already coated with my seed. I fuck her hard like this, riding her cunt like a prized mare being bred. I crouch over her, getting on my feet like an animal, and rut into her hard. She moans into the pillow, loving the rough treatment, and I bite her back, leaving my mark on her. I feel her pussy start to squeeze me, and I know she’s cumming. She’s opening up her pussy for me, and I thrust in and hold it, filling her up.</p><p>Once we both catch our breath and come down from our peaks, I pull out and lie down beside her. I kiss her face gently and pet her body, showing her how much I care for her. She keeps her ass in the air just how I told her to, letting my cum stay and take root.</p><p>If she’s not already bred, she will be soon. I’ll make damn sure she’s bound to me in every way possible.</p> <p>4</p><p>Chris</p><p>Sitting across the table from Megan is wonderful. Her parents being at the table with us isn’t so wonderful. I reach for the bowl of salad at the same time as Megan, and our hands touch. We lock eyes and I run my fingers over hers, feeling her softness with my fingertips.</p><p>“So, Chris, your place will be ready tomorrow?”</p><p>Hearing my name makes Megan jump, and she pulls her hand away from mine. I look up to see Phil and Janet bringing the last of the food to the table as we all sit down for dinner. I clear my throat, trying not to think about how I was just upstairs fucking Megan’s little cunt four times before they got home. It would have been five, but they came home as she was sucking my cock and getting it ready to fill her up again. I got her sweet pussy so full of cum there was hardly room to stuff my cock inside her. She kept her hips tilted up to keep as much as possible inside her, both of us hoping it would result in breeding her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes, I can go pick up my keys in the morning, and everything is all set to move in on Saturday.”</p><p>“You must be so excited to finally have your own space,” Janet says, smiling at me.</p><p>“It will be a relief not to have to be quiet anymore.” I look over and smile at Megan, letting her know full well what I mean by that.</p><p>Phil laughs and cuts up his chicken. “Oh, you haven’t been so bad. We are all going to miss you, I know that. Aren’t we, girls?”</p><p>Both Megan and Janet agree, and I just smile as I eat my dinner. I know one pussy in this house is going to miss my bedtime stories, but I’m thinking we’ll find a way to still make that happen.</p><p>“So, honey, have you decided about college yet? I know we keep bringing it up, but you’ve gotten all these acceptance letters and you’re graduating in four months. You really need to decide what you want to do.”</p><p>I pause, my fork halfway to my mouth, as I look at Megan for her response. I can’t imagine her wanting to leave for college after what we’ve shared, but if she decides to go, I guess I’ll just have to follow her. It’s crazy how fast your priorities can change.</p><p>She tucks her hair behind her ear and looks away from her mom and dad. “I’m not sure yet. I don’t think I’m ready to go. I’m graduating early, but I want to leave my options open for now until I decide what I want to do.”</p><p>Phil reaches over, patting her hand until she looks up at him. “I completely understand, honey. I didn’t know what I wanted to do until I was already halfway through college and had to change majors. I wasted two years of time and money on something because my parents pushed me into it. You mom and I want you to be happy, so think about it, and when you’re ready, we can decide. You’re a smart girl, and we trust you’ll figure it out.”</p><p>“When I was your age, I just wanted to have babies and be a stay-at-home mom,” Janet sighs wistfully, looking over at Phil, and I nearly choke on my beer.</p><p>“I wish we could have had a dozen babies, my love,” Phil says, and they smile at one another. “Luckily we were able to have one, and she turned out to be enough of a pain in the ass for a dozen.” We all laugh, and Megan’s cheeks burn with embarrassment.</p><p>Phil mentioned that Janet had to have a hysterectomy after giving birth to Megan. Something about complications with bleeding. Phil had almost lost both of them. I look at Megan and feel my heart ache. I can’t imagine losing her. I know that when she gets pregnant, I’ll make every doctor monitor her in case that problem should arise with her too.</p><p>Megan gives me a look, and I see it there in her eyes. Need. She wants that too. She wants to be bred. She wants to give me babies. I feel my cock swell under the table as I think about sinking inside of her again. It’s been less than an hour, but I don’t know how much longer I can wait.</p><p>“Maybe after dinner I can show Megan where my new place is. You guys have already seen it. It’s only fair she gets to see it too.”</p><p>Janet beams. “That’s a great idea, Chris. You being here has been so great for Megan. She’s normally in her room all the time with her nose stuck in a book. You’ve really opened her up.”</p><p>If she only knew.</p><p>“Oh fuck, I’m so close but we’re almost there.”</p><p>Megan pulls back from my cock and smiles at me from the passenger seat. “You can’t come in my mouth. That would be wasteful.”</p><p>She said she wanted to tease me, and did that and more. As soon as we were out of the driveway, she leaned over the gear stick and undid my pants. Thankfully, the route to my house included some back roads, so we were safe. As she sucks my cock, I reach back and put a finger in her ass. I just need to get inside every part of her. I want all her young holes stretched only for me.</p><p>I pull into my driveway and park in the garage. I look over at Megan, and put my finger in my mouth to suck it clean. Her eyes get big and her face goes bright red. “There’s not a part of you that isn’t sweet, baby girl.” I lean in and kiss her softly on the cheek. “Get out, baby.”</p><p>It’s dark out, but we’re in the garage, and I don’t have any close neighbors. I get out and shut my door, going around to meet her. I grab her up and pin her to the side of the SUV. I can’t wait any longer. I don’t get the keys to the place until tomorrow, but I don’t need to take her inside. This is going to be hard and fast, and I can do that right here.</p><p>Megan is wearing loose cut-off jean shorts and a baggy tank top that has a Stormtrooper on it and it reads, ‘I love a man in uniform’. She’s so fucking cute I can’t stand it. I love that she embraces what she loves, no matter what people might think. Some would see her as a nerd, but I see her as someone who loves what she loves, not caring what people think.</p><p>I have her pinned to the side of my car, my face in her neck as I bite and suck, leaving another mark for that Croy motherfucker to see. He can tell anybody he wants he did it, but that little shit knows good and well she’s claimed. Someone else is getting her sweet cunt, not him. Not ever.</p> <p>I pull back and spin her around. “Put your hands on the hood, baby. I need to get off. You got me so worked up with that sweet mouth of yours, it’s gonna take me two seconds to nut.”</p><p>“Just cum inside me, Chris. I don’t need to get off, but just make sure you get it all in there.”</p><p>“Oh, you’ll get off.”</p><p>I push her shorts down to her knees, and lift the back of her tank so I can see all of her ass. I unbutton my jeans and pull out my cock, already leaking and ready. She leans forward over the hood and sticks her ass out for me. I lube my cock at her opening, seeing that she’s soaked and ready too. Her horny cunt sucks me in slick and easy, without any resistance. I grab her hips with both hands and start to fuck her hard. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I won’t last long like this, but I don’t care. I’ll make sure she gets off after, but right now I’ve got to fill her little pussy up. My balls are tight and achy. It’s like I haven’t gotten off inside her four times already today. The animal inside me needs her. I look down at where we are connected, seeing my dick pull out of her tight cunt covered in her cream. She’s so wet for it, I’ve got a ring around the base of my cock from her juices, and it drips down my nuts. Sticky syrupy sounds echo in the empty garage as my wet balls smack against her pussy.</p><p>Once again she’s my prime breeding machine, taking my big cock all the way inside and begging for more. Her fertile cunt opens for seed, my seed. Seeing my cock disappear inside of her and feeling her tight pussy squeezing it to the point of pain are enough. I thrust hard one last time, pumping all of my cum into her. She squeezes me and sucks me dry. When my last drop escapes, I pull out and spin her around as I go down on my knees in front of her.</p><p>Megan’s shorts and panties are still around her knees, but I don’t need much room. I’m at eye level with her pussy, and I bury my face in the softness there. She can’t spread her legs because her clothes restrict her movement, but I grab her hips, pulling her to me to get my tongue on her clit. I lick her all over as her hands go to my hair and her moans fill the garage. I suck her clit into my mouth, biting on it slightly and making her shout. She tastes like the two of us mixed together, and I fucking love it. Sucking her cream-covered clit and hearing her sounds have my cock leaking all over again—a fresh batch of cum ready for her.</p><p>It doesn’t take long before she’s tensing up and throwing her head back, lost in pleasure. Her orgasm causes a flood of juice to flow between her thighs, and I feel it dripping down my chin. I pull back and see a big smile on her face as she catches her breath. I smile back at her, but flip her around again, pulling her ass towards me as her hands grab the hood.</p><p>“Jesus, Chris. Again?”</p><p>“Just one more, baby, and I swear I’ll be done.” We both know that’s a lie, because she can’t go to sleep without my cock inside her.</p><p>I fuck her on the hood of the SUV, fighting between my instinct to be gentle and the urge to wear her pussy out so much that she won’t be able to walk tomorrow. She’ll be sore sitting down as it is, so I’m trying not to break her cunt. I grab her ass with both hands, pulling it to me as I fuck into her tightness. She bounces against my cock, and the feeling of her welcoming softness against my hardness is so fucking perfect.</p><p>The need to cum is so strong I feel like a goddamn teenager with his first dirty magazine. But it only takes me a few minutes until I’m pouring into her cunt again.</p><p>When I pull out, my cock is a sticky mess. Between her cum and mine, I’m covered, but I don’t give a fuck, and I tuck it back into my jeans, smearing our juices all over my underwear.</p><p>I help Megan pull her panties and shorts back up, since her legs are so shaky. Once I straighten her out, I kiss her on the nose and then on the lips.</p><p>“What do you think about the new place?”</p><p>She lets out the cutest snort and then makes an exaggerated motion of looking around the garage. “I love it.”</p><p>I don’t take my eyes off her when I whisper, “Me too.”</p><p>5</p><p>Megan</p><p>Pulling on the door, I come up short when I see the sign: ‘Library closed for Homecoming dance committee meeting until end of the school day. Study hall open in room 213’. Crap. I don’t know why I elected to come my senior year. I could’ve graduated at the end of my junior year, but my mom reminded me of all the things I would miss: school dances, graduation, and all the great things normal teenagers apparently do their senior year.</p><p>I’m not normal, but I know part of my mom isn’t ready for me to leave home yet. I am still her baby on some level. She always wanted a big family, and with the way things are going, that might be happening rather soon. Making my way back down the hall, I head to room 213. I’m only enrolled in two classes this semester, and neither of them are credits I need or care about. Opening the door to study hall, I stop when I see six sets of eyes turn and look at me.</p><p>A blush hits my cheeks when their gazes linger over me, and I see Croy among the students. He gives me a cocky chin lift. It takes everything in me not to roll my eyes. I can’t believe he was telling people he gave me that hickey. I’ve only been back at school a week, and it seems things have changed. If I walked into this room last year, none of them would’ve turned to look my way. Now six of the school’s football players are staring at me like I’m the ‘precious’ from The Lord of The Rings.</p><p>“Megan?”</p><p>My heartbeat accelerates when I hear my name. I know that voice all too well. I look over to see Chris sitting at the front of the classroom, but my eyes shoot over to Miss Heart, who’s sitting on the corner of his desk. She’s smiling at my Chris, being extra flirty, and it makes me clench my teeth.</p><p>“Sorry, Coach Burns, the library...” My words trail off when I realize everyone is still staring at me. It’s not something I’m used to or really care for. I prefer to blend in with the crowd and keep to myself. Even more so in high school.</p><p>“Why don’t you come to the front of the room and have a seat?” He says it without having to hear the end of my sentence. He glances over to the back of the room where Croy and some of his teammates are sitting, and then back to me. His eyes are hard, and it doesn’t take a rocket scientist to get his silent message: Don’t fucking sit by them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I debate it for half a second before I change my mind. Though I love when I get Chris worked up and crazy, and Croy seems to be his hot button, I opt not to. Tonight’s the first game of the season, and he doesn’t need me adding to his stress. No matter how much I want to go over there in protest of Miss Heart sitting on his desk, I refrain. Isn’t there a freaking thirty-year-old history book she should be updating or something?</p><p>Making my way to the front of the classroom, I sit in the chair directly in front of them, dropping my bag on the floor next to me. Now I’ll be able to hear everything they say. Miss Heart shoots me an annoyed look, like she notices this as well, but she quickly covers it up. She leans down close to Chris, and it’s then I realize my mistake. Now she’ll just have to lean in close to him to whisper.</p><p>I can’t do anything but stare at her. The famous Miss Heart. And by ‘famous’, I mean all the boys have talked about her since I can remember. She teaches ninth grade history and runs the cheerleading squad for the varsity football team. Today is game day, so the cheerleaders wear their uniforms, the players all sport their jerseys, and all the teachers and students dress in ‘spirit’ gear, something I’ve never participated in. I’ve never even gone to one of the games. Living in Texas, people worship high school football; something I still don’t understand.</p><p>Like everyone else Miss Heart is all dressed up for game day. She has her dark hair in a high ponytail with blue and white ribbons. Her jeans fit her almost like a second skin, and I wonder how she breathes in them. Her school shirt has a deep V down in the front, and the further she leans down towards Chris, the more her boobs show.</p> <p>I look over at him and see his eyes are locked on me, not paying any attention to Miss Heart.</p><p>“Chris,” she says louder, making him look back at her. I bite the inside of my mouth.</p><p>“We could really use your help on Saturday. Afterwards everyone is going out, and you’re more than welcome to join us. You can meet the rest of the staff. I’m sure we’ll be celebrating your win.”</p><p>“I don’t think I can, Kim. I’m moving this weekend.” His voice is dismissive, and it warms my belly. Normally, girls like her get all the guys, but for some reason Chris wants me. It’s attention I’ve never gotten from the opposite sex before. Well, not until recently. But to be honest, I hadn't wanted it until him. Chris is different. I knew it from the moment I ran right into him. My mom always told me when I found the one, I’d know it, and she was right. Seeing him and feeling him for the first time, it was like my body came alive. And like most things I’ve wanted in life, I just went for it. When I decide on something, it’s final and there’s no holding me back. That’s what I’ve been doing with Chris, but sometimes I think I bit off more than I can chew. I know this could end badly, and that maybe our timing is wrong, but I also know that it would take something like this, something hard and fast and consuming, to change me.</p><p>“How about you come Saturday night, and I’ll come over Sunday and help you.” She leans in closer to Chris, and I hear her say in a hushed tone, “Or I could just stay over Saturday night, and I’ll be there in the morning to help you.”</p> <p>“Megan.” I jump when Croy says my name and it pulls me away from hearing Chris’ answer to Miss Heart’s innuendo. I don’t turn around to look at Croy, because I know he’s taken the seat behind me. I can feel him leaning up closer to me, and I want to cringe.</p><p>“Yes, Croy,” I say, pulling out my notebook from my bag, trying not to stare at Miss Heart and Chris. I don’t want to watch her flirt with him, and I know there’s nothing I can do about it.</p><p>“You change your mind and decide you want to come to the dance with me? Broke my heart when you cancelled.”</p><p>It’s hard to contain the snort I want to release. First off, it wasn't me who cancelled the date, it was Chris. He took my phone and texted Croy. I’m not even sure what he said because he deleted the text and blocked his number. I don’t know what Croy’s deal is. We’ve gone to school together since middle school, and I don’t think he’s ever talked to me in my life until this year. It’s got to be these boobs. I glance down at my shirt and see my boobs straining against it. I really need to get some bigger sizes. I had no idea this was going to happen over the summer. This has to be more then late blossoming.</p><p>“Hmm...” I struggle to find the words. I’ve not been big on talking to boys. Chris is the exception, but he’s definitely no boy.</p><p>I feel Croy pull one of the pencils out of my hair, making my locks fall, hitting my shoulders. I’m annoyed, and I start to say something, but luckily I’m saved from having to answer him.</p> <p>“Anderson, why don’t you go to my office and watch those game tapes? I’ve got them sitting on my desk.”</p><p>I look up to see Chris glaring over at us. Why is he angry? It’s not like I can control where Croy chooses to sit. It’s freaking study hall. Seniors come and go as they please. But I love that he’s feeling a spark of the jealousy that I’m feeling right now.</p><p>Getting up from his seat, Croy tugs on a piece of my hair, making me look up at him. “You coming tonight?” he asks, and I know he’s talking about the game.</p><p>I just nod my head.</p><p>“Wait for me after and we’ll talk.” He pauses for a second, and then leans down so he can look me in my eyes. “Since you won’t respond to my texts.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Sorry, I’m terrible about charging my phone.” It’s not a total lie. I’m the worst with that thing.</p><p>“Croy!” Chris snaps again, making both of us jump. Even Miss Heart backs off his desk.</p><p>Croy throws his hands up in an apologetic gesture, but he looks back at me, and then at Chris, before he shakes his head and leaves.</p><p>“All right. Why doesn't everyone head out.” I glance up at the clock on the wall and see school isn't out for another fifteen minutes, but everyone hops to, excited about the early dismissal. Miss Heart continues to stand there, so I grab my bag, hating that I’m going to have to leave them both in here alone.</p><p>“Megan, I need to speak with you. Your father asked me to give you a message.” I can tell from his tone that he’s pissed, and for some reason it makes my nipples hard. Hearing the authority in his voice does something to my body I didn’t expect. After the Croy incident yesterday, he fucked me until I could barely move. Everything between my legs has been so sore today, but just his tone makes me wet with need.</p><p>Miss Heart stands there like she’s waiting to hear the message herself. I bet she’s hoping he gives me the message and then I’ll leave, giving her the alone time I can see she’s chomping at the bit to get. But I have a feeling Chris is going to give me more than a message.</p><p>“We’re done here, Kim.” His words are final and dismissive, and I almost feel bad for her. Almost.</p><p>She lets out an irritated breath, and I can tell she wants to say something, but she won’t because I’m standing there. “Guess I’ll see you on the sidelines tonight.”</p><p>“Keep your cheerleaders away from my players, or they’ll be cheering from the stands.”</p><p>My eyes bulge at his words, and I wonder what she’ll say, but she just clenches her jaw and slams the door behind her. Chris follows after her, and I wonder what he’s going to do, but when he reaches the door he locks it. He pulls down the window shade, and then turns to look at me.</p><p>My whole body starts to buzz as I feel his eyes on me. If I didn't know him I’d probably be scared. Chris isn’t a small man by any means. He’s well over a foot taller than me, my head just coming up to his chest. It’s clear he still maintains the build he had when he played in the NFL, because there isn't a soft spot on him. He’s muscled everywhere, and sometimes when he takes me, I feel completely caged under him. Right now, his dark brown eyes seem black, and I see him take a slow deep breath, release it, and squeeze his fists at his side.</p><p>“Bend over the desk.” His words come out as a growl, and I hardly recognize it. Nodding, I head towards the desk he was just sitting at, and do what he says.</p><p>Dropping my bag back on the floor, I get to his desk and bend over. Once I’m in position I wait. I stay there for a few minutes and nothing happens, but I know not to move.</p><p>“Chris?” I ask, the silence killing me.</p><p>“Again.”</p><p>I don’t understand what he means, but now I can feel him behind me. I can feel the soft touch of his pants against my legs.</p><p>“Say my name again.”</p><p>“Chris.”</p><p>As soon as his name passes my lips, he flips up my skirt. He told me to wear one this morning after he fucked me against my bathroom door. He had to rip my pants down my legs, and afterwards he told me, “Enough with the pants shit.” He said he needed easy access to me, so I dug through my drawers to find this skirt.</p><p>In a flash, my panties are down my thighs, but he doesn't pull them off. He uses his feet to kick mine further apart, stretching the white material of my panties. It makes the cotton bite into my thighs, and the feeling puts me on edge. I hear the sounds of his belt buckle coming undone, and then his zipper going down. My pussy knows what’s coming, and my clit starts to pulse.</p><p>“This is going to be quick. I need this to calm me down before I can let you leave this room. I know I won’t get to see you until tonight.” I can hear the pleading tone in his voice, so I push my ass back further, letting him know I want this.</p><p>“I’m yours. Do whatever you like with me.”</p><p>“Fuck!” He thrusts all the way in, and his long thick cock fills me so I’m just at the threshold of pain. I’m so much smaller than him, and his cock is so big, but I’m starting to stretch for him. I want to take everything he gives me, and feeling him inside me is beyond heaven. My pussy clenches all around him, loving the feel of him inside me. I wish we could stay joined like this all the time.</p> <p>Gripping the desk on either side of me, he starts to pump in and out. His hands land next to mine, gripping the desk with me, his knuckles turning white. We both hold on as he fucks me hard, filling every inch of me with his enormous dick. There’s not a centimeter left inside of me that he hasn’t filled, and being stretched and pounded like this turns me on even more.</p><p>“I can’t stand it when any of them talk to you. It’s fucking ridiculous, but I don’t care.” He starts pumping fast, his words pushing me to my own orgasm. I have no idea why his jealousy turns me on, but it does. To think this man is so crazy for me, that I drive him to the brink and make him lose control, gives me so much power. I love that he’s so far gone with me that he’s beyond reason.</p><p>“Beg me.” He’s grunting against me as he starts to fuck me faster. I can tell by the grit of his teeth he’s doing everything he can to be quiet.</p><p>“Please, Chris, fill me with your cum. I want it so bad.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Show me, Megan. Milk it out of me.”</p><p>He releases his grip on the desk and reaches down to my clit. That’s all it takes, just the slightest touch, and I start to cum. I feel my pussy gripping him as he pounds into me from behind. The desk scoots across the floor from the force of his thrusts, and I’m cumming hard. I’m doing just as he asked and milking his cock. I feel his warm release splash into my body as he drops down onto my back, kissing my neck. His final twitches inside me are a sweet feeling as he whispers against my skin.</p><p>“Thank you, baby.”</p><p>“I think I should be thanking you.”</p><p>I let out a giggle, and he leans back, pulling out of me. I feel him drop down, and he’s between my legs, pulling my panties the rest of the way down.</p><p>“Love the skirt. Step out.” He indicates for me to lift my foot so he can pull them all the way off. “Don’t move, let me clean you.”</p><p>Using my panties, he wipes between my legs while I watch him over my shoulder. I wait for him to tell me to step back into them, but when he doesn’t, I turn around and watch him put them in his pocket</p><p>“For luck tonight.”</p><p>He smiles, and I feel myself blush. How I could possibly still have anything left to blush about, I don’t know. Chris stands up, fixes his pants, and then he straightens my skirt.</p><p>“Stay away from him, Megan.” I don’t have to ask who he’s talking about.</p><p>“Stay away from her!” It’s a bratty comeback but I don’t care.</p><p>“Who?”</p><p>He legitimately looks confused, and it just adds to my irritation.</p><p>“Miss Big Boobs, Kim Heart.”</p><p>“She has tits?”</p><p>I hate it, but his comment makes me smile, and then it turns into a laugh. He comes over to me, wrapping me up in a hug, and I nuzzle into him, wishing we could get out of here.</p><p>“I won’t let you pretend to be with someone else just because we can’t be together yet.”</p><p>“I know.”</p><p>“Now go home and get ready for the game tonight. I need to see you in the stands, cheering me on.”</p><p>I nod my head, and he leans down to kiss me. Feeling his warm lips against mine has me ready for more, but we don’t have time, and this isn’t exactly the best location. I’ll just have to do what we’ve been doing. Wait.</p><p>6</p><p>Chris</p><p>We took down the Badgers in a blowout. I was nervous about it all coming together, but thankfully it turned out all right. The boys performed better than I expected, and I was right to push them so hard. There were scouts in the stands after the media came to film my first game. I even saw a few of my old coaches walking around and taking notes.</p> <p>It takes a couple of hours after the game to talk to everyone and have the locker room speech with the players. Afterwards I have to do some handshakes with the news and a few boosters to talk about the upcoming season. Overall, it’s a lot more politics than I bargained for, but it is what it is. I guess if I want to continue to coach, this side is the bullshit I have to deal with.</p><p>The worst part about tonight was having to do an interview and having to watch helplessly as Croy went up to Megan after the game and put his hands on her. I had a news camera and a microphone in my face, so I kept it together. He reached out to touch her, but she just stood there with her arms crossed. Her big tits were perched on top of her folded arms, making them look obscene, and I’m sure that’s why Croy was hanging around.</p><p>Phil and Janet were close by, and they looked like they were having a chummy conversation with him too. That fucking kid makes my blood boil, and I’m pissed off that there isn’t shit I can do about it while I’m his coach.</p><p>I made it through the interview without incident, and as I walked past them to the locker room, Megan and I locked eyes. Her parents were so wrapped up in their conversation with Croy they didn’t see me signal to Megan to check her phone.</p><p>When I get to my office, I grab my phone and text her.</p><p>ME: TELL YOUR PARENTS YOU’RE STAYING WITH A FRIEND TONIGHT.</p><p>MEGAN: WHAT FRIEND?</p><p>ME: DOESN’T MATTER. TELL THEM I’LL GIVE YOU A RIDE SINCE IT’S NEAR MY HOUSE. I’LL DROP YOU OFF TOMORROW TOO BECAUSE I HAVE TO GO BACK AND GET MY STUFF.</p><p>MEGAN: SO YOU AND ME ALL ALONE TONIGHT?</p><p>ME: IF YOU TELL THAT FUCKER TO KEEP HIS HANDS OFF YOU.</p><p>MEGAN: MEET YOU AT YOUR CAR XOXO &lt;3</p><p>I toss my phone in my bag and head out. I’m irritated, even though this should be a great night. Maybe it’s just different being on this side of things. When I was a player, the celebration started after the game, but it seems like I can’t get away from people wanting to do interviews and parents wanting to ask about playing time. All I want to do is get Megan and go home so I can sink inside her in peace.</p><p>I got the keys for my new place from the builder this morning, but Megan still hasn’t seen the inside. I plan on showing her every square foot after I get her out of here. The thought causes me to smile, and as I’m not paying attention, I almost run right into Kim.</p><p>“Hey, Coach Burns. Great win out there tonight.”</p><p>“Thanks.” I start to sidestep her, but she follows me.</p><p>“Listen, I know you said you’ve got to move tomorrow, but what about a celebratory drink tonight? I promise I know how to show you a good time, you know, you being new in town and all.”</p><p>I look over her shoulder and see Megan standing there with her family and Croy. She’s pissed, and I am too. We’ve got to get away from all this shit. “Kim, I appreciate the offer, but I’m not interested. I have a standing policy to never date coworkers, and I’m sorry if I gave you any impression otherwise.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her cheeks flush and she looks away. “I...I just meant as friends.” She’s backpedaling and we both know it. “You may be some big shot NFL player, but that doesn’t give you the right to be an asshole.” She spins around and stomps away like I was somehow rude to her.</p><p>I just shake my head and try to pretend that didn’t just happen. I go over to everyone waiting for me. I speak to Croy first. He’s my biggest problem, and I need to get rid of him.</p><p>“Hey, Chris, congratulations on the win!” Janet beats me to the punch and gives me a hug. I can’t help but smile. She would have made a great cheerleader. She’s beaming with pride.</p><p>“Looks like you did an outstanding job of coaching our star quarterback as well.” Phil pats Croy on the back, and I try not to roll my eyes. He fucked up no less than a dozen plays tonight, but luckily my o-line is strong and saved the day.</p><p>“Yeah,” is all I can manage to say as Croy beams, clearly taking the credit. It’s a big win for him, and I don’t want to cheat him out of it. But that kid needs some work if he wants to play college ball.</p><p>“So, Megan said you’re going to be able to give her a ride tonight.”</p><p>I nearly choke on my own spit at Janet’s question, but I just nod and smile.</p><p>“Yeah, Mom. Coach said it was on the way to his new place, and then he could just bring me back in the morning when he comes to get the last of his stuff.”</p><p>“Okay, sounds perfect, as long as he doesn’t mind. Your car is still in the shop getting new tires.” Janet looks at her phone distractedly. “You’ll just need to be back before noon so you can get your hair done for the dance.”</p><p>“You’re going?” The words come out as an accusation. Croy answers, which just pisses me off further.</p><p>“Yes, we finally worked out the details. I’m going to meet up with some of the guys tonight.” He turns, looking at Megan expectantly, and she just nods her head at him. “Okay, I’ll pick you up at five tomorrow. We can do dinner before.”</p><p>Megan’s eyes go wide, but she doesn’t respond. Phil turns to Croy and shakes his hand, telling him he did a good job tonight. I give him a chin lift, and he heads out, leaving the four of us.</p><p>“All right, husband, we’re kid-free tonight. Let’s go get wild.”</p><p>“You mean ice cream, don’t you?”</p><p>“You got it.”</p><p>After Phil and Janet leave, I walk to my car, Megan trailing behind me. I hear her quick footsteps trying to keep up, and it’s all I can do not to turn around and throw her over my shoulder. I’m aggravated, pissed off, and horny. Not a good combination.</p><p>I climb in the SUV and wait for Megan to get in and close the door. I crank it up and pull out of the parking lot, waving to people as we leave. Once we are away from school and on the road, I grip the steering wheel with both hands.</p><p>“So you’re going with Croy? After I just said you needed to stay away from him?”</p><p>“He put me on the spot in front of my parents. What was I supposed to say? ‘Sorry I have a boyfriend, and oh look, here he comes now. You guys might recognize him.’ No. My mom jumped at the chance for me to go to a dance. She wanted me to experience the last part of my high school years, and I guess that included Homecoming. You act like I had a choice.”</p><p>I know she’s right, but I can’t think clearly when it comes to her. “Fuck.” It’s the only thing I can say. I feel like an asshole for putting us both in this position, but we’re stuck, and I can’t claim her out in the open. Yet.</p><p>“Show me your pussy.”</p><p>“What?”</p><p>“You heard me, Megan. Pull your skirt up and show me your cunt. Let me see what’s mine.”</p> <p>I see her shaky fingers go her hem as she scoots her ass to the end of the seat. She pulls it up, spreading her legs wide. I can’t help myself. I reach over.</p><p>“Spread your lips for me.”</p><p>When she does, I rub two fingers over her wet clit, and then sink them deep inside her. I finger-fuck her for a few minutes, and then pull them out, licking them clean. Fuck, I love the taste of her teenage cunt.</p><p>“Let me see your tits too.”</p><p>“Chris.” She sounds shy, but I need it.</p><p>“Show me, Megan. Now.”</p><p>She lifts her shirt and pulls down the soft cups of her bra, letting her big tits bounce free. I reach over, pinching one hard nipple, and then the other. I want my mouth on them so bad, but I’ll have to wait a little longer.</p><p>I reach down and undo my khakis, pulling my cock out. “Come suck me off before we get home. I want you too much right now, and I won’t last.”</p><p>She crawls over to me, leaning over the center console, and starts sucking me right away. Feeling her hot little mouth on my dick is heaven. She’d never sucked a dick before mine, and fuck if that doesn’t make me love it more. She said she watched instructional videos on it, wanting to make it good for me. It’s working all right, because she gives the best head I’ve ever had. She reaches down, stroking my shaft down to my balls and teasing back up as she twirls her tongue around the head. Her warm wet mouth sucks and licks, begging for my cum. I pull over on a back road and grab her hair with both hands, pulling it back out of the way for her while she gets me off.</p><p>I cum hard and fast, and goddamn, her sweet little mouth sucks it all down. “Oh God, baby. The best. Best.”</p><p>I breathe heavily as she sits back against the passenger door, spreading her legs wide for me. Seeing her glistening pussy and how she got off on sucking me makes me start leaking cum all over again. I’ll never get enough of her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I want you to rub your pussy until we get there.”</p><p>I put the car in gear and pull back onto the road. I glance over every few seconds, seeing her rub her pussy and hearing her sticky sounds of pleasure. The SUV smells like her cunt, and I wish it smelled like this all the time. I'm tempted to tell her to rub it all over the car, but we’re pulling into the garage and I don’t want to waste any time.</p><p>Once the garage door closes, I get out and Megan follows. Before she can open the door between the garage and the house, I scoop her up and carry her across the threshold.</p><p>“What are you doing?” she laughs, but I don’t answer. I just smile and keep walking.</p><p>I carry her down the long hall and straight to the master suite. I bypass the mattress that’s sitting on the floor, and go to the bathroom.</p><p>“I need a shower after that game, and I want you to help me break it in.”</p><p>I had some furniture delivered this afternoon. Basic essentials I knew I would need for my first night. The bulk of the furniture and all my boxes from storage will come tomorrow.</p><p>Walking over, I set Megan on the bathroom counter between the double sinks. “Yours is on the left,” I say, kissing her nose and moving to turn on the shower.</p><p>“I have a sink?”</p><p>“You have more than that.” I toss over my shoulder, letting her think what she wants to.</p><p>Once the eight shower heads are running hot, I turn and strip, and then do the same for Megan. I pick her up and she wraps her legs around me as I carry us both to the shower. My cock is hard and jutting up between us. I’m leaking cum, and it rubs between us, making me even harder.</p><p>I had the builders put in a high seat in the shower, big enough for me to sit on. As it turns out, it’s also the perfect height for me to sit Megan on while I wash her, and when I fuck her.</p><p>After I set Megan down, I hit the built-in shampoo dispenser the designers put in. I make her lean back as I lather her hair, massaging as I go. She moans with pleasure, and that’s when I move between her legs, pressing my cock to her opening.</p><p>“I’m going to fuck every inch of you. In every inch of this house. Starting right now.”</p><p>She reaches between us and grabs my cock, guiding me in while I continue to shampoo her hair. I fuck her slowly, unhurriedly, because we’ve got all night. I’ve already taken the edge off, but I know she needs to come after our playtime in the car.</p><p>“Reach down and rub your clit, baby. Use my dick to get off.”</p><p>She does as I ask, rubbing her clit while I fuck her. The only point of contact between us is my hands in her hair, and my cock in her pussy. She moans and grinds against me, taking her pleasure.</p><p>“That’s it, baby. Be as loud as you want. This is our home, and you can scream the fucking roof down.”</p><p>Megan moans louder, letting it echo off the shower walls. Fuck if her sounds don’t make me want to cum. I feel her pussy start to squeeze me, and her back arches away from the tile. She rubs hard and fast, and I watch as her orgasm hits her. She’s beautiful when she cums, and being able to just watch is fucking amazing. Seeing her lost in her pleasure triggers my own release, and I thrust against her, holding my cock inside as far as I can go, emptying all of my seed inside her.</p><p>When I catch my breath, I don’t pull out. I just pick her up and tilt her head towards the shower head to rinse her off. Afterwards, I move her back to the seat and soap us both up, still not breaking our connection. I want to be inside her as much as possible tonight. My goal is to not pull out one time. Just one continual fuck fest.</p><p>I kiss her sweet lips and lick water droplets off her nipples as we rinse off. It sparks off our need all over again, so when I step out of the shower, I just take her down to the tile floor. The cool marble chills our hot skin and creates a slick surface for me to fuck her on.</p><p>“You should really get a rug in here.”</p><p>“You pick it out, I’ll buy it,” I say, licking the water drops off her neck.</p> <p>“I think a Star Wars-themed bathroom would be pretty badass.”</p><p>“Whatever you want, love.”</p><p>7</p><p>Megan</p><p>“You're not going,” he whispers in my ear before he nuzzles my neck, the morning light shining through the windows, giving it a little nip.</p><p>“Chris, my mom...” I try to reason with him, but my words cut off as he pulls himself from me. I instantly miss the warmth of his body.</p><p>The bedroom is bare, with only a king-size mattress on the floor. Chris paces the room like a caged lion wanting out. The tense lines of all his muscles show. Okay, maybe not a tiger, more like a bear.</p><p>“Come back to bed.” Sitting up, I let the sheet drop away, hoping it will entice him back into bed. I don't know how much longer I have until the movers show up, and I want to soak up every minute of alone time we can have together. These moments are rare, and I want every second I can get. A moment without having to worry about being caught, or what people will think. It’s just him and me in our safe bubble.</p><p>\"Fuck!\" he bellows, and then turns to look at me. His curse sounds angry, but his face doesn't show any trace of that. “I can't do this.”</p><p>A sudden panic hits me at his words, and I can feel the blood leave my face. Gripping the sheet, I pull it to cover myself.</p><p>“No, no, no, baby.” He's on me instantly, his big hands cupping my face. “I meant this hiding shit. I can't do it, and it’s driving me fucking crazy. I don’t know what’s wrong with me, but the thought of you going anywhere with that kid drives me nuts. I don’t think I’d make it through the night without losing it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Chris, I would never do anything with him.\" I try to reassure him about the dance, running my hand up and down his back and pulling him closer. He just stares down at me. His face looks like he's in agony.</p><p>“No, you wouldn’t because I won’t let you near him.” His mouth takes mine in a punishing kiss. It’s hard, and it demands my surrender—something he already has. I can feel his need to mark me, and I should probably be scared by his intensity, but I’m not. I crave it, want it more than anything else in the whole world.</p><p>No one has ever made me feel the way he does. Like he can’t breathe without me. “I need you.” My legs drop open a little more at his words, giving him what he wants, letting him fully slide between them. His big body cages mine. He feels so good pressed against me. My heart pounds and desire rushes through me.</p><p>He doesn’t wait for permission, no build up or foreplay. He pushes inside my body with all the strength in his powerful thighs. His cock thrusts against the tight muscles of my pussy, and I feel a delicious ache as he bumps against my cervix.</p><p>“You feel that? I’m going to drain every drop of me into you, and your greedy pussy is going to soak it all up. Isn’t it?”</p><p>I moan at his words; it’s all I can get out as my pussy clenches around him, begging him to do it. My body jerks beneath him as he starts to thrust in and out of me. Each thrust is more forceful than the last. Using his hand, he holds me in place, thrusting deeper, like he can’t get far enough inside me.</p><p>Our moans fill the room as he begins to pound into me at a punishing pace. I know I’ll feel the aftermath of this love-making for days to come. Waves of pleasure so intense wash over me, I’m not sure how much I can take. He rides me hard, making me scream out his name. The climax strikes me without warning, ripping through my body like an explosion. My body locks up under his, every muscle tensing as the orgasm courses through me.</p><p>His cum shoots into my body, his warm jets filling me up. My pussy clamps down around him, trying to greedily suck up all of his cum.</p><p>“Who the fuck is she?” The shrill words jolt me from my lust-sodden mind, Chris’s body goes rigid against me.</p><p>“What the fuck are you doing here?” he bellows, getting up.</p><p>The woman standing in the door looks completely unfazed by Chris’s hard words. She’s well put-together, her short red hair falling to her shoulders. It’s completely straight, with not a strand out of place. Her dark lipstick is a dramatic contrast to her pale skin. She looks like she’s at least six feet tall, with killer heels helping her get there.</p><p>She stares at me with her nose scrunched in disgust, like I’m some kind of bug. It’s then I realize I’m completely naked and so is Chris, standing there next to the bed in all his glory.</p><p>“Turn around, don’t look at her naked,” he barks out, but the woman just stands there staring at me. If anyone should get dressed, it’s him.</p><p>“Megan, bathroom. Now,” he says, noticing the woman in the doorway isn’t moving. “Megan!” he snaps again, sending me into motion and scrambling for the bathroom. I see Chris sliding on a pair of boxers as I slam the bathroom door, and I’m somewhat relieved.</p><p>Dressing quickly, I’m thankful that my clothes are in here as I listen to the yelling on the other side of the door.</p><p>“What are you doing here, and how the fuck did you even get in, Delilah?”</p><p>“I’m sorry Chris, I shouldn’t have responded like that, I know we aren’t exclusive.”</p><p>The word ‘exclusive’ makes my stomach clench.</p><p>“You didn’t answer my question.” Chris’s words are sharp and angry. I’ve never heard him talk like this.</p><p>“Well, I just thought, you know, we could never be together before because you traveled so much, and now, well, you’re here, I’m here.”</p><p>“Go down to the kitchen and wait for me,” I hear Chris say, making a lump form in my throat. Why isn’t he kicking her out? Are they still in some kind of relationship?</p><p>It makes me wonder if how he acts with me during sex is how he acts with every woman. I’m new to this. Maybe he’s just always this intense. Maybe he likes talking dirty, and I’m just one in a long line of many.</p><p>I jump when I see the door handle wiggle. “Megan, unlock the door.”</p> <p>I wipe the tears from my eyes, not sure what to say. I don’t want him to know I’m crying.</p><p>“I’ll be out in a minute. I’m just going to jump in the shower...” I pause for a second to steady my voice so it won’t crack. “Why don’t you go take care of your—” I stop because I don’t know what to call her.</p><p>“All right, baby. Don’t leave this room, you hear me?” His voice is stern and not to be questioned.</p><p>“Okay,” is all I can manage, thankful the one word is all I need. A minute later I hear his footsteps leave the room. Releasing a breath I didn’t realize I was holding, I seize the opportunity. Slipping from the bathroom, I peek out the window that overlooks the front yard.</p><p>Shit. We’re in the middle of nowhere. No way could I walk. I see Chris’s pants on the floor so I go over and pull out his keys.</p><p>Now I just have to get out of here without being noticed. As I sneak down the stairs, I pause when I hear the woman say, “We were going to get married. You said you wanted babies, and I’m ready for that.”</p><p>It takes everything in me to hold back the sob that wants to escape. I feel like I’m about to vomit. I can’t listen to any more of this. I sneak around to the garage, and it’s then I see how the woman got inside. Chris had left the garage door open. Sliding into his SUV, I text my mom. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Megan: Pick me up at the school</p><p>Mom: Be there in ten</p><p>I start the car and pull out of the driveway. I have to beat my mom to the school. I don’t want her to see me driving Chris’s car.</p><p>When I get there, I pull the car into the backlot, dropping the keys into the side panel of the door. Pulling my phone from my purse, I see a ton of missed calls and texts from Chris. Without reading them I type out a message as I head to the front of the school to wait for my mom.</p> <p>Megan: Sorry I took your car but I left it at the school in the staff parking lot. Keys are in the side door. I need time to think. Please give it to me.</p><p>When my mom pulls up to the curb, I jump into her car. My distress is clearly showing.</p><p>“Baby?” she whispers, and the floodgates open. Tears stream down my face, and I no longer try to fight what I’m feeling.</p><p>“Home, Mom, please,” I beg, looking out the window. I know if I look at her, I’ll just cry harder.</p><p>“Megan, you have to tell me if someone hurt you. You’re scaring me. I’ve never seen you like this,” she pleads with me.</p> <p>Looking over at her I reassure her. “Just my heart, Mom.”</p><p>Her eyes soften at my words. “Ice cream and shopping it is.”</p><p>We pull away from the school, and a silent breath leaves my lungs, thankful that Chris didn’t make it there before we left.</p><p>“I don’t think I’m up for it.” I stare out the window, wiping tears from my eyes.</p><p>“They opened a new vintage game shop in the shopping center by the lakes.” I look back over at her and see she has a soft smile on her face. “If he made you cry and isn’t chasing you down, he’s not worth it, baby. They should always chase.”</p><p>“I just have no idea what I’m doing, Mom. I’ve never been—”</p> <p>“In love?” she finishes for me, and I just nod my head. I’m totally clueless. Part of me thinks I’m overreacting, that I should sit down with Chris and talk this out, but the other part of me is telling me to run scared. I don’t know if I can’t handle what he might have to say.</p><p>“Then we’ll talk it out,” she says, like it’s that simple.</p><p>“I don’t think I can with you, Mom. It’s, well, awkward.” The idea of talking to my mom about boys seems weird, but maybe because I’ve never done it before. There was never anyone else. Only him.</p><p>“Megan, you’re eighteen years old. I know what your father and I were doing when I was eighteen. You’re a woman, I’m a woman. It’s only awkward if you let it be.”</p><p>“Ice cream it is,” I say.</p><p>She smiles and nods, heading in the direction of the ice cream shop.</p><p>Lying in bed, I stare up at the ceiling. I told my mom as much as I could without giving away who I was crying over. We spent the day shopping and talking, I texted Croy to let him know I wasn’t going to the dance, and I felt a little better about everything.</p><p>My mom was right. If it’s meant to be, it’s meant to be. It just crushes me to think that Chris might have had what we shared with someone else at one time. That he considered having a baby with another woman eats me alive. I felt so special when I thought of this being something we only felt for each other. This need to be together clawing at both of us was special. Uncontrollable and unexplainable, it was just there. How things were supposed to be.</p> <p>Chris came crashing in when I wasn't sure what I wanted from life. Feeling a little lost, like I didn't fit in anywhere. But with him, it felt like I fit perfectly. That I’d just been lost in my head, waiting for him to come find me and pull me out.</p><p>It’s why I can’t talk to him right now. I don’t want to hear what he has to say about everything. About who or what that woman was to him. I already feel like I could shatter into a million pieces.</p><p>Before he came along, I was so scared about the next chapter in my life and of what it was going to bring. College was the obvious next step. I had filled out the forms, made the grades, took the test, and had no problems getting early acceptance letters. Except the thing is, I don't want to go to college. I was driven to get in because I thought it was what I was supposed to do. Pushed from one world I didn’t fit into to another.</p><p>The dream of making a life with Chris and continuing to write was what I wanted. But part of that dream might be slipping through my fingers. When I told my mom today I wasn't sure I wanted to go to college, she told me she stood behind whatever I chose, that I’ve always been a smart girl and I would figure it out. I think she was so happy that I was showing interest in the opposite sex for once in my life. I can see dreams of grandbabies floating around in her head already.</p><p>It’s why I went so hard for Chris and didn't hold anything back. For the first time in my life, things seemed to line up. I pushed my insecurities away and went after him. Maybe this was all my doing. I pushed myself on him during a time he was vulnerable. Maybe he was still torn up about this woman, and I slid nicely into the role for him.</p><p>I’m so confused about where to go from here. I even talked to my mom about withdrawing from school. I have the credits to graduate. I don’t need to be there. I just need to decide what I want to do with my life, and a big portion of that involves Chris.</p><p>My mom was hell-bent on finding out who I was seeing. She tried incessantly to get it out of me. I was sure she would tell me that the feeling would pass and that I was in too deep too fast, she surprised me by telling me that from the first moment she saw my dad, she knew. They were inseparable from day one, so she made me feel better about heartache after such a short time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>In a perfect world I could get Chris. And I’d be okay with the fact that he wanted a family with someone else before me. It shouldn’t bother me, but it does. Maybe he still wants to be with her. She would probably fit him better. No sneaking around or having to deal with someone who has no idea what she’s doing when it comes to relationships. Someone like me.</p><p>The screech of brakes makes me sit up in bed. It’s followed closely by the sound of the front door slamming open.</p><p>“Megan!”</p><p>8</p> <p>Chris</p><p>I drove by her house a dozen times, and I couldn’t see a car in the driveway. I went everywhere I could think of. I decide to drive by her house again. I won't stop searching until I find her, even if it means I do it forever. When I see Janet’s and Phil’s cars out front, I tear into the driveway. I jump out and bust through the front door, shouting her name. I just have to see her. I don’t think I’ve gone this long without her since this all began.</p><p>I rush through the kitchen and see Janet standing there, her eyes wide with shock and worry. I must look like a mess, but I feel like I’ve gone crazy. I round the corner, and see Phil leaning against the door frame.</p><p>“She’s upstairs.”</p><p>His tone of voice is calm and knowing. I need to tell him. “Phil—”</p> <p>“I know. I’ve known for some time, but I wanted you to man up and tell me.”</p><p>“I’m sorry about the way this happened, but I’m not sorry I love her. I don’t know why or how, but she’s the one. She’s it for me.”</p><p>He looks at me and searches my eyes, for what, I don’t know. But he must see what he needs, because he nods his head. “I won’t lie and tell you this is easy for me. She’s my baby girl, she’ll always be my baby girl, but I know she won’t find better.” He reaches his hand out to mine and I take his, thankful for his approval.</p><p>“What just happened?” Janet says behind me, and I see Phil smile sweetly.</p><p>“I’ll explain later, honey.”</p><p>“Get out.” Megan’s voice from behind Phil makes me snap to attention.</p> <p>“Baby, listen. You’ve got to let me explain.”</p><p>“I heard everything. I thought I was special. I thought I was different. But you and that woman, you...you were going to marry her.”</p><p>A frustrating rage fills my veins and I want to scream. I take a deep breath and try to explain this as swiftly as possible. I need to take her hurt away. I can see she’s torn up about this, and I never intended for this to happen.</p><p>“That woman, Delilah, she and I went on one date together five years ago. Five years ago. I was traveling a lot with the team then, but even still I knew she was trouble and ended it after that one dinner. She went crazy, Megan. She went to the press, said we were engaged, said she was pregnant with my baby...I never even touched her.”</p><p>Megan crosses her arms defensively, still looking at me in disbelief.</p><p>“I swear to God, Megan. It’s the truth. It’s probably still online somewhere. I had to get a restraining order, and I sued her. We settled out of court and she swore never to bother me again.”</p><p>“Oh God, Delilah is back?” I hear Janet say behind me. Janet and Phil were my rocks back then, helping get me through that mess. I felt like such a dick taking her to court, but they both kept reminding me that she needed serious help.</p><p>“I called the cops and they took her to the hospital. From what they said, she’d been under her sister's care, but had a recent relapse when her boyfriend broke up with her. Guess she was just making the rounds.”</p> <p>Megan looks back and forth between her parents, and I can see hope in her eyes. “Dad, is this true?”</p><p>“Yes. She was really unstable, and I was able to get a psychologist friend of mine to look over the case,” he says, confirming everything I said.</p><p>“Honey, if I had known that was the problem, I could have told you the whole story. My God, you and Chris? When did this happen?” Janet sounds utterly shocked.</p><p>Megan blushes profusely, and looks at me through her lashes.</p><p>“Come on, Janet, let’s give them a chance to talk.”</p><p>Phil pulls her from the room as she keeps asking questions. “How did you...” I hear her saying over her shoulder as they walk out.</p><p>“So you didn’t want babies with her?” she asks, looking down at her feet. I hate that she thought I wanted with someone else what I only want with her.</p><p>“No.”</p><p>Megan takes a tentative step towards me, and I stand my ground, not wanting to scare her off. I’m sure I look crazy. I felt crazy when she left me today. The thought of her running from me was like a hot blade to my heart. She’s it for me. If she doesn't want me, I'll live out a miserable existence. Or I'll have to buy a secluded island, kidnap her, and keep her there.</p><p>“And you never wanted to marry her?” she asks, looking up at me through her eyelashes.</p><p>“No,” I fire back instantly.</p><p>“You didn’t love her?”</p><p>She takes another small step forward, and I can feel my heart beating out of my chest.</p><p>“I’ve loved one woman in my life, and that’s you, Megan. I love you.”</p><p>She rushes the rest of the way and I catch her, wrapping my arms around her.</p><p>“I love you too, Chris.”</p><p>“Let’s go home, baby.”</p><p>I feel her nod against my neck, and I close my eyes. Finally my world is whole again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Epilogue</p><p>MEGAN</p><p>Ten years later...</p><p>“Hafy Bifby.”</p><p>“What was that?”</p><p>Chris moves his mouth away from my pussy, licking his lips. “I said ‘happy birthday.’” I giggle as he dives back between my legs, licking and sucking his way to my orgasm.</p><p>I stretch my arms over my head, spreading my legs wider. This isn’t a bad way to start my twenty-eighth year. I grip his hair in my hands, grinding against his face, never getting tired of the way he feels on my body.</p><p>We’ve been through so much, and getting to this moment was hard fought, but goddamn, was it worth it.</p><p>Surprisingly, my parents were thrilled that Chris and I were together, and we didn’t realize it at the time, but having that support meant all the difference. I opted out of my last year of high school and graduated early. Chris and I didn’t go public until it was official, but the backlash was awful. He coached the high school to a state championship with an undefeated season and still they wanted him out. The school board created a new contract for him to sign that was just bullshit to push him out of the door. He didn’t need the money or the attention, so he just went quietly, not making a scene. My heart broke for him, because all he ever wanted to do was to be involved in football, even if it was coaching.</p><p>After a year of sulking about it, I suggested he get involved in a local ‘big brother’ football camp. Ever since then, he’s found his purpose again. He’s been there eight years, and loves seeing the boys grow and develop.</p><p>I was pretty much treated the same way I was before senior year of high school, like the awkward girl no one knew what to do with. But I was used to it, so it was no skin off my nose. I got pregnant the minute Chris got inside me, giving birth to our son, Chris Junior, nine months later. After that, we had our daughter Fae, and then our other daughter Mara. My pregnancy with Mara was difficult, so after that, we decided it was time to close the baby chapter. Our family is happy and healthy, and that’s all I ever wanted.</p><p>“Fuck, baby, I can’t wait. I need to get inside you.”</p><p>“It’s my birthday! Don’t I get a say?”</p><p>“After this, I need to take the edge off.” Chris scoots up the bed, thrusting inside me, hard and fast. “Goddamn, eating that pussy gets me so fucking hard.”</p><p>He reaches between us, rubbing my clit, and then leans down to kiss me, letting me taste myself. The flavor of my need combined with his hard cock fucking me tests my limits. Chris pulls back, putting a hand over my mouth as I shout my release. I feel myself squirt on his cock, drenching him in my cum.</p><p>“Fuck.” He buries his face in my neck, biting me there while he empties inside me. The feeling of his warm cum flooding me makes me twitch and sparks off another, smaller orgasm.</p><p>“Mom! Grandma is here to take me to soccer practice!” I hear Fae yell from the bottom of the stairs.</p><p>“Tonight the kids are going to your parents’,” Chris says as he licks my nipple, sucking it into his mouth.</p><p>“What are we going to do with an empty house and all this time on our hands?” I giggle as I rub his hairy chest. God, he’s forty and just getting sexier with every year that passes.</p><p>“I’m sure we can think of something.”</p><p>“How about you put on that Darth Vader mask I got you and you punish me for being a rebel?”</p><p>He gets a wicked look in his eye and nods his head. “I think I’d enjoy showing you my Lightsaber.”</p><p>We fall into giggling pile as we roll around in our happily ever after.</p> <p>THE END </p> </body></html>"]