["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Flipping through channels on the flat screen television, Detective Sergeant Kevin Bryson stretched out on his back on the motel bed and tried to get comfortable. James Tucker, his best friend, former partner and probably the love of his life had stopped answering his cell phone, and no one had heard from him in over three weeks.</p><p>It had been a long drive the day before from the Gulf coast of Florida to North Carolina, and once he arrived, he’d spent some time going from place to place in the small town of Sylva, even though it was early evening, asking questions in a few of the shops still open and in the small cafés, just like he’d done all day today. He went anywhere he could think of, really, that might get him results. The local sheriff’s department had been his first stop that morning, of course. They looked at his credentials and were polite enough, but claimed never to have heard of any cult operating in the area. When Kevin admitted Tucker left Florida willingly, they told him there was nothing they could do.</p><p>Everyone in town, as a matter of fact, claimed never to have heard of any kind of cult, religious or otherwise. They also claimed never to have heard of a former detective from Florida named James Tucker or his lover, a man Kevin knew only as Gavin—but then, he hadn’t really expected to get information so quickly. He was really only hoping to stir things up and get a lead.</p> <p>Using cell phone records, he’d tracked Tucker to this general area, but that was as close as he could get. If Tucker had fallen victim to a dangerous cult, like Kevin thought he had, he believed there would be other cult members in the area, whether they were willing to admit it or not. If he asked enough questions, nosed around enough, he might be able to attract the attention of the group. He was hoping the cult members would come looking for him and save him further trouble.</p><p>He sat up on the side of the bed and stretched. He’d spent the morning in town and most of the afternoon searching on the internet for various churches or religious groups in the area. It was late afternoon now, and he needed to figure something out for dinner.</p><p>Levering himself off the bed, he stretched again. Damn, his back was a little stiff from the long drive. At the ripe old age of thirty-four, he shouldn’t have this many aches and pains, should he? Maybe if he actually did more cardio like his trainer told him to when he worked out at his gym, he might be in better shape. Up to this point, he’d been mainly interested in shaping his body and sculpting his muscles so he usually concentrated on the weights. Tucker used to laugh at him and say at least he’d look pretty when he wound up in the hospital with a heart attack someday. Tucker, himself, was a runner.</p><p>Tucker—Kevin felt the familiar twinge in his chest that he always got when he thought of him lately. He’d been in love with Tucker for so long, it seemed like a part of him by now. Tucker had never wanted to be involved romantically, claiming it was because they worked together, and saying it would ruin things if a relationship between them went wrong. So Kevin had reluctantly accepted the status quo and remained Tucker’s partner and eventually became his best friend. Of course, he was still in love with Tucker, and always would be. That went without saying. And he wouldn’t forsake him now, if there was any chance this crazy group was holding him against his will. He wanted to talk to him and see for himself, and he wouldn’t be satisfied with anything less.</p><p>There had been almost no word from Tucker since he left Florida to travel to Tennessee almost a month before with a man he barely knew, this Gavin. The guy was from somewhere in the state, close to the border of North Carolina, and Tucker said he wanted to go with Gavin to explore his newly discovered family home. Gavin had told Tucker that he was taken from the area as a baby by his grandparents, and his real father was still alive and looking for him. The fact that Tucker was given no proof of any of this, and that he’d been hiding out from Gavin just a few days before, somehow no longer seemed to matter to Tucker, no matter what Kevin tried to tell him. Tucker had told Kevin he suspected Gavin was the leader of some kind of cult. What could have happened to change his mind so radically?</p> <p>To make things even worse, they’d been right in the middle of a murder investigation, and the chief was so furious when he discovered Tucker’s absence and his refusal to return, he’d fired Tucker on the spot, a not surprising reaction. As it turned out, the man was a homophobic asshole anyway. Tucker had long suspected that about him, and he kept his orientation secret within the department. When Tucker left the way he had, word had inevitably gotten out about him.</p><p>At Kevin’s persistent urging, the chief had sent some investigators to check into the situation, and they questioned people at the Nightstick, a bar Tucker frequented, and at the hotel where Gavin had been staying. It hadn’t taken him long to discover Tucker and Gavin were lovers. At that point, the chief closed the investigation, saying Tucker had ‘gone off with his fag boyfriend.’</p><p>He’d called Bryson in his office to tell him he was no longer looking into the situation. “I guess he fooled us all with his homo lifestyle, huh? Let him go. Good riddance. And leave it alone, Bryson, or we’ll start to wonder about you too. End of story.”</p><p>It wasn’t the end of the fucking story for Kevin. For him, it was only the beginning. The assholes he worked with could wonder about him all they wanted to. If Tucker was in trouble, he wouldn’t turn his back on him to save himself.</p><p>Since the day Tucker left with Gavin, Kevin had only heard from him once. He’d called to tell Kevin he was about to go through with some kind of commitment ceremony with the guy, and that he would be staying in Tennessee. Nothing Kevin could say would talk him out of it, and Tucker had actually hung up on Kevin while he was still pleading with him, saying he’d be in touch. That was the last time he’d heard from him, and Kevin was worried sick.</p><p>A loud knock on the door startled him for a second. He moved to the door cautiously. It was probably only hotel staff, but this whole thing had made him jumpy. The people in the small town were friendly enough, until he started asking questions. Way too many of them had clammed up after that, and acted, not exactly with hostility, but like he’d definitely worn out his welcome.</p> <p>Another loud, insistent knock sounded on the door, and he went over to the peephole. Who could be calling so late? He’d learned a long time ago it paid to be careful until he knew exactly what he was dealing with.</p><p>At first, Kevin couldn’t believe what he was seeing. Tucker stood in front of the door, his head slightly lowered as he waited, fidgeting a little. Behind him stood a big, dark-haired man Kevin had never seen before. As Kevin watched, this man leaned across Tucker and took hold of the door knob, shaking it impatiently.</p><p>Kevin took an involuntary step back. What the hell? Part of him wanted to rip the door open and enfold Tucker in his arms, but another part of him was alarmed. Who was this big guy with Tucker? At the first sight of him, Kevin’s heart had started racing.</p><p>Tucker called out, “Bryson, open the door. It’s me, Tucker.”</p><p>Kevin’s heart leaped again at the sound of his voice. Whoever the other man was, Kevin didn’t like the look of him. He wished he had his gun on him, but it was all the way across the room and from the way the door was shaking, it wouldn’t last long enough for him to retrieve it. Taking a deep breath, he flung the door open, tensed and jumped back, ready for whatever was about to come through it. Instead of the trouble he was expecting, Tucker stood in the doorway, looking like he always did, a big smile on his handsome face. Relief surged through Kevin, so strongly it made his legs a little weak.</p><p>Tucker’s eyes darted nervously around the room as he stepped over the threshold, though. The man, who had been standing protectively behind him, a little too close in Kevin’s opinion, came in with him. This guy was definitely not Gavin. Kevin had seen Gavin a couple of times behind the yellow crime scene tapes in Florida, while investigating the murders which remained unsolved. The last time Kevin had talked to Tucker he’d implied that the case was solved and no longer an issue, though when he’d pressed him for details, pleading with him to think this thing over and come back home for a while, he’d hung up on him. Indeed, there had been no more murders in the area, and the consensus was the perpetrator had been a transient and had moved on.</p><p>This was another reason to be wary of the guy who came in with Tucker. The muscular guy was no one he’d ever seen, but the expression on his face told Kevin he wasn’t exactly pleased to meet him. His eyes were scanning the room, as if to discover someone else hidden away, or some as yet unseen threat to them both.</p><p>Tucker met Kevin’s gaze and gave him a big smile, as he stepped all the way inside the room. He walked right up to Kevin and into his arms, surprising him. Tucker had never been physically affectionate with him before. Kevin held him close for probably too long, just breathing in his sweet scent with relief and reveling in the feel of the hard body against his. The big guy who had walked in behind him made a noise deep in his throat that sounded suspiciously like a growl, and Kevin reluctantly let Tucker go. Kevin cast a glance at the other man, wondering who the hell he was and what claim he seemed to feel he had on Tucker.</p> <p>“It’s good to see you, Bryson,” Tucker said, taking a step backward, his cheeks turning pink. “I...uh...got word you were looking for me.”</p><p>Kevin couldn’t prevent himself from touching him again, and reached for his arm to draw him over to the bed to sit down. “You got word, huh? But how did you know where to find me? God, I’ve been worried about you, Tucker. You said you’d call, but I haven’t heard anything in weeks. You can’t just disappear like that, man. Your apartment...your car...everything’s waiting for you to come back home. I paid the rent on the apartment for you last month.”</p><p>A definite growl came from the throat of the big man hovering near them this time, and Kevin looked up at him in exasperation. He stood between them and the door, like he thought Kevin might snatch Tucker up and make a run for it. Not a bad idea at that...</p><p>“I’m so sorry you had to do that, Bryson. I’ll pay you back, of course. And I am home,” Tucker was saying firmly. “I thought you understood I live here now. I’m sorry I haven’t gotten in touch sooner.” He waved one of his hands in that slightly old-fashioned, elegant way of his that should have looked feminine, but didn’t. “I don’t need any of the things I left behind, Bry. In the apartment, I mean. I’ll ask Gavin to send someone to pick up the car though and pay off the lease.” He brushed his dark hair off his forehead. Kevin watched him closely, trying to discern any kind of hidden message he might be trying to send him, and observing him for any changes in his demeanor. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tucker,” Kevin tried again after a few moments. “Won’t you come back home with me and think this over a little?”</p><p>“I think that question has been already been answered, Detective.” The man behind Tucker had taken an aggressive step forward as he spoke, and Kevin rose to his feet to meet his challenge. “Tucker is home, and there’s nothing to think over.”</p><p>The guy was huge, at least six foot three or four, and muscular, like a damned body builder. He looked to be probably thirty or so and looked vaguely Native American, with his tanned skin and high cheekbones. His eyes were intense and thickly lashed. The bastard was gorgeous, and if he’d met the guy in a club somewhere, Kevin might have been all over him. Kevin usually didn’t like men to be so much bigger than he was, but for this one he might have made an exception. Right now, however, the man was just pissing him off.</p> <p>“Chill, dude, I’m not talking to you,” Kevin said, not backing down an inch. “Who the hell are you anyway? Are you some kind of damn bodyguard? Afraid the newest member of your cult will come to his senses if he talks to a normal human being?”</p><p>The guy tensed and clenched his fists, but Tucker stood up and insinuated himself between them, putting a hand on Kevin’s chest. “Bryson, please. This is my...uh...this is Richard. Gavin was busy and couldn’t come with me, so Richard volunteered to drive me here. I came to tell you to go back home and drop this. Please, Bryson. I know you think I’m being coerced in some way, but...”</p><p>“Well, aren’t you?” He put his hand over Tucker’s and trapped it on his chest.</p><p>Tucker tried to pull his hand away and step back, but Kevin held on to him. “Just send this dude outside, and let me talk to you alone for a few minutes. Please, Tuck.”</p><p>The man Tucker introduced as Richard put a big hand on Kevin’s chest and pushed him back away from Tucker as he pulled Tucker behind him. At the same time the guy touched Kevin, a stunned look came over his face and he glanced down at his hand and back up at Kevin. Pulling his hand away sharply, he shook his head as if to clear it. “I’m not going outside or anywhere else, dude. And this conversation is finished. Let’s go, Tucker.”</p> <p>The man turned to hold out a hand to Tucker, and Kevin grabbed his arm to stop him. So fast he never knew what hit him, Richard took Kevin by the throat with one hand, pushing him backward and slamming him down on his back on the bed. He came along with him, straddling him and leaning down way too close over him.</p><p>Kevin had never thought of himself as weak, but in comparison to this guy, he was like a damned kid. He couldn’t budge either Richard’s body or his hands. He bucked up hard against him, trying to tumble him off, but it didn’t work. The hand, which had been holding him firmly, but not really hurting him, tightened a little around his throat as Kevin struggled. Richard glared down at him, his eyes widening just a little, his nostrils flaring. Kevin was aware of dark stars sparkling around his peripheral vision as he fought to get more air in his lungs.</p><p>Kevin could hear Tucker yelling, but it wasn’t until he stopped fighting and sagged in defeat that the pressure on his throat relaxed, and he was able to drag in a deep breath. Richard was crouching over him, breathing deeply, a dangerous glint in his eye. Richard didn’t move his hand, only whipped his head back to Tucker, almost snarling at him.</p><p>“Let me handle this, Tucker.”</p><p>He leaned down until his face was only inches from Kevin’s, coming so close Kevin could feel his hot breath blowing over his lips. “I’m going to let you up now, and you’re going to behave yourself, you got that?”</p><p>Kevin nodded—the brief movement of his head was all that the man’s hand allowed him. The pressure on his throat remained for another few seconds while Richard continued to lock eyes with him. If the cold stare was intended to intimidate him, it was pretty damn effective with his hand still gripping Kevin’s throat. Finally, Richard got up slowly, releasing him, and Tucker rushed to sit down beside Kevin and put his arm around his shoulders. “Are you all right? Did he hurt you?” He cast a furious glance up at the other man, not seeming to be the least afraid of him. Richard gazed serenely back at him and shrugged, folding his arms across his chest.</p> <p>Kevin shook his head and put a hand up to the sides of his neck. He’d have bruises there tomorrow. He glared up at Richard, who was still standing way too close to Tucker for Kevin’s peace of mind. “This shit just proves my point, Tucker. I’m not leaving here without you. And there’s nothing this son of a bitch or anybody else can do to stop me.” Irritatingly, he noticed how hoarse his voice sounded, and he shot Richard an angry look.</p><p>Richard gave him a slow, soft smile. “You know better than that, don’t you, Detective?”</p><p>Kevin glared at him. “I’ve had enough out of you, asshole.” His voice came out way shakier than he intended. “You just assaulted a police officer, and I may not have jurisdiction here, but I can still bring charges for what you just did. Don’t think I won’t do it. And while I’m at it, I’ll have a word with the state police about your little operation here, since the locals don’t seem interested. Last I heard, kidnapping and holding someone against their will was still illegal in this state.”</p><p>Richard gazed at him for another moment before addressing himself to Tucker. “You see? Are you satisfied now?”</p><p>“Just stop it, both of you, damn it. I’m not a bone for you two to fight over, for God’s sake.” He grabbed Kevin’s arm, turning him to face him. “Look at me, Bryson, and listen up. I wasn’t kidnapped, and I’m not being held against my will. No one brainwashed me. Shit, Bryson, give me some credit here. I’m a grown man, and I know what I want, so back off.”</p><p>Kevin huffed out a furious breath. “I want to believe that Tucker, but I can’t. People who are brainwashed aren’t exactly aware of it, you know.” He jabbed a finger at Richard. “And I’m not letting this son of a bitch off so easy!”</p><p>Tucker rolled his eyes as the man he called Richard made another move toward him. Tucker stood up again and shoved the man back before turning to put a hand on Kevin’s chest. “Wait a minute. Damn it, calm down, both of you. Give me a minute to think.”</p><p>Both Kevin and Richard glared at each other around Tucker as he stood in the middle of the floor, a hand on each of their chests. It would have almost been funny, if Kevin hadn’t known how high the stakes were. This could be his last chance to get Tucker away from these people.</p> <p>“Okay,” Tucker finally said. “Come with us then. See for yourself.”</p><p>“Tucker...” Richard said in a warning voice.</p><p>“I know, damn it. But can’t you see he’ll never believe me? What choice do we have?” Tucker turned back to Kevin. “Well? Will you go with us and see for yourself? We can put you up at the lodge for a few days, and you can see that I’m not in a cult, as you call it, and I’m not there against my will.”</p><p>Kevin glanced up at Richard and saw that he was furious. That alone decided him. “Sure, I’ll go with you to this lodge. Why not? I told the chief I wouldn’t be back for a week, so I have some time.”</p><p>“You told him you were coming here after me?”</p><p>“No, he wouldn’t have appreciated that,” Kevin said with a bitter tone. “You were right about his knee-jerk reaction to finding out he had a gay officer. When he read the reports of the investigators, he acted just the way you were afraid he would.”</p><p>“He had me investigated? Why?”</p><p>“It was at my insistence. I’m sorry, Tucker. I thought...well, you know what I thought, and when I talked to you I wasn’t overly reassured. The investigators talked to a few people at the Nightstick and at Gavin’s hotel. They even found out about the club you used to go to over in Ft. Walton.” He sighed. “I think he suspects me too. After all we were partners for a long time. Obviously I would have known. He made a few comments, so when I left I didn’t want to give him any more ammunition to use against either of us. I told a couple of the guys I was going to visit my parents.”</p><p>Tucker exchanged a glance with Richard, and he nodded curtly, like something unspoken had passed between them. Tucker held out a hand to Kevin. “Then come with us. I’d like you to meet my new family.”</p><p>As Richard stared at Kevin Bryson, talking quietly with his son, he felt a strange stirring in his chest. What the hell was the smell emanating from him? It was delicious, and seriously driving him crazy. He hadn’t meant to overreact as he had, but being so close to him, he couldn’t think straight. When he’d touched him the first time, he felt something like a jolt of electricity shoot up his arm.</p><p>It had been a long time since he’d been so immediately attracted to anyone like this. Not since he’d met his bloodmate more than twenty-five years ago. Richard thought about the incensed glare the man had fixed on him when Richard had his hand around his throat, and he was laid out on the bed beneath him. Just before he gave in and lowered his eyes, he’d given Richard a smoldering, passionate stare. Kevin would have to be assimilated into the pack and become a mate to one of the wolves, it was clear to him now. The man would never give up. But damn, he was going to be a handful for somebody.</p><p>He’d be a handful for somebody, but not him. Richard put the attraction he felt for the man firmly aside. He would never mate again, no matter what. The last time he’d felt so much for someone so quickly was when he’d met Tucker’s mother, his one true bloodmate and the woman who would become his wife. He had taken one look at her and knew she was destined for him. Luckily the feeling was mutual, and they’d been married only a week later. He hadn’t regretted it, even though she had lost her life in an accident not even a year after that. Losing her had left him so heartbroken and devastated, no one thought he would recover at first. Wolves mated for life, and the loss of their bloodmate was usually enough to kill a wolf. Richard came close, but the thing that brought him back was his love for his infant son. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tucker was Richard’s only son, and Richard was beyond protective of him. They’d been kept apart for many years, since Richard’s in-laws had kidnapped the baby after their daughter’s death and taken him away. Richard had never stopped searching for him, but his efforts failed again and again. Gavin, the pack alpha, discovered Tucker coincidentally when he went to Florida to investigate a rash of killings there instigated by their enemy, the Hunters. They had taken a natural pet and cruelly changed him into a monstrous killing machine, targeting humans. During the investigation and attempt to intervene, Gavin realized Tucker was his bloodmatch and convinced Tucker to come back to Tennessee with him. They’d had their mating ceremony only a couple of weeks later. Now this person from Tucker’s past was here to talk Tucker into leaving again and to make trouble for them all.</p><p>When news reached the pack that a detective from Florida was in the nearby town of Sylva, North Carolina, asking questions, both Richard and Gavin had been incensed. Gavin, in particular, was fuming.</p><p>“Why would he come here, Tucker?” Gavin asked. “What is this man to you?”</p> <p>“Kevin Bryson was my partner, you know that, and he’s my best friend. As to what he’s doing here, I don’t know. He’s just very...protective, I guess.”</p><p>“But why, Tucker?” Gavin asked his mate. “Why so protective and why would this man come all the way up here from Florida to find you? You said you called him and told him everything was fine.”</p><p>“I did,” Tucker said, flopping down on the sofa and looking up at his mate and his father with that mulish look he got when he didn’t want to discuss something. Richard continued to regard his son with determination. His stubbornness wasn’t going to do him any good this time.</p><p>Richard sat down in an armchair across from his son and tried not to let his irritation show. He knew Tucker well enough by now to know it would only make him worse. Gavin was a good alpha and a good mate to his son, but he’d neglected to give Tucker the loving discipline every pet needed, in Richard’s opinion. Richard may have been a little old-fashioned in his thinking in that regard, but the old ways worked. Why change them?</p><p>Richard saw Tucker glance up nervously at him, and knew he was hiding something. Gavin glanced over uneasily too. Though Gavin outranked Richard, he probably knew his beta father-in-law thought he spoiled Tucker outrageously. Richard had told him so often enough. Richard loved Tucker more than his own life, but he wanted him to be a good alpha’s pet, and in his mind, at least, keeping secrets from your mate only caused problems. If Tucker had been his mate, he’d already be over his knee.</p> <p>Richard pressed his lips together, though, and let his alpha handle things. He, at least, knew his place in the pack hierarchy. Gavin sat down beside Tucker and put an arm around his shoulders. “Honey, please. This is important. How did he know where to find you? He came directly to the closest town to the lodge, and you said you only told him you were somewhere in Tennessee. He shows up in North Carolina, just across the state line from us. How did he manage that?”</p><p>“He’s smart. And a detective.”</p><p>“Tucker,” Richard said in a warning voice.</p><p>“Okay,” Tucker said, his shoulders sagging. “I called him just before our mating ceremony on my cell phone. I guess he got the cell phone records and found the nearest tower.”</p><p>“But how could he...” Gavin flushed and fell silent when Tucker raised an eyebrow at him. “Oh, right. Police officer.”</p><p>Tucker snorted. “Well, yeah, and he has a key to my apartment. All he had to do was look through my phone bills. He knows where I keep everything.”</p> <p>He sat back on the sofa for a couple of seconds before leaning toward Tucker again. “That still doesn’t answer the question of why. What in the hell did you say to him? He was telling everyone in town that you were a missing person, and he feared for your safety.”</p><p>“Well, I didn’t tell him that. Like I said, he’s just protective...”</p><p>“Yes, about that, Tucker. Why would he be so protective of you?” Richard leaned forward. “Is there more going on than what you’ve been telling us?”</p><p>Tucker gave his father a startled glance and then sighed. “I guess he’s kind of...in love with me...”</p><p>“What?” Gavin said with a growl. “What the hell, Tucker, you told me your partner was straight, married and had a baby on the way. Did you lie to me?”</p><p>Tucker shrugged and would have gotten up if Gavin hadn’t gripped his arm. “Yes, okay, so I lied. I’m sorry, but you were jealous, especially when you found me in his parents’ condo, and I didn’t want you to think there was anything between us, because there’s not. I mean, he wanted a relationship, but I told him it wouldn’t be a good idea. We were partners, after all, and I know what would have happened if things hadn’t worked out between us. They probably wouldn’t have, either, because he’s not my type.”</p><p>Gavin glared at his mate. “Bullshit, Tucker. I’ve seen your partner when we did surveillance on you and at the crime scenes in Florida. The guy is good-looking.”</p><p>Tucker slanted him a smoldering look and leaned over until he was inches from Gavin’s face. “Yeah, if you like the blond, Brad Pitt look. I’m more into tall, dark and incredibly sexy myself.”</p> <p>Gavin looked unconvinced, but dropped a kiss on his lips as if he couldn’t help himself when Tucker was that close. Richard leaned back in his chair, shaking his head. “You should have told us everything, Tucker, so we could have taken precautions.”</p><p>“C’mon, Dad, I had no idea he would do something like follow me up here. I told him I wasn’t in a cult, and I was perfectly happy, and that maybe Gavin would let me come back to Florida for a visit soon.”</p><p>Richard shook his head. “Gavin would let you, huh? That was like waving a red flag, Tucker, especially if he was concerned that you were being held against your will.”</p><p>“Ah, hell, I didn’t think about that. Look, let me just go talk to him and send him on his way.”</p><p>“Out of the question,” Gavin said firmly.</p><p>Tucker whipped his head around to argue, and Richard broke in. “He’s right, Tucker. Best case scenario, he won’t believe you. He’ll think you’ve been brainwashed and keep digging until he learns too much, and we’ve been compromised. Worst case, he’d throw you over his shoulder and haul ass with you tied up in his trunk and put you in some kind of therapy for cult members. I won’t lose you again.”</p><p>Tucker blew out a frustrated breath. “Oh for God’s sake. Okay, then what are we going to do about it? He won’t stop, you know. He’s like a bulldog when he’s after something like this, and he’s very good at what he does. He’ll just keep investigating until he finds out everything he can. He might even go to the state police and try to flush me out that way.”</p><p>Richard looked at Gavin and met his steady, implacable gaze. Tucker glanced from one to the other. “What? What did I say?” A light dawned on his face, and he jumped angrily to his feet. “Oh no! Oh, hell no, you’re not going to hurt him.” He grabbed Gavin by the shirt front. “I will not stand for you hurting him. I’d go to the state police myself before I let you touch one hair on his head, do I make myself clear?”</p><p>Gavin gripped his wrists and pushed him gently away, still keeping hold of him. “Calm yourself, Tucker. Nobody’s going to hurt him.”</p><p>“Tucker, I’m surprised at you,” Richard said. “You know we don’t deliberately hurt humans unless they attack us first. And even then, we’d try not to injure them. Even the Hunters were given a chance to assimilate into our pack last year when we destroyed their compound. Those that gave up were taken care of and found mates within the three branches of the pack.”</p><p>“So then...wait...you want to assimilate him? Is that what you’re trying to say? What the hell does that even mean? You’d force him to become a part of the pack?”</p><p>“Oh for God’s sake, Tucker,” Richard said. “It’s not like it’s a fate worse than death...you seem to be pretty happy.”</p><p>“Yes, but I chose this life for myself, damn it. I wasn’t forced into it.”</p><p>“There would be no question of forcing,” Gavin said in a soothing tone. “If he received a mating bite, he’ll be eager, as a matter of fact.”</p><p>“Oh yeah, that makes it so much better.” Tucker shook his head. “No, I can’t agree to something like that.”</p><p>“We’re a long way from a decision like that anyway,” Gavin said. “Too many factors are involved.”</p><p>“Like what?”</p><p>“Like whether or not he’s already told a lot of people where he was going, or if he has close family members who would come looking for him...that kind of thing. His personality too, would have to be considered. If he became the mate of a wolf, he’d have to have a somewhat submissive nature, and not be resistant to being dominated, especially during...uh...” he cast a glance over at his father-in-law and blushed. “You know.”</p><p>“You mean sex? Good Lord, Gavin, my dad knows we have sex.”</p><p>“Tucker,” Richard said reprovingly.</p><p>“Well, you do.”</p><p>“Yes, well, what I may know, and what I like to think about are two different things, son. And this conversation is becoming uncomfortable. What Gavin is trying to tell you is that we do have different methods, depending on the individual. What works for some might not work for others. We’ve been in this area for a long, long time, Tucker, and of course your friend, the detective, is not the first human to get a little too curious about us. When that has happened over the years we’ve had to take steps to mitigate the damage. Not just for ourselves, but for everyone in our pack.</p><p>“Like what? Besides assimilation.”</p><p>“We used to keep prisoners inside the compound years ago.” He held up a hand at the look on Tucker’s face. “But not anymore. It’s cruel, and we’re not interested in becoming jailers. In recent years, some mild brainwashing techniques have been used, though we don’t like that either...too unpredictable and too much chance of the person losing all their memories.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, then that’s out. It’s just inhumane.”</p><p>Richard turned his head slightly to regard him. “But we’re not human, Tucker. You seem to forget that. And our first priority has to be the pack.”</p><p>“But there must be other humans who know about you. You said my mother told my grandparents before she died.”</p> <p>Richard nodded. “Yes, some family members of the pets do know something about our nature. But we’re careful to decide who is given information. Close family members of the pets have a stake in keeping our secrets. Their children’s happiness is at risk, after all. But we’re very selective in who we tell. We have natural pets who work with us in the police departments and various state agencies to help ensure our privacy. Not much is left to chance, Tucker.”</p><p>“At least let me go see him. Then if I see it’s not working, we can bring him to the lodge and make a decision about what to do. I understand what you’re saying, but I won’t be a party to hurting him in any way. He’s always been a good friend to me. You can go with me to make sure he doesn’t throw me in his trunk or whatever,” he said, with a slight rolling of his eyes. Putting a hand on Gavin’s chest, Tucker leaned into him. He was making his appeal directly to Gavin, who he knew had trouble denying him anything. If Richard hadn’t been so irritated, he might have had a grudging admiration for how manipulative his son could be.</p><p>“Okay, honey, you can talk to him,” the alpha said. “But keep in mind that it probably won’t do any good. If he continues to not believe what you tell him or if it looks like he’s going to make trouble, then bring him here and we can decide what to do.”</p><p>“Let’s cross that bridge when we come to it, okay? I think I can talk to him and convince him to go back home and leave us alone. Let me try, anyway.”</p><p>Gavin nodded and pulled Tucker into his arms. Over his shoulder, he gave Richard a significant look. They’d give Tucker his chance, but if this man was as persistent and stubborn as Tucker was, Richard didn’t hold out much hope that it would work.</p> <p>Coming back to the present, Richard signaled to Tucker to step outside the hotel room with him. Tucker inclined his head slightly and turned to Kevin, who was getting his things together to leave with them. “Go ahead and get packed. I need to speak to Richard a moment.” At the detective’s look of alarm, he smiled and put a hand on Kevin’s arm. “I’ll be just outside the door, don’t worry. I won’t leave without you.”</p><p>Kevin nodded, and turned to get his things from the bathroom, while Tucker followed Richard to the corridor. Once outside the room, Richard regarded his son, who shifted restlessly from foot to foot. Taking Tucker’s hand in his, he spoke softly to him. “I want to make sure you realize he won’t be leaving the lodge again if he goes with us. But at least you’ve had your chance to talk to him.”</p><p>“I know, and I feel like shit about this. I’m betraying him, but I don’t know what else to do. He’ll make good on his threats. Since I couldn’t convince him to keep his mouth shut, he’ll be assimilated, won’t he?”</p><p>Richard shrugged, looking uncomfortable. “It does seem as if no one knows he’s here. Assimilation would work, I suppose. You told me his parents live in another state?”</p><p>“Yes, taking care of Kevin’s elderly grandparents. They won’t be concerned for a while, at least.” He gazed up at his father. “But eventually they’ll come looking for him.”</p><p>“If we decided to take him into the pack, then by that time, he’d be recovered enough to be able to talk to them himself and make reassurances. It seems like we have about a week before anyone from Florida gets concerned, and even then they wouldn’t know where to look for him.”</p> <p>Tucker glanced back at Kevin through the partially open door. Kevin had finished his packing and was sitting on the bed, probably trying to overhear what they were saying.</p><p>Richard put a hand on his shoulder. “I don’t think there was anything else you could have said that would have made him leave without seeing for himself, son. He’s pretty damned stubborn. At least this way, we don’t have to take him by force and possibly cause him an injury.” He glanced over at Kevin, who was staring at them suspiciously. His dark, sooty lashes contrasted with the fair skin of his cheeks, and his eyes were narrowed in concentration. Richard felt another strong stirring in his groin and shifted his feet. What the hell was the matter with him? He leaned down and whispered in Tucker’s ear. “He’s a fighter.”</p><p>“Yes,” Tucker said, crossing his arms over his chest. “He always has been. And now he’s in this mess because of me. Damn it, it’s all my fault. He came after me to help me, and I’m screwing him over.”</p><p>“He’s in it because he’s pigheaded. Not to mention jealous.”</p><p>“Dad, put yourself in his place. Wouldn’t you try to help me escape if you thought I was being brainwashed and held against my will? Can’t we talk to him and try to convince him to keep quiet about all this? If we could convince him we’re not any kind of threat to humans...”</p><p>Richard shook his head. “It’s not only up to us. The other two alphas have a say in this as well. Too many lives could be ruined if word gets out.”</p><p>Richard was silent for a moment, gripping his shoulder. “There’s nobody to blame here. You’re both doing what you have to do. Now let’s get your boy here back to the lodge. It’s a good thing the hotel owner is one of us. We should be able to get him to erase any evidence of his stay here, just in case.” He glanced over at the man sitting on the bed. “Your friend’s going to be supremely pissed and hard to handle when he realizes what’s happening.”</p><p>Chapter Two</p> <p>Following the big SUV along the dark, twisting mountain roads, Kevin glanced over at the big man sitting next to him. Damn, the asshole was good looking. The light coming off the dash highlighted his high cheekbones and accentuated the planes of his scowling face. He was obviously not happy about something. Kevin supposed he was upset because he was going to this lodge of his. Fuck him. Kevin shifted his gaze firmly back to the road, even as his cock enthusiastically agreed with him.</p><p>As he’d feared, Tucker drove the SUV. Richard had not allowed him to ride with Kevin. He was probably afraid Kevin would take off with him if he got him alone in his car. Damn right, too. So he’d half expected to be told to follow them to their mountain lodge. What he hadn’t expected was that Richard would slide into the front seat of his car with him. “You don’t mind, do you?” he’d asked. Kevin knew it was a rhetorical question.</p><p>“In case we get separated on the dark mountain roads,” Richard explained. “It’s easy to lose your way if you don’t know where you’re going.”</p><p>“Why not?” Kevin agreed, trying to hide his reluctance. It was bad enough to have him sitting so close to him, let alone be so affected by his presence. For one thing, his cologne or his natural smell, whatever, was driving him crazy. It was a clean, woodsy, outdoor scent, mixed with something slightly musky underneath. Whatever it was, it was making his cock thicken in his damn crotch, and he hated the idea of being so attracted to this man.</p><p>Despite his physical attraction to him, he hadn’t forgotten lying helplessly on his back on the bed with this guy’s hand at his throat not an hour earlier. He figured he had bruises coming up already. Strange how big and powerful these men were. Gavin had been huge too, and the reports were that all of the men traveling with him to Florida had similar builds. Tucker had spoken of a family, and it was possible, of course, that their size was a family trait. If so, this bunch had certainly won the genetic lottery, if they were all as handsome and well-built as Gavin and Richard. And none of them, according to the investigator’s reports, appeared to be over the age of thirty or so. It was mysterious, and Kevin hated mysteries.</p><p>Lost in his thoughts, he was following the tail lights of the SUV in front of him when a deep voice broke into his thoughts. “You’re wasting your time, you know. You won’t seduce Tucker away from Gavin.”</p><p>Kevin turned his head sharply toward the man in the seat next to him. “What makes you think I want to seduce Tucker?”</p><p>“I see the way you look at him.” Richard turned his gaze toward Kevin. “He’s in love with Gavin. They’re married for all intents and purposes. Tucker is a loyal person, and he thinks the world of you, but only as a friend. You’ll never be more than that to him.”</p><p>Stung by his words, Kevin snapped at him. “What the hell is any of this to you? Why don’t you let me worry about it?”</p><p>Richard glanced over at him, his dark brown eyes gleaming in the light from the dash. “So long as you know...” he said cryptically and focused his gaze back on the road. “Besides the two of you would never have worked out. You both need a strong man to be in charge of you.”</p><p>Kevin shot him a furious look. “What the hell do you know about me?”</p><p>“I know that when I put you down on the bed back there in the hotel room, your dick was as hard as a rock.”</p><p>Kevin could feel his face flaming, and he was glad for the dark interior of the car. “You don’t know what the hell you’re talking about.”</p><p>“Okay,” Richard answered serenely, staring out at the road ahead. “Don’t get pissed off. Forget it.”</p><p>“You better hope I’ll forget it. I could still bring charges against your ass for what you did back there.”</p><p>Richard made an inscrutable little grunt, and for the next few miles there was silence in the car. Kevin was furious. Mainly because the son of a bitch was right. He had been a little turned on, and he didn’t know exactly why.</p><p>“Why are you so convinced Tucker is in some kind of cult? Does he seem different to you?”</p><p>Tightening his grip on the steering wheel, Kevin huffed out a long breath. “Not exactly different, no.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Then why are you so suspicious?”</p><p>“Because I know Tucker a lot better than you do. I know how cautious he is and how long it takes him to trust people and let them get close to him. There’s something not right about all of this, and I’m not going to give up until I find out what it is.”</p><p>Richard stared at him speculatively for a long moment before turning back to gaze out the windshield. Ahead of him, Tucker was pulling off onto a road with a gate and a high fence. As they watched, Tucker rolled down his window, spoke into a speaker fixed to a post in front of the gate, and the gate swung slowly open.</p> <p>“Damn, what is this, Fort Knox?” Kevin commented as he followed the SUV through the gate.</p><p>“As we’ve told you, we’re a private family.”</p><p>Kevin blew out an irritated breath, feeling even more pissed off when Richard’s lips curved up in a mocking smile. Once through the gate, the road stretched for at least two miles or so into the forest. Trees lined the road closely on either side, rather ominously, Kevin thought. He was beginning to feel claustrophobic when they finally came to an opening, and he could make out lights piercing the utter blackness ahead.</p><p>They pulled up to a huge log structure, about three stories high. There was a semi-circular driveway in front that Tucker followed, and he parked right next to the massive double front doors. It was made of huge logs that appeared to be rough-hewn, both rustic and handsome. The place was a far cry from what he’d imagined. It looked almost like a big hotel of some kind, though of course, there were no signs outside and no big parking lot full of cars. As a matter of fact, if they had more vehicles than the big SUV, he didn’t see them. Possibly they had a garage somewhere out back. He pulled his car up behind Tucker’s and got out, aware that Richard had grabbed his bag from the back seat.</p><p>It was around nine o’clock in the evening, and a few people were walking around outside, though a stiff breeze made the air seem chilled. They nodded to Richard and Tucker as they passed and looked at Kevin suspiciously. When he followed Tucker inside, he saw a big open area, like a hotel lobby. On the left side of the room were tables and chairs, set up like a dining area, and leading up to the upper floors was a big, wide staircase in the middle of the room. There were maybe twenty people in this area, either talking quietly in armchairs and sofas by the fireplace or moving up and down the stairs. There was an almost equal mixture of men and women. A few were sitting at the tables, drinking something and relaxing together. Nothing was alarming in the scene, but it all felt a bit off to Kevin.</p> <p>For one thing, many of them seemed to look very much alike with their coloring. Again, that could have been the family resemblance, but they all had similar, wary expressions as they glanced at him and then quickly away. There were more normal sized people, like him and Tucker in evidence, but still there were all the bigger ones, filling at least half the room, and they looked at him with outright hostility. Some of them actually tucked their smaller companions behind them as they regarded him, as if he were some kind of threat to them.</p><p>He felt Richard’s hand at the small of his back, nudging him forward, and he saw Tucker beckoning to him from the stairs. Tucker was smiling down at him from a few steps above, and after running the gauntlet in the big living area, he was only too glad to walk toward him. “Let me take you to a guest room and get you settled. There’ll be time to meet everyone in the morning, okay?”</p><p>He nodded uneasily and followed Tucker upstairs. Richard followed closely behind with his suitcase. They walked past a few doors in the hallway on the second floor when Tucker stopped and swung open a door. Kevin stepped into a pleasant room, large and spacious, with a king-sized bed draped with snowy linens. “You have a bathroom here,” Tucker said, indicating a side door. He turned to him with a big smile that didn’t quite reach his eyes. “Why don’t you try to get settled in and I’ll go find Gavin. I’m sure he’ll want to say hello.” He glanced over at Richard. “Will you go with me? Um, Richard?”</p><p>“You go ahead, Tucker. I’ll follow you in a moment. I need to have a word with Kevin first.”</p><p>Tucker glanced back and forth between them, and shoved his hands in his pockets. “I can wait for you. If you think that’s best?”</p><p>Richard gave him a look that had Tucker glaring back at him for a long moment before finally lowering his gaze. “Go ahead, Tucker,” Richard said. “I’ll be there in a few minutes. I won’t take long.”</p> <p>Tucker nodded and left the room. Since when did Tucker take orders from this guy? Kevin glanced at him. “Okay, what now? You want to warn me away from Tucker again? I assure you I got the message, but there’s something weird about this place, and I’m not going to rest until I find out what it is.”</p><p>Richard nodded. “Yes, Kevin, I think you will find out.” He came slowly toward him and without meaning to, Kevin took a backward step. Something feral in the man’s eyes alarmed him, and he turned to take a half step toward the door. Richard grabbed his arm in a strong grip and with his free hand drew a hypodermic needle covered with a rubber tip from his pocket. Staring down at it in horror, Kevin yelled loudly for Tucker and tried to wrench away, but before he could, Richard used his teeth to rip away the rubber tip and bury the needle in his upper arm. Even as he struggled, a feeling of weakness and warmth spread over him, and he felt his knees collapse. Before he fell toward the floor, Richard caught him, holding him up against his firm body. He only had time to glare up at Richard accusingly, his curses coming out as garbled nonsense, before the darkness swallowed him up. As Richard laid him back on the bed, he could have sworn the man was sniffing at him again.</p><p>Richard looked down at the sleeping figure on the bed and then back at his alpha. Gavin was a handsome man, but if he didn’t know how much his son loved Gavin, he might have been worried. As a matter of fact, he found it hard to understand how Tucker could have resisted Kevin’s advances so long. There was no doubt that Kevin Bryson was one very beautiful and tempting human. Richard thought he might be fucking irresistible, in fact, and he longed to get his hands on his body again.</p><p>When they arrived back in the compound with him, he’d told Tucker he wanted to talk to the detective, but he hadn’t been truthful. He only wanted Tucker out of the way before he took care of Kevin. Richard had already made a decision on the way to the lodge that this stubborn man would never rest until he’d uncovered their secrets. He wasn’t sure the brainwashing techniques would be effective either. This man was too strong-minded and resistant. No, he had to be assimilated into the pack, even though he knew Tucker still wanted to talk things over. The first step in the process was to immobilize the man and make sure he wasn’t wired, or being tracked in some way.</p><p>Once he got rid of Tucker and gave Kevin the injection, he’d sent for Gavin. Gavin glanced down at Kevin’s sleeping form on the bed. “Tucker’s going to be furious at both of us, you realize that, right?”</p><p>“I know, but it had to be done. He’s been making a lot of threats to call in the local authorities.” Richard gazed down at him and shook his head disapprovingly. “Stubborn, willful boy.”</p><p>“Sounds a lot like your son,” Gavin said, grinning.</p><p>Richard huffed out a breath and began to unbutton Kevin’s shirt. “May as well get started. See if he has any kind of tracking devices on him that could lead someone to the compound.” Though gammas usually handled something like this, Richard hadn’t wanted any gammas touching Kevin. He told himself it was because Kevin was Tucker’s friend, and he felt protective of him. They already had gammas downstairs going over his car before taking it back down the mountain to a secure location.</p> <p>When Gavin put his hands at Kevin’s waistband, though, and started tugging off his pants, Richard felt both hot and cold at once, a feeling of possessiveness washing over him, a feeling so powerful he yelled, “No!” at his alpha in alarm. Gavin froze, looking up at him curiously.</p><p>“I mean, uh, let me do that, Alpha. Please.” He gently nudged Gavin aside and took over, the thought of Gavin’s hands on Kevin made him uneasy and nervous.</p><p>They had found nothing on him. Kevin was already stirring a bit as he came out of the mild sedative he’d been given. His face was pale, and Richard checked his pulse for the third or fourth time to make sure it was still steady.</p><p>Kevin had a nice body underneath the sheet that was covering him. His face actually did look a bit like Brad Pitt’s, as Tucker said, though softer, his face not so angular. Richard thought he was better looking too. His hand strayed to Kevin’s hair, and he pushed it off his forehead. It was too long for a policeman, really. He wondered if they gave him a hard time about it. He noticed Gavin staring at Kevin, and felt vaguely jealous and uneasy. He reached down to pull the sheet up higher on Kevin’s chest and saw his alpha give him a strange look.</p><p>“How are we going to proceed?” Richard asked, and Gavin shrugged.</p><p>“Hell if I know,” Gavin replied. “I’ve never been in a situation like this before. If no one knows where he is, we keep him in here for a few days to let him get used to us. Tucker’s already furious. He wanted one more try to convince him to leave and keep his mouth shut, but you made that decision easy for me. We’re pretty much committed now. I’ll have to consult with the other alphas, but I know they’ll agree assimilation is our best option. Tucker will have to come to terms with it, somehow. In the meantime, we’ll have time to convince him to let us select a mate for him. I don’t want to have to force him. The full moon is in another few days, so we’ll need to keep a close watch on him until afterward. There’ll be enough going on then without adding this to the mix.” He stared down at him and frowned. “Perhaps in time, he’ll want to join us. Or we can persuade him. Are you sure you couldn’t tell about him from your talk in the hotel or on the way over here? Do you think he’ll be able to join the pack and follow orders? Pack hierarchy is usually the hardest thing for humans to adjust to.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Richard shook his head. “He was too resentful of me and too anxious to protect Tucker for me to get a good read on him. I couldn’t get a clear notion of how submissive he is. When I put him down on the bed, he did give in, but not right away. I think the right man could master him.”</p><p>“The right man, huh? And who would that be?”</p><p>“No idea. It would have to be someone my age or older, probably. Someone’s who’s learned some patience. Someone who isn’t still trying to find a bloodmatch, yet attractive enough that he can seduce him. Tucker insists this can’t be a forced mating, and I’d really hate to resort to any kind of mind altering techniques with him. He’s been a good friend to Tucker. He came here out of concern for him.”</p> <p>“I know,” Gavin said thoughtfully. He regarded his beta speculatively. “Actually, this prospective wolf mate you’re describing sounds a little like you.”</p><p>Richard shook his head firmly. “No. No way. My bloodmate died a long time ago, and I have no interest in a love match. No. We’ll find him someone, if not here, then at one of the other lodges. That is, if he’s suitable. We don’t want to pair him with someone who’ll make his life miserable...and vice versa.”</p><p>A door closing behind Richard caused him to turn as Tucker came in the room. He walked up beside Gavin, hugging his arms to his chest, obviously still upset. “Not awake yet, huh? Damn, he’s going to be so angry. I wonder if he’ll ever speak to me again.” He turned to his father. “I should have been given a chance to explain things to him first. You didn’t have to drug him.”</p><p>“If you think he would willingly have let us strip search him and take his car, then you don’t know him as well as you think you do.”</p><p>Gavin broke in. “Tucker, it’s not up to you, honey. This is a pack decision.”</p> <p>“I know you’re angry, Tucker, and I’m sorry,” Richard said. “I have to do what I think is best for all of us, and we had to make sure he didn’t have any tracking devices. From what I’ve seen of him so far, I knew he’d fight me. I didn’t hurt him...the doctor assured me the sedative was fairly mild, even though it was fast-acting. He’ll wake up soon.”</p><p>“Are you still determined to be in here with him alone when he wakes up?” Tucker asked his father.</p><p>“I think it’s best. He’s familiar with me, and he already thinks of me as the bad guy. Let him cuss me for a while and calm down before I call you in,” Richard said.</p><p>“Oh, we’re doing the bad cop, good cop thing, hmm? Okay, but don’t get him too crazy, or I won’t be able to settle him down enough to get him to listen to me,” Tucker said. He pointed his finger at his father. “And don’t make him mad. You guys don’t always realize how overbearing you can be.”</p><p>Richard smiled. “I make no promises. He’s got a short fuse.”</p><p>Kevin groaned and raised his knee restlessly, trying to turn over. The cuff on one wrist attached to the headboard prevented it.</p> <p>“Is cuffing him really necessary?” Tucker asked.</p><p>“I won’t keep it on him long. Just making a point with him, that’s all.”</p><p>Tucker opened his mouth to say more, but a loud groan from the bed stopped him. Kevin thrashed his head on the pillow. “Better get out of here,” Richard said. “It looks like he’s waking up. I’ll call you after we talk.”</p><p>Tucker left with reluctance, allowing Gavin to tug him away, and Richard was alone with the beautiful man on the bed. Giving into the temptation to touch him, he brushed his fingers over one flushed cheek. He thought about what Gavin had said about him taking this man for a mate.</p><p>It had been so long since he’d allowed himself to have someone to love. As the beta, he lived his life mostly for the good of his alpha and his pack. Only once had he allowed himself to love someone who belonged only to him, and for that brief span of time, he’d had a treasure in his hands, only to have it snatched cruelly away. Now this new treasure was here within reach. Was it possible to have it all again? Did he dare to even try? There had been cases—a few—where a wolf had managed to not only survive the death of his mate but to find love again. The beta of the North Carolina pack had managed it. It was very rare, but possible.</p><p>His wolf stirred inside him, restless and edgy. He dropped his hand and turned away. No, it was too risky, and there was too much to lose. This time, if he lost, he knew he wouldn’t survive. The pain would surely kill him. He wouldn’t risk it all again, no matter how much he wanted this man. He stood up and crossed to the window as Kevin moved his head on the pillow, trying to wake up. Richard stared out the window and hardened his heart. He wouldn’t be hurt like that again. A love like he’d had with his wife only came once in a blue moon, and never came again. Besides, this guy didn’t even like him. He glanced back over at him. If only he wasn’t so desirable.</p><p>Kevin’s eyelids fluttered and then opened, as he tried to wake up. He lay on his back, one wrist bound above his head. Groggily, he took stock of his situation. His head ached and his stomach twisted with nausea when he tried to sit up. He was cuffed to a soft bed in a darkened room. His clothing had been removed, but he didn’t seem to have any injuries. Tucker must have prevented that. Tucker...it hurt to think he was part of this, but he knew he wasn’t really responsible for the betrayal. The bastards who brainwashed him were behind all of it.</p><p>He heard a slight noise to his left and saw the man who had attacked and drugged him standing by the window. He was silent, watching. It was a little scary to realize he could be so quiet and unmoving. It didn’t seem natural, somehow. Had he been watching Kevin as he slept? The idea caused a chill to run down Kevin’s spine. Richard’s gaze seemed to be measuring Kevin, though his posture was relaxed, and his face calm. His expression gave no indication of what he had planned for him.</p> <p>The silence grew as they stared at each other. Richard let his unreadable gaze travel slowly over Kevin’s body and though Kevin was covered with a sheet, Richard’s eyes seemed to map every inch of him. Kevin was irritated to feel a hot blush starting on his cheeks. He had no doubt who had undressed him as he lay unconscious. He glanced up into the man’s eyes and saw the cool, steady regard. Once they arrived at the compound, Kevin had let his guard down, and now he would pay the price. This man was a predator, and he would do well to remember that.</p><p>His mouth felt as dry and dusty as a backcountry road as he cleared his throat to speak. “Well, I should have known you’d be here. Where’s Tucker? Why the fuck am I cuffed to this bed?”</p><p>Richard prowled closer to the bed, his eyes intent on Kevin’s face. “Tucker’s fine. He’ll be in to see you soon, but first you and I are going to have a little talk.”</p><p>Kevin pulled viciously at the cuff on his wrist. “Get me out of this shit!”</p><p>“Settle down before you hurt yourself. I’ll release you in a moment, but first we need to get a few things straight between us.”</p><p>“I have nothing to say to you, asshole. Do you have any idea how much shit you’re going to bring down on your heads by attacking me and holding me like this? I’m an officer of the law—do you really think you can get away with it?”</p><p>Richard lifted one shoulder in a shrug. “We already have, Kevin. And I don’t think you told anyone where you were going when you decided to come up here on your little rescue mission, because you didn’t want anyone to know in case Tucker turned you down. You’re here on your own because you couldn’t stand to let him go.”</p><p>“You’re full of shit.” Kevin glared at him, putting everything he felt, all the anger and frustration, even a little of the fear and desperation at the situation he found himself in—everything—into that look. He saw something move on Richard’s face and it softened, just the slightest bit as he came toward him.</p><p>“I’ll let you go, so long as you remember you’re a prisoner here. You can stop making threats, because none of this is under your control anymore. Understand?”</p><p>Kevin glared up at him silently, feeling cold fury, his gaze promising retribution.</p><p>Richard met his gaze unflinchingly. “Do you understand?”</p><p>“Yes, damn it. I understand.”</p><p>Richard pulled a key from his pocket and released him from the cuff. He stepped back as Kevin sat up, rubbing his wrist, and swung his bare legs over the side of the bed. He was careful to keep the sheet over his lap, and he could feel another flush slowly rising over his cheekbones. He resisted the urge to put his hands over his cock, instead meeting his captor’s gaze with a steady stare.</p><p>“So now what happens? You try to brainwash me too?”</p><p>Again, an odd look passed over Richard’s face but he sat down in the armchair next to the bed and leaned forward. “For the next day or so, nothing much happens. I’ll let you talk to Tucker, and you’ll mostly stay here until we can make preparations.”</p><p>“Preparations for what, damn it?”</p><p>Richard shrugged, and Kevin made a sound of anger and impatience.</p><p>“If it hadn’t been for Tucker, you’d be waking up in a cell down in the basement right now, so count yourself lucky.” Richard said sternly. “This is a private group, Kevin. We don’t appreciate outsiders coming to spy on us and threaten us, and we protect our family.”</p><p>“Family?” Kevin snorted. “Save the bullshit, Richard, I’m not drinking your kool-aid. If you let me go and take Tucker with me, I’ll tell the police you cooperated and maybe they’ll go easy on you. It’s your best chance.”</p><p>Richard raised one eyebrow. “No, actually, I don’t think it is. We have something different in mind for you.”</p><p>“Like what? I’m warning you, asshole...” Kevin stood up, clenching his fists around the sheet to keep it around his hips. He hated this, hated the smug bastard in front of him, hated the fact that he’d allowed himself to walk right into their trap. He wanted to smash his face in, make him feel as frustrated and furious as he did right that moment. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Aggressively, he took a step toward him. “Who the hell are you anyway? Are you fucking Tucker too? Is that it? Are you guys in some kind of three-way?”</p><p>Richard’s reaction was immediate. He jumped up from the chair, his face dull red, his mouth open in surprise. His hands shot out and shoved Kevin hard on his chest, knocking him back on the bed.</p><p>Kevin scrambled back to his feet, throwing the sheet down in his fury. He took a step forward and shoved back, putting everything he had into it, all his fear and his rage. Richard stumbled backward, his big body mostly absorbing the shock, but Kevin was gratified to see he’d surprised him.</p> <p>Richard stood still for a moment, seeming to gather himself, taking in deep breaths and clenching his fists. In seconds, his face was smooth and calm again, and Kevin could see that he’d mastered the flash of anger his words had caused. Suddenly, he didn’t want Richard to be so in charge of his feelings anymore. He wanted him to experience the same savage passion and rage he was feeling. He sneered at him, taunting him deliberately. “What’s the matter, Richard? Afraid your little secret will get out? Doesn’t Gavin know about you and Tucker? Are you two sneaking around behind his back? How does it feel to have your cock up that sweet little ass? Or does he put his dick up yours? Is that what you like?”</p><p>“Shut your mouth!” He reached for Kevin, who put his hands up defensively, expecting to be hit in the face. Richard grabbed his wrists instead, and they struggled, each determined to get the upper hand. As they scuffled back and forth, Kevin trying his best to break Richard’s incredibly strong hold on his wrists, Kevin was slammed back into the wall by the bed, and Richard forced his hands above his head.</p><p>They were almost nose to nose, and once again, he was almost overwhelmed by Richard’s scent, which was teasing him and making him foggy with desire.</p><p>“Don’t talk shit you don’t know anything about! What you’re saying is disgusting!” Richard yelled.</p><p>“Why? Because Tucker is a man? You’re not into men, is that it? Or you just think you’re not? It wouldn’t be the first time a straight guy wanted to have a little something on the side. Tucker’s pretty sweet, isn’t he?”</p> <p>“Shut up!” Richard kept his tight hold on his wrists, and bent to take Kevin’s mouth in a punishing kiss. At first he practically ground his lips against Kevin’s, but when Kevin reacted instinctively and parted his lips, he stopped his rough assault, just holding his lips against his, breathing hard into his mouth. The next second, Kevin heard a low growling sound coming from his throat, and he was licking gently at his lips. Kevin opened his own mouth farther and tentatively pushed out the tip of his tongue to meet Richard’s. Richard swept his tongue over Kevin’s and thrust inside his mouth.</p><p>Kevin let out a low moan as his body betrayed him. He could no longer concentrate on anything except the man’s tongue sweeping over the inside of his mouth, the heat making his balls draw up and his cock thicken. He couldn’t catch his breath and the bastard holding him wasn’t letting up. He thrashed his head from side to side, trying to escape, but Richard only laughed and put up one hand to hold his chin, while the other hand effortlessly held both of Kevin’s wrists against the wall. His laugh was a low, throaty rumble that made Kevin’s balls tighten to the point of pain. He kissed him until Kevin’s lips felt raw and only when he sensed Kevin’s surrender did he slowly withdraw, giving his lips a final little lick. It was scary how easily he controlled him, and Kevin slowly became aware of how very naked he was.</p><p>He froze when Richard’s large hand grasped his cock. For a long moment they simply stared at each other, the intimacy of standing so close with Kevin’s cock in this virtual stranger’s grip made his knees almost collapse. When Kevin glanced down to stare at the hand wrapped tightly around him, Richard’s voice rasped at him. “Look at me.”</p><p>Kevin obeyed, feeling almost compelled.</p><p>“Do you want me, Kevin? If you want this, all you have to do is nod. Just tilt your head up and back down.” He blew softly in his ear. “That’s all it takes.”</p><p>“No! I don’t want any of this. I didn’t want you kissing me, and I don’t want your hand on me either!”</p> <p>“Really?” Richard leaned forward, his own breathing fast and hot in Kevin’s ear. “Is that why you were moaning in my mouth just now? Is that why you’re so hard?”</p><p>Kevin’s legs were trembling. Why couldn’t he just tell him to fuck off? Strangely, he wasn’t frightened of him, even though he was holding him so tightly. Kevin had a feeling he wouldn’t hurt him. He raised his eyes to Richard’s and caught his steady gaze. Richard’s lips curved up in a beautiful smile. “That’s right. Look at me. Can you see how much I want you? You’re so goddamned beautiful. All you have to do is ask me to pleasure you.”</p><p>Kevin took a deep, shaky breath. God knew he wanted it. It had been a long time since he’d been so attracted to anyone, since anyone’s hand had felt so good. Holding Richard’s gaze, he nodded his head slowly up and down.</p><p>Richard smiled at him in triumph and slowly pumped his dick in his hand, never taking his eyes off him. “Feel good?” he whispered, leaning down to lick the corner of his mouth.</p><p>Kevin flicked his gaze up at him, and Richard responded by holding that gaze, his grip on Kevin incredibly firm and hot. Kevin heard himself whimper as the hand sped up, the pressure increasing. He pumped him slowly up and down, only gradually increasing the speed and the tempo. His thumb grazed over the leaking tip of Kevin’s cock and he smeared the pre-cum over the sensitive head.</p><p>Kevin was so close he thought he was about to embarrass himself by coming so soon. He slammed his head back against the wall to distract himself, but Richard followed him and took his mouth again, pressing those warm, full lips against his, his tongue flicking out to lick at the corners of his mouth. Then without warning, he flicked his thumb down into the sensitive slit and squeezed. Kevin threw back his head and his orgasm raced through him, the hot cum pulsing from his body in long streams. He was coming in Richard’s hand, helpless to prevent it, and the man smiled down at him, capturing his groans in his mouth.</p><p>“That’s right, come on.” Richard continued to milk his cock for every drop until his grip became painful and Kevin was sagging. Only then did he release him and catch him around the waist when he would have fallen. He put him back on the side of the bed. “Sit still,” he said softly.</p><p>He disappeared through one of the two doors in the room and when turned on the light, Kevin could see it was a bathroom. Kevin heard the water running. He came back in only a few minutes with a cloth, while Kevin was still trying to catch his breath. Kevin reached for the cloth, but Richard shook his head and pushed his hand away, cleaning Kevin himself. He made him spread his legs while he washed him thoroughly, to Kevin’s hot embarrassment and then draped the sheet back over his lap, looking into Kevin’s eyes.</p> <p>“Sweet boy,” he said, and moved his hands so they were trailing across Kevin’s shoulders. Finally, he let him go and crossed back over to the window.</p><p>When the silence dragged out to the point where it became excruciating, Richard finally spoke. “I’m sorry I shoved you before. I didn’t mean to hurt you. I don’t why you make me so...” he stopped in mid-sentence, looking up at the ceiling as if to find an answer there. Finally he started again. “Did I hurt you?”</p><p>Kevin shook his head, still unwilling to look at him.</p><p>“What you said about me and Tucker...it’s not true. Tucker is my...Tucker is a relative. A close relative and what you said made me...”</p><p>“I was just popping off. I didn’t really believe it,” he said grudgingly.</p><p>Richard stood for another few moments, and Kevin could almost feel the restlessness radiating off him. Finally he spoke. “I have to go, but Tucker will be in to bring you something to eat, and I’ll be back later. You’ll be seeing a lot of me until...” Kevin darted a glance up at him, and he smiled, shaking his head. “Relax for now. Try to get some rest, and Tucker will be in soon.” He strode toward the door, not even glancing back at him once before he left the room.</p><p>Kevin looked down at his traitorous cock, “A fat lot of help you were...” he muttered, wishing he’d never come on this crazy rescue mission, wishing he could just close his eyes and fade away, escaping this room, this situation and the crazy attraction he was feeling for a man who could so easily eat him alive.</p><p>Chapter Three</p><p>He was still sitting on the side of the bed a few minutes later when a soft knock came at the door and it opened slowly. Tucker came in alone, holding some clothes folded in his hand. He stood just inside the door for a long moment, as if unsure of his welcome. He seemed nervous and uneasy.</p><p>Kevin sighed. “If those are for me, give them to me. It’s cold in here, and I’m freezing.”</p><p>Tucker looked concerned and turned first to the controls on the wall, giving them a turn. “I’m sorry, I didn’t realize.” He brought the clothes over to him. “I didn’t have any pants that would fit you, but I brought some shorts, and a shirt. You’re a little bigger than me, but I think they’ll fit.”</p><p>“What about my things? I saw him bring in my suitcase.”</p><p>“Oh. Well, they’ve been taken away, Kevin. You know, in case there was any kind of tracking device or anything.”</p><p>“In my clothes? God, I’m not James Bond.”</p><p>“I know, but they’re being really cautious.” He stuck his hands down in his pockets and rocked back and forth on his heels nervously. “I, uh...I guess you’re pretty pissed off at me.”</p><p>“Shouldn’t I be?” Kevin stood up, letting the sheet fall and noticed how Tucker averted his gaze. That was new. He’d never been hesitant to look at him before in the locker room at the gym or the couple of times they’d gone swimming in the nude late at night on the beach outside his parents’ condo. He pulled on the clothes Tucker had brought him quickly, half afraid Richard might come back in the room. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I hoped you’d understand,” Tucker said. “I’m sorry I tricked you, Bry. The more we talked, and the things you were saying...I knew you had to come with us. I thought if you came on your own, it would be easier on you, that’s all.”</p><p>“Who is that guy, anyway? He acts like he has the right to boss you around.”</p><p>Tucker lowered his gaze and pressed his bottom lip between his teeth before he spoke. “Yeah, he kind of does have the right. In a way. I don’t always pay attention, though,” he said, a wry smile tilting up the corners of his mouth.</p> <p>“What the hell, Tucker, are you trying to be cryptic? Who is he?”</p><p>When Tucker crossed his arms and shook his head, Kevin lost patience. “Tucker, I’m getting out of here, and I’m taking you with me, whether you go willingly or not,” Kevin said grimly.</p><p>Tucker shook his head. “God, Kevin, what does it take to get through to you? You won’t be able to leave. They won’t let you! In case you haven’t noticed, you’ve been locked naked in a room inside the lodge. How the hell do you think you’re getting out of here? And I’m here because I want to be. You don’t understand. There’s a secret here, but it’s not about any kind of religion or cult. Actually I’m a part of it all, but I-I can’t tell you yet. But I can promise you, I’m all right. I’m in love with Gavin, and he gives me everything I need.”</p><p>“What kind of damn secret? What do you mean you’re part of it but you can’t tell me yet? How could you just walk away from everything...your job, your home...your whole damn life, just to be with him? Why is everything such a fucking mystery?”</p><p>Looking miserable, Tucker put a hand on his arm. “I will tell you, but not yet. You’ll know everything soon, Kevin.”</p> <p>“Oh? How is that? Because they’re about to do to me whatever they’ve done to you? You say it’s not brainwashing...well, then what is it? Some kind of drugs? Is it what Richard shot into me?”</p><p>“No. I promise you, Kevin, that was only a sedative, and I’m not taking any kind of drugs.” He raised his eyes to the ceiling. “Damn it, this is too hard. I just need to go ahead and tell you.”</p><p>The door opened and Richard strode back in. His eyes went straight to Kevin and roamed over him almost possessively before he stopped beside Tucker and put a hand on his shoulder. “I came back to tell you they’re serving dinner downstairs. Would you mind getting Kevin a tray, since you know more about what he likes than I do?”</p><p>Tucker nodded. “Sure. Be back in a few minutes.”</p><p>“Take your time. I’m not eating anything either of you give me.” Kevin pushed the words through clenched teeth, more for Richard’s benefit than Tucker’s. Casting an accusing glare at Richard, who was standing way too close to Tucker to suit him, he wondered just who he was most jealous of, Tucker or Richard? What the hell was wrong with him, damn it?</p><p>Richard regarded him calmly. “You need to eat. You’ll get sick if you don’t.”</p> <p>“Then I guess I’ll get sick.”</p><p>Richard got a stubborn look on his face, and for just a moment, he reminded Kevin of somebody, but he couldn’t put his finger on it. “You’ll eat or I’ll make you eat. Suit yourself.”</p><p>“Fuck you,” Kevin said and raised a fist to smash it into that arrogant mouth. “I’d like to see you try.”</p><p>“Oh, would you? Go ahead, take your best shot.” Richard stepped forward, seeming ready to take him on, but before they could clash, Tucker was between them, pushing back on Richard’s chest.</p><p>“Please stop,” he said, looking up at Richard. He spoke over his shoulder to Kevin. “I told you I wouldn’t drug you, and I won’t. Damn, chill out.”</p><p>“Chill out? You invited me to come here, and this guy drugs me with a hypodermic needle and cuffs me naked to a bed. Not exactly chill inspiring.”</p><p>Richard growled at him, low in his chest, but Kevin refused to back down. Kevin grabbed Tucker, pushing him aside and squared off to the big man opposite him. Kevin drew back his fist again. “Go ahead, asshole. Do what you need to do.”</p><p>“Richard, stand down.” A commanding voice from the open doorway made them all whip their heads around to see Gavin. He strode forward and gently put Tucker behind him before turning to Kevin. “No one will drug you again, Kevin, and you need to eat, though I understand how you must feel. Would you feel better if Tucker tasted everything for you and let you watch him? He can do that for you if you like. We don’t have to resort to drugging your food. You should realize that by now. If we wanted to drug you, we’d just do it, like we did before.”</p> <p>“Whatever,” Kevin said tiredly, flopping down on the side of the bed. He felt stupid for making such a big deal about it. He didn’t really think the food would be drugged, and he actually did kind of trust Tucker not to hurt him willingly. It was Richard, really. Everything about the damn man set his teeth on edge. He was angry at himself for noticing Richard’s scent as he walked in again, too, a woodsy, subtle cologne mixed with a very male odor. It had assaulted his nose the second he came through the door and he’d had to shift his feet a little to hide his sudden erection. Damn the man. How could he possibly be attracted to him? Besides, Tucker had been about to tell him something when he walked in. Maybe something that would help him figure out how to get out of this mess.</p><p>Richard shoved his hands in his pockets and stared moodily at him. “I’ll go then, since I just upset him.” He got to the door and turned, glaring back at Kevin. “I don’t think it does any good to coddle him, though. He needs to learn some manners. Tell him what to do, and I’ll make sure he does it.”</p><p>As he left, Kevin muttered, “Yeah, like hell you will. Fuck you,” mostly under his breath, but Gavin heard him. He frowned a bit, but didn’t say anything, just folded his arms over his chest and regarded Kevin quietly.</p><p>“Well, I’ll go get that tray,” Tucker said, clearing his throat. “Gavin?”</p><p>“I’ll stay here with Detective Bryson until you get back. I’d like to have a word with him.”</p><p>Tucker nodded and cast Kevin an anxious glance as he left. Kevin turned to Gavin belligerently. “What the fuck now?”</p><p>“I know you’re angry, but you came looking for us, remember? We didn’t come and drag you up here.”</p><p>“Like you did with Tucker?”</p><p>Gavin made a noise of impatience. “Surely you know Tucker well enough to know he wouldn’t have stood for that. And if I had tried to just overpower him and bring him here against his will, do you really think he’d have gone through a commitment ceremony with me?”</p><p>Kevin shrugged. “You played mind games with him. Coerced him somehow, I don’t know.”</p><p>Shaking his head, Gavin sighed. “You know better than that. No, I convinced him to stay because I love him, and he loves me. Even after he knew exactly what I am, and what he is too.”</p><p>“What you are? What the hell does that mean? More mysteries, I guess.”</p><p>“Kevin, this is my home, and the people you saw downstairs are all part of my...family. We call it a pack.”</p><p>“A pack?” Kevin said blankly. “Like wolves?”</p><p>“Yes, exactly like wolves,” he said eagerly, his dark eyes lighting up. “Wolves feel more comfortable together in a close family unit. Wolves have rankings within the pack. Their leader is the alpha.” He regarded Kevin steadily, maybe checking for his reaction to this drivel. Kevin tried to keep his face blank. He was finally getting some information, no matter how crazy, and he wanted to learn everything he could.</p><p>“I’m the alpha of this pack, Kevin. Richard is my beta, or my second in command.”</p><p>“Okay,” Kevin said slowly. “And what does that make Tucker?”</p><p>“Tucker is my mate. Tucker is related to our pack too, even though his grandparents took him from us when he was only a baby. When we found him again, and explained things to him, he agreed to come here with us and meet everyone, including his father, who’d been searching for him for years. Of course, I wanted him to stay, and I tried my best to convince him. His father did too. In the end, he made his decision, and I think I can safely say he doesn’t regret it.”</p><p>“And if he’d decided not to stay? Would you have taken away his clothes and cuffed him to a bed like you did me?”</p><p>“Tucker’s situation was different, and I’m not sure what would have happened if he’d decided he didn’t want to stay once he’d seen the compound and knew...all he knew about us. I guess I’m only just realizing what a chance I took with him. I told him before he came that he could leave here if he didn’t want to stay, but I know now I wasn’t telling him the complete truth of the matter. I let my own emotions cloud my judgment. I would have let him go, because I wouldn’t have broken my promise to him, but the others wouldn’t have felt the same way and might have gone after him. No, I took a terrible risk with him, and I’m so relieved it turned out for the best. I’m afraid my luck has run out though, with you, Kevin.”</p><p>Kevin felt an icicle of fear spear down his spine. He shifted uncomfortably. “Your luck or mine?”</p><p>Gavin glanced up, startled. “No, I didn’t mean it that way. We’d never hurt you, Kevin, any more than we already have. I promise you. What I meant was, we can’t just let you leave. You’ve been a good friend to Tucker over the years, and I owe you honesty at least. You have to be assimilated into our pack, Kevin. I’m afraid that’s the best possible scenario for you now.”</p><p>We can’t let you leave. Those words terrified him, but he couldn’t let that show. He stood up and walked to the window, gazing out, trying to calm his nerves. A few people were walking around outside, looking purposeful, as if they were doing some nightly chore. Everything looked so fucking normal. Except that nothing was normal about any of this. Clenching his fists so hard he could feel his nails biting into his palms, he took a couple of steadying breaths. He had to keep his wits about him. Try to play along until he could find a way out. He knew Gavin was waiting for some kind of response. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Assimilated? What does that mean?” he asked sharply.</p><p>“It means you’ll be staying here with us, and you’ll become one of us. You’ll have to let your parents and friends know about it eventually, of course, once you’ve settled in a bit. You’ll have a good life here though, and I think you’ll be happy one day. I hope so anyway.”</p><p>Good life? As a prisoner?Was he serious? Before Kevin could even figure out a response to this, he heard a noise at the door. It was Tucker, holding Kevin’s dinner tray in his hands, and he looked furious. “So much for your promise to let me be with you when you explained things to him. Are all your promises lies then? Are any of you people even able to tell the truth?”</p> <p>Gavin crossed over to him and tried to take him in his arms, but Tucker pulled away in anger. He went over to put the tray down on the bed and stood beside Kevin protectively, his body vibrating with emotion. Gavin followed him and turned him to look at him.</p><p>“You misunderstood, Tucker. I haven’t exactly explained things yet. I was just telling him he has to stay with us. I thought maybe we should explain things a little at a time.”</p><p>Tucker rolled his eyes. “Because that will make any of this acceptable to him? Don’t be ridiculous.”</p><p>“Tucker, I’ve been speaking with Marco and Zack. Both of them were quite clear that they’d never go along with just letting him go back to Florida. There’s too much at stake. He’ll have to join the pack. I should have waited for you, but I saw an opportunity and...” He sighed. “And I’m sorry.” Again, he tried to take Tucker in his arms and again, Tucker shied away from him.</p><p>“No.” He turned back to Kevin and took his hand in his. “I’m sorry I got you into this. I know you came here out of concern for me, and I promise you I never meant for any of this to happen. I should have called you sooner. I should have reassured you more often.”</p> <p>Gavin tried again to put an arm around him and this time Tucker let him, even leaning against him a little. “You were sick for a long time, honey. It’s not your fault.”</p><p>“Sick? What was wrong with him?” Kevin asked, narrowing his eyes. “Did you do something to him?”</p><p>“No.” Both Tucker and Gavin spoke at the same time. Tucker put a hand on Gavin’s chest and turned to face Kevin. “Right after our ceremony, something happened. I was...attacked by some of the same killers who were operating in Florida. It’s hard to explain, but I will explain it all to you, Kevin. I promise. It’s just that it’s going to be hard for you to believe. It was for me at first. There’s just so much...I mean it goes against everything we ever believed about the world...about everything...” His voice trailed off, and he seemed completely at a loss.</p><p>Kevin looked back and forth between them. “Okay, if this is supposed to reassure me—”</p><p>Gavin spoke up. “We’re not trying to scare you, Kevin, but Tucker’s right. All of this will be difficult for you to believe. I’m no good at explaining this. When I told Tucker the first time, he passed out.”</p><p>“Okay, what exactly is about to happen? I demand to know the truth. I’m not understanding any of this, and you’re freaking me out.”</p> <p>Tucker opened his mouth to speak, but Gavin cut in. “There are only two ways to proceed from this point, Kevin. Neither is a great option, but it’s all we have. We thought about trying some drugs on you that would wipe away your memories, but that method is risky in that it’s unpredictable. It could wipe away all your memories. The risk is too great, in my opinion, and we don’t want to risk harming your mental faculties. The other thing we can do, and the thing we’ve decided on is to join you to someone in the pack. You’d become their mate, like their husband, and stay here with us. Once you’ve settled, you’d be free to come and go as you pleased, so long as your mate agreed. You’d be like Tucker, in a way. Fully a member of our pack.”</p><p>“Your pack? Mate someone? I can’t even fathom what you’re talking about.” He shuddered and gazed over at Tucker then down at himself. “Do I have it on me, Tucker? I feel like I got the crazy all over me, and I need to wash it off.”</p><p>Tucker allowed a surprised chuckle to slip out. Even Gavin smiled a little. “I know it sounds outrageous, Kevin. You don’t understand fully yet, and I can’t explain it more right now. It would be too much to for you to take in. The day after tomorrow’s the full moon. Maybe afterward...”</p><p>“What happens on the full moon? You talk like you’re all vampires or some shit.” He got a horrified look on his face. “Is that it? You think you’re vampires or creatures or something? Tucker, tell me you haven’t been sucked into this.”</p><p>Tucker shook his head. “I haven’t been sucked into anything, Kevin.” He turned back to Gavin. “He’ll never believe it until he sees it for himself.”</p><p>“See what? What are you talking about?”</p><p>They both gazed back at him, Tucker nervously twisting his hands and Gavin with a speculative expression. Gavin finally spoke. “Day after tomorrow, Kevin. Can you trust us just a little until then? We’ll take you to our ceremony. We have one each month on the night of the full moon. Everything will be explained to you then.”</p><p>“Hell no, I want to know now. I want to know what craziness you’ve made Tucker believe.”</p> <p>Gavin shook his head. “Later.” His voice held that hint of steely determination and command Kevin had heard earlier. He doubted he could budge him further.</p><p>“Tucker, you can visit more with Kevin in the morning, but for now I’d like you to come with me.” Gavin held out his hand.</p><p>Tucker took the hand, smiling at Kevin, probably trying to reassure him. It wasn’t working. “I’ll be back tomorrow morning, Kevin. Try to get some rest if you can. There are extra blankets in the closet if you need them.”</p><p>They left together and Kevin sat on the bed for a few minutes before he put the tray down on the floor. He was hungry, but he still couldn’t get the idea of being drugged completely out of his head. Tucker wouldn’t drug him deliberately, but it seemed to him that Tucker wasn’t in charge of much of this. He got up and moved restlessly to the window. There was a steel mesh screen bolted to the window. So much for trying that as a way out of the room. Gazing across the yard, he saw that the outside lights were still on, lighting up the grounds of the complex. The woods outside the light seemed so dark and thick. He was reminded of the Robert Frost poem—</p><p>The woods are lovely, dark, and deep,</p><p>But I have promises to keep,</p><p>And miles to go before I sleep...</p><p>Exhausted, he rested his head against the cold glass, and tears stung his eyes. What the hell had he gotten himself into? Would he ever be able to go home?</p><p>A brief knock on the door made him turn to see Richard coming in with a small tray. He dashed the moisture from his eyes, but he thought Richard noticed him doing it. He stood by the door and looked meaningfully at the still full dinner tray on the floor. “I was afraid of that. Stubborn. Pigheaded...” He came farther into the room and held out the smaller tray toward Kevin. On it was an apple, a banana, several unopened packets of crackers and a wrapped piece of soft cheese, along with a canned cola. “Here, you have to eat. I figured maybe you’d know this was all safe.”</p><p>Kevin took the tray and couldn’t resist a brief glance up into those dark eyes. “Thanks. There. Is that any improvement in my ‘manners’?” He smiled a little when he saw the blush begin on the big man’s cheeks.</p><p>“Sorry about that. I lost my temper, but you don’t need to get sick or not sleep well because you’re hungry. You can carry this defiance shit too far.”</p><p>Kevin took a bite of the apple. “Well...thanks.”</p><p>Richard nodded and turned to leave. When he got to the door, he turned. “I’ll come back in the morning. I usually take an early morning walk. I’d like you to go with me. You need to see things are not as bad here as you’re thinking, and it’ll get you out of here for a little while.”</p><p>“Whatever,” Kevin replied.</p><p>He frowned and went out, but just before he closed the door, he leaned back in. “Goodnight, Kevin.” The door closed gently behind him and Kevin heard the door locks snick to. Locked in, of course. He popped the lid on the can of soda and took a long sip. Well, it had been an interesting trip so far, to say the least. Maybe even life changing. He couldn’t wait to see what happened next, except for the cold chill he got every time he thought about the word assimilated.</p><p>It was like something out of some science-fiction series. Some of his favorite Star Trek and Doctor Who episodes were the ones with the Borg and the Cybermen, who went around sucking the humanity from people, saying in their robotic voices, “You will be assimilated.”</p><p>That image almost brought a smile to his face. Almost. He took his tray over to the armchair by the window—also locked, of course—and chewed thoughtfully on his apple, staring out onto the compound. Just exactly what kind of craziness had he stumbled onto here? And what was in store for him the day after tomorrow on the night of the full moon?</p><p>Sunlight shone through his windows early the next morning, waking Kevin up. He stretched, then got up and wandered into the bathroom. He’d slept a lot better than he thought he would. All that adrenaline had exhausted him, he supposed. Staring at himself in the mirror over the sink, he decided he looked pretty rough. He was unshaven and badly in need of a shower. He turned the water on in the big tiled shower and used the toilet. Then he stepped under the hot stream and let the water just soak him for a while. It felt good running down his back and he stood under the spray for several minutes, using the shower gel already there to clean himself. He got out and dried off on fluffy, expensive-looking towels, then looked through the drawers in the vanity. There he found toothbrushes still in the wrappers, toothpaste and even a new razor. After making use of all of it, using shower gel to help soften his beard, he felt a hundred percent better. He heard someone come in the door, and he came out to see who it was. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Good, you’re up.” Richard said, standing near the door. He glanced down at the towel around Kevin’s hips. “If you’ll get dressed, I’ll take you down to breakfast.”</p><p>“Seriously? You mean you’re not going to handcuff me or blindfold me or anything?”</p><p>“I think I can handle you, Detective Bryson, just as you are. Are you interested, or should I bring you another tray?”</p> <p>“Oh no, I wouldn’t miss it for the world. I may not have that many more chances...as I’m about to be assimilated and all. Who knows when I’ll have a chance to go downstairs again?”</p><p>“Assimilated? Who used that word with you? Did Tucker tell you that?”</p><p>“No, Gavin did. After you left me with him last night, he told me that he’d considered wiping out all my memories, but graciously decided instead to let me join your uh...pack. Oh, and find me a mate too.” Though he was proud of his flippant tone, he could feel his knees start to tremble. To cover, he sat down on the side of the bed and gripped them hard, looking up at Richard defiantly. “What...doesn’t he tell you everything?”</p><p>“I haven’t seen him or Tucker since last night.”</p><p>“Oh.” He meant to give a bitter little laugh, and was horrified that it came out almost a sob. He dropped his eyes to the floor, embarrassed to be showing emotion in front of any of his captors. A warm hand landed on his shoulder and Tucker tried to shrug him off. He didn’t want pity from any of them, especially Richard. The hand only tightened.</p> <p>“I’m sorry about all this, Kevin. I wish you’d never come here.”</p><p>“Yeah, well, that makes two of us.”</p><p>Richard sat down beside him, his thigh brushing up against Kevin’s and lighting a fire in his groin. Damn, why couldn’t he control his reactions to this man? He put his hands in his lap to hide the way the towel was beginning to tent outward. “I’m okay. I’m not freaking out. Much.”</p><p>Richard sat quietly, not saying anything for a few minutes, just letting him get control of his emotions again. Richard cleared his throat. “Why don’t you get dressed in what you were wearing last night and I’ll take you down to breakfast? Things always seem better after coffee.”</p><p>Kevin snorted. “There’s not enough coffee in the world for any of this to seem better.” He got up and grabbed the clothes Tucker brought him from the dresser. “I guess this will have to do. No shoes, though.” He turned to head toward the bathroom to get dressed in private. Even though Richard had already seen him naked, he had some standards. Not many apparently, considering how easily he’d already given in to Richard, but some.</p><p>Before Richard could reply, a knock came on the door and Tucker entered, carrying an armful of clothes. He looked surprised to see Richard sitting on the side of the bed. “Oh, hi...um...Richard. I brought Bryson some more clothes.” He turned to him and held them out. “I found someone who was about your size, and he loaned me these jeans and this shirt. I could only find flip flops for your feet, though.”</p> <p>“That works, thanks.” Taking them, he ducked into the bathroom and quickly dressed. The jeans were tight, but the right length. The shirt was a button up and he left it untucked. No underwear, but he wasn’t sure about wearing anybody else’s anyway. He could hear Tucker and Richard talking in soft tones through the door, but when he put his ear to it, the voices were still garbled. He recognized his name, but little else. He opened the door and stepped out and saw Richard’s eyes flicker over him briefly before he dropped his gaze.</p><p>“I’m coming to breakfast with you, if that’s okay,” Tucker said brightly. He came over and grabbed Kevin’s hand. “C’mon, Bryson, I’m starving, and the food is really good here.”</p><p>“Don’t call him by his last name. His name is Kevin.”</p><p>Both Kevin and Tucker looked at Richard in surprise, and he shrugged. “It’s the name his parents gave him. They probably wanted him to be known by that instead of his last name. Tucker.”</p><p>Tucker actually laughed and blushed a little as Kevin looked back and forth between them. What the hell was the relationship there, and why did he resent their closeness like he did?</p><p>He allowed himself to be tugged along with nothing more said, and the three of them left the room and headed down the stairs. Again, as soon as he came into view, people in the common area grew quieter, and a few of the big ones said something to their smaller companions, who then got up and left the room. Gavin was eating breakfast at one of the tables on the side of the room, and they headed there. He smiled up at them when they came closer.</p><p>“Sit down and have some breakfast. How are you this morning, Kevin?”</p><p>Kevin shrugged, unwilling to pretend. “How should I be? I’m ready for you to give me back my things and my car and let me get the hell out of here.”</p> <p>Gavin kept chewing and only nodded. He looked up and caught the eye of a young girl standing nearby with a coffee pot. “Emily, can you bring our guest some breakfast please? You like bacon and eggs, don’t you, Kevin?”</p><p>Kevin only stared at him, but he kept talking as if he really were just a guest here. “Richard, I need to talk to you about tomorrow night’s ceremony later on, when you get a chance.”</p><p>Richard nodded, shifting to the side so the girl Gavin called Emily could pour him a cup of coffee. He handed her Kevin’s cup too, since she seemed afraid to come close to his side of the table, darting nervous glances over at him and back over at a large, dark haired man who sat at the table next to them. His mouth was turned down in a frown, and he scowled at Kevin when he caught his eye.</p><p>Tucker leaned over and whispered to him. “That’s Christian and he’s an ass. Don’t pay any attention to him. He’s part of Gavin’s personal guard, but he’s really hanging around here to make sure you don’t grab Emily up and take off with her.” Tucker laughed. “As if, right?” He shook out his napkin and gave Christian a dirty look. “Ignore him.”</p><p>“Everything okay, baby?” Gavin asked.</p><p>Tucker looked up with a smile. “Sure, except for Christian staring a hole in us. Surely you can find him something to do.”</p><p>Gavin looked over at Christian and gave him a stern nod, and Christian stood up quickly and left, casting a warning look over his shoulder at Kevin. It would have been funny anywhere else, but not here. Not when his circumstances were so uncertain. Kevin was embarrassed to see his hand tremble a little when he raised his coffee mug.</p><p>Richard must have noticed too, because he felt his warm hand grip his thigh under the table and give him a gentle squeeze. “Kevin doesn’t have to worry about Christian.” His hand moved up his thigh to rest against Kevin’s groin.</p><p>Kevin was so surprised he almost choked on a sip of coffee. Richard gave him an amused glance, but kept his hand where it was.</p><p>Gavin took a sip of his own coffee and shook his head. “Sorry, Kevin. That wasn’t anything personal. He’s newly married to Emily, and he’s a bit possessive.”</p><p>Tucker scoffed. “A bit? I’m surprised he lets her out of their room long enough to do her job.”</p><p>Kevin looked over at him wide-eyed, but Richard squeezed him again. If Richard kept this up, Kevin was going to embarrass himself. “Tucker’s joking,” he said. “We don’t see many strangers actually here inside the lodge, and it’s got folks nervous, that’s all.”</p><p>Emily came in, balancing three plates on her arms, and the next few minutes were taken up with sorting out breakfast. The food was good, and he ate it all, not even thinking about drugs any more. Gavin had been right. If they wanted to drug him, they’d just do it. It wasn’t like they needed to trick him.</p><p>As they were finishing their coffee, a man approached the table. He was one of the big men so common there, and he had the look of the Cherokee Indians so common in the Smoky Mountains. He nodded to both Gavin and Richard and looked directly across the table at Kevin. His gaze swept over him before he spoke to Gavin. “This the one you were telling me about?”</p><p>Tucker stiffened next to him, but Gavin nodded. “Yes, but we can talk about it later, Russell. Not now.”</p><p>“Sure,” he said, giving Kevin one last appreciative glance before moving away. Tucker’s mouth fell open.</p><p>“Russell? You can’t be serious.”</p><p>“I said we’d discuss it later, Tucker.”</p><p>“Well, I’d like to discuss it right now. Not Russell. I forbid it.”</p><p>“Oh you do, huh? Well, that’s not really your decision to make, Tucker. And what’s wrong with Russell anyway? He’s a nice guy, a good gamma. There’s absolutely nothing wrong with him.”</p><p>Tucker’s voice had dropped down to a deeper timbre, mimicking Russell. “‘Is this the one you were talking about?’ Oh yeah, such finesse and charm. Nope, no fucking way.”</p><p>“We don’t exactly have an unlimited choice, Tucker, and please lower your voice. Russell’s mate was killed in a Hunter raid a few years ago.”</p><p>“Wait a minute...” Kevin said in a choked voice. “This is about me? Are you thinking that me and that guy...”</p><p>Richard scooted his chair back from the table and stood up abruptly, taking hold of Kevin’s arm. “Kevin and I are going for a walk,” he said, tugging Kevin from the chair. We’ll be back in a while, and I’ll come find you, Gavin.”</p><p>Kevin stumbled to his feet and allowed Richard to lead him from the room and out onto the grounds. It was a sunny morning, with only a slight chill in the air, so Kevin was glad of the long sleeves on his shirt. He was feeling distinctly chilled, and he didn’t think it came only from the air temperature.</p><p>“Tell me he’s not planning on having that guy fuck me.”</p><p>Richard looked at him with shock. “God, the way you talk.”</p><p>“Well, is he?”</p><p>“Gavin is looking for a suitable mate for you, yes. But no one will force you. We’ll find someone you can agree to.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“This whole thing is crazy.” Kevin stopped walking down the path they were on that led into the woods, shoving his hands down into his pockets. “I’ve got to get out of here, before I’m as nutty as the rest of you.”</p><p>Richard turned to stare down at him. “Damn it, don’t you listen? We’ve been over this. We can’t let you leave.”</p><p>“Yeah? Well, what if I took off right now? Just took off running and got away from you?”</p> <p>“Not going to happen.”</p><p>“Really?” Kevin suddenly shoved Richard hard, surprising him and making him stumble back off the narrow pathway into the bushes. Kevin leaped off the other side, plowing through some thick bushes to get to a more open area in the woods. He took off as fast as he could, losing the flip flops after about three or four steps, but forging on despite the beating his bare feet were taking, dodging around trees and rocks, hearing Richard crashing through the brush behind him. Suddenly, strong arms lifted him off his feet and held on tight, crushing his body back into a solid, large form. He struggled wildly, kicking back against Richard’s legs, pulling fiercely against the arms around his waist. He fought to escape, but his struggles were useless. He couldn’t break Richard’s grip around his waist, no matter how hard he tried. Breathing hard, he cursed and went limp, letting his head fall back against Richard’s chest. Only then did Richard let him go to sink down to the ground and sat down beside him while he caught his breath.</p><p>After a few minutes, Kevin glanced up at him, a little out of breath. “Not my best escape attempt ever,” he managed.</p><p>Richard glared at him, but his lips twisted up a little. “Had a lot of escape attempts, have you?”</p><p>“Not really,” he said, with a shrug and a short bark of laughter. “That one played out better in my head than in actual execution, though.”</p> <p>“Damn it, Kevin, you have to accept this. You can be happy here if you just let yourself. We’ll find someone you’ll like. He can train you to be a good mate.”</p><p>“Train me? Like a dog? Fuck you, Richard.”</p><p>“You can cuss me all you want. It’s not going to change a thing. You’ll still be mated to a member of our pack.”</p><p>Kevin snorted. “I don’t want to mate with anybody! You’re talking about sex, right? Forget that.”</p><p>“You didn’t seem to mind it so much last night,” Richard said quietly.</p><p>“Damn you. Get this through your head. I’m not fucking mating with anybody. I don’t want that!”</p> <p>“Oh, yeah? Even with me?”</p><p>The question seemed to surprise both of them. Kevin caught his breath with a hitch as he stared at Richard, almost nose to nose. The tension between them was thick, and the air felt charged. Kevin could hear the faint sound of voices way far in the distance, but the woods where they sat were dense and solid. They could almost have been the last two people on earth. He felt his cock strain against the zipper of his jeans, and looked down to see the front of Richard’s pants bulging too. He suddenly wanted to see Richard’s cock very badly. He was so big and muscular. Would his dick be on the same scale? What was wrong with him that he was so attracted to this guy? How could he want him so much?</p><p>“Answer me, Kevin. Would you want to mate with me?”</p><p>“What?” He started at the unexpected question, coming a little too close to what he was thinking. “I-I thought we sort of already did a little of that.”</p><p>“Not yet. I’m talking about something more, Kevin. A commitment. If you became my mate, I’d keep you with me forever. Make no mistake.” He leaned over and put his lips next to Kevin’s ear. “I think you want someone to make you feel things you’ve never felt before. I could do that for you. I could take you in hand, make you want to be on your knees with my cock buried deep inside you.”</p><p>His breath caught when Richard began stroking him through his pants. They both watched as he unzipped him and pulled Kevin’s cock out. It sprang to life in Richard’s hand, growing thicker and longer. “Then I could have this whenever I wanted it, and as often as I wanted it.”</p><p>“Like hell.” He pushed on Richard’s chest as hard as he could, but the man never budged and never stopped stroking.</p><p>“Tell me to stop, then, baby. Tell me to leave you alone. I will, if you ask. If you tell me you don’t want this...”</p> <p>“I’m not your baby. Stop calling me that.”</p><p>“I think you are. And before I finish with you, I think you’re going to tell me you are.”</p><p>Chapter Four</p><p>Richard looked down at his prey and his wolf leaped inside him. From the moment he walked in on Kevin and saw him with a towel wrapped low around his hips, water droplets still clinging to his chest from the shower, he’d wanted him in a primal, powerful way that had nothing to do with the way a good beta acted with someone like Kevin, someone who wasn’t yet a member of the pack, and who was supposed to mate with another wolf. The thought of anyone else’s hands on him made him furious, though. He’d been relieved when Tucker came in that morning, bringing him clothes, but then Kevin had put on those damn tight jeans. He looked so delicious it made Richard want to gather him up in his arms and take off somewhere with him. Whatever cologne the man was using still clung to him too. It was maddening, and he had to breathe through his mouth to keep his erection at bay.</p><p>Wolf shifters in the southern Blue Ridge were the ultimate predators, outside of wildcats and bears, but even the bears took a backseat to the huge beasts of the Dark Hollows pack. Something ancient and primal took over in Richard’s brain as he watched his prey running from him, and now after the short chase through the woods, his wolf was clamoring to stake a claim on his mate. This man was his, damn it, and it had been all he could do to sit passively when Russell had come to the table at breakfast and looked Kevin over with lust written on his features.</p><p>He moved his hand up under Kevin’s shirt. His skin was warm and soft under his fingers, and there was a slight trembling. Was he frightened, staring up at Richard with those wide eyes, or was he excited? Kevin’s groin was still bulging in his pants, his hard cock straining for freedom. Richard rubbed his palm across it and listened with pleasure to Kevin’s little whimper.</p><p>“Don’t be scared. If you want me to stop, I will. But I don’t think that’s what you want, is it?”</p><p>Slowly, Kevin shook his head. Then he leaned over to kiss Richard. His lips parted, allowing Richard to slip his tongue inside to explore Kevin’s mouth. He heard Kevin’s soft moans of pleasure, and it made him wild to have him underneath him. He wanted all of him. He wanted to put his scent and his mark on him so everyone would know whom he belonged to. He released him for a moment and pulled his hands away to give him his instructions. “Strip. Get those damn jeans off. Now.”</p><p>Kevin scrambled to his feet, his hands going to his fly. In seconds he had them off and began on his shirt, not even bothering to unbutton it, but just pulling it over his head and throwing it on the ground beside his pants. He was breathing hard as he stood there, letting Richard look his fill as he skimmed off his own pants, but kept his underwear. Kevin didn’t know about his knot, and it wasn’t yet time for him to find out.</p><p>God, he was beautiful. Richard had seen his cock before, of course, but now he had time to truly admire him. His body was lean, yet well-defined. His pubic hair was as blond as the hair on his head, and his cock was thick. Not as long as Richard’s, but very nice. Perfect, really. It was sticking out from his body, dark red and fully erect. A glistening drop of pre-cum was poised on the tip and Richard fell to one knee in front of Kevin to catch it with his tongue.</p><p>Kevin’s knees buckled, and he might have fallen if not for Richard’s hand on his hip, steadying him. He knelt in front of Kevin, looked up at him with a grin and swallowed him down in one smooth motion. Kevin’s whole body convulsed and he made a sweet little sound like a moan. Richard licked slowly up the length of his shaft, following the pulsing vein to the head. He played with that for a few seconds, dipping his tongue into the slit and then sucking hard at the entire head while he fondled his balls.</p><p>“Wait, I’m going to come!”</p><p>Richard pulled his head away. “No you won’t. Not yet.” He pulled him down beside him and onto his stomach. Kevin squirmed as Richard explored his rounded ass, first kissing each delectable ass cheek and then running his tongue down his crease. Kevin was pushing his stiff cock against the ground below him, obviously trying to get some relief.</p><p>“Oh, no, you don’t,” Richard said. “You won’t come until I tell you.” Getting up on his knees behind him, Richard pulled Kevin up so that he was sitting on his lap. He was careful to keep Kevin’s gaze to the front so he couldn’t get a glimpse of his cock. Like all the wolves, he was well-endowed, but he also had an extra ring of flesh around the base of his penis that humans didn’t have. Used during the first mating, the ring swelled to lock the wolf together with his mate for over an hour, while the gland secreted chemicals to complete the mating. Wolves called it their knot, and it wouldn’t do for Kevin to see his at this point.</p><p>He took Kevin in his hand and pumped him. Kevin gasped out loud, and Richard laughed softly in his ear. Still pumping his dick, he murmured to him. “Now, I believe you were about to tell me whose baby you are.”</p><p>Kevin moaned and shook his head, squirming under Richard’s hand. “Stubborn boy...all you have to do is tell me. C’mon, sweet boy, don’t be defiant.”</p><p>Moving his hand more quickly, he listened to his boy’s moans with pleasure. He put him back on his knees and held him there, pushing his head down to lie flat on the ground, his ass in the air. He put his fingers on either side of his ass cheeks and pulled his crease open to reveal his pink hole. He thrust his tongue inside it, holding Kevin firmly in place when he tried to pull away with a muffled scream. Burying his face in Kevin’s ass, he laved it with his tongue until Kevin was practically squealing. Pre-cum was dripping from Kevin’s cock, puddling on the ground beneath him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tell me...”</p><p>“No!”</p><p>Richard buried his face again and worked Kevin’s hole with his tongue until the boy was incoherent and quivering.</p><p>“Okay! I-I’m your baby, whatever. God, please!”</p><p>“That’s right, beg me a little more. Beg me to take care of my baby.”</p><p>“Please, please, Richard. Take care of me.”</p><p>“Very sweet. Okay, sweet boy, since you asked so nicely...”</p><p>Richard poised his cock at Kevin’s entrance. Holding him around the waist with one hand, with his free hand he painted the little pink hole with the white fluid seeping copiously from his own cock. Wolves were immune from human diseases, so he had no qualms at taking him just as he was. His wolf was clamoring at him to give him the mating bite and his knot, but he pushed the urge down, unable to deny himself the pleasure of taking his boy, but not ready to give him the mating bite yet. That time was coming. He was sure of it now. No one else would be allowed to have his prize, and he would have fought the alpha himself if it had been necessary.</p><p>But he didn’t want to hurt his smaller mate, and he needed a bed and some proper lubricant before he gave him his knot. Besides, he wanted to ask Kevin properly to be his mate, and not while he was in the throes of passion. He would wait. In the meantime, though, there was nothing to stop him from pleasuring both of them. He ran his hands over the globes of Kevin’s ass and stroked down the crease gently, parting it with the tips of his fingers so he could lick it again. Kevin literally screamed, and Richard had to take a moment to put a hand over his mouth. He leaned over his back and soothed him. “Hush now. We’ll have half the compound down here.” He rubbed and stroked his back. “Are you okay?”</p><p>Kevin groaned and nodded, too far gone to speak, and Richard started a litany of softly spoken words close to his ear. “Is this what you want, sweet boy? Is this what you need? I’m going to take care of you. You need me to take care of you. Tell me how much you want it. Tell me, baby.”</p><p>So far gone he was almost delirious with lust, Kevin could only nod his head and whimper, thrusting his ass up for more attention. This was all the answer Richard needed, but he wanted to hear the words. He needed to hear him admit it. He thrust his cock against him, letting him feel it so close and ready to penetrate him. “Ask me, sweet boy.”</p><p>“P-please,” he finally managed, twisting his head back to look at him. “Fuck me, please.”</p><p>Richard pressed forward, his copious pre-cum lubricating Kevin, and he felt Kevin’s tight ring pop as he entered him. He hesitated for just a moment, allowing him to adjust to his size before he thrust in all the way up to his knot in one smooth, hard motion. Kevin cried out, but didn’t resist the invasion. He was breathing rapidly, but he was still with him, still caught up in passion. Richard began to fuck him in earnest, pulling out almost to the tip of his cock and then sliding back in again. It was a slow, measured pace that made Kevin hum with pleasure. He pulled him back up on his lap and impaled him there, using his strength to pull him up and then push him back down on his cock over and over again, picking up the pace until he was fucking him rapidly, really thrusting into him. It took only the slightest touch of Richard’s hand, sliding over his erection to bring Kevin to his climax. He put back his head and came hard, white streams of cum shooting out in front of him. Seeing that, Richard felt his own orgasm clawing at him as he strained against his mate. He pulled out to shoot his cum over Kevin’s ass and the back of his thighs. He gathered some of his cum on his fingers and smeared it over Kevin’s chest as well. He was marking his territory, and he defied anyone to come around Kevin now that his scent was on him.</p><p>Lowering him to the ground, he pulled up his pants, grimacing at the stickiness. He would have to take another shower when he got back to the lodge. He looked down at his mate and smiled. He was lying on his side, seemingly completely spent, Richard’s cum smeared all over him. He would have been content to let him lie there and rest before he took him again, but he could hear someone approaching from the direction of the lodge. He lifted his nose to sniff. It was more than one gamma, coming toward them fast. Richard leaned down and shook Kevin, rousing him. “Get dressed, baby. We’re about to have company.”</p><p>He stood protectively in front of Kevin as the wolf-shifters approached, aware that Kevin was scrambling into his pants behind him. Before he had a chance to put back on his shirt, four gammas burst into the clearing. They stumbled to a halt when they saw the big beta glaring at them belligerently. Richard saw that it was Christian, along with Todd, Benjamin and Marissa, all members of Gavin’s personal guard. “We heard a scream.”</p><p>“It’s under control. Don’t concern yourselves.”</p><p>“But...”</p><p>“This man is under my supervision. Is there a problem?”</p><p>“Oh, no, no, sir. Sorry, sir. Didn’t mean to interrupt.” The four gammas practically bowed their way back out of the clearing, and Richard scowled after them. Those four had been pissing him off since Tucker had first arrived, and he was going to speak to Gavin about them. First he had to take care of Kevin. Turning back to him, he saw him standing, his face a dull red, staring at the ground.</p><p>“Are you all right?”</p><p>Kevin nodded, glancing up at him with an unreadable look. Richard figured he was embarrassed by the group coming up on them and seeing them together. He may as well get used to it, though, since he belonged to Richard from now on.</p><p>“Let’s go back and find those so-called shoes Tucker brought you. I’ll have to take you into town after we’re mated and buy you some boots, and some new clothes.”</p> <p>Kevin looked up at him strangely, but only nodded, and Richard felt like he’d made some progress with the stubborn man. At least he wasn’t cussing and fighting everything he said, anyway. Taking him by the hand, he led him back toward the original trail they’d been walking on. Tomorrow night, after the ceremony, he’d explain everything to him before taking the final step. That is, if he was still in any shape to, after witnessing the shifting of the whole pack. It could be a frightening thing, he’d been told, but other pets had witnessed it and come through okay. Kevin was strong and he’d have Tucker there to help him. Then when he came back from the pack run under the moonlight, he’d be able to mate with him properly. Everything was going to work out just fine.</p><p>“What’s the matter with you? You’ve been acting strangely since you came back from your walk with Richard? Did he say or do anything to upset you?” Kevin and Tucker were in Kevin’s room after lunch. Kevin had talked Tucker into sitting with him in his room so he could talk to him.</p><p>Kevin felt a slow burn come up his neck. “I don’t want to talk about Richard.”</p><p>“Okay,” Tucker said. “But if you need me to talk to him, I will.”</p><p>Kevin slanted him a look. “What is there between you two anyway? Tell me the truth, Tucker. Are you fucking him?”</p><p>“God no!” Tucker jumped to his feet in outrage. “How could you ask me something like that?”</p><p>“Well, don’t get pissed. I’ve seen the way he looks at you. You’re important to him, that’s all, and I-I need to know how he feels.”</p><p>Tucker cocked his head. “You need to know? Why? What’s happened between you?”</p><p>Kevin shrugged and Tucker said, “Oh...” Then, “Oh. My. God.” His eyes were wide as he gripped Kevin’s arm. “Are you two...”</p><p>Shrugging again, Kevin pulled away, only to be shocked when Tucker threw both arms around his shoulders. “Damn!” he said again. “But this is fantastic.”</p><p>“I don’t know how fantastic it is. He’s an arrogant prick, a goddamn toppy bastard. God knows why I haven’t knocked his head off by now. He does things to me, Tucker. Things nobody ever did before, and I can’t help myself.”</p><p>“Um, okay, I don’t think I want to hear anymore. Not that I’m not happy for you both. I am. I can’t tell you how much, but no details, okay?”</p><p>“Huh? Since when? When we were back home you liked a play by play.”</p><p>“Yeah, well, we’re definitely not in Florida anymore. Have you agreed to mate with him?”</p><p>“No. Yes. Hell, I don’t know anymore. When I’m with him I know he’s exactly what I want, even though I never knew I wanted it. I’ve never been much for the D/s stuff, you know that. I’m still not, except...when I’m with Richard, he makes me want it. I want to please him and make him proud. I want to fulfill his needs, and I know that only I can do that. No one else knows him or cares about him like I do. No one else will put his pleasure first, even above their own. But I can’t walk away from my whole life, Tucker. What about my job? My parents? I don’t understand how you did it, though the thought of leaving Richard—never seeing him again makes me physically ill. I don’t think I can do it.” He ran his hands through his hair. “Listen to me. I’m talking as if I’m actually considering this thing. The longer I’m here the more my brains are turning into mush!”</p><p>“Oh, come off it, Bryson. Is your life really so great in Florida? You’re not seeing anyone, and your parents have moved away. You work with a bunch of assholes. It’s not like you love your job so much anymore. Would it be so unthinkable to move here and start a new life with Richard?”</p><p>“Doing what? Sitting around and being his little pet? His fucking little sex toy?”</p><p>“Is that what you think I am?” Tucker frowned at him, bristling. “What you two do together behind closed doors is your business, but no one is asking you to be a toy. Plenty of us here have full lives and even careers now. I was even thinking about starting up my own private detective agency in town. I may have already done it by now if I hadn’t been hurt. You could do it with me, if you wanted to. It won’t be the same, of course. I’ll probably be doing a lot of pre-divorce work, like following cheating spouses around. Boring stuff, but maybe some missing person work, too. Who knows? Whatever I decide, it’s a choice I made, and I’ll live with it. There are no perfect lives, Bryson. We all make compromises for the people we love.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There are so many unanswered questions. I have to know what all of this is about, Tucker. Are you finally ready to tell me what happened in Panama City? Were any of these people the killers? I have to know. Did Richard have anything to do with those murders?”</p><p>Kevin sat across from Tucker in his room, watching Tucker’s mouth drop open at the question. “No, I’ve told you. Why would you think Richard or any of the pack had anything to do with the murders?”</p><p>“A lot of reasons. Gavin was seen lurking around at least two of the crime scenes, and the whole holding you in his hotel room thing down in Florida when you first met. That’s what you told me then anyway. I don’t really know, and it’s driving me crazy.” Kevin slumped down into his chair. “You used to be able to tell me anything,” he said quietly, waiting Tucker out. He was playing on Tucker’s emotions, trying to guilt him into telling him more about what the hell was going on. He knew from his time as Tucker’s partner that Tucker had to think things through in his own time. Rushing him or pumping him with questions never worked well, so he waited for him to get ready to talk. Finally, he looked up into Tucker’s eyes, and took a deep breath. “Won’t you tell me, Tucker? The killer we were looking for in Panama City? Did Richard or Gavin or any of the others have anything to do with killing those guys?”</p> <p>Tucker leaned forward. “No. I swear to you they didn’t. I’ll try to explain, but you won’t believe me.”</p><p>“Try me.”</p><p>“Okay, here goes...you see, there was this group called the Hunters. They hated our pack and want to destroy us completely. They’d been kidnapping certain members of the family, the more vulnerable, weaker members, and shooting them up with a potentially lethal cocktail of drugs. Really crazy stuff. A mixture of methamphetamines, growth hormone, and God knows what all. It works with our body chemistry to make us...not ourselves. It makes us wild and puts us in a rage. Basically, it turns us into killers. That’s what was killing those people in Florida, Kevin, and Gavin and his men were there to try to stop it.”</p><p>“Why didn’t they come to the police then, and tell us what they knew? You can’t just withhold information in a murder investigation, Tucker. You know better than that.”</p><p>“I know, but at the time they didn’t know what was causing it. I mean, they’d seen the end results, of course, but they didn’t know who was behind it. They thought the Hunters had been eradicated. They had no idea that a new leader had taken over, one even crazier and more deadly than the first leader. Look, it’s complicated, but the bastard kidnapped me right after my ceremony with Gavin. Me and the mate of another alpha leader in a neighboring pack. Between us we managed to get away, but he almost got me, Kevin. I barely survived.”</p> <p>Kevin stared at him, unable to believe most of what he was hearing. “You know how this sounds, don’t you, Tuck? Alphas and hunters....you sound as crazy as the rest of the people around here. They really have converted you, haven’t they?”</p><p>“Oh shut up, Kevin!” Tucker jumped to his feet and leaned across the table. “This refrain of yours is beginning to get old to me too. You asked and I told you. I also warned you that you wouldn’t believe me. I’m tired of having to defend our way of life and who we are. You came to us, remember. If you can’t even believe me when I’m telling you the truth—”</p><p>“Okay, okay, settle down. Maybe if somebody told me what the hell was going on sometimes...but you have to admit this shit is hard to believe.” Kevin put up both hands in defense. “Sorry. I’m listening. If you say this happened, then I’ll believe you, no matter how crazy it sounds. So let me get this straight. These guys, these hunters, hate your family and want to destroy them. They thought that by kidnapping some of the family members and using drugs to turn them into killers, then...what? You lost me on that part.”</p><p>“We’re not sure,” Tucker shook his head. “It could have been to discredit us in the area. That’s what Gavin thinks. We have a huge family, spread out over Tennessee, Georgia and North Carolina. Not to mention our extended family and families of the um...people who are kind of adopted into our family. Like you will be.”</p><p>Kevin pressed his lips together and nodded shortly. “Me? That remains to be seen, but go ahead.”</p><p>“Well, that makes a huge network. We hear things that could be a threat to us from the people in that network. That’s how we knew you were in town, for example. So if the Hunters could spread fear and mistrust of those of us who live in the compound and even those who live in town, think of how that would undermine us. People would be less willing to protect us and tell us things. They could even go to the authorities and then...”</p> <p>“Then people like me would be getting assimilated all over the place. Or the villagers would come here in a mob with torches to burn you out, like in the Frankenstein movies?”</p><p>Tucker smiled. “Something like that. Anyway, that’s one of the theories we’re working with. The other is that the guy running the group is just bat-shit crazy. He says he’s the illegitimate son of the old leader, and he’s brilliant but fucked up, you know? So far he’s responsible for the confirmed deaths of at least two members of the pack, with more missing. Not to mention the people in Florida whose deaths he caused.”</p><p>Kevin nodded somberly. “So where is this guy?”</p><p>“We don’t know. He got away at the hospital the day we were rescued in all the confusion. We think he left the area, at least for a while, but no one is sure. That’s one reason why everyone is jumpy and Gavin has those body guards. Our pack has been doing that for a while now, since before I came, protecting our alpha, and the other packs are doing it now too since we know the Hunters might still be out there.”</p><p>“This place is like Fort Knox, with all the fences and alarms, steel mesh on the windows. I said that the first time I saw it. Why are you still so afraid?”</p><p>“We have over four hundred acres here and the North Carolina pack has even more. We can’t possibly defend the woods as well as we’d like, though we do have frequent patrols. Besides, there’s something going on here, Kevin, that I can’t quite put my finger on. I can feel it.”</p><p>Kevin nodded. He had a healthy respect for Tucker’s instincts. That weird sixth sense of his had saved both their butts on several occasions in the past.</p><p>“I’ve expressed my concerns to Gavin and to Richard, but they don’t take it seriously. There’s something about Gavin’s private guard...”</p> <p>“I saw them in action earlier. Bunch of punks. Who’s the Amazon?”</p><p>Tucker smiled briefly. “Marissa. She was none too happy about me showing up, I can assure you. She had Gavin picked out for herself. I think she hates me, though Gavin disagrees. Says she’s only being protective.”</p><p>“So Gavin is bi...”</p><p>“Yes. All of the wol...all of them are.”</p><p>“All of them? But that’s just weird, Tucker. How can they all be bi-sexual?”</p><p>“I don’t know; they just are.” Tucker began to look uncomfortable.</p><p>“More of the stuff you can’t tell me, huh?”</p><p>“I guess so. Look, Kevin, change the subject, okay? You’ll know more tomorrow night, after the ceremony.”</p><p>“So you keep saying. What’s so special about it anyway?”</p><p>Tucker smiled at him. “It’s the blue moon. And you’ll see for yourself why it’s so special.”</p><p>Chapter Five</p><p>It was late afternoon and Kevin sat on the sofa next to Tucker in the main hall waiting for the dinner service to begin. His head was back on the seat cushion, and he was staring up at the ceiling and thinking about Richard. Damn it, how had he allowed himself to become so fucking attracted to the man in such a short time? And what the hell was wrong with him that he would like the kind of treatment Richard had been doling out since the first time he’d been in the same room with him? The sex with Richard earlier had been just about damned perfect, though, there was no denying that. He’d never felt so fulfilled, so satisfied by a lover. It scared the shit out of him.</p><p>He couldn’t, wouldn’t, lose himself like Tucker had. He’d keep his wits about him and keep looking for a way to escape. This had to be Stockholm syndrome, where abducted victims begin to identify and even side with their captors. That had to be it. It was a common thing in hostage situations, probably some form of evolutionary survival mechanism. This had to be what was happening here. Surely knowing it was half the battle.</p><p>Now if he could only work on a way to steel himself against the attraction he felt for Richard, he might be able to survive this thing. He wouldn’t give into him so easily again. Richard actually had some nerve seducing him after the way he’d treated him from the very beginning.</p><p>Richard walked into the room then, and Kevin felt an immediate tug on his emotions seeing his handsome face. Richard hadn’t even seemed to notice him yet, so Kevin turned his attention back to a young man who had suddenly appeared in front of him, and was looking down at him curiously. He had no idea who the guy was, but he’d been staring at Kevin intently for a while now. He was one of the big ones, and up to now he’d been standing with a group of his buddies over by the huge fireplace as they’d also presumably been waiting for dinner to be served. Now the young man had moved closer and was saying something to Kevin, and he tried hard to drag his attention back.</p><p>“What? I’m sorry, what did you say to me?” he asked, gazing up at the man.</p><p>“I said, it’s nice to finally see you up close. I saw you when you came in the other night but you disappeared pretty fast.”</p><p>“Oh,” Kevin said, trying to pull his hand away from where the young man still had it tightly in his grip. “Yeah, well, nice to see you too.”</p><p>“You’re very nice-looking,” the young man said. “My name is Derek, by the way.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Uh, thanks?” A little unnerved at this direct approach, he looked over at Tucker for help, but Tucker was carrying on a conversation with someone on the other side of him.</p><p>“I understand you haven’t been spoken for yet...Maybe later this evening you’d have a cup of coffee with me?”</p><p>Kevin stared up at him as his mouth dropped open. Spoken for? Was he kidding? He was saved from having to answer that question when a warm hand dropped on his shoulder.</p> <p>“Do you need something, Derek?” Richard was standing right behind him, gripping him hard enough that Kevin thought he might be leaving the mark of his fingerprints. Kevin glanced up at Richard in irritation as Derek dropped his hand and took a quick backward step.</p><p>“No. No, sir, nothing at all. I was only saying hello to Kevin.”</p><p>“Very friendly of you. I appreciate your making him welcome, Derek. Thanks.”</p><p>The young man’s gaze traveled from Kevin back up to Richard and back down again, and his eyes changed. He gave a stiff little nod and backed away to rejoin his friends.</p><p>Kevin sat in stunned surprise. What the hell was that about? Had Richard just staked some kind of claim on him? He’d thanked the guy in a very proprietary way. I appreciate your making him welcome, Derek. Fuck.</p> <p>How in the hell had this happened in the span of two days? Richard had stormed into his life, turned him inside out and left him craving his touch. If the truth were told, he’d been sitting here pouting over the fact that Richard was nowhere to be seen, when he was probably talking with Gavin or doing whatever it was he did all day. Kevin was the one sitting here mooning over the guy like a love-sick idiot. He needed to put a stop to this and right damn now. And why was his cock so hard at just the sound of Richard’s voice and his hand on his shoulder? Damn it. This was getting out of hand.</p><p>He leaned forward to put his coffee mug on the table in front of him, dislodging Richard’s hand. Richard came around to stand in front of Kevin. “Why was Derek talking to you?”</p><p>“Who? Oh, that guy. Why don’t you ask him? Is talking not allowed for the prisoner? He said he thought I was nice-looking and wants to drink coffee.”</p><p>“He was holding your hand and staring at you like he was about to take you to his room. What did you say to him to cause a look like that?” Richard’s face was stern and cold, the red patches on his cheeks the only sign that he was angry.</p><p>“What did I... Are you kidding me? I was sitting here minding my own business when your boy over there came up and grabbed my hand, talking about me not being spoken for, or some shit.” Kevin raised an eyebrow. “Why? How does whatever I do have anything to do with you?”</p><p>Richard stared down at him, clearly furious. “Everything you do has to do with me. And don’t you forget it again.”</p> <p>He turned on his heel and walked away, leaving Kevin staring after him, angry and frustrated. His heart beat a rapid tattoo in his chest. Tucker leaned over and whispered to him. “What the heck was that about?”</p><p>“Damned if I know,” Kevin said, not bothering to hide his irritation. “Arrogant prick.”</p><p>Tucker drew back as if offended. “No, he isn’t. He’s probably only concerned about you. And you told me about your feelings for each other, so don’t try to deny them now. He’s probably a little jealous. Besides, Richard takes his job very seriously, and one of those jobs is the welfare of the people in his pack.”</p><p>“I’m not in his fucking pack, Tucker.”</p><p>“If he’s chosen you for his mate, you are. The most important member to him.” Tucker frowned and turned away.</p><p>Great, alienate the only friend I have here, that’s the ticket. Kevin dropped his head on the back cushion of the sofa again, hating feeling so lost and hating the idea that he’d put himself in this stupid situation in the first place. He realized he was beginning to care—too much—about what Richard thought, and that frightened him and pissed him off in equal measure. Richard’s presence in the same room made him want him more than he’d ever wanted anybody in his whole life. He had to put a stop to this and fast. Maybe if he played along, he could get them to let their guard down so he could escape.</p><p>He moved closer to Tucker and put a hand on his arm. “I’m sorry, Tucker. I know you like the guy. All this is getting on my nerves, I guess.”</p><p>Tucker patted his knee. “It’s okay. I understand. We’ll have dinner, and then I’ll walk up to your room with you. Maybe we can watch a movie or something. Or I could bring you a book? It might be a long evening.”</p> <p>“Yeah, I am pretty tired.”</p><p>Kevin wearily glanced around the room, looking for Richard. He was nowhere to be seen, and he felt a little pang in his chest. He felt like he had disappointed the man in some way and it was messing with his head. That had to be all it was. Hell, he had plenty of experience disappointing people. He’d been doing it all his life.</p><p>Kevin’s parents were wealthy, and his father had a thriving law practice. He made it clear that he fully expected Kevin to join the firm after college. College was, in fact, where the relationship with his parents had begun to unravel. First, his father had pushed him to join his old fraternity. The fact that they were the fraternity on campus with the reputation for hard drinking and even harder partying had certainly not put Kevin off too much. He was young, and liked to drink and have a good time with the best of them, but the fact that the fraternity brothers were also homophobic assholes had definitely not counted in their favor.</p><p>The boy who roomed across the hall from him in campus housing was a nice guy from a small town in south Florida. They had met the first day in their new dorms and had a few casual conversations when they saw each other in the following days. He also had a legacy from his father, and was being pushed to join the same fraternity, so they had that in common. The boy was a slight figure, very shy, a cello player, who wanted to major in music, but his jerk father was pushing him into a business career. At the first recruitment party for the fraternity, it was made clear to all of the potential pledges that although they could not deny a first invitation to the legatees, it was by no means a sure thing that person would be offered a bid. The brothers made that clear by pretty much aiming their remarks at Kevin’s friend from across the hall.</p><p>Of course, the boy hadn’t received any further invitations and one of the brothers had confided to Kevin at the next recruitment party that some of the members had decided he looked like a fag. They didn’t want any of his kind in their house.</p><p>The funny thing was that he said this to Kevin, who had known he was gay since he was fifteen years old, while the boy from the dorm was straight as an arrow, with a girlfriend he was serious about.</p><p>That was the last recruitment party Kevin had attended, and shortly afterward, he had come out to his parents. They were shocked, and his mother cried, but eventually they came around. He was their only son, and they loved him. It simply became a topic not to be discussed.</p><p>In his junior year, he had told his long-suffering parents he would not be attending law school or becoming a lawyer either. He had neither the grades nor the aptitude for it. Instead he switched his major from Pre-Law to Criminal Justice, with the vague idea of becoming an FBI agent someday. Another pipe dream that his solid C average kept him from, but he was honestly fine with going back home after graduation and joining the local police force. He loved the job and within a few years had worked his way up to detective and fallen in love with his gorgeous partner, who made it clear that he wanted only friendship from Kevin.</p><p>So he’d been drifting, it seemed, for a long time. He had a job he liked, though truthfully, he’d come to like it less in the last few years. But he had a nice home, plenty of men to warm his bed, even if the one he’d really wanted had gotten away. He knew he was good-looking enough. People had been telling him that all his life, and he was always cruised hard when he entered a club. Having enough men was not a problem. So everything was good enough in his life. Maybe not ideal, but good enough. And if he ever felt like something was missing, he shrugged it off.</p><p>Nobody’s life was perfect, after all, but his was damn close. He lived in a tropical paradise, for God’s sake, and he brought men home from the clubs from time to time who were eminently fuckable. The fact that he never felt quite satisfied after fucking them was stupid and his own damn problem. He figured maybe he wasn’t capable of any real feeling beyond the superficial. He enjoyed the men he brought home, fucking them into the mattress most nights, but up to now hadn’t made a real connection. Something was always missing, always leaving him wanting more.</p><p>It was different with Tucker, of course, but they’d never had sex, never really connected in an intimate way. Tucker was more like an unattainable goal. Something to strive for, but not anything he ever thought he’d really have. Over the years, their relationship had become more about friendship, in fact.</p><p>Not like the connection he had with Richard. ‘If you want me to stop, I will. But I don’t think that’s what you want, is it? I think you want my cock buried deep in your ass.’ Why did those words keep resonating in his head? ‘Before I finish with you, you’re going to tell me you’re my baby.’ Damn it, he hated the way Richard treated him. He wasn’t anybody’s little bitch, and he was going to make that clear the next time he saw him.</p><p>After dinner, he followed Tucker upstairs, deciding that what he needed more than anything was a good night’s sleep. He left Tucker in the hallway and went inside his room without even turning on the lights, collapsing on his bed in exhaustion. He desperately needed a shower, but he was too tired right this minute. He remembered how Richard had shot off all over his ass and thighs and then smeared cum on him. God knows he needed a shower after that, but a small part of him liked the idea that Richard had marked him with his cum. Hell with it, he’d get a shower when he woke up in the morning. He stripped off his clothes and got in under the covers naked. He hoped Richard would stay away from his room, though, and leave him the fuck alone. He needed rest and distance from the man and not necessarily in that order. He needed to turn his mind off for a little while and get off this crazy emotional merry-go-round that his life had somehow become. It was only about seven o’clock but it was already getting dark outside. He wondered where Richard was, and then blew out a frustrated breath. Damn it, why can’t I stop thinking about him? Why can’t I turn off these thoughts in my head? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He hadn’t realized he’d said the words out loud until a voice coming from the chair beside him answered. “Because you need something from me. Why don’t you tell me what it is, sweet boy?”</p><p>Chapter Six</p><p>“Shit, you scared me to death. Why the hell were you sitting here in the dark? Don’t you ever knock?” Kevin scooted up in bed to sit with his back against the headboard.</p> <p>Richard’s deep voice rumbled in the dark room. “It isn’t dark. Not really. And I did, but you weren’t in here. So I came in to wait for you. Actually, I’m here to apologize.”</p><p>Kevin snorted. “You? Apologize? I must not have heard you correctly.”</p><p>“I shouldn’t have been so short with you downstairs. It wasn’t your fault that Derek came over to you. Even with my scent all over you, I guess he couldn’t resist.”</p><p>“God, I hope I didn’t smell that bad. I was sitting right next to Tucker, and he never said anything.”</p><p>“Tucker wouldn’t have noticed.”</p> <p>“But that boy would have from across the room? You and your cryptic comments.”</p><p>Richard stood and came over to the bed to sit on the side. Kevin pulled the sheet higher on his chest, uneasy at Richard’s proximity. “Okay, apology accepted, but I need to sleep.”</p><p>Richard stretched out his arm and Kevin felt his fingers trail gently along his jaw. “I need to claim you soon,” he said, almost as if he were talking to himself.</p><p>Kevin leaned into his touch, craving it, hating himself for needing it so much. “What about what I need?”</p><p>“Tell me what that is, baby,” Richard said softly.</p><p>“I-I need to get out of here, to go home.”</p> <p>“I know.” Richard’s hand moved down to his shoulders, massaging, stroking, making him ache even more in his groin. He dropped his head back on the headboard.</p><p>Richard’s hand moved down to his nipples, gently circling each one, one thumb rubbing over the small nub. “I know all that, sweet boy. But what do you want me to do for you right now?”</p><p>“I don’t want you to do anything.”</p><p>Richard’s hand stilled, and he raised one eyebrow as he pulled his hand away. Unable to bear it, Kevin grabbed for it and pulled it back to his chest, his breathing quickening. Kevin shook his head, tightening his grip on Richard’s hand. He couldn’t put it into words. He just had this aching need inside him that he wanted filled. It had always been there, throughout every encounter with every man, all of his life. No matter how much sex he had, it was never quite enough. Today, in the woods, was the closest he’d ever come to fulfillment. He wanted, he needed more.</p><p>“I-I want it rough. I want you to take me. To make me like it.”</p><p>Something blazed in Richard’s eyes for just a moment before his lashes fell to cover the spark. His voice, low and sexy in the quiet room, sent chills through Kevin’s body. “I won’t hurt you...”</p><p>Kevin’s breath hitched, and he nodded, letting his hands fall away from Richard’s and gripping the sheets beneath him. He was almost ready to beg, but he pressed his lips together, swallowing the things he wanted to say. Then Richard’s voice came again.</p><p>“What I will do is turn you over my lap and spank your pretty ass until it pinks up under my hand, until you squirm and beg me to stop, until you’re coming on my thighs, because you can’t help yourself. Then I’ll turn you over on this bed and fuck you so hard you forget your own name. So hard you’ll plead with me to stop, but I won’t. Until I think you’ve had enough. All you have to do,” he leaned over and whispered in Kevin’s ear, his hot breath sending waves of pleasure through his body. “All you have to do is ask for it.”</p> <p>“Oh, God...” His heart was beating wildly at the image that sprang into his mind. His body spread out across another man’s knees. The humiliation, the pain, the loss of control. “Oh God, please.”</p><p>“That’s what I thought.” Richard pulled Kevin across his lap as if he were a child, his ass in the air. Despite what he said he wanted, now that the reality was here, he panicked and struggled, trying to get up. A strong hand held him down, held him in place. He knew that if he cried out and told Richard to stop, he would. That was why Richard was hesitating, waiting for Kevin to find his balance, to be sure. Richard rubbed his hands over the globes of his ass, soothing what he intended to spank in just seconds. “Ready?”</p><p>Kevin took a deep breath and nodded, and then Richard’s hand came down on his bare skin hard twice in succession. The heat from his face quickly transferred itself to his ass, and he bucked his body as the hand fell again and again. His cock lay against the rough material of Richard’s jeans, and as his balls tightened, he rubbed frantically against his thighs. Richard never relented, never gave him a chance to get used to it, to get ready for the next one before the hand fell again. His hips began to writhe, his body well aware of what it wanted, what it needed from this man. His cock was engorged with blood, and he was becoming mindless.</p><p>He felt himself arching like a cat, trying to turn to watch the hand as it came down on him, but the hand on his back was relentless, pushing him back down and making him take it. He could hear the choked cries coming from his throat, hardly able to breathe for the sensations that were rocking his body, the pain and the pleasure coming in equal measures so fast it was overwhelming him.</p><p>He cried out then as his orgasm gripped him and he thrust his legs straight out behind him, convulsing on Richard’s lap. Richard’s hand tightened around his waist as he spurted all over his belly and Richard’s thighs. “Good boy,” Richard said, as he slapped his ass one more time. “Tell me how that felt.”</p><p>“I-I...”</p><p>“Tell me it was good then, baby.”</p><p>“It was good.”</p><p>“This will be better.” He picked Kevin up off his thighs as if he weighed almost nothing and laid him face down on the bed. Trying to breathe again, Richard picked up his head and looked at him over his shoulder. He was stripping off his clothes, his eyes never leaving Kevin. “Get on your knees.”</p><p>Slowly Kevin got in the position Richard told him to, his knees trembling. He couldn’t come again so soon. He would do this because...because Richard told him to. He spread his knees wide and laid his head on the mattress, his ass high in the air.</p><p>He could feel Richard behind him, stroking his hips, his back. Richard leaned over him and his voice rumbled in his ear. “The first time I saw you in that hotel room, I wanted to spread you out like this, for my pleasure. I wanted to spank you first for that smart mouth, and then lay you down and make you open yourself to me. Would you have liked that, Kevin?”</p><p>His fingers were spreading him at his crease, and he nodded, not knowing if Richard could even see it, but it was hard to form words. He liked the things Richard was saying to him, but it made him feel strangely needy and wanton, embarrassed. He turned to bury his face in the mattress, and Richard chuckled. “Sweet boy.”</p><p>He heard Richard fumble at the table beside him and then he jerked in surprise as cool liquid hit him in his most intimate place. He half raised his body up, but Richard’s hand was there, smoothing it in place, making him groan and shiver. The blunt head of Richard’s cock brushed against his hole and he cried out. Richard’s hand soothed him again, rubbing his ass cheeks and murmuring to him. Kevin could feel pre-cum dripping from his cock that had somehow become half-hard again. He’d never started to get hard so soon after an orgasm that strong. What was this man doing to him?</p><p>A finger entered him, strong and sure, sweeping inside and stretching him. It brushed his prostate and he jumped. Another finger slipped in and he heard himself groaning with pleasure. Three of Richard’s fingers were in his ass, twisting and spreading. Then a strong, warm hand went around his shaft. “Fuck yourself in my hand, baby. Show me how much you want it.”</p><p>“Richard, please...”</p><p>“Please what? What is it you need, baby?”</p><p>“I-I need you.”</p><p>“Then show me.”</p><p>The fingers in his ass slipped away, replaced by the head of Richard’s cock, huge and blunt. He pushed it inside and Kevin gasped before his body responded, opening to him, letting him in. He pushed all the way in until Kevin could feel something hard, his balls maybe, crowding his ass, and then he stopped, just filling him, but not moving. “Your turn, baby. Show me how much you want this. Fuck yourself on my cock until you come in my hand.”</p><p>“Oh, God...”</p><p>“Do it. If this is what you want, show me.”</p><p>Slowly he pushed himself forward into Richard’s hand. The pressure on his cock felt so good, he never wanted it to stop, but he needed to move. He pushed himself back on Richard’s cock and felt the tingling on his prostate and he moaned aloud, grinding himself on that cock that felt so good inside him. He heard Richard’s sharp intake of breath and smiled to himself, knowing he wasn’t the only one about to lose control. Suddenly, that became his goal, to make Richard lose control too. To make him cry out Kevin’s name and come so hard he lost himself. He pushed back up into his hand and then slammed back into Richard. He did it over and over again, no longer thinking, just feeling the mindless pleasure, and he heard Richard’s groaning.</p><p>Richard took over then, taking the control away from him, and he was taking him hard, filling him with his big cock and stretching him until he was panting for breath, but he liked it. It satisfied him in a way no one had ever done before. Lust filled his head, and his eyes glazed over, and all he could do was feel as Richard pounded him into the mattress. He gave up his efforts then and just allowed it to happen. He was no longer in control of anything—he was just along for the ride, and he realized that was just the way he’d wanted it all along.</p><p>His orgasm slammed into him like a freight train, knocking him off track, shaking him to his core. He came harder than he’d ever come in his life, the orgasm he’d had as he lay across Richard’s lap felt like foreplay compared to this. He was boneless, destroyed, mindless. He was vaguely aware of Richard’s release and him sagging down on top of him and then rolling them both to the side, but he was too wiped out to even open his eyes. The pleasure came again, like an aftershock, and he shivered and leaned back into the warmth of Richard’s chest. He felt lips brush his ear and smiled in contentment as he drifted gently down into the welcoming darkness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Wake up and get dressed. We’re going on a hike.”</p><p>Kevin opened one eye and peered up at Tucker, who was standing by his bedside, fully dressed and grinning at him. “You may be,” he grumbled, turning over to get away from him and pulling the covers back over his head.</p><p>Tucker ripped them off, laughing at the startled curses coming from the bed. “C’mon, it’s a gorgeous day outside. Perfect for a climb up to the waterfalls. A bunch of us are going, and I want you to come too.”</p> <p>Kevin leaned up on his elbows. “Tucker, what is wrong with you? You know I don’t hike, or climb or anything resembling that shit. Go ahead and I’ll see you when you get back.”</p><p>Tucker crossed his arms stubbornly and stood by the bed until Kevin huffed out a breath and opened his eyes again. “Seriously? I don’t want to go.”</p><p>“You don’t need to sit around inside all day. Come on and go with us. Richard’s coming.”</p><p>Kevin sat up and shot him an evil glare. “And that’s supposed to make me cream in my pants? What are we, in the eighth grade?”</p><p>“C’mon, it’ll be fun. I haven’t spent any real time with you yet, other than fighting over all of this.” He waved his hand again in that languid way of his, an oddly old-fashioned and endearing gesture.</p> <p>Kevin swung his feet over the side of the bed and stretched. “So who all is ‘a bunch of us’?”</p><p>“Some of the newer mates and their...uh...spouses, and just a few others. It’s so nice out, and it’s a not a work day. Gavin and Richard and some of Gavin’s guard are going along because the falls are near one of the perimeters of the property and they can use it as a jumping off point to patrol, as well as guard the mates on the trip.”</p><p>“Guard you? Why do you need that?”</p><p>Tucker walked over to Kevin’s dresser to take out some of the clothes he’d furnished him with. “You know I told you about the Hunters and the recent attacks. They’re being careful still, though we don’t know for sure if they’re still in the area. Some innocent people died, including humans.”</p><p>Kevin turned his head and stared. “What did you say?”</p><p>“Huh? What?”</p> <p>“You said, including humans.” His eyes narrow and suspicious, he asked quietly. “Don’t you think you’re human anymore, Tucker?”</p><p>“I...uh...you must have misunderstood me.”</p><p>“No, pretty sure I didn’t.”</p><p>Tucker’s cheeks were pink, but he hurried back to where Kevin sat and handed him some clothes. “Here, you can put these on.”</p><p>Kevin grabbed his hand. “Talk to me, Tucker.”</p><p>“No,” he said, twisting away. “Just put that on and come downstairs. We’re leaving in an hour, and you’ll need breakfast first.” He held up a hand to stop Kevin from saying more. “No, just get dressed. Please. I think they’re going to talk to you tonight after the ceremony, and you’ll know everything then. I can’t say more. You wouldn’t believe me anyway.” He turned and hurried out of the room, leaving Kevin staring after him and shaking his head. Whatever they’d said to Tucker, whatever they’d brainwashed him into believing, Kevin himself had to stay lucid and not fall prey to it. If an opportunity arose to get out of here, with or without Tucker, he had to go for it. It was too easy to get caught up in all of this and lose yourself. In the meantime, he’d bide his time and learn all he could.</p><p>He went in to shower and shave and get ready for the day, giving himself a stern talking to about the little butterflies that were dancing around in his chest at the idea of spending most of the day with Richard.</p><p>“Come on in with us, Kevin. Don’t be such a wimp,” Tucker called out, his hands on Gavin’s shoulders.</p> <p>“It looks cold. I can watch just fine from here.”</p><p>The hike down to the falls was almost worth it for the view, though Kevin refused to admit it, still a little angry with Tucker at his strange reluctance to share anything with him. After breakfast, the group of about twelve people—a mixture of the big ones and the others, who Kevin now knew were their so-called mates, a mixed group of both men and women—set out on the hike through the forest. Richard and Gavin went along too, though they’d kept at the back of the group, talking quietly to each other on the trail down the mountain.</p><p>By the time they finally reached it, they’d been hearing the roar of the falls for some time. Then suddenly they came out into a large clearing and Kevin looked up to see two huge fountains of water splashing down from the rocks above to form a pool below. Tucker told him the pack called them Twin Falls, though they didn’t really have an official name.</p><p>The pool formed below was large and hemmed in by more rocks, before making its way downstream in a fast moving current.</p><p>Some of the group went immediately into the woods to pull off their clothes and put on their swim wear, but Kevin plopped down on the grass to rest. His feet were sore, though Tucker had found Kevin some hiking boots that fit. He wasn’t used to hiking so he was too hot and just wanted to rest. The sun had beat down unmercifully on their shoulders as the group made their way up the trail, and he felt sweaty and sticky. It wasn’t a terribly steep trail, but the black gnats, which seemed to appear out of nowhere, drove him crazy, buzzing around his head. Tucker, walking beside him, noticed and smiled in sympathy. “You must be wearing some kind of hair product. The gnats love it.”</p><p>“Well, I don’t love them, the little bastards, and I’m not wearing anything. What do I have?” he said, desperately swiping a hand at the little cloud of them over his head.</p><p>“May just be the shampoo I left in the bathroom for you. When we get there, we’ll go in swimming and you can wash it off. That way, they’ll leave you alone on the walk back down to the lodge. I brought you some trunks.”</p><p>“Maybe. We’ll see how cold it is. I like my pools heated.”</p><p>“God, you’re such a city boy,” Tucker said with a laugh. “It’s cold, but it’ll feel good after this hike.”</p><p>Kevin shrugged and trudged forward, wishing for the hundredth time he hadn’t come. He still felt that way, sitting here watching everyone else having a good time. He’d finally gotten up and put on his swim trunks, just because they were cooler than his jeans, but he had no intentions of freezing his balls off in the frigid water. Maybe he’d stick his feet in later.</p><p>“C’mon, Kevin. Let’s go in.”</p><p>Kevin looked up at Richard, who was standing over him, his muscular body totally nude. “Damn Richard, exhibitionist much?” Then as he looked at him, he noticed something else he’d never seen before. There was an extra ring of flesh at the base of his shaft, almost like a growth of some kind wrapping all the way around his penis.</p><p>“Does it bother you?” Richard said, following his gaze down to himself.</p><p>“Huh? Oh, no,” he said, turning his head away and watching the swimmers. “Why should it? What...uh, what is it anyway?”</p><p>“It’s something all the men in my pack have. We were born with it. We call it our knot.”</p><p>“You mean like a birth defect that runs in the family or something?”</p><p>Richard’s lips twitched. “Or something. It doesn’t hurt. I never pay attention to it unless I see someone stare at it.”</p><p>“Oh. Sorry.”</p><p>“No need. But is that the real reason you’re uncomfortable? Or do you not like me showing my body to everyone?”</p><p>“You can show the world for all I care,” he said irritably. “It’s your body. If you want to flaunt it around, go ahead. Except I don’t see why you have to stand there and let everybody get a good look.”</p><p>“Jealous, baby?” He bent down and pulled Kevin up into his arms as if he weighed nothing much at all, and strode toward the water with him. Kevin was too shocked to struggle much until he hit the frigid water where Richard tossed him. He landed a few feet away, coming up thrashing and sputtering to the surface. He stood up, shivering and pointed a finger at Richard.</p><p>“Damn you, you’re going down for that!” Richard waded in after him, still laughing. Kevin made a wild leap for him, intending to push him under. Instead, Richard caught him and thrust him under again. When he came back to the surface a second time, he felt strong arms pulling him along with the current and going farther away from the group to the edge of the pool of water. A powerful arm wrapped around his waist, and Richard pulled him against his body.</p><p>Shivering, Kevin clung to his shoulders and wiped the water from his eyes. Pressed up against his body so closely, Kevin could feel the hardness of Richard’s shaft on his thigh and he found himself lost in the dark brown eyes that were far too close. “What’s the matter, baby? Do you want me to treat you with more gentleness? I can do that for you if you’re too delicate,” he purred.</p><p>Angrily, Kevin smacked his fist on Richard’s shoulder. “Fuck you! Treat me like a girl and I’ll tear your balls off.”</p><p>“You, a girl? Never, baby.” He reached down under the waistband of the trunks and palmed Kevin’s dick. “I like your parts right where they are.”</p><p>Kevin glared at him anyway, as he floated, pulling Kevin with him. He kept his hand right where it was, but only rubbed his thumb gently over the broad head of his shaft and Kevin gradually relaxed into him. The icy water was preventing his erection, but still his touch felt so good, so right. He realized that these last few days he’d felt more alive with Richard than he had maybe for years. Fighting with him, becoming so angry at him that he wanted to scream and then making love to him with such passion was emotion, plain and simple, and something he’d run away from for a long time. For years, he’d been numb to everything, really, especially after Tucker had turned him down, and he believed, at the age of thirty-four, that maybe real love and a strong relationship simply weren’t in the cards for him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not that he needed it really. He had a good life at home, and he couldn’t wait to get back to it. He didn’t need this irritating, arrogant man, who tried to dominate him and control him. So why was his nearness so exciting? He was so close and he smelled so damn good, manly and with a slight musk scent that made Kevin’s skin tingle.</p><p>Damn it, he wanted this man, and to hell with all the reasons why it would be a bad idea. Kevin slanted his head up to taste Richard’s lips, the first time he’d initiated such a thing, sweeping his tongue inside Richard’s willing mouth, and sampling every breath he took.</p><p>Groaning, Richard turned Kevin so his back was facing the others, and his tongue slid over Kevin’s. He put his hand on Kevin’s ass, pulling it in toward him, arching against him and gradually heating and hardening the flesh made soft and cold by the water. God, Kevin wanted him. Whether this was true and forever, he didn’t know, but just then he couldn’t imagine ever wanting anyone else.</p> <p>A shout from behind them made Richard turn and laugh as Gavin stood on the bank watching them with raised his eyebrows. “We have a long way to walk before we get back home this evening. Kevin has a busy, important night ahead of him as well. Don’t wear him out.”</p><p>“I’ll try not to,” Richard said lazily, looking back down at Kevin and taking one more slow kiss, despite Kevin’s reddened cheeks and attempts to get away. Richard towed him back to shore and helped him out before ducking into the trees and retrieving his clothes. Kevin sat down on the grassy bank to let the sun dry him off, as Tucker joined him.</p><p>Leaving only two guards, Gavin and Richard took their leave, wanting to make it all the way around the perimeter, they said, before nightfall. It occurred to Kevin that a lot of miles had to be covered by then, if that was the case, but he didn’t even try to apply logic to what the big ones said anymore. He just accepted that it didn’t make sense and went on. It gave him a headache if he thought about it too much, and really, almost none of it made any sense.</p><p>They stayed for about another hour, until they were all sleepy and beginning to get too hot again. They ate the lunch they’d brought with them and afterward headed back up the mountain. Kevin found the climb back up was more exhausting, though the gnats did leave him mostly alone this time, and when they got back to the lodge, he was pretty tired. He let Tucker talk him into some video games and by the time Tucker had annihilated him as usual, it was time for dinner. The others still hadn’t returned, but Kevin decided to go up and take a nap before the ceremony later that night. The unaccustomed fresh air and exercise put him out in no time.</p><p>He awoke maybe a couple of hours later and felt a large, hard body snuggled up against him. He scooted back into Richard’s warmth and closed his eyes again with a sigh. He awoke again, what must have been hours later, feeling disoriented. He was alone in bed this time and felt a little abandoned until he remembered that tonight was the ceremony. Richard must have left him sleeping. He glanced at the clock on his bedside table and saw that it was eleven o’clock. Why hadn’t Tucker come for him? They’d told him they would talk to him, and he would know everything after the ceremony. Was he not allowed to watch the ceremony itself? Fuck that. After what kept happening with Richard and how strong their connection was, Kevin could no longer ignore the fact that he was in this thing deep. He had to know the truth of what he might be facing.</p> <p>He suspected they were all members of some strange cult, not necessarily religious in nature, but that was a possibility too. It might be a Nature-based religion or perhaps some kind of animal worship. They seemed to believe they were in some kind of pack, after all, and Gavin had said he was an alpha, like with wolves. The day before, Richard had even marked him with his scent, for God’s sake. If that was all it was, it may be harmless enough, though crazy as hell. He still wasn’t sure how Tucker had allowed himself to be roped into all this, unless the need for a family, to connect somehow and belong had been stronger in him than Kevin had ever realized.</p><p>It was all this talk of hunters and killing that bothered him, and he couldn’t shake the fear that this group was somehow responsible for the deaths in Florida, no matter how many times Tucker denied it. He had to find out once and for all, before he totally lost himself in Richard, like Tucker had apparently done with Gavin. These men exuded strength and power, and if he wasn’t very careful, he would be as overcome by it as Tucker had been.</p><p>Slipping from bed, he pulled on his clothes without turning on a light. The light streaming in the window from the full moon was bright and lit up the whole chamber with a silver glow. He tried the door to his room and found it locked, of course. He looked around the room for something he could use to slip the lock, and his eyes lit on a framed picture on the dresser. Sometimes, these pictures had stiff cardboard backings. He quickly dismantled it and found that it did, indeed, have a stiff, glossy cardboard backing to help hold the picture in place. He tore it in half, and using it like a credit card, he worked on slipping it down to tumble the lock.</p><p>He’d had a lot of practice at this when he was a teenager. He used to slip out of the house when he was fifteen or so to meet a boy he liked down the block. His mother, who never quite knew what to do with him, figured out that he was sneaking out at night, though she didn’t yet know it was to meet boys. At that point, she was worried he’d get some girl pregnant. She took to locking his door at night, as well as the front and back doors with a key so he couldn’t get out of the house. He’d become quite adept at slipping his debit card into the lock on his bedroom door and then easing out through a window downstairs. He hoped his skills would come back to him.</p><p>The card kept tearing in his hands and frustrated, he prowled around the room, looking for something else he could pick the lock with. Nothing. Frustrated he sat down on the side of the bed and thought. There was no way that Richard and Tucker would have left him completely alone in a locked room in the lodge. It stood to reason that someone had stayed behind, if for no other reason than to raise an alarm should anything happen. He went to the door and began to bang on it, yelling as loud as he could that he needed help.</p><p>After a few minutes of this, he finally heard footsteps moving down the hall toward him. They stopped outside his door and a female voice called out. “Is everything okay?”</p> <p>“No, no, I’m sick. Please help me. Open the door.”</p><p>Praying it wasn’t one of the big ones, he stood back, waiting for the door to open. A small young woman with blonde hair eased the door open and then jumped quickly back as she saw him standing there. She was rather heavily pregnant, and she put her hands protectively over her stomach.</p><p>Kevin raised both hands in the air to reassure her. “I won’t hurt you. I won’t even touch you. I’m sorry I had to lie to you, but I need to leave this room, and I can’t have you raising an alarm.”</p><p>She wrung her hands and stared at him with big, blue eyes. “W-what are you going to do?”</p><p>“Nothing, honest. I’m really sorry about this. I just want to go to the ceremony. Now, if you’d just step inside here, I’ll lock you in and you’ll be safe. I promise. I’ll even tell someone to come and let you out as soon as I get there, okay?”</p><p>She nodded and stepped past him into the room. He tried to smile at her reassuringly, and then closed the door behind him, propping a chair from the hall against the outside. Even though he hadn’t touched her, he still felt a little like a big bully, and he figured that if one of the big ones was her husband, he’d have some serious explaining to do. They all seemed so protective. It was weird.</p><p>He was still quiet as he moved down the stairway, in case guards had been left outside. Tip-toeing to the back door, he opened it quietly and saw no one else around. Far in the distance, he could hear voices and see lights in the forest. He moved toward them, trying to keep to the shadows, in case anyone other than the young woman had stayed behind to guard the outside of the lodge.</p><p>Excitement coursed through him as he walked down the path. The moonlight made it easy to navigate, especially once his eyes adjusted to the darkness. Hearing what sounded like howling coming from the clearing ahead, Kevin felt a trickle of fear down his spine. He was almost at the clearing, and he faded back into the trees. Wanting to avoid detection for as long as he could, he edged closer, not sure what he was about to see, but feeling strangely excited. Perhaps, at long last, some of the mysteries were about to be solved. He found a big pine tree right on the edge of the clearing and moved over behind it, gazing out at the assembled group. There looked to be about sixty or seventy people in the clearing, both young and old. The bigger ones were all standing together in a group by the front, while the others were closer to the edge where he was hiding. He could see Gavin standing on a little outcropping of rock, slightly elevated, and he was talking to the group of men and women clustering around him. Kevin was too far away to hear anything they were saying.</p> <p>Closer to him was a woman with long, gray hair, the oldest person he had seen at the lodge up to now. Despite her age, her body was straight. She had broad shoulders and powerful arms. Around her was a group of small children, and she seemed to be telling them stories. Kevin saw Tucker standing near this group, along with some of the other, smaller ones. He stepped out into the moonlight and went to Tucker’s side.</p><p>“Oh God, Kevin, you startled me,” Tucker said, turning to him in surprise. “What the heck are you doing here? Richard said you weren’t coming, and he even left someone to watch over you.”</p><p>“Yeah, about that. She’s locked in my room, Tucker. Better send someone to let her out.”</p><p>Tucker gave him a pissed-off look and spoke to a boy beside him. The young man hurried off back toward the lodge.</p><p>“If you scared her, Joshua will kill you.”</p><p>“I don’t know who that is, but I assure you she’s fine. I never even touched her.”</p><p>“Joshua’s her mate, Kevin. Like I’m Gavin’s mate. And you have no business being here. Gavin and Richard will be furious.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why is that? They told me they wanted me here a couple of days ago.”</p><p>“Things have changed. Now Richard wants to be the one who tells you about things. He thinks you’ll be too freaked out if you see it happening.”</p><p>“See what happening?” Kevin shook his head. “No, I’ve waited long enough. I need to be here, Tucker. I need to see for myself what’s going on. It’s time I was let in on this big secret of yours.”</p> <p>Tucker nodded, laying his hand on Kevin’s arm. “I agree, but it’s not my call. Look, stay for a little while, but I think as soon as Richard notices you here, he’ll make you leave. Tonight is kind of special, and I don’t think things will get started right away. Actually, it’s my first time to see this too. It’s the blue moon ceremony.”</p><p>“The what? Blue moon? I thought you were joking about that.”</p><p>“No, Gavin said it really happens about once every three years. The full moon rises twice in the same month, at the beginning and then again, toward the end of the month. It doesn’t change color or anything, of course, but it’s very rare. When it happens, they have this ceremony, to mark the occasion.” He pointed toward an older woman who was telling the children stories, because they were indeed stories of some kind, and the children sat on the ground under the moonlight seeming to hang on her every word.</p><p>“So...what? You worship the moon?”</p><p>Tucker shook his head. “They don’t worship it, no. But it’s very important to them. It-it brings on the change, though they can do it at any time.”</p> <p>“Do what? What do you mean by the change?”</p><p>“You’ll find out if Richard doesn’t catch you. For now, listen to what the medicine woman is telling them. These are some of their legends,” Tucker said.</p><p>“Medicine woman? Seriously?”</p><p>“The clan has an Indian heritage a long way back. Shh...listen.”</p><p>Kevin moved a little closer, with Tucker beside him and they focused on what she was saying.</p><p>“Once in the old days, long ago, before the humans came, there was a wolf, and this wolf was alone. Oh, there were other wolves in his pack, but each of them ran under the silvery moon together, and he had no mate to run with. He lived high in the hills all alone, and refused to join the others. And this gave rise to the legend of the lone wolf, with his long teeth and his fearsome, fiery eyes.</p> <p>“But that wasn’t the worst thing. It wasn’t the thing that froze the marrow in the bones of the other wolves late at night, and caused the children to hide their heads under their paws, and the others to cower in their dens. The worst thing was the lone wolf’s howling, in the cold, crackling air and in the light of the silvery moon. He would sit on his high hill and howl the mournful song of a lost soul, tortured and alone.</p><p>“And it frightened everyone who heard it—all except one. One young pup, who also lived alone, his parents having moved on and left him. And when the pup heard the wolf’s mournful song, he would stand in the pale, silvery light of the moon, and he would lift his voice to join the wolf, and he would call to him. ‘Who’s going to stay with me this long, lonesome night?’”</p><p>Kevin had to admit he was a little charmed by the story. It had the feel of a fairy tale, both from the old woman’s soft voice and the children’s rapt attention. When she got to the last line, the long, lonesome night part, she would drag out the vowel sounds, making the words sound almost like a howl. The sound made a little shiver go down his spine and he saw the children shift to sit closer to each other. As the sound died on the chill night air, she continued.</p><p>“But no one ever came, and no one ever answered, because the pup was a solitary soul. No one understood him or took the time to know him. And he would lie awake in his bed at night wondering why he felt so lost and alone. Sometimes it would make him angry and sometimes it would make him cry. And every night when he heard the wolf, he would stand and sing out, ‘Who’s going to stay with me this long, lonesome night?’ But no one ever answered and no one ever came.</p><p>“And one night there was a strange and rare moon, a blue moon, and this time when the young pup stood and called, ‘Who’s going to stay with me this long, lonesome night?’ he heard an answering call. It was the lone wolf, singing his sad, lonely song, but closer this time, sounding nearby. It might have been nothing. It might have been his imagination that the song sounded so close, or only a shadow crossing the blue moon, but he thought it might be everything he’d been seeking. It might be a way to belong. He called again, ‘Who’s going to stay with me this long, lonesome night?’ And from the corner of the eye, he saw the shadows move and become living and breathing flesh. It was the wolf. The pup was frightened, but he knew he had drawn the wolf with his mournful song, and as he peered into the red eyes in front of him, he felt his fear go away.</p><p>“He knew in that instant that what he had sought for so long had finally come for him. The wolf answered his call. And so with his heart full and his eyes lit up with understanding, the pup faced the wolf and he said again, ‘Who’s going to stay with me this long, lonesome night?’ And the wolf said, ‘I will.’</p><p>“So even today, but only sometimes, on special nights when the moon is full, like tonight, if you strain very hard to hear it, you may hear the cry of the two wolves, their voices mingling together, high on a hill, under the light of the blue moon.”</p><p>Just as she finished speaking, a long chilling howl rose up from the group gathered around Gavin. As Kevin watched in fascination and horror, they threw off their clothing one by one and fell on all fours. Even from thirty yards away, where he stood, he could hear the popping and cracking sounds as their bodies elongated and stretched. His mouth fell open and he grabbed Tucker’s arm in terror, pulling at him as one by one their bodies shifted and shimmered as they changed into huge wolves before his eyes. Black ones, brown ones, silver ones, all huge with red eyes and fearsome fangs hanging from their mouths.</p> <p>Kevin screamed. He couldn’t have held the sound back even if he’d tried.</p><p>He heard Tucker yelling at him, even the woman who’d been telling the stories was suddenly on her feet, looking at him in alarm, but he couldn’t seem to stop. His scream pierced the night and was even louder than the howling of the wolves. He saw several huge heads turn toward him and a few nearest the back of the pack began prowling in his direction. That was all it took.</p><p>He wrenched his arm away from Tucker and took off as fast as he could back down the path he’d come down. His only thought was to put as much distance between himself and the horror behind him as he could. He was aware of Tucker right behind him, yelling and grabbing at his arm. Tucker had always been a fast runner, much faster than he was. Tucker yanked at his arm and shoved him around to face him.</p><p>Vaguely some part of his mind registered feet pounding toward them. Panting for breath he cast a wild eye behind him, trying to wrench away. Whatever was coming for them was headed their way fast. His mind screamed to him that the monstrous creatures were coming for them both, and they had to get away. Kevin threw his body behind Tucker’s, intending to push Tucker ahead of him down the pathway. He felt something huge and powerful slam into his back and knock them both to the ground. He wrenched his body around, half turning over to see a huge black mass hovering over both of them, a gaping maw dripping saliva on their faces. A huge paw slammed into his chest with a stunning, breathtaking pain. His ears were filled with the feral snarls coming from the beast’s throat and his mind refused to register what was about to happen.</p><p>Tucker was screaming at the beast on Kevin’s chest, pounding on it with his fists. The beast turned its head toward him, and Kevin could have sworn it gave a growl almost of satisfaction. It sank its teeth deeply into Tucker’s neck. Without conscious thought, Kevin rolled to his side, squirming out from under the creature while it was busy with Tucker, and he staggered to his feet. The only thought in his head was that this thing was about to kill Tucker, to rip out his throat. Rocks almost the size of his head lined the path leading up towards the circle. Kevin heaved one up without thinking, brought it up as high as he could and crashed it down onto the skull of the monster. It let out one loud sound, half scream, half roar and then slumped down across Tucker’s body.</p><p>Suddenly, he was pushed roughly to the side, and he fell on the path, his legs unable to hold him up any longer. A huge brown wolf was crouching over Tucker’s body, while another large gray one suddenly flung itself over him, knocking him on his back. He put up his hands defensively as bile came flooding into his mouth. Not again—he wouldn’t survive this time. He choked back the vomit, and he closed his eyes, letting his head fall back on the ground and giving up. Bright pain radiated down from his chest and across his side. Broken ribs, he thought absently, a part of his mind still trying to work out what was happening to him.</p><p>After a few moments he was vaguely aware that hands lifted and carried him, as behind him he could still hear what sounded like a battle raging, with other snarls and growls and howling all surrounding the pathway. He opened his eyes and realized Richard carried him, running fast. Too fast, it seemed, to be real. He had to be dreaming. Others were shouting, but his vision was getting dimmer and there was a strange buzzing in his ear. It must be shock. His mind kept repeating the word as a chill swept over him.</p><p>He never lost consciousness, but the buzzing in his ears continued, even as he was taken into the warmth of the lodge and taken upstairs to his room. Someone laid him down on the bed and Richard covered him with a blanket, then said something to the others in the room and ran out again. He’d said something about checking on his son. What? What son? What in the name of God was going on? What had he just seen? The images of the beast that tried to kill both him and Tucker flashed through his mind again and again as he lay shivering on the bed. Richard would come soon. He knew that, and he yearned for him at the same time he dreaded seeing him.</p><p>Chapter Seven</p><p>Richard had never been so frightened in his life. He’d been near the front of the crowd and had just shifted when he heard the loud commotion near the path. Almost unable to believe what he was seeing, he watched as Gavin’s personal guard, the ones he’d last noticed at the back of the pack, ran toward the loud yelling. His keen eyes picked out Tucker right away, and he was stunned to see him struggling with Kevin. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He’d left Kevin asleep and locked inside his room. How could he be here now? Obviously, he’d witnessed the shifting of the entire pack, and he was badly frightened, maybe fighting Tucker off as he tried to get away. Too stunned to move at first, Richard was aware of Gavin leaping past him. After staring blankly for what felt like an eternity, his body hurled itself toward the scene unfolding by the edge of the woods.</p><p>Kevin had broken and run down the path, with Tucker right behind him. Tucker caught up to him after only a few paces, but to his horror, Richard saw Todd, the guard nearest them, wasn’t stopping his headlong rush toward them. Todd had been right at the back of the pack, only yards away from where the men had been standing before they took off running. He plowed into them now, and took them down, his fierce, savage snarls loud and frightening. As incredible as it seemed, Todd was attacking the men, and seemed to be going for the kill.</p><p>Kevin somehow rolled out of his grasp and made it to his feet, and before anyone else could reach them, picked up one of the big rocks lining the pathway and hurled it down on the back of Todd’s skull. Richard’s mind registered all of this as he saw the others reach them on the path. Gavin shouldered all of them aside and fell on top of his mate, keening and growling as he forced the shift on himself. Kevin still stood beside Tucker, swaying unsteadily and clearly in shock. Richard took him down himself, trying not to hurt him, but feeling fiercely protective. His wolf needed to crouch over him, needed to make sure no one touched him. Filled with impotent rage at the thought that Todd would dare to hurt either his son or his mate, he savagely hoped Todd was dead, or else he’d kill him himself.</p> <p>He had seen Tucker lying still on the pathway, blood streaming from him, and his mind shied away from that image. Tucker couldn’t be dead. It became his mantra, and he repeated it over and over as he tried to gain control. Gavin was over him, and the narrow pathway was alive with the snarls and nervous whining of the pack.</p><p>The gammas who made up Gavin’s private guard huddled around Todd. Richard saw them rolling him over and checking his pulse. One of them looked up at the others and shook his head grimly, while Marissa gasped and turned her face away. As Richard watched, the body shifted back into its human form, and a few of the other guards were forcing the shift as well, shocked and disbelieving. They all must surely realize that what Todd had done was almost unthinkable. To attack the alpha’s pet, along with a guest of the alpha’s in their home was unconscionable and punishable by death. If Kevin hadn’t already killed him, Gavin would have torn him apart, while the entire pack watched.</p><p>All this registered in some part of Richard’s brain, but he was still finding it hard to calm down enough to shift. How on earth had this happened? All of Gavin’s guard had been overzealous, and Richard had warned Gavin about them only a few days before. But why had one of them dared to launch this attack? Had he totally lost his mind?</p><p>Todd certainly couldn’t tell anyone now because he was dead, killed by the rock that Kevin crashed down into the back of his head.</p><p>He managed to force the shift back on himself and tried to quickly assess any damage Kevin had sustained in the attack. No broken skin, thank God, but he was hunched over his side, and drew in short, sharp breaths. Richard suspected broken ribs at the very least.</p> <p>Gavin was already running back toward the lodge with Tucker, so Richard forced all of his attention back on Kevin. He murmured soothingly to him. He was still conscious, but his breathing was erratic and he had his eyes closed. He picked him up carefully and took him back to the lodge, wanting to get him somewhere he could examine him more carefully.</p><p>When they reached Kevin’s room, he put him on the bed and covered his shivering body with a blanket. Irena, the medicine woman, had come in behind him, along with a few other gammas, who were standing nervously by the door. Yelling at them to call for the doctor, he motioned Irena closer.</p><p>“Stay with him, please, Irena, while I go check on my son. I think he’s suffering from shock and broken ribs. I’ll only be a moment.”</p><p>Irena nodded and sat beside Kevin, taking his hand in hers.</p><p>When he got to Gavin’s room, he was almost afraid to go in. If he lost Tucker now, after finally finding him again, he didn’t know what he’d do. It made him sick to think about it. Easing open the door, he saw Tucker lying on his back in bed, his face unnaturally pale against the sheets. Gavin was pressing his wrist to Tucker’s lips, feeding him with his blood.</p><p>“Is he...” he asked, almost afraid of the answer.</p> <p>Gavin turned a flushed, worried face toward him. “He’ll be okay, I think. His wound is closing already. Another minute or two...”</p><p>Richard nodded. “Thank God.” He crossed over to the bed to stand beside his son, taking and squeezing one of his hands. His knees suddenly felt too weak to hold him and he sank down beside Tucker on the bed.</p><p>“Kevin?” Gavin asked.</p><p>Richard nodded. “Some bad bruises. I think he has broken ribs, and he’s in shock. I left him with Irena to come check on Tucker.”</p><p>Gavin nodded, his face set and tight. “What the fuck happened tonight, Richard?”</p><p>Richard shook his head. “I don’t know. Todd attacked them both, even though he had to know who they were. I still can’t believe it...”</p><p>Gavin made a low growling sound in his throat, but said nothing further, just smoothed Tucker’s hair with his free hand, urging him to take more of his blood.</p><p>Richard put a hand on his arm. “I know how you’re feeling, but don’t make yourself sick. He can only take in so much right now. The doctor will be here soon, and he’ll guide you.” He got back to his feet nervously. “I hate to leave him, but Kevin...”</p> <p>Gavin nodded. “Go ahead.”</p><p>Richard got almost to the door when he heard Gavin speak to him again, his voice full of strong emotion. “Kevin saved him tonight, Richard. If it hadn’t been for him...”</p><p>Richard nodded, unable to speak. Kevin could have run away, but he’d stayed to fight a savage creature much bigger than himself with only his bare hands and his courage. Another reason to love Kevin, as if he needed any more. He turned and rushed down the hall toward his mate. When he reached Kevin’s room, he saw that Kevin was awake. Irena was examining his ribs, her fingers skimming lightly over the left side of his body, and Kevin’s struggles to breathe were becoming more obvious. Irena looked up at Richard. “His breathing is getting worse. You need to help him.” She pulled Kevin’s face back toward her. He was awake and he looked up at her and then past her to Richard. His eyes widened in fear, and it felt like a knife to Richard’s heart.</p><p>Irena shook his chin slightly to make him focus on her. “Kevin, listen to me. Richard is going to help you now. You must swallow what he will give you. It will help you and take away some of the pain. Do you understand?”</p><p>He nodded almost imperceptibly and his eyes flew back up to Richard, who had sat down on the other side of the bed. “Kevin, it’s me, baby. You know I’d never hurt you, right?”</p><p>Kevin stared blankly back at him, making no sign he’d heard him. Moving slowly, Richard brought his wrist to his mouth and allowed his fangs to drop. Kevin’s sharp intake of breath caused him to wince and groan with pain, and while his mouth was still open, Richard pressed his wrist to his lips.</p><p>There was a brief struggle as he tried to wrench his head away, but Richard held his head steady with his free hand, while Irena held down Kevin’s body. Irena was one of the oldest members of the pack, but she was still a wolf, and her body still powerful.</p><p>Kevin tried to resist, but the blood slipping down his throat would have choked him if he hadn’t swallowed. A look of extreme distaste came over his features, followed by an expression of surprise. He began to allow the blood into his mouth, and then to actually make small sucking motions with his lips. In moments, his eyes had rolled back in his head, but when Richard looked at Irena in alarm, she was smiling.</p><p>“His mate’s blood is soothing and calming him, taking away his pain. He will continue to drink until you pull him away. Be careful not to lose too much yourself.” She patted his shoulder. “I’ll go up to the alpha now to see if I can help since he’s had a chance to calm himself. He would allow no one near his mate at first. The doctor should be here soon.”</p><p>Richard sat beside his beautiful mate just watching him as he took in the wolf’s blood. He understood now why Gavin had been almost unable to pull his arm away. His wolf was soothed by helping his mate this way, and he had to force himself to pull back when he began to get lightheaded. He wiped the blood away from Kevin’s lips with a corner of the sheet and stroked his hair. He was almost frightened by the intensity of his feelings for him. Something wasn’t right. These feelings were too intense, too powerful. He hadn’t felt anything like this since...since his bloodmate years ago.</p><p>He pushed the thought away, and bent over Kevin to press his lips against his forehead, keeping watch over him until the doctor arrived.</p><p>Dr. Cornsilk stopped in to check Kevin’s vitals and give him an injection for pain. Kevin was fast asleep now, with Richard sitting on the bed beside him.</p><p>“He’s so pale,” Richard said anxiously.</p><p>“It’s from shock,” Dr. Cornsilk replied. “He should be fine, though he should be kept quiet, and he’ll need some reassurance when he wakes up. He’s been through a bad emotional trauma.</p><p>Richard nodded. “Fine. I’ve already given him blood, and it seemed to soothe the pain.”</p><p>“Yes, the ribs are already healing. Amazing, considering you haven’t even given him a mating bite yet.” The doctor looked at him with an odd expression. “Usually the wolf’s blood won’t help much until after the mating rituals. The bloodmatch with the two of you must be very strong.”</p><p>“What? No,” Richard said, shaking his head. “My bloodmate died over twenty years ago, Doctor. You know that. She was Tucker’s mother.”</p><p>Dr. Cornsilk shrugged. “Nevertheless...” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Richard shook his head emphatically. “No, you don’t understand. He’s not my bloodmatch. I had that years ago with Tucker’s mother, and she passed away. I’m in love with Kevin, yes, but...”</p><p>The doctor shook his head firmly. “Richard, only the blood of a bloodmate can heal so quickly. You know this. Other wolf blood can certainly help keep someone alive until they can be helped, but only bloodmatch blood heals perfectly and quickly like this. No, Kevin Bryson is your bloodmatch.”</p><p>“But that’s impossible, Doctor. My wife...”</p> <p>“I know it’s unheard of, but it may be that your first love was not a bloodmatch.”</p><p>Richard shook his head stubbornly. “No, impossible. You didn’t know her.”</p><p>“Of course not, and I don’t mean to offend you. Love matches are often just as strong and long lasting. There are really very few differences in the actual feelings involved. The difference is biochemical. It comes in a couple of ways. First of all, with a bloodmatch, a wolf really can’t live without his mate. The attachment is almost physical, it seems, and wolves often die soon after a mate passes away.”</p><p>“I had my son to think about,” Richard said gruffly. “I tried to survive for him.”</p><p>“I understand, of course. Still, others have not had the stamina that you’ve shown, even when children were also involved. I’ve already mentioned the blood connection with healing.”</p> <p>“My wife died in an isolated area, and there was no chance to save her. Maybe if I would have been with her...”</p><p>“Well, it’s interesting to speculate, but we’ll never know for sure, of course. What I can tell you with some assurance is that Kevin most definitely is your bloodmatch. His ribs are almost completely healed. I’ve never heard of a wolf having two bloodmatches before, but I suppose anything is possible, especially when, if she was indeed your bloodmatch, your first mate died so quickly after you’d established the mating.”</p><p>“And you know all this because of the healing?”</p><p>“That, and...tell me, how long have you known him?”</p><p>“I don’t know,” Richard said. “A week, maybe. No, less than that. This is only the fourth day.”</p><p>The doctor nodded. “Yes, an instant attraction? A feeling that was almost overpowering right away? And tell me, have you noticed a fragrance around him?”</p> <p>“A fragrance?”</p><p>“Yes, some overwhelmingly sweet scent that comes from him.”</p><p>Richard nodded. “Yes, all of that.”</p><p>“And did it not strike you as strange that after some twenty years of not being attracted to anyone, that you meet this man and fall so in love with him in three or four days that you want to spend the rest of your life with him?”</p><p>Kevin’s delicious scent wafted up to him even now, causing him to feel almost dizzy. He’d thought for several days now that he needed to find out what kind of cologne Kevin wore and invest some serious money in the company. He’d never smelled anything like it before, and it was a scent he identified strongly with Kevin. It had been teasing around his nostrils for days now, driving him out of his mind. He looked up at the doctor in shock.</p><p>“My God,” he said. The irresistible scent of the mate was well-known in the folklore of the wolves. It was what usually attracted them to their bloodmates in the first place. How could he have been so stupid as not to have realized? It must have been because he hadn’t been expecting it. His bloodmatch had died so long ago.</p><p>“Exactly,” the doctor said with a slight upturn at the corners of his mouth. “Get some rest, Richard. Both your mate and your son will be fine. They were extraordinarily lucky. Not many humans survive a wolf attack.”</p><p>Richard nodded. It was still hard to believe what had happened. How had Todd dared to attack them the way he had? He could feel the restlessness of the entire pack at what had occurred, but he was too tired and emotionally drained to do anything about it tonight. He kicked off his shoes and lay down beside Kevin, gathering him in his arms.</p> <p>Kevin sighed as he settled into Richard’s side, his head on his shoulder, his arm around his waist. This was where he’d like to keep Kevin the rest of his life, safe in his arms, except he knew Kevin would balk at the idea. He was too independent, too practical and too unwilling to accept anything he couldn’t see and touch with his own hands. He had to find a way to make him surrender that iron will of his just enough to let Richard in. He had to convince him that what they had was real and true and perfect, even though he knew Kevin would fight him every step of the way.</p><p>Kevin woke up to find himself wrapped up in Richard’s arms. At first he was alarmed, but as he tried to move away, pushing gently against him so he wouldn’t wake him up, Richard shifted to his back and his eyes flew open.</p><p>“Good morning. How do you feel?” he murmured, and Kevin felt his heart beating rapidly in his chest. He pushed against him, harder this time, to get some space between them.</p><p>It was like pushing against a wall. He couldn’t budge him, and Richard looked down at him curiously.</p><p>“Going somewhere, baby?”</p><p>“Let me go,” Kevin said, still pushing at him. “I know what you are.”</p><p>Richard shifted his body and rolled over on top of him, holding him down. He stretched Kevin’s arms up over his head and held them there. “And what am I?”</p><p>“A-a monster, damn it! I saw what happened last night. I saw you all turn into those beasts.”</p><p>“You saw us shift into our wolves. I know. I’m sorry you had to find out like that, sweetheart. I planned to break it to you some other way, though I don’t guess there’s any way for you to be comfortable with the idea.”</p><p>“Comfortable with it? Are you crazy?” He struggled uselessly again for a second and then huffed out a long breath. “I don’t understand. Maybe it’s me that’s crazy.”</p><p>Richard leaned down and captured his mouth, kissing him for a long time until those crazy feelings came over Kevin again, and his treacherous cock thickened between them. What the hell was wrong with him that he was still so attracted despite what he’d seen with his own eyes? A sudden thought made him jump. “Tucker? Where’s Tucker? I saw that thing ripping at his throat.”</p><p>“Tucker’s fine, and Todd is dead. The wolf who attacked you was Todd, one of Gavin’s guards. No one knows why he attacked you like he did, though we’re going to try to find out. I’m so sorry, Kevin. I know how terrified you must have been. If I could have gotten to you sooner...but you saved Tucker, Kevin. The rock killed Todd.”</p><p>“Good,” he said, anger tightening his lips. “The mother fucker tried to kill us both.”</p><p>“I know. I can’t explain it. One of our oldest and most sacred laws is to always protect our pets.”</p><p>“Your pets?” he said, his voice filled with contempt. “Is that all we are to you? Pets?”</p><p>“It’s a term we use for our mates and for the members of the pack who never shift. Those like Tucker. It doesn’t mean the same thing to us as it does to humans.”</p><p>“Humans...God, I’m going crazy.”</p><p>“I’m not human, baby. You saw that for yourself. We’re wolf shifters, and we’ve existed for as long as humankind. But we’re not evil. All we want to do is to be left alone to live our lives in peace.”</p><p>“No, this is crazy. Let me go!” Kevin started struggling again to get away, trying to pull his wrists away from Richard’s grasp.</p><p>Richard started kissing him again, and though he twisted his head to get away, it did begin to soothe him, especially when his lips traveled all over his face, slowly, almost reverently. They didn’t speak for several minutes, just lay with their bodies touching all over. The room was filled with sunlight, and he wondered what time it was and where the others might be. Richard shifted to take some of his weight off him and released his wrists.</p><p>“Are you okay?” he asked gently.</p><p>Kevin nodded. “Can I get up? I have to go to the bathroom.”</p><p>“Of course.” Richard rolled away and Kevin sat up shakily on the side of the bed. He felt his ribs. Still a little sore, but not bad. Damn, in his delirium the night before he’d been sure they were broken. The pain had been bad, and he couldn’t catch his breath. Now it was like nothing had happened. Had it been real? Was any of this real?</p><p>He pushed up to his feet and staggered a little, but put a hand out to stop Richard when he would have gotten up to help him. “I’m fine. I was just dizzy for a second.” He made it to the end of the bed before he staggered again, and this time Richard was beside him, not taking no for an answer. He put an arm around him to help him to the bathroom and then stood, leaning with his backside against the vanity, patiently waiting while Kevin peed.</p><p>“This really isn’t necessary,” Kevin said sharply, glancing over at him darkly. Richard shrugged in that maddening way of his, his arms crossed over his chest. Finishing, Kevin stumbled over to the sink to wash his hands and caught sight of himself in the mirror. There were blood stains under his chin and down in the hollow of his throat. The memory of being held down on the bed while Richard forced his blood into his mouth came back with a vengeance and he staggered again. He kept staring into the mirror again and saw a further horror. There was a fine spray of blood on his forehead, and even in his hair, probably from Todd, or even Tucker.</p><p>“The-the blood. You...”</p><p>“I gave you some of my blood, yes. Only to heal you, baby.”</p><p>“Oh my God,” he whispered and backed up as far as he could in the small bathroom. Richard made a sound of impatience and reached for him, pulling him back into his arms.</p><p>“Calm down. It helped you. It’s not going to turn you into a werewolf, if that’s what you’re thinking. Get all that Hollywood crap out of your head. Todd never bit you, or even raked you with his claws.”</p><p>“Y-you mean to say that if he had bitten me...” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No. Not exactly. Well, in a way...” He reached into the shower and turned on the water. “Let’s get you cleaned up and we’ll talk about it, but over breakfast. You need something to eat and so do I.”</p><p>When he had the water adjusted, Richard stepped into the shower and held out a hand. Kevin hesitated for only a second before he stepped over and took his hand. Richard rewarded him with a beautiful smile and pulled him inside under the warm spray. Tenderly, Richard washed away all traces of the blood, and held Kevin close to his body, stroking his back when he began to tremble.</p><p>Both the warmth of the water and Richard’s closeness finally stopped the chills that had been shaking his body, and he was able to get out of the shower and stand still while Richard dried him off.</p> <p>Richard stood up beside him and took him by the shoulders. “Better?” he asked softly.</p><p>Kevin nodded and they went back to the bedroom for Kevin to get dressed. Richard looked down at himself sheepishly. “We’ll have to stop by my room for me to dress. I was naked last night at the ceremony.”</p><p>Kevin felt his cheeks get hot, but he nodded and followed him out, hoping no one was in the hall. Richard was casual about his nudity, and now Kevin could see why. The big ones—the wolves, he made himself think—must be naked around each other all the time.</p><p>Richard’s room was just down about three rooms from his. Kevin wondered why he hadn’t realized how close he was. Hesitating at the door, he waited for Richard to wave him inside the room. It was larger than his, and sparsely furnished. It reminded Kevin of a suite in a hotel, with a small kitchen of sorts. It was no more than a microwave on a counter next to a sink and a small refrigerator under the counter.</p><p>A dark brown leather sofa stood in the middle of the room with a matching chair, and over on the side of the large room was a big king-sized bed and some dressers. Everything was Spartan and neat, as Kevin had thought it would be. There was something so organized and controlled about Richard.</p> <p>He pulled on a pair of underwear, well-worn jeans and a T-shirt, slipped into some scuffed loafers and came back over to him. He dropped a quick kiss on Kevin’s lips. “Ready, babe?”</p><p>It must have been later than Kevin thought, because almost no one was around downstairs. A different woman came out to take their order, and Kevin wondered where Emily was. Her husband was part of the so-called guard. Was he being questioned? Richard ordered for both of them and then sat back, seeming to read Kevin’s thoughts.</p><p>“Emily must be with Christian this morning. I imagine he’s taking it hard. Todd was his best friend.” Tucker shifted his gaze down at his hands and Richard covered one of them with his. “No, don’t feel bad about it. If you hadn’t protected both you and Tucker, you’d be dead. I’d have killed him myself if I could have gotten to him before you acted.”</p><p>“I know,” he said quietly. “Still, it’s hard. I’ve killed someone before in the line of duty once a robbery at a quick stop store I rolled up on when I was still on patrol. The guy pulled a gun on me, and I had no choice, but it messes you up, no matter how justifiable it might have been. This time, it was so much more personal, you know?” He passed a hand over his face. “I’m sorry. I guess the reaction is finally starting to set in. My hands are shaking.”</p><p>Richard put a hand over his as the woman brought their breakfast. Kevin took a big sip of his coffee, and the bitter brew strengthened him somewhat. They both ate quietly for a few minutes, and Kevin could feel it bringing him strength.</p><p>Gavin showed up beside them, coming in from the side entrance where neither of them had noticed his approach. “How’s Tucker?” Richard asked, before Kevin got a chance.</p> <p>Gavin smiled. “Much better. Almost completely recovered, and spitting mad because I made him stay in bed this morning.”</p><p>“Wait...what?” Kevin broke in, laying down his fork. “How is that possible? I admit my memory is fuzzy, but I saw that thing ripping his throat open.”</p><p>Gavin and Richard looked at each other and Richard gripped his hand a little tighter, like he was afraid he might bolt again. “Gavin gave him his blood, Kevin. Not only mate’s blood, but alpha’s blood. It’s the strongest of all.”</p><p>“And this healed him somehow?”</p><p>“Yes,” Richard said patiently. “Just like my blood healed your ribs.”</p><p>Kevin moaned and closed his eyes. “I’ve got to be dreaming all this. Or else I’ve totally lost my mind.”</p><p>Gavin spoke up gently. “Just take your time. It took Tucker a while to get used to it too. You see now why he couldn’t tell you. You wouldn’t have believed him. Tucker wanted to put me in a mental hospital up until the time I shifted in front of him.”</p><p>Kevin nodded. “I remember he told me. About the hospital, anyway.”</p> <p>“There’s something else you need to know, Kevin,” Richard said. “Tucker and I...we have a close relationship.”</p><p>“I know,” Kevin said sharply. “Don’t tell me I was right all along, and you’re in some kind of three-way.”</p><p>“No,” Richard said firmly. “Don’t be silly. Tucker is...Tucker is my son.”</p><p>Kevin cocked his head to one side, a smile tilting up the corners of his mouth. “Your what? Come on, Richard, you can’t be much more than five or six years older than Tucker. How is that even possible?”</p><p>“I’m a wolf-shifter, Kevin. We stop aging around thirty and don’t age again until we get really, really old. Some don’t even live that long, though we...we live a very long time.”</p><p>“H-how long?”</p><p>“Around two hundred years, give or take.”</p><p>Kevin laughed. Out of all the craziness he’d witnessed in the last few hours, he didn’t know why he should even think this was odd at all. “And you? How old are you, Richard?”</p><p>A little smile appeared on Richard’s face. “I’m seventy-four.”</p><p>Kevin opened his mouth to say something but nothing came out. Richard took him by the shoulders and shook him gently. “Kevin, take a breath.”</p><p>He inhaled sharply and his sight began to clear a bit, as the little black stars stopped dancing in his peripheral vision. “I-I’m sorry,” he said. “I don’t know why that should surprise me so much, or hit me so hard.”</p><p>“You’ve had a lot to take in,” Gavin said. “Give it all some time. In the meantime, Richard, I need to talk to you about what we found when we searched Todd’s room.” He glanced over at Kevin and hesitated, but Kevin sat forward.</p><p>“No, go ahead. I want to hear this. I think I have a right.”</p><p>Gavin nodded. “First, let me tell you two of the other members of my personal guard are missing this morning, Marissa and Benjamin.”</p><p>“What?” Richard hissed in a breath sharply. “And Christian?”</p><p>“Christian has been cooperating. He seems pretty scared, and rightly so. He knew their plans but he claims he had no part in any of it, and he was too frightened of the others to come to me.”</p><p>“Do you believe him?” Richard’s voice had turned hard and grim.</p><p>“I’m not sure yet. There’s no excuse for his disloyalty. He’s being held downstairs until I can question him further.” Kevin remembered Tucker telling him the basement held prison cells. He remembered something else Tucker had told him.</p><p>“Tucker had a bad feeling about the guard. Especially that one woman, Marissa.”</p><p>“I know,” Gavin said, his voice sounding tired. Kevin wondered if he’d been awake all night and figured he had been. “Tucker has been right about Marissa all along, it seems. I should have listened to him.”</p><p>“Tucker has good instincts,” Kevin said. “What did you find in Todd’s room?”</p><p>“Crazy ramblings, mostly, in a book he was writing, a kind of manual for what looks like a military style coup.”</p><p>“A coup? Like a takeover?” Richard’s voice was unbelieving. “Are any of them alpha?”</p><p>“No, and that makes it even more strange. It looks like his father put a lot of this in his head from what I read.” He turned toward Kevin. “Todd’s father was alpha and our previous alpha’s battle commander for many years. He was killed a few years ago fighting the Hunters. Todd’s writings implied that in his opinion, all the natural pets, like Tucker, for example, are defectives, every one of them, both physically and mentally. At puberty, when the change came over the rest of the pack, turning them into wolf shifters, the ones who weren’t able to shift should be, in his opinion, put out of their misery. They should be mercifully destroyed, and not left to suck the life out of the rest of the pack, their useless lives a drain on the pack’s resources...his words, by the way, not mine.”</p><p>“That’s the craziest thing I’ve ever heard of,” Richard interrupted, his face furious.</p><p>“Apparently, Todd’s grandfather before him had been of similar mind, and you realize, this is going way back, hundreds of years. When one of his father’s own siblings had failed to develop naturally into a shifter, she was simply smothered in her sleep. His grandfather felt it was his duty and his responsibility as her parent. In his opinion, one he had passed on to his family, so-called natural pets had failed to develop normally. Failure to deal with such aberrations was a weakness. In the wild, defective offspring simply didn’t survive. It was the natural way.”</p><p>“This is complete drivel! The fucking bastard was insane,” Richard’s face was even darker red by now, and Gavin was nodding.</p><p>“In Todd’s mind,” he continued, “and that of his brothers and cousins, too much fraternization with the weaker humans and pets was the reason the Hunters had been able to pose such a threat to our race for so long. His grandfather’s teachings had told them that in centuries past, the wolves were the most powerful species on the planet. Humans were for subjugation and existed only to serve the wolves in whatever capacity they were granted. Somewhere along the line, a grievous mistake was made by allowing humans and so-called natural pets to breed with the wolves, thus weakening the wolf blood line. It had become so mixed and so thin over time, in fact, that wolves no longer had the bloodmatch with each other, or at least only rarely. Now routinely wolves had a bloodmatch with a defective pet or a human. Even his own alpha,” Gavin paused with a grim smile. “That would be me, of course, what he called the strongest wolf in the pack, and I succumbed to one of the abnormal creatures. The other alphas of the Mountain packs had taken humans, all except one, and Todd pinned his hopes on that alpha’s strength and the strength of his blood.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Who? Casey over in North Carolina? The battle commander?”</p><p>“Yes, that’s the one. He mated with another wolf a couple of years ago, if you remember, Rory. From what I hear of him, he’s extremely dominant.”</p><p>Richard nodded, and Gavin continued. “There would be no easy way out of the mess their ancestors had created, Todd decided. They must eradicate all of the defective natural pets by any means possible. It was the doctor in charge of the Hunters who had given him the idea of getting rid of the pets, the one who attacked Tucker after our ceremony. Along with some of the methods he’d used on the two alphas’ mates, Tucker and Nicky.” Gavin turned again to Kevin to explain. “This so-called doctor injected both of them with powerful drugs to make them do his bidding. This is what Todd and his followers had in mind for the alphas.</p> <p>“Once they had them enslaved to the drug and ready to be used as breeding stock, then a strong leader, perhaps one who was mated with a wolf, like the alpha Casey, could take over, and change things, perhaps even in their own long lifetime. In the meantime, a new breed of wolves would be born, wolves that came from two wolf parents. Since the alphas were the strongest, they would supply the sperm to create the new breed, and the guard could control the alphas with the drugs. It would take time, of course. The alphas still had many loyal followers, many more than their small group. But he thought they would soon come around to his way of thinking when they witnessed for themselves the beautiful, strong children produced by the matings. They’d keep it quiet, too, about what they were doing to the alphas. They’d put out the story that they were caring for them in their grief over their mates. Because that’s another thing they had planned. The alphas’ pets would all be killed to make way for more suitable mates. Anyone who objected would be exterminated as well.</p><p>“Then it would be time to take care of the natural pets, a painful but necessary process. They’d be rounded up and put into extermination camps. An edict from the new alpha to never again breed humans should take care of the rest of it over time. Human pets could be taken and used as submissive love slaves, to slake the appetite caused by the bloodmatch, but nothing more. No more giving them the status of mates. That’s what his grandfather had done, all those many years ago. He bred his children with a female wolf, using a human woman who was his true mate only to assuage the frenzy of the bloodmatch, and if any of his children failed to develop normally, he dispatched them. Over time, he theorized the bloodmatch would right itself, and go back to the way it was in the beginning, with wolves only mating other wolves. This would be the new order.”</p><p>“My God,” Kevin said softly. “It sounds like something out of Nazi Germany.”</p><p>“Which greatly influenced Todd’s father, according to what I can find out about him. All of that was happening when he was a young man, of course. He was an admirer of the German Chancellor, according to what Todd wrote.”</p><p>“Don’t tell me Marissa and the others bought into this bullshit,” Richard said.</p> <p>Gavin nodded. “Unfortunately, it seems they did. Or maybe, like Tucker says, Marissa had her own agenda. But there are others too, all of them in the alphas’ personal guards. In fact, there’s a whole network of them in each of the three packs, though their numbers are small at the present, according to what Christian’s been able to tell us. I was on the phone to the other alphas early this morning to advise them of the traitors in their own packs. We were concerned about Casey at first, but Marco has spoken with him, and he just called to tell me he’s convinced he wasn’t a part of any of it.”</p><p>Richard ran a hand over his face. “I can’t believe any of this. Was Marco able to make any arrests?”</p><p>“No, and that’s what’s worrying me. Apparently, Marissa and Benjamin warned them all, during the confusion after Todd’s death, and this morning several guards were missing from each of the packs. They’re hiding somewhere, and we need to find them.”</p><p>Richard rose to his feet. “What are we waiting for?” Gavin grinned and for the first time, Kevin saw something in both men’s eyes that wasn’t quite human. He shuddered and Richard bent down to him, pressing a quick kiss to the top of his head. “Go up and sit with Tucker. I’ll put a guard on both of you until we get back.”</p><p>“Good,” Gavin said. “We need to track them down, and I won’t rest until they pay for what they’ve done.”</p><p>Chapter Eight</p> <p>“It’s no use, Tucker. I can’t go through with some crazy mating with Richard. I won’t do it.” Tucker stared back at Kevin, a disapproving look on his face. They were in Tucker and Gavin’s room, on a leather sofa that looked exactly like Richard’s. Kevin wondered if the pack had gotten a deal on them, or something, though they didn’t seem to be hurting for money. It was more likely they just weren’t all that interested in the décor, or at least Gavin and Richard weren’t.</p><p>It was three days after the attack on the night of the blue moon. Though the pack hadn’t given up, no trace of the missing guard members could be found. Christian had cooperated, but he claimed not to know of any escape plan. He claimed Marissa was in charge of that aspect of their plans, and she had still been working on them when Todd jumped the gun.</p><p>Why he’d attacked Tucker like he had, before any of their plans were solidified was still a mystery. Maybe the madness that was so evident in his writings had overpowered him when he had the alpha’s pet within his grasp. Christian had been at a loss to explain it, saying he knew they were making some plans, but he’d been under the impression they were as yet unformed and certainly not imminent. The jury was still out on what was to be done with Christian. His mate, Emily, had vowed to stay with him if he were to be banished, and her family, powerful within the pack, was lobbying for greater leniency since Christian had cooperated.</p><p>Richard had been so busy searching for them, Kevin had seen very little of him over the past few days. He couldn’t believe how much he missed him, and it was pissing him off. He didn’t want to feel this way. He was still trying to come to terms with what he’d learned about the group. He could almost laugh now to think he believed they were a cult; how he wished it were that simple.</p><p>For the past two days, Tucker had been pressuring Kevin to submit to a mating with his father. “I don’t understand, Kevin. I know you care for him. Dr. Cornsilk said he was your bloodmatch.”</p><p>“I might care for him, but I’ve known him for a week. A week, Tucker. There’s no way in hell I’m going to commit myself to someone I’ve known that long, so you can stop trying to talk me into it. And if you think I’m just going to blithely ignore the fact he’s a shapeshifting wolf, for Christ’s sake, you’re crazy.”</p><p>“Well, no relationship is perfect,” Tucker said with a grin. At Kevin’s rolled eyes, he laughed out loud. “C’mon, Kevin, you know I struggled against it too, but he’s your match. Admit it. Didn’t you feel an immediate attraction? God, when I first met Gavin, I had sex with him within the first thirty minutes.”</p><p>“Yeah, but that’s because you’re a slut.”</p> <p>“True enough.” Tucker laughed and punched his friend. “Asshole.”</p><p>Kevin laughed along with him for a moment and then turned serious, running a hand through his hair. “I’ve got to get out of here, Tucker. I’ve got to.”</p><p>“Nothing has changed along those lines, Kevin. They won’t allow you to leave.”</p><p>“Damn it,” he yelled, jumping to his feet and crossing to the window. “How did I get myself in this mess?” He turned around and faced Tucker. “And don’t apologize again. It was my own stupid fault for coming here. I know that.”</p><p>“Maybe it was meant to be. Like fate, or something. If you hadn’t come, you never would have met my father.”</p><p>“Oh damn, don’t even remind me. You realize I would be...what, your step-father? Shit.”</p><p>Tucker laughed, a happy sound that Kevin had missed. Grudgingly, he smiled back at him. “Maybe I’m scared, Tucker. Not of Richard, I don’t mean that. But of what he’ll want from me. Total commitment, of course, but not only that. He’s going to want me to...” He turned back to the window. “Shit, how can I even talk to you about this?”</p><p>“It’s awkward, I know.” Tucker shrugged. “But it’s not like I grew up with him as my dad or anything. He feels more like a brother, in a way, you know? An older, very stern brother...” He laughed again. “That’s um...that’s it, isn’t it? How...uh...controlling he is? I know he’s pretty old school.”</p><p>“He’s a fucking Dom, Tucker, if you people use that word. The way he...the things he makes me...” He blew out a long breath. “Damn it.”</p><p>“Look, you don’t have to tell me the details. I don’t even need to go there. God, you’ve seen how Gavin bosses me around, and he’s mild compared to most of the wolves, so I know exactly what you’re talking about. You...you don’t respond to it?”</p><p>Kevin sighed and pressed his forehead against the window. “I don’t know what I’m doing, Tucker. I do respond to it, but I’m just not sure if I want that for the rest of my life. We’ve been having sex since the first night I came here, and he’s been a toppy bastard since the first time. Sometimes I...hell, I don’t know if I can be what he needs, though I want to be. I’m not what he wants, I think.”</p><p>“There’s only one way you’ll find out,” he said quietly. “Try submitting to him, completely. You’ll know if it’s right for you.”</p><p>“I-I don’t know if I can do that. I mean, I pretty much have already, but there’s a part of me that’s holding back, and I know he can feel it.”</p><p>“Why don’t you let him worry about that? Submission isn’t about weakness, you know. It’s supposed to be an exchange of power. It is with me and Gavin. Or is it that you’re afraid you’ll like it too much?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kevin turned around and glared at his friend. He could feel his face flame with heat. “Fuck you, Tucker.”</p><p>“Oh, fuck you too, Bryson. Face it, you’ve never had a relationship that lasted more than a couple of months, and you’re what? Thirty-four? There’s something going on with you, Bryson, and maybe it’s that no one has really satisfied you before. No one has taken care of what you really need. But Richard has come pretty close, hasn’t he? So close you’re scared to death.”</p><p>“You don’t know what the hell you’re talking about.”</p> <p>“No? You started getting interested in me when I told you I thought I liked to dominate. I used to go to the clubs in Fort Walton, but you’d never go with me. What was it you were afraid of?”</p><p>“Who said I was afraid of anything?” He fidgeted for a few moments before turning and walking toward the door. “This is stupid. I’m going back to my room.”</p><p>Tucker laughed. “You can run, but you can’t hide, Bryson.” Tucker’s laughter followed him down the hallway as he slammed the door behind him and went into his room. He threw himself on the bed, and stared up at the ceiling. How the hell could he even be considering this shit? He turned over on his stomach and closed his eyes, anger radiating off him in waves. He was bored as hell and needed exercise, and the one thing he didn’t need was to be cooped up inside this damn room like a fucking prisoner.</p><p>The door opened behind him and he heard Richard’s low whistle. “Nice view, baby. I could get used to being greeted this way every day.”</p><p>“Very funny,” Kevin said, not turning over. “Don’t start shit with me today, Richard. I’m not in the mood.”</p> <p>“Really? I never would have noticed.” Kevin heard him walk over to stand beside the bed. “I’ve been talking with Tucker. He told me where to find you.”</p><p>“Yeah, well, where else would I be? I don’t exactly have the run of the place.”</p><p>“Tucker said you were in a pretty foul mood.”</p><p>“Whatever...”</p><p>A slap on his ass made him spin around so fast he almost fell off the bed. “Cut it out. I don’t want to play this shit, damn it.”</p><p>Richard stared down at him. “Who’s playing? Get up and pack a bag. Take your toothbrush and a change of clothes. I’m heading up to a cabin on the high ridge, and you’re going with me.”</p> <p>“What?” He noticed for the first time that Richard had a small backpack slung on his shoulder.</p><p>“You heard me. I was going to have a couple of gammas check it out, just to make sure none of the guard was up there, hiding out. Instead I think I’ll take the four-wheeler and take you with me. I’ll tell Gavin we might be gone a couple of days.”</p><p>“Why?”</p><p>“Because we need some time to figure out some things between us.”</p><p>“Like what?”</p><p>“You know the issues between us, Kevin. I don’t have to spell them out. You’re not the only one with doubts, you know.”</p><p>Kevin sat up, feeling unreasonably irritated. So Richard had doubts, huh? “All I want to do is go back home and forget all about this. Then you don’t have to worry about me or about your damn doubts.”</p><p>Richard smirked at him. “Oh, you don’t like that, do you? The fact I might not be willing to go through with this either.”</p> <p>“Well, who the hell asked you, anyway? It sure as hell wasn’t me.”</p><p>“Shut up and get on your feet. We’re leaving.”</p><p>“Fuck you. I’m not going anywhere.”</p><p>“Don’t press your luck, Kevin, or I’ll throw you over my shoulder and haul you out of here. Up to you.”</p><p>Glaring at him, Kevin got to his feet and stomped into the bathroom, grabbing his toothbrush and toothpaste and razor. He stood in the doorway with the items in his hand. “Guess I’m ready. I don’t exactly have a lot to take with me, you know. You stole my suitcase, so I don’t know how I’m supposed to pack.”</p><p>“Smart ass. Put them in my pack and grab some jeans. I know Tucker brought you some.”</p><p>Kevin went to his dresser and got the jeans and another T-shirt, then brought everything over to throw it down on the bed beside Richard. He shot Kevin an exasperated look before scooping them up and stuffing them down in his bag. “Okay, come on. We’re out of here.”</p><p>Kevin may have been following Richard down the stairs and outside to the shed to find the atv, but he was anything but cooperative. The sullen expression on Kevin’s face told Richard he wasn’t prepared to do much of what he told him to do—at least not without a fight.</p><p>Hell, Richard had always liked a challenge. And it was time to do what he’d wanted to do for a long time. It was time to finally break through Kevin’s barriers for good.</p><p>It took about thirty minutes to travel up the dirt road at the back of the lodge that led up to the small cabin on the ridge. They had traveled up the deeply rutted road that was little more than a wide trail through the woods, really, through the dense woods that surrounded the lodge. All along the way, they were treated to beautiful mountain vistas as they climbed the ridge and came out on spots where the trees weren’t quite as thick. By the time they finally reached the small clearing where the cabin was located, Richard figured Kevin was probably tired of bouncing around on the back of the four-wheeler.</p><p>Richard pulled around to the front of the cabin and turned off the engine, allowing Kevin to climb off the back and take a look around. The log cabin was tiny, only one room, and situated near a small stream, about fifteen yards away. He could hear it babbling over the rocks.</p><p>“Stay here,” Richard warned, as he climbed the rock steps. “I don’t see any signs of anyone being here, but let me make sure.” He disappeared inside to take a quick look around. No sign that anyone had been there recently, and no fresh scents. He returned in a minute or two to beckon Kevin inside.</p><p>He watched as Kevin looked slowly around. The interior was even more rustic than the outside, with the log walls, pinewood floors, and a rock fireplace along one wall. It had a musty, unused odor, and no kitchen or bathroom, just an old wooden table and chairs, a couple more chairs by the fireplace and a double bed along the opposite wall.</p><p>Tucker had told Richard before they left that Kevin had never been one for roughing it. He frowned now and crossed his arms. “Not exactly the Taj Mahal, I see. And where the fuck are you going to sleep? That bed is only big enough for me.”</p><p>Richard ignored him, stepping around him to throw his backpack on the bed and then moving around the room, opening windows to air the place out. He went over to a chest by the foot of the bed and pulled out some clean sheets for the bed and threw them at Kevin, who barely got his arms up in time.</p><p>“I’m going to check the perimeter for any signs they might have been here. Put the sheets on the bed and build a fire while I’m gone.”</p><p>“Wait a minute. You’re taking the four-wheeler? When are you coming back?” Richard heard a tone of whininess in Kevin’s voice that made him smile. He hid it before he turned back to him. It would do Kevin good to feel a little off kilter and out of his element, and make him rely on Richard just that much more. He wanted him to let down that rigid guard of his.</p><p>Richard grinned at him. “Don’t worry, I have no intention of leaving you here alone, though it might do you some good. Make you realize how nice things are at the lodge you’re always complaining about. I’ll be back in probably twenty or thirty minutes. Now make the bed and start a fire, like I told you.” He turned and left just in time to miss the sheets that hit the door behind him, along with what sounded like a chunk of wood from the fireplace. He chuckled as he went down the steps.</p><p>He drove back down the trail about a quarter of a mile before parking the vehicle on the side of the road and checking the perimeter of the cabin on foot. Looking for any signs the missing guard could have been there, it didn’t take too long to discover no one had been in the area recently. He hadn’t thought they would come here, or he’d never have brought Kevin along with him. The hunting cabin was too well known and was used far too frequently for them to use it, but he needed to be sure. Also, he wanted to spend some time with Kevin. Tucker told him of Kevin’s unsettled mood. It was time for Richard to claim his mate.</p><p>As the light waned, a breeze began to pick up and the evening turned cool. Knowing his boy would be getting nervous, he drove back along the trail and saw Kevin sitting on the rock steps out front. He crossed his ankles and leaned against the railing as Richard drove into the clearing, probably trying to appear casual and unconcerned. Richard got off the atv and came toward him, stopping when he reached the bottom of the steps. His gaze roamed over Kevin’s body before he spoke. “I don’t see any smoke.”</p><p>“Did you actually expect me to start a fire? Who do you think I am, Paul Bunyan?”</p><p>Richard stood regarding him for a few moments. The evening was quiet around them, the only sound was the water splashing over the rocks by the stream. He could tell it was getting late, though it stayed light until late in the evening this time of year. Kevin shifted nervously and spoke again to fill the silence.</p><p>“What is there about me that would give you the idea I could start a fire without matches? Or at all, for that matter. I’m a Florida boy. We don’t have a lot of fireplaces or any need for them.”</p><p>Richard didn’t reply, just walked past him into the cabin. Kevin followed him inside and stood behind him at the fireplace, watching him as he carefully stacked his wood. He put some smaller pieces underneath the stack and then stood up and opened a drawer in the small table by the fireplace, extracting a box of matches, which he held up and shook mockingly. He lit one, touched it to the kindling and carefully poked at it for a few seconds until it caught up. He stood up and faced Kevin. “You’re not going to learn how any younger, you know. It isn’t brain surgery.”</p><p>“Yeah, well, who says I want to learn anyway?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Richard crossed the room and sank down on the side of the bed. “Why are you acting like this, Kevin? Trying to prove something to me or to yourself? Or are you asking me to do something about it?”</p><p>Kevin clenched his fists. “You go to hell.”</p><p>Richard smiled. “Get down on your hands and knees. Your ass toward me.”</p> <p>“Why? So you can bully me?”</p><p>“Your choice, baby—the easy way or the hard way?”</p><p>Kevin hesitated for a long moment while Richard held his breath. It was a total bluff, not because he couldn’t easily handle the smaller man, but because he didn’t want an unwilling partner. He believed Kevin needed this, and had been asking for it all day, but he had to make sure. Then with only a trace of hesitation, Kevin turned his back and dropped to his knees between the bed and the table.</p><p>Just because he’d obeyed didn’t mean he was happy about it. Every muscle in Kevin’s body was tense and resistant, and he glanced back over his shoulder at Richard and literally snarled at him.</p><p>Richard smiled, liking the challenge. He sat on the bed for a few more seconds, deciding how to proceed until Kevin growled again. “Damn it, do something. Do you expect me to stay here all night?”</p> <p>“Only if I tell you to,” he replied. He gave him a hard smack on his ass. “Now shut up like a good boy.”</p><p>Richard stood up and opened his backpack, pulling out a pair of leather cuffs. He walked around to stand in front of Kevin. The second he caught sight of them, he immediately balked, as Richard thought he would. “Hell no, Richard.”</p><p>Richard had already decided he wasn’t about to give him a choice. Kevin needed someone to take his choices away. “Give me your wrists,” Richard said softly.</p><p>“Not going to happen.”</p><p>Richard leaned over and slapped his ass again, hard enough to make him jump. “Are you done? Because we can do this all night if you want to.” Kevin pressed his lips together and looked up at him through a fringe of hair, and the sight of Kevin on his knees in front of him, that sultry, sullen look on his face lit a fire in Richard’s groin. When he lowered his eyes again, Richard knew they were almost there.</p><p>Richard pulled Kevin’s wrists up and over toward the table leg. He wrapped the cuffs around the table leg and then attached them to his wrists. Kevin could move up and down the leg, but he wasn’t going anywhere else. The table was old, but heavy, made of solid chunks of wood. He watched while Kevin struggled with the idea for a moment, even trying to lever the table up with his shoulder. He could move it, but couldn’t get it off the floor far enough. When he realized he was securely shackled there until Richard decided to let him go, he pulled hard at the cuffs, getting angry. “Let me go, Richard.”</p> <p>“No.”</p><p>Breathing hard, he turned to look at him. “Please.”</p><p>“Begging won’t help, baby. You have some apologies to make and a few lessons to learn first.”</p><p>He came around behind Kevin and jerked him effortlessly to his knees with one hand while the other pushed his shorts down past his knees. He pulled them off all the way, then, leaving him naked below the waist. He took some lube from his back pack and laid it on the floor beside Kevin while he stripped off his own clothes. Still on his knees, Kevin turned to watch him uneasily. “I don’t want this.”</p><p>“Then tell me to stop. One word and it’s over. Is that what you want, baby?”</p><p>Kevin turned his head back around, biting on his lower lip. Richard grabbed his chin and turned his face around. “Want me to stop?”</p><p>Kevin blew out a long breath. “No.”</p><p>“Then tell me how sorry you are for being such a smartass all day.”</p> <p>“Sorry,” he mumbled.</p><p>“And for throwing things at me and not even trying to start a fire?”</p><p>“Okay. I’m sorry, all right?”</p><p>“Now tell me why you did it.”</p><p>He raised his head, a look of confusion on his face. “What? I don’t know...I just...”</p><p>“Just what?”</p><p>“I was mad, all right?” The sullen, belligerent look was back on his face.</p><p>“Because you thought I wasn’t giving you enough of my time? Because you wanted my attention, but you didn’t know how to ask me for it?” He splashed some lube over himself. Putting more on both his hands, he wrapped one hand around Kevin’s dick, slowly stroking it from the base to the head, while the other hand went to his crease.</p><p>Kevin cried out with the overload of sensations, and another look of confusion swept over his face. “I...I don’t know. Please. Please, Richard.”</p><p>“Please what, baby? That’s it, isn’t it? Because you can’t ask me, can you? That would be admitting you like what I do to you. You like the idea of being under my control. Despite everything, you like it all. Being dominated. Feeling like you have no choice. Feeling like I was neglecting you if I didn’t have you under me. You want me to pay attention to you. You want me to fuck you and take all your choices away, kind of like now, don’t you? That way you’re not to blame for any of it. You’re not staying with me because you want to, but because I’m making you, isn’t that right?” His hand was moving faster, up and down his rigid shaft. Richard bent over and bit him gently on his shoulder, at the same time inhaling that perfect scent. Pleasure and pain, that’s what Kevin wanted, and that’s what he’d give him.</p><p>Richard was dragging an orgasm out of him, and Kevin threw his head back against his shoulder, groaning and breathing fast. “Then you can go back to your life in Florida and play it safe. You can pretend you like to top all the time, and pretend you’re independent and don’t need anybody. Don’t need me, more than you need to breathe.” He’d been jacking Kevin hard and now he gave a final twist while sticking a finger up his ass and finding his prostate. Kevin screamed and came so hard he was left shaking and trembling in Richard’s grasp.</p><p>Before he had time to recover, Richard bent him back over on his knees, pushing him down on his elbows, so his ass was right where he wanted it. He entered in one thrust, making Kevin cry out again as he buried himself up to his knot. He put his hand under Kevin’s body and found his softened cock and wrapped his hand around it again, moving the skin up and down, probably painfully now since Kevin had just come. He whimpered, but Richard ignored him. “You almost admitted it to me once,” he said, whispering in Kevin’s ear. “You told me you liked it rough. Is this rough enough for you, baby?”</p><p>“God, please, Richard.”</p><p>“Admit it to me first. Admit you like this. For once and for all, tell the damn truth.”</p><p>Kevin groaned and started to sob, and Richard knew he was close to finally admitting it, finally asking for what he needed without shame or guilt. “Yes,” he whimpered. And then louder, “Yes, I need this. I need you. Please.”</p><p>Richard thrust hard into him then, over and over until they both came. Afterward, while the aftershocks still shook them both, he lay on top of Kevin and stroked his back, trying to catch his breath. He reached up and released the cuffs and pulled him into his arms. He came willingly, wrapping his arms around Richard’s waist, and hooking a leg over his, pressing his whole body close.</p><p>When he could talk again, Richard murmured in his ear. “I’m going to mate with you now, Kevin. Are you ready to give yourself to me?”</p><p>Kevin nodded, burrowing his face into his shoulder.</p><p>“You know what this means? It’s forever, and I’ll never let you go. You’ll live as long as I do, and you’ll drink my blood from time to time to stay healthy, but that means you can never leave me. We’ll always be together from this point on. You understand?” He pulled Kevin’s face away from his shoulder and stared down at him. His face was smooth and relaxed, and he looked more at peace than Richard had ever seen him.</p><p>“I understand,” he said softly.</p><p>“Thank you for giving yourself to me, Kevin. I look on it as a precious gift, and I’ll try never to betray your trust.” He kissed him tenderly and held him close for a while. But he was unable to wait much longer. He’d waited so long already for this time to come.</p><p>Richard stood up and carried him to the bed. Knowing Kevin was already stretched from their lovemaking, he still lubed him well, and then, turning him over on his side, he sank his teeth deeply into Kevin’s neck, causing him to cry out again. He entered him before his cries died out, easing his way in at first, and then as he met resistance to the knot, pushing harder, maneuvering his hips until he felt it slip in. Kevin gave a hoarse shout and began to have another orgasm immediately, due to the chemicals secreted by the knot and the stimulation to his prostate. Holding and petting him through it, Richard settled himself for a long night.</p><p>The knot would tie them together for at least an hour or more while Kevin had multiple orgasms. He’d be in heat even after it was over, and he’d have to be patient with him and love him through it. Richard would only be able to hold him close and soothe him. He kissed the back of Kevin’s neck again and held him tightly in his arms, shuddering a little at the realization of how much he meant to him. Kevin held more power over him than he could ever dream of.</p><p>Richard would care for him always, just like he would tonight. Because he’d finally found his home again, and from this time on, neither of them would ever be alone.</p><p>Epilogue</p><p>Sitting on the edge of the little stream, Kevin laughed as he saw Richard’s gaze shift toward him and held up both hands. “No, please, don’t even think of pulling me in. It’s too cold!”</p><p>Richard smiled at him. “Don’t worry. I have no intention of scaring away the fish.” He held up a string of trout. “Although, I probably do have enough for dinner tonight.” He waggled his eyebrows up and down and came toward him, but Kevin jumped up and ran up the bank.</p><p>“Stop right there,” he pleaded, his back against a big tree. “These are the only dry clothes I have left.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Richard came up and put his arms around Kevin’s waist, burying his face against his neck. “Mmm, but who said anything about you wearing clothes? I think they’re highly overrated in your case.”</p><p>Kevin distracted him by catching his chin and bringing his face around for a soulful kiss. “If you don’t throw me in, there might be a blow job in your future.”</p><p>“Oh yeah?” He swung him up in his arms and started for the stream. “Can we firm that offer up a little bit?”</p> <p>“Yes, yes, okay! Definitely a blow job!”</p><p>Richard laughed again and sat down with him in his lap. He pulled him around to straddle him. “Still sore, baby?”</p><p>Kevin dropped his gaze. “Only a little.” It had been two days since their mating, and for most of the day before, he’d been a little out of his head as the chemicals from the bite and the knot worked their way through his body. He remembered only snatches of the time, but what he did remember made him blush. He remembered begging to be fucked, begging to suck Richard’s cock, and feeling absolutely insatiable. This morning when he’d awakened, he was feeling almost back to normal, though his ass ached abominably and Richard had heated up water from the stream and made him sit in it and soak for a while before putting a soothing cream on him. He’d been embarrassed beyond belief, but felt cared for and cherished at the same time.</p><p>“What will happen now?” he asked quietly, running his fingers down Richard’s jawline.</p><p>“Well, if you agree, we’ll go back to your home long enough for you to resign and decide what to do about your condo. You’ll need to decide what you want to bring with you, and we can get you moved into my quarters in the lodge. We’ll decide about your car too, and then if you want to sell them, we can open you an account at the bank in Sylva. I think that’s what Tucker’s going to do. He still likes the idea of having his own money, though he doesn’t need it.”</p> <p>“I like the idea too, at least for now. I might need it one day to open a business with Tucker, or even take care of my parents later on.”</p><p>Richard nodded, and started kissing up the side of his neck. Since that was bound to get out of hand pretty quickly, and Kevin still had things to talk about, he pulled away and put his hands on Richard’s shoulders. “And a commitment ceremony like Tucker’s? Will we have one of those?”</p><p>“Not exactly like Tucker’s ceremony—not nearly so formal. That’s for the alphas really. We’ll definitely have one, only not so elaborate.”</p><p>“Good. I like that.”</p><p>“Then that’s what we’ll do.” He leaned in for another kiss, but Kevin stopped him again.</p><p>“What about the guards? Will you have to go away and search for them?”</p> <p>“Not me personally. The three packs are forming a search party to look for them. Normally, we’d only banish them for wrongdoing, but this is more serious. They seem to have a grudge not only against our pets but against humans. We can’t let that slide. We’ll have to hunt them down and exterminate them.”</p><p>Kevin shivered briefly, and Richard wrapped his arms more tightly around him. “It’s nothing for you to worry about now, baby. I’ll always take care of you.”</p><p>“Yeah, well, I can take care of myself, and you too, if you give me back my gun.”</p><p>“Duly noted. I’ll see you get it back right away. It would be good for Tucker to carry his too, until we can get this under control.”</p><p>“And just one more little item to clear up...”</p><p>Richard rolled his eyes. “Are you always going to be this much of a pain in the ass?”</p><p>“Probably, yes. But don’t change the subject. I want to know what you meant before we came up to the cabin about not being so sure you wanted to go through with our mating either.”</p><p>“Oh, you remember that, huh? It’s the bloodmatch thing, baby.” Stroking Kevin’s arm, Richard got a distant look in his eyes. “I lost my first mate, and I don’t think I could survive it again. The pain was like nothing I’ve ever felt before or since. If anything ever happened to you...I couldn’t go through it again, and that scares the hell out of me.” He looked so sad that Kevin squeezed him a little to remind him he wasn’t alone anymore and that Kevin was right there with him. He nuzzled his face in Richard’s neck.</p> <p>“It scares the hell out of me, too, but what’s the alternative? To go through life never having what we really need because we’re afraid to take a chance? That’s what I was doing, and I wouldn’t ever go back to that again.”</p><p>“You deserve to be happy, baby,” Richard said, kissing him gently on his forehead.</p><p>Kevin grinned at him, and put his hands on Richard’s zipper, slowly unzipping his jeans. “You know what? I think we both do.”</p><p>The shadows lengthened by the little stream, but Kevin couldn’t be bothered to notice much. His only thought was that, just like in the story the old woman had told the night of the blue moon, neither of them would ever have to spend the night alone again. And that was the last rational thought he had for a long, long time.</p><p>*THE END* </p> </body></html>"]