["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>It was crazy. The worst possible idea imaginable. She had spent three years denying the desire, denying the truth of her own feelings. If she walked up to that room, then it would change things forever.</p><p>Marey pulled her little car into the parking lot of the motel and stared at the exterior nervously. Was she brave enough to do it? Could she actually walk in there and give in to all the desires she had kept hidden all her life, and then walk away as though it had never happened?</p><p>Her hands gripped the steering wheel, her fingers curling around it in a death grip as she fought the tremors that quaked through her body. She didn’t know if she could do it. She had spent too many years fighting it. Unlike her friends, the merry five who had entered into marriages with infamous Trojans, Marey knew she likely didn’t have what it took to carry this off.</p> <p>It was one night, her hormones screamed at her. One stupid night of wild, hot sex, stop philosophizing over it. She could do this.</p><p>Couldn’t she?</p><p>Of course she could. She was thirty-five, not twenty, and she hadn’t been a virgin for a long time. Damned good thing, she reminded herself—Saxon Brogan would terrify a virgin.</p><p>She laid her head against the steering wheel, groaning pitifully as she tried to force herself from the car. Wasn’t this what she wanted? she reminded herself. One hot, wicked night with the man of her dreams before reality came with the rising sun and she went back to the staid, sterile life she lived.</p><p>Why? Something snapped within her then. Why did she have to return to anything? There was no husband. No children. No parents to catch her in some naughty act. All she had were her friends. Friends that one by one had fallen into the clutches of a lifestyle that Marey might not understand, but didn’t condemn. And it wasn’t as if she was doing anything illicit.</p> <p>She ignored the flashing thought of the underclothes she was wearing. Or those she wasn’t wearing, she reminded herself.</p><p>She could do this. She raised her head, nodding firmly. There was no law that said the man who fucked you had to love you, was there? Of course there wasn’t. Besides, she loved Sax. The admission was one she rarely allowed herself to make. One she hid from herself as much as possible.</p><p>Fear had held her hostage for years. The fear that her ex-husband, Vince, would finally slip his hold on sanity and kill her. The fear that she was making another mistake, that her heart would pay the price this time. Her pride had been sacrificed to her ruined marriage and Vince’s fury. But her heart. If Sax broke her heart, could she survive it?</p><p>She breathed in roughly. She would have to survive it. Now, dammit, she had waited too long. Fantasies could only sustain a woman for so long, and toys were a poor second to what she knew was waiting for her.</p><p>Sax, with his quirky little smile, his dark eyes, his voice whispering his need for her. The sight of his hands, so much darker than her pale flesh, coasting over her body, bringing her a pleasure she had never known before. Dominant, commanding, he was part of the exclusive men’s club that had been nicknamed Trojans. They were dominant, forceful, but even more, they practiced sharing their women, bringing them to heights of arousal that were rumored to leave their women weak for days.</p><p>Her friends had married into the club. And though getting details was like pulling teeth without anesthesia, she had managed to pry out enough to fuel her own midnight fantasies.</p> <p>Was she brave enough? If she could fantasize about it, then surely she had the courage to do it. To go to Sax and take the pleasure she knew awaited her. To see if a future was possible, if the fantasies were a pale excuse for reality, or vice versa.</p><p>She pried her fingers from the steering wheel, grabbed her small purse and opened the car door before she could change her mind. She was a grown woman. A mature adult. And if there was one man in the world who could trip her switches, it was Sax. So what if he didn’t love her, if he was miles out of her league. He wanted her. For tonight at least, she could be the woman she wanted to be, with no fear of gossip or reprisals.</p><p>Squaring her shoulders, she moved across the parking lot and up the stairs to the second landing. Room two twenty-nine. She pulled the key card from the side pocket of her purse and gripped it with tense fingers. Nerves shook her body, pounded through her bloodstream. Adrenaline was a crashing crescendo in her ears as she approached the door and drew in a hard, deep breath.</p><p>She could do this. She had waited years, lusting after a man she feared she couldn’t keep. Besides, it was almost Christmas—well, almost Thanksgiving anyway. She could treat herself to something a little different this year. Something hot and wild, something she could carry with her forever, no matter what the future might hold.</p><p>She slid the card into the electronic lock, waited until the light flashed green, then turned the handle slowly.</p><p>See, she could do this. She pushed the door open slowly, and stepped in before coming to a shocking, mind-numbing stop.</p><p>“What the hell happened?” Sax Brogan was enraged as he entered the ER, coming to a stop as James Wyman rose from one of the plastic seats and moved quickly to meet him.</p><p>He wanted to hit something. Someone. Every muscle in his body bunched, tightened with the impulse as the other man approached.</p> <p>An hour at the police department hadn’t improved his mood. Being suspected of physical assault and attempted rape had been more than shocking. When he learned who he was accused of assaulting, he had nearly lost his mind.</p><p>His only thought was to get to her, to make certain she was okay, to see with his own eyes the damage done.</p><p>“She’s conscious now,” James murmured as he reached him, then waved him toward the elevators. “They have her sedated, though. The injuries aren’t that bad, the concussion is mild. The doctor thinks she’ll be fine.”</p><p>“That crazy ex of hers?” Brogan clenched his fists, fighting his fury. He couldn’t believe this. It was inconceivable.</p><p>“Unfortunately,” James sighed as they entered the elevator. “The detective called a few minutes ago. They have him in custody now, but I don’t know if that’s going to help Marey when she faces you.”</p><p>Sax glanced back at James with a frown. The investigator had told him Marey called the station herself, giving a statement over the phone and securing his release.</p><p>“She knows you’re aware of what happened. That you know she thought she was meeting you in that motel,” he explained patiently. “You know how she is. She’s fought this thing between you two for too long. This isn’t going to help things.”</p><p>Sax remained quiet. He stared at the elevator display panel, ticking off the floors until the muted bell sounded and it came to a stop.</p><p>The bastard ex-husband had found her weakness, just as they had all known he would.</p><p>“She’ll get over it,” he finally said, reining in his need for violence. “Starting now.”</p><p>He had stayed away from her out of respect for her, because she had asked him to. Her soft voice, her gentle gray eyes had pleaded with him not to press her, and he hadn’t.</p><p>Squire Port, Virginia, home base for Delacourte and Conover Electronics was a small little community. Everyone was at least acquainted with every one else, and many knew each other well. Delacourte Electronics promoted a friendly, casual atmosphere with its employees and their families, and because of that, Sax had known Marey for years. Before the messy divorce and her withdrawal from all but her closest friends. He also knew her ex well enough to know that any relationship he began with her would be marred by the man’s possessive insanity.</p><p>“How did he know to use me?” He stopped at her hospital door, keeping his voice low as he glanced at James once again.</p><p>Sax knew he had been careful, very careful over the past years, to heed Marey’s wishes and stay away from her. He hadn’t liked it. Hell, he hated it to his back teeth, but he had respected her wishes. So how had Vince known she would drop her guard for a secret assignation with him?</p><p>“We don’t know.” James shook his head, shoving his hands in his pants pockets and staring back at him somberly. “We just don’t know, Sax. The police found a note, signed with your name, asking her to join you in that room. Her screams alerted a couple in the next room who called the cops. When they found her, she was unconscious. I think he meant to kill her.”</p><p>And blame Sax for the crime. Son of a bitch. He ran his hand over his shaved head and breathed out roughly.</p><p>“I have to make sure she’s okay,” he said roughly, his throat clogging with pain at the thought of what had been done to her. “I have to see her.”</p><p>“I knew you would.” James nodded slowly. “When she woke up, and Terrie explained what happened, she was horrified. She called the police herself. But she hasn’t said much since. She knows you’re coming.”</p><p>Sax nodded then reached for the doorknob. He turned it slowly, pushing the door open and stepped inside quietly.</p><p>Terrie, James’ sister-in-law, came to her feet, her face still damp, her eyes red-rimmed as she stared back at him.</p><p>“Come on in,” she whispered, glancing at the sheet-draped bed that Sax could only glimpse the bottom of. “She’s resting. For now.”</p><p>Sax entered the room, moving slowly as he passed the bed.</p><p>“I’ll be outside.” She patted Sax on the arm gently as she passed him.</p><p>As the door closed, he turned, swallowing tightly before allowing himself to see the damage done.</p><p>God help the bastard, he thought when he saw her face, because he was going to kill him. Her face was horribly bruised, her eyes and lips swollen. Sax prayed that Vince Clayton wouldn’t manage to get out of jail, because if he did, he was a dead man.</p><p>Her soft, pale blonde hair framed her face—a face he knew was softly rounded, inquisitive, stubborn.</p><p>“Looks bad, huh?” Her voice was raspy, groggy as she opened her eyes, the soft gray barely visible through the swollen lids.</p><p>It was all he could do to restrain himself, to hold back. He wanted to pull her into his arms, hold her against his chest and swear he would never let it happen again. That he would protect her, keep her safe. But he was smart enough to know she would never accept it.</p><p>“I’ll kill him, Marey.” He pushed his hands in his pockets, his fists clenching as rage ate through him. “I swear I’ll kill the bastard.”</p><p>Her breathing hitched as she grimaced painfully.</p><p>“It was my fault.” Tears clogged her voice then. “I should have known better.” A bitter laugh escaped her throat. “It was stupid of me not to check with you.”</p><p>He moved to the side of the bed, his chest tightening with emotion. He couldn’t believe this had happened, couldn’t conceive that anyone would do this to her.</p><p>He sat down slowly in the chair beside her, shrugging off his suit jacket and flexing his shoulders as he sighed wearily.</p><p>“I’ve considered it a time or two,” he finally admitted with a grimace. “Actually, kidnapping you and tying you to my bed for a week was my favorite fantasy.”</p><p>A short, groggy little laugh left her throat. “Trojans and their whips and chains,” she said with a little sigh.</p><p>He picked up her hand, noticing the flinch as he did so. It wasn’t from pain.</p><p>“Don’t.” She pulled back from him, swallowing tightly. “I’m sorry about what happened. I’m just sorry. But I can’t—”</p><p>“You came to that motel thinking I would be there,” he said gently, staring down at the soft creamy flesh he gripped in his much darker hand. “I wouldn’t have expected that, or I would have had you years ago. You can’t back out now.”</p><p>“I already have.” Despite the drugs and the pain, her voice was firm.</p><p>“You might think you have.” He picked up her hand again, his fingers holding it in place as she stared at where they met. “But Marey, I can be relentless. I won’t let you go now, not knowing this.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Panic flared in her eyes.</p><p>“And he will never hurt you again.” He leaned close, staring back at her intently, determination thundering through him. “Do you hear me? The bastard will never touch you again, because to do so, he will have to go through me. You’re mine, and when you get out of here, I intend to claim what belongs to me, Marey. Every sweet beautiful inch of you. Mine.”</p><p>Chapter One</p><p>One Month Later</p><p>“What are you doing here?” Marey leaned against the doorframe, staring up at Sax as he stood on the stoop, looking too damned sexy, too tempting for so early in the morning. “This habit of yours is getting on my nerves, Sax. This is too early in the morning to be out of the bed.”</p><p>In the past four weeks, if he had missed half a dozen mornings showing up for coffee and trying to wheedle breakfast out of her, then it would surprise her. And he was getting bolder. Touching her as she moved around the kitchen, stealing kisses when she couldn’t avoid him, laughing at her irate expressions and teasing her when the morning grumpiness got the best of her.</p><p>“You should be used to it by now.” His teeth flashed in a smile that made her pussy weep in loneliness as he stepped into the house, pulling the door from her grip and closing it softly.</p><p>He was going to drive her to an asylum before it was over with. The man was like an unstoppable force once he got something in his head, and since her attack, he had appointed himself her personal bodyguard whenever he deemed it necessary.</p><p>She sighed wearily. She was exhausted. Sleep was a thing of the past and paranoia whipped through the night like the rattle of ghostly chains.</p><p>“Vince call?” he asked as he moved into the kitchen, heading straight for the automatic coffeepot. She had learned to time it for his visits.</p><p>She stood still as the question filtered through her morning grogginess, holding her still in shock.</p><p>“How did you know he was released?” She frowned in irritation as she followed him. “And since when did you decide to just make yourself at home here?”</p><p>He pulled one of the mugs from a hook under the cabinet and poured the coffee with the ease of a man comfortable in his surroundings.</p><p>“Stop trying to sidetrack the conversation,” he retorted calmly. “Why didn’t you tell me when you found out he was released? It’s been a week.”</p><p>She pushed her hands deep into the pockets of her baggy flannel pajama bottoms and hunched her shoulders defensively.</p><p>“Because it was none of your business?” she suggested mockingly. “I didn’t make his bail for him and I’m not taking his calls. There’s nothing else I can do until the court date.”</p><p>“He’s been calling?” The cup lowered back to the counter as his voice lowered dangerously.</p><p>Hell. It was too damned early to deal with this crap.</p><p>“A few times,” she answered waspishly. “Let it go, Sax. You’re not my father or my husband.”</p><p>His eyes narrowed. The deep chocolate depths of his gaze sent a shiver of sensation through her. So far, he had been gentleness itself as she healed from Vince’s attack. He hadn’t really pushed her for anything other than breakfast, and though his sexuality was always present, he kept it reined in for the most part. She had a feeling, based on that look, it wouldn’t last for long.</p><p>“I’m not going to sit idly by while he beats the hell out of you again, either,” he informed her, his voice cold, his expression shuttered as he watched her. “And look at you, you aren’t even sleeping anymore. Do you think I don’t know what those shadows under your eyes mean, Marey? Why are you being so stubborn?”</p><p>She breathed out roughly as she stalked to the coffeepot herself. No one should have to deal with this without that first cup of coffee.</p> <p>“Don’t start again, Sax,” she snapped. “I’m not moving in with you. It’s not happening, noway, nohow.”</p><p>Especially not now. She poured her coffee, reining in her own fury at the circumstances. To be honest, she had been giving in, considering the offer he had made after she came out of the hospital, tempted by the hot looks, the promise of passion and heat in his eyes. Vince’s release from jail had canceled even the consideration of such a move. There was no way she would dare to push him that far now. The instability she only glimpsed during their marriage had become terrifying.</p><p>She poured the steaming liquid into her cup, ignoring him as he crossed his arms over his chest, straining the white silk shirt he wore and making him look impossibly strong. It was obvious he hadn’t grown lax in the four years since he had left the Army and joined Delacourte. His body looked just as tight and hard as it had when he came home.</p><p>A woman really, really shouldn’t have to face this so early in the morning. This amount of sex appeal, dominance, and pure male presence should be reserved for fantasies alone.</p><p>As she turned away, she stiffened as she felt the whisper of a touch over the curve of her rear. Balancing the hot coffee, she shot him an irritated glare.</p><p>“That was dirty and low,” she snarled as he grinned back at her unrepentantly. “Keep your hands to yourself.”</p><p>He snorted at that, a male sound of disbelief. “That’s not going to happen, Marey. And we’re not finished discussing this Vince thing, either. If you won’t move in with me, then I’ll park on your doorstep instead.”</p><p>“And I’ll have the sheriff drag you off.” She sat down at the small breakfast table, her cup thunking on the glass top as she flicked him another irate look. “Sit down and drink your coffee, Sax. It’s too early in the morning to argue with you.”</p><p>“Add that to the fact that you haven’t slept in weeks.” He frowned back at her. “Yes, I can see where your patience would be wearing thin. Aren’t you sick of it yet? Being too damned scared to reach out for what you want?”</p><p>“You being what I want, of course,” she suggested sarcastically. “Don’t you get tired of running after women who don’t want you?” Lord forgive her for that lie. It was a whopper.</p><p>He laughed at her then. A low, deep chuckle that stroked over her senses and had her clit reminding her voraciously just how much it longed for his touch. It was swollen, sensitive, just as her nipples were, her breasts—hell, every cell in her body was aching for him.</p><p>“You’re almost awake enough this morning to pull that lie off.” If his frown was anything to go by, he was less than pleased. “Try getting some sleep tonight and maybe I’ll pay attention tomorrow.”</p><p>Maybe pushing Sax at seven-thirty in the morning wasn’t a good idea, she thought a second later as he pulled her from the chair, one powerful arm hooking around her waist as he brought her flush with his very hard, very aroused body.</p><p>“Sax...” She meant to protest. Really, she assured herself. She was outraged that he would be so dominant, so sexually determined at the drop of a hat.</p><p>Of course she was, her conscience mocked her as her lips opened beneath his, a moan shuddering from her chest as his tongue licked at her lips, possessive and intent on claiming the territory beyond.</p><p>She was going to protest this. She was going to tell him just how arrogant and completely, impossibly unfair he was being and all the reasons why this was a really bad idea.</p><p>Sure she was, she mocked herself as her hands gripped his shoulders, her lips opening beneath his as she felt his hands moving slowly beneath the loose material of her nightshirt, pressing against her stomach as he played with the strings that tightened the waistband of her pajamas.</p><p>He felt so good. So good and warm, and strong. All she wanted to do was immerse herself in it, let the sensations whipping through her body carry her wherever he wanted her to go. Just this, just for a brief time. Then she would make him stop. She would be strong again and she would reset the boundaries she knew she had to have between her desire and what she knew would protect them both.</p><p>For now, she was lost and she damned well knew it. This was why she kept as far away from him as possible. This was the reason she had fought the desire between them. Because of this, the pleasure, the incredible fiery sensations that traveled not just through her body, but through her soul as he lifted her closer, grinding her against him, the hard wedge of his erection pressing firmly into the engorged nubbin of her clit.</p><p>“So sweet,” he whispered as his lips nipped at hers then, his teeth tugging at the bottom curve, his tongue licking over it as she fought for his kiss again. She didn’t want to think, didn’t want to let go of the incredible pleasure consuming her.</p><p>It was happening too fast, a part of her screamed. If she didn’t stop now, she wouldn’t be able to later.</p><p>Shut up! The aching core of her pussy wasn’t having it. It flared with renewed demand, weeping its thick juices as he lifted her closer.</p><p>She sought his kiss again, her head tilting, her tongue licking at his lips, a moan shuddering from her chest as he gave her what she sought. Hot, moist, his tongue ravaging, his hands possessive as he lifted her, settling her against the table as he pressed between her thighs. Her bare thighs...</p><p>Oh God, she was so lost. How had he removed the pajama bottoms without her even noticing?</p><p>“Come here, baby.” He moved back despite her protest, his hands lifting the shirt, pulling it over her head before she could form a protest.</p><p>“Sax... Not fair...” she cried out as he bent her backwards, his lips covering the hard tip of her breast as the words echoed around them.</p><p>She was going up in flames. She couldn’t survive pleasure like this. It was too much. Too intense.</p><p>Her hands gripped his head, feeling the slick, shaved contours beneath her fingertips as she held him to her, gasping, crying out, fighting for breath as the intensity of his touch swirled through her.</p><p>This was what she had gone to that damned motel for. Because she couldn’t resist the allure, the fire, the cascade of pleasure that infused every particle of her being.</p><p>“No, it’s not fair,” he growled, his lips raking over the incredibly sensitive tip of her breast. “I’m at your breasts when I’m dying to eat your pussy.”</p><p>Shock held her motionless as he jerked a chair from under that table and pulled it to him. Sitting down, he spread her thighs, his eyes on hers as his head lowered.</p><p>“Breakfast,” he whispered. “I always did prefer sweets first thing in the morning.”</p><p>His tongue swiped through the ultra-sensitive slit of her pussy. When his tongue reached her clit, he circled with a hum of approval, licking around it, causing her to arch closer, a strangled scream of pleasure tearing from her throat.</p><p>She wasn’t allowing this, she assured herself. She wouldn’t allow it. It was dangerous. Not just for her peace of mind and her own heart, but for him as well.</p><p>But she was, and she was glorying in it, she realized distantly. Her thighs were spread for him, her hands gripping his head, holding him to her as he devoured her with lustful greed.</p><p>His hands were just as busy as his lips, and he was proving the rumor that he was definitely an ass man where a woman was concerned. His fingers were caressing from her pussy to the small entrance of her anus. And though Marey had been certain that particular fetish wouldn’t infect her as it had her friends, as his fingers massaged, caressed, pressed, she found her curiosity and arousal heightening.</p><p>His mouth kept her pussy from missing the touch of his fingers, allowing his fingers to spread the slick cream that wept from her vagina back to the small entrance to lubricate and prepare it for the gentle impalement of his finger.</p><p>“Sax...” She was panting with the pleasure, unable to focus, no longer able to think. She could only cry out his name, lifting for him, poised on an edge of sensation she was certain would destroy her.</p><p>“There, baby,” he crooned against her pussy, his voice vibrating against her clit. “Just enjoy. Let me show you good it can feel.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Another finger joined the first. She wasn’t certain if her strangled cry was one of protest or encouragement, but she knew the slow, even thrusts of his fingers inside her—first one, then two—were pushing her past any boundaries she could have conceived.</p><p>He moved, shifted as his tongue dipped into the opening of her vagina, tracing the entrance, flickering over the sensitive tissue as he licked at the juices easing past it. She was so wet, so hot, it should have been humiliating.</p><p>Her eyes widened in shock as she felt his finger move back, felt the tip of another joining it. Cool, slick gel eased his fingers inside her, assuring her he was more than prepared for whatever his desires were that morning. Desires that were quickly becoming her own.</p><p>He prepared her slowly, easily, keeping her poised on pleasure so intense she was certain flames were going to begin rolling over her. Perspiration dampened her skin, fingers of heat ran over her repeatedly as the band of intensity tightened in her womb and the stretching fire increased in her rear. Fire that burned with a pleasure so mind-consuming there wasn’t a chance of denying it. So soul-destroying that when he rose to his feet, releasing the straining length of his cock and pushing the waistband of his slacks around his thighs, she never thought to protest, never thought to consider that she was crossing a line she might never be able to return from.</p> <p>“This is what you’re denying yourself, Marey. Only a part of what you’re denying us both.”</p><p>He pressed the head of his cock against the stretched opening of her anus, lifting her to him, his hands spreading the cheeks of her buttocks apart as she felt the thick crest begin to penetrate the little opening.</p><p>Pleasure and pain collided as his gaze caught and held hers. She felt him enter her slowly, unbearably slowly, stretching her impossibly, sending her senses screaming with the conflicting sensations.</p><p>She had never believed that line between pleasure and pain would tempt her, would draw her to the extent that nothing mattered except pushing that boundary further.</p><p>“Breathe, baby,” he whispered. “Deep breaths. Close your eyes and press out for me. Let your body milk me in, don’t force it.”</p> <p>Her head thrashed on the table.</p><p>It was decadent. Splayed out on her breakfast table, Sax’s cock slowly filling her ass as she stared back at him beseechingly. Her most perverted, most depraved fantasies were being played out, stripping her of control, leaving her pliable, willing, eagerly embracing the broad erection impaling her.</p><p>“Good girl,” he crooned, his face twisted into a mask of pleasure. “You’re so fucking tight, Marey. It’s like being consumed by flames.”</p><p>She was the one being consumed. Inch by inch as he worked his cock inside her, filling her, stretching her until he sank in to the hilt.</p><p>She couldn’t breathe. She could feel the muscles of her anus convulsing, flexing and rippling around the length of flesh filling her. It was more pleasure than she could have envisioned. Deeper, more intense than the vibrators or plugs she had used there.</p><p>“Think of this, Marey,” he growled as he began to move, holding her to him, sending her senses careening as he began to fuck her slow and deep. “Think of this, baby, the next time you’re telling me I’m chasing a woman who doesn’t want me.”</p> <p>She screamed as his movements began to quicken, one hand moving from her buttocks, his fingers going to her aching, empty pussy. Two fingers pressed inside, moving in tandem to his thrusts up her ass as reality began dissolve. The world centered on the dual penetration. His fingers moving inside the ultra-tight depths of her pussy, his cock fucking her ass with long, smooth strokes that steadily quickened, grew harder, more intense.</p><p>She writhed beneath him, straining toward release, begging for it, pleading as her body tightened to what she was certain was a breaking point.</p><p>“Now, Marey.” His voice was strained, rough as she felt his cock flex and throb inside the sensitive channel.</p><p>His fingers moved faster inside her pussy, his thumb moving to her clit, stroking it, pushing her higher, higher...</p><p>She screamed as she fell over the edge of oblivion. Ecstasy washed through her body, burned along her nerve endings, sending her flying into rapture as she felt him explode, the heat of his semen filling her as he thrust in hard and deep one last time, groaning fiercely as he came inside the hot depths of her ass.</p><p>She settled down to earth long moments later, her eyes opening as he slowly withdrew from her. She watched as he fixed his slacks then reached to the counter to tear a handful of soft paper towels from their holder.</p><p>He cleaned her gently, watching her with those chocolate eyes that seemed to see clear to her soul.</p><p>“You can’t turn back,” he told her as he eased her up, holding her steady as she stood naked before him, fighting to find reality once again. “I won’t let you.”</p> <p>“No matter how much it hurts me?” she asked him then, her voice hoarse, filling with tears as realization began to wash over her. “Does that matter, Sax? Does it matter at all how much it’s going to hurt me?”</p><p>Chapter Two</p><p>“She has to be the most stubborn, independent, irrational woman I’ve had the misfortune to meet.”</p><p>Sax slammed the file drawer in place, ignoring James’ mocking snort behind him as he slapped the file he had pulled out on the desk between them.</p><p>He was irritated, horny as hell, and damn if he wasn’t suffering from a guilt trip of major proportions.</p><p>No matter how much it hurts me? The words wouldn’t leave his mind, ricocheting in his head as he fought against the pain he had glimpsed in her eyes.</p><p>“You act like you’re surprised, buddy,” James laughed as he leaned back in the chair in front of Sax’s desk and watched him with amusement. “You’ve been chasing her for three years and just figured that one out?”</p><p>Sax sat down heavily in his own chair and regarded the other man with a frown.</p><p>“I don’t appreciate the amusement you’re finding at my expense, James,” he snarled back. “Dammit to hell, she enjoyed every minute of it. Drenched my fingers when she came and still had the nerve to try to guilt me out of her life. I should tie her to the damned bed for a week and fuck her until she’s too tired to guilt or deny me.”</p><p>James chuckled at that one, not that Sax could blame him. Sax had been making that same threat for three years now.</p><p>“Vince is out on bail,” Sax sighed then, worry and fury clashing at the thought of all the ways he could hurt Marey. “He disappeared within hours. If she doesn’t ease up on the stubbornness, he’s going to kill her.”</p><p>It was his worst nightmare, that Vince would attack her again, taking her from him forever. It was hard enough waiting on the sidelines all these years, certain she would give in eventually. But now...Sax knew the waiting was over. The question was would the fragile bonds of emotion between them survive the dominance rising inside him? He was sick of waiting. And he was sure as hell sick of her denying the very thing he knew both of them craved.</p><p>“Vince will self-destruct eventually,” James agreed. “All we can do is watch her, Sax. Daniel will look for him, Drew Stanton owns the security agency she’s using—he has priority watch on her. The sheriff will keep a closer eye on the house during his patrols, and when he comes up for trial, Caleb will make certain he spends plenty of time behind bars. The members of The Club won’t desert her. We watch out for our own, you know that.”</p><p>Caleb Embers was the prosecuting attorney assigned to the case, and a member of The Club. Sax was well aware of the fact that if Vince made it as far as trial, then Caleb would fry his ass.</p><p>“Keeping him the hell away from her until he gets to trial is what worries me,” Sax bit out. “She’s so determined to deny us both that she could end up giving him the opening he needs. I swear to God, James, I can’t understand her. It’s as though she thinks she has to deny herself. As though she’s paying penance for something that only she’s aware of.”</p><p>“Or terrified of a pattern repeating itself,” James suggested then. “She put her life on hold for her parents. When they died, she wasn’t a teenager any longer. Loneliness can do strange things to a woman, Sax. She married the first man who offered and learned within weeks the mistake she made. I have a feeling you’re something Marey couldn’t bear losing. So she’s going to fight you harder.”</p><p>Which was no more than he expected. But damn if it wasn’t grating on his nerves.</p><p>“Tell you what.” James leaned forward in his chair, watching Sax with a knowing glint in his eyes. “Let’s head to the house for dinner. We’ll have a drink and see if Ella has any ideas how to break her friend’s control. She knows Marey better than anyone. If anyone knows how to find her weakness, it’s my wife.”</p><p>Sax tapped his fingers against the leather arm of his chair. He was right. And Ella would help too. She was worried as hell over Marey. She would make a great conspirator.</p><p>He moved quickly to his feet, ignoring James’ amused laughter as they pulled on their suit jackets and headed for the door.</p><p>“So, who’s your third lately?” Sax finally thought to ask his friend as they neared the door.</p><p>James snorted. “Ian came out of hiding. I think he’s running though. Damn if he’s not desperate to get as far away from his own house as possible since Dane’s daughter moved in with him. Have you seen her?”</p><p>Dane Mattlaw had been Ian’s best friend while he lived abroad in his younger days. The older man had been a steadying influence, while also helping to develop some of Ian’s sexual tastes in the high-class brothels they frequented before Dane’s marriage.</p><p>The daughter was a vixen. Not that Ian had introduced any of The Club’s members to her.</p><p>“Mattlaw will kill him.” Sax grinned when James’ comment finally registered. “If he’s running from her, then he’s a little too interested.”</p><p>“Too interested and denying it too hard,” James laughed as they left the office. “Watching him fall is going to be fun, Sax. He’s a little too superior in his attitude toward the rest of us after our marriages. We’re all cheering for her. She’s going to put a hurting on that boy that will bring him to his knees and make him cry for mercy.”</p><p>That reminded Sax much too much of what Marey was doing to him. Damned woman.</p><p>“He’s driving me crazy.” Marey stomped into Ella’s house hours after the kitchen interlude, ignoring her grinning friend as she made her way to the kitchen and the wine Ella kept in steady supply.</p><p>Hell, she was married to a Trojan, a dominant, woman-sharing, sex-perverted male that likely made Ella as insane as Sax was making her at the moment.</p><p>“He’s a sweetheart, Marey,” she laughed as she came behind her, moving to slide two wineglasses from their position under the cabinet and set them on the work island.</p><p>A sweetheart. Yeah, he was a sweetheart all right, and he was making her fucking crazy proving it. Keeping an eye on her, checking the house all the time, calling to make certain she was okay. The sound of his voice, that deep baritone, rasping over her senses, had nearly been her undoing several nights in a row.</p><p>“You should know,” Marey finally snorted mockingly. “Wasn’t he James’ little buddy that first time?”</p><p>Ella cleared her throat, a light flush working over her cheeks at Marey’s reply.</p><p>“If I had known you—”</p><p>“Oh, shut up.” Marey waved the small guilt-ridden sentence away. “I don’t have a problem with it. I just need solutions here. How do I get rid of him?”</p><p>She poured a half glass of wine, considered the amount then filled the glass. She needed definite liquid courage here. She smacked the bottle to the counter, lifted the glass and took a healthy swallow. She needed the strength right now, not to mention the balm to her nerves. The balm to her nerves was a definite must-have. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Wine is for sipping, whisky is for swilling,” Ella said mildly, watching her warily. “So why don’t you care if I fucked Sax?”</p><p>Marey was in the process of sitting her glass back down. She paused, glanced at her friend and lifted it for another healthy swallow. Ella’s timing sucked.</p><p>“Just don’t let it happen again,” she muttered as she refilled the glass moments later. “I might not be so forgiving now.”</p> <p>That was an understatement. She would be damned pissed, but she knew that Ella would never consider it after suspecting the feelings Marey had for him. Marey could confidently pat herself on the back that she had hidden her feelings for the man from even her closest friends. Ella had no idea until several weeks after she returned from her honeymoon. During one of Marey’s late-night let’s-consume-a-bottle-of-wine visits, Ella had revealed that Sax had been the third in the Trojan ménage James had set up.</p><p>Marey flushed uncomfortably at the memory of what she said in reply.</p><p>Touch him again and I’ll rip your tonsils out! she had informed her friend haughtily. James wouldn’t find you near as attractive then.</p><p>She sighed wearily. She had fucked herself there. Ella had tried to throw her in Sax’s company ever since.</p><p>“But you don’t want him?” Ella lifted a perfectly shaped brow with mocking inquiry.</p> <p>“Don’t start lecturing me, Ella,” she snapped, pushing her fingers restlessly through her hair and wishing she had taken the time to confine the long, blonde strands to a braid or something. Anything to keep it out of her face. It was aggravating her, and she didn’t need the additional frustration.</p><p>“Who’s lecturing you?” Ella shrugged as she poured a half glass of wine, refilled Marey’s then picked up her glass and gestured to the living room. “Let’s at least argue in comfort. Why do you always have to come here looking for a fight? I have better things to do than fight with my friends.”</p><p>Yeah. Like fuck James Wyman with Saxon Brogan as a third in a ménage that made Marey crazy to think about. Not that the past exploits bothered her. Ella was her friend—more like a sister—and really, if she had to share a man in such a situation, then it would be Ella she would choose, she thought whimsically.</p><p>Damn, that wine must strong.</p><p>Sighing, she plopped down in her favorite leather chair, wiggled a bit and then cast Ella an accusing stare.</p><p>“James has been sitting in my chair,” she sniped. “He’s messing it up.”</p> <p>She watched Ella smother her chuckle. No one was taking her seriously anymore.</p><p>“Well, sometimes, we share it.” Ella wiggled her eyebrows suggestively as Marey gaped back at her.</p><p>“Eww.” She jumped from the chair. “You fucked in my chair?”</p><p>“Well, I cleaned it later.” Ella was definitely laughing now. “Don’t worry, there’s no evidence left of the event.”</p><p>Marey shuddered and moved to the less comfortable recliner. “Have you fucked here too?”</p><p>“Honey, every square inch of this house has seen action this year.” Ella leaned back in her chair, her eyes sparkling with laughter as Marey grimaced in distaste.</p><p>“I guess even the floor is grotty,” she sighed as she collapsed back in her favorite chair. Dammit, she didn’t want to think about sex right now. Didn’t want to hear about it or know about it.</p><p>“Yup, even the floor is grotty,” Ella laughed at the description. “Now tell me, why would it bother you if I fucked Sax now, if it didn’t bother you before?”</p> <p>Marey shot her an evil look. She deserved it. She was so damned confident and sexually wicked now that she should be burned at the stake.</p><p>“Women like you were stoned a hundred years ago, Ella,” she reminded her with aloof distain.</p><p>“That was two hundred years ago, dear,” Ella pointed out, toasting her with her glass. “Aren’t you glad we were born during a much more sexually aware time?”</p><p>“You do not want me to answer that right now,” she sighed wearily, staring back at her friend with a mixture of irritation and fondness.</p><p>“Answer me, Marey,” Ella demanded softly. “I won’t leave you alone until you do.”</p><p>Marey sighed in resignation. “Hell, I don’t know. Maybe I’m just as perverted as the rest of you.” Ella shot her a disapproving look. One Marey ignored, just as she always had.</p><p>What the hell was she supposed to say? That jealousy just didn’t come into it? She was smarter than that. Friends lasted forever, men didn’t. Besides, she knew that Ella would have never let Saxon touch her if she had known Marey was even the least bit interested in him. Being angry over it now was nothing short of ludicrous.</p><p>“Then what is your problem?” Ella lifted her glass, sipping at her wine as she watched her with those probing blue eyes of hers.</p><p>Ella had always seen too much. She had known when Vince was abusing her, when she had taken enough and was preparing to leave, when she began to fear for her safety because of his threats. They had known each other for years, their parents had been best friends, and despite their age difference, they had always been close. That bond of friendship had only strengthened as they became adults.</p><p>“Ella, you have to make James talk to him.” Marey finished off her wine before leaning forward and extending the glass for Ella to refill. “He’s making me insane. He calls. Checks the house every night. And this morning, he had the nerve to show up demanding breakfast. He’s trying to take over.”</p><p>“I see...” Ella nodded somberly. “This would be a problem.”</p><p>“It’s horrible,” Marey snapped, furious at the gleam of laughter in Ella’s eyes. “I don’t want him there. James is going to have to talk to him.”</p><p>“Vince made bail the other day, didn’t he, Marey?” Ella said then, her voice gentle, but knowing.</p><p>Marey leaned back in her chair, lowering her head to stare into the pale liquid that filled her glass.</p><p>Yes, Vince had made bail.</p><p>“That has nothing to do with it,” she whispered. “I’m not a coward, Ella.”</p><p>But she was. She could feel that knowledge crawling through her mind, mocking her with the sterile, lonely life she led.</p><p>“I never thought you were a coward, honey,” Ella sighed. “Just frightened. And I never blamed you for that. But you have to fight back sometime.”</p><p>Marey avoided her gaze, shaking her head as she swallowed past the lump in her throat.</p><p>“He would go after Sax,” she finally whispered. “Not me.”</p><p>And she couldn’t bear the thought of that.</p><p>“And Sax is man enough to rip his face off,” Ella snorted. “Come on, Marey. Vince only whips on people who are smaller than he is and you know it. Sax would grind that little bastard into dust.”</p><p>“Or Vince would hurt someone else, and frame him again,” Marey snapped. “Or do something to cause his brakes to fail, or any number of things that could end up destroying him. Dammit, Ella.” She stared back at her miserably. “I can’t let that happen. Can’t you see that?”</p><p>“Vince is out on bail. Once he goes to trial, he’ll go to jail,” Ella pointed out.</p><p>“For how long?” Marey sneered then. “A year? Two?”</p><p>She sat the glass of wine on the table that separated their chairs as she rose to her feet. Crossing her arms over her chest she paced to one of the wide windows on the other side of the room before turning back to face her friend.</p><p>“I’ve grown used to being alone—”</p><p>“You’re full of shit,” Ella snapped. “You’ve grown used to hiding, Marey. Risking nothing and having nothing, and letting Vince terrify you. I won’t have James talk to Sax.” She lifted her chin stubbornly. “I think he’s doing the right thing, and I think he’s the right man for you. So forget it.”</p><p>“You’re such a bitch!” Marey snarled.</p><p>“Takes one to know one,” Ella snapped back childishly, frowning back at her mulishly. “Maybe you’ll get lucky and Sax will spank it out of you. Oh, but you might enjoy that. I’ll tell him to hold off on it for a while.”</p><p>Marey narrowed her eyes warningly. Ella’s response was a cool little smile as she moved to her feet, facing her defiantly.</p><p>“That’s low,” Marey growled furiously.</p><p>“No, dear, low is telling you what a magical tongue he has,” she sighed mockingly. “And how much he fairly loves to eat pussy. The man is a connoisseur. He can go at it for hours, and leave you screaming for more.”</p><p>Oh, she didn’t need to hear that. Her pussy flooded, her juices easing from her vagina to coat the bare, waxed folds beyond as she remembered just how good his tongue was.</p><p>Ella’s expression was mockingly ecstatic, her eyes gleaming in confrontation, her lips curved into a satisfied little smile.</p><p>“And he has stamina...” She drew the word out pleasurably as Marey breathed in slowly, reining in her response. “His cock stretches you, makes you burn, makes you beg...” She closed her eyes dreamily. “He’s almost as good as James.”</p><p>“Glad to know I rate in there somewhere.”</p><p>The sound of James’ amused, deep voice had both of them jumping in startled awareness as they turned to stare at the door.</p><p>He lounged against the doorframe, incredibly handsome, sinfully sexy. Marey well understood why her friend had been so besotted with him for so many years.</p><p>“This is a private conversation.” Despite her furious blushes, Ella drew herself up haughtily and faced her husband. Though Marey had no problem seeing the arousal that flared in her eyes.</p><p>“So I heard.” His lips curved in a smile, his eyes gleaming with laughter. “Very interesting one as well,” he mused as he crossed his arms over his broad chest. “Should I let Sax know you’re up for a visit?”</p><p>“No!” Marey’s furious exclamation joined Ella’s as they both faced him now.</p><p>He chuckled in response.</p><p>“Go play or something, James.” Ella waved her hand at him dismissively. “This is girl talk.”</p><p>“So I heard,” he drawled. “But maybe you would both like to know that Sax is due here in about ten minutes to go over a new product that’s in design at the moment and to share a beer while he bemoans a certain woman’s stubbornness. Marey might want to run while she has the chance. He’s just waiting to catch her out of that fortress she owns, and she looks pretty primed right now.”</p><p>He glanced to her breasts and Marey’s gaze dropped to the royal blue silk covering the full mounds. Her nipples were poking against it like a four alarm signal for an all-night fuck.</p><p>Her gaze flew to Ella’s in horror.</p><p>“This is your fault,” she snapped. “I didn’t need to hear any of that.”</p><p>“But you still love me.” Ella grinned.</p><p>“Bitch,” Marey snarled again. “And yes, I still love you. But I am gone like the wind.”</p><p>And she wasted no time in running. Sax was on a very, very short leash right now, and she knew it. As much as she loved Ella, there wasn’t a chance in hell she was sticking around to see him. Because her own desires were on an even shorter leash, and growing fiercer by the day.</p><p>Chapter Three</p><p>She locked her doors when she got home. Ignored the doorbell, thanking God that Ella hadn’t given Sax the code into the house as she had the gates. The next morning, she did likewise. Cowardice? Hell yes, she told herself fiercely. Sax terrified her where her weakness to him was concerned.</p><p>She finally slipped out around noon, unable to cancel her meeting with Ella at Delacourte to complete the planning for the annual Christmas party. She slipped in without incident. Getting out wasn’t as easy.</p><p>“When are you going to stop running from me, Marey?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Damn.</p><p>Caught in the empty outer office where James’ secretary should have been standing guard, but was absent instead.</p><p>“I’m not running from you,” she denied the charge calmly, despite the fact that she knew she was running. Every chance she could get for now on. “I was heading home. I’m finished for the day, Sax.”</p> <p>He stood in front of her, too close, but she refused to retreat. She had run from her ex-husband for years—that was humiliating enough. She wasn’t going to back down from another man. Especially one she knew as well as she knew Sax. One that could make her senses sing with pleasure. Her body rock in orgasm. Her mind dissolve with no more than a touch. God, she was hopeless.</p><p>He towered over her, tall and broad, his shaved head gleaming in the light above them. Teak dark flesh was emphasized by the charcoal gray of his suit and his dark, chocolate eyes. Eyes that warmed as he watched her, just as his smile did.</p><p>How was she supposed to fight him and herself?</p><p>“I’m getting tired of waiting on you, Marey.” Sax didn’t beat around the bush. “You’re tempting me into that little kidnap fantasy we discussed before. You might think hiding from me is achieving whatever objective you’ve set, but I can assure you, baby, the day is going to come that I’m not going to let you run any longer after yesterday.”</p><p>She felt the flush that suddenly washed over her face.</p> <p>“You really need to forget about that,” she muttered, crossing her arms over her breasts as he braced his arm against the doorway, leaning against it casually.</p><p>He was about as completely yummy as a man could get. Yummy enough that her mouth watered with the thought of tasting him, her hands itched to touch him. And she knew every muscle under that skillfully tailored jacket was as hard and tight as that bulge behind the zipper of his slacks. A bulge well capable of satisfying a woman in any and every way.</p><p>She risked a quick glance down. Oh, hell yes, definitely yummy.</p><p>“You can touch if you want.” He was openly laughing at her as her gaze flew back to his. “After yesterday, there’s really no sense in being shy, honey.”</p><p>Marey cleared her throat, not so much embarrassed and never shy, as she was aware of the tightrope she was walking. Fighting herself was hard enough. She didn’t know if she could fight him as well.</p><p>Not considering the years of dreams and the silly emotional attachment she had developed to him after her divorce. Why she was running now made no sense to her, and she doubted it would make any sense to anyone else.</p> <p>“That’s all right,” she finally replied calmly, refusing the invitation to touch him. “I do need to leave though, if you don’t mind.”</p><p>“Leave with me.”</p><p>The offer left her stunned. Her eyes widened, her breath stuttering in her chest as he stared back at her somberly, intently. It was tempting. So very, very tempting.</p><p>“That’s not a good idea, Sax,” she finally whispered. “You know it’s not.”</p><p>“You can’t keep running,” he finally sighed. “And I’ll be damned if I’m going to keep chasing after you. How long are you going to let Vince run your life like this?”</p><p>She glanced away from him, turning back as he straightened from the doorway and came closer. She stepped back, then stopped. She wasn’t going to run from him. But God, how could she handle...</p><p>Her swift indrawn breath was fully audible as his hand lifted, smoothing down the silk covering her arm. The caress had her nerves tingling, but when his hand gripped hers where it rested on her other arm, she shuddered in response. The back of his hand brushed her hard nipple, sending shards of awareness whipping through her.</p><p>Her clit caught fire, swelling, burning out of control from no more contact than the back of his hand brushing the hard point. Her pussy clenched in empty hunger, reminding her that even her vibrators suddenly lacked the satisfaction she had once found with them.</p> <p>“Sax, this isn’t smart,” she whispered. “You know it’s not.”</p><p>His head lowered, his lips smoothing over her forehead as she stared up at him. The warmth, the velvet roughness of the kiss had her eyes closing and weakness sweeping over her.</p><p>“I want you, Marey,” he whispered as his lips moved along the side of her face to her ear. There, his teeth caught the sensitive lobe, tugging at it erotically as she shivered, her arms unfolding, pressing against his hard chest, her fingers curling in the silk of his shirt. “Yesterday was just a small treat. I want all of you. Hot and wet, moaning beneath me as I show you just how good we can be together. Wouldn’t you like that, baby?”</p><p>She stood, dazed, pleasure sweeping over her as he lowered one hand to the curve of her buttock, his fingers shaping the flesh as his teeth raked her neck.</p><p>“Do you remember how good it was? I do. Buried snug and deep up that sweet ass. I want to bury in your hot little pussy next. Deep and tight while I feel you milking me, hear your wild little moans in my ears.”</p><p>“You’re not playing fair,” she whispered, feeling the pleasure streaking through her womb, striking between her thighs and making her clit swell and throb with arousal.</p><p>She was so weak. Too weak.</p><p>“I’m not playing,” he whispered a second before his teeth raked her neck again and his hand clenched the flesh of her rear. “Not in the least. Remember that, Marey. This isn’t a game, and the next damned time you refuse to open that door to me, it’s coming down. You can say no if you don’t want to be touched, but I’ll be damned if I’ll worry if you’re lying in that house bleeding to death or already dead. Don’t make that mistake again.”</p><p>His voice had her shivering in trepidation. He was serious. Too serious, and she knew it.</p><p>He straightened then, staring down at her broodingly, his eyes glittering with a sensual hunger and an emotional intensity that shook her to the tips of her toes.</p><p>“Hurry and run,” he said mockingly. “Or you might not have the chance to get away again. The next time I have you cornered, I’m going to fuck you until you never dare to run from me again. You won’t be able to breathe, let alone deny what we both want.”</p><p>She blinked in shock. Run.</p><p>She moved quickly around him and did just that. Reluctantly. Straight home, to her room, to her bed, eyes closed and vibrator running as she fought to ease the craving for Sax’s touch.</p><p>Sax breathed out roughly, as she did just as he suggested—she ran. He was growing tired of this. She was more skittish now than she had ever been before. And it broke his heart. He could see the yearning, the pain in her eyes, and wanted nothing more than to ease it. To love her until the pain vanished and the happiness shone through, as it did with Ella.</p><p>Dammit, he wanted her to choose, and there lay the bitter truth. He didn’t want to force her to accept him, he didn’t want to overcome her objections or override her shyness and fears. He wanted her to come to him. Arrogance? He snorted at that thought. Probably. But she had been running for so damned long that it was starting to grate on his ego.</p><p>“She’ll stop running, Sax.” Ella stepped from the office she had been meeting Marey in, her voice concerned, compassionate. “Sometimes she gets stubborn and you just have to let her wear herself down.”</p><p>A smile quirked his lips. Ella had been defending her friend for months now. That had begun about the same time James had informed him that Ella had refused to participate in another ménage with him.</p><p>“I’ve waited a long time, Ella,” he breathed out wearily. “I’m going to get tired of waiting soon. When I do, she might have more to worry about than Vince. She’s going to have to worry about me.”</p><p>Ella ducked her head, though he caught the amused curve of her lips.</p><p>“It’s something that perhaps you should consider,” she finally said as she raised her head, her gaze direct then, somber. “Marey doesn’t always reach out for what she wants, Sax. She’s too used to having it jerked away, just as she’s within reach of it.”</p><p>He wanted her to come to him. She had asked him, pleaded with him years before to leave her alone, to stop his campaign to seduce her, to hold her. He had promised himself then that when the time came, it would be Marey’s decision. Perhaps that was where he had made his mistake. He hadn’t known then the things he knew now. Her determination to hold herself aloof, to ensure she never lost anyone, nor was betrayed again.</p><p>He pushed his hand into the pocket of his slacks as he stared back at Ella, seeing the confident, sensual, loving woman she had become over the past year. She had run from James for nearly a decade, just as stubborn and determined as her friend was. She was happy now, glowing with it. Could he fill Marey’s eyes with the same satisfaction, that glow of a woman confident and well satisfied with what she found in her lover’s arms?</p><p>He lowered his head, staring at the rose carpet of the outer office as he fought to restrain the impulses that had been rising inside him for weeks now. After Vince’s attack on her, he hadn’t wanted her to feel as though she was confronting another extreme situation, a man unable to let go.</p><p>Perhaps instead of giving her the space to find the answers, he was doing as Ella suggested instead. Giving her a chance to hide. Marey didn’t need to hide anymore. She had been hiding for far too long.</p><p>Chapter Four</p><p>Someone was in the house.</p><p>Marey jerked up in bed later that night, terrified as she heard the sound downstairs. What the hell was it? Why hadn’t her alarm gone off?</p><p>There it was again. She blinked in the darkness. Was that a whistle? She stared into the dark bedroom, her heart racing, the sound echoing in her ears as she fought to wake up, to make sense of the sudden panic ripping through her again.</p><p>The new alarm system was supposed to be foolproof. Alerting the police and sounding a wail that would raise the dead if the house was breached. Evidently, it wasn’t as secure as the salesman had promised her.</p><p>There it was again. It was a whistle. And she knew that sound. The grating little tune was one Vince was fond of. He would sound it for hours at a time, working himself into a rage as he did so. It always heralded another accusation, another rage, and in those final weeks of their marriage, another physical blow against her.</p><p>Shit. She jumped from the bed, jerking her robe on as she grabbed her cell phone from the bed and punched in the sheriff’s number. This was insane. How the hell had he managed to get through the alarm and into the house? And why was he being so stupid?</p><p>“Sheriff’s office.” The dispatcher answered on the first ring.</p><p>“Janey, it’s Marey Dumont,” she snapped, her voice low. “Vince has broken into the house.”</p><p>She had gone to school with Janey, knew her husband and her kids. None of them liked Vince. Not that she could blame them.</p><p>“Stay with me, Marey, I’ll get someone on the way out there.”</p><p>Marey listened as Janey’s voice became more distant, imperative, as she called in the report.</p><p>“I have a car on the way, Marey,” she came back, her voice calm, cool. “I want you to stay on the phone with me, honey, till they get there. You say the alarm didn’t go off?”</p><p>“Not a peep,” she whispered. “I just happened to wake up when he made a sound downstairs. I don’t know how he got through.”</p><p>It didn’t make sense. Vince wasn’t the brightest light in the house, and electronically, his skills were nil. He would have needed the code to the gates as well as the door.</p><p>There was a crash downstairs.</p><p>“You fucking whore!” Vince screamed from the bottom of the stairs then, as something else could be heard shattering against a wall. Dammit, he was breaking her vases, she thought miserably. She had paid a lot of money for those damned things. Her insurance company was going to scream.</p><p>“Shit. Janey, tell them to put some lead on the gas,” she breathed out harshly. “He’s drunk and he’s pissed. How the hell did he get past my alarm?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She moved quickly to the bedroom door, locking it before pushing the large, wing-backed chair over to it, and tilting it until the back was forced beneath the brass knob. It was the only security she could think of. Tomorrow, she promised herself, she was buying a gun.</p><p>“They’ll be there fast, Marey, just stay calm,” Janey assured her quietly. “I want you to stay back from the door. Hide in the bathroom and lock the door there. Get as far away from him as you can until help arrives.”</p><p>She could hear her voice fade as Janey turned to the radio and called in to report to whoever was headed to the house.</p> <p>She stood indecisively in the middle of the bedroom, staring around it in regret. She couldn’t stay here. Vince was evidently insane. First the attack at the motel and now this. She couldn’t, she wouldn’t live this way.</p><p>“I’ll kill you this time, you fucking bitch.” He was at the door, his fists hammering on the door as Marey began to tremble nervously. “What makes you think you can whore around on me? I’ll kill you for even thinking of letting another man touch you. You fucking slut. You’re a dead woman!”</p><p>Enraged, almost incoherent, his curses slammed into her, making her stomach knot in fear as she bit her lip to hold back the cry of rage that built in her throat. They had been divorced for years, and she had been careful. Very careful to make certain he had no reason to torment her as he had that first year after their split.</p><p>His fists hammered into the door again, shaking the panel. He was a brute of a man. The door was heavy but she had no doubt he would get through it.</p><p>“Janey, this is getting serious,” she breathed out, her voice shaking as she moved to the bathroom and locked the door there as well. There were no chairs to place against the door, nothing to hold him back. “These doors won’t keep him out.”</p> <p>“Two minutes, Marey,” Janey promised her calmly. “You can hold on two minutes. Get a can of hairspray, anything harsh. If he makes it past the doorway, spray his eyes full. Do whatever you have to. Sheriff Richards and Deputy Carlson are almost there. You’ll hear the sirens soon and so will he. Maybe it will run him off.”</p><p>She was right. Seconds later the sound of sirens wailing in the distance could be heard. Relief poured through her as tears filled her eyes. Her nerves clashed as she felt the jolt of Vince throwing himself against the door.</p><p>“The gates are locked,” Marey told Janey, moving along the wall as she heard him crash into the door again. “The code is six, four, eight, three, two, nine. That’s going to delay them.”</p><p>Janey relayed the code to the sheriff before coming back.</p><p>“You hear them now?” The sirens were growing louder.</p><p>“You fucking whore. You slut,” Vince screamed then. “I’ll get you, bitch. When I do, I’ll kill you. That damned sheriff won’t save you every time.”</p> <p>The sound of running feet down the stairs assured her he was leaving. Breathing a sigh of relief, she collapsed against the wall, a tired, nervous little laugh escaping her throat as tears tightened her chest.</p><p>“He’s gone,” she whispered then. “Janey, he’s going to fucking kill me. What the hell am I going to do?”</p><p>The house was a mess.</p><p>Evidently Vince had found quite a few ways to amuse himself before she woke up. Curses had been spelled out in lurid detail in black and red permanent marker across the walls. Her living room furniture was slashed, vases and heirloom glassware shattered. Some of the items Marey knew she would never be able to replace.</p><p>She stared around at the destruction, dressed in jeans and a sweater to ward off the chill that filled her body as the sheriff and his deputy filled out their reports and called the security company. Within hours, the house was filled with people, and all Marey could do was stand and stare around in confusion at the mess her ex-husband had made.</p><p>“You need to find a hotel, or stay with a friend for a few days, Marey.” Sheriff Richards stepped around the mess in the entry hall as he moved from the living room. “The security system is intact, but he obviously has the codes. You’re not safe here.”</p><p>Duh. No shit.</p><p>Marey kept the sarcastic comment to herself as she stared back at the sheriff.</p> <p>“What are you going to do about him?” she asked him carefully. “They let him out on bail. He could terrorize me further, Sheriff. Now what the hell are you going to do about it?”</p><p>He sighed roughly, propped his hands on his hips and shook his head. As handsome as the man was, right now, she wanted to kick his teeth in. He was being of no help whatsoever.</p><p>“We’ll pick him up. He’s violated the terms of his release, so the bail will be revoked. But until we catch him, you’re not safe.”</p><p>“She will be.”</p><p>Marey froze at the dark, dangerous voice behind her. She turned slowly toward the open front door and stared back at Sax Brogan with a sense of fatal resignation.</p><p>Now, why hadn’t she guessed he was going to show up?</p><p>A man shouldn’t be so sinfully sexy, she thought. He shouldn’t steal a woman’s last breath with a frown, or make her knees weak from one of those hot little looks from dark, chocolate brown eyes. And he sure as hell shouldn’t make her pussy burn in the middle of a situation that was precarious to say the least.</p><p>“Hello, Sax, it’s good to see you again.” Sheriff Richards nodded back at him as Sax stepped into the house. “I hope you’re going to convince her to get out of here until we pick up Vince. She’s getting a bit testy on me.” He cast her an amused look.</p><p>Marey frowned back at him.</p><p>“I am neither testy, nor a child, Sheriff,” she snapped. “And I don’t need a man to take care of me. I can make decisions fine on my own.”</p><p>She hated it when men acted as though a woman was only safe if she had a man in front of her. In Sax’s case, if things went the way he wanted, she would have one behind her as well.</p><p>“Of course you can.” The sheriff nodded. “Which means you’re going to take my advice and get the hell out of here until I let you know we’ve caught Vince Clayton. Aren’t you, Marey?”</p><p>Why did men always think they were right and she was wrong?</p><p>“Pack some clothes, Marey,” Sax said easily, though she read the tense readiness in his body. “I’ll take you to Terrie or Ella’s, but you are getting out of here. If I have to carry you out.”</p><p>His dark face was set in lines of determination and resolve. Marey glanced away, knowing that if she left with him, he wouldn’t leave her anywhere else. She would be going to his house. His bed.</p><p>She glanced back at him knowing she was losing a battle she didn’t really want to fight any longer. She had set this in motion when she made that trip to the motel, when she had let her desires and her needs overcome her common sense. She had no one else to blame but herself.</p><p>“Go on, Marey,” the sheriff urged her. “We have an APB out on Vince, we’ll have him in custody soon. Until then, protect yourself. Get the hell away from the house.”</p><p>Like she had a choice at this point? She was well aware of the fact that she couldn’t stay at the house, and she wasn’t endangering her friends either.</p><p>Gritting her teeth in fury, she slanted Sax a fulminating look as she turned and stalked to the curved staircase.</p><p>“You’re taking me to a hotel,” she snapped, though she was careful to keep her back to him. “No questions, no alternatives. A hotel.”</p><p>“Whatever you want, Marey,” he called back, his voice carefully neutral.</p><p>Pausing, she turned back to look at him.</p><p>His expression was pure sin, sex in its most undiluted form. His dark eyes gleamed with it, his expression was filled with it. She was so fucked. Unfortunately, she had a feeling she was going to enjoy it. Too much.</p><p>Chapter Five</p><p>She knew he wouldn’t do as she asked. How had she known? She was psychic, she sneered to herself. She had known because she knew Sax Brogan. Three years before, he had claimed her with no more than a kiss. A dark, sultry earth-shattering kiss that had filled her senses with visions of hot, carnal delights and her mind with her own screams of lusty need.</p><p>She had held him off with a simple request. A plea. And for years he had abided by it. Until the day he was arrested because she was attacked during a meeting that she thought would involve him. She had known when she stepped into that motel room that she had made a grave, tactical error. Not only was she losing the battle with Vince, but she had known, if she survived, she would lose another, much more personal battle, with Sax.</p><p>He didn’t say a word after loading her large suitcase into the back of his Lexus and helping her into the passenger side. He had loped around the car, got into the driver’s seat, put the car in gear and driven away from her home. Straight to his. A beautiful two-story contemporary home on the outskirts of the city, surrounded by trees on two sides and the haunting melody of the ocean on the other. It was as rugged and strong as he was.</p><p>And she had kept her mouth shut. She hadn’t demanded he drive to the hotel. She had sat in the car, silent, watching the night pass by as her pussy grew wetter by the second.</p><p>“Nice place.” She finally found the courage to speak as he closed and locked the door behind them. The room they stepped into was huge. There was no entryway, just a large, open ceiling living room that was roomy and comfortable and at the same time as enduring as she had always thought Sax was.</p><p>“It’s home. The bedroom is up here.” He led her to the double doorway, stepping into a short hall with a tall, oak staircase that led to the upper landing.</p><p>Like the living room, the hallway had an open ceiling allowing her to glimpse the railed hall above. She followed him up the stairs silently, her heart thundering in her chest, knowing she wouldn’t, couldn’t fight him any longer.</p><p>The bedroom he led her into was obviously his. The stark masculine furniture, a huge king-sized bed, tall, wide dresser and a low, mirrored chest. One wall was open, with a sturdy railing and a view of the living room. Beside it was a computer desk, the computer sitting atop it was still running, the last instant message he had received still displayed.</p><p>From Wicked, Janey just called Tally. Vince hit the house. Get there now!</p><p>“Well, so much for confidentiality,” she remarked as she stared at the screen. “I thought dispatchers were sworn to secrecy or something?”</p><p>He moved to the computer and flipped off the screen with a snap before turning away from her and tossing her suitcase on the low chaise lounge that sat in front of the doors of the upper deck.</p><p>“You can put your stuff wherever you can find room,” he told her dispassionately. “We’ll go after the rest of your clothes tomorrow.”</p><p>“Will we?” she murmured. “You and whose army?”</p><p>She faced him fully then, aware of the tension whipping between them.</p><p>He shrugged out of his jacket as he turned to her, tossing it over her suitcase. He stared back at her, his gaze vividly hot as his fingers went to the buttons of his shirt.</p><p>“I don’t need an army, Marey.” His lips pulled back from his teeth in an elemental snarl. “Stop baiting me. You know you’re going to be here, at least for a while. Why not stop fighting it, and me, and we’ll see where the hell this thing is going.”</p><p>She drew in a short, quick breath.</p><p>“It shouldn’t go anywhere,” she snapped back. “Vince is insane, Sax. Do you enjoy placing yourself in danger?”</p><p>“The most danger I intend to face is that hot little pussy creaming between your thighs,” he snarled back, jerking the shirt from his broad shoulders as his words left her knees trembling.</p><p>If her pussy hadn’t been creaming before, it was now. Thick and hot, the juices seared the sensitive folds as her clit began to throb in an erratic, erotic rhythm. Her breasts became swollen, her nipples poking against her sweater, and she was certain every inch of her body was flushed from the heat rising inside her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, you’re as direct as always.” She crossed her arms over her breasts, facing him with a frown.</p><p>“I’ve learned to be, with you.” His hands went to the waistband of his slacks, his fingers loosening the clasp of his belt with a rough movement.</p><p>“Sax.” She swallowed tightly as the belt opened and his hands worked at the fastening. “Slow down.”</p> <p>He paused, staring back at her with hungry demand.</p><p>“I heeded that plea three years ago,” he said coldly. “I won’t this time, Marey. The time for games is long past.”</p><p>But he didn’t remove his pants. He came toward her instead, towering over her, making her feel weak, helpless. But protected. For such a large man, Sax had a way of turning her inside out and making her feel more feminine than any other man ever had.</p><p>“Look at you,” he sighed as he came abreast of her, staring down at her with sensual demand. “So small and perfect, your eyes darkening with arousal. Every time you look at me, I watch that, watch your eyes get dark and hungry for me. Do you know how hard that’s been to resist? How much I’ve wanted to throw you over my shoulder and take you away someplace where objections don’t exist? Where the world disappears around us and there’s nothing but me and you?”</p><p>Oh, now that really wasn’t fair. She felt the breath suspend in her lungs as her womb convulsed in longing. To hear that sexy, deep voice saying something so wickedly hot that it had her trembling in need.</p> <p>How long had it been since she had known a man’s touch? Three years since Sax’s kiss. Years before that. She had held herself aloof, no matter the loneliness or the sense of isolation. It had been easier to deal with the deprivation than the rages she knew Vince was capable of.</p><p>She stared up at him, helpless, weak with the needs thundering through her as he reached out, his hands gripping the hem of her sweater.</p><p>“I’m going to taste every inch of your body,” he whispered as he drew the material over her midriff. “I’m going to eat you like candy, Marey, and listen to you scream for more.”</p><p>He was going to have her screaming for more before he even got her shirt off at this rate.</p><p>“Sax.” Her hands fluttered helplessly as the sweater cleared her swollen, unbound breasts.</p><p>No bra. She hadn’t had time for one.</p> <p>“Hell, I could come in my pants just looking at you, Marey,” he sighed as his hand gripped first one wrist then the other, lifting her arms so he could pull the sweater over her head.</p><p>She was bare to him now, her breasts heaving, her nipples aching in response to the heated look in his eyes. His hands smoothed down her uplifted arms, drawing them down until her hands rested on his broad shoulders.</p><p>She trembled, shuddered in driving response as his hands lowered, cupping her full breasts, lifting them in his palms as his thumbs and forefingers tweaked the tender, responsive nipples.</p><p>She arched, gasping for breath as heat struck from the hard tips to the center of her womb. Her pussy rippled, the slick juices flowing in a rich stream to coat and prepare her for his penetration.</p><p>“Take my shirt off,” he whispered. “Come on, baby. Show me you need this as much as I do.”</p><p>She stared up at him nervously.</p><p>“I’m...” She licked her lips in hesitation. “I’m not good at this, Sax.”</p><p>Her fingers flexed against his chest as she stared up at him, imploring. Vince hadn’t been her first lover, but his abuse had all but destroyed her confidence. She was terrified of disappointing him.</p> <p>Shame coursed through her. She had known it would be like this. He would expect her to participate, to know what to do, to know how to love him in turn. Her throat thickened with rage and tears as she realized she didn’t know, had no idea how to touch him, how to pleasure him.</p><p>“It has nothing to do with how good you are at something, Marey.” His voice was dark, deep, as he shrugged the shirt from his shoulders, her fingers touching impossibly warm teak flesh then.</p><p>She trembled at the feel of him. Strong and heated, the muscles of his chest bunching beneath her touch as her lips moved along his chest.</p><p>“Just touch me,” he crooned gently, weaving a spell of sensuality around her that was impossible to resist. “I’ve dreamed of it, your hands on my flesh, your lips, your tongue, touching and stroking me with your hunger. Show me how hungry you are for me.”</p><p>Hungry? She was starved. She could feel her hand soaking in the feel of him, sending the sensation to parts of her body that shouldn’t even be considered erogenous zones.</p><p>As she stared up him, she licked her lips, her gaze centering on his. Perfectly, sensually full, they looked warm, inviting. She needed his kiss. She whimpered with the need, suddenly overwhelmed with the thought of touching and being touched. God, she needed him to touch her. Just a kiss. One small, light touch of his lips...</p><p>His head lowered, but there was nothing light in the possession he took of her. He groaned, a rough, desperate sound as his lips covered hers, his tongue stroking against the seam until she parted for him, gave him permission to raid the warm depths of her mouth.</p><p>One arm went around her, clasping her to him as her hand roamed over his chest, his steel-hard abdomen. He might work at a desk, but his body was in perfect shape, muscular and hard. So hard.</p><p>She moved against him, feeling the wedge of his cock behind his slacks, against her lower stomach. She trembled, pressing closer, her head falling back in surrender, her body sliding against his as her tongue reached out timidly to his.</p><p>Racing, desperate, clawing lust bit into her with a demon’s razor-sharp bite. She arched, sizzling heat blooming in her belly and streaking to her clit, her pussy, her engorged breasts. Out of control, her hands slid up his chest, his strong neck, gripping the back of his head as his hands arched her closer, lifting her until he could grind the thick erection against the pad of her cunt.</p><p>She cried out, shaking in the grip of an arousal she had never known before. Never, even in the darkest dark, when dreams so erotic, so sensual attacked her, had she known such a powerful, driving need as what she felt now.</p><p>“Easy, sweetheart.” His lips moved from hers, his hands holding her still when she would have followed, would have begged for more.</p><p>When he refused the caress, her lips moved to his chest. Sleek, tough skin over powerful muscles. Her tongue stroked over the dark flesh, her hands moving from his head to his abdomen. She wanted him naked, wanted him hot and blistering with desire as she was. It was killing her, the sudden, powerful sensations sweeping through her.</p><p>“There you go, baby.” His deep, crooning voice urged her in her madness.</p><p>And it was madness. She was setting herself up for a fall, a small weak portion of her mind warned her. This was destruction. It was a fall from which there would be no recovering.</p><p>Her lips moved to his abdomen, close, so close to the opened waistband of his pants. And beyond. Beyond lay the object of her desperation.</p><p>She nipped at his tight flesh as his fingers threaded in her hair.</p><p>“Loosen my pants, Marey. Release my cock, baby. I’m dying to feel your hands on me. Soft, silken hands. Do you know how often I’ve dreamed of watching your hands stroke me?”</p><p>She could feel the pressure burning in her clit as he urged her on.</p><p>Her hands trembled, fumbled with the tab of his zipper, but finally managed to work it over the straining erection. She heard him moan as her fingers brushed the tightly stretched cotton of his boxer briefs as her eyes opened, widened as she glimpsed the impressive length of him beneath the material.</p><p>His fingers tightened in her hair.</p><p>“Do it, baby,” he growled, his voice resonating with the same painful hunger whipping through her body. “Release my cock. Touch me, before I go crazy here.”</p><p>She pulled the elastic waistband down, pushing at it as it cleared his thighs, freeing the dark length of his erection to her touch. She touched him timidly, amazed at the feeling of satin warmth, and beneath it, iron-hard strength. Thick veins ridged the length of his cock as the pulse of blood pounded at the flesh.</p><p>The head was flared, a perfect mushroom shape designed for pleasure, damp with pre-come and throbbing imperatively. Closing her eyes, Marey allowed her tongue to peek out, to wash over the crest, tasting the salty male essence of him as he moaned roughly.</p><p>“There you go.” His breathing was rough, his voice deeper. “Let me feel that soft little tongue. Do you know it feels like hot silk?”</p><p>She licked over the head again, moaning herself at the taste of him. She wanted him, wanted more, she wanted to consume him.</p><p>Chapter Six</p><p>Sax knew he was walking a thin, fragile line with Marey. Her sexual confidence, as Ella had warned him, was extremely low. Nearly untried, hesitant, frightened, but so naturally sensual she was blowing his mind as she licked and probed at the tight, desperate flesh of his cock.</p><p>He wanted to push inside her mouth, wanted to fuck her lips and feel her sucking at him hungrily. But not yet. He had to let her take him as she needed him, explore and make him insane with the hot bite of lust.</p><p>His fingers tightened in her hair as her lips finally began to join the play. She sipped at the head of his cock, caressing him with feather soft strokes he was certain were designed to strip him of control. She was killing him, lick by slow, luscious lick.</p><p>“Oh hell. Yes. God, yes.” The words were torn from him as her lips finally, blessedly, wrapped around the straining head of his cock and sucked him in.</p><p>Heat lashed at him, whipping through his shaft, tightening his scrotum and sending electrical impulses of sheer sensual pleasure streaking up his spine. He held her head, keeping her in position, holding her that she could only suck him deeper, but never fully release him.</p><p>She was moaning around the flesh stuffing her mouth, her tongue lashing at it as she sucked at him.</p><p>“Damn, your mouth is paradise,” he growled. “All silky and wet and hot. Suck it, baby. Suck my dick, sweetheart.”</p><p>He couldn’t stop the words from pouring from his lips. Each phrase made her hotter, made her mouth tighten on him, her little tongue to go wild along the underside of the bulging head.</p><p>“That’s a good girl,” he crooned to her, closing his eyes, his head falling back on his shoulders as she sucked him like a little sex goddess. “Damn, Marey, that’s so good. So damned good it’s all I can do to hold back, baby.”</p><p>He could feel the tightening in his balls, feel his release gathering, threatening to break the fragile control he was fighting so hard for. He wouldn’t come in her mouth, not yet, not like this. When he filled her with his semen, it would be in a far more satisfying place than her sweet, hot little mouth. At least, he hoped it would.</p><p>“Enough.” His voice was a rasping sound of desperation as his fingers pulled at her hair in warning, intending to draw her back.</p><p>A sharp moan echoed around the stiff flesh she suckled as he pulled the strands. Her fingers clenched tighter at his straining thighs as her back arched.</p><p>Sax grimaced tightly, tugging at her hair again.</p><p>She whimpered, the sound one of dazed, intense pleasure. So he pulled harder.</p><p>Big mistake.</p><p>Her mouth moved on him, shuttling up and down, sucking him voraciously as her little tongue stroked and probed and pushed him further over the line. Her hands wrapped around the base of his cock, holding it steady, stroking in time to her mouth above as he pulled her hair again.</p><p>Slick wet heat engulfed him nearly to her throat. She was taking more of him, ravenous now. “Marey, baby. I’ll come down your throat,” he warned her desperately. “Let up, sweetheart, or you’re going to get every drop of it.”</p><p>She stroked him more intently than ever, her mouth consuming him as he bucked against her, fucking past her lips as his hands pulled at her hair, relishing the unbidden, kittenish little mewls of pleasure that erupted from her throat.</p><p>He hadn’t meant to take her like this first, he thought despairingly as he felt his balls tighten further, the tingling at the base of his spine intensifying. But it was paradise. Paradise and torment at once, and he was helpless against her. For now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He held her steady, his hands exerting pressure on her hair as he deepened his strokes, driving into her suckling lips, his body tightening, sensitizing...</p><p>“Son of a bitch. Suck it, baby. Suck my dick, Marey. Take it all.”</p><p>He felt the first hard pulse of semen as it shot from the head of his cock, splattering against the back of her throat as she began to swallow, moaning and twisting against him as he buried in deeper and gave her all he had. Harsh, rapid jets of seed spewing into her mouth, only to be caught by her hungry little tongue and consumed until he had nothing left to give.</p><p>He pulled back from her then, ignoring the soft cry of regret as his cock pulled free of her lips with a hollow little “pop”.</p><p>“Come here.” He urged her to straighten as his hands went to the metal snap of her jeans. “Kick your shoes off for me, baby.”</p><p>He was pushing the waistband over her hips, going to his knees and burying his face in the soft flesh of her stomach as she shuddered in his grip.</p><p>“Your mouth is destructive,” he whispered before allowing his tongue to dip out and probe at the shallow indention of her navel as she struggled out of her sneakers. Then he was pushing her jeans to her ankles, lifting her feet free and opening his eyes to stare up at her.</p><p>“You were a very naughty little girl,” he drawled as his hand stroked up her leg to curl around the curve of a buttock. “Do you know what naughty little girls get?”</p><p>Her eyes darkened further, almost black now as he caressed her ass.</p><p>She shook her head sharply, her lips parted as she fought to draw in air. She looked dazed, almost uncomprehending as he licked at the damp, rounded flesh of her belly.</p><p>“They get spanked,” he whispered then, watching her eyes, her expression.</p><p>Curiosity and trepidation filled both.</p><p>God, he couldn’t believe how innocent she was, so sweetly untried that it would be the same as taking a virgin. Something he had never dreamed would turn him on until now.</p><p>He rose slowly to his feet, pulling her to the bed and sitting down as he stared back at her.</p><p>“I’m going to spank you,” he told her, relishing the very idea of it. “I’m going to make your ass and your pussy burn so bright you’re going to scream for me to take you. To fuck you until you can’t breathe for coming.”</p><p>“I will now,” she gasped, her engorged, hard-tipped breasts rising and falling sharply.</p><p>His cock jerked at her rough declaration.</p><p>He glanced at the crotch of her panties. A silky thong that left her ass bare and clearly showed the dampness seeping from her pussy. He was going to bury his mouth there and see if it was possible to lick her dry. His mouth watered at the thought.</p><p>“You will anyway.” He pulled her to him, drawing her down across his knees as she shuddered, the soft curves of her ass clenching.</p><p>Stretched over his lap, her head hanging down, her feet lifted from the ground, his hand smoothed over the soft, creamy perfection of her ass. He lifted the little band of fabric from the cleft of her butt, grimacing in raging lust as he parted the cheeks of her ass and glimpsed the small, delicate entrance to her anus.</p><p>Tempting. Tight. His cock clenched at the memory of being buried there.</p><p>He returned the material to its resting place, smoothed his hand over her butt then lifted it for the first soft blow.</p> <p>She flinched, crying out at the first small smack. Not pain, he could tell by the arch of her sweet backside that it wasn’t pain. Or at least, not a pain she didn’t want to experience again.</p><p>The erotic, sensual burn on her butt was driving her crazy. She could feel her flesh heating, absorbing each small smack as it tingled and ached for more. She had never known anything so sexual, so completely naughty as being bent over Sax’s knee, her ass burning from each erotic blow.</p><p>“You flush so pretty,” he praised her, his voice dark and rough as another burning caress was applied to her rear. “A soft beautiful little blush.” She shivered, jerking and crying out as he landed another soft blow.</p><p>It wasn’t painful. It heated her flesh by degrees and sent sensations whipping through her body with lightning fast precision. Each little smack heralded a sharp, burgeoning ache in her pussy, making her juices flow from the ache deep inside. Her clit was swollen, throbbing, desperate for his touch.</p><p>“So pretty, Marey.” His hand smoothed her buttock a second before he smacked it again.</p><p>She writhed on his knees, pressing her pussy into his thigh and whimpering with the rising demand vibrating there. She was burning. Each well-aimed, carefully timed smack to her rear only increased the flames.</p><p>“Sax, please...” she finally wailed as the next, firmer tap sent her senses careening. She jerked, shuddering as a burning lash flayed her clit and sent fiery fingers of sensation to attack her womb.</p><p>Her pussy was soaked. She could feel the juices clinging to her flesh, dampening her panties. Fire burned her from her ass to her cunt, making her writhe with a lust she hadn’t thought was possible.</p><p>Before she could gasp, he lifted her, turning her in his arms and depositing her on the bed as he came over her. His cock stood out from his body like a flesh and blood lance, the tapered head glistening with pre-come.</p><p>His lips came down on hers again. A hard, deep kiss that had her moaning, twisting beneath him as her hands gripped his shoulders and her hips lifted to him.</p><p>“Not yet,” he growled, his voice rough as his lips moved to her cheek, her neck. “Not yet, Marey. I’ve waited too long for this, I have no intention of rushing it.”</p><p>“Sax, you’re burning me alive,” she whimpered.</p><p>It wasn’t supposed to be this good. How was she supposed to survive losing something that felt this good, and he had even taken her yet.</p><p>“You’ll burn brighter before I’ve finished,” he warned her, the dominance in his tone making her shiver in anticipation.</p><p>His hands cupped her breasts then, lifting them to his lips. She watched, spellbound, as his tongue curled around the stiff peak of her nipple, licking at it, sending lightning-bright sensation shooting to her clit.</p><p>She convulsed with the pleasure, shuddering beneath him as he sucked the tender tip into his mouth, rasping it gently with his teeth before sucking it firmly. Her head twisted on the mattress as she fought to breathe. Arousal pulsed through her body like a hard electrical current, sensitizing her nerve endings, whipping through her bloodstream and driving her closer to an edge of pleasure she could never have imagined.</p><p>“Damn, you’re exquisite,” he growled as his lips began to roam lower.</p><p>He spread her thighs wide as he licked and kissed his way over her midriff, her abdomen, growing steadily closer to the steamy pussy covered by little more than a scrap of silk.</p><p>Silk that a second later ripped beneath his hands.</p><p>Excitement burst through her bloodstream, anticipation electrified her flesh.</p><p>She stared down her body, watching as he pushed her legs apart a second before he licked his lips and lowered his head.</p><p>The first firm, broad lick of his tongue through the drenched slit of her pussy nearly threw her over the edge into climax. She shuddered in the grip of pleasure, crying out hoarsely as she lifted her hips, begging for that final stroke that would throw her over the edge.</p><p>“Not yet.” His voice was raw, carnal lust. “I’m going to taste you first, Marey. Every soft, slick, sweet inch of this delectable pussy is mine now. And I promise you’ll never forget it.”</p><p>She screamed a second later as his tongue plunged inside her. There were no gentle preliminaries, no warning. She was empty, then she was filled, his tongue stroking inside her as his hands gripped her buttocks and lifted her to his mouth.</p><p>He sucked at the juices that flowed from her, hummed his approval of her taste and her response against her clit until she was begging, screaming. She was dying in need of him.</p><p>“Please, Sax.” Her hands gripped the comforter with desperate hands. “Please now. I can’t stand it any longer.”</p><p>He moaned against her flesh, his tongue suddenly flaying her clit, lashing at it with devilish greed as the pleasure grew and grew toward the explosion that would rip through her and destroy her mind. Her eyes widened, her lips opened to scream but all that emerged was a hoarse, brittle cry as her orgasm built, exploded through her with a force that left her convulsing, her muscles locking in desperate sensation as he came over her.</p><p>“You’re not finished yet, Marey.”</p><p>She felt the broad head of his cock press against the tender opening of her pussy, and while the spasms of her climax echoed through the clenching flesh, felt him begin to push inside her.</p><p>“Damn.” He grimaced almost painfully as she arched, a throttled scream tearing from her throat as fiery pleasure-pain assaulted the muscles of her pussy as he began to stretch them open. “You’re so fucking tight, baby.”</p><p>She couldn’t stand it. She couldn’t survive it. She felt every inch of his erection as it tunneled inside her, stretching apart unused muscles, stroking nerve endings she didn’t know she possessed.</p><p>The previous climax wasn’t given time to die away or to abate before he began building the next one. Marey stared up at him, her eyes locked with his, bemusement whipping through her as she gasped, tried to beg but could only cry out as he shifted against her and wedged tighter and deeper inside her.</p><p>“You feel like wet silk. Hot, tight wet silk.” His voice was a hoarse rumble as he breathed roughly above her, but his words...his words had her pussy convulsing around him as more of her juices eased his way.</p><p>Retreat, reenter. Retreat, reenter. Pulsing, throbbing strokes opened her tender flesh as he thrust his cock inside her. In and out, probing, deepening, wringing gasping screams from her throat as each stroke drove her higher.</p><p>“Oh, baby,” he whispered as he lowered his head, kissing her lips, her neck. “Do you know how good this feels? Your pussy tightening around me, milking me like an erotic little mouth, sucking me in even as it tries to force me out.”</p><p>His voice was so deep, so rough it was like a physical caress, stroking over her, inside her.</p><p>She bucked against him, driving him deeper as they both moaned in rapture.</p><p>“Hold on to me, sweetheart,” he whispered at her ear then. “I’m going to take all of you now. Every. Sweet. Fucking. Inch.”</p><p>She screamed as he drove inside her the last few inches, filling her to the hilt with heat and hardness, with fiery pleasure and the rasp of pain. One hand held her hip as the other lifted her closer to his chest as he began to move.</p><p>This wasn’t fucking. She didn’t know what it was, how she was supposed to describe it, but this wasn’t what she had done with her ex-husband. This was primal, elemental. She hung on to his shoulders, her nails biting into his flesh as each stroke seared her cunt and set her clit on fire.</p><p>She moved beneath him, pushing against each thrust, driving him deeper inside her as she writhed on the impalement.</p><p>“Yes,” he hissed at her ear. “Fuck me back, baby.”</p><p>His hips rotated, his pelvis stroking against her clit as a white, bright light began to glow at the edge of her vision. She couldn’t stand it. She couldn’t breathe, she wouldn’t survive the pleasure.</p><p>“Fuck me,” he snarled at her ear again as he began to fuck her harder, driving inside her, pushing her higher as she slammed her hips back at him.</p><p>“Sax. Sax, please...oh God... Sax, it’s too good...too good...” She felt the crescendo rising inside her. Her womb tightened, her clit began to pound with a steady hard throb until she exploded.</p><p>She felt herself come apart in his arms, over and over again. It wasn’t a single, terrifying explosion, but multitudes of them washing over her, convulsing her entire body beneath him as a strangled cry wailed from her throat.</p><p>Another hard thrust as she heard him groan, his head lowering, his hips driving his cock deeper, harder, and she felt the first torrential explosion of his semen inside her. Each hard blast of his release had her shuddering in renewed pleasure as it echoed within her own climax. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It seemed to last forever, and yet it ended too soon. She collapsed beneath him, fighting to breathe, drowsiness weighing at her limbs as she felt him move, and moaned at the feel of his cock sliding free of her as he fell beside her.</p><p>His arms came around her, hard, warm. Protective.</p><p>“I’m tired,” she sighed, snuggling against him as her eyes fluttered closed.</p> <p>“Sleep, baby,” she heard him whisper gently. “Sleep right here. Where you belong.”</p><p>Chapter Seven</p><p>Sax sat at the edge of the bed hours later, staring down at Marey as she slept. His mind was a morass of thoughts and emotions. Finally, he had her here, where he wanted her, had wanted her for years.</p><p>The sheet was pulled to her hips, revealing the delicate lines of her back. Her dark blonde hair fell over her neck and shoulders and framed her profile like a silken cloud.</p><p>Her unique looks could never be described as beautiful, they were too strong, too stubborn for such a term. His lips quirked in a grin as he considered the stubborn part. Her expression often reflected the inner part of her, willful and determined, but it was subtle. A quality many people often missed because they were unaware of what they were looking at.</p> <p>But Sax knew. He had seen it in her the first time he met her, just before her divorce. He had seen the misery in her eyes, but her determination to hide it from her friends. When she thought no one was looking, weariness and resignation would draw her shoulders down before she would resolutely straighten them.</p><p>For years after the divorce, despite the hell he knew her ex-husband had put her through, she had maintained a dignity that he could do nothing but admire. And a body that drove him crazy to possess.</p><p>He loved her. Despite the fact that she had run from him, that she had denied him at every turn, the need for her wouldn’t ease. It only grew stronger, deeper. He had her, for now, but he was smart enough to know that keeping her wouldn’t be as easy and getting her into his bed had been. He would have to keep her off balance, keep her body humming, her mind immersed in her sensuality until she knew she couldn’t survive without him.</p><p>He knew what she hid from herself. He saw it in her eyes, in her voice, in the hunger in her expression. He had her heart, she just had to realize it. And getting Marey to realize what she didn’t want to see would be his hardest battle.</p><p>He drew the blanket further over her back before rising from the bed and heading for the shower. He had waited, watched, knowing the day would come when Marey would drop her shields and allow him the chance he needed to break into her heart. He was in there now, though he was certain she would deny it to herself as long as she could.</p><p>He also knew something else about Marey, something she had revealed hours before. She loved the sensual dominance he could give her. She liked the fiery pleasure-pain and walking that fine line of carnal intensity. He would push her, he couldn’t give her time to think, to consider the evolving relationship he could see coming. If he did, she would run. And he couldn’t allow her to run. He wouldn’t allow her to run.</p> <p>“When you get ready, I need to run in to the office for a few hours,” Sax announced as Marey sat silently after breakfast, fortifying herself with caffeine, wondering how she was going to manage to escape this new situation.</p><p>Sex with Sax was incredible. Too incredible.</p><p>“Go ahead.” She took the final sip of her coffee. “I’ll get ready and you can drop me off at a hotel.”</p><p>The tension that filled the room was like a punch in the gut. She raised her eyes, staring back at him as he watched her silently, his eyes narrowed on her.</p><p>“Stay a few days,” he finally suggested casually, as though it didn’t matter either way, as though there was no risk in such an action. “At least until they’ve picked Vince up, Marey. You aren’t safe in a hotel. You’re safe with me.”</p><p>She breathed out wearily, pushing her fingers through her still damp hair as she sat back in her chair and watched him directly.</p><p>“And if Vince decides to blame you for the fact that I’m here, rather than where he can get to me?” she asked him defensively. “What then, Sax? He’s not sane. He won’t go after you with his fists as he does me. He could come after you with a gun.”</p><p>A savage smile tightened his lips.</p> <p>“I would look forward to it, Marey,” he snarled. “Unlike you, I know how to deal with bastards like that. He won’t get to me easily, I promise you that.”</p><p>Were all men insane? Or just the ones she knew?</p><p>She closed her eyes as she clenched her teeth and held back a furious growl.</p><p>“And what makes you think you’re invincible all of a sudden?” she snapped, coming to her feet, ignoring the glint in his eyes as they dropped to her bare legs beneath the long hem of one of his T-shirts.</p><p>“I don’t think I’m invincible, Marey,” he assured her, his voice deepening, thickening with lust as he watched her. “But I know the type of man Vince is. A bullet isn’t personal enough, it doesn’t prove his strength, and that’s what’s important to him, proving his superiority.”</p><p>In that, he was right. Vince couldn’t tolerate believing an opponent could be physically superior to him. He didn’t own guns, he owned fists and knives.</p><p>“And I’m supposed to just accept the fact that you’re placing yourself in his path,” she snapped belligerently. “I don’t think so, Sax. I don’t need these problems.”</p><p>“Do you think he can beat me, Marey?” Genuine amusement reflected in his expression then. “Are you afraid your man can’t protect you?”</p><p>“You aren’t my man,” she muttered, using the only defense she could come up with. “And right now, you’re acting like a little boy playing one-upmanship.”</p><p>“One-upmanship is not a child’s game,” he informed her with a slow, sexy smile. “It’s a man’s game. Want me to show you?”</p><p>Oh man, the sound of his voice, the look in those dark eyes. Her pussy was suddenly humming in need, creaming furiously to the pure sexuality there.</p><p>“That’s okay.” She scuttled quickly out of his way, watching him warily now. He could turn her knees to mush and her resistance to no more than a passing thought. There wasn’t a chance in hell she was going to let him touch her. “You go on to the office. I can just lounge around here. Use the hot tub.” Call a cab and find a good hotel.</p><p>He tilted his head questioningly. “If you walk out of here now, we’ll never know what could have been, Marey. Is that what you really want?”</p><p>Was it? No, she didn’t want that, but neither did she want to see Sax pay for her mistakes.</p><p>She drew in a harsh breath. “After they catch Vince—”</p><p>He was shaking his head before the words were out of her mouth.</p><p>“I don’t want a woman who can’t trust me to protect her.” He crossed his arms over his chest, staring down at her somberly. There was no anger, no fury, just pure male stubbornness.</p><p>Marey stared back at him, bemused. He should be furious, not calm. In hindsight, she realized she had more or less given the impression she didn’t trust him to protect her. She hadn’t meant to. She had never felt that way. But his male pride should have at least been pricked. There should have been anger, a snarl, snapping sarcasm. Something besides somber intensity, steadiness.</p><p>Her hands clenched in the material of the T-shirt as she fought to come to grips with this new brand of male species. Who knew they could be so damned hard to figure out?</p><p>“I trust you to protect me,” she finally answered, clearing her throat nervously. “It has nothing to do with that. I’m used to protecting myself, Sax.”</p><p>She had been doing it for a long time. She might have messed up a time or two, but for the most part, she thought she’d done a fairly good job.</p><p>“And Vince is determined to hurt you, no matter the cost to himself,” he told her quietly. “You know you can’t fight him, Marey, you’ve seen that. He tried to kill you.”</p><p>“I don’t need you to stand in front of me.” She turned away from him, furious herself now as she paced to the sliding glass doors that led to the deck. “Dammit, Sax, why do you think I’ve stayed away from you? Why do you think I’ve lived like a nun in that damned fortress Father built, and forgot I was woman all these years? He’s crazy. He could try to kill someone.”</p><p>“Yes, he could,” he snapped, but not in anger, more in frustration. “And that someone could be you. Because he knows you’re not strong enough to fight back. Until the sheriff apprehends him and the courts put him away for good, you need to stay safe. I can keep you safe.”</p><p>He said the last sentence as he moved behind her, pulling her against his much taller body, his strong, warm body, as she fought the weakness that filled hers. He made her weak, made her want to lean on him, trust him. How insane was that? She knew better than to trust anyone.</p><p>“If you walk away now, Marey, it’s forever.” He lowered his head, pressing a kiss to her hair as his eyes met hers in the glass. “Now, are you going to the office with me, or do you want me to take you to that hotel?”</p><p>She stared back at him, their gazes locked in the glass of the sliding doors, and frowned fiercely.</p><p>“You are going to piss me off,” she finally snapped.</p><p>Surprise flared in his eyes. Surprise and arousal.</p><p>“Baby, that’s a given,” he chuckled. “Now, make up your mind and let’s get out of here. I have work waiting.”</p><p>Chapter Eight</p><p>Sax watched from beneath his lashes as Marey lounged on the couch on the other side of the room, calmly flipping through a magazine as he worked on the reports he needed to finish up for the day.</p><p>She was driving him crazy. She was as calm and placid as a mountain lake right now, waiting on him, as though it was nothing unusual to have little or nothing to fill her day. He knew she was an editor for a small publishing company, one that published extremely erotic content. She hadn’t been the one to reveal the information though, it had been Ella who had dropped that little bomb months before.</p><p>Was that how she had learned to sit so silently, immersing herself in whatever she was reading? Or had she learned patience and silence while caring for her ill parents so many years ago?</p><p>There was so much about her that he needed to know. So many ways he wanted to learn everything possible about this intriguing woman.</p><p>“Bored?” he asked curiously.</p><p>She glanced up, her gaze a bit distant as it met his.</p><p>“No.” She shook her head. “I have company.”</p><p>She lifted the edge of the magazine before returning her attention to the article she was reading. It wasn’t fluff. The news magazine was one of his favorites actually.</p><p>He shifted in his chair, attempting to ease the uncomfortable weight of his throbbing erection.</p><p>“Do you need to run by your house before we head back to mine?” he asked her then. “Pick anything up?”</p><p>She glanced up again. “No. I should have enough for a few days.”</p><p>Her attention went back to the magazine. It made him crazy. Made him horny. She was as calm and relaxed as a summer’s day, and just as damned hot. He knew how hot she could get, how wet and sweet.</p><p>“How long has it been since you’ve had a lover?” he asked her then, shifting to relieve the discomfort of his hard-on.</p><p>He watched her tense before she looked back at him, narrow-eyed and suspicious, but hot.</p><p>She glanced at her watch mockingly.</p><p>“Eight hours maybe?” She went back to the magazine.</p><p>Sax observed her for long moments. She looked cool as hell, but he could see the altered breathing, the heavy rise and fall of her breasts. She was aroused. Just that fast. Her nipples were pressing tight against her shirt, her face flushed just enough to testify to her heat.</p><p>“Before that,” he bit out between clenched teeth, waiting, his erection throbbing in agony. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She flipped the magazine closed and turned to him defensively, her gray eyes sparkling in defiance.</p><p>“Exactly what do you want to know, Sax?” she asked him. “And why all the questions?”</p><p>God he loved it when her eyes went hot like that. Anger and passion and complete female stubbornness mixed with arousal. It was invigorating, energizing. It was making him so fucking horny he couldn’t breathe.</p><p>“Does everything have to be a test?” he growled back, coming out of his chair and stalking across the room. “Maybe there are just things I want to know about you.”</p><p>“You should pretty much know everything by now,” she shot back, staring up at him as he towered over her. She didn’t jump to her feet to even out the distance or to assert her own control. She kept her seat, though she leaned back against the couch to keep the arch of her neck at a more comfortable angle. “It’s not as though we’ve just met.”</p><p>“And the more I think about it, the less I know,” he told her, frustration rising within him.</p><p>“And how many lovers I may or may not have had is important?” She arched her brow mockingly. “Fine, Sax, until you, there’s been no one since my divorce. Before my marriage there were two. I’m sexually inexperienced but not stupid. Anything else?”</p><p>“What the hell do you do all day besides flip through magazines and edit romances?” His cock was steel-hard and driving him crazy with the need to fuck.</p><p>She smiled slowly, her eyelids drifting lower, giving her a mysterious, sensual look.</p><p>“Play with my favorite toys and fantasize about you,” she drawled. “What do you do when you’re home alone?”</p><p>The little liar. He could see the devilry in her gaze, the deliberate teasing in the way her tongue stroked slowly over her full, lower lip.</p><p>“Jack off and imagine your ass burning red,” he snarled, reaching down and pulling her to her feet. “I won’t let you hide from me forever, Marey.”</p><p>“But I’m not hiding anymore, Sax,” she reminded him, her hands moving up his chest, over his shoulders. “I’m right here where you can see me.”</p><p>God, she was a temptation. A sweet, beautiful little keg of dynamite standing placidly in his arms. For now.</p><p>She shifted against him then, her lower stomach pressing against the hard ridge of his cock as a light flush of arousal stained her cheeks.</p><p>“Are you finished working?”</p><p>His fingers burrowed in the soft weight of her hair as he held her still, watching the heat flame in her eyes.</p><p>“I’m finished,” he growled as he pulled at the silk he held, watching her eyelids drift lower as sensual weakness consumed her.</p><p>“We could go back to the house.” Her hands moved from his shoulders to his waist, gripping the flesh there as his head lowered to her cheek.</p><p>“I won’t make it to the house,” he told her roughly. “I want you here. Now.”</p><p>A low, aroused laugh came from her throat as she tilted her head back, allowing his lips to caress her neck.</p><p>“Trojans and their office sex. I’ve heard about that.”</p> <p>“You hear too damned much. Those women have loose lips.” He nipped at her neck, imagining her stretched out on the leather sofa, naked and filled with his dick.</p><p>She gasped as his hands moved to her breasts, cupping the delicate weight, his thumb and forefinger testing the hardness of her nipple through the soft silk blouse she wore. He was dying to get it in his mouth, to feel the sensitive nub growing harder as he sucked at it.</p><p>“You know too much about things you shouldn’t.” He nipped at her neck, feeling her shudder from the erotic little pain he delivered.</p><p>“Hmm, have to get my jollies somewhere,” she moaned as he licked at the soft flesh he had nipped.</p><p>Oh, he could give her jollies, he thought with a grimace of building lust, more jollies than she could have imagined.</p><p>As his lips moved to hers, taking her in a kiss that had them both moaning at the heated pleasure of it, his hands went to the small buttons of her shirt. He wanted her naked, wanted her wet, wild and screaming out her pleasure.</p><p>“You need to lock the door,” she gasped as the sides of her blouse fell apart and his lips wandered down her neck.</p><p>Her breasts were swollen, flushed, her hard little nipples poking against the lace of her bra as his lips drew closer.</p><p>“Hmm. Live dangerously,” he murmured as he licked over the delicate curves. “Consider it a jolly.”</p><p>Chapter Nine</p><p>Consider it a jolly? She was fucking going to go through the roof as it was.</p><p>“You’re crazy.” She could feel the fires building in her body, the heat attacking her pussy like an inferno gone wild.</p><p>“Am I?” He drew the shirt from her shoulders, dropping it to the floor as his fingers moved to the clasp of her silk slacks. “It’s closing time, but anyone could still walk in. A lot of the Club’s members come in to my office, Marey. They wouldn’t touch you, but they would watch, see your little pussy flared around my cock, hear your cries as I go in hard, deep, and push you over the edge.”</p><p>She trembled, her eyes closing at the insidious images he was provoking.</p><p>“Have you ever been watched, baby?” Her pants dropped to her ankles, revealing the white lace thong she wore beneath them. “Seen the arousal in another man’s face as your lover pumps into you? And I would. I would give them a show. I would show them how sweet and tight your cunt grips me, draw out and let them see the slick, syrupy juices that flow from you before I’d push back in, and let them hear your screams.”</p><p>Oh God. This was just nasty. Depraved. It was killing her. She had never, ever done anything like that. But she had to admit, Terrie and Ella had piqued her curiosity, made her wonder if it could truly be as good as they claimed it was to be part of Sax’s sexual lifestyle.</p><p>“How...” She fought the moan that would have been more a scream as his hands gripped the cheeks of her ass and he pulled her closer to him. “How can you share like that? Why aren’t you jealous?”</p><p>“Because I want your pleasure. All of it. I want to see the surprise and the sensual agony twisting your features, and know I’m a part of it. I want to see you screaming, begging, every inch of your body caressed and pleasured. But we’ll both know who you belong to, Marey,” he whispered. “Won’t we?”</p><p>His lips lowered to her breast, his gaze still locked with hers as his tongue curled around the elongated nipple, sensitizing it further, sending currents of pleasure ripping into her womb.</p><p>Who she belonged to? She knew who she belonged to, and it terrified her. Marey shuddered as pleasure burned through every cell of her body and the truth of her own sensuality and emotions burned through her mind.</p><p>She had waited for this. Longed for this. Even before she knew the sexual lifestyle Sax embraced and what a relationship with him would mean. She had put her own sexuality on hold, waiting, knowing the day would come when she would have this chance, this brief time to be the woman she had always longed to be in his arms.</p><p>As his lips created havoc and mind-destroying pleasure with her nipples, Marey’s hands moved to his shirt. Her fingers slipped the buttons free, her hands pushed the material from his broad shoulders. She needed to touch him, to feel him. She needed to memorize every rough indrawn breath, every groan that came from his chest, so she would have the memory later, when the man was gone.</p><p>Her hands smoothed over his bare chest, down the tight planes of his abdomen, to his slacks. She made short work of opening his slacks as his lips sipped at her nipples and his hands roamed over her back and shoulders. She needed him naked, close to her, warming her.</p><p>“Come here.” He pulled her to the couch, easing her upon it until she was stretched out and staring up at him with dazed need.</p><p>God, she ached. The sensual pain was destroying her. She had never, at any time in her life, been as aroused as she was now.</p><p>“I could eat you forever,” he whispered as he knelt on the floor, slowly pulling the thong from her body, his hands spreading her thighs, positioning her until her pussy rested at the edge of the cushions. “You have the sweetest pussy I’ve ever tasted, Marey.”</p><p>His lips lowered to her as she watched, his expression tight with lust, his dark eyes glowing with it as his tongue extended and swiped slowly through the shallow, bare slit of her pussy.</p><p>Marey jerked, flinching at the pleasure of his heated tongue licking her, caressing her waxed folds with hungry intent. He wasn’t in a hurry. He parted the inner lips with his thumbs and explored the valley with destructive leisure as she tensed and fought to rein in her own pressing need for orgasm.</p><p>Her hands went to her breasts, her fingers plucking at her nipples as she watched him, entranced by the sight of him, so big and broad between her splayed thighs, as he made a sensual meal of the heated juices that spilled from her pussy.</p><p>His eyes flared at the sight of her pleasuring her breasts. It sent a sharp biting thrill shooting through her body to realize it had pushed his arousal higher. She fought to ignore the emotional impact, the chinks developing in the shields she had raised against him. She wanted to enjoy, to allow every fantasy she had ever had of him, life.</p><p>Her breath hitched as his tongue circled her clit, his lips surrounding it to suck at it gently as tremors of ecstasy began to ripple through her womb. Then his hand moved, his fingers sliding through rich feminine cream, easing it lower as he massaged the tiny entrance to her anus.</p><p>Her eyes closed. She couldn’t watch him, couldn’t let him see what it was doing to her. He prepared her slowly, drawing her juices back, pressing the pad of his finger into the small opening as she bit her lip and tried to hold back the pleas and cries that would have spilled from them.</p><p>“You’re so tight,” he groaned, his voice a hard rumble in his chest. “So sweet and hot. But I want you hotter. So hot, that you have to have more.”</p><p>She wanted more now. The small, tiny little bites of sensation weren’t enough. She needed more.</p><p>“Do you like that?” His finger slid in deeper, massaging the sensitive nerve endings just inside the entrance, making her tighten on him, then relax. She needed more.</p><p>“Sax...” She was breathing hard, heavy. “More. Please.”</p><p>She heard a growl, a hungry male sound of pleasure as he slid in further, his lips moving on her clit again, building the pleasure inside her to a lava-hot intensity. She couldn’t bear it. She whimpered, her hips writhing, pressing closer, impaling herself further on the broad finger penetrating her ass.</p><p>Each surging, burning fork of pleasure that struck her drove her higher. She was panting, pleading, mewling sounds of need falling from her lips as she felt herself nearing the edge.</p><p>“Go over for me, baby,” he whispered roughly as his lips surrounded her clit, one hard finger penetrated her gripping pussy, while the one that teased her anus slid in, sending fire scorching through her body, pleasure tearing through her senses until she erupted, shuddering and screaming out her pleasure as her orgasm exploded through her.</p><p>He didn’t give her time to come down, for the vibrations to ease away. He rose between her thighs, his cock jutting toward her, thick and hard as her gaze centered on it.</p><p>He pressed the erect flesh against the bare folds of her pussy as Marey gasped, watching as the flared crest pushed in, disappearing inside as flames began consume her. He held her legs over his arms, holding them apart, watching as she watched, filling her slowly as she began to tremble.</p><p>“Sax. It’s so good,” she cried out, her voice barely more than a low gasp as the pleasure began to consume her once again. “It’s so good...so hard...” Her back arched as she panted for breath, using her inner muscles to caress and milk the iron-hard flesh as it impaled her.</p><p>“And you’re so soft,” he growled. “So soft and tight you steal my mind, Marey.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He pushed into her, stretching her slowly, filling her pussy with the incredible heat and pleasure that she knew she would only find with Sax.</p><p>Her gaze stayed centered on his dark cock as he impaled her. Moving inside her slow and easy, working in and out until finally, every inch buried inside her, stealing her breath.</p><p>Control was, for both of them, a thing of the past then. Sax didn’t take her gently, though he never hurt her. He held her firmly in place, his hips moving hard and fast, his cock jackhammering inside her with a frantic, almost desperate pace as the pleasure began to build, to whip through her in blistering bolts of sensation that had her screaming, her head falling back against the couch as she arched to him.</p> <p>It was too good. Too hard. Too much pleasure.</p><p>“Harder,” she screamed out as her orgasm began to peak, the slamming of his erection inside her stroking nerve endings too sensitive, too responsive, for her control to handle. “Harder, Sax. Fuck me harder.”</p><p>He groaned, the sound rough and primal as the thrusts increased, the heavy pressure building in her pussy, her womb, her soul...</p><p>She exploded, screaming out his name as she felt him drive in deep, felt the flexing of his cock, then the scalding release of his seed as it began to jet inside her, prolonging her own orgasm, driving it higher, hotter.</p><p>She collapsed minutes later, fighting to breathe, to make sense of the incredible lethargy and sense of peace that suddenly filled her. As though this was where she was meant to be.</p> <p>That evening, wrapped in a towel and carrying a bottle of chilled wine, Marey joined the five Trojan wives in Sax’s hot tub. The impromptu meeting had been arranged before they left the office. As they were leaving, James had invited them to ride back with him and Ella in the company limo. With a knowing grin, he had informed Sax that Ella was becoming impatient to visit with Marey, and putting her off was evidently causing him a few sleepless nights.</p><p>Tess, Cole’s wife, was stretched out on one end of the ten-seat tub, eyes closed as she smiled at something Terrie, Jess’ wife, said beside her. Ella, married to Jess’ twin brother James, sat on the far end beside Tally, the only woman lucky enough—or was that courageous enough?—to be in a relationship with the twins, Lucian and Devril Conover. Kimberly, Jared Raddington’s wife, sipped at her wine as she watched everyone else. She was the quietest of the five women, but no less important within the small group.</p><p>“You’re taking long enough, Marey,” Ella smirked as Marey dropped her towel and eased naked into the bubbling water.</p><p>She snorted at her friend’s comment as she poured a glass of wine and sat the bottle on the deck behind her.</p><p>“Doesn’t it bother the rest of you when those men close themselves off like that?” she asked, referring to the fact that the seven men were now closed in Sax’s office, discussing only God knew what.</p><p>It bothered her. Made her nervous, especially considering the fact that her lover was one of them.</p> <p>“Yeah, maybe the rest of them are giving Sax advice,” Ella drawled. “You know, on how to spank stubborn women.”</p><p>“Naw, that’s a treat,” Tess countered with a laugh. “They’re in there convincing him of the merits of abstinence. Punishment lies in doing without, not getting extra. Ask Cole, he’s learned that fact several times.”</p><p>“Yeah, right,” Terrie snorted at that one. “Come on, Tess, ‘fess up. What’s your best holdout time? An hour?”</p><p>“Almost,” Tess laughed back. “Or until he pulls out the toys.”</p><p>“Oh God. I shouldn’t have to listen to this.” Ella covered her ears in mock horror. “That’s my daughter.”</p><p>“Prude,” Tess chuckled.</p><p>“Not anymore, Tess,” Terrie pointed out with a laugh. “James and Sax reformed her.”</p><p>Ella’s blush covered her upper chest, neck and face as she splashed water back at her friend.</p> <p>Marey glanced at Kimberly then, seeing the flush that filled her face, the way her eyes lowered. Ella had admitted it had been damned near impossible to talk Kimberly into joining the group, because of her past exploits with Sax at the Club.</p><p>“Sax as a reformer,” Marey drawled. “Now that one is hard to imagine.”</p><p>She ducked as Ella splashed water at her, before chuckling easily. It was odd, being amongst this group, all of them together at once. She had avoided the larger gatherings over the past year, unwilling and unable to bear the frank discussions she knew arose within them.</p><p>“Of course he is, Marey,” Tally entered the joviality then. “He’s reforming you. I bet he’s already choosing prospective seconds now. Maybe that’s what all the secrecy is all about.”</p><p>Her tilted eyes sparkled with amusement and fondness as Marey shot her a dark look.</p><p>“It occurs to me, that the five of you are finding much too much amusement in this,” she announced haughtily. “Maybe I’ll reform Sax.”</p><p>Laughter erupted around her at her comment.</p><p>“Yeah, I can see that one happening,” Ella toasted her with her wineglass. “Let me know when it works, hon, and we’ll all enjoy our fun and games in your memory as we make a note to keep our men away from yours. If you reform the Trojans, we might all have to hurt you.”</p><p>Marey rolled her eyes, shaking her head at the knowledge that her friends relished the occasional threesomes their husbands provided, and the more extreme sexuality they possessed.</p><p>“I can’t see Sax reforming,” Kimberly spoke then as though forcing herself to face a problem head-on. “Any more than the others would.”</p><p>“Sax definitely does seem to enjoy the screams he inspires,” Ella chuckled. “Are you screaming yet, Marey?”</p><p>“Remind me to kill you, Ella,” Marey growled affectionately. “How do the five of you do this? Sit and discuss this? Jess had sex with Tessa, but I’ll be damned, Terrie, if it bothers you in the least. Lucian had fun and games with Terrie. The five of you should be mortal enemies.”</p><p>“Yeah, and Sax played really nice with me and Kimberly,” Ella pointed out with a smirk. “But you still love us.”</p><p>“I’m still debating your worth, Ella,” Marey gave her friend a mock snarl. “I didn’t say I wasn’t just as perverted as the rest of you, I’m just pointing out how damned odd we are.”</p><p>“No odder than the men of that Club,” Kimberly pointed out then, accepting the refill of her wineglass from Ella. “I’ve never seen so many men gather in one place, and actually get along. They don’t stress over their women fucking around, and they don’t get pissed over the games. I’ve actually heard them discussing positions and how loud it would make the women scream.” She rolled her eyes. “They’re worse than us.”</p><p>“How many are in that damned club now?” Tess opened her eyes for that one.</p><p>Kimberly, though she no longer had limited membership after her marriage, had been one of the few women allowed the freedom to come and go within the mysterious estate that housed The Club.</p><p>“The last I heard, there were more than fifty members.” Kimberly shrugged. “Though, I would say twenty regulars.”</p><p>According to Ella, they had stopped pressing the other woman for names months before.</p><p>“Yeah, Kimberly was their practice piece,” Tally laughed as the other woman flushed crimson.</p><p>“It amazes me no one has murdered you yet,” Kimberly growled, narrowing her eyes on the other woman. “That was snide, Tally.”</p><p>“Naw, that was Tally’s jealousy,” Marey assured the other woman with a slight wink. “She’s still pissed you were able to get in and she wasn’t.”</p><p>Tally sniffed arrogantly. “I would have, of course, been a perfect choice,” she declared, surveying her nails with an air of offended pride.</p><p>“Sure you would have,” Terrie drawled. “If they wanted to follow your orders and obey your unwritten, unvoiced little rules. You were supposed to submit, Tally,” she reminded her with a laugh. “Not them.”</p><p>“So Lucian and Devril keep having to remind me,” she sighed, though the wicked glint in her eyes gave lie to her put-upon tone of voice. “Maybe I can get them to remind me again tonight. I did point out that exceptionally designed paddle we found on the internet.”</p><p>Laughter filled the tub again as wineglasses were refilled and the conversation began to dissolve into hilarity.</p><p>“Hey, what happened to Sax’s car?” Tally suddenly asked, her question creating a ripple effect that had silence filling the tub.</p><p>“There’s nothing wrong with the car.” Marey frowned. “Why?”</p><p>“The sheriff’s office was towing it off as Lucian and I left the office. I was just curious... Ouch, Ella, why the hell did you pinch me?”</p><p>“Because you don’t play dumb nearly well enough,” Ella snapped, her eyes glinting in anger as she set her glass on the deck behind her. “Let’s hope we’ve all had enough to last us for a while because I bet we get cut off for a long time after this one.”</p><p>Marey’s eyes narrowed as her heart began to beat furiously in her chest. She turned to Kimberly. She was now part of Delacourte’s security team and would know more than any of the rest of the ladies.</p><p>“I like my job, Marey,” she sighed. “Don’t make me jeopardize it. But I promise you, everything is under control.”</p><p>“Vince,” she whispered. “He did something to the car.”</p><p>“I think I overheard someone mentioning a damaged brake line and possible deterioration before the car reached the cliffs.” Tally was on a roll, and her own anger showing now. “She’s not a child, she deserves the truth.”</p><p>“I bet Lucian and Devril don’t spank you for a week,” Ella muttered.</p><p>“You and James lied to me.” Marey turned on Ella, fury flaming inside her. “You were going along with it, Ella?”</p><p>Ella stared back at her unapologetically.</p><p>“For now,” she admitted defensively. “Dammit, Marey, you’re ready to run from Sax at the least excuse. I wasn’t about to see you get an excuse. I don’t want to see you dead.”</p><p>“You’d rather see Sax dead?” she yelled back, jumping to her feet as she stumbled from the hot tub, pulling the towel around her as Ella joined her. “What do you think that would do to me, Ella?”</p><p>“Well, no one is dead this way,” Ella shouted back as she knotted the towel between her breasts. “You’re so stubborn, Marey, you’d cut your own nose off to spite your face. Sax can protect you.”</p><p>“I don’t need his protection or yours,” Marey spat furiously. “Damn you, Ella, you had no right to lie to me.”</p><p>“Why not?” she snapped. “You lie to yourself all the damned time. It shouldn’t bother you so fucking bad when someone else tries to do no more than protect you from your own foolishness.”</p><p>“I’m here aren’t I?” Marey nearly screamed. “I’m sleeping in his damned bed and he’s fucking me regularly. Isn’t that what you wanted?”</p><p>“More to the point, it’s what you want and deny yourself with any and every excuse,” Ella accused her, crossing her arms over her breasts, her expression mulish, defiant. “I just wanted to make certain you didn’t come up with a new excuse.”</p><p>“It was none of your business...”</p><p>“The hell it wasn’t. Do you think we enjoyed sitting in that goddamned hospital room with you after he nearly killed you?” Ella yelled, her own voice hoarse with her anger. “Get a clue here, Marey, he wants you dead.”</p><p>“Get a clue here, Ella, you’re a nosey bitch,” Marey snarled.</p><p>“And you’re a stubborn bitch.” Ella was nearly in her face now, nose to nose, her face flushed in anger. “And if you try to walk out on Sax over this I’m going to beat you myself.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh, be careful, baby, you might make me hot,” Marey mocked her heatedly. “Wouldn’t that be a new stroke of pleasure for the bastards?”</p><p>“Ewww. They’re going to get all pissy and gross now,” Tess announced to one and all. “Someone go find Sax and James to cool them down.”</p><p>“Shut up, Tess.” They both turned on her, snarling furiously before turning back to each other.</p><p>“Well, I can see we left you ladies alone too long,” Sax spoke from the sliding doors, his voice calm, a shade mocking as Marey turned to him slowly.</p><p>His arms were crossed over his broad chest, his teeth flashing in a mocking smile as the others stood behind him, watching the scene outside with varying expressions of disapproval.</p><p>Her eyes narrowed on him before she looked to each one in turn.</p><p>“Remember me telling you that you were going to piss me off?” she asked him then, her voice sarcastically sweet.</p><p>His brows lifted slowly.</p><p>“Consider me pissed off.”</p><p>She swept into the house, shaking with rage and fear. Fear uppermost. It crawled through her system, twisting her stomach in knots that threatened to send her to the bathroom heaving.</p><p>Vince wouldn’t stop, she knew. He was proving it. And dear God, she didn’t know if she could bear losing Sax.</p><p>Chapter Ten</p><p>“This is a mistake, Marey, please don’t do this.” The driver pulled the limo into the parking lot of the hotel as Ella voiced yet another plea that she return to Sax’s.</p><p>“I have to think,” she muttered, staring out the window into the brightly lit interior of the hotel lobby.</p><p>“Vince isn’t sane...”</p><p>“I know that, Ella,” Marey sighed tiredly.</p><p>“Sax loves you, Marey...”</p><p>“Ella.” James voice was low, soothing. “Sax and Marey have to fight this out themselves.”</p><p>Marey looked over at James, the concern on his face, the worry, before she looked back to Ella.</p><p>“I love you, you old harpy,” she said softly. “And I know he cares. I just have to figure out what I’m doing here. I can’t do that with him hovering over me. I’ll be careful though, I promise.”</p><p>Ella sighed regretfully. “Fine. And I love you too. Even if your decisions do suck sometimes.”</p><p>“Most of the time,” Marey admitted with a sigh, already missing Sax, uncertain if the decision she had made in anger was one should stick to now that the rage was dimming.</p> <p>“We can take you back, Marey,” James offered, his voice gentle.</p><p>“No.” She drew in a deep breath as the driver opened the door and stood aside patiently.</p><p>She hugged Ella quickly.</p><p>“I’ll call you tomorrow.”</p><p>She jumped from the car before she could change her mind, striding purposely into the hotel, refusing to look back.</p><p>“You know, if stubborn had a name, it would be Marey.”</p><p>Marey froze in the act of securing the hotel door and turned slowly.</p><p>Sax.</p><p>Well, this explained why James had the chauffer drive around aimlessly while Ella argued with Marey.</p><p>“Boy, when they say Trojans stick together, they mean it,” she snorted. “How much did you have to bribe the concierge to arrange this one?”</p><p>The hotel was the best in the city, security had always been exemplary.</p><p>“Delacourte/Conover holds an account here,” he informed her, his voice cool. “The owner also happens to be a member of The Club.”</p><p>She snorted at that. She should have figured that one out on her own.</p><p>She stood silently, her hands fisting in the loose material of her dress as she stared back at him.</p><p>He stood in the center of the room, his feet braced apart, his head tilted as he watched her, his eyes dark and brooding.</p><p>“If you’re finished being pissed, we can go back to the house now,” he said patiently.</p><p>Her teeth snapped together angrily.</p><p>“Can you get any more arrogant?” she snapped. “Maybe I don’t want to go back.”</p><p>“And maybe you like to lie to both of us too damned much,” he suggested silkily, moving to her, slow, relaxed, his steps stalking.</p><p>She wasn’t going to run from him, she promised herself. She wouldn’t give him the satisfaction. Or was that, deny herself the satisfaction? She was as sick as Ella and the others.</p><p>“You know, Marey,” he whispered, his voice soft, dangerous. “It occurs to me that somewhere, somehow, you’re going to have to trust someone. Trust starts here and now. Bend over on the bed.”</p><p>She gaped back at him.</p><p>“Excuse me?”</p><p>He shook his head slowly. “Excuses are over. Bend over, baby. Now...”</p><p>Running from him wasn’t going to work. She had admitted that while she was arguing with Ella. It was useless. He was her weakness, the one she feared most, and was most helpless against. She moved slowly to the bed, licking her lips nervously at the determined, dominant glint in his eyes. Her pussy was heating, dampening, her breasts swelling in anticipation. Perv, she accused herself. But she moved to the bed, gave him one last nervous glance then bent over slowly.</p><p>“There’s a good girl.” Marey knelt on the bed, her rear in the air as Sax slid the last inches of a butt plug slowly into her ass nearly half an hour later.</p><p>She was stretched, burning. Her hands were clenched in the comforter as she fought to breathe through the sensations, to think past the dazed sexuality that filled her.</p><p>“You’re going to wear that until we get home,” he whispered as his hand smoothed along the curves of her butt. “Then I’m going to fuck you. While your ass is filled with that plug, and you’ll be ready for me, Marey. So wet and so ready that when I slide inside your tight cunt you won’t be able to stop screaming.”</p><p>She believed it. She was going to scream now.</p><p>“Come on, stand up for me.”</p><p>He helped her from the bed, drawing her up until she faced him, swaying, the muscles of her ass clenching around the fiery width of the dildo penetrating her.</p><p>She stared up at him, trembling, increasingly aware of the stuffed depths of her rear, and the aching emptiness of her pussy.</p><p>“Ready?” He held out his hand for her, a small smile quirking his lips.</p><p>“I don’t know if I can walk.” She swallowed tightly, attempting to still the tremors racking her body.</p><p>“Yeah, you can.” His hand smoothed over her rear. “Slow and easy. And let it feel good.”</p><p>She snorted sarcastically. “I’m going to get off just walking, Sax. This is cruel and unusual treatment.”</p><p>“No, you won’t. You’ll just wish you could.” He chuckled as he drew her to the door. “And just think how good it’s going to feel when we get home.”</p><p>“Have you ever been raped, Sax?” she asked conversationally then, almost missing the surprise that crossed his face as she picked up her purse and headed for the door, a hard breath exhaling from her chest as pleasure tore through her.</p><p>“No,” he chuckled. “I can’t say as I have.”</p><p>“Expect it,” she warned him with a snap as he opened the door for her and she swept from the room. “Soon.”</p><p>Raping Sax was going to be delayed.</p><p>“What the hell is he doing here?” Marey snapped out with a groan as they pulled into the tree-shaded driveway of Sax’s home late that evening beside a black Mercedes and the brooding, dark-haired man standing beside it.</p><p>He straightened as Sax stopped the rental car, his arms unfolding from across his chest as he shoved them in his pants pockets instead. Daniel Conover was as well known to Marey as Tally’s lovers, Lucian and Devril. He was a top-notch private investigator, and a pricey one as well. He was also part of the exclusive little club Sax belonged to if the woman was to be believed. And Marey knew her well enough to know she wouldn’t lie about it.</p><p>And he wasn’t too hard on the eyes. Thick black hair, intense gray eyes and a brooding expression that made more than one woman sigh in longing. He was a bad boy, wild and dangerous, and you could see it in his face.</p><p>Her pussy was blazing, her ass was on fire and every nerve and cell in her body was screaming out for release. She didn’t want to wait. She wanted Sax in the house, naked and fucking her. She didn’t want to socialize. No matter how easy the company was to look at.</p><p>“I’ve hired him to find your ex-husband.”</p><p>Marey gnashed her teeth. “We’ll argue over that one later. Get rid of him, Sax. I’m dying here.”</p><p>“As soon as possible,” he promised, opening his door and moving around the front of the car to open her door.</p><p>He helped her out of the car as a sharp, indrawn breath hissed between her teeth. She clenched the muscles of her anus, feeling her juices leak from her pussy, burning her clit and sending ripples of incredible hunger convulsing through her vagina.</p><p>“Hurry.” She felt like snarling. She wasn’t in the mood to be polite. To anyone.</p><p>His hand cupped her hip as he closed the door and led her to the house.</p><p>“Come on in, Daniel,” he invited, causing Marey to elbow him in his tight abdomen.</p><p>She wanted to be fucked. She didn’t want company.</p><p>Sax punched the security code quickly on the control panel, which automatically unlocked the door for him to swing it open. Lights flipped on inside the house, casting a gentle, soft glow through the large living room.</p><p>“Daniel, you know Marey Dumont.” Sax introduced them as he headed for the bar at the side of the room. “Would you like a drink, Daniel?”</p><p>A drink? He was staying long enough for a drink?</p><p>Marey cast the other man a glare from beneath her lowered lashes. In return, she got a slow, wicked smile and she was going to ignore what that did to her overly aroused body, she assured herself.</p><p>“Hello, Ms. Dumont.” He nodded, his deep voice a rumbling in his chest as he watched her closely. “You’re looking lovely as ever.”</p><p>“Good to see you, Daniel.” She nodded briefly before turning to Sax. “I’ll wait on you upstairs...”</p><p>She turned to leave the room. If she didn’t get the hell away from him, she was not going to control herself.</p><p>“Marey.” His voice stopped her as she turned from him. Turning back slowly, she watched him with narrow-eyed warning. “Daniel might need to ask you some questions. You should stay.” His voice hardened.</p><p>Okay, she hated bossy men, but the sound of his voice, the warning implicit in it, had her pussy clenching spasmodically.</p><p>She licked her lips quickly, fighting to control her breathing as she faced him, aware of Daniel watching the scene. She bared her teeth at him, ignoring the flare of amusement in his eyes as she did so.</p><p>Daniel was a Trojan. For a moment, her knees weakened at the suspicion and the arousal that overwhelmed her at the thought. Sax was moving faster than she had anticipated if he had planned this.</p><p>She breathed in deeply. She had waited years for this. She had known the day she pulled into the parking lot of that damned motel what would happen if she ever went to Sax’s bed. This would be part of it, she had known. The sharing. And she wanted it.</p><p>For a moment, she wondered if she should have felt shame. It wasn’t every relationship that began with the understanding that there would often be more to the sexual depth than was considered decent. If so, then she guessed she was shameless. She had known for years that Sax was more sexual, more dominant than other men. She had gone to that motel knowing, knowing it would never end with one night, knowing that eventually, she’d be part of the lifestyle she knew he led, if she managed to hold onto him long enough to experience it.</p><p>She ignored the little voice in the back of her head that warned her this was more than sex. The part of her heart that weakened, softened, and laughed gently at her refusal to look beyond the sexual, or to delve deeper into the fact that it was a lifestyle she would have never embraced with another man. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She would eventually walk away. Most likely sooner than later, simply because she knew she couldn’t bear the fear, day in and day out, that he would leave her. That the day would come that he would wake up, bored by her, having realized it was only the sex holding them together rather than any emotion on his part. Though she had to admit, he played the loving suitor quite well.</p><p>“In that case, I’ll have a glass of wine if you don’t mind.” She tried to relax, to still the trembling in her hands, in her body as she met his gaze.</p><p>A slow smile shaped his full lips as he nodded slowly.</p><p>Walking slowly, swallowing tightly, she moved to the couch and sat down. Sweet mercy. Her muscles clenched, convulsed around the thick plug as she moved. She wasn’t going to survive this.</p><p>She watched as Sax handed Daniel his whisky on ice then moved to her with the wine he had poured. She needed something to still the nerves rising inside her, and the depraved images running through her mind.</p><p>“Does your ex-husband have any computer skills, Ms. Dumont?” Daniel sat in the chair across from her, his gray eyes watching her curiously, knowingly.</p><p>“Not that I’m aware of.” She accepted the wine from Sax, forcing her attention on the questions as he sat beside her. Close. Reminding her of how well they seemed to fit together.</p><p>“Any friends who do?” Daniel leaned back in his chair, crossing his ankle over the opposite knee. “Your security company’s computers were hacked into night before last. We think this is how he managed to get the security codes. He didn’t break the system.”</p><p>Geez, she was supposed to think right now?</p><p>“Vince’s friends rarely called or came to the house.” She concentrated on trying to control her breathing, but it wasn’t easy when Daniel flicked a glance to her breasts. Her nipples were standing out, hard and tight and getting worse as Sax began to stroke her neck with his fingers.</p><p>“Do you remember any of his friends? Names, anything?”</p><p>She breathed in deeply. “We were barely married a year, Daniel. And I can’t remember the few people he did introduce me to.”</p><p>She could barely remember her own name right now.</p><p>Sax’s fingers drifted to her collarbone, then the upper edge of her breast.</p><p>Marey lifted the wine to her lips and took a heavy drink. Her hand was trembling and she couldn’t stop it.</p><p>“Daniel, maybe questioning Marey should be done later,” Sax said gently.</p><p>Daniel shifted in his chair, his gaze going to her breasts as Sax slid the first button of her shirt free. Her head fell back against his shoulder, weakness filling her. She was going to do it. God, she couldn’t believe she was actually living the fantasy that had filled her dreams for so long.</p><p>“Sax, if this is solo event, you better let me know now,” Daniel half groaned as Sax caressed the upper mounds of her breasts.</p><p>“Is it a solo event, Marey?” Sax whispered, taking her wineglass as his finger glanced over her nipple, causing her to jerk in reaction.</p><p>“I knew what I was getting into.” She breathed in harshly as Daniel stood to his feet, moving slowly to the couch, his eyes lowered sensually as Sax moved her until she was stretched out, her head on his opposite shoulder.</p><p>“Yes, you did know, didn’t you, baby?” he crooned. “Were you looking forward to it?”</p><p>“I was looking forward to you,” she whispered, unable to lie to herself or to him. “All of you... Oh God!”</p> <p>Her entire body convulsed from no more than Daniel loosening the belt of her slacks and sliding the button that held it together free.</p><p>“You’re beautiful aroused,” Sax whispered as his fingers flicked the buttons of her blouse open. “But I want to see you insane with it. There’s a pleasure that women find, only when taken like this, Marey. A pleasure we only find in seeing you experience it. One that makes us as high as it does you.”</p><p>“High?” she gasped as Daniel lifted her, sliding her pants over her hips as he removed them, sending her senses reeling, her nerve endings flaming in response. “Sax, this is passing ‘high’.”</p><p>Her blouse fell away from her breasts as her pants slid from her body. The plug in her ass felt like an erotic wedge, burning her with the knowledge of what was to come as her panties slid as easily from her body as her pants had.</p><p>Minutes later, she was naked, staring up at the two men who had quickly disrobed, their fingers wrapped around their straining cocks, two sets of hungry eyes—one gray, one chocolate brown—watching her intently. She wasn’t willing to lie there and wait. Rising, she turned on the couch, her hand reaching out for the bronzed length of Sax’s cock, her mouth opening as he pressed the wide head to her lips.</p><p>She sucked him in hungrily, tasting male heat and desire as Daniel moved to her side.</p><p>“Easy, baby.” Sax pulled back from her, ignoring her protesting cry as his cock slipped from her mouth.</p><p>She wasn’t going to protest too hard though. Instantly, Daniel’s lips covered the straining peak of one breast as Sax knelt at the arm of the couch and similarly captured the other.</p><p>Oh God. Her hands tangled in Daniel’s hair, clasped Sax’s smooth head.</p><p>This was paradise. Their lips tugging on her breasts, sucking her deep, tongues flaying her nipples as their hands roved over her body. She was being consumed, devoured. She shuddered in their grip, her head falling back as she whimpered with the storm rising within her.</p><p>“Sax...” His name escaped her lips, though she was certain she couldn’t breathe, let alone form words. “Sax...”</p><p>She wanted to say so much, and yet the words wouldn’t come. Wanted to whisper whatever that emotion was burning in her soul, yet she couldn’t make sense of it.</p><p>“So sweet.” His lips trailed from her nipple, down her torso as he lifted her, propping one knee on the cushion to allow his tongue freedom to dance over her swollen, saturated pussy.</p><p>He circled her clit, licked at it, breathed over it, until she was straining against him, begging for more. Heated, calloused fingertips trailed up her thigh until they were parting the trembling folds, one finger working its way inside her burning vagina.</p><p>She pushed against it, moaning, begging for more as Sax covered her clit with his lips and sucked it into the fiery heat of his mouth.</p><p>“Sax, damn you,” she cried out, twisting, thrashing in their grip as lips, tongues and fingers drove her on a spiraling ride she wasn’t certain she could survive.</p><p>The lash of his tongue on her clit had her straining, begging for her orgasm. The firm, suckling pressure at her nipple sent arcs of near violent sensation shooting to her womb as the finger filling her pussy worked in and out, stroking her ever closer to what she knew would be a destructive climax.</p><p>Then just as quickly, both were gone.</p><p>She screeched hoarsely, reaching for them, only to have Sax return her to her previous position as he once again filled her mouth with his cock.</p><p>Daniel knelt behind her, his lips smoothing over the curves of her ass as his fingers moved to the cleft, gripping the base of the plug and turning it slowly.</p><p>She cried out around the erection filling her mouth, sucking it firmly, her tongue lashing at it as Daniel began to torment the filled tunnel of her ass. She ached. She whimpered with the pain, her hips moving, backing against him as he drew the flared end back then impaled her slowly with it again.</p><p>Sax moved until he stood at the arm of the couch, forcing her to brace her upper body over the thick cushion to maintain the deep penetration of her mouth. His cock stretched her lips, his hands burrowed in her hair, holding her still as he thrust in and out easily.</p><p>Behind her, Daniel slowly removed the plug as Marey screamed at the sensations the action invoked. She was going to come. Oh God, she was going to come from no more than the erotic pain of the thick bulb blistering the small ring of muscles it passed. Almost, she was almost there.</p><p>Her nails bit into the cushion of the couch as the impending release slowly drifted away, leaving her to growl furiously. She needed that release, desperately.</p><p>“Damn, Sax, she’s wet.” His fingers slid through the drenched folds of her pussy.</p><p>“Wet and wild,” Sax whispered, staring down at her as she raised her eyes to his, her mouth filled with his cock as she moaned in excitement.</p><p>She worked her mouth on him as much as the hands in her hair allowed, but as she felt the cooling sensation of lubrication gel being applied to the stretched entrance to her ass, she stilled.</p><p>She watched Sax, seeing his expression tighten as he watched Daniel slowly stretch and lubricate her ass. His face was twisted with arousal, but something more. Something undefined as Daniel moved and the head of his cock nudged against her.</p><p>His eyes came to hers again, the dark color flaring with emotion, pleasure. Pride. Then she couldn’t see, couldn’t hear anything but her own strangled screams as she felt the thick cock easing inside her.</p><p>Sax eased back, pulling his cock from her mouth, though he continued to hold her head up, to watch her as Daniel slowly worked his cock up her ass.</p><p>“Sax. Sax...Oh God...it burns...” Hard hands held her hips as she bucked against the penetration, desperate to force more of the hard flesh inside her. “Make it stop...”</p><p>She was screaming, arching, her pussy so hot, so wet now she could feel the excess dampening her thighs.</p><p>“So pretty.” His thumbs smoothed over her cheeks as she stared up at him imploring, feeling every bulging inch of Daniel’s cock as it slowly filled her. “Let it go, Marey,” he whispered. “Just let the pleasure control. Not you.”</p><p>She tried to shake her head. She couldn’t allow that. If she did, she might not survive never having it again.</p><p>“You will,” he crooned, glancing past her as Daniel groaned roughly. “You’re tight, Marey, he’s having to work his dick inside you. Do you know how good that feels, having to move so slow and easy? Can you feel it, Marey? The edge between pleasure and pain. It’s the same for Daniel, working his cock up your ass as you tighten on him, wondering which sensation is stronger and dying for more.”</p><p>She tried to shake her head. She needed him to just shut the hell up. She couldn’t fight him and these sensations.</p><p>“Look at me, Marey.” His voice hardened as her eyes closed. They opened again slowly. “Look at me. He’s almost filling you, just a few more inches, baby. He’s going to work that tight ass open then fuck you slow and easy. And I’m going to watch your face, sweetheart. Watch you fly over the edge while you scream.”</p><p>Scream? She couldn’t breathe, how was she supposed to scream?</p><p>All she could do was concentrate on the rising tension in her body, feeling Daniel slide in those inches until he was seated inside her to the hilt, filling her with every inch of cock.</p><p>And it wasn’t enough. She whimpered, shaking, staring up at him, terrified to ask for what she needed. If she did, how would she maintain her distance from him?</p><p>Behind her, she felt Daniel’s hands grip the curve of her buttocks, pulling them further apart as she watched Sax glance behind her. Daniel pulled back then, causing her to clench her teeth tight, to hold back a scream as he began to work his cock in and out. Long slow, deep thrusts and retreats, shafting her rear with measured thrusts as she felt the pleasure building inside her. Pleasure, pain, fire and ice. The alternating sensations shuddered along her nerve endings as each stroke of Daniel’s erection inside her pushed her past the point of control.</p><p>She needed more.</p><p>She strained against Sax’s hold on her face, needing to bury her face in the pillowed armrest, to chant her needs in silence so he couldn’t hear.</p><p>He smiled down at her tightly, his lips pulling back from his teeth, his teak dark face twisted in pleasure as he watched her, his gaze going from her face to the point where Daniel was fucking her ass with diabolically slow strokes.</p><p>“Sax...” she whimpered his name, unable to hold back the unspoken plea raging through her body. “Please...” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Please what, baby?” His hands held her face steady. “Tell me what you want, Marey. All you have to do is ask me for it. That’s all. Anything you want. It’s yours.”</p><p>She wasn’t going to make it. She moaned at the knowledge that he had known her better than she knew herself. She couldn’t deny it, the pleasure, the edge of pain, or her need for him.</p><p>“More...” she mouthed silently.</p> <p>His thumb smoothed over her lips.</p><p>“I have to hear you, baby,” he groaned, compassion and more reflecting in his gaze.</p><p>She didn’t want to see that more.That emotion she couldn’t admit to, even to herself.</p><p>Behind her, Daniel continued to move, each stroke breaking her control further. She was full, yet she was empty. She needed more, needed that something that would push her over the edge and send her screaming into climax.</p><p>“Fuck me,” she demanded roughly, driving back on Daniel’s cock as his hold slackened.</p> <p>Instantly, a light, reproving smack was delivered to the curve of her buttock.</p><p>Sax chuckled as she jerked, snarled and drove back again. Another smack sounded on the opposite cheek. It was making her crazy. How the hell was she supposed to survive this, to hold on to any part of her heart if he kept forcing her to relinquish so much to him?</p><p>“Sax, fuck me.” She tossed her head, jerking from his hold, tossing her head in demand. “Damn you, fuck me now.”</p><p>Chapter Eleven</p><p>“Easy, sweetheart. We’re going to do this slow and easy...”</p><p>Together, Daniel and Sax had eased her up, keeping her impaled on the cock penetrating her ass as Sax stretched out on the couch beneath them. Her legs spread, knees bent as together they began to lower her.</p> <p>How they kept her suspended in such a way, she didn’t know and she didn’t care. All she knew was finally, finally, Sax’s cock was tucking against the folds of her pussy, pressing against the weeping entrance as she was lowered by slow degrees.</p><p>Daniel’s erection throbbed in her ass, filling her so full that she feared Sax would never be able to work his inside her convulsing pussy. But slowly, by smooth, thick degrees, he began to fill her, working in and out as Daniel had done, forcing her muscles to stretch, her cream to flow faster and slicken his way until he slid into the very depths of her.</p><p>Her head lay against his chest, her arms around his neck, and she swore she wasn’t crying as she listened to his crooning words.</p><p>“So good, baby...hot and sweet...so fucking tight... That’s it, love, take all of me now. All of me, Marey...”</p><p>He had all of her.</p><p>“Sax.” She was dazed, weak, despite the fires erupting from nerve ending to nerve ending and the pleasure-pain consuming her.</p><p>“That’s okay, love,” he whispered. “Just lay there. We’ll do the rest.”</p><p>They began moving then. Perfect, practiced moves that drove Sax’s cock deep in her pussy as Daniel retreated from her rear, only to then have Sax retreat as Daniel pumped inside her ass. At first, their movements were slow and easy, allowing her to accustom herself to the fullness, the hunger. Allowing the inferno building from the dual penetration to destroy her mind.</p> <p>She couldn’t just lay against him, she fought the arms that held her close, her hips writhing, struggling to increase the strength of the thrusts as the sensations began to grow, to build, to tear through her body until every inch of her flesh was sensitized, pulsing, waiting...</p><p>When it came, she screamed. The words that escaped didn’t matter, the tears ran down her cheeks unheeded, all that mattered was the release exploding through her, deep, brutal detonations that convulsed her quaking pussy and sent her cream spilling past the cock shuttling hard and deep inside her. She was consumed by it, destroyed by it, barely able to understand that the men filling her were finding their own release as well, pumping her body full of hot semen, sending another series of contractions ripping through her.</p><p>Finally, she collapsed wearily on Sax’s chest, her body still shuddering almost violently as she felt Daniel ease slowly from her rear, his hand sliding over the curves gently as Sax whispered soothing nonsense at her ear.</p><p>“I’m going to shower, buddy,” she heard Daniel breathe out roughly. “Should I stay or go after I’m done?”</p><p>“Hang around,” Sax grunted. “We need to talk.”</p><p>The words drifted around her as she lay against Sax, feeling him ease from her, holding her close as he lifted himself from the couch then swung her in his arms.</p><p>She was only distantly aware of the trip upstairs, or of how he washed her tenderly before tucking her into his bed. She curled beneath the blankets, into his pillow and let sleep overtake her.</p><p>“Did that a little fast didn’t you, Sax?” Daniel walked into the kitchen later, dressed, toweling his hair dry as he watched Sax quietly.</p><p>Sax glanced up from the sandwiches he was making, grimacing at his friend’s comment.</p><p>“I have to keep her off balance,” he admitted with a sigh. “She runs scared as hell when she has time to consider things. Until Vince is in custody, I’m walking a fine line.”</p><p>Daniel snorted. “She’s crazy about you. We’ve known it for years. She runs if she just thinks you’ll be in the vicinity. Her face flushes if your name is mentioned, and according to Tally, toys can be a girl’s best friend and all hers are named Sax.”</p><p>Sax grunted rudely. “So I was told.”</p><p>Ella had been a font of information lately where Marey was concerned. That bit of information he could have done without though.</p><p>“Vince has disappeared, Sax,” Daniel said wearily as he took his seat at the small breakfast table, accepting the saucer that held his sandwich and the bottle of beer Sax handed him. “I have several men on his trail, but nothing has come up yet. The sheriff is scratching his head too. We’re tracking whoever hacked the security company’s computers. It was a good job, but they messed at a pivotal point. Sheriff found Vince’s prints all over your car though. He definitely did the tampering on the brakes. We’ll find him, but I don’t know how soon.”</p><p>Sax breathed out roughly. “She’s scared of him,” he growled. “Marey’s not scared of much. She has a backbone of steel, but Vince scares her.”</p><p>Daniel shifted uncomfortably. “You read the report you hired me to put together three years ago, man. He’s not sane. He played a good game to get her. A lonely rich woman. She spent her life taking care of her ill parents, putting her own on hold. They die, she’s ripe for the picking. Vince picked. You’re lucky she was smart enough to get rid of him before he killed her.”</p><p>“I want him found.” Sax took his seat, keeping his voice calm despite the fury rising inside him. “He damned near killed her at that motel and the next time, she might not be so lucky. Find him, Daniel, I don’t care how many men it takes or how much it costs. I want him gone.”</p><p>Daniel stared back at him broodingly.</p><p>“Gone how?” he asked carefully.</p><p>Sax lifted his gaze, staring back at his friend coldly.</p><p>“However it takes.”</p><p>Chapter Twelve</p><p>Marey awoke slowly the next morning, her eyes fluttering open, the dark beams of Sax’s ceiling the first thing she saw. Sax slept deeply beside her, his arm lying over her hips, his head lying next to hers as he kept her tucked close to his body.</p><p>He had awakened her in the early morning hours for a hot shower, washing her carefully, gently, before drying her and tucking her back into bed before crawling in beside her.</p><p>He had taken care of her.</p><p>She frowned deeply up at the ceiling, wondering if there had ever been a time when anyone had taken such care of her. She couldn’t remember it if there had. Perhaps as a child her parents had, but if so, she had been so young that those memories had been lost over time.</p><p>She had cared for them since she was a teenager. First her mother, who had conceived her only child in middle-age then contracted cancer when Marey turned thirteen. She had fought it for ten years, but she had been weak. So weak that her heart had given out before the renewed cancer had taken her.</p><p>A year later, her father had a stroke that had left him bedridden.</p><p>She could have hired someone to care for him. She could have deposited him in a nice little nursing home and resumed her life. But she loved her father. With his gentle smile and soft voice and his remorse that her life had been spent caring for him and her mother rather than being the woman she should have been.</p><p>There had been no regrets. But there had been no time for relationships. She had known her father would be gone within a short time, and she hadn’t been willing to desert him, to leave him to strangers to care for him any more than she had to.</p><p>But she had found an escape. From the pain and the depression of watching her parents dying in front of her eyes, Marey had found an escape in the books she loved. First as a reader, then as an editor. She had worked the past six years as an editor for an erotic book publisher. The books were blistering, incredibly hot. And for a while they had eased the dark, sexual fantasies that haunted her. After her father’s death...</p><p>She breathed in deeply. What a fool she had been. She had married the first man to ask her no more than a few months after having met him. Within weeks the rages had started. Within six months he was hitting her. It had been a horrible blow to her confidence. Within weeks of the divorce, she had learned that Vince had no intentions of letting her go. If he even suspected she was interested in another man, accidents began to happen.</p><p>She didn’t know if she could live if something happened to Sax because of her. To this point, Vince had always struck at her, but she knew Vince had never felt truly threatened that she would find someone else to share her life, or her money with.</p><p>It was all about the money and the power he thought it would bring him.</p><p>“If you don’t stop thinking so hard, I’m going to have to fuck you again,” Sax mumbled at her ear, his deep voice rumbling in his chest with morning drowsiness.</p><p>A smile quirked her lips.</p><p>“You play dirty pool,” she told him quietly. “Sometimes I have to think, Sax. This is one of those times.”</p><p>He grunted mockingly. “I don’t like how you think sometimes, have I mentioned that?”</p><p>He pushed the sheet away from her body before his hand flattened against her belly, his lips smoothing over her shoulder. She stared down at the rich coffee tone of his skin contrasting so exotically with her pale skin.</p><p>“Now, I would have never guessed that,” she countered, allowing the amusement to weigh heavily in her voice. “You’ve surprised me, Sax.”</p><p>He chuckled, a low sexy sound that had her womb clenching in response.</p><p>“You’re a smart-ass first thing in the morning.” He stroked her stomach slowly, his fingertips lightly drawing over her flesh, sending soft, though destructive sensations washing over her nerve endings.</p><p>It wasn’t so much sexual as it was caring...loving. She tried to steer clear of that. She couldn’t let daydreams get mixed up with reality. She had made that mistake once before.</p><p>He cared. She was certain he cared for her. Sax was often a brutally honest person, he rarely pulled his punches with anyone. But for three years he had moved on the outer edges of her life, always there, always watching her. He had never, not at any time, unleashed his infamous biting sarcasm on her. He had never looked at her with the brutal icy-eyed gaze she had seen him give others. He had never done anything but treat her with the utmost consideration and heated hunger.</p><p>Yes. He cared. And perhaps he could have loved, if she was strong enough to be as brave as she had needed to be three years before.</p><p>“Yeah, Ella calls me a smart-ass often,” she finally answered, her gaze going back to the ceiling as she smiled fondly, thinking of her friend. “Actually, I think her favorite insult is bitch.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not hardly.” His fingers strummed over her hip. “Smart-ass I’ll accept though. Now what has you so solemn this morning?”</p><p>She could feel his erection against her thigh, but there seemed to be no haste in him to relieve his arousal. He touched her gently, easily. The caresses as calming as they were arousing.</p><p>“Just stuff,” she sighed. “I was shameless last night, wasn’t I?”</p><p>She heard the note of pride in her voice and almost winced.</p><p>“You were indeed shameless,” he chuckled. “And wet and wild. So fucking hot you were incredible.”</p><p>She turned back to him.</p><p>“Why do you share, Sax?” she asked him then. “You’ve said it’s for the women’s pleasure, but that doesn’t make sense.”</p><p>“Why not?” He propped his head on his hand as he levered up, watching her curiously. “Do you think I don’t find pleasure in it, Marey?”</p><p>“I wouldn’t find pleasure in seeing another woman touch you.” She frowned at that thought. She would feel murderous.</p><p>“And you won’t ever have to,” he promised. “But you can’t deny you enjoyed what happened last night with Daniel. That you haven’t thought of it, looked forward to it. I heard it in your voice, saw it in your eyes and your response. Why did you enjoy it?”</p><p>“Because I’m a pervert,” she snorted sarcastically. “Now your excuse?”</p><p>He laughed, a smile curving those sexy lips as he stared down at her reprovingly.</p><p>“Shame on you,” he growled. “You’re not a pervert. You’re a very sexy, very sexual woman. That edge of the forbidden is exciting though, isn’t it? Makes the pleasure higher, hotter. Maybe that’s why we like it. I don’t know. But it’s something I wouldn’t want to do without. Seeing you like that, embraced between myself and Daniel, your eyes dazed, your face flushed, pleasure swamping every particle of your being is addictive. It’s a high, baby, only unlike any other I’ve ever known.”</p><p>“Beats drugs, huh?” She rolled her eyes expressively.</p><p>His grin kicked in again, his chocolate brown eyes watching her closely, warmly.</p><p>She was so lost, she thought. She had lost her damned heart to this man so long ago and now she faced losing him.</p><p>“I love you, you know.” He said the words so simply, so matter-of-factly that for a moment, she was certain she hadn’t heard him correctly.</p><p>“Boy, you really like to play dirty pool,” she snapped then, anger, helplessness washing over her. “You couldn’t at least wait until this was settled? Until Vince was caught and I could make sense of any of this?”</p><p>She jumped from the bed, casting him a furious glare as she jerked the shirt she was using for a gown from the small chair beside the bed and pulled it on. He was lying back on the pillows, watching her somberly, his eyes piercing her, filling her with guilt.</p><p>“I like things clear,” he amended calmly. “Don’t play dumb, baby. You knew this was more than an affair when you went into it.”</p><p>There he was, just lying back in the bed, his erection tenting the sheet, staring back at her in that calm, solemn way of his. What the hell was she supposed to say? To do?</p><p>“I can’t even think about this.” She pushed her fingers through her hair in irritation. “I won’t think about this. Not until Vince...”</p> <p>“This excuse is getting old.” His voice never changed inflection but it still hardened, grew deeper. “It’s like you pull it around you whenever you can’t face what’s growing between us. It’s a crutch.”</p><p>“That isn’t true,” she snapped back defensively. “He’s dangerous...”</p><p>“Because you refused to stop him when his violence escalated.” She flinched at the calm accusation, staring back at him furiously.</p><p>“It doesn’t matter why it happened.” She breathed in deeply, fighting to make sense of the clash of emotions rising inside her now. “I can’t make decisions about the future now.”</p><p>“I’m not asking you to make decisions, Marey.” His smile was a wolf’s snarl, predatory, confident.</p><p>Rising from the bed, completely unashamed of his nudity and the erection jutting from between his thighs, he stalked toward her.</p><p>“It doesn’t take a decision.” Gripping the neckline of the T-shirt with both hands, he tugged forcefully, ripping it down the front as she stared back at him in shock, gasping in arousal. “It doesn’t take anything from you, baby. I’m not asking for anything. I don’t have to ask. I know what’s mine and I know how to claim it.”</p><p>He pulled her to him, a strong, forceful movement as he gripped her hips. His head lowered, his lips covering hers, possessively, dominantly.</p><p>She couldn’t hold back her moan. There was nothing like Sax’s kiss or the way he held her to him. He seemed to surround her, his heat and his strength protecting her even as his kiss ravished her senses.</p><p>She couldn’t fight him. There was no fight in her. She could only grab his shoulders, hold on tight and absorb him into the very depths of her soul. There was nothing so hot, so tempting, so completely overwhelming as Sax’s embrace.</p><p>As his lips moved on hers, gentle and sure one moment, hard and possessive the next, Marey moaned in rapturous pleasure, her hands clenching on his shoulders, rubbing her body against him, loving the way his hands stroked her back, drew the remnants of the T-shirt from her body, and sipped at her lips with hungry demand.</p><p>This was what she had run from for three years. As insane as it sounded, and inconceivable as it was, she could feel him sweeping not just through her heart, but through her soul.</p><p>“I know how to love my woman,” he whispered as his lips slid from her lips to her ear. “I know how to protect her, and I know how to hold her. And I will hold you, Marey.”</p><p>He pulled her back to the bed, lifting her against him as he lay back, staring up at her with heavy-lidded sensuality as he cupped her buttocks in his hands, moving her until she straddled his hips, lifting her until the head of his cock seared the sensitive opening of her pussy.</p><p>“Ride me,” he growled, arousal thickening his voice as his hand raised to her heaving breasts, his head lifting to allow his tongue to lick at her hard, distended nipples.</p><p>Marey whimpered at the sensuality of having the control, staring down at him, his body reclining beneath hers, his cock hot and erect, waiting to pierce the willing depths of her pussy.</p><p>She lifted up, her breath hitching as she moved against him, whimpering as his cock began to penetrate the slick, heated entrance to her hungry pussy. Her head fell back as she took him slowly, working the hard flesh inside her by increments, driving herself crazy with the incredible sensations streaking through her body. She loved it. Loved feeling his cock stretch her, burn her.</p><p>His hands were on her breasts, fingers tweaking her nipples as she rode him with long, slow strokes, fighting the need to rush, to drive herself to madness on the thick stalk of flesh filling her.</p><p>“There you go, baby,” he whispered as he tensed, obviously holding himself back as he allowed her to take her pleasure as she needed.</p><p>Her juices were flowing between them, the sounds of wet, suckling flesh echoing around her, driving her arousal higher. His hands, warm and slightly calloused, rasped her nipples as his voice crooned in that rough, deep baritone and sent her mind spiraling with her pleasure.</p><p>Her pace increased, their moans mingling as the intensity and the heat grew. She could feel her womb tightening, fingers of fire racing through her pussy. She was going to come...</p><p>“Sax. Harder. Oh God, fuck me...” She couldn’t gain the force she needed, the rhythm he used to power into her and throw her over the edge.</p><p>She shook, shuddered, fought her own weakness and pleasure in her drive for ecstasy.</p><p>His hands moved from her breasts to her hips. They held her still, his fingers clenching there as he began to move. He drove his cock inside her with enough power and force to cause her to arch in his arms, a strangled scream leaving her throat as her orgasm began to race through her body.</p><p>She convulsed above him, her thighs tightening, her hands clenching into the muscles of his chest as she felt herself come apart around him. His strangled groan met her scream as he drove in one last time, tensed further and then found his own release. Hard, rapid jets of semen burning her, the feel of the silky fluid flooding her, throwing her higher.</p><p>The aftershocks seemed to last forever. She shuddered through them as he drew her to his heaving chest, his lips pressing to her forehead, his hands stroking over her back. Soothing her. Easing her down from the almost painful heights of pleasure.</p><p>“Can you walk away, Marey?” he asked her then, his voice gentle, understanding. “No matter the risks, can you really walk away?”</p><p>Chapter Thirteen</p><p>Could she walk away?</p><p>Later that evening, Marey stepped onto the back deck of Sax’s home and eased into the hot tub bubbling merrily in the corner.</p><p>The hot water wrapped around her, the massaging pulse of the jets beating against her weary muscles. Sax was insatiable. She ached in places she had no idea she could ache. But for the first time in years, her body was relaxed, even if her mind wasn’t.</p><p>He was right, she couldn’t walk away. He terrified her. Loving him terrified her. And not because of what she was scared Vince would do, though that was a worrisome aspect. No, he terrified her because she knew she had already given him so much of herself. If she stayed, if she accepted this relationship for what it was, then he would own her soul.</p><p>She had been alone for most of her life, even before her parents’ deaths. Sharing it with someone determined to take such an active role wasn’t easy to accept. Sax wouldn’t go his way as she went hers. He was a possessive man, not controlling, but possessive all the same.</p><p>He would expect to share her life, not just exist within it.</p><p>She leaned her head wearily against the rim of the tub and breathed out roughly.</p><p>She loved him. She had always known she loved him, but she hadn’t known how much until he began to fill her life.</p><p>“I’m going upstairs to finish up a few reports.” Sax stood at the glass sliding door, chest bare, his teeth gleaming in his dark face as he watched her with a wicked glint in his eye. “Need anything before I go up?”</p><p>Marey chuckled at his suggestive tone. “I think you’ve more than taken care of anything I could have needed,” she assured him. “I’m just going to lay here and relax for a while. You go work.”</p><p>He moved to the deck, kneeling behind her and pressing a kiss to the top of her head.</p><p>“Just yell if you need me,” he whispered warmly. “I’ll leave the bedroom window open just in case.”</p><p>“Mmm.” She closed her eyes as his kiss moved to the shell of her ear, his tongue lapping at it heatedly. “Get out of here. You’re insatiable.”</p><p>He laughed at that, a male sound of pleasure and pride as he rose to his feet and walked back to the door.</p><p>“I’ll be back down in about an hour,” he promised. “Don’t overheat.”</p><p>“With you upstairs, there’s no danger of that,” she laughed back at him, watching as he flashed her a wicked grin and turned away.</p><p>She closed her eyes, fighting the need to call him back.</p><p>“I love you, Sax,” she whispered, knowing he was gone, unable to hold back the words any longer.</p><p>What the hell was she going to do with him? She couldn’t let him go. She couldn’t walk away. He fulfilled too many parts of her soul. He fulfilled her, period. Laughed with her, loved her, touched her with such passion and hunger that she knew she would never be the same again.</p><p>“Well, you look comfortable enough, bitch!”</p><p>No.</p><p>Her eyes flew open, fear and disbelief clamoring through her as she met Vince’s furious gaze. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You really have lost your mind,” she said, amazed at his daring. She had pretty much caught on to the fact that Vince wasn’t too bright, but this was ridiculous. “Vince, Sax will kill you if he catches you here. Don’t you realize that?”</p><p>His brown hair was still kept shaggy short, but stood on end, unkempt and dirty. His brown eyes narrowed in hatred, his fists clenched. The faded denim shirt he wore was streaked with dirt, his jeans ripped at the knees.</p><p>“The son of a bitch,” Vince snarled. “He’s too busy playing his computer geek games upstairs. And you’re not going to scream, are you, Marey?” he sneered. “Little Miss Too Much Pride. I heard you screaming for him, though, didn’t I, you little whore? Him and that bastard he put up your ass!”</p> <p>She flinched at the fury rising in his voice.</p><p>Drawing in a deep breath, she tensed. Sax would be down soon, he rarely left her long while he worked upstairs, checking on her often. Being naked and at the mercy of a man she knew wouldn’t hesitate to kill her with his bare hands was a frightening prospect.</p><p>“How did you evade the sheriff?” she asked him, hoping to buy some time, to distract him just long enough for Sax to make his way downstairs.</p><p>His thin lips twisted in disgust as a dark, brick flush rose under his skin, barely noticeable in the dim light of the deck. It wasn’t a good sign.</p><p>“I can’t believe you actually had the nerve to file charges.” The low, evil chuckle that came from his lips had her shuddering in terror. “That was very bad of you, Marey, you should have taken your punishment and kept your stupid mouth shut.”</p> <p>“You nearly killed me, Vince,” she snapped, refusing to let him see her fear. “And you tried to frame Sax for it.”</p><p>“He shouldn’t have been sniffing around you,” he snarled. “What makes him think he can take what belongs to another man? He’s a trespasser and you’re a whore, always watching him, eating him with your eyes. Did you think that just because you forced that divorce that it changed anything, Marey? The vows were until death do us part.” His lips curled in a feral sneer. “And only death will part us!”</p><p>She was rising from the hot tub, a scream on her lips as he tensed to jump for her, knowing her time had run out. As she turned, Daniel rushed from the house, his hard hands gripping her as he pushed her against the side of the house. Sax rushed past them, leapt the distance of the tub, tackling Vince as he moved to run.</p><p>Eyes wide, she watched as Daniel quickly followed. His voice rose as he informed Sax of all the legal ramifications of murder. Not that Sax seemed inclined to listen as his hands tightened around Vince’s throat, a snarl of fury twisting his lips.</p><p>It was over quickly, too quickly for her to process the fact that Vince was unconscious on the deck, and she was still standing naked in the cool fall air, staring back at Sax in amazement as he rose from the deck.</p><p>“I should paddle your ass,” he yelled, staring at her over the churning water of the tub. Furious. His eyes were blazing, anger contorting his expression as she watched him in amazement. “What in the living hell possessed you, woman, to sit and bait him like that? To just sit there, calmly talking to him in a tub of water knowing fucking good and well he was capable of drowning you?”</p> <p>Screaming. He was screaming at her, his body so tense, so tight, she wondered if something would break.</p><p>“I knew you would save me,” she whispered, blinking back at him in surprise. “I knew you wouldn’t let him hurt me.”</p><p>Shock filled his face then. “I wasn’t here!” He wiped his hands furiously over his slick head as he yelled again. “How the hell was I supposed to save you?”</p><p>“But you did, Sax,” she pointed out. “I knew you would be here. I knew you would be...”</p><p>Tears filled her eyes as she stared back at him.</p><p>“You don’t leave me alone, Sax,” she said softly. “You’re always close, touching me, embracing me, needing me. How can anyone have a chance to hurt me when you love me so well?”</p><p>A heavy frown darkened his brow. “That is not getting you out of trouble,” he assured her through gritted teeth as he stomped around the hot tub, jerking her in his arms and holding her rapidly chilling body close to his warmth. “But God help me, Marey, the next time you do anything so stupid, I’m going to paddle your ass.”</p><p>A tearful smile crossed her lips as she tilted her head, her hand reaching up to touch the dark features of his face, the sensual curve of his lip.</p> <p>“I love you, Sax,” she whispered. “I was going to tell you that tonight, while you held me, while you loved me. I’ve always loved you.”</p><p>A hard breath shuddered through his chest as he buried his head in her hair, his arms tightening around her.</p><p>“I’m definitely spanking you,” he groaned. “God baby, I love you. So much you terrified the hell out of me sitting there talking to that bastard so calmly, knowing how easily he could hurt you.”</p><p>“Knowing you would be there,” she said against his chest as he lifted her into his arms while Daniel called the sheriff.</p><p>“You’re cold,” he growled. “You didn’t even bring a robe out.”</p><p>“So warm me.” She burrowed against his chest, her arms wrapping around his neck, her head resting naturally on his shoulder. “Warm me, Sax...”</p><p>Chapter Fourteen</p><p>“Somehow, Vince managed to hire an ex-employee of the security firm to hack into their computers for the code to Marey’s house,” Daniel reported the next morning after the sheriff and his deputies had arrested Vince, taken their statements and then left them in peace.</p><p>Marey was sitting tiredly on the couch, bleary-eyed, certain she had never been so exhausted in her life as she listened to what Daniel had come to the house the night before to tell them.</p><p>Neither she nor Vince had heard the car pull up at the front of the house, but Sax had. Just as he had heard Vince through the opened bedroom window seconds before. Moving carefully, he had let Daniel in, then together they had contained Vince. A few broken bones were the least of her ex-husband’s problems now.</p><p>“What will they do with the hacker?” Marey asked, fearing the moment when Daniel would leave and she would have to face Sax alone. She was suddenly terrified. Not of him, but of herself.</p><p>When he had jumped across the hot tub, the rage that had filled him had been palpable. He would have killed Vince if Daniel hadn’t stopped him.</p><p>Son of a bitch, I’ll fucking kill you for touching her. Vince’s eyes had been bugging from his head, his face turning purple. Do you understand me? My fucking woman, you low-life motherfucker!</p><p>His woman. Conviction, determination, commitment had filled every hoarse word, every finger that tightened on Vince’s throat before Daniel managed to pull him away.</p><p>“They’ll arrest him.” Daniel watched her closely, but not near as close as Sax was watching her.</p><p>She nodded, lowering her head again as she stared at the floor, her arms wrapped around her chest.</p><p>“I’m going to head out of here, Sax,” Daniel announced then. “I still have to stop at the sheriff’s office and take care of some more paperwork. I’ll call you later.”</p><p>“Thanks again, Daniel.” Sax moved across her line of vision, his powerful legs moving slowly across the floor.</p><p>“I can see myself out,” Daniel said. “Take care of your woman. The night has been hard on her.”</p><p>Marey shuddered.</p><p>Seconds later, the front door closed, leaving her alone with Sax.</p><p>Silence filled the house.</p><p>Emotions rose within her with a force that had her shaking in their grip.</p><p>“Marey.” Sax knelt before her, his broad hand lifting her chin as he stared back at her somberly.</p><p>Oh God. He shouldn’t look at her like that, she thought. His expression so tender, loving. She had fought so hard not to believe in happily-every-afters, in warmth and love. How was she supposed to protect her heart?</p><p>But she knew, had known for days that such protection was a long time past.</p><p>She felt a tear slip down her cheek.</p><p>“Everyone I really love leaves me,” she said. “I didn’t love Vince, and I knew it. I barely cared, but I was so damned tired of being alone.” Her breath hitched in her throat as he continued to watch her, his dark face intent, his expression filled with love. “When I met you,” she continued. “I couldn’t believe. If I believed, I would have had to face how I’ve hidden for so long. The coward I’ve been.” She pulled away from him as a sob shook her.</p><p>“Marey, don’t do this to yourself,” he whispered. “We can talk about this later. After you’ve rested.”</p><p>“I won’t have the courage then,” she cried painfully, moving away from him as she rose to her feet, tightening her arms around her chest as she turned her back on him. “You don’t understand. You were right. All along. Vince was a crutch. An excuse to keep you away.” She turned back to him, staring back at him, refusing to hide any longer. “I had to keep you away, Sax.”</p><p>“Why?” He pushed his hands into the pockets of his slacks as he stared back at her, his brown eyes wary.</p><p>“Because you could hurt me,” she whispered. “And I knew it. You could rip the heart from my chest, and you terrified me because of it. Because Sax, in a matter of months, as you tried to make me laugh, to talk me into your bed and your life, I fell in love with you. And I didn’t know what to do with that love. Or how to handle it if you ever walked away from me... Or if you were taken from me...”</p><p>She thought of her father, his patient resolve, his gentleness and the hole his and her mother’s deaths left in her life. She had spent her own life caring for them, putting it on hold, forgetting her dreams, her needs in the face of theirs.</p><p>“I can’t promise I won’t die, Marey,” he whispered, and in the rough tone, what she heard, she heard with her heart, not her ears. Hopes, dreams... “All I can promise you is that while I live, as long as I draw breath, I’ll love you. And I’ll pleasure you with everything I have.”</p><p>His arms wrapped around her then, his hands smoothing up her back as she clutched at him, tears flowing freely from her eyes, sobs tearing at her chest.</p><p>“I love you,” she cried out, her hands clutching at his shoulders as he lifted her, moving until he was sprawled into the chair Daniel had vacated, drawing her over him, her thighs clasping his while his hands tore at her robe.</p><p>“Feel me, Marey,” he groaned, throwing the robe to the floor before he shifted, his hands tearing at his pants as hers ripped at the buttons that held his shirt together.</p><p>Naked. She needed him as naked as she was, bodies, hearts and souls bare to one another. Embracing each other.</p><p>When he surged into her, her head fell to his shoulder, her arms wrapping around his neck as his circled her back. He moved into her powerfully, thrusting hard and deep as she undulated against him, driving him deeper, gasping, crying out as he whispered his love, his lips moving over her shoulder, her neck, his tongue stroking trails of moist flames as his arms tightened around her, holding her still as he began to drive inside her harder.</p><p>Waves of pleasure suffused her, overtook her. Perspiration built along her body as she fought to breathe, to reach the peak of rapture that she knew she could find only in Sax’s arms.</p><p>The closer she came, the more she could feel opening inside her soul. She cried into his shoulder, gasping her love, her need, her regret that she had waited so long to accept what she had known was in his heart.</p><p>“Hold me, Marey,” he growled at her ear. “Just hold me, baby.”</p><p>He was moving stronger now, his cock pushing to the very depths of her, burying to the hilt over and over again, impaling sensitive nerve-ridden tissue as his love had impaled her soul. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>She was held, just as she held. Her pussy clenched around his erection, tightening as the bands of pleasure began to explode. Her arms held him to her, his held her as well.</p><p>Her strangled cries echoed around them as her orgasm finally erupted. Unlike any other, it swept her reality, sizzled through her body, and left her shuddering in his arms as his hoarse shout filled her ears and she felt his release explode inside her.</p><p>Embracing. Embraced. And for the first time in her life, free.</p>   </body></html>"]