["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>While standing in her office, preparing to leave for the night, a vision came to Elise Jordan, a sequence of events that threatened the life of someone she knew. She tried to shut the images down, to stop the flow, something she could normally do. But this vision would not be denied. She saw it through to the end, which was not an end at all, just that point at which the woman, if left on her own, would surely die.</p><p>Now she had a decision to make and a vampire to contact, something she had promised herself she would never do.</p><p>Elise thrived on order and routine. She enjoyed having a firm schedule. She was the only person she knew who had a genial relationship with her alarm clock.</p> <p>Everything about this vision, however, invited chaos, the very thing she strove to avoid every day of her existence.</p><p>She sighed. She didn’t really have a choice, not if she was to live with her conscience. Funny how her conscience, and not desire or drive or hope or even fear, would dictate her future. Just guilt. Good old-fashioned guilt.</p><p>She finished up in her office, going through her ritual: wiping down the counters, checking the optical refractor, frowning because she needed to buy a new one, bringing forward the small trash can beneath her desk to make sure the building maintenance people found it and emptied it. She stared at the trash can. Would she even be here after the weekend?</p><p>On Friday night, a single woman should be going out, maybe with girlfriends, maybe to a regular bar, meeting men, meetingnormalmen, not tracking down former vampire warrior boyfriends from other dimensions. Two or three expletives, a habit learned from said boyfriend, flowed through her mouth and hit the air.</p><p>She took off her professional white coat, folded it up, and put it in her tote. She had a stock of coats so that she could rotate them through the cleaners. She never wore the same coat twice in a row. She liked everything fresh, clean, in its place, which meant that what she was about to do went against the grain.</p> <p>She never went against the grain. Except for Gideon. Gideon in all respects, in every sense, had been totally and irrefutably against the grain.</p><p>The last one to leave, she set the alarm, then locked the door to the building. She had a thriving practice that she shared with several other optometrists. Imagine, a clairvoyant setting up shop as an optometrist. Talk about overkill.</p><p>She headed to her car, her very sensible Audi, white, of course, against the endless months of strong Phoenix sunshine.</p><p>Once inside, she buckled up. In April, the temp hovered in the mid-eighties during the day, so she needed a couple minutes of air conditioning to take the day’s heat off the vehicle. She started the engine and powered up the A/C.</p><p>She sat for a minute staring through the windshield at nothing in particular. She leaned her forehead against the steering wheel. She took deep breaths. The hum of the motor and rush of air eased her nerves. Sort of.</p><p>Oh, God. Was she really going to do this, open the lid to Pandora’s box, let out all that chaos?</p> <p>Courage, Elise.</p><p>Whatever.</p><p>She didn’t have a choice. She really didn’t. Someone’s life hung in the balance. If she felt the routine of her life slipping away, too bad.</p><p>She sat back in the seat and withdrew her iPhone from her simple gray leather purse. She touched the screen and brought up Gideon’s number. She touched the screen again. The ringtone chimed along, not caring that she resented the hell out of this conundrum.</p><p>“Elise, what’s wrong?”</p><p>Oh, God his voice. So deep. Her body knew that voice, every varied resonant timbre. She rocked her hips forward, trying to get more comfortable, trying not to feel so damn much, trying to push all that sudden familiar desire away.</p><p>“Elise?”</p><p>“Sorry.” Her voice sounded hoarse. “I never meant to use this number.”</p> <p>“I know. But that’s why I gave it to you. Just tell me what’s wrong.”</p><p>“I had a vision.”</p><p>“What? Wait a minute. You ... had a vision?”</p><p>“Yes. Long story, that.” She wanted him, just this once, to go with the flow. Fat chance. Neither of them really understood the concept offlow.</p><p>“What do you mean you had a fuckingvision? As in, you saw the future?” Yep, no flow.</p><p>She rolled her tongue around her mouth. More guilt. “In all our time together, I might have forgotten to mention that I’m clairvoyant. I get visions. I see the future.”</p><p>She heard him breathe for the space of eight long seconds. “You’re fucking clairvoyant and you’re just telling me now?”</p><p>She had to pull the phone away from her ear. All those familiar expletives rattled through the airwaves and burned up the inside of her car. She sighed again. A cursed tear slid from her right eye. Another from the left made the same unhappy journey.</p><p>“Can you be mad later?” she asked. “I don’t like this any more than you do. But I have something critical I need to tell you.”</p><p>Another eight seconds passed, filled with his muttering this time, deep and low. “Fine.” Crisp, brittle, mad as hell. “Give.”</p><p>The issue rose up, a solid wall in her chest. She had nothing to give, except guilt. “I had a vision about your sister. About Rachel.”</p><p>“Fuck.”</p><p>She cut through another string of expletives. “Some really bad guys will be after her tomorrow at dusk; you know, longish dark hair, pale-bluish skin. You call them pretty-boys.”</p><p>“Elise, you’re killing me here. Are you saying what you’re saying? Are you telling me that you know about death vampires?”</p><p>Dread worked claw-like fingers into her chest and grabbed hold. She really didn’t want to do this, to reveal the truth. “Yes, Gideon, I retained all the memories you believe you wiped. Death vampires, otherwise called pretty-boys because of their overall beauty, alignment of features, extraordinary power, long dark hair, and glossy black wings, evidence that these monsters drink people to death in order to get at the highly addictive dying blood. And they’re known as ‘boys’ because most death vamps are male, though women cross the line, too, just not as often.”</p><p>No seconds this time. “Shit.” He repeated this word a few more times and again she pulled the phone away from her ear. She let him mull all these truths around, unspoken from the beginning of their relationship, that she knew all about the multi-dimensional world of ascension, that she had a boatload of preternatural power, and that she had never truly been honest with him.</p><p>The long silence that followed brought a couple more tears.</p><p>“Okay,” he said. “What exactly happens in this vision of yours?”</p><p>“Three death vampires fly over a ridge of tall trees, pines maybe, or redwoods. I don’t recognize the place, but there’s a clearing, a small river, bigger than a stream, lots of rocks on the banks, hills, more trees, a real forest. And there are two bridges, small bridges.”</p><p>“You said this takes place tomorrow? How do you know?”</p><p>“I just know. Late afternoon, almost at dusk.”</p><p>Long, long pause, “Meet me at the Blood and Bite. Tell me when you can get there.” He didn’t ask. He commanded. But what else was new?</p><p>“An hour and a half. I have to go home and change.”</p><p>“Fine. And Elise?”</p><p>“Yes.”</p><p>“We’re going to talk.”</p><p>More commands, but then Gideon wasn’t just your average Militia Warrior serving Second Earth. He was high in the ranks, answering only to Colonel Seriffe, who headed the Militia Warriors in Metro Phoenix Two, and when the occasion demanded, the militia worldwide.</p><p>This time, she paused. After a couple more deep breaths, she said, “I don’t want to, but I will.”</p><p>The time had come.</p><p>Gideon hung up. He stared at his phone. Jesus, his hand shook.</p><p>He stood in the stone foyer of his home in north Scottsdale Two, Second Earth, like a suit of armor, unmoving and rigid. He couldn’t even blink. He didn’t know which thought to have first, that Elise possessed previously unacknowledged preternatural power or that his sister faced certain danger.</p><p>When some life started flowing back into his limbs, he touched the screen of his Droid a couple of times. He waited. His sister’s voice came on the line.</p><p>“Hey, Gid.” Okay, she sounded upbeat but he knew Rachel. She could front with the best of them, a family trait. She hid her unhappiness about living on Second Earth really well.</p><p>He worked his jaw, then finally said, “You’re not thinking of doing anything foolish, are you?”</p><p>When silence returned, he pressed the phone against his thigh, closed his eyes and shouted one long “fuck” at the ceiling. He drew his phone back up to his ear. “Please don’t, Rachel, I’m begging you. Don’t do it. How can I keep you safe if you do this?”</p><p>“First, it’s not your job to keep me safe. I’m a big girl. Second, I don’t know what you’re talking about.” The slight tinny quality to her voice failed to escape his ear.</p><p>“Liar.”</p><p>“I’m late for my yoga class.”</p><p>“On Friday night?”</p><p>“Why not?”</p><p>He debated his next course of action for about three seconds. “You might be in trouble, as in big trouble.”</p><p>She laughed. “As in you’re giving me a Seer warning.”</p><p>“Maybe.”</p><p>“What?” She said it in that tone of hers, with the pitch angling up at the end. “Why would I show up in the future streams?”</p><p>“More like a clairvoyant vision and no, I don’t really know the difference, but my source called it a vision. Beyond that, you know why. You have more power than you’ve ever admitted.”</p><p>“More Second Earth bullshit, brother.”</p><p>“I know you’re not happy here.” Rachel believed that no human should even possess, not to mention make use of, any form of preternatural power, and she thought Second Earth, as anascended world at war, was one huge-ass piece of hypocrisy. She was intopeace andlove and vegan food. And she really hated that her own brother served as a Militia Warrior. So, yes, she was unhappy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Understatement,” she said.</p><p>“Okay. Fine. But could you stay put for a day or two until I figure out a couple of things?”</p><p>The night was full of dead air spaces. He heard her take a deep breath through her nose. “I’ve heard of a rogue colony in northern California, and that’s all I’m going to say.”</p> <p>“Rachel, no.”</p><p>“Well, gotta go. Love you, Gid, so much, but my instructor scowls if I cross the threshold past seven.”</p><p>“Whatever,” he responded, but only because he was talking to the screen of his phone. Rachel had already hung up.</p><p>Sweet Jesus. Every word out of his sister’s mouth just confirmed at least part of Elise’s prophecy. He didn’t doubt for a second that his sister was going rogue.</p><p>Thousands of vampires left Second Earth to live in exile on Mortal Earth. He just never thought his sister would join those ranks.</p> <p>And how the hell was he to protect her if she went rogue? She could say whatever she wanted to say, but death vampires hunted vulnerable women who tracked life alone, like culling the weak from the herd.</p><p>He also knew that powerful ascenders like Rachel had light signatures that could show up on HQ’s electronic surveillance grid. He could contact Bev, who worked the grid all night, and have her start checking for power signatures over northern California.</p><p>He withdrew the thin, credit card–sized warrior phone from the pocket of his jeans. He swiped the front and a moment later Bev came on the phone.</p><p>“What’s doin’, Gideon?” He smiled. Bev’s voice soothed him, but then the women chosen to work HQ’s command center had that special calming quality, a necessary skill when dealing with disaster and horror on every other call.</p><p>“Hey, Bev. I have a situation.”</p><p>“How can I help?” There it was, the words he needed to hear.</p> <p>“I’ve just been tipped off about a rogue colony in northern California.”</p><p>“Is it possible this is a lair?”</p><p>“My source indicated there were no death vampires present. Definitely a colony. And ... this is critical.”</p><p>“I’ll set up the grid right now. May take a few hours to identify significant power signatures.”</p><p>“Give me a shout when you find something.”</p><p>“Will do.”</p><p>He hung up and sucked in another deep breath.</p><p>Now for the other side of the equation.</p> <p>An hour later, Gideon leaned against the tall side of the nearest red velvet booth at the Blood and Bite. His skin twitched.</p><p>Fighting and making war shaped his days and nights. As a Militia Warrior, he battled death vampires six nights out of seven every fucking week of his life, serving and protecting. He could handle wielding a sword, but waiting for his ex gave him the scratch.</p><p>Beyond that, could he believe a woman so made up of lies?</p><p>This last thought went straight to his hands. He watched them ball up into fists. He closed his eyes, took a deep breath, then shook out his hands. He needed to calm the hell down.</p><p>He hadn’t seen Elise for a month. Talk about hell. He had no special attachment to her, but he couldn’t exactly sleep at night and his thoughts ran to her more often than not.</p><p>Fuck. Breakups were hard. That’s all.</p><p>He opened his eyes and once more scrutinized the entrance to the club in case Elise had arrived.</p><p>Unattached Militia Warriors milled around waiting for the next female to arrive. Mortal women came in droves to the Blood and Bite. Once they left, they might have foggy memories of exactly what happened on the club’s premises, enthrallment being a beautiful thing to a vampire, but rarely did a woman leave without a smile on her face. That fulfillment brought them back every time.</p><p>For the most part, the warriors held to the rigid club rules: no deep enthrallment, consensual sex only, mind-altering mist over the openings to each booth to sustain privacy, no voyeurism except in the case of a superior officer checking out rumors of misconduct.</p><p>As a section leader for the Phoenix Two Militia Warriors, he had to investigate even the whiff of an infraction. Every once in a while, he prosecuted warriors who crossed the line.</p><p>He glanced to his right in the direction of the dance floor. The DJ kicked up the Black Eyed Peas and the strobes made those couples dancing look like zombies on crack.</p><p>He caught a scent and stiffened from head to toe.</p><p>He knew Elise had arrived because the air in the hot, sweaty club suddenly smelled of strawberries, ripe, lush, sweet, juicy strawberries. She had a scent meant just for him, an anomaly in their relationship, since specific mutual scents didn’t occur in the usual course of ascended vampire life. In fact, the only known case of the phenomenon had occurred recently when a myth, which proved to be not a myth, afflicted one of the elite Warriors of the Blood.</p><p>That Gideon could scent Elise had always troubled him. What did it mean that she gave off a scent he could detect? Was this a case of the infamousbreh-hedden? Impossible, on so many levels. For one thing, thebreh-hedden was supposed to be a myth. And for another, only Warriors of the Blood were known through all those ancient myths and legends to have experienced the ritual.</p><p>What-the-fuck-ever.</p><p>Even thinking about the WOTBs, otherwise known as WhatBees among his ranks, also gave him the scratch. Those assholes just couldn’t stay out of Militia Warrior business. The next time he found one of them discipliningone of his men, he’d not hold back, not even a little. Sure, the WhatBees had a place, but not on his turf. They served Madame Endelle directly, answered only to her as the ruler of Second Earth.</p><p>Right now, they were lined up at the bar, pretty as you please. Assholes.</p><p>Okay, so he was a little on edge and he should think nicer thoughts, because they did lay it on the line every night. That they had advanced powers was just the luck of the fucking draw. But courage for courage, give him a Militia Warrior every damn time.</p><p>When Elise’s strawberry scent once more rolled in his direction, his body reacted, as it always did, as though her scent punched into all his pheromone receptors at exactly the same moment. Punched, then punched again.</p><p>Thank God for the strobes. He didn’t have to worry about any of the other Militia Warriors thinking he was interested.</p><p>He pushed away from the bank of tall-backed red velvet booths and headed toward the entrance. When he reached her, two Militia Warriors hovered over her, attempting a thrall. He might have laughed, because no way could either of these bozos bust past her shields.</p><p>But amusement didn’t exactly sum up his feelings right now. Instead, the sight of two men hitting on a woman he would always think of ashis womanbrought his head down and his fists up.</p><p>“Move it or lose it,” he said. “This woman’s taken.”</p><p>The first warrior jerked back in his direction ready to do battle, then looked up. “Shit, Gideon. Sorry.” He turned and headed toward the dance floor.</p><p>The other one backed away almost as fast.</p><p>Smart vampires.</p><p>He looked at the woman whose body he knew every which way from Sunday, and all those familiar sensations rushed back at him, her under him, her on top of him, her lips around him, taking him deep. God, he missed her. Even standing in front of her, yeah, he missed her. And he blamed her for his goddamn celibacy as well. For the last month, since their breakup, he’d been off blood and sex, which might just account for his current temper.</p><p>“Gideon,” she said, in that controlled way of hers. Her voice, low and melodic, did him in every damn time.</p><p>The music had just cranked up again. More Black Eyed Peas. He leaned close and spoke against her ear. “I’ve got a booth.”</p><p>She drew back and nodded. She looked tight around her eyes, even angry. What the hell did she have to be angry about? He was the wounded party here.</p><p>She moved to the right, in the direction of the booths. He crowded her, his hip up against her hip, his hand at her back, then around her shoulder, pulling her close to keep her from touching other men. Shit, he couldn’t control his instincts around her. But how was that anything new?</p><p>He was so screwed.</p><p>When he drew her up next to the booth, she looked up at him and frowned. “You actually reservedthis booth?”</p><p>He nodded. “Why, not? I figured you owed me one helluva an explanation, so why not here? After all, this is where you spoke and acted out all those fucking lies.”</p><p>Elise stretched her preternatural vision just a little so that the strobes didn’t impact her view of him. She saw him as though bathed in a warm light. But this was a mistake, because she could see him, really see him, and what she saw struck her down as it had from the beginning, as though she was looking at the only man on two earths that could ever do it for her.</p><p>His sheer physical presence never failed to surprise her. He was warrior tall at six-five, lean and heavily muscled. He wore a snug T-shirt and jeans, a look she loved on him. He had broad shoulders and thick pecs made for biting and sucking. She knew his biceps well; they were fit for holding on to when he drove into her.</p><p>She loved his dark blond hair, which flowed away from his face, neither long like the Warriors of the Blood, nor short like most Militia Warriors’, but somewhere in between as though Gideon was in between.</p><p>But of all his many physical attributes, she loved his eyes the best. They were dark blue and stormy like waters in some northern sea. He had only to look at her, hold her gaze, and he could command her—not because he enthralled her, but because looking into his eyes was like looking into his soul and that was the real problem. She liked what she saw.</p><p>Gideon was like no man she knew. He was a warrior, a Militia Warrior, who were also called Thunder God Warriors after an Apache expression. He served the ruler of Second Earth as a frontline soldier in the war against death vampires. He had the commitment and dedication of the disciplined military mind.</p><p>She turned, ready to slide into the booth, but there, waiting for them both, was the usual: her reddish Cosmo and his Glenlivet neat.</p><p>Memories rushed back to her and she weaved on her feet so that he caught her elbow. “Hey,” he whispered. “You okay?”</p><p>Damn and damn. Why did he have to prove his worth by having their drinks ready and waiting and why did she have to remember all the ways he’d made love to her as though time was just one big well-oiled, revolving door? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A shiver traveled straight through her and a wave of his scent, his gorgeous, sexy, toffee scent, flowed over her shoulder. A few of her learned expletives once more sped through her mind.</p><p>She swallowed hard, pulled her elbow out of his grasp and half scooted, half fell into the booth. She caught herself with hands on the strong red leather of the seat. She turned her near-topple into a quick glide and move to sit at the back of booth. Hopefully, he would keep his distance and sit adjacent to her. The last thing she wanted was his body next to hers.</p><p>She slid her Cosmo toward her, then took a drink. She should have sipped, but right now she could use a little added courage.</p> <p>She took a deep breath.</p><p>Now to explain all the lies.</p><p>Chapter Two</p><p>For a moment, while holding Elise’s arm and keeping her steady, Gideon almost lost the real reason for the meeting. For at least five painful seconds, his left hand started drifting toward her waist and lower. He wanted his arms around her. He wanted to pull her up hard against him, he wanted her to feel the stiffness and length of his arousal, and he wanted his fangs in her neck. By the strawberry wave that hit him, damn, it wouldn’t take much to get her where he wanted her to be.</p><p>As he slid into the booth to sit at a right angle to her, his nostrils flared at how thick her scent was, how utterly seductive.</p> <p>He picked up his tumbler, took a hefty swallow, and let the scotch pound some sense into him.</p><p>His shoulders hurt from restraining all his overpowering very male, very vampire instincts. He put the tumbler on the table and stared at it. He breathed. The night promised to give one long lesson in breathing.</p><p>“So what do you want to know, Gideon? We might as well have this out.”</p><p>He pressed into the back of the booth and closed his eyes. If he could calm down enough, yeah, he might be able to breathe and think, and then maybe he could answer her question.</p><p>Finally he said, “So exactly how much do you know about ascension, about ascending dimensions, about all of it? If I recall, you asked a lot of questions over the last two years, but you were clever. Not once did I suspect that at the end of each night Ididn’terase your memories.”</p><p>“I worked hard at it.”</p> <p>“But why? Why not be up front with me?”</p><p>She stared at him, her dark brown eyes wide. Even though he hated all this deception, there was so much about her he liked. She took her work seriously and she lived a well-ordered life. Because of his military training, he was the same. But she had a wild side, too, that he appreciated, something he hadn’t expected, a real surprise. She wore her straight black hair parted in the middle, straight to her shoulders with a small upward curve at the ends. She had a kind spirit and treated all the Militia Warriors with great respect. He’d been proud to call herhis woman all the time they’d dated.</p><p>She wore a white button-down shirt, open at the throat, jeans, a black belt, and black shoes. She was damn beautiful, with full lips, a straight nose, and prominent cheeks. She wore only a touch of mascara, maybe lipgloss. He wanted to kiss her, but what else was new?</p><p>She looked wound up tight, probably because of the lies.</p><p>He created mist to cover the front of the booth, which dampened the sound of the music and kept the strobes from flashing into the space.</p><p>“All right, Elise, let’s have it. How much do you know? I want to hear as many details as come to mind.”</p><p>“All right.” She spoke of the world of ascension, about dimensional planets, same geography, different earths, that to reach the next world you had to demonstrate power at a Borderland, which in turn would initiate the rite of ascension that each human of Mortal Earth had to go through in order to reach the next dimension. After three days had passed, the mortal would take part in a brief ceremony, be given the gift of immortality as well as the gift of fangs for taking blood. In cruder terms, ascension was about becoming a vampire. In more exalted terms, it was about being born into a new world and a new life that involved a whole host of preternatural powers. She knew of the five major Borderlands in this part of the world: downtown Phoenix, New River, the north end of the White Tanks, the Superstitions, and Awatukee.</p><p>The Militia Warriors, known among the ranks as Thunder God Warriors, had their HQ in Apache Junction Two, near the Superstition Mountain range. The Apaches used to call the range Thunder God Mountain.</p> <p>She talked for at least twenty minutes. He listened, huffed a sigh, listened some more, scowled. He couldn’t believe how much she knew about Second Earth. Great. Just great.</p><p>Finally, she said, “I know a lot more, but I think you get the gist.”</p><p>All he could think to say was, “Shit.” Then after a good long moment, “Oh, God.” He took another swig of scotch. “Why bother now? You didn’t even tell me when I broke up with you.”</p><p>She shook her head but she met his gaze straight on. “I’ll tell you flat out I was grateful when you called it quits. I confess you had me done up and done down. I couldn’t leave but I needed to, and not because you’re from another dimension. I ... I’ve never seen myself in a long-term relationship with anyone. I’m not good at it. I prefer my solitary life, in part, I suppose because that’s what I’m used to.”</p><p>He remembered now. She’d talked about her life once, about the early death of her father and that the stress on her mother of trying to raise Elise alone just hadn’t added up to a lot of stability or a sense of being loved. Add to that the need Elise had to hide her powers, and yeah, she would have gone it alone.</p><p>She continued, “I hated that I showed up here every week, had sex with a vampire, gave my blood, but never had the smallest intention of really being with you long term. I felt like such a coward and a user. For that, I’m sorry. I had nothing to give and I still don’t. You need to know that up front, before everything else unfolds.”</p><p>Everything else? How much more could there be?</p><p>She stroked the stem of her martini glass. The movement distracted him. He nodded a couple of times then shifted his gaze back to her. “I’m no different. I thought I was using you as well.”</p><p>“I know.”</p><p>“Shit.” He liked her more for being this honest with him. “Okay. So, tell me about the vision and about your power. Tell me all of it.”</p><p>“I’d rather show you the vision,” she said, her tone so low that he tilted his head.</p><p>“Show me?”</p><p>She nodded in quick jerks. He felt her fear like a stab against his mind. “I get it. You want to put the vision in my head.”</p><p>She nodded again, but this time slowly.</p><p>“How do you even know you can do that?”</p><p>“I just do. Will you allow me to put my hands on your face?”</p><p>“Yes.”</p><p>She slid to the end of her seat, then shifted to join him on his side, sitting beside him.</p><p>He frowned. He didn’t like the proximity at all. Too dangerous.</p><p>Beyond that, he wasn’t sure she really had the power to share the vision, but he would soon find out. However, the moment she put her hands on either side of his face and closed her eyes, he realized that having visions probably just scratched the surface of her power.</p><p>Telling vibrations passed from her skin to his, strong ripples of sensation. He was nearly overwhelmed with her presence right against his mind. His chest tightened. If she had this much power, then the enemy would want her, or want her dead. So, shit.</p><p>How much worse could this moment get?</p><p>He closed his eyes and felt her press against his mind. He knew enough about mind-engagement to get really relaxed and to let his shields fall, otherwise he would feel nothing but great shards of pain, knives spinning in his head.</p><p>As she streamed the vision, he saw it all in a quick flow, like a movie, the images clear and precise.</p><p>His sister, Rachel, came into view. She smiled like she was happy, a rarity for her. She sat with several others, all in folding chairs or lounges, clustered around a campfire, at dusk. He felt what Elise felt, that the timing of the vision encompassed the next day, but where was this place? Because of his earlier conversation with Rachel, he could only suppose he was looking at a location in northern California. He hoped to hell Bev would have some luck with the grid search.</p><p>The vision shifted to the sky overhead. Three death vamps appeared, flying over a line of trees, then gliding in the direction of the river and the campsite.</p><p>When the vision ended, and Elise’s hands fell away, he slid his phone out of the pocket of his jeans and tapped the surface of the screen.</p><p>He closed his eyes, hoping like hell that his sister would pick up. At the very least, he needed a mind-link with her for the next twenty-four hours.</p><p>After leaving Gideon’s mind, Elise couldn’t believe how she felt. Dizziness swirled through her brain, the aftereffects of having been inside his head. Her body vibrated with power, and something else, something that made her turn to look at Gideon, made herwant him.</p><p>He had his elbow on the table, his hand shading his brow. He spoke with his sister, his voice rising and falling. He even shouted, then calmed, then shouted again. He said something about wanting a mind-link with her.</p><p>Her gaze became fixed to his lips. She watched them move. She knew his lips so well, how they felt on her lips, on her skin, against her breasts, and lower. How he would pull at her flesh with his lips, tugging, so sensual, determined, until he brought her to screaming.</p><p>She tried to direct her thoughts into other channels, but they proved intractable as her gaze slid down his neck and she watched the vein in his throat beating hard. She wanted what he had to give her. She wanted it gliding down her throat, feeding her, strengthening her.</p><p>She slid closer so that her leg touched his leg. She settled her hand on his bicep, one of her favorite places. He glanced at her, but the argument he carried on distracted him.</p><p>Some kind of madness had her in a tight grip. Being inside his mind had left her so very hungry ...for him.</p><p>She became a woman with a new mission that had nothing to do with visions and lies.</p><p>She rose to her feet, took their drinks, and settled them on a tall ledge on the opposite side of the booth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Familiar with how the table worked, she gave Gideon a nudge so that he would sit back in his seat. Because he was still arguing with Rachel, he obliged her.</p><p>She flipped the tabletop up, locked it in place, then pushed the whole thing away from Gideon. That gave her plenty of room.</p><p>She moved to stand in front of him, dropping to her knees. She wiggled between his legs. How nice, he spread his legs a little farther to accommodate her. She lowered her face to his groin.</p> <p>“We’re all set, Rachel. Thank you for letting me do this. I won’t contact you unless things turn critical.” A pause. “Love you, too.”</p><p>She felt him shift and her head bobbed as he put his phone back into the pocket of his jeans. They both wore jeans. She smiled as she rubbed her head back and forth, not too hard, but enough to feel that his body liked what she was doing.</p><p>“Elise? What the hell are you doing?”</p><p>She looked up at him, her lips parted. Her breaths came in little pants. “I liked being in your head ...a lot.”</p><p>“I can see that. Oh, God. You’re close, aren’t you?”</p> <p>She nodded. “Gideon, I didn’t exactly mean for this to happen, but you’ve got to help me out here.” She ran her hands up and down the tops of his thighs. She brushed her face once more over what was now so very hard. She wanted him in her mouth.</p><p>He sat very still. He didn’t speak.</p><p>Tacit permission.</p><p>She rose up just a little and with her hands still on his jeans, she thought the thought and used some of the power she’d been concealing from him.Voilà. Jeans and T-shirt gone. She’d sent them to her home in Surprise.</p><p>“Commando,” she whispered.</p><p>“Shit, you can fold. Elise. You’ve got to stop ... I mean ...” She wrapped her hand around him. A groan followed.</p> <p>She took him in her mouth, the beautiful crown. How well she knew his body. She swirled her tongue over and over, dipping into the small crevice, licking then settling in to suck him, savoring, her body arching, her hips flexing, needing more, so much more.</p><p>She felt his hand on the back of her neck. He rocked into her and she sucked, drew back, sucked, drew back until he was pumping into her mouth. She let him, each thrust more beautiful than the last.</p><p>Her mind still flowed so strangely back and forth.</p><p>“Oh, God,” he murmured. “Elise, you have to stop.”</p><p>No, she didn’t.</p><p>She thought another beautiful thought, left the hard length of him, then rose up naked in front of him.</p><p>His gaze fell to her breasts. His eyes flared and he sucked in a whole lot of air. Another groan returned. Because he was sitting, he threw his right arm around her waist and caught her left breast with his left hand as he drew her close. He dipped low and before she could beg him to do it, his mouth closed around her nipple and he returned the suckling favor.</p><p>She cried out. Relief was in sight.</p> <p>His right hand drifted low, to cup her buttocks. His hands were big so that he covered both cheeks at once and pressed her toward him.</p><p>“Heaven,” she whispered. “Just heaven.”</p><p>Gideon didn’t know whether he was totally pissed off or totally aroused. Okay, his cock knew. He stood upright and ready.</p><p>He hadn’t expected this, but he understood. She’d pierced his mind, and like so many other experiences on Second Earth, the use of different preternatural powers often doubled the intensity of sexual response. Mind-diving during sex could be a major turn-on. Having his wing-locks stimulated during a climax was like taking a rocket ride into outer space.</p><p>He released her breast.</p><p>Maybe he was pissed off with Elise, but he understood her conundrum, which had now become his problem. There was only one sensible way to finish this.</p><p>He released her breast and looked up at her. “Elise,” he said. “Look at me.”</p><p>She met his gaze, her eyes at half-mast, her lips swollen. She didn’t say anything.</p><p>“You want me to fuck you?”</p><p>Her back arched and she squeezed her eyes shut. She leaned into him. “Yes,” squeaked out of her throat. Her hands gripped his shoulders.</p><p>He rose up, caught her around the waist with one arm and slid his free arm across her back. He lifted her off her feet, turned, then eased her onto the leather seat of the booth. Everything about the Blood and Bite had been designed to create moments like these, including the width of the seat, made large enough for his big warrior body.</p><p>He stretched out on top of her.</p><p>She surrounded his shoulders with both arms and whimpered. She fluttered her fingers all the way down his back. He cried out. Damn, that felt good, so good. His wing-locks ran in a V formation from shoulder to waist and were very sensitive. When ready for flight, his back would thicken, the apertures of his wing-locks would weep, then the wings would rush out through the well-lubricated locks. When not ready for flight, his back had a series of faint but discernible ridges—the wing-locks. Had she noticed the ridges?</p><p>“I love your wing-locks,” she whispered, as though having read his mind. She knew his body. She remembered what he liked.</p><p>He met her gaze. “So you were never enthralled.”</p><p>She shook her head as her gaze fell to his lips. “Forgive me,” she whispered. “Please.”</p><p>Aw, hell. He nodded. “You didn’t have to come here. You didn’t have to warn me about Rachel.”</p><p>“How could I not have come? She’s the most important person in your life. I do care about you, Gideon. I do.” Tears swam in her eyes. She’d never looked more beautiful.</p><p>And there it was, the real problem, that he knew her soul, that she was kind and considerate, a decent woman.</p><p>He kissed her. He still might be a little pissed, but he was also grateful. His eyes burned as he drifted his tongue over her lips. She opened her mouth and he drove inside. Her body, caught up in all that sensation, bucked against his.</p><p>He slid his knee between her legs. And like the signal he meant it to be, she spread her legs wide for him so that he could get between. She moaned where he touched her, his hand caressing her hip then lower and lower. He looked into her eyes and rubbed the backs of his fingers over her soft black hair.</p><p>How many times had he gone down on her, easing his tongue through every tender bit of her flesh, every curve and line of her until she was panting and crying out over his back, her nails digging deep and making him hard.</p><p>“Take me now,” she whispered.</p><p>Maybe it was the fact that he knew that this time,this time, would be the last, but a sense of urgency, of time having dropped the last grain of sand into the hourglass, made him pause as he pressed himself into her opening. He lifted up on his arms so he could watch. He pushed and inch by inch began sliding into her. She was wet, so very wet. She gripped his forearms, pulling on him, urging him on.</p><p>“Elise,” he whispered. He met her gaze.</p><p>“Do it, Gideon.”</p><p>Then he plunged hard.</p><p>Elise cried out. Her mind still felt dizzy, as though she wasn’t quite recovered from being inside his mind.</p><p>He groaned as he slid back and back. He moved into her and she held him tight, pulling him inside, savoring every powerful inch of him.</p><p>His lips found hers and his hips grew urgent, plunging hard now and oh, it felt so good.</p><p>She gave herself to the feel of his body as her hands roved his shoulders. He groaned as her hands met his pecs and pinched his nipples. She rubbed over them with her palms.</p><p>His rhythm was always good. He was hard as a rock and pushed against that internal part of her that grew achy with pleasure until she was one steady whimper, little ohs that puffed from her mouth.</p><p>“Gideon.”</p><p>He slowed his movements and met her gaze. His lips were parted, swollen. His hair swayed as he thrust. “What do you need? I’ll do anything.”</p><p>Anything?</p><p>She licked her lips. Her gaze fell to his vein.</p><p>His hips jerked and he cried out. “Shit. Do you want me to take your blood?”</p><p>“Yes.” One long breathless word. “I could never ask you before now, but I wanted to. I wanted to beg you. I love it when you drink from me. I loved all the places you took blood from me.”</p><p>His body contorted and he paused over her. He closed his eyes.</p><p>She felt his cock jerk deep within. He gasped and held his breath. She didn’t move. He was on the precipice and even speaking about taking her blood had nearly brought him.</p><p>He started breathing again. He opened his eyes. “Okay. Show me what you want me to do.” His voice was deep and he smelled of toffee, lots of toffee.</p><p>She pushed the hair away from the left side of her neck. She turned her head and exposed her throat to him. His hips began to pump as he lowered his upper body to her. He overlaid her jaw with his hand and pinned her, his forearm pressed into the seat for leverage.</p><p>She cried out and clenched in anticipation. She loved that he restrained her, that he had her pinned to the booth.</p><p>He dragged the thick upper part of his fangs over her throat, then licked her neck. Shivers chased down her chest and tightened her nipples. She cried out again. She felt saliva fall on her neck. Her hips jerked into him.</p><p>He grunted and licked. She felt her vein rise to meet him, as though his vampire nature called forth what he required. He twisted his upper body and with a feral huff he struck.</p><p>As he began to take deep draws from her neck, his hips moved faster, rubbing over that achy part of her, low, so very low. Oh, God.</p><p>Though she was held fast against the seat, she could move her right hand. She slid it down his abdomen. He was ripped, this vampire warrior of hers. As he drank from her and pushed into her, she began a slow progress over muscles that flexed and released with each push of his hips. Lower and lower and she felt her soft curls and his thick oh-so-male pubic hair. She touched and savored, lower and lower until she felt his powerful stalk that plunged into her.</p><p>She raked a nail over his cock. He grunted low in his chest as he sucked down her blood.</p><p>Gideon had done this before, but never with the knowledge that she was fully aware of what was happening. His body was on fire and her blood tasted of strawberries and wine and woman. His hips pistoned. Strength flowed through him, power that came from taking her willing blood. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He released her neck and planted his hands on either side of her head. He moved into her with force so that her body slid over the leather. He looked down at her, at her head moving from side to side. Her eyes were closed, her face contorted. She panted, whimpered, and cried out.</p><p>“Look at me,” he commanded.</p><p>He eyes popped wide. She met his gaze. He held on tight. He moved over her in heavy waves, pushing her body around. She slung her legs around his hips. He felt it coming, from her, from him, that moment.</p> <p>With every push a grunt left his body. She matched the sound with a cry. Her body moved with him, then against him. The whole time he looked into her eyes.</p><p>Slowly, as though time held onto the moment and dragged it out, she lifted a hand to his face. Her eyes were wide and unblinking. She put her hand on his cheek.</p><p>He realized she wanted to be in his mind while they did this. It would take sex to a whole new level, really mind-blowing ascended sex, only possible when ascenders had enough power to be in each other’s minds.</p><p>Elise definitely had enough power and he was going to let her do it.</p><p>“Oh, God,” left his mouth, just as she pressed her mind against his. In a moment of unparalleled ecstasy, as he began to come, he let his shields fall and her sudden presence in his mind brought him and brought him and brought him, pleasure shooting from his balls, up his cock, out and into the well of her body, over and over.</p> <p>“Gideon!” she screamed. Her mind rolling through his, teasing, stroking, feeling him up.</p><p>He felt her core tugging at him.</p><p>“Gideon!” she screamed again.</p><p>His back arched as he pumped. Holy shit, he was going to come again. “More” was all that he could push past his teeth.</p><p>She slung her arms around his neck and pulled him against her so that they moved as one, in great hard waves, pleasure spiking over and over until at last he was spent.</p><p>He heard her deep gasps as she tried to catch her breath. Her body slowed down. His hips eased back.</p> <p>Oh. My. God.</p><p>She kissed his neck, small little wet punches. “Gideon,” she whispered. “Gideon. Oh, God, Gideon.” She drew in another gasping breath. “What was that?”</p><p>“Ascended sex, your mind inside mine. Damn, you’ve got power.”</p><p>He collapsed on top of her. His heart hammered away at the inside of his chest. He was covered in sweat.</p><p>She licked his neck. “You taste ... so good.” He felt her chest rise and fall as she, too, worked to breathe.</p><p>The dizziness in Elise’s head still turned the booth around and upside down. But, oh, that ride! And what had prompted her to touch his face again, to climb inside his mind once more? As soon as she had, pleasure barreled through her, rushing like a flash flood, pushing everything out of the way except him and his toffee scent, and his thrusts and his hips and the sheer animal power of his body.</p><p>The climax had flowed up her body, into her chest, through her neck until she felt it as a geyser through her mind.</p><p>He was right. It had never been like that before. But then she had never been truthful with him. If honesty resulted in this kind of orgasm, she planned on being completely straightforward with him from this second on.</p> <p>Several minutes, later, when she could breathe and when he wasn’t grunting with every other draw of air, the dizziness finally disappeared.</p><p>He eased off her and out of her. He unfolded a washcloth from somewhere and as he had always done, tucked it between her legs.</p><p>Her heart hurt looking at him, at the way his streaked, brownish-blond hair fell forward and hid part of his face. She would have thanked him for the attention but suddenly she was feeling way too much.</p><p>He didn’t meet her gaze as he dropped back on his buttocks, shifted and planted his feet on the floor. He leaned his head back against the velvet of the booth and sighed. He looked as though he had moved about a thousand miles away from her. Maybe he had.</p><p>His eyes opened and he looked up at the ceiling. “Please don’t think this changes anything.”</p><p>She put a hand to her chest and rubbed her sternum. Her heart had settled down but yes, it ached, very low as though she had rocks caught in the bottom, weighing it down.</p><p>Did she want something changed, to be different, with him? She stared up at the ceiling, at the various pipes and large ventilation tubes crossing each other.</p><p>A different kind of dizziness returned, the one that meant a vision was coming. This time she saw a beautiful woman with enormous black hair. She pulled at a long feather dangling from her right ear and read from a large book that she held in her hands.</p><p>Elise closed her eyes and shut the vision down. She’d learned the skill as a child, that she didn’t have to see every bit of the future that ran at her. But stopping the clairvoyant episode didn’t stop the sensations that now plucked at her heart</p><p>What came to her was the simple truth that despite the goods and the bads of ascension, she had opened a door to this new world the moment she sat in her Audi and called Gideon.</p><p>She belonged in this new world.</p><p>She took one backward look. With her internal eye, she saw herself locking up the optometry building, getting into her car, and calling Gideon.</p><p>Mentally, she simply slammed the door to the past shut. There was no going back. Not now, not ever.</p><p>She opened her eyes and sat up, shifting her legs over the side of the red leather seat.</p><p>Though she sat naked beside Gideon, she turned her head to look at him. He must have seen the movement because he shifted to look at her as well.</p><p>“There’s something else I need to tell you and I have a feeling you’re really not going to like it.”</p><p>He groaned, rolled his head back to thump against the velvet back of the booth, and muttered, “Well, fuck.”</p><p>Chapter Three</p><p>Elise waited until he turned to look at her once more, until he said, “Let me have it.”</p><p>So she did. “I’ve had a dozen dreams over the last month, dreams about Second Earth, of living in an ascended world, of flying over a long narrow lake, of mounting a pair of dark blue mottled wings, beautiful wings. I have been full of this aching need here—” she put a hand to her chest—“I can’t ignore it any longer and something about this, about being inside your mind, has changed me.</p><p>“Because of all that you’ve told me over the past two years, I know exactly what’s going on with all the dreams and all these painful longings.”</p><p>He shook his head. His eyes had a wild look. “Don’t do this, Elise. I’m begging you, don’t say it. Don’t fucking say it.”</p><p>She lowered her chin. “I know that this is my call to ascension.” He groaned long and loud. He put his head in his hands. She continued, “I have no doubt that I’ve been called to ascension. Yet for the past month, before I had the vision of Rachel and the death vampires who were after her, I wasn’t going to act on it. Tonight has changed everything. I know that now.</p><p>“So here it is. In about an hour and a half, however long it takes me to get back to my house, then drive over to the north end of the White Tanks, I’m going to answer my call to ascension at the White Tanks Borderland.”</p><p>“No,” he cried, almost a shout. He shook his head back and forth, back and forth. “You can’t. I won’t let you. You can’t do this. I won’t have one more person on Second that I have to look after. Rachel has been enough. I need my freedom, Elise. I need to be a warrior. I can’t do more than that, be more than that.”</p><p>“No one’s asking you, Gideon. You’re not obligated to help me or to be with me or anything. I’m doing this for me, because I have to, becauseI’ve been called and I know I belong on Second. This has nothing to do with you.”</p><p>She thought the thought, and brought both sets of clothes back. She dumped his T-shirt and jeans on his lap. Though it made her cheeks burn, she withdrew the washcloth, thought another thought and sent it to her clothes hamper. Sometimes sex was just embarrassing, but what could she do? She started getting dressed the old-fashioned way, one leg at a time.</p><p>“You’re not getting it,” he cried. “I’ve felt your power. You’re not going to have a simple ascension. Darian Greaves, who heads up the opposition, will want you dead unless you agree to align with him. You know how things are set up. He’ll have three days during your rite of ascension to find a way to destroy you with impunity. That’s the law. You’ll have to battle your way into our world. Don’t fucking do this.”</p><p>He was breathing hard at the end of this speech, but his plea changed nothing.</p><p>When she had her jeans back on and most of the buttons buttoned, she met his horror-stricken gaze. “Get over it, Gideon. Sorry if this puts a crimp in your plans, but I’m ascending. Tonight. And don’t think I’m elated. I’m not. I liked my life. Ilovedmy life, but that life is over.” She took a deep breath. “Case closed.”</p><p>He turned away from her and let one big “fuck” bounce around the booth.</p><p>“Let me understand you,” Seriffe said. He had a low, strong voice. “Your woman, Elise, is answering her call to ascension and you want to serve as her Guardian of Ascension. But you do know that’s a job relegated to the Warriors of the Blood.”</p><p>Gideon stood in front of Colonel Seriffe’s desk. The Colonel was a big man, like Gideon, a worthy warrior, and commanded the respect of his men. He remained seated.</p><p>“I’ve been gaining power lately. Last night I offed two death vampires by myself. That’s been happening a lot.”</p><p>Seriffe narrowed his eyes. “I heard it was three.”</p><p>Gideon’s jaw tightened. “Not exactly. The third was a woman. I’m not proud of it, but she came at me, sword and dagger, and there was nothing I could do.” Female death vampires were very rare but it happened. None of the Thunder God Warriors liked taking a woman’s life, even if she was powerful, dangerous, and had killed innocent mortals or ascenders to get at the addictive dying blood.</p><p>Seriffe nodded. He knew the score. “I still think you’re out of line making this request.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Shit, this wasn’t going well, but he didn’t know how else to approach what was fast becoming an unmanageable situation. He felt compelled to do all that he could to assist Elise. Whether he liked it or not, she was important to him, more than he wanted to admit.</p><p>There was only one thing to do and he laid it out. He told Seriffe about Elise’s vision of Rachel, the timing of the forthcoming event, everything. He couldn’t quite keep his hands steady as he spoke. Everything seemed to be funneling down to one major shitstorm.</p><p>“Looks like you’re fucked,” Seriffe said. He continued to stare at Gideon from beneath thick black eyebrows. Seriffe’s olive complexion and strong features placed his ancestry somewhere in the Middle East. He had a wife and three young children. He was the best of men and a hard taskmaster.</p> <p>“Colonel, I don’t know if I can explain exactly what’s happening here, but I have one desire, to make sure that Elise makes it through the next three days. If you can get me assigned as her guardian, I’ll use Militia Warrior support, lots of it, with your permission, of course.”</p><p>Seriffe remained silent, just staring, weighing, coming up with a judgment.</p><p>Gideon didn’t know what more he could say, but there was one aspect of the entire situation he felt he should relate. Shit, he so didn’t want to do this, to confess this. “There’s one more thing.” Then he spoke of the scents that he and Elise shared.</p><p>At that, Seriffe’s brows rose. “Jesus H. Christ, what are you telling me? That you’re caught in the grips of thebreh-hedden like Warrior Kerrick was a month or so ago?”</p><p>“It sounds impossible and the truth is I don’t know. But based on all those rumors about what Kerrick went through, this is fucking similar and let me tell you there is nothing pleasant about it. I ... I want to kill any man who so much as looks at Elise.”</p> <p>Seriffe, however, nodded very slowly. “We live in remarkable times, Gideon. I have felt this for months now, some strange enormous hand at work, changing our lives, our destinies.” He nodded again, faster this time. “All right. I’m going with my gut on this one. Give me five minutes. I’ll see what I can do.”</p><p>The relief Gideon felt nearly undid him. As Seriffe got on the com, he walked away from the desk to pull himself together. He felt like something lived inside him now, pulling him apart like a cyclone spinning in his chest.</p><p>He stood by the plate glass window overlooking the desert. At night, not much could be seen, just the black skyline of the Superstition monolith, the famous Thunder God Mountain, and about a million stars overhead. Sweet Jesus, one of the Warriors of the Blood would be out there battling right now. On Mortal Earth, some of his brothers-in-arms would be waiting at the various Borderlands to catch any of the death vampires who snuck through. War had kept this planet hostage for over two thousand years, since Greaves had ascended. The bastard had ambition and apparently a shitload of patience.</p><p>The trouble was, the war had ramped up. They all felt it, that Greaves was going to make his bid for the domination of two worlds, and he wouldn’t take long doing it.</p><p>A few minutes later, Seriffe called him back to his desk.</p><p>“You’ve got the assignment. And you’re not going to believe this, but Endelle approved it herself.”</p> <p>Holy shit. Endelle was the ruler of Second Earth and rarely bothered with Militia Warrior business.</p><p>“You know what this means,” Seriffe said, his lips a hard line.</p><p>Gideon nodded. Jesus, if a higher-up like Endelle was involved, that meant Elise was definitely marked by the enemy as well.</p><p>He had a whole new ballgame on his hands.</p><p>“She had one last word for you, and I quote, ‘Get your ass over to the White Tanks Borderland Two, and for fuck’s sake, take eight squads of MWs with you.’” Seriffe chuckled. “You gotta love her.” He narrowed his eyes. “Okay. Get your men assembled and as soon as ascendiate Jordan answers her call to ascension, I’ll send you into the Trough.”</p><p>At that Seriffe smiled and Gideon smiled back.</p><p>Finally, he could breathe a little easier. He had permission from Her Supremeness to take care of business. He would serve as Elise’s Guardian of Ascension. Good.</p><p>Twenty minutes later, Gideon had all thirty-two Militia Warriors, grouped in the usual squads of four, ready to descend into the Trough. Seriffe would do the honors and they’d float down between dimensions to protect Elise as soon as she demonstrated power at the Borderland.</p> <p>Shit, was this really happening?</p><p>An hour and a half later, Elise stood in the open desert, at the north end of the White Tanks Borderland. She had to demonstrate power to initiate her rite of ascension. After that, both factions of the war that encompassed Second Earth would present an alignment package, she would state her choice, and then game on. The enemy would have three days to take her out.</p><p>At this point, however, she didn’t care. She had only one goal, to get to Rachel by tomorrow night before the death vampires could harm her. She wasn’t sure what her ascension process would entail, but Rachel was important to Gideon and she really didn’t deserve to die at the hands of a monster.</p><p>She looked around and in the distance she saw a number of stone outcroppings and massive boulders. Well, why not?</p><p>She focused on a massive, car-like rock, centered herself, and as she had been doing since she was very young, pointed her right index finger and gave the boulder a track to follow.</p><p>The vibration in the air, all around her, intensified. The boulder lifted in the air and began to float along the trajectory she had indicated. Though she had left behind her perfect, orderly world, right now a sense of unexpected freedom surprised her. Her ascended life would allow her to explore her powers, not hide them. She wondered what more this world would one day offer her.</p><p>She watched the boulder land off to her left and smash a rather tall stand of cholla onto its side so that it stuck out at a weird angle.</p><p>She stared at the giant rock that was almost as tall as she was. Energy sang through her body. She shook all over but in the best possible way. She felt born anew, lifted up, and on the verge of a life never before anticipated.</p><p>She looked up into the skies. She understood the timing of everything. Representatives from both sides would arrive to present their offers, then she would choose. And if her preternatural powers were strong enough, for the next three days she would receive the protection of a Guardian of Ascension. Gideon seemed to believe she would be in for it, that her ascension wouldn’t be simple because her powers were just that strong. She simply didn’t know, but one way or the other she was certain to find out in the next few minutes.</p><p>The air suddenly grew very cold, arctic, a sure sign that someone was descending through the Trough, that nether-space between dimensions.</p><p>She glanced around, staring at every shadow. Would death vampires dare to arrive early? Or worse, what if Commander Greaves decided to pay her a visit before someone from Endelle’s faction got to her?</p><p>Anything could happen, but she knew that a breach of protocol would result in prosecution, so she relied on that alone to keep her safe for the time being. The ascended world had a governing body, similar to Mortal Earth’s United Nations, called COPASS. It oversaw the war between Endelle’s faction and Greaves’s army, imposing strict rules on both sides. The committee also established and upheld equally strict rules about the ascension process.</p><p>COPASS. She chuckled as she paced. Apparently, no one thought to check the acronym before the members chose their name: Committee to Oversee the Process of Ascension to Second Society.</p><p>The air grew colder still and she started to shiver. She backed up against the boulder and waited, her gaze fixed into the night sky.</p><p>The ascenders appeared in the distance as small indistinct objects in the sky. She extended her preternatural vision and started to count, but soon gave up. There were so many. Death vampires?</p><p>Her heart set up a furious cadence.</p><p>But a few seconds more and she recognized the warrior leading the way. Gideon.</p><p>Her mouth fell agape. She couldn’t believe it. She hadn’t expected him to be here. She had released him from all obligation.</p><p>Gideon was here with a small army of what must be his fellow Militia Warriors. He wore traditional flight gear, heavy battle sandals and black leather shin guards, a black leather kilt, a weapons harness that covered his chest and held sheaths for two daggers. As soon as he landed, he began directing his men. When he turned his back to her, she saw the tough-looking strip of leather that went straight down the spine and allowed for wing-mount. He looked ... powerful.</p><p>Tears filled her eyes and she drew a couple of deep breaths. For reasons she couldn’t explain, a sudden need to sob her heart out almost did her in.</p><p>She clenched her fists and gave herself one big shake. She was not going to fall apart now.</p><p>She knew what she was getting into. Gideon’s explanations had left her with few illusions. Second Earth was at war. Death vampires killed mortals and ascenders alike. And the moment she refused to join Commander Greaves’s faction, she would be targeted for death as well, beginning tonight.</p><p>Gideon directed his men to spread out, to form a large circle with Elise at the center, at least two dozen yards away from her, well beyond the large boulder she still leaned against.</p><p>At last satisfied with the location of each squad, he turned his attention to her. He crossed the ten or so yards to her, his preternatural vision seeing the darkness around her as though lit with a soft light. She wore a T-shirt, jeans, sensible running shoes. He approved.</p><p>When he reached her, he grabbed her arm. “You okay?”</p><p>She blinked several times. “Yes, but you’re kind of hurting me.”</p><p>“Shit. Sorry.” He released her arm. “A little wound-up.”</p><p>“I can see that. So why are you here? I mean, what are you doing here?”</p><p>Gideon couldn’t quite focus. His gaze slid past the boulder to the squad on the other side. His thoughts darted in several directions at once: who would Greaves send to present his offer, would Endelle show up, would his men do what they needed to do, would anyone die tonight? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Gideon?”</p><p>He shifted his gaze back to her. “Yes?”</p><p>“You didn’t answer my question.”</p> <p>He narrowed his eyes, tried to focus. “What was it?”</p><p>“What areyou doing here?”</p><p>“Oh. Okay.” He told her about his earlier conversation with Seriffe. “In the end, Madame Endelle agreed to allow me, or rather us, to protect you.”</p><p>She nodded. She glanced around. “You brought so many of your warriors with you.”</p><p>He tracked her gaze. “I brought the best. You’re in good hands. My section has one of the best records in dealing with death vamps.”</p> <p>“So basically, you orchestrated all of this.”</p><p>“Yes, of course.”</p><p>She shook her head, but she smiled. Her eyes looked watery. “There is noof course, Gideon. This is just amazing to me.”</p><p>He was truly confused. “Why would you say that?”</p><p>She lowered her voice. “Because you broke up with me and you yelled at me about ascending. I liberated you from any responsibility here, remember?”</p><p>He stared into her brown eyes. A slight breeze brought wisps of hair streaming over her face. He pushed them back, tucking the loose strands behind her ear. “You’re important to me, Elise. That’s the beginning and end of it. And I can’t help that I feel a sense of responsibility toward you. It’s who I am. Despite what I said earlier, you must know that I care about you. I care what happens to you. I just wish you didn’t smell like strawberries.” There. He’d summed it all up. Nice, neat, tidy, orderly.</p> <p>And suddenly, just like that, he couldn’t breathe. All he could do was stare into her eyes, take in her delicate, very womanly scent, and stare.</p><p>You’re so beautiful, he sent, forgetting for just this moment that she wasn’t telepathic.</p><p>But she smiled and as though she smoothed soft fingertips over his mind, she responded,I was into you from the moment I saw you at the Blood and Bite. I wanted you in a way I’d never wanted a man before. I had to have you and I’m so sorry that I lied to you.</p><p>“Oh, Elise,” he whispered, wrapping his arms around her.</p><p>“Did you hear my thoughts? Tell me you heard them.”</p><p>“Each one,” he whispered, aware that the audience, though dozens of yards away, was considerable. “That you wanted me.” He repeated the gist and she smiled again, leaning against him.</p><p>“You have so much power,” he whispered, drawing her against his chest. A chill went through him. Even with thirty-two Thunder God Warriors present, even with his own advanced powers, would it be enough to keep her alive?</p><p>Elise drew back slightly and stared into dark blue eyes, her special vision holding him in a glow. Her gaze traveled down to the battle gear he wore. She’d seen it in her dreams and every once in a while a warrior would show up at the Blood and Bite in what she knew to be flight gear, but this was real.</p> <p>When she saw the two dagger hilts up close, however, she put her hands on his arms. “Oh, God, this is real, isn’t it? Ascension, vampires, dimensional worlds, everything, isn’t it?”</p><p>Compassion entered his eyes. “Yeah. It’s fucking real. And you’re ascending. Damn, I can’t believe you’re ascending.”</p><p>Once more he drew her close and held her.</p><p>She wanted to ascend. This was the right decision for her. But if she ascended, if she made a new life for herself on Second Earth, how could she be near Gideon, yet never be with him again? Although in another sense that was an easy question to answer.</p><p>The death of her father had shattered their small, close-knit family of three. Afterward, her mother had usually carried two jobs just to keep the bills paid, so Elise had been on her own a lot.</p><p>The one time she’d tried to share her difficulties with her mother, that she’d had a vision about one of the neighborhood kids, her mother had blown up. She’d yelled at Elise about her selfishness and her need to control her absurd imagination. Elise had simply shut down in order to survive.</p><p>The increase of her powers over the years had shrunk her solitary existence even more. She’d had the occasional boyfriend, but nothing serious, since what guy would be able to handle a woman who could see the future?</p><p>She wasn’t complaining, not really. She’d learned to create a good life for herself and overall, she enjoyed her independence.</p><p>But here she was, locked in Gideon’s arms, an ascended vampire who could understand what she was going through, who had arrived to see her through her rite of ascension, and she felt a profound desire to be with him, maybe even in a forever kind of way. But how could she do that when for the bulk of her existence her only relationship skill was keeping as much distance as possible?Not that Gideon was asking. He seemed to be as relationship-challenged as she was.</p><p>“We’ll take this one step at a time.” Had he read her mind?</p><p>His voice was deep and resonant, calming. She could feel the beat of his heart because her cheek was pressed tight against his throat. Her neck was arched and her lips were oh-so-close to his vein. She stood five-ten to his six-five, so she had to lift up on her toes to hold her present position. Her chest drew into a knot as her nostrils flared and she breathed in the toffee-male scent of him.</p><p>Familiar longings, deep and profound, swirled through her entire chest cavity. Her surroundings disappeared. Only he existed. She ached for this man, this vampire. Shecraved him.</p><p>But something more reached her nostrils, something rich, thick and heavy, something alive and flowing, something that represented all that he was, a meal that would satisfy her cravings. Her gums tingled and at exactly the same moment, she felt a matching tingle in a V down her back, from shoulder blades to waist.</p><p>Desire streaked through her abdomen landing deep, so very deep. Her mind grew clouded, her breathing labored.</p><p>“Elise,” he murmured, the timbre of his voice now rough. His arms moved over her, a writhing motion that caused the tingles on her back to intensify.</p><p>At the same time, she shifted, arching her neck a little more as she opened her mouth wide. With her teeth, she grazed his neck and moaned. She could almost taste what he had to give her, what she needed from him.</p><p>“Shit. What are you doing?”</p><p>What was she doing? She hardly knew. She wasn’t exactly in a fully conscious state. Her tongue flicked over his neck and she felt the muscles shift and as she continued to flick, the vein rose. She latched onto the vein and suckled hard. Yes, this was what she wanted, what she needed.</p><p>Elise, you’ve gotta stop. Now. Oh, shit, I’m so close to coming. Shit. Shit. You could bring me with what you’re doing.</p><p>A low growling sound flowed through her throat while she suckled him. Her teeth pushed deeper into his skin, seeking. She felt frustrated and in need of what he could give her. Why wouldn’t he give it to her?</p><p>She slid her arm around his neck to pull him toward her, opening her mouth wider.</p><p>Elise ... you must stop. But his hands had grown wild and one of them covered her buttocks and pressed her into his groin. That he was hard for her somehow fired her need and she sucked even harder at his neck.</p><p>“Well, well, well, what do we have here? Two vampires in heat? Or would that be one vampire and one little ascendiate? Nice show, BTW. Damn, Gideon, she’s right on the verge and if I’m any judge, so the hell are you!”</p><p>Oh, God. Endelle. Ruler of Second Earth. Elise, you’ve got to stop.</p><p>Gideon’s voice rippled through her mind but the words made no sense. Besides, his vein called to her. She moaned and sucked. She was so close to tapping what she needed.</p><p>But Gideon slid a finger between her lips and broke the seal so that her mouth popped off his neck. She bobbed backward, her body on fire, her underwear way too wet, her breasts aching. Fog rolled through her mind. So many cravings and urges possessed her that she wanted to scream in frustration.</p><p>Can you pull it together, he sent.We’ve got the ruler of Second Earth here with us.</p><p>As her mind began to clear, Elise turned around and faced the woman known as Madame Endelle. She addressed Gideon. “So, how about you make the introductions,” Endelle said. “Or did that little show I happened to catch rob you of the rest of your IQ points?”</p><p>Without warning, Elise found herself shoved behind Gideon and when she tried to move, he held her back. “Ease down, Endelle. The ascendiate is having a rough night.”</p><p>“Well, those sounds she was making definitely soundedrough.” She laughed.</p><p>Elise pushed hard at Gideon’s arm so that she could maneuver enough to get a good look at the woman she’d heard so much about over the past two years. Endelle, sometimes known as She Who Would Live, ruler of Second Earth, Her Supremeness, bitch on wheels, scorpion temperament, and nine thousand years old. She was tall, taller than Gideon, probably, because she wore stilettos even in the desert. She had long black hair, ratted up to an imposing height at the crown, then falling straight to the middle of her back.</p><p>But oh my god, what was she wearing?Gideon, is that horsehide?</p><p>Our ruler is a bit fashion-challenged.</p><p>Her top had a striped beige reptilian look, sewn together in strips. Her skirt looked like spotted appaloosa and around her neck hung a very strange collection of ... rattler tails?</p><p>“Wow,” she said aloud before she could check herself.</p><p>Endelle glanced down at her chest and flicked the necklace a couple of times, which made the expected sound. “Like it?”</p><p>“It’s very ... unique.”</p><p>At that, the woman threw her head back and laughed. “Unique? Loooove it!” But her expression sobered almost as fast, crazy quick, as she approached Elise. “Well, let me have a look at you. So, you’re the one giving us a deep pain in the crotch tonight. You’re pretty enough. This Neanderthal treating you right?”</p><p>Chapter Four</p><p>Elise glanced at Gideon, whose expression had turned dark, his brow low as he stared at Endelle. He was one giant warrior caveman and still held one arm protectively in front of her as though the real danger right now was Madame Endelle herself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ease down, warrior. Jesus H. Christ. One more twist on your screw and your brain will crack in half.”</p><p>Gideon snorted.</p><p>Endelle turned and settled her gaze on Elise. “As for you, my little troublemaker, here’s the deal. We’re at war, but if you want to be on the side of right, you’ll join my forces. The pay sucks, we work fucking long hours, you’ll have to do a million things you don’t want to do, but if you’re lucky you’ll live and you might even have the pleasure of making a significant contribution to ending the war. What do you say?”</p> <p>Elise knew one thing—Her Supremeness knew shit about PR. Fortunately, she already knew from Gideon that Endelle’s side was committed to peace and life, while the enemy sought chaos and death. “I’m in.”</p><p>Endelle smiled and for just a moment, despite the ancient lined appearance in her brown eyes, she looked almost human. “Hell, you almost give me hope.”</p><p>She turned back to Gideon. “But since you’re here ... goddamn, warrior, you’re as big as Thorne, you know that?”</p><p>Elise knew that Thorne was the leader of the Warriors of the Blood and had a mind-link with the scorpion queen.</p><p>“That’s right,” Gideon said. “So the fuck what?”</p> <p>Did one speak to the ruler of the earth like that?</p><p>But Endelle only laughed. “I have only one question. Why the hell haven’t you made the jump to light-speed and joined the Warriors of the Blood? You’re close, you know. Thorne told me you offed three death vampires by yourself last night.”</p><p>“I did.”</p><p>Elise looked up at him. “You did? Gideon, that’s amazing.” Usually, it took four Militia Warriors to take down one death vampire, hence the small army that surrounded her.</p><p>Gideon growled. “Even if I developed the power to grow another pair of arms and held a sword in all four hands all at the same time, I’d never join that pansy-ass group.”</p><p>Endelle barked her laughter. “Pansy-ass? Gideon, you don’t know how much I want to hear you say that in front of Thorne, or maybe Kerrick. How about Luken? Yeah, say that in front of Luken. He’s got maybe twice your muscle mass.” She chortled again.</p> <p>But Gideon just crossed his arms over his chest. “Any day of the week, with your permission, of course.”</p><p>As Endelle rolled her eyes, then started in on him about how he needed to bring more of his powers online so he could advance to Warrior of the Blood status, and as Gideon just glared back and ground his molars in response, Elise’s oh-so-familiar dizzy sensation began at the base of her skull, in that dip between the muscles. She could feel it glide up through her brain and over the top until it reached her forehead. She rocked a little on her feet.</p><p>What a surprise to have her clairvoyance go into high gear right now, with the ruler of Second Earth in front of her. This time, she didn’t stop the vision, but let it fly the distance.</p><p>Her vision clouded. She could still see Endelle and Gideon and all the Militia Warriors, but it was as though a thin veil had fallen in front of her.</p><p>This time, the vision added something new, a sort of digital clock in her mind that started a serious and very specific countdown.</p><p>Fifty-nine, fifty-eight, fifty-seven ...</p><p>Images began to flash through her mind of Gideon right in front of her, just a few yards away, wielding his sword against, oh, God, four death vampires. She also saw his men, in that large circle, battling four-to-one against another eight death vampires. She knew what they were because she’d heard them described a dozen times: their enslaving beauty; bluish porcelain complexions; and huge, glossy, black wings.</p><p>Forty-nine, forty-eight, forty-seven ...</p> <p>She blinked. Her mind cleared. The veil disappeared but the clock continued to run. Without having to be told, she knew exactly what she had just seen and what she needed to do.</p><p>Thirty-nine, thirty-eight, thirty-seven ...</p><p>She shifted to stand beside Gideon, then grabbed both his wrist and Endelle’s, which sent strange ripples of power up both of her arms. She didn’t direct her words to them, however. Instead, she caught Gideon’s gaze and said, “We have incoming.”</p><p>He lowered his chin. He didn’t ask what she meant. He asked, “How many?”</p><p>“What’s going on, ascendiate?” Endelle narrowed her eyes at her.</p><p>“A ... a vision. Death vampires. Lots of them.</p><p>The clock blinked at her. Elise whispered the numbers, “Nineteen, eighteen, seventeen ...” The air grew cold, a sure sign that death vamps were descending through the Trough.</p><p>Endelle looked around. “Gideon, something doesn’t feel right to me. I know the ascendiate hasn’t been here but a few minutes, so tell me, who the hell showed up from Greaves’s faction to present his offer of alliance?”</p><p>Gideon shook his head. “No one’s been here and I arrived right after she answered her call.”</p><p>Endelle turned to face them both, grinning. “Well, shit, dammit-to-hell! We’ve got an illegal party coming in, which means I’m going to give COPASS a good reaming.” To Elise, she said, “Stay alive, if you can. And for fuck’s sake, if you do make it through the night,get a room.”</p><p>She lifted her arm and vanished.</p><p>Ten, nine, eight ...</p><p>How Elise might have responded was lost to the sight of at least half the Thunder God Warriors mounting their wings from bulked-up back muscles. The remaining warriors stayed on the ground. She’d seen the wings in her dreams and she knew that ascenders developed the ability to mount wings, but she had no idea the sight would bring tears to her eyes.</p><p>“All those wings are so beautiful.” They were in a variety of shades and patterns, just as her wings, from her dreams, were dark blue and mottled.</p><p>Gideon stepped a couple of yards in front of her and flashed his sword into his right hand.</p><p>Then the death vampires came.</p><p>“Make yourself small,” Gideon said. He patted the air with a flat hand.</p><p>Elise dropped to plant her ass in the dirt right up against the enormous boulder she’d moved earlier. She slid her arms around her knees and pulled in tight. She’d seen that as well, her body shaped into a ball and Gideon standing guard over her like a Roman gladiator, his sword gripped in his right hand.</p><p>Death vampires, one after the other, touched down then in the same split second mounted their glossy black wings and launched themselves skyward.</p><p>The death vampires were indistinguishable one from another, partly because it was nighttime but also because they tended to look alike: long black hair; dark eyes; undeniable beauty; and pale, pale skin, reputed to have a faint bluish tint. For incomprehensible reasons, drinking a person to death created great beauty and an equalizing of features and overall coloring. Their white faces were stark beacons in the dark sky.</p><p>As the warriors launched into the air, they kept their swords close to their kilts. Elise didn’t want to look, but she couldn’t force herself to turn away, either, sort of like passing a car accident on the freeway.</p><p>Try not to watch,Gideon sent.This will be the worst of it.</p><p>Okay.</p><p>But she couldn’t help herself. The good guys were going to war against the monsters.</p><p>As steel met steel, her gaze jumped from one warrior to the next.</p><p>Another wave of dizziness began at the base of her skull. She rose to her feet.</p><p>“Elise, you should sit down.”</p><p>“I can’t,” she responded. She knew a vision had come, but this time she had the weirdest feeling she might be needed.</p><p>Swords flew until bodies and other things started dropping from the sky and falling hard to earth. The various thumps began to hit her ears so that it wasn’t her eyes that she closed—rather, she covered her ears with her hands.</p><p>Fifty-nine, fifty-eight, fifty-seven ...</p><p>“Gideon, I’m having another vision.”</p><p>He turned toward her. “What do you see?”</p><p>Her heart lurched. “You ... battling four death vampires.”</p><p>“Tell me what to do.”</p><p>She shook her head as she watched the battle unfold within her mind. “It’s too complicated.”</p><p>Forty-nine, forty-eight, forty-seven ...</p><p>“Hook up with me, then,” he cried. “Mind-to-mind.”</p><p>She turned to face him, the battle beyond forgotten. “What do you mean?” The vision faded but the clock remained.</p><p>He took hold of her arm. “Remember how you showed me the vision earlier, of Rachel. Well, show me this one, just like that. I might be able to use it to do battle.”</p><p>Twenty-nine, twenty-eight, twenty-seven ...</p><p>“I still think it’s too complicated. Can we connect somehow? A link of some kind?”</p><p>He put his hand on her neck and suddenly he was in her mind.This is a mind-link. She felt the click.</p><p>Good, she responded.</p><p>Ten, nine, eight ...</p><p>Time was running out. She couldn’t warn him. She just pulled away from him and in a sharp blast directed the vision along the link.</p><p>Gideon stumbled backwards about three steps then caught his balance. He opened his eyes. “Got it,” he cried, his sword in hand, upright, ready. “Keep streaming, no matter what happens.”</p><p>Three, two, one ...</p><p>And four beautiful creatures appeared in front of him, like magic, having folded straight through the dimension this time, delivered specifically to Gideon, no doubt, by one of Greaves’s powerful generals.</p><p>“Well, Militia Warrior, you ready to rumble?”</p><p>“Bring it on, asshole.” Gideon’s voice was dark.</p><p>A fifth vamp materialized, caught sight of Elise, and said, “The woman’s mine.”</p><p>But her vision had already given Gideon a head start. He would now know the exact maneuver each would take so that he could meet the enemy blow for blow. She backed up against the rock and sank into her safest position. She held the vision close and continued to let it stream.</p><p>Gideon couldn’t afford to stall out for even one second, but receiving the visions had turned his mind to mush and he wasn’t sure how long he could sustain seeing them, reacting, then pacing his moves by making use of all the anticipatory information. It was like reading one line and having someone speaking the next line at the same moment. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Even so, he let the images come, one after the next, and with the practice of two centuries on Second Earth, serving that entire time as a Militia Warrior, he fought, blocking the necessary thrusts, moving with speed as indicated, his sword arm ringing with strike after strike.</p><p>He dipped and caught the death vamp to his right low across the abdomen, which took him to the ground. He whirled, according to the vision, and before the next one could react, he took the pretty-boy’s head.</p><p>He shifted with preternatural speed, levitated and caught the third death vampire in the air, slicing his hamstrings and sending him into a violent roll. The vamp slammed into the earth, his neck broken.</p> <p>Gideon touched down and with the vision still pouring images into his head, struck blow after blow against the fourth death vamp, who worked backward in an attempt to move him away from the fifth bastard, and damn but the ploy was working. This death vampire had amazing sword skills, strong enough to match Gideon. He was now at least nine feet away from Elise and there wasn’t a damn thing he could do about it.</p><p>The images from her vision ceased as well, so he could only imagine what was happening to Elise behind him. What was the death vamp doing to her? Shit. He fought harder. He blocked one blow, vibrations ringing up his arm, then swung wide and low, but missed the killing strike.</p><p>That his woman could be taken or worse, killed, brought a burst of speed, so that he ended up behind his enemy then thrust his sword hard into the back of the vampire, all the way through.</p><p>When the pretty-boy fell face down in front of him, a sight met his eyes that shocked the hell out of him.</p><p>Elise stood over the last death vampire with a smallish boulder held high over her head. One massive boulder had just rolled off the death vampire and he was struggling to rise. Some of his ribs had to be broken, maybe his spine crushed. Sweet Jesus. She must have used her kinetic ability and surprised the hell out of her opponent.</p> <p>He watched Elise lift the smaller boulder higher still, then with all the strength she could muster she crashed the damn thing down on the death vamp’s head. The resulting crack and spray of blood forced his feet to move in her direction.</p><p>Elise was breathing hard as she backed away from the monster. She flattened her back against the enormous boulder she’d been leaning against earlier. Her arms were spread wide and trembling, her hands shaking.</p><p>By the time Gideon reached her, she was making small grunt-like sounds, small huffs from the back of her throat.</p><p>Her eyes were wild.</p><p>He glanced behind him and saw that the air battle was over ... for now. Duncan, another section leader, flew in his direction.</p><p>Turning back to Elise, he asked the only thing he could think of. “You okay?”</p> <p>She shook her head. “I saw into his mind. Oh, God, I saw into his mind.”</p><p>Gideon moved closer. He extended his arms toward her, intending to comfort her but she held up a hand. “No. Don’t even think it. That’s not what I want, not what I need. Not right now.” She shook her head a couple of times. “I saw into his mind. I ... saw the last woman he killed. She was pregnant, very pregnant, and he killed them both. I’m glad he’s dead. He’ll never take the life of another woman or another unborn child again.” Her voice was shocked out and uneven.</p><p>Gideon swore in a soft angry stream. Elise wouldn’t allow him to touch her, he didn’t know what to say to her, and he sure as hell didn’t know how to comfort a mortal who had just slain her first death vampire. She stood, staring down at the blood that pooled beside the killing boulder, her arms now wrapped around her stomach. She trembled from head to foot.</p><p>This was why he hadn’t wanted her to ascend. It just wasn’t fair to women of power that when they engaged their rite of ascension, they were faced with this.</p><p>He muttered a string of curses, then drew his warrior phone from the narrow pocket at his waist. He swiped across the front and a moment later heard Bev’s voice. “How can I help?</p><p>That voice again. He actually grew calmer. “Hey, Bev. We need clean-up at the White Tanks.” He looked around. “Damn, we offed twelve, no, make that thirteen, pretty-boys.”</p><p>“Well done,” Bev cried. “Let me engage the coordinates. Almost there. Just give me a sec.”</p><p>He drew close to Elise but still didn’t touch her. “Hey. Close your eyes when I say, okay?”</p> <p>Her gaze was fixed on the blood that still seeped, forming an ever larger black lake in the dirt.</p><p>“Okay.”</p><p>Bev came back on the line. “You folks ready?”</p><p>He called out to the troops, “Clean-up. Eyes closed.” He glanced at Elise and when he saw that she squeezed her eyes shut, he gave Bev the go-ahead.</p><p>He closed his eyes. He loved Second Earth technology. A brilliant light flashed over his eyelids and when he opened his eyes, every single bit of debris was gone, blood, feathers, limbs, bodies, everything.</p><p>He watched Elise closely. She opened her eyes, but her gaze sought the ground and she continued to stare at what was now just an empty damp spot, nothing much left to remind her of her first kill.</p><p>Duncan drew close. He nodded; Gideon did the same. Normally, they would have locked forearms and shouted their triumph into the air, but not with Elise working so hard to hold herself together.</p><p>“Casualties?” Gideon asked.</p><p>“Just a skin burn. Eric’s still walking, but I called for a healer. Down to the bone on his left arm.”</p><p>“Good, that’s good.” He turned to Elise. “I’d like you to meet one of the other Section Leaders. Duncan Wallace, Elise Jordan.”</p><p>Elise offered a half smile. “I know Duncan. We met at the Blood and Bite several times.”</p><p>“You remember, then,” Duncan stated.</p><p>Elise shrugged but she smiled and some of her tension seemed to ease. “I suppose I owe you an apology as well.”</p><p>“For what?”</p><p>“I faked being enthralled and having my memories sliced. I only pretended I’d never met you before each time Gideon introduced us.”</p><p>His brows rose. He jerked his thumb in Gideon’s direction. “And lover-boy didn’t have a clue?”</p><p>Elise chuckled. “You might want to do me a favor and let the subject drop, since lover-boy is still thinking about whether to forgive me or not.”</p><p>Duncan laughed. “You’ll do.” He gestured to the boulder. “Hey. What the hell is this?”</p><p>Gideon glanced at him and from his peripheral he could see that Elise did as well. He followed Duncan’s gaze to the base of the boulder. “What?” Gideon asked.</p><p>“This big-ass rock. Look, there’s a whole chunk of cholla flattened and sticking out at the far end. This shouldn’t be here.”</p><p>“Oh, that,” Elise said. She sighed, heavily. “That’s how I answered my call to ascension.” She turned around, searching the dark desert beyond. She waved in the direction of the White Tanks. “This boulder came from over there ... somewhere.”</p><p>“That’s major shit,” Duncan said.</p><p>Gideon watched Elise put on a brave face. She thanked Duncan for his compliment. He was proud of her, really proud of her.</p><p>His chest tightened as he watched her. He was so fucking lost, yet strangely energized at the same time, like he stood on the brink of something he didn’t quite understand.</p><p>Duncan held his sword balanced on the leather shoulder strap of his weapons harness. He addressed Gideon. “So just now, you defeated four death vampires by yourself. That’s unheard of. What the hell is going on with you? You looking to join the WhatBees?”</p><p>“I’d rather eat a bowl of crushed glass. Besides, I didn’t do this by myself. Elise is clairvoyant. She streamed the visions into my head and that’s how I got the job done.”</p><p>“I’m thinking you dating Elise might be about the best decision you ever made.”</p><p>Gideon glanced at his woman, who was actually smiling a little now. A strange sense of knowing, of destiny, rippled through his mind. Was dating Elise the best decision he’d ever made?</p><p>Beyond that, once she completed her ascension ceremony, how was he ever going to tolerate other men getting near her?</p><p>Chapter Five</p><p>Elise watched a dozen thoughts flit across Gideon’s face. She couldn’t imagine what he was thinking, but she seriously doubted he considered their dating to be the best thing that had ever happened to him. Not by a long shot. She cramped his style. That message she got loud and clear. He didn’t want one more woman in his life to worry about, especially since Rachel was already a handful.</p><p>Gideon loved his sister more than anything else in the world, but Rachel definitely had a mind of her own. She had for a long time been intent on exiling herself to Mortal Earth, joining a colony of vampires, and living a simpler, less complicated life. Apparently, in some colonies both the use of fangs and any preternatural power were strictly forbidden.</p><p>Rachel grew her own organic vegetables, touted the benefits of communal living, and despised the war above all things.</p><p>In contrast, Elise was here, having just answered her call to ascension, because she knew in her heart that Second Earth was where she belonged.</p><p>She glanced around. The Militia Warriors were all on high alert, scrutinizing the desert around them. How was she supposed to do three more days of this? She recalled her vision about Rachel. She had no doubt that she and Gideon would be with Rachel tomorrow night.</p><p>But how could they possibly get to that location if the enemy just kept throwing more death vampires in her direction?</p><p>She glanced at Gideon. “So what happens next?”</p><p>Gideon also looked around, his gaze skating from one squad to the next. “Well, the order of events is pretty screwed up and if I know Endelle, she’s going to ream COPASS until she gets her way. Greaves never offered you a choice.”</p><p>“The ascendiate is always given a choice,” Duncan said. “Mine came way early in the process, before the shit went down.”</p><p>Gideon nodded. “This might just mean good news, Elise, but I don’t want to get your hopes up.”</p><p>And with that statement, a movement of air swept through the night, behind Gideon but well in front of two of the squads near the mountains. Both men turned to face the White Tanks then moved into a fighting stance, as did the rest of the troops, knees bent, backs hunched, swords in hand and upright. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A single man, a warrior, folded into the battlefield. He wore the same traditional black leather kilt and weapons harness. His black hair was Warrior of the Blood–long and held in place by the traditionalcadroen.</p><p>Elise drew a little closer to Gideon. “Who is that?” she asked, keeping her voice low. “He looks a little taller than you, and I know all the Warriors of the Blood, but I don’t recognize him from the Blood and Bite.”</p><p>She felt Gideon’s sudden tension as though even the air around him tucked in close. “Leto,” Gideon said. “A former Warrior of the Blood, now serving Greaves.”</p> <p>Duncan spit on the ground. “A goddamn traitor.”</p><p>Leto.So this was the vampire who had left Endelle’s service to align with the Commander.</p><p>Leto acknowledged both Gideon and Duncan with an inclination of his head. As he drew closer, within ten feet of Gideon, he met her gaze and actually bowed to her. “I have come on behalf of the Ascenders Liberation Army to address the ascendiate.” The ALA. Now there was a serious joke. What exactly did ascenders need liberation from? But wasn’t that always the way. When a megalomaniac wanted to take over the world, he always promised freedom, then delivered slavery.</p><p>Leto had a rich, resonant voice that filled the desert night sky. “You are hereby afforded the opportunity to choose between service to Madame Endelle or to the Commander, Darian Greaves. The Commander hopes you will choose this night to align with him.”</p><p>Elise took a step forward so that she stood beside Gideon. At the same moment, he folded his sword away. “You would say that to me after your commander sent thirteen death vamps to this Borderland not ten minutes ago?”</p> <p>Leto held her gaze for a long moment, then bowed to her again. “The Commander offers his apologies. His servants acted hastily, and not from his orders, and he begs your forgiveness.”</p><p>Both Duncan and Gideon scoffed at these remarks.</p><p>Leto ignored them and continued, “The Commander also wishes me to advise you that should you choose to align yourself with the Coming Order, you will be well rewarded. A place of prominence has been prepared for you, a fine house, and great wealth. You will be given a post as a Seer’s apprentice, since he has perceived that you possess such abilities. I assure you it is a place of great honor. The Commander also wishes me to say that reports of his wrongdoings have been grievously exaggerated, that he is a man, a vampire, of noble character and high ethical standards.”</p><p>She couldn’t believe Leto had the audacity to say such a thing to her. “Does he consider the creating and sustaining of death vampires to be the representation of his high standards?”</p><p>“Weapons of war by definition are heinous. All of them. The Commander does not differentiate between a sword, a gun, or a death vampire. The achievement of a Coming Order will once and for all eliminate the depredations of the death vampires from the face of two worlds. That is the Commander’s promise.”</p><p>“How would that be possible?” she asked. “Don’t death vampires require dying blood to survive? Would he actually destroy his entire army?”</p> <p>“On no account. His world-renowned scientific team works day and night on a medical solution to the truly heinous addiction. Each day they draw closer to the awaited answer, but until the achievement, he feels compelled to use whatever means he must to draw this war to an appropriate conclusion.”</p><p>Again, the scoffs followed, but none of it mattered. She had already made her choice.</p><p>“Will you consider the Commander’s offer?”</p><p>“I know too much about Second Earth to ever consider an alignment with Commander Greaves. There can be no more discussion.”</p><p>She felt pressure on her mind, almost a tapping sensation. She watched as Leto’s eyebrows rose.You have powerful shields, ascendiate.</p><p>Though telepathy was new to her, she responded,As I have been told.</p><p>Leto bowed. Aloud, he said, “Then so be it. I have been notified that Madame Endelle has convened COPASS to argue on the illegalities of the recent attack. The Commander graciously grants a reprieve from further attack until COPASS has made its decision concerning the remainder of your rite of ascension. I bid you well, Ascendiate Jordan.” He bowed once more.</p><p>That he knew her name shouldn’t have surprised her, but she was still startled. He lifted his arm and vanished.</p> <p>Gideon brought his phone to his ear and conferred with Bev at HQ. She confirmed all that Leto had just said; the reprieve held.</p><p>Gideon suggested they retire to his Mortal Earth home in the hills just beyond Cave Creek to the north of Phoenix. He would cloak the house in mist just in case Greaves was up to his old tricks. He’d also have his men patrol the grounds through the night, guarding the property until dawn.</p><p>He suggested that Bev fold them as a unit in order to offer Elise the greatest protection. Gideon made the phone call and the moment he returned the card-like phone to the small pocket near the waist of his kilt, the vibration began.</p><p>Elise had never folded before. She tensed—darkness, a long quick slide full of vibration, then suddenly her feet touched gravel.</p><p>She found herself standing in front of a Santa Fe–style house, on a long driveway. The men, under Duncan’s direction, fanned out and took up another protective circle around the property. A ravine and nearby hill offered a certain measure of privacy. Since they were still on Mortal Earth, some distance from neighbors would always be necessary.</p><p>Gideon put his arm around her. “I’m going to cloak the house in mist now.”</p><p>She watched the mist appear, an interlocking lace-like structure that would serve to confuse the mind, as if the house simply didn’t exist. It was just like the mist Gideon had created in front of the booth when were at the Blood and Bite.</p><p>“So beautiful,” she whispered.</p><p>He turned to her. “Let’s get you inside. You’ve been through a lot and it’s late. I’m thinking you may be wanting a nice hot shower and a bed.”</p><p>She nodded. As she stepped across the threshold, the lights came on, soft lights from the ceiling. Dark slate covered the floor. A coat of arms decorated one wall. Ancient swords, another. The furniture was heavy, dark, very masculine, more black leather.</p><p>On the wall opposite was a large screen TV and beside it, a photo of Rachel.</p><p>Elise crossed to the photo. “She’s so beautiful, but her hair is a lighter blond than yours.” Rachel wore her hair in a mass of waves and curls. Her blue eyes sparkled. She had sculpted cheeks, also like Gideon’s.</p><p>Gideon stood just behind her, off to her right shoulder. “She and Duncan used to date. I’ve been debating all night whether to tell him about the vision.”</p><p>She looked over her shoulder. “This has to be really hard on you.”</p><p>He shrugged. “Better to have a vision than to get a phone call one day. But please, don’t think about that now. This is war and one thing you must learn is to be in the moment. It’s very clichéd, but damn true.”</p><p>She turned toward him. “I know you have a mind-link with Rachel. I know that’s part of your strategy here, but what else is being done?”</p><p>He nodded. As he drew his warrior phone once more from his kilt, he said, “Bev runs the surveillance grid at Militia Warrior HQ. She’s looking at northern California for us.”</p><p>He thumbed the phone then brought it to his ear. “Hey, Bev. How’s the grid looking? Any signatures?”</p><p>Gideon nodded and frowned. His shoulders sagged.</p><p>When he thumbed the phone a second time, she already knew the answer. “The grid is just finishing up a section in the mountains to the east, but there aren’t any rivers in that area, certainly nothing large enough to warrant a bridge or two. Basically, no signatures.”</p><p>“Maybe Rachel’s not even there yet.”</p><p>“Maybe.” His cheeks looked drawn and he didn’t meet her gaze.</p><p>She put her hand on his arm and rubbed back and forth. He shifted to look at her, then overlaid her hand with his arm. “What can I say, I love my sister.”</p><p>She nodded. “I know, and we’ll find her in time. I have confidence in my visions. They’re never wrong.”</p><p>“Never?” his brows rose.</p><p>“They’ve always come through.”</p><p>“Well, shit, that’s something. Thank you.”</p><p>“And thank you for saving my life tonight, you and your men. I will never forget that.” Then she smiled. “Now, how about that shower?”</p><p>Gideon glanced first to the left then to the right. He frowned, as though undecided about where to put her.</p><p>Finally, he looked at her. “I don’t mean to crowd you, Elise, but would you share my bed tonight? No funny business, I just want to be close in case something unexpected happens.”</p><p>Elise nodded. “You won’t hear me argue. I’m not sure I could sleep if you weren’t next to me.”</p><p>“Good. Then we’re in agreement. Good.” But his brow was pinched.</p><p>He gestured to his right and she headed down the hall. “Take the second hall on the right.”</p><p>She turned and made her way into a lofty suite that had a large bathroom on the right and on the left a bedroom with a vaulted ceiling.</p><p>She debated for only half a second. She headed left into the bathroom. Just before she shut the door, she glanced back. He stood there, godlike in his flight battle gear, his hair flowing away from his face, his hands fisted, his arms flexing and releasing.</p><p>“You won’t go far, will you?” she asked.</p><p>He shook his head. “I’ll use another shower and join you in a few minutes. How does that sound?”</p><p>“Good. That sounds good.” Funny how awkward she suddenly felt. She knew his body backward and forward and upside down from all her time with him at the Blood and Bite, but put her in his master bedroom and she felt strangely shy.</p><p>As Elise flipped on the lights and closed the door, she happened to glance down at her jeans. She drew in a soft hiss. The legs were covered in dark blobs and a couple of sprays of the same matter, which must have been blood from the death vamp she’d killed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She weaved on her feet, then backed up into the door to give herself some support. Could anything have brought the recent battle at the Borderland closer to home than this?</p><p>She closed her eyes and breathed through it, through the reality of the decision she’d made, that she’d basically entered a war against powerful monsters who drank people to death.</p><p>Her stomach turned, but she breathed some more. She reminded herself of what she’d seen in the death vamp’s head, the pregnant woman murdered, her child lost as she died. She held to that. She created a shrine to the woman deep within her mind and she promised herself that no matter what else happened in the coming days, weeks, maybe even centuries, that she would hold this woman’s death as her touchstone, the reason why Commander Greaves and his army of death vampires must be defeated as soon as possible, and once and for all.</p> <p>The part of her that functioned well when her world was orderly, approved of the shrine and subsequent resolve. If she just kept her head, both metaphorically and literally, she might discover she had the skills to survive all the coming tests and challenges.</p><p>With that, she folded off her all her clothes, and sent them straight to the trash can she kept in the side yard of her home in Surprise.</p><p>She turned the knob on the shower and as the water heated up she brought a few things over from her house: toothbrush and Colgate, peppermint soap, a hairbrush, body lotion, and a few more incidentals, a chemise and baggy silk shorts for sleeping, as well as a chenille robe. She hung the clothes on two hooks on the back of the door. Then she took a minute to arrange the rest of the goodies in a row.</p><p>Something about the neat line of toiletries gave her pause and a slow smile curved her lips. Maybe she didn’t know everything the decision to ascend would bring her or even cost her, but being able to just be herself, to utilize powers she possessed, really caused her heart to swell.</p><p>A half hour later, her hair was still damp as she sat in Gideon’s bed near the headboard, the covers to her waist. She drew up her knees and wrapped her arms around them.</p> <p>Gideon had returned to the doorway, this time barefoot but wearing jeans and a T-shirt that pulled across his pecs. His longish hair was damp, which made his strong cheekbones look even more prominent and so damn sexy. She wanted to ask him to join her in bed, but for some reason that earlier odd, shy feeling returned to her.</p><p>Even though his toffee scent was a strong indication that he wanted to be with her, probably as much as she wanted him, he hadn’t budged from the doorway.</p><p>“Hey,” he said, the tenor of his voice low, so very low. “So this has been a rough night for you.” He looked solemn, concerned, his forehead creased.</p><p>“Yeah, it has, but I’m good, really.”</p><p>The shower had given Gideon time to think. His plan to share the bedroom with her had seemed like a good idea at the time, but when he arrived at the door and saw her sitting in his bed,in his bed,some ridiculous primal beast had risen once more, maybe a symptom of this really frustratingbreh-hedden myth, and he’d wanted to launch through the air and throw himself on top of her.</p><p>So he remained by the door, trying to calm down. But it didn’t help that she kept looking at him, her gaze sometimes dropping to his neck, then his chest, his abs. More than once even lower, and he wasn’t exactly being shy right now. His jeans had shrunk.</p> <p>In addition, her strawberry scent was an olfactory nightmare that kept on giving.</p><p>Gideon knew the rational part of his brain was in there somewhere. He summoned it now and worked hard to put himself in her shoes.</p><p>She had been through hell, given the nature of her initiation into the world of ascension. It was now past ten. She needed her rest and he needed ... dammit, he didn’t know what he needed.</p><p>When he realized what she’d done at the Borderland, while he was battling his last pretty-boy, some tremendous shift had occurred in his mind. Here was an untried woman of power and of substance who had used two boulders, one that she’d moved kinetically, the other that she’d held in her hands, to kill a death vampire. She’d also coordinated his battle movements and because of that alone, he’d been able to slay four,four, death vampires. Unheard of for a Militia Warrior.</p><p>So who the hell was she, this powerful ascendiate, sitting with damp hair, a thin, strappy shirt over her full breasts, nipples peaked, her arms clasped around her knees, loosely, like she was doing okay, and shedding strawberry scent? Who the hell was she?</p><p>The woman meant for him.</p><p>He was reminded, however, that he didn’t really know Elise, that she had lied to him for two years, that she had pretended to him, faked him out. But he wasn’t even sure if that was what kept him immobile right now.</p><p>Then he understood that this didn’t feel small to him. It was one thing to meet a mortal woman once a week in a sexy booth at the Blood and Bite and take her from every position imaginable. But it was another to meet her on the other side of her call to ascension in which she had demonstrated all this preternatural power and acquitted herself remarkably on the battlefield.</p> <p>“Have you decided not to share this bed with me?” she asked.</p><p>“I’m not so sure it’s a good idea. We have a new ballgame now, and given our unfailing attraction to each other, I’d hate for things to heat up when there just isn’t going to be much on the other side for us. Understand?”</p><p>She drew in a long deep breath. “Gideon, I know it’s asking a lot when you’ve already made your position clear, that you can’t give yourself to me in a long-term relationship, and I get that, I really do, but if you could just stay with me tonight, sleep in the bed next to me, I would be ... grateful. ”</p><p>He glanced at the floor then back to her, his thoughts spinning. “I guess in all this time, we’ve never really talked aboutyou. I mean I know some things, that your father died when you were young and you didn’t get a lot of support as a child. I can’t even imagine what it was like to have your kinetic abilities and your clairvoyance come online with no one to talk to.”</p><p>She took a deep breath. “It was pretty rough when I was so young.”</p><p>“I’d like to know more.”</p><p>She huffed a sigh. She rolled her thumbs over and over each other and stared at them now. “I don’t remember much about my father, although I remember being sad for a long time after he died.</p><p>“The real problem was how his death affected my mother. She wasn’t prepared to enter the workforce and she always struggled to make ends meet. She grew bitter and, I guess you would say she was cold towards me. I never felt like she blamed me outright for the difficulties of her life, but the bottom line was simple: she couldn’t be there for me.</p><p>“I tried to tell her about one of my first visions, that one of the neighbor children was going to get hit by a car.” She paused. More deep breathing.</p><p>“The accident happened, didn’t it?”</p><p>She nodded, still rolling her thumbs.</p><p>“My mother yelled at me, called me selfish, told me I used my imagination way too much. She seemed to ignore the fact that an hour later the child almost died from exactly the kind of accident I had foretold. I understand now, though. She was sunk in her own problems and had no way of reaching out to me. So when she told me to go to my room, I crawled under my bed and stayed there, for hours. I guess in my little girl way I was adjusting to my reality. My mother never mentioned what happened and I took her cue and never spoke of my powers again. I learned to organize my life in simple terms and without the complications of relationships, not even one with my mother. She died about nine years ago of cancer.”</p><p>He took a step into the room. “I’m so sorry.”</p><p>She shrugged. “I’ve never told anyone that story.”</p><p>“I guess you really couldn’t, could you?”</p><p>“Not like that. I guess what I’m trying to say is that I get where you’re coming from. Neither of us, I think, is exactly built for a relationship, wouldn’t you say?”</p><p>“My job is lethal. There’s no other way to say it. I could go out to fight in the next hour and not come home. Why would I want to put that on a woman, any woman?”</p><p>He sighed. “The funny thing is, I’ve been to a lot of funerals, deaths of my brothers-in-arms, and I’ve learned to grieve, to adjust, to move on. But you know what I really can’t handle, the thought that someone I love, someone not serving as a warrior, someone really close to me, could get hurt or killed by a death vampire. This thing with Rachel, your vision, has my chest in a vise. But even without the vision, I worry about Rachel all the time. I can never let it go.”</p><p>“And now I’m here.”</p><p>“And now you’re here.” He moved the rest of the distance to stand at the foot of the bed. “I think you’re going to be happy on Second Earth, I do. You’ll get to be more of who you are every single day. But I’m really counting on you finding your place in this new world far away from me and I hope like hell you understand. It’s not personal. But if I got involved with you or anyone else, I’d be wound up in an even tighter knot, wondering when the other shoe would drop, waiting day after day to get the bad news.”</p><p>She nodded. “I get it. You don’t have to say anything more and as soon as I’ve made it through my ascension, I think I’ll strike out for new territory, maybe San Francisco Two or Paris. I’ve always wanted to go to Paris.”</p><p>He smiled and something inside him eased. She’d let him off the hook, although, given her history, that hook hung pretty low to the ground as it was.</p><p>But would it ever be that simple? Elise in Paris or anywhere else in the world? Would he ever truly be free of this gnawing sense of responsibility he felt for her?</p><p>She patted the bed next to her. “Come be with me, Gideon. Just until I get through my rite of ascension.”</p><p>He let all of his fucking worries drop to the floor. She needed him and he could be with her for a couple more nights.</p><p>He crawled across the top of the comforter. She stretched out on her right side to face him as he settled his way too big warrior body next to her. He drew his knees up then jammed the pillow up under his head so he could see her better. She did something similar. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tell me about Ohio in the early 1800s.” She smiled when she said it and he realized she was relaxed, that she was asking a question about his past, and perhaps for the first time could ask without worrying that he might think she knew too much about the dimensional worlds.</p><p>“Raw. Ohio was raw back then.” He talked of the family farm that he grew up on, the siblings birthed and buried because that was the way life was two hundred years ago, of the brother who lost his arm in an accident, his mother and father, that Rachel was the only one of his family to ascend.</p><p>She shared as well, the brighter spots of her life, of trips to San Diego in the summer to visit an aunt and of once making her mother smile because she’d baked a cake for her birthday.</p> <p>She reached over and put a hand on his nearest bicep, the one pressed into the jammed-up pillow. She stroked lightly and it was a comfort. Without thinking, he covered her fingers with his hand and pressed them. He met her gaze and she smiled.</p><p>“This is nice,” she said, but she yawned. And after a few minutes her eyelids started to fall.</p><p>Yes, this was nice, and his heart began to hurt all over again.</p><p>Damn, what was he supposed to do with this woman?</p><p>Chapter Six</p> <p>Elise dreamed she was ready to fly. She stood at the northernmost edge of White Lake. She wore a soft, light-blue flight suit with a halter to allow for wings, and soft leather shoes. Gideon always said that his wing-locks were sensitive, but the closer she came to mounting her wings, as the apertures all down her back in a V began to weep, her entire body developed a low, exciting hum that reminded her of sex.</p><p>Her back thickened, both muscles and all the surrounding tissue. She gasped and arched her back. The next second, her wings flew through her wing-locks, rushing from her back, forming through a sudden complex combination of feathers and a mesh superstructure.</p><p>She cried out. She felt light and at ease with the world.</p><p>As though she had been making use of her wings forever, she drew them up and up until the tips of each span almost touched in the center above her. Then she drew them back down in a powerful sweeping motion, which of course propelled her into the air. She lifted her face into the wind and soared, flying high over White Lake.</p><p>Her wings moved separately from her arms so that with each forward thrust she could simply hold her arms in front of her and embrace the flow of air and savor.</p><p>The sun was on her back, a beautiful spring morning in the desert. She looked down at the dark, blue-green water below and saw her shadow, then the shadows of several other flyers.</p> <p>She glanced left and right. Spread over several hundred yards or so were eight female ascenders, four on each side of her, all facing forward, powering their wings in unison as though they formed a flight team.</p><p>She turned her attention to what was in front of her now. Other female ascenders preceded her, a row of five, a row of three, then one and she recognized the lead woman ... Alison, the woman Warrior Kerrick had taken as hisbreh, or mate, when she went through her rite of ascension. Gideon had told her the whole story of their relationship just a couple of months ago.</p><p>Elise knew she was meant to be here, destined to be here. But why? What was her purpose in being part of this team, of flying over White Lake on Second Earth, of flying behind Alison?</p><p>“Hey.”</p><p>Elise heard Gideon’s voice, but it was far, far away.</p><p>In slow stages, the dream began to fade.</p><p>“Elise.”</p><p>She awoke and opened her eyes. She had the sense that she hadn’t been sleeping very long. She was still facing Gideon but he was propped up on his elbow and looking down at her. Concern etched his dark blue eyes.</p> <p>“What is it?”</p><p>“You were making a funny sound in your throat, like you were trying to speak. I was worried.”</p><p>“I was dreaming of White Lake and of Alison and many other women. We were all flying, but in a coordinated pattern as though we were meant to accomplish something. What do you think it means?”</p><p>He shook his head. “I have no idea. Maybe one day you can talk it over with Alison. Scuttlebutt says she dreamed of White Lake during her ascension as well. But just so you know, we put a lot of stock in dreams on Second.”</p><p>She sighed and nodded.</p><p>“So you’re okay?”</p><p>“Yes.” She smiled. “It was a good dream. I liked being there. I felt as though I belonged. Oh, and I mounted my wings and flew. I love it when that happens.”</p><p>He nodded as though that seemed perfectly reasonable.</p><p>The dream had helped her to understand more of the world she had entered, more of Gideon’s world, who he was. “Gideon, I want you to know that I loved all those times we were together at the Blood and Bite.”</p><p>He chuckled. “Yeah, it was pretty great.” She heard a soft growl leave his throat and her body responded. He’d done that a lot over the past two years, growled like a jungle animal, and every time the soft rumbles had worked her up so fast. She’d loved it.</p><p>Though the room was dark, she could still see him. It was ... romantic.</p><p>“I can see you,” she said.</p><p>“Preternatural vision. Nice, isn’t it?”</p><p>“Is it always like this, for all ascenders?”</p><p>“Nope. Again, you’re special and I guess in this way, so am I. Hey, what’s with the strawberries?” But he chuckled again.</p><p>She sighed and her body started experiencing that loose, liquid feeling like she was melting. “Mmmm. Toffee.” As she had earlier, before she fell asleep, she put her hand on his bicep. “Don’t you think you’d be much more comfortable under the covers?”</p><p>He cleared his voice. “Uh. Maybe I should go.”</p><p>He rose up as if to leave, but with that movement, her fingers slid down his arm and she caught him on the inside of his elbow and tugged. “The hell you should.”</p><p>He met her gaze. “You’ve been through a lot, Elise. I don’t want to take advantage of you.”</p><p>At that she laughed outright. “You gotta be kidding me.”</p><p>“I’m trying to be a gentleman here.”</p><p>“Well, screw that. You’re what I need and I need youright now.Besides, there was something I always wanted to do with you at the Blood and Bite, but I couldn’t because if I’d suggested it then you would have known you’d failed to put me in thrall.”</p><p>She watched his eyes flare and a delicious wave of toffee rolled over her and tightened all the muscles of her lower abdomen until she was squirming against the sheets. She loved how he smelled because it wasn’t just toffee, it was him, a very male scent that rippled through her nose and sent vibrations into her brain.</p><p>This was the way it had always been, proximity, touch, a little whiff of him, and her body became a bed of coals.</p><p>“What did you always want to do?” he asked, his voice low. Another soft growl left his throat.</p><p>She licked her lips. “How about I just show you?”</p><p>He didn’t exactly speak, it was kind of a groan, growl, and soft grunt combined.</p><p>She had him.</p><p>“Roll onto your stomach, Gideon.”</p><p>“My stomach?”</p><p>“Well, strip first. That would be helpful, then after that just do what I tell you to do. Got it?”</p><p>He didn’t wait to be ordered again, but sat up and while still on the bed, he pulled his T-shirt up and over his head, which of course gave her a fine view of all that lean, muscled warrior physique. She cooed and ran a hand up his chest. She wanted to keep touching him, but he moved backward, slid off the bed and shucked his jeans. Oh, God, he’d gone commando ... again. She licked her lips because he was fully aroused. She was finding it hard to breathe.</p><p>“On the bed, warrior.”</p><p>But his gaze fell to her chest. “Not yet. Not until you’re naked as well.”</p><p>She grinned. This was so much fun. She stood up on the bed, but stayed out of reach as she pulled her chemise over her head and dropped it on the floor behind her. She took her time easing out of her baggy sleeping shorts.</p><p>His gaze never once met her eyes, instead they flickered over various parts of her body: her breasts; her navel, which he liked to tongue; her hips; and the thatch of hair between her legs.</p><p>When he reached for her, she put out a hand and backed up just a little making sure she didn’t ruin the show by falling off the bed. “No-o-o, warrior. This is my ascension and I get to call the shots. On your stomach. Now.”</p><p>He grinned this time, then obediently pulled the covers back and stretched out beside her ... oh, yeah ... face down. Oh, God, what a body.</p><p>“Now spread your legs wide so I can get where I need to be for this.”</p><p>He obliged her. “Sweet Jesus, Elise, what are you planning to do?”</p><p>“Not gonna tell you.” She smiled and climbed over his right leg so that she could plant her knees between his thighs. “Are you comfortable?”</p><p>“Oh ... yeah.”</p><p>She realized that trust was so not an issue between them. He was fully exposed to her, vulnerable and beautifully on display, the hard mounds of his ass and his lean, muscled warrior body from tight muscular legs to a back that angled into broad, powerful shoulders. She stretched out her right hand and ran two fingers from the top of his spine down to the base. Even this touch caused his body to undulate. She smiled and her body responded in turn, tingling low and growing damp.</p><p>The air was all toffee and very male.</p><p>Anticipation was a good thing.</p><p>She leaned over him and smoothed her hands over his back, starting at the spine and spreading wide so that at last she felt what she wanted most to explore.</p><p>“Oh, God, my wing-locks.”</p><p>“Yes.”</p><p>“Remember, they’re sensitive.”</p><p>“Oh ... yes. I experienced them in my dream.” A shudder of pleasure ran straight through her, all the way to her toes.</p><p>She smiled again. She leaned down, stretched out over him, and got close, skin to skin. She licked along the very top wing-lock, to the right, a long ridge just above his shoulder blade.</p><p>He cried out, then said, “I’m serious, Elise.Sensitive. If you keep that up, I’ll come fast.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I know, and this is exactly the way I want it, so just relax. Now shift your left hip just a little. Make any adjustment you need, but I want your cock in my hand ... now.”</p><p>Again, he didn’t wait for a second command. He bent his left knee, moved around a bit then muttered, “Okay,” which came out hoarse and breathy, partly because his face was smashed into his pillow. The other part of “breathy” she understood quite well because he was leaking his toffee scent everywhere.</p><p>She took her time and drifted a hand down the whole panel of wing-locks on the left, which were now weeping. The moisture made her fingers nice and wet. Perfect. He groaned, grunted, and cried out. Again, perfect. She leaned down and started licking the uppermost wing-lock on the right side of his body again.</p><p>“You’re killing me,” burst from his mouth.</p><p>“Good.” She licked some more.</p><p>She reached with her wet hand and found his very stiff cock and gently eased her hand over the soft, swollen head. As she licked the wing-lock she began stroking him. She had a lot of territory to cover and savored every inch of it.</p><p>Shit, shit, shit, moved from his mind to hers.Oh, God, oh, god, oh, god ...His hips began to pump and she stretched her body out a little more so that she connected with him, mostly her pelvis over his buttocks. She found a good rhythm with her hand and she worked him at just that right pressure, not too hard, not too gentle. She kept licking the wing-lock at the same time and listening to the groans from his mouth and what became a persistent stream of curses from his mind to hers, which pleased her so much.</p><p>Oh, fuck, that feels good.</p><p>She loved pinning him down like this and having him in her power. “I’ve fantasized about this, Gideon,” she whispered against his ear, then moved back into position to lick his wing-lock some more.</p><p>His big body shuddered beneath hers.</p><p>No, this wouldn’t take long.</p><p>When he was almost there, she moved the fantasy forward. She opened her mouth wide and took part of the wing-lock fully into her mouth and sucked ... hard.</p><p>Damn, but if he didn’t bow off the bed—how she kept her balance on top of him she wasn’t sure. She moved her hand fast now and that was all it took as he groaned and started to come. A very longshiiiiit traveled through her mind.</p><p>She kept the rhythm steady as he cried out over and over. She sucked and sucked on his wing-lock as his cock jerked in her hand. Her body bounced on top of his erratic movements until he was finished at last and lowered himself to the bed with a long, serious, satisfied groan.</p><p>She gave his wing-lock one last lick and released his cock from her fist very carefully. He was usually pretty sensitive after he came.</p><p>She remained spread out on top of him. She felt satisfied in that way she always was when he orgasmed. She knew the bed was a mess, but who cared? This was her ascension. She had survived a death vampire attack. She could damn well enjoy the moment however she wanted.</p><p>He chuckled softly, so that her body bounced. “That was fantastic and I love that you’re on top of me.”</p><p>She spread her arms out over his. “Look, it’s like we’re flying and our arms are the wings.”</p><p>He chuckled again and once more she was bouncing against his back.</p><p>He took her left hand in his and drew her fingers to his lips. Afterward, he turned her hand slightly and licked over her veins. “I just realized I don’t have to pretend either, and you know what happens when I take sustenance.”</p><p>She shivered and a small moan escaped her lips. For whatever reason, her blood brought on renewed arousal. “Then you should take what you need, vampire.”</p><p>“And after that, I’ll give you what you need.”</p> <p>She moaned softly against his neck.</p><p>She felt saliva on her hand first. When his fangs emerged, he tended to salivate quite a bit. His fangs struck next, a slight sting, a dart of pleasure, then the sucking began.</p><p>Her back arched because there was nothing like that pulling sensation. For whatever reason the ascended world had emerged as a vampire world and the giving of blood was one erotic ride. Her hips began to press into his buttocks and with each movement of his mouth, as her blood left her body and flowed into his, desire rippled over her breasts, sent shivers down her abdomen, until she felt the clench and release of her internal muscles.</p><p>That she was feeding him meant something to her, more than she wanted to admit, especially since she’d been feeding him, nourishing him for the past two years. So just how far along this road were they, anyway? Could she really see a life on Second Earth without him? On the other hand, could they make a life together without tearing each other apart?</p><p>But when the thought struck her that at the end of her rite of ascension, when she actually ascended to the Second Dimension, she too would gain a pair of fangs and take sustenance from his body, she groaned and set her mouth at the back of his neck.</p><p>She sucked on him and bit him, which made him draw harder at her veins and once more his body writhed under hers. Damn, it all felt so good. She summoned her newly discovered telepathy and sent,When I get my fangs, I want to take your vein deep.</p><p>Those must have been the right words, since she got the best response. He released her wrist and with preternatural speed turned into her and flipped her over. Before she knew what had happened, she was flat on her back, her arms caught in one of his hands overhead, and he’d bound her with a rope around her wrists.</p><p>Oh. Dear. God.</p><p>“Now here’s somethingI’ve been wanting to do.”</p><p>She held his gaze, those gorgeous blue eyes that she’d looked into how many times while he took her to the edge, a hundred, a thousand? His streaked blond hair hung a little forward, framing his face. He was so handsome and he always made her come more than once. He was attentive that way.</p><p>Would it be so bad being with him ... forever?</p><p>But as the rope tightened she craned to look behind her and saw that he’d tied the rope to what she hoped was a very strong finial in the center of the headboard.</p><p>She shifted her gaze to see those blue eyes again. He straddled her, all this muscled vampire. “I have you where I want you.”</p><p>“You should let me go, warrior,” she teased. She tugged on the rope but it wasn’t fear she was feeling.</p><p>He planted his hands on either side of her face. He dipped down to sniff her cheek, her temple, her neck. “Strawberries,” he murmured. “Sweet, ripe, luscious strawberries, sweet enough to eat. And, no, I’m not letting you go.”</p><p>Her back arched and a moan left her mouth. His teeth grazed her neck. “I’m going to eat you, Elise. You ready for that? You want my mouth on you? My tongue? What about my fangs again in just that place you like and the way you like it?”</p><p>She writhed and tugged on the ropes, because right now she wanted her hands on him. She wanted to push his shoulders in the direction she needed him to go.</p><p>“Tell me what you want, Elise.” He licked her neck. “But I’m not moving until you say it out loud. I want to hear the words.”</p><p>A strangled sound escaped her lips. “I want your mouth on me. Gideon, do that thing with your fangs, that potion you release between my legs.”</p><p>He drew back and met her gaze. He smiled, then he kissed her, a slow wet kiss, his tongue deep and pulsing. He drew back, “You sure you want me to go down on you?”</p><p>Her back arched and a groan rattled around in her throat. “Yes. Please. Yes. Now. ”</p><p>He kissed her once more, then eased backward, trailing kisses down her chest, over both breasts, down her abdomen, lower and lower until she was blind with frenzy and need, knowing exactly how wonderful it would feel. Because she’d taken him on his back and brought him to orgasm, she was so ready for him. His arousal was hers and back and forth until when he kissed her pubic hair she was panting in light gasps, her abdomen jerking in small movements.</p><p>Then his tongue found her and she cried out at the sheer, intense pleasure and it wasn’t just that it was an oral touch but, dammit, it was Gideon, and he knew her body, and she treasured him and trusted him and the ropes made the whole damn thing so hot.</p><p>She was on fire as his tongue flicked back and forth, then moved up and down. He blew a soft stream of air, then got in close and took as much of her in his mouth as he could and suckled her.Almost there, almost there,she sent, streaming her thoughts into his head.</p><p>Must have been the wrong words because he stopped and drew back to look at her. “That’s not a good thing.” How innocent he looked, but how cruel.</p><p>She jerked on the ropes now. “More, more.”</p><p>“More? You sure?”</p><p>“Gideon,” she squealed, one long complaint.</p><p>He chuckled, very low, very deep. But when he bent down it wasn’t his tongue she felt but his fangs in the center of her mons as he struck deep. She cried out partly in surprise, partly in response to the unexpected quick pain that diminished immediately, but mostly because she knew what was coming.</p><p>Fangs could release potions, one of the best gifts of ascended life, Gideon had once told her. She felt the secretion and the pleasure began, a burn, a thrill, an ensuing ache. Oh. God. He kept his fangs buried and then she felt his tongue working her low, over all the folds and secret places so that she was once more right near the edge.</p><p>But he held back, she could feel it. His voice entered her head.Tell me when. I know how you like it, so tell me when the potion hits you and I’ll do it, quick and fast.</p><p>“Okay,” rushed from her throat. Her hips bucked now against him, but he planted his hands on her waist to keep himself pinned tight.</p><p>The potion was low, seeping and pleasuring her. She panted in quick harsh pants.Almost, almost. Oh, God, she couldn’t breathe.</p><p>Tell me.</p><p>Almost.</p><p>Tell me, Elise. Let me give you pleasure.</p><p>“Now,” she cried out as the potion poured through her flesh.</p><p>He withdrew his fangs and flicked his tongue in quick sharp movements.</p><p>Pleasure spiked, her back arched, she screamed at the ceiling and he kept licking and bringing her and bringing her and bringing her. The orgasm rolled on and on because the potion intensified everything. She cried out over and over and he kept working his magic until at last the sensation subsided. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She lay, panting and just a little contorted.</p><p>Gideon rose up from his labors. His woman’s torso was twisted to the side and she panted. Her eyes seemed unfocused, just the way he wanted them. He saw his work and it was good. He smiled.</p><p>He glanced down at his cock, which once more stood at attention. There was nothing like her pleasure to get him worked up.</p> <p>At last her arms and legs grew slack. She rolled to stretch out and finally looked up at him, her wrists still tight in the ropes. “Thank you,” she murmured. She blinked a few times. “That was amazing.”</p><p>“We’re not done, just so you know.”</p><p>She chuckled and smiled. “We never did seem to quit too early in the game, did we?”</p><p>“The usual was at least three rounds, but who’s keeping score.”</p><p>He straddled her and walked up the bed with his knees. He could have mentally untied the ropes but he wanted his cock close to her face so that he could tease her a little more, as he slowly undid the knots. He let his fingers do the looking because he knew Elise and he wanted to watch her. She liked having her mouth on him and he wanted to keep himself just out of reach.</p> <p>He watched her lips, her tongue, trying to get to him, so he shifted this way, then that, just so he could watch her mouth open. He wanted to see himself inside her, but this was a good way to begin.</p><p>When she finally released a frustrated huff, he freed the ropes so that she could now move her arms and hands and put them wherever she wanted them. He rose up just enough and touched the head of his cock to her mouth. With her hands now on his hips, she met his gaze as she opened wide and he fed her, slowly, one inch at a time.</p><p>At the same time, she slid her hands over his buttocks and began to knead his flesh.</p><p>Holy shit.</p><p>If his mouth on her felt anything like this, then he understood why she enjoyed his tongue as much as she did. He closed his eyes and savored as she began to move her tongue over his cock and to suck, then lick, then suck. He drew himself out of her slowly and she sucked just a little harder until a stream of air left his throat, something close to a hiss.</p><p>He was torn. He wanted to keep doing this, but he was already a little too far gone—but then he usually was when he took her blood. Still, he didn’t tell her to stop, and now there was a soft warble in her throat. His hips began a slow pump and her mouth moved with him.</p> <p>His gaze fell to the left side of her neck. He wanted more of her. Her black hair lay fanned out on the pillow beneath her. He could see the pulse in her neck. His mouth flooded with saliva, which always happened when what he wanted was inside her vein.</p><p>Her fingers worked the muscles of his buttocks and she’d begun moving her head up and back so that she could stroke part of his length with her mouth. He closed his eyes and gave himself up to the pleasure for just a few more seconds. Just a few more. Oh, dear God.</p><p>But when his thighs tensed and his back started to bow, he pulled out of her mouth, slid backward, leaned down, and planted a kiss on her lips. “Next time,” he murmured. “Right now, I need something different.”</p><p>She arched her neck and kissed him back. He remained where he was for a long moment as he gazed into her eyes. Would it be so bad, being with her, long-term? Could he? Could she?</p><p>The thought of coming home to her each morning after a night of battling death vampires drew his heart into a hard, hopeful knot. Shit, he shouldn’t be having these thoughts. These decisions had already been made. Right?</p><p>She slid a hand to the back of his neck and pulled him down to her. She kissed him again, warm and deep. She looked at him. “Don’t fret. Not right now. Just make love to me and make it good. We’ll worry about tomorrow ... tomorrow.” She smiled.</p><p>That was something she’d always done; she’d always known the right thing to say to put him at ease.</p><p>He had just started sliding down her body, ready to finish what they’d started, when his phone rang.</p> <p>“Shit.” He maneuvered to the side of the bed and folded his phone into his hand. “Give.”</p><p>“Hey, don’t bark at me,” Seriffe said, but he chuckled. “Sorry to disturb, but we’ve been summoned to the palace.”</p><p>“The palace?” He turned and looked at Elise, who was leaning up on her elbows, still beautifully naked. “When?”</p><p>“The next ten minutes. Can you be ready?”</p><p>He looked down at the missile that was his cock and sighed. “Sure.”</p><p>“Get a patch through to Jeannie at Central for the fold.”</p><p>He dropped his phone onto his jeans.</p><p>“What’s going on?” Elise asked.</p><p>“It’s your ascension ceremony.”</p><p>“I thought I had to endure a series of attacks for three days?”</p><p>He shrugged. “The sequence was wrong for your rite of ascension. Leto should have offered you the choice first before the death vampires attacked. Endelle probably forced COPASS to give her this concession. Hey, don’t worry. This is good news.”</p><p>This timeshe looked at his cock and sighed.</p><p>Chapter Seven</p><p>Elise stood in front of Madame Endelle, in one of the large white marble rotundas of the official Second Earth palace. She was waiting for Her Supremeness to start the ceremony. She might have been awed by her surroundings if she hadn’t been completely overcome by the reason for her presence in the massive, formal dwelling.</p><p>She was ascending.</p><p>Endelle had argued her case before a hastily convened COPASS, stating that because Elise hadn’t been offered her choice of alignment before the attack at the White Tanks Borderland, the attack had been completely illegal.</p><p>Greaves had agreed to permit the ascension without further repercussion. It was that, or the actions of one of his generals would be brought to trial and the general could risk execution for violating COPASS law. So, naturally Greaves conceded.</p><p>So here she was, at Madame Endelle’s palace, at nearly midnight, with Duncan standing off to her left side and serving as a witness. Gideon stood behind her and to her right just a couple of feet. He wore a formal military tunic in black silk and a sleeker version of the usual battle sandals. He had a purple cape flung over one shoulder. Again, ancient Rome came to mind.</p><p>Elise wore a simple black dress for the ceremony and basic black heels. She’d worried that she wouldn’t be dressed appropriately, but frankly, Endelle hadn’t seemed to notice what she was wearing or anything else about her.</p><p>Her Supremeness smoothed a hand the length of her earring—the same feathered earring that Elise had seen in one of the visions she had recently shut down. The feather was very long, a foot perhaps, and narrow, with the coloring of pheasant. Endelle wore a black ceremonial robe that reached to what Elise knew to be some of Her Supremeness’s favorite footwear: black stilettos. She held a large book in one hand and with the other flipped through the pages.</p><p>Elise felt dizzy and overwhelmed. She was ascending, beginning a new life in a new dimension. She would be free to explore her powers in the open and if the itching up and down her back was any indication, she would develop wings in the near future. She couldn’t wait.</p><p>“It’s late,” Endelle said, “and my thong is bugging the shit out of me, so let’s get this done.”</p><p>Elise couldn’t suppress a spurt of laughter, but Endelle truly didn’t seem to care. She read straight from the book in a voice that bordered on a drone. A woman, in a place of authority, who was nine thousand years old, had probably done this one too many times.</p><p>Despite the woman’s disinterest, the words meant something to Elise, of the ascended world, of the community she would soon enter, of service, great service, to Second Earth. She would be given special duties that would align with her preternatural powers and in due course she would receive the gift of relative immortality. She would receive her fangs this very night and, yes, she would one day mount wings and fly.</p><p>At the end of the reading, Endelle posed Elise several questions about dedicated service, limiting her involvement with Mortal Earth, and asking her to pledge her loyalty to Endelle. Elise responded in the affirmative each time. Endelle waved her forward as she folded the big book away.</p><p>When Elise drew near, the ruler of Second Earth put both hands on Elise’s jaw. Her hands were very warm and that warmth increased until her fingers felt hot. A kind of vibrating energy began to flow into Elise’s face.</p><p>“I hereby imbue you with Second immortality, all the qualities which will allow for long-life and the sharing of blood and potions. May you bring peace to our world.”</p><p>The earlier dizziness increased. Elise closed her eyes and power poured through her, an exciting wave of sensation that jolted her shoulders, arms, torso, and legs. She felt wonderful, at ease, almost peaceful.</p><p>She drew in a deep breath, as though new life flowed into her lungs and healed every secret, lonely place that had haunted her throughout her childhood. This was the true gift of ascension, a sense of being fulfilled, empowered, and brought into a community of like beings.</p><p>Endelle released her and commanded her to open her mouth.</p><p>Elise put her fingers to her face. She felt different, especially at her incisors and with just a thought she made her newly created fangs emerge.</p><p>“Good. Very good. Not everyone can do that shit right away.” She then snorted and looked at Gideon. “Looks like you’re in for a ride tonight. Oh, and look, I’ve made your woman blush.”</p><p>Elise knew her face was hot, but the sudden flush wasn’t about sex or embarrassment. She met Gideon’s gaze. “I’m ascended now.”</p><p>He nodded. “Yes, you are.”</p><p>She felt very strange, very different, like something in her mind had opened, broadened. She reached out for Rachel with her thoughts and found her camping beside a river, the same river with two bridges. “I can see Rachel,” she whispered.</p><p>“Who the fuck is Rachel?” So much tact from the ruler of the world.</p><p>Elise met Endelle’s gaze. “Gideon’s sister.”</p><p>“Oh, that Rachel.” She rolled her eyes. “Well, kids, I’m outta here.” She lifted an arm, then lowered it. She turned to Elise and after offering a strange little grunt, she said, “Welcome to Second Earth. I hope you like it here. Ah, fuck, whatever.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Elise smiled in return as the air rippled in the vacated space. She wasn’t sure if she despised the ruler of Second Earth or really liked her.</p><p>Duncan approached them. He extended his hand to Elise and she took it. He covered that hand with his own. He had beautiful green eyes, but something in them looked rather lost, very alone. Maybe it was a warrior thing. “Welcome to Second, Elise. I know you’ll be happy here. It’s not an easy world, but you’re obviously built for it in many ways. Congratulations.” His smile was warm.</p><p>A growl sounded beside her and probably by instinct, Duncan withdrew his hand and took a step back. He lifted both hands, the universal surrender signal. “Just showin’ the love, Gid.” But he laughed. “And to quote our fearless leader, ‘Well, kids, I’m outta here.’” He offered a bow, rose up, lifted his arm and vanished.</p> <p>She was sort of getting used to that. Sort of.</p><p>She was left with Gideon and an unsettled feeling that everything had just changed.</p><p>He put his hands on her shoulders. “You’ve been through a lot and it’s late. You must be exhausted.”</p><p>She met his gaze. “You’re right. I am.” But there was something more, something she couldn’t quite put her finger on.</p><p>“Let’s get you home.”</p> <p>She looked up at him. And there it was, but it made her smile. “And where would that be?”</p><p>He laughed. “You’re right. How about for tonight we go to my home in north Scottsdale Two?”</p><p>“I’d like that.” But she couldn’t quite escape a sense of unease.</p><p>Using his slim warrior phone, he contacted Jeannie and the strange folding vibration began, followed by that quick slide through nether-space. Her feet touched down on hard rough gray stone.</p><p>Gideon’s house.</p><p>She glanced around and her eyes popped. She didn’t know what she had expected to see, but not this, not a house that was so interesting and well-designed. The man made war, yet he lived here. “This is yours?”</p> <p>“Every last bit.”</p><p>From the large living room on the left, she could see scattered lights from a long bank of windows. She turned in the other direction, and saw landscaping lights that shone up into a rising slope of desert cactus, creosote, and spindly trees. “You’re on a hillside.”</p><p>“Yes.”</p><p>“So this is your home on Second Earth.” She glanced around. “This stone is beautiful.” Some of the walls were curved and she could hear a fountain in the distance.</p><p>He waved a hand and lights came on, shining down from a tall, beamed ceiling.</p><p>A castle in the desert.</p><p>She looked around. She liked the strength of it but she saw something else as well, a place well-fortified, a reflection of the master, perhaps even a reflection of his heart.</p><p>Gideon stood three feet away from Elise. He felt the distance; he could taste it. Something had changed for her.</p> <p>She looked around and marveled. She appreciated the architecture; she even smiled. But as she turned toward him and faced him, a deep sinking sensation pulled once more at the base of his heart.</p><p>“I know we left in the middle of things to go to the palace,” she said, her gaze flickering to and away from his, then back. “But I think I would prefer to sleep alone. I didn’t expect to feel this way.”</p><p>“What way?” He needed to know, wanted to know what thoughts crowded her mind right now. His heart took to thudding a heavy cadence and not in a good way. Jesus, sweat broke out at his temples. He took a deep breath.</p><p>“I have such a pressing sense of destiny. I can’t explain it. I know I’m meant to work here, near Endelle. I feel it like a geyser in my chest. So what I said earlier, about San Francisco Two and Paris, isn’t going to happen. I think you should know that, be prepared for that. I’m not leaving Phoenix Two.”</p><p>He nodded. He glanced around the stone foyer. The space seemed so cold—strong but cold. His gaze shot back to her. The description fit, but which one of them did it describe? Hell, maybe both of them.</p><p>“Where will you go?” Then it hit him that he thought of her here, in this house, with him, that these thoughts had been dogging him from the moment her earlier phone call had set him on this journey. “You can stay here as long as you like.”</p><p>Forever, rippled through his mind. He crossed his arms over his chest. Part of him wanted to make the offer, even to ask her not just to stay but to bond with him, take the ritual of thebreh-hedden as far as they could, which right now looked likeall the way.</p><p>Elise stared at his arms, now a protective interlacing over his ribs, his chest, his heart, his lungs, his breath, his soul, his everything. Her throat ached for no good reason. She wanted so much more from him, yet she wanted nothing.</p><p>Her gaze dropped to the beautiful stone floor. Her eyes traveled and traced patterns, slight dips and ridges, an entire geographical world beneath her black heels. The scent of him, toffee and male, permeated the foyer. Her nostrils flared and desire teased her everywhere.</p><p>This would remain unchanged between them, her desire, his, and back and forth. She drew in a breath and released a sigh. She wanted to move forward, but she wanted to go back as well. She wanted all those nights with him at the Blood and Bite returned to her, in full measure.</p><p>Yet she needed to be sensible more than anything. She couldn’t keep having sex with Gideon. Sex had bound them together for two years. Now she belonged to Second Earth just as he did and given her sense of destiny, her need to stay in Phoenix Two, she would no doubt see him from time to time. But he would be with other women, and she would have to learn to be dispassionate and objective with him, not to feel jealous or possessive.</p><p>Her heart hurt, like a fist had started punching at it. She didn’t understand why, not really. Sex was great, but just how much of a relationship could it sustain?</p><p>“I think I should sleep in your guest room tonight.” She finally lifted her gaze to his.</p><p>His mouth worked. He nodded. “That would be for the best.”</p><p>So his thoughts must be mirroring her own.</p><p>He turned and moved across the foyer to stand in front of what looked like a study. When he faced her, he gestured to his left. “This way.”</p><p>Once Gideon left the guest room, he made his way through the somewhat meandering home, into what he always thought of as his armory. More swords stood upright in lit glass cases along the north wall, a second ancient coat of arms hung over the huge gray stone mantel, and a gleaming suit of armor stood in sentinel readiness to the right of his fireplace.</p><p>He crossed to the bar near the armor and poured a Glenlivet and took a first big swallow. The burn felt good. He sat down in his favorite black leather chair and took another swallow. He repeated until some of the heaviness in his chest disappeared.</p><p>Better. Until he took a breath and a whiff of strawberry scent drove through his nose, straight into his brain, and sent desire once more through his veins and into his groin.</p><p>Damn. This would never change between them. Anytime he was around her, he knew he would catch her scent and want her just like the first, second, third, and hundredth time at the Blood and Bite.</p><p>If he could do it all over again, if he could go back to that first moment, he would have folded out of the club and never gone back because what he felt right now, without the ability to bust down her bedroom door and take her, was a kind of agony new to his Second Earth experience.</p><p>One thing for sure, he needed to get Elise out of this house by morning.</p><p>The strawberry scent grew stronger until finally he sat up, then stood up. The hairs on the nape of his neck rose.</p><p>Shit, something wasn’t right.</p><p>He folded straight into Elise’s room and the moment his feet touched the stone floor, he drew his sword into his hand.</p><p>Elise sat up in bed, her arms spread wide, her fingers splayed and tense. She stared at nothing, as though caught in the grip of what? Another vision.</p><p>Finally, she blinked. She looked at his face, then his sword, then she nodded, a quick stream of jerks. “Everything has changed. The timing of the vision of Rachel has changed. Gideon, the attack will take place in, oh, God, three minutes.”</p><p>“What?” he cried.</p><p>She continued, “It’s dark, the death vampires are on the way. Rachel and her friends are all sleeping in tents. You’re there. So is Duncan. Battling.”</p><p>His thoughts ran swiftly, the following actions swifter still. He called Duncan and told him to get his ass over to his Scottsdale Two house, master bedroom. He folded off his formal tunic and folded on flight battle gear.</p><p>He watched Elise change into her jeans and tennis shoes.</p><p>“You can’t go with us,” he said.</p><p>“Fuck that. I’m supposed to be there. I’m in the vision, too.”</p><p>Now how the hell was he supposed to argue with a Seer prophecy? “Fine. Whatever.”</p><p>A few seconds later, Duncan folded into the room. Gideon brought him up to speed.</p><p>Duncan looked at Elise. “How many death vamps?”</p><p>“Three.”</p><p>“So where are we headed?” Duncan asked.</p><p>Elise stared at both men. She took deep breaths. The clock shouted at her:Two minutes, thirteen seconds. Two minutes, twelve seconds.</p><p>She didn’t know what to do. She dove inward and pictured Rachel. She concentrated very hard and she felt a strong tugging sensation like she was being pulled in her direction, almost as though she could fold directly to her. She tried harder, focused on folding, but nothing happened.</p><p>“I can feel her presence, almost like I could fold to her, but I can’t.” She turned to Gideon. “Can you use your mind-link? Find out where she is? But tell her to make sure everyone stays inside their tents.”</p><p>“Hell, yeah.” He closed his eyes and a moment later his body twitched, a soft jerk. He nodded. His eyes grew pinched. “We’re coming,” he said aloud.</p><p>He opened his eyes. “Rachel’s in Northern California all right, redwood country, not far from the ocean. I told her to gather everyone in the most central tent and to have swords ready in case they need to do battle. A couple of them are former Militia Warriors.” He scowled. “Shit, I can feel her as well, but I can’t get to her.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Elise crossed the room to him. Maybe if they worked together on this, like they had while doing battle at the White Tanks Borderland. She lifted her hands in the direction of his face. “May I?”</p><p>One minute forty-five seconds, one minute-forty-four seconds ...</p><p>“Yes. Anything.”</p> <p>She placed her hands on his cheeks. A ripple of power flowed down her arms. He caught her hands and pressed them closer still. Her heart thrummed being this near to him. A sensation, so much like love, swept through her, threatening to carry her along on a swift current.</p><p>She reined in her thoughts and focused once more on the recent vision. The rocky riverbank, the fire now in glowing embers, the various tents, a cough in the night—all came into perfect view.</p><p>“I see them,” he said. “Okay. I’ve got it. Duncan, trace after us. Elise, we’re going now. You ready?”</p><p>“Absolutely.”</p><p>Gideon had his arm around Elise. “What’s our timing and where do you want us?”</p> <p>“Forty-nine seconds.”</p><p>Elise drew away from him and scanned the riverbed. Gideon shifted his gaze as well. Logs had jammed up on the far side of the river, probably creating a swimming hole.</p><p>Moonlight reflected off the water and created a swathe of light.</p><p>“Gideon, you and I remain here at the west end,” she whispered. “Duncan, you’ll be battling on the east side, close to the river. And one more thing. I need to download the battle for you, to stream the vision into your mind. Can you handle it?”</p><p>Gideon didn’t mean to, but he grabbed Elise around the waist and pulled her close. “No. You’re not doing that.”</p><p>Elise stared up at him. “Yes, Gideon, I am. What are you doing?”</p> <p>He squeezed his eyes shut. “Shit.” He released her. But the thought of her in Duncan’s head set every instinct to shouting at him.</p><p>Duncan narrowed his gaze at Gideon. “You gonna be okay with this?”</p><p>“No. But she’s got to do it. It’ll guarantee we get the job done fast so we can get the hell out of here. Elise, just do it.” He walked away. He paced as she drew close to Duncan and put her hands on his face. He barely restrained shouting into the night sky again. Duncan was a good friend, but Gideon hated anyone this close to his woman.</p><p>Except she wasn’t his woman.</p><p>So, shit. If she really did take up a job in Endelle’s government, his reality had just made itself known and he was not happy.</p><p>“Got it,” Duncan said.</p><p>Thank God Elise stepped away from him. She returned to Gideon. “What’s going on with you?”</p><p>“I don’t know. I just can’t bear you touching other men.”</p> <p>“Well, get over it.”</p><p>He ground his teeth. “I’m trying. I know the score. I know this is necessary.”</p><p>“Fine.”</p><p>“Fine.”</p><p>“Is Rachel all set?” Elise asked.</p><p>Gideon nodded. “She has everyone in the center tent, crouched, with swords in hand.”</p><p>“Ten seconds,” she whispered.</p><p>The three death vampires flew in formation, the lead with a wingman to his left and one to his right. Elise knew that occasionally women joined the ranks, but right now there were just three men, with the moon shimmering off their glossy black wings. She couldn’t really see much more as they breached the tops of the redwoods and began a gliding descent into the broad stretch of open space that encompassed the river and massive rocky riverbed.</p><p>A familiar dizziness began once more at the base of her neck and swept through her brain. The vision began and she let it flow, this time of Rachel dragged through the top of the tent by a death vampire in flight. There could be no question that the enemy had come to take Gideon’s sister away.</p><p>Ten, nine, eight ...</p><p>Elise moved into the shadows and crouched.</p><p>Duncan folded to the eastern side of the camp and brandished his sword to attract attention.</p><p>Gideon, to the west, used the same technique.</p><p>Moonlight glinted off the blades.</p><p>As if by signal, one vamp broke in Gideon’s direction, the other in Duncan’s. To Elise’s horror, the third headed straight for the central tent ... as though he knew, as though he had foreknowledge.</p><p>Elise didn’t hesitate. The moment each warrior engaged a death vampire and the terrible sliding sound of metal on metal struck the air, she began running in Rachel’s direction. She had no idea what she was going to do, but she ran.</p><p>Then she understood it all, that of course her vision was shared by other Second Earth Seers and that the enemy had acted on the first vision to reset the attempted abduction for this moment instead of tomorrow night. The most recent vision of Rachel unfolded right in front of her eyes as the death vampire, using his sword, started hacking at the tent structure. He worked almost surgically at it so that the walls kept collapsing on those inside. Finally, he made a last slice, reached through an opening, and caught an arm.</p><p>He flapped his wings and began moving backward.</p><p>Rachel appeared, flailing.</p><p>Elise was almost there.</p><p>Just as Rachel’s feet cleared the tent, the death vamp dropped her back onto the now lumpish, writhing canvas as those caught beneath trapped tried to escape.</p><p>He turned in Elise’s direction, his enormous black wings, flapping slowly and keeping him aloft just a foot or so above the ground. Then the wings began to retreat into his back.</p><p>“Hello, Ascender Jordan.”</p><p>The sight of Rachel safe on the tent relieved Elise so much that she failed to understand what was really going on until it was too late. The death vamp moved with preternatural speed and caught her arm in a tight grasp. She had just started to struggle when, in the very next moment, she was flying, not into the air, but through nether-space, that long, familiar glide ...</p><p>Chapter Eight</p><p>Gideon rose from the killing position, withdrew his blade from the death vampire’s chest, but only in time to watch Elise vanish. He glanced at Duncan.</p><p>His fellow Militia Warrior moved with unexpected speed, the result no doubt of having a preview of the battle, thanks to Elise. The death vamp had drawn in his wings and the pair fought over the uneven rocky ground. Was it his imagination, or was someone else in the ranks of the Thunder God Warriors experiencing emerging powers as well?</p><p>“How we doin’?” Gideon called out.</p><p>“Go! I’ve got this. Bring Elise back.”</p><p>“Tend to Rachel.”</p><p>“I will. Go.”</p><p>Gideon blurred his speed to the tent and found Elise’s trace, an iridescent light blue. He thought the thought, and whipped through nether-space.</p><p>When he arrived, ready to do battle, he froze at the sight of the death vampire holding Elise, her back to his front, a knife at her throat. A small lantern on the floor of what appeared to be a dark cavern provided the only light. “One step, warrior, and I’ll slit her throat.” He waved his knife around the cavern. “Then we’ll all just take turns drinking. Your choice.”</p><p>At least a dozen pretty-boys stood around, apparently ready to enjoy the show.</p><p>Gideon saw it all, the ruse, the trap, his death and hers.</p><p>As death vampires gripped him by the arms, he met her gaze and sent,I’m sorry. This whole thing was a setup.</p><p>I know.</p><p>In two hundred years, Gideon hadn’t known this kind of sudden despair, as though he had fallen into a hole that had no end. He expected his death to be swift, for a blade to simply slide through some vital part of his body, perhaps even through his neck, but no such horror occurred.</p><p>Instead, rough hands pushed him to his knees, bound his hands behind his back, then did the same to his feet, joining both with a rope.</p><p>The death vamp used the point of his blade and pierced Elise’s throat, just deep enough. Her small cry pierced Gideon’s heart. He leaned down and licked the flow of blood, then turned to look at Gideon.</p><p>“She tastes of power. When I drink her to death, my friend, my power will grow, then we’ll see what kind of war can be waged.”</p><p>Gideon saw red, a deep crimson sheen over his eyes. He pulled on the ropes, but whoever had bound him knew a thing or two about fashioning knots.</p><p>The death vamp leaned close to Elise. “Did you know one of the vampires he killed in a recent foray was a woman?”</p><p>“Yes.”</p><p>“Think less of him, Elise? Your woman-killer?”</p><p>“A death vampire, despite gender, still drinks people to death.”</p><p>“True. We wouldn’t want to discriminate, now would we? But don’t you want to know why I’ve brought you here?”</p><p>“I assumed it was because Greaves wants me dead, because of my level of power.”</p><p>“Greaves,” he snorted. He sounded disgusted. “What do I care about the Commander?”</p><p>Gideon watched Elise frown. She shifted slightly trying to look up at her captor. “Then if you aren’t in league with Greaves, what am I doing here?”</p><p>“You have to ask Warrior Gideon that question.”</p><p>She looked back at Gideon, still frowning.</p><p>Gideon shifted his gaze to the death vamp and enlightenment dawned. He’d never thought of death vampires as retaining any degree of their humanity. He had known plenty of monsters who did rage the earth, killing without conscience, hurting as many people as possible.</p><p>But there were always a few who had fallen into the lifestyle, perhaps unaware of the consequences, perhaps with a partial immunity to the full breadth of the addiction. He believed that was what he saw now as he met the death vampire’s gaze, in the deep shadows beneath his eyes, the crevices beside his mouth. He saw pain. A lot of pain.</p><p>“I killed the woman you loved,” Gideon said.</p><p>“Bravo. Give the warrior points for having at least some intelligence.” He pressed the point into Elise’s throat, broke skin, then dipped down to lick once more.</p><p>Gideon growled and strained at the ropes.</p><p>The death vamp laughed. “Elise, now you will learn something that all your precious warriors have failed to tell you. Did you know that many of us take wives and try to live out our lives as best we can? My wife wasn’t doing any harm. In fact, we were helping Mortal Earth by ridding it of criminal elements. We preyed on the drug and human traffickers in Mortal Earth Phoenix. My wife had been adamant about that. She was good for me. Now she’s gone and now, Gideon, I have what you love. But unlike you, I’m going to give you some time for a farewell, and I’m doing that because I loved my wife. She would have insisted on it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He waved all the other death vamps away, and like a dark fog, they slipped into the shadows and hidden pathways of the cavern and disappeared. When they were gone, he released Elise, giving her a shove so that she fell forward, hitting her knees hard.</p><p>She was on her feet almost as fast. She crossed the space between and lunged for Gideon, grabbing him, pressing herself up against him, wrapping her arms around his neck. “Fold us out of here,” she whispered.</p><p>He tried, but nothing happened. “Can’t. There’s some kind of blocking mechanism, which means that no one else can get in here either.”</p> <p>Elise drew back and looked at him, at his longish dark blond hair, messed up from the battle; at his dark blue eyes, which she loved so much; at his strong cheekbones and jawline; at his fierce expression.</p><p>There was no way out.</p><p>Reality struck hard that this might just be the last time she would ever look at Gideon. Funny how she had been thinking in terms of decades and even centuries, when in reality all she really had was this moment with him.</p><p>She sat back on her heels and stared at him. The past two years at the Blood and Bite flowed through her mind, the many times she had made love with him, how their time together often turned so beautifully wicked.</p><p>At the same moment, she recalled being under her bed as a child, lying on her back, plucking at the super-thin fabric that covered the bottom of the box spring, afraid of who she was, afraid of her emerging powers, alone in her struggles.</p> <p>She had always been alone. Until Gideon.</p><p>Did it all end here? Was Gideon to die because he’d cared for her enough to follow her trace into this cavern, this trap?</p><p>In all the time that she’d been with him, she’d never understood the most remarkable truth of all—that she loved him. She loved his ferocity and his attentiveness, she loved his dedication to his men, to the fighting Militia Warriors, she loved his devotion to his sister. She loved him.</p><p>Without knowing exactly how it had happened, for the first time in her life, she had fallen in love.Gideon, she sent, just a whisper through his mind. Then she put her lips to his and she kissed him.</p><p>For some reason, the thought that he was to die, that his wonderful service as a Thunder God Warrior was to end tonight, became utterly unacceptable. She drew back and ran her hand through his hair, savoring the sight of him, longing suddenly for all the years they wouldn’t have together.</p><p>She had been foolish, even reckless, with what had been given to her. She had denied what was right beneath her nose for the past two years, that by some miracle love had found her. Could a woman have ever been more obtuse?</p> <p>But what would have been different for her if she had known? She looked into his eyes and willed him to understand just how much she loved him.</p><p>As that awareness of love flowed through her, something in her heart opened up, opened wide. She drew in a deep breath, so very deep, as though understanding flowed with the air that moved into her lungs. She no longer thought just of herself. Her tidy orderly world had expanded and she thought of him, and what would be right for him, best for him.</p><p>Above all, she wanted him to live. If she had been more focused on that part of the equation, rather than blindly insistent on what she could do, he might not even be here right now, trapped. She had wanted to help and had acted hastily. What if she had paused for just a moment, thought a little harder about the situation, maybe even waited while the individual battles raged? Maybe things would be different.</p><p>All well and good, but what was she to do now?</p><p>She had one goal: to get him out of here, and as she considered the nature of the death vamp’s suffering, she knew what she had to do.</p><p>She kissed Gideon one last time. “I think I know a way out of this,” she whispered.</p><p>“How?”</p><p>“Just trust me.”</p> <p>“Elise, wait. What are you thinking?”</p><p>She rose to her feet. “Vampire,” she called out. “We’ve said our goodbyes.”</p><p>Gideon had a really bad feeling. He didn’t like the look in Elise’s eye, as though she’d made up her mind about something and it wasn’t good. She needed to fight. He needed to fight. But how? He struggled against his bonds, but they held.</p><p>The vampire returned, a swagger in his step, his dark eyes cold and merciless as flint. “So soon?”</p><p>Elise approached him. “I think you’ve erred.”</p><p>“Really. I doubt that.”</p><p>“Then tell me this, just how much are you suffering since your wife died?”</p><p>He grabbed both of her arms and shook her. “Don’t even speak of her, ascender.” His fangs emerged.</p><p>Gideon struggled harder. “Elise, don’t do this. Don’t fucking do this.”</p><p>She ignored him. She smiled up at the vampire. “Don’t you think my man’s suffering would be better than his death? Don’t you think he should suffer as you’re suffering now? What real retribution would there be in just taking his life?”</p><p>The death vampire gripped her arms harder, but a slow smile crossed his face. “You’re making some sense, ascender.”</p><p>“You can always come for him later. But for a little while, why not release him, drink me to death, then after he’s truly suffered, you can hunt him down and finish him off.”</p><p>“You want him to have a chance.”</p><p>She shrugged. “I think you’ve been wronged. I don’t regret my death. It was inevitable. I knew I had a lot of power. If you hadn’t done this, Greaves would have found a way to get rid of me.”</p><p>Gideon knew she was working for his release, and the bastard might just fall for it. But if he was thrown out of the cavern, he knew he’d never get back, never have a chance of saving her. He’d lose her forever. “Stop this, Elise. Stop it now. You don’t know what you’re doing, what you’re saying!” He kept shouting and when she didn’t even turn in his direction, he started yelling at the death vamp, telling him to release Elise, to take him instead, to let her go.</p><p>The death vamp smiled. “Looks like you’ve got your boyfriend all upset. Maybe you’ve got something here.”</p><p>Gideon didn’t stop shouting, but it did no good.</p><p>The death vamp issued the order. Before Gideon could blink, two of his comrades had him by his arms and he was flying through nether-space, the image of the death vamp sinking his fangs into Elise’s pale throat the last thing he saw.</p><p>When Gideon was back at the campsite, Duncan ran across the rocks toward him and started slicing through the bindings. He saw his sister, shaken but safe. Several ascenders were gathered in a knot around her.</p><p>Once freed from the ropes, Gideon immediately folded back to cavern, but the block that the death vamp had put on the pathway back to Elise returned him to the riverbank again and again.</p><p>He sank to his knees, not caring that the rocks were hard and something pierced his skin so that he bled. Duncan was there, but he waved him away. He wasn’t exactly aware that he shouted to the heavens and waved his fists and yes, he wept, tears streaming down his cheeks.</p><p>How had this happened? And how had he failed to prevent it? In his strenuous effort to keep Elise at arm’s length, he’d succeeded in making it impossible to work as a team with her. He was a man of war. He battled the enemy in teams all the time. He strategized, worked with his men, and they worked with him. They trained and plotted. He knew their minds. They knew his. Sometimes, in the heat of battle, it took only the smallest flicker of an eye to understand what one of his fellow warriors meant to do.</p><p>He should have done no less with Elise, engaged her, plotted with her, trained her. But his fear of getting too close had made it impossible to really know her or to work with her, so that in the end what he feared the most, her capture, her imminent death, had been exactly what he got.</p><p>And she’d done this for him. She had found a way to set him free, but he wasn’t free and never would be. He was bound to her as tightly as the moon to the earth. If she died now, how could he go on without her?</p><p>Finally, he stopped shouting at the heavens. He’d been a fool, insisting he didn’t want her in his life, didn’t want to care about her or worry about her, but right now, he would give his life to have that responsibility laid on him, to have his woman beside him, to hold her once more, to give himself to her without reservation.</p><p>Deep awareness dawned.</p><p>He loved her. He had tried so hard not to love her that in all those months at the Blood and Bite he’d failed to notice that he’d probably passed that point the first night he’d been with her. Everything made sense now, all the tumblers fell into place, his heart opened and he saw all his truths, that no man should live without love, no human, mortal or ascended, should deny himself love, war or no war.</p><p>He’d been foolish, utterly foolish, and that’s what had brought him here, his knees bloodied, his heart and mind anguished, his woman even now at the mercy of a grieving maniac. If he’d understood his heart even a little, he would not have taken such a risk tonight, with only Duncan as backup. He would have had a clearer view, his usual warrior’s view. He would have brought reinforcements, a large-scale force, and not relied exclusively on a vision that he knew damn well could be used equally by the enemy. His thoughts had been narrowed down, not broad enough. He saw that now.</p><p>He calmed his mind a little more and turned inward. He opened his heart then he realized he still had a mind-link with Elise. The link had been created just before the attack at the White Tanks so that he could receive her stream of battle images.</p><p>Maybe if he worked with her, together they could figure a way out of this. It took time to drain a person to death. She wouldn’t be gone yet.</p><p>He opened the link. If they were fated, as he now believed they were, then he might be able to communicate with her, even through the powerful block the death vamp had created.</p><p>Elise, he sent.Can you hear me?</p><p>Elise had tried for the past two minutes, as the monster at her neck took her blood, to reach out to Gideon telepathically, to find him, to tell him of her latest vision and what she knew, what the monster had failed to conceal from her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Just beyond his shoulder, she could see other death vampires arrive and leave. This had to be some sort of major Mortal Earth lair for the bloodsuckers.</p><p>Elise, can you hear me?</p><p>Gideon, her mind cried in return.There isn’t much time. I’m growing so very cold. But, from where you stood in the cavern, off to what would have been your left, is an arrival and departure point for the death vampires. I’ve been watching them come and go.</p> <p>Your trace is blocked.</p><p>I had a vision, Gideon, of you coming from that place, of following my trace almost to the end then seeking the opening. But don’t come alone.</p><p>I’ll find you.</p><p>So cold.</p><p>Stay alive.</p> <p>How do you stay alive when your blood is leaving your body so fast?</p><p>Gideon explained everything to Duncan, who in turn got on the com to Colonel Seriffe in order to bring several squads of Thunder God Warriors to the riverbed.</p><p>Elise had given him the start of a plan. Would it work? He wasn’t sure, but he would keep his mind open to her now, to working with her, to possibilities.</p><p>He returned to the tent, where he knew her trace still existed. He picked up the iridescent blue signature again. This time when he followed, he slowed down as he moved toward the end of the fold, and where the trace was blocked, at the junction between nether-space and real-space. Instead of pushing, he slid his perception to the left, to the area of the cavern Elise had suggested.</p><p>The opening appeared behind a thin veil of her crystal-blue trace signature. He suspected something about the nature of the block had dispersed the signature. Where the signature ended, so did the block.</p><p>He whisked himself back to Duncan, explained what they were to do and to follow his trace this time at the count of five with the entire contingent. “There are death vampires everywhere. Let Seriffe know he might want to send more warriors. We’ve hit a major lair on Mortal Earth.”</p> <p>“Done,” Duncan said, holding his warrior phone to his ear. “I’ve got Seriffe on the com. Count of five. Got it. Go.”</p><p>Gideon swept through the trace once more and found himself at the veiled opening. He thought the thought and punched through, landing squarely on his feet. He thought another thought and brought his sword into his hand.</p><p>“Elise,” he shouted.</p><p>I’m here, she sent.</p><p>Her voice in his head sounded ghost-like, almost gone. Shit.</p><p>Several death vampires smiled at him and advanced. About two seconds later, all those happy expressions died. Gideon could feel the arrival of wave after wave of Militia Warriors entering the cavern behind him.</p><p>Duncan and his men moved forward as Gideon turned to his right. The grief-stricken vamp held a very limp Elise in his arms. He also held a blade poised at her neck. He smiled at Gideon.</p><p>“Too late,” he said, his smile widening.</p> <p>“No,” Gideon shouted as he blurred his speed in her direction.</p><p>But when he arrived, though blood spurted in heavy pumps into the air, it wasn’t from Elise’s throat, but from the death vamp’s neck.</p><p>The bastard let her go and she crumpled to the stone floor. The death vamp put his hands to his own throat and began the healing process, backing away step by step. But Gideon did his duty, plunging the sword into his chest cavity, angling up and piercing his heart.</p><p>The death vampire looked surprised as he fell backward onto the stone floor. Gideon withdrew the sword and folded it back to his weapons locker in Scottsdale Two.</p><p>Elise lay on her side, struggling to sit up, but failing. He dipped down, lifted her into his arms and held her close. She relaxed in his arms.</p><p>“What happened?” he asked. “I saw the blade at your neck.”</p><p>She smiled. Her face was so white, her lips almost blue. “He was so pleased to see you that he forgot about me. I mustered my strength, pressed against his wrist, and pushed toward his neck. I was more successful than I believed possible because I didn’t realize that my ascension had increased my physical strength. There’s only one problem.”</p><p>“What’s that?”</p><p>“He took an awful lot of my blood.”</p><p>And with that, she passed out.</p><p>Elise woke up in a hospital, an IV hooked up to her arm and a bag of blood suspended on a nearby stand.</p><p>So they had these on Second Earth, too. Huh.</p><p>She couldn’t quite move her other arm. In fact, it was almost numb. Something really heavy was pressed against the length of her.</p><p>She turned and saw a shock of dark blond hair by her shoulder. She drew in a deep breath and the smell of toffee and man floated to her nostrils, teased her senses, then drifted on inside. All those familiar sensations returned, of sex and blood and Gideon, and his body.</p><p>She was dizzy and happy and alive.</p><p>She sighed and didn’t care that she couldn’t feel her fingers. They could all fall off so long as Gideon remained next to her like this.</p><p>Tears started to her eyes. She had survived and Gideon lived. What more did she need?</p><p>The nurse came in and met her gaze. “Oh, good. You’re awake. Feeling better?”</p><p>She thought about that for a moment. “I feel wonderful. What did you give me?”</p><p>She jerked her head toward Gideon then toward the bag of blood. “Sleeping Beauty here is a match. He donated. How does your neck feel? It was pretty torn up.”</p><p>She felt the gauze, pressing to the skin beneath. “I think it’s all healed. Is that possible?”</p><p>The nurse smiled. She had warm gray eyes. “You’re ascended. Everything’s possible. But let me have a look.” She moved to the side of the bed and peeled the gauze back. “It looks perfect. Not even a bruise. But I’m not surprised. One of our major healers was here, Horace. He worked on you for awhile as well.”</p><p>“If I don’t get the chance, please thank him for me.”</p><p>“I will.”</p><p>Elise glanced at Gideon. “So how much blood did he give me, anyway, to be this done up? Is he okay?”</p><p>He snorted in his sleep.</p><p>The nurse laughed. “You wouldn’t believe how much he fussed over you. Then he barked about how he needed to give you more blood and kept after the doctors so much that Colonel Seriffe finally ordered us to give him something to sleep.”</p><p>“You drugged him.”</p><p>The nurse nodded.</p><p>“Well, he can be pretty stubborn.”</p><p>The nurse snorted. “Understatement, but then I’ve never met a Militia Warrior who wasn’t.”</p><p>Elise thought back on all the events of the past twenty-four hours. But there was a gap she needed filled in. “Can you tell me if you know anything about what happened at the river? Maybe you overheard something, but did everyone make it out okay? Rachel, Duncan, and the others?”</p><p>The nurse drew close and put a hand on her shoulder. “They all made it out. The Colonel said when you came around I was to be sure and tell you. He knew you’d be worried. Rachel and Warrior Duncan were here for a few minutes, but you were still out cold.” She lowered her voice. “I heard it from reception that they got into a huge fight, right in front of Colonel Seriffe. Warrior Duncan is in big trouble. They used to date, you know, Duncan and Rachel. I lost the pool when they didn’t get married.”</p><p>Elise smiled. But her arm was pretty numb, so she slowly pulled the poor limb out from under Gideon and flexed her fingers a few times to get that awful tingling started, then she put her arm around his shoulders. He moved into her, and murmured something in his sleep about freedom, and snuggled close.</p><p>“You’ve got yourself a good man there.”</p><p>Elise met the nurse’s gaze and nodded. She smiled again but this time tears started to her eyes and wouldn’t stop. “I know. Believe me, I know.”</p><p>To his mind, she sent,Don’t worry. You’ll have your freedom.</p><p>Chapter Nine</p><p>When Gideon awoke, his face was smashed into a pillow. He blinked a few times, uncertain of where he was. The room was lit with a soft glow. The blinds on the windows showed black slits between.</p><p>Nighttime.</p><p>Where was he?</p><p>He felt groggy as hell.</p><p>He heard movement, as though someone behind him was moving from one part of the room, then back.</p><p>He turned over, stretched, and yawned. He blinked again. “Elise? You’re up? Christ, how long did I sleep that you’re up and moving around? This is the hospital, right?”</p><p>“Yes. I’ve been discharged. I was just waiting to say goodbye.”</p><p>At that he sat up, a little too fast. His head swam. He put his hand to his head. Then he remembered. “Seriffe ordered me to take those damn pills.”</p><p>She shrugged and a smile turned up one side of her mouth. “You were a little ... out of control.”</p><p>“No, I wasn’t.” He tried to remember. He had been insistent that she receive the best care. She’d looked so pale. “I thought you needed more blood.”</p><p>She chuckled. “Gideon, reports are that you yelled at the doctor for ten minutes. You called him an asshole. He finally called Seriffe.”</p><p>“I did all that? Jesus.”</p><p>“Yeah, but it was kinda sweet. You were looking out for me.”</p><p>He glanced at the suitcase on the stand by the door. “What are you doing?”</p><p>He watched her swallow and she didn’t exactly meet his gaze. “I thought I’d go to a hotel. I have a little money saved. I hear the Bredstone is one of the best in the world.”</p><p>The Bredstone was over by White Lake on the other side of the White Tanks. “That’s pretty far away.” He scowled. He could feel his brow forming a solid ridge.</p><p>He slipped his legs over the side of the bed and ran his hands through his hair, pushing it away from his face. He couldn’t imagine what he looked or smelled like. He’d been battling, then he’d come here. He’d had enough sense to change into jeans and a T-shirt, but yeah, he needed a shower.</p><p>He leaned over and did some floor-staring. He really didn’t want her to go to the hotel. He also didn’t want to crowd her. “So do you want to go to a hotel?” He swung his head to look at her. He felt like he was about sixteen and trying to gauge if his hoped-for girlfriend wanted a second date. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She did some floor-staring herself. She smoothed a pair of jeans over her arm. She shrugged again. “I think I should go.” She met his gaze. “Don’t you think I should go?”</p><p>“If you want to, of course.”</p><p>She opened her mouth, then closed it. She turned back to her suitcase and laid the jeans on top of a sizeable pile. He wasn’t sure if she’d be able to close it.</p> <p>“Where’d all the clothes come from?”</p><p>At that she faced him and smiled. “I’ve been practicing my folding skills. I brought all of this from my home in Surprise.”</p><p>“Nice,” he said.</p><p>“Thanks. I’m getting better.”</p><p>His heart started racing. Ah, shit. He had to talk to her. He had to take her home with him. He just had to.</p> <p>But man, doing this felt like he’d just set a flame-torch to every nerve on his body.</p><p>He took a few deep breaths. He stood up and steadied himself, then turned toward her. Even though he was dizzy, he crossed to her. He got a little too close because when she turned around, she bumped into him.</p><p>“Sorry.”</p><p>“Sorry.” She looked up at him and he froze. Could a woman be more beautiful than Elise? No. Never. Her glittering brown eyes, full lips, sculpted cheekbones.</p><p>When a wave of strawberry flowed over him, he staggered, righted himself, then caught her chin in his hand. “Aw, fuck, Elise. Won’t you come home with me? Won’t you stay with me? I want you there. Bad.” As declarations went, this one really sucked.</p><p>Elise’s eyes opened wide. “You want me to come home with you? Really?”</p> <p>Why so much disbelief? Oh, yeah, he’d been screaming about how much he didn’t want to be with her for the past twenty-four hours.</p><p>He gathered his courage and said, “I’m not the most eloquent man. I never will be. You should know that. But here it is. I’m in love with you, and not just that ratty little hey-sleep-with-me kind of love, but the deep kind, the kind that wants a forever and a life with you and kids, maybe, if any of that appeals to you. Shit. Does it?”</p><p>“Appeal to me?”</p><p>“Yeah. Can you see a life with me, even though it will probably be fucked up with a lot of danger, and death vampires, and horrible wounds, and all that shit?”</p><p>She moved to the side of the bed, sat down, put her hands over her face, and burst into tears. Jesus H. Christ. A woman crying. Acid on his skin.</p><p>But he summoned his courage once more and crossed to sit down on the bed beside her. He put his arm around her and she turned into him, planting her wet face against his right pec. Her body heaved up and down as she sobbed.</p><p>His heart sank to his feet, but he didn’t move. He just held her and let her get it out. Rachel sometimes did this. She said he was a jerk to think it was personal; women needed to cry on occasion. That’s all.</p><p>The problem in this case, however, was personal. He told the woman he loved that he loved her and now she was making his T-shirt all wet.</p> <p>When her body calmed down, and only a few ripples of sobs escaped her, he said the only thing he could think of. “I’m sorry. Right after the battle, I changed into this T-shirt and jeans and I must smell like hell.”</p><p>She lifted her gaze to him, all wet and slobbery, her nose swollen and red. She chuckled. “You smell like heaven to me, like toffee and Gideon, and everything I’ve come to love.”</p><p>Love? “You love me?”</p><p>“I don’t want to go to a hotel. I want to go home with you, and live with you, and sleep in your bed, and take you inside my body as many times a day or night as you want to be inside me, and I want to have babies with you, if that’s what you want. And I don’t care if you come home all cut up from fighting. I don’t give a fuck if my life gets all disorderly and chaotic, because I want you, Gideon. That’s what I know to be true. I want you, in my life, forever.”</p><p>Relief, like an ocean, flowed through him. He stood, lifted her up, gathered her into his arms and he kissed her, hard, full on the lips. He cupped her buttocks and dragged her against him. She bounced against his chest a few more times. He let her, though. He was learning.</p><p>But there was something he had to say to her, something that needed saying. He drew back. “There’s just one thing.”</p><p>She nodded in brisk jerks of her head. She folded a tissue into her hands and blew her nose. “What?”</p><p>“I want it all, Elise. No half measures. I want all of you. I want to go as far along the path of thebreh-hedden as our powers will allow and given that you can share your clairvoyant visions with me, I think we might be able to take it all the way.”</p><p>Elise looked at him from behind her tissues. Thebreh-hedden. He wanted to complete thebreh-hedden. She blew her nose again then lowered her hands to her lap. “So what we’re talking about is essentially a kind of mate-bonding.”</p><p>He nodded.</p><p>“I want to, but it’s all so overwhelming.” She glanced around the hospital room. “But maybe we should leave here first, go to your house. Then you can tell me what to expect.”</p><p>He smiled softly as he gathered her up once more in her arms. “What happened to all that embracing of chaos?”</p><p>She laughed, a very wet laugh. “Well, it doesn’t mean that I won’t try to lasso the tornado once in a while. Okay, maybe all the time. Order can be a good thing.”</p><p>“Yes, it can.”</p><p>He kissed her again, but it wasn’t a simple kiss. He dipped his tongue and explored the recesses of her mouth. He kissed her until she leaned against him and threw her arms around his neck. He kissed her until she was groaning softly, his hands exploring more and more of her body.</p><p>Only then did he pull back. “I guess we’d better get out of here.”</p><p>“Yeah, before anyone walks in and we make them go blind.”</p><p>He chuckled.</p><p>She glanced back at her suitcase. “Can you send that on ahead for me?”</p><p>He chuckled. “Sure.” A moment later, the suitcase vanished. Turning back to her he had to ask one last time, “Are you sure you’re ready to do this?”</p><p>Elise looked into beautiful blue eyes. Was she ready to do this? Was she ready to embrace so much chaos? Was she ready to love this man with all her heart?</p><p>“Yes,” she said, and she meant it.</p><p>She felt the vibration and closed her eyes. His arms were around her as they swished through nether-space. She felt her feet touch down and she smiled because she could feel the roughness of the stone, the floor of his foyer.</p><p>She opened her eyes and here she was, in his home.</p><p>All the inset lights in the timbered ceiling above came on, setting his castle-house in a soft glow.</p><p>Again, she looked up at him. “So thebreh-hedden. We’re really going to do this.”</p><p>He nodded.</p><p>She took a deep breath. “You’ll take my blood and I’ll take yours.”</p><p>His gaze shifted back to her mouth and a soft growl left his throat. He became one heavy roll of toffee and she staggered under the rich scent. “Yes.”</p><p>“And we would be connected low.”</p><p>His eyes fluttered as he nodded.</p><p>“Then you’ll be in my head and I’ll be in yours.”</p><p>“A back-and-forth flow while everything else is going on. We all thought it was a myth and mostly it’s relegated to those ascenders of Warrior of the Blood status, but ...”</p><p>“But you’re on the brink of becoming a Warrior of the Blood.”</p><p>He nodded. “I’ve been on the brink since I met you two years ago. I know that now.”</p><p>She smiled. “But I’ve never heard you say one generous word about the WhatBees.”</p><p>He shook his head and offered a half smile. “It’s a territorial thing and I’m sure I could adjust in time to a new calling. The WhatBees serve as we serve, so of course on a really basic level I approve of what they do. But my loyalty will always be to the Thunder God Warriors and I honestly hope I never have to leave militia service.</p><p>“But Elise, if we close the circuit, there’s something you have to understand. We’ll be a couple. I meanreallya couple. I’ve seen how thebreh-hedden impacted Warrior Kerrick. He goes Neanderthal if any other man gets too close to Alison. It’s a primal connection, a deep one. So, we’ll be ... a couple and I won’t be able to keep away from you.”</p><p>Fifty-nine, fifty-eight, fifty-seven ...</p><p>Another vision ...</p><p>She saw him naked in a room she didn’t recognize, a room made up partially of gray stone walls. Probably his bedroom. He was fully aroused.</p><p>Heaven.</p><p>She gasped, then shut her clairvoyant power down hard.</p><p>Some things needed to be experienced in the proper order, without foreknowledge. Yet somehow, the sudden vision ended the last of her fears. She was made for this, for Gideon and for this new world, in every possible way. The only thing she didn’t know was what would happen once they traveled the path of thebreh-hedden.</p><p>But like Endelle said,whatever.</p><p>She drew in a rough breath. “So where do we do this? Did you want to go back to the Blood and Bite where it all began?”</p><p>His smile was warm and grew very male and beautifully dark. “I want you inmy bed, Elise. In my bed.”</p><p>She sighed. “Then let’s do it.”</p><p>He took her hand and inclined his head toward a hallway to the left. “My bedroom’s this way.”</p><p>Her heart pounded but she nodded and let him lead her down the long hall, to a room that opened up on the left to another view of scattered lights and the valley stretched out below.</p><p>His bedroom.</p><p>The bed was big, flat, and had a wrought-iron headboard. She thought of the ropes he’d used on her earlier. She’d like to tie him up. Desire didn’t just flow through her, it cascaded in heavy sheets of sensation.</p><p>“Mmmm. Strawberries.”</p><p>“I could use ropes on this bed.” Did she actually say that aloud?</p><p>But he laughed and caught her up in his arms. “Oh, Elise, you are so my kind of woman.”</p><p>She laughed as well but the sound was a little tinny and her heart wouldn’t quiet down. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He drew back. “You’re nervous.”</p><p>She nodded, small, quick jerks of her chin. “I’ve never done this before.”</p><p>“Well, neither have I.”</p> <p>She shook her head and odd tears pooled in her eyes. “No, that’s not what I meant. I’m talking about love. I’ve never done real love before, committed love. Of course thebreh-hedden has me freaked out as well, but still ... love.”</p><p>He drew in a deep breath. “Me neither, but I’m willing to learn how to do it right. I want to love you, and learn to love you, battle with you when we need to work things out, and yeah, use some ropes on the bed, for as long as we have together. Just so you know, it could be a long time, as in an eternity.”</p><p>“Now you’re really freaking me out.”</p><p>He searched her eyes for a moment. “We can do this, Elise.”</p><p>Then he kissed her and Elise melted into his arms, no holding back, no letting her fears rise above her desire to be with him, really be with him. He deepened the kiss and drove his tongue inside, searching her out as he had from the first.</p> <p>Her heart swelled with affection, with desire and yes, with love. She slung her arm around his neck and held him close. His arms became a beautiful vise that nearly squeezed the breath from her, but it felt so good.</p><p>Let’s do this thing,he sent.</p><p>She pulled back and cradled his face in her hands.Yes,she sent, growing more and more at ease with telepathy.Let’s fuck the hell out of this thing.</p><p>He laughed and scooped her up in his arms. He turned her toward the bed and he must have thought the thought because she watched the covers move as if by magic, peeling back to finally sink to the floor at the foot of the bed.</p><p>She didn’t know what exactly was going to happen. She knew the mechanics but she also knew that thebreh-hedden went way beyond physical bonding. Preternatural power would be involved.</p><p>But as he laid her out on his bed, on the dark blue silk sheet, nearly the color of his eyes, she let it all go and focused only on him, only on him.</p> <p>Chapter Ten</p><p>Gideon looked into her eyes and saw that she was with him, really with him. Her straight black hair was once more fanned over the dark blue pillowcase and her brown eyes glittered in the dim light of the room. A need swelled in his chest and his breathing tightened. The sensation felt familiar. He sometimes felt this way before battle, a heavy, very male-laden state.</p><p>Some part of his brain started to shut down in a strange way. The rational part. His breathing grew rough and labored and faint grunts left his throat.</p><p>“Gideon, what is it?”</p><p>“Spread your legs.”</p><p>Her dark eyes flared, flames leapt, and when she spread for him, more of his brain shut down.</p><p>In its place was a very specific need that was more than just sexual. He needed her to know that he was her man, now and always.</p><p>He climbed between her legs and planted his knees. He settled his hands on either side of her shoulders. He leaned closed to her neck and sniffed, dragging her scent into his nose, more female this time, less strawberry. He licked and felt her shudder.</p> <p>Then he dipped low and he bit her shoulder, hard. Not too hard, but hard.</p><p>She cried out. “Gideon. What the hell?”</p><p>He drew back and once more looked into her eyes. He lowered his chin and out of his throat and mouth a deep growl emerged, something he’d never heard himself utter before.</p><p>He watched her neck arch then her back. “Oh, God, that sound. It’s different. What are you doing to me?”</p><p>He shifted to her opposite shoulder. He sniffed again. He licked her skin. He bit again, hard.</p><p>A long “Ooooh” came out of her mouth and her scent rolled now, a heavy strawberry-woman cloud that flooded him and took his mind deeper into an ancient primordial world.</p><p>He looked down at her breasts and he pawed them, rubbing over peaked nipples with one hand as he balanced himself on the bed with the other.</p><p>These are mine, he sent.</p><p>Gideon. Shit. Gideon.</p><p>He moved a little lower so that he could put his mouth above the left breast. He struck with his fangs and released the potion. She cried out and he took as much of her nipple and breast in his mouth as he could and he sucked ... hard. He looked up at her and saw the wild look in her eye.</p><p>She panted.Fire, she sent, the word a primal cry in his mind.</p><p>He left that position and moved to her other breast and once more he sank his fangs in and released the potion. Her back arched off the bed. He grabbed the same breast and suckled again, hard, firm, sweeping his tongue over and around the nipple and sucking again.Mine.</p><p>“Yes. Yes.” She panted and when he looked up at her, he saw tears in her eyes.</p><p>He shifted lower and sank his fangs just above her belly button. She was tender there and he knew it. He released the potion then tongued her navel until she was gasping and rising up off the bed.</p><p>He put a hand between her breasts and forced her down. He needed to keep her there, flat on her back. He didn’t know the why of it, but she wasn’t to move. This was where he needed her.</p><p>He moved lower and took as much of her clitoris in his mouth as he could and he sucked, which brought her up off the bed again, but using the same hand he pushed her back down and held her there while her body undulated under him. He’d latched on good, though, and he worked her with his mouth until her pants became cries and then screams as he brought her and brought her and brought her.</p><p>“The potions,” she shouted. “Oh, God.”</p><p>He released her and resumed the dominant position, over her and between her legs. She lay slack but her face was twisted as if with pain.</p><p>“More,” she whispered. “I ache everywhere. It’s moving low. So low.”</p><p>He was fully erect and he took her hand and put it to his cock. Her eyes flared wide again as she turned slightly to meet his gaze.</p><p>Yours, he sent.</p><p>Mine. She surrounded him with her hand and felt his entire length. He arched his back and closed his eyes. His breathing was harsh. She thumbed the tip and smoothed the wetness over the crown of him. His hips pumped into her hand again and again.</p><p>Give me what is mine,she sent.</p><p>A dam broke in his chest. He moved with lightning speed and breached her opening, pushing inside with hard grunts. Her hands were wild on his body, touching him, digging her nails into the muscles of his shoulders and arms, then sweeping her hands over his sensitive wing-locks.</p><p>She dug her nails once more into his biceps. Maybe she broke skin; he didn’t care. This was what he needed, his cock driving into her, pulling back, driving again, over and over, her body liquid, loose, wild, as she met him thrust for thrust, her hands now shifting low and sliding between so that he felt her fingers on his shaft.</p><p>He moved back and looked down at her hands that touched her and touched him. He moved faster until a new instinct broke over him and his fangs emerged.</p><p>“Yes,” she shouted at him, but the sound seemed both near yet far away at the same time.</p><p>She tilted her head to expose her neck. He lunged for her throat and with the skill of two centuries, tapped her vein and started sucking as his hips thrust and her body stilled so that he could take from her what he needed without tearing her apart.</p><p>He pulled hard at her throat. His body was slightly contorted so that he pushed into her at an angle. She whimpered now. He lifted his left arm and with his fingers pushed at her lips and stroked her gums.</p><p>That’s all it took. Her fangs emerged and just as he had lunged for her, she grabbed his wrist, sank in her fangs and sucked him down.</p><p>I’m going to take your mind. What were these words he used? Damn, he was in a Neanderthal space and couldn’t move out of it. But then again, Elise didn’t seem to be objecting ... at all.</p><p>Do it, she sent.</p><p>Gideon thrust hard with his hips, sucked long and deep with his mouth, then pushed his way into her mind, invading and taking possession of what was his.</p><p>Gideon. Oh, God. Gideon. Your mind in my mind. I’m going to come. She lost it and the beast of his soul was pleased. She grunted over his wrist and spasmed around his cock and he held his ground and kept a steady rhythm. He spun her orgasm out as far as he could, savoring every throaty cry that bounced off the beams of the ceiling and the stone of the walls.</p><p>She panted now, softly, but her legs worked over his, sliding and writhing. His woman needed more and he would give her more.</p><p>He dove deep within her mind, spreading out, seeking. He found the memories she had of her time with him at the Blood and Bite. Images cascaded over his mind until deep, approving grunts erupted out of his throat.</p><p>Gideon, I love you in here. You have me, you have me.</p><p>Her life was a banquet upon which to feed, to search, to savor, but when he saw one of her previous boyfriends, his current, dominating self grew anxious and angry.</p><p>She seemed to understand because she herded him, pushing his mind back to his time with her at the Blood and Bite.</p><p>Elise understood the dilemma and shoved her mind against Gideon’s to keep him from going too deep and seeing things that would only enrage him. From the moment he’d told her to spread her legs, she knew she was seeing a Second Earth phenomenon that related to powerful warriors and the ritual of thebreh-hedden. She hadn’t exactly been prepared for it but she trusted him, trusted his essential nature, not to act outside the bounds of what was right and wrong and damn, this was hot, so hot.</p><p>His blood down her throat was an elixir that kept her body at the boiling point, even though he’d brought her twice. Of course, the fact that the potions were still active and thrilling meant there was more to come.</p><p>If this was ascended life, give her more, a lot more.</p><p>Now move into my mind, he sent,and when you do, just be ready.</p><p>Ready for what,she asked, still sipping his blood, still savoring the thrust of his cock deep inside.</p><p>Anything. Even his voice in her head sounded lower and more guttural than usual, more beast than man, or would that be vampire?</p><p>But for just a moment, she stalled out, wondering if what they were about to do, taking thebreh-hedden to a limit not normally meant for Militia Warriors and novice ascenders, was really the wisest course. For this moment, she was under that bed, keeping her pain in tight, fearful of being hurt again by someone incapable of love, not by design but by circumstance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Gideon had kept himself locked up just as tight all these years, decades.</p><p>Gideon. How she loved him, but was love enough?</p><p>She followed him back to the threshold of her mind. She felt him move out of her head and a wash of loneliness swept through her. He had left her and she was alone. She needed him so very much. Yet still she hesitated. Should she take this last step? Could she?</p> <p>His hips slowed and his mind touched hers again.Do you love me, Elise?</p><p>Yes.</p><p>Do you trust me?</p><p>Yes, very much.</p><p>Then come with me. We can do this. Together, we can do this.</p> <p>She drew in a breath through her nose, swallowed his exquisite nectar, met his hips with a thrust of her own and with all the courage she could muster, she crossed into his mind.</p><p>Silence first, a surprise.</p><p>Then she met him, the flavor of who he was, his memories, his life. She fell into him, a long, beautiful fall that felt like a cool breeze on a warm day.</p><p>She knew him and she loved him and she trusted him.</p><p>He was a man of honor and character and worth.</p><p>She saw him with his Militia Warrior brothers and felt the love he carried for them all. She saw him interact with Colonel Seriffe, always the professional, always putting forward the best interests of his men.</p> <p>Then she saw him alone in this bedroom, at night, staring out the window, deep into the lights of the valley below. She felt the depth of his loneliness, a state he was unaware of, and in this moment she was grateful she’d crossed the barrier between them, for this was something she could soothe and fill, the depth of this need, unacknowledged for two centuries.</p><p>I love you, Gideon.</p><p>His draws on her neck ceased and she removed her fangs at the same time. He pulled back and looked at her. She was joined to him, mind to mind, and waiting, like standing on a precipice, high on a mountaintop and waiting to be swept away by the next errant wind.</p><p>The wind came, but instead of sweeping her off the mountain with Gideon, it caught her up in a rising spiral of sensation. She felt him, felt his body, felt his cock within her and the pleasure her body gave him.</p><p>“I can feel what it’s like for you to have me inside you.”</p><p>She nodded. “Ditto. It’s amazing.”</p><p>His hips moved again, faster and faster. She stayed within his mind; she felt his pleasure and hers.</p><p>When the orgasm came, it was doubled, tripled in intensity. She grabbed him around the neck with both arms and held on as he pumped into her. She could feel the sharp pleasure travel the length of his cock just as all that electric sensation, enhanced by the potions, pulled at her and brought her back arching.</p> <p>She screamed and cried out.</p><p>The orgasm poured through him. Then her. Then him. Then her. She experienced it all.</p><p>And just when she thought it might be over, a new wave erupted for her, for him, and he shouted. “Shit. My wings.”</p><p>Her hands found his back. All the apertures of his wing-locks were weeping, which wasn’t new, but this time his muscles, the flesh supporting the apertures, had thickened, a lot. She figured out what was happening, so she moved her hands low onto his buttocks and stayed with him.</p><p>“Just let it go,” she whispered.</p><p>He met her gaze. “You sure?”</p><p>She smiled. “Hell, yeah. Release your wings and let it all go.”</p><p>“Hold on then.”</p><p>His hips moved faster with each thrust. He arched away from her and grunts left his mouth. She felt his wings begin to glide through his wing-locks. She felt the pleasure of it and cried out all over again.</p><p>His wings appeared and he jerked into her and that one solid movement brought her screaming and writhing once more. He pumped into her and shouted a series of curses as he moved and writhed and twisted and came a second time.</p><p>The orgasm went on and on, a kind of preternatural ecstasy that wouldn’t stop. His hips thrust and she knew he was still coming and her own pleasure seemed to be a mile long. He slid his arms around her waist, then maneuvered as he drove into her so that one arm surrounded her buttocks and kept her pinned to him while the other supported her back, because in the next moment his wings, which overlapped the space above the bed, had her airborne.</p><p>Another orgasm barreled down on her so that she was screaming into the ceiling once more, the sensation streaking through her body. He bucked and she felt him come. She moved with him and against him, until finally he slowed and the last bit of her pleasure eased into that loose, contented sensation.</p><p>She could feel his wings from within his body and each gentle flap as he sustained them in the air. She let her arms dangle at her sides, hanging down. Her fingertips grazed the sheet below and she laughed. “I love this new world.”</p><p>At that, he met her gaze, but his eyes weren’t exactly focused.</p><p>“You okay in there?” she asked.</p><p>He nodded and his smile had the look of someone who had been to the shores of heaven and was struggling to come back.</p><p>She was one with him, in the most incredible sense. Her mind flowed through his and suddenly the vision was on her but this time there was no countdown, just the future images of Gideon. She let them flow into his mind so that he could see them at the same time.</p><p>In the vision, he matched swords against Kerrick in training, and his movements equaled Kerrick, in speed and skill.</p><p>The battling stopped and Kerrick wiped his forehead and said, “Good. You’ve almost got it. Let’s try it again.”</p><p>And on it went, the battle training, sword to sword, the shrill sound of metal grating and clanging against metal.</p><p>The images flew. Kerrick worked Gideon hard until both men were sweating and struggling for air.</p><p>When the training session ended, Thorne approached both men. He clapped Gideon on the shoulder, nodding. “I’ve seen enough. Your speed almost matches Kerrick’s now, which is really saying something because no one is as fast Kerrick. You’ve made it, warrior. I’m going to ask Endelle to bring you into the ranks of the Warriors of the Blood.”</p><p>The vision faded. Elise blinked at Gideon and he frowned at her. “You saw that, right?” she asked.</p><p>He nodded, his wings flapping. “It was amazing.” He held her tight against him. “But damn, I really don’t want to leave the Militia Warriors.”</p><p>“The vision didn’t show what happened after Thorne made his pronouncement. Maybe that’s not even the issue, only that soon you’ll have their level of ability.”</p><p>“Maybe,” he said. “But I do have one question; what’s the time frame? Do you know?”</p><p>Elise shook her head. “Sorry. Haven’t got a clue.”</p><p>“Could be a fluke.”</p><p>“You mean a visionary gaffe?”</p><p>He chuckled. “Hell if I know.”</p><p>She reached up to him and kissed him. “Looks like Endelle wasn’t kidding when she said you were close to Warrior of the Blood status.”</p><p>“I guess not.” Then he smiled and his eyes had a distinct glimmer. “You know what all this increased power means, right?”</p><p>She lifted one of her dangling arms, and touched his cheek. Because of the two years she’d spent talking with him at the Blood and Bite and because she’d just been inside his mind, she knew exactly what this meant to him, that which was more important to him than anything in the world. “You’ll be able to make a difference in the war.”</p><p>“Yes.” He made the word long, like it had never had so much value than it did right now.</p><p>The rhythm of his wings slowed as he lowered her back onto the bed. When she felt the firmness of the mattress beneath her, only then did he remove his arms from around her, but at about the same time he collapsed on top of her and she loved it.</p><p>His wings settled in a soothing blanket over the bed. Covered by an angel, except he wasn’t an angel, he was just a man, a warrior, and, yes, a vampire. She slid her arms around his neck and kissed him over his vein.</p><p>And now she was a vampire, too.</p><p>She savored his contentment and released a deep sigh. They were still connected deep within, a symbol of the greater connection of their minds and souls. Tears, unbidden, began to flow and after she’d swiped several away, he asked, “What’s wrong?”</p><p>He lifted up to look into her eyes, his now etched with concern. She felt the tightening of his abdominal muscles, the strain of his brow, all that he was feeling as he tensed.</p><p>“I never thought to know love like this. I’m amazed, just amazed.”</p><p>His abdominals relaxed, his brow eased, and the muscles of his cheeks stretched as he smiled. “Me, neither.”</p><p>And that was the truth, their shared truth.</p><p>He kissed her and his kiss held the promise of a life together, a long life together. And love. Yes, a bounty of love.</p><p>The next morning, the first thing Gideon did, well, thesecond thing Gideon did, was to take Elise to see the White Lake Resort Colony.</p><p>The waters were manmade from the vast underground rivers that traveled beneath the Metro Phoenix area. The colony was fifteen miles long and stretched the entire length of the White Tanks. On either side of the lake, over a hundred hotels and gardens served the globe as one of the finest collection of resorts in the world.</p><p>She was properly awed and happy. He was stunned at how closely connected to her he was, that he could feel her external sensations, the warmth of the wrought-iron railing beneath her hands as she gazed down into the replica of the Vancouver Island Butchart Gardens, the way the breeze tickled the backs of her arms, and that as she shifted to look at him, a shiver passed over her shoulders and down her back. The answering scent of strawberries told the rest of the story.</p><p>He leaned down and kissed her. “I’m so grateful for you, Elise.”</p><p>She smiled and gave him an answering kiss. She turned and pressed up against him, planting her hand on his chest as she liked to do, rubbing her fingers back and forth. He could feel the softness of his T-shirt against her fingertips.</p><p>She leaned her head against his shoulder and he surrounded her with his arms. “I can’t believe there are so many extraordinary gardens.”</p><p>“At least a hundred.”</p><p>“Then it will take us some time to explore them all.” She shifted against him so that she could see down into the garden. She gave a little cry. “Look, a little girl just mounted her wings.” But a voice came over the outdoor speaker system at almost the exact same moment. “There is no mounting of wings in the garden. Will the Twoling’s mother please discipline the child?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>When the mother began to give chase, Elise laughed. “I guess some things don’t change.”</p><p>“Nope.”</p><p>“I love this world,” she said with a sigh. “I feel as though I’ve come home. Really come home. I never thought in the course of my life that I would ever know such happiness.”</p> <p>He hugged her. “I feel the same way.”</p><p>He couldn’t believe that all this bounty had come to him, unexpected, unrequested. Before he had met Elise, there had been no deep-seated need that he’d been aware of, but truthfully, he must have been kidding himself. Now his heart was full and he couldn’t imagine a life without her. He’d become the moon to her earth and he would spend the rest of his life in constant motion around her, seeing to her, tending to her, keeping her safe, teaching her how to wield a sword, and maybe one day filling her belly with child.</p><p>“I hope we have children some day, Gideon.”</p><p>He kissed the side of her neck. He knew she wasn’t reading his mind. She didn’t have that kind of power to push past his shields without him knowing. But that she had been thinking the same thing, at the exact same moment, meant a lot to him. It was one more sign that their decision to complete thebreh-hedden had been the right one. “I would love to have a little Eliserunning around, mounting her wings when she wasn’t supposed to.”</p><p>“Or a little Gideon.”</p> <p>“Yes, a little Gideon.”</p><p>Once more he gave her a squeeze, his heart stretched to capacity, his world expanded beyond anything he had ever imagined for himself. He had loved the day of his ascension, because he belonged in this world. But now, with Elise pressed close to his heart, he knew the real gift of ascended life and it was love. Now and forever, it was love. </p>  </body></html>"]