["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bang bang bang. Fireworks exploded above her, the dazzling pastels blooming before her eyes in a furious cascade of sparks. As the hot coals showered down like burning rain, Laura jumped when one touched</p><p>her.</p><p>Bang bang bang! they exploded, the little pieces hitting her face, her legs, suddenly soft and caressing her like –</p><p>\"Laura!\" Bang bang bang. \"If I hadn't lost your key I would come in!\"</p> <p>Josie. Wha? Laura opened her eyes and fumbled for her phone. 7:22 a.m. She sat upright in horror.</p><p>\"Hang on!\" she shouted, stumbling to the door, unchaining and unlocking it. Josie stood there, petite and jaunty, peering around Laura.</p><p>\"So is he still here?\" she asked breathlessly. \"Is that why you didn't answer?\" Josie looked like a chihuahua in skinny jeans.</p><p>\"Is who still here?\" Laura yawned and stood on tiptoe, her muscles desperate for oxygen, blood rushing into her extremities and nearly giving her a calf cramp as she slowly went down to flat feet, rolling her shoulders and stretching her neck.</p><p>\"Whatever hot, eligible bachelor contacted you last night, because you are on a roll, Baby! One a day, right?\" She punched Laura lightly in the shoulder and stormed past her, banging and shuffling things as Laura stared at the back of her front door.</p> <p>For the briefest of seconds she ran a frantic mental check – had she gone out last night? – and then cursed herself. This was getting out of hand. No, last night she had stayed home and finished up some quarterly reports, watched a few episodes of Mad Men, and gone to bed early. Apparently, she'd needed the sleep. And, apparently, she had forgotten to set her alarm. Now she would be late for work, though she knew her boss wouldn't mind. Last night she had clocked an extra three hours; flex time and a salaried position made it easier to go in a bit late this morning.</p><p>Josie didn't have that luxury. As a geriatric nurse, she needed to be on shift on time, every time. At least she only worked three shifts a week, though. Soon her rotation would take her to midnight shifts, which Josie hated. So did Laura; it was hard to get together when her best friend kept a schedule better suited for vampires.</p><p>\"I took a break from my busy fuckbuddy schedule,\" Laura yawned, stretching again. Her belly felt cold as her shirt hiked up, and when she looked down her braless breasts hung lower, off to the sides, like small,</p><p>smooth animals with the metabolism of a sloth. Josie had a chest like a boy's, if a boy had tight little breasts you could fit in a headphone cover. Mostly, they envied each others' figures, though Laura could never understand why Josie would want these boobs. At this rate, she'd need a wheelbarrow by the age of fifty. Or to marry a</p><p>good plastic surgeon. Or a billionaire.</p><p>A quick thought of Mike, then a more surprising flash of Dylan, hit her. She couldn't get over Dylan – didn't want to, really. Mike had called her last night. Asked her out again. This time to his cabin up on the mountain. Maybe they could make love without a million uninvited, biting guests. That would be a step up, Laura thought, as she absent-mindedly scratched her ass over her flannel pajamas. She needed some arnica for the bites and kept forgetting to buy some.</p> <p>\"Quit scratching yourself and come have some coffee!\" Josie called.</p><p>How did Josie know she was scratching? It's like the woman was part psychic. Or heard the scrit scrit scrit of fabric as she scratched. Or watched her reflection in the hallway mirror. Ah – that was it. She looked and</p><p>saw Josie's cheesy, overstretched grin as she held up a mug and took a sip.</p><p>\"Ahhhhh. Coffee tastes so much better at your house, Laura.\"</p><p>\"That's because it's free.\"</p><p>Josie sputtered and laughed. \"OK, you got me there.\"</p><p>Laura poured a cup of coffee and sat at her little kitchen table, taking deep breaths. \"What am I going to do, Josie? Mike asked me out on a date tonight.\"</p><p>\"What did you say?\"</p> <p>\"Yes, of course. I really like him.\" She took a sip. \"More than I want to.\"</p><p>\"What does that mean?\"</p><p>Laura said nothing, then started to explain, but thought the better of it. \"Nevermind.\"</p><p>\"You are stuck on Dylan, aren't you?\" Josie's tone was incredulous. \"Did you ever figure out who that woman was?\"</p><p>\"Nope.\"</p><p>\"And has he tried to reach you?\"</p><p>Laura blew air out her nose, laughing softly. \"I have 34 messages from him on the dating site.\"</p><p>\"Oh, he's playing it cool, isn't he?\" Josie laughed. Then she frowned. “But I thought you blocked him?”</p><p>“He created a new account.”</p><p>Josie made a low whistling sound of disbelief. “Day-um, Laura!”</p><p>Laura smiled wistfully. \"Yeah. I just can't go there, Josie. You know how much it hurt when I found out about Ryan...\" She had dated Ryan for the better part of a year. They'd shopped for engagement rings. He'd introduced her to his boss, went on double dates, and then one day she got an anonymous message on Facebook. A request to friend.</p><p>Someone with Ryan's last name.</p><p>His wife.</p><p>Funny how he had forgotten that detail.</p><p>Laura had a pretty simple morality: don't date people who file taxes with other people as a married couple. Her rule was easy to grasp. Too hard for Ryan, though.</p><p>And now she applied the same rule to Dylan: no dating people who were involved with other people.</p><p>\"If I'm going to be part of a threesome, Josie, it won't be as the invisible third.\"</p><p>\"Mmmmm, a man sandwich with Laura in the middle. And those two men...\" Josie licked her lips with great exaggeration.</p><p>Laura's hands reached out to shove Josie before she could think to stop herself. \"Cut it out!\" Her face burned, though, with the thought. Josie just cackled.</p><p>A threesome. Menage. She'd never done it. But she sure had thought about it. As her breath hitched with embarrassment and arousal she shifted in her seat, now painfully aware of the increased heat in her nether regions.</p><p>Regions that had seen more activity – and from more men – in three days than in two months.</p><p>\"Laura and Mike and Dylan, sitting in a tree – oh!\" Josie joked, skittering away so Laura couldn't punch her again. Shaking her head, Laura buried her face in her coffee to hide her expression from her friend, who was about a hair away from figuring out that Laura would welcome the menage.</p><p>It was all more than she could even acknowledge to herself, much less admit to her friend. There were lines in friendship. This was one of them. She couldn't take back the words if she blurted them out, and right now she was just too confused and tired to deal with the fallout from admitting what her heart really desired.</p><p>Besides, there was that pesky issue of Dylan's girlfriend. Funny, how that put a screeching halt to any sandwich fantasies.</p><p>At least she had Mike.</p><p>\"You still have Mike, though,\" Josie mused. \"Poor Laura. Have to settle for a guy who looks like something out of Asgard. Does he have a tongue like a god, too?\"</p><p>Laura threw the empty half-n-half container at Josie, who just chuckled as she stood and walked out the door, leaving Laura to get ready for a torturous day at work, the hours before seeing Mike stretching out like years.</p><p>As she dressed, though, she remembered her drive home from their last date. For some reason she still didn't understand, she'd started crying as soon as they'd gotten in their cars. At first, she'd almost jumped out of the seat and run after him, just needing something – more. More words? No. More sex? Ah – no.</p><p>Just more.</p><p>By the time she'd arrived home she had been fine, so whatever triggered the tears seemed to have settled and found its place inside her. Could sex with someone she'd only met a couple of days ago unleash emotions that strong?</p><p>Was it deeper than that? Her earring got stuck as she tried to shove the post through the ancient hole, the back of the earlobe grown over. A few layers of skin had closed up the back of the lobe and she worked to center the end of the post over the spot where the lump of scar tissue was thickest. Gritting her teeth, she forced the metal rod through, the hot sting of newly-pierced tissue evolving into a throb.</p><p>Her favorite pearl earring dangled nicely. Was it worth the pain?</p><p>Sure. For the sake of wearing something that complemented her perfectly.</p><p>Maybe Mike's the same, she thought. You had to date a lot of painful jerks before you found the one who complements you perfectly.</p><p>Hot tears filled her mouth and eyes.</p><p>Aha. Now she understood.</p><p>And yet Dylan – she closed her eyes and full drops poured out of her inner tear ducts and down her nostrils. An ache in her throat spread to her chest. Ignoring his messages had been agony. Sheer, unadulterated pain in the form of restraint.</p><p>She had held fast, though she had faltered only once. The (gorgeous, incredible, irresistible) idiot had gone and created a completely new online dating account to circumvent her blocking him! How stalkerish and weird and creepy and –</p><p>Flattering.</p><p>Charming.</p><p>Arousing.</p><p>She had almost – almost, achingly almost nearly so close – broken down and agreed to meet him for coffee, just to hear his side of the story – which she already knew. It was a cliché upon a cliché, right?</p><p>Holding fast, though, she had simply typed:</p><p>Please leave me alone.</p><p>And, like magic, he had.</p><p>The ache that his respect for her wishes created in her was so contradictory yet so pervasive it made her question her own sanity. Why was she so drawn to this guy? What was so special that she would override her own moral code for him?</p><p>Ah, but you didn't, her conscience reminded her.</p><p>Oh, how I want to, she retorted.</p><p>Dylan stared at the computer monitor, completely unsure and yet painfully, deeply certain of what he was reading. Mike and Laura? Mike was hitting on Laura at the online dating site? What? He scrolled through the history of the chat window and realized that – that the first chat took place the morning after his date with her.</p><p>Oof. His stomach twisted and his balls felt like lead. Stretching his neck and clearing his throat, he fought back a tearful rage. Ease up, Buddy. Last time you let your temper flare you had a $400 door to replace.</p><p>He'd been a bit confused when he woke up that morning and she had been gone. But he'd had plenty of encounters where that happened – yet he'd expected her to answer one of his phone calls or his texts. She had plenty of opportunities.</p><p>While he wasn't quite ready to stomp over to her house and hold a boom box over his head, with Peter Gabriel's In Your Eyes blasting from it, he was definitely in that uncomfortable zone where he expected to have a second date with her, anticipated it – really, frankly was excited by the prospect of it and had been stymied by her refusal to talk to him.</p><p>Mike had sniped her? This wasn't a rare baseball card on eBay, for fuck's sake.</p><p>Even though it had been less than twenty-four hours since he last saw her, and he knew he shouldn't be so eager, it stung. He had an inkling about why she was blowing him off now – some inkling. A 6'5” inkling.</p><p>According to the times on the chat window, it looked like within a few hours of leaving his bed, she was planning a date with – Mike?</p><p>Mike? Mild mannered, boring old Mike?</p><p>This didn't make any sense! Dylan was the one who went out and found someone for them. Dylan had found Jill, who had been their one and only. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jill.</p><p>He sighed, his shoulders slumping, and as he leaned forward, cradling his face in his hands, a wash of nostalgia, of mourning, of pain came over him. And this time he let it. Normally, he pushed it away, manned up and did what a lot of guys do – went for a run, watched the football game, ate too many wings, pumped iron. But right now he let his feelings sink in. Watching her die had been one of the most – no, the most difficult thing – Dylan had ever experienced. The helplessness had nearly killed him, too. Mike had just retreated into his own world. Running tens of miles, half marathons, day in and day out until his shoes wore out within weeks, until his feet blistered, until he put his body into a state of pain that let some of the agony in his heart leak out.</p><p>Dylan wasn't like that. Dylan had fought and fought, and fought, had argued with the doctors, had argued with Jill. Bargained with God and anyone who could help. Had tried to convince her to try all sorts of alternative therapies that he had read about on the Internet, from vitamin C to certain yoga positions to chelation – and while the doctors said none for it could hurt, none of it helped.</p><p>Jill had gently accepted her own fate after a valiant struggle; Dylan had never accepted it. Ever. Here he was, a year and a half after her death finding someone like Laura, hoping that maybe she could help to repair some of the scars that were still fresh from Jill's death.</p> <p>And then Mike goes and turns into a snake.</p><p>Why would he do this? This wasn't Mike's style at all. He wasn't the type to poach a girl. Mike was the beta. They joked about it. Dylan was the alpha and Mike was the beta and that was just the law of nature and how things worked between the two of them – between the three of them, with Jill. Jill had liked Mike's sensitive touchy-feelly, new-agey nature and she’d loved Dylan's arrogance.</p><p>Oh, that had hurt. She had called him arrogant all the time, as if his self-confidence didn't have a bedrock foundation for his firm grounding. Here he was a fire-fighter, a paramedic – built, a former model and he was arrogant? He could wave it away most of the time, but now he just chuckled to himself, thinking about the times she had put him in his place. Frankly, he had needed that, needed her steady, sardonic wit, her –</p><p>\"Oh, stop it Dylan. She's gone. Just stop it,\" he mumbled to himself. He looke,d up stared at the monitor again, and the nostalgia came to a screeching halt.</p><p>He narrowed his eyes.</p> <p>It was time for the alpha to put the beta in his place.</p><p>Whistling some Lady Gaga tune that he'd caught in the car on the long drive home from the mountain, Mike was feeling pretty pleased with himself. He had just proven that he, on his own, could catch the same woman Dylan could catch.</p><p>And boy, what a catch Laura was. Way more than he ever expected. She was absolutely, positively nothing like Jill. And yet, he had a feeling that if the two had met, Jill would have really liked her – and probably would have given her approval. Laura accepted the fact that he was quiet sometimes and he was able to sit in absolute silence with her, out in a field, staring at the mountain. The two of them could just coexist in peace together. You couldn't find that in many people. Very few, in fact.</p><p>Jill had been one of them. Dylan definitely wasn't, but he had other traits that made him worth being with, hard as it might be these days to remember them. As he pulled into his parking spot his mind was filled with nothing but plans to see Laura again. A niggling irritant scratched deep within his brain, though, ruining the absolute perfection of this new beginning.</p><p>Dylan.</p><p>He had to tell Dylan at some point and it wasn't going to go well. He and Dylan had been together since high school and he knew him backwards, forwards and upside-down. Even though Mike's intentions were pure, Dylan would view this as a threat, as a challenge, as some sort of – as Dylan put it – alpha-beta problem.</p> <p>Mike just rolled his eyes and ignored the alpha-beta crap because he knew that on the surface he looked like a beta. They weren't wolves, though, and this wasn't a pack; they were human beings who were complex and nuanced. And he could show Dylan, and himself, that he was capable of going out on his own and find a woman.</p><p>Well, okay, that wasn't quite fair. Dylan had found the woman. Fair enough – but he could go out on his own and test the waters. Make sure the woman was attracted to him on her own and not as part of some package with Dylan at the lead.</p><p>He had just done that today. Quite pleased with himself, that sense of pleasure faded, like a light switch being flipped off, the second he walked in the apartment and saw Dylan’s face.</p><p>\"You slept with her, didn't you?\" Dylan wasn't just pissed. Betrayal was too mild a word to describe his feelings. He was itching for a fight, his fingers clenching against his hot palms.</p><p>Mike walked through the door, a cheerful smile on his face, a loose, languid quality to his joints that made Dylan want to throw him against the wall and beat the ever-loving shit out of him for taking his woman.</p><p>Their woman.</p><p>Funny, how history seemed to repeat itself. Because this is exactly what had happened with Jill almost ten years ago when they'd all first met. Mike would deny it, but the reality was that Jill had been Dylan's girlfriend and Mike had been the interloper then. So, even though Dylan knew that they had this running joke, that he was the alpha and Mike was the beta. Mike was neither – he was really just a snake.</p><p>A snake Dylan couldn't live without.</p> <p>“You son of a bitch, you went and – you found Laura and you – the morning after my date with her, you contacted her and got her to go out with you!” He couldn't help but stammer, and the sputtering made him feel small and insignificant, reduced to babbling like a lovesick teen. Fury plumed in him, hot and fast, with a taste like blood.</p><p>Mike stopped dead in his tracks and shoved his hands in his pockets, staring ahead at Dylan, eyes boring into his.</p><p>“Yep.”</p><p>That enraged Dylan more than anything, because he knew at this point Mike would only give one-word answers. Like a robot, the man shut down and steeled himself, becoming an impenetrable fortress of quotidian bullshit.</p><p>“So you knew how important this date was, you knew that I was checking her out for us, not just for me, you jerk!” Dylan seethed now, his anger fueled by Mike's withdrawal. “So, why in the hell would you go behind my back and contact her? And a few hours after I slept with her!”</p><p>“I didn't know you slept with her!”</p><p>Dylan cocked his head, rolled his eyes, and made an Oh please! gesture. “Right, like any woman I wanna sleep with isn't going to sleep with me on the first date!”</p><p>Mike let out a puff of laughter. “Do you know how much you sound like a total douche? Like any woman I wanna sleep with is gonna to turn me down,” he mocked, his hands gesturing like Dylan's, chest puffed up and prancing around like a peacock. Animated, mocking Mike was way worse than Robot Mike.</p><p>Dylan could feel his heart rate zoom, and, he feared, his skin turn green as he morphed into something so angry he couldn't control it, a firefighter, billionaire Hulk.</p><p>And it was all aimed right at Mike.</p><p>“What you do or don't do on your dates, Dylan, is up to you.\" Mike replied. A cold wall, unreadable. Typical Mike.</p><p>“When you're poaching women that I find for us, it becomes my business, Mike!”</p><p>“I never asked you to go out and find women for us, Dylan!”</p><p>“Well, you never not asked me! It's been eighteen months. When are you gonna get over Jill?”</p><p>Mike pursed his lips, his nostrils flaring, the affable good guy now morphing into something that Dylan knew was under the surface. “I think I can ask you the same question, Dyl. When are you gonna get over Jill? When are you gonna get over this idea that there's some perfect woman out there for us. There isn't. There's a good woman for you and there's a good woman for me, but the perfect woman for us? That's...” Dipping his head and hiding his face, Mike's voice faded out as if it were too impossible to voice.</p><p>“Then why did you date Laura – why did you go after her? Doesn't make any sense Mike, what you're saying man.” Dylan's heart rate started to slowly drop. He knew where this was going and he knew that picking a fight with the man he loved was about the last thing on earth that he needed right now. And yet he couldn't help himself, because, son of a bitch, the guy had just gone and taken away the woman that he was trying to court for both of them.</p><p>“You wanna know the truth?” Mike ran a hand through his thick blonde hair and shook his head, smiled ruefully. “The real truth, Dylan?”</p><p>“No shit, Mike, of course I wanna know the truth. Don't lie to me. Oh, wait a minute. Hey – you already did!”</p><p>Mike rolled his eyes again. “The truth is, I wanted to prove that whatever woman you try to find for us is independently attracted to me. I'm sick and tired of getting your sloppy seconds.”</p><p>“Oh, so now Jill was sloppy seconds!”</p><p>“I did not say that!” Mike straightened up to his full height. Six feet, five inches. A wall of runner's muscle. Now the aggression was coming out, the anger was reaching the surface, and Dylan could watch it, but all he could do was respond to it, instinct taking over.</p><p>“I never said that about, Jill. But you know how that worked. I had – ”</p><p>“Dylan, you can't just go out and find some woman and throw her down at my feet like a table scrap and expect us to live in threesome harmony. You have to respect the fact that I need to care about her, too. I need to make sure that she cares about me as well.”</p><p>Dylan had known at the back of his mind that this was true. Of course it was true. Of course Mike should feel that whoever they shared was in love with him – in love with both of them but in love with him. Dylan knew it. Dylan had known from the moment he met Jill that she was head-over-heels in love with him and the other night with Laura he had felt something awfully close to that, maybe even the same as that, but he was holding back. Grief had a way of messing with him.</p><p>Now here stood Mike, pissed as hell at him. The two of them facing off, the anger tangible, so palpable he could almost lick its bicep.</p><p>And then suddenly, both men pulled back. Mike peered at him. “You know, there's only one way to find out where this is going.”</p><p>Dylan shook his head. “She won't answer my texts. She won't answer my phone calls. She won't – it’s like, man, she just cut me out.”</p><p>Mike frowned. “That does not square with the woman I met. Laura's warm, she's intelligent, she's eager to find someone to connect with to develop a relationship with.” As Mike continued, Dylan screwed up his face, a bit jealous that Mike got that much out of her whereas Dylan had had more of a surface level experience. More entertainment than emotion.</p><p>“Dylan – you listening to me?”</p><p>“Yeah, sorry. My mind just wandered.”</p><p>“What the hell are we supposed to do about this mess now?” Mike asked.</p><p>Dylan threw his hands up in the air and made a sputtering sound. “Hell if I know. Then again I'm not so sure we have a situation if she keeps ignoring me.” He reached his hand out to shake Mike's. Mike gave him a confused look but grasped his hand. “Then,” said Dylan dramatically “the better man won!”</p><p>Mike screwed up his face in a grimace. “That's not how this is supposed to work.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No. I know. That's not how it's supposed to work,” Dylan answered, “but what am I supposed to do? She won't let me even say a word.”</p><p>“I think you should go find her.”</p><p>“Find her where?”</p><p>“You know where she works, right? You even know the floor. Can't be that hard. You know her name. You know what she looks like. You may not be the brightest bulb on the string, but...”</p> <p>“Hey!”</p><p>“It's not hard to find her. Go after her, Dylan. Maybe that's exactly what she's looking for.”</p><p>“Why would she want me to chase her when she's cutting off all contact with me, or at least not answering anything? I mean 34 messages is pretty...”</p><p>“You sent her 34 messages?” He knew it, but the reality hit him, hard, in this moment, with adrenaline making his veins feel like balloons, the steady throb of blood rushing through him like the beat at a Blue Man Group concert. “Jesus, Dylan, are you nuts?”</p><p>“What? I was impatient!”</p> <p>“If I were Laura and some guy sent me 34 messages through an online dating site after our first date, I'd run away screaming, too! And I'm a guy.”</p><p>Dylan laughed ruefully. “Alright, you've made a good point. I just, you know...”</p><p>“So how many texts did you send her?”</p><p>“Just three.”</p><p>“Three?”</p><p>“Yeah, and I left a couple...a few...okay.” Faltering, he confessed. “Six voicemails.”</p> <p>“Oh, God. Really? You're worried that I'm blowing this for us? How about you? Come on, Dylan. It's one thing to be the alpha, it's another to be the nutso!”</p><p>“Hey!” Mike was right. He'd gone overboard. “So, you're saying the only way to make this right...?”</p><p>“Yep, go find her.”</p><p>“Don't you think, if I would have scared you off from all the messages and texts, and phone calls, and voicemails, then won't showing up at her place of employment pretty much guarantee me a visit with the cops?”</p><p>“Well, it all depends on how you present yourself.”</p><p>“What do you mean?”</p><p>“Go there with flowers and a latte, make it a double with some vanilla, and you may have a chance.”</p><p>“How do you know how she likes her coffee?”</p> <p>Mike grinned.</p><p>“Ahhh, geez. You spent more time with her than I did, didn't you?”</p><p>“After our date, we ended it with a nightcap. She got hers decaf but I'd imagine that during the day she drinks it straight up. Go find some coffee shop, get her a double latte with...”</p><p>“With vanilla?”</p><p>“...with vanilla. And show up with a dozen roses and see what happens next. Just don't go all Richard Gere and do the Officer and a Gentleman thing.”</p><p>“Well, I am a firefighter. I'm used to carrying people up and down stairs and across places.”</p><p>“Yeah, I know. You are used to carrying people.”</p><p>A silence hung between them.</p><p>“But you weren't gonna let me do that this time were you?” Dylan asked Mike. They stared off at a stand off.</p><p>“Just go see her. See if you can fix this.”</p><p>“But what about...us, the three of us?”</p><p>“I don't know. That's a good question.”</p><p>Nostrils flaring, Mike's answer pissed him off. Dylan puffed up and got closer, in Mike's personal space, his own boundaries barely drawn. “I don't want to go see her till we've – until you and I have settled that.”</p><p>“Fine. So what are we doing here?”</p><p>“Um...”</p><p>Neither man knew what to say.</p><p>Mike's eyes lit up. “I have an idea, but it's really out there.”</p><p>“How out there?”</p><p>“Way out there! It's kind of a long shot. I...I don't know.”</p><p>“Spit it out.”</p><p>“Tell you what, you go and talk to Laura and see if you can convince her to date you again. Don't bring me up, don't talk about us. Don't talk about our...you know...relationship.”</p><p>“Our threesome.” The men spoke in unison.</p><p>“Okay,” Dylan said “Fair enough.”</p><p>“Just get the lines of communication open and get her to have a date with you. Not tonight. Tomorrow night.”</p><p>Dylan scrunched his face up. “Why?”</p><p>Mike smiled “Because I have a plan.”</p><p>The idea hit Dylan as the elevator dinged and the doors opened on the thirty-second floor of Stohlman Industries. He was holding a giant vase filled with eighteen red and pink roses sprinkled with baby's breath and was carrying a double latte with vanilla as well. He could pretend to be the deliveryman – that's how he'd get access to her.</p><p>The receptionist made it easy. “Hey there,” he said, grinning madly. “I'm looking for Laura.” Pretending to fumble with the card to read her name, he shot the woman his conspirator's grin. She smiled back, leaning forward on her desk.</p><p>“Last name?” He paused. Let his smile deepen enough for the dimples to show. Flirting with receptionists was one of his finest arts; helped him with fire investigations. As her face changed from all business to wishful pleasure, Dylan knew that he was about to get access to Laura in two seconds.</p><p>“Michaels.”</p><p>Her eyes widened. Somewhere in her twenties, she was exactly the kind of woman people assumed were his type. Long, silky brown hair. Big eyes. Great cheekbones. A v-neck top that showed everything but her belly button. If he wanted to, he could take her out for lunch and have a nooner with her in her car. Or a spare office.</p><p>Fucking a receptionist, though, wasn't part of the plan. It also wasn't part of Dylan's heart. Dead to the idea, he only had room for Laura right now. The receptionist perked up, tilting her head and brushing her hair forward, over her clavicle. “Oh, yeah, Laura! What beautiful flowers. I'm Debbie.”</p><p>He nodded. “Dylan.” Her eyebrows arched as she looked him up and down, apprising him like a piece of meat. Oh, boy. Being hit on like this didn't surprise him.</p><p>Having zero internal response did.</p><p>“Yeah, I need to deliver them. You know the drill.” He leaned on the desk, peering into her eyes. Play it up, man, if it could get him what he wanted. “Somebody must really appreciate her.” He eyed the flowers; the spread was gorgeous. The receptionist's could be, too, and from her body language it was clear he could dabble in it at his discretion. “So, can you tell me where her office is?”</p><p>“Oh, oh no, you can just leave those here. She's...I don't want to disturb her right now.” A look of fake sympathy washed over her face as she created a reason to wave him closer. He obliged, his nose inches from her as she whispered, “She...she actually...well, I'm kind of glad to see the flowers here because she seemed a little upset this morning and we managed to pry it out of her that she was having some man problems.”</p><p>“Oh, gotcha.” He ran a hand through his thick hair, drawing attention to his face, posing just a little. One of his model poses that he knew would show off his biceps. Debbie practically ate him with her eyes. “Oh, man, I hate guys like that.” Dylan shook his head. “Just, you know...it makes me want to be a better man. Flowers don't solve everything. You can't be a dick and expect a few roses to fix it all.”</p><p>Ding. That seemed to get her, and now all he had to do was go in for the kill. “You know, if she's had that rough a time, I think it would be better if I just brought these in and delivered them myself and that way, you know, give her a little extra perk up to a crappy day.”</p><p>He wasn't even making any sense at this point, but it didn't matter; he could have been reciting the Pledge of Allegiance for all Debbie the Receptionist seemed to care. She was practically drooling. “Yeah, sure. Room 311,” she said, pointing vaguely down a hallway.</p><p>“Thanks so much, Hon,” he answered. Following her directions, knowing that if he turned back around her eyeballs would be glued to his ass, he sought out room 311. Down a corridor, past the coffee machine, past the bathroom, and then...whoa! Some tiny little interior office. Poor Laura didn't even have a window. Maybe being a business analyst wasn't as glamorous as he'd thought. He knocked softly.</p><p>“Just a minute,” shouted the voice from the other side. Yup, that was her. This was going to be one wild surprise. Steeling himself, he arranged the latte in one hand and the flowers in the other, trying to decide whether to smile or not. Too cheesy? When she opened the door, her expression was not quite what he expected. He thought he might see surprise. He thought he might even see fear.</p><p>Disgust had never occurred to him.</p><p>“Dylan, what are you doing here?” She glanced around the hallway as if his mere presence were something she wanted to hide from others.</p><p>“I'm delivering roses from an admirer,” he said, piling on more charm, hoping this was going to take.</p><p>“Really? Aren't they better suited for your girlfriend?”</p><p>Where was that one coming from? “My girlfriend? What girlfriend?” he asked.</p><p>Someone at the copier a couple of offices down paused and craned their neck, their ear perked, catching whatever wave of gossip they could grab from the conversation he and Laura were having right here in the hall and he took that as a cue.</p><p>Nodding toward the person he said “Do you really want to have this conversation out here?”</p><p>Her face changed. She glanced over. “No, I don't.” Ice Queen voice. If she could be any colder she'd be a glacial shelf in the Arctic. Ouch.</p><p>“Please, let me come in and let's talk, 'cause I don't have a girlfriend and I don't know what you're talking about!”</p><p>She frowned, seeming to consider her options. Finally, she reached for the flowers, grabbed the latte with a yank, turned around and left the door open. He took that as an opportunity, stepped through and closed the door. She set the flowers on a filing cabinet and took a swig of the coffee.</p><p>The room was the most boring office he'd seen – and he was a firefighter, so he'd seen his share. At least the fluorescent lights didn't blink on and off like crazy and trigger eye tics. Everything was beige. The floor was beige. The walls were beige. Nope, change that. Putty, he had recently learned, was the official name of the most boring shade ever. He'd learned that because he'd had to do some requisition forms for some boring filing cabinets. Replacing some pre-World War II office equipment at the firehouse.</p><p>None of that mattered. What mattered was that the dozen and a half roses that he bought were by far the only color in the room other than Laura's perfect lime-green sweater covered by a nice double-breasted suit. She leaned back against the front of her desk, her butt forming beautiful curves against the edge, her arms crossed over her now-swelling breasts. He could tell that she was aroused just by the sight of him, but could also tell that her anger ran deep.</p><p>Where on earth had this come from? he wondered. At least he had some explanation for why she'd fled his bed at three in the morning. She thought he had a girlfriend? What the hell had Mike been telling her? Wait, that didn't make any sense, 'cause Mike swore up and down he hadn't said a word about them to her. So...what?</p><p>“Why do you think I have a girlfriend?” he asked.</p><p>She said, “Well, when your bedroom is plastered with pictures of someone who looks like she was part of the Olympic beach volleyball team, it's kinda hard to come to any other conclusion.” She gestured down at her belly and hips. “I, obviously, wasn't picked to play for that team.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“My bedroom pictures?” Huh? “Oh, my God!” he said, washing his face with his hand, rubbing his eye until he calmed himself down. “Jesus, Laura. That's not my girlfriend. That's Jill!”</p><p>She snorted. “So who's Jill? Your wife?”</p><p>“Jill is my...man, this is complicated.”</p><p>“Yeah...” she replied, drawing out the word. “It's always complicated. It was complicated with the last guy I dated. Seriously – he turned out to be married, too.”</p> <p>“Oh, so you think...oh, no, Laura, Laura, no!” Dylan shook his head. “Jill's dead. Jill's my...my...former lover.” The words came out like a mouthful of packing peanuts. How could he describe Jill? She was just Jill. Giving her a label reduced her to so much less than she had been.</p><p>“Dead?”</p><p>“Yeah. She died of cancer eighteen months ago.”</p><p>“And so you have pict – oh! Oh, oh, no, Dylan, I've made such a big mistake!” she cried. All of the anger drained out of her voice, her hushed tones triggering more hope than mourning in him.</p><p>“I didn't bring it up because it was just our first date, Laura,” Dylan explained. “But no, those are pictures of Jill. We – ” watch it, Dylan “I was with Jill for almost 10 years. And, she, well...she died. She has, she had non-Hodgkins lymphoma. And there was nothing the doctors could do after really trying everything. So, that's...that's my girlfriend, as you put it.”</p> <p>He stuffed his hands in his pockets and stared at the industrial carpet for a few seconds, then looked up at her. “Is that why you've been putting me off? Is that why you've been ignoring all of my messages, my texts, my voice mail – because you got up in the middle of the night and saw some pictures of this...of some woman and jumped to one hell of a conclusion?”</p><p>Oh, shit! Laura thought. She could see the anger forming in him and she couldn't blame him.</p><p>So all this time Laura had been blocking him, hiding from him – no, running away from him – and had fled straight into Mike's arms because she thought he had a wife or girlfriend? Damn it! Leaving Jill's pictures all over his bedroom had been just part of his life; he'd never even considered taking them down. Hadn't really noticed them as part of the scenery. They were just there.</p><p>It gave him pause now. Was he really over Jill? He knew Mike wasn't, had never even begun to heal, but Dylan assumed he was past the worst of it, and that Jill would just remain as a lingering “what if.” The three of them had started to talk about having kids the year before she was diagnosed. That potential had been shut down fast by chemotherapy and radiation and just getting through life day by day. Whatever remained of Jill inside him, though, was bigger than he had realized. If a bunch of pictures were that overwhelming and made Laura think he was a two-timer, then it was time to re-evaluate himself.</p><p>Laura's entire demeanor had changed from a defensive, angry countenance to one of apology and self-reproach. “Dylan, I don't know what to say. I am such an idiot! Idiot, idiot, idiot!” She lightly smacked her forehead with each repetition of the word. He smiled. Ah, how well he knew that feeling.</p><p>“I totally see where you made that leap, Laura.” He closed his eyes and inhaled, partly to figure out what to say next and partly because the room was so cold and corporate it was giving him the heeby-jeebies. “We haven't known each other for very long.” He took a step toward her. She didn't move back. Good, good. “And I can only imagine what it was like to wake up in the middle of the night in my bedroom.” Step. “Surrounded by pictures of Jill.” Step. Two more steps and he'd be within range to reach out and touch her.</p> <p>Gorgeous, long blonde hair pulled tightly back made her look like a cold career woman and less like the Laura he'd fallen for on their date. She seemed remote, but as her face melted into something he recognized – arousal and intrigue – his heart warmed and a little swagger grew in him. He had a chance here. As the seconds passed, the odds leaned more and more in his favor. He glanced at the door. A lock.</p><p>Good. They would need it.</p><p>She relaxed against her desk, letting her arms drop from across her chest, and casually unbuttoned her suit jacket. Her fingers fluttered to her mouth, a gesture of contemplation as she seemed to measure what she was about to say.</p><p>“I need to say something.” Here it comes. She's going to tell me about Mike. She pulled on her lower lip with her index finger, then touched a loose strand of hair, twirling it in her fingers, the gesture making her seem much younger and achingly vulnerable. “Guys like you don't go after women like me,” she said quietly.</p><p>“Oh, come on, Laura – that's not – ”</p><p>Palms facing out, she made him stop mid-word. “Let me say my piece.”</p><p>“Yes, ma'am.”</p><p>Her furrowed brow made him worried he'd mis-stepped. “You are a former model. Women pay thousands of dollars to go out on a bachelor auction date with you.”</p> <p>He choked. “You know that?”</p><p>“I Googled you. There are more images of you than there are links about you, Dylan.”</p><p>“Oh,” he said. Anything more would seem like he was bragging. The swagger grew. How about that? Nice.</p><p>Looking down, she stared pointedly at her belly, her legs, and used her hands to flow down her body. “So what does a guy who looks like you want with a woman who looks like me?”</p><p>“I – ”</p><p>“That night with you was unreal. Un-fucking-real. A little too unreal, you know? When I woke up and saw all those pictures of this surf-n-ski bunny all over you – ”</p><p>“Jill wasn't – ”</p><p>“I'm sure she was more than that. Really.” She cocked her head and seemed to have a sudden flash of insight, but whatever it was she kept it to herself. This conversation most definitely was not going where he'd thought it would, but it was fine. Laura was sharing. Her willingness to be this open, this real, reminded him of Jill. How lucky was he? And why hadn't other men seen the goodness in her? They – not Laura – were the true idiots.</p><p>“Laura – ”</p><p>“So I ran.” Tears filled her eyes. “It was too good to be true. In my mind, you were just another asshole, like Ryan.”</p><p>“Who's Ryan?”</p><p>“The last guy I dated before we met. He turned out to be married.”</p><p>“Ouch.”</p><p>“Yeah. See why I ran? Why I blocked you? I just – we're so different, and I assumed you just wanted a one-night stand. So I gave you one.”</p><p>Now, Dylan. Now. Two more steps and he was there. A hand was all he needed. A hand was all she could handle right now. The soft whisper of his skin against the tightly-woven wool of her jacket's arm sounded like a Greek chorus of chiding. It was good enough, though.</p><p>She glanced at his hand but didn't shake him off, didn't step away. Instead, she sighed, a tiny smile on her lips.</p><p>“Laura, it's not like that.”</p><p>“And when you pursued me! Wouldn't stop messaging me and texting me and calling and – Jesus, Dylan, you are persistent!” Her throaty laughter made him harden, his entire body seizing, breath hitching. If he wasn't careful he'd groan, and the sound might scare her off. Oh, how he ached for her.</p><p>Easy, boy. Don't overplay this.</p><p>Using every ounce of restraint he possessed, he leaned in toward her, his hand now stroking her forearm. “You're worth pursuing.”</p><p>Indecision flickered in her eyes. Or was it disbelief? Had it really only been a handful of days since their date? And in the meantime, she'd started dating Mike, had slept with Mike, and now here he was chasing after her. She wouldn't say a word about Mike; he knew that. And she didn't have to, because what was he to her right now? Some guy she'd ditched in his bed because she thought he was screwing with her (literally and figuratively) and she left to protect whatever vestige of integrity and self-respect she had deep inside.</p><p>Walking out of his apartment in the middle of the night was an act of courage for Laura; he could see that now. It was her way of stepping back from the last bastard who had dallied with her. Dating Mike was an even bigger step, and he felt a rush of mixed emotions overpower him, filling his mind and veins and heart. That she liked Mike gave him tremendous hope. That she was willing to talk to Dylan right now gave him more.</p><p>Getting her to accept them both and their unconventional relationship would take something greater, though. Something bold. Something that could cut to her core and transmit a very clear, very safe message that she was amazing and adorable and lovely and – everything they wanted.</p><p>Never one to back down from a challenge, and often the guy who took stupid risks, he felt one well up within him right now. Without thinking, he stepped back and put his hands on his hips. “I'm really angry right now.”</p><p>She blinked, her face shifting to confusion. “What?” Then the wall came down hard. “At me?”</p><p>“No. At all the assholes over the years who have mindfucked you and convinced you that you're somehow less than amazing.”</p><p>Breathe, Laura. Breathe. When Dylan had walked into her office with a batch of flowers she had nearly died on the spot. Died dead. The last person she ever expected to grace the halls of the thirty-second floor at the Stohlman Industries building, Dylan had sauntered in like he owned the place. That was him, though – he walked with such confidence, a natural fluidity and power that said I'm here.</p><p>He really was here right now.</p><p>Here. In front of her.</p><p>Oh, God. Mike.</p><p>How could she want both Dylan and Mike? In her dreams she wanted them both, alright – at the same time. Threesome fantasies had become all-pervasive, filling her mind during quarterly accounting meetings, code reviews, train rides and coffee runs and hell – even when she clipped her nails. She couldn't get these two out of her mind and had found herself not only enjoying Mike more and more, but pining away for Dylan.</p><p>Who she had written off as a two-timing douche.</p><p>Boy, had she been wrong. Egg on her face and all that. A dead girlfriend? Could she have made a worse call? The light pressure from his hand on her arm felt like a branding burn, his heat so strong it emanated, rays of warmth and fire pouring through the cloth and onto her eager skin. How could his touch – a simple gesture of compassion – fuel so much arousal and deep yearning within her?</p><p>Mike.</p><p>And what about Mike? They weren't exclusive, so she didn't have to feel guilty about these reactions to Dylan, yet she did feel tremendously conflicted, because it was Mike. Nice, amazing, contemplative, easygoing Mike. Sex with him had been mindblowing, too. She couldn't compare.</p><p>Why on earth was she thinking any of this in flashes of a second as Dylan's eyes undressed her right here, in this drab office, her body moistening and pooling into a heap of hormones and cravings under his soulful eye? That familiar itch between her legs made her nearly groan aloud, for she knew what it meant.</p><p>Torment.</p><p>She wanted Dylan. Now. On her desk and in her. As she glanced down she saw her sweater, pooched a bit at her belly, right where the waistband of her skirt rested. Did he mean it? She wasn't Jill. Would never be Jill. Couldn't be the chick with fifteen percent body fat and legs like a beach volleyball addict. Oh, sure, she could surf. And ski. And maybe run with an inhaler and an ambulance driving two miles an hour behind her. Give her an Olympic bar and some squat racks and she'd do fine with the guys, lifting in the weight room, but they'd outlift her easily. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Call it whatever you wanted – fluffy, zaftig, fat, big and beautiful, plus-sized, curvy, big girl – this was her, and she wasn't changing. Could Dylan (and Mike! Don't forget Mike!) really want her? The fat girl?</p><p>His eyes changed, softening with a dark intensity, his lips parting slightly, his body moving closer. Unmistakable body language. Yeah. He really was into her.</p><p>Right now she wanted him in her.</p><p>Mike?</p> <p>Choice A: tell Dylan that she was seeing someone else and ask him to give her a call so they could get together sometime later.</p><p>Choice B: fulfill yet another fantasy and have Dylan take her right here, right now, on her desk and behind a cheap lock on her office door, biting her hand to keep the sounds of ecstasy quiet enough to avoid drawing sidelong glances and nudges among the gossipers.</p><p>“Choice A,” she muttered. Be a good girl. Do the right thing. Don't be that woman.</p><p>“Hmmm?” he asked, the sound hoarse and airy, like he was struggling for control. Just like her. His eyes – oh, those eyes, so pure and focused and wanting her. His words were a balm that healed so many wounds, softened myriad scars, made hope spring eternal in her heaving bosoms which, right now, strained against her all-too-silky bra fabric and made her tense and frenzied, her clit hot for Dylan.</p><p>That hand on her arm slid up to her shoulder and she reached out, too, the fat girl with the firefighter/model, the swaggering man of muscle and bravado who swept her off her feet and gave her a taste of fun and confidence. Now his palm cupped her cheek, slid to loosen her hair, the thick waves pouring down her back and shoulders as he immersed both hands in the strands and brought his lips to hers.</p> <p>Choice B, after all, it seemed. Don't be that woman.</p><p>Might as well tell herself not to breathe. The press of his soft lips on hers made her inhale so deeply her breasts compressed against the silk of her bra, the sensation of puckered nipples and taut rib cage band so constricting she felt faint for a second, the room spinning as his tongue found hers, his hands sliding down her back, then to her waist. With a sudden push inward and up he lifted her off from the ground and onto the desk, the force of his strength unnerving yet making her grin. He could lift her?</p><p>He could lift her. With catlike reflexes he slid her jacket off her body and snaked her skirt up, over her thighs, one hand kneading the flesh of her hip like a hungry man grabbing for food.</p><p>“Oh, how I've missed you,” he whispered in her ear, his breath hot then cold as the spaces between words stood out in stark relief, the air filling the void of his sweet confession.</p><p>“I'm so sorry,” she answered, her voice thick with apology.</p><p>“No.” He pulled back and kissed her forehead, then her nose, and stared at her. “I am sorry. Sorry that it took this much determination to reach you. Sorry that so many men before me hurt you enough to make your walls necessary.”</p> <p>Mike. Don't think about Mike!</p><p>Gulp. “You're different, though – ”</p><p>“You couldn't know that. I had to show you. Let me show you more, Laura.” The brush of her hair against her neck, the rasp of his stubble against her cheek as he kissed her, the scent of him, a smoky musk with a hint of citrus – she was his. As he gently leaned her back on the desk, his muscled body over hers, she availed herself of his skin, palms sliding under his tucked-in shirt, the glorious heat of Dylan finally tangible, touchable, tasteable.</p><p>Taste him. As he hovered over her she reached up and found the softest spot on his neck, the skin fragile and tender, begging for her tongue. As the tip slid over the nape of his neck she felt him swallow, his Adam's apple moving slightly, air rushing through his windpipe in a gasp. He was salty and human, the little buds on her tongue feeling the hair follicles, half a day's growth peeking out. She breathed in his essence and then her legs parted, widening to accommodate his hips as a flash of his groin pressed against hers, his hard rod pushing against his pants.</p><p>She knew exactly how he felt right now. Reaching for his waist, she unbuckled his belt, unbuttoned the row of buttons on his fly (vintage Levi's? How Dylan) and slid his pants over those thick, hard hips, her palms cupping the curves of honed man as sinew and tendons, tight from working out and just plain old work, gave her a relief map of his body to touch and explore at her leisure.</p><p>Except right now, there was nothing leisurely about her touch. Molecules in motion increased the frequency of movement until her every pore buzzed, all expanses of skin at the ready, the brush of Dylan against her so exquisite she nearly screamed. His mouth teased and played with her lips and tongue as her hands took him in, his boxer briefs more than she wanted between them, yet just enough to keep him enmeshed and unleashed.</p><p>The vibration of his moan on her mouth unhinged her, his hands under her sweater, fingers memorizing her ribs, her waist, and her hands made quick work of making him nude, the inequity of their states of dress an added thrill. In seconds she could right herself, skirt down, sweater pulled straight and neat, panty status hidden by her clothing.</p><p>A naked firefighter, though, would be hard to hide if the mail clerk or the receptionist wandered in.</p> <p>She chuckled at the thought and he pulled back, questions in his eyes. “The door,” she whispered and he cocked one eyebrow.</p><p>“You want me,” he hissed, biting just hard enough on her earlobe to make her hips rise off the desk, “to lock it?”</p><p>“I want you to fuck me,” she growled, reaching for his tense rod.</p><p>“That's a given, my dear,” he whispered. “But first things first.” As he slid off her she actually whimpered, reluctantly letting go of his hot flesh, the sound so ludicrous she began to pant, sitting up as he walked away. Ah, but the view was worth the added seconds of wait. Dylan glided across the room like a man from two or three millennia past, his body so full and real she reveled in the pleasure of watching him move, the need to have him in her still urgent yet paused, her appreciation for the perfection of his form like an artist's eye for beauty.</p><p>Yet he wasn't perfect. Scattered scars spoke to a childhood and adolescence of outdoor exploration, and she gasped when he turned and she saw an enormous, jagged line running down his back. “What's that?” she asked as he quietly locked the door. “On your back.” The scar was an angry, foot-long keloid welt that seemed so incongruously positioned compared to the rest of him. It stretched a good three or four inches wide, like something had taken a bite out of him. No hair grew on it and the skin seemed alien, a pale white that stood out from the rest of his olive tone, as if it were abandoned by the rest of his body.</p><p>“A support beam fell on me during a fire,” he answered, leaning over her in seconds, fingers lacing through hers as he eased her back down from her now-seated position. “We can talk about that later. Right now I have a different fire to attend to.” One hand released her palm and slid between her legs, the touch maddening as his fingers reached her curls, then one slid to find her burning clitoris, the touch making her rasp his name.</p><p>“Oh, Dylan.” His hardness was there in seconds, her wet, ready pussy practically drawing him in. Her cheeks were flushed and she had a moment of unreality as she imaged the scene from above, Laura and naked Dylan going at it on her desk, next to the state of Wisconsin's quarterly reports, the thrum of her desktop computer the only soundtrack to cover their groans and gasps.</p><p>She was never more grateful to have been promoted out of the cubicle farm than right here. Right now. Right –</p><p>He entered her, slick and right and full and his hands roamed her breasts, mouth imprisoning her, hair splaying out across the desk calendar, covering half of July, her body tensed and relaxed at once, full of Dylan Dylan Dylan. What had been panting, earlier, returned, her body completely fixated on his touch, his taste, his fingers on her clit and in her hair, his lips devouring her, biceps tight as her hands explored his body, the dusting of dark hair that seemed to cover so much of him a braille of consummation.</p><p>Of reunion.</p><p>His thrusts were gentle but thorough, his ass gorgeous to touch, her palms making love to the twin cheeks, with dimples she could feel. Both knew they needed to be quick; Laura sensed it in his careful attention to her clit, how he knew exactly which skin to touch and when, bringing her higher, to a new level of unfolding and opening, waves of orgasm lining up at the ready as he called them forth.</p><p>A thin sheen of sweat covered his chest as he pulled back, eyes intent and staring at her, a brief flicker of self-consciousness making her smile shyly as he drove himself deeper into her.</p><p>She almost broke the moment with a nervous word but stopped herself. And then – oh, then – her back arched and his fingers and self were lifting, lifting her as all heat and fire and warmth and wetness zoomed between her legs, into her chest, her heart expanding and blossoming, his voice in her ear whispering, “Yes, come, come Laura, I'm – ”</p><p>Biting her hand was her only recourse as she twitched and jerked, the sheer force of her orgasm so strong that her body tried to escape it, couldn't run away, had to stay and let the pleasure envelop her, nerve endings straining to grow enough to accept all Dylan gave her now, his legs working for balance and purpose and then –</p><p>“Laura, oh, Laura,” he moaned, but she was too caught up in the layered power of her own body's response to reply. Her walls clenched around him, abs tightening in places so deep within her she didn't know she had, Dylan's own climax feeding off hers as her excitement increased, knowing he wanted her, that his body was in hers, that she did this to him.</p><p>Her.</p><p>Every nerve ending exploded as her hands balled into fists, then her fingers opened and she clawed at his shoulder as he worked to keep his thrusts even, their hips bucking and her ass slamming the desktop, face contorted and primal, her diaphragm nearly spasming, too, as she tried to stay silent, her orgasm cresting and then slowly, too slowly, fading out as Dylan, too, milked his own release.</p><p>As reality seeped back into her mind she took in the scene. Naked, sculpted man slumped over her spread-eagled body on her desk? Check. Spot on beige carpet where their juices leaked onto the floor? Check. Hair balled into a rat's nest at the back of her head from the friction of fucking on a veneer desk? Check. Aroma of sweat and sex in an office that normally smelled like cleanser and coffee? Check.</p><p>Mike. His name popped into her head as she kissed Dylan's sweet cheek, his breath still rushed as his own orgasm faded, his head resting against her neck.</p><p>Guilt? Check.</p><p>As she boarded the train for home, her skin still plastered with the scent of Dylan, she marveled at what had just happened a few hours ago. Laura's mind raced with the implications of what she had just done. Breaking her hard and fast rule about having sex at work had been one thing. (Though, she hedged to herself, he wasn't a coworker, so did it really count?). Sleeping with Dylan again was exhilarating. Astounding. Fiery. All the good parts she remembered with a hefty dose of danger, making the office sex some of the best she'd ever had.</p><p>Even better, though, had been Dylan. The revelation that those pictures had been of a girlfriend, alright – but a dead girlfriend, one he mourned for nearly two years after the fact – had been glorious. There was no hidden wife, no girlfriend lurking in the shadows, stealing part of his heart. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The ride on the train home helped her to downshift. She needed to think this through without Josie wisecracking in her ear and without that inner, doubting voice. Sitting on the half-empty train gave her space to think. All the other women her age were reading on their phones, texting, or deep into a Kindle device. Hmmm. She needed to get one of those for the ride. Maybe if she buried herself in a good book she could escape from the clusterfuck she'd created in her real life. Reading about other peoples' foibles and mistakes was so much easier than living through her own.</p><p>Leaning her head back against the glass, she sighed, the train's rumble sending her head bobbing forward slightly. Mike. Dylan. Mike. Dylan. Mike. Dylan. The rhythm of the car moving forward on the metal tracks turned the two words into a mantra.</p><p>Why couldn't she have both?</p><p>Both, both, both, both. Now that word looped through her mind to the beat of the train's motion. Both, both, both, both.</p> <p>Beep! Her phone told her she had a text. Reaching into her purse, she pulled it out. Battery was low, too. Making a mental note to charge it when she got home, she checked.</p><p>Mike. His text confirmed their date. He was taking her up to his cabin tomorrow night. You like pasta? he asked.</p><p>Who doesn't? she replied.</p><p>LOL he texted back. Can't wait to see you tomorrow.</p><p>You too, she replied.</p> <p>And then she immediately texted Josie, because right now? She needed her friend, some ice cream, and a lot of talk.</p><p>Sorry. Can't make it until morning.</p><p>Laura gawked at the screen. What? She needed Josie right now! Why couldn't the woman be free at the time Laura craved a good bitch and moan session?</p><p>Why can't you come over? I've got cherry chocolate chip ice cream, Laura texted.</p><p>Work. Extra shift. Money. Sorry. Tomorrow morning? Josie answered.</p><p>Fuck. The train skittered to a stop, then fwap! Laura was flung to the side. Too busy texting, she forgot to grab one of the stabilizer bars, and she nearly landed ass over tea kettle on the floor. A quick scramble out the wheezing doors and she was on her way home.</p> <p>Fine. No ice cream for you, Laura texted as she walked home, her heels clicking on the pavement. A balmy night, one that should be enjoyed outside, drinking margaritas at an outdoor table.</p><p>Instead, it was her, Netflix, and Mssrs. Ben and Jerry. Josie could suck it. OK, Josie could come over for coffee in the morning.</p><p>By the time she got home, stripped down into her jammies, and grabbed dinner (the pint had plenty of protein, right? And cherries counted as a fruit...), she found she was too tired to make it through the monologue on The Daily Show. Throwing the other half of the ice cream in the freezer, she padded into the bedroom, plopping on top of the covers. The clock read 7 p.m. A nap?</p><p>Sore legs pulled up against her belly as she curled into a ball. A nap....</p><p>“Slow down, slow down!” Josie held up her hands, displaying her nails of the week: little tiny campaign posters, alternating on her fingers, five for each Presidential candidate. It looked like a sea of red, white and blue had been vomited up onto her nail beds. What Laura had thought would be a nap turned into more than eleven hours of sleep. She felt like Rip Van Winkle, and this time, Josie made the coffee. Laura must have looked that zombified, because Josie never made the coffee.</p><p>Yet another morning talk with Josie. If she wanted to enjoy breakfast with someone, she wished it could be Dylan or Mike.</p><p>Or Dylan and Mike.</p><p>“So you're telling me Dylan brought you flowers, it turns out the girlfriend in the pictures is dead, and you fucked him. On your desk. At work. In the Beige Room of Pain.”</p> <p>“No, see it wasn't really like that – what? Beige room of what?”</p><p>Josie held up one finger. “Uh, uh, uh! I'm just establishing the facts here. Your office is where color goes to die. That's a fact. We'll get to the moral and ethical judgments next. But first: did Dylan, in fact, pose as a flower delivery man to sneak into your building at work today?”</p><p>“Yes.” Laura poured herself a cup of coffee and sat down. She was going to be late again.</p><p>“And did he then come into your office, and you told him that you knew he had a girlfriend or a wife?”</p><p>“Yes.”</p><p>“And he then informed you that the girlfriend was dead, has been dead for almost two years, and then you – fucked him on your desk?”</p><p>“Yes.”</p><p>“Okay, the facts are established.”</p><p>“Good. So I – ”</p><p>“Now: Are you out of your fucking mind?” Josie grabbed Laura's coffee mug and took a swig, arching one eyebrow and looking more like Stephen Colbert than she had any right to.</p><p>“What are you, a lawyer all of a sudden? You're a nurse. You work in an old folks home!”</p><p>“I don't work in an old folks home,” Josie sighed. “I do clinical research on geriatric patients.”</p><p>“Same difference.”</p><p>“No, it's not the same difference. Do you design Tylenol bottles for children?”</p><p>“What? No, I work in IT for a children's health insurance program!”</p><p>“See? Related – but not the same!” Josie finished Laura's coffee and slammed the mug down, but was considerate enough to get up, pour more, and slide it across the table to her.</p><p>“Oh, shut up. That's not what this is about. Why the hell are you grilling me? It's an interrogation, like I'm being cross-examined or something.”</p><p>“Because – you're – behaving – like – someone – who – has – lost – her – mind!”</p><p>“Why – are – you – talking – like – I – am – a – toddler?”</p><p>Josie snorted. “I don't know.”</p><p>Laura squinted at Josie. Stared her down. “You're just jealous because I've had more sex than you.”</p><p>“Well, duh! You slept with Dylan, and then a day later you slept with Mike.”</p><p>“No, a couple days later.”</p><p>“And then, like, a couple days later, you slept with Dylan.” Josie held up her hands and wiggled them, pursing her mouth in a silent “O.” “A couple days makes all the difference when you're fucking two guys at once.”</p><p>“Not both at once,” Laura jumped in. Her face burned. If only...</p><p>“So, Mike's next on your dance card...”</p><p>Laura sighed, “Can we just not do this right now, Josie? I'm confused and tired, and...”</p><p>“And you're probably kinda sore, huh?”</p><p>Laura grabbed a pot holder and threw it at Josie's head.</p><p>“Hey, you almost cracked one of my nails!” Josie made a great show of examining each talon.</p><p>“Well, it will match your cracked head. What kind of friend are you right now? You're supposed to be supportive!”</p><p>“I am being supportive. I support you getting your head out of your ass! What are you doing, Laura, sleeping with these two, on and off, on and off?”</p><p>Laura didn't have an answer. It was easier to just argue. “Because I – really like them. Both.”</p><p>Josie plopped down on the couch next to her. “Well, damn, girl, give your poor hoo-ha a little break here and there. It's not the Energizer Bunny!”</p><p>“Jea-lous,” Laura mocked.</p><p>“How much did Stohlman Industries pay you during the time that you were being serviced by the fake flower delivery dude?”</p><p>Laura laughed. “I don't know. It didn't last as long as you think it lasted.”</p><p>“Oh, I'm sure it didn't. Quickies at work never do.”</p><p>Laura punched Josie's shoulder. “How would you know?”</p><p>“Have you ever seen the on call room at a hospital? There are brothels in Bangkok that get less action.” Josie grabbed a clementine from the bowl of fruit on the table and pierced the sweet, loose skin with one of the same nails she'd nearly cracked when the limp pot holder had whacked her head. Laura opened her mouth to make a sarcastic comeback but couldn't.</p><p>Both.</p><p>If only there were a way she could have both.</p><p>“Too bad you can't have both.” Josie elbowed her in the ribs. Laura slid sideways, giving Josie an evil look. Had she read her mind? Had Laura said something she was thinking aloud? Was Josie baiting her to see if she could get a rise?</p><p>“Both?” Laura laughed lightly.</p><p>Shrug. “A girl can dream, right?”</p><p>A vision of her fantasies in the shower hit Laura, surreal and stifling and shaming.</p><p>“Some dreams are just a little too farfetched, Josie.”</p><p>Plunking the peel in the trash can, Josie spoke through a mouthful of juice wedges. “No such thing.”</p><p>“What?”</p><p>She swallowed, her voice clearer now. “No such thing. That's why they call them dreams. If they were supposed to be not farfetched, we'd call them plans.”</p><p>“When I said I had a plan, having you go to Laura's office and fuck her on her desk was most decidedly not part of the plan. Not.Part.Of.The.Plan.” Mike stretched his neck, turning it so hard that something popped. Twice. It felt good – he needed to release something other than his foot up Dylan's ass.</p><p>“Yeah. Uh, well, I always said I'm a 'pantser.'” At least Dylan had the decency to seem sheepish. Cocky and sheepish. How the hell did he pull that off?</p><p>“How about you try working on being a 'keep it in your pantser'?”</p><p>Dylan bit his lips and did an “Aw, shucks” gesture, staring at his toes and kicking the floor lightly. Good try, buddy. Like you're Opie or something. “I'm sorry, Mike. It really wasn't planned.”</p><p>“I know.” He softened a bit, knowing Dylan was telling the truth. He never lied; that was one part of their relationship that made sense.</p><p>Shoulders relaxing, Dylan perked up. “So the good news is that she likes me again!”</p><p>“The bad news is that she still has no idea what we really want from her.”</p><p>“And the billionaire thing.”</p><p>“Yep.” They sat in a stony silence, the weight of too many unresolved issues smothering them. Mike felt a sudden sadness, a depression out of nowhere. Dylan got Laura today, and he was genuinely glad, if conflicted.</p><p>Dylan bit his lips.</p><p>Mike could feel his eyes rolling hard in his head as he stared at Dylan, and finally he said, “Whatever. At least you're back in her good graces now, and maybe we can find our way through this one and not scare her off.” What Mike wanted to ask, and what he knew he couldn't ask, was Had Laura said anything about him? Because if she had, and still slept with Dylan, that meant one thing. And if she hadn't, and slept with him, that meant something else.</p><p>He wasn't sure what either option meant, just that it meant something.</p><p>Dylan was staring at him, head cocked, eyes slightly narrowed, his arms crossed over his chest, bunching up his t-shirt. “You want to know if she said anything about you, don't you?”</p><p>Shit. It was like the guy could read his mind! Then again, after ten years together, maybe he could sometimes. “Did she?”</p><p>“No.”</p><p>The silence that hung between them meant something too. Damn it. Mike knew it. But knew what? All this meaning and no clarity made him confused, overwhelmed, frustrated. Time for a run. This one might require a half marathon. “Hey man, I'm going to go do a half. Are you in?” Might as well invite him along.</p><p>“Thirteen miles? Are you crazy?” A loose thread on Dylan's t-shirt caught his attention and Dylan played with it, slowly twirling the thread tight, nice and taut, and then snapping it, removing it. He flicked it into the trash can. Then he leaned back against the kitchen counter and stared at Mike. “You're trying to pound the pain out of yourself.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“How's that any different from what you do? You just lift yourself into oblivion.”</p><p>“No, lifting is different. It builds strength. What you do just saps you.”</p><p>“Running centers me, it doesn't sap me!”</p><p>Dylan thought about that for a moment. “Aw, what the hell. I'll do five with you. But that's it, man. You are not talking me into doing thirteen.”</p> <p>“Yeah, well, far be it for me to ask you to say one thing and do another.”</p><p>The look on Dylan's face told Mike that the barb had hit its target. “Come on, Mike. Don't be like this!”</p><p>“Be like what?” Mike could feel himself stiffening, steel pouring into his body, making him tight, in control, immutable.</p><p>“Look,” said Dylan, “we're not competing here. We're not enemies here. We have the same goal, and the goal is to find somebody we can both love. Find somebody – ”</p><p>Mike interrupted him “To replace Jill?”</p> <p>Dylan let out a big breath of air. “I thought that's what we were doing...” he said, shaking his head.</p><p>Mike frowned. Where was he going with this?</p><p>“But it's not about that any more. It's about moving on. It's not about replacing Jill. It's about – ” Dylan paused, his eyebrows raised, his body relaxing. “It's about Laura. It's not about Jill, not any more.”</p><p>Just when he was starting to enjoy his self-righteous anger, Dylan had to go and get all reasonable and introspective. “All right, fair enough.” Mike held his hand out. “Truce?”</p><p>Dylan grabbed him and hugged him. “No need for a truce. There was never a battle.”</p><p>“Oooo, what kind of pasta is that? Spinach? Basil?” Laura marveled at the spread Mike was putting out for this meal. So much food! You would think they were having dinner for more than the two of them.</p> <p>“It's green.” He shrugged.</p><p>“Hold on! I'm mocked when I don't know what kind of wine the red stuff is, but you get a pass on green pasta?” She mock pouted. “No fair.” Silly and playful, Laura felt giddy. The giddiness drove out the guilt. Sort of. In many ways, this date with Mike was a test. Sleep with Dylan. Sleep with Mike. Sleep with Dylan at work, sleep with Mike tonight in this amazing cabin. Then everything would be fair and balanced.</p><p>What are you, Laura? Fox News?</p><p>He stirred the pasta, steam floating up in swirls like magic potion from a cauldron, his white cotton button-down tucked nicely into tan business pants. Shirt sleeves rolled up and the top two buttons undone, Mike looked a little too business casual for her. She liked him sporty. Sweaty.</p><p>Naked, actually.</p><p>What he was wearing now made her think of middle management. Corporate life. A flash of her beige office and her legs wrapped around Dylan's naked ass made her wince.</p><p>“You OK?” Mike peered at her, concerned. “Something wrong?”</p><p>Shake it off. “No, just – no.”</p> <p>He bent over the stove, his frame so tall he had to crouch to fit under the hood. It made her feel liliputian. No one – ever – made her feel diminutive, yet somehow Mike mastered it. She liked it.</p><p>Liked his cabin, too. How in the hell did a ski instructor afford this? Four bedrooms, each with its own bathroom, a deck bigger than the house she'd grown up in, and a sliding door at the lower level where you could just ski right up, unbuckle your boots and snap off the skis, and come right in. Decorated in knotty pine and colors that screamed “Ski lodge!”, the place was amazing.</p><p>All this and an apartment in the city, too? He hadn't invited her there, though. Just here.</p><p>Next date.</p><p>Why had he just turned the burner off? Laura took a big swig from her glass of Pinot Grigio (she was learning) and Mike grabbed the bottle, filling it instantly.</p><p>His grin was saucy, a wolfish look on his face. “Like the wine?”</p><p>Gulp. Three big mouthfuls and she finished half the glass. Thoughts of Dylan kept invading. The brush of his fingers on her inner thighs. The rasp of his stubble against her ear. The texture of his ass as it tightened under her steady palms as he thrust –</p><p>Gulp. Enough wine and maybe he would quit invading her brain.</p><p>Maybe you should quit inviting him.</p><p>“Earth to Laura.” Mike. Oh, yeah. Mike. The back of his hand brushed against her cheek, fingers stroking her face, tucking loose hair behind her ear, then trailing lazily down to her collar bone, one palm cupping her breast as he bent down for a kiss.</p><p>The touch of his lips on hers made her swoon. Spinning rooms were never really her thing, but the wine hit her as his warm body crushed against hers and she went limp, his strong arms holding her in place as his tongue provided an elegant rough draft of what it was going to do in, oh, about five minutes,</p><p>On her clit.</p><p>She pulled back, blinked coyly, grabbed the wine bottle from the counter and filled her glass again. This time there was no pretense of gentility; she chugged it like a sorority girl at a kegger, placed the glass down on the granite counter with a click, and grinned like a fool.</p><p>“Are you really hungry for something green?” The flooding warmth that covered her was equal parts wine and arousal for what she knew was coming.</p><p>Her.</p><p>“I'm more in the mood for a pale blond.” His fingers brushed her loose, blonde curls away from her neck. She shivered, his touch like an unwinding sigh. Kisses delivered to her throat, her earlobe, then her mouth made her throat tighten, her legs loosen, and the rest of her melt.</p><p>“Or,” he added, one hand traveling up from her hip to her breast, “I'm pretty sure I'd prefer something pink.” They had both dressed more casually, the intent of the evening clear. When Mike had shyly suggested she bring an overnight bag, he didn't need hand puppets, markers and a white board to explain what he expected from the date. Muscular and wiry at the same time, he managed to look like a gentle giant and a lanky teen all at once.</p><p>Right now, though, he was all man. Confident, sensual – and very much in command. She hoped he liked what she had worn, simple J.Jill casual clothes, with a flowing mauve skirt and top that hid her bigger parts but accentuated her face. She didn't need to hide anything, with Mike (and that was the beauty of him), but she also felt unready to run around in crummy workout clothes or flannel jammies. Not yet.</p><p>Someday, though. Just not right now, as his hand burned a hot path on her skin, clit at the ready as if at attention and waiting for its next order. His warm sigh and low growl made her woozy. Or maybe that was the wine. At this point, it didn't really matter which it was.</p><p>“Hot pink?” she gasped as his hand traveled under her skirt, flirting with her panties, one finger slipping under and – oh!</p><p>“Very hot,” he murmured, his lips against the corner of her mouth, her thighs quivering as one hand discovered exactly how wet she was for him, the other wrapped around her back, pinning her to him. She raised the stakes, too, by sliding her hand along his inseam, finding him hard and ready for her. Dinner? What dinner. The pasta could be purple with blue polka dots for all she cared.</p><p>He pulled back, hand slipping reluctantly from her thong, his face dark and playful all at once, with a mischievous look his pulled his hand to his lips and licked the tip, eyes locked on hers. Then Mike cocked his head, held his hand out for her to grasp, and nodded toward his bedroom.</p><p>“Shall we?”</p><p>I thought you'd never ask. “We shall,” she declared, clearing her throat as he twisted and pulled her gently through the doorway, the room obviously decorated by a guy, with thick leather, unfinished wood beams, and a stark, unlived-in look dominating. How long has he had this place? she wondered. It was like he'd just moved in. Too sterile.</p><p>A cream comforter with imprints of brown and green bears covered the bed, like something from a B&amp;B that catered to ski people. The backs of her legs grazed it; soft and well worn. Mike reached out for her and, with a neutral, open expression on his face, slid his palms up her sweater, untying the sash where the wraparound stayed together, gently nudging it off her shoulders where it pooled on the floor.</p><p>His hands were so warm, his face open and inviting, intent on his actions as if making love in a meditative state. Laura knew that no matter what, one hundred percent of Mike's attention was on her; he was so present it almost hurt, an awareness too deep and painful at times. Right now, though, she reveled in it, like finding the perfect patch of sunshine after a storm.</p><p>His hands moved under her t-shirt and slid up. She pulled her arms into position to take it off easily, his sigh the only reward she needed. Eventually, they would find their way into the bed. This dance of unveiling was worth the linger.</p><p>Reaching for his buttons, she imitated his actions, his skin softer than she remembered, the flesh tight and muscles hard beneath. As his arms folded and peeled off his shirt she watched a concert of twitches and stretches play out before her, like an artist's rendering of male perfection – but real. His tan skin and long torso were achingly hot, looking up into his face as he bent down to kiss her like cocooning.</p><p>Nimble fingers unbuttoned his pants and unzipped him, his sharp inhale seeming to fuel the depth of his kiss, tongue pushing harder against hers and hands pressing her jaw as he tried to get a grip on what seemed like an overpowering urge. Nearly frantic, his hands made quick work of undressing her the rest of the way, leaving Laura completely naked within half a minute, Mike following after. So much for the linger.</p><p>The room was so warm that when he pulled her onto the bed, reclining in each others' arms, she didn't need the covers for comfort – but would have preferred them for modesty. You don't need to hide, a voice said. It was Mike's. In her head, though – he couldn't have spoken, actually, because right now he was kissing her belly, his route revealing his intentions as he aimed for her womanhood.</p><p>A little sigh, almost a moan, escaped from her mouth, over her teeth and through her lips like a prayer as his hands roamed up her hips, palms and fingers splayed to take in her skin. She loved how he appreciated her body. Not tolerated – appreciated. Enjoyed.</p><p>Owned.</p><p>Her own hands were eager for more of him on them, fingers brushing against his neck, palms taking in his shoulders as –</p><p>Creak. The bedroom door opened slightly, then a footstep. She froze. Was someone else here? Mike seemed to hold his breath suddenly, though his hands continued to caress her.</p><p>To her complete mortification, Dylan walked into her line of sight.</p><p>Dylan?</p><p>She squinted, as if her eyes deceived her. Nude, in Mike's arms – or, rather, with her legs in Mike's face – Laura could have named five other people she'd expect to see walk through that door before she'd have anticipated Dylan.</p><p>“What are you doing here?” Laura felt exposed. He just stared at them, Mike nuzzling her belly and pointedly not looking up. Caught. She was caught. She hadn't been exclusive with either guy, so she shouldn't feel guilty, but she did.</p><p>And what the hell was Dylan, of all people, doing here right now?</p><p>He gestured toward the door. “Uh, your front door was open, and I came here to say hi, and when I saw it ajar I was worried about you can came in to make sure you were OK.” He shot Mike a dark look. “I see you're more than OK.”</p><p>Laura choked, not sure what to say, laying naked on the bed with Mike going down on her, like something out of a bad soap opera. A bad, kinky soap opera. “So, uh, I don't know what to say.” Her face burned red with embarrassment. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And more. It was like her dreams, her shower fantasies, had come to life, as if somehow the universe had read her mind (or, at least, Dylan and Mike had) and decided to make this all come true. But it was too real, too creepy, and she found herself immobilized by the surreal.</p><p>Yet turned on beyond belief.</p><p>Finally, Dylan said, “I'm so sorry.” But he didn't mean it. His face burned with desire. And if Mike could see her face right now, she feared, he'd read her lust on her face, too.</p><p>Laura knew Dylan could make her wet. Those perfect, sculpted abs. And the thatch of hair at his waist – mmmmm. Those thick, sinewy arms folded across his chest. Smart, gleaming eyes and a smile like molasses reminded her of his sensuality.</p><p>Clever eyes, with flecks of gold, read her like a professor studying historic documents. He felt it, too. Everything but Mike disappeared.</p><p>A shot of destiny made her want them both, for they were meant for her, as one. Both were reeling.</p><p>Mike cleared his throat. “Want to clue me in?” His face rested on her thigh. She almost forgot he was there. The scent of her permeated Mike's skin and there it was again, that wave of guilt, but this time tinged with...possibility? Something crackled in the air between the three of them, a subtext she didn't understand, and Laura was starting to feel like maybe, just maybe, these two complete strangers were planning something that she didn't see coming.</p><p>A dog barked outside. Her senses froze. That was crazy, right? Apparently, they knew each other, though. How did they – ?</p><p>Dylan crossed the room fast. Then he stripped off his shirt. “Can we make this a triad?”</p><p>Laura's insides clenched and her body tingled. His rippled torso made her drool. He gave Mike a conspirator's half smile. There it was – a familiarity between them. Both were the alpha type yet they seemed less interested in establishing control and more interested in – her?</p><p>Laura was caught between the two men. What would Mike say?</p><p>Mike cleared his throat. “It's been a while, but...”</p><p>“You've, uh, done this before?” she blurted out, the words escaping before she could push them back in.</p><p>“You haven't?” His voice carried a sweet, incredulous tone. Her breath disappeared as he traced a lazy circle at the hollow of her throat. This was less an invitation and more a requirement.</p><p>“No, I mean – you two know each other?” Duh, Laura. Of course they did. “How do you...but I've been dating you both!”</p><p>“We know,” they said in unison.</p><p>Their chuckles made her even wetter, if that were possible. Mike looked up and caught her eye, one eyebrow cocked.</p><p>Cold blood flooded every cell of her body. This was a set up? Dylan and Mike not only knew that she'd been dating the other but they were some sort of item?</p><p>And they wanted a threesome with her? Go with it, her heart said. Maybe that wasn't her heart. Something much lower on her body swelled and pulsated, eager for her showerhead fantasies to come to life with flesh.</p><p>She liked it. Laura stared impolitely at Dylan's chest, eyed him up and down, and then turned back to Mike. Staring deep into Mike's eyes, she squinted and sighed in torment.</p><p>“Is this really what you want?” Please say yes, she thought.</p><p>Dylan groaned. “I vote yes!” he purred. His eyes were burning for her.</p><p>“Mike?” she asked. He licked her hip, rubbing his nose on the soft flesh where her belly and thigh met, the nuzzle somehow both playful and sensual.</p> <p>“I'd say that's a yes,” she moaned. A drunk feeling enveloped her. Dylan's tan, muscled hands undid his jeans. Meanwhile, Mike resumed his activities. She closed her eyes. Her ears heard Dylan's jeans hit the floor. God, how she loved his ass. Her nipples tightened.</p><p>Two more hands roamed over her skin. She shivered, a sharp inhale and a wetness making her nearly cum. The tongue Mike flicked drove all thought away. She couldn't breathe now, was just a mass of nerve endings and goo.</p><p>Imagining Dylan's cock in her at the same time as Mike's made her moan and tweak her own nipple. A strong hand pushed it away.</p><p>“Oh, no, you don't,” Dylan's voice cajoled. “That's my job.”</p><p>She felt Mike's chuckle on her clit as he drove her crazy, soft tongue teasing her skin, bringing her so achingly close. Sliding her hand on Dylan's skin while the other buried itself in Mike's hair, Laura feared she would come this second. They were too much, together, but oh, God, how good it was.</p><p>The scent of both men mixed with hers, like the ocean at sunrise. Man and nothing but. She needed to taste them, and she pulled Dylan to her. Her tongue poked out and licked his arm.</p><p>“Don't waste that tongue there, Babe,” Dylan murmured.</p><p>And just then, Laura lost control. Mike moved up to kiss her. He was the gentle savior, always tender and sweet. Oh, how her clit craved attention. Four hands, two men, and she was still ravenous.</p><p>“Oh, please, more!” she begged. One hand found her clit and she bucked against it, eager for release. Mike's mouth grazed against her ear. She shivered, making her wetter. Dylan's other hand traveled up to her breasts, pinching as he rubbed her, keeping her orgasm at the ready, her hips bucking to find a rhythm for release.</p><p>“You have the most luscious body,” Mike groaned.</p><p>Laura wanted to believe it. Years of being teased for her curves had toughened her but now she found her true partners. All the insecurities she felt, every worry, roared into her mind, and then Dylan sidled up to her face, giving her a gentle kiss.</p><p>“Laura, I've wanted you for so long,” he said. “We have.” The hand on her clit, their words, all sent her over the edge, her cries a prayer as she came. Dylan held her, strong arms feeling the waves as she trembled and twitched, a flood of intensity making her head explode.</p><p>She batted at Mike's hand, which still strummed her, the orgasm released, and she lay panting, with two naked, gorgeous men staring at her.</p><p>Oh, shit, she thought. Now what? She was so spent already, Laura didn't know what to do next. Two hot men were in her bed. She was about to have her first threesome. And all she could do was stare back.</p><p>“Ready for round two?” Dylan asked, as Mike took her hand and placed it on his rock-hard cock.</p><p>She slid her hand from the base to the tip as Dylan pressed her shoulder lightly, Mike moving to the side of the bed. She felt a small drop of pre-cum on Mike's rigid cock, and the fluid made it easier to stroke him, Mike's knees buckling as she groaned.</p><p>Meanwhile, Dylan climbed on top of her, his cock soon in her face, and as she took him in her lips she felt two fingers slide inside her soaking pussy. Not what she expected, so soon, and yet her body surprised her with a deep, abdominal muscle clench and a groan that made her vibrate against Dylan's cock, making him groan and he pushed against her, riding her mouth.</p><p>As she deep throated him, she focused on giving Mike attention, too. What were the chances she'd found two incredible men like this, hot for her, the girl who was teased when it came to romance? She knew they weren't lying; she could tell by how they touched her. She relaxed. It made this moment so much more precious, for they appreciated her for who she was.</p><p>Dylan stiffened and she knew he was about to cum. She wanted both of them in her, though. Was she crazy? The guys weren't touching each other.</p><p>“Oh, no!” Dylan shouted, pulling out of her mouth. “No, not like this,” he begged, glancing at Mike.</p><p>Mike nodded. His hand stopped on her clit, making her cry out. “Oh, Laura, this is going to be so fun,” he said, sliding up her body, caressing her, as Dylan walked over to the couch.</p><p>Filled with a new sense of confidence, Laura stood and ran her hands over her breasts. “Ah, Mike, the question is: Can you both satisfy me?” The question emboldened her and turned up the heat a notch, both men puffing out and elongating at her words, their hands and bodies larger and warmer, the air tingling with suspense.</p><p>His rough hands claimed her, the force shocking her, the crush of his lips an answer. Dylan pulled them apart gently, cocky and ready, as Mike sat down on the couch. Now Dylan kissed her, exploring and teasing, making her wet and eager for what was next.</p><p>Dylan nudged her to sit on Mike's hot, rigid cock; it was time, finally. Sliding down his pole, she straddled him as her pussy walls clenched and held on, Dylan bending her over just enough to make what came next possible.</p><p>A slick sensation hit her backside, Dylan getting her ready. His mouth was on her ass, shocking her, the sensation new and aching. Never before had she let her mind go there, the taboo so great that unless she read about rimming in a magazine or story she didn't consider it, pushing it out of her mind like so many other forbidden pleasures. It felt so good, yet seemed slightly wrong.</p><p>Right here, right now, though, it felt sooooo right. Her pussy tightened, making Mike groan, and Dylan slipped one finger past her sphincter.</p><p>“Ah!” she cried out. Mike was more than enough, but she needed Dylan, too. Dylan poured lube on her ass, then a finger slipped in, the finger stretching her, soon replaced with the tip of his cock. Meanwhile, Mike kissed her breasts, his hips keeping a slow rhythm, building a slow climax.</p><p>Now, oh! pain filled her, Dylan bracing himself behind her, the breach of her anus too much, to the point where she almost said “no!”</p><p>It pushed every boundary, unsure of herself, until Dylan leaned over and whispered, “Relax.”</p><p>Oh, how she did. That was part of the surprise and delight. Knowing they treasured her, Laura reveled in defying convention, creating a world where Dylan's hands were a sacrament. Both filled her completely, Mike's slick sweat against her as friction inside made her slippery and hot, all three breaths like a symphony, the sound a special music just for her.</p><p>Dylan's calloused hand took her nipple, his jaw tight and ready for more. Mike's eyes were light yet intense, loving her as she felt Dylan's hands slide over her belly, one hand finally slapping her ass, her groan all he needed to hear.</p><p>Her thighs were drenched as she rode Mike, all self-consciousness gone, and now Laura enjoyed the tactile sensation. She bit Mike's lower lip, hard, whispering, “I want you both so much.”</p><p>All flesh and bone and breath.</p><p>Mike lifted his hips up, his fingers – whose fingers? – now circling her clit and ringing her ass. She tipped her head back, leaning on Dylan's chest, her breasts in the moonlight, body on display, and she felt possessed by herself, unleashed and ready to gush.</p><p>“Oh, God, I'm so close,” Mike groaned, planting a sweet kiss on Laura's skin. Words escaped her, a sudden thunderclap inside her and she answered with a scream. Both men worked to keep up with her, and although she knew inside she should slow down, she felt something greater than guilt: need.</p><p>Now, the thin membrane between them became the center of her soul, stretching and turning and sliding and tingling until she felt her arms and legs and fingers and toes curl into one little supernova. Shaking, Laura lost all thought, fingers gouging Mike's chest, slipping on slick sweat, hands scratching and clawing for someone to cling to as the world ended and began all at once inside her core.</p><p>Dylan came next, his hands firm and rough and flexing against her ass, his body shuddering as he came, filling her with a hot wetness, his cock throbbing against her pulsing muscles.</p><p>She had never been so full, Dylan's cock expanding and meeting a need she never knew she craved. She was pleased with her own boldness. Spent, he leaned against her, making her want just a bit more, as if one wasn't enough. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But just then, Mike's turn came, his eyes unfocused, face tight with concentration, arms bulging as he thrust up, up, into her, making her tighten and realize she had another wave in her to catch. Cool air hit her ass as Dylan pulled away.</p><p>“Come here,” she said, panting.</p><p>“I'm here,” he murmured, moving next to Mike and Laura, licking a trail up her ribs, the sensation so luscious as he took one ripe nipple. Sliding her hands over Mike's shoulders, she stretched into the sucking, her hips taking in his thick rod, the simultaneous attention so erotic she felt the new orgasm snap.</p><p>She clamped on Mike's cock at that exact moment, milking him as he thrust up and shouted, “More!” He thrust, then halted, repeating the action, until with one final sigh he finished, leaning back against the couch, eyes closed, chest heaving with exertion.</p><p>Laura's orgasm sprang to life as if she hadn't just exploded mere minutes ago, the intensity taking her breath away. Dylan nuzzled her ear from behind and kneaded her breasts, murmuring,“Let it all out.”</p><p>He didn't need to say it.</p><p>She became someone else – no, she became her, the self-confident woman she remembered and the sexy beast she knew was within. From her core, her entire body clenched and heaved, a plane of orgasm shooting through her. Dylan's fingers and hands drained every drop from her until she slumped forward, Mike's hands caressing her back, the tenderness a comfort she didn't need but welcomed anyhow.</p><p>For now, tenderness wasn't a surprise; it was a right. Her eyes raked over Dylan's glistening body as he walked to the bed, stretching on the sheets, arms over his head, muscles taut and strong. He shot Mike a conspirator's look and the two started laughing.</p><p>A cold flush took over her body. Oh, my God. This was all some sort of game? Were they really tormenting her? Was she the fat girl again, the butt of some awful joke? Had they recorded this, a cruel joke to show on YouTube in a few days, making her a social media pariah? All her self-confidence, all her sensuality drained out of her and she buried her face in her hands, hot tears filling the back of her throat.</p><p>“Oh, no! Laura, we weren't laughing at you!” Mike picked up on her distress first, rushing to cradle her. How did he know what she was thinking? It was uncanny, but words escaped her again, the pain of what she thought they were doing so great that even if they weren't, its echo remained.</p><p>Dylan's hot hands caressed the back of her neck. “We, uh, well.” Dylan hesitated, then blurted out, “we kinda planned all this.”</p><p>“Yeah, I know. When's the YouPorn video going up?” she asked, now just pissed but also hoping Mike's arms weren't part of the joke, that his soothing was real.</p><p>“What? No, no. We planned it because we wanted a threesome with you. We were together, watching for someone like you to appear on that dating site for a long time.” Dylan's voice seemed so earnest. Here she was, naked and covered in their juices, Dylan and Mike and their luxurious flesh before her, and all she could do was cry.</p><p>“Someone like me?” Hope bloomed. Maybe she had been right all along. The two men exchanged a glance and Mike spoke first.</p><p>“Just like you. Blonde. Perky. Funny as hell. Centered. And with a smoking bod. We're tired of women who aren't real, and who don't have the ability to see beyond convention, outside of judgment, and to just follow their hearts.”</p><p>“So you decided to put me to some sort of test and see if I'd rise to the occasion?” Laura searched frantically for her clothes, her vulnerability like a giant shark bite where her heart should be. Exposed, she felt shame pour out of her like an open vein right here, right now, because how could she go from the exhilaration and attachment of what the three of them had created just moments ago to this all-consuming pit of despair?</p><p>Four eyes watched her, countless pounds of muscle twitching and trembling as she spoke, both men gawking at her like she held their balls in a pair of pliers. Why were they doing this? The mixed signals stymied her. A sick joke? A bet? Some kind of weird competition that ended in threesomes?</p><p>Those same comfortable, flowing clothes that she had loved wearing here tonight when all she had expected was a date with Mike were the bane of her existence as she struggled to throw them on as fast as possible, her foot getting caught in the yards of ample fabric. “God damn it!” she shrieked, nearly falling over.</p><p>“Laura.” Mike climbed out of bed, his naked form stretched out in front of her, her face inches from his crotch as she bent over to untangle herself. Under any other circumstance she would have welcomed the view, but right now his golden flesh just prolonged her agony.</p><p>Kneeling with more grace than she could ever possess in three lifetimes, he grasped her foot tenderly, peeling the stretchy cotton cloth off the toes where it had twisted. Her leg free, she could pull her skirt around her waist and shove her arms through her t-shirt, then fling her oversized jacket over it, all with Mike staring balefully up from the ground. Those giant blue eyes communicated so many emotions Laura just couldn't receive right now.</p><p>Run.</p><p>Run away. They're making fun of you, Laura. The voice sounded like Josie's. Like her mother's. Like every person who had pretended to like her but had just been playing a joke on the fat girl.</p><p>Joke was over. She heard Dylan call out her name as she slammed the front door and marched through the dark to her car, the tears spilling over her lashes before she'd made it down the porch steps. She reached into a non-existent pocket for her keys. Keys. Thank God she'd driven here in her own car and could leave, but she couldn't get out of here if she didn't have keys.</p> <p>Damn! Her purse. It was back in the –</p><p>Creak. The front door opened and Mike's long, taut arm came through it, her purse dangling from the end, the porch light making the entire production seem like some rejected scene from one of the later Friday the 13th movies. Horror was apt; it's what she felt right now. Gently, the arm knelt down, resting the purse on the welcome mat. Without a word, he withdrew his limb and the door creaked shut, the glow on her purse like a spotlight of failure.</p><p>Was that some sort of message? Don't bother coming back in? Like a pilot light pluming as it is first lit, Laura felt a fireball of rage explode in her. She wanted to ram the front door and –</p><p>No. The fury snuffed out fast, leaving a deadly calm inside. Mike did that because it was Mike's way – quiet, silent. Deliberate. He knew she wanted to leave and he helped. No judgments, no words, no complications.</p><p>What she needed most right now, as she sneaked up the steps and snatched her purse strap, was no complications. No thoughts, no feelings, no regrets, no nothing.</p><p>Laura stormed back to her car, yanked the door open, piled in and cranked the engine. To her relief, it started fine and off she went, the aroma of sex and Dylan and Mike perfuming the air. Their hands were still imprinted on her, the ache of them inside her stretching and throbbing inside, as if she hadn't quite readjusted to the lack of their stroking, their kisses, their –</p><p>Don't think about it. After her first threesome, she was touched out. The next thing to touch her lips better be named chocolate. Or coffee. Or Xanax.</p><p>Hot tears, though, beat them all to it.</p><p>“Her purse? Of all the gestures you could have made, Mike, the one you picked was to put her purse out on the porch for her?” Although he'd stayed in bed while poor Laura had wrapped herself into a knot rushing to put on her clothes, now Dylan leaped out, pacing like a caged animal. His nude form was less appealing than it normally would be as Mike struggled to make sense of the last hour.</p><p>“She needed to be able to leave in peace.”</p><p>“She's going to think that was some sort of big old 'fuck you,' Mike! Like we were telling her to get out.”</p><p>“No.”</p><p>“Yes,” Dylan replied savagely. He grabbed his boxer briefs and dragged them on. Mike heard the popping of stitches and bit back a smirk as Dylan untangled himself from having put both legs in the same hole. As Dylan figured it all out Mike calmly put his own underwear and pants on, desperate to go for a long trail run. Where the hell was his shirt?</p><p>“Where are you going?” Dylan shouted as Mike wandered out of the room in search of his shirt.</p><p>“For a run.” Where was it? He and Laura had been by the bed, and her fingertips had – Oh. Yeah. Turning around, he walked back in to find Dylan shoving his shoes on, glaring at Mike like he'd just ripped his puppy's head off and eaten it.</p><p>“At midnight? Smelling like – uh, us? Are you trying to be bear bait?”</p><p>Behind the door he found his shirt in a wrinkled heap. His biceps ached as he stretched his arms and slid them into the sleeves. Sore already? He snorted.</p><p>“You think something is funny? At a time like this? Man, you're cold.” Dylan bounded to his feet, fists curled, itching for a fight. Mike knew he wasn't mad at him; Dylan was frustrated and hurt, and this was what he did.</p><p>He got mad.</p><p>Mike, on the other hand, got out. Out on the road, the trail, the running paths – wherever his feet took him. Coming right up to him like a peacock ready to strut, Dylan got in Mike's face, his bare chest brushing against Mike's tight-weave cotton.</p><p>“What the fuck are we supposed to do now?” he hissed, arm pointing toward the front door. “She's gone. Your little plan failed.”</p><p>“We don't know that. Quit saying 'my plan.' My plan didn't involve a threesome on the spot.” A deep itch, an urge like a tic, swelled up in him from bones to outer skin; the need to flee. To run. To race.</p><p>To get the hell out of there.</p><p>His throat started to hurt and Dylan looked like a gremlin, yapping about Laura and how it was all destroyed now and who was crazy enough to run in the woods alone in the dark and why hadn't he been there more for Dylan after Jill and then his words went into slow motion, like molasses pouring from his gaping maw, until Mike had to look away. Acid trips were less surreal than this.</p><p>“Laura thought we were mindfucking her, Mike,” Dylan growled. “That we were laughing at her, like we planned some sort of joke and she was the punch line.” He ripped his hands through his hair and made a keening noise not unlike one he had made when the doctor had come to them after Jill had coded. “And who can blame her? I pop up like I'm stopping by for tea and cookies and BAM! Her first threesome.” Dylan collapsed on the bed, shaking his head and groaning, hands clamped on his temples.</p><p>“It would be a bit jarring.” Shit, Dylan was right. He couldn't run now. What next? His muscles kept tightening, spasming without conscious effort. The urge to move was too great. This was not going to end well.</p><p>Dylan sat up and shot Mike a withering look of incredulity. “Jarring? Who are you – the queen's PR person? Keep calm and carry on is one thing. Keep calm and act like a robot just makes you look like an ass, Mike.”</p><p>Blink. Mike didn't know what to say. Had nothing to say. He needed to run. Lungs felt like they were collapsing in, his spine curling forward, his knees itching and nerves burning.</p><p>Run.</p><p>“And then there's the whole billionaire thing!” Maniacal laughter poured out of Dylan's mouth. Now he was just plain old scaring Mike. So much for that run. He plopped down next to Dylan on the bed and just watched him.</p><p>A grotesquely loud gurgle vibrated from Dylan's gut. “Sorry,” he muttered. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Gotta eat.” Mike shrugged. “Laura and I didn't really even get dinner going,” he added guiltily. The sight of the unfinished meal made him go cold. Memories of what had transpired a few short hours ago, the promise that held everything – he had to get out of there.</p><p>“I don't really – you know, just being here bothers me.” Smoothing the bedsheets, Dylan looked around the room. “I just – ”</p><p>“Yeah. Me too.”</p><p>“Did we fuck this one up?” Dylan's eyes begged him to say “no.” Mike couldn't. He wasn't a liar by nature, not even a social liar, and right now he didn't have an answer. Whether they could reach Laura or not, on her terms and her timeline, would be key. Trying right now, when she was raw and hurt and bewildered, wouldn't do anyone any good.</p> <p>“I don't know.” Dylan grabbed a shirt, some ratty Rush concert t-shirt his older brother must have bought at a concert in the late '80s, and tossed it on. Mike wanted to say the exact right thing. Perfect words that would solve this problem. That, however, was the problem with words – he never could use them well enough to make any mess better. In fact, he always seemed to make it all worse when he opened his mouth.</p><p>Action made so much more sense.</p><p>“What time is it?” Dylan asked, looking around the room for the clock. He fingered a hole in the hem of the shirt, worrying it bigger.</p><p>“It's gotta be past two. And good grief, man, you're a billionaire. Buy a new shirt. Hell, buy the band Rush. You can afford it.”</p><p>“Geddy Lee's not my type.”</p> <p>Mike stared out the window. “The night is black, without a moon.”</p><p>“And if you choose not to decide, you still have made a choice. What's next, Mike? You gonna rickroll me?”</p><p>“Over pancakes?” Mike grabbed the keys to his car, a new Grand Jeep Cherokee. Loaded. Paid cash.</p><p>Dylan's eyes lit up. “Jeddy's pancakes? They're open twenty-four hours. I could go for some chipotle maple sausage crepes.”</p><p>Ugh. “Whatever happened to a simple short stack?”</p><p>“You are so vanilla.” Mike arched an eyebrow dramatically in response. Dylan backpedaled. “OK, OK, not so vanilla. Just boring.”</p> <p>Mike's feet itched to run. Pancakes first. If he carb loaded, he could bang out a good half marathon later. “Jeddy's it is,” he agreed. Dylan fairly bounced out of the house. So easy to please.</p><p>“The ride's a good hour.”</p><p>“Worth it!” Dylan shouted as they ran for the jeep.</p><p>If only chipotle maple sausage crepes solved everything.</p><p>\"You what?\" Josie's voice was as close to a shriek as Laura had ever heard, her face flushed with shock and awe. \"You WHAT?\"</p><p>Laura literally ducked and covered, her face so hot she imagined it would burn her fingers if she touched it. \"I know. I really am a slut.\" One call to Josie and her friend had come over bearing a large box of Godiva chocolates, a bag of salt 'n vinegar potato chips the size of a third grader, and new fingernails: Beetles album covers. Abbey Road was currently shoved in Laura's face, accusing and menacing.</p><p>\"A slut? Hell, no! You're a goddamned queen! Holy shit, Laura! You're living every woman's dream!\"</p><p>That was not what Laura expected to hear.</p> <p>Not one bit.</p><p>\"Huh?\" She peeked up at Josie from between her fingers, like taking a glimpse of a scary horror movie. Little Josie was buzzing like a hummingbird, face flushed, upturned nose and pursed lips making her cuter than ever. Laura had hated how Josie was “cute” while Laura was “smart.” Josie was “petite” while Laura was “big boned.” Josie was “pretty” while Laura had “such a pretty face.” Not that it got in the way of their friendship all these years, but the parents, the adults in their life – everything and everyone had to fit neatly into a category. A word. A phrase. And if you didn't –</p><p>You ended up in a threesome with two guys who were still mourning their dead shared girlfriend.</p><p>Maybe categories weren't so bad.</p><p>\"OK, not every woman's fantasy, but uh, most of us...\" Josie's voice trailed off and now, to Laura's surprise, it was her friend's turn to be embarrassed. \"Two hot guys, both after you, wanting you in their bed and in their hearts – and they're not gay? Huh? So you get two guys' attention all the time. Who wouldn't want that? You fucking lucky bitch.\" Josie spat out the last word with contempt. Not the kind of contempt Laura was primed to hear, though. This was the sound of jealousy.</p><p>\"Hold on! HOLD THE FUCK ON! So you have wanted a threesome?\" Laura leaned forward. Her turn to wag a finger in someone's face. To her surprise, it felt good. She saw the appeal.</p><p>\"Sure. Ever since that one time in college.\"</p><p>Laura's eyebrows shot up. \"You did? You had one?\"</p><p>Biting her lower lip, considering her thoughts, Josie cringed. \"Yeeeesssss. Once.\"</p><p>\"AND YOU NEVER TOLD ME?\"</p><p>\"I was too ashamed.\"</p><p>Shame. Was Laura supposed to feel shame right now, after what had happened with Mike and Dylan? She didn't. And didn't think she ever would. Shame might have been front and center in her chaotic bundle of twisted emotion with the two men, but it had faded fast. That shame had been less about the pleasure they'd just shared and more about her worry that she was the butt of some cruel joke. Once she had some distance, her wise mind kicked in. What did she have to be ashamed of? She'd done nothing wrong.</p><p>Neither had Dylan and Mike. Well, at least, not in terms of the threesome. Behind the scenes was a whole 'nother issue...</p><p>Defiance rose up, welling like a geyser, ready to explode. \"I'm not ashamed.\"</p><p>\"I never said you should be. Frankly, I'm – impressed. Stunned. Gobsmacked.\" Josie chuckled, sitting on the couch and folding her tiny legs under herself, looking like a kitten curled up on the sofa. \"You amaze me. Laura, you have found it all. Are they really as hot in real life as they are in those pictures?\"</p><p>That brought Laura up short, and all she could do was to slump down on the couch across from Josie and blink. Found it all. Dylan, with his swagger and zest for life. Mike, with his quiet contemplation and steady sweetness. The two really did complement each other and when you put them together with her they made –</p><p>Everything.</p><p>“What about the fact that they ganged up on me? Hid their real relationship with each other from me? I mean, I felt so, so – caught off guard. There I was, naked and in bed with Mike, and oh, hi! Dylan pops in.”</p><p>“Sounds like the beginning to every other letter in Penthouse Forum. 'Dear Penthouse Forum, I was minding my own business trimming my rose bushes in the buff when the mailman and the meter reader just popped in...'”</p><p>The pillow wasn't hard enough to knock Josie down, but Laura threw it anyhow. A brick would have been better. “It's not like that.”</p><p>“Then what is it like, Laura?” Josie frowned. “It was voluntary, right?”</p><p>Huh? “What do you – oh!” Laura pressed her fingertips to her lips. “Oh, no, no, no, Josie it wasn't – yes. It was completely voluntary.” Both women exhaled.</p><p>“Good.” Josie chuckled. “You had me worried there when you said 'it's not like that.' What did you mean?” She played with the loose tassel on a throw pillow as Laura thought for a moment, pulling her feet under her in a mimic of Josie.</p><p>“Uh, I meant that it wasn't cheap and tawdry, like those Penthouse letters. Dylan shocked me – can you imagine one guy you're dating walking in on you having sex with someone else?”</p><p>Josie reddened. “Um. Well. Ah. Uh...”</p><p>“Is there anything you haven't done?” Laura screeched.</p><p>“My situation didn't exactly end like yours!” Josie shouted back. “You ever try to get dressed while crawling out a second-story window?”</p><p>Dumbstruck, Laura squinted at her friend and shook her head slowly. “Sometimes I don't think I even know you.”</p><p>“College was a time of exploration.”</p><p>“Translation: I also slept with a lot of professors.”</p><p>Josie shrugged. “Can't get through organic chemistry any other way.”</p><p>An ambulance flew past, the lights spreading a disconcerting disco glow throughout Laura's living room. The clock read 3 a.m. What kind of friend comes over in the dead of night with one call?</p><p>The kind who, apparently, fucked her way to a high GPA. Laura tucked this detail away for later. Right now, she had her own mess at hand.</p><p>\"I feel like a freak, Josie.\" Laura wailed, rubbing her eyes. She peeked through her fingers. “Though less of a freak now that you've shared.”</p><p>“I'm a giver.”</p><p>“You're a – well, that's one word. I guess I'm a giver, too. More like a sucker.” Laura straightened her shirt and cracked her neck. Aches began to emerge. Minor pains that reminded her of the contortions she had engaged in hours ago. Delicious twists and flexes. “And I mean it – I feel like a freak.”</p><p>\"No, you don't. You just think you should feel like a freak. Deep down, Laura, you don't – not really.\" How could Josie be so sure?</p><p>“How do you know what I feel?”</p><p>“I know you feel like buying me a latte.” She sized Laura up. “Nope. Scratch that. This is definitely more than a latte conversation. We need us some pancake breakfast at a sugar shack.”</p><p>“It's July, Josie. The sugar shacks are closed.”</p><p>“Okay. I'll settle for Denny's.”</p><p>“Gross.” Laura recoiled. She'd waited tables there for three years in college. The only superbird she wanted to see was her own middle finger flipping off her old manager whenever she was in town and drove past.</p><p>“Well, excuse me for not knowing the proper gourmet etiquette for what to eat while talking about your best friend's threesome.”</p><p>“Brie and Nutella, actually,” Laura intoned, faking sincerity. “Haven't you read Dan Savage's column on it?”</p><p>Ding! Laura's laptop made an all-too-familiar sound. Her Home Page was the online dating site – who could this be?</p><p>“Laura! Batman's calling. Or maybe the Green Lantern. Iron Man's taken – Gwyneth got him already.” Josie grabbed her arm and dragged her to the door. “No – you can't answer it. We need to talk about the two you already got before you get any more hot guys. Leave some for the rest of us!”</p><p>Laura whiplashed her head between the front door and her laptop. “But...”</p><p>“Nope – and now you're definitely buying. Hope you have lots of cash, because I am starving. Flash Gordon can wait.” Laura ran back to the table, slammed the laptop shut, and trotted back to Josie, the streetlights outside her door blinding her as she realized she was starving.</p><p>The night air whipped against her cheeks, refreshing and cleansing, like a baptism of reality. Walking a few blocks, she and Josie searched out a good breakfast joint.</p><p>“What time is it?” Josie asked.</p><p>Laura checked her phone. “3:12.”</p><p>“Jesus,” Josie muttered. “You're getting me a giant stack of pancakes, eggs, bacon, a milkshake – the works. Three in the fucking morning.”</p><p>“Yer getting' old, Josie. We used to just get started at three a.m.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Getting started at three a.m. with a guy in my bed is one thing. Prowling the town for pancakes with you? I need three shots of espresso for that.”</p><p>Insatiable. The rush of hunger hit Laura like something sexual, a teeming need for a brownie sundae. Breaded, fried shrimp. Mozz sticks. Apple pie.</p><p>They turned a corner and – hooray! Jeddy's was open. Josie pointed. “Jeddy's?”</p><p>“Good old Jeddy's. Geez, haven't been here in...what?”</p> <p>“Seven months,” Josie said, a sour expression on her face.</p><p>“Seven mo – ” Oh. Yeah. Josie had come here to drown her sorrows after her last fuckbuddy left her. For a guy.</p><p>“Let's talk over caramel toffee chocolate chip pancakes. With crushed bacon cooked in.” Josie wiped an imaginary line of drool from the corner of her mouth. Or was that real?</p><p>“Only if you add in real whipped cream and homemade chocolate sauce.”</p><p>“Deal.” As they approached the door, Laura's hunger pangs sounded like gongs at a Buddhist monastery, the reverberations filling every void.</p> <p>Except for two.</p><p>Read how it all ends in Her Two Billionaires and a Baby! A short preview of how the series of love between Laura, Dylan and Mike all ends:</p><p>\"How much longer?\" Laura asked, her foot bouncing a mile a minute as she sat at the kitchen table, legs crossed, her fingers drumming on the top.</p><p>\"Thirty seconds,\" Josie answered. \"Twenty less than the last time you asked.\"</p><p>\"Shut up.\" To her surprise, the smartass went quiet. Damn well she better. This was no time for jokes. Josie's fingernails caught Laura's eye. Each was a rotation of a positive and negative pregnancy test. She inhaled sharply.</p><p>“Jesus, Josie, your fingernails! Have some compassion!”</p> <p>“I thought they were cute.” Josie shot Laura a sideways glance and rolled her eyes. “Someone's lost her sense of humor completely.”</p><p>“Yeah, well, I must have puked it up along with my lunch. If it means so much to you, go find it in the toilet.”</p><p>Ding! The oven timer beeped and Josie met her eyes, both of them scared shitless, Laura moreso. It was her life in the balance, after all, and while her best friend could be the most empathic person on the planet, she couldn't give birth for her.</p><p>Laura covered her eyes. \"You look. I can't.\"</p><p>\"Okay.\" Silence.</p><p>\"Josie?\" Laura could feel the sandpaper in her voice, could hear her unacknowledged truth, knew exactly what Josie was about to say but needed her to say it. To make it real. Her stomach roiled and that full-body flush – not the good kind – flooded her senses again. She willed herself to take deep breaths. Three of them, to be exact, before Josie finally said:</p><p>\"It's positive.\"</p><p>Her Two Billionaires and a Baby debuts in late December 2012.</p> <p>Ready for More?</p><p>Her First Billionaire – a sample...</p><p>Read how it all starts, with Laura, Dylan – and Mike's entrance at the end – as the two men find their way to bringing Laura into a most unique, and decidedly hot, forever threesome. Here's a sample from Laura and Dylan's story:</p><p>“Hot, luscious piece of ass who can suck a golf ball through forty feet of garden hose seeks rippling-ab'd firefighter who has a tongue that thrums like a hummingbird and enjoys painting my toenails and eating Ben &amp; Jerry's out of the carton while watching Mad Men.”</p><p>Laura Michaels stared at the online dating site's registration screen and frowned. That's what she really wanted to write. Here was the truth:</p><p>“Needy, insecure, overweight twenty-six year old Business Analyst with three cats, a corporate job with pension and no debt seeks Mr. Impossible for way more than friendship and lots of ice cream. I'm desperate for some physical affection and oral sex with a guy who doesn't view it as some sort of favor he's granting me, and then expects to be praised like he cleaned my toilet. One night stands are better than nothing as long as you brush your teeth. Call me!”</p><p>Her best friend, Josie Mendham, punched her in the bicep. “You can't say either of those!” Josie was Laura's opposite. Where Laura was 5'6\", Josie was barely tall enough to ride roller coasters. Remove the 1 from Laura's size and you still had to go down to 2 to get Josie's. Where Laura had long, curly blonde hair and bright green eyes, Josie was chocolate all around. “Mutt and Jeff” her mom had called them, and they'd been besties since eighth grade.</p><p>Which meant Josie knew Laura too well. “You are going to do this, damn it,” she said, wagging a finger in front of Laura's face. “No trying to be perfect. Perfect is the enemy of good enough.”</p><p>“I haven't even found Mr. Good Enough!”</p><p>“That's because the hundreds of Mr. Good Enoughs have walked past you, Laura, and you're blind to them.” Josie nudged Laura aside and started typing, her long nails burning up the keyboard. How did she do that? Typing on the pads of her fingers seemed impossible, but Josie did it, keeping her manicure intact, little replicas of the famous grey necktie from Fifty Shades of Grey on each nail.</p><p>The two had been out at a club the night before and Josie spent the night, waking up chipper and springing this online dating thing on Laura before she'd even had her first cup of coffee. As the machine gurgled and burbled, Laura willed it to hurry. Weighing out her entire dating future in a half-zombie state was not good.</p><p>Laura knew she had to lie, but how much was acceptable? Could she shave off a few sizes, or would she need to hack off an imaginary arm and leg to make herself seem “fit” and “athletic”? The drop-down box with its built in descriptors seemed like judgmental torment. No choices were there for “zaftig” or “juicy” or “full figure.”</p><p>Being a size 18 with size F breasts wasn't a crime, she knew; in real life she was fashionable and flowing, plump and pleasing, and could arm wrestle most guys into submission, but reducing her accomplishments, personality and, yes, body into a vocabulary designed by some Internet start-up team of nineteen-year-old dropouts from Stanford and Carnegie Mellon made her irrationally angry.</p><p>No – rationally angry.</p><p>Seeing little choice, she pointed to the boxes on the screen and told Josie, “Pick the word 'fit.' I can deadlift 105 pounds. Which is,” she eyed Josie, “more than you weigh.”</p><p>Josie pointedly ignored her, biting her lower lip and deep in concentration. “Voila!” she shouted, her hands spread wide in a grandiose gesture. “There's your ad.”</p><p>She announced:</p><p>“Luscious, curvy Business Analyst seeks friendship and more. Financially independent and self-assured, I'm a fit woman who wants a man (or, more than one! YOLO!) for stimulating conversation...er, yeah. Conversation. Message me (or massage me!).”</p><p>“I can't write that!” Laura groaned. “It makes me look like I want an orgy!” She squinted at the screen. “And what the hell is 'YOLO'?”</p><p>“Who doesn't want an orgy?” Josie wiggled her eyebrows lasciviously and stuck out her tongue, waggling it like she was performing a very bad imitation of oral sex. “And YOLO stands for 'you only live once.'”</p><p>“Cut it out. You're turning me on. It's been that long since I got some ass, and the last guy used his tongue like he was a Roto Rooter man. Like that.” She pointed at Josie's tongue and bent over, laughing.</p><p>And then Josie, with a flourish, pressed the “Submit” button. “Thank you for joining – your profile is now live!” the screen read.</p><p>“Oh, shit, Josie, did you just do that?” Laura sputtered, spilling creamy coffee all over her sleeve as she grabbed the mouse. “Fuck!”</p><p>“What?” Josie batted her eyelashes. “Live a little. See who replies!” She grabbed her heavy, over-full Vera Bradley purse that they had discovered at a local thrift shop for $3.99 and fingered her car keys. “Gotta go, Laura. And don't you dare delete that.”</p><p>Laura laughed. “You know me too well.”</p><p>“No shit,” Josie muttered. Her face turned serious. “Really, Laura. You need to get out there. Some guy is being deprived of your awesomeness. And besides, your budget needs the break.”</p><p>“My budget?”</p><p>“Yeah. What are you spending in batteries for Bob?”</p><p>Confused, Laura shook her head. It was like Josie spoke a foreign language sometimes. “Huh?”</p><p>“Your battery-operated boyfriend. You know – BOB.” And with that she snickered, running for the door as Laura threw a section of a fashion magazine at her. Josie's evil laughter filled the apartment as she ran down the hallway, the sound fading once she hit the stairwell. “Have a good day at work!” she hollered from the street.</p><p>The coffee machine gave its death-rattle gasp that signaled the pot was done, and Laura went to drink it greedily, needing sustenance to kick her brain into gear. Enough caffeine and she could date anyone. Hmm, maybe she should do a search for baristas on that site. Free lattes would be a nice perk.</p><p>Dylan Stanwyck couldn't quite believe what he saw when he logged into the online dating site. Four months of weeding through so many crappy profiles had jaded him. Finding the right woman would be like coming across the proverbial needle in a haystack, but in this case he didn't want to face any pricks.</p><p>And yes, women could be pricks. So far he had been inundated with requests to chat, and he knew exactly why. Being a firefighter who competed in weightlifting competitions for fun, along with the occasional mini triathlon, made his pictures look quite nice. The problem with the women who were responding to him was that they were also the type to be drawn to appearances only. It seemed so shallow of him to think it, but sometimes being built the way he was could be a curse.</p><p>Curse of the Jersey Shore chicks. Because that was the type who seemed to seek him out, like moths to a flame. A trashy, Snooki-like flame of ho-dom. When he would meet up with these women he found himself in some alternate universe, where they licked their lips and offered themselves up in the alley behind the nice tapas restaurant where he liked to take women. A few goat cheese stuffed dates and pitchers of sangria later and he was being humped up against a slimy brick wall next to the trash cans.</p><p>And when he turned them down...he still had scars from one woman's long, overdone nails raking his neck as she screeched, \"You don't know me!\" over and over, requiring police assistance as passersby gawked, took pictures they probably uploaded to Reddit, and mercifully called 911 on his behalf.</p><p>So when this new profile for Laura appeared, he peered at the description and leaned back in his chair, taking a deep breath. Cute. But not too cute. A little sassy. He liked sassy. He ran a hand through his thick, wavy hair. Time to get a haircut, dude. You look like a survivalist. And smell like one, too, he thought as he studied her picture and caught a whiff of himself. His morning run was done, 3.8 miles logged on his online fitness program, and he reeked.</p><p>She looked like a 1940s pin up girl. A little plumper, with soft curves to her shoulders, a fuzzy, lime-green sweater accentuating her breasts. Her jaw line seemed firm and gentle all at once, and what appeared to be naturally-blonde hair was swept up off her face in a pony tail. His mom would call her a \"corn-fed farm girl\" and those lips – lush and grinning a half smile that seemed to say \"Kiss me, Dylan.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Smart, too. A business analyst? Sounded suitably bland and yet signaled she was smart enough to carry her own in a conversation about something other than Kim Kardashian or Fifty Shades of Grey (really – why? Why had every date for the past two months mentioned it?). A real woman. What a refreshing change.</p><p>So he continued reading:</p><p>“Luscious, curvy Business Analyst seeks friendship and more. Financially independent and self-assured, I'm a fit woman who wants a man (or, more than one! YOLO!) for stimulating conversation...er, yeah. Conversation. Message me (or massage me!).”</p><p>Something fierce and hot inside him came to life. From that description it sounded like she...seriously? No way.</p> <p>\"Mike! Hey, Mike! Get in here!\" If there were a chance – any chance at all, here, then he had to act fast. Someone this amazing was about to get inundated by messages from needy weirdos.</p><p>And he needed to be the first.</p><p>His roommate wandered in. Where Dylan was all muscle and brawn, Mike Pine was tall and sleek, a marathoner's body of long, lean tissue. Dylan's dark, Italian, thick looks made him popular with women, but Mike was the golden boy, with blonde hair and blue eyes, the long distance runner with a soft heart, the guy women turned to and poured their hearts out, Mr. Sensitive to Dylan's Mr. Conquest.</p><p>Dylan tapped the screen. \"Take a look at her.\" He smiled smugly as Mike's eyes raced across the screen. They'd been waiting for a long time. Too long. His roommate's expression told him everything he needed to know. Score! It might finally be time.</p><p>\"Do you really think that's some sort of code for being up for a threesome?\" Mike asked, eyebrows arched. \"I don't know, Dyl...I think it's just some sort of joke she's making. You know how nervous and weird people can be when they try to distill their entire life into a few sentences.\"</p> <p>Dylan chewed on the inside of his cheek. Bad habit. \"Good point. Well, even if she isn't into a nice menage arrangement, she is one fine woman.\" A low whistle escaped from his lips. \"I have a project on my hands now, don't I?\"</p><p>Mike nodded, peering at the screen, eyes lingering. \"You are going to have a lot of competition.\"</p><p>Dylan snorted. \"Like I give a fuck. May the best man win.\"</p><p>Mike went silent, then grinned, his fresh-faced boy-next-door look morphing into a Wall Street trader's predatory smile that made Dylan suddenly uncomfortable for no reason he could pinpoint. \"Yeah. I hope he does.\"</p><p>Ding! The little chat box on the online dating site lit up like a Christmas tree. Laura sucked the last mouthful of her coffee and gaped at the screen. You have got to be kidding me, Laura thought. Already? She clicked and read a message from “9inluvr”:</p><p>Hey, babe. I live in the city and so do you, so let's hook up for some FWB action.</p> <p>She snorted. Oh, sure. Just like that. Yer a catch, Bud. A real romantic.</p><p>Ding! This one was from some guy named Dylan. Before she read the chat she looked at his profile.</p><p>Well hellooooo there, Mr. Firefighter. A thin line of drool formed at the corner of her mouth, an instant response to the picture before her. It was a professional picture, the guy wearing no shirt, a fireman's hat perched at a jaunty tilt. Like a stripper's picture in a firefighter's role. Oh, God. I can't date a stripper, she thought. He'd have nicer g-strings than mine.</p><p>But no – he was a real firefighter. The picture, he explained in his profile, came from a charity bachelor auction he was in. Bachelor auction? How much had he gone for? As she studied the picture she figured it had to be a solid four figures. Hell, she was ready to empty her life savings for a night with this guy.</p><p>On a whim she Googled “Dylan charity bachelor auction firefighter” and her drool increased so much she would soon need a bucket.</p><p>Oh, holy hell. The image search showed the same man, whose name was Dylan Stanwyck, in firefighter's pants, boots, a fireman's hat and suspenders, perched on the floor of a fire station right next to the pole. He was leaning on one elbow and had smears of soot on him, with well-oiled muscles and a smug-ass grin. Whoever set up that photograph needed to be recruited for her company's marketing department because damn – she was ready to use up every available dollar on her credit cards to get a night with him.</p><p>Maybe she could save a bunch of money and just set herself on fire. Or her car. It probably wasn't worth much, but if she found out his schedule and whether he'd be the one responding...</p><p>And he was pinging her on the dating site? She dropped her coffee and scrambled to write back in the chat room.</p> <p>“Hi,” she said, all inspiration and creativity vanishing as the heat forming between her legs apparently melted her brain.</p><p>Hi. I'm Dylan. Nice to “meet” you. :)</p><p>Think, Laura. Think. Man, where was Josie? Of all the times for that girl to be on time to go to work. She needed help figuring out something witty to say.</p><p>Hi. I'm Laura. Nice to “meet” you, too!</p><p>She wrote back. Then he answered:</p><p>You're probably on your way to work analyzing businesses, or businessing analysis, or whatever it is you do ;). I was hoping you might be interested in going out? We can do coffee, maybe? Or go to a nice tapas bar?</p><p>Tapas! Her favorite! But wait – Josie always said any guy who likes tapas must be gay. Laura checked the photo again. No way. And even if Dylan was gay, she would still sleep with him. Cute, polite, and loves tapas?</p><p>Tapas sounds great! When?</p><p>Dammit! Now she sounded too eager. And then he waited. And waited. No reply. Shit! Maybe he was having second thoughts. Or she sounded like a moron. Or he realized he didn't like tapas after all. Or he really was gay. Or this was his cat impersonating him. She began to pace, willing the chat bar to ping. If she stared hard enough, maybe it would come – now! No, now! Or...now!</p><p>Finally:</p><p>Uh, this might seem too eager, but I don't care. I am free tonight. I work a 24 tomorrow, so this is my last chance for a few days. I don't mean to be rude, asking you on short notice, but...please tell me you're free tonight.</p><p>Yes! Yes, yes, yes, she wanted to write. But she needed to play that stupid game, the dance of meeting someone new. Her turn to wait. She reread his message. What was a 24? She puzzled over that one as she chewed on her nailbed, pulling on it until it bled. Brilliant! Screw up your manicure when you have a hot date tonight, Laura.</p><p>Might have. Might have. Don't put the cart before the horse.</p><p>I am free. Prince William is now taken and so I have an opening in my busy social schedule.</p><p>She hit “Send” before she could change her mind. Too cheesy?</p><p>LOL. Sounds great. Meet me at Tempo Bistro after work. At 6?</p><p>Tempo Bistro? The most expensive, chi-chi restaurant in town? Not tapas, either – something she couldn't quite remember. Asian fusion? How on earth could a firefighter afford that? Not your problem, Laura. And she was making terrible assumptions. She needed to assume they were going dutch. Good thing she was a careful saver.</p><p>'lo?</p><p>The chat window pinged. Geez, Laura. Get out of your head. She typed furiously:</p><p>Sounds even better. I'll see you there and you know what I look like.</p><p>And he replied,</p><p>Oh, yes. :P</p><p>What was that supposed to mean? Her eyes swept over the clock – now she had eight minutes to shower. Damn! Laura just shook her head and walked to the bathroom, stripping naked by the time she crossed the threshold and turned on the hot water.</p><p>Sliding under the spray was bliss, the beads of water trailing their way down her body, her hair wet and ropy within seconds, the curl relaxed and the strands stretching long enough to tickle the top of her sacrum. Eh – why not leave the ad up? Who knew. Maybe she'd attract a better breed of guy. Or, at least, a different kind. She eyed the shower head – did she have time? Eight minutes?</p><p>More than enough for the last guy she dated.</p><p>Just enough time for some intimate attention from Mr. Showerhead, though. Josie was wrong. It wasn't her battery bill that was getting expensive. Her water bill, on the other hand...</p><p>Good thing her vibrator was waterproof. As she soaped up she was cognizant of the time, knowing she had minutes to finish. Pulling up the old standby fantasy always worked. Two men, luscious and thickly-muscled, both in the shower with her. Mmmm...</p><p>The extra tip of her vibrator slid along the soft, sensitive skin of her clit as she perched one foot on the tub, opening up for access to slide in her fantasy lover, who was soaping her body with his sculpted, large hands, hands that smoothed over her curves, cupping her ass to pull him toward her, sliding his enormous cock in her while the other nameless, faceless lover kissed her, hard, his tongue lashing against her and exploring as the spray rolled down in rivulets between them, gathering at her folds and adding to the tease on her clit.</p><p>Her passage tightened as she imagined him bending down, on his knees, his tongue now lapping where the vibrator's little antennae tweaked her, not her own hands moving the thick shaft in and out but the lovers', four hands at once on her as one mouth descended on her eager, red nub, the other man thrusting her up against the shower's wall, her body ready for more.</p><p>She tensed, knowing she was so close, craving all these hands, more than enough for two men who wanted and needed her, the familiar muscled cresting of her climax so innate she barely cried out, the release perfunctory but oh, so welcome.</p><p>And, now, the guilt. Because how could a “normal” woman really want two men at once? As she absent-mindedly rushed through the rest of the shower, quickly washing off her trusty toy, a persistent voice said, You, Laura. You.</p><p>Read the rest at Her First Billionaire.</p><p>Her Second Billionaire – a sample:</p><p>Mike knew that there was absolutely no chance that she was going to answer his little chat outreach anytime within the next twenty-four hours. He knew that Dylan had a date with her last night, but hoping against hope and because he was an eternal optimist, he decided to log on while he was having his morning cup of coffee.</p><p>And just to see if maybe – just maybe – she might have answered him, even though it was now six minutes before seven in the morning. He figured she was still in Dylan's bed, probably going on for round seven (knowing Dylan), and there wasn't a chance in hell that she would...wait, what?</p><p>He stared at his phone where he'd logged into the app for the online dating site. Her little icon blinked rapidly – he'd subscribed to her and her avatar had suddenly turned green.</p><p>Oh, holy hell, no! he thought. Hell, yes! a different voice answered in his poor, addled brain. Enough with the ridiculous self doubts – he had to grab his chance now. She was logged on to the dating site early in the morning after a date with Dylan. This meant – oh, the implications stunned him. Made him smirk.</p><p>Mike took a swig of coffee and quickly tapped out:</p><p>Hi, there. Are you on right now?</p><p>She typed back,</p><p>I'm just drinking my coffee and getting ready for work and I logged in and saw your message, so hi!</p><p>Wait a minute. Back up for a second. So if she was at home drinking her coffee, then that meant Dylan had struck out. Ooh! Well that wasn't quite what he wanted. He wanted Dylan to have some success but not to hit a home run. And so it looked like maybe he'd hit a single? A double?</p><p>The app stared at him, as if it were mortal. He quickly punched in:</p><p>Oh, good morning! Yeah, I'm not really functional without two or three cups of coffee myself </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>with a little grin icon.</p><p>See, now, this was the problem with trying to find the right women. He didn't want to be the sloppy second that the women settled for. He wanted someone both he and Dylan could share, equally. When it came to their limited experience trying to find the right, single woman, Dylan had always been the front man and Mike had been the wingman. He was tired of being the wingman. Maybe it was time, really, for the best man to win. That comment to Dylan had most definitely not been just a joke – he'd been very, intensely serious.</p><p>And that man was stepping up to the plate now, ready for his turn at bat. Oh God, he was getting sick of the baseball metaphors.</p><p>The app beeped as she replied with:</p><p>So I see you're like, Mr. Triathlon and ski dude, and my idea of exercise is walking across the room to get the remote.</p><p>Oh, man. She was chatting him up. There was a natural opportunity here and he – he couldn't blow it. He couldn't blow it. He sat there in his boxer briefs, typing away with one finger on his ridiculous smart phone interface and realized that the boxer briefs were getting awfully uncomfortable. Because as he typed, he stared at her little avatar with those sweet dimples, and that amazing, intelligent look on her face and decided that his body's response was telling him pretty much all he needed to know.</p><p>He typed out something that sounded good on the surface, and then the second that he hit enter – augh! – he wanted to take it back.</p><p>lolol, yeah don't be afraid, we could just go for a hike if you want.</p><p>Oh, I think I just asked you out.</p><p>Yeah I did.</p><p>and then he ended it with a question mark.</p><p>Shit, a hike? A hike? God, could that be any lamer? Why couldn't you come up with something romantic? Beating himself up came naturally, and this time he had good cause – a hike? Dylan had taken him up on his advice and taken Laura out to the fancy Asian fusion place that so many of the women they had dated loved to go to but, then again, he could count “all of the women they dated” on one hand.</p><p>All of the women had also flatly and resoundingly rejected what they were offering, which was, he had to admit, pretty unique. However, settling for second best had left them both hollow and incomplete, and now they had an added complication. 2.2 billion of them, to be exact.</p><p>A hike, yeah, I'd like that. That sounds really cool.</p><p>The words sat on the screen like fairy dust, as if some unseen spirit had conjured them from a mystical layer in the universe and plopped them on Mike's phone. Seriously? She said yes?</p><p>She liked the hike idea. Oh, my God. Oh, my God. He sucked down more coffee, the hot liquid helping to regenerate his brain cells, making him come alive and think think think to say the right answer.</p><p>Which was...? Smacking his forehead, he ran twitchy fingers through his hair, his palm grazing a day's growth on his chin. Jesus. She was saying yes! The coffee felt like a pool of hot lead in his gut now as he raced to reply, typing out a response. OK, OK, breathe dude. Breathe, breathe, breathe. What could he say?</p><p>What could he say? Keep it simple. With a shaking finger, he wrote:</p><p>OK. So, how about this afternoon. After work? You wanna do lunch and then go for hike? I know a great spot in this State Park, a nice easy trail, it won't be too hard on you.</p><p>He hit enter and then realized that that was probably one of the stupidest things he could have said, his fingers itching to find some magical “retract” button, a switch he could flip to withdraw his words from cyberspace.</p><p>Fuck! He wasn't implying when she was out of the shape, he didn't mean to... oh, shit. Mike, you idiot! He buried his head in his hands and fully expected her little icon to go away and disappear, and for Laura to think he was just a double failure at this shit, to go running back to Dylan – who knew how to handle women. Then again, if he was that good, why was Laura chatting right now?</p><p>She replied:</p><p>Sounds good. I'll wear my hiking boots, don't worry. I have feet, I can walk, I can use them, I can even move them independently while chewing gum.</p> <p>And funny, too! He laughed and wrote back:</p><p>OK, phew, good to know. I like bipeds</p><p>and typed down his phone number. Laura sent hers back and he realized that he needed to say something, yet had no idea what to say because this was the first time that he had actually found a woman, on his own, without Dylan.</p><p>Yeah, yeah, yeah – technically Dylan had found her, but Dylan had no idea that he was independently pursuing her. The not-inconsequential fact that he had just essentially sniped her couldn't be ignored, either.</p><p>Wow! He just stared at his smart phone, dumbfounded, willing his erection to go away but it wasn't, and there was no hope that it was going to go away. He could tell as he just stared at the blinking cursor.</p><p>Finally she wrote back,</p><p>Hello, hello. Are you there, Mike?</p><p>Oh, Jesus. He startled as he realized he needed to respond, and quickly typed back,</p><p>Yeah, sorry. Not enough coffee yet. So, great, it's a date? And thanks.</p><p>She wrote back a little smiley face, and he realize as he leaned back in the chair that he may have just made the biggest mistake of his life.</p><p>Had she really just made a date less than three hours after sneaking out of another guy's bed? She opened up one of the seventeen texts from Josie which, as she scrolled through them, appeared to all be variations of \"Please tell me about the hot guy.\"</p><p>So she finally decided to put Josie out of her misery and typed out, \"Hey. Awesome night. Will tell you the deets later\", hit “send” and almost instantly got back a response.</p><p>What do you mean later? Hell, no. I'm coming over.</p><p>She wrote back:</p><p>Can't. I'm late for work as it is. Let's just say I need a shower this morning.</p><p>and hit “Send”.</p><p>Squeeeee</p><p>was Josie's reply.</p><p>Do you have another date?</p><p>Do I have another date? Oh, yeah, Josie, I have another date. It's just not with the same guy. Ugh, how was she going to tell her this? She needed two showers. One to wash off Dylan and the other one to wash off her own skank.</p><p>This was getting ridiculous. She typed back:</p><p>There's a lot to this. Will write more later. Come over after work.</p><p>She hit “Send” and turned her phone over, leaving Josie hanging, and padded into the shower. Indeed, it was time to wash off Dylan and her own... er... her own sense of ambiguity? Indecision? Disappointment?</p><p>Revelation? For she had learned so much these past few days, mostly about herself. In some ways, she was surprised to realize, it didn't matter that Dylan was with someone else. In the past, that would have crushed her, but now – now she felt a renewed sense of power. Of strength. Stripping down and turning up the temperature on the shower's spray, she felt her body melt into the hot water, the sting of the jets tearing her away from her looping thoughts, putting the focus back on her body. Rivulets of water streamed over her breasts, down her belly, with its gentle curves and lush skin, pooling at her V and sliding down her thighs, a familiar heat rushing into her womanhood.</p><p>It may have been only a few hours since she'd left his bed, but his mark really was on her. Closing her eyes, she remembered his touch and felt an incongruous sense of guilt. Guilt? He's the one who had a girlfriend or wife. Yet here she was, scheduling a date with a stranger hours after having Dylan in her. On her. All over her.</p><p>The detachable shower head was about to earn its keep. She knew exactly where to aim it, her hands practiced when it came to masturbating. All her normal fantasies, though, weren't cutting it – not the dream about Jake Gyllenhaal, or Matt Bomer, or even Zach Braff. Instead, her mind drifted to Dylan. And Mike.</p><p>As she parted her labia and zeroed the jet spray on her clit, she fought the image of Dylan. And Mike! Both? Yet nothing made it go away. Her body responded to the mere idea of it, of both of them at once, of four hands, two mouths, two cocks all focused on her. Laura. On her needs, on her pleasure, on her discovery. Ahhhhh...</p><p>This was crazy! She hadn't even met Mike yet. Had crawled out of Dylan's bed just a few hours ago, resolved never to see him again. Why was she letting them dominate her fantasies? She still had Dylan's juices in her, his saliva dried on her, his kiss and skin and lips all – well, now that the water washed the night away, that wasn't really true, but her neck tightened as her breasts swelled, her hands holding the shower spray in one hand, centered straight on her clit now, her other hand parting her labia and two fingers slowly entering her, the balance hard to achieve but easier as she propped one foot up on the edge of the tub and leaned back against the shower wall.</p><p>Her fingers encountered slightly sore flesh, her mouth spreading with an unexpected grin as she recognized why it hurt a bit, why the water's sting was so bittersweet. Ah, Dylan – he had been thick and huge and gentle and rough all at once, knowing exactly how to press her skin, tweak her tight spots, play her body to perfect orgasm over and over with his tongue, his lips, his fingers, his hands, and that gorgeous, veined cock.</p><p>Now she had a face for her menage fantasies – Mike's. Why not? Live a little, Laura. No one knew what went on in the privacy of her own mind, her own shower, and as she sighed deeply, the pressure of everything vanquished, she felt a familiar heat and bliss rise up in her as the water pulsed its way into her soul, her clit crying out for more, her fingers sliding in and out of her tight pussy not in a heated rush but, instead, slowly, stroking that spot on the top that always made her clench just a tad harder, made her breath hitch, made her imagine it was Mike's fingers in her, Dylan's tongue strumming her clit, both men eager and ready to enter her at once.</p><p>“Mmmmm,” Mike moaned in her ear, his thick, wiry runner's body sliding next to hers in the shower, beads of water darkening that blonde hair, toned arms lifting her up and plunging her down on his ready cock. And then – was that Dylan's mouth on her ass? Then gently parting her cheeks as Mike lifted her, had her straddle him across the waist as he effortlessly held her in place, strong legs bending slightly so Dylan could...</p><p>She snaked her pinkie finger down so it played with her puckered anus, the mere touch of her fingertip on her perineum enough to tip her over, imagining Dylan filling her, double entry almost too kinky to even let herself dream about.</p><p>“Ah, God, Laura, more,” Dylan groaned behind her, his cock inching slowly inside her ass, Mike's tip pushing hard against her cervix, her body entombed between them as the water sprayed down. When Dylan's mouth found her earlobe she –</p><p>Exploded. The shower head, her pinkie finger on her anus, her fingers exploring her g-spot, and her dream all combined to make her bend down and scream as a mad rush of orgasm pounded her instantly, no warning, no teasing, just a wall of everything that left her gaping, her mouth open and her throat hoarse as she let it all unleash, her shoulders twitching and bashing into the wall, her hands moving and milking this for everything she could find, her mind filled with images of Dylan and Mike simulfucking her, their faces strained and cumming, too, all from her. Her body, her presence – her.</p><p>And then – nothing. Like a switch flipped, she pulled her hands out of all her orifices, turned the shower head off, washed up fast and got ready for work. Sated, but not distracted, she shifted from horny, bewildered single on the dating scene to Business Analyst for the megacorporation.</p><p>That wouldn't last more than a few minutes, for she knew her mind would wander, soon. For now, though, it was a welcome and much-needed break. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mike had no idea what he was supposed to say as he stared at the chat window. This was so out of his element and Laura seemed so out of his league, but he knew he needed to do something. He couldn't let Dylan be the one in charge of yet another woman. They were supposed to share her – that was the entire plan.</p><p>So he had typed,</p><p>\"lolol, yeah don't be afraid, we could just go for a hike if you want.</p><p>Oh, I think I just asked you out.</p> <p>Yeah I did\" .</p><p>And when she typed “Yes,” he couldn't believe it – and panicked. Now he actually had to step forward. Dylan had always gone out and found the women and had been the one to find Jill, and no matter how desperately they both missed Jill, Jill was gone and they had to accept that.</p><p>Laura was pretty much the opposite of Jill, but he could see what Dylan saw in her. That was a sweet smile. She seemed accomplished, and there was something Mike couldn't put his finger on, a genuineness and authenticity, but he and Dylan were not exactly the most conventional package.</p><p>So he worried that maybe a business analyst at Stohlman Industries wasn't going to make the cut – or maybe he was more worried that they wouldn't make the cut with her. The office cubicle type wasn't exactly eager to go out on the slopes or to even watch him at mile marker twenty during a marathon, in his experience.</p><p>But Dylan was giving it a good try and Mike had to, too. The problem was that Mike had to do it in secret. He typed in a few more words, they scheduled the hike, and then she disappeared, off to whatever corporate job she had on whatever floor of whatever giant skyscraper downtown. That world was so alien to him; he worked at a ski resort, and in fact he was missing it already.</p> <p>You don't just work there anymore, a voice inside him said. You own it...</p><p>The season hadn't started yet, but he looked forward to it. He always did every year and when he wasn't skiing he was running. Between the two he kept his sanity somehow, for over the years he had learned that the endorphin kick that came from running and from the massive double diamond trails in the winter were what he needed most. Jill had fit in nicely with his life and with Dylan's life, spending time running with him. Man, was she an ace on the slopes, too.</p><p>She and Dylan had an affinity for action movies, for cooking and...he let himself get nostalgic, even let his eyes well up with tears. Letting the memories flood him was dangerous, his mind tipping over from nostalgia to deep grief, a mourning he'd only recently been able to emerge from, the slam of Jill's inheritance making him ache all over again.</p><p>His body was consumed suddenly by grief at her loss. It hadn't been running, it hadn't been skiing, it hadn't been any of Dylan's crazy antics like sky diving or parasailing that had killed Jill.</p><p>It had been one cell that mutated and mutated and mutated until finally it had taken over her body, the lymphoma wasting her away and neither of them had gotten over her death from eighteen months ago. In some ways Mike had gotten over Jill even faster than Dylan, though Dylan had been the first to go out and find somebody to sleep with. Mike hadn't gone out and broken that physical barrier yet, replacing the memory of Jill's body with someone else's – he just hadn't. Couldn't.</p><p>Eighteen months, though. It had been a long dry spell and he was getting frustrated. Now he finally felt emotionally ready to at least give this a try, and he was more than physically ready. Who knew what the hike would bring? All he knew was that he had to try, and he had to try on his own. He couldn't be the tag along with Dylan. That had complicated their relationship with Jill for far too long. It wasn't until it was too late that Mike realized that it actually hadn't mattered. He had loved Jill. Jill had loved him and they both loved Dylan. And the three of them had made it work, somehow, in their own crazy way.</p> <p>Now the question was, could the three of them – this time with Laura – make it work? He was getting ahead of himself. All that mattered was having one hike with the woman. He just needed to see if this could be his future – their future.</p><p>She had never gone on a date like this – hiking? Meeting Dylan last night had been a very public affair, even if it ended in the very private way. She thought about it and realized that she needed to call in some reinforcements, so she texted Josie:</p><p>Hey, Jose, I have a date tonight. Can you help me?</p><p>Josie texted back:</p><p>Oh, cool, the firefighter? Awesome.</p><p>Laura winced and answered:</p><p>Well, no, not the firefighter. Someone different.</p><p>What?</p> <p>Yeah, it turns out I'm popular on that online dating site.</p><p>Josie texted:</p><p>Hold on, I'm five minutes away from your house – why didn't you tell me earlier? Thought you were late for work.</p><p>I am, but who cares. You have time?</p><p>There is no way you can have that kind of date like last night and now a new date and not give me the juicy details before work.</p><p>Laura walked over to the coffee maker, put the basket in, dumped in some grounds and started what she knew was going to be the first of many cups of coffee today. As promised, Josie arrived within five minutes, barreling through the front door and plopping down her suitcase-sized purse on the kitchen table, eyes ablaze with curiosity.</p><p>\"You slut!\" Josie said it with a tone of admiration, not condemnation, and the expression on her face was so comical it made Laura burst into laughter.</p><p>\"Well, thank you, I guess.\"</p><p>\"No, no, I just mean – damn. So, how does this work? What the hell happened with the firefighter?”</p><p>“He's married. Or has a girlfriend.” Josie's face fell, shifting from eager curiosity to self-righteous anger on Laura's behalf. What a great friend. Laura almost laughed at how bulldoggish Josie looked.</p><p>“How do you know?”</p><p>“Because I woke up in his bed at three in the morning and there were pictures of her everywhere. It wasn't hard to figure out.”</p><p>“Maybe it was his sister?” Josie asked, her voice going up high, as if hopeful and as if there was a snowball's chance in hell it was true.</p><p>“In a bikini at the beach? Being kissed by him? Uh, no. Unless she's Angelina Jolie and he routinely tongue-kisses his sister – ”</p><p>“OK, ewww. Point taken. So the guy is a slimeball and took you home while his girlfriend's out of town. Fucker.” She rubbed Laura's shoulder. “How did you handle it?”</p><p>“I woke up, saw the pictures, freaked out on the inside but stayed quiet, got dressed and almost cried in the cab.” Laura gulped a hot mouthful of coffee down.</p><p>“So you sneak home after ditching a guy in his bed, after sleeping with him within what? Three hours, four – OK, four hours of knowing him. You find out he has a girlfriend, with pictures of her plastered all over his room, so you decide you're going to come home and write him off and...now you have a date with another guy?” Josie's expression was, to say the least, comical. It was like a graphic of a “what the fuck” emoticon.</p><p>Only in real life.</p><p>“It is pretty freaking amazing,” Laura agreed, nodding absentmindedly as she added two spoons of sugar to her coffee. She hadn't consumed coffee with sugar since tenth grade. Since returning home from her date, though, she'd been doing a lot of out-of-character things, including dating two men on the same day.</p><p>“Spill it.”</p><p>“I came home, was about to shower, and this guy IM'd me on the dating site. I had just blocked Dylan, actually, and made sure he wasn't in my 'Favorites' anymore. So then Mike – ”</p><p>“Suddenly some guy pops up in the chat window on this website and asks you out?\"</p><p>“Yes.”</p><p>“Worth it?” That was code for whether he was attractive.</p><p>“He looks like that actor who played Thor in the movie.”</p><p>Josie's jaw dropped. “Not fair! When do I get Captain America hitting on me?”</p><p>Laura laughed and dumped her coffee, pouring a fresh cup. She started to tremble inside, the urge uncontrollable. It was all too much, too intense, and spelling it out for her best friend was making it all too real.</p><p>“What's he do for a living?”</p><p>“Ski instructor,” Laura mumbled as she hurried to fill her mouth with more coffee and delay the interrogation. Josie rolled her eyes.</p><p>Her friend poured herself another cup of coffee, glanced at the clock and said, \"Oh shit, I'm late for work, but I don't care, this is, this is – this is awesome! Way, way better than any movie. Plus I have a front seat view!\" They both winced at each other and Josie added, “Uh, you know what I mean. Not literally.” She shuddered.</p><p>\"I'm so glad that I'm meeting your entertainment needs.\"</p><p>\"Come on, what kind of life do I have? I haven't had sex in seven months. I have to live vicariously through you.\"</p><p>Laura snorted, \"Well, it serves you right after years of doing it through you. It's only fair.\"</p><p>Josie hung her head in mock shame. \"Well, yeah, OK, fair enough, but lay off the years comment. I haven't gone through that many men.\"</p><p>“I beg to dif – ”</p><p>“Shut your whore mouth!” Josie threw half an English muffin at Laura's head and, with catlike precision, she dodged it, both women howling with laughter.</p><p>Laura paused, thought for a moment, and said, \"You know, you can open your own profile and see what pops up. To solve that seven month problem you've got going on there.” She gestured vaguely at Josie's torso.</p><p>\"Oh, I've seen what pops up. You know the phrase, 'shit floats'?\"</p><p>Laura just laughed. Ouch. Then again, Josie's last date had been from an online dating site. Turned out to be a sixty-year-old neocon Tea Party activist who used a Groupon for dinner and made Josie pay her half before the coupon. Capitalism at its best – he'd made money off their date. And all Josie had to remind her was a lovely restraining order when the guy wouldn't leave her alone.</p><p>\"So when is the date?\"</p><p>\"Tonight.\"</p><p>\"Tonight?\"</p><p>\"Well yeah, right after work. Mike says there's enough daylight to make the climb in ninety minutes.”</p><p>“The climb?”</p><p>“We're hiking. One of those hills at the state park outside of town.” If Josie rolled her eyes any harder they'd pop out and wander down the hallway out into the street.</p><p>“He hikes, too?”</p><p>“He's a triathlete.” Laura coughed, the unveiling increasingly ridiculous. Was any of this really happening?</p><p>“So wait a minute, Mr. Ski Instructor Gorgeous Triathlete Thor Lookalike chats with you for a couple minutes this morning and already tonight, you,” Josie looked her up and down as if surveying her from hair down to toes, “who are about as athletic as a slug, are going on a hike to the top of one of the biggest hills outside of the city where you will eaten to death by mosquitoes, you will become sweaty and ridiculously tired and then...”</p><p>“You're so flattering,” Laura muttered.</p><p>“What? You’re gonna what? Climb a mountain, Laura? You have a heart attack when you can't find the remote and have to actually stand up to change the channel.” That gave Laura a reason to pause. What the hell was she going to do? By the time she met up with Mike it’d be six at night. He said it was a ninety minute climb to the top. Granted, it was summer so there was plenty of sunlight until nine or so. But what had she gotten herself into? Did she even own hiking boots? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Josie continued, “Do you even have any shoes that are going to work with any kind of an outfit for climbing a mountain?”</p><p>Laura just stared at her as if she’d been reading her mind. “I guess I’ll have to figure that out. All I know is I’m kind of in a super-emotional state right now, Josie. I got an unsolicited chat yesterday morning from a hot firefighter. Went out with him to one of the trendiest restaurants in town and ended up in his bed. When I woke up, I was surrounded with pictures of a women who looked like she was a combination of a beach volleyball player and a surfer. Which I'm not. Ever. At all. It will take me four lifetimes to ever be like that. I slumped out of there and then – boom! – I come home and there's a chat from another guy. I, I don't even have time to think. I don't even know what to I'm supposed to think. All I know is I'm just saying yes to it all. I'm saying yes to life, I'm saying no to doubt and I'm just grabbing the brass ring and – ”</p><p>Josie interrupted her. “And you're throwing out the clichés, like you're talking a mile a minute, you won't throw out the baby with the bath water, you aren't going to count your chickens before they've hatched, like you're ...”</p><p>“Oh, shut up.”</p> <p>Josie stopped and put her hand on Laura's arm. “Just be careful.”</p><p>“Oh, no, it's fine. I've got condoms.”</p><p>“No, that's not what I'm talking about. You...I just don't want your heart broken again. You deserve – you deserve everything that's going on right now. You certainly deserve to be able to fuck two hot guys in twenty-four hours.”</p><p>“I'm not going to do that.”</p><p>“Well,” Josie wiggled her eyebrows, “I would.”</p> <p>“Yeah, I know you would.”</p><p>“But I'm not you, Laura. And I'm just saying, be careful with that heart of yours. You – you know what I mean.”</p><p>Laura sighed. “Yeah, I know what you mean.” She squared her shoulders, took in a deep breath, let it out. A nice cleansing breath. “I'm saying yes. I'm saying yes.”</p><p>“Great. Will you buy coffee this time on our way to work? I really need a triple latte.”</p><p>“What?” Laura shook her head as if clearing it. What was Josie talking about?</p><p>“You said you're saying yes. Say yes to buying me an overpriced coffee. Say yessssssssss.....”</p> <p>She waved Josie off and got out of the chat window and did what every woman does in the twenty-first century after being contacted by a guy from an online dating website. She Googled him, just as she had Googled Dylan.</p><p>“Wow. What a strange set of results, Josie. Check this out.” Her friend craned over Laura's shoulder to see the screen. Mike's name appeared over and over, followed by a bunch of numbers. Some sort of times, like a race? Wait. The Tri-state Marathon. The Sunshine Regional Triathlon. Oh, my God. He wasn't kidding.</p><p>He really was a triathlete. More than that – he was a steady, longtime triathlete. This wasn't some guy who did it once for bragging rights.</p><p>She knew that guys could shine her on, that people lied in online dating sites and they often talked about being athletic – which was code for I watch TV on Sundays when the football game is on as an excuse to eat wings.</p><p>But this guy was the real deal. Page after page – she had to go twelve pages in before she found anything other than some race time. According to the dates, this guy had been doing this for at least the past ten years. Then she found a ski resort page. He worked at the ski resort. That's what he told her, so he had been telling the truth. He was a ski instructor and first aid person. Interesting. That was as different from her life as you could possibly get. Same with Dylan.</p><p>She pushed aside thoughts of Dylan. Dylan was, as far as she was concerned, off her radar screen. He may still be lingering on her skin in that deep, sensitive part of her belly, and the scent of him might still be on her sweater – and maybe in the crook of her elbow, and behind her earlobe and –</p><p>Oh stop it, Laura, just stop it. The guy had a girlfriend. He was trolling the online dating sites, probably just to find a one-night stand or because he was a sex addict or – who knew? No more Dylan. In fact, she had blocked his number on her phone, removed him from her “Favorites” on the online dating website, and she was 100 percent done. Just wrote him off. No more Dylan.</p><p>Mike, on the other hand – Mike was new. Fresh. Untainted. What could she learn from Mike? Some protective voice inside her said, Are you a complete and utter moron? You’re going to go at twilight, during dusk, and walk a multi-mile trail in the woods with some guy you’ve never met yet – are you crazy?</p> <p>Josie knocked her out of her reverie. “He seems interesting. I'm trying to imagine you running a – ” Josie gasped, “ – marathon.” Wheezy laughter. “Uh...I just can't.”</p><p>“You just lost your free latte.”</p><p>\"You know me, I'm a fast metabolizer of caffeine – that's what my genetic testing showed me. You have to get me one! This – ” she pointed to the cup of coffee Laura had just made her – “isn't enough!” She mooned a begging face.</p><p>“Did your genetic testing show that you consume enough caffeine to mimic a sun-addled mosquito on crack every day?\"</p><p>\"Yes.\"</p><p>\"Really?\"</p><p>\"Yes, it did.\" Josie nodded soberly. \"And so therefore, that explains why I need you to buy me a triple latte, Miss I'm Going to Say Yes to Life.\" Josie frowned, \"So was the sex any good last night?\"</p><p>\"What?! Why are you asking me that?\"</p><p>\"Well, we're talking about saying 'yes,' so it seemed like a natural segue...\"</p><p>\"Of course it was good.\" Laura rolled her eyes, her chest heaving a bit as she sighed deeply. \"Too good.\"</p><p>\"What do you mean, too good? Is that possible?\"</p><p>“Well, it's too good when it turns out he has a girlfriend. He was just, phew – oh boy, Josie.”</p><p>“The best you've ever had?” Josie asked.</p><p>“Well,” she sighed heavily. “Yeah.”</p><p>“You're sure he has a girlfriend?”</p><p>“The pictures made it clear.”</p><p>“Damn. Well, maybe you can say 'yes' to this guy you're seeing tonight.”</p><p>“Yeah.”</p><p>“Yes.”</p><p>Huff, huff, huff. Laura was more out of shape then she'd ever imagined. Her idea of exercise was lifting her hand from her mouth to the bag of Doritos or lifting the spoon out of the pint of Ben &amp; Jerry's. No, she chided herself, that wasn't really true. She took the stairs at work, and that wasn't a joke, considering the fact that she worked on the thirty-second floor. And she and Josie power walked around her neighborhood (Josie jokingly called it their Mugging Prevention Program), but this kind of sustained, prolonged effort that used muscles that involved the hard work of uneven terrain, hiking along the trails and the woods? This she wasn't used to.</p><p>And that was OK. Really. Mike was a sweetheart who slowed his pace down and who was absolutely, fantastically interesting. Talking about everything from books that Laura hadn't read since college, but had always loved, to movies – who knew he had a Christopher Guest obsession, too? She couldn't wait for a second date where they could sit and watch Best in Show, and she could enjoy having that someone finally who appreciated the humor.</p><p>Second date? She was getting ahead of herself.</p><p>And she really liked that.</p><p>\"Laura, are you OK?\" Mike asked, a look of concern covering his face as she wheezed slightly while rounding a bend and staring at the tall hill leading to the summit. Too tall. Too high. Too little air. Ah, hell. What had she agreed to? Huff huff huff.</p><p>\"Oh, I'm fine,\" she lied. \"Just not used to these tall hills. I'm more accustomed to doing eleven street blocks downtown while carrying my morning latte. Not hiking up a steep mountain while carrying a stainless steel water bottle. I'm adjusting, though – I'll be good.”</p><p>He smiled and stared at her. \"You're a good sport you know?\"</p><p>\"I have to be. I don't think I have the oxygen to run away.” </p> </body></html>"]