["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Born to impoverished Irish immigrant parents at the turn of the century, James Cameron Patrick Gallagher entered this world with a large chip on his shoulder.</p><p>It didn't help any that he was birthed in the backroom of a sweatshop that should have been condemned, to a timid, fretful woman who'd been forced to return to work just hours after she had delivered him into the hands of his nervous, alcoholic father. A father who was indifferent to the boy at best and violent at worst.</p><p>From the moment of that first wail forward, Jamie spent his life fighting for respect. Fighting his way out of the poverty that haunted him as he grew up in the Irish slums of New York.</p><p>At age fifteen, he found his way out.</p> <p>The year was 1916 and two important events happened to him. His father died after he slipped and fell into the river on his way home from a three-day drinking binge. Two weeks later, Jamie went to work for the renowned gangster Ally Malone so that he could support his mother and eight younger siblings. A thug and a bully, Ally had shown him a way to make money that had made Jamie's poor mother's knees ache from the untold novenas she had prayed for her son.</p><p>But that was okay as far as Jamie was concerned. His new lifestyle afforded him the ability to buy his mother silk pillows to cushion her work-worn knees, and instead of praying with a cheap wooden rosary, she now had one made of gold and ivory.</p><p>It was a rosary she'd thrown in his face the day she had learned the real truth about her son: Jamie wasn't a poor innocent lad being led astray by those out to take advantage of him. By the time he was twenty, he was a fierce gangster to be reckoned with.</p><p>Disowned by his mother, he'd given his younger brother a reputable job so that Ryan could care for the family without their mother knowing it was Jamie's ill-gotten gains that kept them all fed.</p><p>Jamie had learned to harden his heart and to care for no one or nothing. He became Gallagher. A man who had no other name. One who let no one near him, let no one know him. He was ice-cold and rock-solid.</p> <p>Until the day Rosalie had come into his life and chiseled away his granite casing. The daughter of Portuguese immigrants, she had been walking home from an all-day Mass.</p><p>Jamie had stumbled over her in his haste to catch up with a \"business\" associate he needed to take care of.</p><p>It had been a cold winter evening with snow falling down on the city. February 11, 1924—a date that was branded into his heart and mind for all eternity. The minute Rosalie had turned her dark brown eyes on him, his entire body had been consumed by fire. For the first time in years, he felt something more than cold, blind hatred.</p><p>\"I'm so sorry,\" she had whispered in her exotic accent, brushing at his expensive, handmade suit. \"I didn't see you for the snow.\"</p><p>\"It was my fault,\" he hastened to assure her. No doubt any other man in his position would have hit her or yelled at her. That thought sent a wave of unreasonable fury through him.</p><p>She was a complete stranger and yet he felt possessive toward her. Respectful. Two emotions he'd never accorded any woman not related to him.</p> <p>\"Rosalie!\" her mother had snapped as she came back for her daughter. \"You do not talk to such men. How many times must I say that to you.\" She took Rosalie by the arm and offered him a pleading, servile glance. \"Forgive my daughter,senhor . She is young and foolish.\"</p><p>\"It's fine,senhora ,\" he said quickly. Then he met Rosalie's wide-eyed stare. She was truly beautiful. Her black hair was braided and coiled around her head, exposed to him when her church veil had fallen off after they collided. Her dark brown eyes were pure. Innocent. Completely unspoiled by the bloody violence that made up his life. Most of all, her eyes were kind.</p><p>He didn't want anything to sully that gaze. To make it hard and cold. Bitter.</p><p>Like his.</p><p>\"May I have permission to court your daughter?\" The words were out of his mouth before he could stop them. Her mother's expression was one of pure horror. White Irishmen didn't court Portuguese women. Society would never tolerate such a thing.</p><p>\"No,\" she said sharply, hauling her daughter away from him.</p><p>Jamie might have taken no for an answer.</p><p>Gallagher didn't.</p> <p>It had cost him well over one hundred dollars in bribes to locate Rosalie, but she had been worth every cent of it. Regardless of her parents, his associates, and society as a whole, he had made her his wife on June 17, 1925.</p><p>Rosalie alone had known Jamie. And he had died trying to get to her side while she struggled to bring his one and only child, his son, into the world.</p><p>It had been a cold snowy night then too. Just days before his thirty-third birthday. He'd known the authorities were after him, had known he had a mole in his company even though he had been trying to go straight.</p><p>None of that had mattered.</p><p>Rosalie had needed him, and he had refused to let her down.</p><p>It was a decision that had cost him his life and his soul.</p><p>SEVENTY YEARS LATER</p><p>NEW ORLEANS</p><p>Gallagher frowned as he felt something tickling his lower back. It was a sensation that he'd learned years ago signaled a Daimon was nearby. He turned his one-of-a-kind 1932 Bugatti Atlantic Aerolithe down a side street and parked it.</p><p>Oh yeah, the feeling was there, even stronger than before. He left the car and paused as he got his bearings. In the last seventy years, he'd only been to New Orleans a handful of times, and though the city didn't change much, it still took him a couple of minutes to remember the lay of the French Quarter.</p><p>The moonlight filtered down past the wrought-iron railings and hanging plants to illuminate the old brick of the buildings. Faint laughter and music could be heard as well as cars hissing by. He cocked his head to listen, hoping for a sign of where the Daimons were.</p><p>A scream rang out.</p><p>Rushing off after it, he tore through the back alleys until he found the young woman near a garbage pile, surrounded by four male Daimons while a fifth Daimon had already sunk his fangs into her neck.</p><p>Infuriated, Gallagher rushed them. They charged him in unison, not that it did them any good. A couple of well-placed blows and one quick stab to their chests, and they were history.</p><p>Gallagher ran to the woman and knelt down by her side. Gently, he turned her over to find a girl no older than twenty. He cursed at the fate that had brought her into the path of the Daimons.</p><p>Luckily she was still alive, even though she was struggling to breathe. He pulled his monogrammed handkerchief out of his coat pocket and used it as a makeshift tourniquet over her vicious neck wound.</p><p>Moving quickly, he carried her back to his car, then rushed her to the nearest emergency room where he learned that the hospital staff wasn't big into admitting unknown women who were carried in by strangers in bloodstained clothes.</p><p>Once he had Nick Gautier on the hospital phone with the clerk and he was sure the unknown girl would be cared for, Gallagher took a deep breath.</p><p>He hung around the hospital, wanting to make sure she would live. Anxious and unable to just sit while the staff tended her, he found himself wandering around the corridors. The place was really decked out for the holidays. The green and red garlands and poinsettia cut-outs added a warmer feel to the antiseptic white. A couple of nurses and young female visitors smiled invitingly at him as he passed by. But then, women always had. At six-foot-four with black hair and eyes, he was well-muscled and hard-edged. The kind of guy that dames tended to notice.</p><p>He'd never been vain about it. It was just a fact of life that women liked to look at him and often propositioned him. And though he'd been tempted a time or two over the decades, he had never touched another woman.</p><p>Not so long as his wife had lived. Gallagher might have broken every law on the books, but he had never broken a single vow. Especially not one made to someone he loved. Even after Rosalie's death, he still hadn't felt the inclination to touch another woman. So Gallagher just nodded kindly to them and kept walking.</p><p>Before long, he found himself on the pediatric ward. His stomach knotted as he realized where he was. There had been a time once when he'd hoped to come to a hospital to see his son.</p><p>He'd never made it.</p><p>Hurried and not thinking, he'd left his office building at a dead run and had been trying to get into his car when he'd found himself surrounded by cops.</p><p>Gallagher, who had never backed down from a fight, had held his hands up. For Rosalie's sake, he'd been willing to surrender to them.</p><p>They had shot him dead in the street like a rabid animal.</p><p>Unable to deal with the memory, Gallagher was just about to turn around and leave when something odd caught his eye...</p><p>He saw a strange-looking elf dressed in a red Santa shirt with a very short red skirt, and red-and-white thigh-high stockings that vanished into a pair of scuffed-up black combat boots. She sang to a group of kids with a voice that would rival a heavenly choir for its melodic beauty. The woman was tall and in a freakish way extremely attractive, with eerie, reddish-brown eyes that must have been some kind of contact lenses, pointed ears, and hair that was jet black and streaked with red.</p><p>But what floored him most was the man with her.</p><p>Acheron Parthenopaeus. The glorified leader of the Dark-Hunters sat on the floor, surrounded by children while he played a black guitar and sang chorus to the woman's lead.</p><p>Gallagher was stunned by the sight. In all the years he'd known Ash, he had never seen the man relaxed. Normally, Acheron had a presence about him that was decidedly lethal and cool. One that warned people to keep their distance if they wanted to live.</p><p>But that wasn't the Ash he saw now. The man on the floor looked more like a kid himself. Approachable and kind. Ash's deep voice mingled with the elf's as they sang Jackie Deshan's \"Put a Little Love in Your Heart.\"</p><p>\"Now there's a sight you don't see every day, huh? Two punked-out Goths throwing a Christmas party for sick children.\"</p><p>Gallagher turned to find a middle-aged African-American doctor beside him. She looked tired, but amused, as she watched Ash and his elfin helper with the children.</p><p>\"You've no idea,\" he said to her.</p><p>The doctor smiled. \"I have to admit it took me some getting used to when I started working here a few years ago. I thought they were joking when they first told me about the Goth Guardian Angel and his children's fund.\"</p><p>Gallagher arched a brow at the nickname. \"So he comes here a lot?\"</p><p>\"Every few months or so. He always brings gifts for the children and staff, and then plays with the kids for awhile.\"</p><p>Gallagher couldn't have been more stunned had she told him Ash routinely burned the hospital to the ground. \"Really?\"</p><p>\"Oh, yeah. We figure he must be some rich kid with a need to do some good. The darnedest thing is, whenever he comes, the kids become perfectly calm and serene. Their blood pressure goes down and we never have to give them any painkillers while he's here. After he leaves, they sleep comfortably for hours. And best of all, the cancer patients go into remission for several weeks afterward. I don't know what it is about that young man, but he really makes a difference in their lives.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Gallagher could understand that. Even though Ash could be terrifying, there was something oddly comforting about the Atlantean.</p><p>The instant Ash realized he was there, he saw the veil come down over the man's face. The humor faded, and Ash stiffened noticeably. Ash became the grim, take-no-prisoners leader that Gallagher was well-versed with.</p><p>As soon as the song was finished, Ash handed his guitar off to one of the older children and excused himself. He stood up and left the room with a loose long-limbed, predatorial gait. Ash's face was impassable as he crossed his arms over his chest and approached Gallagher.</p> <p>\"St. Ash—who knew?\"</p><p>Ash ignored his comment \"What are you doing here?\"</p><p>Gallagher shrugged. \"I was just passing through.\"</p><p>He cocked his head. \"Passing through? Last time I checked, Chicago was north of Baton Rouge, not south.\"</p><p>\"I know. But since I was so close, I just wanted to stop in at Sanctuary and wish everyone a Merry Christmas.\"</p> <p>Ash listened to Gallagher's thoughts and let the man's emotions wash through him. Jamie's wife had died of old age this past summer, and her death had hit the Irishman hard.</p><p>As soon as he'd \"heard\" about her death, Ash had gone to Jamie immediately only to find out that Jamie had broken his Code of Conduct and visited her while she'd been in the hospital. Ash had chosen to overlook the breach. He might not have ever known the love of a human being, but he did understand those who were lucky enough to have it.</p><p>\"Tell you what, since you're here, why don't you just stay on until after the New Year?\"</p><p>Jamie scoffed at that. \"I don't need your pity.\"</p><p>\"It's not pity. It's an order. Since Kyrian is retired, Talon could use an extra hand. Things get rather rowdy this time of year. Lots of Daimons head down south where it's warmer and people are out for New Year's.\"</p><p>\"Are you full of crap or what?\"</p> <p>Before Ash could answer, the elf woman came out of the room holding a young toddler to her hip.</p><p>\"Akri?\" she said to Ash in strange sing-song kind of voice. \"Can I keep him?\" She patted the plump leg that was exposed from beneath the hospital gown. \"See, he good eating. Lots of fat on this one.\"</p><p>The dark-headed toddler laughed.</p><p>\"No, Simi,\" Ash said sternly. \"You can't keep the baby. His mother would miss him.\"</p><p>She pouted. \"But he want to go home with the Simi. He said so.\"</p><p>\"No, Simi,\" Ash repeated.</p><p>She huffed at him. \"No Simi, no food. Nag, nag, nag. Does your daddy nag you too?\" she asked the boy.</p><p>\"Nope,\" he said as he pulled at one of the black and red horns on top of her head.</p> <p>Ash sighed. \"Simi, take the baby back inside.\"</p><p>She moved to stand before Ash. \"Okay, gimme a kiss and I'll go.\"</p><p>Ash looked extremely uncomfortable as he glanced at Gallagher, then back at her. \"Not in front of the Hunter, Simi.\"</p><p>She made a strange animal-like noise as she looked at Gallagher. \"The Simi wants a kiss,akri . I'll wait all century. You know I will.\"</p><p>To say Ash looked peeved was an understatement. He leaned over and kissed her quickly on the brow.</p><p>She beamed proudly, then trotted off with the child.</p><p>\"Who is that?\" Gallagher asked. \"Or should I say,what is that?\"</p><p>\"In short, she's not your concern.\" Ash rubbed his hand over his forehead as if he were in pain. \"Where were we?\"</p><p>\"I asked why you were giving me temporary duty in New Orleans.\"</p><p>\"Because Talon could use a hand.\"</p><p>\"I wonder what Talon would say?\"</p><p>\"He would tell you not to piss me off.\"</p><p>Gallagher gave a half laugh at that. \"All right then. I'll take it under advisement.\"</p><p>Ash watched the woman in the room with the kids. \"You can camp with the Peltiers at Sanctuary. Right now I better go before one of those kids ends up on a milk carton.\"</p><p>Gallagher watched as Ash rushed into the room to take a little girl from the elf and then set the child aside. The elf danced away and moved on to another child.</p><p>Shaking his head at the oddity, Gallagher headed for the elevator to go back below and check on his patient. The nurse told him she would be fine. Gallagher let out a relieved breath.</p><p>The nurse stood up and patted his arm. \"Come on,\" the woman said, inclining her head toward the back. \"She wants to thank you.\"</p><p>\"I don't need any thanks.\"</p><p>\"Sug, we all need thanks. C'mon.\"</p><p>Before he could stop himself, he let the nurse lead him back to a small emergency room that had curtained walls. The petite brunette sat up on her stretcher with an oversized bandage on her neck. Her large green eyes were a bit dazed, but they brightened as soon as she looked up to see him. The nurse left them alone.</p><p>\"Are you the man who saved me?\" she asked.</p><p>Feeling awkward, he nodded.</p><p>The girl fidgeted with the blanket that covered her. \"Thank you. Really.\"</p><p>\"My pleasure. I'm just glad I found you when I did.\"</p><p>\"Yeah, me too.\"</p><p>Gallagher turned to leave. \"Well, I need...\"</p><p>His voice trailed off as a lovely young woman came through the curtains. She was tall, probably around five-ten or so with jet-black hair and deep blue eyes. \"Jenna!\" she cried as she saw her friend on the stretcher. \"Oh thank God, you're okay. The lady on the phone said you'd been attacked.\"</p><p>Jenna's eyes teared up. \"I don't know what happened. I was just going out to my car, and I don't remember anything after that. If not for him, I'd probably be dead.\"</p><p>The girl turned around and froze. She looked at him as if she'd just seen a ghost.</p><p>Gallagher stared back defiantly. \"Something wrong?\" he asked.</p><p>She frowned. \"No.\" She waved her hand around as if feeling silly. \"I'm sorry, you just remind me of someone.\"</p><p>\"Old boyfriend?\"</p><p>\"No, my great-grandfather.\"</p><p>\"That's not particularly flattering. I thought I looked rather good for my age.\"</p><p>She laughed at that. \"No, I mean... oh, never mind.\"</p><p>Jenna cocked her head as she looked at him. \"He does look like him, Rose. You're right.\"</p><p>Rose. The name hit him like a blow.</p><p>Before he could move, the girl named Rose approached him. She pulled out an engraved gold locket from underneath her brown sweater. It was a locket he knew intimately. Right down to the garnet and diamonds that formed a circle on the front of it, to the inscription on the back.</p><p>For my Rose.</p><p>Happy Anniversary 1930.</p><p>She opened the locket to show him the two pictures inside. One was the photograph Rosalie had requested he have made just months before he died and the other was of his son at age two. \"See,\" the girl said, showing him the photograph. \"You look just like my Grandpa Jamie.\"</p><p>His heart aching, Gallagher swallowed. He wanted to reach out to touch it, but his hands shook so badly, he didn't dare. \"Where did you get that?\"</p><p>\"My great-grandmother gave it to me last spring. Since I was named after her, she wanted me to have it.\" She smiled sadly and then closed the locket and returned it to rest under her sweater. \"My father said Grandpa Jamie was a gangster, but I don't believe it. Gram Rose would never have married someone like that. She was a saint.\"</p><p>It was all he could do to breathe. To not crush her into his arms and weep. His great-granddaughter.</p><p>Rosalie.</p><p>This vibrant young woman was his living tie to his wife. When he spoke, his voice was thick and deep. \"She must have loved you a great deal to give you that.\"</p><p>\"I know. She wore it every day of her life until she gave it to me. It's just weird, you know? You looking so much like him and all.\"</p><p>Gallagher cleared his throat. \"Yeah. Weird.\" He couldn't take his eyes off her. He didn't see much of himself or Rosalie in the girl, but he felt the bond of kinship deep in his heart.</p><p>She was his family. And he could never tell her. Just as he had never been able to tell her father or her grandfather.</p><p>Gallagher had bartered his soul for vengeance and then been forced to step back into the shadows and surrender the care of his family over to strangers. But at least the Squire Council had been there. After Gallagher had become a Dark-Hunter, they had sent in people to make sure his family survived.</p><p>The government had taken everything from Rosalie. Confiscated even his legitimate assets and left her destitute. The Squires had given her a job, and after a few years, they had sent in suitable beaux to date his wife and one of them had finally married her.</p><p>While Harris had lived, he had sent Gallagher updated photos and news about Gallagher's son and grandchildren. The Squire's Council had ensured the safety and well-being of his family while he had gone about his business of hunting and killing Daimons.</p><p>Ash had warned him how hard it would be.</p><p>\"So long as you have direct descendants still living, it will haunt you. But it does get easier... in time.\"</p><p>Other Hunters had told him the same thing, but right now with his great-granddaughter standing before him, he didn't believe it. God, it was so unfair.</p><p>Or maybe this was his atonement for living the violent life he had chosen.</p><p>Always an outsider. A part of the world, but not in it. He winced at the truth.</p><p>Weary and hurt, he excused himself from the girls and made his way out of the hospital. The street outside was virtually empty. The late hour had sent everyone home seeking warmth. Comfort.</p><p>He doubted if he would ever feel either again.</p><p>When he pulled into the private garage that was across the street from Sanctuary, Elizar Peltier came out of the back door and stopped. The man's long, curly blond hair was pulled back from his face. He wore a pair of black chinos and a baggy black sweater.</p><p>\"Jamie Gallagher,\" he said slowly. \"I'll be damned.\" He turned and called into the open door, \"Kyle, go tellMaman to put on a plate of corned beef and cabbage. We have a Dark-Hunter in need of food.\"</p><p>Gallagher nodded his thanks. \"Hi Zar, it's been awhile.\"</p><p>\"About thirty or so years, I think, since we last had the pleasure of your company.\"</p><p>Time was truly fleeting to an immortal. \"Yet you still remember my favorite food.\"</p><p>Zar shrugged. \"I never forget a friend.\"</p><p>Neither did Gallagher. They were too few and far between.</p><p>Zar led him to the building next door to the Sanctuary bar. Built at the turn of the century, Peltier House was the home of the Katagaria family and their hodgepodge group of refugees. The house connected to the bar through a downstairs door that was guarded at all times by one of the eleven Peltier sons.</p><p>In the Hunter world, they were legendary because they greeted everyone as friends: Were-Hunters, Dream-Hunters, Dark-Hunters or others. It mattered not. So long as you minded your manners and kept your weapons concealed, they let you enter and leave in peace. Those who broke the one house rule of \"No Spill Blood\" quickly found themselves leaving in pieces. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The elegant Victorian mansion was quiet now except for the muffled sound of the Howlers playing on the stage next door in the bar. It was furnished in expensive turn-of-the-century antiques that had been in the house since they were new. The bear clan didn't like change. Gallagher was glad for that. It felt strangely like coming home again.</p><p>\"How long are you staying?\" Zar asked as he led him up the hand-carved mahogany stairs.</p><p>\"Until the New Year.\"</p> <p>Zar nodded. \"Mamanwill be glad to hear that.\" He showed Gallagher to a room at the end of the hallway.</p><p>Gallagher stepped inside and found a warm, cozy bedroom. The windows were well-shuttered and covered by heavy drapes that would keep the daylight from reaching him.</p><p>\"Here's a cable modem for your laptop if you brought one.\"</p><p>The corner of Gallagher's mouth lifted. \"All the comforts of home.\"</p><p>\"We try. I remember well the days of running and hiding, and never having a single comfort. Take a few minutes to get settled in and join us when you're ready.\"</p> <p>Gallagher watched Zar leave while feelings and memories went through him. He appreciated the bears' courtesy, but he would trade all his money and immortality for one single night spent with his wife and son.</p><p>One single Christmas with them, watching Rosalie's face light up as she opened a gift.</p><p>The pain of his loss racked him. He didn't want to hurt and wish for things he could no longer have. He sat on the bed and stared at the wall. He saw his great-granddaughter's face and wondered if she would go home at Christmas to be with her family.</p><p>For that matter, he wondered if he should go home himself. At least Chicago was familiar to him. Weary and heartsick, he lay down on the bed to just rest for a second. He only wanted to escape for an instant into memories of a time when he had been human.</p><p>Gallagher woke up to find that three days had passed while he slept. He didn't remember anything about his dreams.</p><p>\"Why did you let me sleep so long?\" he asked Mama Peltier as soon as he left his room and found her in the downstairs parlor on the right.</p> <p>In human form, she was an elegant, tall blonde woman who most often wore a stylish suit. Though she looked no older than forty, she was in fact close to eight hundred years in age.</p><p>\"Acheron said you needed to rest and I agreed.\"</p><p>\"But three days?\"</p><p>She shrugged. \"Do you feel better?\"</p><p>Strangely, he did. At least physically.</p><p>It was just after dark on Christmas Eve. The bear clan was slowly filing down the stairs and gathering into the two main parlors where dual twelve-foot-tall pines were decorated.</p><p>Gallagher stood back, watching the whole crew of Katagaria and Arcadians who made Peltier House their home, gather around for the coming celebration. The tiny bear cubs climbed over presents and tried to eat and climb up the trees while their fathers and mothers, in human form to make Gallagher feel more at home, pulled them back. Justin Portakalian came down in his panther form and picked up one of the smaller cubs by the scruff of his neck and rolled him playfully across the floor.</p><p>It was the most bizarre Christmas gathering Gallagher had ever seen in his one-hundred-plus years of living. He felt even more out of place than he had felt three days ago when he arrived. As members from The Howlers came in to join the party, Gallagher decided he needed a breath of fresh air and a moment of quiet to clear his head. He headed out into the cold dark night and drifted aimlessly through the French Quarter. Before he realized it, he was outside the St. Louis Cathedral.</p> <p>It had been a long time since he'd last been in church. There were only a few people headed inside. No doubt most of the parishioners would wait until the Midnight Mass. He started to turn away, but instead found himself heading inside with the others.</p><p>The foyer was dark, but his Dark-Hunter sight saw the interior clearly and he moved toward the small font of holy water that rested on the wall to his left, just beside the church store. He blessed himself, then opened the dark wood doors that led into the cathedral. The beauty of the stained glass and statuary immediately took him back to the days of his youth.</p><p>Gallagher genuflected, then sat down on the last row. Here, he felt his Rosalie. Devout, she had never missed a Holy Day of Obligation or Feast Day. He had dutifully gone with her even though he'd hemmed and hawed about it. Ever patient, she would sit by his side, patting his arm and smiling to herself over the fact that she had gotten him to do the impossible.</p><p>\"I miss you, Rose,\" he breathed, his chest tight with the pain of her loss.</p><p>He wanted to stay here where he felt her, but he couldn't. No Dark-Hunter could remain in any old church for very long before the ghosts of the past came out to possess them.</p><p>And he was too weak at this moment to fight them.</p><p>Getting up, he made his way silently out back to the font, then out to the street.</p><p>It was cool out, but nowhere near the coldness he felt inside himself. Gallagher headed down Chartres Street. He didn't know where to go. He didn't feel like going back to Sanctuary and there was no real need to hunt on Christmas Eve. Since most humans were at home with their families, the Daimons tended to stay in as well.</p><p>\"Hel-lo!\"</p><p>He paused at the familiar sing-song voice. Turning around, he found \"Simi\" behind him.</p><p>\"Hi,\" he said, half-expecting to see Ash with her.</p><p>But apparently she was out alone. Simi bounced up to him. \"What'cha doing out here all alone?\" she asked. \"Did you forget how to find Sanctuary?\"</p><p>\"No. I want to be alone for a bit.\"</p><p>She cocked her head and frowned. \"Why? Were the bears mean to you? Mama can get a bit cranky whenever I play with the cubs. She thinks I'm going to eat one, but bleh! They're way too hairy. Now if she'd let me skin one, I might be interested.\"</p><p>He laughed in spite of himself. \"Are you joking?\"</p><p>\"Oh no. I never joke about hairy food. It's disgusting.\" She looked up at him. \"If they weren't mean to you, then why did you leave?\"</p><p>\"I don't know. I guess I didn't feel right being there.\"</p><p>\"Why?\"</p><p>He shrugged. \"What are you doing out here?\"</p><p>\"Not much.Akri is off with that red-headed demon so he said I could go play just so long as I don't eat nothing not cooked by a human. But all my favorite places are closed so I thought I'd go find the bears myself and see if Jose, since he's human, would make me up something good that wouldn't makeakri mad if I ate it.\"</p><p>\"Akriis Ash?\"</p><p>\"Yes.\"</p><p>\"And the red-headed demon?\"</p><p>\"Artemis the bitch goddess. You know her. She's the one who stole your soul.\"</p><p>\"She didn't steal it.\"</p><p>Simi blew him a raspberry. \"Of course she did. She steals everything.\" She stood up on her tiptoes and stared into his eyes. \"Hey,\" she said, taking his chin in her hand so that she could move his head back and forth while she examined him. \"You're hurting in there. That would makeakri very sad. He doesn't like for his Dark-Hunters to hurt and the Simi don't like it whenakri is sad. Why are you hurt?\"</p><p>\"I miss my family.\"</p><p>Releasing him, she nodded sympathetically. \"I miss mine too. My mama was good people. 'Simi,' she would say, 'I love you.'Akri loves me too.\"</p><p>She tilted her head down so that he could see her horns which were now covered by what appeared to be very small knitted hats. \"See,akri even gave me hornay warmers so my horns wouldn't get cold. You want some hornay warmers too?\"</p><p>This had to be the oddest conversation of his life. He didn't know why he stayed here talking to her. Maybe it was her childlike manner. There was something very charming about her.</p><p>\"I don't have horns.\"</p><p>\"You want some?\" she asked hopefully. \"I could give you some real colorful ones.Akri has some black ones, but he doesn't let other people see them.\"</p><p>\"Ash has horns?\"</p><p>\"Oh my, yes. They are quite lovely. Not as lovely as mine, but they are still very nice. The Simi would say she hopes you see them, but if you ever did, you'd be dead and I think the Simi would miss you. You seem very nice too.\"</p><p>Gallagher frowned as she rummaged around in her giant oversized, beaded purse. After a few seconds, she pulled out an oven mitt that looked like a fish. She handed it to him.</p><p>\"That is quality. From QVC. My favorite place. Do you watch QVC?\"</p><p>\"No.\"</p><p>\"Well, you should.Akri says I watch it too much, but he never complains when I shop there. They like me too. Put me on television and call me Miss Simi. I like that.\"</p><p>He handed her the fish back.</p><p>\"Oh no, that's for you. Presents make people happy. The Simi wants you to be happy.\"</p><p>Oh yeah, this was without a doubt the strangest moment of his life. Both mortal and immortal. \"Thank you, Simi.\"</p><p>She waved his words aside with her hand. \"No need to thank me. See, that's what families do. They take care of each other.\"</p><p>His stomach tightened at her words. \"I no longer have a family. I had to give them up.\"</p><p>She looked at him curiously. \"Of course you have a family. Everyone has family. I'm your family.Akri your family. Even that smelly old goddess is your family. She's that creepy old aunt who comes around but nobody likes her so they make fun of her when she's gone.\"</p><p>He laughed again. \"Does she know you say that about her?\"</p><p>\"Of course. I say it to her face all the time. That's whyakri told me to come play while he's with her. He don't like it when we fight.\"</p><p>She took his hand into hers. \"Listen and I'll tell you whatakri once told me. We have three kinds of family. Those we are born to, those who are born to us, and those we let into our hearts. I have let you into my heart so the Simi is your family and she won't give you up. If you are sad right now, then I'm thinking your family is still in your heart too, and they are taking up so much room that you have no room for anyone else.\"</p><p>\"I can't give them up.\"</p><p>\"And you shouldn't. Ever. No one should ever forget those they love. But it's like with QVC—whenever I fill up my room with too much stuff,akri builds me another room. Somehow there's always space for more. Your heart can always expand to take in as many people as you need it to. The people who live there, they don't go away. You just make room for one more person and then another and another and another.\"</p><p>With her arm in his, Simi walked him down the street. \"Don't you want Simi to be your family?\"</p><p>He thought about her words and strange analogy.</p><p>She leaned forward and whispered. \"This is the part where you say, 'Yes, Simi, I would like to be your family.' 'Cause if you don't, then I'll have to take my mitt back and barbecue you.Akri is still upset about the last Dark-Hunter I barbecued and that was... oh, a thousand or so years ago. He part elephant when it comes to remembering things. So tell me, do you want Simi to be your family?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He smiled in spite of himself. \"Yes, Simi, I would like to be your family.\"</p><p>She beamed. \"Good. You're such a smart Dark-Hunter.\"</p><p>Before Gallagher realized it, Simi had led him back to Sanctuary. She opened the door and stood back, waiting for him to enter. The earlier loudness was nothing like what was happening now.</p> <p>There were four hawks lined up on one curtain rod, dancing in time to the rocking Christmas carols. The Howlers (all in human form) were singing while Dev Peltier played the piano. A white tiger was lying on its back on the sofa while Marvin the monkey jumped up and down on its belly.</p><p>A large black bear he assumed was Aimee Peltier was feeding two baby cubs peanut butter sandwiches. A red-headed human woman with a scar on her face came up to them and grabbed Simi into a hug. \"Hey little demon, where's boss man?\"</p><p>Simi shrugged. \"He off attending to Lord Queen Pain-In-My-Butt. How are you, Tabitha? Is your sister and Kyrian coming?\"</p><p>\"No, they'll be here tomorrow. Morning sickness hit Amanda as they were leaving, but Talon said he'd be here just as soon as he could.\" The two of them drifted off into the crowd.</p><p>Gallagher stood back, watching the revelry. There were Arcadians here, Katagaria, Dark-Hunters, demons, humans, and who knew what else. By all rights none of them should get along and yet they were together tonight.</p> <p>Bound by something other than blood. They were bound together by their hearts.</p><p>Colt came up to him. An Arcadian Sentinel, his job was technically to hunt and slay the Katagaria. But years ago the Peltiers had rescued and protected Colt's mother and then raised him after her death. He was as loyal to the bear clan as any of their natural sons.</p><p>Smiling, he pulled a pineapple mitt out of his back pocket. \"Man, Gallagher, you must really rate. You got one of the good fish. All I got was a lousy pineapple.\"</p><p>\"What, does everyone she meet get one?\"</p><p>\"Nope. Only family.\"</p><p>Gallagher looked around at that and saw something he'd hadn't noticed earlier.</p> <p>Everyone there had a mitt. </p> </body></html>"]