["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Malibu, California</p><p>Cyn lowered the twenty pound weight to the exercise mat—okay, so it was only a five pound weight, but it felt like twenty pounds when combined with thirty plank press reps, an exercise that was surely designed by a madman or a sadist. Or both.</p><p>Every muscle in her body was whining at her to stop, so she surrendered, collapsing to the mat and rolling onto her back. Eyes closed, she pressed her spine flat to the floor a few times, then starting with her toes and working upward, she consciously relaxed each muscle in turn, focusing on every even breath, in and out, the steady beat of her heart—</p> <p>“Yo, Cyn.”</p><p>Cyn’s Zen state collapsed. She kept her eyes determinedly closed and snapped out an irritated, “What?”</p><p>Her workout partner cum sadistic trainer Elke laughed. “I wanted to be sure you were still breathing.”</p><p>“I was relaxing. It’s good for me.”</p><p>“It’s good for all of us, but it’s nearly midnight.”</p> <p>“And?”</p><p>Elke gave an unladylike snort. “Pretending ignorance won’t get you out of it.”</p><p>Cyn sat up and cast a scowling glance at the vampire who’d become a friend. Surprising, since she and Elke hadn’t exactly started on the best of terms.</p><p>“Hey, don’t blame me,” the ice-blond vampire said now. “You’re the one who wanted to be more involved. Be careful what you wish for and all that.”</p><p>“I wanted to be more involved in security issues, things to do with Raphael’s safety. Not every goddamned business meeting. I hate business meetings. I don’t even go to my own. Besides, how do you know what I wanted? I never told anyone but Raphael.”</p><p>Elke rolled her eyes. “Right. Like every single vampire in the compound didn’t know you were pissed about that business at the fund raiser in March.”</p> <p>Cyn grabbed a bottle of water, tipped her head back, and drained half of it, instead of responding. She wasn’t comfortable discussing her personal affairs with anyone, and there was nothing more personal than her relationship with Raphae . . . and especially what had happened between them at the end of March. She’d been furious about his decision to put himself at risk, essentially offering himself as bait to draw in the same man who’d already tried to kill him once. That had been bad enough, but his real offense had been keeping her in the dark precisely because he’d known she’d fight him on it. So rather than talk to her, try to reason with her, and maybe, just maybe, listen to her objections, he’d simply not told her. Until he was shot and she’d figured it out for herself.</p><p>She’d almost left him that night. Had come closer to walking out the door than at any time in their relationship, including the earliest days when she’d still been coming to terms with the fact that she was falling in love with a bossy, fucking vampire lord who was alpha to the extreme. But, in the end, she couldn’t do it. She loved him in a way she’d never loved anyone in her entire life.</p><p>Elke was right, though. She’d insisted Raphael keep her in the loop going forward. She didn’t like to call it an ultimatum, though that’s what it had been. She had told him if he ever lied to her like that again, she’d leave and he’d never find her. Raphael had contacts and money, but then, so did she. Of course, they had a blood bond which would make it easy for him to locate her, at least for a while. But, on the other hand, he was hampered by vampire politics, which would make it difficult for him to come after her overseas.</p><p>But now Raphael was trying to make it up to her by including her in every little thing, and she didn’t have the heart to tell him it was too much. She’d already hurt him enough. Well, that and she didn’t want to sound like an ungrateful bitch who just couldn’t be satisfied.</p><p>Cyn sighed and pushed up off the floor.</p><p>“I’d better shower and change,” she told Elke. “Don’t want Raphael’s business buddies to think he mated a stinky human.”</p><p>Cyn stepped out of the shower, feeling well and thoroughly pummeled. Their shower was big and decadent, its multiple showerheads like a terrific massage rather than a shower. She wrapped herself in a towel, then grabbed another and rubbed it over her wet hair as she walked over and opened the door. Cool air rushed into the steamy room, and she started to turn back, but then smiled at the sight of Raphael sitting in his big chair, reading something on an iPad. He looked all serious and handsome in a brilliant white shirt and perfectly creased charcoal slacks, a dark blue silk tie with a tiny silver design providing a nice touch of color. The matching suit jacket was lying across the bed, as if he’d tossed it there. But Cyn knew that was only for show. Raphael was far too vain to risk marring the perfect cut of his suit. He’d have laid it down just so. She grinned crookedly. He was such a control freak.</p><p>“I don’t trust that grin,” he commented without looking up.</p> <p>“It’s Pirozzi you shouldn’t trust,” she said, deliberately offhand as she strolled across the room toward him. “That vampire’s a pig. No, wait. Pigs are too smart. He’s a toad. A big, fat, bloated toad.” She stood directly in front of him and nudged his leg with her bare foot teasingly, waiting for a response.</p><p>Raphael smiled slightly and set down his iPad, still without looking up. And then before she could react, he grabbed her around the waist and tumbled her laughing into his lap.</p><p>“Insulting our guest won’t get you out of the meeting,” he murmured, slipping one long-fingered hand beneath the towel and caressing her naked hip.</p><p>Cyn tightened her lips in irritation, then turned and stuck her tongue out at him.</p><p>He only laughed and said, “Neither will that. I’ve better uses for your tongue.”</p><p>“Do you?” she murmured, and bracing herself against his shoulders, she rose up and twisted around until she was straddling his lap. She began loosening his tie. “We’ll be late for your meeting,” she commented, sliding the tie off and tossing it aside.</p><p>Raphael tugged her towel completely away and dropped it to the floor. “There is no meeting without me,” he growled and cupped both of her breasts in his hands, strumming the nipples with his thumbs. His eyes lifted to meet hers, their black depths flickering with silver starlight.</p><p>Cyn’s breath caught in her throat as a familiar thrill shivered along her nerves. She loved the way he desired her, the heat that still filled his eyes whenever he looked at her. No matter how long they’d been together or how much they argued—and they did argue—he still wanted her. This beautiful, powerful creature who could turn heads just by walking into a room wanted her.</p><p>Her heart swelled as she wrapped her arms around his neck. “I love you,” she whispered. “So much.”</p><p>Raphael gripped her more tightly, one hand on the nape of her neck, the other low on her back, holding her still as he crushed his mouth against hers in a hungry, demanding kiss. His tongue swept between her lips, caressing every inch of her mouth, tangling around her tongue in a battle for dominance that neither one of them cared about winning.</p><p>“I love you, my Cyn,” he whispered against her lips. “Remember that.”</p><p>“I don’t have to remember,” she said fervently. “You’ll always be here to tell me.”</p><p>He kissed her again, yanking her closer until his growing arousal was nestled right between her thighs. She rocked forward, eyes closed, pleasuring herself against the rigid bulge of his cock as he switched his kisses to her breasts, taking one nipple between his lips and sucking hard, his tongue tormenting the stiff peak until his teeth closed on it gently, and she hissed in pleasure. She loved it when he did that, when the initial sting of his bite became a jolt of lust that sizzled right down through her belly to spear her pussy. She felt the resulting gush of wet heat and ground herself on his cock where it was straining against the confines of his zipper.</p><p>“Oh, dear,” she said breathlessly, “I’ve gotten your pants all wet and sticky.”</p><p>Raphael’s strong fingers dug into her ass. “I have other pants,” he hissed, his breath hot on her neck as he teased her with small bites, never breaking the skin, only tantalizing her with the scrape of his fangs and the soothing touch of his tongue.</p><p>“Raphael,” she groaned.</p><p>He lowered his head further, his teeth closing around the fragile arch of her clavicle, barely breaking the skin before pulling away and licking the small taste of her blood.</p><p>“Delicious, my Cyn,” he murmured, and she could feel his smile against the curve of her shoulder.</p><p>She made a wordless noise of frustration, grabbing both sides of his fine shirt and tearing it open, sending buttons flying. She sighed with satisfaction at the sight of his naked chest, running her fingers lovingly over his firm pecs, pushing the shirt over his shoulders and squeezing the thick pads of muscle there, then smoothing her hands down to his waist and scraping her nails over the hard ridges of his abdomen.</p><p>“Gorgeous,” she whispered, her fingers already busy unbuckling his belt. She glanced up and found him leaning back and watching her with bemusement. Giving him a quick grin, she carefully unzipped his pants, humming with satisfaction when his beautiful, hard cock sprang into her fingers, bucking as if eager for her touch.</p><p>Cyn stroked up and down—once, twice—loving the glide of hot skin over the hard steel of his erection, the clench of his abdominal muscles as he hardened even further in her grasp.</p><p>“Mine,” she said, then rose up onto her knees, just enough that she could slip him between the swollen lips of her sex, into the slick, wet ache between her thighs. She lowered herself slowly, taking him into her body, feeling her sensitive tissues stretch to accommodate his thickness. A sigh of pleasure escaped her lips, and she closed her eyes as she began rocking slowly back and forth.</p><p>Raphael growled abruptly, a deep rumbling sound that had Cyn’s eyes flashing open to see his eyes burning with hunger. His arms came around her and his hands stroked down her back to curl over her hips and grip her tightly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She sucked in a breath as his fingers dug in and he buried his cock more deeply inside her. Cyn threw her head back and closed her eyes, savoring the exquisite sensation as he began thrusting up against her, his big hands gripping her hips, holding her close as he asserted his dominance. Leaning forward, she lowered her mouth to his shoulder and bit down hard, satisfaction zinging through her at his hiss of lust. Anticipation shivered over her skin when she felt his moist breath against her neck, when his tongue scraped roughly over her jugular. She groaned at the press of his fangs and wanted to call his name, to demand that he take her now. But her throat couldn’t produce the sounds, her breath panting out of her chest, her lungs squeezed by the pounding of her heart. She cried out, begging for release, trying to move, to flex her hips against his thrusting, anything to relieve the terrible need building to a crest so high it threatened to crush her.</p><p>Raphael watched with hooded eyes as Cyn writhed in his grip, a study in pure sensuality. Her lovely skin was flushed with color, sweat gleaming along the swell of her breasts as they swayed against him, her nipples rosy pearls that rubbed against his chest with every thrust of his cock into her sweet body. Her nails scraped the back of his neck, and he felt the warm brush of her breath against his skin a moment before she bit his shoulder, her blunt human teeth drawing blood. He hissed with pleasure when her lips closed over the wound, when her tongue lapped out and she swallowed, drinking his blood. Fisting his hand in her silky hair, he bared her neck and lowered his mouth to the gentle curve of her jaw, nibbling, teasing, relishing her pleading gasps as he finally brought his mouth to the enticing blue line of her jugular. His tongue rasped along its length, plumping it until it was a juicy swell of blood. Baring his fangs, he sliced easily through the velvet warmth of her skin, puncturing the thin membrane of her vein and releasing the honey sweet flow of her blood. He drew deeply, like a man starved, her blood filling his mouth and sliding down his throat, giving him warmth, granting him life. Cyn’s scream of climax vibrated against his bones as she trembled in his arms, every muscle clenching, holding onto him as if she couldn’t let go, her knees digging into his hips as her hot, wet pussy squeezed his cock like a vise and she shivered in his arms. He gripped her hips more tightly and thrust upward, her sheath pulsing along his length, demanding his climax, urging him to join her, to spend himself inside her.</p><p>With a final flex of his hips, he plunged balls-deep into her heat, his own orgasm racing in an unstoppable wave until it crashed over him, filling her with his release, claiming her once again as his own, now and forever.</p> <p>Cyn collapsed against Raphael and waited for the trembling to stop, for her heartbeat to grow even, for her lungs to draw a full breath. Sex with Raphael was like a shot of adrenaline straight to the heart. She snuggled her face against his neck, breathing in his familiar scent, loving the way he was smoothing one hand up and down her back, almost as if to comfort her. She kissed the soft skin of his freshly shaved jaw. A couple more hours and his beard would show up again, and she’d love that, too. Who was she kidding? She loved him any way she could get him.</p><p>His arms tightened around her, which was the only warning she got before he stood, taking her with him.</p><p>“Where are we going?” she asked lazily.</p><p>“To the shower we both need.”</p><p>Cyn chuckled. “You’re still wearing clothes.”</p> <p>“Not for long.” He slid her down his body until her feet hit the ground, placing both hands on her waist until he was certain she was steady on her feet. “Stay there,” he ordered.</p><p>Cyn considered making a run for it, just because it would be so much fun when he chased her. But she was feeling too boneless to generate that much energy, so instead she watched in amusement as Raphael stripped out of his clothes in record speed, giving her a sly glance at the ruin of his shirt.</p><p>“You have plenty of shirts,” she dismissed. “In fact, you have plenty of exactly that shirt.”</p><p>“The loss was well worth it,” he all but purred, and Cyn felt a little shiver of excitement tighten her nipples.</p><p>“Shower,” Raphael said, turning her around and giving her ass a smack.</p><p>“Hey!” she protested, even though he’d barely touched her. Their lovemaking became wild sometimes, but he was always exquisitely careful with her. His strength was overwhelming, but he’d never hurt her. Not that way.</p> <p>“Shower,” he repeated. “Pirozzi is still waiting.”</p><p>“Unfortunately. You sure he hasn’t given up and gone home?”</p><p>Raphael laughed. “I’m certain I’d have heard if that were the case. Jared is keeping him company for us.”</p><p>Cyn’s good mood hiccupped at the mention of his lieutenant’s name. Jared had been behind the plan to use Raphael as bait for the assassin, and she was sure he’d argued for keeping her in the dark about it, too. Duncan would never have done that. She still missed Raphael’s former lieutenant, even though she understood that his leaving had been a good thing for Duncan and Raphael both. Duncan had finally gotten a territory of his own, which was an honor long overdue. Plus he’d met Emma who, it turned out, was the love of his life. And Raphael ... well, Raphael got another ally on the powerful Vampire Council. More, really, since it was Raphael who’d made Duncan a vampire, and the bond between a vampire and his children was nearly unbreakable. One by one, Raphael was seeding the Council with vampires who were either his own children or who’d agreed to ally with him for the foreseeable future.</p><p>Raphael had plans, and Cyn wasn’t sure anyone knew exactly what those plans were. She wanted to ask him about it, but was afraid he wouldn’t tell her. Or, worse, that he’d lie about it. And she couldn’t take it if that happened. So, she didn’t ask, figuring he’d tell her when he thought the time was right. In the meantime, she went to every boring meeting, keeping up her side of the bargain. As Elke had said, Cyn was the one who’d insisted on being in on the decision making.</p><p>“Inside,” Raphael said, and she realized that he’d hustled her into the bathroom while she’d been thinking of other things. He opened the shower door and leaned in to turn on the water.</p><p>“Aren’t you joining me?”</p><p>“Of course,” he said, with a small smile.</p> <p>“Uh oh,” she joked. “You’re thinking bad thoughts.”</p><p>“Not at all,” he said smoothly, stepping into the shower behind her and closing the door. “My thoughts are very, very good.”</p><p>He lathered up and began washing her body ... slowly, sensuously, his strong hands massaging her back, squeezing her ass. She moaned, arching her into him as his fingers dipped between her thighs.</p><p>“Now who’s thinking bad thoughts,” he whispered against her overheated skin.</p><p>Cyn turned to face him, taking pleasure in his indrawn breath as her breasts brushed against his chest. Reaching behind him, she pumped some shower gel into her hands and began stroking his very fine chest. “My turn,” she murmured, letting her hands drift down over his flat belly and farther, until she was caressing the hard length of his fully aroused cock. One of the joys of bedding a vampire—their stamina and recovery was phenomenal. She smiled happily.</p><p>“Cyn,” he said quietly.</p><p>She looked up and found his eyes had gone nearly solid silver with lust. Her womb clenched ,and an aching need swelled between her thighs. She licked her lips, and his gaze shifted avidly.</p><p>With a low growl, he lifted her by the waist and pinned her against the tile wall. Looping his hand under her thigh, he wrapped it around his hip, lifting her until his cock was positioned at her entrance. Cyn bucked against him hungrily, wanting him inside her again ... and again after that. It would never be enough. Raphael’s hand came between them, and then he was sliding between the swollen folds of her outer lips, forcing his way through the slick tissues of her sheath, until there was nothing between them but skin.</p><p>He paused for a moment, his fingers clenching along her thigh, his other hand fisted on the tile over her head as he stared down at her. His cock kicked deep inside her, as if demanding he start moving again. Cyn looked into his eyes and smiled, then flexed her hips just slightly.</p><p>Raphael snarled and started fucking her hard and fast, slamming his cock into her, their wet skin slapping noisily in the steamy confines of the shower. Cyn wrapped her arms around his neck and hung on, meeting every thrust with one of her own, threading her fingers through his short hair, digging her nails into his scalp. She cried out as her climax drew closer, as every nerve ending she possessed began quivering in eager anticipation. The inner walls of her sex tightened, caressing Raphael’s thick cock, making him groan as he fought to keep moving in and out.</p><p>Cyn was drowning in sensation, sweat rolling down her body in the steamy shower, hot water pounding them from all sides. Her skin felt too tight, with even the slightest touch of Raphael’s hand sending waves of pleasure straight to her clit, her nipples so hard that every scrape against his chest was a fresh ripple of orgasmic stimulation. Raphael’s eyes were closed, his muscles straining as he fought his own climax, fought against the loss of control. Focusing hard, Cyn flexed her inner muscles around his cock. Raphael’s eyes flashed open, his hot gaze meeting hers.</p><p>“Come with me, lubimaya. Come now.”</p><p>Cyn let go with a groan of relief, letting the climax overtake her. She tipped her head back against the tile wall, her entire body convulsing as desire roared through her veins and shrieked along her nerves, her muscles spasming until she would have fallen if Raphael hadn’t been there to hold her up. He wrapped her legs around his waist, lifting her higher and spreading her thighs, so he could go even deeper. And then with a rush of heat that she felt in her womb, he was coming, his voice a rasp of sound against her ear as he said her name.</p><p>Chapter Two</p><p>They were late for their meeting, but no one seemed to care. Or at least, no one dared say anything to Raphael. Cyn was certain everyone knew she and Raphael had been humping their brains out. There was only so much one could do to cover up that post-orgasmic glow. But fuck ’em. They could find their own perfect lovers. She had hers, and she was going to take full advantage. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jared filled them in on what they’d missed so far, a quick and thorough rundown of an incredibly boring session. In a nutshell, Pirozzi wanted to expand his very successful manufacturing operation, and since Raphael was his biggest, and only other, shareholder, he needed the big guy’s approval. Yawn.</p><p>But she managed to appear reasonably alert and interested, managed also to remain, if not friendly, then at least polite to Jared. And not to cheer out loud when the meeting ended.</p><p>Raphael gave her a discreet wink, knowing her too well not to understand what she was thinking. She gave him wide, who-me? eyes that fooled no one, least of all Raphael, then watched as he stood to bid Pirozzi farewell, accepting the other vampire’s slight bow of obeisance. There were some vampires in Raphael’s circle, those closer to him, with whom he’d shake hands in greeting, or even, in Lucas’s case, exchange hugs. But then, that was Lucas. He was a very huggy guy for a vampire. In any event, Pirozzi was not of the inner circle and definitely not a friend. He was simply one of the many vampires who called Raphael master. Raphael ruled his people absolutely, but fairly, and they accorded him both respect and fear. That’s how it worked among vampires.</p> <p>When Pirozzi and his assistant were gone, Raphael took Cyn’s hand and pulled her to her feet, draping a possessive arm over her shoulders as he walked her out of the conference room and down the hall to his office.</p><p>“Work?” she asked.</p><p>“An hour’s worth. You can go downstairs if you want.”</p><p>“No, I’ll stay with you. I’ve got some catching up to do, too.”</p><p>Raphael settled behind his desk, while Cyn sat on the couch with her laptop. She still did private investigations, but most of her clients were vampires now, and almost all of her investigations were done remotely. She hadn’t sworn off field work; she liked the adrenaline rush too much. But just as Raphael had promised to keep her in the loop, she’d promised him not to take the kind of crazy risks that had almost gotten her killed. So lately, the only time she’d been in the field was with Raphael, and her on-line research skills were getting better with every job.</p> <p>“When is that thing in Chicago?” she asked. She’d received a new e-mail job request, but the time frame was short.</p><p>“The first week in December,” Raphael said absently, then looked over at her.</p><p>“December in Chicago?” she asked unhappily. “We’re going to freeze our asses off.”</p><p>He shrugged. “Probably, but the Midwest needs a new lord, and we can’t delay any longer.”</p><p>“Do you have to be there?”</p><p>“It’s tradition. The presence of the Council lords helps keep violence to a minimum. We will be stopping in South Dakota first, however.”</p> <p>Cyn scowled. “South Dakota. That’s kind of like stopping in Fairbanks to warm up before the Arctic.”</p><p>Raphael shot her an amused look. “I need to consult with Lucas, and, against my better judgment, you’ll be meeting Kathryn.”</p><p>“Kathryn?” Cyn grinned happily. “Can Emma and Sarah come, too?”</p><p>“No.”</p><p>Cyn just laughed. But the first thing she did was dash an e-mail off to the rest of the Mates Club, giving them the good news. The name wasn’t ideal—too nautical by half—but that’s what Sarah had suggested they call themselves for now, since “spouses” didn’t work and Colin’s participation ruled out anything gender specific. Their first official get-together was supposed to be at the upcoming Chicago Council meeting, and now Cyn was about to get the full scoop on their newest member. She hit send and glanced up to find Raphael studying her suspiciously.</p><p>“I don’t think I want to know what you just did.”</p><p>“Aw,” she cooed, getting up and walking over to slide onto his lap. “You’re a tough guy. You can take it.”</p><p>“Kathryn is with the FBI, you know. She’s very law abiding, according to Lucas.”</p> <p>“I know,” she said, giving him a comforting pat.</p><p>“She’s still active. Working in the Minneapolis office.”</p><p>“I know,” she repeated in the same soothing voice.</p><p>He eyed her narrowly. “Cyn.”</p><p>“Yes?” She gave him her best angelic smile.</p><p>He sighed deeply. “I’m going to regret this.”</p><p>“Don’t be silly. We’re gonna have fun!”</p><p>Chapter Three</p><p>South Dakota</p><p>They flew to South Dakota by private jet—Raphael and Cyn, plus their security. Cyn’s personal team consisted of Elke and Robbie, the former Army Ranger who was her daytime bodyguard and friend. She loved Robbie. He’d gone through hell and back with her, and that was a bond not easily put aside. Raphael’s team was much larger, of course. Not that he couldn’t defend himself, but vampires were very big on appearances, which meant Raphael had to travel with a suitable security cadre.</p><p>Juro was with them, naturally, since he was Raphael’s Security Chief. Cyn got along just fine with Juro. The big Japanese vampire had been the only one of Raphael’s inner circle who’d argued in favor of telling her everything about their plan to bait the assassin last March.</p><p>Jared was with them, too, but he was another matter. Cyn would have liked to ignore him altogether, but as Raphael’s lieutenant, he was constantly around. And she knew the distrust between them troubled Raphael, so she made the effort to be civil.</p><p>There were three SUVs waiting for them when they landed in Rapid City, which was the closest airport able to handle Raphael’s Learjet. Lucas had provided drivers along with the vehicles, but being the hyper-paranoid personalities they all were, Juro immediately replaced Lucas’s people with his own. Not surprisingly, Lucas’s people were prepared for that eventuality, and all piled into a fourth vehicle. The team leader lingered, offering to lead the way back to Lucas’s estate, which Juro accepted. Cyn had done her homework and knew that Lucas lived in the back end of nowhere, so a guide was a good thing. That didn’t mean Juro wouldn’t double-check everything, though.</p><p>Raphael led Cyn over to the middle of their three SUVs, which was kind of predictable if any bad guys had plans to take Raphael out on the road. But then, if any bad guys tried to ambush Raphael’s convoy, they’d be in for a few surprises. And not the happy kind.</p><p>Juro slid behind the wheel, and Cyn hid her grin as he immediately reprogrammed the in-dash Nav system. His fingers flew over the screen’s keyboard in a blur of vampire speed as he replaced whatever data Lucas’s people had already put in there. Trust among friends, Cyn thought to herself. It was touching, really.</p><p>They made good time once they left the city behind. There were very few cars on the road. The only light was from the nearly full moon overhead, the only sound the hum of the tires on the road and the occasional murmur of voices from Jared or Juro in the front seat. Cyn sank back into the comfort of Raphael’s embrace, her eyes closing almost of their own accord. The days leading up to this trip had been unexpectedly busy. Two days ago, she’d had the fortunately rare pleasure of participating in a big meeting with the legal team managing the Leighton Family Trust, a meeting which naturally included her grandparents and her father. Cyn usually proxied her vote to one of the lawyers she trusted when it came to such things, but this particular meeting had required her presence. Seeing her father had been especially stressful, since he was still pissed off about Raphael buying the Karcher property out from under him last year. He was convinced Cyn had something to do with it, and she supposed indirectly she had, since it was her father’s disregard for her that had motivated Raphael to buy it. But the truth was, Karcher or not, she and her father didn’t have much in common. So there had been that charming encounter, and then several other business matters, all of which had to be handled during daylight, and, of course, Raphael continued to claim her nighttime hours, which was not exactly a hardship. But it did mean she’d gotten very little sleep, and as they sped through the black night, she drifted off to the familiar sounds.</p><p>It was a break in the familiarity that woke her. She sat up, abruptly wide awake, every sense on high alert as she tried to figure out what had changed. One of the security SUVs was in the lane next to them, and then sliding past as their SUV sped up and the security vehicle dropped back to trail behind them. She frowned and leaned forward to look out the front window. There had been two SUVs in front of them, one with Lucas’s people and the other with their own. There was now only one, which meant the threat, whatever it was, was coming from the rear.</p><p>“What’s going on?” she asked no one in particular.</p><p>It was Jared who answered her. “Trailing vehicle thinks we have a tail.”</p><p>“Who’s that in front of us?”</p><p>“That’s our people. Lucas’s team is dropping back to check out the unknown.”</p><p>Cyn turned to stare out the back, but could see nothing, not even headlights. With the bright moon out here, the vampire drivers had all turned off their lights, but what about their uninvited visitor? She strained to see something, her hand automatically creeping to the 9 mm Glock that rode in its usual shoulder holster, touching it like a talisman for good luck. Although she didn’t really believe in luck. She believed in being prepared and kicking ass.</p><p>Raphael’s hand touched her thigh, his fingers squeezing lightly. “They know their jobs, lubimaya.”</p><p>She grimaced unhappily, but scooted back and settled close to him. “I know that,” she muttered. “Doesn’t mean I don’t worry.”</p><p>“You wouldn’t be you otherwise.”</p><p>Cyn scowled, not sure she liked that idea either. But she pretended to relax while listening avidly to the murmured conversations in the front seat and wishing she’d worn her own ear bud.</p><p>Finally, Jared turned around to say, “They’re gone, my lord. Whoever it was saw us reacting and took off across country. No lights.”</p><p>No lights. That meant ... “Vampires?” she asked.</p><p>“Not necessarily. The moon is bright tonight, and locals would know the terrain well enough to travel in the dark and conceal themselves successfully.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So our guys lost them?”</p><p>“Lucas’s guys, but yes.”</p><p>She glanced at Raphael, but he didn’t seem particularly perturbed by any of this. He seemed to sense her doubts, though, because he gave her a small smile, and said, “I trust Lucas absolutely, my Cyn. Whoever this was, Lucas had nothing to do with it.”</p> <p>“Then who did?”</p><p>“That is something we’ll discuss with Lucas when we arrive.”</p><p>Cyn wasn’t particularly happy with his answer, but she knew it was the best she was going to get. And she had to admit that there was very little else they could do at this point. She slouched down in the seat unhappily. Raphael’s arm came around her, and she supposed he meant it to be comforting. It might have worked, too, if not for the grin he was fighting unsuccessfully. She elbowed him, and he gave up the fight, chuckling softly.</p><p>She sighed, pretty sure she’d never manage to get back to sleep. “I was having a great dream, too,” she muttered.</p><p>“What were we doing?”</p> <p>She smiled up at him. “What makes you think you were in it?”</p><p>“You said it was great. I assumed that meant it included me.”</p><p>She tsked loudly. “What an ego you have.”</p><p>He shrugged. “Of course. So, what were we doing in your dream?”</p><p>Cyn regarded him evenly, then rolled her eyes and said, “What do you think?”</p><p>He laughed and pulled her into a hard embrace, hanging onto her when they hit a pothole so deep the whole SUV tilted to one side.</p> <p>“Jesus, did we blow a tire?”</p><p>“That’s just Lucas’s idea of a security perimeter.”</p><p>The road continued rough for a short distance, then smoothed out as a white fence appeared seemingly out of nowhere, gleaming in the headlights like a guideline to whatever came next. That turned out to be a big barn, surrounded by white-fenced paddocks in the distance. Cyn leaned across Raphael to see better.</p><p>“Horses?”</p><p>Raphael stroked a hand down her back and nodded. “Lucas breeds them.”</p><p>“Pretty,” she said as they drew closer. She sat up and looked at Raphael. “Do you ride?”</p><p>“You forget how old I am, my Cyn. I grew up on a farm before the invention of the combustion engine.”</p><p>“Doesn’t mean you ride, old man. Maybe you drove a buggy or something.”</p> <p>Raphael stroked a finger slowly over her cheek. “You do enjoy poking at the beast, lubimaya. I believe we’ll continue this conversation later,” he growled, his eyes glittering with power. “When we’re alone.”</p><p>Cyn swallowed hard as she met his silvery gaze. Raphael would never hurt her, but she sometimes forgot just how much power he wielded. And he was right, she loved teasing him. But that was partly because he was so powerful. Everyone constantly catered to him, and she felt it was her duty to keep him humble. Well, okay, not humble. Raphael would never be humble, but she teased him as a reminder of his humanity.</p><p>She leaned forward and bit his lower lip, licking away the blood as she slipped her tongue into his mouth and gave him a slow, sensuous kiss.</p><p>“I look forward to it,” she whispered.</p><p>Raphael’s gaze was heated as he gazed back at her. “I love you, my Cyn.”</p><p>“I love you back, my Raphael.”</p><p>At that moment, the SUV made a final sweeping turn and Lucas’s main house came into view. It was a clearly modern construction, but an effort had been made to include a strong Southwestern flavor in the overall Craftsman style. It was built into the hillside, giving it a low profile, but the roof was high and peaked, with red tile and skylights. The skylights were an unusual touch in a vampire’s home, but maybe Lucas liked to look at the stars and moon, or maybe he just liked the way it looked. The structure shone almost golden against the dark night, all lit up by artistically placed landscape lighting. The front door opened as they arrived at the house, casting an even brighter rectangle of light down the stairs and right onto the spot where their SUV pulled to a stop.</p><p>“My lord?” Jared said from the front seat, asking, without saying it specifically, if Raphael was ready to disembark.</p><p>“Give the word, Jared,” Raphael said.</p><p>Jared nodded, then muttered a few words into his Bluetooth mic. The doors on the two security SUVs popped open at once, and Raphael’s vampires poured out, forming a security phalanx up the stairs and right to the open doorway. This wasn’t their usual deployment, and it gave lie to Jared’s early assurance that the trailing vehicle had been nothing to worry about. Cyn loosened the safety strap on her Glock just as Jared opened the passenger door next to her. He glanced up, meeting her eyes briefly, then stood back without offering his hand to assist her. Smart vampire. First, Cyn didn’t need help getting out of a fucking truck, and second, she wouldn’t have accepted his hand even if he’d offered it. She knew it was petty, but she’d always been good at holding a grudge, and apparently that hadn’t changed.</p><p>Raphael exited behind her, his arm slipping around her waist. Cyn grinned inwardly at the show of possessiveness. Lucas was not only a friend, he was also madly in love with Kathryn, his newfound FBI lover. But when it came to these guys, possessiveness trumped pretty much everything, even when it wasn’t necessary.</p><p>“Raphael!” Lucas’s pleased shout had Cyn glancing up to see the Lord of the Plains flanked by his own security team and waiting just beyond the front door. Cyn rolled her eyes. They had enough security here to start a small war.</p><p>Ignoring his bodyguards, Lucas stepped out onto the porch with a big grin on his face. She had to admit he was a handsome devil. Not as handsome as Raphael, naturally, but then her own personal vampire lord was unusually beautiful. Still, Lucas was very pretty with his black hair and almost golden eyes. Unfortunately, as far as Cyn could tell from their brief acquaintance, Lucas’s favorite pastime was tweaking Raphael, which was her favorite pastime. She resented the hell out of anyone usurping her rightful role. Why Raphael put up with it, she didn’t know, although she’d gotten the impression at their previous meeting that the two powerful vampires had an almost father-son relationship.</p><p>“Lucas.” Raphael’s greeting was much more restrained than Lucas’s, although he did step forward to accept the other vampire’s hug, going so far as to offer an abbreviated embrace in return.</p><p>Releasing Raphael, Lucas turned his laughing gaze on Cyn, arms outstretched, but she gave him a warning glare. She wasn’t a huggy person.</p><p>“Lucas,” Raphael growled, adding his own warning.</p><p>“Lucas, our guests have barely arrived. Be good.”</p><p>Good luck with that, Cyn thought to herself, then held out her hand to the tall blonde standing a step back and to Lucas’s right. “You must be Kathryn,” she said.</p><p>The woman grinned. “And you’re Cynthia.”</p><p>“Cyn,” she corrected immediately. “I’ve been dying—”</p><p>Lucas cleared his throat loudly and interrupted, saying, “Raphael, this is Kathryn Hunter, the love of my life.”</p><p>Kathryn rolled her eyes, but smiled as she reached out to shake Raphael’s hand. “It’s an honor, my lord. Lucas has told me so much about you.”</p><p>“And all of it good,” Lucas added.</p><p>“I’m sure,” Raphael said dryly, then turned his attention to Kathryn. “A pleasure, Agent Hunter.”</p><p>“Oh, call me Kathryn, please. Let’s not stand on ceremony. Lucas tells me we’re all friends here.”</p><p>“Well spoken, acushla,” Lucas said, “and absolutely right. I apologize for not coming out to greet you, Sire, but my security people were all hot and bothered about your shadow on the way here. Your people too, from what I’m told. Come inside, let’s be civilized. You, too, Jared. And Juro, you’re looking spectacular, as always.”</p><p>Juro didn’t say anything, only growled deep in his throat.</p><p>Predictably, that made Lucas laugh, as he took Kathryn’s hand and led the way deeper into the house.</p><p>Cyn and Raphael followed, with Jared and Juro in their wake. Cyn looked around curiously, wondering if the interior would hold up to the lovely exterior, and she wasn’t disappointed. Keeping with the Southwestern style, the floors were all tiled, with the rest of the decor following the theme. They passed a huge open room that looked like someone’s man cave, with a giant flat screen and multiple game consoles and other electronics. Cyn recognized the room’s functionality, because they had one just like it back at Raphael’s Malibu estate. It was where the vamps hung out when they weren’t on duty, but weren’t quite free to leave the estate either.</p><p>Lucas led them past that room, turning left down a hallway until they reached a pair of double doors that stood open on another spacious room, this one with an open-beam ceiling and a big stone fireplace with a good-sized fire burning cheerfully. Cyn moved automatically toward the warmth, smiling her greeting at yet another good-looking vampire who waited for them just inside the room, looking very frat boy in his faded denims and black crewneck sweater.</p><p>“You know my lieutenant, Nicholas, of course,” Lucas was saying, and Cyn nodded, remembering him from the briefing at Raphael’s Grand Junction house after the assassination attempt.</p><p>“Nicholas,” Raphael acknowledged.</p><p>“Sit,” Lucas said, indicating a pair of overstuffed sofas facing each other across a gorgeous coffee table made of artfully distressed wood.</p><p>Kathryn gave Lucas a quelling look and amended the offer, saying, “Please. Have a seat.”</p><p>He responded by grabbing her around the waist and giving her a loud smacking kiss on the cheek. “What would I do without you, Katie mine?”</p><p>“I think we all know the answer to that,” Nick muttered, and Kathryn shared a snicker with him.</p><p>Lucas ignored the exchange, collapsing onto one end of the sofa and slouching down, stretching his long legs out and plopping his booted feet on the heavy coffee table.</p><p>Raphael sat with a bit more care, taking the other end of the sofa and opening his leather jacket as he settled back into the cushions. Cyn eyed him appreciatively. He looked like someone off the cover of a glossy magazine and she wished they were alone, so she could lick him up one side and down the other. His black eyes came up to meet hers, hot with intent. She gave him a lopsided smile, and he winked back at her. A promise for later. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Sit over here with me, Cyn,” Kathryn said, drawing her attention as she sat on the facing sofa. “That way we can listen to what we want and tune out what we don’t.”</p><p>“You wound me,” Lucas said, clutching his heart dramatically. “I thought my every word was music to your ears.”</p><p>“In your dreams,” she muttered back. “Come on, Cyn. I have cookies, and coffee, if you want it. If you’d rather—”</p> <p>“Coffee would be great,” Cyn assured her. She unzipped her jacket before sitting down, giving her easy access to her weapon. Sure, Lucas was a friend, and yes, Jared and Juro were here to provide security, not to mention Raphael himself being fully capable of defending himself. But Cyn was a control freak, especially when it came to Raphael’s security, and she couldn’t help noticing that there was a telltale bulge beneath Kathryn’s jacket, too.</p><p>“What a pair we are,” Kathryn confided as she poured some coffee. “In a room full of killers, and we’re worried about protecting them.”</p><p>“Good point,” Cyn agreed, sucking down the hot caffeine. “But I can’t seem to stop myself.”</p><p>Kathryn sighed. “Same here.”</p><p>“I noticed the horses when we drove in,” Cyn said, wanting to change the subject. She loved Raphael, but she spent most of her waking hours with vampires and welcomed the chance to talk about something else. “Raphael says Lucas breeds them, but do you ride, too?”</p> <p>“I rode a lot when I was younger, but I hadn’t done so in years. I’ve been getting back into it since I met Lucas.”</p><p>“You ride at night?”</p><p>Kathryn nodded. “Have to, don’t we? The horses are used to it, though, and the trails are well-marked. Why? Do you ride?”</p><p>“I’m afraid so. My various handlers felt it was something a properly raised young woman should know.”</p><p>“Handlers?”</p><p>“That’s what I call the parade of nannies and private school administrators who were in charge of my education.”</p> <p>“Your parents were ... gone?” Kathryn asked, her voice hushed and full of sympathetic understanding.</p><p>Cyn nodded. “Definitely gone, but not the way you think,” she replied, trying to keep the bitterness out of her voice. “My mother left when I was three, and never looked back, and I don’t think I exchanged a hundred words with my father the first two decades of my life. Poor little rich girl, huh? But at least I don’t fall off when I try to ride a horse.”</p><p>“We should go riding then,” Kathryn said, politely leaving behind the subject of Cyn’s childhood. “I’m on duty most of this week. My nights are free, but I’m saving my days off for the big Chicago blow-out this weekend. I’m off tomorrow, though, and it would be nice to ride in the sunshine for a change.”</p><p>“I’d like that, but let me just check something.”</p><p>Cyn pulled out her cell phone and punched Robbie’s speed dial.</p><p>“It’s the middle of the night, woman. This better be good.” Robbie and the other daylight guards had arrived a day earlier so they would be set up and ready for Raphael’s arrival. Robbie and the others would be sleeping somewhere nearby, though she didn’t know exactly where everyone was yet.</p><p>“This is what I get for trying to be nice?” she joked.</p><p>“What do you mean?” he asked cautiously.</p> <p>“Gee, am I really that bad?”</p><p>“I was sleeping, Cyn.”</p><p>“Fine. Do you know how to ride a horse?”</p><p>“You woke me up for this?”</p><p>“Robbie.”</p><p>He groaned. “Yes, oh wonderful one, I ride, courtesy of the US Army and too much time in the fucking sandbox.”</p><p>“Excellent. Wear your spurs tomorrow, then.”</p><p>“I can hardly wait. Is that all?”</p><p>“Love you, too.”</p><p>“Yeah, yeah,” she heard him grumble as he disconnected the phone.</p><p>“My daytime bodyguard,” Cyn said to Kathryn’s questioning look.</p><p>“You have a bodyguard?”</p><p>“Sure, don’t you?”</p><p>“She won’t let me,” Lucas said, eavesdropping shamelessly.</p><p>“I’m an active FBI agent,” Kathryn said, directing the words at Lucas, her long-suffering tone indicating this was an old argument. She switched her gaze to Cyn. “I can’t have a bodyguard trailing me around, and at night I have Lucas and all of his team. What more do I need?”</p><p>“I have two,” Cyn said with a scowling glance toward Raphael. “A vamp for nighttime—her name’s Elke—and Robbie during the day. And if it was up to Raphael, I’d have a whole team following me everywhere. He thinks I might get into trouble by myself.”</p><p>Across the room Raphael caught her eye with a skeptically raised eyebrow. “Might?”</p><p>“Okay, so it’s possible there’s been a time or two.”</p><p>Raphael laughed, and she threw a cookie at him. Of course, he caught it smoothly and tossed it back at her. Stupid vampire.</p><p>“Anyway,” she continued, with a glare at the love of her life, “I’d love to ride tomorrow, Kathryn, and you’ll like Robbie. He’s a sweetheart under the gruff exterior.”</p><p>“It’s a date. We’ll aim for afternoon, since we’ll be up all night. Sunset’s early this time of year, so I’ll meet you out front around two, if that’s okay?”</p><p>“Great. I can fill you in on all the inside scoop without big ears listening in.”</p><p>“Oooh, secret handshake stuff?”</p><p>“At the very least,” Cyn agreed, blowing a kiss at Raphael who was shooting evil looks at her.</p><p>“Forget them,” Lucas told Raphael, waving a dismissive hand at the conspiring women. “The worse they’ll do is spend money.”</p><p>Juro snorted wordlessly, as Raphael gave Lucas a pitying look. “You have a lot to learn, my friend.”</p><p>“Probably,” Lucas replied undaunted, “but let’s talk about Chicago.”</p><p>“Let’s talk about enemies first, Lucas,” Jared interjected. “How many people knew about Raphael’s arrival, and why would anyone bother to put a tail on us?”</p><p>Lucas sobered immediately. “I wish I knew the why of it, but the how isn’t that difficult. With both the Council meeting and the territorial competition being held at the same time in Chicago, it’s obvious Raphael would be coming this way, along with everyone else. And I made no secret of the fact that Klemens’s role in the assassination attempt on Raphael was a big part of what motivated me to take him out. In most eyes, that means the two of us are at least allies. From there, it’s a small step to think that Raphael might stop to meet with me so we could consult on Klemens’s replacement before the big confab. Which is exactly what we’re doing.”</p><p>“But, if they already knew we were coming here,” Jared persisted, “then, why tail us? What do they gain from that?”</p><p>“An opportunity,” Kathryn said from across the room, proving that the two women were paying more attention than Lucas had credited. “Maybe they knew you all were coming, but underestimated how much security you’d have with you. If your group had been smaller, if you’d been traveling in a single vehicle, for example, an RPG could have taken you all out.”</p><p>“Remind me never to piss you off, acushla,” Lucas joked.</p><p>“Too late for that,” she replied in kind.</p><p>“Kathryn has a point,” Cyn chimed in, meeting Raphael’s gaze. “And I’ve said this before. You’re blinded by your own power. You’re so used to being the baddest guys in the fight that you ignore the damage even a weak opponent can do with the right weapon.”</p><p>Kathryn nodded. “I’m not saying whoever followed you had an RPG. I’m just saying they’re available if you have the right connections, and it doesn’t take a genius to fire one.”</p><p>“So who hates you, Lucas?” Jared asked.</p><p>“The list is long and varied,” Juro growled.</p><p>Lucas gave the big vampire a surprised look. “Did my ears deceive me? Was that a joke, Juro?”</p><p>“No,” Juro snapped back.</p><p>Lucas laughed. “I’ve always known that beneath that stony exterior you love me.”</p><p>“Will you be serious, Lucas?” Kathryn said.</p><p>He sighed. “I don’t know why you’re all assuming they hate me. After all, they followed Raphael. Maybe it’s all tied up with the competition for control of the Midwest. I’ve been open in my support for Aden. If someone put two and two together, they might figure Raphael would throw his support to Aden, too. Maybe someone who wants the territory decided to even the odds before the challenge begins.”</p><p>“I thought it didn’t matter whose support the contestants had. I thought this was a survival of the fittest sort of contest,” Cyn said, giving Raphael a questioning look.</p><p>“Strictly speaking, my Cyn, that’s true. But it is not unheard of for one or more of the Council members to ... clear the field, you might say, for a favored candidate.”</p><p>“Have you ever done that?”</p><p>“I have not, and I must point out,” he said, turning to Lucas, “that there is no assurance Aden will win. There are several strong candidates in contention.”</p><p>“I know Aden, my lord. He’s going to be the one left standing.”</p><p>“Do you trust him?”</p><p>“He’s mine,” Lucas said simply. “I didn’t make him, but I took his oath more than a hundred years ago, and he’s never let me down.”</p><p>“But can he rule? You know the situation, Lucas. You know what we’re facing. We cannot afford someone who is unable to hold his territory.”</p><p>Every investigative instinct Cyn possessed sat up and quivered. The situation, he’d said. What situation?</p><p>“Aden’s been running St. Louis for me for a very long time,” Lucas was saying, in answer to Raphael’s question. “He was sitting right there on Klemens’s western border, dealing with almost constant incursions, and he never lost a square yard of territory to that bastard. He’s powerful as hell, and he’s smart enough when he isn’t being an ass. He doesn’t have the most outgoing personality in the world, but we share a certain history. There, but for the grace of a mother’s love and all that. In the final analysis, though, we’ve spent a lot of time together over the years, and I trust him.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“But ...” Raphael said, and his expression said there definitely was a but.</p><p>“Boy’s got a problem with women,” Lucas admitted. “Doesn’t mind fucking ’em—” He shot the two women a guilty look, and said, “Sorry, ladies.”</p><p>“We’re both familiar with the word,” Kathryn said dryly. “But how is it possible that you hung out with someone who doesn’t like women?”</p> <p>Lucas grinned and flashed her a lascivious wink. “I told you, he doesn’t mind bedding them, and there was never a shortage of volunteers for the job. But other than that ... he thinks they’re beneath him, and that that’s where they belong.”</p><p>“Hmmm,” Kathryn said thoughtfully. “Sounds like bad mommy syndrome. I guess we should be glad he’s only a vampire instead of a serial killer.” She paused a beat. “Oh wait, they’re the same thing.”</p><p>Cyn started laughing, and Kathryn joined in, the two of them high-fiving. They looked over at their respective vampire lovers, wanting to share the joke, and found the two of them staring back blank-faced. Which only made the two women laugh harder.</p><p>“An FBI agent, Lucas? Really?” Raphael said grimly.</p><p>“Oh, right,” Lucas drawled. “Because yours stays home and bakes cookies all night.”</p> <p>Cyn looked up from wiping tears from her eyes. “Hey! I can bake cookies.”</p><p>That only earned her a disbelieving scowl from Raphael, which threatened to set her off again. He shook his head and turned back to Lucas.</p><p>“Where is Aden now?”</p><p>“In St. Louis, but he can be here tomorrow.”</p><p>“All right. I’ll meet him as favor to you.”</p><p>“Thank you, Sire,” Lucas said, leaping gracefully to his feet. “In the meantime, this house is yours. Kathryn and I will stay at the homestead, and I’ll tell Aden to meet us out there tomorrow. It’s more discreet.”</p> <p>“That’s acceptable,” Raphael said. “But, Lucas,” he added, his voice going cold and deadly, “once that’s done, we’re going to find out who was after us and why. Because, if there’s to be a hunt, I intend to be the hunter, not the hunted.”</p><p>Chapter Four</p><p>Cyn waited while Raphael sealed the elevator door behind them, then turned and eyed the well-appointed bedroom.</p><p>“This isn’t Lucas’s and Kathryn’s bedroom, is it?”</p><p>“No,” Raphael replied, dropping his leather jacket on the back of a chair. “This is a guest room. Would it matter?”</p><p>“Yes,” she said emphatically. “I don’t like sleeping in someone else’s bedroom.”</p><p>“You slept in mine.”</p><p>“Back in the day,” she clarified, moving restlessly around the room.</p> <p>He laughed. “It wasn’t that long ago.”</p><p>“Just feels like it,” she said absently.</p><p>“Should I be insulted or flattered?”</p><p>“Take your pick.”</p><p>“Cynthia,” Raphael said. He didn’t use her full name very often. She looked at him. “What’s wrong?” he asked.</p><p>She studied him a long moment, then said, “What’s the situation, Raphael? When you were talking to Lucas,” she clarified, when he gave her a puzzled frown. “You said something about how he understood the situation. Well, I want to understand it, too. What is it?”</p><p>“Ah.”</p><p>Cyn watched him intently, holding her breath as she waited to see what his next words would be. Would he answer her question? Or would he deflect it with casual humor, or even sex?</p><p>He picked up his jacket from the chair and hung it in the closet, then sat down. Her lungs squeezed hard enough to become a physical pain in her chest when he lifted his black-eyed gaze and said, “Sit with me, lubimaya.”</p><p>“I can stand.”</p><p>“Please.”</p><p>She eyed him doubtfully, her lips flattened against the emotions clogging her throat. But he’d said “please,” which he rarely did, so she walked over. She intended to sit on the opposite chair, but Raphael had other plans. He snagged her hand and tumbled her onto his lap, holding her there when she would have gotten up.</p><p>“Raphael. I’m serious.”</p><p>“I know that. I’m ensuring that you can’t get away until I finish speaking.”</p><p>“Is it that bad?” she whispered, her chest so tight she could barely draw breath for the words.</p><p>“It is very serious, and, yes, it is bad, though I suspect not the way you mean it.”</p><p>“Just tell me,” she demanded, unable to stand the stress.</p><p>“You are aware that I’ve been gathering allies lately, beginning with Rajmund, although, of course, my relationship with Lucas is far older.”</p><p>“I’ve had my suspicions.”</p><p>“So have others, although no one but a select few understand my true motives. My enemies assume I’m trying to take over all of North America, that I’m setting puppets on the thrones of the other territories so that I may rule through them.”</p><p>“I don’t believe that. It’s something else, but I don’t know what.”</p><p>“This is the most critical of secrets, my Cyn. It cannot be shared with anyone.”</p><p>“So, why tell me now?”</p><p>“Because I nearly lost you to a secret, and nothing—no secret, no person—is more important to me than you.”</p><p>The tears rolled down her cheeks. Tears of relief that he wasn’t going to lie to her, and of love at the raw emotion in his words. She leaned against his broad chest, resting her head on his shoulder.</p><p>“Don’t cry,” he murmured, holding her close. “Listen, and tell me what you think.”</p><p>She nodded wordlessly.</p><p>“The threat is not on this continent, but in Europe. There are many very old vampires there, vampires who were alive long before I was turned, and who’ve survived by being both wily and powerful. They rule territories in Europe, as we do here. But the territories are small and crowded because these old vampires made too many children in years past, when a vampire was judged by such things.</p><p>“This overpopulation has created a large number of strong and ambitious younger vampires who have nowhere to go. They no longer wish to serve under the yoke of their masters, but there are not enough open territories—or at least not enough with lords who can be handily defeated—and no unsettled lands for them to move into.”</p><p>“They want to come here,” Cyn said, stunned with the realization as she sat up and stared at him.</p><p>He nodded. “They look at North America and see eight vampire lords ruling a vast amount of territory. They assume that makes us weak, that no one vampire is strong enough to rule so much, and they think to replace us with their own number. Not one vampire for a territory, but several. Not eight vampire lords for all of North America, but twenty-five or thirty.”</p><p>“And what about you? What about the others? Do they really think they can take you all on and win?”</p><p>“I am not privy to their strategy or thoughts, only their ultimate goal.”</p><p>“So what are we going to do about it?” she demanded.</p><p>Raphael smiled and hugged her close. “My fierce Cyn. Our first order of business is to continue as we have, to ensure the ascension of vampires we can trust, who will fight with us, and who are capable of consolidating and defending their territories should it come to a war. Which is why the selection of Aden is so important.”</p><p>“But you don’t know him.”</p><p>“I know Lucas, and while he may seem like someone who doesn’t take life seriously, the reality is quite different. When it comes to survival, Lucas is deadly serious. He also happens to be an excellent judge of others. He tells me it’s a side effect of his being a people person,” he added, grimacing in such distaste that Cyn had to laugh despite the seriousness of the subject.</p><p>“The talent probably lies in the opposite direction,” she assured him. “He’s a con artist, which means he has to understand his victims. It’s the same skill, just applied differently.”</p><p>“Did I ever tell you how Lucas and I met?”</p><p>Cyn frowned at what seemed like a non sequitur. “No,” she said.</p><p>“He thought to pick my pocket, or more likely to steal my purse. Either way, his so-called people skills failed him quite spectacularly.”</p><p>“I’m surprised you let him live.”</p><p>Raphael shrugged. “I saw something in him, something I thought I could use.”</p><p>“Were you right?”</p><p>It was Raphael’s turn to laugh. “Oh, yes. He was a challenge, but ultimately well worth the effort.”</p><p>“If you say so. Kathryn seems to like him anyway.”</p><p>“Speaking of Kathryn, remember, you cannot share any of this with her. If Lucas chooses to confide in her, that is his choice, but we cannot afford to let our enemies know that we know they’re coming. This is not a topic for your Mates Club.”</p><p>“You know about that?”</p><p>“Sweet Cyn,” he said, patting her ass affectionately, “I know about everything. You should understand that by now.”</p><p>Chapter Five</p><p>The next day found Cyn urging her horse up the final rise to the top of a hill, and thinking ruefully that the pretty little bay mare probably didn’t need her help, or her urging. No doubt the horse was far more familiar with this trail than Cyn was.</p><p>She’d been impressed earlier with Lucas’s stable of horses. For that matter, she’d been impressed with his stable. Cyn had been raised with money and privilege, and most of her friends growing up had been likewise fortunate. When she’d told Kathryn she’d had riding lessons all through her youth, she’d been telling the truth. She’d been taught by the very best instructors at the most exclusive stables that California and, ultimately, Europe, had to offer.</p><p>But even with that background, Lucas’s stables were amongst the finest she’d seen, especially in private hands. Horses weren’t cheap, not to feed, not to stable, and not to care for. But it was obvious that Lucas did all three and spared no expense. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Robbie suddenly surged past her on the right. He was riding a monster of a beast, a chestnut gelding who was at least eighteen hands tall and with fire in his eye. But then, Robbie was a big guy, so nothing smaller would suit. He was also, as it turned out, a damned good rider and seemed to relish the challenge the horse presented. Horse and rider both appeared to be grinning when they raced past her.</p><p>Cyn grinned back. Lucas’s lands were meant for riding, with lots of wide, well-groomed trails that were kept clear of obstacles. She supposed in the deep part of winter, with the snow up to everyone’s ass, the trails were less reliable. But as far as she was concerned, only a masochist would venture out in that kind of weather, anyway. As it was, the afternoon’s early December temperatures were pushing her boundaries of reasonable comfort, though even she had to admit the sun felt good on her face and the air was cold and fresh.</p><p>She leaned forward and patted her mount on the neck. “Don’t you worry about those silly boys, sweetheart,” she soothed. “They’ll stub a toe, and then they’ll be crying like the big babies they are.”</p> <p>“Raphael know you have such a high opinion of men?” Kathryn asked, coming up behind her at a more sedate pace than Robbie’s headlong dash.</p><p>“Of course, he knows. But then, as he’s always pointing out to me, he’s not a man.”</p><p>Kathryn laughed, as they rode side by side up over the rise and paused on the ridge line. “It is lovely here, isn’t it?” she asked, looking back over the rolling expanse of snow-dappled hills.</p><p>“Except for the cold.”</p><p>“Cold?” Kathryn scoffed. “Honey, you ain’t seen cold. It’ll be up to our asses in a month.”</p> <p>“Exactly what I was thinking. But I thought this was your first winter here.”</p><p>“Yeah, but I’ve visited the Minneapolis office enough times to know. Only for Lucas would I live here. I’m a Southern girl.”</p><p>“Lucky for me, Raphael hates the cold as much as I do.” Cyn spotted Robbie heading back toward her across the wide, flat top of the ridge. She stood in her stirrups to shout at him, and had just sucked in her breath to do so, when the unmistakable crack of a long range rifle shot shattered the peace of the day, and had both her and Kathryn diving for the ground.</p><p>“Cyn!” Robbie roared as he flew across the plateau. He jumped from the saddle before the big horse had even come a full stop, too much of a warrior not to have his rifle in hand as he crouched low and ran to where Cyn was scooting along the snow-covered ground, heading for the protection of a small cluster of good-sized rocks. “God damn it,” he swore as he grabbed her on the fly and half-carried her the rest of the way. Kathryn was already nearly there, having been closer when the shooting started. Robbie reached out now to snag her jacket and drag her behind the largest of the rocks.</p><p>“I counted two shots,” Cyn said, pulling her Glock from its shoulder holster and wishing she had something with better range.</p><p>“Rifle,” Kathryn confirmed. “Long range, probably—” She risked a quick peek and ducked back. “—the next hill over, those trees.”</p> <p>“What do you think, Robbie?” Cyn asked.</p><p>The big Ranger shrugged out of his dark-colored parka, leaving him in nothing but a long-sleeved, off-white thermal Henley. Rolling to one side, he squirmed down into the snow and slipped the barrel of his Remington M24 around the side of the rocks.</p><p>“Want me to put some snow on your head,” Cyn whispered, only half-facetiously.</p><p>“Fuck you, Cyn. I can’t take you anywhere.”</p><p>“Maybe he was shooting at you!” she hissed.</p><p>Robbie grunted, his eye and his focus now on whatever he was seeing through the scope of his rifle. Eventually, he pulled the gun back, rolled over and sat up.</p><p>“I think you’re right about where it came from,” he told Kathryn, “but the shooter’s gone. Probably saw his chance, took the shot, and then ran for it, maybe without even waiting to see what he’d hit.”</p><p>“This can’t be a coincidence,” Cyn said. “First we’re tagged from the airport, and now someone’s shooting at us.”</p> <p>“Yeah, but why us? You and I can’t influence the damn challenges,” Kathryn said angrily.</p><p>Cyn snorted. “Unless we die,” she said dryly. “When a vampire’s mate dies, it’s a devastating blow. Maybe they’re targeting you and me to get to Lucas and Raphael.”</p><p>Kathryn blushed hotly, her already cold-pinked cheeks getting even redder. She shot Robbie an embarrassed glance. “Um, Lucas and I aren’t actually mated yet.”</p><p>Robbie gave Cyn a meaningful stare. He clearly thought she was the target because her death would definitely hurt Raphael badly. Maybe even make him skip the Council meeting. She had to admit the evidence seemed to point that way, if Kathryn and Lucas weren’t mated. Sure, Lucas would mourn her death, but it wouldn’t hurt him the way the loss of a mate would. Of course, that assumed the shooter knew they weren’t mated, and besides, there were other reasons for shooting someone. It didn’t have to be related to vampire politics.</p><p>“Who hates you enough to try to kill you?” she asked Kathryn, avoiding the whole mating issue. “Any big FBI busts you’ve been involved in lately?”</p><p>Kathryn frowned. “Not really. I honestly don’t do that much field work, and when I do it’s mostly white collar stuff.”</p><p>“I thought terrorism was the big issue these days.”</p><p>“It is, but even there, my involvement is more in the way of tracing financial transactions, following the paper trails, not hunting down bad guys. Most of the people we arrest wouldn’t even know I was involved.”</p><p>“No offense, but it sounds pretty boring. You have skills. When this is all over, I think we should talk.”</p><p>Robbie groaned loudly. “I don’t want to hear this.”</p><p>“Don’t be so dramatic. You think it’s safe to stick our heads up?”</p><p>He grabbed his jacket and dug into a pocket, pulling out a pair of compact, but extremely powerful military-issue binocs. Propping himself higher, he began a systematic search.</p><p>“You were a boy scout when you were little, weren’t you?” Cyn teased.</p><p>“Babe, I was never little,” he said, without taking his eyes away from his search.</p><p>She smiled. “What do you see?”</p><p>“Snow, trees, rocks. Some grass. No bad guys.”</p><p>“What do you think?”</p><p>“I think I’m calling Steve Sipes back at the house to let him know what happened, and that we’re coming in.”</p><p>“Who’s Steve Sipes?” Kathryn asked.</p><p>“Raphael’s head of daylight security. Lucas must have one, too, right?”</p><p>“Yeah. Guy named John Breunig. He’s probably at the homestead, since that’s where Lucas is, but I can give him a call.”</p><p>“Do that,” Robbie said. “Sipes’ll call him, too, but it’ll be good if he hears from you directly first.”</p><p>Kathryn nodded and punched a speed dial number on her phone, while Robbie did the same. Feeling somewhat superfluous—something she wasn’t used to in situations like this—Cyn rolled into a crouch, and ignoring Robbie’s glare, she stood and made her way across the plateau to gather the horses. They weren’t happy about all the excitement, but she soothed them one at a time and brought them in. Even Robbie’s monster gelding.</p><p>Robbie was off the phone and glowering at her. “What if I’d been wrong? What if that shooter had still been active?”</p><p>“If you’d really thought that, you’d have tackled me before I ever got up.”</p><p>He stared at her a long minute, then huffed a laugh. “Come on. Let’s get you back to Raphael before I get any grayer.”</p><p>It was nearly dark by the time they returned to Lucas’s big house. They’d met Steve Sipes and his security team halfway back. He’d detailed some of his team to continue on to the plateau and see what they could find in the little bit of light that was left. While the rest of the team had escorted the three of them back to the estate, which Cyn thought was massive overkill. Whoever had fired on them was long gone, and a crappy shot to boot.</p><p>But she knew Raphael wouldn’t see it that way, and Robbie knew it, too. Raphael was powerful enough, and their bond was close enough, that even in his sleep, he’d have known that Cyn was in danger. So when they made it back to the stable, she passed the mare’s reins to Robbie, slid to the ground and ran for the main house. She didn’t recognize the security guys on the outer perimeter, but Sipes’s men were standing guard closer in, and two of them were waiting for her at the front door.</p><p>She smiled as she ran past, hurrying down the hallway to the elevator. She entered the code and stepped inside, slipping through the doors downstairs before they were fully open and rolling onto the bed just as Raphael opened his eyes and reached for her. She laughed as he tumbled her beneath him and efficiently stripped away her clothing until he had inspected almost every inch of her.</p><p>“I’m fine,” she said, reaching up to smooth his hair away from his forehead.</p><p>“I see that,” he purred, dipping down to nuzzle the side of her neck. “You smell like horse.”</p><p>“I think they were aiming at Kathryn, not me.”</p><p>He lifted his head. “That would have been small comfort if you’d been the one shot.”</p><p>“I’m sorry.”</p><p>He stared down at her, meeting her eyes, and then smiled ruefully. “I’m beginning to think I’m the one who should apologize to you. I’ve brought this violence into your life.”</p><p>“Raphael,” she said, letting everything she felt for him flood the link between them, “I love our life together. I love you. Without you, I’d still be sneaking around taking pictures of cheating spouses and probably end up getting shot anyway as a prowler. I’d much rather spend my life with you, no matter the risks. I love you,” she repeated. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He kissed her then, his lips moving over hers in a sensuous caress as he pressed his hips between her thighs. There was no foreplay, no preparation, just his cock, familiar in its weight and thickness, in the velvet stroke of it as he pushed deep inside her with a single thrust. She was wet and ready for him, had been ready from the moment he’d rolled her beneath him. She hungered for him always, for his touch, his heat, the spark of silver in his eyes, the deep growl of his voice.</p><p>She’d been a fool to think she could ever leave him.</p><p>“I love you,” she whispered, as he plunged between her legs, harder and faster until they tumbled over the edge of ecstasy together, their passion a searing heat that entwined their fates forever.</p> <p>And God help any creature who thought he could tear them apart.</p><p>“I am yours,” Raphael rasped against her ear. “Always, lubimaya. Always.”</p><p>Chapter Six</p><p>Raphael tugged Cyn closer, enjoying the heat of her body, the soft press of her breast against his side as they made their way to Lucas’s homestead. Blackness stretched all around them, their vehicle the only one seemingly for miles.</p><p>“Raphael?”</p> <p>“Cyn.”</p><p>She laughed, and it made him smile. “What is it, lubimaya?”</p><p>“Kathryn said she and Lucas aren’t mated.”</p><p>“No, not yet.”</p><p>“Do you know why?”</p><p>“As I understand it, Kathryn is what you would call commitment phobic. Lucas is giving her time to adjust.”</p> <p>“I was commitment phobic. You didn’t give me any time to adjust.”</p><p>“True. But then I am not Lucas.”</p><p>“You’re certainly not,” she said, burrowing closer and giving him a hard hug. “But you said they aren’t mated yet?” she clarified, emphasizing the yet.</p><p>“I believe Lucas will push for it sooner, rather than later. The situation we discussed will bring danger to all of us,” he said, his mood turning deadly serious. “There will be no more margin for adjustments, not for anyone. Lines will be drawn, sides will be chosen.”</p><p>“Will it come to that?”</p><p>“Almost certainly.”</p><p>“No hope for a peaceful resolution?”</p><p>“There is always hope, my Cyn, no matter how small. But hope doesn’t win wars. Preparation does.”</p> <p>They rode in silence, wrapped in the comfort of each other’s presence, in the knowledge that whatever the future brought, they would meet it together. The empty countryside flashed by the darkened windows, until the SUV slowed and made a turn seemingly out into the wilderness itself.</p><p>“Where the hell are we going?” Cyn muttered, as dirt kicked up by the SUV’s big tires billowed around the windows in pale clouds. “I’m telling you right now that if this involves sitting on a log and watching a fire burn, I’m waiting in the truck.”</p><p>Raphael kissed her temple. “No campfires. We’re nearly there. Look ahead.”</p><p>Cyn sat up enough that she could see out the front window, and he nearly laughed at the look at her face.</p><p>“What the fuck?” she demanded. “A log might be better than that ... shack.” She studied it more closely. “Oh my God, is that an outhouse?”</p><p>“I don’t think it’s functioning,” he teased. “This, my Cyn, is the homestead, the original domicile on this parcel of land, and the one that permitted Lucas to claim the entire acreage as his own.”</p><p>“The homestead,” she repeated flatly. “What’s next, bonnets and long dresses?”</p><p>Raphael grinned. “No bonnets for you. And no long dresses either, not the kind you mean anyway. I like your legs too much.”</p><p>“Aw, you say the sweetest things. But really, when you say homestead, you mean like from the Homestead Act? Because it certainly looks ancient enough.”</p><p>Raphael nodded. “It is. That shack, as you call it, was considered an improvement at the time.”</p><p>In fact, Raphael mused thoughtfully, once upon a time, the house had been the only structure for miles around, and what now served only as camouflage had been the sole truth of it—an old, poorly built house suitable for tear down and nothing else. But Lucas had long ago upgraded the structure, so that while it still looked old and rundown, it was anything but.</p><p>“It has been improved since then, however,” he assured her somewhat absently. “Jared,” he said, turning his attention to his lieutenant who sat in the passenger seat up front. “When is Aden arriving?”</p><p>“I’m told he’s no more than a few miles behind us, my lord.”</p><p>Raphael frowned. “How many are with him?”</p><p>“Only his lieutenant, Sebastien. That was the agreement, while Lucas has his two, and you have myself and Juro.”</p><p>“Gee, thanks, Jared. If anything happens, I’ll just wring my hands and fret like I always do,” Cyn said testily.</p><p>Raphael raised a single eyebrow in Jared’s direction, but the vampire didn’t bother to respond to Cyn’s remark, smart enough to know he couldn’t win that particular conversation.</p><p>Cyn glanced at Raphael. “I still think you should have brought more,” she said. “Too much weird stuff going on.”</p><p>He nodded. “Perhaps, but I don’t anticipate any hostilities tonight.”</p><p>Cyn snorted dismissively. “Put too many vampires in one room, and there are always hostilities.”</p><p>Raphael smiled. “No violence, then. Aden is sworn to Lucas, and they are friends besides.”</p><p>“If it’s all the same to you, I’ll keep my gun close anyway.”</p><p>“I wouldn’t dream of asking you to do otherwise,” he assured her, dropping a kiss on the top of her head.</p><p>“Jared, is Lucas ready for us?” he asked.</p><p>“Yes, my lord.”</p><p>The SUV came to a stop, blowing more sandy brown clouds over the front of their vehicle, obscuring the windshield until Raphael could barely make out the house. Behind the wheel, Juro scowled and turned neatly, parking the truck head out and to one side of the small porch. They waited until the dust settled, then the two vampires disembarked from the front seat. Juro moved a little away from the house and stood staring out into the stygian depths of the desert, his eyes glowing in the faint light, while Jared circled around to Raphael’s side of the truck and opened the door.</p><p>Raphael stepped out, then waited for Cyn, resting a hand low on her back as they walked toward the shabby-looking porch. The front door opened before they got there, splashing yellow light into the darkness, and making Jared swear as he turned his back before it could ruin his night vision. Sensing Lucas’s intent before the door ever opened, Raphael had lowered his eyes against the sudden light, and now lifted them in time to see Lucas coming toward him, his expression unusually grim.</p><p>“Sire,” Lucas said formally. Very few vampires knew of the blood tie between Raphael and Lucas. He only spoke of it now because the vampires present were the inner circle of their security, the warriors they trusted more than any other.</p><p>“Lucas.”</p><p>“I’m told the life of your mate was put in danger this afternoon. I apologize.”</p><p>“My Cyn believes your Kathryn was the target.”</p><p>“Does she?” He glanced back at the house with a scowl, though Kathryn was nowhere to be seen. “Kathryn was rather vague as to the details,” he said finally. “I’m beginning to think that was intentional.”</p><p>“Lucas,” Raphael said. “It’s dusty out here.”</p><p>“Is it?” Lucas asked, his usual grin returning.</p><p>Cyn huffed impatiently, and Lucas laughed as he started to reach for her hand. Raphael growled softly in warning, but Cyn deftly avoided the grab and moved back, sliding her hand into the crook of Raphael’s arm instead.</p><p>“Lead the way,” she told Lucas, her voice pleasant enough, though her eyes were narrowed in irritation.</p><p>Lucas went to link his arm with Raphael’s other side, but stopped midway when Raphael swung his head around and gave him a challenging glare.</p><p>“Shit,” Lucas swore, going straight for the open door. “You guys are too fucking serious. I need a drink.”</p><p>“Alcohol doesn’t work on you,” Cyn called.</p><p>“It does if I drink enough of it, sweetheart. Come on in.”</p><p>Cyn gazed after him as he disappeared inside, then she looked up at Raphael. “He doesn’t seem to be taking this security business very seriously.”</p><p>“The only time Lucas is unmistakably serious is when he’s on the field of battle. But that doesn’t mean he’s not paying attention the rest of the time.”</p><p>She gave him a doubtful look. “I’ll take your word on that, since I’m assuming tonight’s not going to end in a battle.”</p><p>Raphael started to agree with her, but the distant hum of an approaching engine made him pause, even as Juro came to his side and said, “Inside, my lord, if you please.”</p><p>Raphael nodded and urged Cyn toward the house’s open door. “There’s a vehicle coming,” he told her, assuming she hadn’t heard.</p><p>“Aden?” she asked.</p><p>It was Juro who answered, saying, “Probably, but we shouldn’t take that chance. Not even with your gun at hand.”</p><p>It was an obvious reference to Jared’s earlier, and unintentional, slight of Cyn’s skill, and she beamed at Juro. The two of them got along famously for some reason. Raphael couldn’t explain it, since Juro didn’t bother with very many people, but it comforted him to know that the big Japanese vampire and his brother would be there to protect Cyn if the worst happened. If his enemies succeeded, and Raphael was no longer there to do it himself.</p><p>Cyn glanced back, trying to sneak a glance at the new arrival, but before she could see anything, Juro followed them inside and closed the door, taking up a position with his back against the wall. Jared had moved farther into the room and assumed a watchful stance near the fireplace where flames were already licking hungrily over fragrant logs. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It wasn’t long before even her human ears could pick up the noise of the approaching vehicle, but now that they were inside, no one seemed overly concerned. Raphael had abandoned her in favor of joining Lucas near the fireplace, where they were pouring drinks from a carafe of something that looked and smelled like whiskey.</p><p>She used the time to take a good look around the fucking homestead. Obviously Raphael had been having a little fun at her expense, because the interior of the house was completely at odds with its outward appearance. It was on the small side, you couldn’t hide that, but what there was had been put to good use. The living room was spacious, probably close to half of the total footage, and beautifully decorated. The furniture—a big leather sofa and two matching chairs placed around a rustic coffee table with a natural rock base—was clearly intended to be used, and the fireplace had a gorgeous stone hearth. What looked like typical family pictures hung on one wall, and many of the knickknacks looked personal. This was different from what she’d typically encountered in her experience with vampires, most of whom tended to avoid personal mementos. It wasn’t that they wanted to forget, it was just that it was difficult to maintain the bits and pieces of a life when it lasted hundreds of years. It didn’t surprise her that it would be Lucas who went against the trend. He seemed to relish the role of rebel.</p><p>“Cyn!” Cyn turned as Kathryn made her way across the hardwood floor, boot heels tapping sharply. “I had to deal with a last minute phone call from the office. I’d hoped to manage a few days off the grid, but it’s not to be.”</p> <p>“I understand,” Cyn assured her. “This is a really nice place.”</p><p>“It doesn’t look like much from the outside, though, does it?” Kathryn said, laughing. “The first time Lucas brought me here, all I could think of was whether or not it had indoor plumbing.”</p><p>“I know, right?” Cyn agreed. “That’s what I said to Raphael, too.”</p><p>“You want a drink? I’ve got food for you and me. They’d starve us if we didn’t take care of it ourselves.”</p><p>“I forget about food sometimes myself. I’d say it’s good for my figure, except I make up for it on the days when I do eat,” Cyn commented, following her to the small kitchen, which clearly doubled as a wet bar. “You have vodka?”</p> <p>“We have everything.”</p><p>Cyn glanced over to the big couch where Raphael and Lucas were already deep in conversation. She could see the faint swirl of red in the amber depths of the drinks they were sipping, and knew they’d added blood. She felt the sharp bite of jealousy. Raphael wasn’t supposed to drink anyone’s blood, but hers.</p><p>“Ice?”</p><p>“What?” Cyn asked, turning to look at Kathryn. “Oh. Yes, thanks.”</p><p>Kathryn handed over her drink and stepped in close. “We need to talk,” she said almost too softly for Cyn to hear.</p><p>Cyn glanced up and held her gaze for a moment, then cut a significant glance at the two vampire lords. Later she mouthed silently, and Kathryn nodded her agreement.</p> <p>Just then, a heavy car door punched the air out front, and she heard deep voices. Juro moved, positioning himself between the door and Raphael, while Jared took a step closer. Raphael didn’t seem to notice. He remained seated while Lucas stood to greet his new guest.</p><p>Following Juro’s cue, Cyn set her drink down and unsnapped the safety strap securing her Glock in place. Kathryn caught the movement, and her eyes widened, her gaze swinging immediately to Lucas who was walking over to open the door.</p><p>“I’m going with you,” she snapped, striding over to stand with her lover. Lucas only smiled and brushed the back of his hand down her cheek.</p><p>“There’s no cause for alarm, Katie mine. Aden is a friend.”</p><p>Cyn caught Juro’s eye, then moved several feet to the right, giving herself a better angle on the door and taking all the friendlies out of her line of fire. Even Jared.</p><p>Lucas saw what she was doing and snorted a quick laugh. He shook his head and took a step forward, stopping right in front of Juro who was blocking the door. “Honestly, big guy. You know I would never endanger Raphael.”</p><p>Juro stared him down for a long heartbeat, then nodded once and stepped away.</p><p>Cyn expected some smartass remark from Lucas, but apparently he’d been sincere in his assurances to Juro, so he only nodded his thanks. He opened the front door and walked outside, and the smell of dust and exhaust fumes wafted in. A moment later and Lucas was back, and he wasn’t alone. The newcomer, presumably Aden, was nearly as tall as Raphael, but bulkier, with thickly padded shoulders and arms beneath a leather coat. His black hair and olive complexion made her think his origins were probably Mediterranean. He stepped into the room behind Lucas and paused, his hooded gaze taking in the room and everyone in it before zeroing in on Raphael. Cyn tensed when Raphael stood to meet him, but Raphael continued to look perfectly at ease, and she reminded herself that he was more than capable of defending himself—and everyone else, if it came down to it.</p> <p>“My lord Raphael,” Lucas said formally, “This is Aden.”</p><p>Aden surprised Cyn by giving Raphael a slow, respectful bow from the waist. He straightened, then waited a beat, his eyes carefully assessing, before he crossed the room and stretched out his hand in greeting.</p><p>Raphael’s impassive expression didn’t change, but he shook Aden’s hand, and Cyn was struck by the unusual tableau. Two big, beautiful males, almost visibly radiating power, sizing each other up, but with no overtly hostile intent. For now. Raphael gestured, inviting Aden to sit, and he did so, taking one of the chairs. Lucas and Raphael took opposite ends of the sofa facing Aden, and, as if that was the signal everyone had been waiting for, the tension level in the house plummeted. Even Juro relaxed somewhat, resuming his former sentry position against the wall.</p><p>Waiting for her heartbeat to return to normal, Cyn went back over to the small kitchen and drank a healthy slug of her vodka, feeling it burn all the way down. Kathryn joined her a moment later and pulled a beer out of the fridge.</p><p>“Guess I don’t need to worry about playing hostess, huh? No hors d’oeuvres for these guys,” she murmured to Cyn as she twisted off the cap and took a drink.</p><p>Cyn laughed. “They heard that, you know,” she said, not even trying to speak softly. She’d learned long ago that it was nearly impossible to foil vampire hearing. “Why don’t you and I go outside? If it’s too cold, we’ll climb into one of the trucks and turn the heater on. And I’ll tell you all the secrets of vampireland.”</p><p>“Vampireland,” Kathryn repeated. “I like that. Let’s go.”</p><p>“Cyn,” Raphael called before they’d gotten halfway to the door.</p><p>“We’ll be right outside,” she called sweetly.</p><p>He gave her stern look, then ruined it by giving in to the smile playing around his lips. Cyn couldn’t help herself, she smiled back. He was such a beautiful male, and he was all hers.</p><p>“We’ll be careful,” she promised.</p><p>“You have your gun, acushla?” Lucas called cheerfully.</p><p>Kathryn rolled her eyes and said, “You know I do, sweet thing.”</p><p>He laughed. “Don’t stay too long.”</p><p>“We’ll be fine,” Cyn assured them. “Besides, we’re in the middle of nowhere. Anyone tries to hit this place, we’ll see him coming a mile away.”</p><p>Raphael waited until the door had closed behind the two women, before returning his attention to the night’s business, which was Aden.</p><p>“I don’t mean to interfere, my lords,” Aden said, leaning forward urgently. “But additional caution is warranted. There are vampires out there who are plotting to do more than simply install a new Lord of the Midwest.”</p><p>Raphael eyed Aden for a long moment before answering. “What do you know of it?”</p><p>Aden glanced across at Lucas and said a single name. “Magda.”</p><p>Lucas shot him a look of disbelief. “Are you kidding me?”</p><p>“Lucas, you know me. I don’t kid about such things.”</p><p>“Fuck me. What’s that bitch up to?”</p><p>“Magda blames Kathryn for her disgrace,” Lucas’s lieutenant, Nicholas, interjected urgently as he circled the couch and took the other chair. “Maybe Cyn’s right about Kathryn being the target this afternoon.”</p><p>“I thought you and Magda were close,” Raphael commented.</p><p>“We were,” Lucas agreed. “Unfortunately, during the conflict with Klemens, she put her ego ahead of the safety of this household, and I reassigned her.”</p><p>“When I spoke with her very recently,” Aden said, “she had a real hard-on for you, Lucas. A woman scorned, unless I miss my mark.”</p><p>Lucas rolled his eyes. “She was jealous of Kathryn.”</p><p>“Well, she’s got it in her head that she can replace you as Lord of the Plains.”</p><p>Raphael grunted softly in disagreement. “I’ve met Magda. She wouldn’t make it a day without challenge, and she wouldn’t survive that.”</p><p>“No, she doesn’t have the juice,” Lucas agreed thoughtfully. “Doesn’t mean she’ll admit it, or that she won’t give it a try. Magda’s always had an inflated sense of self-worth. Is she acting alone?” he asked Aden.</p><p>“There were others with her, though none with real power. I wouldn’t hesitate to meet any of them in challenge, singly or, for that matter, altogether. And that includes Magda. You could leave this to me, my lords. I could eliminate all of them easily and count it as part of the competition.”</p><p>Raphael shook his head. “Kathryn may have been the target, but my Cyn could have been killed. Whether they intended to or not, they’ve challenged me, and I will not let it stand. In any event, I doubt they’ll wait until Chicago. They seem determined to eliminate one or both of us before then.”</p><p>“But why?” Lucas asked. “Me, okay, I get it. Magda’s pissed and not thinking straight. She thinks if I’m dead, she’ll be able to hold my territory. But why would she risk challenging Raphael?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Because she’s stupid and vindictive,” Aden growled. “You never should have fucked her. I warned you she was trouble.”</p><p>“You think all women are trouble,” Lucas replied. “Besides, it’s been decades since I took her to bed. And you’re wrong, she’s not stupid. I kept her on precisely because she’s damn smart.”</p><p>“Smart’s even worse. She thinks she can outwit you. She may be right,” he muttered.</p> <p>“Thanks for that, asshole.”</p><p>“Gentlemen,” Raphael said with forced patience. “Whoever is behind these attacks will be dealt with, whether it’s Magda or someone else. But we have other business to discuss tonight.”</p><p>“Of course, my lord,” Aden said.</p><p>“Lucas believes you can take and hold the Midwest, Aden. What do you think?”</p><p>“The territory is mine, my lord. The challenge is simply a formality. I know my competition, and I will prevail.”</p> <p>“Assuming you’re correct, and the territory becomes yours, Klemens ran a corrupt empire,” Raphael said. “Most, if not all, of his income came from illegal sources, which forced him to do business with untrustworthy humans of criminal repute. That made him weak, and I cannot afford to have a weak lord ruling the Midwest.”</p><p>He watched Aden closely, waiting to see how the other vampire would react to the implied threat. To see if Aden understood that he was being offered a place in an alliance—an alliance very much controlled by Raphael—and if he would agree to be a part of it. Or if he was stupid enough to challenge Raphael, which meant he would die here tonight.</p><p>“You don’t know me, my lord,” Aden said solemnly. “You don’t know my history. But I’ll tell you this much. I don’t consort with criminals, or with anyone whose purpose in life is to take advantage of others.”</p><p>Raphael nodded. “I had heard as much, but I needed to hear you say it. And don’t worry about Magda. Lucas and I can handle her.”</p><p>“Piece of cake,” Lucas chimed in. “She hasn’t broken the bond between us for some reason. Probably coasting on my protection for now. But it means I can find her.”</p><p>“And she will lead us to the others before she dies. It will make your path smoother,” Raphael told Aden. “There will be no need for you to expend your energy on what my Cyn would call low-hanging fruit.”</p> <p>Aden laughed. “An apt description, my lord. I would be happy to assist in Magda’s demise, however. I always enjoy a good hunt, and vampires are much wilier prey than humans.”</p><p>“The hunt is mine,” Lucas said. “Or ours,” he amended, catching Raphael’s chilling glance. “Now, I say we enjoy this very fine Irish—”</p><p>All three vampires were suddenly on their feet and heading for the door as the sound of gunfire cut through the night.</p><p>Chapter Seven</p><p>“There are times when I wish I smoked,” Cyn said as she leaned against the fading warmth of the SUV’s front end.</p><p>“I know what you mean,” Kathryn agreed, zipping her jacket. “It looks so satisfying in the movies. So cool. Smoke drifting in the cold air, dramatic pauses to suck in a new lungful of tar and nicotine.”</p><p>“Until the stuff kills them, anyway. They don’t show that in the movies.”</p><p>“There is that. I wonder if vamps can smoke. You know any who do?”</p> <p>Cyn thought about it. “I may have met one or two. But Raphael’s people are fairly fanatic about security, and so they tend to be health nuts, working out all the time, and forcing me to work out with them. Kidding,” she added, when Kathryn gave her a sideways look. “About the forcing, not the working out part.”</p><p>“I haven’t met that many of Lucas’s vampires yet,” Kathryn said. “I’ve seen them in battle, though, and they’re certainly serious about that. Maybe they’re health nuts, too. I’d meet more of his people if I traveled with him. He’d like me to, but the FBI prefers that its agents show up for work most days.” She smiled to show it was her turn to be joking, but Cyn sensed there was more to it than that.</p><p>“It’s difficult,” Cyn commented. “The vampire lords’ life style ... it’s all-consuming.”</p><p>“And Lucas is used to getting what he wants.”</p><p>“They all are. I’ve made it my personal mission to make sure Raphael doesn’t always get his way.”</p><p>“How’s that working out for you?”</p><p>Cyn chuckled. “Not so well, but it’s fun trying. And it drives him nuts, so the effort is well worth it.” She smiled, thinking about Raphael’s usual reaction to what he considered her stubbornness.</p><p>“Good times,” Kathryn agreed, and they both snickered.</p><p>“You know, the air’s really fresh out here,” Cyn said.</p><p>“Yeah, it is. Bracing.”</p><p>“What do you say we sit in the truck instead?”</p><p>“Fuck, yeah. Who needs fresh air? I’m freezing.”</p><p>Cyn laughed and opened the driver’s side door, sliding behind the wheel. She snagged the extra keys from their hiding place and turned on the engine, then made sure the heater was set to human warmth.</p><p>Kathryn turned as she settled into the passenger seat. “So ... this Mates Club ... There are other women like you and me?”</p><p>Cyn smiled. “I prefer to think of myself as one of a kind, but if you mean mated to vampire lords, then, yes, we are not alone. And we’re not all women, either. The vampire lord up in Canada is female. Her name is Sophia, and yes, she’s still called a vampire lord. Chauvinistic bastards. Anyway, her mate is a former Navy SEAL and all around badass named Colin Murphy. We went through some really heavy shit together a few months ago, and survived. He’s a friend.”</p><p>“And the rest?”</p><p>“There’s Sara, whose story is hers to tell, not mine. She’s a survivor, though, and also a friend. I’m actually the one who introduced her to Rajmund—he’s Lord of the Northeast. They did the traditional marriage thing not long ago, big wedding, the whole bit. Beautiful dress.”</p><p>“You and Raphael aren’t married?”</p><p>She shook her head. “We’re mated, which is the vamp way, and enough for us. I don’t know how much Lucas has told you, but it involves—surprise, surprise—an exchange of blood.”</p><p>Kathryn shook her head. “Lucas has hinted around about the mating ritual and what it would mean for us, but I can tell he doesn’t want to push too hard, too soon. It sounds a lot like being married.”</p><p>“It is, I guess. There are definitely advantages, though. The blood link means Raphael can find me anywhere in the world, pretty much. And the longer we’re together, the stronger the link. That’s why I had to race back to the house this afternoon. Our link is strong enough that he can follow me even in daytime, especially if something traumatic or emotional happens.” She huffed a laugh. “Like if somebody was shooting at us. I wanted to be there as soon as he woke up, so he could see I was fine. If I do get hurt, though, the blood link lets me heal a lot faster than normal.” She turned to stare out the windshield, thinking about Washington and how close she’d come to dying. “That shit I told you Colin and I went through together? I would have died if it hadn’t been for Raphael and the blood we share.”</p><p>Cyn grew silent, remembering, and realized how very quiet it was out here. No distant hum of traffic, no planes, no drift of music, no people. There were only her and Kathryn, and two vampires—Lucas’s second bodyguard, a big vampire named Mason, and Sebastien, who’d come with Aden. The two of them seemed to have reached agreement on how to guard the shack, er, homestead, as long as the honchos were convening inside. Mason was currently standing guard at the opposite corner of the house from where Cyn and Kathryn sat in one of the trucks, while Sebastien had disappeared around back a few minutes ago.</p><p>“Any other law enforcement in the club?” Kathryn asked, breaking the silence.</p><p>Cyn shook her head. “The closest is Emma, but she’s a lawyer, and a political one at that. She’s mated to Duncan in D.C. She—” Cyn stopped talking to stare straight ahead.</p><p>Kathryn followed her gaze. “What is it?”</p><p>Cyn didn’t say anything, just opened the truck door and stepped outside, listening hard. “Mason,” she called softly, “do you hear anything?”</p><p>He stared at her unblinking, then his head swiveled and his attention focused on the unpaved road leading to the house. His whole body seemed to lean forward intently, and then Cyn stopped watching him because her own senses were telling her that she’d been right all along. A truck was speeding toward the house, and with no lights. It was the dust cloud she’d seen first, caught in a chance flicker of moonlight at just the right angle to be visible for a few seconds. But she could hear the transmission whining with effort now, as the unknown driver pushed it past its limits, either unable or unwilling to shift gears. Another glint of moonlight, this one off metal, and then Cyn was pulling her gun and thanking the instinct that had warned her to load her so-called vampire killer rounds tonight. She didn’t know who was driving that truck, but the special ammo would work as well on a truck as a vampire.</p><p>“Kathryn!” she called, as the truck came into view, no more than sixty yards away and closing the distance fast. She felt more than saw Kathryn pull her weapon, felt her take up a shooter’s stance. The truck roared into the cleared area in front of the house. It was a big pickup, its diesel engine rumbling like a freight train. She could make out one person in the cab, the driver, his hands gripping the steering wheel and his unwavering gaze focused straight ahead. There was no hesitation, no lessening of speed as he drew closer, no indication that he doubted what he was about to do.</p><p>The sound of a sub-machine gun on full auto thundered in from Mason’s position, and then Cyn and Kathryn were both firing, not knowing what the driver had in mind, only that they had to stop him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cyn lifted her aim from the truck’s engine compartment and trained it on the driver instead. She saw the windshield crack, saw the driver slump over the wheel as if his strings had been cut. Saw someone big in the corner of her eye, and then a pair of strong arms was grabbing her, and before she knew it, she was inside the house and the door was being slammed with only seconds to spare before an ear shattering explosion rocked the homestead on its ancient foundation.</p><p>Chapter Eight</p><p>“Cyn?” Raphael stroked her face softly. She wasn’t hurt. He’d know if she’d sustained any physical injury. It was most likely the concussive shock of the explosion, which had rocked Lucas’s fortified house like a child’s toy and stolen her consciousness briefly.</p> <p>Her eyes opened, green and a little confused. He watched puzzlement turn to wide-eyed alarm before her gaze cleared and she reached up to touch his cheek.</p><p>“Is everyone okay?” she asked. “Mason was outside, and Sebastien, and ... the house?” She looked around, struggling to sit up.</p><p>“Everyone is well, lubimaya,” he said as he helped her sit up. “I told you, Lucas’s shack is far more than it seems. He often spends the daylight hours here and has no desire to be interrupted or attacked while he sleeps.”</p><p>“It must be a fortress,” she said softly. “Impressive. So what the hell happened?”</p><p>“Obviously, the truck was filled with explosives.”</p> <p>“Will you help me up?”</p><p>Raphael stood easily, then held out his hand. Cyn grabbed it, and he pulled her to her feet and into his embrace, whispering against her ear. “One too many times, my Cyn. This has to end.”</p><p>She pulled back to frown at him. “The only way to end this is to figure out who’s behind it, and take them out. You big bad bloodsuckers have any ideas on that?”</p><p>“One or two. Lucas?” he said, glancing over his shoulder.</p><p>“Replacement vehicles are on the way, Sire. We should remain inside—”</p><p>“Fuck that,” Cyn snapped. “We need to recover whatever we can of that damn truck. The driver’s dead, but if we can figure out where the vehicle came from, we can—”</p> <p>“How do you know the driver’s dead?” a deep voice said from behind her.</p><p>Cyn spun around, one hand on her Glock before it registered that Raphael never would have permitted a threat to come up behind her. She left her hand there anyway, and Raphael knew it was because it was Aden who’d spoken and she didn’t know him. The knowledge that Raphael and Lucas considered him an erstwhile ally would count in his favor, but even that wouldn’t be enough to make her trust a vampire she didn’t know.</p><p>“Because I killed him,” she said flatly, answering Aden’s question. “And if my bullets didn’t do it, then that explosion surely did. Raphael, I need to get out there before any more evidence is destroyed.”</p><p>“My lord,” Aden said, addressing Raphael. “I’m not certain the females should be involved in this.” He lowered his gaze to regard Cyn coolly. “I’ve spoken to Mason, and it was the two women who drew first, possibly in something of a panic upon realizing their own danger. I also find it curious that Ms. Leighton somehow knew the truck was coming before either of the vampires on guard. Perhaps we should check it ourselves first, rather than permit her—”</p><p>He didn’t get any further than that.</p><p>Cyn went ballistic. She pulled her weapon, her movement faster than a human should have been capable of. But Raphael was faster yet. He grabbed her from behind, wrapping her in his arms and holding her hand in place before the gun cleared her holster.</p><p>“Gently, my Cyn,” he whispered against her ear.</p><p>But there was nothing gentle about the rage burning in his chest, making his blood seem to boil in his veins. He was furious at the insult to Cyn, to her honor, and his blood link with her only made it worse. His fury leaked through to Cyn, combined with her own rage, and then pulsed back at him the same way, creating a closed circuit of his anger, stoking it higher and higher until it was a living, breathing thing. Until every other vampire in the room froze, wondering if they would survive the next few minutes.</p> <p>“Jared, clear the room,” Raphael ordered.</p><p>“My lord,” Jared murmured, and hustled over to the front door where Nicholas was already inputting a code on the keypad, releasing the security shutters. The steel plates retracted with a heavy grinding noise that made him suspect at least one of them had been damaged in the explosion. But no one commented on it. They simply waited in silence until Jared was able to pull the door open, and then one by one the lesser vampires vacated the room.</p><p>Jared was the last to go, meeting Raphael’s eyes with a nod, before pulling the door closed behind him, leaving only Aden, Raphael and Lucas, along with Kathryn—who’d refused to leave—and Cyn. Raphael hadn’t moved an inch while he waited. His arms still encircled Cyn, holding her tightly, preventing her from taking any action, still worried about what her anger might drive her to do. Or perhaps it was his own anger that worried him and Cyn both, because she freed a hand enough to rest it on his where it gripped her upper arm, and he felt a rush of warmth through their shared link.</p><p>There was no warmth when he spoke to Aden, however.</p><p>“I am hundreds of years older than you are,” he said in a voice that frosted the air around them. “I come from a time when women were chattel to be traded away for economic or social gain. But even I am not so backward that I continue to discount the integrity of women, not to mention their courage and intelligence. Lucas has told me you have issues with females. That is your history, your prerogative, your foolish prejudice. But when you let that prejudice interfere with serious affairs, with matters of life and death, that is ignorance and stupidity. My mate is worth a thousand of you. If she were a vampire, you would be calling her Lord of the South. Remember that before you think to insult her again, or the next time I’ll let her go ahead and kill you.”</p><p>Aden’s eyes had come alive as he listened to Raphael, as his avid gaze shifted to stare at Cyn. “So, the rumors are true,” he said softly. “It was you who killed Jabril.”</p><p>Cyn froze, her heart pounding against Raphael’s arm where he still held her fast. She tightened her grip on his hand, and he knew what she was asking. She wanted to claim her kill. She was justifiably proud of having gotten rid of the depraved and murderous Jabril, but Raphael had repeatedly told her to keep it quiet, that it was dangerous for anyone to know. And that was still true. But if Aden thought to join Raphael’s Council—and it was his Council, no matter its official designation anymore—then Aden needed to know with whom he was dealing. And he needed to know that he could not fuck with Raphael’s mate.</p><p>Raphael’s arms around Cyn gentled slightly. “It is true,” he said finally, making certain that Cyn could hear the pride in his voice, something he’d never let her hear before, though he’d always felt it. He’d been so damn proud that she’d not only triumphed over Jabril’s designs against her, but that she’d made him pay the ultimate price. Raphael only wished he could have been there, could have seen the shock in Jabril’s eyes at the realization he’d been bested not simply by a human, but by a woman.</p><p>Aden bowed his head slightly, a sign of both acknowledgment and respect. “I meant no offense, my lord.”</p><p>“Of course you did,” Raphael scoffed. “But your offense was against Cynthia, not me. And make no mistake, you won’t be given a chance to do it again.”</p><p>Aden dipped his head a second time. “My apologies, Ms. Leighton,” he said politely enough, but he continued to stare at Cyn, studying her curiously. Raphael frowned and exerted a tiny bit of his will, compelling the other vampire’s sight upward, away from Cyn, until it collided with Raphael’s own cold gaze. He held it there just long enough to make his point, long enough that Aden was forced to acknowledge Raphael’s unbreakable control.</p><p>Raphael released him. “Do you still believe this is Magda’s doing?” he asked casually, as if they hadn’t just clashed in a test of wills.</p><p>“I do, my lord,” Aden responded, demonstrating his willingness to accept Raphael’s lead and move on to urgent matters. “Lucas knows her better, but this latest attack—all of the attacks thus far—are consistent with what I know of her. She prefers to act from the shadows, sending others to do her work.”</p><p>“I bet that driver was human,” Cyn commented, proving that while she was still angry, she was more interested in pursuing the source of the attacks than in killing Aden. For now, anyway.</p><p>Raphael gave her a final hug and then released her.</p><p>“Why do you say that?” Aden asked, and Raphael could hear nothing but sincere curiosity in his voice. Cyn apparently had some lingering doubt about that sincerity, because she waited a moment before answering.</p><p>“Observation,” she said finally. “He had the headlights on at the end—when he was really speeding up—and you guys never need them. For another, he was scared to death, gripping that steering wheel for dear life and staring straight ahead, as if he was under a compulsion, unable to break away even if he’d wanted to. And, frankly, he died too easily. I’m certain it was the gunfire that killed him, not the explosion. And I don’t think a vamp would have died from even my special ammo at that distance.”</p><p>“Special ammo?” Aden asked curiously.</p><p>“147 grain Hydra-Shok,” Cyn informed him. “Small hole going in, really big hole coming out. I call them my vamp killer rounds,” she added, and Raphael could hear the quiet warning in her voice, before she added, “But you guys are tough. At that distance and with the truck moving so fast ... I don’t think it would have killed a vampire.”</p><p>“Perhaps,” Aden allowed.</p><p>“I’ll tell you what, if the sun comes up and there’s no bloody bits lying about? If there’s nothing but ash?” Cyn said with a shrug. “Then we’ll know for sure.” She turned to Raphael. “In the meantime, I know time is short until sunrise, but Kathryn and I—” She glanced over and caught Kathryn’s nod of agreement. “—need to check out the scene before we leave. The driver’s body—what’s left of it—will attract animals, and they could drag away evidence. It’d be ideal to store the body somewhere, but I’m not eager to tote it around, and I doubt Lucas wants to store it in here.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucas made a noise of disgust that made his position clear.</p><p>“I’d like to do as much as we can before Kathryn has to get back to the city,” Cyn continued. “And then I can come back by daylight and do a more thorough search.”</p><p>Raphael didn’t say anything, but he wasn’t happy about her coming out here without him, and he didn’t try to hide it.</p> <p>“I’ll be careful,” she promised, clearly understanding the source of his concern. “And I’ll have Robbie with me. You know his instincts are even better than mine when it comes to sensing danger. And it’s not like anyone can sneak up on us out here in the middle of nowhere.”</p><p>He studied her a few minutes longer, then nodded reluctantly. She smiled, rising up on her toes to kiss him lightly. “Don’t worry,” she whispered directly into his ear. “I’ll tuck you into bed first.”</p><p>If they’d been alone, she’d have been naked and on her back already. But since they weren’t, he satisfied himself with a warning glare, which only made her laugh. Clearly, she was in terror of his retribution.</p><p>“One thing puzzles me,” Cyn said, stepping back to include Lucas and Kathryn in the conversation. “You said Magda worked closely with you, Lucas. So why would she aim a bomb at what she knew was a fortified building?”</p><p>“She didn’t know,” Lucas said simply. “Most of my vamps have never been out here, and of the ones who have, only Mason and Nick are aware of the extra security measures. There’s an underground bunkhouse out back where my guards sleep, so there’s no need for them to come in the house. And Magda never liked the place. Said it was too primitive. She hasn’t been out here since we put the furnishings in, which was well before we added the enhanced security.”</p> <p>Cyn nodded her understanding, but what Raphael found most interesting about Lucas’s comments, was that he had no qualms about revealing his security arrangements while Aden was in the room. That indicated a level of trust which spoke directly to Lucas’s confidence in Aden, and it made Raphael’s opinion of Aden go up a notch, despite his blindness when it came to women.</p><p>“Okay, we need to check out the scene,” Cyn was saying. “Kathryn, I have a flashlight in my purse, but just one, and these guys never need them.”</p><p>“Hey,” Kathryn said in mock affront. “Don’t you watch TV? I’m an FBI agent. I always have a flashlight with me.” She disappeared into the bedroom, emerging a moment later with the same kind of Mini Maglite that Cyn carried. Raphael couldn’t help noticing the similarities between the two women, and he only hoped Kathryn tormented Lucas as efficiently as Cyn did him. The thought made him smile.</p><p>“I hate to break up the party,” Lucas said dryly, when the women were gone, “but it’s getting late. Kathryn will be going back to the city this morning, but, Raphael, I’ll have to stay at the main house today. We don’t know yet what damage this place has suffered, and given the situation—”</p><p>“This is your home, Lucas. Your territory. In any event, Cyn and I will leave for Chicago at sundown.”</p><p>Everyone was being polite, Raphael thought to himself, but the truth was that vampire lords were too aggressive and territorial to play well together, especially when visiting another’s territory. The annual Council meetings typically lasted only a few hours, with the various lords flying in for the meeting and leaving just as quickly. This year’s meeting in Chicago would last longer because of the challenge, but since the city was part of the Midwest and currently no one’s territory, the strain would be lessened.</p> <p>There was also the fact that under Raphael’s guidance, the members of the Council were slowly becoming allies, rather than enemies. They couldn’t erase their vampire instincts, but they could blunt them long enough to get along and work toward a common goal. Which was why Raphael had maneuvered all of them into this situation in the first place. If the European vampires had left him and his alone, he would have been happy ruling nothing but his Western territory with Cyn at his side. But he was nobody’s victim. If Europe wanted a fight, they’d get one. And they’d discover the bitter taste of defeat.</p><p>But for today, Raphael and Lucas would sleep in the same house, albeit as far from each other as physically possible. It helped that Lucas was Raphael’s child, and that he was willing to submit to Raphael’s will if it came down to it. But despite their love for each other, it would be stressful. It was necessary for this one day, but that was it.</p><p>The front door opened with a squeal of damaged wood, and Cyn stuck her head in.</p><p>“The replacement SUVs are here, and sunrise is about an hour away,” she said with obnoxious good cheer. “Time to rock and roll, my lords.”</p><p>“Time to rock and roll?” Raphael repeated, as he locked down the elevator in their guest quarters.</p><p>Cyn laughed. “I considered going with saddle up, what with Lucas having horses and all, but decided to stick with the classic instead.”</p><p>“Classic is obviously a relative term,” Raphael commented drily.</p><p>“You’re being awfully calm about me going back out to the homestead this morning.”</p> <p>“As you said, Rob will be with you, and I happen to agree with your reasoning. It is necessary to find and stop Magda before she can disrupt the challenge in Chicago. With all of the other lords present, the potential for disaster is fairly high. And that doesn’t take into account the challengers who will be on edge even without her machinations.”</p><p>Cyn narrowed her eyes at him. “Who are you?”</p><p>“My Cyn,” he said, stepping close to her and trailing a finger down her silken cheek. “I have finally come to understand that my attempts to control you only result in you engaging in ever more risky behavior in order to prove that I do not, in fact, control you. I have, therefore, changed my approach. I am capable of adapting, you know.”</p><p>“You, my love,” she drawled, “are one of the most adaptable people I have ever met. You have one goal, and that is to win. And you do whatever it takes to get there.”</p><p>“I would move heaven and earth to keep you safe, lubimaya.”</p><p>“I know,” she said, her eyes going soft. “Even though I could argue you’re controlling me by not controlling me.”</p><p>Raphael laughed. “If only we had time for that discussion,” he said with mock regret. “You did promise to tuck me into bed, however.”</p><p>“Hmm. So, I did.” She shrugged out of her jacket, letting it drop to the floor behind her, then stripped her sweater off over her head. “How much time do we have?” She walked toward him, her hips swaying seductively as she twisted the front clasp on her bra.</p><p>Raphael growled and stuck his fingers into the waist band of her jeans, pulling her closer as her bra fell open, baring her beautiful breasts. He rested a hand on her waist as he bent to take her mouth in a kiss. Her arms snaked around his neck as she leaned into the kiss and pressed the full length of her body against him.</p><p>Their tongues caressed each other in a dance that was both familiar and different every time. She tasted like Cyn, sexy and seductive and surprisingly sweet. He could smell the enticing scent of her blood, so very close to the surface of her satin skin, the delicious perfume of her arousal. He lowered his head to the curve of her neck and simply breathed her in. He loved this woman as he had never loved another, as he never would love another.</p><p>He bent suddenly and swung her up into his arms, unable to wait any longer. The sun wasn’t far away, and he needed to be inside her, needed to feel her bucking beneath him, to hear her cries as she came over and over again, helpless in the throes of their lovemaking.</p><p>Cyn laughed as he threw her onto the bed. He pulled her boots off, then began tugging at his own clothes.</p><p>“Strip,” he ordered. “I want you naked.”</p><p>Cyn blew a raspberry at him, but put her hands on her jeans, snagging her lacy underwear as she began a sexy shimmy that shoved them both over her hips and down her endlessly long legs. When they were around her ankles, Raphael bent and pulled them the rest of the way off, then wrapped his fingers around her calves and placed one knee on the bed between her legs.</p><p>He looked her over then, one eyebrow raised in a challenging stare as he slid his hands higher along the inside of her thighs, spreading her legs until she was completely open to him.</p><p>“Raphael,” she whispered, her breaths shallow, her heart pounding so loud that he didn’t have to strain to hear it as he watched her fingers twist into the elegant silk of the bed’s coverlet.</p><p>“My Cyn,” he crooned, pressing his hand to the slick wetness between her legs, spreading the swollen lips of her vagina, and leaning close enough that his hard cock stroked teasingly against the satin skin of her inner thigh.</p><p>“I thought you said ...” She panted a little to catch her breath, trying to finish her sentence. “You said,” she repeated breathlessly, “there wasn’t much time.” Her last word ended on a cry as he slipped a finger into the delicious heat of her sex, while his thumb rubbed slow circles around her sensitive clit.</p><p>Cyn groaned and tried to reach for him, but he only smiled. She swore and palmed her own breasts instead, pinching her nipples until they were full and ripe as cherries, until he could almost see the blood pulsing between her fingers.</p><p>It was his turn to swear. Leaning forward, he flattened one hand beneath her upper back and lifted her breasts to his mouth, sucking hard, first right then left, before biting one juicy nipple with a hungry growl. Cyn cried out, her nails digging furrows into the skin of his shoulders as her back bowed upward, offering herself to his mouth. Her hips thrust against him impatiently, her legs wrapped around his hips, pulling him into her heat.</p><p>Raphael reached between his legs with a snarl, and fisted his cock, wetting only the tip between her thighs, sliding it up and back, enjoying her small cries of frustration, until he finally positioned himself and entered her with a firm thrust. Plunging as deep as he could go, feeling the trembling sheath of her body as it parted before his invasion, then wrapped him in a hot, wet embrace. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cyn scraped her fingers along his scalp and gave a hard tug on his hair, pulling him up to her mouth, tasting her own blood on his tongue as they kissed passionately. This was no longer a seductive dance of tongues. This kiss was demand and desire all tangled up in the deep love they felt for each other. It was a hunger they could never satisfy, and one they would never tire of. Their teeth clashed as their tongues fought for dominance, and Raphael wanted to roar with the sheer joy of the battle.</p><p>With a growl, he wrenched his mouth away from her lips and nipped at her neck. Cyn’s breath caught, and he felt the first clench of her sheath. He bit harder, still teasing, still not breaking the skin, but beneath him Cyn’s muscles tightened in excitement, and the hot grasp of her pussy began to shiver around his cock.</p><p>Raphael lifted his head enough to stroke his tongue over the taut side of her neck. He kissed the swell of her jugular once, a bare touch of his lips.</p> <p>“I love you, my Cyn,” he whispered against her hot skin.</p><p>“Raphael,” she panted, then groaned as her inner muscles contracted.</p><p>Raphael’s fangs emerged, and he struck without warning, slicing into the velvet honey of her vein, her blood filling his mouth, his stomach, spreading heat and life into every inch of him, until it was hard to tell where she ended and he began.</p><p>Cyn cried out, her inner walls fisting his cock until he could barely move, her abdominal muscles clenched, the hard pearls of her nipples scraping against his chest as she climaxed, bucking beneath him. He knew he should retract his fangs, should stop the satin flow of her blood into his mouth. He was powerful and old, he didn’t need much blood to sustain himself, but this was more than nourishment—this was his Cyn. He took one more long, indulgent pull, relishing the sheer, sweet taste of her, then lifted his head enough to lick the twin wounds shut.</p><p>Her eyes flashed open, green and fogged with desire. Her tongue dashed out, and she licked her lips, meeting his gaze in a challenge of her own, as she flexed her inner muscles around his cock.</p> <p>Raphael sucked in a breath as desire flooded every nerve, heating his blood and swelling his cock to almost painful hardness as it jerked deep inside Cyn’s sexy body.</p><p>He growled and cupped her ass with both hands, holding her open as he began fucking her with long, hard strokes, the friction of their bodies generating an almost volcanic heat that surrounded his cock and shot straight to his balls. It soared higher and higher, a wild heat that shot down his shaft, splashing against Cyn’s womb as she orgasmed yet again, the two of them thrusting against each other until they were both spent and breathless.</p><p>Raphael collapsed on top of Cyn, feeling the pulse of her heart beating against his chest for only a moment before he rolled to one side, taking her with him. It was a few minutes before either one of them could speak.</p><p>“How’s that for tucking?” she asked, the tease ruined by the jaw-cracking yawn she spoke around.</p><p>“Excellent tucking,” he agreed. “You should sleep.”</p><p>“No,” she insisted. “I need to get back to the homestead before there’s nothing left to find.” She yawned again, then groaned. “Jesus, I hope there’s coffee on this ranch somewhere.”</p> <p>Raphael hugged her. “Lucas has the usual daytime staff, so I’m certain there’s coffee and breakfast, too. You need to replenish.”</p><p>“I need to drink water, you mean. That’s what I get for loving a bloodsucker.”</p><p>He slapped her ass.</p><p>“Hey! There’s no need to beat me.”</p><p>Raphael scoffed wordlessly, and she laughed.</p><p>“What’s your plan for the day, then?” he asked.</p><p>“Depends on what we find at the homestead. If there’s anything to follow, we’ll do that, but I’ll be back before dark.”</p><p>“Promise.”</p> <p>“Yeah, yeah, I promise.”</p><p>“I love you, my Cyn,” he murmured.</p><p>She rose up enough to press her lips against his. “I love you back, my Raphael.”</p><p>Raphael closed his eyes against the searing heat of the rising sun that was blazing inside his skull. He fought it as long as he could, straining to remain awake, to give voice to the alarm bells clanging in the back of his mind. But this was one foe he could never defeat, and sleep claimed him before he could warn her that among vampires even friends could be enemies.</p><p>Chapter Nine</p><p>“Fuck,” Robbie muttered, as he climbed from the SUV and stood staring at the debris scattered in front of Lucas’s homestead house.</p><p>Cyn ignored him as two of Lucas’s daytime security guards walked over to join them. She recognized both of them from the previous morning, and smiled a greeting.</p><p>“Okay with you if we look around a little?” she asked, although the request was mostly for form, because the visit had been arranged in advance.</p><p>“Help yourself,” one of the guards said. “Lord Donlon cleared it already.”</p><p>“Thanks. You all haven’t seen anyone snooping around, have you? Maybe a vehicle headed this way in the distance that turned around suddenly?”</p><p>The guard shook his head. “See for yourself. Line of sight goes on forever here. We’d definitely notice.”</p><p>“Okay. We’ll poke around a bit, and get out of your hair.”</p><p>“Holler if you need anything.”</p><p>Robbie didn’t look up when she rejoined him. Eyes on the ground, he grumbled, “Whose idea was it to search through this stuff anyway? Oh, wait,” he continued, slanting a look at Cyn. “It was yours.” He leaned over to push aside a piece of tire, then grunted in disgust.</p><p>Cyn glanced over at what appeared to be a piece of human rib bone with bits of meat still attached.</p><p>“I’m surprised there are any body parts left,” she said absently, returning to her own search. “I thought the animals would have dragged it away or eaten it by now.”</p><p>“A visual I could live without,” Robbie groused. “You know, Cyn, when you called this morning, you said we were going hunting, not picking through some guy’s barely dead remains.”</p><p>“We’re not picking through remains, we’re looking for clues. And then we’ll go hunting.”</p><p>“You sure the big guy knows you’re doing this?”</p><p>“Absolutely, and he agreed it was necessary.”</p><p>Robbie sighed. “All right, what the hell are we looking for again?”</p><p>“I think our best bet is finding something from the truck. It looked like a personal vehicle to me. I had other stuff on my mind at the time, but I remember it as being fully loaded. Shiny paint, lots of chrome, big tires. Somebody’s baby.”</p><p>“Nothing from the plate?”</p><p>Cyn closed her eyes briefly, trying to replay what she’d seen in those few minutes of panic. “What’s the South Dakota plate look like?”</p><p>Robbie frowned. “Mount Rushmore, I think.”</p><p>Cyn stared at him without seeing. “Yeah, that could be it. Blue sky, with something gray. It might have been Rushmore.”</p><p>“Great. That narrows it down to only a few hundred thousand vehicles.”</p><p>“Don’t be snarky. It was dark, and he turned his lights on when he got closer. Not to mention the bomb he was carrying.”</p><p>“Excuses,” he tsked, shaking his head.</p><p>Cyn grinned despite herself. “Okay,” she said, scouring the scattered debris. “Our best bet—and I know it’s a long shot, so no smart ass remarks—would be even a small piece of the plate. The back end was loaded with explosives, not to mention the gas tank, so that probably blew all to hell, but the front plate might have been thrown out of the immediate blast range.”</p><p>“No problem,” Robbie said absently, reaching into his pocket and pulling on a latex glove. “I’ll get right on that for you.”</p><p>Cyn’s laugh trailed off as he held up a bloody piece of something.</p><p>“Unless you’d rather have this,” he said, grinning. “I do believe it’s a thumb.”</p><p>She hurried over. “I think you’re right,” she said. She retrieved a bottle of water from the SUV, and poured it over the gruesome appendage, washing away the dirt and grime.</p><p>“Could be someone else’s, I guess,” Robbie said.</p><p>“Nah, it’s too fresh. Let’s see if our guy’s in the system, shall we?”</p><p>She whipped out her cell phone, took the thumb in her own gloved hand, and pressed it to the screen, scanning it quickly before handing it back to Robbie. The image was automatically sent to her laptop, which would then query every fingerprint database she had access to, and that was most of them.</p><p>“Ain’t technology great?” Robbie commented. “Should we save this thing?”</p><p>Cyn dug a plastic baggie out of her pocket. “Just in case.”</p><p>“Speaking of cases,” he said, dropping the thumb into the baggie, “how come the local cops aren’t all over this? That explosion was visible for miles. We saw it from the ranch.”</p><p>“Kathryn says Lucas is friends with the mayor. He made a few calls, and voila, no police were dispatched. Your tax dollars at work.”</p><p>“More likely it’s Lucas’s political contributions at work. Corruption is everywhere.”</p><p>“Yeah, well, get over it and help me decide what to do next, because we have a winner, boys and girls.”</p><p>They both peered down at the ID displayed on Cyn’s cell phone. “Matthias Hoover,” she read. “He has an old DUI conviction. No surprise that one would hit first. There’s an address, but this record is old. Let me see ...” She tapped the screen rapidly, accessing the local white pages, and found a listing under the same name, same address.</p><p>“I love people who stay in one place. Incoming,” she murmured and sent the address to Robbie’s phone, which pinged almost immediately.</p><p>“Got it,” he said. “What now?”</p><p>“We check out the house.”</p><p>“Cyn,” Robbie said in clear warning.</p><p>“If it looks like Magda or any other vampire is using the place, we won’t go inside,” she promised. “We’ll wait until sunset, and let the big guns handle it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Promise?”</p><p>She scowled. What was it with everyone demanding promises from her? It’s not like she did crazy stuff all the time. Well, not anymore.</p><p>“Scout’s honor,”’ she told Robbie.</p> <p>“You were never a scout,” he snickered as they climbed into the SUV and drove away from the wreckage.</p><p>“It’s a saying, Robbie. Sheesh. You know where you’re going?”</p><p>“No, but the Nav system does. Sit back and enjoy the ride.”</p><p>Enjoy the ride, Cyn thought to herself. What was there to enjoy? She’d never been a fan of the kind of dry, barren country she was seeing outside the truck window. She could admire the spires and pinnacles in the distance, but the view was mostly hills covered with dry grass with blotches of snow. In the spring, it was probably lovely and green. In a few weeks, pretty and snow-covered white. Today? Splotchy brown and boring.</p><p>She caught Robbie checking his rearview mirrors and frowned, thinking she’d seen him do that one too many times.</p> <p>“Problem?” she asked, cutting a glance at her own side mirror.</p><p>“That blue sedan three vehicles back. I’m sure it was behind us earlier.”</p><p>Cyn studied the car in question, angling her head for a better view. There weren’t a lot of vehicles on the road, but enough that someone could tail them if they were smart about it.</p><p>“What do you think? You want to drive around a little?”</p><p>“Our exit’s coming up. Let’s see if they follow us.”</p><p>Robbie slowed, exiting to the right, and making an immediate right hand turn. Cyn didn’t even look where they were going, too intent on watching their potential ghost.</p> <p>“He kept going,” she said, twisting around to look out the back window. “Hold up a minute.”</p><p>Robbie pulled to one side, and they waited, until she couldn’t see the blue sedan anymore.</p><p>“Looks like we’re clear.”</p><p>He did his own quick scan, then nodded. “I’m going to drive around a bit before going to Hoover’s house just to be safe, but I think you’re right.” He put the truck in gear and pulled back onto the road.</p><p>By the time they reached Matthias Hoover’s address, they were confident they’d lost their tail, assuming they’d ever had one. They parked about a quarter mile away on the opposite side of the street, and under the stark cover of a bare-limbed black walnut tree.</p><p>Cyn raised a pair of binoculars to her eyes and scanned the house. It was small and old, and stood alone, separated from its nearest neighbor by several hundred yards of scrub. It was in desperate need of a paint job, and if it hadn’t been for the light dusting of snow on the ground, Cyn was pretty sure the front yard would have been nothing but dirt and a few scraggly bushes.</p><p>Well, that and the two human guards lurking around the perimeter, which told her this wasn’t exactly an ordinary human dwelling.</p><p>After watching the guards silently for a few minutes, Cyn lowered her binoculars. “What does that look like to you?” she asked quietly.</p> <p>“Looks like a big comedown for someone who used to live on Lucas’s ranch,” Robbie said, studying the house through his own binocs.</p><p>Cyn swallowed a chuckle. “Tell me about it. But I’m talking about the guards.” She lifted the binoculars again.</p><p>“Is that what they’re supposed to be?”</p><p>Cyn eyed the two human guards who were standing at opposite corners of the house, not even trying to look alert. “Point taken.”</p><p>“Probably a vamp house, though,” Robbie agreed. “Shades are all down, and why else have guards at all? Unless it’s drugs, but that sort tend to have a more effective watch than those two.”</p><p>“Assuming it’s vamps, and I think it is, it doesn’t have to be Magda. There’s no reason for her to hang around. She could have sent Hoover off on his suicide mission, and moved on to Chicago. Whoever’s in there might just be some flunkies she left behind to keep an eye on things.”</p><p>“Or maybe she wanted to be close to the action. If the bomb had succeeded in taking Lucas out, the territory would be up for grabs, right? Maybe Magda figured she could swoop in while everyone was still reeling.”</p><p>Cyn pursed her lips thoughtfully. “Maybe. Or maybe this house is all she can afford. After all, it was Lucas’s money that subsidized her lifestyle before. Maybe she’s a shopaholic and spent all of her salary on clothes.”</p><p>“Bummer.”</p><p>“Doesn’t matter why, or even if, she’s here, I guess. Doesn’t matter how many are in there either, because Raphael doesn’t approve of killing vamps while they sleep, not even the assholes.” She stared at the house thoughtfully. “Although ...”</p><p>“I don’t like the sound of that,” he said worriedly.</p><p>“... it might be useful to know how many vampires are in there. You know, so Raphael will know what he’s dealing with.”</p><p>Robbie huffed dismissively. “Yeah, right. Because Raphael and Lucas would just have one hell of a time coping if there’s too many of them low-level vamps in there.”</p><p>“Spoilsport. But you’re right, damn it. Hey!” she said, brightening. “What if when we go back to the ranch to tell Raphael, Magda wakes up, and is gone before we get back here?”</p><p>“Nice try, babe. How about if we use a cell phone to tell Raphael instead? And that way no one can sneak away.”</p><p>“No, I promised Raphael I’d be there when he woke up.”</p><p>“Okay, so I drop you at the estate, then come right back here. I’ll keep watch just in case that Magda bitch is an early riser. If they take off, I’ll follow.”</p><p>“You sure?”</p><p>“You worried about me, Cyn?”</p><p>“Always. It’s a pain in the ass to train a new bodyguard.”</p><p>“Love you, too, babe. You just wake the big guy and bring reinforcements. I’ll be waiting.”</p><p>Chapter Ten</p><p>Cyn propped herself on Raphael’s chest and watched him sleep. Some might argue that what he did wasn’t a true sleep, since he couldn’t wake up. But he dreamed, and it was restful for him, and that was close enough for her.</p><p>Her eyes cut to the digital clock on the bedside table. She was like a walking Farmer’s Almanac these days, at least when it came to the sun. She heard the minute click of the clock as the time changed, and then Raphael’s arms came around her, and she smiled. It was always the first thing he did. His midnight eyes opened, and his big hand rested familiarly on the curve of her butt.</p><p>“Hi,” she said happily.</p><p>“Good evening, my Cyn.” He tugged her higher until their mouths met in a soft, welcoming kiss.</p><p>“And how was your hunt today?”</p><p>“Good. We’re pretty sure we found the house where Magda’s holed up.”</p><p>He eyed her cautiously. “And is she still there?”</p><p>“If you’re asking if we went into the house, the answer is no. We decided to wait for you guys.”</p><p>He studied her for a moment, his handsome face drawn into a scowl. “Where is my Cyn, and what have you done with her?”</p><p>She slapped his chest.</p><p>“On second thought,” he said, rubbing her butt, “I recognize this ass. So why the suddenly sensible approach?”</p><p>“It was Robbie’s influence. He’s determined to be the voice of reason.”</p><p>“And what does that make you?”</p><p>“Alive. Because everyone knows the voice of reason is the first to die when the monsters come.”</p><p>He blinked, then shook his head. “I don’t want to know. Tell me where this house is, and I’ll let Lucas know. Magda is his child, after all. He’ll want to deal with her.”</p><p>“But we have to go back there, too,” she said urgently, raising herself enough to stare into his face. “Robbie’s waiting for us.”</p><p>“We’re leaving tonight. You can call Rob, have him meet us at the airport.”</p><p>She gave him a narrow-eyed look. “You’re doing this on purpose, to torment me.”</p><p>“Am I? Maybe it’s a test of your new cautious nature.”</p><p>Cyn made a dismissive noise. “I never said anything about being cautious, fang boy, so put that idea right out of your head. We could easily have taken Magda’s human guards, but I know how you feel about killing vamps while they sleep, so there was no point in going inside. So there.”</p><p>He laughed. “Welcome back, my Cyn.”</p><p>“You’re awful. How am I supposed to become a better person?”</p><p>“You don’t need to get any better,” he said, his voice deep and silky as he buried his face against her neck. “I love you exactly the way you are.” Without warning, he rolled her beneath him. “You’re wearing clothes.”</p><p>“You’re not,” she said, flexing her hips playfully, feeling the hard length of his arousal.</p><p>“I need to shower.”</p><p>“Hmmm, I’m feeling a bit gritty myself. That explosion site was pretty gruesome.”</p><p>“We could shower together.”</p><p>Cyn flexed her hips again. “It might take longer that way.”</p><p>Raphael stood, taking her with him. “Then we should get started.”</p><p>“What’s taking them so long?” Cyn sat with Elke on the stairs of Lucas’s big house, watching Raphael and Lucas discuss how to proceed with the night’s hunt, and thinking Kathryn would be sorry to miss this. Especially if it turned out to be Magda in that house. Cyn had gotten a clear impression that there was no love lost between the two of them. Unfortunately, Kathryn had been called into the agency this morning, so she was going to miss the big takedown.</p><p>Assuming it ever happened.</p><p>The vampires all stood at the bottom of the stairs, near the several big SUVs which were waiting to take them away ... once they finished negotiating. Jared and Juro were there with Raphael, and Nicholas from Lucas’s side. It was all terribly civilized, which struck Cyn as rather anticlimactic under the circumstances. They were about to hunt down and kill some rogue vampires, not rendezvous for dinner at the local steak house. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What the fuck?” she demanded irritably. “Robbie’s been sitting on that house all alone for hours. We need to get there.”</p><p>“It’s a question of precedence,” Elke said. She sat one step higher than Cyn, leaning back on her elbows with her legs stretched out in front of her. To all appearances, she was completely relaxed, but Cyn knew she could be on her feet in mere seconds if a threat manifested. She also could probably hear every word the two vampire lords were saying.</p><p>“What precedent?”</p> <p>“Several actually, that’s the problem. Raphael is Lucas’s Sire, which gives him precedence. But this is Lucas’s territory, and Magda is his child. And though Raphael was followed from the airport, most likely with nefarious intent, the other far more dangerous attacks affected both lords equally, whether intentionally or not.”</p><p>“Jeez, sign a fucking contract why don’t they? If I’d known they were going to call in a mediator, I’d have taken care of it myself while the sun was up. Can we go now?” she called loudly.</p><p>Raphael said something that made Lucas laugh. She gave him a squinty look. “What’d he say, Elke?”</p><p>“I couldn’t hear.”</p><p>“Bullshit.”</p> <p>“You’re like a sister to me, Cyn—”</p><p>“I hate my sister.”</p><p>“Okay, bad analogy, but I’m not telling you anyway. You’re a friend. But Raphael owns me body and soul.”</p><p>“Yeah, yeah.” She glanced at Elke over her shoulder. “Think your lord and master is going to get his very fine ass in gear any time soon?”</p><p>“Are you ready, my Cyn?” Raphael said from way too close, his deep voice laced with amusement.</p><p>Her head snapped around to find him standing right in front of her, one hand held out. She scowled as she let him pull her to her feet. “I hate it when you do that,” she muttered as they walked toward the waiting SUVs. The two lords were traveling in separate SUVs. They’d agreed on that much early on. Ostensibly, this was because Raphael and his party would be going directly to the airport after dealing with Magda. But Cyn knew the real reason was because they were getting on each other’s nerves. She could feel their growing tension like a constant, and fucking irritating, buzz over her skin. It was a relief when they finally climbed into their respective vehicles and drove away from the house, putting some distance and cold metal between the two powerful lords.</p> <p>“So what’s the deal?” Cyn asked Raphael once they finally hit the main road and started making good time. “You guys work out your issues?”</p><p>Raphael’s sensuous mouth curved slightly as he put his arm over her shoulders and pulled her close. “The kill is Lucas’s. Magda is his child.”</p><p>“Well, that blows. Why’d I bother to track her down if we don’t even get in on the kill?”</p><p>He studied her for a moment, his eyes gleaming silver in the darkness of the backseat. “You’re so bloody-minded, lubimaya,” he said with obvious pride. “Is this is my influence? Or were you always this way?”</p><p>“I didn’t stab other children on the playground, if that’s what you’re asking. Let’s just say that living with you has freed up my more primal instincts and leave it at that.”</p><p>“So, it is me,” he concluded, chuckling happily.</p><p>Cyn slanted a quizzical look at him. “Most guys would be freaked out to discover they’re living with a homicidal woman.”</p><p>“But I,” he purred, skimming his lips over her cheek, “am definitely not most guys.”</p> <p>Cyn turned her head to catch his lips in a kiss. “No, you’re not,” she murmured. “And thank God for that.” She kissed him again. “So why are we bothering, if we’re not in on the kill?”</p><p>“For appearances. Magda offended us equally, after all.” He paused a moment. “But mostly because Lucas thinks it will be fun to hunt together again.”</p><p>Cyn rolled her eyes. “Not much of a hunt. I already found her for you. And for the record, if anyone else asked ... no, forget it. No one else would dare ask you to do something just for the fun of it. Except me, of course. But I don’t get why Lucas wants you to do it tonight. You guys are already on the verge of ripping out each other’s throats.”</p><p>Raphael was spared from responding to that when Cyn’s phone rang. Frowning, she took a quick look. “It’s Robbie,” she told Raphael before answering. “Everything okay?”</p><p>“Something’s going on, Cyn. There’s a new bunch of vampires who just arrived at the house, and I don’t think they’re friendlies.”</p><p>“The challenge is active,” Raphael said softly, his vampire hearing having permitted him to hear both sides of the conversation. “Who is it?”</p><p>“Do you recognize anyone?” she asked Robbie.</p><p>“No one I know. There’s five of them, but one guy’s clearly in charge. He’s big, nearly as tall as Raphael, but darker, Middle-eastern looking.”</p><p>“Aden,” Raphael said simply. He pulled out his own phone and hit a speed dial. “Lucas,” he said. “We have company.”</p><p>“We’re minutes away, Rob,” Cyn said quickly, half listening to Raphael’s call. “You okay?”</p><p>“Yeah, I don’t think they saw me, and I’m not sure they’d associate me with Raphael, even if they did. You need to get here, though.”</p><p>Cyn disconnected and caught the tail end of Raphael’s conversation with Lucas. “The decision is yours,” he said, and disconnected.</p><p>Cyn took one look at his carefully blank face. Not angry, not anything. It was his vampire lord face, remote and unemotional. “What was that?” she asked.</p><p>Raphael shrugged. “Magda belongs to Lucas, but Aden is within his rights to challenge her.”</p><p>“Doesn’t he have to wait until the Council makes it official?”</p><p>“She’s made it clear that her intention is to compete for the territory. Not only to Aden, but to others. That effectively began the competition, at least where she was concerned.”</p><p>“Well, damn. This just gets worse and worse. Now Aden gets the kill.”</p><p>Raphael laughed, hugging her close. “My poor Cyn.”</p><p>She sat up suddenly. “There,” she said, pointing out the black SUV where Robbie waited. “The house is that white one with ... oh,” she concluded, realizing there was no need for her to point out the house. The human guards were gone, but Aden was very much in evidence. Backed by two other vampires, he was approaching the closed front door of the house. He turned at their approach, and strode out to meet them with a welcoming smile. It was the first smile Cyn had seen on his face.</p><p>“He looks awfully smug,” she said sourly.</p><p>“Come,” Raphael said, blatantly trying not to laugh as he took her hand. “Let’s see what Aden has to say for himself.”</p><p>By the time they were out of the SUV, Raphael’s stoic lord of the universe mask was firmly back in place. He nodded as Lucas joined them, then they both turned cool gazes upon Aden.</p><p>“My lords,” Aden said, clearly striving for solemnity, but it was a losing battle. He was too obviously pleased with himself to manage it.</p><p>“You knew she was staying here?” Lucas asked. His manner was not altogether friendly, and Cyn felt the first prick of unease. There was a lot of power in those three. Raphael and Lucas were both proven commodities, and Aden obviously had power of his own if he thought to rule the Midwest. With tensions already running high, the likelihood of everything going south was terrifyingly high.</p><p>Aden’s smile disappeared. Smug or not, he was smart enough to see the risk and avoid adding to it. “I did not know where Magda was, my lord. I did, however, assume she was in town, given the attack last night. And, so ...” He turned and gave Cyn a sly look. “I had someone follow Ms. Leighton and her friend this afternoon.”</p><p>Raphael grew very still. Not a good sign.</p><p>“We suspected there was a tail on us,” she said casually, trying to break the tension. “But we thought we lost them.”</p><p>“You did,” Aden agreed. “But you got them close enough. There aren’t that many houses out here, after all.” What he left unsaid was that as a potential vampire lord, he was powerful enough to sense Magda’s presence once he got close enough.</p><p>“I’ll send you a bill,” she said, slipping her arm through Raphael’s. “It won’t be cheap.”</p><p>“Quality never is,” he said, with a slight dip of his head. He turned his attention to Lucas. “But there is still the question of Magda, my lord.”</p><p>Lucas scowled and was about to say something when the front door opened, and a curvy, dark-haired woman appeared. No, not a woman, a vampire. As were the two young men who crowded behind her, as if she could protect them.</p><p>“Magda,” Raphael told Cyn softly.</p><p>Magda paused briefly, eyes wide as she stared at the welcoming committee of vampires on her doorstep. She was a beautiful woman. Cyn acknowledged that much as she watched Magda visibly attempt to gather her courage, to wrap herself in the arrogance of someone who knew the value of her own beauty. But she couldn’t do it. Not with two vampire lords waiting for her, not when she’d tried to kill those same vampire lords less than twenty-four hours earlier.</p><p>Magda closed her eyes as if in prayer, then strode forward. Juro immediately stepped in front of Raphael, even as Nicholas moved to intercept Magda before she could reach Lucas. She flashed an angry glare at him—she had enough arrogance left for that—but then her gaze found Lucas, and there was nothing but pleading in her eyes. She dropped to her knees, then lower, prostrating herself before her Sire.</p><p>“Sire,” she said, her voice muffled as she kept her eyes downcast, her face nearly touching the ground. “I was a fool. I beg forgiveness.”</p><p>Cyn stared at the prostrate female in disbelief. Did she really think Lucas would forgive her for trying to kill him and Raphael? For taking a shot at Kathryn? Something of her surprise must have alerted Raphael, because his fingers tightened almost imperceptibly around hers. Cyn glanced at him, then followed his gaze to Lucas. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucas. Raphael had told her not long ago that the only time Lucas was truly serious was on the field of battle. And perhaps this qualified, because the lighthearted, teasing Lucas was gone, gone, gone. The Lucas who stepped around Nicholas to stare down at Magda was as cold as ice, terrible in his beauty, his eyes gleaming with a subdued golden light. He raised those eyes to the two vampires still lingering in the doorway, and his lips peeled back to bare his fangs. He didn’t move so much as a muscle that Cyn could see, but suddenly the two vampires collapsed, scattering into dust before their bodies hit the ground.</p><p>And then he turned that deadly gaze on Magda.</p><p>“My lord,” Aden said, boldly interrupting. “The challenge has begun.”</p> <p>And the way he said it, it sounded formal, like part of a ritual.</p><p>For a moment, Cyn thought Lucas would kill Aden for daring to speak. His golden gaze lifted to stare at Aden, and there was no friendship in that look, no emotion at all. It was the flat look of a predator deciding whether his prey was worth the effort of killing.</p><p>But Aden never flinched. His own eyes lit with the deep blue of dusk as he faced down his master, his friend, his body language a complex mix of both submission and challenge. “My lord,” he repeated. “The challenge has begun.”</p><p>Lucas blinked lazily, then shifted his predator’s gaze to Magda and said, “The challenge has begun.”</p><p>“No!” Magda shrieked. Her eyes were wild, rolling white as they went from Lucas to Aden and back again. “Please, Sire! I beg you!”</p> <p>To no avail. Lucas turned his back on her as if she represented no threat at all and walked back to the waiting SUV. Nicholas was not so sanguine about his Sire’s safety. He never took his gaze off Magda as he backed after Lucas.</p><p>Magda jumped up as if she would run. Aden did no more than glance at her, but he unleashed a slap of power that Cyn felt like a shiver along her bones as it slammed Magda back to the ground, and left her screaming in pain.</p><p>Cyn figured it was all over then, but Aden turned slightly, shifting his attention to Raphael, and holding his gaze for a moment before dipping his head in a slow bow. “The challenge has begun, my lord.”</p><p>Raphael nodded casually, his body language completely relaxed as he shifted to slip an arm around her waist, his fingers dropping to caress her hip. “The challenge has begun,” he agreed. And then, still holding onto Cyn, he turned and walked away, as if none of it mattered anymore, as if Magda, writhing on the ground in pain, struggling against Aden’s invisible bonds, didn’t matter anymore.</p><p>And perhaps she didn’t. It was the way of Vampire. There was no room for pity or squeamishness.</p><p>“Are you certain of him?” Raphael asked Lucas when they met up at the vehicles.</p> <p>“I am. He can be an ass, but he will stand with us, Sire,” Lucas insisted. But despite his confident assurances, there was something in his voice that drew Cyn’s attention, a bleakness in his eyes that told her Magda’s imminent death was going to hurt him. Or maybe it was her betrayal. Or both. But whatever it was, it made Cyn, the least huggy person in the world, want to give him a hug. So, she did.</p><p>Lucas sighed softly when her arms came around him.</p><p>“Tell Kathryn I’ll call her,” she told him, when she stepped away. “She needs to know what to expect in Chicago. Major frock event.”</p><p>A little bit of Lucas’s usual twinkle returned to his eyes. “Sounds intriguing.”</p><p>“It is,” she agreed, one brow arched. “But you don’t have the equipment to appreciate it.”</p><p>Lucas smiled at that, then turned to Raphael. “See you in Chicago, Sire.”</p><p>Raphael nodded. “Until then.”</p><p>The two vampire lords clasped hands and slapped backs quickly, then strode away from each other while trying to look like they weren’t in a hurry. Which they so obviously were.</p> <p>Juro took off as soon as Raphael climbed in and pulled the door closed. Cyn turned around to verify Robbie’s presence in the convoy, then settled next to Raphael for the trip to the airport.</p><p>“That was kind of you,” he said quietly.</p><p>Cyn shrugged uncomfortably. “He seemed so sad, and Kathryn wasn’t there.”</p><p>“Ah, yes. Kathryn. I assume your conversation with her will include this new club of yours?” he asked casually.</p><p>Cyn was grateful for the change of subject, but she wasn’t fooled. He was dying to know what was up with the Mates Club.</p><p>She snuggled closer with a deep sigh. “I just want to be sure Lucas has warned her about the formal events in Chicago. You know, so she knows how to dress.”</p><p>“Hmm,” he said.</p><p>“You know what I wonder?” she asked.</p><p>“I cannot imagine.”</p><p>“Ha, ha. But I was wondering ... how much I should charge Aden for coasting on my investigation. I had to take a fucking print off a dead guy’s thumb!”</p><p>Raphael laughed. “You’re still upset you didn’t get to bloody anyone tonight.”</p><p>“Hell, yeah, I am.”</p><p>He tucked his mouth next to her ear and said, “We’ll have to work off that energy some other way.”</p><p>She shivered, then turned and met his kiss, closing her teeth over his lower lip. “Promise, my lord?”</p><p>“Promise, my Cyn.” His gaze became distant, as if he was seeing something she couldn’t, and he said, “But do not worry. There will be blood enough for everyone before this is finished.”</p><p>Epilogue</p><p>Chicago, Illinois</p><p>Cyn held Raphael’s hand tightly as they strolled down the hallway. The hotel corridor was empty, despite the number of guests already filling the large ballroom beyond the double doors just ahead of them. Raphael’s security had cleared the way for them, just as she knew others had done earlier that evening. All of the sitting vampire lords had walked down this same hallway this evening. Raphael was only the last.</p><p>Some might have thought having all of the lords in one place made them vulnerable, an easy target. But vampire lords were scary powerful. Put them all together, and you didn’t have an easy target. You had a bomb waiting to go off in your face. Except the vampire lords would all be alive and well after the so-called bomb went off, and you’d be dead.</p><p>Not that there wouldn’t be violence associated with tonight’s gala. But it wouldn’t be coming from any of the current vampire lords. The sole purpose of this gathering was to launch the competition which would determine who would be the next Lord of the Midwest. Everyone’s power was on full display. No one was hiding what they were, from the lowest minion to the prominent contenders, to the lords themselves, and aggression was running high. According to Raphael, the vampire lords’ presence and power were the only things that kept it from becoming a complete free-for-all.</p><p>“Are you ready, my Cyn?”</p><p>She looked up and found Raphael watching her with infinite patience. Well, that and the heat that was always there when he looked at her, as if what he really wanted to do was drag her back to their private suite and fuck her senseless. Which he’d already done once this evening. Twice if you included the shower. Which she definitely did. She smiled in recollection, and he smiled back, knowing what she was thinking.</p><p>“You look beautiful, lubimaya. As always.”</p><p>“So do you, fang boy.” And, God, that was true. Some men were born to wear a tux, and Raphael was one of them.</p><p>“The others are waiting,” he told her, although his look clearly said they could wait forever if that’s what she wanted.</p><p>“I’m ready,” she said. “Let’s go wow the masses.”</p><p>“Or at least a few vampires,” he amended.</p><p>Cyn was laughing when they opened the doors. There were smiles and greetings all around as she and Raphael joined the others. Air kisses and hugs, and the enthusiastic admiration of designer frocks, and tuxes, too. Improbably enough, these people had become her friends, and she paused a moment to take them all in.</p><p>“My lord,” a deep voice said, and she turned to find Aden waiting to pay his respects. “Ms. Leighton,” he added, smiling.</p><p>“I e-mailed you my bill earlier,” she informed him, with a shark’s grin. “You’ll want to be sitting down when you open it.”</p><p>Aden laughed cheerfully. “It was well worth the price. I couldn’t have done it without you.”</p><p>“That’s for sure,” she agreed.</p><p>“If you’ve finished, my Cyn,” Raphael said smoothly, slipping his arm around her waist. “We do have business to conduct.” He shifted his gaze to Aden. “I wish you luck, Aden. I’m certain we’ll hear from you before it’s over.”</p><p>“Thank you, my lord. I look forward to it,” he said, then bowed again and disappeared into the crowd.</p><p>“You think he’ll be the next vampire lord?” she asked Raphael.</p><p>“I’m quite certain of it.”</p><p>“Will he join us when the time comes?”</p><p>“If he doesn’t, he dies,” Raphael said without pause. “There is no room for sentimentality or friendship in the coming battle. He’s either with us, or I’ll kill him myself and find someone who is.”</p><p>And then, Raphael tightened his arm around her, and together they returned to their friends and allies, the ones who would stand with them until the end. </p> </body></html>"]