["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Nicky sang the lyrics to his favorite Bruno Mars song as he danced his way into the room in front of Marco. He’d been told he had a nice singing voice, and Marco smiled indulgently at him as Nicky swayed his hips and did a little two-step on his way over to Marco to trail his fingers over his broad, muscular chest.</p><p>Teasingly, Nicky skipped away as Marco reached for him, humming softly as he pulled off his clothes to get ready for bed. It was late and he needed sleep, but Nicky was still exhilarated and happy because the party to welcome the newcomers to the pack had been such a huge success. Nicky pulled up his shirt and ran his hands over the taut muscles of his abs, moving his other hand down inside the waistband of his jeans, knowing Marco’s eyes were on him. Nicky loved to tease Marco, making the bulge in his tight jeans even larger than it already was.</p><p>Marco moved up beside him and brushed Nicky’s hand on his abs impatiently away, replacing it with his own. The larger man pulled him tightly against his body and put his lips to the skin at Nicky’s throat, his tongue licking out causing Nicky to groan and thrust his hips out toward him. Before Nicky quite knew what was happening, Marco had taken over the job of undressing him. He left a trail of Nicky’s clothes on the floor as he walked him backward to the bed, then picked him up and tossed him on the mattress.</p> <p>Grabbing both his wrists in one of his hands, Marco pulled them up over his head and held them there while his mouth moved to Nicky’s throat, his eyes, and back to his lips. He dipped his head down and took one brown nipple in his mouth, teasing and taunting the sensitive nub with his teeth and his tongue. He dropped his hands down to cup Nicky’s ass and pulled him possessively close to him. The intensity and the desperation startled Nicky. “God, I need you. I love you so much,” Marco whispered frantically in Nicky’s ear. “Love me, baby. I have to have you.”</p><p>Nicky laughed, wrapping his legs around Marco’s waist and pulling him even closer. “Then take me! I’m all yours.”</p><p>Marco moaned and pulled Nicky’s legs down long enough to reach blindly for the oil on the table next to the bed. Since his hands were trembling with need, he got more of the oil on the backs of Nicky’s thighs than on his ass, but it was enough to get the job done. When he pushed first one finger inside Nicky’s tight hole and then another, stretching him gently, Nicky squirmed in excitement and pleasure. Marco smiled down at him as he rubbed his fingers against his puckered entrance.</p><p>“It’s enough, Marco. Please, sweetheart. I need you inside me now. Don’t wait.”</p><p>Marco lowered his hips to nudge inside him, and Nicky lifted his own hips in welcome, pushing his head back on the pillows. “That’s it, baby,” Marco murmured. “You’re my sweet love. My only love.” Marco whispered the words in his ear and Nicky twisted his head to capture Marco’s mouth. As he touched his lips to Marco’s, it was as if he ignited a powder keg. Marco took his lips with another groan and surged into Nicky, burying himself to the balls and dragging his cock over Nicky’s prostate again and again. Nicky came with an intensity that surprised him. He couldn’t seem to stop, and for a moment, it reminded him of their first time together, when the knot had caused him to have those unbelievable, endless orgasms. Marco called out hoarsely and followed him seconds later, pulling Nicky to him so tightly he could barely breathe.</p> <p>They both lay still for a long time afterward, like two survivors in the aftermath of a storm, clinging together, unable to move apart. Finally, Marco shuddered and got up to get a warm cloth to clean Nicky. He cared for his mate tenderly and afterward, stretched out on the bed behind him, spooning Nicky’s body and holding him close.</p><p>“Good night, sweetheart,” Marco said softly, kissing the back of Nicky’s neck. Nicky cuddled back into him and sighed, so much in love and so satisfied, he never wanted to move from where he was right that very minute.</p><p>“I love you, Marco,” he said. Marco murmured something in reply and Nicky thought idly that he’d never been so happy in his life. Happiness this perfect couldn’t last, could it? A superstitious shiver shook him, and Marco tightened his hold around Nicky’s waist, making a soft questioning sound.</p><p>Nicky cuddled back into Marco’s embrace. “Nothing, baby. Someone must have walked over my grave. Go back to sleep.” He sighed and settled into the warmth of Marco’s embrace as he drifted down to sleep.</p><p>The next morning, Nicky woke up early and stretched, turning toward Marco, who was still deeply asleep, his mouth slightly open, with soft snores coming from his throat. Nicky kissed his forehead tenderly and slipped from the bed. He pulled on a pair of sweat pants and walked into the kitchen, got a glass from the cupboard, and poured himself some orange juice.</p><p>He stood by the window looking out at the mountains as he drank his juice and thought he’d never get tired of looking at the beautiful vistas he saw from this vantage point on the second floor. From here he could see deep green ridge after ridge fading off to light blue in the distance. When he’d first come to the mountains, he thought the lodge was isolated and lonely, but not anymore. Now he couldn’t imagine living anywhere else.</p> <p>Finishing his juice, he drifted over to the sofa and lay down on his back with his feet propped up on the back of the sofa. Idly, he picked up a magazine his best friend Logan had given him. He didn’t want to make any noise that would wake up Marco.</p><p>Marco had been so tired lately with all the stress of getting the new pack members settled in, Nicky wanted to let him sleep as long as he could. He was worried about him, really. In the last couple of weeks, he’d developed deep shadows under his beautiful smoky eyes and just yesterday, Nicky had noticed Marco’s hands trembling as he drank a mug of coffee. He decided he would push him again to go to the doctor, no matter how much he grumbled about it.</p><p>After a few minutes, he pushed the worry from his mind and got lost in his magazine, jumping when he heard a slight noise nearby. He looked up to see Marco looming large at the foot of the sofa, staring down at him, with a cold, almost hostile look on his face.</p><p>“Can’t you find something better to do than lie on your ass reading a magazine?” Marco growled as he glared at his mate.</p><p>Nicky looked up, his mouth dropping open in surprise. He quickly pulled his feet down from the back of the sofa and sat up. “Sorry! I was just reading this article Logan told me about on martial arts training.” He leaned over and reached for Marco’s hand. “Are you okay, baby? Why are you so grouchy this morning?”</p><p>Marco pulled his hand abruptly away and walked to the kitchen. “Who said I was grouchy? Damn, can’t I just be sick of seeing you lying around all the time?”</p><p>Nicky’s eyes filled with tears at his harsh tone, even as his lips tightened with anger at the unfairness of the comment. Fuck! He wasn’t being lazy, he was only trying to keep quiet so Marco could sleep.</p><p>“Well, excuse the hell out of me,” Nicky quipped. “Who pissed in your cornflakes this morning?”</p> <p>Marco gave him a frosty glare and then ran a big hand over his face, shaking his head. “God, baby, I’m sorry. I don’t even know why I said that.” In a complete about face, he came over to sit next to Nicky on the sofa, taking him in his arms, and kissing his lips tenderly. “Forgive me, sweetheart?”</p><p>“Damn, I’m getting whiplash with these mood changes of yours,” Nicky laughed. “It’s okay. I guess I have been pretty lazy this morning, but I was trying to let you sleep in a little. I haven’t even made breakfast yet. I could fix you something or are you going downstairs to eat?”</p><p>“Yeah, I’ll go down to the dining area. Don’t worry about it. Ian’s probably down there and I need to talk to him anyway,” he said, talking about his pack’s beta. “In fact, I’m not even all that hungry—I don’t know what the matter is with me lately. I haven’t had any appetite. I’m sure as hell not sleeping well, and now I’m taking it out on you.”</p><p>“It’s okay,” Nicky replied. He’d been worried about Marco for weeks now, but Marco refused to see a doctor. Like all the wolves, he could be stubborn and intractable when he got his back up. More like an old mule than a wolf, Nicky thought.</p><p>“No, it isn’t okay. I shouldn’t be taking all this out on you, but thanks for being so understanding. Maybe I’ll stop by the doctor’s office this afternoon, just to check.”</p><p>“Would you, Marco? I’d feel a lot better about it if you would.”</p><p>“We’ll see. I have so much to do...”</p><p>“It’s not good for anybody if you get sick, babe. We all rely on you. Please promise me you’ll go by and see the doctor.”</p><p>“I said, I’d see! Damn it, stop crowding me!” He stood up quickly and then flushed, glancing back down at his mate. “Sorry,” he said again. “Maybe I’d better go by and see what the hell’s going on with me. I need to go find Ian, but I promise I’ll go by today.” He dropped a kiss on Nicky’s forehead, and then walked quickly to the door. He stopped and turned to look at Nicky, who was still sitting on the sofa with a frown creasing his forehead. “Don’t worry about me, okay? I’ll be fine—I’ll see you tonight.”</p><p>Nicky sat for a long time after he left, staring into space and thinking about the past few weeks since the raid on the Hunter’s compound. Marco had been out of sorts and feeling run down and tired. At first, Nicky thought it was all the added work from the newcomers to their pack. Over seventy of the Hunters had surrendered, begging for assimilation rather than execution, and at least a third of that number had settled in the North Carolina pack. The others were taken to the North Georgia and Tennessee branches of the Werekin, and the remaining twenty-some men were in the process of merging into Marco’s group now. All had been turned at their request, and some had already found mates for themselves. The others were still in the process, and so far it had been going quite smoothly. Marco had done a wonderful job of settling them in, and he and the other wolves were still in the process of training them, so Marco had been running himself ragged. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Most nights Marco fell into bed exhausted, no matter how much sleep he’d gotten the night before. He’d been pale, irritable and angry for no reason, and now he’d taken to snapping at Nicky more and more often during the day. Sometimes afterward, Nicky had seen a look of bewilderment on Marco’s face. Other times, the look he saw was a steady and unwavering disapproval and almost resentment. When Nicky questioned him as to what was wrong, what he’d done to make him look at him that way, Marco had shrugged it off. Told him it was his imagination. But Nicky knew better.</p><p>He got up off the sofa wearily and began to straighten the kitchen. He was supposed to meet Logan and Evan, his closest friends, a little later for lunch. Dragging his feet, feeling vaguely out of sorts, he walked to the bedroom to make the bed, but only got a few steps inside the room when he heard the front door close. He turned around to see Marco standing just inside the door, a hard, almost angry look on his face. Nicky noticed again how dark the shadows under his eyes were becoming. Marco’s face was drawn with exhaustion.</p><p>“Back so soon, honey? Did you forget something?”</p> <p>Marco prowled toward him, his moves somehow predatory and threatening. Nicky stepped backward instinctively, trying not to flinch when Marco suddenly put his hands on Nicky’s shoulders.</p><p>“Marco?”</p><p>Without saying a word, Marco shoved him backward toward the bedroom.</p><p>“Why were you up so early really, Nicky? Were you planning something? Trying to keep something from me again?” The low-voiced questions hit Nicky harder than anything he might have shouted. His voice was hoarse and menacing. “Are you trying to leave me again, pet? Want to get away from me?” He shoved Nicky again, and Nicky stumbled backward, falling on the floor, looking up at Marco, feeling frozen in shock. He couldn’t seem to utter a word as he stared up at this man who looked like Marco, but who was acting like a terrifying stranger. Suddenly Marco seemed to collapse on himself, putting a hand to his eyes as tears streamed from them. “You’re driving me crazy! I can’t get you off my damn mind! Why are you doing this?” Frightened, but unable to watch his lover in so much pain, Nicky reached a hand out to him.</p><p>In another dizzying mood swing, he slapped the hand away. “What? No smartass comments, boy? Then put that goddamned sarcastic mouth of yours to good use. At least that’s one thing you’re good at.”</p> <p>Nicky hissed in a hurt breath but allowed Marco to pull him up to his knees. “That’s the way I like you, pet, on your knees. Only you should be naked. Naked and waiting on my pleasure. It’s what pets are good for, right?” He put a hand behind Nicky’s head, pulling his face close to the rigid cock straining against his jeans. “Suck me. Take me in your mouth and show me how grateful you are for all I do for you.”</p><p>“Stop it!” Nicky pushed back against him violently, jumped to his feet and ran around the side of the bed. Marco’s face was a mask of rage.</p><p>“Stop it? You don’t tell me to stop, damn you! You’re mine, you fuckin’ little bitch.” He stalked around the side of the bed, looming over Nicky, and drew back his huge fist.</p><p>Nicky flinched and covered his head, cowering down beside the bed, expecting the fist to slam into him. Nothing happened. Nicky raised his terrified, tear-filled eyes to see Marco stumbling back away from him, an expression of horror and confusion on his face.</p><p>“N-Nicky...I...I...” He seemed stricken at what he’d almost done. He looked down at his fist as if it didn’t even belong to him. Careening backward, his big frame hitting the door with great force, he righted himself and stood frozen in the doorway. “Oh God, what am I saying? What did I almost do?” He turned and stumbled out of the room, bent double and clutching his stomach as if in great pain.</p><p>Unable at first to process what had just happened, Nicky sat shaking in disbelief for a long moment afterward before grabbing for the phone and dialing a number with a trembling hand. “Please, come right away! My God, Logan, something’s happened to Marco!”</p> <p>He dropped the receiver and found he didn’t have the strength to move, so fell back down on the side of the bed. He heard the door slam open and Logan rushed in. Logan, the mate of the pack beta, Ian, lived right across the hall in the big lodge, one of the main reasons Nicky had called him. That and the fact Logan was probably his best friend in all the pack. They’d been through a lot together.</p><p>“Nicky?” Logan called from the main room.</p><p>“In here.”</p><p>“Damn, Nicky, what’s happened? What did he do?” Logan asked, sitting beside him on the bed. “He didn’t hit you, did he?”</p><p>Nicky, whose eyes had dropped to his lap, twisted his hands together. “No, n-not really.”</p><p>“Not really? What the fuck? What did he do, Nicky?” Logan leaned in close to his friend, warm sympathy in his dark eyes. Nicky knew that Logan had been on the wrong side of a wolf a time or two himself.</p><p>“He yelled at me.” Nicky laughed shortly. “I know, I know, he yells at me all the time, but this time he...”</p><p>“What?”</p> <p>“He pulled back his fist to hit me and called me a...a fucking little bitch.”</p><p>“Oh my God!” Logan said softly. “Nicky, I’ve never seen Marco treat you with anything but love. Even when he was furious at you, everyone still knew he was crazy about you!”</p><p>“I know,” Nicky said miserably. “He was crazy all right, out of control. I’ve never seen him like that, and it scared me to death.”</p><p>“What did you do? Nicky, tell me the truth. If he hit you...”</p><p>“No. He didn’t, really. He stopped himself, but he drew back his fist, and I thought he was going to knock my head off. He stopped himself and seemed upset by what he’d almost done. He took off then, and I don’t know where he is.” Logan squeezed his shoulder gently.</p><p>“No, I’m okay, really,” Nicky said. “It’s just—God, I can’t stop shaking. I’ve never seen him like that before, Logan. It was like looking into the face of a stranger—a stranger who hated my guts.”</p><p>“I’m going to call Ian. He needs to know what’s going on.” Logan pulled out his cell phone but before he could even punch in the number, the phone rang. “Oh, it’s you,” Logan said into the receiver. “I was just about to...what? Oh shit. Okay. Okay, we’ll be right there.”</p><p>Logan put down the phone and took Nicky’s hand again. “Nicky, that was Ian. Be strong, Nicky. Something’s happened to Marco. He’s collapsed downstairs, Nicky, and they’ve taken him to the infirmary. The doctor’s with him, but...I’m sorry, Nicky. He’s unconscious. They... God, Nicky, they had trouble getting a pulse at first. It doesn’t look good.”</p><p>Marco was having the strangest dream he’d ever had. He was wandering in a deep, unfamiliar forest, searching for someone desperately, but unable to find him. He was growing increasingly frantic, his wolf close to the surface. He shifted then, giving into his wolf, and stood howling his frustration at the moon. He heard a slight noise close by and saw the man he was searching for. A beautiful boy, really, in his early twenties with golden blond hair and sapphirecolored eyes.</p><p>The boy was frightened of him and turned to run. Marco, in his wolf form, was on him in seconds, knocking him to the ground and rolling him to his back. The boy cast a hectic gaze up at him, screaming in terror and twisting wildly to get away. Marco bent over him and sank his fangs into the boy’s throat, furiously ripping and tearing with his teeth until the beautiful boy lay unmoving beneath him. He moved away from him then and stared down with satisfaction. He had killed him, had rid himself of the boy and would never have to love anyone so deeply again. He felt as if a huge and oppressive weight had been lifted from his shoulders.</p><p>He was free—free to make his blood thick and unyielding, strong and unfeeling. He would never again be a slave to his passions. He would never again have to fear the boy’s leaving him. He’d taken that option away. Backing away and licking his lips, he tasted the boy’s blood on his tongue, sweet and cloying. He turned and ran into the woods, leaving the lifeless, broken body in the clearing behind him.</p><p>Marco twisted his legs restlessly as the awful dream left him, slowly becoming aware that he was in a strange bed. Without moving, he opened his eyes a slit and looked warily around him. A white room, people moving in the corner, and someone sitting by the bed, his head bowed, his golden blond hair falling over his face—where the hell was he? His arm ached abominably, and he glanced down to see an IV running into his veins. A hospital, then. Where were Ian and the rest of his pack? Surely, they wouldn’t have allowed anyone to take him to a hospital—too much chance of arousing suspicion with his werewolf blood. So where could he be, and who were these people in the room with him?</p><p>Suddenly, the door opened and Rory, his nephew, came in, looking drawn and worried. He felt an immediate sense of relief. If Rory was here, then he must be somewhere safe. Marco wanted to speak to him, but couldn’t seem to summon the energy to move. He saw Rory come closer to stand by the man with the blond hair and put a comforting hand on his back. The young man raised a tear-stained face to look up at Rory and Marco was shocked at the boy’s beauty. Who the hell was he and why was he sitting here crying by Marco’s bedside? It was too confusing and too much to worry about, so Marco closed his eyes and let sleep drift gently back over him.</p><p>The next time he awoke it was darker in the room. A dim light over a sink in the corner showed the blond boy from before still by his bedside, this time sleeping in a chair he’d pulled up close to the bed. His clothes were rumpled, and he needed a shave, but he still looked beautiful and sad, tear tracks on his face and his full lips pulled down in a heartbroken frown even in his sleep. Marco wished he knew who he was.</p><p>The door opened and a man came in who looked like a doctor, wearing a white lab coat with a stethoscope casually slung around his neck. He came over first to the boy in the chair and looked down at him with such tenderness and compassion that Marco knew the doctor must be in love with the boy. Strange that the thought gave him a little pang of jealousy and possessiveness. He didn’t even know the boy’s name. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The man turned to Marco and moved over to put a finger on his eyelid, lifting it up and then saying in a low but firm voice, “You’re awake. Good. Do you know where you are?”</p><p>Marco shook his head slowly back and forth as the door opened again and Ian walked in. Marco stretched out his hand wordlessly and Ian rushed over to him, taking his hand in a warm grip. “Marco! You’re awake, thank God. Nicky has been inconsolable—hell, all of us have been!” He turned to the boy in the chair, who still hadn’t awakened, though he was by now stirring restlessly. “Nicky, Nicky, wake up! Marco’s awake!”</p><p>The beautiful boy’s eyes sprang open and he threw himself onto Marco’s chest, tears streaming down his face. “Marco!” he cried. “Oh God, Marco, I was so scared!” He kissed Marco on the lips, and then began to kiss him all over his face, raining the kisses down, some soft, some passionate, until Marco pushed him gently away, uncomfortable at being kissed by this strange boy. He stared over at Ian and then back at the blond boy.</p> <p>“Ian, what the hell’s going on? I’m sorry,” he said, turning toward the young man. “I can see that you obviously think you know me very well, but...who the hell are you? I don’t remember ever seeing you before in my life.”</p><p>Chapter Two</p><p>The shocked silence that greeted Marco’s words erupted into chaos after a shocked little cry from Nicky. Ian gasped in disbelief, and the doctor put an arm around Nicky’s waist and spoke soothing words to him that Nicky couldn’t even focus on. He couldn’t have held back the tears that burst from his throat if he’d tried. He looked wonderingly from Marco back to Ian and then the doctor was pulling him from the room. He stared back at Marco as he left—was this some kind of cruel joke? It wasn’t possible that Marco could have forgotten all they were to each other —all they’d gone through to get to where they were?</p><p>The doctor pulled him down the hallway to a set of chairs in the waiting area near the nurse’s station. The doctor’s name was Jeremy Tate, and he was the brother of one of the bloodmates in their pack. His sister, Elizabeth, had been mated to one of the gammas for several years, and the pack had come to trust Dr. Tate implicitly. When Marco’s organs started to fail, the wolves grew frantic and called Jeremy, who was Chief of Staff of the hospital in Brevard, the closest town to the lodge. He’d arranged for an immediate transfer to the hospital, where they could give Marco the life support he needed.</p><p>Dr. Cornsilk was also now on staff at the hospital, so between the two of them, they were able to manage all of Marco’s care with the help of a nurse and a lab assistant who were mated to a pack members as well, making sure his blood work didn’t fall into anyone else’s hands. Dr. Cornsilk was a non-shifting wolf himself—what the wolves called a natural pet—from the Dark Hollow wolf pack and had recently been on staff at the Hunter’s complex, acting as a double agent for the wolves before the wolves attacked and closed the operation down. He was at the nurse’s station looking over some early lab results when he saw Jeremy bring a tearful Nicky into the hall, and he quickly came over to them in alarm.</p> <p>“Oh my God, has Marco...” “No,” Jeremy said, “but something’s badly wrong. He’s awake, and doesn’t seem to remember his own bloodmate. Can you go in and check on him? I need to take care of Nicky.”</p><p>“Of course,” he said, already sprinting down the hall to the Alpha’s room. “Don’t worry, Nicky,” he called over his shoulder. “I’m sure he’s just disoriented.”</p><p>“He’s right, you know,” Jeremy said softly, his arm still wrapped around Nicky’s shoulders. “Marco couldn’t forget you. Please don’t be so upset.”</p><p>“I-I’m sorry. I know I’m being an idiot. It’s just...Marco’s been so sick, and I thought he was dying. Then to have him wake up and look at me like that. Like I was some stranger...”</p><p>Jeremy patted his arm. “Give him a few minutes and we’ll go back in there. I’m sure it’s just a temporary thing. He seemed to know Ian.”</p><p>Nicky stood up, wiping away his tears. “Can I go back in now? I have to see him—I won’t make a scene and get him upset again.”</p> <p>“All right,” Jeremy said, getting up to stand beside him. “But if I see him getting upset, I’ll have to take you out of there. The lab work is still out and we don’t know what caused this collapse. Until we do, we have to be careful with him. He came close to not making it. We used up all the alpha blood we had on hand to transfuse him and get him this far. There can’t be any more relapses. Casey and Zack have given too much blood as it is,” he said, referring to two of the other alphas in the pack. Zack had rushed all the way from the North Georgia branch of the pack to give his blood, after Casey, the battle commander, had given all he could.</p><p>“I know. I’ll be careful, I promise.”</p><p>Jeremy smiled at him and took his arm to lead him down the hall. Jeremy was fairly young to be the Chief of Staff, but even young as he was, he was well-known as a brilliant cardiac surgeon and the hospital had jumped at the chance to have him when he indicated an interest in the job. Jeremy had grown up in Brevard and loved the mountains, so had decided he was needed there more than in one of the major medical centers.</p><p>Tall, dark and handsome, he was the doctor every unattached nurse on staff was crazy about, but Jeremy didn’t seem to be interested in any of them. Instead, he spent a great deal of his off time at Mountainwood, the wolf’s lodge. Once Nicky had been surprised to see a strange look of longing on his face as he stared at Nicky and Marco from across the dining room. At the time, Nicky thought he might be attracted to Marco, but he’d never noticed the look again, so thought he must have imagined it.</p><p>Jeremy led him into Marco’s room and when the door opened, Marco looked up at them with a narrowed gaze. Ian held out a hand to Nicky, and he came closer, standing by Ian’s side. “Marco,” Ian said. “Here’s Nicky, your mate—your bloodmate. Surely you recognize him.”</p><p>Nicky looked down at Marco hopefully, holding his breath, but Marco shook his head. “No, I’m sorry, but I don’t.”</p><p>Nicky sagged against Ian, who broke with the pack tradition never to touch another wolf’s mate and put a comforting arm around him. He gave Marco a warning look and Marco sighed deeply.</p><p>“Look, I don’t mean to hurt your feelings. I can see that I am, but I don’t mean to, I swear. You’re a very nice-looking young guy, but I-I just don’t remember. I’m sorry.”</p> <p>He looked so genuinely upset that Nicky felt pity for him, even though his heart was breaking. He shook his head slightly. “No, it’s all right. I understand.” He turned to the doctor. “But how is it Marco knows Ian and not me?”</p><p>Dr. Cornsilk shook his head. “I have no idea, Nicky, I’m sorry. There is a type of amnesia called systematized amnesia in which the victim loses all the memories related to a certain location or a certain person. It’s a kind of dissociative disorder and is known to be associated with too much stress. It’s rare, but that could be it.” The doctor shrugged slightly and shook his head. “We’re just not sure. We’re still running tests, so maybe we’ll have some answers soon.”</p><p>Nicky nodded sadly, and turned back to Marco. “I-I need to stay here, though, with you, if that’s all right. Please don’t make me leave you. I promise I won’t be a bother.”</p><p>Marco shifted in bed, looking confused and uncomfortable. “Well, I...” he looked over at Ian helplessly and something unspoken passed between them.</p><p>The wolves, especially close friends and associates like Ian and Marco, had an almost psychic connection at times, it seemed to Nicky. At least they seemed to be able to sense each other’s feelings very well. Or maybe they had discussed it before he arrived, but Nicky knew with a sinking feeling the decision had already been made and not in his favor.</p><p>Sure enough, Ian spoke up next to him. “I’ve already called Logan, Nicky, and he’s on his way to pick you up. You’ve been sitting here for two days straight, and you’re exhausted. Marco’s out of danger now, so you need to go home and get some rest. I’ll stay here with him and I promise you I’ll call if anything goes wrong.”</p><p>“No,” Nicky said, frantic at the idea he had to leave his mate alone and, in his mind at least, unprotected. “I can’t just leave him. Please!”</p><p>Ian gave Marco another significant look and Marco spoke up. “Look, uh, Nicky, maybe it’s best if you go home for a while. I’m pretty tired, so I’ll probably just sleep.” He looked at Nicky with kindness, but absolutely no recognition whatsoever. “You look pretty exhausted too.”</p><p>Jeremy came over to Nicky quickly and drew him unresistingly into his arms. “Nicky, come on with me, and we’ll wait for Logan outside.” He rubbed Nicky’s back, soothing him. “Give Marco a chance to rest,” he said in his ear.</p><p>Marco spoke again, and this time with a steely edge to his voice and a grim expression on his face. “I may not remember him, but I do know one thing for sure, doctor. You need to take your fucking hands off my mate.”</p><p>Marco had been questioning Ian when the blond boy and Dr. Tate walked back in the room. Something moved in his chest—what was it? But it was gone before he could put a name to it. The boy—Nicky, they’d said—looked terribly upset, and Marco didn’t like to see him that way. He wasn’t sure why, but it seemed wrong somehow. A strong surge of protectiveness swept over him. Ian had been explaining to Marco that the beautiful boy was his mate—his damn bloodmate and he still couldn’t remember. He didn’t feel the primal pull that he knew he was supposed to feel.</p><p>He had no memory of even liking men that way particularly, though wolves didn’t feel any prejudice against the idea like humans did. When your blood picked your mate, it seemed foolish, not to mention futile, to struggle against it, so the wolves of his pack were mated to both male and female pets. So while he thought the boy absolutely gorgeous, and felt an attraction to him—hell, who wouldn’t—he felt no blood pull, no compelling urges. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Still, Ian said he was his bloodmate and had been for well over a year, so he had certain responsibilities to him. He would never abandon a bloodmate, and according to Ian again, he’d always indicated that he was very much in love with the boy. That accounted for Nicky’s strong reaction when he told him he didn’t remember him, and he felt a little guilty at how heartbroken the boy had seemed to be at his words.</p><p>Marco needed a little time alone to absorb all of this, and to understand what in the hell had happened to him. Dr. Cornsilk said they were still running tests on him. He’d had some kind of infection in his blood, akin to blood poisoning, or perhaps a virus. How he’d been infected was still a mystery, but in the meantime, they’d keep him here for a while and run more tests. It would also give him some time to figure out what the hell he would do about this boy, Nicky.</p><p>Marco had asked Ian to call Logan to take the boy home. He wanted a little time to himself, but didn’t want to hurt the boy by saying so. He’d obviously hurt him enough already by having no memory of him. When Nicky’s face crumpled in pain, Marco wanted to take it back, but then Dr. Tate stepped up and put his arms around the boy. Nicky put his head down on the doctor’s chest, and the son-of-a-bitch had actually rubbed his back in a sensuous, not just comforting way. Could no one else see how this man obviously felt about the boy who belonged to Marco? A strange, possessive feeling swept over him, flooding him with jealous rage.</p> <p>Marco’s wolf leaped to the surface so fast he thought he might shift right there. He felt a growl at the back of his throat and restrained himself with difficulty. The bastard needed to take his hands off Marco’s boy, and damn quick, or he’d tear his fucking throat out. He said something along those lines, and Ian put a restraining hand on his chest.</p><p>Tate was surprised and dropped his arms, taking a step back. Nicky jumped away from him at the same time, a startled look in his eyes. His gaze searched Marco’s face to see if there was any recognition there, and finding none, he slumped his shoulders again. Marco leaned up in bed, though, and grabbed his hand, pulling Nicky over to him possessively, casting a furious glance at the handsome doctor.</p><p>“Nicky,” he said, gazing into his eyes, “go home with Logan. I’ll call you later tonight to make sure you get home safely. In the meantime, I want you to go to bed and get some rest. Understand?”</p><p>Looking a little surprised at his tone, Nicky nodded. “Sure, Marco, I understand. But I could rest here just as well. Couldn’t I just...”</p><p>“No. I said go home, Nicky. Now do as you’re told, and you can come back later.”</p> <p>Nicky flinched at his firm tone, but dutifully turned and walked to the door. He glanced back at him once and Marco felt another unexpected pang at the misery in his eyes. But if this truly was his mate, then the boy needed to learn how to take orders. Apparently, he’d been spoiling Nicky, if the way he was acting was any indication. He wasn’t even wearing a collar. That kind of thing just invited unwanted attention. No wonder the damned doctor felt free to put his hands all over him.</p><p>Marco couldn’t imagine he was ever so lenient with the boy. Obviously, he needed to tighten the reins, and he would take care of that just as soon as he got home. His father had taught him pets needed a firm hand and a little good old fashioned discipline. That’s the way his father had treated his human mother, and she’d seemed happy enough. They had always given the appearance of being deeply in love. Ian told him he and Nicky had a great relationship, and had been very happy, so perhaps the boy was just distraught. Marco leaned back in bed. He would give him the benefit of the doubt—for now.</p><p>Dr. Tate followed Nicky from the room, but Cornsilk came over to check his vitals again. “Are you in any pain, Marco?”</p><p>“No, that’s the thing. I’m a little tired, but I feel fine. Maybe I can go home soon—I hate the idea of risking exposure like this in a human hospital. Do you really think it’s wise, doctor?”</p><p>“I know it seems strange to you, but we really had no choice. You were quite ill when you arrived, and you had to stay on life support until the transfusions of alpha blood began to take effect. If your vitals remain stable for twenty-four hours, then you can go home to finish your recovery, but you have to promise not to work so hard again. If this is a virus, as I’m beginning to think it is, the weakened, stressed state you got yourself into may have been a contributing factor. When we worked with the various viruses at the Hunter’s lab, the wolf’s metabolism was always strong enough to ward off any virus the scientists tried on them.”</p><p>The doctor gazed down at Marco for a moment, lost in thought. “Which makes me wonder...when you went into the Hunter’s complex during the battle, did you touch anything in the labs and or come across any infected persons?”</p> <p>“No,” Marco replied. “But when I was in the general’s quarters, some guy did come out of a side door and attack me with a hypodermic. Zack killed him when he saw me attacked.”</p><p>“What?” The doctor said in surprise. “Why didn’t you tell me all this before?”</p><p>Marco shrugged. “I thought at first it was some kind of poison, but after a few minutes, whatever it was didn’t bother me, so I forgot about it.”</p><p>The doctor’s voice took on an excited tone. “That could have been the pathogenesis—the way the virus was introduced.”</p><p>“Yes, but doctor...” Ian interrupted. “The raid was over six weeks ago. Surely he would have gotten sick sooner if that had been the case.”</p><p>“Not necessarily,” the doctor said, shaking his head. “Incubation periods vary widely. Mononucleosis, for example, has an incubation period of over forty days. Other viruses can be even longer. We need to find out what this person might have injected you with. Do you have any idea who he was?”</p><p>“The bodies were all identified and matched with locations before burial,” Ian said, a worried frown on his face. “We’d just need to check the records.”</p><p>“Yes, if you could do that, it would be helpful. I have access to all their experiments, and if we could figure out what it was, we might be able to reverse the effects.”</p> <p>“What effects?” Marco asked. “I mean, I know I’ve been pretty ill, but I’m better now. I feel pretty good, really. Whatever it was has gone. Maybe we’d better just leave well enough alone.”</p><p>Both Ian and the doctor gave him a strange look. Ian put a hand on his arm. “Marco, you don’t remember your bloodmate, Nicky. It’s breaking his heart and if you were yourself, you’d never allow that. Something is terribly wrong, Marco, and I, for one, won’t rest until I find out what it is.”</p><p>Chapter Three</p><p>Nicky stood outside the lodge, waiting for the car carrying Marco and Ian to arrive. Logan was with him, and soon Evan walked up to join them too, giving Nicky’s shoulder a squeeze. Evan was the mate of a gamma, and another of Nicky’s closest friends. Some of the other wolves</p><p>and their mates were drifting out in twos and threes as well, to welcome their alpha home. “What time are they supposed to be here?” Evan asked.</p><p>Logan checked his watch. “Any minute. I talked to Ian when they left the hospital, and that</p><p>was thirty minutes ago.”</p><p>Evan fidgeted for a moment and then turned to Nicky. “So he doesn’t remember you at all? How is that possible?”</p><p>Nicky blew out a big breath. “I don’t know; I’ve been asking the same question, but the doctors don’t really know either. Dr. Cornsilk said there was some kind of amnesia— systematized, I think he said—where you can forget just one person and anything related to that person. But why me, of all people?” Tears came to his eyes again, and he shook his head miserably. “I don’t want to talk about it now, Evan, when he might come any minute. God, he’s</p><p>seen me blubbering enough already—he must think I’m fuckin’ unstable as it is.” “Sure, I’m sorry, Nicky. It’s just so hard to wrap my mind around it all. Oh, look, here they come.”</p><p>A big black SUV was coming slowly down the long graveled private road leading to the lodge. Nicky tried to calm himself and smoothed his sweaty hands down over his jeans. He’d dressed carefully that morning, wearing his favorite tight, dark-washed jeans and a blue buttonup shirt that was Marco’s favorite—used to be his favorite, anyway. He’d once said it matched the color of Nicky’s eyes perfectly. Nicky had shaved closely and tried to tame his unruly blond curls. He’d even put on some aftershave that Marco liked. He stood up straight and schooled himself not to run and throw his arms around Marco the minute he saw him. He had to remember to play this cool and not try to force a response from him.</p><p>The car pulled slowly to a stop in front of the lodge and both Ian and Marco got out. Ian went to Logan right away and kissed him on the forehead, murmuring something to him in his ear. Marco smiled at Nicky and nodded very politely, acknowledging him, then glanced around at the others who had come out to greet him. The pack had been nervous and uneasy since his</p><p>sudden illness and needed to be reassured their alpha was well on his way to recovery. “Thanks for coming to meet me, everyone,” Marco said with what Nicky thought was a beautiful smile. “Maybe things can get back to normal now that I’m home. Nobody needs to worry about me—I’m feeling just fine.”</p><p>“Yeah, except for the fact he can’t remember his own mate.” Evan stepped close to Nicky and whispered in his ear, putting a hand on Nicky’s back reassuringly. Nicky smiled at him, but shook his head in remonstrance.</p><p>“No, it’s okay. He has to reassure everyone. We have to put a good face on this so no one is too alarmed.” He stepped forward and took Marco’s arm. Marco looked down at him in surprise, but didn’t pull away. “Marco, we have a little surprise for you. We’ve planned a luncheon in honor of your recovery. Don’t worry,” he said when he saw the look on Marco’s face. “Nothing too elaborate. Just a little lunch.” He pulled Marco with him into the lodge, and Marco gave Ian a </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>slightly irritated glance over his head. Ian shrugged and smiled back at him.</p><p>Inside the large dining area, Nicky had directed a head table to be set up, with Marco in the center and Nicky at his right side. Ian, Logan, Casey and Rory made up the others at their table, and once they were all seated, the servers brought out the food. Fried chicken, ham, pinto beans, collard greens, fresh corn, even banana pudding, still warm from the oven—all Marco’s favorite</p><p>“No speeches,” Marco growled in his ear, and Nicky laughed, so happy to have Marco home and there beside him again. They all tucked into the feast, and though Nicky still didn’t have much appetite, he enjoyed watching Marco eat. Nicky had always been a picky eater, hating most vegetables and especially the southern staples, though he’d been born and raised near Atlanta. He’d chosen these dishes for Marco and was content to just watch him enjoy his meal.</p> <p>At one point, Marco glanced over at his still full plate. “You need to eat something.” He picked up a bowl of pinto beans and put some on Nicky’s plate. “Eat some beans. They’re good</p><p>for you.”</p><p>“None for me,” he said with a laugh. “Redneck vegetables make me sick.” “Redneck vegetables—what the hell is that?” His eyebrows pulled together in a frown, as he</p><p>seemed to be trying to decide if Nicky meant the remark as an insult.</p><p>Nicky rolled his eyes. “It’s just all the vegetables my mama used to try to make me eat when I was little, so I called them names to make her mad. Collard greens, pinto beans, fried green tomatoes.” He made a little face. “All that southern stuff. I swear my mama got me mixed up in the hospital. I was always convinced as a kid that somewhere out there some little rich kid was</p> <p>living the life that should have been mine.”</p><p>Marco gave him a puzzled little smile, as if he didn’t quite know what to make of him. It suddenly seemed so familiar—Marco had given him much the same smile almost every day since he’d met him.</p><p>“Well, eat something else, then. That’s an order from your alpha.”</p><p>Nicky glanced up at him, and found him smiling at him, so he smiled back and took a big</p><p>bite of mashed potatoes. Marco grinned and nodded. “Good.”</p><p>Nicky would have been much happier at his approval if he hadn’t felt like Marco wanted to pat him on the head. He’d worked so hard over the past year and a half to make Marco understand that the pets of the pack weren’t children to be taken care of and patronized. If Marco had forgotten him and everything associated with him, then that might mean he had all that work to do over again. Only this time, Marco didn’t seem to be as crazy in love with him as he was before. Tears threatened to spring to his eyes again, but he ruthlessly forced them away. He would make Marco remember what they used to have if it was the last thing he ever did. He had</p> <p>to.</p><p>Nicky ate a little more and moved the rest around to make it look like he’d eaten some. He really had no appetite. He glanced up and saw Dr. Tate sitting with his sister and her mate across the room. The doctor was watching him very closely, so Nicky smiled and gave him a little wave. He looked over at Marco to find him watching him too, and frowning with disapproval. Was he a little jealous? Nicky remembered how possessive he’d been at the hospital when the doctor put his arms around him. He filed the information away to possibly be used later. If appealing to the possessiveness of his big, bad wolf was what it took, then that’s what he would</p><p>Some soft music was playing in the background, and as the meal ended, people began to leave their tables and stand around in small groups. Nicky drifted over next to Logan, while Marco was talking with Casey and Rory.</p><p>“How are you holding up, Nicky?” Logan asked. “Any sign he remembers you yet?” “No,” Nicky sighed. “But he’s still a wolf, and he’s apparently still possessive as hell, even</p><p>if he doesn’t quite remember me. I waved at Dr. Tate just now and got a very dirty look.” Logan smiled. “No surprise—even if he doesn’t remember you, he knows you’re his mate, and his pride won’t let him react any other way. Maybe that’s a good sign though—he’s definitely not indifferent to you.”</p><p>“I think I’ll take advantage of that fact right now. Come with me, Logan.” Pulling Logan along with him, Nicky went over to stand by Jeremy Tate’s table.</p><p>“How are you, Nicky?” The doctor’s warm voice felt like a balm for his still tender feelings and made him instantly relax. While Marco was in the hospital, he’d come to realize the doctor liked him, maybe a little too much, but his frank admiration was flattering and soothing. Nicky</p><p>gave him a bright smile in return.</p> <p>“I’m fine, now I’ve had some rest. I wanted to thank you again for all you did for me and Marco in the hospital. I know it couldn’t have been easy, keeping things so private and hush hush.”</p><p>“Not at all, it was my pleasure. I’m happy to see you feeling better.” No mention of Marco, Nicky noticed.</p><p>He glanced over his shoulder and saw Marco watching him. Deliberately, he stuck out his hand to Jeremy Tate. He certainly knew better. One of the things he’d been trying to change for a while was this silly rule about never touching another wolf’s mate. Pets could touch each other all they wanted, but not any other male. It was a rule Nicky had long thought ridiculous. Why he felt the need to push the issue now, he couldn’t say, other than to crack that mask of cool indifference on Marco’s face whenever he looked at him. Some perversity inside him—the thing that usually got him in trouble—was urging him on.</p><p>Jeremy looked down at the hand he offered. Nicky and he had discussed this rule once during a long night at the hospital, and Nicky knew Jeremy was well aware that he wasn’t supposed to touch him. He couldn’t even touch his own sister, for God’s sake, except on rare occasions and then only after he’d asked permission from her mate. Dumbass rule, Nicky</p><p>thought, so he put out his hand and waited to see what might happen.</p><p>Instead of shaking it, like Nicky had intended, the doctor clasped it in his warm hand and smiled up into Nicky’s eyes. Feeling a little uneasy at his expression, Nicky tried to pull away, but the doctor held on and even added another hand to the mix, one of his thumbs slowly stroking over the back of Nicky’s hand. “Steady, Nicky.” Jeremy said softly. “Marco’s coming, and he looks pissed.” As Marco walked quickly across the room toward them, Jeremy finally</p><p>dropped his hands and sat back in his chair.</p><p>Before Nicky could move away, a big hand gave him a hard swat on the ass, surprising and embarrassing him in front of everybody. He put his hands back on the sting, but Marco pulled his arm, hauling Nicky up to his side. Standing between Nicky and the doctor, Marco leaned over and murmured softly in Nicky’s ear. “We need to start as we mean to go on, Nicky, and you know better than to do what you just did. I can only imagine you’re playing some kind of little</p><p>game. I hear you’re good at that. Go to our rooms, and I’ll be up in a minute to deal with you.” Marco let go of his arm and gave him a little push toward the door. Nicky felt his face flaming. He figured he’d make Marco a little jealous, but he hadn’t expected to be swatted in front of most of the pack and then sent to his room like a child. He briefly thought about refusing, but didn’t want to make any more of a scene than he’d already done on Marco’s first night home, so he turned on his heel and left the dining room as quickly as he could. He gave Jeremy Tate one glance as he left and found him looking at his retreating figure with concern in his dark eyes.</p><p>Marco watched Nicky walk out of the dining room too, admiring the sway to his perfect little rounded ass. He’d been watching that ass from across the room, noticing how the skintight jeans outlined his hips and accentuated his smoking hot body. God, he really was a gorgeous boy. Everything about him attracted Marco, from his golden, tousled curls to those big blue eyes. And his body—it was small compared to the wolves but perfectly formed. Marco wondered what he would look like beneath those jeans and that shirt stretched so tightly across his muscular back. He was half listening to Casey going on about the new construction that they always seemed to be involved in and half lost in admiration of this boy everyone said was his, when he noticed he wasn’t the only one in the room watching Nicky’s fine ass.</p><p>Several of the male wolves and nearly all the females were watching him too, some of them with a hungry look in their eyes. Dr. Tate watched him like he was something to eat as Nicky walked toward him, his gaze roving up and down Nicky’s body. Possessive jealousy seared through Marco, and leaving Casey in mid-sentence, he stalked across the room to lay claim to his mate. When he saw Tate with both hands wrapped around one of Nicky’s, he was filled with fury. Tate was being deliberately provocative, and both he and Marco knew it.</p><p>Did this human think he could steal his mate from him? Over his dead body. Just before he could tear Nicky away from him, the doctor released Nicky’s hand, but Marco still swatted Nicky’s ass to show his possession of him, and pulled the boy closely to his side. He’d never had such strong reactions to anyone before, and he fleetingly wondered what the hell was going on inside his mind. After sending Nicky upstairs, he glared down at the doctor. He wished he was a member of his pack so he could show him proper discipline. As it was, he clenched his fists by his side, fighting to keep his voice calm. He noticed with another, calmer part of his mind that both Ian and Casey had arrived to stand slightly behind him.</p><p>“We appreciate your coming today, Tate, but we don’t want to keep you away from your duties at the hospital any longer.”</p><p>Jeremy Tate stood up to face him. He wasn’t as tall as Marco, but he was well over six feet and muscular. His eyes held a challenge that Marco’s wolf responded to with an urge to leap across the table and rip out his throat. He restrained himself with a steely concentration as the damn man smiled at him. “Thank you, alpha. It was good of you to invite me—oh, but that was Nicky, wasn’t it? You know you’re a damn lucky man to have someone like him. I hope you realize it. I wouldn’t like to see him mistreated.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Was the arrogant son-of-a-bitch actually standing here in Marco’s house lecturing him on how to treat his mate? Holding onto his temper by a thread, Marco bared his teeth back at him. If he wanted to think it was a smile, so be it. “I hope you realize he belongs to me. And I don’t need your advice on how to treat him.”</p><p>The doctor stared steadily back at him. “Oh, I think maybe you do. And I’ll leave you with a word of advice even if you don’t want it. A man like Nicky Henderson should be treated like a precious gift, or he just might decide to go where he’s respected and loved for who he is.”</p><p>If it hadn’t been for Ian and Casey, he would have attacked the man right there, but they held onto his arms tightly, not allowing him to pull away. Nicky Henderson, his ass! The bastard was deliberately using Nicky’s human name before he became mated to Marco. He wondered fleetingly how he even knew that, but before he could latch onto the half-formed memory, it was gone. Tate turned around and walked quickly away and out the front door before the other two men finally released Marco. Tate’s gamma brother-in-law bowed deeply to the alpha and his closest aides, hurriedly escorting his pet, the doctor’s young sister, from the table.</p> <p>Casey stepped up closer to speak urgently to Marco. “Alpha, he’s not worth it. Don’t do this in front of everyone. I’ll have a word with him and tell him not to come back.”</p><p>“Do that,” Marco said angrily. “The bastard is lucky I didn’t kill him. Did you see him pawing over my mate? Did you hear him call Nicky by his human name? That asshole!” He set his face angrily and turned to Ian. “Make my apologies to everyone, Ian. I need to have a word with Nicky.”</p><p>“Marco,” Ian said in alarm. “Don’t—don’t be too harsh with him.”</p><p>Marco looked at him sharply. “You too, Ian? Is everybody in the Nicky camp now? Guess I need to get re-acquainted with my mate to see how he’s managed to get everyone wrapped around his little finger.” He turned to go and found his nephew Rory standing in his way. “Yes?” he said sarcastically. “Do you have some words of advice for me too, Rory?”</p><p>“Just this,” he said quietly. “I’ve never seen anyone so upset as Nicky was when we thought you were dying, and it was real, Marco. I really think he would have died too, if anything had happened to you. He loves you, and I want you to remember it.”</p> <p>Marco blew out his breath in a frustrated sigh. “I have no intention of hurting him, Rory. I’m only going to talk to him.”</p><p>Rory put a hand on his arm. “Remember how you reacted when Casey tried to lay the law down with me when we first mated? Remember how furious you were? You were my champion and got me out of there until you could talk some sense into Casey. Who’s Nicky’s champion, Marco?</p><p>“Nicky doesn’t need any champion, Rory. He has me, and I’ll take care of him. Satisfied?”</p><p>At Rory’s hesitant nod, Marco tried to step around him, but Rory grabbed his arm. “Marco, I know you don’t remember him, but Nicky has always been able to get under your skin. Without the blood bond—just remember, you two have a very complicated relationship.”</p><p>“Thank you, Rory, for your advice, but I believe I can handle one small human male, whether or not I have a blood bond with him. Now if everybody will get the hell out of my way, I’m going upstairs to talk to my mate.”</p><p>Marco walked with a determined step up the stairs and to his rooms—or he supposed he should say the rooms he shared with his mate. He opened the door to find Nicky sitting in a large, overstuffed chair in the main area, one leg thrown over the arm. He looked a little sullen, a little pissed-off and totally gorgeous with his blue eyes flashing at Marco as he walked in. Marco stood for a moment with his arms folded across his chest, wondering what in the world to do with this beautiful boy, despite his confident words downstairs. He felt as if he barely knew him, except to know that everyone seemed very protective of him. Ian had said he was a handful, and Casey had just grinned and rolled his eyes when he asked him about the boy. What the hell had he gotten himself into? If he was going to have any peace in his home he needed to show this boy who was in charge, and quickly.</p> <p>“Nicky, I don’t want to fight with you on my first day home.”</p><p>“No,” Nicky said quietly. “I don’t want that either.”</p><p>“Well, at least we’re agreed on something.” Marco walked over to sit across from him on the sofa. A sudden image of Nicky lying naked on this same sofa, his legs propped up on the sofa back, laughter on his lips as he held out his arms to Marco hit him hard. He shook his head at the memory that had seemed to come out of nowhere and he sat down. “Nicky,” he said quietly. “I don’t like to have to discipline you, but I get a strong impression that you do things your way. You knew you weren’t supposed to let the doctor touch you, yet you did it anyway. If we’re mates, I don’t understand why you rebel against things so much. Aren’t you happy as the alpha’s pet?</p><p>“If we’re mates?” Nicky shouted, pouncing on the word. “Do you doubt it? Do you think everyone is lying to you because you couldn’t possibly be mated to someone like me?” Nicky sat up indignantly in the chair, his hands gripping his knees so tightly his knuckles turned white.</p><p>“No,” Marco said, trying to be calm. “I never said any of that—I asked you a simple question, and I think you’re trying to deflect it. Let me rephrase the question. Why does Dr. Tate continue to put his hands all over you? Have you done or said anything to make him think you’d welcome such advances?”</p><p>Nicky bit the inside of his cheek and shrugged. “I don’t know. I’ve never done anything to encourage him, I swear.”</p><p>“Oh, I see. So you didn’t mean to reach for his hand downstairs? He just misunderstood? Going for something on his plate, were you?”</p><p>Nicky blushed, the pink color staining his cheeks and making him look absolutely adorable. He looked up from underneath his lashes at Marco and let his lower lip tremble just the tiniest bit. So this was how he did it. He made himself look so vulnerable and cute people couldn’t get mad at him. Marco wondered how long he’d been jerking everyone around like this, and why, knowing full well what he was doing, Marco was falling for it too. With difficulty Marco stifled the urge to put his arm around him and reassure him he wasn’t mad at him and that everything would be fine.</p> <p>“No, of course not, Marco,” Nicky said softly. “I guess I just kind of forgot myself in the heat of the moment, you know? I was just so grateful to him for bringing you through that awful time in the hospital. I was so worried about you, Marco! Are you feeling better? Would you like to lie down for a while?”</p><p>“I’m fine, Nicky, and stop trying to change the subject. As the mate of the alpha, you aren’t allowed to forget yourself. The others look to you to set a good example.”</p><p>“Well,” Nicky said, leaning forward. “I’ve been meaning to talk to you about the shaking hands thing. I mean, isn’t that carrying things a bit far? Couldn’t we bend that rule just a little?”</p><p>“As I recall, the doctor wasn’t shaking your hand, he was holding it and gazing into those big blue eyes of yours. Rubbing his thumb over the back of your hand too, I believe.”</p><p>“Oh? I-I hadn’t noticed.” He caught Marco’s skeptical gaze and dropped his own. “Um, sorry, sir.”</p><p>Marco raised one eyebrow. “Sir? Why do I get the impression that you’ve never called me sir before in your life?”</p><p>Nicky looked surprised. “I...uh...”</p><p>“Do you even recognize me as your alpha?’</p><p>“Um, what do you mean?”</p><p>“Do you think I have the right to ask you to submit to my authority?”</p><p>Nicky looked uncertain for a moment. “Uh, well...of course, I recognize you as the alpha of the pack...”</p><p>“And are you a member of my pack?”</p><p>“Well, in a way...”</p><p>“In a way? Has someone made you feel not a part of our family? Have I ever made you feel you weren’t?”</p><p>“Well, no...”</p><p>“And when we mated, I assume it was in the usual manner. I gave you a mating bite? You had the knot?”</p><p>Nicky blushed and nodded his head slowly.</p><p>“So then when you said, ‘in a way,’ what exactly did you mean?”</p><p>“I-I just meant I’m not a wolf.”</p><p>“Oh, I see. So you don’t think any of the pets are in the wolf family? They’re not a part of my pack?”</p><p>“No! I mean, yes, of course they are.” Nicky was getting flustered. His face was now a deep red, and he was avoiding Marco’s steady gaze.</p><p>“And do you consider yourself to be a pet?”</p><p>“Well, sort of...”</p><p>“Sort of?”</p><p>“Marco, I’ve never liked that word. It sounds so S&amp;M. No, I don’t identify with that word at all. I’m your mate, yes. I’m here because I love you, and I want to be with you, but a pet—no, most definitely not. I’m not your damn pet.”</p><p>Marco gazed at him steadily. “’Pet’ is a just a word the pack has used for as long as anyone remembers, Nicky. A term we use to mean our non-shifting family members—our mates, and our children who don’t turn out to be shifters. In the past they were our dependents, but many of our grown pets have very good jobs on the outside now, yet they still consider themselves to be members of our pack. And they’re also still our pets. As my mate, you would have to also agree to be my pet. The alpha’s pet. It’s an important position and an important title. You know in the wolf clans we follow pack hierarchy. Each member has a rank. Nicky, don’t you want to be my mate anymore?”</p><p>“You know I do—don’t try to blackmail me!” Nicky glared at him, his eyes full of hurt.</p><p>“No blackmail. It’s a simple fact. If you’re my mate, then you’re also my pet. Do you agree?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nicky jumped to his feet and crossed to the window, his hands fisted by his side. Staring outside, he mumbled something vicious-sounding under his breath.</p><p>“Calling me names doesn’t change anything, Nicky.” Marco sat back on the sofa, waiting him out.</p><p>“Damn it! Marco, please promise me things won’t go back to the way it used to be around here. If it does, I swear I’ll...”</p><p>Marco walked up behind him and ran a finger down his back, making him shiver. He’d been longing to touch this back since he’d first noticed it downstairs. This was his, damn it. “You’ll do what?”</p><p>Nicky slumped in defeat and turned around to face him. “I hate this, Marco.”</p><p>“What is it you hate? The name? Or they fact that you’re my mate? If it’s so hateful to you, I won’t force you.”</p><p>Nicky took a step closer to him, his eyes blazing with passion. “Is that what you want? Are you trying to tell me you want out? You don’t want me as your mate?”</p><p>“Don’t put words in my mouth. I’m more than willing to accept you as my mate. You’re the one who seems a bit ambivalent. I’m only trying to be honest with you, Nicky. I don’t remember what we had together—the doctors said it might come back, but if it never does, could you still be happy?”</p><p>“If you never l-love me again?” he said, his lips trembling for real this time.</p><p>“I’m attracted to you. I want you to belong to me. Love could come in time.” He held out a hand to him. “I’m willing to give it a try, if you are.”</p><p>Immediately Nicky took his hand. Marco smiled down at him. Got you! “Will you be my pet, sweetheart?”</p><p>Nicky nodded, dropping his head. “I’ll try.”</p><p>“Good. There won’t be any more discussion of it then. Now, no more flirting with other men, all right?”</p><p>Nicky was clenching and unclenching his hands, and Marco could see the struggle inside him. It was delicious watching him struggle against Marco’s control over him. Marco’s cock was as hard as a rock. “Nicky? Do you agree?”</p><p>Nicky blew out a huge breath. “Yes,” he said, gritting his teeth. “But I never flirted. Not really. I can’t help it if men come on to me. It’s attention I never invited, but I’ve had it all my life.”</p><p>“I can imagine. You’re very attractive, Nicky, and then too, some men like the challenge of taking you away from the alpha. One thing I would like to do to help control that is to have you wear my collar.” He held up his hand at Nicky’s expression. “I figured you’d probably hate the idea, but it shows that you belong to me, and perhaps will remind others to keep their damned hands off you. Do you have one, or do I need to get one for you?”</p><p>“There’s one in your dresser drawer,” he said softly, not looking up.</p><p>“Will you get it and bring it to me, please?”</p><p>At the expression on the boy’s face, and the real internal struggle he seemed to be going through over obeying his command, Marco almost felt sorry for the boy. When he finally stepped around Marco to go to the bedroom, though, he could barely walk for the bulge in the front of his jeans. Marco bit his lip to keep from smiling. Maybe his boy did like a little kink after all. Perhaps he was more of a submissive than he admitted, even to himself, if the idea of a collar got him that hard.</p><p>Nicky came back in with a soft leather band in his hand and crossed over to hand it to Marco. Marco grabbed his hand and pulled him down to his knees in front of him. The minute Nicky knelt down, the delicate, yet sexy fragrance coming off his skin, the way he turned to look up at Marco from under the curtain of hair falling into his eyes—all made Marco’s cock strain against his pants. Marco took the collar from him and put it around his neck. Nicky turned his head a little to allow him to buckle it on him, an act of submission that made Marco’s wolf leap within him.</p><p>“You look beautiful, Nicky. Would you feel comfortable wearing this for me?”</p><p>Nicky sighed in surrender. “Yes, I suppose I could do that.”</p> <p>Marco leaned forward, forcing himself to pat Nicky gently on the shoulder, only barely resisting the urge to bite into his neck and take his blood, marking him as his. He hadn’t intended to let himself feel so attracted to the boy. He pushed him gently away. “Maybe you should sit over there, Nicky.”</p><p>Nicky ignored his request and turned his face back up to gaze at him. “I was thinking...”</p><p>“Yes?” Marco asked warily.</p><p>“Well, maybe we should try to get to know each other again. Maybe it would help your memories return.”</p><p>Marco felt a smile playing around his lips. “How would you suggest we do that, Nicky?”</p><p>“Mmm...maybe by kissing a little? Just to see if anything comes back to you?”</p><p>Marco felt his cock jerk at the idea. “All right,” he said softly. “Purely in the name of research...”</p><p>“Of course.” Nicky closed his eyes and tilted up his head. He parted his lips slightly, waiting for Marco to take the next step. Smiling a little and ignoring his pouting lips, Marco leaned over to kiss him gently on the side of the neck, unprepared again for the sweet scent radiating off his skin. What was that? Was he wearing some kind of cologne? Marco moved his nose down to the hollow beside Nicky’s neck and breathed in deeply, surprised to hear a little moan coming from his own throat. He raised his head in surprise, and found his lips only inches from Nicky’s.</p><p>Nicky leaned forward into a kiss and slid his hands under Marco’s shirt, finding his sensitive nipples and twisting one gently in his fingertips. He pulled his head away and not quite touching Marco’s lips, he whispered, “Did you like it? We could try another one if you want.”</p><p>Marco smiled and captured Nicky’s mouth, parting his lips and barely touching his tongue to Nicky’s. Nicky opened up to him, his little tongue hot and inviting. Marco growled possessively and stood up, pulling Nicky to his feet beside him. He stepped in closer to him and put his hands under Nicky’s ass, pulling him up so his crotch touched Nicky’s. He ground his erection against the one in Nicky’s tight jeans. Deepening the kiss, he pressed tighter. Nicky’s arms stole around his neck, and the tips of their tongues met again. Nicky pulled back and smiled up at him.</p><p>“Either you’re enjoying the kiss or you’ve got a very large pistol in your pocket.”</p><p>Marco laughed, pulling Nicky closer. “Little brat,” he whispered in his ear. “Yeah, I’m enjoying the kiss. Maybe we should experiment a little more since this has gone so well.”</p><p>Nicky pressed a chaste little kiss on his neck that sent chills racing down Marco’s spine. With a growl, Marco wrapped his arms tightly around Nicky, pulling his legs up to wrap around his waist. He began walking toward the bedroom, bending down to kiss him and holding the kiss as he moved forward.</p><p>He walked the few steps to the bedroom and lowered him to the side of the bed. “Take off your clothes, Nicky,” he said in a voice that was ragged with need.</p><p>Marco undressed, his eyes never leaving Nicky’s body as Nicky stripped. Nicky lay down on his back and regarded Marco solemnly. Marco let his eyes roam up and down Nicky’s body, amazed that he belonged to him. He was perfection—a muscled torso, tapering to a small waist and beautiful abs. His cock was large, and a dark shade of pink, riding high on his stomach, the head gleaming with a few drops of pre-cum. His golden curls were spread against the pillows and his lips were parted and ruby red from where Marco had kissed him. The black collar lay snugly against his pale skin, marking Nicky as his. All his.</p><p>“God, look at you, laid out and ready for me. You look like an angel with those blond curls —only a debauched and fallen angel, one that I’m about to fuck into the mattress.”</p><p>“Promises, promises,” Nicky said softly, his lips curving into a small smile. Marco crawled onto the foot of the bed and prowled up toward him.</p><p>“Oh, it’s more than promises, sweetheart. I’m going to eat you up. When I get through with you, I’ll have put my mark on every inch of your body. I’m going to spread my cum all over you, so nobody will ever question again whom you belong to.”</p><p>“My, my,” Nicky drawled. “I hear a lot of bold talk, but I haven’t seen much action yet.”</p><p>Marco gave him feral smile and engulfed his whole cock in his mouth in one move. Nicky made a surprised, gasping sound. Marco sucked his cock down, starting with a soft, steady suction that he slowly increased as he moved one of his free hands to Nicky’s balls, holding the hot flesh. He began to add his teeth to the pressure on his cock, slowly skimming his teeth up the shaft, squeezing his balls, waiting for Nicky’s scream of pleasure. He didn’t have long to wait. Nicky thrashed beneath him, his whole body rippling with need, his hands buried in Marco’s hair.</p><p>Marco hummed around the shaft as he licked up the underside with his tongue. When he came back up to the head of Nicky’s cock and thrust his tongue down into the slit, Nicky raised off the bed, and his scream was fucking perfect. He thrust his tongue into Nicky’s slit again and again until Nicky came with another hoarse shout, and his spurts of cum sprayed onto his chest and even his face.</p><p>Marco licked cum from his face and kissed Nicky so he could taste himself. Nicky had collapsed back against the pillows, but Marco had no intention of letting him off so easy.</p><p>“Put your hands on the bedstead and don’t move them.”</p><p>Nicky did as he was told, his big blue eyes trustingly looking up at him. Marco palmed Nicky’s sweet prick and moved his mouth up to Nicky’s nipples, sucking first one and then the other into his mouth and tugging on them with his teeth, until he felt Nicky’s cock fill out again in his hand.</p><p>Nicky moaned with sensual pleasure at the pressure of Marco’s teeth on his nipples. Marco pulled his head back a little and blew on his nipples, making Nicky cry out. “That’s right, baby. Get hard for me. Show me how much you need this. How much you need me.” He reached into the drawer by the bed and got the oil he knew was there, without even questioning how he knew it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He pushed Nicky’s legs up and massaged the lube into his tight, pink hole, pressing his lips over Nicky’s to catch his moans. “Does it ache for more, baby? Want me to fill it for you?”</p><p>Nicky nodded, panting hard for breath and clenched the bedposts harder as Marco could see him want to move, but want to obey him even more. “Good boy,” he whispered to him. “Very good boy. Let me take care of everything, baby.”</p><p>Nicky groaned, his entire body arching toward Marco’s touch. “What do you want, sweetheart? Want me to put my cock inside you?”</p> <p>Nicky thrashed his head. “I-I...”</p><p>“Say it, baby boy.” Nicky closed his eyes, squeezing them shut. “No, baby, look at me with those beautiful blue eyes. Say it, sweetheart.”</p><p>“Please put your cock inside me.”</p><p>“I thought you’d never ask. I will, baby, just as soon as you tell me you’re my pet. Say it, sweetheart. There’s nobody to hear it but me and you.”</p><p>Nicky thrashed his head again and shook his head. “I’ve already...” He looked deeply into Marco’s eyes. “You bastard.”</p> <p>Marco smiled and slid one finger deep inside Nicky and began to move it slowly in and out. The tight little passage clamped down on his finger, trying to expel it, but he slid it slowly back in until Nicky finally began to relax. He added another finger and the process started all over again.</p><p>“Feel that, baby? Is that what you want?”</p><p>“Marco, please...”</p><p>“Please? Please fuck you? Oh baby, I want to, I really do, but first you have to tell me. Tell me you’re my pet.”</p><p>“Marco, you asshole! Stop! Ooh, I hate you!”</p><p>“Want me to stop?”</p> <p>“No, no! Don’t!”</p><p>“Which is it, darlin’, first you do and then you don’t...” He slipped in a third finger and rubbed all three hard against Nicky’s prostate until he shouted again and his eyes rolled back in his head.</p><p>“Please...damn it!”</p><p>Marco let his fingers graze over his prostate again. “Say it.”</p><p>“I’m your pet!” He was so breathless he could hardly get out the words.</p><p>“Good boy. I’m going to fuck this hot little hole,” Marco said, pulling out his fingers and easing his huge cock inside his lover. He thrust inside again and again, nailing his prostate with each thrust, until Nicky was making guttural, unintelligible sounds. Nicky’s tight, hot passage squeezed Marco so tightly he wasn’t making any sound other than moans either. With one more hard thrust, they came together, and Marco thought the top of his head would come off.</p><p>When he’d emptied into his lover, he didn’t think he could move. He lay there, his cock pulsing, his body drained. He drew out and gathered some of the cum leaking out of Nicky’s ass and painted it on Nicky’s cheeks, his lips, his forehead. He got more and spread it over his chest and his neck. “I want you to smell like my cum, baby,” he whispered to him softly. He put some on his finger and fed it into Nicky’s mouth, making him suck it off. “I want you to taste like it.” He felt his fangs drop down and he sank them into Nicky’s neck, sucking the hot blood into his mouth. “Mine,” he moaned into his ear. “Mine.”</p><p>“Yours,” Nicky said, pulling his arms down and wrapping them around Marco’s neck. “Only yours.”</p> <p>“Damn right,” Marco said, and wrapped his boy in his arms, pulling his head onto his shoulder. Then wrapped up in him, their cum gluing them together, Marco sank into sleep.</p><p>Chapter Four</p><p>Marco untangled his legs from the smaller man next to him and eased himself out of bed. He stood looking down at Nicky for a moment before he turned away to go shower. He really was a beautiful young man. A sudden flash of memory hit Marco so hard he almost staggered.</p><p>Marco was sitting in a restaurant in Atlanta—he knew it was Atlanta, though he had no idea how he knew—and he was watching Nicky from across the room. Nicky was standing by a table with a pad and pencil, frowning in concentration as he took an order from the customer. He looked up with a smile and got that little look on his face that he got whenever he was about to make some clever remark, and the people at the table laughed as he said whatever it was. Marco wanted to go to him and bend him back across his arm and kiss that smartass little mouth until Nicky was breathless. Kiss him until he begged for mercy, but he wouldn’t give him any. Marco’s mother put a restraining hand on his arm. “No, Marco, not yet. He’s so young. Give him a little more time,” she said.</p><p>Marco shook his head. Where in the hell did that come from? He’d never been to Atlanta so far as he could remember, or watched this boy as he worked in a restaurant or anywhere else. Was that some kind of memory coming back? He turned away and moved to the bathroom for his shower. As he stood under the steamy spray, his mind kept wandering back to the night before. He’d had no intention of making love to his mate. Hell, he barely knew him, even if he did feel a strange possessiveness for him. So why in the hell did he practically jump the boy as soon as he’d kissed him? Why had he wanted so much to possess him, to tease him, to make him cry out his name?</p><p>He had an uneasy feeling about it. The dream from the hospital came back to him in a rush —the one where he was stalking the boy through the woods. What could that violent, disturbing dream possibly mean? He felt like he was going crazy. He finished his shower and dried off. When he came out of the bathroom, he saw Nicky sprawled out on his back on the bed, one slender foot hooked around the blanket and his golden hair spread out on the pillow. A feeling of deep satisfaction came over Marco to see him in his bed, looking mussed and well fucked and decadent, and Marco thought briefly about going back to bed to wake him up.</p><p>He liked having Nicky in his bed—it was right where he needed to be. Funny, he’d never liked sharing a bed with anyone before that he could remember. Usually he fucked someone and sent them home, preferring to wake up alone, but that wasn’t the case with Nicky. Nicky was special. Yet why did he think so? The young man was gorgeous, yes, but Marco hardly knew him. Why did he want so badly to go back and climb into bed with Nicky and make love to him all day long? The whole thing was downright mysterious, and Marco hated mysteries.</p><p>He was the alpha, and as the alpha he was responsible for the well-being of his pack. He didn’t have time to stand around and moon over some pet. It was a sign of weakness that his father would never have allowed in himself or any member of his household. If he found a weakness in himself, his father purged it ruthlessly, and Marco would do the same.</p><p>Marco’s weakness must be to blame for the changes he’d noticed since he arrived home from the hospital. None of the pets were wearing collars or leather pants, as they had done all the years he could remember. How could he have been so lax in letting the old, traditional ways fall by the wayside? He must have allowed himself to be seduced by this boy and persuaded to do things he never would have done before he met him.</p><p>But why? Why would this pet want to make changes to Marco’s pack? It was almost as if he’d been sent there by enemies of the pack to undermine his authority. He stopped in the middle of the hallway and shook his head. No, it was ridiculous—Nicky didn’t seem to be the least bit treacherous.</p><p>Like a scene from a movie playing in his head, another dream-like image assailed Marco. He stood facing Nicky in the ancestral ring, crowds of people watching them as Marco circled around him, looking for an advantage. Nicky had challenged him? A pet? It was unheard of. He stood very still, willing the memory to come on stronger.</p><p>Nicky sank down on his knees in front of Marco, presenting his neck. It was an instinctive sign of abject submission and humility. Nicky’s back was straight, his hands were behind his back, and he trembled. By sinking to his knees and giving up, Marco won the challenge by default. Marco could now rip out his opponent’s throat if he wished to.</p><p>A gasp came from the crowd when Nicky fell to his knees, but now it seemed the entire pack held its breath to see what would happen next.</p><p>Marco leaned over, putting his hands on Nicky’s shoulders, holding him in place. He brought his mouth down close to his throat to let him feel his hot breath on his neck. He could feel Nicky’s whole body jerking with fear.</p><p>The memory seared through his brain like branding iron. Could it be true? Had Nicky challenged him and faced him in the ring? He seemed to remember it, and how he backed down at the last moment and offered his submission, so Marco had spared his life. Yet they had still somehow remained mated after that. The blood match must have been very strong, indeed. Why had Nicky betrayed him? How could he have ever managed to trust Nicky again after such a thing? Nothing made sense, and he was determined to get to the bottom of it. He strode angrily down the hall in search of his council.</p><p>Nicky smiled at the sight of Evan’s widening eyes as he sauntered into the dining hall. He slid into the seat across from him and Logan. “How’s it hangin’, boys? I’m starving!”</p><p>Logan grinned and glanced down at his watch. “Twelve o’clock, Nicky? Surely you aren’t just now getting up?”</p><p>”Well,” Nicky said in an aggrieved tone, “I had to get my beauty sleep. Marco kept me up all night.” He grinned at both of them. “We didn’t get much sleep either.”</p><p>Logan shook his head. “Damn, Nicky, I thought he was going to beat your ass for sure when he followed you out of here. He seemed furious after Dr. Tate held your hand like that.”</p><p>“He didn’t hold my hand—he was just being friendly, and Marco totally overreacted.” He rolled his eyes. “Like that’s a surprise. I swear the man is way too uptight—he wears me out.” He shrugged and winked. “Sometimes in a good way.”</p><p>“Typical wolf,” Logan agreed. “Always trying to prove who’s the alpha dog. Marco’s the worst, outside of Casey. Both alphas. I might add. They sure as hell don’t share anything they feel they own, do they?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Except their chew toys—Marco’s very generous with his.” Nicky put his head back and laughed loudly at his own joke. A few people who were sitting nearby looked over at him fondly. Nicky was a huge favorite with almost everyone in the pack, and they were proud of their alpha’s pet. His beauty, his kindness, his eagerness to help out any pack member any way he could all served to make him very well liked.</p><p>“Well, don’t look now, but your top dog is on his way over here,” Evan said, looking over Nicky’s shoulder. Nicky glanced up to see Marco bearing down on them. Evan grabbed his tray and stood up.</p><p>“I think I have things to do in my room. See you guys later.”</p> <p>Nicky turned to smile up at Marco. “I didn’t even hear you leave this morning.”</p><p>“Good morning, Nicky. Logan, would you excuse us for a moment, please?”</p><p>Logan gave Nicky a sharp glance and nodded, picking up his own tray and moving away. He glanced back at them as he went, a worried expression on his face.</p><p>Marco sat down beside Nicky, who reached for his hand and slipped his own inside. “I missed you this morning when I woke up,” Nicky said, looking up at Marco from under his lashes. “I was hoping you’d still be in bed beside me.”</p><p>Marco looked him up and down but didn’t respond at first. Then he put Nicky’s hand back in his own lap. “I’ve missed you too. Tell me, Nicky, why aren’t you wearing your collar this morning? “</p> <p>“Um, collar? See, I thought that was just some, you know, bedroom thing we were doing last night.”</p><p>“Bedroom thing?”</p><p>“Well, yeah, you know...it was kinda hot. Like when you put your cum all over me. I even had some of that in my eyebrows this morning. Not that I’m complaining, mind you, but next time, probably not really necessary for, you know, my ultimate satisfaction.”</p><p>“Nicky, it wasn’t a bedroom thing, as you say, and I think you know that. I won’t put up with these little subterfuges, and I understand from what people are telling me that you’re kind of known for them.”</p><p>“Well, I wouldn’t say that, exactly.”</p><p>“No? According to my council members, the first few months you were here, you ran away and joined with a rogue group who were challenging my leadership of the pack. Then to top that off, you became their champion and challenged me in the ancestral ring.”</p> <p>“You’ve been checking on me? But that was all a huge misunderstanding, Marco. And I didn’t run away, I was kidnapped by them. Then they explained to me how harsh you were being with their mates, and forcing them to act all submissive when they didn’t want to, and I...uh...I did sort of challenge you, actually. But I didn’t know what it meant at the time, really. When you faced me in the ring and told me the consequences, then I submitted to you right away.”</p><p>“Yes, and then turned feral from lack of wolf’s blood because you were carrying out some kind of half-assed experiment.”</p><p>Nicky reached for his hand and Marco let him take it again. “I didn’t know it would make me feral, Marco. You saved me, you know.”</p><p>“Of course,” Marco said, rubbing his thumb over the back of Nicky’s hand. “I’ll always save you—you’re my mate. Even though I’m just getting to know you—well, it feels like it to me, anyway—I already feel very protective of you. That’s why I was alarmed to also hear you disobeyed a direct order and risked your life by going to the prison with my nephew Rory to save Ian from the Hunters.”</p><p>“Oh...that...well, see...”</p><p>“And then when I correctly gave you a punishment for it that seemed to be a very reasonable punishment from what I heard, you ran away again.” Nicky dropped his eyes back to the tablecloth, but Marco’s finger forced his chin up gently but firmly. “You and Logan both were gone for over two weeks, I believe. With Hunters in the woods.”</p><p>“Yes, Marco.” Nicky’s voice was very quiet.</p><p>“I don’t mean to be harsh with you, Nicky, despite what your friends Logan and Evan were probably telling you, but I can’t allow you to risk yourself like that again. As my mate, you’re my responsibility, and I take my responsibilities very seriously. I have to teach you to be a good mate and a good example to the other mates in the pack. I think I need to retrain you as my mate, Nicky. And we may as well get started today. Go upstairs and find your collar. Put it on and stay in our rooms until I get there. Understood?”</p> <p>“Sure, I understand.” He pulled his hand away from Marco’s and stood up. He gazed down at Marco and took a deep, steadying breath. “That doesn’t mean I’m going to do it.”</p><p>Chapter Five</p><p>Nicky woke up alone and stretched his arms up over his head. He was starving and hoped Marco had left him something to eat. Sitting up and scooting out of bed, he stood up and walked stiffly into the kitchen. His ass was sore both inside and out from Marco’s “discipline.” He wondered again just what he’d gotten himself into as he found the muffins Marco had left on the counter for him. He found a glass and poured himself a big glass of milk. Deciding to stand up to eat and spare his aching ass, he thought back to Marco’s reaction the day before when he’d refused to put his collar on.</p><p>At first Marco had simply stared at him, and then he took his hand and pulled him back into his seat. “I’ve just come from a long talk with my council members, Nicky, and we’ve come to some decisions. I think it’s only fair for me to explain them to you before this goes any further.”</p><p>Nicky was uneasy at his firm tone and the unyielding look in his eyes. “What decisions? What do you mean? Before what goes any further?”</p><p>“The council and I discussed all the changes made to the pack in the last year and a half, and we agreed that some of them are worthwhile. Wearing the leather pants with no shirt, for example, was old-fashioned and inconvenient, even impossible, for the pets who need to work outside or down in one of the towns.”</p><p>“Well, yeah. Thank God you actually realized how stupid that was.”</p><p>Marco went on as if he hadn’t spoken. “So we’ll continue to allow our pets to dress in more modern clothing. The collars, however, for the mated pets, is not optional any longer. All mated pets will wear one from now on and that is not negotiable, so don’t even start.”</p><p>“I see,” Nicky said shortly, his lips thinning in anger.</p><p>“The extra freedoms you’ve all been allowed will stay as well. The pets acquitted themselves quite well in the battle with the Hunters, so you’ll still be allowed to fight beside us, should that ever become necessary again. Some of the training that Logan has been doing can continue, though the advanced training is not necessary and will cease right away. Logan and his helpers will have plenty to do just conducting basic self-defense training.”</p><p>Nicky nodded, not trusting himself to speak, and Marco continued.</p><p>“I thought at first, judging from your behavior, that I needed to change other rules too, but from what the council tells me, it’s more a matter of you misbehaving than any rule changes being needed. I’m not sure why I’ve let you get away with so much, Nicky, but all that is going to change. I’m retraining you, and this time, I’ll be more strict. As the alpha’s pet, you need to set a good example for the younger pets. All of them look up to you and will follow your lead.”</p><p>“Retraining,” Nicky said quietly. “And if I refuse?”</p><p>Marco leaned forward. “Nicky, understand me on this. My pet has to be a leader and must be well-behaved. I would never force you to do anything you don’t feel comfortable with. Please understand I’m not trying to threaten you—I’m only trying to be honest. If being submissive to me is so hateful to you, then, I’m sorry, but you’re not what I want or need in a mate. Since the blood match is no longer a factor, I could allow you to leave. The match could be dissolved.”</p><p>He let the words sink in as Nicky’s eyes filled with hurt, angry tears. How could this be happening? He’d thought this love with Marco would be forever. He’d always been told that wolves mated for life, and he’d been more than happy to spend his life right here with Marco. Now Marco was telling him he was expendable. He felt like he was in a nightmare and couldn’t wake up.</p><p>Marco put his hand over Nicky’s, where it lay suddenly still and lifeless in his lap. “Please understand I’m not trying to hurt you. I don’t want to hurt you, and I don’t want you to go. But if you decide to leave, remember I’ll never abandon you. I’ll continue to feed you and give you whatever you need. You’d always have a home here, and maybe you could find a mate with someone else. It’s obvious that many of the males admire you. The females too.”</p><p>Nicky pulled his hand sharply away. “While you mate with someone else too? And the idea of my being with another wolf seriously doesn’t bother you?” Nicky’s voice was filled with hurt and shock. Marco looked uneasy.</p><p>“Yes, of course, it would bother me at first. Even in a short time, I’ve come to have feelings for you. I have a few memories that have come back—not many,” he said quickly when hope sprang up in Nicky’s eyes. “But I feel—I feel things I don’t understand. Some of the memories confuse me, I’ll admit. But yes, in time, I-I may well have to find someone else if you decide to leave me.”</p><p>“Oh, let’s have some honesty between us, Marco. It won’t be me ‘deciding’ to leave you— this is about you forcing me into a decision. Backing me into a wall.”</p><p>Marco leaned back and tightened his own lips in anger. “Be reasonable, Nicky. This is not the way I want to live my life, any more than it’s what you want. Wolves are dominant creatures, and the alpha is the most dominant of any in the pack. Yes, I want a submissive mate, but I won’t force you into it. I’m not some kind of slaver. A slave wants his freedom, while a submissive wants nothing more than to belong to his master and to freely give up control. I have no interest in an unwilling partner, Nicky. If you can’t give yourself to me completely and become my submissive mate, then what future do we have together? One of us will always be wanting more than the other could possibly give.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He leaned forward and took Nicky’s unresisting hand in his, rubbing his thumb along the back of Nicky’s hand. “I’m trying to give you a choice. I think I’ve seen some true submission in you, but only you know what you really want—what you need to make you happy. I want you to think this over very carefully. Be sure. Ian and the others are urging me to wait and see if my memory comes back, but I know my own mind. If I didn’t push the submission issue before, then it had to be because of the blood match. The blood match blinds us to anything except being with our mate. Usually the match is a good one and pairs us with a mate who is perfect for us. I think, in our case, the match could have been a mistake.”</p><p>Nicky shut his eyes, feeling the words hit him like poison darts, each one hurtful and potentially even killing. He shook his head, unable to say a word.</p><p>“Nicky, please understand,” Marco said. “I must have been afraid to lose you before, and to tell you the truth, the idea is still hateful to me. I want you for my mate, but only if this is something you truly want too. We both deserve to be with someone who can make us happy. Take some time and think it over, baby. I’ll go with whatever you decide, but make no mistake. If you decide to stay with me, you’ll belong to me completely, and I won’t be satisfied with less.”</p> <p>He rose to his feet, gave him a long, significant look and walked away, leaving Nicky confused and heartbroken, not knowing which way to turn. He put his head down on the table and one low sob shook his shoulders. A hand on his back made him raise his head and dash the tears away from his eyes. It was Logan, looking at him with concern.</p><p>“What’s the matter, Nicky? What did he say to you? I was watching you two from nearby and when I saw how intense the conversation was getting, I decided to wait and see if you were okay.”</p><p>“He really doesn’t love me anymore, Logan. I kept thinking that deep down he still did, and I could somehow reawaken it, but I can’t.”</p><p>“Nicky, I don’t think Marco even knows what he feels anymore. Give him some time, and he’ll remember you. Or else he’ll fall in love with you all over again.”</p><p>“Not if he won’t give me a chance. Not if he dissolves our mating.”</p> <p>“What? I don’t believe it! Marco would never let you go.”</p><p>Nicky shrugged sadly. “That’s what I thought, but he said he wants someone who’s more submissive, and who doesn’t disobey all the time.”</p><p>“That asshole!”</p><p>“Oh, Logan, he’s right, in a way. He said we both deserve to be happy. He doesn’t remember me, really, and what we once had together. He knows what he wants in a mate, and if I can’t bring myself to submit to his authority the way he wants, then maybe he’s right. Maybe we should be apart. Though the thought of him with someone else makes me...” He bent over and clutched at his stomach. “I think I’m going to be sick.”</p><p>Logan jumped to his feet in alarm and grabbed a trash can from against the wall. He shoved it under Nicky and rubbed his back in sympathy as Nicky retched helplessly into it. When Nicky finished, he helped him to his feet.</p><p>“Come on. Let’s get you upstairs where we can talk in private and you can lie down for a while.”</p> <p>Nicky allowed Logan to take him back upstairs and help him over to the sofa where he stretched out, still trembling from the stress of what Marco had told him and the weightiness of the decision he had to make.</p><p>Really, how could there even be any choice? He couldn’t leave Marco. Just the idea of it had made him violently ill. No matter how much he joked about him and teased him in the past about being a stubborn, dominating throwback, he still couldn’t imagine his life without him. He didn’t want to. He would do whatever it took to stay with Marco—whatever it took. And in all truthfulness, he’d always been submissive to Marco in the bedroom, an enthusiastic bottom to his top. It was his stupid pride that was getting in the way, and he wouldn’t allow that to ruin his happiness.</p><p>If Marco wanted him to wear a collar and obey him in public, then he would do it. Marco had mentioned retraining, which would probably mean a couple of weeks of kissing his ass in front of the pack and hot sex when they got back home. Surely he could handle that. He might even enjoy it, if he could relax and allow it to happen. He loved Marco’s dominance in bed, and Marco would never be really mean to him, no matter if he remembered him or not.</p><p>Dominance wasn’t about being mean to someone, Nicky knew that. He knew it instinctively. Marco had said true submission was about giving yourself completely to another man and putting all that you were into his hands. Hadn’t he already done that with Marco a long time ago? Sure, he liked to tease him and try to get his attention, but that’s usually all it was. He wanted his undivided attention. He craved it and would do anything to get it. He could do this. He would do this. Nicky turned to Logan, who’d been sitting quietly in a nearby chair watching him.</p><p>“Logan, would you do me a huge favor and go get Marco? Tell him I’ve made my decision.”</p><p>“Nicky, are you sure? Really sure?”</p><p>“Yes, Logan. I’m going to do this. Gabe does it for his alpha all the time,” he said, referring to his friend from the Georgia pack.</p><p>“But Gabe is a true submissive.”</p> <p>“Maybe so, though they fight all the time and have epic sex afterward. Am I really so different? Marco has always dominated me in bed, and I’ve mostly always let him. He’s spanked me before too, and then we had sex afterward. He just doesn’t remember any of that, and all he knows is I’ve run away a few times when we were fighting, and I don’t let him boss me around. The thing is, Logan, that I always knew he’d come find me whenever I ran away, and most of what I do to be rebellious, I do it because I want his attention.”</p><p>Logan shook his head. “You’re talking yourself into this, Nicky.”</p><p>“It doesn’t matter. I want Marco on any terms, and that’s all me. If wearing his collar and letting him boss me around will allow me to keep him, then what the fuck is the problem? Hell yeah, I’m talking myself into it, because I’ll keep Marco no matter what it takes. No matter what, Logan! If you don’t want to help me with this...”</p><p>“Nicky, I want to help you. You’re my friend. But I want you to be happy.”</p><p>“Marco makes me happy.”</p><p>Logan sighed and stood up. “Okay, I’ll go find him. I just don’t get what his problem is. Why can’t he go on as he did before? Hell, none of us is exactly independent here. We all live with our wolves and mostly submit to their will. What the hell else does he want?”</p><p>Nicky heard the echo of Logan’s words as the memories receded. What did he want, indeed? Nicky sighed and finished eating, turning to go put his dishes in the sink. He wrinkled his nose at the smell of garbage. Marco must have forgotten to take it out and now it would have to wait until he got home. He was being punished and Marco had forbidden him to leave the apartment and ordered him to remain inside, naked, until he told him different.</p><p>Nicky walked over to light a scented candle on a table by the window to help sweeten the air. He also opened the window to let in some fresh air and stood gazing out. Last night, Marco had begun his “retraining.” He’d been waiting for Marco when he came home, already wearing only a pair of skin tight briefs made of a jersey-like material that showed off his package quite nicely, he thought. The apartment was clean and Marco’s eyes had lit up when he walked through the door and looked Nicky up and down. Nicky had strapped on the thin leather collar just before Marco came home, and he saw Marco’s eyes linger on it for a few moments.</p><p>Marco came toward him and took him in his arms. “Are you sure about this, sweetheart?” he murmured, his lips against Nicky’s ear.</p><p>“I’m sure.” And he was sure. He really thought he could pull this off and everything had gone really well until bedtime.</p><p>Marco had been working on some paperwork, so Nicky got involved in a TV show he liked while he waited for him to finish. When he stood up and stretched, telling Nicky to turn off the TV and come to bed, Nicky hesitated, feeling irritation. The rebelliousness that was so much a part of his nature reared its ugly head.</p><p>“I’ll come just as soon as this is over, Marco.”</p><p>“Nicky, it’s getting really late.”</p><p>“C’mon, Marco, I said in a few minutes! What possible difference can a few minutes make?”</p><p>Marco stepped closer and gazed down at him. “Are you testing me, Nicky? Is that what this is about?”</p><p>“I’m not testing anything. God! I’ve waited on you hand and foot all evening and now I just want to sit here for a few minutes and watch my show. Is that so much to ask?”</p><p>“It’s not about the damn show and you know it! Turn it off and come to bed.”</p><p>Nicky ignored him and deliberately turned up the volume. From the corner of his eye, he could see Marco narrow his, and then he wrenched the remote from his hand and threw it across the room, shattering it.</p><p>Jumping to his feet, Nicky yelled, “Asshole!” Then he clamped his hands over his mouth and slowly turned to face Marco. “I’m sorry. I didn’t mean that.”</p><p>“No? What did you mean?”</p><p>“Uh, nothing. I mean, yes, sir. Or no sir. Or whatever it is you want me to say, sir.”</p><p>“Come here, Nicky.”</p><p>“Uh...no, I think I’ll stay over here for a minute.”</p><p>“Nicky...”</p><p>“I’m not going to let you hit me, Marco!”</p><p>Marco’s eyebrows rose. “Hit you? What on earth makes you think I would ever hit you?”</p><p>“Oh I don’t know, maybe the fact you already have the first day you came home and I shook Dr. Tate’s hand. That and the look in your eyes.” Marco started forward toward him and Nicky held up his hands in a Tai Kwan Do defense posture Logan had taught him. “Stay back, Marco, I’m warning you!”</p><p>Marco rolled his eyes and reached for him and Nicky panicked. He dropped the posture—he didn’t really know the move anyway—and swung his fist at Marco, aiming for his nose. Marco caught Nicky’s fist in one big hand and pulled Nicky to him, pushing his hands behind his back and holding them there, bringing Nicky’s body up close to his, so tightly Nicky couldn’t move, except to look up into his face, afraid of what he might see there. Instead of the anger he expected, though, he saw only determination. “Right,” Marco said. “I can see you need a little reminder.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nicky’s cock began to fill out just thinking about the spanking he’d given him at that point. The spanking still had his ass so sore he couldn’t sit down. Well, that and the sex afterward. Several rounds of it. Marco had been insatiable—Nicky had never seen him so wild and out of control.</p><p>Nicky had been fucked on just about every surface in the apartment, and even up against the wall once. Not that he hadn’t loved every second of it. Except for the spanking—he could have done without the spanking, even though he’d come twice during the proceedings. He’d come once when his cock, tucked between Marco’s hot thighs, had absorbed just about all of the friction it could take as he struggled to get up and Nicky shot off with a loud, embarrassing moan. Then again, before he could even recover from the first orgasm, Marco had splashed his hole with lube and used his fingers to fuck him as he lay face down on his lap until Nicky begged for mercy and came even harder than before. That was the last orgasm Marco had allowed him to have for hours, putting him in a cock ring and sucking on his nipples and his cock until Nicky apologized abjectly and pled for release. Instead, he’d kept him naked and needy, teasing him unmercifully, yet not allowing him to come until almost dawn.</p><p>Just before he finally allowed him to go to sleep, he’d taken him to the bathroom and into a warm shower. Marco bathed him tenderly and kissed him under the warm spray of the shower until his knees were weak. Afterward, he’d dried him and carried him to bed, spooning him and fondling his dick for what was left of the night.</p><p>Marco still hadn’t told him he loved him, but Nicky was hoping he might be getting close to saying it. His need to hear the words again was an almost physical ache. Nicky had said it over and over, but each time Marco had only kissed him in reply.</p><p>Nicky switched on the radio by the window. The Bruno Mars song, “It Will Rain,” the same one that was playing his last night with Marco before his collapse was on the radio, and Nicky swayed back and forth as he sang along. The irony of the song wasn’t lost on Nicky. It was all about pain and sacrifice and loss.</p><p>From his place by the window, Nicky saw Logan come out on the lawn, followed by his young trainees. He was training the younger pets in self-defense techniques, and Nicky longed to go out and watch them. Because of Marco’s orders to stay naked until further notice, though, he couldn’t even go outside. Of course, the wolves went around partially clothed all the time, as they shifted to train or run in the woods and nobody paid much attention. He wondered what Marco would do if he went outside without wearing any clothes. After all, Marco had ordered him to stay naked, so technically, he wasn’t disobeying him. Not totally.</p><p>The little devil who lived on Nicky’s shoulder urged him to go ahead and do it. What was the worst thing Marco could do? Spank him again? That had been pretty hot. Besides, it was such sweet payback. Marco would hate him showing his body off to anyone else. The thought of all the attention Marco would give him for this had his dick getting stiffer. Actually, the idea of being naked in front of everyone was a little daunting, but Nicky knew he could do it. It just took some big balls and Nicky looked down at himself and smiled. Big balls he had. Maybe it was time to show them off.</p><p>He turned from the window with a sigh. Might as well face it, no way did he have big enough balls for that. Marco would seriously kill him. He wandered over to a new canvas he had set up next to the window and smiled. At least he could paint standing up and spare his sore ass. He had started an oil of a silver gray wolf howling at a full moon, just before Marco’s collapse. Since Marco had confined him to his rooms, maybe this would be a good time to work on it.</p><p>He went over to the small cabinet where he kept his paints and supplies and took out his palette of paints and a small can of paint thinner. He opened his paints, but had trouble with his paint thinner’s cap. Using a paint rag to help him grip the top, he applied pressure and twisted as hard as he could. The cap came off all at once, soaking the rag and spilling onto the table by the window. The small candle he’d lit earlier was on the table and the flame leaped up and caught the rag on fire. Panicked, Nicky tossed the rag toward the window, but it fell against the lacy curtain, which went up in a sudden burst of flames.</p><p>“Oh my God!” Nicky yelled, backing away. He ran over to the sink and filled a pan of water, returning to hurl it against the flaming curtain, but the flames were by then licking at the ceiling. Nicky turned and ran to the door, flinging it open and shouting for help. A door opened down the hallway and Jeremy Tate and his sister appeared framed in the doorway.</p><p>“Hurry! Come quick! Fire!” Nicky yelled, and then things started happening very quickly. Jeremy yelled for his sister to go get help, while he ran down the hall to Nicky’s apartment. Pushing past him, he ran inside the apartment and took in the scene with a quick glance. “Is there a fire extinguisher, Nicky?”</p><p>“Oh, yes!” Nicky nodded, pointing to the kitchen wall near the stove. “I forgot all about it!”</p><p>Jeremy grabbed it from the wall and expertly put it into operation, extinguishing the flames in only a few minutes. He put down the fire extinguisher and turned to Nicky, who was still shaking with reaction. “You’re burned, Nicky. Sit down so I can look at it,” he said urgently, grabbing his arm to examine it.</p><p>“I-I...” For the first time Nicky noticed the rag had burned his arm just above his wrist. He stared down at it in confusion, allowing Jeremy to draw him over to the sink to run cold water over it. When the water touched his arm, the pain rushed in with a vengeance, and his knees went weak. He sagged down a little and tried to pull away. Jeremy moved behind him to push him against the counter and keep him from moving his wrist away. At the same time, he slid his arm around Nicky’s waist to hold him up.</p><p>A loud roar behind them had them turning together in surprise. Marco was moving toward them with blood in his eyes. He reached them in only a second and ripped Nicky out of Jeremy’s arms, flinging him halfway across the room in his rage. Nicky landed on his ass in the floor, but he was more concerned about Jeremy, who was on his back with a partially shifted Marco on top of him. They were surrounded by other wolves who pulled Marco off and held onto him while Jeremy was hustled away. Other hands were helping Nicky to his feet and someone wrapped a blanket around him.</p><p>Marco pulled himself from the grip of the men around him and came over to Nicky, taking him into his arms. He picked him up and carried him into the bedroom, laying him on the bed. “Are you all right?” he asked urgently, his voice sounding hoarse and ragged. When the wolves shifted, even partially, it sometimes took a short while for their voices to sound normal again.</p><p>Nicky held out his arm. “Just my arm...it got burned some. That’s what Dr. Tate was doing at the sink. He was trying to help me.”</p><p>Marco’s lips were thin and tight. “I know...I...overreacted when I saw him—you were naked and...” He ran a hand over his face. “Shit. I overreacted, baby.”</p><p>Ian stepped up behind him with the first aid kit. “Here, Marco. There’s some burn salve inside unless you think he needs to go to the hospital.”</p><p>“No, I don’t think it looks all that serious,” he said, opening the kit. “I can give him some blood later if he needs it.” He took out the cream and spread it gently over the burn. The healing salve began to cool it right away, though Nicky was still trembling with reaction. Marco patted his shoulder and looked up at Ian. “Tate? Did I hurt him?”</p><p>“No, he was just shaken up a little. He said he understands how it must have looked with Nicky, uh, naked and all. He said he’s been around wolves long enough to know they think mostly with their little heads,” Ian said ruefully.</p><p>“Son-of-a-bitch,” Marco muttered under his breath. “I thought he was told not to come back here.”</p> <p>“He was visiting his sister, who’s a little under the weather, and he did put out the fire, Marco. He was only trying to help,” Ian said quietly.</p><p>Marco gave him a sharp look, but didn’t say anything else. He stood up abruptly and strode out of the room, leaving Ian standing by Nicky’s bed, looking down at him.</p><p>“Is your arm feeling better, Nicky?”</p><p>“Yes, a little. Is there much damage from the fire?”</p><p>“No, not too bad. Nothing for you to worry about. Lie back and get some rest. I’m sure Marco will be back in after he checks things out a bit. He was just concerned about you, Nicky, that’s all. He’s been through a lot lately, and he’s still trying to adjust.”</p><p>“Yeah, aren’t we all?’</p><p>Ian shook his head sadly and left him alone. Nicky rolled over on his back to stare at the ceiling and think about what had happened. Jeremy’s body felt so alien and strange against his, smaller than Marco’s yet hard and firm. Very firm in one area in particular. Jeremy Tate had a huge hard on as he pressed up against Nicky’s naked body. He had to admit that despite the pain in his arm, it had been—not at all unpleasant. At least someone wanted him just for himself. He wondered if Marco noticed Jeremy’s erection. He wondered too if Marco noticed the way Nicky’s cock had begun to fill out as Jeremy held him against his body.</p><p>Chapter Six</p><p>Marco sat across from Nicky in the room that had been freshly painted and repaired. Two weeks had passed since the fire. Two weeks of almost constant arguments and recriminations and tears. The sex between them was still amazing, and neither one of them could get enough of each other in bed. Each time it seemed as if they both knew it was mostly over between them, yet they clung to each other almost desperately, unwilling to break this last bond keeping them together.</p><p>The day before, Marco had finally asked Nicky to release him from their vows. Nicky had been shocked and disbelieving at first, telling Marco he hated him and would never forgive him for what he was doing. Marco had hoped he would settle down after a while, but he guessed it wasn’t meant to be. Nicky was still furious and refused to even look at him.</p><p>He’d asked Nicky to dissolve their union, not because he didn’t have feelings for Nicky, but because he was making Nicky more and more miserable with each day that passed, and if this kept up, he knew Nicky would wind up despising him. To tell the truth, he hadn’t really expected Nicky to agree. He thought he might just scare him a little and make him try harder to do as Marco said. When he’d said yes to the dissolution, Marco had felt betrayed, even though he’d asked Nicky for it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Now Nicky fidgeted on the sofa in front of him, and Marco thought with despair that Nicky had never looked more beautiful, more desirable.</p><p>“So,” Nicky said quietly. “What happens now?”</p><p>“I already have your room set up and waiting for you, next door to Evan and Brett. I thought you might want to be close to some of your friends. We can have the dissolution ceremony tonight, if you want, to go ahead and get it over with. And that will be it. You’ll be free to live with us for as long as you want—you’re still a part of our pack, hon—uh-Nicky, and I’ll take care of you always.”</p> <p>“Even after you find a new mate? Your mate might not like that so much.”</p><p>“It doesn’t matter,” Marco said, shaking his head. “I won’t abandon you.” Nicky looked up at him with pain and hatred in his blue eyes. Damn, why did this have to hurt so much? Not just Nicky, but Marco too. He felt as if a giant hand was clenching his guts.</p><p>“I did try, Marco. I really did.”</p><p>“I know, baby. I know you did. I know things were making you miserable. I think it would have made you despise me in the end if you had stayed with me, and I didn’t want that. I’d never want that. I do want you to be happy, though I guess that’s hard for you to believe right now.”</p><p>Nicky stood up, keeping his gaze averted, not looking directly at Marco. He walked toward the door. “This thing tonight—it’s private, isn’t it? I don’t want a crowd of people.”</p> <p>“It’s private. Just the two of us and Ian as witness.” Dissolutions were uncommon enough that Marco and Ian had to look back through the old books to see exactly how to do it. Wolves mated for life, and dissolving a union like this hadn’t been done in recent memory. The idea of it had made the whole pack uneasy and unhappy. Marco wondered, not for the first time, if there were any way just to take the whole thing back and make it go away. The pain he was causing Nicky was killing him, and the only way he was going to be able to go through with this was by clinging to the idea that Nicky would ultimately be happier without him.</p><p>Nicky nodded and turned away. He put his hand on the knob and turned his head just slightly to speak over his shoulder, not meeting Marco’s eyes. “I-I don’t know if I can stay here, Marco. I may have to go away.”</p><p>“No!”</p><p>Nicky turned all the way around looking surprised at the vehemence in Marco’s tone.</p><p>“I-uh-I mean, no. You need to stay with the pack. We’re your family now, and besides, you have to feed from a wolf. If you can’t take the blood from me, then Ian or Rory will be glad to help you. You don’t need to leave, Nicky. No, you can’t leave. ” Marco was surprised how the thought of Nicky’s absence from the pack made him feel. It was excruciating and almost made him sick. He thought it must be guilt he was feeling and pushed it firmly down inside him. It was a weakness he could overcome. He had to.</p><p>Nicky shook his head sadly. “We’ll see. I just don’t know right now. I-I need to go downstairs. I’ll see you tonight. He cast his eyes around the room one last time and then turned away, dropping his gaze. The door shut quietly behind him, leaving the room emptier than Marco could have imagined.</p> <p>Marco worked at the construction site all afternoon, trying to wear himself out, trying to forget the look in Nicky’s eyes when he left the room that morning. Finally, late that afternoon, he followed the others when they left for the day, dreading the moment when he opened the door to his apartment and found it empty. He knew he was being foolish. He’d agreed this was for the best, and he couldn’t imagine why the idea of losing Nicky as his mate was causing him so much pain. There was no way he could have fallen in love with Nicky in the few short weeks since he’d come home from the hospital. That sort of thing only happened with a blood match.</p><p>He just had deep regrets about hurting the boy, that was all. He’d made a mess of things with Nicky, and he owed the boy a chance to find some happiness. He went into his rooms to take a shower. He dreaded the dissolution ceremony later on, even though he’d cautioned Ian to make it as short as possible. The ceremony had been scheduled for six-thirty, so he wandered downstairs to grab a quick bite to eat before it began, even though his stomach was churning, and he had little appetite.</p><p>As soon as he entered the dining area, he saw Nicky, sitting with Evan and his mate, Brett. Logan was standing beside him too, speaking to him quite seriously about something. Nicky kept shaking his head, but looked up sharply when he noticed Marco come in. His pretty cheeks flushed, and he looked down at his plate. Marco turned away, not wanting to stare at him and make him uncomfortable. He felt sick, but he forced himself to fill a plate at the buffet table and walk over to a table occupied by Casey and Rory.</p><p>Rory looked at him with his lips tight and angry, but Casey nodded and smiled at him, making him welcome. There was a tense silence at the table, though, and finally he set down his fork. “Did you have something to say to me, Rory?” He knew his nephew was upset with him about Nicky. They’d been close friends and even partners in crime from the time Nicky had first come to the lodge.</p><p>“Just that you’re making a huge mistake, Marco.”</p><p>“Rory,” Casey said in a warning tone. “Show respect to your alpha.”</p><p>“I’m sorry, Marco, but I don’t understand. No one does, and you need to know that. Nicky’s</p><p>not a bad person. He’s just—Nicky! He’s funny and sweet and brave and everybody likes him. No one understands why you’re treating him like this.” Marco shook his head. “I like him too, Rory.” Marco sighed heavily and glanced over at Nicky again. He wasn’t eating anything—his plate was still full and he was moving things around on it like he always did when he was pretending to eat. His wolf leaped inside him at the thought that Nicky would make himself sick. He wanted to go over and make him eat, but that was the problem. Nicky didn’t want his orders—he had no need for Marco’s control, and he’d made that abundantly clear.</p> <p>“Nicky’s too independent, too outrageous, too—everything—for this lifestyle. Apparently, I was so lost in the blood match I didn’t give that enough consideration. I know you told me he was dying from being attacked in a mugging when he first came here, but I shouldn’t have mated with him until he came out of heat. I should have spoken with him when he had a clear head and could make a decision without the blood messing with his mind. I wonder if he was ever really happy.”</p><p>Rory snorted. “Of course he was! Everyone knew he was! Sure, Nicky’s a little wild and rebellious, but one thing was always clear to everybody, and that was how much he loved you. And how much you loved him too! I know he doesn’t like to take orders—I don’t always like it myself,” he glanced over at Casey. “But I love Casey more than I hate taking the orders. Casey’s an alpha too, so I know how hard it can be. But if you compromised, gave in to him just a little— the way you used to before you got sick. Of course, you loved him then, and I guess you don’t love him anymore.”</p><p>Marco could feel the heat rise up in his face. “The blood match is gone.” “Yes, I know, but do you love him? Ian and Logan don’t have a blood match and they’re perfectly happy. It can be done.”</p><p>Marco stood up without answering and walked away from the table. He didn’t want to listen to any more of this. He couldn’t.</p><p>Walking purposefully over to Nicky’s table, he stopped beside Logan, who inched subtly away from him and stood beside Nicky. No doubt about where Logan’s allegiance lay, but Marco was glad Nicky had such a loyal friend. He focused on Nicky, though, and spoke softly to him. “Nicky? Are you ready to go upstairs to the office?”</p><p>Nicky nodded and stood up, stumbling a little so that Logan steadied him. He seemed to take a deep breath. “I’m ready,” he said.</p><p>Marco waited for him to proceed, but when he just stood there, he walked ahead, glancing over his shoulder to make sure he followed. They walked up the stairs with Logan following again. Marco glanced at him, but got a steely look of determination in reply. He didn’t care if Logan watched this train wreck. He only wanted to make sure Nicky was okay with it, but Nicky seemed to be almost in a daze, not even watching where he was going.</p><p>Marco led the way into his council room where Ian was already waiting. He had the paperwork set out for both of them to sign. At Marco’s nod, he asked quietly, “Nicky, is it your desire to permanently dissolve your mating with Marco?”</p><p>Nicky nodded, not looking up at either of them. Ian held out the pen for Nicky to sign at the bottom of the paperwork, and he did so with a trembling hand.</p><p>Marco’s hand was none too steady either as Ian asked him the same question and then handed him the pen. Before another word could be said, Nicky quickly turned and hurried from the room. Logan shot Marco one more poisonous look and followed him. It was quiet in the room after the two young men left, and Marco sank into a chair and put his head in his hands.</p><p>Ian grasped his shoulder. “Are you all right, Marco? Should I call him back?”</p><p>“No,” he said with a shake of his head. “It’s done, and it was hard enough to do it without talking about it over and over. I feel awful, Ian. What if I’m making a terrible mistake?”</p><p>“I think you are.”</p><p>Marco raised his head in surprise at the blunt words of his beta. “What? But the blood match is gone, Ian, and I don’t think Nicky was ever all that happy as an alpha’s pet. He struggled so against it, and now he’s free to make a different life for himself.”</p><p>“By doing what? He’s in the pack for life, and that won’t change. I suppose he could take another mate. Certainly there will be many, both male and female, who will want him. How will that feel, Marco, to watch him with someone else? Knowing what some other wolf is doing to him when he gets him behind closed doors?”</p><p>“Shut up, Ian!”</p><p>“All right. I’m sure you thought all this through, but I know I could never stand by while some other wolf pawed all over Logan. My God, it would drive me crazy.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You and Logan are in love, Ian.”</p><p>“That’s right, we are,” Ian said thoughtfully. “Very much in love. And yet we don’t have a bloodmatch.”</p><p>Ian gathered the papers and walked stiffly to the door, while Marco looked after him with a stunned expression. He sat for a long time after Ian left, dreading going back to his rooms, so empty now without Nicky. He was terribly afraid he wouldn’t be able to sleep and would stay awake half the night, haunted by that lost, bitter expression on Nicky’s face.</p> <p>“That was Dr. Cornsilk. He has some information for you and needs to speak to you at the hospital. Would you like me to come along?” Ian stood at the door of his office early the next morning, his face once more the mask of his calm beta.</p><p>Marco nodded, not really wanting to be alone. He stood up and sighed in exhaustion. His prophecy from the night before had come true. He had slept poorly, plagued by restless dreams and a feeling of unease. “Did he say what it was about?”</p><p>Ian shook his head. “No, just that you should come right away. He’s found something in the notes about the amnesia.”</p><p>Marco nodded and got up from his desk to leave right away. He thought about going by to check on Nicky before he left, even started to go down the hallway to his room, but turned away. He should leave Nicky alone for a while. He could check on him when they returned.</p><p>Driving into town, Ian was quiet, barely saying a word, just watching the road. Marco, too, was preoccupied and silent. They drove into the hospital parking lot and made their way inside. Dr. Cornsilk nodded respectfully to his alpha as Marco and Ian came into his office. “It’s good to see you looking so well, Marco. A bit tired, perhaps...”</p> <p>Marco sat down in a chair in front of his desk. Ian sat beside him. “I’ve been going through some things,” Marco said.</p><p>“Oh?” The doctor raised an eyebrow at Marco, but Marco stared steadily back at him, unwilling to say more. “Well, uh, I called you in to speak to you about the amnesia you have with Nicky. I’ve been looking through the records, and we found the name of the man who must have been the one to jab you with the hypodermic needle. We’re almost positive his name was Arthur Bennett. Dr. Arthur Bennett, the doctor in charge of the laboratory at the complex.”</p><p>“What the hell did he jab into me?”</p><p>Dr. Cornsilk looked down at his file. “From what we can determine, he was working on a genetically engineered virus. This virus was targeted directly at the bloodmatch. As you know, discovering a way to end the blood match was an interest of the Hunters for years. They believed that they could use this to destroy the matches of all the human so-called victims and thus free them from what they termed their bondage to their wolf mates. The idea was to make a vaccine targeted at killing the blood factor causing the match. I think he used one of his experimental vaccines on you, Marco.”</p><p>“And that’s why I forgot Nicky? And almost every memory associated with Nicky?”</p><p>“Yes, I believe so. According to the records we found, this was his latest vaccine, completely untested on any subjects. You’re damn lucky it didn’t kill you.”</p> <p>“It destroyed my match with Nicky,” Marco said quietly. “So in one way at least they did destroy me.”</p><p>“So no memories have come back at all?”</p><p>“One or two—but nothing much.” Marco leaned forward eagerly. “Now that you know what it is, can you cure it? Is there anything you can do?”</p><p>The doctor shook his head sadly. “I’m afraid not. The virus that infected you has already gone—it swept through and flooded out certain aspects of the bloodmatch before your wolf antibodies did their job and rid your body of the virus. Unfortunately, it left damage in its wake. Those memories probably will never come back.”</p><p>Marco nodded his head slowly. “That’s what I was afraid you’d say. I dissolved my union with Nicky just yesterday.”</p><p>Dr. Cornsilk’s mouth fell open in shock. “You did what?”</p><p>“I dissolved my union with Nicky. We’re totally incompatible, Doctor. It wasn’t fair to keep him in a union that would never make him happy or fulfilled, and I owe it to my people to give them an alpha’s pet who is my true blood match. Perhaps now I can find my soul mate.”</p><p>“But Nicky is your soul mate!”</p> <p>Marco shook his head. “That’s what everyone tells me, but now that the bloodmatch is gone, we could see that we just weren’t compatible with each other. We fought all the time, and he would have ended up hating me—I couldn’t have stood that. So even though it was painful for us both, I had to let him go. Maybe he can find who he’s supposed to be with and find a little happiness.”</p><p>Cornsilk shook his head again vigorously. “No! He’s supposed to be with you, don’t you see? The blood match doesn’t produce the love—it only takes away the inhibitions, the prejudices—all the things that get in the way of a wolf recognizing his true love. His true soul mate.”</p><p>“I-I don’t understand.”</p><p>“Marco, Nicky is not the person you would have chosen for yourself. He’s very nicelooking, yes, but he’s also a man. Perhaps that wouldn’t have been your first choice. Also, forgive me, but your Nicky can be a bit...challenging. I think you, as an alpha wolf, would probably gravitate toward someone who would be more naturally submissive. Someone easier for you to control.”</p><p>“Exactly!” Marco exclaimed. “Nicky is a fucking loose cannon!”</p><p>“Perhaps that’s so, and that’s why your first inclination would have been to pass him by. But that would have been terribly wrong. The bloodmatch prevents you from ignoring or leaving him, and thereby ensures your ultimate happiness. It compels you to mate with him. Even though you might struggle against it, the bloodmatch is always true. Always perfect. You’re supposed to be with Nicky and if you’re not, then you’ll be doomed never to find happiness again.”</p><p>Marco sat in stunned silence. “Why have I never heard of any of this shit before? Why has no one ever explained it to me like this?”</p><p>The doctor shrugged. “Perhaps there was never a need before. You found your mate at a young age and seemed perfectly happy with him. Your parents probably never felt the need to explain further.”</p><p>Marco looked up with distress evident in his features. “I dissolved our union last night. I hurt him terribly, and I doubt that he’ll ever forgive me.”</p><p>The doctor stood up beside him and put a hand on his shoulder. “Perhaps you should try to talk to him. It may not be too late.”</p><p>“I-I don’t know what to do anymore. I’m so confused.” Marco stood up and shoved his hands in his pockets. “I feel like I’m being pulled in different directions, and no matter what I decide to do, someone will be hurt. I’ve hurt Nicky—I know that, and I can’t hurt him anymore.”</p><p>“You don’t think he’s hurting right now?” Marco spun around to face the angry voice behind him. Dr. Tate stood in the doorway.</p><p>“I’m putting you on notice, wolf. I’m going after him, and you better not get in my way. You may not want him anymore, but I do, and after all you’ve done to him, I don’t think he’d take you back even if you tried.” The doctor turned on his heel and walked away, leaving Marco staring after him, rigid with fury.</p><p>“Happy birthday, Evan,” Nicky smiled at his friend and handed him the gift he made for him. It was the painting he’d started of a wolf, standing outlined by the moon. A little paint had turned the silver fur into the darker fur of Brett’s wolf. Nicky wanted no reminders of Marco anywhere around him. It had been over three weeks since the dissolution, and his hatred for Marco had grown exponentially with each passing day.</p><p>He’d tried to avoid seeing him at all, scheduling his meals for times he knew Marco wouldn’t be around, and taking his feeding from Rory, even though the taste was not good to him, and he had to almost force himself to keep on. Marco had assured him he could continue to take his blood, but the thought of such an intimate connection with Marco made him shudder. He couldn’t—he wouldn’t be so close to him. The memories of other times when he’d fed from Marco, lying beside him on lazy Sundays warm and wrapped up in his body would surely kill him. No, he could never take blood from Marco again, just like he would never make love to Marco again. Never kiss his full lips or hold him as he lay between his thighs.</p><p>He shook himself and focused again on Evan, holding the package out to him. “I hope you like it,” he said shyly. Nicky loved to paint, but had never had the confidence he needed to market his work. Marco had promised him he would set up a gallery for him down in the town to showcase his work, but that was over now. He knew Marco would still do it, but he wanted nothing from him at this point. Nothing.</p><p>“Thank you so much, Nicky!” Evan was saying as he and Brett gazed down at the painting. “It’s so beautiful!”</p><p>“Glad you like it,” he said with a pleased smile and sat down at their table. Brett was giving his mate a small party in the main dining room, and at first Nicky thought about not going, afraid he might run into Marco. At the last minute though, he’d decided the hell with Marco. Evan was his friend.</p><p>“Please get some cake, Nicky. The dancing will start in a few minutes,” Brett told him, and Evan laughed softly.</p><p>“Brett knows how much I enjoy dancing. After the last time, he said he’ll be my partner from now on, though.”</p><p>The last time there was dancing in the main hall, Zack, Logan, Evan and Nicky had put on quite a show for their wolves, trying to make a point about their possessive natures. Marco had taken him to their rooms afterward and made love to him for hours. Nicky felt a flush come to his cheeks as the memory flashed through his mind. Damn it! Why did everything have to remind him of Marco? The thought that had been at the back of his mind since the dissolution came forward again. He had to leave here. He couldn’t stand much more of this. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nicky pasted a smile on his face as the slow music started and Brett spoke up again. “Yes, but this time, the music is softer, more slow and sexy. That way I can pull you up close and hold you all night long.” He put an arm around his mate and pulled him into a kiss, but Evan pushed him gently away, glancing over at Nicky and giving his mate a significant look. Brett dropped his arm and looked over at him. “Oh, sorry, Nicky.”</p><p>“For what? Don’t be silly, I’m fine.” God, I hate this! Everyone walking around me on eggshells, afraid to mention Marco’s name or show affection to each other in front of me. I hate this! I have to leave.</p><p>Logan and Ian came in and joined them at the table, and Logan kept up a steady chatter, so out of character for him. Nicky knew he was trying to keep his mind occupied with all this false cheer. Ian went for cake, and came back with a huge piece for Nicky, setting it down in front of him. Nicky smiled and pushed it around his plate with his fork. He’d had little appetite lately, even for the sweets he used to love.</p> <p>Logan, sitting beside him, noticed what he was doing. He whispered to him gently. “Nicky, you’ve lost so much weight. Please try to eat a little. I’m worried about you.”</p><p>Nicky pushed the cake away. “Don’t be. I know you mean well, but I’m fine, Logan.”</p><p>“You certainly are.” The voice coming from behind them made everyone at the table turn to look. Dr. Tate stood behind Nicky’s chair, looking down at him warmly. “Hi Nicky,” he said, gazing into his eyes. “Would you dance with me?”</p><p>Ian and Brett both tensed at the question, though since the dissolution there was nothing to keep Nicky from accepting the invitation. No stupid rules about touching another wolf’s mate. Not one damn thing, he thought furiously. He stood up and smiled. “I’d love to, Jeremy.”</p><p>As Jeremy led him on the floor, Marco walked in. Perfect timing. Fuck him! Marco’s eyes roamed over Nicky and then flashed to Jeremy Tate. Tate actually nodded at him with a little smile, but Nicky simply turned his head, not dropping it, just turning away in distaste. Why did the damn man have to look so good? He was wearing a dark brown shirt and tight jeans that hugged his body. He hadn’t shaved that morning, apparently, and the shadow of the beard on his face made him look dangerous and bad tempered. Well, that was true enough.</p> <p>Nicky felt Jeremy pull him into a close embrace, actually putting one hand low on his back, on his upper hip really, and used it to pull Nicky’s groin up tight to his. Nicky could feel the hard outline of his cock on his stomach, and he pulled his head back to gaze into Jeremy’s eyes.</p><p>“It’s all right, sweetheart,” Jeremy murmured to him. “Don’t let him intimidate you. He has nothing to say about this.”</p><p>Nicky laughed a bitter little laugh. “That never stopped him before. Don’t worry, I’ve never been afraid of him, and I won’t start now.” He allowed Jeremy to pull him along in a dirty dance with lots of grinding and groping of his ass. It did nothing for Nicky, but his desire to get on Marco’s nerves made him grind Jeremy back and run his hands over Jeremy’s shoulders. He glanced over at the table where Logan and Evan sat, and saw them both staring at him with fascination.</p><p>Feeling reckless, he whispered in Jeremy’s ear. “Let’s go outside to the patio, Jeremy. It’s getting a little close in here.”</p><p>Jeremy grinned down at him and led him outside, one hand wrapped possessively around Nicky’s waist. Nicky relaxed and let Jeremy steer him into the shadows of the patio. Once there, Jeremy put Nicky against the wall and began kissing him, long passionate kisses that were quite nice. Jeremy was very good-looking, Nicky thought. He wasn’t overly tall, like the wolves, only a few inches taller than Nicky. That made a nice change. His body was lean, yet powerful, and his muscles were compact and lovely. He seemed to be so sure of himself and his place in the world, something Nicky envied.</p><p>What would it be like to be a cherished partner again? To have Jeremy Tate love him? Perhaps it was time to truly move on. He leaned further into Jeremy’s kiss and Jeremy pulled his head back slightly and smiled down at him. “I told Marco not long ago that there were others who would snap up this beautiful prize. I’m ready to offer you all the love you’ll ever need, sweetheart.”</p> <p>A growl from behind them made them both turn to look. Nicky watched Jeremy suppress a smile. “Well, I wondered how long it would take you to follow us. Marco. Your claim on this man is over. No one wants you here.”</p><p>Marco grabbed his shoulder and ripped him away. Jeremy reeled back at his attack and fell on his ass, as Marco stepped protectively in front of Nicky.</p><p>“You gave up your right to protest this, Marco,” Jeremy yelled. “Get out of my way!”</p><p>Marco turned and seized Nicky possessively around his waist, hauling him to his side, still growling. “Get off my land, Tate, or I won’t be responsible. Leave now!”</p><p>Jeremy got to his feet and glared once at Marco before addressing Nicky directly. “I’ll be back, Nicky. Don’t let him do this. Stay strong.”</p><p>Jeremy pushed past them and disappeared inside. Nicky wanted to rail at Marco, but before he could say a word, Marco grabbed his hand and towed him behind him like a child as he walked determinedly into the nearby woods. When Marco first appeared behind Jeremy, Nicky had felt for a fleeting moment like he was cheating on Marco. How stupid was that? Marco had thrown him away, and he had no right to act like this.</p><p>Marco pulled Nicky along in the dark behind him, and Nicky started to seethe with anger. He dug in his heels and struggled against going forward. Marco stopped and stared down at him, and Nicky could see the wildness in his eyes. He recognized the look, and knew how close Marco’s beast must be to coming forth. Not a good thing, he thought, and shivered to see the beast so close to the surface.</p><p>Something told Nicky it would be wise not to fight Marco now, and besides, he didn’t want to, anyway. Making a sudden decision, Nicky turned his head and gave Marco his vulnerable throat, and it seemed to do the trick. Marco made a soft, growling, whining sound deep in his throat and pulled Nicky to him, wrapping his arms around his waist and burying his face in Nicky’s neck.</p> <p>He sank down on the ground with Nicky still clutched to his body and tucked him beneath it. He removed Nicky’s clothing with swift, impatient hands, throwing it aside on the trail. Then he sat up and divested himself of his own clothing, as Nicky watched him with a hungry gaze, wanting to devour every inch of the golden flesh he was uncovering. He didn’t care if Marco didn’t love him anymore. Marco’s thick shaft was gorgeous as it was revealed, a thick pearly drop of pre-cum seeping from his slit.</p><p>Nicky rolled up to his knees, wanting to possess that shaft, wanting to taste, to lick and touch. Marco gazed steadily at him as he came toward him, doing nothing but watching him with glowing eyes.</p><p>Nicky lowered his mouth, licking at the drops of pre-cum and tasting the sweetness of Marco’s seed. He heard Marco’s sharp intake of breath, but he was too absorbed in what he was doing to look at him. Taking hold of his cock, Nicky rubbed his hands over the pulsing flesh, feeling the heat and reveling in the silky softness of the skin covering his rigid shaft. He stuck his tongue directly into the slit and began to fuck it with his tongue, holding on tightly as Marco bucked his hips beneath him. His ragged breathing told Nicky he was fighting a losing battle for control. Knowing Marco as he did, he knew that probably every nerve ending in his body was screaming at him to throw Nicky on his back and take control, to dominate and possess him. He must be holding on by a slender thread.</p><p>Nicky smiled wickedly and engulfed his whole shaft with his mouth, taking him all the way down his throat, knowing Marco’s body intimately and what it took to drive him mad with passion. Marco’s hands came up to card through his hair and hold his head, encouraging him in his efforts. Nicky was hard as marble himself just from watching Marco struggle. He grasped his balls and gently kneaded them, enjoying the interesting sounds Marco was making. For a moment at least, Marco was his and he was right where he wanted to be.</p><p>From the common area, Nicky could hear the Bruno Mars song that was his favorite playing softly, providing a backdrop to this moment. Marco made a sound that Nicky had only rarely heard him make before, a keen, undulating cry and his hips thrust forward, as he came explosively, filling Nicky’s mouth and throat with his sweet essence. Nicky swallowed it down, holding his hips as Marco arched his back and shouted his release.</p><p>Nicky followed him seconds later, his excitement too great to contain. Nicky sank back on his heels, before leaning forward and kissing Marco, making him taste himself on Nicky’s lips. Then he was being lifted into strong arms and carried. Nicky buried his face against Marco’s chest and closed his eyes, never knowing when Marco entered a side door and carried him upstairs to their bed.</p><p>The next morning, Marco left Nicky lying curled up in their bed and slipped from the room. He’d been so out of control the night before, he had hardly known what he was doing. When he first walked into the common area and saw Tate dancing with Nicky, a red haze had covered his eyes. He’d clenched his fists as Tate pulled Nicky’s beautiful body up to his, so obscenely, and Marco had barely felt Ian’s hand on his arm or heard his voice, urging caution. When they’d drifted toward the door and Tate had taken Nicky’s hand to pull him outside, Marco had lost his mind with rage and charged toward the door.</p><p>Only Ian’s hand on his arm, restraining him, had stopped him for even a moment. “I tried to tell you, Marco. You can’t do this—Nicky doesn’t belong to you anymore.”</p><p>“The hell he doesn’t,” he’d growled and shook off Ian’s hand. By the time he’d gotten outside he was barely rational any longer. His beast had almost taken complete control. When he’d seen Nicky spread wantonly against the wall, and Tate running his hands over what belonged to him, it took everything he had not to kill the man where he stood. Somehow he’d kept from ripping out his throat and allowed him to leave before taking hold of his mate and pulling him to the woods. He had no clear idea of why he took Nicky there, except that his wolf was in charge and the need to run and rut with his mate was strong inside him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When his mate had pulled away, his wolf had turned on the smaller man and demanded his submission. When Nicky had offered his throat, he was able to relax a little, though his heart was still racing. He actually didn’t remember much of what happened next, but this morning when he awoke next to Nicky, his legs over his, and his hand holding his cock, he’d been surprised and a bit horrified. What had he done? He’d vowed never to take advantage of Nicky again—never to hurt him again. How could he have interfered as he did the night before? They had tried this and it didn’t work. No one could have tried harder than Nicky, and he would not hurt him again.</p><p>Still, he had to wonder if Nicky would give him another chance. Seeing him with Tate had shaken him badly, and he was very afraid Nicky had moved on in his mind. He wanted Nicky back, but what if Nicky wouldn’t have him now? He’d made love to him, but there was something missing—something sad and lonely and almost desperate in his face.</p><p>Confused and conflicted, only knowing he couldn’t leave Nicky again, because he simply wouldn’t have the strength, he got up and got dressed, leaving Nicky asleep in his bed. He needed to see Dr. Cornsilk again and have him explain it all to him one more time. He wanted the bloodmatch back, not because he needed it particularly. He was in love with Nicky, bloodmatch or no bloodmatch, and nothing would keep them apart again if he could help it. He knew that now. But he missed the closeness of the mind link, and he was furious that it had been taken from them.</p> <p>Regardless, he would do whatever it took, live whatever life Nicky would give him to be with Nicky, and nothing else mattered. The last three weeks without him had been torturous, catching only an occasional glimpse of him as he went about his business during the day. He’d noticed how pale he was in those rare glimpses, how much weight he’d lost, and he yearned to take care of him. He’d hoped he’d come to him for blood, but he went to Rory instead, preferring his blood to Marco’s, and Marco had been shocked at how much that had hurt. He hated himself more each day for dissolving their union, and he was determined to get Nicky back, in any capacity he would allow.</p><p>He went downstairs and directly to one of the trucks outside to drive into town. He needed to talk to Dr. Cornsilk, and try to settle his mind. He drove directly to the hospital and was happy to see the doctor’s car in the parking lot. He ran up the stairs, too impatient to wait for the elevator and went straight to his office. Cornsilk was sitting at his desk, working on something on the computer when Marco entered. He glanced up at him in surprise.</p><p>“Marco. What are you doing here so early? Are you all right? Has something happened?”</p><p>Marco strode over to his desk and leaned across it. “You have to help me, Doc, before it’s too late.”</p><p>He heard someone behind him and glanced back sharply to see Dr. Tate again, lounging against the doorframe like he had the last time he’d come to this office. Did the damn man just hang out in the halls and wait for him? Marco almost growled at him, but the doctor smiled a bitter little smile at him.</p> <p>“Forget it, Marco. It’s already too late. ‘Like the base Indian who threw a pearl away that was worth half his tribe...’ That’s a quote from the play Othello, Marco, a favorite of mine. You’re probably too damn dumb to know that, but it reminds me of you. Perfect, really. You threw Nicky away like he was garbage when I would have done anything to have him. Funny thing, though, he didn’t want me. He was too much in love with you. I called him this morning to check on him after you interrupted us last night. He told me he didn’t love me and never would. He said he was miserable living at the lodge, and seeing you everywhere he looked. So congratulations, you stupid werewolf bastard. Nicky’s gone. He’s left you and me both and said he wouldn’t tell anyone where he was going.”</p><p>Chapter Seven</p><p>Nicky looked out of the grimy window of the bus and let his head rest against the pane. He was tired and hungry, and thought he might get off at the next town he came to and find a place to eat and a place to sleep for a while. Before he left that morning, Logan had made him take money, though he hadn’t wanted to at the time.</p><p>“Take it, Nicky,” Logan had said, pressing a roll of hundred dollar bills in his hand. “I got it from Ian’s drawer—it’s pack money, and they owe you.”</p><p>“No, Logan, I don’t want anything from Marco. I just want to get out of here and never look back.”</p><p>“Fuck that. He owes it to you, and a lot more. I only wish I could talk you out of this. Can’t you just wait and talk to him? There must be some explanation for his leaving you this morning after what happened last night.”</p> <p>“Oh, I know the explanation. I was a booty call for him, no more, no less. His fucking ego is so big, he couldn’t stand the thought of Jeremy Tate taking something away from him. Then this morning when he thought about it, he had to take off before I got any ideas about the arrangement being permanent.” Nicky shook his head. “No, there’s no way I can stay here, Logan. Not with the way I feel. I’m too angry, too hurt. I wouldn’t be able to hide it, and it would disrupt the pack. I have a lot of friends in the pack, and I won’t stay here and cause that kind of emotional turmoil for everyone.”</p><p>“Stop worrying about everybody else. You know what will happen if you don’t drink blood from a wolf, Nicky. You’ll suffer...”</p><p>“Like I wouldn’t suffer if I stayed here? The more I think about what Marco has done to us...how he tossed me aside like I was nothing. Especially after last night—I hate him, Logan. I really do.”</p><p>“Are you trying to convince me or yourself?”</p><p>Nicky turned a flushed face toward Logan. “Does it really matter? I have to get away from him. I can’t stay here and watch him take up with someone else, while he denies me the same privilege. I won’t.”</p><p>Logan had driven him to the bus station at the foot of the mountain, and he had gotten on the first bus pulling out, which happened to be heading for Nashville, but he had gotten off once they stopped in the town of Franklin, only thirty miles away, to take on more passengers. He knew Ian would be able to get it out of Logan as to which bus he’d taken, so he decided to change buses in the small town. The first one out led to Georgia, the next state over, though this bus stopped in Gainesville, a fairly large town north of Atlanta, still in the foothills of the Appalachian mountains. Gainesville, Nicky remembered was not too far from where his friend Gabe lived, with his alpha mate, Zack.</p><p>He remembered Gabe telling him a story once about how he and Zack first met. Gabe had been a feral pet, having been bitten by a rogue wolf who had attacked him and his mother at a lonely roadside rest center. His mother had been killed in the attack and Gabe turned into a feral creature. He’d lived that way for over a year, turning into a vicious wolf-like creature at the full moon. That’s what happened when a bitten human didn’t take blood from a wolf. That’s what would happen to Nicky soon.</p><p>Gabe had traveled from town to town, living the life of a nomad, and going out to the woods, way up high away from popular trails when the sickness would come on him at the full moon. Nicky considered the idea of going up into the mountains very carefully. It would be difficult for anyone to find him up there if anyone was looking. Marco might, out of some sense of misguided responsibility. He refused to be a burden, a dependent that Marco kept around on sufferance in case he needed an outlet for his sexual needs. Fuck that.</p> <p>If he had to turn feral, then he would. No big deal—he could face it if Gabe had. He was a man and would face whatever he had to. It still beat the hell out of living like some half-ass mistress of Marco’s, his fuck toy. When he’d awakened that morning and found himself alone after spending the night in Marco’s bed, he had known he had to leave. The crushing disappointment would kill him next time. For a little while, he’d been able to fool himself, to think that maybe, just maybe, Marco was having second thoughts. To awake and find the bed cold and empty beside him told him everything he’d needed to know.</p><p>Maybe he would buy himself a tent and a few supplies and make his way up to the Georgia mountains for the next full moon. The next one was coming up in a week or so, and he might be facing the change. It had been a while since he’d fed from Rory and he hadn’t taken much then. Besides, the blood from a non-mate was never as potent as that of a mate. Yes, he would more than likely turn at this full moon, and he needed to be far away from people when he did. Nicky knew enough to know that the pain would be terrible, even killing. Some people didn’t survive it.</p><p>He didn’t much care whether he did or not, really. And if he died, then his body would be in the high, wild places he loved so well now. Maybe one day the wolves would come across his remains and devour him utterly, even to the marrow of his bones. He smiled to himself at the melodramatic turn his thoughts were taking him, but in a way, it really would be altogether fitting. It had a nice closure to it, a kind of symbolism. Yeah, maybe a tent and some supplies. He’d see about it tomorrow when he’d had a chance to rest.</p><p>Gabe climbed up in Zack’s big, heavy-duty pickup and settled himself in the seat with a sigh. He was on his way down the mountain to hang up missing person flyers for his friend Nicky, who had vanished, seemingly without a trace, almost three months before. Zack had been in close contact with the other friends he had at Nicky’s old home, and they told him how frantic and desperate Marco had been since Nicky went missing, how upset the entire pack was becoming over Nicky’s continued absence. Logan, in particular, felt guilty at having driven him down to the bus station, though Gabe knew how insistent Nicky could be when he wanted something.</p><p>Still, he was heartsick at the thought of how desperate Nicky must have been to have left, and he knew only too well what he was going through if he was still alive.</p><p>His mind turned away from the thought that Nicky might be dead. He wouldn’t believe it. Nicky was strong, and he’d be able to survive the feral change, just like Gabe had done. He hadn’t had the heart to tell Marco the entire truth, though, when he’d questioned him after Nicky left a few weeks earlier about exactly what happened during the change. One look at the misery on his handsome face, and he couldn’t tell him how painful it had really been, how much he wished he could die to get away from the near constant pain in his gut, even after the change was over. Gabe had done some heavy drinking and some drugs too, to try to ease that pain. Not to mention having lots of indiscriminate sex with whomever he happened to pick up in the bars he frequented. He assumed Nicky would do the same, and had tried to steer them all in that direction. Look in the bars, he’d told them—it was probably where Nicky would be found. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As he drove along the long driveway leading from their lodge, his cell phone rang, and he punched on the Bluetooth that Zack had insisted he use after the wreck he’d been in a year or so before. Not that the wreck had even been his fault, but Zack was a wolf, and the alpha at that. Over-protectiveness came with the territory. Zack’s voice came over the speakers in his dash.</p><p>“Hey, sweetheart. You got away without a kiss this morning. I just may have to spank you for that when I get my hands on you again.”</p><p>Gabe laughed. “Mmm, yes, please. I won’t be gone long, babe. I just wanted to put out these flyers for Nicky. Are you on your way to the mines?”</p> <p>“Yes, Jamie’s with me too. We’ve only just left, but we should get there around ten o’clock for our meeting with the foreman. Should be back home by this afternoon. Where are you going to put out the flyers?”</p><p>“I wanted to go by some of the bars in town, just to check and see if anyone has seen him.”</p><p>“Okay, but be careful, honey. I don’t like you in places like that.”</p><p>“Afraid I might get on the bar and start dancing again?” Gabe laughed. “No, I think my butt’s still sore over that one. I have no desire to repeat that punishment, thank you very much.”</p><p>Zack chuckled softly. “Now you’ve done it. My dick is hard as rock just thinking about that pretty little ass across my lap.”</p> <p>“Oh my God!” Gabe suddenly yelled, and he could hear Zack’s frantic shout.</p><p>“What’s the matter? Are you okay? Talk to me!”</p><p>“Zack, somebody just stepped out on the road in front of me. I think they’re trying to flag me down.”</p><p>“Run over them! Don’t you dare stop!” Zack said loudly, fear evident in his voice.</p><p>“No, it’s...oh my God, Zack, I think it’s—Nicky! He looks like Nicky—oh Jesus, he looks so...”</p><p>“I’m on my way to you, baby, but it will take about twenty minutes. Stall for time. Try to get him inside the truck.” Zack hung up with a clatter and Gabe slowed way down, rolling to a stop beside the figure that had darted back off the road and was now standing just outside the tree line. Gabe jumped from the truck and ran toward him, but the man who looked like Nicky put up his hands and growled slightly.</p> <p>“Stay back.”</p><p>Gabe slowed to a halt and stared at him. “Nicky? It’s me, Gabe.”</p><p>“I know who it is. Just please don’t touch me, Gabe. I’m filthy, and I-I don’t like being touched now.”</p><p>Gabe stood very still, looking at his friend. Nicky’s hair was long and shaggy. He had dark circles under his eyes, and he looked really dirty, with dirt caked even under his fingernails. He was trembling, and had lost twenty pounds at least, since the last time Gabe had seen him. He was still achingly beautiful, but he had a haunted look, and the sparkle that had always been such a huge part of him was gone, his eyes flat and lifeless, like a doll’s eyes.</p><p>“Nicky, please let me help you,” Gabe said softly, holding out a hand to him again.</p><p>He shied backward, but nodded. “Yes, I came for help. I, uh, I spent all the money I had, and I need more, Gabe. I was wondering if you could give me some.”</p><p>“Of course I will, Nicky. Let’s go back to the house, and ....”</p><p>“No! I can’t let Zack see me. I’ve been waiting around for three days now to try to find you alone. Zack will tell Marco, and he’ll come to get me out of some stupid sense of responsibility or duty, and I won’t be just a burden to him. A fucking millstone around his neck.”</p> <p>“No, Nicky, he’s been frantic and miserable since you left. He’s been searching everywhere. He loves you so much, Nicky.”</p><p>Nicky tilted his head and for a moment, Gabe saw hope in his eyes, just a faint glimmer, but then it was gone, almost as fast as it had come, leaving his eyes dull and hopeless again. He shook his head. “He feels bad about it all, of course. Feels responsible. Good. The son-of-a-bitch is responsible. I want him to suffer, like I have. I hate him!”</p><p>“No, Nicky, please come and sit in my truck. You look so tired. I can give you some money, or whatever you need. I’ll take you wherever you need to go. Come on, I’ll help you.”</p><p>Nicky hesitated, then took one step forward. Suddenly he froze and tipped his head in that same strange little way again. His eyes narrowed as he looked back at Gabe. “You’re trying to trick me! Your damn wolf is coming, isn’t he?” He backed away and would have melted back into the woods if not for Gabe’s excited cry.</p><p>“No, Nicky, wait! You’re right, Zack is coming. He was on the phone with me when I first saw you. But wait! You know they’ll shift and hunt you down. You could be hurt! Don’t run, Nicky, please. Just give up and come home with us.”</p><p>“No way, Gabe. I can’t go back! I’ll never go back!”</p><p>He turned and ran off into the woods, even though Gabe yelled frantically at him to return. Gabe peered into the bushes, wanting to run in after him, but knowing Zack would kill him for risking himself. Nicky was too unpredictable in his present state. He turned and ran back to the truck, and grabbed his phone. Scrolling through the numbers, he found the one he wanted and punched the number in with his hands shaking. “Marco, thank God you answered right away. It’s Nicky! I’ve seen him, and you need to get down here right away!”</p><p>Knowing he didn’t have much time before Zack and the other wolves would be after him, Nicky ran straight for the nearby stream he’d gotten a drink of water from earlieri. He ran straight down the middle of the freezing stream for as long as he could, stumbling and falling over the rocky bed, hoping to drown out his scent. Finally, when the stream widened and got deeper, he was forced to climb out on the steep bank and head into the deep woods. Exhausted, he had to stop and rest frequently, but he knew he had to keep running and get as far away as he could from the place he’d stopped to talk to Gabe on the road. Not only was Zack and the rest of his pack sure to be hot on his trail, but by this time, he knew Gabe had called Marco.</p><p>By nightfall, Nicky was dead on his feet. He’d been afraid to go back to his campsite, high in the mountains of the state park, near Gabe and Zack’s home. He made camp there two weeks ago, and this had been the first time he’d come down in all that time. He was out of most everything, but especially liquor and drugs. Food didn’t mean too much to him anymore, but he had to have something to help dull the almost constant pain in his gut. He had scored some Oxy just before he climbed up to his camp site, using almost the last of his money. Gabe had told him how bad the pain would be and he’d wanted to be ready. Now that was gone, along with the last of his booze, and he wasn’t sure what he was going to do next. He’d thought Gabe would help him, not rat him out to his wolf. Damn submissive bastard! He would have thought that Gabe, of all people, would have sympathy for him, knowing what he was going through.</p><p>The change had come on just three nights after he’d made his camp. He had felt prickly all over that afternoon, and as the evening came on, his bones began to ache and grow stiff. When the change finally came over him, it was quick, just one moment or so of the most intense pain. Pain so horrible it took him to his knees and he lost consciousness for a few minutes. He woke up to a feeling of rage. A bestial sound that he recognized as a growl forced itself past his lips, and when he opened his mouth to gasp in shock, a wolf-like whine issued forth, inhuman and brutish. Getting up on his knees, he let his head fall back and a loud howl issued from his mouth. The howl reverberated through the hills around him and filled him with satisfaction. He looked around at his surroundings and realized he wasn’t seeing in color anymore, yet his vision was sharp and bright.</p><p>He tore off his constricting clothing, which was suddenly too tight, the shirt choking him. His body had morphed into something not quite human. He still had a human shape, but his face felt wrong. He raised a hand and saw long, inhuman claws on his fingers in place of nails. He moved those fingers to his face and felt a snout where his mouth had been. For a moment, blind panic filled him, and he ran around in circles, whining and making terrifying animal-like noises. Finally he managed to calm down, and remember that he wouldn’t stay this way when daylight came. Gabe had assured him he would change back.</p><p>He grabbed onto the idea, which soothed him enough that he was able to drop back down to all fours, still panting in fear, but managing to stay calmer than before. After a few minutes, he was able to crawl into his tent, and stay there the rest of the night, though the moonlight still kept up its siren call. He had enough humanity left to know he was too close to people to heed it. If he ran into someone on the trails...in the moonlight...his mind shied away from what he might do.</p><p>Instead he took all of his fear and rage and focused it on one person—one man whom he hated above all others—Marco. Marco had done this to him. He had taken away his life nearly two years ago and created this monstrous thing that he now was. Then when he’d tired of him, he’d thrown him away like a broken toy. Fury swept over him and all he could think of was killing Marco, slowly and torturously. All night he stoked the fiery anger and toward dawn he finally fell into an exhausted sleep. When he woke up, hours later, his body had resumed its prior form. That had been two weeks ago, and his determination and resolve to stay away from Marco hadn’t faltered since.</p><p>Now as he sat on a rock by the trail, trying desperately to catch his breath, he thought again about how much his life had changed in such a short time. He’d be damned if he was going to crawl back to Marco now or ever. He’d make his way back to Atlanta just as soon as the next full moon was done and over with, and peddle his ass on the street if he had to. Whatever it took. Anything to get the drugs and alcohol he would need to be able to survive.</p><p>He heard a distant howl and pricked up his ears. Another howl answered from a different direction. Wolves! They were calling to each other. Could they have already picked up his trail? Shit! Lurching to his feet, he began to run, looking back over his shoulder, scared to death that he would see one of them coming after him, hunting him down. His shoes, wet completely through, squished in a nasty way on his feet and his jeans, which were wet through to the knee, clung to his skin like leeches. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Only escape was on his mind at that moment. He stopped his headlong flight for a moment and tried to picture the trail maps he’d studied when he first came up here. Actually, they had made little sense to him, and he’d probably been a little drunk at the time. He gnawed at his lip.</p><p>Hearing a noise off to his left, he whirled around and saw a huge silver wolf stalking him through the trees, coming right for him. He was unable to stifle the scream that tore from his throat. He looked around him for a weapon, but nothing came to hand. He turned to run, expecting to be taken down at any moment, and he wasn’t disappointed. A powerful blow to his back took him to his knees. He twisted wildly, throwing his hands up over his face. He felt the hot breath on his throat, as he took one last deep shuddering breath and then everything faded to black.</p><p>He awoke minutes later to find himself lying on his back, his hands tied in front of him with the rags of his own shirt. Looming over him, Marco stood looking down into his face, as naked as the day he was born, his body every bit as beautiful as Nicky remembered.</p> <p>“Let me go!” Nicky kicked out with his feet, but Marco simply stepped back out of reach. “No,” he said quietly. “Settle down, Nicky. We need to talk.”</p><p>“I have nothing to say to you! I hate you!” Nicky turned his face to the side, trying not to look at Marco’s beautiful body.</p><p>“I’m sorry to hear that, baby. I love you,” Marco said softly.</p><p>“Bullshit! Don’t try to hand me that crap. It won’t work anymore.” He began to struggle wildly, pulling at the rags on his hands and kicking out with his feet again. Marco knelt beside him and put a hand on Nicky’s chin, turning his face toward him. “Stop it. I’m not letting you go, and you’ll just hurt yourself.”</p><p>Breathing hard, Nicky subsided, but glared hard at Marco before he rasped out one word. “Why?”</p> <p>“Why what?”</p><p>“Why do you want to take me back? Is it to make yourself look better to everyone? Like you’re so generous you let me stay even though you don’t want me anymore?”</p><p>“I do want you. I was a fool to let you go. I love you, Nicky, and I always will.”</p><p>“Yeah sure, you love me so much you asked me to dissolve our union.”</p><p>“I was wrong, baby. So wrong. If you’ll give me a chance, I’ll spend the rest of our lives making it up to you.” Falling to his knees beside him he cupped Nicky’s cheek in his hand and kissed him firmly, but very gently. Even that much contact was enough to make Marco moan with desire. To his surprise, Nicky moaned too, but softly and almost reluctantly, as if the sound were being wrung from him.</p><p>With his other hand, Marco reached for the bulge in Nicky’s pants, stroking his cock through the material. Nicky tried to pull his mouth away, but Marco followed his every move, teasing his lips with his tongue. “I love you,” Marco whispered against his lips again and again Nicky sighed. His mouth fell open and he welcomed Marco’s tongue inside, meeting it with his own. Marco unzipped Nicky’s jeans, and slipped his hand inside freeing his cock. Dizzy with desire, Nicky allowed him to stroke his shaft and pushed up into his hand. Marco lay across his body, angling so that his rock hard cock rubbed alongside Nicky’s. His hand moved inside his pants and down to cup Nicky’s balls. He dipped down further to tease his rim. Nicky gasped and bucked against him.</p> <p>Keeping his gaze on Nicky’s, he put his fingers in his mouth, wetting them thoroughly before dipping one back inside Nicky’s tight hole. A few seconds later, a second finger joined the first and started moving up, searching for the spot Marco knew how to find only too well. When he found it, Nicky cried out, waves of pleasure washing over him. He pushed down on Marco’s fingers, wanting more fullness, more stimulation. Meanwhile his cock was sliding against Marco’s other palm, driving him seriously out of his mind. He couldn’t decide which way to thrust, whether to push forward or back. His mind swirling with pleasure, he felt his orgasm clawing at him. He lifted his ass up off the ground as he came, screaming out Marco’s name.</p><p>Marco fell over on top of him and nuzzled his face in his throat, trying to catch his breath. Suddenly he stiffened, seeming to hear some sound that Nicky couldn’t hear, and he quickly raised himself up from Nicky’s body, bending over to tuck Nicky back inside his pants and tug up the zipper. He pulled him up to his feet then and up against his side, hiding his erection. Nicky was glad for his arm around him so tightly. He didn’t think his knees would have held him up otherwise. He saw Ian and Zack emerge from the trees, back in their human forms, and he lowered his head, not willing to meet either man’s concerned gaze, and a little embarrassed at their nudity. They must have only shifted back moments before.</p><p>Marco turned him around in his arms and held his face against his chest. Nicky’s mind was in a whirl. He heard the excited voices of the men around him, but he felt himself fading. He was so tired, so worn out. Blackness crept up in his peripheral vision, but shied away when he tried to focus on it. His legs sagged a little more, and soon he felt Marco’s arm go under his knees and his body was picked up and held tightly to his chest. Only then did he allow himself to sink deeper and deeper into the blackness that was coming for him.</p><p>Nicky was furious. Since he awakened, he’d been trying desperately to escape, fighting everyone, and now he was sitting exhausted in a room with Gabe, his wrists in Gabe’s fur-lined cuffs. He was cuffed because he kept trying to wreck the room before they restrained him. His ankles were bound too, because he was still trying to get up and run. Gabe looked over at him nervously. “Nicky, I wish you’d try to eat something.”</p><p>“I want a drink, Gabe. I keep telling you I need a drink. Take these fucking cuffs off me and let me go.”</p><p>“Damn it, Nicky, you know I can’t do that.” Gabe indicated the tray next to Nicky on the table. “I got you some beer though. See, doesn’t it look good? I know you must be hungry. A bottle of beer and a variety of meats. Wouldn’t that be good?”</p><p>Nicky sneered at him. “Sounds like the working title of your memoirs, Gabe.”</p><p>Gabe smiled. “Very funny, Nicky. You always did have a way with words. Yes, actually it could well be the story of my life before I met Zack. I know you must be feeling better if you’re cracking on me.”</p> <p>“I don’t feel better! I feel like shit! I need a drink, Gabe, and not a beer. Damn it, my stomach hurts! You must remember how that is—only some tequila or some vodka will help make it bearable. That or drugs. Morphine or Oxy would do it...but I’ll take what you got.”</p><p>“I don’t have any drugs, Nicky. Marco’s blood would help you, if you’d let him feed you more instead of fighting him so hard.”</p><p>“Bullshit. I don’t want to drink from Marco, or see him or even be in the same room as him, I told you. Please Gabe, let me go. I’ll never bother you again. You don’t have to give me any money, or anything. Just let me go.”</p><p>“You’re not going anywhere except back home where you belong,” Marco’s voice sounded behind them at the door.</p><p>Nicky bit his bottom lip and turned his head sharply to the side, looking down at the floor. “You gave up your right to make that decision for me,” Nicky said softly.</p><p>Marco came in and sat down in front of Nicky on the sofa. Gabe patted Marco’s shoulder and got up to slip out the door, leaving Nicky and Marco alone in the room. Marco said nothing more, just folded his arms across his chest and watched Nicky’s face carefully. Nicky glanced up at him furiously from beneath his lashes. He’d be damned if he’d say anything to the bastard. What the hell was he thinking, sitting there looking all big and bad. Damn wolf! Why did he have to be so gorgeous, and why did Nicky still love the bastard so much?</p><p>Marco thought Nicky looked dirty and disheveled. He had shadows under his eyes and badly needed a shave and a haircut, and was way too thin. God, he was absolutely fucking gorgeous, and Marco could barely keep his hands off him. He couldn’t get enough of looking at him, and was content to sit there most of the night if he had to, determined to wait Nicky out. He was dying to feed him again, anything to make him feel useful, like he was doing something for his mate. The strong protective urges were driving him crazy, but Nicky was right. He’d given up any rights he had over him, and now all he could do was hope and pray that Nicky could forgive him and take him back.</p><p>When he got the word that Nicky had been found, it was like waking up from a terrible nightmare that wouldn’t end. From the time he found out Nicky was missing, he’d been searching everywhere for him, driving everyone crazy until they came up with fresh ways to try to find him. He had hardly slept from worrying about where Nicky was sleeping, and could barely eat for worrying that Nicky was going hungry. Scouring the nearby hospitals, police departments, and even the morgues, he dreaded what he might find, but had turned up nothing. He didn’t need anyone to tell him what an idiot he’d been because he’d spent the last three months calling himself every kind of fool.</p><p>He had castigated, reproved, and mistreated himself until even Logan and Evan had begun to feel sorry for him. Then, that morning when the call came from Zack, he could hardly believe it. Ian and Logan had driven him to Zack’s lodge, because he was shaking so badly he didn’t trust himself behind the wheel. That and the fact that Logan would have killed him if he hadn’t brought him along.</p><p>The others had already been out searching for him when they arrived, so leaving Logan with Gabe, Marco and Ian both shifted and ran off into the woods. They’d located the search party soon enough, consisting of Zack, his beta, Jamie, and three more of his gammas. They discovered that it had taken about an hour to get back to the lodge and form a search party after Gabe had seen Nicky. When they got on the scene they soon found that Nicky had evaded immediate capture by running through a stream for a while. It had taken them almost another hour to pick up his trail. It had been sheer luck that Marco, so in tune with Nicky’s sweet scent, had stumbled across it right away on an outcropping of rock off the trail where he’d stopped to rest. Finding him after that was only a matter of minutes. When he’d taken him down, he was still in his wolf form and had sensed Nicky’s fear and anger just before he passed out. Marco had quickly shifted back and tied his ex-lover’s hands. What happened next he would never regret and couldn’t have stopped no matter what. His only hope was that Nicky would forgive him enough to come home with him. He had certainly seemed responsive, even if it seemed almost against his will. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As he sat across from Nicky on the sofa, he wondered just how angry Nicky still was. Nicky kept his head turned away, but Marco could see him sneaking little glances, moving just his eyes. Finally, he blew out a long breath. “Well, damn it. Say something. I’m not getting any younger here.”</p><p>“There’s not much to say, sweetheart, except I love you very much, and I want you to come home.”</p><p>“Oh, just like that, huh? Suddenly you love me, after making my life miserable for months. And for nearly two years before that?”</p> <p>“Yes.”</p><p>Nicky shot him a hot, furious glance. “Well, tough shit. I don’t love you.”</p><p>Marco nodded thoughtfully. “All right, baby.”</p><p>“Don’t fucking ‘baby’ me! I don’t!”</p><p>“I said, all right.”</p> <p>“Well, what the hell does that mean? I’m not going back with you, you know. You can’t make me.”</p><p>“Now, baby, we both know I can make you if I want to—stop talking foolishness.”</p><p>Nicky blew out a long breath. “Damn you, Marco. I won’t go home with you!”</p><p>“Yes, Nicky, you will. At least for now. I’m trying to give you time to get used to me again, before I take those cuffs off, take you in the bathroom and give you a good bath, which you badly need, by the way. Then I’m going to wrap you up in a blanket and you’re going to ride in my lap all the way home. I’ll probably kiss you most of the way, too, so get ready for that, because I love you even if you don’t love me, and I’m never going to stop.”</p><p>“I-I...damn you, Marco, why won’t you listen to me?”</p><p>“Because I want to do what’s best for you, and Zack said your mind was clouded with alcohol and drugs, so I think I know what you really need right now, darling.”</p> <p>Nicky made a scoffing sound. “You don’t know the location of your own asshole.”</p><p>Marco smiled and shrugged. “As a matter of fact, I do. Yours too, for that matter.”</p><p>Nicky’s lips twitched, but he still refused to look directly at Marco.</p><p>Marco tried again. “I’m not trying to boss you, darling, and I am listening, but right now, you’re not making a lot of sense. Once you’re home and rested and you’re back to your normal self again, you can make decisions about whether or not you’ll forgive me and let me spend the rest of our lives trying to make all this up to you.” He held up a hand as Nicky started to sputter out a protest. “I know, I can never make this up to you, but I want to try. Just give me a chance, that’s all I ask. Just one chance! I want to hold you in my arms and try to explain how terribly mixed up I was, and how stupid and pigheaded I was too.”</p><p>“I don’t believe a damn word of this,” Nicky said, shaking his head. “You want to control me, possess me again. I tried to do that for you in the past, because I loved you so much. I knew better even at the beginning—I knew I was doing the wrong thing by letting you boss me around so much, by allowing you to think you controlled me because you’re bigger than I am. But I was trying to make you happy, and all it did was drive us further apart.”</p><p>“I know that now.” Marco hesitated, trying to find the words to make him see how it was. How he’d taken love, true love, pure, beautiful love and treated it as if it were his right. By trying so hard to control Nicky’s exuberance, his lovely free spirit, he tried to destroy the very thing that was so unique about Nicky, the thing that had attracted him in the first place. “I know I was selfish, Nicky. I tried to force you to stay with me from the beginning, keeping you tied down to keep you with me. I was terrified you’d leave me, but too damn macho to admit it. All those times you ran away from me only made it worse. I was determined to own you, to mark you as mine in some way. I didn’t trust that you could stay because you loved me as much I loved you.”</p><p>Nicky turned bitter eyes toward him. “Why is that, Marco? Have you never looked in a mirror before?”</p><p>He shook his head doggedly. “I know all that,” he said, brushing it aside as if it were unimportant. “But I’ve never been like you, baby, so free and complete within yourself. You know exactly who you are and what you’re worth. People love you Nicky, really love you. It’s because you’re beautiful inside as well as outside. They follow me because of tradition and fear, not out of any kind of love.”</p> <p>“That’s not even true, so stop feeling so sorry for yourself,” Nicky said sharply. “They love you as much as you let them. You’re not always easy to love.”</p><p>Marco sat listening to him, nodding and accepting what he said, not getting angry about it as he might have done in the past. Nicky looked at Marco for the first time as if he might believe Marco had truly changed in some way.</p><p>Marco spoke again, desperate to make Nicky understand. “I really didn’t remember you at first, baby, but it didn’t take me long to fall in love with you all over again. That scared me so damn bad I didn’t know what to do.”</p><p>Nicky was watching him, seeming to be fascinated, despite himself.</p><p>“Why?” he whispered.</p><p>“Because you were so beautiful and sweet and funny, and I could see how much everybody loved you. Right from the beginning I was so jealous. You were mine, but everyone wanted a piece of you. Even that damn doctor. I didn’t know how much you loved me then. Memories kept coming back of times you ran away and left me, and I thought it was only a matter of time before you left me again. So I-I think I pushed you away, to see what would happen, and at first you kept coming back. No matter how much I asked of you, you kept coming. So I thought, yes, I can hold him with his love. I can use his love against him and keep him just for myself. Of course, it was never enough, so I kept pushing. I suggested dissolution, kind of as a test, maybe even, God help me, a threat, But you agreed. I thought, okay, there it was. I had been waiting for the other shoe to drop and there it fucking was. The minute you left my office that night I knew what a terrible mistake I’d made and what a colossal fool I was.”</p><p>“Yes,” Nicky said bitterly. “You are.”</p><p>“I admit it. Dr. Cornsilk tried to make me understand, and I thought I finally did. I was coming to talk to you at the party for Evan and then he was there. Jeremy Tate, putting his hands and his mouth on you. And you let him! Damn, it almost killed me. I had to make you mine again. I knew we were meant to be together, and the hell with any bloodmatch.”</p><p>“No, Nicky said, shaking his head. “When I woke up, you were gone. I was just a booty call to you.”</p><p>“Baby, you’re not ‘just’ anything to me. I left to go talk to the doctor to see if there was any way I could get the bloodmatch back—to be even closer to you than I already felt. I thought maybe if we could link our minds again I could make you see how sorry I was for everything. Maybe then I could talk you into staying with me. I was coming back that morning to tell you how much I loved you and to beg you to come back to me. Then I got the news that you had left me.” Marco sank down on his knees in front of Nicky and gently took his hand in both of his. “Please come back home to me, darling. I promise you I’ll change.”</p><p>Nicky glanced down at him, making a soft little “Humph” sound. He seemed to be thinking things over furiously. Marco could almost see the thoughts tumbling through his head. Marco waited him out quietly, holding his breath.</p><p>“If I agreed to come back...and that’s a big if...I won’t come back as your little slave.”</p><p>“Agreed,” Marco said quickly.</p><p>“I might not even live with you right away...well, at least I wouldn’t sleep in the same room. Well, probably.”</p><p>“Okay,” Marco said softly. “I understand.”</p><p>“We’d have to be married again immediately, and in front of the entire pack.” Nicky said, pointing his finger in Marco’s face. “You took away all my status with the pack as the alpha’s pet, and those things are important to wolves. Stupid, but the wolves respond to it. I won’t come back otherwise.”</p><p>A huge grin split Marco’s face. “Yes, darling.”</p><p>“It doesn’t mean I’ve forgiven you, either. I may never forgive you. You may have to spend the rest of our lives together doing major sucking up.”</p><p>“Of course.” Marco nodded. “I will.”</p><p>Nicky sighed deeply, like a tired child. “All right. You can take off these cuffs and take me to the bathroom. I want a shower though. Alone. No tubs.”</p><p>“Of course,” Marco said again, springing over to undo his cuffs and release him, then standing back up and holding out a hand to him. “Are we okay, then, Nicky? Just a little?”</p><p>Nicky stood up and glared at Marco, but Marco pressed up against him and tried to kiss him on the neck. “Will you let me make it up to you? Are we done with this?”</p><p>Nicky pushed him back and gave him an icy stare before he reached out and grabbed Marco by the balls and squeezed hard, almost bringing him to his knees. “We’re done when I say we’re done.” He pulled down on Marco’s balls until he sank lower to bring his face on a level with Nicky’s. “And we’re not done!”</p><p>Marco closed his eyes and sighed. “Oh, thank God,” he said, and Nicky smiled.</p><p>*The End* </p> </body></html>"]