["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Veins of lightning lit the clouds, dancing whips of white-hot energy illuminating the midnight sky. The earth rumbled and rolled, unsettled and flinching as the creature clawed its way through the soil to burst into the air, instantly fouling every living thing it touched.</p><p>Leaves shriveled and blackened. The air vibrated with alarm. The vampire settled to earth, turning its head this way and that, listening, waiting, its cunning mind racing, its rotten heart beating with a mixture of triumph and fear. He was the bait, and he knew the hunter was not far behind, close on his trail, drawn straight into the heart of the trap.</p><p>Traian Trigovise burrowed through the soil, following the stench of the undead. It was too easy, the trail too well marked. No vampire would be so obvious unless he was a rank fledgling, and Traian was certain he was dealing with strength and cunning. He was an ancient Carpathian hunter, a species nearly immortal, blessed and cursed with longevity, with timeless gifts and the need for a lifemate to make him complete. He was first and foremost a predator, capable of becoming the most loathsome and evil of all creatures, the un-dead. It was his sheer strength of will and duty to his race that kept him from falling prey to the insidious whispers and call of power.</p><p>When the tunnel veered upward toward the sky, Traian continued onward, pushing deeper into the dirt, feeling his way, listening to the heartbeat and energy of the earth around him. All was silent, even the insects, creatures often summoned by the evil ones. He scanned the surface, taking in a large area, and discovered three blank spots, evidence that more than one vampire was close.</p> <p>He found a web of roots, thick and gnarled, humming with life, reaching deep into the earth. He whispered softly, respectfully, touching the longest, deepest artery, feeling its life force. He chanted softly in the ancient language, asking for entrance, felt the response moving through the thick old tree. Leaves shivered as the tree reached toward the moon, embracing the night even as it shrank from the presence of the foul beings. Imparting secrets and conspiring to help, the tree spread its roots to allow Traian into the intricate system protecting and nourishing the wide trunk.</p><p>The hunter was careful not to disturb the soil or the root system as he maneuvered his way carefully through the labyrinth, pushing through the surface just far enough to scan his surroundings from inside the cage of safety of the overlapping roots above ground. He shape-shifted as he emerged, a shadow hidden amongst the thick branches and leaves.</p><p>For one moment he could see only his prey, the tall, thin figure of Gallent. He recognized the vampire as one of the ancients sent out by their prince so many centuries earlier, just as he had been. The undead continually twisted, sniffing the air suspiciously, his gaze darting along the ground. He clicked his long fingernails together in a peculiar repeated rhythm.</p><p>The wind rushed through the grove of trees, and the leaves rustled and whispered. Traian allowed his gaze to shift, quartering the area, searching with his mind more than his acute vision. The breeze brought the echo of that strange rhythm to him, coming from his left. Then from his right. Two more of the undead waited to fall upon him and rip him to pieces. He shifted again, drifting with the breeze through the cage of roots, rising as molecules into the night, allowing the friendly wind to take him higher into the cover of leaves.</p><p>Dark clouds swirled into a boiling cauldron. Lightning veined the murky, spinning mass. He hovered there with a small, humorless smile in his mind. Discretion really was the better part of valor in some circumstances. He would pick his own battleground. Then he heard the clicking of the fingernails again. The sound was growing louder. With each click, droplets of water fell from the cloud. Tiny droplets that never quite reached the ground. The beads collected in midair, formed a large, shimmering pool. He could see his reflection clearly in the pool. Not the scattered molecules, or an illusion, but the real man amongst the leaves. It was his only warning, and it came just a heartbeat before the attack.</p> <p>He caught movement from the corner of his eye and instantly reacted, somersaulting through the sky, shifting into his true form, grateful for the leaves that hampered the nearly invisible silvery net meant to entangle him. Spears spiraled through the air, along with tiny darts tipped with poison from the tree frog, and showers of red-hot embers that burrowed into the skin and burned for weeks. Insects clouded the skies, and all the while the clicking of the fingernails went on relentlessly.</p><p>Traian launched himself at the shadowy figure orchestrating the fight, ignoring the two lesser vampires. Gallent was directing the action, a leader in evil, as he had been a leader among Carpathians. Traian burst through the sky, his fist already snapping out, driving toward the vampire's chest.</p><p>Gallent shimmered transparently. The fist passed through his body harmlessly even as the undead struck back with razor-sharp talons. The hand came from Traian's left, the swift, sure movement of a full-fledged master. The knifelike nails drove deep through flesh and muscle, all the way to the bone. One of the lesser vampires hurled himself onto Traian's back, sinking his teeth into his target's exposed neck.</p><p>Traian simply evaporated, leaving the smear of blood on the shivering leaves and the scent of the ancient gift driving the vampires into a frenzy of rage and hunger. He traveled quickly through the night. The Carpathian Mountains were riddled with networks of caves, where rich soil deep beneath the earth waited to welcome him. He was close to home. He had been steadily traveling back to his homeland to see his prince but had become sidetracked when he came across the vampires.</p><p>His shoulder throbbed and burned. His neck was a fierce torment. There were a hundred places on his body that ached from the embers and darts. He found an opening into the cool interior of the mountain, went deeper still, through a labyrinth of tunnels into the earth. He floated down into the bed of rich soil and just lay there, feeling a sense of peace and solace in the wealth of welcoming minerals.</p><p>Austria</p> <p>The theater doors opened to allow the smartly dressed crowd out. They emerged laughing and talking, a crush of happy people pleased with the performance they had witnessed. Lightning forked across the sky, a brilliant, dazzling display of elemental nature. For a moment the long, sequined gowns, furs, and suits of varying color were lit up as if caught in a spotlight. Thunder crashed directly overhead, and the ground and buildings shook under the assault. The light faded, leaving the night nearly black and the crowd almost blind. The throng broke into couples or groups, hurrying to their limousines and cars, while valets tried to work fast before the rain began to fall.</p><p>Senator Thomas Goodvine stayed beneath the entrance archway, bending his head toward his wife to hear her over the buzz of the crowd, laughing at her softly spoken words, nodding in agreement. He pulled her beneath his shoulder to prevent her from being jostled by the steady stream of people hurrying to avoid the weather.</p><p>Two trees formed the unique archway to the theater, the branches interlocking overhead to form a small protection against the elements. The leaves rustled and the branches clicked together in the rushing wind. Clouds whirled and spun, weaving dark, ominous threads across the moon.</p><p>Another burst of lightning illuminated two large men pushing against the stream of theatergoers, apparently determined to gain shelter in the building. The flash of light faded, leaving only the dim lighting of the archway and the streetlights flickering ominously. Thelma Good-vine tugged at her husband's jacket to bring his attention back to her.</p><p>\"Down! Get down!\" Joie Sanders plowed into the senator and his wife, her arms outspread, sweeping them both to the ground. In one move she rolled up on her knee in front of them, a gun in her outstretched hand. \"Gun, gun, everybody down!\" she shouted. An orange-red flame burst from two revolvers in a steady stream toward the couple she'd been assigned to protect. Joie returned fire with her usual calm and dead-on accuracy, watching one man begin to topple, almost in slow motion, his gun still firing but up into the air.</p><p>People screamed, ran in every direction, fell to the ground, crouched behind flimsy cover. The second gunman grabbed a woman in a long fur and dragged her in front of him as a shield. Joie was already pushing at the senator and his wife in an effort to get them to crawl back inside the relative safety of the theater. The second gunman propelled the sobbing woman forward as he fired at Joie, who rolled again to cover her charges' line of retreat.</p><p>A bullet sliced through the flesh of her shoulder, burning a path of pain and spraying blood over the senator's trousers. Joie cried out, but steadied her aim, ignoring the churning in her stomach. Her world narrowed to one man, one target. She squeezed the trigger slowly, precisely, watched the ugly little hole blossom in the middle of the man's forehead. He went down like a rock, taking his hostage with him, falling in a tangle of arms and legs.</p><p>There was a small silence. Only the clicking of the branches could be heard, a strange, disquieting rhythm. Joie blinked, trying to clear her vision. She seemed to be looking into a large, shimmering pool, staring at a man with flat, cold eyes and something metal glinting in his hand. He rose up out of the crowd, slamming into Joie before she could scramble out of the way. She twisted just enough to escape the lethal blade, driving the butt of her gun upward into his jaw, then slamming it back down on his knife hand. He screamed, dropping the blade so that it went skittering along the sidewalk. His fist found her face, driving her backward. The man followed her down, his face a mask of hatred.</p> <p>Something hit the back of his head hard, and Joie found herself staring up at one of her men. \"Thanks, John. I think he smashed every bone in my body when he fell on me.\" She took his hand, allowed him to help her out from under the large body. Joie kicked the gun from the limp hand of the first man she'd shot, even as weakness overwhelmed her.</p><p>She sat down abruptly as her legs turned to rubber. \"Get the senator and Mrs. Goodvine to safety, John.\" The wailing sirens were fading in and out. \"Someone help that poor woman up.\"</p><p>\"We've got it, Joie,\" one of the agents assured her. \"We have the driver. How bad are you hurt? How many hits did you take? Give me your gun.\"</p><p>Joie looked down at the gun in her hand and noted with surprise she was aiming it at the motionless attacker. \"Thanks, Robert. I think I'll just let you and John handle things for a while.\"</p><p>\"Is she all right?\" She could hear the senator's anxious voice. \"Sanders? Are you hurt? I don't want to just leave her there; where are you taking us?\"</p><p>Joie tried to lift her arm to indicate she was fine, but her arm seemed heavy and uncooperative. She closed her eyes and breathed deeply. She just needed to be somewhere else, just for a short time while the medics fixed her up. It wasn't the first time she'd taken a hit and she doubted it would be the last. She had certain instincts that had taken her to the top of her profession. It was very dangerous at the top.</p><p>Joie could blend in. Some of the men liked to call her the chameleon. She could look strikingly beautiful, plain, or just average. She could blend in with the tough crowd, the homeless, or the rich and glamorous. It was a valuable gift, and she used it willingly. She was called in for the difficult assignments, the ones where action was inevitable. Few others had her skill with knives or guns, and no one could disappear into a crowd the way she could.</p><p>She took herself out of her body, watched the frantic scene around her with interest for a few minutes. The others assigned to the senator and the Austrian agents had everything under control. She was being put into an ambulance and hustled away from the scene. More than anything, she detested hospitals. She simply took herself away, soaring free. She wanted to be outdoors, under the sky or beneath the earth in a world of subterranean beauty - it didn't matter, as long as it wasn't within the walls of a hospital.</p><p>Joie felt weightless, free, skimming through the mountains she had studied so carefully. As she soared free, she planned a trip caving with her brother and sister as soon as the senator and his wife were safely back home. She crossed space. Smelled the rain. Felt cool and moist in the mist of the mountains. Far below her, she saw the entrance to a cave, spotlighted by the small sliver of moon that managed to peek around the thick cloud cover. Smiling, she dropped down to enter a world of crystal and ice. Whether she was dreaming or hallucinating didn't matter; all she cared about was escaping from the pain of her wounds and the smell of the hospital.</p><p>Traian lay in the cool earth, gazing up at the high, cathedral-like ceiling. His body hurt in so many places, he just wanted to rest. The beauty of the cave was breathtaking and took his mind off his physical pain. Then he turned his head and saw her. She was hovering just overhead to his left. A woman with a cap of dark hair and large eyes. She was staring down at him in complete astonishment.</p><p>\"You're hurt,\" she said. \"If you were real, I'd send the paramedics.\"</p><p>\"What makes you think I am not real?\"</p><p>\"Because I'm not really here; I'm in a hospital many miles away. I don't even know where here is.\"</p><p>\"You look real enough to me.\"</p><p>\"What in the world are you doing lying in the mud in the middle of a cave?\" Her soft laughter rippled through him. \"You didn't mistake this for a beauty spa, did you?\"</p><p>His heart nearly ceased beating. Those simple questions turned his world upside down. He was aware of everything - the coolness of the interior, the blue of the ice, the dramatic sweep of architecture formed thousands of years earlier. He was mostly aware that her hair was a rich brown and her eyes were a cool gray. Her mouth was wide and curved at the corners, and she had laugh lines.</p><p>He was seeing in color. After hundreds of years of a bleak, gray existence, living in a world without color or emotion, there she was. The other half of his soul. Staring down at him with curious eyes and an amused grin. There was blood on her shoulder and bruises on her face, a tear in the gown she wore.</p><p>\"You seem a bit overdressed for a cave,\" he pointed out.</p><p>She shrugged, her laughter soft and inviting. \"Yes, well, a lady likes to know she looks her best when the cave crickets come calling.\"</p><p>\"You are hurt, too.\"</p><p>\"A small bit of trouble with some unpleasant fellows. What about you? And do you often go swimming in the mud with a gaping hole in your shoulder? You have heard of infection and gangrene, haven't you?\"</p><p>\"How good of you to notice. A small run-in with a group of unsavory ruffians. I was uncharacteristically slow.\"</p><p>\"You have an incredibly sexy accent. Do women fall all over you just at the sound of your voice?\" She was very good at placing people by their accents, but his was different; there was a rich turn to his words. As dreams went, this was a fun one.</p><p>\"I have not noticed such a phenomenon, but I will watch for it in the future.\"</p><p>\"Nice cave. I love caves. This one looks like a wonderful place to explore.\"</p><p>\"I do not believe it has been discovered yet,\" he replied pleasantly. Peace seeped into his body. His soul. Genuine laughter found its way into his heart.</p><p>\"Really? You just sort of stumbled in blindfolded, did you? An interesting way to explore caves. Where am I? I'd like to come back here.\"</p><p>It was his turn to arch his eyebrow. \"You floated through the air blindfolded?\"</p><p>She grinned at him. \"I do that sometimes when I don't want to be wherever I am. A bad habit.\"</p><p>Her form shimmered and her smile faded. \"They're doing something nasty to me, I can't hold the projection.\"</p><p>He sat up, bit back a groan as the embers beneath his skin burned fiercely. \"Do not go yet.\"</p><p>\"I'm sorry.\" She looked down at her arm, looked back at him, tears swimming in her eyes. \"They're cleaning my wound. It hurts like a bear.\"</p><p>And then she was gone. Just that fast. Vanishing without a trace. He sat there alone in the dark of the cave, astonished at how life could change in the blink of an eye. She was real. Her psychic abilities were strong. He had shared her space, shared her mind, and the path was imprinted on his brain. She would not escape him.</p><p>Traian lay back and waved his hand to close the soil over him, stilling his heart, his breath, allowing the song of the earth to send him into a deep, healing sleep. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p> \"You're losing it, Joie, there's nothing here.\" Gabrielle Sanders sank gracefully to the ground and drew up her knees as she regarded her sister with cool gray eyes. \"Stop making yourself crazy and enjoy the view. It's breathtaking up here. You've been in a frenzy for hours now.\" Tipping her head back, she stared up at the sky. \"We've been climbing forever. If you were going to find anything, you would have done so by now.\"</p><p>\"I'm not losing my mind, Gabrielle,\" Joie insisted. \"I've already lost it.\"</p><p>There was a sudden silence. The wind paused. A hawk screamed as it missed its prey. Gabrielle exchanged a long look with her brother, Jubal. They both stared at their younger sister. She seemed focused entirely on the rock surface she was studying. \"Well, that's a relief,\" Gabrielle replied, laughing. \"All this time I thought I was the abnormal one.\"</p><p>Joie let her breath out slowly. She knew she was acting crazy, almost out of control. What was she going to tell Gabrielle and Jubal? That she really had lost her mind some weeks ago and this was a last-ditch effort to hold on to her sanity? That she wasn't joking, and she belonged locked up somewhere on heavy medication?</p> <p>What are you doing?</p><p>The voice came out of nowhere, unexpectedly as it always did, catching her by surprise. Masculine. Sometimes amused. Sometimes teasing. Always alluring. She tried not to hear it. Tried not to respond. But she could never help herself. She always talked to him. Laughed with him. Wanted him. In spite of the beauty of his voice, this time he sounded infinitely weary, strained, as if he were in pain.</p><p>\"Come on, I'm so close to the entrance I should be able to see it. Jubal,\" Joie appealed to her brother, \"you know I'm right. I'm always right. There's a network of caves, most of them unexplored, and we're right on top of it.\" Joie was certain she'd already begun her descent into madness. She'd rather be with that voice in her head than with any real person in the world. She lived to hear that voice. She thought about him day and night, was consumed by him. Joie lifted her chin.</p><p>I'm proving you don't exist so I can get over you. I have a list of would-be lovers a mile long, and I'd like to have a little fun for a change. Now is not the time. Get out of here. It is dangerous. Of course you would say that. You don't want me to know you aren't real. Look, honey, it's been fun, but we have to break up. I can't have a mythical lover, even if you're an awesome lover in my dreams. A girl wants to have the real thing once in a while. It isn't like I can introduce you to my family. Hey, guys, this is my invisible pal, Traian. He has a name like a locomotive, but that's my fantastic imagination. Traian is a very old and respected name. Go away from here, Joie. I will not comment on your name, as it would be considered extremely rude. Comment away, 'Traian. You're not real and neither is this conversation, so insult me all you want.</p><p>\"You're always looking down when you should be looking up, Joie,\" Gabrielle said with a sigh. \"If you reach straight up, you might be able to catch a cloud. Have you even noticed the flowers? They're gorgeous. I wish I knew what they were called. For once in your life, think of something besides caves.\" She waved her arms to encompass the countryside. \"This is Dracula country. If you'd forget your obsession with caves, we might be able to explore the old castles for a change.\"</p> <p>The flowers that are pink with a yellow middle are called Tratina. The white daisies are Marguarete. I cannot remember offhand what the blue ones are called, but it will come to me. Are you eavesdropping on our conversation? You are thinking loudly. And denying my existence, which seems to be a habit of yours lately.</p><p>Joie gave a little sniff. He was a figment of her imagination and he knew the names of the flowers. \"Gabrielle, the pink ones are Tratina, and the white daisies are Marguarete. I have no idea what the blue ones are called.\"</p><p>\"You're a walking encyclopedia,\" Gabrielle said, impressed.</p><p>Jubal stared at the wild countryside surrounding them, on either side and below. There were many deep gorges and several caves. Green valleys and plateaus made the view breathtaking. Below them, in the heavier depressions, water had soaked the ground, causing peat bogs. There were vivid green beds of moss and numerous shallow ponds winding their way around stands of birch and pine. It was magical, and yet Jubal was uneasy. The air was crisp and cold and the sky seemed clear, yet a strange mist covered the surfaces above them. At times he thought something moved in the mist, something alive and terrifying.</p><p>\"Joie, give it up and let's get out of here,\" he said. \"This place feels haunted to me. I don't like the vibes.\"</p><p>Gabrielle turned her head. \"Really?\" She arched a winged brow at him. \"That's strange, Jubal, I feel the same way. Like we shouldn't be here, or that we're intruding in some way. Do you suppose it's all the vampire stories we were listening to at the inn last night? Normally, creepy stories are amusing, but I definitely feel apprehensive.\" She raised her voice. \"What about you, Joie? Does this place give you the creeps?\"</p> <p>\"We came here to explore the caves,\" Joie said firmly. \"We're always very respectful when we go spelunking, so there's no reason to be nervous. I know the opening is here; I'm so close to it.\" She walked carefully around an outcropping of the mountain, stepping over her brother's outstretched legs without even glancing at him. \"The entrance is here, I know it is,\" she muttered.</p><p>The others feel the threat of the vampires. You must go, Joie. Oh, now you're going to tell me you believe in vampires. I just picked up that thought from Gabrielle. You aren't real, so be quiet and stop trying to frighten me away. I'm not leaving until I know for certain. You already know; you just cannot admit the truth. I am trapped and will not be able to rescue you should you come upon them.</p><p>\"Rescue me?\" Joie nearly shouted the words, her dark eyes flashing with indignation. She turned her head to smile in reassurance at her brother and sister.</p><p>Gabrielle and Jubal exchanged a long, amused glance, used to Joie and her ramblings when she was on the scent of a new cave. Few people were as adept as their sister at discovering magical worlds below the surface.</p><p>Rescue me?</p><p>She hissed it into his mind.</p><p>You can just bite me, Traian. Do you have any idea how annoying it is for someone like me to be treated like a ditzy little woman who can't fend for herself? I would not mind biting you.</p><p>This time his voice purred with sexual innuendo.</p> <p>But another time would be better.</p><p>Joie shivered in spite of herself, yet heat curled deep inside her.</p><p>If you keep this up, my brother and sister are going to figure out I'm crazy and have me committed. Then where will you be?</p><p>Strands of dark hair blew across her face, hiding her expression from her siblings.</p><p>And just for your information, Sir Galahad, I am not the 'in need of rescue' type, so get over that one fast. Sheesh. First it's vampires and now it's rescuing. Will you just be quiet and let me figure this out? I don't suppose you want to tell me, give me a hint or two, if you're really down there and know where the opening is.</p><p>Jubal leaned back in the tall grass with his hands behind his head, studying the cloud formations. He didn't want to look at the unusual tendrils of mist that seemed to wind around Joie's legs as she walked carefully around the outcropping. \"You're like a hound dog on the scent of a criminal, Joie,\" he said. \"You would have made a great detective.\"</p><p>\"She would have,\" Gabrielle agreed with a little grin. She concentrated on the bright blue flowers with their symmetric petals. The beautiful masses of flowers were unusual, yet something sinister seemed to lie beneath the ground, just inches from the soft petals, an obscene, malicious presence. Staring at the flowers, Gabrielle swore the ground rose up an inch or so as if something were tunneling beneath it. The wind rushed over the mountainside. She sat up quickly, blinking rapidly.</p><p>\"What is it?\" Jubal asked.</p><p>\"I don't know. For a moment I thought I saw something moving beneath the soil. This place gives me the creeps.\"</p><p>\"Joie, come on. We're getting out of here,\" Jubal decided, reaching a long arm to gather their gear. \"The sun will be down in a couple of hours anyway.\"</p><p>Joie examined every inch of the outcropping and the niche on either side. The rock was grown over with scrub and grasses. Wildflowers lifted their bright heads toward the sun. Joie narrowed her gaze and stepped up as close as possible, focusing completely on the jutting surface and every crack and shadow. \"I've never felt so driven in my life. I don't think I can leave without finding it,\" she admitted honestly. \"I'm sorry - if you two want to take off, go ahead. I'll come along as soon as I can.\"</p><p>Jubal and Gabrielle exchanged a long, knowing look. \"Sure thing, sis, we'll just leave you up here all by yourself. Knowing you, you'd disappear into a cave and mate with a troll,\" Gabrielle said.</p><p>\"Ha ha,\" Joie answered.</p><p>\"What's the name of this mountain range?\" Jubal asked idly, but his gaze was on Joie as she scanned the rock surface. \"The bogs are even beautiful. If it wasn't so freaky up here, I could live in this area.\" When Gabrielle arched a black eyebrow at him, he laughed. \"I could. I don't need to live in a city. I've got the same genes as the two of you. I just like to have money, you know. I need it for the two of you, to bail you out of all the trouble you get into.\"</p><p>\"You idiot,\" Joie said affectionately, although she didn't look at him. \"You have enough money to retire from that silly job of yours and do something useful with your life. Something humanitarian.</p><p>There's a small crack running the length of the rock here. There's something funny about this, Jubal, Come look at it. It just isn't right the way it is.\"</p><p>\"My humanitarian contribution to the world is looking after you two thrill seekers,\" Jubal pointed out as he got lazily to his feet. \"Without me to curb your antics, the world would be a frightening place.\" He looked up at the strange, moving mist. \"Rather like this place.\" He sauntered slowly over to examine the surface of the outcrop.</p><p>\"We're in the Apuseni Mountains, part of the Carpathians, you heathen,\" Gabrielle informed her brother. \"If you paid even the slightest attention to anything we said, you'd know that. And you could no more give up your luxury condo and live in the mountains than you could swim the English Channel. And, I might add, we take care of you.\"</p><p>\"Hey! I can swim,\" Jubal objected. He ran his hand over the rocks, frowning as he did so. \"Just because I don't like to swim doesn't mean I can't. I wasn't born with gills like the two of you. She's found something, Gabrielle. This is a pattern, but it needs to be...\" He trailed off, dug his fingers around several of the smaller rocks, and began to rearrange them.</p><p>\"There's a surprise,\" Gabrielle said and rose to her feet also. The cool mountain air fairly vibrated with excitement. \"You could always come and research hot viruses with me,\" she invited, slinging her arm around her brother.</p><p>\"Yeah, I'll get right on that, Gabrielle, because I'm a crazy man and want to die a miserable, but noble, death,\" Jubal said, ruffling his sister's dark hair. \"I think I'll stick to my stocks and bonds and let you do your wacko research all by yourself. There it goes. Wow, look at that.\" The crack widened when he placed the last rock in the sequence. \"This is man-made, not natural. Damn it, Joie, don't go in.\" He snagged his backpack and pulled out a logbook, carefully entering the time. \"We're just doing a cursory exploration, and it's nearly sunset. No one knows where we are.\" Muttering, he hastily anchored the logbook near the crack where his sister had slipped inside.</p><p>Gabrielle shouldered her gear and followed. \"It's extremely tight, Jubal,\" she cautioned. \"Pass me your gear; it's the only way you're going to get through.\"</p><p>Jubal took one last look at the sky, noting that the clouds that had been floating so lazily overhead were now spinning ominously, a gathering of a great force. His chest scraped as he maneuvered through the jagged crack and into the narrow hall. Behind him the wind rose in a sudden shriek, lashing at the mountain, while strange, haunting cries echoed off the peaks. Mist swirled around the mountaintop, a mini tornado that snatched the logbook and sent it skittering down the hillside to land in one of the many bogs, where it slowly sank beneath the dark waters.</p><p>Joie moved quickly through the narrow hall, well ahead of her brother and sister. The ceiling dropped with every foot, so she was forced to bend over, eventually crawling on all fours and then sliding on her stomach. She could feel the cool air coming from a subterranean chamber. Everything inside her demanded she keep going, even when she had to maneuver her body at odd angles to slither through the tunnel.</p><p>\"Slow down, Joie,\" Jubal cautioned. \"Stay within sight of us.\"</p><p>\"I don't like the way she's acting,\" Gabrielle whispered. \"I've never seen her like this. She always obeys the safety rules, you know that, Jubal. Something is really wrong.\" She felt sick, her stomach churning, her mind filled with dread. \"Something terrible is going to happen if we don't stop her.\"</p><p>Jubal waited, but Gabrielle didn't move; she remained wedged in the narrow hall, blocking him from continuing. \"Keep going, Gabrielle,\" he said. \"We'll catch up to her and talk sense to her. She's been caving for years. She's not going to forget everything she's ever learned.\"</p><p>\"Ever since she was hurt in Austria, she's been different,\" Gabrielle pointed out. \"Distracted. Driven.\"</p><p>\"She's always very focused when she's going into a cave. And this is a big discovery, an unexplored cave. We have no idea what we're going to find. Of course she's excited.\"</p><p>\"You know it isn't just that; she's been different this entire trip. Even before that. She's quieter. Joie isn't quiet. Now she seems to be somewhere else half the time. I feel like we're losing her, Jubal - as if something is pulling her into another world where we can't follow.\"</p><p>Jubal sighed loudly. \"I wish I could say I don't know what you mean, but that's why I came on this trip. I've been worried about her too.\" He reached out and pushed at his sister. \"Move it. I can't even hear her now.\"</p><p>\"I can't move, Jubal.\" Gabrielle sounded scared. \"I really can't.\"</p><p>\"Are you stuck?\" Jubal was very calm, but inside a dark dread was stealing over him.</p><p>\"No,\" Gabrielle whispered. \"I just can't move. Have you ever heard the term 'paralyzed with fear'? I think I really am.\"</p><p>Joie pushed forward as the ceiling lifted, allowing her to walk once again. Eventually the hall opened into a large chamber. \"Hey, you two, it's much better in here. There's a large gallery.\" She shone her light around the area, noting the fingerlike formations surrounding a large abyss that yawned in the middle of the chamber. She climbed into her rigging as she struggled to hold on to reality. \"Gabrielle! Jubal! I'm going to begin my descent.\" Joie tested her harness and glanced back toward the hall. \"Gabrielle! Jubal! Are you two okay?\"</p><p>\"Wait for us, Joie,\" Jubal ordered. \"Gabrielle has a bad feeling about this and so do I. I'm thinking we should regroup for a few minutes and talk this over. This could be more trouble than we want.\"</p><p>Joie fought back laughter that bubbled up out of nowhere. \"Talk it over? Nobody's in more trouble than I am right now, Jubal. I can't turn back. I have to make this descent or go live in a padded cell for the rest of my life. I am not kidding you.\"</p><p>Jubal caught at Gabrielle's leg. \"She isn't joking; she sounds on the verge of hysteria. Move it, Gabrielle. Right now.\"</p><p>Jubal rarely used that tone with either of his independent sisters, but it had the desired effect. Gabrielle scooted forward, driven by the fact that her brother obviously shared her growing fears for Joie.</p><p>Joie sat on the edge of the precipice, staring down into the black abyss. She didn't look up when her brother and sister joined her. Jubal rested his hands on her shoulders. Gabrielle sat cautiously beside her and took her hand. \"So tell us. What's going on, Joie? We always stick together. There's no need to hide anything from us.\"</p><p>\"Does insanity run in the family?\" Joie continued to stare down into the well of darkness. \"Because if it does, someone should have warned us.\"</p><p>\"You think you're insane?\" Jubal struggled to understand. Joie was the one who laughed all the time, who found humor in everything. She lit up the world with her smile, and she certainly never seemed to suffer from depression. \"I hear voices. Well...\" she hedged, \"a</p><p>voice. One voice. All the time. We have conversations. Long conversations. Sometimes very intense and sometimes humorous.\" She felt the color rise beneath her skin and was grateful it was dark in the gallery. \"Sometimes sexy. I find myself staying up all night just to be able to hear his voice and spend time with him.\" She shrugged her shoulders. \"He even has a name. Traian Trigovise. How could I think up a name like that? He has an accent. A European, very sexy accent.\"</p><p>Gabrielle tightened her fingers around Joie's hand. \"When did this start? When did you first hear this voice?\"</p><p>Joie shrugged, remaining silent. Neither Jubal nor Gabrielle spoke, waiting her out. Finally she sighed. \"When I was shot in Austria. You know how much I hate hospitals. When they took me there, I did my little disappearing act.\" She looked at her brother and sister. \"I thought I was dreaming when I first saw him, but I'd been experimenting for some time with astral projection. I guess I succeeded, I don't know. I think we connected because we'd both been in a storm, in a battle and wounded.\" She shrugged helplessly. \"It's the only reasonable explanation to me. He didn't go away. I could hear him talking to me in my mind. He found something important in the caves. I was already planning a trip here with you two, so I figured I could see if he was real.\"</p><p>\"Joie,\" Jubal reprimanded gently. \"Telepathic communication? With someone else? I know we can use telepathy, but we've never met anyone else who can.\"</p><p>\"Is it really that far-fetched? I can take myself somewhere else. I know when I'm in danger. You're weird with patterns, and Gabrielle can do all sorts of strange things. We're all able to use telepathy with each other. Is it such a stretch to believe others can use it, too? I have to go down there. I have to know if he's real, if he's here, in this place. I feel him. I can't explain it, but it's like he's crawled inside of me somehow and I need him. I need to prove this to myself.\"</p><p>\"Why didn't you tell us right away, Joie?\" Jubal asked.</p><p>\"Because I don't want the voice to go away,\" Joie admitted with stark truth. \"I saw a counselor. He said I was having a break with reality, schizophrenia, probably brought on by the trauma of being shot. I didn't want to point out it wasn't the first time I've taken a bullet; it wasn't the worst injury and it won't be the last. I didn't take the medication the counselor prescribed. I thought maybe it wasn't so bad to live in a fantasy world part of the time. I still function and do my job.\" She managed a faint smile, her sense of humor rising even in the middle of such a serious conversation. \"Do you think many people want a schizophrenic bodyguard? They get two for the price of one.\"</p><p>\"Come on, Joie, you can't believe you're going crazy. You're...\" Gabrielle paused in search of the right words. \"You're you.</p><p>You can do anything. You excel at everything. You can't hear voices.\"</p><p>Joie smiled up at her sister. \"I'm definitely hearing a voice. Right now he's telling me to get out of here. He's saying it's dangerous and that we're all in mortal danger. He actually used the word mortal.</p><p>I don't use that word. Do you think I have a split personality? I've always preferred male activities. I've always been such a tomboy. Maybe this is just my male side coming out. And just so you know how really screwed up my mind is, he's sexier than I am.\"</p><p>\"Maybe your intuition is telling you not to make the descent, Joie,\" Jubal cautioned. \"We haven't planned this out adequately.\"</p><p>\"I don't have a choice,\" Joie said sadly. \"Not this time. We have the rigging. We have the supplies. We're all dressed warmly enough. I can go down and look around. If I'm not back in a couple of hours, you can go for help.\"</p><p>Gabrielle shook her head. \"We all go. We stick together, Joie. If you have to do this, then we do it together like we always have.\"</p><p>\"Then we should stop talking and get moving,\" Jubal said decisively. Joie wasn't going to change her mind. Whatever was compelling her into that black abyss was too strong to fight. Worse, the dread was still growing inside him. He glanced down into the dark hole. Evil lurked close by, and he had the feeling they were going to come face to face with it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Joie, this is out of this world,\" Jubal said softly, in awe. He turned in a full circle, shining his light on the walls of the gallery. The descent had been a long one, well over two hundred feet. \"I've never seen anything like it. What a find. The ice formations are incredible. I swear I actually saw a vein of gold in more than one place. There are so many halls and galleries to explore.\" Gabrielle cautiously moved around an ice sculpture that rose like a living flame from the floor. \"Look at this. When I shine my light on it from this angle, I'd swear the thing had gems in it. It's as brilliant as a polished diamond but reflects the light as if it were red like a ruby.\" Movement caught her attention, and she turned her head to watch Joie as she examined the glacial ice that formed the gallery. \"Be careful, I suspect that a good number of viruses previously unknown to us come from insects and even perhaps the fungi in caves such as this one. These microorganisms exist with no light and few nutrients, locked inside the ice, yet still capable of living. There's such a wealth of information down here.\"</p><p>Joie ignored both of her siblings. She was so close now, she could almost feel him breathing. Somewhere in this labyrinth of halls he was waiting for her. Smoldering. Angry that she had disobeyed him. He was real, not a voice in her head, not a part of a split personality. He was real and alive and in pain. She could feel his pain, throbbing through her body, beating at her head.</p><p>Tell me.</p><p>She demanded it. Forced him to deal with who she really was, not who he thought she should be.</p> <p>Tell the others to be quiet. They are in danger. I have battled the same enemy three times since you found me in the cave. I am a prisoner and wounded and extremely weak. I cannot aid you much in the battle, and the enemy has powers you cannot possibly comprehend.</p><p>Joie gave him a mental image of rolling her eyes in exasperation.</p><p>Sorry for the fluff in my head, but I'm usually found wrapped in cotton or bubblewrap to protect me from all the evil people in the world.</p><p>She signaled her brother and sister to silence, switching easily into hunting mode. She moved through the halls with confidence, recognizing the feel of him now. Knowing she was moving toward him.</p><p>I doubt very much if I'll need your aid, Mr. Brawny, but I'll keep it in mind. How many? There is one with me now. The others will return well fed and high with a lust for killing. You do not want to meet them. Then I guess I'd best pull your butt out of trouble and get the heck out of Dodge. You do not act like any of the women I know act. Thank you. I appreciate your saying so.</p> <p>Joie dropped to her knees and crawled through a narrow, tubelike passage. Jubal and Gabrielle followed close behind. The steady drip of water reminded Joie of the clicking of the branches at the theater the night she was shot. There was a peculiar rhythm to the drops, almost as if some unseen hand, not nature, guided the water's descent. The tube began to widen until she could once again stand.</p><p>A strange, growling noise assaulted her ears. It sounded like a cross between a hyena laughing and a dog growling viciously. Immediately she held up her hand behind her, signaling Jubal and Gabrielle to stop while she scooted closer. She used the tall columns of rock and ice formations as cover.</p><p>Traian was literally pinned against a wall of ice. Blood ran down from each shoulder and leg where sharp, twisted stakes had been thrust through his body to pin him like an insect on a board. Joie held her breath to keep from crying out in dismay. It was no wonder she could feel the pain radiating from him. She knew Traian was aware of her presence, but he didn't make the mistake of giving away her position. He watched the creature hovering over him with cool eyes.</p><p>\"You seem nervous, Lamont,\" Traian observed.</p><p>The creature hissed and without preamble bent his head to Traian's neck and sank his teeth into the pulse beating there.</p><p>Joie could easily see the long incisors stabbing into flesh, something she'd only seen before in films. She dropped to the ground, crawling on her stomach, using her elbows to propel herself across the floor between two columns of ice to get into a better position for attack. She came up on her knees behind a large ice formation, her gaze fixed on her target.</p> <p>He is very dangerous, especially now when he is filled with the blood of an ancient.</p><p>Traian's voice was calm in spite of the ghastly creature tormenting him.</p><p>Joie stared at the hideous thing. It was tall and emaciated, the skin shrunken around its skull, almost as if it were dead. Tufts of hair stood straight out, a curious gray-white color, while the rest of the hair hung in oily, twisted ropes. He gulped down the blood, smearing it on his lips and stained teeth, all the while making growling noises in his throat. He seemed more animal than man.</p><p>My family always warned me if I hung out underground too long I could end up with a troll. At the risk of seeming shallow, I have to say he isn't very handsome and doesn't appeal at all to me.</p><p>Her hand went up to the back of her neck, sliding down between her shoulder blades in a well-practiced move, came out with the knife she always carried.</p><p>The creature lifted his head alertly and looked around the large gallery with suspicious eyes. Joie remained motionless, hardly daring to breathe. The cold air rushed through the chamber and touched Traian and the creature with icy fingers. Immediately Lamont caught at one of the stakes pinning his victim to the ice flow.</p><p>\"None of your tricks, ancient one. Your blood belongs to us now. The others will be back soon with a victim to force you to our bidding. You are far too weak to resist.\"</p><p>What is he? He is vampire. The undead. And there are others. You must get your family out before the others return.</p> <p>Traian watched his tormentor intently. The vampire leaned close to the gaping wound in Traian's throat, his breath a sickly green vapor as he licked at the blood with a thick, dark tongue. \"I just might kill you instead. A stake through the heart.\" He lifted a lethal-looking stake over his head and gave a maniacal laugh.</p><p>Vampires are difficult to kill. You will only get one chance. Go for his heart.</p><p>Joie threw the knife with deadly accuracy. It hummed as it rocketed across the chamber and buried itself deep in the vampire's chest. The creature screamed, the sound cracking the ice so that sharp daggers broke from the high ceiling and rained down like deadly missiles. Joie flung her body over Traian's, protecting him from the falling ice. The vampire went down hard, thrashing wildly, the sounds echoing through the cavern, and then there was sudden silence.</p><p>Joie moved back slowly, slipping a second knife from the scabbard on her calf. \"That didn't look so difficult to me. If you want, I'll give you a lesson or two.\"</p><p>\"What took you so long?\" Traian asked.</p><p>She made her way cautiously around him, kicking aside the bigger chunks of ice. \"Bad directions. You know how traffic in these places can be.\" She leaned close to study one of the pins slicing through his shoulder to hold him to the wall. \"I hate to point this out to you, but you're in a bit of a mess. What was all that he-man macho crap telling me to stay away? If you ask me, you're in serious need of rescuing.\"</p><p>Traian arched an eyebrow. His skin appeared pale, and he was clearly weak from loss of blood. Unattended wounds from a recent battle seeped more of his precious life fluid. He shook uncontrollably, unable to maintain his body's temperature. His hair was black and matted with blood. \"I am certain I would have thought of something. He has friends. They will be returning soon, and when they see him, they are not going to be happy. And if I do not incinerate his body, he will rise again.\"</p><p>\"Lovely thought,\" Joie said and turned to keep a wary eye on the repulsive corpse. \"Lucky for you I travel with a doctor. My sister Gabrielle is quite mad, always peering into microscopes and lecturing us about how we're parasites on earth, but she does have certain skills.\" She whistled softly to signal to her brother and sister to enter the ice chamber.</p><p>Gabrielle avoided looking at the vampire as she studied the daggers of ice pinning Traian to the wall. \"You do know the strangest people, Joie,\" she said. \"I don't even want to ask where you met him.\"</p><p>\"If I pull out the stake, is he going to bleed to death?\" Jubal inquired.</p><p>\"Just do it before the others come back,\" Traian advised, \"or we are all going to die. Vampires are very dangerous. You were lucky.\"</p><p>Joie sniffed indignantly. \"I was fast and accurate and very good. There's no need to feel inferior.\" She signaled to Jubal even as she flashed a smug smile at Traian. \"I have a gift.\"</p><p>Jubal took hold of the stake in Traian's left shoulder with both hands and yanked with all his strength. Blood spurted, but Gabrielle pressed her palms over the wound hard. \"The first-aid kit is in my pack, Joie, but I don't know how we're going to get him to the surface. He needs blood as quickly as possible.\"</p><p>\"Just take them all out,\" Traian instructed. \"We really have to hurry.\"</p><p>\"Do what he says, Jubal.\" Joie caught the sense of urgency emanating from Traian. Little white lines were etched around his perfectly sculpted mouth. \"Vampire babe is twitching.\" To her horror, the knife was vibrating, wiggling back and forth as if slowly emerging from the rotted flesh. \"Hurry - we may have a little problem with handsome. He seems to be coming back to life.\"</p><p>\"Pack the wounds with mud. Hurry,\" Traian said.</p><p>Joie didn't want to take her eyes off the ghoulish creature, but the dark compulsion in Traian's voice alarmed her. Gabrielle obeyed him. Always meticulously careful of germs and microorganisms, she scooped up handfuls of gooey soil and, before Jubal could stop her, smeared it over Traian's shoulder and the rest of the gaping holes in his flesh.</p><p>Without warning, Traian reached out and dragged Jubal close to him, murmuring something Joie couldn't quite catch. He bent his head toward Jubal's exposed throat. Neither Jubal nor Gabrielle protested; rather, they stood quietly, as if enthralled.</p><p>Fury burned through Joie. \"You blood-sucking fiend! Touch him and you die! I'm not kidding you. Let him go or I'll tear your heart out. And don't try using your voice on me, because it won't work.\" As she hissed the words out in a low, smoldering voice, she moved to aim the knife she had drawn from the sheath strapped to her calf. At the same time, she tried to keep the vampire in sight.</p><p>\"If I do not get blood, we are all going to die,\" Traian said calmly. He looked at her, his gaze steady and honest.</p><p>She let her breath escape between her teeth as she reached out and jerked Gabrielle away from him, thrusting her sister behind her. \"Release them now.\"</p><p>\"We have only minutes.\"</p><p>\"Then don't waste time.\" Her hand didn't waver. Neither did her stare.</p><p>Traian spoke softly to Gabrielle and Jubal, and both reacted immediately, Jubal hurrying to safety.</p><p>\"Tell us what's going on,\" Joie said. \"It isn't as if we didn't witness the zombie man on the ground here, doing his sorry imitation of Dracula.\"</p><p>\"I am Carpathian, of the Earth. All the stories I told you were true, not made up to entertain you. I lived the battles; they were not fiction. I need blood to survive, but we do not kill for sustenance. I have fought the vampire for hundreds of years.\" His voice was every bit as steady as his gaze. \"This one will rise again, and he has friends. You cannot stop them, nor can I without blood to build my strength.\"</p><p>Jubal caught at Joie and tried to drag her backward, away from the wounded man. She held up her hand. \"He's telling the truth, Jubal. I can feel them coming - can't you?\" She handed her knife to her brother, ignoring her trembling hand. \"If I'm making the biggest mistake of my life, I expect you to avenge me.\"</p><p>She made her way to where Traian remained slumped against the blue ice, pulling off her helmet as she did so. \"Go for it, but remember, my brother can hit a bull's-eye every time.\"</p><p>Traian touched her then, circling her wrist with his long fingers and drawing her slowly, inexorably to him. Joie's heart skipped a beat, then began to pound, whether in fear or excitement, she didn't know. She knew only that her mouth went dry and her insides were melting at an alarming rate. His eyes went dark, focused on her completely, shutting out everything else. Everyone else. He pulled her into the shelter of his large frame.</p><p>Joie felt his every muscle, hard, defined, rippling with power. He should have smelled of sweat and blood, but his scent was masculine, clean, inviting. Sexy. The world seemed to drop away. Danger didn't matter. His arms swept around her, held her close so that her heart beat with the same rhythm as his. She placed her hand over his chest, felt his heart beat strongly against her palm. She lifted her gaze to his and was instantly lost in the burning intensity she saw there.</p><p>There was a storm of emotion between them, a dark cauldron every bit as roiling and wild as the gale raging above ground. Mesmerized, she could only stare up at him. His fingertips brushed the hair from her neck. Sent fire racing through her bloodstream. Where he had been businesslike and abrupt with Jubal, he was gentle, even tender as he enfolded Joie closer. He bent his head to hers.</p><p>Gabrielle made a small cry of protest, stepped toward them with every intention of stopping him. Traian lifted his head, his eyes glowing with a strange fiery red, halting her in her tracks. His eyelids drifted down, his arm curling around Joie possessively so that she nearly disappeared from sight, completely engulfed in his embrace. There was something very protective, yet predatory in his posture.</p><p>His lips barely skimmed over Joie's skin. She felt it. A brush of butterfly wings, no more, yet that slight touch sent heat spreading through her body. He kissed her eyes until she closed them. Sensations increased. He whispered to her, in her mind an intimate, soft litany of words in an ancient tongue. His voice wrapped her in velvet, an erotic spell of enchantment she willingly embraced.</p><p>Joie felt his breath warm on her neck. His tongue swirled over her pulse. Once. Twice. Her entire body clenched, every muscle contracting breathlessly. Waiting. Wanting. His lips feathering over her neck sent heat pooling low, and her legs went weak. One arm, of its own accord, slid upward to curl around his head, to draw him closer, cradle him to her. White-hot lightning pierced her skin. Sent whips of lightning dancing in her bloodstream, a pleasure bordering on pain. Nothing had prepared her for the sheer erotic fire coursing through her body. A soft moan escaped her. She moved restlessly against him.</p><p>Traian pulled her closer, imprinting his body against hers, feeling every lush curve and soft, rounded line. Lifemate. He had waited so long. Endured so much. There was no shield providing her with a protective barrier. She knew exactly what he was doing and yet she accepted him, accepted his need for her blood. It rushed through his body with the force of a freight train; his shrunken, starving cells soaked it up; tissue and muscle and damaged organs demanded sustenance. He wanted to savor the moment, savor his first taste of her, his first touch on her skin.</p><p>Even as Traian struggled for sufficient control to blur the horrified gazes of her siblings, he was aware of the undead struggling to rise again the two vampires rushing through the maze of halls to reach him before he could escape. He took from Joie only what he needed to have strength when the battle came. He couldn't risk her being too weak to defend herself. They would have more than one skirmish with the undead before they were out of the labyrinth of caves.</p><p>Very gently, almost reverently, he swept his tongue across the pinpricks to close them. \"Thank you, Joie.\" His arms held her up, his body taking her weight.</p><p>She shivered as she lifted her lashes to study his face. At once she was caught and held in the dark depths of his eyes. \"You're welcome.\"</p><p>\"I hate to break up the love fest the two of you are having,\" Jubal snapped, \"but we've got a little problem. The knife just fell out of the dead thing's chest, and he's beginning to thrash around. It isn't a pretty sight.\"</p><p>Jubal's voice broke the spell Traian seemed to have woven around Joie. She pulled her gaze away with an effort and looked over at the creature clawing the floor of the cave. \"He looks angry,\" she observed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"He is not the only one,\" Traian agreed. \"His friends are coming this way fast, and they have murder on their minds.\" The vampire struggled to a half-sitting position on the floor, blood and spittle running down his chin. His red- rimmed eyes fixed on Joie with a mixture of hate and fear.</p><p>She glared at him. \"What the hell did you do to my knife, you fiend? Do you have any idea what a knife like that costs?\" She held out her hand to Jubal for the knife she had given him. \"Give that to me. I think I'm going to need it.\"</p><p>Traian put her firmly behind him and signaled to Jubal and Gabrielle to move away from the vampire. They did so carefully. He was making hideous noises, his talons cutting deep gouges into the ice.</p><p>Jubal handed his sister the knife. \"Let's get out of here while we can. I don't think I want to meet any more of these things.\"</p> <p>\"I'm going to pretend I never met this one,\" Gabrielle said firmly.</p><p>Joie watched Traian closely. He seemed to be gathering something unseen into his hands. She could feel the buildup of energy in the chamber. The gallery was actually warming, increasing the dripping of the water dramatically. Between Traian's palms, light glowed, a bright orange-red, emitting heat. It appeared just smaller than a basketball, the energy coiling and spinning.</p><p>The vampire screamed in rage and attempted to rise, stabbing at the air with his claws and clicking his twisted nails rapidly in a summons. The ball left Traian's hands, hurtling through the chamber to pass cleanly through the vampire's chest, leaving behind a gaping hole where the heart had been. The creature slumped to the floor, limp and unmoving, a foul stench rilled the cavern.</p><p>\"Handy little trick,\" Joie observed. \"You'll have to teach it to me.\"</p><p>Traian managed a boyish grin. \"Finally, something impressed you.\"</p> <p>A terrible howling, like that of a demon pack, echoed through the subterranean caverns, sending chills down Joie's spine. \"I think that's our cue to leave.\"</p><p>\"Can we climb? How do we know where they are?\" Gabrielle asked anxiously.</p><p>\"What the hell are they?\" Jubal demanded.</p><p>\"Vampires,\" Traian answered. \"And they are coming for us. We have to get out of here now.\" He indicated a small break in the wall of ice. \"That way. I will seal it up behind us. It will not stop them, but it will slow them down.\" Gabrielle didn't wait for a second invitation. Clutching her pack, she ducked into the crevice and scooted down the ice chute. Jubal started to say something, thought better of it, and followed her into the ice tunnel.</p><p>\"In all of our conversations, it didn't occur to you to mention a few pertinent facts such as how you're a peculiar sort of man who likes blood and has vampires and other mythical creatures stalking you? You might have mentioned, just once, that you weren't telling me cheery bedtime stories but that you lived this sort of life. Didn't you think that might be important in the grand scheme of things?\" Joie arched an eyebrow at Traian.</p><p>\"I took into consideration your fear that you had lost your mind. It occurred to me that if I started talking about vampires being real and not fictional, you would have yourself committed.\" His smile was slow and incredibly sexy as he stepped back to allow her to precede him. \"You will need your pack. We may be trapped in here most of the night.\"</p> <p>The ice chute was cold after the unexpected heat Traian had generated in the chamber. Before she could disappear down the slide, he wrapped his arms around her, drawing her back against his chest. He climbed into the chute, sat down with her on his lap, and pushed off into the spiraling tube.</p><p>Joie slid down into the freezing world of blue ice and crystal, knowing he was right. She would have had herself committed at the mere mention of vampires. \"I still might,\" she muttered aloud. \"I don't think having a boyfriend who has a neck-biting fetish is too sane.\"</p><p>\"Boyfriend?\" She heard the genuine amusement in his voice. \"I have never been anyone's boyfriend before.\" He buried his face in the warmth of her neck. \"I told you not to come here. I am not certain I can get your family out alive. There is something in this cave the vampires are determined to find. Or protect.\"</p><p>His arms held her snugly to him, his body protecting hers from the biting cold, the ice slivers and hard, jagged edges that could tear through fabric and skin. She reached out, caught at a thick crystalline handhold, and jolted their downward slide to a stop. \"This formation isn't entirely natural, is it, Traian?\"</p><p>With a startling rasping sound, crickets poured down the tube around them. Traian shifted, turned. Joie felt the gathering of energy, of heat, of power. She opened her mind instantly to him, flooding him with her strength and energy, generously sharing everything she had, everything she was. The impulse to do so should have frightened her. It didn't. She belonged with him. Shoulder to shoulder. Mind to mind. They were connected in some way she didn't understand, but it felt right. She didn't trust people, other than Gabrielle and Jubal. She was naturally private and always very careful in close relationships, yet the moment she heard Traian's voice, the moment she laid eyes on him, even when she'd thought he was a fantasy, she had known he was somehow a part of her.</p><p>Below her, she heard Gabrielle cry out as the insects reached her. Jubal murmured softly in reassurance. Above her, a scream of rage and hatred announced that the undead's companions had found his lifeless body. Traian began to chant in a soft voice, his hands moving quickly in a pattern Joie couldn't quite follow, the movements blurring with his incredible speed.</p><p>\"Let go,\" he ordered, and dragged her hands from the hold so that they plunged down the slide toward the bottom. She could hear the ominous cracking of ice. The tube above their head was veined in a starburst pattern that spread rapidly outward. At the entrance, the ice began to fall in large chunks, some sliding down the tube toward them. Traian hit the ground running, with Joie in his arms. \"Hurry!\" he called to Jubal and Gabrielle.</p><p>A sound was building behind them, a great roar and a thunderous clap as the tube collapsed in on itself. The earth shook beneath their feet, and an ominous rumble emanated from the walls and ceiling surrounding them. Jubal caught Gabrielle's hand and followed Traian at a dead run through the narrow hall.</p> <p>Joie clung to Traian, feeling somewhat silly being carried when he was so hideously injured, but the man wasn't even breathing hard. Sharp daggers of ice fell from the ceiling as they rushed through the tunnel. Several times, Traian redirected a lethal missile as they raced along the well-worn path. Traian stopped so abruptly, Jubal ran into him. Very slowly Traian allowed Joie to stand on her own feet. His arm remained around her. They were on the edge of a precipice. A very narrow bridge, constructed of ice and stone, was the only way across. It appeared dangerously thin in places and had an obvious hole in one section.</p><p>\"Where the hell did that come from?\" Jubal demanded. \"That's no natural bridge. Who could have carved such a thing? Can we cross it?\"</p><p>Traian studied it warily. He shook his head. \"I am beginning to be very afraid we have stumbled into a cave we do not want to be in. I fear that bridge is an invitation to death. A trap.\"</p><p>Jubal glared at him. \"If you know something, tell us.\" He caught Joie's hand and pulled her away from Traian. She was already looking upward, searching for another way out of the hall. \"Joie, slow down for a minute,\" Jubal ordered. \"I don't understand what's going on here, but I can tell you, this man is dangerous. We don't know him and we don't need to be associated with him.\" He actually shoved her behind him, the look in his ice-cold eyes making it clear he was prepared to protect his sisters against an obvious predator. \"Why are we taking his word for anything?\"</p><p>Traian swung his head around, his eyes glittering with menace. There was instant silence. Joie wrapped her fingers around her brother's wrist. \"I think we can talk about this at a more opportune time. Maybe when the fiends from hell aren't chasing after us.\"</p><p>\"Has it occurred to you, he's one of them?\" Jubal demanded, glaring at Traian. \"He drank your blood, Joie. That ought to tell you something right there.\"</p><p>\"It tells her I am different. Not quite human. The fact that I did not kill her - or you, for that matter - tells you I am not vampire.\" Traian spoke very quietly. \"I will not allow any harm to come to her.\"</p><p>Joie made a move to slide past her brother, but he sidestepped, staying between her and Traian. She glared at him. \"What is wrong with you? You aren't going all macho and stupid on me, are you, Jubal? I love you dearly, but you can't be serious. Did you see that thing? We've got to get out of here, and Traian knows the way.\" She tilted her chin to look up at him. \"You do know the way, don't you?\"</p><p>Gabrielle slipped her hand into her sister's. \"I'm afraid, Joie. I've got a terrible feeling we're all going to die.\"</p><p>\"The vampires are broadcasting terror and images of death to feed your natural fear,\" Traian explained. \"They are hunting something in these caves. The network is very large and, as you can see, not all naturally formed. I stayed to try to find what they are looking for. Vampires do not normally put so much energy into a project. Whatever it is they want, their finding it will not benefit either the Carpathian or the human race.\" Jubal nodded toward the raw wounds on Traian's chest. \"You've been in a few battles with them.\" He nodded. \"Yes, and I have noticed changes in their behavior. Now vampires are running in packs. They used to be out for themselves, or occasionally a master vampire would use the newer ones as fodder for his battles, but lately they seem to be organized.\"</p><p>Jubal shoved a hand through his hair in agitation. \"I feel like I'm losing my mind. Vampires are Hollywood creations, creatures in movies. They aren't real.\" He stared hard at Traian's mouth, trying to see his teeth. \"I saw you bite my sister's neck, and I'm sorry, but that puts you into the vampire category as far as I'm concerned. You just go your way and we'll go ours, and we'll pretend we never saw you.\"</p><p>Traian's gaze swept over Jubal, his glittering eyes taking on a peculiar reddish glow in the light from the helmets. He noted Jubal's aggressive posture, his clenched fists. \"Do you think to fight me? There is no way to win. I am powerful beyond your imagination, just as the vampires are. You still do not understand the danger you are in.\"</p><p>\"You didn't look so powerful lying there while that thing was having you for dinner,\" Jubal snapped.</p><p>\"He does have a point, Traian,\" Joie said. \"But we don't have time for this.\" She could hear a sound accompanying the drip of the water. A soft clicking, like branches banging together in the wind. It made her edgy.</p><p>There was no warning. One moment Traian stood in the glare of their lights, the next a huge, shaggy black wolf with a mouthful of lethal teeth sat in his place, eyes focused menacingly on Jubal. Gabrielle screamed and stumbled backward. Jubal reached out to catch her, dragging her away from the abyss to comparative safety beside the snarling animal.</p><p>Joie circled the wolf's neck with a restraining arm. \"Totally impressive, but not something I want to take home to Mom.\" Her heart was pounding so loudly, it sounded like a drum in her ears. Even her mouth was dry.</p><p>There is no need to fear me. I would never harm you.</p><p>\"Why would you think I was afraid of you?\" Joie demanded. \"I'm not in the least afraid. I'm keeping you under control.\"</p><p>It may have something to do with the knife you are holding to my throat.</p><p>Traian said it casually, a soft amusement in his voice, as if the blade pressed so tightly against him didn't matter in the least.</p><p>And that scared her more than the fact he had just shape-shifted into a predator. She looked down at her arm curved around his neck. The fur was thick and luxurious, and her arm was nearly buried in it. But she could feel the handle of the knife in her hand. She let out her breath and slowly eased the blade away from his throat. \"I was just making certain you were paying attention,\" she said as she slipped the blade back into the scabbard.</p><p>Traian calmly shifted back into his true form. \"Just how many weapons do you carry on you? You seem to be a walking arsenal.\"</p><p>\"You are a walking arsenal,\" Jubal accused. \"Joie, how did you get mixed up with him? And it's obvious you're talking with him telepathically.\"</p><p>Joie burst out laughing. \"You sound so accusing, Jubal. I told you I was talking to him telepathically. We all do it. Don't pretend it's all that unusual for us.\"</p><p>\"We have to work at it,\" Jubal complained. \"You seem to communicate with him effortlessly.\"</p><p>\"Jubal, we can discuss all this later when we're far away from here,\" Joie said. \"That clicking noise is driving me crazy. I don't like the rhythm; it's not natural.\"</p><p>\"I want to get out of here,\" Gabrielle said. \"Joie, find us a way out.\" Her voice trembled, and she sounded very forlorn.</p><p>\"We'll get out, hon,\" Joie said with confidence. \"If the two macho boys can stop beating their chests long enough\" - she blew her brother a kiss - \"we'll figure this out.\" The dripping of the water was more insistent. She looked anxiously toward Traian. Something was wrong. He knew it. She knew it.</p><p>\"I will take them across and come back for you,\" Traian said to Joie. There was no sense in attempting to take his lifemate first. It was clear she would never go without the others, and he didn't want to waste time arguing. He held out his hand toward Gabrielle. \"Come with me.\"</p><p>She didn't look at him, but rather at her sister. \"Do you trust him, Joie?\"</p><p>Joie looked up at Traian, noting the lines etched in his strong, timeless face. The dark depths of his eyes. Old eyes. Eyes that had seen too much. He was a man who had been alone too long. She was a looking at a warrior. A man of honor. Joie reached out to brush a caress along his jaw with her fingertips. The touch jolted him. Jolted her. Need slammed into him, a driving punch that shook his existence. Heat flooded her body. Electricity arced between them, lightning flashing in their veins. Instant awareness. They smiled at one another in understanding.</p><p>\"I would trust him with my life, Gabrielle. More importantly, I would trust him with yours. Please go with him now. I've got that bad feeling I always get when we're in danger.\"</p><p>Gabrielle took Traian's hand, allowed him to draw her to him. They all looked at Jubal.</p><p>\"Damn it, Joie, I'm your older brother and the man here,\" he muttered, shaking his head, but he went obediently to Traian's side.</p><p>Traian leaned over to catch Joie's chin. \"I will be back immediately. Do not attempt to engage the enemy. They must not get their hands on you.\" There was an underlying urgency in his voice. His dark eyes stared into hers. \"Be safe, Joie. I need you to be safe.\"</p><p>He was taking her family to safety for her, when everything in him demanded he take her first. Joie understood his look immediately, recognized how difficult it was for him to do what was important to her rather than to himself. There was a storm of emotion churning inside him, yet his features remained tranquil. Only his eyes burned with intensity. With possession. With promise. With passion.</p><p>His mouth fastened on hers, a hard kiss that staked his claim on her. That kiss told her he meant to have her and nothing would stand in his way. She felt his body tremble and tasted his passion, tasted his fear for her.</p><p>He pulled away abruptly, lifting her brother and sister easily, as if they were no more than children, shifting into a creature with wings, half man, half bird, and flying across the abyss into the dark where she could no longer see him.</p><p>Joie was left standing alone on the edge of the precipice with the darkness pressing down on her. With the strange rhythmic clicking and the dripping water. Heart pounding and mouth dry, she turned toward the sound, shining her light to see what was behind her.</p><p>In the small confines she could see water trickling from the side of the cavern; it was not clear, but a milky yellow, and gathered into a foul-smelling pool. She moved cautiously, positioning herself to keep an eye on what was gathering there. Something evil. Something alive.</p><p>The water rippled in response to a dark disturbance below the surface. The pool darkened into an oily substance, revealing two red orbs glaring with terrible malevolence. A chill crept down her spine. The hair on her arms stood up.</p><p>Traian.</p><p>Automatically, without conscious thought, she reached out for him, showed him the pool with its macabre secrets.</p><p>Move! Get out of its line of vision, Joie. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Joie stared back at the flame-red eyes in horror, unable to look away. The eyes were real, watching her, some terrible apparition set on her destruction. She had never seen so much malice, so much black hatred pouring from any entity. Her body rebelled, sickened by the evil emanating from the thick slime.</p><p>At Traian's warning, she tried to wrench her gaze away, but she was trapped, unable to break eye contact with the red flames. Her airway began to close, choked off by an invisible noose. Instinctively her hands flew up to her throat as if she could pry unseen fingers from around her neck, but there was nothing there. As white stars flashed across a black background, Joie realized dizzily she had only precious seconds to break the invisible hold on her throat. She reached for her knife, following through in one smooth motion with a throw directed by sheer desperation.</p><p>The blade sank deep into the fiery left eye. Immediately the water bubbled up in a blackish-red ooze and the hold on her throat loosened, allowing her to breathe. A terrible howl filled the cavern, assaulting her ears. She stumbled away from the poisonous pool, dragging air into her lungs, coughing as her raw throat protested.</p><p>In the next moment Traian was dragging her into his arms, his body crowding hers, his hands moving over her to assure himself she was unhurt. As he lifted her, she clung to his strength, not bothering to pretend the encounter hadn't shaken her. He moved quickly through the air, so fast the cold air bit at her face, numbed her arms, and tore tears from her eyes. Joie buried her face against his chest, allowing herself a few moments to recover before she faced her siblings.</p> <p>\"You are teaching me the meaning of fear,\" he said.</p><p>\"Really? I thought it was the other way around. I don't think your world is the calm environment a woman like me should be in.\" Her voice shook, embarrassing her.</p><p>\"Having courage does not mean being unafraid.\"</p><p>\"True, but everyone doesn't have to know I was shaking in my boots. Literally.\"</p><p>\"I am not everyone. I still cannot believe you are real,\" he said softly. His lips moved against her cheek, a brush lighter than a butterfly wing, yet she felt it all the way to her toes. That small caress sent blood rushing through her veins, her heart leaping; his touch warmed her as nothing else could.</p> <p>\"I'm having a difficult time believing that any of this is real,\" Joie admitted. \"And what's up with the wolf? Telepathy, okay, I can accept that. Even your strange little blood fetish, but don't you think changing into animals and flying through the air might be going a little too far?\"</p><p>His arms tightened possessively. \"You do not enjoy flying?\"</p><p>\"I don't enjoy anything when I'm not in complete control. And you didn't have to intimidate my brother.\"</p><p>His arm was curved around her, pressed against the underside of her breasts. \"You will not be in complete control when I make love to you, Joie,\" he told her softly.</p><p>She closed her eyes at the velvet sound of his voice. Danger surrounded them. Her family was close. It didn't seem to matter. She was so aware of him, her body ached with need. With hunger. With absolute longing. She felt edgy and hot; a terrible pressure was building inside her.</p><p>I feel the same way.</p> <p>She often spoke with her brother and sister using telepathy, a secret they all shared, but this was different. So much more. An intimacy that whispered of erotic nights and appetites that would never be sated.</p><p>Why? Why with you? I am your other half. We belong together. I have searched the world for you. Waited lifetimes for you.</p><p>Joie tightened her grip on his shirt, burrowed closer to his heart. She was a woman who knew herself well. An adrenaline junkie. A feminist. A believer in justice. She loved her life. Traveling from country to country. One assignment after another taking her into danger. Her recreation time was spent caving, white-water rafting, or skydiving. She was not a woman who wanted or needed a man. She was not a woman who clung to a man.</p><p>Joie looked up at Traian, the light from her helmet shining on his face. He had changed her very existence for all time. \"I'm not altogether certain I approve of you.\"</p><p>Laughter rumbled in his throat. \"Fortunately, your approval is not strictly necessary. Lifemates simply are. We have no choice in the matter. We are like two magnets that cannot be torn apart.\"</p><p>\"Great. I don't know a thing about you except I can't exactly bring you home to my mother and father. My family is very close, by the way.\"</p><p>He put her carefully on firm ground. Jubal and Ga-brielle rushed to her, flinging their arms around her and hugging her close. \"I had not noticed,\" Traian said with drawling amusement. \"We are not safe. We have to keep moving.\"</p><p>\"Wait, Traian,\" Jubal objected. \"We found something. Something really important. You said those vampires were hunting something. You have to take a look at this. I've never seen anything like it.\"</p> <p>Traian hadn't relinquished Joie's hand, even when her siblings dragged her into their arms. She felt a little silly holding hands - she'd never really done it, not even in high school. But there was something warm and comforting, something extraordinary about being close to Traian.</p><p>\"You can bring me home to your parents.\" He said it softly, honestly, as he followed Jubal and Gahrielle through a narrow hall. \"I would never embarrass you, or frighten them. I want to meet them. Anyone important to you is important to me.\"</p><p>Joie tried to prevent her heart from going crazy. She was no young girl, but a fully grown woman. A man shouldn't have such an effect on her, yet he did. There was honesty in his voice. A simple sincerity that shook her. She knew nothing about him, not even what he really was, yet she knew everything. She knew what kind of man he was. The knowledge was instinctive, the one thing she was certain of.</p><p>\"Where is your family?\" she asked.</p><p>\"I have only my people. My prince.\" His eyes gleamed a deep black in the soft glow of the helmet lights. \"You are my family. Your brother and sister have become my family.\" He arched an eyebrow at her. \"And we have only just met. A very strange concept for you, but completely natural to me. Lifemates are two people who meet and need to be together, two halves of the same whole. Finding a lifemate is what every Carpathian male dreams of and longs for and fights to keep our world together for, yet few of us ever gain such a treasure. I never thought to experience such an earth-shattering event.\"</p><p>\"Are you disappointed that I'm not what you thought I'd be?\"</p><p>Traian looked down at her. \"You do not yet understand the concept of lifemates. I am surprised and even shocked by the idea of a human lifemate, but I could never be disappointed with you. We were made for one another. We complete one another. You are fascinating to me. You always will be.\"</p><p>Joie hurried to catch up with her brother and sister, not wanting Traian to see the pleased grin she couldn't quite hide. Jubal turned toward a shallow alcove in the wall, directing his light onto the ice. There was a sudden silence as all of them held their breath. The creature encased in ice was large, an enormous beast with scales covering its body, a wedge-shaped head, a serpentine neck, and a long tail ending in a sharp spike. The wings were folded in close along the body. It had sharp claws for rending and tearing. One eye was wide open and staring at them through the thick wall of ice.</p><p>Joie let her breath out slowly. \"That's no dinosaur.\"</p><p>\"It has to be,\" Gabrielle said. \"It can't be a dragon. Don't tell me it's a dragon.\" She glared at Traian. \"There aren't vampires. You can't change your shape, and there aren't dragons. The air is bad down here and we're all having a mass hallucination. It can't be anything else.\"</p><p>\"Is it real, Traian?\" Jubal asked. There was awe, even reverence, in his voice.</p><p>\"Yes. It is real. I had no idea it was down here.\"</p><p>\"Do you think this is what the vampires are looking for?\" Joie asked.</p><p>Traian shook his head. \"They have no interest in the remains of a dragon. But this is definitely a cave the wizards used. I suspected as much. It could be a gold mine of information for our people. The wizards had incredible power and knowledge. It would be terrifying to think that the vampires might get hold of any of the power the wizards wielded. Do not touch anything. We must be very careful in here. The wizards used spells and traps to guard what belonged to them.\"</p><p>\"That's what you meant when you said the bridge could be a trap. You thought the wizards had made it,\" Jubal said.</p><p>Gabrielle held up her hand. \"We're talking about things found in fantasy books. Legends. Myths. There has never been evidence of dragons existing. Not even when dinosaurs roamed the earth.\" She reached out to touch her sister. \"Joie? Are you certain of this? Certain of this man? He flies through the air. He changes into a wolf. He can talk to you telepathically. He takes your blood like a vampire would.\" There was pleading in her voice.</p><p>Traian pulled Joie closer to him. He was well aware of Gabrielle's influence on Joie. He could easily read his lifemate's mind, just as he could pick up the thoughts of her siblings. Joie loved her brother and sister and would willingly sacrifice her own happiness for them if need be.</p><p>Joie felt the possession in Traian's touch, felt the brush of his mind in hers. She smiled up at him in reassurance. At the same time, she reached for Gabrielle's hand. \"The one thing that matters is family. And more than anything, we want each other to be happy,\" she explained to Traian. \"I know what I'm doing, Ga-brielle. You know I've always relied on my instincts. I know this is right. I don't understand any of it, but maybe I've been preparing for it all of my life. I fit with him. You're right, I don't know him yet, but I fit with him.\" She rubbed her face, smearing mud across it. \"A one and only sort of thing. Silly, but true.\"</p><p>Jubal groaned. \"Joie, I never thought you'd turn all mushy romantic on us.\"</p><p>Gabrielle exchanged a long look with Jubal and turned to Joie. \"Well, I suppose your life with him will always be interesting.\"</p><p>\"My sisters have already put gray in my hair. I won't survive Traian hanging around, howling at the moon, biting Joie's neck. And, just for the record, stay the hell away from mine, Traian. Having a woman bite my neck might be a turn-on - kinky, maybe, but I could handle it. Having a man bite my neck is out of the question. Doesn't do a thing for me,\" Jubal said dryly.</p><p>\"Ouch. That hurts, Jubal,\" Traian said. \"I was really looking forward to a snack later.\" He leaned down to brush the top of Joie's head with his chin. He had to touch her, keep reminding himself she was real. Even when they were speaking telepathically while he searched the complex of caves for whatever the vampires were frantic to find, he almost believed he had made her up.</p><p>Gabrielle managed a grin. \"Well, he fits in with our weird family, Joie. I can't wait to see Mom and Dad's reaction.\"</p><p>\"I need to seal this area off, slow the vampires down, and get all of you out of this cave,\" Traian said. \"I'm not so eager to leave,\" Joie responded, studying the huge body of the dragon. \"This is a treasure. There must be other fascinating things down here.\"</p><p>\"You are being hunted,\" Traian said severely. \"I am getting you out of here now. I will come back later and find whatever the vampires want so badly.\"</p><p>\"When you're alone,\" Joie said.</p><p>\"When I am alone,\" Traian confirmed. He urged them through the narrow hall. \"You must not touch anything, no matter how inviting it appears,\" he added as a precaution.</p><p>Jubal glanced at Joie. \"It isn't like you to agree to stay behind. Are you certain he doesn't have you under a spell?\" He groaned. \"That sounds so melodramatic and stupid. I can't believe I said it.\"</p><p>\"I'm a professional, Jubal, and I don't need to make a point. This is his area of expertise, not mine.\"</p><p>The hall opened into a gallery. Tall columns in a Gothic style were carved into the walls. The high cathedral ceiling was impressive. Pillars of ice and crystal formed two rows down the room, each holding several round globes of varying colors. Joie peered into one of the largest, a milky blue natural sapphire. As she stared at it, the color deepened, darkened, began to swirl with alarming speed. Mesmerized, she moved closer. The ground beneath her tilted, rippled. She felt a pulling, a drawing as if the swirling sphere called to her.</p><p>Traian clapped his hand over her eyes and pulled her away from the globe. \"Do not look at them. Gabrielle, come away from there.\" There was urgency in his normally calm tone. \"Jubal, just pull her with you. I can feel the aura of power in all of these objects. Until we know what they are, we need to give them a wide berth.\"</p><p>Joie was stunned that she had been so quickly pulled into the globe's influence. \"I thought wizards were supposed to be good.\"</p><p>\"Absolute power corrupts. It is something one learns when one's life spans hundreds of years.\" Traian crowded close to Joie, keeping his body between her and the tall pillars.</p><p>Joie laughed. \"Don't let Jubal or Gabrielle hear you say that. If you tell them you've been alive for a few hundred years, they might change their minds about us.\"</p><p>\"I heard it already,\" Jubal said. He was pacing right behind Gabrielle, pushing her through the long, wide-open room. There were clear crystal sculptures of mythical creatures. Small, blood-red pyramids made of stone were set into chiseled-out archways in the walls. It was difficult not to stare at the gems and strange objects surrounding them, but Traian was obviously fearful of their safety, and they were ever conscious of the deadly creatures following them.</p><p>A deep boom shook the network of caverns. They stopped in the last one and stared at a solid wall in front of them. \"There has to be a way out,\" Traian said. \"Wizards were not able to shape-shift or fly. They were much as you are. There must be an opening leading to the surface.\"</p><p>\"We have our gear,\" Joie pointed out. \"We can use it to climb.\"</p><p>\"Not with vampires so close on our heels. They will not need gear to climb. They can take to the air to pursue you. They hit the trap I set for them and were buried under a mudslide, but it will only slow them down. Look for something that does not feel right. There will be a hallway leading up to the entrance.\"</p><p>\"Like the rocks outside the cave. The pattern was all wrong,\" Joie said. \"Jubal, you're good at patterns. Find us the opening, and hurry. Jubal's rather infamous in our family for his mathematical mind,\" she told Traian.</p><p>\"He can see a pattern in just about anything. That's how he makes all his money.\"</p><p>They could hear scratching, a terrible sound amplified by the acoustics of the cavernous room. Great claws scraping at the earth, digging to get at them. They spread out, walked along the wall, carefully examining every surface. All the while they could hear the vampires tunneling furiously through the mud and ice. The sounds grew louder, closer, and Traian dropped back, facing the wall where the creatures were certain to break through.</p><p>\"I've got it!\" Jubal said triumphantly. \"We were expecting up, but it's down. The floor. See the pattern on the floor, Joie?\"</p><p>\"Open it,\" Traian said tersely, not looking, his attention centered completely on the far wall.</p><p>Jubal studied the squares, pyramids, and starburst patterns of stone beneath the layers of muddy ice. In the center of each symbol were hieroglyphics, pictures carved into each stone. He stepped on various ones, taking his time, choosing each stone carefully, following the pattern he could see laid out before him.</p><p>At last a large stone slid aside to reveal steps carved into the ice. Jubal hesitated. \"Are you certain this is the way?\"</p><p>\"It has to be the way,\" Traian said. \"Take your sisters and go.\"</p><p>Jubal was cautious, shining his light down the narrow staircase. The stairs appeared to be a bridge over a dark, fathomless abyss. \"It's another bridge, Traian. Do I trust it?\"</p><p>\"You have to. It must have been their way out.\"</p><p>Jubal took a deep breath and stepped onto the first stair, found it solid, and reached back to aid Gabrielle. \"Hurry, Joie.\"</p><p>\"Come with us, Traian,\" Joie pleaded.</p><p>Water gushed in a dark, muddy stream from the side of the wall. Insects poured into the gallery. The wall to Traian's left collapsed in an oozing pool of dark sludge.</p><p>Two hideous creatures flopped onto the floor of the chamber, abominations in the crystal perfection of the room. Gaunt and cadaverous, they were covered in black muck. Baring their jagged, spiked teeth, they stared at Traian from red-rimmed eyes filled with venomous hatred. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Gabrielle, run,\" Joie urged. Fear clawed at her insides, but she dropped back to protect her sister and brother. \"Jubal, go, don't look back.\" She would always stand between her brother and sister and danger. And she couldn't leave Traian. She wouldn't leave him. Not to face hideous monsters on his own. It didn't matter that he claimed to have hunted vampires all his life, she was incapable of abandoning anyone to face danger alone. And somehow, Traian was connected to her. A part of her blood and bones. Of her heart and soul. She would stand with him.</p><p>Jubal caught Gabrielle's hand and jerked her down the stairs in a race for their lives. Behind him, the thick slab of stone slid back into place, locking Joie in the cavern above them. She was grateful and relieved that her brother knew her well enough not to waste precious time arguing and that she could count on him to protect Gabrielle.</p><p>Both her knives were gone. Joie always carried two, but she'd used both, one on the vampire feeding on Traian, the other in the eye of the pool. She kept a distance from Traian, giving him room to fight. She could taste fear in her mouth. She had no gun, no knife.</p><p>My fourth dan black belt doesn't look too promising considering that those very nasty things have wicked-looking talons and mouths full of shark teeth. We could use a gun or two. Maybe a machine gun. Stay close to me. I want you where I can protect you. They can move the earth, rain down missiles from the ceiling. They will not fight in the way you expect.</p> <p>Traian had never really experienced gut-wrenching, bone-deep fear before. He had never had anything to lose. Now there was everything. A woman whose mind he walked in, whose body he didn't yet know intimately.</p><p>I gathered that.</p><p>For some reason her simple words made him relax, want to smile. Joie didn't panic easily. She didn't lack for courage and she was committed to fighting with him. She wasn't going to faint because vampires were real and had come with vengeance and death in mind.</p><p>Don't count on it.</p><p>Her wry amusement told him she was a shadow in his mind, looking for strategy on how to defeat the enemy.</p> <p>If they get their hands on me, I'll be trying to faint. Do they have a weakness? Ego.</p><p>Joie took a deep breath as the creatures slowly pulled themselves up to their impressive heights. Fire burned in their eyes. A foul stench permeated the cavern, choked off all the cool, clean air and replaced it with a thick putrid substance.</p><p>Which is the stronger?</p><p>Traian noted her calm manner. She accepted that they would have to fight their way clear. Having battled with the same vampires on three occasions, Traian was well aware of their strengths and capabilities.</p><p>The one with the incisors over his lower lip he is extremely powerful. He is called Valenteen and is a master vampire. The other is called Shafe. There might be more, so stay very alert. Well, darny and here I was expecting I'd take a nap.</p><p>Traian worked at keeping a straight face. Even in their desperate situation, Joie could let him know her feelings.</p> <p>I was worried you might be.</p><p>Joie tapped her foot. \"If it isn't the troll brothers. How are you? Just dropped in to be neighborly? I'm so glad you didn't bother to dress formally. It's just a small get-together we're having.\" Deliberately she walked across the stone patterns in the floor, keeping their attention centered on her. \"We're in the midst of redecorating. What do you think? Too many crystal balls?\" She indicated the largest, nearly a foot tall, resting on a tall pillar of black obsidian. \"They're very valuable. You can see your future in them. This one answers questions and finds objects.\" She reached out as if to pat the smooth sphere.</p><p>Joie was fully aware that Traian was keeping his body between her and the vampires. The two creatures stood in a swirl of steam and mist, coated in black ooze. The moment she mentioned the spheres, greedy eyes stared at the globe.</p><p>Surprisingly, Joie felt warmth along her palm as she positioned it above the crystal ball. The crystal had leapt to life at the close proximity of her hand. For a timeless moment, she saw her own face swirling in the mists of the globe, she saw Traian standing behind her, reaching for her, love etched into the lines of his face, hunger and desire burning in the depths of his eyes. She couldn't look away from him, from the intensity of his love. He couldn't feel that way about her, could he? He didn't know her. How could two people be so drawn to one another, recognize love so quickly?</p><p>Get away from that thing.</p><p>Joie blinked, looked up. The white swirls of mist were filling the cavern, consuming Traian. Consuming her. In the tendrils of fog, something moved. Something dark and menacing. She caught a glimpse of another shape in the shadows curled protectively around an object, but she couldn't make it out with the white mist and gray shadows merging together. A dark shadow loomed over Traian.</p><p>Watch out!</p><p>She tackled him. Shoved him aside. Her momentum carried them both away from the vampires and close to the outer wall of the cavern. An array of weapons adorned the nearest alcove. Glittering gems decorated wicked-looking knives and long spears and swords. Here was a virtual treasure trove for Joie. She was drawn to the weapons, yet something held her back, some finely tuned warning system that prompted her to put her hands behind her back and ignore them.</p> <p>Traian calmly regarded the black shadow that was emerging from the fog in the cavern. \"Justice has come, Valenteen,\" he said to the master vampire. \"A shadow warrior has been awakened and he is seeking our deaths. Do we fight each other?\"</p><p>Valenteen growled harshly, shaking his head, backing away from the large, smoky creature emerging from the shadows.</p><p>Joie twisted her fingers in the back of Traian's shirt, peeking around him at the thing Traian had identified as a shadow warrior. It was insubstantial, made of ever-moving black and gray smoke. It's eyes glowed an eerie red, not like the bloodshot eyes of the vampires, but fierce flame burning brightly.</p><p>I wouldn't mind waking up now.</p><p>Traian reached behind him, circling her bare wrist with his fingers. Gently. Barely there. Just a whisper of contact, yet it was enough. They were together. It was all that mattered. He would shield her from the warrior, from the vampires.</p><p>Can you get out of here by yourself?</p><p>It suddenly occurred to her that he could shape-shift, perhaps become as insubstantial as the mist. Maybe even burrow through earth and ice as the vampires had done.</p><p>The vampires dissolved, leaving behind a pool of black goo. It bubbled and spat a poisonous brew at the shadow warrior. Joie gasped. There was a strange silence. An icy blast of air cleared the stench from the chamber and pushed the smoky creature away from Traian and Joie.</p><p>It matters little if I could. I would never leave you behind.</p><p>His voice was reassuring. Calm. Steady. Confident.</p><p>Jubal and Gabrielle are still in the caves. Jubal will be hurrying to find his way up toward an entrance. He's a good caver, but if they go after him... My brother and sister can't protect themselves from the vampires. Both vampires have remained in this room. They will not leave or move to give away their presence to the warrior. I do not sense any others close by. The shadow warrior has not attacked because we haven't touched anything. If we draw his attention to us, or take something the wizards left behind, he will strike.</p><p>Voices whispered. Filled the chamber with temptation. Before she knew what she was doing, Joie's fingers were nearly curled around a knife with a wicked-looking curved blade. It called to her. Her palm itched to feel the weapon in her hand. She clenched her fist, resisting the temptation. The voices increased in strength. She glanced toward the spheres, saw them all active, the clear colors swirling with life, with deeper hues and sparkling gems.</p><p>Traian caught both of her hands in his.</p><p>Talk to me. Tell me about yourself. Everything you can think of. Look only at me. Look into my eyes. See me. Only me.</p><p>His hands were much larger than hers, enveloping them. When she obediently tore her gaze from the jeweled daggers and knives, she was caught in the black depths of Traian's gaze. The world narrowed for her.</p><p>Around them, smoke and mist drifted upward from the floor, creating a world in the clouds where voices muttered, the words in an ancient tongue, harsh, yet not foul, insistent, yet not commanding. Colors pulsed in the room, bright banners from the spheres, which were alive with heat and energy.</p><p>Look only at me, Traian reiterated when she would have turned her head toward the pulsing lights.</p><p>This is a trap. Think of me. Let me tell you who I am, what I am. What I need and want. I want to know everything about you and your family. Talk to me. Tell me who you really are, what you stand for. Tell me what you need and want.</p><p>His voice was mesmerizing, tugging at her heart when she thought there should be only physical attraction. He was easily the sexiest man she'd ever encountered. They were in mortal danger. Vampires huddled somewhere in the room, awaiting their moment to strike. A warrior come to life out of the shadows guarded centuries-old treasures in a world of sorcery, yet Joie was fascinated by the man in front of her.</p><p>You don't make sense. I make perfect sense.</p><p>He smiled, a flash of dazzling white teeth. She nearly stopped breathing.</p><p>You know I work as a bodyguard. Silly profession, placing your precious body between someone else and danger.</p><p>She laughed softly in her mind. Traian felt the vibration pulse through his body, touch him in places he had long ago forgotten.</p><p>You spent several lifetimes chasing vampires. I'm catching very interesting memories in your mind, unless you spent all of your life watching Dracula movies. I think you've placed your precious and very sexy body between danger and people many times. And don't say you're a man and that it makes a difference. That would seriously annoy me.</p><p>Growls of hatred mixed with the insidious whispers. The smaller vampire, the one Traian had identified as Shafe, emerged from the black goo, hissing and spitting, dragging himself across the floor on his belly. His claws scored the stones as he tried to stop himself from answering the summons. His eyes were on the largest crystal ball.</p><p>Even with Traian's mesmerizing eyes and hypnotic voice, it was nearly impossible for Joie to ignore the drama being played out in the swirling mists of the cave. The voices were insistent, chanting a steady rhythm, drawing the vampire toward the glowing crystal. Greed and fear were on the face of the creature as it edged closer and closer. All the while, the dark shadow of the warrior, guardian of the wizard's treasures, watched dispassionately.</p><p>Joie shivered. Fear was a living, breathing entity nearly choking her. At times, through the rising mist coming off the stone floor, she could make out a suit of armor on the warrior; at other times it was as insubstantial as the clouds.</p><p>Traian pulled Joie into his arms, drawing her tightly against his chest. His movements were deliberately slow, careful, wary of drawing the warrior's attention to them.</p><p>We are going to float upward, Joie, just drift toward the ceiling above us.</p><p>She was afraid. Battling human adversaries was one thing; facing down vampires and warriors made up of smoke and shadow was something altogether different. She slid her palm up Traian's chest, the solid wall of flesh and blood reassuring her. Her arm curved around his neck. She locked her fingers there, fitting her body tightly against his. His much more masculine frame was hard like an oak tree. There was little give to the defined muscles beneath his skin. She felt her feet leave the ground and she closed her eyes, sending up a quick prayer.</p><p>Traian watched the warrior. Colored lights pulsed through the cavern, lit the mist so that wraithlike creatures appeared to be moving within it. Ghosts of the wizards, lost so long ago. He tightened his arms around Joie. She fit perfectly to him, her mind comfortable in his, drawing knowledge and studying tactics. He could feel her there inside him, sharing his memories and gathering information on his battles with vampires, fully prepared to join him should there be need.</p><p>More than anything else, he wanted her to know him as a man. He wanted time with her. He wanted to hear her laugh, to see warmth and acceptance in her eyes the way he had imagined during their long-distance chats. And he wanted her out of danger. Things were going to happen fast and ferociously. He focused on one thing. Getting Joie to safety.</p><p>They drifted higher in the cavern, and Traian clouded their image with more mist, more smoke, so that they seemed part of the haze. He took care that their movements were slow and lazy and as natural as possible, so that nothing would trigger the instincts of the warrior.</p><p>The shadow creature was motionless, even while the smoke that made up its body whirled and spun in dark threads. The fierce eyes remained fixed on the vampire crawling toward the temptation of the pulsing crystal orb. Shafe drew closer, closer, reaching out to the visions and promises of wealth and power swirling inside the globe.</p><p>Triumphantly the vampire placed his palms around the beckoning crystal. The moment he touched the globe, the shadow warrior threw back its head and roared. For a brief moment the smoke around it cleared. It stood tall and straight, dressed in glittering multihued scaled armor. And then it was smoke again, rushing across the wide expanse of floor, not quite touching the ground.</p><p>Valenteen, the older vampire, oozed from the black pool, shifting into the form of a snake. It slithered to the nearest wall and began to burrow through the earth. Joie strained to see below her, to see the shadow warrior as he reached the undead cupping the crystal ball.</p><p>Your light. Turn it off.</p><p>Her heart jumped.</p><p>We need the light. I see fine in the dark. We want to escape this chamber. I can take us through the air shaft and do not want to chance drawing the warrior's attention.</p><p>As she doused the light, Shafe screamed hideously. Colors glowed in the rising mist. A dark blood-red stain slowly began to invade the smoky fog. It spread like a virus. A violent clash of light and sound conjoined as the vampire's voice shrieked and wailed until Joie buried her face in Traian's neck.</p><p>She was trembling. His gut knotted.</p><p>We are almost out. Do not look. This is a trap and we will seal it up so no others can find it. You're thinking you'll come back tomorrow night and find out what the vampires were searching for. I have to find out. I have been in these caves several weeks, fighting the vampires on and off. I destroyed more than one, yet they remained. That is highly unusual and it worries me. Worse still is the fact that Valenteen was not the only master. There was another in the group, Gallent. I was able, after several battles, to destroy him, but he was clearly with this group. And I sense another...</p><p>Joie sighed and hugged him tighter.</p><p>This is not happy news. Sounds like our gang problems. We'd better start looking on the Internet for a site called vampires of the world, unite.</p><p>Above her head, he smiled.</p><p>It had not occurred to me to check there, but if we find such a thing, are you volunteering for undercover work?</p><p>She made a small growling noise of dissent and bit his shoulder hard.</p><p>The air shaft was narrow, but he angled their bodies until they slipped through, taking them to the upper levels. As soon as she felt the ground beneath her feet, she turned on her light, caught his hand, and sprinted through the tunnel toward the entrance.</p><p>\"Valenteen is not following us. Although he is a master vampire, he will not attempt to fight me alone.\"</p><p>His words stopped her. Joie wanted to make sure that Jubal and Gabrielle had made it to safety, but the idea that a creature as hideous and lethal as a vampire wouldn't fight Traian alone was frightening. What did she know of him, after all? He was a voice speaking to her in the night. A man who drank blood and shifted shapes.</p><p>\"I am a man of honor. A man who has found the one woman. The only woman.\" He put a gentle hand on her shoulder. \"I know this happened too fast and you do not altogether trust it.\"</p><p>\"If I don't think about it, I trust it, and that scares me, Traian. I'm not particularly a trusting person. All this time I thought I was still in control after all, I did rescue you. But now you're saying those creatures won't attack you while they're alone.\"</p><p>\"I am an ancient hunter. I have been tried in battle for more years than I care to remember. I know the ways of the vampire and I am much skilled in what I do.\" There was no arrogance or bravado in his voice, only acceptance and truth.</p><p>\"And these vampires?\"</p><p>\"Should not have been together. They should not be here, in the Carpathian Mountains, so close to our prince and many of our males. I was returning to my homeland when I first came across them. I knew they were desperate to find something in that cave. Although it was risky to pit myself against so many, it was my duty to my people to stay and discover what they were looking for. Even after you found me and I recognized who you were, I stayed because the vampires were so frantic to find something. I had no idea this was a cave of wizards.\"</p><p>\"And what is the significance of wizards to a vampire? I know what it would be to humans. Most of us don't actually believe the fairy tales about wizards and crystal balls. And dragons. That was very cool, by the way.\"</p><p>\"You saw the spheres in that room. Ancient spells and power remain in them. We don't want vampires, or anyone, for that matter, to get their hands on things best left alone. Carpathians are of the Earth. We have gifts, but we do not wield power in the same way as the wizards did.\"</p><p>\"Is it possible some are still alive?\"</p><p>\"I would think It likely. At least I would think some of their descendants remain and have retained their knowledge, or at least a portion of it.\"</p><p>Joie sighed. \"Lovely thought. Anyone who created that shadow warrior is not going to be counted among my best friends.\"</p><p>\"Nor mine.\"</p><p>Joie followed him through the long hall, not looking at the beauty and magnificence of her surroundings as she normally would. She turned the information over in her mind. \"You grew up a long time ago.\"</p><p>He grinned at her, his teeth flashing in the light of her lantern. \"Well, yes. I have lived for centuries. I barely remember my parents anymore.\" His smile slipped away. \"The memory of my childhood days has faded. I catch glimpses at times. I do recall the years just before leaving my homeland. The way the prince looked at us all. I saw it in his eyes. His own death, the decline of our people, his dread for all of the warriors he was sending away from home. Our women were so few, even then the numbers were declining. Back then we had alliances with humans. Now we keep to ourselves and just do our best to blend in.\"</p><p>She listened to the sound of his voice and heard the sorrow that ran deep. In his mind she saw the battles, sometimes with childhood friends. Saw his inner demons, the insidious whispers of power, the dark stain that slowly spread over him, calling to him. And he was always alone. In every memory, he was always alone. Joie wanted to comfort him. She caught his hand, tangled her fingers with his. She meant it to be a brief gesture, but he tightened his grip.</p><p>\"I grew up very differently,\" she said, ducking her head to avoid a large crystal formation. \"My family is very close and very loving. We all talk at the same time and give each other all sorts of unwanted advice. My dad tells outrageous stories. He used to sneak into our bedroom at night with a flashlight shining on his face and tell scary stories until we screamed and laughed and Mom came running in to chastise him. We all knew she knew he was doing it, and she was really laughing, too. Once, after he read us Stephen King's Cujo, he put whipped cream on the muzzle of our huge mutt and shoved him into the bedroom. It's a wonder we all survived his sense of humor.\"</p><p>She laughed at the memory, deliberately sharing with Traian the warmth of her childhood, the love in her family. \"We're all a little bit crazy, but it's okay with us.\"</p><p>\"Do you think I will fit in?\" He brought her hand to his chest and held it against his heart. \"I would not mind having a family after all this time.\"</p><p>He was a tall man with wide shoulders and eyes that had seen far too much, yet the lost note in his voice turned her heart over. Joie smiled at him. \"I can't wait for you to meet my mother.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The night air was crisp and clean and so fresh, Joie gratefully dragged it deep into her lungs. Fear was dissipating now that she was out in the open. She pulled her helmet from her head to allow the wind to comb through her hair. Stretching her arms toward the moon, she laughed softly. \"I love the night. I love everything about it. It doesn't matter if its stormy or not.\"</p><p>She turned her head to look at Traian. His face was beautiful in the moonlight. \"Worthy of a Greek god,\" she murmured, astonished that she felt so much for him, that her emotions were so strong and connected with his. His hair fell like black silk around his face to his shoulders. There wasn't so much as a smear of mud on his face. All traces of blood were gone from his chest, leaving only the raw gashes on his flesh.</p><p>Joie shook her head, stepping away from him, putting distance between them. She needed space, needed to find balance. \"Thanks a lot for leaving me standing filthy and wet all by myself while you're all shined up and looking good. I'm not even going to ask how you did that.\"</p><p>His teeth gleamed at her, more the smile of a wolf than a man. \"I have my little secrets. You are shivering. Hand me your pack and take this jacket.\" He enfolded her in the warmth of a suit jacket.</p> <p>Joie decided not to ask him where he found the jacket either. \"How did you find the way out? I couldn't see a thing.\" She sank down because all at once she was tired and she wanted to feel the ground under her. Traian had changed her entire life in the blink of an eye, and she didn't want to think too much about the bizarre world he lived in.</p><p>\"There were signs if you knew what to look for. In the old times, Carpathians and Wizards were not enemies. We lived side by side and enjoyed the benefits of both races. We often used the same glyphs. I saw them as we moved through the halls.\" He crouched down beside her, touched her chin with gentle fingers. \"Let me take you back to the inn where you are staying. You are tired and hungry and want a shower. You are also very worried about your brother and sister. You needn't be. I planted the symbols in your brother's mind to assure that they would find their way out quickly.\"</p><p>\"Thank you, that was thoughtful of you. I was concerned, although both are experienced cavers. I just wanted them safe and away from vampires and traps. They'll be worried about me. I know Jubal hated leaving me behind, but he'll want to get Gabrielle back to safety as soon as possible. He'll take her straight to the inn.\" Joie swept a hand through her hair, pushing it back from her face. \"I am tired, Traian. I feel as if I could sleep for a month.\"</p><p>He drew her to her feet, then simply lifted her, cradling her against his chest. Joie burst out laughing. \"This is so medieval. Male carries little woman over mountain. Oh, the utter humiliation of it all.\" She wrapped her arms more tightly around his neck in case he thought to put her down. Joie allowed her head to drop back as she scanned the heavens. \"If you ever tell a single soul I let you do this, I'll have to hurt you. I just want to be very clear on this.\"</p><p>Traian wanted to kiss her. More than anything, it seemed necessary to bend his head and find her mouth with his. Just taste her. Put in his claim. \"What is your position on kissing?\"</p> <p>Joie stared up his mouth. The wicked, sinful temptation of it. \"I'm thinking it over,\" she conceded. \"If I let you kiss me, I'll melt on the spot. That's a given. I already know that, and it's so very humiliating. Worse than being carried around like I'm a fainting, weak bundle of femininity.\"</p><p>\"True, but it would be worth it,\" he pointed out seriously.</p><p>She sighed and lifted her hand to his face, her fingertips tracing his sinful mouth. \"Yes. But there's another consideration, Traian. You're going to be addicting. And then I won't be able to get you out of my system and I'll get all weepy when we have to part, and that's just more than I can bear, crying over some idiot man. Do you see the complications here?\"</p><p>\"Hmmm. I do see that might be a problem if we were ever to part, but since we are truly lifemates and have no choice but to be together, I do not really think it is of much importance. In fact, under the circumstances, being addicted to my kisses would be an asset.\" His strong teeth nipped her finger.</p><p>\"The lifemate thing - see? That's part of the problem. I have this overwhelming need to be mistress of my own fate. I don't think I'm cut out to be a lifemate if it entails a have to sort of relationship. I'm a want to sort of woman. There is a difference.\"</p><p>\"That is good, Joie. I do not foresee any problems whatsoever, because as we think so much alike. I am definitely a want to sort of man. And I want to kiss you.\"</p> <p>There was a devilish smirk on his face, one she couldn't possibly resist. And who wanted to anyway? His mouth was descending toward hers, and Joie lifted her face to meet him halfway. Because this kiss was her choice, and he needed to know it.</p><p>Her lips were soft, yielding, welcoming even. After all the long centuries, Traian felt like he had come home. It didn't matter where they were, whose world they were in, she would always be home to him. The Earth stopped spinning, just as he knew it would. Bursts of starfire rained down around them. The embers smoldering deep in his belly burst into flame and raged through his bloodstream. His body knew her almost as intimately as his soul, though he hadn't even really touched her yet.</p><p>Joie couldn't think, couldn't breathe, forgot whether it was night or day. It was impossible to get her brain to function. She could only feel. Nothing had prepared her for the unrelenting pressure building so swiftly in her body, the heat rising, flames dancing along her skin, creating an inferno deep inside. Passion coiled tighter and tighter, a spring threatening to explode. Her breasts ached. Her fingers found the silk of his hair, crushed the thick mass in her palm. \"You shouldn't be able to do this to me,\" she whispered into his mouth. Into his heart. \"I don't let anyone inside.\"</p><p>\"I am already inside you.\" His lips took hers again, over and over, long, drugging kisses that shook them both.</p><p>\"It has to be the danger factor,\" she said. \"It's the only logical explanation.\"</p><p>\"Is there logic? I cannot remember.\" He couldn't get enough of her. Mud from her face smeared his. Her clothes were wet, soaking his. His wounds burned, but he couldn't feel the discomfort when his body was so heavy and hard with need.</p><p>His voice shook her. It was possessive. Husky. Perfect. A seduction in itself. It was Joie who pulled away, framing his face with her hands. She rested her forehead against his. \"I need a minute here. I can't breathe, or think, or want anything but you.\"</p><p>His mouth curved into a smile. \"Is that supposed to stop me?\"</p> <p>Her gray eyes studied every inch of his face. He could see her confusion. \"Why do I feel like this? Does this make sense to you, Traian? I don't jump into relationships. All I can think about is having sex with you. Not just sex - wild, uninhibited sex.\"</p><p>His smile widened. \"I think kissing you is the best idea I have ever had.\"</p><p>She couldn't help smiling back. He made her happy in a way she never had been. Complete when she hadn't known a part of her was missing. \"Why you? You aren't even human.\"</p><p>\"Your entire family has telepathic abilities. Are you certain you are human?\"</p><p>Laughter spilled over. \"Please don't ever ask my father that. He's outrageous, and he'll tell you some absolutely horrible and untrue tall tale, and we'll all be mortified.\"</p><p>The raw affection in her voice told him her father's outrageous stories never really mortified her and she loved the man very much. \"That gives me hope. At least I know you plan on introducing me to your parents, but the list of dos and don'ts is growing.\" He bent his head to steal another kiss. \"Hang on. I am about to take you flying.\"</p><p>She made a noise somewhere between laughter and strangling. \"Has it occurred to you I might be afraid of flying?\"</p><p>\"You were engaged in astral projection the first time I laid eyes on you,\" he pointed out.</p><p>\"I thought it was drug-induced,\" she admitted. \"I'd been experimenting, but I didn't really believe I was actually accomplishing it. I thought I just sort of hypnotized myself. I would never have been so open with you had I thought you were real.\" Joie turned her face up to the sky, her head cradled on his shoulder.</p><p>\"Then I am glad you thought you made me up. I think I will like your family very much. I have not had a family in so many years, the idea of one did not occur to me. Yet now, when I watch you with your brother and sister and feel the love you have for them, it makes me envious.\"</p><p>Her heart turned over at the longing in his voice. Joie had never thought she would feel so intensely about a man. The mere tone he used could make her shiver like the caress of fingers, or wrap around her heart like a fist. \"I've never wanted to give myself to anyone, not wholly,\" she admitted, looking up at him. \"Not all of me. I didn't want anyone to see inside me. But you already do, don't you?\"</p><p>\"Yes.\" Holding her close, protectively, he took to the air.</p><p>They soared across a night sky so dark it was nearly purple. A blanket of stars sparkled overhead. The few remaining storm clouds drifted rather than spun. Far below them the ground dropped away - mountains and valleys, forests and lakes hiding secrets best kept hidden for all time. A mixture of old and new.</p><p>Joie's breath caught in her throat. She was half terrified and half fascinated at the shape Traian had assumed. He had the enormous wings of a huge owl, yet human arms held her against the soft, feathered breast. The feathers tickled her skin, sent a shiver down her spine when she realized it was all too real.</p><p>Is this not better than thinking you are crazy?</p><p>The masculine amusement would have earned him a punch had they been on the ground. Sheer exhilaration was taking the place of fear.</p><p>I'm not certain I want you running around in my brain. It was perfectly natural to think I was hearing voices. Even when you are able to speak to your brother and sister telepathically? That's entirely different. We've always been able to speak to one another, but not anyone else. We just thought it was a Sanders sort of thing. My mom and dad can do it too. It could be considered arrogance to think that only your family was capable of telepathic communication.</p><p>Lights from the inn lit the ground below them. Traian dropped to earth some distance from the building, where the shadows were deep. Music spilled out of the two-story building, floating out in all directions. People mingled on the wraparound verandah and on most of the balconies, some dancing, some talking, and others pressed close to one another.</p><p>\"The festival,\" Joie said. \"I forgot about it. Look at me - I'm a mess.\"</p><p>\"You look beautiful to me,\" Traian objected. \"Which room is yours?\"</p><p>\"Second story, third balcony on the left.\" She grinned at him. \"Are we floating?\"</p><p>\"Is the window locked?\"</p><p>\"That wouldn't stop me. I have second-story skills.\"</p><p>His eyebrow shot up. \"I am very impressed. I am a hunter and I am certain those skills could come in handy.\"</p><p>She narrowed her gaze, locking her fingers behind his neck. \"They come in handy for a bodyguard. I do have a business, and I'm known to be one of the best.\"</p><p>\"I'm sure you are.\" He took her into the sky fast, enjoying the way she clung to him, tightening her arms and gasping as he shot up.</p><p>Don't you laugh at me. I'm not laughing. I can feel you laughing. You know, it isn't normal to fly through the sky. It is normal for me.</p><p>The balcony floor felt solid beneath her feet. She let go of his neck immediately. \"Great, I would have to do this with a hundred people around.\"</p><p>\"They cannot see you. I have shielded us from their eyes.\"</p><p>She glanced at him over her shoulder. \"We're invisible? Sheesh. Is your life easy or what? I wouldn't mind being invisible in my line of work. No wonder those things are afraid of you.\"</p><p>\"They fly, and they can cloak their presence as well.\"</p><p>Joie pushed open the door to her room. \"How perfectly charming of them. Where do they come from?\"</p><p>Traian followed her into the room. She heard his heavy sigh and turned around to face him. \"I'm not going to like your answer.\"</p><p>\"Vampires are Carpathians who have chosen to give up their souls for a brief moment of power, the thrill of the kill. Our males lose their emotions and the ability to see in color after the first two hundred years of existence. Some earlier, some later, but all of us eventually lose everything we hold sacred if we do not find a life-mate. Our race has few women and fewer children. We are on the verge of extinction. There is little hope, and more and more of our males are turning.\"</p><p>There was compassion in her eyes. \"How terribly sad for all of you. So you and the other hunters are forced to police the vampires. Even if they were once boyhood friends... or family.\"</p><p>He nodded, astonished at the wealth of understanding he read in her expression. She clearly saw what others did not: deep below the surface, every destruction of a childhood friend or cousin had cut pieces out of his soul until he feared there was little left. Yet her understanding, the compassion washing over him, changed something. He felt it, felt the first healing touch and the power a lifemate wielded. She stood there in her filthy clothes with mud smeared all over her face, and she was beautiful to him. A lump the size of his fist rose in his throat, and he turned away from her, afraid of allowing her to see the emotion threatening to choke him. How could she possibly understand what she meant to him? \"I'm sorry, Traian. I know I can't begin to understand what it must have been like, but I feel the weight of it in your mind.\" More than that, she felt how alone he had been. The intensity of his pain shook her. His life had been stark. Ugly. Bleak. She caught frightening glimpses of scenes in his past. Terrible battles that lasted for hours. Severe injuries. Death all around him. No one to comfort him. No one to care.</p><p>\"This is becoming a habit.\"</p><p>Joie closed her eyes briefly, overwhelmed by longing, by the need to wrap her arms around him and just hold him. \"I have to contact Jubal and Gabrielle. I can feel that they're close, so I'm certain they made it.\" When she picked up the phone to dial their rooms, her hand was trembling.</p><p>Traian waited while she talked to her siblings, assuring them she was fine and that she would meet them downstairs after she showered. She was instantly relaxed, laughing, her voice soft with love, firm with reassurance. He had forgotten so much. Just the tone of her voice brought back memories of his life before he left his homeland to answer the call of his prince.</p><p>Joie was uncomfortably aware of her appearance now that Traian was staring at her. \"I need to take a shower.\"</p><p>\"Is that an invitation?\"</p><p>She stared at him, at the hard angles and planes of his face. At his dark, fathomless eyes. If the attraction between them was merely physical, Joie would have thrown him on the bed and ripped his clothes off right there. But he stirred unfamiliar feelings in her. Deep and frightening feelings for a woman in charge of her own destiny.</p><p>With indecision written so clearly on her face, Traian felt as if his world was balanced on the point of a needle. He was afraid to move. Afraid to speak. He knew their joining was inevitable. He would have her. She was his. She belonged to him. But he still wanted it to be her decision. He wanted her to want him in the same way he wanted her.</p><p>\"It's a small shower stall,\" she said.</p><p>She put both hands behind her back and knew that she was afraid of the next step. But she took it because she was nothing if not courageous. She lifted her chin and smiled at him in invitation.</p><p>He didn't wait for her to come to him; he took the few steps separating them and swept her up into his arms. Joie smiled at him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Steam fogged the clear glass of the shower door, rose up to curl around the two bodies standing beneath the spray of hot water. Joie allowed the water to pour over her, drenching her hair and skin, washing the grime from her body. The shower stall was small, forcing her into close contact with Traian. She thought she was completely prepared for the sight of his very masculine body, but found she could barely breathe. He was all defined muscle, his chest wide, his hips narrow. She dared not look below his waist. The man had no modesty when it came to his desires. And he desired her.</p><p>\"Are you going to keep scooting back every time I get close to you?\"</p><p>There was a hint of amusement in his voice. His tone was like velvet, sliding over her exposed skin, setting every nerve ending on alert. Her mouth went dry. \"It's the only safe thing to do. Before I actually met you, I thought about having you all to myself, alone and naked and...\" She trailed off a little desperately. The erotic fantasies were wonderful when he wasn't standing in front of her, larger than life and still nearly a stranger. \"Now I have absolutely no idea what I'm going to do with you.\"</p><p>\"I distinctly remember you telling me you had lovers lined up,\" he said, his hands framing her face, his thumb tilting her chin so that her gaze met his. \"What were you planning to do with all of them?\"</p> <p>There was a little bite to his voice and his white teeth came together with a definite snap. Joie tried not to let the sudden smile blossoming inside her show on her face. \"You weren't real. I could say anything.\" It was impossible to look away from the dark intensity of his eyes, the hunger there. His emotions were as naked as his body. \"I keep thinking this is happening too fast. I don't really know you. How did I end up bringing you to my room? Standing naked in the shower with you? I'm a private person, and not very trusting, yet here you are.\"</p><p>It was all he could do not to kiss her. Traian knew he could easily sweep aside her every objection. The attraction between them was mutual. Electric. All-consuming. She would respond to him with the same fierce need he had for her. \"Joie.\" He whispered her name, an ache in his voice. \"If you want to talk about this, I suggest we get out of the shower and put the width of the room between us. We have been in each other's minds for weeks. You know me. You know more about me than most people could learn in a lifetime. You know my character and what I stand for. And you know this is no passing fling. This is forever.\"</p><p>\"Forever.\" She tasted the word. \"That's a long time, Traian.\" The water poured over her body and steam encircled them as she leaned into him so that the tips of her breasts pressed against his chest. She felt him hard and thick and heavy with a man's need, a temptation and a pleading. \"You're asking me to make a decision, the enormity of which I can't possibly comprehend. I love my family, Traian. I really love them and would never be happy without them.\"</p><p>He bent his head to hers. Close. His mouth was inches from hers. \"I know what I am asking of you, and I know you have reservations about your family. I do not want to go back to an existence without you. Spend your life with me, Joie,\" Traian tempted softly. He feathered kisses down her face, over the corners of her mouth. His teeth tugged at her bottom lip. \"Spend several lifetimes with me, an eternity. Be with me. Say you want me that much. Let me be part of your family.\"</p><p>She looked up at him, at the intensity burning in his eyes. It was so hot it branded her, seared her all the way to her heart. Joie felt the pull of his need, of his loneliness. He was a dangerous predator, not quite human. Powerful beyond anything she had ever dreamed of. And sexy. Heart-stoppingly sexy. Her arms were already sliding around his neck, her body molding itself to his. \"Can we be together, Traian? How? Tell me how.\" Because she had been alone in the midst of a family she loved. Always surrounded by people, friends, family, she was always apart. She never knew why until she heard his voice. Something had been missing from deep inside her, some essential part of her.</p> <p>\"You can become as I am. Still Joie, still part of your family, but with the gifts and vulnerabilities of my race. Or I can age as you age. My strength will weaken and I will be more vulnerable to our enemies. It is your happiness that counts, Joie. I want to be in your life always.\"</p><p>Butterfly wings fluttered in the pit of her stomach. She felt she was on the edge of a great precipice. Joie tried to pull back before it was too late. The enormity of what he was offering was both frightening and exhilarating. He swamped her with his loneliness, with the intensity of her own feelings, so completely foreign to her. She tried to take refuge in humor. \"I don't even know if you're good in bed.\"</p><p>\"I want you to acknowledge to me that you know what I am offering you.\" His mouth skimmed over her face, tracing her high cheekbones, her chin, moved lower to find the pulse beating frantically in her neck. His warm breath bathed her in heat, a seductive temptation every bit as powerful as the feel of his body heavy with need.</p><p>She was in his mind, saw the choices clearly. His teeth sinking deep, making her his, bringing her into his world. Or Traian staying with her as if he were human, aging along with her, his great strength slowly fading, always vulnerable to enemies. Two choices. Two worlds. Only a heartbeat of time to choose.</p><p>She knew she needed to answer him, not because he demanded it, but because the intensity of her feeling for him was so strong, she</p><p>needed to settle her future in her own mind. His teeth nipped her skin, his tongue swirled over the tiny ache. She felt the throb in her deepest core, the clenching of muscles aching for relief.</p> <p>\"Joie.\" He breathed her name again. \"I will love you to the end of your days.\"</p><p>The water poured over her, heightening her sensitivity to pleasure. She heard the honesty in his voice. The purity. Joie tilted her head to the side to give him better access, closed her eyes in anticipation. She was certain. She might not understand why it was right, but she had never been surer.</p><p>His teeth sank deep. White-hot pain pierced her body, giving way instantly to sheer ecstasy. Lightning flashed in her bloodstream, hot whips of pleasure tormenting her. Heat welled up, threatened to consume her. She held him to her, closer, moving her body enticingly. It should have frightened her, the way he fed on her, devoured her with a hungry, craving lust more sexual than anything else.</p><p>Traian traced every line and curve, every hollow, etching her body in his memory, wanting the moment to last several lifetimes. The rush hit him hard, a sexual hunger mixed with a dark craving nearly uncontrollable. For centuries his appetite had been insatiable, a terrible hunger that could never be assuaged, but now her blood satisfied his inhuman need. But his sexuality remained unappeased. Hard and hot and heavy with desire. His tongue swept across the pinpricks on her skin. His lips traveled down to her breast. Ancient words beat in his head, words of a ritual imprinted on him before his birth. Once said, there was no going back. Traian and Joie would be bound for eternity.</p><p>The small sound escaping from her throat only urged him on. His tongue teased and danced over her taut nipple, caught the droplets of water as they beaded on her skin. \"I claim you as my lifemate. I belong to you. I offer my life for you.\" His hands shaped her body, slid up to cup her breasts.</p><p>His face was dark, his gaze intent as he looked into her eyes. Joie felt a strange wrenching in the vicinity of her heart. A part of her tasted fear, wanted to cry out for him to stop, but another part embraced his words, understood the importance of each promise uttered. Her hands slipped over his chest, and she leaned forward to taste his skin, her teeth nipping his chest directly over his heart. She had never been a biter, but something urged her to sink her teeth deep, to connect them together. She swirled her tongue over his heavy muscles.</p><p>She was killing him. His body hurt, a hard, painful ache; he was desperate for relief. \"I give to you my protection, my allegiance, my heart, my soul, and my body. I take into my keeping the same that is yours. Your life, happiness and welfare will be cherished and placed above my own for all time. You are my lifemate, bound to me for all eternity and always in my care.\" The words spilled out of him, the Carpathian ritual marriage, as old as time. He felt thousands of tiny threads binding them together as they were meant to be joined.</p><p>He caught her chin in his hand, lifted her face to his, finding her lips almost blindly, wanting to devour her. She opened her mouth to him, melted into him. Traian caught her up in his arms, kissing her wildly, and carried her to the bed, cradling her in his lap so that his heavy erection pressed tightly against her buttocks. He whispered softly in his language, a strong command, even as his fingernail lengthened and he drew a line over his chest.</p> <p>Joie kissed his throat, her lips drifting down his neck, unerringly finding his chest and the gash there. A hot flame burst inside him, a firestorm of emotion and sensation. The back of her head fit into his palm as he held her to him, encouraging her to make the exchange. Heat poured through his body. He burned for her, his body hard and painful with need, even as pleasure swept through him. Traian shifted, lowering Joie to the comforter, following her down so as not to break the connection between them. When he was certain she had taken enough for a true exchange, he whispered the command to halt and closed the wound himself. At once his mouth was on hers, stealing her breath, giving her his own.</p><p>Joie couldn't remember how she ended up beneath him, his hips wedged between her legs. His hands were everywhere, stroking, caressing, inciting. There wasn't an inch of her skin that he didn't explore. She heard her own strangled cry as his fingers sank deep inside her, felt her muscles clench tightly around him. Ready. Waiting. Desperate for his invasion. Her fingers caught at his hips, pulling him to her in a frantic attempt to find relief. She had never wanted or needed anything more than to feel his body deep inside hers.</p><p>Traian, certain she was ready for him, pinned her hips and thrust into her in one long, deep stroke. She gasped with pleasure, arched upward toward him, meeting him thrust for thrust. He cried out, unable to stay silent as he surged into her. She was a silken glide of fire and velvet as her feminine sheath gripped him tightly.</p><p>Joie clung to him, unable to do much more than hold on, lifting her body eagerly to meet his as he drove harder and deeper, merging them together in a fiery tango that she wanted to go on forever. They were skin to skin. Their hearts beat with the same wild rhythm. The air crackled with electricity, and sparks leapt from nerve ending to nerve ending. The pressure built and built until she thought she might have to scream with the joy exploding through her.</p><p>Then she felt him in her mind. Felt the sensations in his body, the gathering of a great force, much like a volcano. Hot. Thick. An inferno of desire and hunger mixed with intense emotion and pure lust. He filled her with flames and heat, an outpouring of pressure building from his toes to the top of his head. At the same time, he felt her every reaction, the waves of pleasure swamping her, racing to overtake them both, consume them completely.</p><p>Joie cried his name, clutched his body tightly as they went over the cliff together, free-falling through space in wild exhilaration. She couldn't catch her breath; her heart was pounding out of control. \"I think I see fireworks,\" she whispered into his chest.</p><p>He laughed softly. \"I think we produced the fireworks.\" He lay over her, his body pinning hers, locked tightly inside her while he kissed her slowly. Thoroughly. Leisurely. Savoring her. \"Thank you for finding me, Joie.\"</p><p>\"My pleasure, Traian,\" she answered. He was moving yet not moving, and each small shift sent ripples of aftershocks through her entire body. \"I can hear our hearts beating. Really hear them, like pounding drums. And I can hear the blood moving through your veins. Is that normal? Because if it is, eww, ick, and yuck.\"</p><p>He laughed softly, the sound vibrating through her entire body so that her muscles gripped even more tightly around him. \"Think about turning the volume down. Our minds are very powerful. You can control the volume with a thought.\" His teeth tugged at her lower lip. \"Think about it and you can hear a pin drop in the next room. But if you want quiet, you simply turn the volume down.\"</p><p>\"I don't feel that much different inside. I thought I would notice changes.\"</p><p>\"You haven't gone through a conversion, Joie. It takes three blood exchanges. We have only exchanged one time.\" He caught her firmly in his arms and rolled, taking her with him, so that she was straddling him.</p><p>He filled her completely, still hard and thick so that every movement sent pleasure dancing through her body. His hands cupped her breasts. \"I want to look at you. I still have a difficult time believing I actually found you. That I am with you.\"</p><p>Deliberately Joie moved, a long, slow glide up and down as if riding a thick pole. She felt him shudder with pleasure and arched back, pushing her breasts into his hands, getting a better angle to take more of him deep inside her. \"Why are you waiting?\"</p><p>He watched himself, slick and wet from her body. \"I want to give your body time to adjust to the changes.\" It was difficult to get the words out, difficult to have a coherent thought when she was gripping him so strongly with her muscles, riding him harder and faster with long, deep strokes. Fire licked at his belly, flames erupted over his skin until the heat rushed to one central spot, collected there, and raged out of control.</p><p>He let the sexual ecstasy wash over him, through him, take possession of him, all the while watching the glide of her body, the way her muscles moved beneath her skin, the way her breasts pushed into his palms and her nipples teased and tempted him. The sheer enjoyment on her face. Her thoughts, completely taken up with giving them both pleasure, were enough to send him over the edge. He picked up the rhythm, thrusting upward, driving into her as she came down over him. Each stroke took his breath, took his heart. Her body caressed his. Was wet and hot and tight. Brought him to the brink and left him wanting more. He felt her muscles contract, grip, squeeze, and grip until they both went up in flames together.</p><p>Joie lay beside him, unable to move, wanting to laugh with joy. Her fingers found his, tangled, and held on. She believed in living life to the fullest, but she had always thought she would do so alone. For the first time in her life, she felt complete and utter satisfaction. Complete and utter peace.</p><p>\"I feel exactly the same way,\" Traian said. \"I cannot help wondering - if you had been the Carpathian and I the human with a beloved family, would I have been as trusting as you have been? You cannot know what your faith and trust mean to me.\"</p><p>Joie turned her head, a mischievous grin on her face. \"I decided I liked flying and the shape-shifting would be cool. And if you do something so silly as to cheat on me or run off with someone else, I'm very good with a knife.\"</p><p>He raised an eyebrow. \"I thought you would be worried about giving up food. It does smell good. I have even sampled some from time to time.\"</p><p>\"No one said anything about giving up food.\" She eyed him with suspicion. \"There are certain things women can't do without, Traian. Chocolate at certain times of the month is essential to health. Not necessarily my health, but the health of all males in the vicinity. I'm not giving up chocolate, not even for great sex.\"</p><p>He propped himself up on one elbow, the pad of his finger tracing a circle around her breast. \"Chocolate is that important, is it?\"</p><p>\"Essential. Absolutely essential. That's nonnegotia-ble.\"</p><p>\"What kind of chocolate must you have?\"</p><p>\"Dark chocolate, of course. Is there any other kind?\"</p><p>He dipped his head to pull her breast into his mouth, suckling strongly just to feel her reaction. His tongue swirled over her nipple before he kissed her. His kiss was long and slow and thorough. When he lifted his head, he laughed softly at her expression. She stared up at him, bemused, one hand touching her lips in wonder where the taste of dark chocolate melting in her mouth was very real.</p><p>\"How did you do that?\"</p><p>\"You need and I provide - that is how it works. I believe you wanted to see your brother and sister tonight.\"</p><p>She allowed him to pull her up. \"Anytime? You can do that anytime? Wow. I think I'm going to like this lifemate business.\"</p><p>Traian laughed, hardly able to believe the happiness blossoming inside him. Hardly daring to believe Joie was real. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Joie stood in the doorway of the lounge, her gaze scanning the crowd as she always did, getting a feel for the throng, picking out the ones most likely to cause trouble and the ones who might be interested in more than they should. She noted a tall, dark-haired man in the corner who looked up when she walked in with Traian. He quickly glanced away from them, taking a sudden interest in his drink, but she could tell he was watching them carefully. A second man drew her interest. He sat in one of the high-backed chairs near the fire, a newspaper in his hands. He was short and slender and wore reading glasses. He was looking over the top of the thick rims at Gabrielle.</p><p>Jubal turned and waved to Joie. Gabrielle looked up, gave a glad cry, and rushed toward her. Joie prepared herself to be practically bowled over as her sister embraced her, hugging her joyfully. Over Gabrielle's shoulder, she noted the man in the glasses looking past her to Traian. Recognition flickered across his face, and he carefully folded the newspaper and laid it on the small table in front of him before rising.</p><p>Traian, Joie warned. She set Gabrielle gently to her side and just a little behind her.</p><p>Traian scanned the room, was slightly shocked when he realized the slender man was human yet seemed to recognize who and what Traian was. Moreover, he was expecting Traian, had come to the inn in the hope of finding him. Traian noted with amusement that Joie had tried to position her body between him and the stranger. The rush of joy and affection, a lightening of his heart and soul, made him tremble. He couldn't remember if anyone in his long lifetime had worried about him or tried to protect him. That small gesture meant the world to him.</p> <p>Behind it was her faith in him. She'd made a leap of faith, committing herself to his life, his world. She believed he wanted her happiness above his own, and she wanted to give him happiness. He had a mad desire to scoop her up and run back to her room, where he could make love to her all over again. He looked at her, allowed the thought to shimmer in his mind, to glow hot in his eyes.</p><p>Joie laughed. \"Stop that.\"</p><p>Gabrielle looked from her sister to Traian and made a rude noise. \"Oh, no. Joie, we leave you alone with him for a few minutes and you seduced him, didn't you?\"</p><p>Joie shrugged unrepentantly. \"You have to admit, he's pretty hot.\"</p><p>\"I'm telling Mom.\"</p> <p>\"Well, you tattletale, if you say one word to Mom, I'm going to tell her you were thinking of taking that job researching the Ebola virus. You know what she'll do when she hears that.\"</p><p>\"You wouldn't dare,\" Gabrielle said. She pushed at Joie's shoulder as the slender stranger approached, trying unsuccessfully to move her sister aside for a better look. \"Now that is a hottie, Joie. There's more to a man than muscle.\" She grinned at Traian. \"No offense or anything.\"</p><p>\"None taken,\" he assured her.</p><p>\"Your tongue is hanging out, Gabrielle,\" Joie whispered. \"Stop ogling him. For you to be falling at his feet, he must have an IQ of two hundred.\" She glanced up at Traian. \"No man she's ever looked at could carry on a normal conversation. I think she can see straight through to their brains.\" She nudged her sister. \"Your eyes are popping out of your head.\"</p><p>\"I was just looking,\" Gabrielle hissed back. \"At least I didn't throw myself at him and show off by doing in underfed trolls fresh out of the grave.\"</p><p>\"I was happy she did that,\" Traian pointed out.</p> <p>\"Yes, well, I suppose you would have been, under the circumstances,\" Gabrielle conceded. \"But she has a major hickey on her neck. If Mom saw that, there'd be consequences.\"</p><p>Traian bared his strong white teeth at her. \"I think I can handle your mother.\"</p><p>Gabrielle and Joie looked at each other and burst out laughing. \"It isn't possible, Traian, even for you,\" Joie said.</p><p>The slender man stopped in front of them and held out his hand to Traian, although Joie noticed that his gaze continually shifted to Gabrielle. \"I'm Gary Jansen. Mikhail Dubrinsky sent me. He asked me to convey his apologies, but unforeseen circumstances prevented him from coming himself. Should there be need, he asked that you put out a call to him and he will send Falcon.</p><p>Mikhail's brother is in Italy at this time, so I was sent to gather the information and aid you in any way I can.\"</p><p>Traian gripped Gary's hand firmly. \"I am Traian Tri-govise. This is my lifemate, Joie Sanders, and her sister, Gabrielle. I trust the prince and his lifemate are well?\"</p><p>\"Raven has been ill,\" Gary said briefly.</p><p>Traian caught the echo of Gary's thought.</p> <p>Miscarriage.</p><p>Joie slipped her hand into his, an offer of condolence that betrayed the fact she'd been a silent shadow in his mind. She might not understand the importance of the news, but she could feel his sorrow. \"We need to speak somewhere quiet,\" Traian said. \"I have news the prince must hear.\"</p><p>Jubal joined them, slipping an arm around his two sisters and waiting to be introduced. Traian did so as they followed Gary from the lounge to the comparative quiet of his room.</p><p>\"Nice,\" Jubal commented. \"We're on the second story with small balconies. This is great.\" He looked out the double doors to the spacious verandah. \"Joie, we should have asked for the ground floor.\"</p><p>A dull red swept under Gary's skin, and he glanced at Gabrielle as he hastily cleared clothes from a chair. \"Sorry about the mess.\"</p><p>Gabrielle smiled at him. \"You should see my room. We were in a cave, and our clothes were filthy. All I could think about was taking a hot shower.\" She blushed for no reason, turning away from Gary to study the verandah Jubal seemed so interested in.</p><p>\"Mikhail wanted me to ask you why you did not simply give him the information when you requested that someone join you here,\" Gary said.</p><p>\"Had I used the common telepathic link, the undead would have heard what I had to say,\" Traian said. \"I have never exchanged blood with the prince and do not have a private telepathic link. It was better to keep my news confidential.\"</p><p>Gary nodded toward the Sander siblings. \"Forgive me for asking, but you are certain everyone in this room can be trusted?\"</p><p>\"I am more certain of them than I am of you,\" Traian answered.</p><p>Gary smiled, relaxing for the first time. \"That's good enough for me. I can give Mikhail your news, although he asked me to have you return home as soon as you are able. He has called in the ancients his father sent out. He needs their knowledge to make informed decisions in the ongoing war with the undead.\"</p><p>\"Where is his second? I fear the life of our prince is in danger. I do not like the fact that the undead dare to gather so close to our homeland.\"</p><p>\"Gregori is in the United States but will be returning soon. Falcon and Jacques stay close to the prince.\"</p><p>\"There are many undiscovered caves in these mountains,\" Traian said. \"I went to ground in one of them and came across several vampires. They were hunting something beneath the earth and they were so frantic to find it, they began to hunt me, instead of avoiding me as would be usual. We had several battles. I destroyed two of them, although more than one master vampire travels with them and they are extremely powerful. I was severely wounded after one of the battles, and they found my resting place. Instead of killing me, they decided to use my blood so they could continue searching. Joie and her brother and sister found us. Joie killed one of the vampires.\"</p><p>\"Sort of,\" Joie corrected when Gary looked at her with admiration. \"The darn thing fried my favorite knife. Traian had to incinerate it before it was really gone.\"</p><p>He isn't like you, Traian. He's human. Few humans are trusted with the knowledge he has of our people. He must be much respected for Mikhail to send him to me.</p><p>\"Vampires are very difficult to kill,\" Gary said, \"and with even one master vampire in the vicinity, it is too dangerous to engage in battle.\" He rubbed the bridge of his nose. \"I'm a biochemist, not a hunter, but I've seen the results of what the vampire can do to humans. It's terrifying.\"</p><p>Gabrielle shuddered visibly. \"I think Joie was having fun down there in the cave, but all I wanted to do was hide under the bed. And I kept thinking about viruses and touching all those microorganisms down there.\" She made a face. \"I think I'll leave vampire hunting to the experts. If I never see or hear of another one, I'll be happy.\"</p><p>Joie grinned at her. \"And here I was planning on making it my new career.\"</p><p>\"That's not funny, Joie,\" Jubal said. \"What you do is bad enough. You give us all gray hair. You stay away from those things.\"</p><p>\"How did you get involved with all of this?\" Gabrielle asked Gary curiously.</p><p>He looked sheepish. \"I actually developed a compound to paralyze the system of Carpathians, thinking, of course, they were vampires. The compound was twisted into a poison and used to torture and dissect whomever the human society of vampire hunters deemed one of the undead. When I tried to expose them and rescue one of their victims, I met Gregori.\" He shrugged his shoulders. \"I can't describe Gregori or what meeting him was like, but it changed my life. The society would like to see me dead, so as a protection, Gregori brought me here to help with research. I like it here and have developed strong friendships, so I stay.\"</p><p>Who is Gregori?</p><p>There was so much respect in Gary's voice, Joie was curious.</p><p>He is second to the prince. A great hunter and healer. He is lifemate to the daughter of the prince.</p><p>Joie looked up at Traian. \"I can see the Carpathians have a complex society. Why didn't we know of its existence until now?\"</p><p>\"We take great care to blend in to the human world. It has been our way for centuries and has worked well for us. Unfortunately, our race is on the verge of extinction.\" Traian gathered Joie to him. \"Without life-mates, we will not survive.\"</p><p>\"Lifemates?\" Jubal echoed.</p><p>\"We mate for life. Once a male finds the woman who is his other half, he binds her to him, as you do with a marriage ceremony. If she is a human and does not live fully in our world, it can be very difficult. Lifemates cannot be parted for long periods of time. We have a strong telepathic link and must touch each other's minds frequently or one begins to grieve for the other. As Carpathians cannot walk fully in the human world, it is usually best for the human to walk in our world,\" Traian explained.</p><p>Jubal and Gabrielle exchanged a long, apprehensive look. \"What exactly does that entail?\"</p><p>\"Jubal - \" Joie protested.</p><p>\"No, Joie, I want to know what he's talking about.\" Jubal didn't look at his sister but rather at Traian. Man to man. Expecting an answer. Demanding one.</p><p>\"Joie has consented to come fully into my world, Jubal,\" Traian said, his voice low and without inflection. \"I will protect her and watch over her and see to her happiness at all times. The conversion will not take her from your family. She would never be happy apart from you. I hope you and your sister and your parents will be able to accept me into your world, your family, the way I know my people will accept Joie into mine.\"</p><p>Jubal swore softly and turned away from them to stare out into the night. \"Joie, did you think this through? Do you know what he's asking of you?\"</p><p>Joie went to her brother, put her arms around him. \"I've never felt as if I truly belonged, Jubal. I accepted that I was different, and yes, I've been happy because I like the work I do and I love my family dearly, but I want more than that. Traian offered me more, and I grabbed the opportunity with both hands.\"</p><p>\"Do you hear what he's saying to you? This isn't like a human marriage, Joie, where you can walk away if things don't work out.\"</p><p>Traian stood beside Joie, his fingers laced with hers. \"Lifemates not only want to be together, Jubal, they need to be. They find a way to work things out. A male Carpathian knows what makes his lifemate happy and does everything within his power to do it for her. And it works both ways. We always have telepathic communication open to us, so, in a sense, we are used to living in each other's heads. I know that is a big adjustment to make, and I am doing my best to give Joie as much space as she needs. But she is already learning quickly.\"</p><p>\"It's what I want, Jubal,\" Joie said. \"Be happy for me.\"</p><p>\"I know you, Joie. You aren't going to be satisfied sitting on the sidelines while vampires are hanging around. You're going to go save the world.\"</p><p>Joie couldn't lie to her brother. \"Probably. On the other hand, I have no intention of giving up my business. I thought Traian might work with me.\"</p><p>\"This is where it is necessary for you to have faith in me, Jubal,\" Traian said. \"I cannot allow anything to happen to Joie.\"</p><p>Jubal laughed without humor. \"You don't know Joie if you think you're going to be protecting her. More than likely, it will be the other way around.\"</p><p>\"Forgive me for butting in, but I've been around the Carpathian race for some time now,\" Gary said. \"Traian is an ancient Carpathian male. He is far more powerful than you can imagine. They do not allow their women to come to any harm.\"</p><p>\"But then you haven't met someone like Joie before,\" Jubal pointed out. \"She's the guardian of the world.\"</p><p>\"Stop picking on me, Jubal. At least I go after people, not little organisms that you can't see and can't do anything about.\"</p><p>\"Hey now,\" Gabrielle objected, \"don't turn the spotlight on me.\"</p><p>A small smile curved Traian's mouth. \"I think you are misjudging me because of our first meeting, when I was being held prisoner. I have survived countless battles with the undead, Jubal. A master vampire is every bit as powerful as our greatest hunter.\" He looked at Gary. \"Mikhail should know they are traveling in packs, and I have heard disturbing rumors that they are planning something. I also believe it is important to discover whatever it is they are seeking. Vampires always seek power. They would never waste time working the way they are unless it resulted in more power.\"</p><p>Gary nodded. \"I'll tell him.\"</p><p>\"I'll be returning to the cave just before sundown tomorrow. I hope to surprise them before they rise. In any case, I will do my best to discover what they seek.\"</p><p>\"Why just before sundown?\" Jubal asked curiously.</p><p>\"I am weak and vulnerable while the sun is high,\" Traian admitted without hesitation. \"The vampire is also at his most vulnerable. If I rise before them, I may be able to destroy them before they regain their strength.\"</p><p>\"Well, of course I'm going with you,\" Joie said.</p><p>Traian brought her fingertips to his lips, breathed warm air over her hand. \"I can travel faster on my own, Joie. And you have not yet learned to prevent them from reading your mind. I would be at risk because of your unguarded thoughts.\"</p><p>Joie's gaze flickered to Gary. The man nodded. \"They are adept at reading our thoughts and even controlling us. Traian can go in without their being aware of his presence, but they would know the moment you were near.\"</p><p>Joie frowned. \"I don't like the idea of you going in alone. There are several of them, and you've admitted there's more than one master vampire. I might be able to help. Could you block them from reading my thoughts?\"</p><p>\"Probably, but the more tasks I have to perform, the more energy I expend. I have to go in fast and hard and get out the same way.\"</p><p>Jubal immediately stepped to his sister's side. \"What if we were nearby, waiting just in case you run into trouble?\" he suggested.</p><p>Gabrielle nodded. \"I think that would be best, Traian. We might not be able to incinerate the things, but we can slow them down for you.\"</p><p>Traian looked at the three of them. Family. Solidarity. Jubal and Gabrielle might not agree with Joie's choice. They might be afraid for her. But when it counted, they stood with her. He bent his head and kissed Joie right in front of them. It was that or humiliate himself with tears shimmering in his eyes. As it was, a lump threatened to choke him. \"Thank you for letting me be a part of your family, Joie. They are wonderful.\" He looked at Jubal. \"I appreciate the offer, but it is safer for me if you are here, a distance away where the undead cannot perceive a threat to them. Should I have need, I will contact Joie immediately.\" He looked at Gary over their heads, and the prince's messenger nodded carefully. He would watch over Traian's lifemate and family. A matter of honor in the Carpathian world. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Joie was dreaming of a hot, moist mouth pulling strongly at her breast, of hands stroking her body. Of lips traveling down her bare skin to her navel, swirling kisses and teasing bites over her stomach. Hands on her thighs tugging her legs apart. She was already damp with invitation.</p><p>She opened her eyes as the waves of sensation burst through her like a gift. The wealth of Traian's silky dark hair slid over her skin, the sight more erotic than she had ever imagined. His fingers moved inside her, found secret ways to shimmer fire through her veins. And then his tongue took the place of his hands, stabbing deep, tasting and teasing and stroking her until she was crying with joy and her body no longer belonged to her. Wave after wave, orgasm after orgasm rippled through her body, so that she bucked and jumped as he held her firmly, his mouth devouring her, claiming her, feeding her sheer pleasure.</p><p>She clenched her fists in his hair, holding on while she took the wild ride, while the earth moved and her body shattered into fragments. He took possession of her then, kneeling above her, dragging her hips to him, thrusting deep with powerful strokes while she came over and over in a mind-numbing climax that seemed endless. He was everywhere, in her body, in her mind, their hearts beating in the same rhythm. She could feel the intensity of his emotions, a tidal wave of longing and love, of absolute need and hunger, of caring and loyalty, far more than she could understand, but real all the same.</p><p>Joie clung to him as his body rode out the storm of roiling emotions, each thrust deeper and harder in a fierce, possessive joining. Thunder roared in his ears, lightning sang in his blood, fire raged in his belly until the conflagration merged together at the core of his body. Her feminine sheath was fiery hot, tight and velvet soft, the friction an unbelievable sensation. He tilted her hips, wanting her to take all of him, wanting to crawl inside her body, his home, his sanctuary after several lifetimes of loneliness. He wanted to give her the world, wanted her body to feel the same flames of passion and pleasure as she ignited in him.</p> <p>He felt her muscles clench around him, the gathering of a great force. He threw back his head, allowed his body to explode with volcanic intensity, thrusting deep, taking her with him, holding her close as they burst into sunlight, the only time he could ever embrace such a thing. His shifted her in his arms, pressed her body to the length of his. \"Never go away,\" he whispered in her ear. \"Never leave me to face the endless years alone.\"</p><p>Joie caught his face between her hands, brushed back the long silk of her hair, and stared up at him. At the lines etched into his beautiful masculine features, put there by battles and years of knowledge of foul things walking the Earth. Put there by sheer loneliness. \"I want you always, Traian. We'll find our way together.\"</p><p>He leaned toward her, kissing her gently, with exquisite tenderness, with the overwhelming love in his heart that he couldn't quite put into words but tried to show by worshiping her with his body. He kissed her over and over, long, drugging kisses, his body locked deep inside hers, his hands tunneling in her hair. His mouth roamed over her throat, down to her breast, found her heart unerringly.</p><p>Joie felt the swirl of his tongue, and her heart leapt in anticipation. Her body tightened around his. White-hot pain lanced through her, gave way immediately to pleasure. She cradled his head to her while he fed, while his body moved slowly and erotically deep within her. The sensation was unlike anything she'd ever experienced. She writhed helplessly beneath him, arching her hips up to meet him, her breasts aching and full with need. When his hand cupped the weight of one breast, his thumb sliding over the taut peak of her nipple, she pressed his head closer to her, offering more.</p><p>Traian swept his tongue across the pinpricks, tasted the temptation of her breast before finding her mouth to share the taste of their life's essence. He took his time, his tongue thoroughly exploring her mouth, teasing and dancing and mating with hers. \"Come into my world, Joie. Another step closer.\"</p> <p>This time she was locked in a dreamy haze, aware of his body's sensations as she moved restlessly, wantonly under him. As her mouth moved against his chest, taking his precious gift, his fingers stroked her throat, her breast. His body thickened inside her, moved with greater force and purpose. She felt the flames, hot and white and pure, burning in his veins, pulsing through him.</p><p>She should have been horrified, but she wasn't. She was overjoyed to be able to bring him such pleasure, so much happiness. She wanted to be fully in his world and she wanted so much more. She moved more aggressively until he was surging into her with strength and power, until she felt the gathering of every nerve ending, every muscle and the flow of blood, until they soared together higher than ever.</p><p>I want more time with you. I want to touch your body and know it the way you know mine. I want to see the things you've seen and make you feel the way you've made me feel.</p><p>\"We have time,\" he said. \"All the things you fantasize about, all the things that matter to you - we have time for everything.\" Very gently he stopped her feeding, closing the wound in his chest. He laid her on the bed, his hands gentle, loving, stroking her bare skin while he brought her fully out of the enthrallment. \"I have to go, Joie. We've slept all day, and it's almost sunset. I have to find the master vampire before he rises.\"</p><p>\"Do you have an idea where to look?\" She traced his face, his mouth with her fingertips.</p><p>\"I hope he did not leave the cave. They were so reluctant to leave it before, but we had not discovered the wizard's traps. It is a dangerous place to be, even for the undead. Maybe especially for the undead.\"</p> <p>\"Promise me that you'll contact me if you run into any trouble.\" She looked him straight in the eye, insisting on the truth.</p><p>\"You are my lifemate, Joie. If I run into trouble, you will know.\" He bent his head to kiss her. Slowly. Lingering over it. Pouring his heart and soul into it.</p><p>Just that fast, Traian was gone. Joie lay on the sheets, staring up at the ceiling, her heart pounding in fear. He was gone, slipping out through the window, a cloud of vapor streaming into the air. It wasn't yet sunset, but she felt as if the sun had gone down on her world.</p><p>It is only the effects of our connection. I am with you. Feel with your mind as a Carpathian must. It takes time to learn our ways, I know, but I cannot have you suffering grief when I am alive and well and able to reach out to you.</p><p>Determined to combat her sorrow, Joie sat up.</p><p>It is amazing how strong the feeling is. And it is a little frightening to think that emotion is stronger than logic. I know where you are, yet I still have such a need to touch you. It makes no sense.</p><p>And it didn't. Joie considered herself a very logical woman. She didn't like this out-of-control feeling, a dark dread that stole her good sense and her ability to reason. She lifted her chin. There were changes taking place in her body and mind, but that didn't mean she would give in to melancholy.</p><p>I'll be perfectly fine, Traian. You worry about yourself. I'll hang with Jubal and Gabrielle while you're gone. And Gary. He knows both the undead and my people. Stay close to him.</p> <p>Joie did the mental equivalent of rolling her eyes. As</p><p>if. Traian, you're going to have to get over your outdated attitude toward women. It must be your age. That man needs protection. He lives in another world, just like Gabrielle. I can see it in him. He's more at home in a lab than fighting vampires. But he knows vampires. Stay close to him. You might have mentioned your archaic attitude and your stubbornness when you were being so blasted charming this morning.</p><p>His soft laughter echoed through her head, and then he slipped out of her mind, leaving her feeling bereft. Determined not to give in to the strange reaction to their separation, Joie took a long, hot shower. It was nearly impossible to stand beneath the cascading water without thinking of Traian, but she concentrated on figuring out how to tell her parents that she was essentially married.</p><p>Gabrielle stuck her head in the bathroom. \"Hurry up! Jubal and I are getting tired of waiting for you two. And you'd better not be doing anything perverted in that tiny little shower stall.\" She sounded more hopeful than anything else.</p><p>\"How did you get into my room, you peeping Tom?\" Joie threw a wet washcloth with deadly accuracy. \"It was locked.\"</p><p>Gabrielle squealed when the cloth hit her square in the face. \"I'm picking up your bad habits. Are you in there alone? Because I don't want to see any naked bodies.\"</p><p>\"Traian already went back to the cave.\"</p><p>\"If he wasn't so drop-dead gorgeous, I'd be afraid he was a troll, he likes to be underground so much. What are you going to tell Mom and Dad?\" This time there was glee in Gabrielle's voice.</p><p>\"I've been rehearsing,\" Joie admitted. She emerged from the stall, wrapped in a bath sheet. \"It has occurred to me to lie to them. And I thought you preferred skinny men. I saw you ogling Gary last night.\"</p><p>\"I don't ogle,\" Gabrielle sniffed indignantly. \"I never ogle. I just thought he was rather on the cute side.\" She sighed heavily. \"Oh, to be model-thin and beautiful.\"</p><p>Joie glared at her. \"You are beautiful, you idiot. You're just crazy. Is Jubal hanging out in the bedroom, because I need my clothes.\"</p><p>\"I'll get you something presentable.\" Gabrielle disappeared.</p><p>Joie heard her giggle. Gabrielle never did anything so undignified as to giggle. Unashamed, Joie found she could hear just by consciously thinking about it. Gary had joined her brother and sister in her bedroom.</p><p>Joie stalked to the door. \"Hello! I hate to remind you all, but I'm stuck here, naked in the bathroom. Vacate or toss me some clothes.\"</p><p>Jubal groaned. \"You are so sick, Joie. I didn't need that visual. Gary, you ought to try having a couple of sisters bent on tormenting you. They gang up on me like you wouldn't believe.\"</p><p>Gabrielle blew him a kiss. \"We keep your life from being extraordinarily dull and boring.\"</p><p>Joie caught the bundle of clothes her sister tossed inside the bathroom. \"Thanks for remembering me.\"</p><p>\"I remembered. It just didn't seem all that important.\"</p><p>Gary stood up when Joie entered the room. \"Traian left already, I take it? I figured he'd rise as early as possible. There were clouds blocking the sunlight. They sometimes arrange the weather to protect their sensitive eyes.\" He smiled at Joie. \"He wants me to get you to drink some juice this evening.\"</p><p>Joie pressed a hand to her stomach. \"I don't think that's going to happen, but I'm sure Gabrielle and Jubal are hungry.\"</p><p>\"Starved,\" Jubal agreed instantly. \"I thought Joie was going to sleep forever.\"</p><p>\"You'll get used to the different hours they keep,\" Gary said. \"I work in the lab and forget the time myself. If I'm on to something promising, I don't seem to need sleep.\"</p><p>\"I'm the same way,\" Gabrielle said. \"Sometimes I look up and it's two days later.\" She exchanged a long smile of complete understanding with Gary.</p><p>Jubal threw his hands into the air. \"It's getting a bit thick in here. I'm for food. Come on, Joie. Whether you're hungry or not, we need to stick together.\"</p><p>They waited while Joie found her calf scabbard and strapped it to her leg. Gary raised an eyebrow, but Gabrielle just shrugged, her grin sheepish. They were used to Joie, and she was nearly always armed with something lethal.</p><p>Joie was aware of the exact moment the sun set. She didn't see the orange and red hues, but in the midst of the laughing conversation going on around her she simply knew. She felt the sudden shuddering of the earth as the vampires rose. Her heart leapt in fear.</p><p>Traian!</p><p>She reached out to him. Touched him. Felt his immediate reassurance. He had not discovered the resting places of the vampires. They had not gone to ground in the cave of the wizards.</p><p>\"Joie?\" Gabrielle touched her hand. \"Are you all right?\"</p><p>Joie looked across the table at her and managed a smile. \"I just wish I was with him.\" She didn't need to say his name.</p><p>A dark shadow passed over the inn, moving fast, so that for a moment silence fell in the dining room and people looked at one another uneasily. Gary reacted instantly. He caught Gabrielle's wrist, rising so fast his chair fell backward. \"Come with me, right now.\" He tugged Gabrielle to her feet and began to weave his way through the tables, dragging her with him.</p><p>Jubal looked at his meal with regret as Joie smacked the back of his head. \"It might be your last meal if you don't move it,\" she cautioned.</p><p>\"It might be my last meal anyway,\" he groused. But he was on his feet and rushing after Gary and Gabrielle.</p><p>\"Call him back, Joie,\" Gary ordered over his shoulder. \"Call Traian and get him back here. We don't have much time.\"</p><p>Joie didn't hesitate. There was too much urgency in Gary's voice.</p><p>Traian. They are here. The undead are here at the inn. Gary says it's urgent that you return as quickly as possible. Do as Gary says. He will know what to do until I am able to return. They cannot get their hands on any of you. Go for the heart if you have to defend yourself. They often inject poison into the bloodstream, and they are great deceivers and shape-shifters. But ego is their weakness. One of their few weaknesses.</p><p>Gary shoved open the door to his room. \"Quick, get inside and stuff everything you can find in the cracks around the doors and windows.\" He tossed Gabrielle shirts as he hurried to the door leading to the verandah. \"We'll have to hole up in here. They'll try to call us out, using compulsion. Jubal, there's a small CD player on the desk. Pick some obnoxious music from the collection and turn it up loud. Very loud.\"</p><p>Joie locked the doors behind her and shoved the dresser against it. \"The keyhole, Gabrielle - stuff something in that as well.\" If vampires could do what she had seen Traian do, stream through tiny spaces as vapor, she didn't see how they were going to keep them out. \"So why are they here?\"</p><p>\"Most likely because you are,\" Gary answered. \"The surest way to bring a Carpathian male out into the open is to go after his lifemate. They'll want one of you to invite them in. If you hear a voice talking sweetly, it is a deceiver. Put cotton in your ears, put your hands over your ears. Do anything to keep from listening. If one of you observes another going to the door or even talking, inviting someone into the room, stop him, even if it means knocking him out.\"</p><p>Shadows passed across the window, moving back and forth as if searching for something. The wind picked up so that the tree branches scraped against the inn with a sickening screech. Clouds spun and boiled, casting hideous apparitions across the moon. A stain spread across the sky, slowly blotting out the stars, creeping insidiously until nearly all light was extinguished. The wind howled against the windows, slammed into the verandah door, carried with it voices. Soft. Cunning. Sweet and enticing. Pleading voices. Cries for help. A woman called out just beyond the door, begging for entrance, her voice rising on the wind.</p><p>\"Joie?\" Gabrielle looked to her sister for guidance.</p><p>Gary was close to her and he put his arm around her protectively. \"Traian will be here soon. We can hold out until then.\"</p><p>Jubal cranked up the CD player so that it blared loudly. Something grabbed the door handle and shook it so hard, the door rattled and splintered. Joie leapt to place her body between the door and her brother and sister. \"Gary, get them out of here,\" Joie ordered.</p><p>\"Believe me, we're safer inside this room than anywhere else right now. And there's less danger if we stick together,\" Gary said. He took up a position at her side. \"Jubal, watch the windows. If you see anything that looks like smoke or fog trying to get in through a crack, you have to stuff in a shirt, the blankets, anything at all to keep it out.\"</p><p>The door was struck again from outside, hard enough to shake the frame. Gabrielle clapped her hand over her mouth to keep from crying out.</p><p>\"You can't come in,\" Gary said, not raising his voice. \"You have not been invited and you can't gain entrance into this room.\"</p><p>Maniacal laughter greeted Gary's calm words. A great weight thudded against the door and began a steady pushing. The wood began to bulge inward. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>In the shape of an owl, Traian streaked across the darkened sky. Joie had no hope of fighting off a master vampire, even with Gary's vast knowledge of the undead. The most they could hope for was to delay the vampires until he arrived. The wind increased in speed so that gusts hurled branches and twigs into the air like missiles. A funnel cloud whirled and spun ominously, from ground to sky, a dark, turbulent monster leaping with greedy outspread fingers toward him. He flew into an invisible barrier, hit the obstacle hard and plummeted toward the ground below.</p><p>The black mass stretched wide, forming a ghastly head with a gaping mouth and long, bony arms, reaching for the body of the owl as it tumbled toward the ground. Traian shifted into dark droplets of vapor, merging with the black mass, spreading thin to avoid detection. The tornado dropped from the heavens as if it had never been, leaving behind an eerie calm and a clear sky.</p><p>A tangle of silver fell from the tree branches, a fine solid blanket of woven strands. Traian was already shifting again, landing in a crouch on the ground. The silver hit his arm but slid off, landing inches from his feet. Pain streaked through his body. Angry red welts rose immediately on his skin where his flesh had come into contact with the glittering silver. Thousands of stinging insects flew at his face, a solid wall of them, programmed to find and attack. Traian dissolved to avoid them, sliding back into the forest to cling to a tree branch in the shape of a frog.</p><p>He reached out with his senses, trying to locate his opponent. Master vampires rarely revealed themselves, especially in battle. Traian knew the undead had deliberately drawn him back to the inn with the hope of trapping and destroying him.</p> <p>I am in a fight for all of our lives. If you can avoid a confrontation, do so. If not, always go for the most dangerous vampire and go for the heart. Nothing else will put them down. Delay. Stall. Try to avoid a battle.</p><p>He waited, his heart beating a little too hard, fear eating at his mind until she answered. Her voice was calm and steady, even confident.</p><p>Don't think about us little mortal people, Traian. We can handle the dead guys. You just don't get a single scratch on you or I'll be upset. And you've never seen me upset.</p><p>The relief nearly overwhelmed him. She was unhurt.</p><p>I have learned the real meaning of fear. Always, I have gone into battle with nothing to lose. I do not much care for the feeling. Well, it's mutual, Traian, so don't go feeling sorry for yourself. I've got the ugly guys at the door, so I'm going to have to let you go.</p> <p>Joie made him want to laugh. She sounded like she was talking to him on the phone and a neighbor had dropped by to borrow a cup of sugar.</p><p>Do not get overconfident.</p><p>He couldn't help cautioning her, although he knew it would annoy her.</p><p>A walk in the park. You worry about yourself.</p><p>He could see the insects scattering, returning, flying through the trees in search of any sign of him. And the bugs always returned to swarm around the same rotted trunk of a fallen tree.</p><p>I love you, Joie, and I cannot do without you. Keep that in mind when you decide how best to handle the situation. You are deciding for both of us.</p> <p>She hissed at him between her teeth. He could hear it clearly, the irritation and annoyance of a woman beyond her limits of patience. His heart did a curious flip, a strange reaction to her feminine exasperation. For some unexplained reason, he felt joy.</p><p>The little frog hopped along the tree branch, taking great care to blend in with the leaves and twigs. He was some distance from the fallen tree, and the ground stretching between was covered with debris. Traian glanced skyward at the black, spinning clouds. At his mental command, lightning shot bright sparks into the massive cauldron overhead. The white-hot energy spun into a large ball, breaking away from the clouds and hurtling toward the ground. The air crackled with electricity.</p><p>Traian leapt from the branch, shape-shifting into his true form, his hands directing the spinning threads of energy, launching the ball as he melted back into the trees. The sphere slammed into the center of the rotten trunk, carving a blackened hole as it went all the way through to hit the ground, forming a deep crater. White whips sizzled and crackled inside the depression.</p><p>Black vapor rose from the trunk of the tree to mix with the dark, spinning clouds. A terrible piercing howl of rage filled the air high-pitched and obscene, it shredded nerves and pierced eardrums. The trees shuddered and shook. Grass and leaves shriveled. The sound bounced from ground to cloud with the force of a clap of thunder. The blast hit Traian in the back and drove him forward, slamming him into a tree. He just managed to whip his head back before he hit.</p><p>He inhaled quickly, took in the noxious, foul smell of burnt flesh, and knew he had scored a hit. Fire rained from the sky, red glowing embers igniting the foliage. Hungry flames licked at the grass and leaves, raced up the trees with glee. Traian spread out his arms, gave a command, and the clouds burst open, pouring sheets of water on the rising flames. The sky overhead was black with smoke and whirling clouds. It was impossible to tell where the vampire was. He was experienced enough not to give away his presence by blank spots in the air. He chose to blend into the chaos of his surroundings, sidestepping further battles now that he was wounded.</p><p>Traian tried one last tactic, knowing the vampire would disappear for many years, avoiding all contacts with hunters in order to survive. There was one last chance to call him into the open, and Traian used it, risking revealing his position to send a summons into the night. His call was pure and commanding, his voice that of an ancient in full power ordering the vampire to ground.</p><p>For a brief moment the hideous creature was outlined in the sky, a ghoul as evil and sinister as centuries of deviant behavior and killing for the sake of watching others suffer could make him. He stared down at Traian with hate-filled eyes, his jagged teeth snapping together in defiance.</p><p>A sound burst in Traian's head, swelling in volume, a counter-command of death and destruction. Every cell in Traian's body reacted. He was a jangle of nerve endings, paralyzed, forced into the open.</p> <p>I am your master.</p><p>The echo reverberated through Traian's muscles and tissue, through every organ.</p><p>No!</p><p>Joie's whisper was a soft, sensuous counterpoint to the poisonous command.</p><p>He took your blood. He's using that as a weapon against you. Shut out his voice. He has no dominion over you, over us. I don't care how strong he is, Traian, or what he is. We're stronger. He can track you through your blood, but he cannot command you. Foolish woman. I am in his mind, I own his mind. He is my puppet, and soon all the others will be too. He cannot touch me, but I can find him anywhere. And through him, I can find you and your pitiful family. Join with me. I will one day rule both Carpathians and humans alike.</p><p>Joie deliberately laughed, the sound like a breath of fresh air, ripping the dark dread from Traian's heart and clearing his mind.</p><p>You are the foolish one. There is only one for me. We will destroy you because you're nothing but a rotten, empty shell. And you're just nasty, if you ask me.</p><p>Traian felt the monster's rage, bursting in his head, in his veins, as if his blood boiled, but he was free of the terrible paralysis. He clapped his hands together and spread his fingers wide, arms outstretched toward the vampire, which was dissolving into the sky. Lightning forked and sizzled. The vampire screamed once, and a putrid smell polluted the night air.</p><p>Kill her. Kill all of them.</p><p>Thunder splintered the sky. The earth rolled and bucked and the storm raged, a wild hurricane slamming into the forest and village.</p><p>They throw tantrums.</p><p>This time there was fear in her voice. Traian was already racing to the inn, doing his best to countermand the killing storm.</p><p>Valenteen is dangerous beyond belief, Joie. Whoever this master is, he commands Valenteen, and that is both shocking and terrifying. I have never seen two masters run together, nor one command another. Hurry, they're breaking through the door.</p><p>Joie's heart was pounding so hard she was afraid it would burst through her chest.</p><p>It might not have been such a good idea to tell him I thought he was nasty.</p><p>The entire inn shook, the walls swaying as if from the shock of an earthquake. The door to the verandah sagged, splintered again as something struck it with tremendous force. Whispers filled the room, soft, insidious whispers made with sweet voices.</p><p>Gabrielle cried out and put her hands over her ears. She took several steps toward the door, nodding her head, her lips beginning to move. Gary leapt to her side, dragged her back, his hand over her mouth. He put his lips against her ear. \"They're trying to command you to invite them in. You must not listen to them.\"</p><p>The door burst in the middle. A black swarm of insects flew into the room with the rain and wind. The dense cloud of stinging bugs attacked exposed flesh, biting viciously. Gary threw a blanket over Gabrielle's head, wrapping her face and arms to protect her from the worst of the bites. Jubal cursed and beat at his face and neck in a frantic attempt to keep the insects off him.</p><p>Joie stood stoically facing the monster outside her door. His smile was a terrible parody, as was his bow. He looked smug as he watched the black horde of insects biting the occupants of the room. Joie knew she was staring at something far more foul than the creature she had knifed in the cave. He beckoned to her with his clawlike fingers, and she felt a tremendous pull. It was only the vicious bites of the insects that kept her from stepping out of the room and onto the verandah. She had no doubt that he would kill her. That he would kill all of them. She struggled to keep her mind her own, rather than allow his soft voice to intrude and command.</p><p>\"Tell me why you do his bidding.\" The only weapon she had was to flatter the vampire's ego. Stall him in the hope that Traian would come before Valenteen could entice her out to him. \"It's clear you're much more powerful. Why would you serve such a creature?\" She forced interest and admiration into her voice. \"I find it hard to believe that a man like you needs someone like him.\"</p><p>Valenteen's lip curled, exposing blackened gums. \"I allow him to think he commands me. It suits me to fall in with his plans. We both seek the same thing. If he finds it, I will take it from him.\"</p><p>Joie was being compelled forward, one slow step at a time. She struggled to stay grounded, flinging her hand out to Jubal. Her brother's fingers tightened over hers instantly, gripping her without hesitation. \"Of course you'll take it. He's a fool to think he can treat you with so little respect. I've been all over the world and have never encountered a man as powerful as you.\" She tried to interject a flirty note in her voice, but her acting skills didn't stretch that far. \"You should lead them all. Everyone would benefit from your knowledge.\"</p><p>In spite of Jubal's restraining hand, she was jerked another step forward. Joie felt like a puppet on a string. She couldn't stop her body from going toward the beckoning hand, even with Jubal trying to hold her back.</p><p>Valenteen nodded his head. \"It is true that I have much experience in leading. Perhaps killing you is not the best answer. Perhaps bringing you to my side would serve us both better.\"</p><p>Jubal let go of her hand and caught her around the waist, lifting her away from the threshold. At once the vampire closed his hand, staring at Jubal's throat. Joie's brother went down hard, choking, coughing, fighting for air. The insects instantly swarmed over him, clogging his throat, attacking his exposed face. Gary made a grab for Joie, but she shook her head and deliberately stepped onto the verandah.</p><p>\"Help Jubal,\" she ordered. She kept her gaze on the vampire, trying to appear fascinated. Traian was close. He was with her, moving in her mind, giving her strength. The vampire believed he was still compelling her to do his bidding, but with Traian's aid, she moved on her own. She didn't look behind her to see if Gary was able to fight off the insects. Intuitively she knew it was better for all of them to keep the vampire's attention centered on her.</p><p>Her stomach lurched at the prospect of being close to such an evil creature. She could see him clearly now, without the illusion the undead often used on their victims. Flesh hung from his bones. Tufts of hair clung to his scalp. His long, thick fingernails were in the shape of hooked claws, sharp and twisted and black. His eyes were red and streaked with yellow. There was a malevolence clinging to him that sickened her and fouled the air around him.</p><p>Instead of trying to stop herself from moving toward him, Joie had to force her shaking legs to take a step. Impatience crossed his face. \"Joining with a man so powerful and knowing he's certain to rule those around him sounds like a good idea. I've always admired strength.\"</p><p>Inches from his outstretched hand, Joie purposely tripped on a piece of the splintered door and stumbled. She protected herself with a palm to the ground, her body slightly turned, giving her precious seconds to slide her other hand along her leg to secure the knife strapped to her calf, the blade hidden flat against her wrist.</p><p>Valenteen leaned over her, spittle drooling from his mouth as he caught her by her hair and wrenched her to her feet. He dragged her against his body, jerking her head back to expose her throat, and sank his teeth deep, gulping as he drank.</p><p>Joie registered the fiery pain of an acid burn as he tore a gaping wound in her throat. Her vision blurred, and the ground lurched as her legs went rubbery. She could hear the sound of his heart, although she couldn't feel it beating. She made no sound of protest, made no struggle, giving herself up willingly. Some of the tension slipped from the undead's body. With every ounce of strength she possessed, everything she was, Joie plunged the knife deep into his chest, driving straight for his heart.</p><p>Lifting his head, Valenteen screamed horribly, the sound shattering glass from windows. Gripping her hair, he dragged her backward as his body fought to stay up in spite of the knife in his heart. With his other hand he grabbed her chin with every intention of breaking her neck.</p><p>Blood gushed from the wound in her throat so that his hand slipped off. Joie clamped both hands on the back of the fist clutching her hair to hold his hand to her head. Dropping low, she spun around and stood up fast, snapping bones in his hand. He howled as he let her go, raking at her with poison-tipped talons.</p><p>Traian emerged from the darkness, his eyes flaming red, dragging the vampire off of her, wrenching his head around hard. The knife handle dropped uselessly to the floor of the verandah, the blade completely eaten away by acid in the blood of the undead. Traian's fist shot out, plunging deep, following the trail of the knife. Valenteen matched the move, driving his good hand into the wall of Traian's chest, through the muscle and tissue, seeking his heart. Traian got there first.</p><p>Staring into the vampire's eyes, he ripped the shriveled, blackened organ out and tossed it aside. Lightning forked in the sky, spun until it was a bright white sphere that engulfed the vampire. Valenteen disappeared into ash and cinder, then was gone completely. The heart was incinerated next. Traian bathed his hands and arms in the energy, removing the acid burning his flesh so he could tend to Joie.</p><p>She sat on the ground, watching him with a kind of awe. She couldn't talk because of the wound in her throat. She simply sat there, her hands pressed to the gaping tear to try to stem the flow of blood. Gabrielle screamed and ran to her side. \"Help me, Jubal, help me lay her down. I need towels, anything at all. Joie, don't you die on us! Damn it, Jubal, she's lost so much blood. Help me.\"</p><p>Gary took her arm and stepped back, taking Gabrielle with him. \"Only Traian can help her now.\" Jubal looked at the Carpathian. \"Do it. Whatever you have to do. Just don't let her die.\"</p><p>Traian looked at their faces, swollen and red from the bites of the insects. He reached down and gathered Joie into his arms, cradling her against his chest. Joie settled against him, her eyelashes slowly drifting down. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Traian,\" Gary said calmly. \"You're in almost as bad shape as she is. You need blood fast. Use Jubal while I get the soil to pack the wounds. I'll give you more blood as soon as I return.\"</p><p>\"She does not want me to use her family,\" Traian said. He had automatically slowed Joie's heartbeat to lessen the blood loss. He buried his face in her throat, closing the terrible wound as best he could with healing saliva.</p><p>\"Who gives a damn what she wants?\" Jubal snapped. \"She only objected because she thought you were a vampire. If you need our blood to save her, take it. It obviously hasn't done anything to harm her or Gary. Gabrielle, help Gary with whatever he needs.\"</p><p>\"The garden has rich soil,\" Traian instructed. He stood for one moment, the lines on his face deep, his chest ripped open, weariness and fear mixed with a turbulent rage in his eyes. Then he leapt to the second-story balcony above them and hurried along the banisters until he found Joie's room.</p> <p>Jubal took the stairs, streaking through the halls to burst into his sister's room. Flinging the door closed, he approached the bed where she lay. Joie was pale, almost gray, her breathing so shallow it nearly didn't exist. \"Can you save her? Tell me the truth, Traian. Is it possible?\"</p><p>A fist seemed to be wrapped around his heart. Traian raised midnight-black eyes, as cold as ice, to Jubal. \"I will allow no other outcome.\"</p><p>\"Gary said you needed blood.\" Jubal sat down beside his sister and took her hand. \"Joie means the world to us. I can see she means the world to you too. I'm not going to pretend to understand your relationship; I'll just be grateful for it.\"</p><p>Traian murmured softly, sparing Jubal the initial fright as he opened a vein in his wrist and fed.</p><p>Forgive me, Joie. I know you did not want this.</p> <p>Strength flowed into his depleted body.</p><p>If I am to save us, this is our only choice. Both of us are wounded. If I can get enough blood, we will survive.</p><p>There was a faint stirring in his mind. A touch, no more, like the light caress of fingers on his face. Traian carefully closed the pinpricks on Jubal's wrist and gathered Joie to him before he awakened her brother from his enthrallment. Jubal slipped from the bed to sit on the floor. \"I take it you have my blood.\"</p><p>\"Yes, thank you,\" Traian replied formally. \"You have all been more than lucky. Any vampire is difficult to defeat, but master vampires have lived for century upon century, growing in strength and power. They use others as minions and puppets and keep themselves from dangerous battles. They sacrifice lesser pawns and slide away when hunters are in the area. They only fight when they are assured of victory.\"</p><p>Jubal watched every movement as Traian laid his hands on Joie's terrible wounds. He seemed to be gone from his own body, staring emptily in space. Jubal could see the lines deepen in his face, his color paling visibly as if his strength were slowly being drawn from him.</p><p>Gary and Gabrielle burst into the room. Gary set a bowl of rich, dark soil on the floor beside the bed, and Gabrielle dumped various herbs into a second bowl. Gary handed candles to Jubal. \"Spread these around the room and light them. We don't want any artificial lights on, just the candles. Gabrielle, mix the herbs together in the bowl. We want the scents to blend.\" He put his hand on Traian's shoulder. \"Joie was a surprise to Valenteen. She was wonderful, unbelievable. She didn't even hesitate. It never occurred to a vampire that a woman would stand between others and danger. And he certainly never thought she would be willing to plunge a knife into his heart.\"</p> <p>\"She used my memories,\" Traian explained as he mixed healing saliva into the soil and packed the wounds in Joie's throat. \"She flattered him and stalled him, hoping I would get there in time. And when I didn't, she did what she always does, she courageously put herself in harm's way in order to get close enough to make certain she destroyed him.\"</p><p>Gary took handfuls of the mixture and packed it into Traian's chest. \"Even with all I know, the draw to go to him was so powerful, I doubt that we would have survived.\"</p><p>\"He was a master vampire and he ran with another much more powerful master.\" Traian lifted his head to look at Gary. \"I never saw the other one clearly. He took my blood in the cave, yet I did not remember him.</p><p>I cannot go near our prince. You will have to relay to him all information. Until the vampire is found, and I very much doubt that he will remain in this country now, I will stay away from Mikhail. We cannot take a chance with his life.\"</p><p>\"He won't see it the same way,\" Gary pointed out.</p><p>\"You know I am right. He should not chance his life by entering into battles in the way that he does. His purpose is to serve and lead our people, not hunt the vampire. We have many hunters and only one leader. His brother is strong and powerful, but he has been damaged by the torture he endured. He cannot lead. If the vampire or humans managed to kill Mikhail, I fear our race would be mortally wounded.\" Traian didn't look up at Gary to see if he agreed or not. He gathered Joie into his arms.</p><p>You must accept my blood, Joie. This will convert you to my race, and it is not a pleasant experience to go through.</p><p>Again he felt her touch, gentle, tender, on his face, yet she lay motionless in his arms. A faint smile appeared in his mind as if she found his warning amusing. He turned his body slightly, not wanting to drain his strength further by masking their presence from the others. The soothing aroma from the herbs and candles mixed with the sounds of chanting in his mind as other voices far away joined in the age-old healing chant. He took the smallest amount of blood possible from her and quickly opened his own vein. She accepted his blood just the way she did everything else where he was concerned, with complete faith. It humbled him that she did so.</p> <p>When she had taken enough for an exchange, Traian laid her gently on the comforter. \"Perhaps you all should leave the room. She would not want you to see her this way.\"</p><p>\"You need blood and care yourself,\" Gary pointed out. \"You're weaker than you think, Traian. Take my blood and let me help the two of you through this. I know what to expect. Gabrielle and Jubal can wait in their rooms.\"</p><p>\"We'll stay,\" Jubal said decisively. \"She's our sister.\"</p><p>Gabrielle watched Traian feeding from Gary. It should have repulsed her, but instead she was fascinated. It seemed such a noble moment to her, one being reaching out to aid another. Gary seemed completely unafraid and matter-of- fact about giving blood, as if it were an everyday occasion. \"If it's messy, Traian, Joie would want me here to see to her needs. She's very meticulous about certain things.\" Gabrielle lifted her chin, prepared to fight for her right to stay.</p><p>\"Your wound is deep, Traian. You need to go to ground. Even with my blood, you don't have strength enough to heal that gash. He nearly tore out your heart,\" Gary said. But he was watching Joie. The first ripple of pain crossed her face and sent a shudder through her body.</p><p>Traian felt the pain take her, a fire burning with the force of a torch in the center of her body, blossoming outward like an explosion. He merged with her, trying to take the brunt of the pain, determined to make her initiation into his world as easy as possible. Traian was amazed at Joie's siblings, certain they would be horrified and afraid as the convulsions started, when Joie was violently sick and it was impossible to control the waves of unrelenting pain. They worked together as a team, seeming to understand that he couldn't talk or direct them. His full attention was on blocking as much pain as possible and helping Joie through the conversion.</p><p>Gary kept the room clean and smelling of the soothing aromas from the herbs and candles. All of them picked up the words to the ancient healing chant. Gabrielle wiped beads of blood from Traian's brow. He managed a faint smile, but his complete attention was clearly on his lifemate.</p><p>The moment he was able, Traian sent Joie into a deep sleep. Exhausted, he looked up at them. \"I have to take her away for a few days. We will be unable to get in touch with you, but she is alive and she will heal quickly.\" He avoided all references to the ground. Joie's family had been through enough without knowing the specifics of where he would take her.</p><p>Gabrielle leaned over and brushed a kiss on the top of Traian's head. \"You take care of her. We're depending on you. I'm not sorry she found you, not after watching the way you've cared for her.\"</p><p>Traian could see she was blinking back tears. \"Thank you, Gabrielle. As soon as possible, I'll bring her to you.\"</p><p>\"I'll stay here with them,\" Gary offered.</p><p>Traian shook his head. \"Warn Mikhail. I don't want to send the information to him on the chance that the one who took my blood could find a way to use me to harm him. Let him know there is something in that cave of value to the vampires and that there are numerous traps. He'll understand when you tell him it is a cave the wizards used.\"</p><p>Gary nodded. \"Jubal and Gabrielle may come with me, if they choose.\"</p><p>Traian rose, Joie in his arms. \"Go then, go tonight. The rules that have always applied to vampires seem to be changing rapidly. You will be safer under Mikhail's protection.\" He slipped out onto the balcony, into the night where he belonged. Where he was comfortable. The wind blew into his face, ruffled his hair, brought him messages from creatures around him.</p><p>He took to the skies, the sleeping Joie in his arms, and headed for a small cave he remembered from his younger days, a cave of healing with hot springs and glacier-water pools. Far below his homeland stretched out before him, a place he had not seen in many years. The sight brought back memories of his parents and his childhood friends. He was home and he held his lifemate in his arms.</p><p>She will never be safe. You will always be linked to me. I spared your life, but I can take it whenever I choose. And I will take hers.</p><p>Traian did not hesitate. He sent a clap of deafening thunder back along the mental path the vampire had initiated, a bolt of lightning streaking through the sky like a spear homing in on prey. Just as quickly, he moved his own position, fully prepared for a war in the sky.</p><p>An explosion of pain burst in Traian's head. He rode it out, certain he'd scored a hit.</p><p>You will pay for that. I am an ancient warrior. I do not fear you or any other of your kind. If you wish to pursue me or mine, I welcome the opportunity to carry out your death sentence.</p><p>Traian moved again, certain of reprisal. He had not displayed fear or awe, or even respect, and the vampire was used to his minions admiring him.</p><p>A shower of hot stones poured from the sky. Traian protected Joie, covering her body with his like a blanket. The stones fell harmlessly around them, but the attack was a halfhearted attempt. The vampire was fleeing and simply wanted to instill fear in Traian.</p><p>He hugged the sleeping Joie closer to him. \"I have been a warrior so long, I barely recall any other existence. Even a master vampire cannot change my chosen path. If he should come to find us, Joie, I will not turn away. He will not take you from me, nor will he take me from you.\" He made the promise to her aloud beneath the stars. And then he took her deep beneath the surface to the healing caverns. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Joie awoke quickly. One moment she knew nothing, and the next she was fully conscious. She heard the steady fall of water, the thrum of life beating in the earth. She knew where she was and how she got there. She felt different, completely alive, yet her body ached and her throat felt torn. She turned her head to look at the man holding her. Traian lay beside her, his arms around her, one hand on her bare stomach, his fingers splayed wide. They were lying in a deep hole in the damp soil of a cave. Overhead the ceiling sparkled with crystals, and water shimmered in a pool not far from them. She knew it, saw it, yet it should have been impossible, buried in the soil as they were.</p><p>\"I'm seeing what you've seen,\" she guessed. Her voice was different, husky, not at all the way she'd sounded before.</p><p>\"Yes.\" His teeth nipped her shoulder. \"We're in a cave I used to swim in as a young man.\"</p><p>Joie looked around her, reached out, and touched the damp soil. \"It's a darned good thing I don't have a cleanliness fetish. Aren't beds appropriate when you're injured?\"</p> <p>\"The soil heals us.\" He kissed her neck, swirled his tongue over the wounds on her throat. \"We can remove all traces of dirt easily. Our wounds were packed earlier with soil but are very clean now. I will repack them before we go to sleep again.\"</p><p>\"How lovely for us. Are there worms in this particular little bed of soil? And did I happen to mention worms in any of our talks?\"</p><p>\"I do not believe you did.\"</p><p>\"There was a reason for that.\" Her fingers tangled with his. His hand on her stomach was soothing her in some way she didn't understand. Her insides ached. \"Did someone take a baseball bat to me?\"</p><p>\"No. The conversion is difficult.\"</p> <p>She didn't want to remember the horror of that seemingly endless pain. The complete loss of control. The helpless feeling she had or the look in his eyes. Especially the look in his eyes. Begging forgiveness. He'd looked guilty, terrified of losing her. She recalled the blood-red tears that had fallen on her face. \"Yes, it was. For both of us.\" Traian nuzzled the top of her head with his chin.</p><p>\"What about Jubal and Gabrielle? It must have scared them to see that nasty little vampire ripping out my throat.\"</p><p>He felt the tremor run through her and pressed his body closer. \"They were incredible.\" He still had trouble believing that neither of them looked at him with blame. And Gabrielle had been so generous in her parting words to him. \"They are both fine. Gary took them to our prince. They are with Mikhail and his lifemate, under their protection. I like your brother and sister very much.\"</p><p>\"I never really thought about it before. We live in the world with humans and protect them, but to keep our race safe, we have always remained apart. This has been my first close contact with humans. Gary is an extraordinary man and obviously trusted by our prince. I feel genuine affection and admiration for Jubal and Gabrielle. I never would have expected to feel this way.\" Traian rubbed her nose with the pad of his finger, and then traced her mouth.</p><p>Joie smiled and nibbled gently at his hand. He touched her continually, as if seeking the reassurance of physical contact. \"You'd better have a deep affection for them. It's the only safe thing to do with those two. And with my parents also, I might add. They're going to drive you crazy, so you have to love them, otherwise you'd do them in. I can't wait for you to meet my mom and dad.\" She burst out laughing at the thought.</p><p>\"Why do you do that?\" Traian asked suspiciously. \"You have a wicked way of laughing every time you mention introducing me to your parents.\"</p> <p>\"Don't worry, I'll protect you from them. Jubal, Gabrielle, and I always go home for visits together. If we team up, we have a chance.\"</p><p>\"I am Carpathian,\" he pointed out.</p><p>\"Like that's going to matter. But you keep thinking it will.\" Her hand fluttered to her throat, still raw and sore from the attack. \"How come I didn't wake up gorgeous and perfect?\" Joie glared at him. \"I had visions of a makeover.\"</p><p>\"You are gorgeous and perfect.\" He sounded puzzled. \"I woke you early to give you more blood, but you'll be going back to the ground until you are fully healed.\" He touched his chest. \"We both will.\"</p><p>She turned her head to look more fully at him, and her breath caught in her throat. \"Oh, Traian, let me see.\" She rose up onto her knees in spite of his restraining hands. \"You're really hurt.\"</p><p>Her eyes held worry, concern. Her hands moved over his chest with anxious, caressing strokes. Traian held his breath, shocked at the tidal wave of emotion sweeping through him. \"It is of no consequence, but thank you for worrying.\"</p><p>\"It's of great consequence,\" she contradicted him. \"How do you do that healing thing? Can I do it to you? Would it work?\" She was already leaning over him, her tongue swirling around the edges of his mangled skin.</p><p>Traian closed his eyes. Her tongue was soothing, a gentle caress that took him by surprise. She was attempting the healing chant in her head, the words soft and hesitant, but she got them right. His eyes burned, his throat clogged, and even his chest felt tight. It had not occurred to him that she would try to take care of his wounds.</p> <p>\"Silly man,\" she whispered. \"Of course I'm going to take care of you. I need to take care of you.\"</p><p>He didn't open his eyes, afraid she might see tears there. \"I thought you were a want to kind of woman.\"</p><p>\"True, but women get to change their minds all the time. Right now I need to do this.\" She laughed, and her breath was warm against his bare skin. \"You'd be surprised at the things I need to do.\" Her mouth was moving dangerously lower.</p><p>\"Oh no, you don't,\" he objected. \"You need to heal first, Joie. I am going to give you blood and put you back to sleep.\"</p><p>She laughed again, blew warm air over the head of his erection. \"Really?\" Her tongue licked him as if he were an ice cream cone. Swirled and danced and did outrageous things. \"I'm back to the I'm a want to kind of woman. I want a lot of things right now. And I want you wanting me enough to stop worrying about whether or not I can make love in my delicate condition. And I want your body inside mine. Only you will do, Traian. I've fallen desperately in love with you, so, darn it, you have a few responsibilities.\" She proceeded to show him exactly what she meant. </p> </body></html>"]