["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>FOREWORD</p><p>UNTIL WE BURN is a novella to introduce Dominic Kinkaide, the main character from BEFORE WE FALL.</p><p>This novella is intended to illustrate Dominic’s lifestyle, his behavior and his mindset which will enhance his character as you read BEFORE WE FALL. Because his lifestyle is a bit wild, this novella will contain explicit language and adult content.</p><p>If you like a bad boy, you’ll love Dominic. I’ve always found this to be true: The badder they are, the harder they fall. Dominic will prove this notion in BEFORE WE FALL. He’ll fall hard....eventually.</p> <p>But until then, he’s immersed in his bad boy ways. I hope you enjoy UNTIL WE BURN.</p><p>Chapter One</p><p>“Harder,” the girl whispers. Obligingly, I slap her ass again. Hard.</p><p>The stinging sound echoes through the night, rippling through the silence of Mount Lee. A hundred feet below, the giant letters of the Hollywood sign gleam ghostly white in the darkness.</p><p>I smile against the back of the girl’s pale neck and bite it. Hard.</p> <p>My teeth sink into her soft flesh, but she likes it. She moans, twisting around so that she can clutch at my chest, twisting her fingers in my tux jacket.</p><p>“Dominic,” she sighs. “I can’t believe I’m here with you right now. Dominic Kinkaide is slapping my ass.”</p><p>“Dominic Kinkaide is doing more than that to your ass,” I point out, remembering how I’d just pulled out of it a minute ago, how I’d rolled off the condom and flicked it away.</p><p>As the coatcheck girl from the black gala event I’d just vacated, she probably had no idea when her evening started that it was going to end like this: with quick, hard anal sex in public....with me.</p><p>Even though it’s two a.m. and it’s unlikely that anyone will be hiking up Hollywood Ridge Trail, the knowledge that they could, the knowledge that strangers might stumble upon us and find us in this intimate situation, turned me on quicker than anything.</p><p>I finished what I set out to do within a few minutes and now, I pull away and adjust my clothes as the girl pulls at her own.</p> <p>I don’t know her name.</p><p>Her name doesn’t matter.</p><p>The girl looks up at me, batting her eyelashes. “That was nice. If you want to... you know, um, actually sleep with me, call me, okay? I’ll give you my number.”</p><p>I look at her in amusement. “Actually sleep with you?”</p><p>She looks embarrassed. “I don’t mean like... sleep in my bed overnight. I mean, real sex. Not just... what we did.”</p><p>“Anal?” I raise an eyebrow. We’re both adults here. We can call a spade a spade.</p><p>“Yeah,” she manages to say, her cheeks flushed. “Anal. That’s the first time I’ve ever done that, by the way.”</p><p>That’s what they all say and I have a hard time believing it. This is the twenty-first century after all. I grin at her though, deciding to humor her.</p> <p>“And? What’d you think?”</p><p>She bats her eyelashes again, coy now, laying her hand against my chest. “I think that you can do anything you want with me,” she purrs.</p><p>I fight to not roll my eyes at her sticky-sweet tone now. She’s too compliant, too needy, too willing to do anything at all that I ask of her. Why the fuck are they always like this? Are they so desperate to sleep with someone famous, even one single time, that they’ll do anything for it?</p><p>Nine times out of ten, the answer is yes.</p><p>And nine times out of ten, I capitalize on that. I’d be an idiot if I didn’t.</p><p>But to be honest, the whole thing is getting tiresome. I’m weary of it. I’m weary of the shallow people, I’m weary of people using other people, I’m weary of easy women who constantly throw themselves at me.</p><p>They only want to say “I was with Dominic Kinkaide.” They want to claim a tiny piece of me, no matter how small that piece or moment was.</p><p>In this case, Coatcheck Girl will be able to say that she claimed ten minutes of my time. But from the look on her face, the wonderstruck expression, that ten minutes was enough.</p><p>“Won’t Amy be mad at you?” she asks curiously as she runs her fingers through her tangled hair in the dark. She doesn’t sound concerned as she mentions the woman that most people assume is my girlfriend.</p><p>I shake my head at thought of Amy Ashby, a woman whose fame is equal to my own, a woman whose jaded outlook on life surpasses even my own. She’s beautiful, successful and savvy.</p><p>She’s also a cold-hearted bitch. It’s one of things I like about her.</p><p>“For one thing, Amy and I aren’t exclusive,” I answer, turning to walk back toward my car. “And for the other, it’s not your business.”</p><p>My voice is cool now. I’m not rude, just matter of fact. It’s just a way of my life. I have to constantly try to keep people at arm’s length, out of reach and out of my business. It’s a full-time job. Actually, it’s several people’s full-time jobs. I employ an entire staff of publicity people for this very reason.</p><p>“Shall we?” I ask politely, holding out my elbow to the girl. I’m a gentleman now, something that women adore about me.</p><p>I’m an actor. I can be whatever they want me to be, I morph into whatever role I’m playing, whether I’m on-screen or off. On-screen, I’ve been a serial killer, rapist, romantic, misunderstood, vampire and poet.</p><p>Off-screen, the role I play the best is that of an asshole.</p><p>The girl smiles up at me now and I can see that this one simple gesture took the sting out of me telling her to mind her own business.</p><p>“Will you call me?” she asks hesitantly as I help her into my slate gray Porsche.</p><p>“Probably not,” I answer honestly as I close her door, still the gentleman. Gentlemen are polite. Gentlemen use manners and most importantly, gentlemen are honest. I’m almost always honest.</p><p>“Seriously?” she stares at me as drop into the driver’s seat.</p><p>“Seriously,” I nod. “Not because I won’t want to, but because this isn’t the kind of life that would be good for you. If you were linked to me in any way, the press would hunt you down, stalk you, photograph you, and pretty much drive you insane. Trust me, it’s for your own good. I won’t call you because I want to you protect you from that.”</p><p>Lie.</p><p>Okay, fine. I’m not always honest.</p><p>And I’m not always a gentleman.</p><p>I stare at the road in front of me as I drive down the winding trail. The engine of my 911 revs around each curve as the tires hug the road.</p><p>“OK. That makes sense,” the girl nods, buying every bit of my line of shit. “Well then, can I call you?”</p><p>“That probably wouldn’t be a good idea either,” I answer bluntly. “But it was nice being together tonight, wasn’t it? I had fun.”</p><p>From my periphery, I see her shoulders slump as she realizes what I’m saying. But what the fuck did she expect? She handed me my coat and offered herself to me on a platter. Did she expect a long-term relationship?</p><p>“Oh well,” she says with forced brightness. “You’re right. It was fun. Can I at least have an autograph?”</p><p>“Of course,” I tell her. “It would be my pleasure.”</p><p>A few minutes later, after we glide to a stop outside of the Shangri-La hotel where she works, I scribble my name on a piece of paper and hand it to her.</p><p>“Thanks, Dominic,” she murmurs, staring me in the eye. “If you change your mind, you know where to find me.”</p><p>I nod and she gets out. I barely glance in her direction before I drive away, although I know that she’s standing on the sidewalk watching me disappear into traffic. They always do.</p><p>Deep down, I should feel guilty. I should feel bad. And once in a while, every once in a blue moon, I do. But then I stomp the shit out of that emotion and put it out of my mind.</p><p>These girls throw themselves at me, not the other way around.</p><p>I’m only giving them what they want.</p><p>It’s a public service, really.</p><p>But none of them, not one, will ever see the real Dominic Kinkaide. In fact, I’m not even sure that he exists anymore.</p><p>I might’ve been successful in drowning out his existence in a barrage of women, kink and whiskey.</p><p>As I drive toward my home overlooking Hollywood Hills, my phone buzzes in my pocket. Pulling it out, I see Amy Ashby’s name flash on the screen.</p><p>I sigh, debating whether or not to answer it.</p><p>Yes, she understands me... or at least, the part of me that is like her. The part that has to shield itself from the public. And yes, I like that she’s bitchy and tough. I admire it because I always know where she stands. But sometimes, like tonight, I’m just not in the mood for it.</p><p>I answer the call anyway.</p><p>“Why did you leave the gala so fast?” Amy complains into the phone, forgoing a greeting. “I wanted to ride home with you. My brother was boring me.”</p><p>Amy’s older brother Sam was the host of the event tonight, in an effort to raise money for autism. He’s as different from Amy as he can be: kind, considerate and normal. Because of those things, he’s not in show business.</p><p>I shake my head, although she can’t even see me. “Because I was tired of the whole thing,” I answer, not mentioning the coat check girl. “You could’ve left with me.”</p><p>Lie. Amy’s a freak in the sack, but she wouldn’t have enjoyed being with a coat-check girl. She likes to think she has standards. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She sniffs. “Whatever. Come over. I want to see you.”</p><p>I open my garage door. “Nope. I just got home and I don’t want to go back out. You can come here, if you’d like.”</p><p>There’s a pause while she considers it. Finally she sighs.</p><p>“Can’t. I’ve got an early call tomorrow. I don’t want to be a bitch on-set.”</p> <p>“No?” I ask in mock surprise. “Amy Ashby doesn’t want to be a bitch?” She laughs, a husky contrived sound.</p><p>“You know, I’ve changed my mind. I’m coming over and I’ll be a bitch tonight for you. I know how you like it. Which riding crop should I bring? The leather or the red velvet?”</p><p>A thrill goes through me at the thought... of being tied up and of Amy Ashby whipping the shit out of me right before she goes down on me.</p><p>It’s our favorite thing to do together.</p><p>“The red velvet,” I answer curtly. “I’ll see you in twenty minutes. Don’t be late.”</p> <p>“On my way,” she purrs.</p><p>I enter my lavish house and disarm the alarm, before grabbing a tumbler of whiskey and heading out to the back veranda.</p><p>As I stand looking down on Hollywood, I ponder my life.</p><p>It’s not what it was supposed to be. In high school, this wasn’t what I had in mind when I pictured myself as a grown up. But here I am, at the mature age of twenty-four and I feel like I’ve aged a hundred years. I feel as though everything that could’ve possibly happened to me in life has happened.</p><p>And it’s left its mark. I’ve got so many marks and scars hidden beneath my surface that I can’t even name them all.</p><p>But that’s all right. I don’t need to name them all. I need to shove them away and forget about them, like I always do. I need to mask them in a wild kinky night of S&amp;M with Hollywood’s favorite starlet.</p> <p>In the morning, we’ll go about our lives as normal, both of us pretending to be what we’re not: normal, well-rounded people.</p><p>The pretense is how we survive.</p><p>Chapter Two</p><p>I duck in the back of my favorite restaurant, Providence, and make my way to my regular table. It’s in the back, in the shadows, and that’s just the way I like it.</p><p>I’m different from most of the people I know who eat here. Most celebrities like to make an entrance through the front because they enjoy how the fans rush up to them, surrounding them with pleas for autographs or pictures.</p><p>Not me.</p><p>That’s never been me.</p><p>I’ve barely slid into my booth before a waitress slinks over to me, her bright green eyes lighting up as she sees me.</p> <p>“Dominic,” she exclaims, wrapping an arm around my shoulders and squeezing. I grin up at her, genuinely pleased to see her. Since she’s one of the only women who have ever turned me down, I shouldn’t be so partial to her.</p><p>But that’s not the case. I actually like her.</p><p>“Hey Alex.”</p><p>She glances around me. “Where’s Miss Ashby? Should I watch for her?”</p><p>I shake my head, remembering how I spent most of the night tied up in silk cords and getting my ass beat by her. She’d slipped out of my house before nine a.m.</p><p>“Nope. She’s at work today. I’m here on my own.”</p><p>“Just the way I like it,” Alex announces smirking. She sits across the table from me, comfortable now that she knows Amy isn’t coming. “How are things? I haven’t seen you in a couple of weeks.”</p><p>I shrug. “I’ve been busy. Just wrapped production, and I have a couple of weeks before the next film starts. I’m thinking about going to my brother’s for a weekend or so. It’d be nice to go home for a few days.”</p><p>Alex shakes her head. “You know that your family has been blessed by the Gods, right? I mean, you’re gorgeous, sexy as hell and you’ve got the freaking world on a string, Dominic. Your brothers are in the most famous band in the world and so you’ve got a built-in soundtrack to your life if you want it.”</p><p>I have to laugh at that. “Oh really? You think that the Devil’s Own will just stop what they’re doing and write some songs for me? Not hardly. I love my brothers, but Sin and Duncan aren’t going to interrupt a tour schedule just for me. But you’re right. I’ve been blessed and I need to remember that.”</p><p>I pick up my menu, even though I know exactly what it says. As I peruse the food offering, Alex stares at me, her brow furrowed.</p><p>“What’s going on with you, dude? You don’t seem like yourself. You seem...off.”</p><p>I laugh again. “I am off. I’ve been off for a long time, but nothing’s wrong. I’m just feeling a bit tired. I think going home to Chicago will be good for me. It’ll recharge my batteries, so to speak.”</p><p>Alex continues to examine me, her head cocked. “Okay. If you say so. But if you want anyone to talk to someone who won’t just tell you what you want to hear, you know you can talk to me. I’m not concerned with sleeping with you, so I’ll always be honest with you.”</p><p>“You’ve got that right,” I tell her wryly. “You’ve never been concerned with sleeping with me.”</p><p>She taps her wedding ring. “Sorry, dude. You’re hot and all, but I’m one of the few out there who believes that marriage is sacred. Well, there are only a few here in LA. I’m sure that there are plenty more like me out in the real world. But we Angelinos are a different breed.”</p><p>“True story,” I agree. “I’ll have the fish tacos.” I fold up the menu and hand it to her. “Thanks, Alex.”</p><p>And by thanks, I mean for offering to listen to me. I do appreciate it. She’s one of the few decent people I’ve met out here.</p><p>“Sure thing.”</p><p>She trots off to the kitchen and I’m left alone once again.</p><p>But only for a few minutes.</p><p>The hostess, a bleached blonde Barbie-type makes her way over to me a short time later, trying to act casual but I feel sure that she’d bee-lined her way to me as soon as she saw that I was here. She always does.</p><p>“Dominic,” she purrs, snaking her skinny arm around my shoulders. Unlike when Alex did it, I’m not enjoying this girl’s touch. I shrug out of her grasp.</p><p>“Hi,” I answer coolly.</p><p>I’m not trying to be rude, but she’s always annoyed me. She’s an opportunist. She’s trying to make it in the acting world and I know she’d probably take down her own grandmother to get a leg up. Given how poor her acting skills are when she pretends to be casual around me, I don’t think she should quit her day job.</p><p>“So, are you alone?” she asks bluntly, her lips almost grazing my ear. “Because I’ve got something important to discuss with you.”</p><p>I arch an eyebrow. “Oh, really? And that is?”</p><p>She whispers into my ear. “I’m not supposed to discuss this kind of thing here, but I have a question about the industry.”</p><p>And by industry, she of course means the acting world.</p><p>I sigh.</p><p>“Okay, shoot,” I tell her.</p><p>“How can I go about getting your agent?” She asks seriously, her eyes burning into mine with intensity.</p><p>“Tally?” I ask in surprise. “He’s got a waiting list ten miles long. He was a friend of my father’s and that’s the only reason why he took me on a few years back.”</p><p>She stares at me dubiously. “So there’s no way whatsoever that I could get you to put a good word in for me?”</p><p>There’s a light in her eyes now, a particular sexual light that I’ve seen in a thousand women’s eyes. I stare back, unfazed.</p><p>“Probably not.”</p><p>“Nothing I can do?” she asks again, her hands trailing from my shoulders down my back and wrapping around to my lap, lightly tracing my crotch. “Can I try?”</p><p>I roll my eyes. “Go for it.”</p><p>The hostess glances around, sees that no one is near, and immediately drops to her knees and crawls under the table. I’m startled for a mere second, then as her deft hands unfasten my pants and stroke at me, I allow all cognitive thought to leave my mind. When her mouth replaces her hands, logical thought disappears and I close my eyes.</p><p>Her hands are cold as she cups my balls, but her lips are warm.</p><p>Her breath is hot.</p><p>And her tongue teases the tip of my dick.</p><p>I fight back the urge to moan. She’s hidden by the tablecloth, so it would look odd if anyone happened to notice me moaning to myself in the middle of a restaurant.</p><p>Christ. I despise women like this, but at the same time, I can’t dismiss their merit. It’s nice to get blown in the middle of the day, in the middle of Providence.</p><p>Sometimes, it pays to be Dominic Kinkaide.</p><p>“Hey, Melanie hasn’t bothered you yet, has she?” Alex demands, appearing out of nowhere. My eyes snap open and I fight to act normal, which is hard since a very key part of me is buried in Melanie’s throat at this very minute.</p><p>Melanie tightens her grasp on my balls, as she’s perfectly able to hear every word that Alex says.</p><p>“Yeah. Stupid chick keeps wanting to assault you... get you to help her out. Just ignore her, Dominic. She’s ridiculous. I have better acting skills than she does. And I’m not an actor.”</p><p>Melanie’s claws grip me tighter and I grimace. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No, I haven’t seen her,” I lie to Alex, praying that Alex doesn’t decide to sit down and chat again.</p><p>“Good,” she says in satisfaction. “I told her to leave you alone. I guess she listened to me for once. If she bothers you, let me know.”</p><p>“She’s not a bother,” I assure Alex. Because she’s not...right now. Alex nods.</p><p>“Your food will be up in a second,” she tells me before walking away.</p> <p>After she leaves, Melanie finishes sucking me off in record time and climbs back out from under the table, wiping her mouth daintily.</p><p>“That chick is a bitch,” Melanie growls to me. “She has no idea what kind of talent I have. But you do. Now. Can you please put in a word with Tally for me?”</p><p>She stares at me, her hard eyes turning soft for just a brief minute, long enough to give me a glimpse into her life. She’s vulnerable and insecure beneath her hard surface. Just another reason why she shouldn’t be in my world.</p><p>Girls like her get eaten up and spit out.</p><p>“Sure,” I tell her. “I’ll say something to him.”</p> <p>Lie.</p><p>But Melanie takes me at my word and bends to squeeze my shoulders once again. She walks away and I watch her hips swish as she goes.</p><p>She’s barely out of my sight when Alex returns with my lunch, switching one service (Melanie’s blow job) for another: my lunch.</p><p>It’s how my life works.</p><p>Everything is easy. Everyone strives to please me. Everything is just so fucking smooth. Now. It wasn’t always that way, of course, but the past is the past. I don’t dwell on it. In fact, I do everything I can to forget it.</p><p>For a second, I wrap my fingers around the necklace in my pocket, the one thing I allow myself to have from my previous life. It serves as a constant reminder for me.</p> <p>To never trust anyone again.</p><p>I release the pendant and grip my fork instead, chewing each bite of food efficiently and quickly, returning to the Dominic Kinkaide that the world knows and loves.</p><p>Mysterious, detached, sexy.</p><p>Those are words that have often been used to describe me. But the one word that suits me most of all has never been uttered, never even been hinted at... because no one knows.</p><p>That word is broken.</p><p>Chapter Three</p><p>“No fucking way, “I mutter to Tally. “I’m not going to London. I only have a month until the new production begins. I want to relax.”</p><p>“Well, you can relax in London while they take your pictures for the promos. I also set up a day of shooting for a Tag Heuer commercial while you’re there. You love their watches.”</p> <p>“I don’t even wear a watch,” I grumble into the phone, pouring a cup of coffee with one hand as I stand completely nude in the middle of my kitchen.</p><p>“You will for a million dollars,” Tally says cheerfully. “It’s an easy day’s work for you. Their VP of marketing is a good friend of mine and I owed him a favor. Just do this for me, please.”</p><p>“Fine. But you know I hate endorsing shit,” I growl. “Unless Porsche needs a spokesman, no more endorsements. I mean it.”</p><p>“Deal,” Tally replies. “Your plane will be wheels up tonight at seven pm. Amy can’t make the flight with you, but she’ll meet you there. They’re going to work her into the promos at the same time so they can wrap it all up in two days.”</p><p>I glance at the clock. Eleven am. I’ve got to be on a flight in eight hours. Sighing, I gulp at my coffee.</p><p>“So much for a vacation,” I sigh again in resignation.</p><p>I can practically hear my manager smile through the phone. “Your brothers have a show in Amsterdam. I’m going to arrange for you to swing through there on your way home. You might not catch the show, but you can visit your brothers for a day or two. I know you haven’t seen them in a while.”</p><p>True story. Because of their world tour, I haven’t seen them in months. I had actually been looking forward to their show in Chicago next month just so I can have the chance to see them. We’ve always been close, but our hectic schedules prevent us from getting together as much as we’d like.</p><p>“Good,” I answer. “I’ll be on the plane at seven. Are you coming?”</p><p>“Yep. I can’t trust you to stay out of trouble over there.”</p><p>He laughs and I’m not sure if he’s kidding or not.</p><p>“Oh, by the way,” he adds. “I sent you a gift. It should be there any minute. I figured your house needs cleaned before you leave.”</p><p>“I’ve got a housekeeper,” I remind him.</p><p>“Not like this, you don’t,” he answer cryptically, and then hangs up.</p><p>I barely have time to finish my cup of coffee before my doorbell rings.</p><p>I pad over the marble floors to answer it, only bothering to pull on a pair of pants before I do.</p><p>I’m still shirtless when I open the door and find two gorgeous college-aged girls standing in front of me. Blonde, pert, big tits.</p><p>Just the way I like them.</p><p>I grin, a slow grin that the public knows and loves.</p><p>Both girls grin back.</p><p>“And you are?” I lift my eyebrow. They both giggle.</p><p>“We’re from Naked Maids,” one of them tells me. “We’re here to clean your house....naked.”</p><p>I can’t help but grin again at the mere thought. Tally. Leave it to him to find something like this. He always looks out for me...on every level.</p><p>“Good,” I tell them, ushering them in. “The only problem is... my house is already clean. Can we find something else for you to do?”</p><p>They look at each other slyly as I lead them through the house to my living room.</p><p>“We’re not supposed to do anything else,” the taller one says. “But you’re Dominic Kinkaide. We’ll break the rules for you.”</p><p>My grin widens.</p><p>“That’s perfect,“ I tell them. “Because I’m a rule breaker. I have a great idea. Brilliant, really. I’d like for you to clean her,” and I point at the other girl. “With your tongue.”</p><p>They aren’t even fazed. She nods with a mischievous look in her eye and they move to the center of the room and drop onto the plush rug.</p><p>I situate myself on a sofa, my legs sprawled out as I watch.</p><p>God, I love to watch.</p><p>Hands, lips, tongues and fingers move together, rubbing, stroking, sucking. My dick hardens and I pull it out, stroking it with my fingers.</p><p>The girls look up.</p><p>“Want some help?” the shorter one asks, her lips glistening.</p><p>I shake my head. “No. I want to watch you. Keep going.”</p><p>They turn back to each other, burying their tongues in each other’s mouth as their hands move everywhere. Their fingers slip in, out, wet. They moan softly as they suckle each other, constantly glancing over their shoulders to see if I like the show.</p><p>I do.</p><p>I finish up within a few minutes and lay sated on my couch as they finish each other off.</p><p>They look up at me as I get to my feet.</p><p>“Anything else you want us to do?” one of them purrs.</p><p>I shake my head.</p><p>“Maybe clean up the kitchen?”</p><p>Their faces are astonished as I walk away and don’t look back, headed for my shower. I guess they don’t get that request very often.</p><p>As I let the water wash over my face and stream down my body, I think about my life. It’s filled with women, in and out of my days and nights like clouds passing in the sky. None of them mean anything to me. None of them will ever mean anything to me. Nothing does.</p><p>I take a very long shower, breathing in the steam, before I finally step out and get dressed. When I make my way back downstairs, the nude maids are gone. The kitchen has been cleared of my coffee cup, the coffee maker wiped clean. So they actually knew how to clean, after all. I’m mildly surprised.</p><p>I grab a book and head out to the pool, soaking in the sun while I read. I should enjoy it while I can. London is notoriously gray and rainy.</p><p>The afternoon passes quickly and before I know it, I only have an hour before I need to depart for the airport. I put the book away and pack a bag.</p><p>I’m just opening the door to my Porsche when a large black car glides to a stop in front of me.</p><p>A curvy blonde bombshell in a chauffeur’s hat steps out of the driver’s seat, dressed in short boy shorts, high heels and thick stripper’s makeup.</p><p>“Your car, sir,” she tells me, her eyes sweeping me up and down.</p><p>I’m surprised for a minute, but then I grin.</p><p>Tally.</p><p>“I suppose you drive topless?” I ask wryly as I put my bag in the open trunk. She smiles flirtatiously.</p><p>“No. But Abbi, your flight attendant, can. If you want.”</p><p>I glance over her shoulder to find another girl, a slender brunette in a skimpy flight attendant uniform, already seated in the back of the limo, pouring a glass of champagne. She holds out the drink to me with a smile.</p><p>“Abbi?” I ask, my fingers brushing hers as I take the glass. She nods, then allows her fingers to rest at the top of my thigh when I settle into the seat next to her.</p><p>“I’ll take good care of you during your flight,” she assures me softly.</p><p>It’s good to be Dominic Kinkaide.</p><p>Chapter Four</p><p>Jet lag is a bitch. A serious, wenchy bitch with a hard-on for revenge.</p><p>I roll over in bed and glare at the alarm. I didn’t sleep much on the plane. In part due to the fact that I never sleep well on them. In another part because of Abbi. The girl aimed to please. Over and over again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tally pretended not to see as Abbi knelt in front of me, not once, not twice but three times during the eleven hour flight. It was nice at the time, of course, but after arriving into Heathrow at 6am without a wink of sleep, I decided to check into my hotel and get a couple hours of shut eye.</p><p>Of course now, three hours later, it’s time to get up and I feel worse than ever. I probably shouldn’t have slept at all.</p><p>I grab my phone and punch in Tally’s number.</p><p>“Dude, I can’t get up,” I groan. “Postpone the promo shoot, would you? I need to sleep.”</p> <p>Tally sighs. “Stop acting like your brother. Sin always does this shit to me. Get your ass out of bed, take a cold shower to wake up and get here. You’re already five minutes late.”</p><p>He hangs up and I throw my phone. It hits the wall and slides to the floor, apparently unbroken. I should have thrown it harder. Fuck this shit.</p><p>As I head into the shower, I grab the room’s phone and dial the front desk.</p><p>“Send up a Blood Mary,” I tell them without preamble. “In fact, send two.” I don’t wait for a response before I hang up.</p><p>When I step back out of the shower ten minutes later, two icy cold Bloody Marys are waiting for me on the table in my sitting room. I already feel better from the cold water. But the Bloody Marys make me one step closer to human.</p> <p>Not close enough to deal with Amy’s drama this early, however. Her name flashes on the face of my phone and I wonder if she has already arrived. I vaguely remember Tally saying she’d be a day late.</p><p>I let it go to voicemail.</p><p>She calls right back.</p><p>I let it go to voicemail again.</p><p>She’s got to learn that I won’t drop what I’m doing for her. I’ll never do that. I don’t care who she is.</p><p>When I’m in the car riding to the set, I listen to her voicemail. In the first one, she’s snotty.</p> <p>“Dom, where the hell are you? I know you’re on set, so I know you have your phone. Answer it.”</p><p>I’m rolling my eyes as I listen to her second message.</p><p>“I’m sorry, babe. I was being bitchy. I’m bitchy when I’m tired.” And hungry, anxious, bored, calm, or otherwise, I think. “Anyway, I just wanted you to know that I can’t wait to see you. I’m getting in later tonight. Let’s have a late dinner, OK? Talk to you soon. Kisses.”</p><p>I sigh as I slip my phone back into my jacket pocket.</p><p>She’s starting to get clingy. They always do. And I had really thought that with Amy’s prickly personality, she wouldn’t. But here we go. The same old song and dance. I know how it ends and it won’t be pretty. But it won’t end yet. I’ll get what I can out of it while it lasts.</p><p>I close my eyes for a few minutes, until the car glides to a stop. I glance at the window and sigh. Fans are already lined up. How they know where I’ll be, I don’t know. This is just a promo shoot, for God’s sake.</p><p>But I paste a smile on as I step outside of the car, as the fans scream and faint and try to touch me.</p><p>Sign myshirtDominicSignmyboobsDominicCanIkissyouPleaseDominicTakeapicturewithmeDominic!</p> <p>Dominic! Dominic! I love you, Dominic!</p><p>Their voices blend together as security pushes them back and ushers me through the masses, through the sweat and perfume, and into the building. I take a deep breath as we step into the silence and I don’t glance back. I know what I’ll see.</p><p>People scrambling to get another glimpse of me, hoping that I’ll come back outside. They don’t even know me, but they think they do because they’ve seen me on-screen so often.</p><p>My fans are why I am so successful. I know that. And I appreciate them. I do. But I’m an intensely private person and having people tear at my clothing unnerves me in a way I’d never thought possible.</p><p>But in order to avoid looking ungrateful, I grin and pretend it doesn’t bother me. I flash the sexy smile that the world recognizes as mine.</p><p>They don’t have to know that it’s a mask, that it’s all an act.</p><p>I’m an actor. They should expect it.</p><p>“I want to see the Tower of London this time,” Amy demands as she takes a bite of cracker slathered in caviar.</p><p>I stare at her. “Aren’t you worried they’ll keep you in it? They’ve confined witches in it before.”</p><p>Amy stops chewing for a moment, her blue eyes astonished. Then she laughs.</p><p>“You’re such a dick, Dominic,” she chuckles, leaning over the sofa arm to slide her fingers along my cheek. “But that’s why I adore you. You say what you want to say to me.”</p><p>“I just call a spade a spade,” I shrug. “You know you’re a bitch and you don’t care. It’s one of the things I like about you.”</p><p>She eyes me, her expression hardening a bit. “You like about me? I just said I adore you. And you like me? What the hell, Dom? I’m not feeling the love from you lately.”</p><p>And here we go. I knew this was coming.</p><p>I set my whiskey tumbler down and level a stare at her.</p><p>“Amy, you knew going into this what I’m like.... What I’m after. I’m not after a relationship. At all. I like you. I respect you. I enjoy having you in my bed. But love? That’s not who I am, Amy.”</p><p>She leans back, her eyes narrowing now, but filled with amusement.</p><p>“That’s what you think now,” she tells me knowingly. “Just wait.”</p><p>“For what?” I raise an eyebrow. “Until hell freezes over? Because that’s how long you’ll wait if you’re wanting more from me than what we’ve got.”</p><p>She shakes her head. “Whatever.” She waves one hand, the diamond rings adorning her fingers sparkling in the dimmed light of my sitting room. “I’m going to be jetlagged. So I should take a sleeping pill and go to bed. But first, let’s go to bed.”</p><p>She stares at me, her gaze turning dark and sultry, as she stands up and slowly begins shrugging out of her clothing.</p><p>I lean back in my seat and enjoy the show.</p><p>Half of Amy’s body isn’t real... it’s been enhanced by plastic surgeons. But because of that, it’s perfect. Her tits are large and round, her nipples pointed to the sky. Her stomach is perfectly flat, her hips swelled to perfection. Due to liposuction, there isn’t one trace of fat on her.</p><p>She’s unnaturally perfect. I personally prefer real curves, imperfections and all.</p><p>But I don’t say that. Instead, I just enjoy the show.</p><p>Bending over in front of me, she slides her panties off and tosses them into my lap. I pick up the lace with one finger and hold it to my nose, inhaling it.</p><p>“You smell good,” I observe.</p><p>She smiles.</p><p>“You know I do,” she purrs, gliding to my side and dropping onto my lap. Reaching into her nearby purse, she pulls out a pair of padded handcuffs.</p><p>“Get on your bed, Dom,” she commands. “I want to be in charge tonight.”</p><p>It’s a good thing I’m in the mood for that. Lying back and zoning out... letting the intense feelings of pain and pleasure blend together until I can’t tell one from the other?</p><p>Yes, please.</p><p>“Fine,” I smirk, as I get to my feet and head for the bedroom. “But stay the hell away from my nipples. If you pull that nipple clamp out of your bag, so help me, I’m out of here.”</p><p>“This is your room,” she points out dryly.</p><p>“Whatever. Then you’ll be out of here. And I won’t give you time to put your clothes on, either.”</p><p>She giggles now, unconcerned.</p><p>“You’d like that, you freak. Watching me strut down the hallway naked, with everyone watching me? I know you’d love that.”</p><p>It’s true. I would. And I’d also like to watch.</p><p>“Don’t blindfold me,” I instruct her as she folds her body against mine and begins to unbutton my shirt with experienced fingers. “I want to watch your tits as I lick you.”</p><p>She sighs into my mouth, her tongue plundering my own. She tastes of vodka and caviar.</p><p>“Lick me from back to front and everywhere in between,” she tells me. “And then,” she pauses as she reaches one more time into her bag. She pulls out a pierced dildo, ten inches long and pierced through several times, Prince Albert style. “And then fuck me with this. After I unlock your handcuffs.”</p><p>“Consider it done,” I murmur huskily as she snaps the manacles around my wrists. “And you’re a fucking freak, too.”</p><p>“That’s what you like about me,” she whispers as she crawls over me and arches her hips against my lips.</p><p>That’s true. It is.</p><p>Amy grinds into my face and I absorb her taste, her smell. She bends backward and rakes her fingernails into my thighs, hard. I’m sure she drew blood, but I don’t care. I’m already at the point where the lines between pain and pleasure have blurred.</p><p>I know that tonight will be spent in just such a place, a place filled with varying shades of gray, where no guilt or worry lingers. Memories from my past will be gone, guilt from my past nonexistent.</p><p>Just for tonight. It can all resume again in the morning, but for tonight, I’m going to enjoy every kinky hour of oblivion.</p><p>There will be no blacks, no whites, and no rights, no wrongs.</p><p>I’ll do what feels good, without regard to what society might think. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Because I’m Dominic Fucking Kinkaide....and that’s what I do.</p><p>Chapter Five</p><p>“Why won’t you fuck me?” Amy asks me, out of the blue.</p><p>I look up in surprise.</p> <p>After Amy slipped out of my hotel room in the middle of the night, we met here on set for breakfast, and have been curled up in my trailer for the past hour. As we wait to be called into makeup, Amy’s got her head buried in a magazine, but she’s staring over the top of it now, her blue eyes accusatory.</p><p>“Excuse me?” I ask stiltedly, although I heard exactly what she said.</p><p>“Why won’t you fuck me?” Amy demands again. “Everyone on the planet wants to fuck me, and I offer myself to you on a platter and you won’t do it. Not really. You have no problems fucking me up the ass or letting me suck you off....but you won’t actually fuck me. I want to know why. I know you don’t have a problem getting it up. So what is the problem?”</p><p>Icy pangs shoot through my heart and I try to ignore them, to push them back down to where they belong. I knew this was coming.</p><p>I knew this was coming, I remind myself. A confrontation about what is wrong with me. I knew it.</p> <p>But knowing it never makes it any easier.</p><p>“I don’t have a problem,” I answer icily, staring her down, her blue eyes locking with my own green ones. “Just because I won’t fuck you, you think I have a problem?”</p><p>She shrugs with her slender shoulders. “You must. Everyone wants to fuck me.”</p><p>She’s tense now, poised stiffly on the edge of her seat, prepared for rejection as she waits for me to answer. I know her. I know what she thinks, how she feels. And like most artists, she’s secretly insecure. She’s afraid that there’s something wrong with her and that’s why I don’t want to fuck her.</p><p>I don’t allay that fear. I’m not a good enough person for that. She doesn’t hesitate to cut people down to size simply because she feels like being a bitch. I feel no guilt over not soothing her ego right now.</p><p>“Maybe everyone does,” I tell her as nonchalantly as I can. “But I don’t. Not right now.”</p> <p>She sits up straighter, her shoulders back and her chin stuck out. “Oh, really? And why exactly is that?”</p><p>I stare at her coolly. “Because I don’t feel like it. Too much drama. You’d only fall in love with me.”</p><p>I play it off like that, like I’m arrogant and cold and like I really believe my own words. Everything’s an act, you see. And this is part of my character. I’m an arrogant asshole.</p><p>Except, of course, I really am. At this point in my life, the act has become my reality.</p><p>But regardless of my words, I’m not afraid she’d fall in love with me. That’s not the reason that I haven’t fucked her... or that I haven’t actually fucked someone in six years. Six. Fucking Years.</p><p>Six years since it happened.</p><p>The mere thought of it, of her, constricts my heart tightly in my chest, like a fucking vise grip has its claws wrapped around it.</p><p>Emma.</p> <p>A vision of her wide blue eyes sparkling at me ripples through my memory and I squeeze my eyes shut to close her out. Reaching into my pocket, I grip the necklace, her necklace, allowing my fingers to trace over the cool aquamarine. It’s the only thing that helps, the only thing that calms me down. It reminds me.</p><p>And makes me forget.</p><p>“Dominic?” Amy snaps, bringing me back to the present, and away from Emma’s glistening eyes.</p><p>I open my own.</p><p>“What?”</p><p>“What’s wrong with you?” she asks curiously, her eyes softening just a bit as she stares at me. I realize that I’m clammy and cold. Anxious. On edge.</p><p>This is what Emma does to me even now.</p><p>I put her out of my mind and turn my attention to the needy woman in front of me.</p><p>I force a grin. “Nothing’s wrong. At all.”</p><p>Amy stares at me. “Then prove it. When we’re done here, let’s go on a date. Take me to the Tower of London, then take me back to your hotel room and make me scream your name tonight.”</p><p>“You scream my name on a regular basis,” I point out wryly. She rolls her eyes.</p><p>“You know what I mean. I want your penis inside my body while I’m screaming it this time. For real.”</p><p>I shake my head, then run one finger over the swell of her fully clothed hip.</p><p>“Can’t. Not tonight. I can take you to the Tower, but then I’m flying out to Amsterdam to see my brothers. I’ll have to take a raincheck.”</p><p>Amy’s interested now. “Sin and Duncan? I want to go. You know I love seeing the Devil’s Own. Maybe you can make me scream your name in Amsterdam, instead. In fact, let’s make a bet. I bet you that I can make you want to fuck me before we leave Amsterdam.”</p><p>That’s never going to happen.</p><p>But I don’t say that. Instead, I smile.</p><p>“And if you win?”</p><p>She smiles back. “Then you get to fuck me. That’s your prize.”</p><p>“And if I win?”</p><p>Amy scowls now, displeased by the mere thought that I might not want her. “If you win, your prize will be not having to hear me bitch about this anymore, because we’ll be done. You’ll go your way and I’ll go mine.”</p><p>“Interesting,” I reply calmly. “So basically, if I don’t fuck you by the time we leave Amsterdam tomorrow night, we’re done?”</p><p>She nods, pleased by what she thinks is her ultimatum. What she doesn’t understand is that I don’t give a flying fuck if I ever see her again...at least, in a personal capacity. She thinks she’s got all the power and control in this equation, but she’s wrong.</p><p>I’m going to see exactly what she’s willing to do to get me to fuck her... and then I’ll leave her without looking back.</p><p>I smile. “Okay. Challenge accepted.”</p><p>She smiles back and cups my crotch with her thin fingers.</p><p>“You’re going to like this.”</p><p>“I’m sure,” I answer. Because I know I will, but ultimately, Amy won’t. You don’t try to push me around—or manipulate me.</p><p>It will never end well for you.</p><p>“Dude,” my brother Sin shouts into the phone. “What the hell? You don’t call for weeks, then you call right before I step onstage?”</p><p>So that explains the loud screaming and noise in the background. Everyone is waiting for my rockstar brother to appear.</p><p>“Sorry, bro,” I answer, unconcerned. “Just calling to tell you that I’ll be there later tonight. I can’t make your show, but Tally figured out a way to fit a visit into my schedule at least.”</p><p>That perks up Sin’s attention and he hollers to our other brother Duncan. “Hey, little D. Dom’s coming to the party tonight. Order more hookers.”</p><p>He cackles into the phone and I have to laugh....at several things. One, because he called Duncan little. Like Sin and me, Duncan is tall. Really tall. 6’4 or so. Broad-shouldered, slim-hipped. Not little in the slightest. And two, that he’s ordering hookers in Amsterdam. The irony of it, because he’s surrounded by groupies all of the time who would do anything he asks... for free.</p><p>“Hookers?” I ask dubiously. Sin snorts into the phone.</p><p>“It’s Amsterdam,” he says, by way of explanation. “We can’t come into Amsterdam and not visit the red light district. That would be sacrilege.”</p><p>It’s my turn to snort.</p><p>“The red light district?” I chuckle. “And how exactly are you and baby brother Duncan going to slip into the red light district unseen by paparazzi?”</p><p>I can practically feel Sin shrug through the phone. Because he doesn’t give a flying fuck.</p><p>“I don’t care if they see me or not,” he answers flippantly. “I don’t live my life according to what they think is acceptable or not. And speaking of that, I’ve got to go. Are you going to be here for my party or not?”</p><p>“Yes.”</p><p>He hangs up without another word and I glance over at my manager. “It’s going to be a long night.”</p><p>Tally grins without even looking up from his smartphone. “Yep. You might want to drink a few cans of Red Bull, old man.”</p><p>I shake my head. “Do you have any?”</p><p>Tally glances up. “I had them stock the plane with it, enough for Amy too. She’ll need it if she’s going to keep up with you.” He pauses, then stares at me. “Be careful how you treat her. The public loves to see you starring together. You’ve got to think of your image, first and foremost.”</p><p>“I’m very close to being done with her,” I tell him calmly. “I’m not going to stay with her just to satisfy public perception.”</p><p>Tally continues his stare-down. “And I would never suggest that. I’m just telling you to let her down with respect. Don’t treat her like a whore. Break up like a normal person.”</p><p>I pause, considering that. “But what if she acts like a whore?”</p><p>Tally shakes his head. “It doesn’t matter. Be a gentleman. The public loves that about you.”</p><p>“Is Amy already headed out to the plane?” I ask, grabbing a gulp of Tally’s drink.</p><p>“The last I heard, yes,” Tally answers, getting to his feet and straightening his jacket. “Although, she got into an altercation in the lobby with some fans. Some little girl wanted her autograph and Amy went off on her for invading her personal space. For fuck’s sake, Amy needs some lessons in PR. She’s a nightmare. You ready?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I nod and we walk from the hotel to a waiting car.</p><p>The drive to the airport doesn’t take long and within a few more moments, I’m walking up the stairs and entering the plane. I’m immediately struck with the vision of Amy sitting with two young blondes on a leather sofa.</p><p>The two blondes are topless and Amy is in the middle, dressed only in a red leather corset.</p><p>My dick tightens in pants.</p> <p>Tally slams into me from behind, since I’ve stopped dead-still in the aisle and he swivels around me to see what the hold-up is. I hear him suck in his breath.</p><p>“You’re a fucking lucky son-of-a-bitch, Kinkaide,” he mutters. “I’ll just...stay up here.”</p><p>I don’t answer. Instead, I take a step, then another.</p><p>“What’s this?” I ask nonchalantly, staring down at Amy’s upturned face. She reaches out and trails her fingers down my thigh.</p><p>“Oh, this?” she asks innocently, glancing at her two friends. “These are my assistants and I’m going to loan them to you for the evening, as well. Anything you need, just ask. They’ll be happy to oblige. And me? I’m in a rare accommodating mood, too. Whatever you desire, no matter what it is... ask. And it’s yours.”</p> <p>And now I’m amused. Amy Ashby is stooping to this? For what? Just to fuck me? I have a growing suspicion that it’s less the driving need to fuck me and more about saving her wounded ego because I don’t seem to want to. Her ego is the biggest thing about her.</p><p>“Well,” I smile. “This could be an interesting evening.”</p><p>Amy smiles back and pats the seat next to her. The blonde to her left moves over, giving me space to sit. When I do, they each loop a leg over one of mine, effectively holding me down.</p><p>“Would you like a drink?” the other blonde whispers to me, her full lips mere centimeters from my ear.</p><p>“Yes,” I answer. “Whiskey. Neat.”</p><p>“Done,” she answers. She slips away and while she’s gone, her blonde friend massages my thigh, then slips her fingers around to my lower back, soothing my tired muscles.</p> <p>Within minutes, the other girl comes back with a glass of whiskey on a tray, and a black velvet blindfold.</p><p>“Amy wants you to wear this,” she says softly. “Let me help you with it.” Bending forward, her soft tits envelop my face as she slides the blindfold over my head. I inhale her feminine scent, soft and flowery.</p><p>“Now what?” I ask as I lean back, totally blind.</p><p>“Now, enjoy your flight,” the girl says brightly.</p><p>And I fully intend to.</p><p>But as they softly stroke my back, my thighs, my face, my chest... their soothing touches have the opposite effect on me than they intend. Because I’ve been up and on-set for ten hours today, I’m exhausted.</p><p>Instead of turning me on, their soothing touches put me to sleep.</p><p>When I wake, we’ve landed in Amsterdam and Amy is glaring at me from across the plane.</p> <p>“Seriously?” she demands. “I went out of my way to plan the perfect evening for you. I have everything you could possibly want on board this plane... and you went to sleep? What the hell, Dominic?”</p><p>I can’t help but grin at this, just a little. She’s pissed.</p><p>“I’m sorry,” I tell her as soothingly as I can. “I’m exhausted and jet-lagged. It’s not a reflection on you. Or of your sexy assistants.” I glance at them and find that they’re fully clothed now. “I’m sorry,” I tell them. “I didn’t meant offend you.”</p><p>They both smile warmly. “Not a problem,” one says. “We’ll can pick up where we left off later.”</p><p>I glance at Amy and raise an eyebrow. “Later?”</p><p>She nods in satisfaction.</p><p>“I told you... you’ll fuck me by the time this night is over. We’re all going to Sin’s party. And we all know... if something freaky doesn’t happen at one of his parties, then it’s not meant to happen.”</p><p>I have to give her that. My brother’s parties are beyond the normal....so far beyond the norm that they’re off the map.</p><p>I nod, not committing, but not declining, either.</p><p>As we deplane, I have a brief memory, a fleeting vision of one other time, years ago, when I’d been at a party and had gotten the worst phone call of my life. The night that had changed my life forever. The night that had crushed my heart into ash.</p><p>I reach into my pocket, twisting the pendant round and round in my fingers.</p><p>I can’t feel anything, not anymore. So what I have to do is go through the motions. And if that means trying to do crazy, kinky, sexual things just to be able to feel something, I’ll do it.</p><p>Because honestly, I haven’t decided what’s worse: not being able to feel something, or being so stuck in the pain of the past that I’m paralyzed with it. For six years, I’ve held out the hope that I’ll come around. That the pain will stop. That I’ll miraculously become normal.</p><p>But slowly, I’m coming to terms with the fact that it isn’t going to happen.</p><p>I’m not normal.</p><p>There’s no use pretending to be.</p><p>And if I’m going to hell for all the shit that I do, I might as well make the crime fits the punishment.</p><p>Until I burn in hell, I might as well make every single moment worth it.</p><p>Starting tonight.</p><p>Chapter Six</p><p>Sin’s penthouse suite is the entire top floor of a glitzy hotel in the center of the city. Sin never does anything understated. He prefers to be the center of attention at any given time and he always pulls it off with panache.</p><p>Amy, me and her two ‘assistants’ push through the throngs of people lounging, dancing and chattering throughout these rooms. Scantily clad people, half naked people. Drunk people. High people. All kinds of people.</p><p>“Where’s your brother?” Amy calls over her shoulder to me. I look around. I don’t see him anywhere.</p><p>“Let’s check his bedroom. He never lets anyone in there...except for certain women.”</p><p>And by certain, I mean whichever women he chose from the crowd at his show. His bouncers would’ve plucked the girls from the throngs, given them backstage passes and then accompanied them to Sin’s after party. It’s just what he does. And he never gets tired of it.</p><p>When we tap on his door and he answers in only his jeans, I can see two naked women in his bed over his shoulder. And I know I’m right.</p><p>“Dude,” he mutters. “Could you have worse timing?”</p><p>“Did I interrupt something?” I grin innocently. Sin scowls at me.</p><p>“Jesus. First you miss my show, then you cock block me. Nice, bro.”</p><p>I chuckle as Sin throws his door open wide, motioning us inside. “You might as well come inside,” he mutters. Then he glances behind me at Amy and her two friends, and his manner changes. He instantly becomes Sin Kinkaide, charming chick magnet.</p><p>“Hello, ladies,” he drawls. Amy smiles at him, unfazed by his celebrity status and blatant sexual energy. Her friends, however, are not. They blush and become instantly on edge. Sin grins.</p><p>“I’ve got a private party goin’ on in here,” he tells them, still grinning. Still shirtless. “It’s very exclusive. Only the most beautiful women in the city get to attend. Would you like to come in?”</p><p>They’re in awe now, flattered by the invitation, and without a backward glance, they step into his room. As he closes the door, I see the two girls in the bed scoot over to make room for the two new girls.</p><p>I turn to Amy, shaking my head.</p><p>“Well, you lost your accomplices.”</p><p>She rolls her eyes and grabs a glass of champagne from the tray of a passing waiter. Running her tongue along the rim, she stares at me over it.</p><p>“You don’t need them. All you need is me, Dom. By tonight, you’ll realize that.”</p><p>Before I can answer or refute that statement, she gazes past me, intent on something across the room.</p><p>“Hmmm. There’s Tara Linwood. I’ll be back in a minute. Think about me while I’m gone.”</p><p>As she brushes past me to chat with the up-and-coming actress across the room, she pushes something into my hand. Glancing down, I see that it’s her panties, a tiny piece of silk and lace meant to turn to me on.</p><p>It doesn’t. I prefer my women pantiless... or in red silk. I lay the panties on a nearby table, next to a bowl of mints. They should brighten someone else’s day. Oddly enough, knowing that Amy is pantiless now across the room doesn’t turn me on, either. Which means that it’s probably time to end things.</p><p>It’s just as well that she chose to give me this ultimatum.</p><p>I get bored very easily and apparently, even bitchy A-list actresses don’t hold my attention long.</p><p>As I walk toward the open balcony, a young waitress catches my eye from across the room, her eyes lighting up as she recognizes me. She quickly tries to hide her excitement, to act professional and nonchalant as she offers me a drink from her tray, but it’s too late. I already saw it.</p><p>And I’m filing it away for later.</p><p>I’ll probably be here for several hours. I might get bored later.</p><p>For now, I settle onto a cushioned seat in the corner of the darkened veranda, staring down at the bright lights of the city.</p><p>From this position, I can see everything I want to see. I can observe party guests and their drunken behavior, I can look down upon the city, and I can stay to myself and not interact with anyone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It’s a win-win situation.</p><p>This is how I stay, winning in my little dark corner, drinking glasses of whiskey, until Tally arrives. He knows just where to hunt for me, his gaze scanning the perimeter of the party as he steps inside the suite.</p><p>He knows he’ll always find me in the shadows.</p><p>“Where’s Amy?” he asks, dropping into the seat across from me and motioning for a waiter to bring him a drink.</p> <p>“Somewhere with Tara Linwood,” I answer. I glance around, but don’t see her.</p><p>Tally shakes his head. “You’re not going to be happy about this. But. The studio doesn’t want you to end things with her. It’s good for the film if people think you’re dating. They want to see an onscreen couple who is actually dating in real life. If you’re still thinking of breaking up with her, don’t.”</p><p>I stare at him, my hard gaze icy.</p><p>“I do what I want. I don’t let the studio dictate to me who I date and who I don’t. I’ve never been that way and I never will be.”</p><p>Tally sighs. “I knew you were going to say that. You and your brothers are the stubbornest sons-of-bitches I know.”</p> <p>The corner of my mouth tilts up, just a bit.</p><p>“Well good. I’m glad you know where I stand.”</p><p>“But you’ll still have to pretend that you’re together,” Tally tells me firmly, pressing another drink into my hand. “And if you can’t stomach that, then you’ll have to figure out a way to make her end things with you. Let her be the one to bring the studio’s wrath down on her head. Not you.”</p><p>I can’t help but chuckle a little. “I’m sure I could find a few ways to piss her off.”</p><p>Tally levels a gaze at me. “But not anything obvious. You can‘t be seen as a dickhead, either. Always, always always.... Keep your public persona forefront in your mind. You are mysterious. You are sexy. You are a gentleman. You are private. All of these things are fine. Maintain that image. Do not appear to be a dickhead. Got it?”</p><p>I nod. “I can do that. Besides, she already gave me an ultimatum. Sleep with her tonight, or we’re done.”</p> <p>Tally raises an incredulous eyebrow. “You haven’t slept with her yet? What the fuck? Are you made of stone?”</p><p>Before I answer, we both look up to see Amy and Tara stumbling from the bathroom together. Amy’s nose is red, a sure sign that they were snorting coke. I personally know it’s one of the ways she stays so slim. They’re both stumbling, a sure sign that they’re drunk, as well.</p><p>An idea forms, hard and fast.</p><p>A brilliant idea.</p><p>No one puts Dominic Kinkaide in a corner. No one gives me ultimatums and expects to win.</p><p>I am not controlled.</p><p>Not now, not ever.</p><p>But first things first.</p> <p>I watch Amy and Tara collapse into one big chair together, giggling and chattering as they furtively glance around the room. I know they’re probably cutting down everyone here. Both women are complete catty bitches.</p><p>They bore me.</p><p>So I motion to the young waitress, the girl who was starstruck earlier.</p><p>“Excuse me,” I say to her smoothly, putting my hand on her arm as she passes. She stares down at me, her green eyes wide.</p><p>“Yes?” she stutters.</p><p>“Where is the bathroom?” I ask politely, although I know perfectly well where it is.</p><p>She points in the direction. “Right there.”</p><p>“Could you possibly show me the way?” I ask, my voice as smooth as honey. “I don’t want to get lost.”</p><p>Her eyes widen as she realizes what my intentions probably are and then she smiles broadly. “Of course. I’d be happy to show you.”</p><p>She puts her tray down on the table in front of me, because she knows she won’t be needing it.</p><p>And then I lead her to the bathroom. Amy watches me in amusement from her chair, but she doesn’t get up or react. She knows me. She likes watching me with other women anyway.</p><p>In fact, a few minutes later as the waitress is kneeling in front of me, the doorknob jiggles and I hear Amy’s voice.</p><p>“Dom? I want to come in.”</p><p>Of course she does.</p><p>She wants to watch, because she’s as kinky as I am.</p><p>But instead of unlocking the door, I grasp the willing waitress’ hair, and guide her into deep-throating me, her lips forming a perfect wet vacuum around me.</p><p>“Not now, Amy. I’m a little preoccupied,” I call toward the closed door.</p><p>I can hear her bitching as she walks away.</p><p>It doesn’t matter. At the moment, all that matters is this blow job.</p><p>I’ll deal with Amy later.</p><p>But I will deal with her.</p><p>Chapter Seven</p><p>“You took long enough,” Amy whines when I finally come out of the bathroom and find her. She’s sitting with Tara on the veranda, in the darkened corner that I had recently vacated.</p><p>Tara looks up at me, her eyes glazed over in a drug-induced haze. I sigh, seeing only the talent that she’s getting ready to waste. I’ve seen it a hundred times. Actresses come into the industry, show so much promise and then self-implode on their way to the top. I can see right now Tara Linwood won’t last.</p><p>“I don’t rush,” I shrug my shoulders. “But I’m ready to go now.”</p><p>Amy lifts an eyebrow. “Oh, really? And where are you ready to go?”</p><p>I grin. “Someplace where the lights are red.”</p><p>Amy’s eyes widen as she realizes what I’m talking about. The infamous Red Light district in Amsterdam, where prostitution is legal and kink of any nature can be bought.</p><p>She grins. “You surprise me, Dom. I wouldn’t think that you’d risk getting seen someplace like that. You know the paparazzi are everywhere.”</p><p>I shake my head. “We’ll be careful. Are you in?”</p><p>She nods. “Of course. I’ll bring Tara.”</p><p>I glance at her friend, who is now leaning on Amy’s shoulder.</p><p>“Can she walk?” I ask dubiously. Amy scowls at Tara, before pushing her off her shoulder.</p><p>“We’ll find out.”</p><p>She yanks Tara to her feet and together, they stumble toward the door. I watch for just a second before shaking my head.</p><p>This is going to be too easy.</p><p>For one split moment, I almost feel guilty, but then I tamp that emotion down. Amy deserves no pity. I’ve seen her verbally lash stagehands into tears for such small offenses as not making sure her water was cold enough. Her heart is black and she deserves anything I give her....particularly since she thought she could control me.</p><p>Not gonna happen.</p><p>I follow them to a car and within minutes, we have arrived in the Red Light district of Amsterdam.</p><p>The streets are wet and dark as we walk down them, glancing into the windows that line the street. Women sit in rooms, waiting for customers, as the red lights flicker over their heads.</p><p>I meet the gaze of one woman, a pretty dark haired woman. Her eyes light up as she sees me and she grins, revealing yellowed teeth. I cringe.</p><p>Not gonna happen.</p><p>“Gross,” Amy scowls. “It looks like the city’s leftovers are here. Let’s go someplace else.”</p><p>She starts to turn around, but I catch a glimpse of another window down the street, one that houses two women. I put my hand on Amy’s arm.</p><p>“Wait.”</p><p>We walk a bit closer, then closer still, all the while, Amy is practically holding up Tara.</p><p>The two girls look like sisters, identical shoulder-length blonde hair, large green eyes, slip hips. They’re dressed in identical lingerie and are sitting in the same identical pose, perched atop two tall stools.</p><p>“Twins,” Amy breathes, turning to stare at me, her eyes widened. “Yes.”</p><p>I have to grin at the possibilities.</p><p>“Where are we?” Tara mumbles, her head rolling around on her neck like a broken bobble-head doll. I raise an eyebrow at Amy.</p><p>She scowls and slaps Tara’s face lightly, then harder. “Wake the fuck up, Tara,” she snaps. “You’ve got to grow up and learn how to handle your liquor better.”</p><p>I gaze at her. “I doubt that the liquor is her problem.”</p><p>Amy ignores my meaning and shakes Tara’s arm as we ring the bell next to the window. One of the girls comes forward and speaks through the speaker.</p><p>“Yes?”</p><p>“We want to hire you,” Amy says firmly. “Let us in.”</p><p>“Payment first,” the girl answers, just as firmly, holding Amy’s gaze. Amy frowns, but we do as requested, pushing our payment through a little window. After the transaction is complete, we’re buzzed in. I glance around the dingy hallway as we make our way to the door.</p><p>It opens immediately.</p><p>“Welcome,” the blond girl purrs now, motioning for us to come inside. Her sister is on the bed and the shades have been drawn.</p><p>“I’m Anika,” the standing girl says. “And that is Anna. We’re here to please you. What would you like?”</p><p>Amy shoves Tara onto the bed and then pulls at me, but I stand fast.</p><p>“I’m going to watch,” I tell Anika. “So I’d like the four of you to give me something interesting to see.”</p><p>Anika eyes Tara skeptically. “Well, three of us can do that,” she finally answers. But Tara is scowling again.</p><p>“What the fuck, Dom?” she demands. “You’re not going to watch. You’re here to participate.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She stands with her hands on her hips, her eyes shooting sparks. But I’m calm.</p><p>“Amy, do you really want our first time to be here.... In a dingy room with three other people?”</p><p>She pauses, relaxing a tiny bit.</p><p>“Make me horny,” I suggest. “Then we’ll go back to my hotel room and take it from there.”</p> <p>She hesitates, but only for a split second.</p><p>“Fine.” She lifts her chin. “What would you like to see? What would make you horny, Dominic?”</p><p>I settle onto a tall stool, my feet crossed in front of me.</p><p>“Lick her,” I gesture toward Anika. “Then her,” and I point at Anna. “Then they both can lick you. Do you have your pierced toy in your purse?”</p><p>Amy shakes her head, but Anika chimes in. “We have a whole cabinet of toys.”</p> <p>“Perfect,” I smile. “I’ll give you a toy when the time is right.”</p><p>They nod and words fade away as they pile into the bed. Clothing comes off and sex noises fill the room. Wet noises, moaning, sucking. Whimpers. Sighs.</p><p>I can see that Amy is enjoying herself, just as I can see that Tara has passed out against the wall. It doesn’t matter. I’m not here for Tara.</p><p>After everyone has been sufficiently licked, I find a toy in the cabinet, a two-headed dildo. A head for the front and one for the back.</p><p>I hand it to Anika. “Use this on her. She likes it up the ass.”</p><p>Amy’s eyes are unfocused as the three women continue. Hands are everywhere, on soft female thighs and plump female lips. It’s enough to lift my dick, but I don’t concentrate on that.</p> <p>Instead, I can’t help but ponder how I got to this point. A twinge of pain pulls at my belly as I think of a pair of blue eyes, innocent eyes. Eyes that loved me. Eyes that decimated me.</p><p>She would horrified if she knew I was here, if she knew how far I’ve fallen into the darkness. I swallow hard and reach into my pocket, fingering her necklace and steeling my heart.</p><p>She’s not here.</p><p>She’ll never be here.</p><p>Bile rises from my stomach as I remember her...as I remember what happened. What I caused. I swallow the ugly taste and swallow again, hard. Forcing the memories from my mind, I turn my attention back to the present and the women debauching themselves in front of me.</p><p>No one controls Dominic Kinkaide. Not anymore. I don’t have a heart left to control.</p><p>Since the women are all distracted with each other, I pull out my phone and snap pictures. And when I’m done with that, I turn on the video camera.</p><p>It only takes a couple of minutes to get what I need.</p> <p>And for Amy to get what she needs. She moans and writhes on the bed as Anika brings her to orgasm, her hands twisting in the sheets beside her. Her face is sweaty, her eye make-up smeared.</p><p>As she comes, she calls out and holds my gaze. She lies still for a moment, and then the twins get up matter-of-factly, straightening their hair and putting their lingerie back on, preparing for the next customers.</p><p>Amy is limp as we walk to the car and I almost have to carry Tara.</p><p>The ride to the hotel is quiet as Amy leans into me, spent from her kinky sex with the prostitutes.</p><p>She puts a hand on my thigh as our driver pulls up to the curb in front of the hotel.</p><p>“Come to my room,” she says throatily, her hands smelling like sex.</p><p>I lift an eyebrow. “For what? You already came tonight. I’m sure you’re exhausted.”</p><p>Her eyes narrow and she grips my leg tighter. “Dominic, I already told you what would happen if you don’t fuck me tonight. You don’t want to risk that, trust me. Because I meant what I said.”</p><p>I stare at her, my eyes hard as I lift her fingers from my thigh and squeeze them firmly in my hand. Not hard enough to hurt, but hard enough to get my point across.</p><p>“Amy, you’re a bitch. And I don’t give a flying fuck if you walk away from me tonight.”</p><p>She snarls, her face twisting into something ugly. “Don’t you know by now? I always get what I want. And trust me, if you walk away from me, I swear to Christ that I’ll make up a fantastic story about being jilted by you for the studio heads. They’ll be so pissed at you that they might fire you. Do you want that?”</p><p>I smile now, amused as I pull out my phone. Quickly, I find the video of her with the prostitutes on my phone. She gasps as she watches Anika fucking her with the dildo.</p><p>“I doubt they would be pissed at me when they hear that I broke up with you because this video leaked online. Obviously, they would understand that I just can’t be linked to something so scandalous. And they wouldn’t want to be linked to you, either. You’d be the one fired, Amy. Not me. So tread lightly.”</p><p>I pause with my fingers poised over the button that would link the video to YouTube.</p><p>“I’m going to get out of this car and you’re never going to try and put me into a corner again. I don’t like ultimatums. You’re going to go your way, I’m going to go mine. We’ll work together. I won’t say anything bad about you, and you won’t say anything bad about me. And this video will stay on my phone. But the first time I get a hint that you’re spreading shit about me to the studio heads, this video will be anonymously submitted to every possible gossip site online within minutes. Got it?”</p><p>Amy stares at me with poison in her eyes. “You’re a fucking dickhead, Dominic. And you’ve fucked with the wrong woman. Someday, I’ll fuck you back...so hard that your asshole will bleed.”</p><p>I roll my eyes at that visual as I open the car door and get out.</p><p>“Well, until then,” I say calmly, and I close my door.</p><p>I feel her astonished gaze burning into my shoulder blades as I walk away and leave her in the car with Tara passed out on the seat beside her.</p><p>I don’t feel vindicated. I don’t feel good. I just feel empty, like always. But at least I’ve got Amy off my back and I won’t have to deal with her anymore.</p><p>I make my way to my hotel room and as I do, I find police officers swarming the lobby and in the elevators. I turn to one.</p><p>“What happened?”</p><p>He looks at me, shaking his head wearily and speaking with a heavy accent.</p><p>“An American rock band is having a wild party with under-age girls,” he growls. “Fecking celebrities. They think they don’t follow the same rules.”</p><p>I stare at him, not responding, because I know that we don’t. We don’t follow the same rules. I get off on my floor and as soon as I do, I pick up the phone to call Tally. He answers on the first ring.</p><p>“You’ve got a mess to clean up,” I tell him. “And it’s not mine.”</p><p>Chapter Eight</p><p>Shooting for the promos with Amy is uncomfortable, to say the least. She shoots daggers at me from across the room with her eyes and when we have to kiss for a picture, she bites my lip.</p><p>But I don’t react. I won’t give her the satisfaction.</p><p>Instead, when she is sitting in a lounger by the wall, I engage in phone sex with an old friend, Kira, from back home. Amy glares at me for a moment, then stalks away to her trailer. I grin into the phone.</p><p>“Yes, I’ll be home soon, Kira. No, I can’t fly you here. I won’t be here long enough. I’m coming to Chicago soon. Maybe I’ll even be home next weekend.”</p><p>Kira laughs her familiar laugh. I’ve known her for so long, she’s known me since we were kids. In fact, she was Emma’s best friend. She knows what Emma did to me. And she’s been here to comfort me for years.</p><p>“I heard Sin almost got hauled off to jail last night,” she mentions. “Fiona called me this morning complaining about it.”</p><p>I grin, trying to picture how worked up my little sister Fiona probably was. Since she’d taken the job as Sin’s manager, he’s definitely put her through her paces.</p><p>“Yeah. He’s got to get better about guessing girls’ ages. Or he has to start taking an interest. So far, he doesn’t give a flying fuck.”</p><p>Kira laughs. “Well, I’m glad he didn’t get into trouble. It’s a good thing the laws there are so much more relaxed about that stuff.”</p><p>“Yeah,” I agree. “It’s the only thing that kept him out of jail. Has it hit the news there yet?”</p><p>“It’s on some gossip sites,” Kira answers. “But I wouldn’t worry about it too much. It’ll blow over.”</p><p>“I agree,” I tell her. “Sin’s having a party next weekend at his house. Are you coming?”</p><p>“I am if you are,” she purrs. “I’ve missed you.”</p><p>I grin. “I’ll be there.”</p><p>We hang up and I head outside, through the halls that lead to the doors. The sunlight pours in through the glass, and I can see the crowds of women flocking outdoors, just waiting to get a glimpse of Amy or me.</p><p>The second I emerge, the women begin screaming and pressing toward me. Security moves me fluidly through the crush of women and within a minute, I’m deposited into a waiting car.</p><p>As the darkness envelopes me, I close my eyes. As we drive away, I can still hear the women calling out my name. Asking for pictures, asking for autographs, asking for kisses and hugs.</p><p>They don’t know me.</p><p>They don’t know what I’ve done, or what I’m capable of.</p><p>They don’t know any of it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I close my eyes.</p><p>“You’ve got to be home on Monday,” Tally tells me firmly. “Shooting begins. I don’t give a rat’s ass what happened with Amy. You’ll be on set and you’ll be cordial to her. So have fun with your brother, clear your head and get ready to work.”</p><p>I sigh into the phone. “You worry too much,” I tell him. “I’ll be fine. Amy won’t be a problem. Shooting will go off without a hitch.”</p><p>“It better,” he growls, then hangs up. I roll my eyes and toss my phone down. Tally tries to sound like an ass, but his bark is worse than his bite. At least, it is with my brothers and me.</p> <p>I finish packing and then head to Providence to have lunch before I board my plane for home. I make my way inconspicuously through the restaurant and find my favorite table.</p><p>I by-pass the hostess, but she sees me as she shows someone else their table.</p><p>She pauses at mine.</p><p>“Have you spoken with Tally about me yet?” she asks, her hand on my shoulder.</p><p>I shake my head. “Not yet. I’m sorry. I haven’t had a chance. But I will soon. And I’ll give him your number.”</p> <p>And maybe I will. Tally can do what he wants with it. Melanie nods in satisfaction.</p><p>“Thank you. And if you need anything else from me, let me know.” Her tone is suggestive. I smile.</p><p>“Thanks. I will. Is Alex here today?”</p><p>Melanie nods as she starts to walk away. “Yeah. She’ll be with you shortly.”</p><p>As I wait, I decide to hit the men’s room. As I pass down the long hall that leads to it, an office door is slightly ajar. I glance inside as I pass and am startled to see Alex sitting on the desk, her legs wrapped tightly around the manager’s waist.</p><p>I freeze in place, staring.</p> <p>Alex has her arms wrapped around his neck, her wedding band glinting in the light. Her tongue is buried in manager’s throat. My heart feels heavy as I remember what she’d said to me before.</p><p>Sorry, dude. You’re hot and all, but I’m one of the few out there who believes that marriage is sacred.</p><p>Not that sacred, apparently.</p><p>She must feel someone staring, because she opens her eyes and sees me. She yanks away from the manager, her eyes wide. I don’t wait. I go to the restroom, wash my hands and then head back to my table.</p><p>Alex is there within seconds.</p><p>“Dominic, it wasn’t what you think.”</p><p>“Really?” I raise an eyebrow. “I’m pretty sure it was exactly what it looked like.”</p><p>She starts to protest, to offer lame explanations about how she needs the money and the manager was going to cut her hours, but I hold up a hand.</p> <p>“It’s not my business,” I tell her coldly. “And actually, I’ve lost my appetite today.”</p><p>Without another word, I get up and leave, ignoring her protests from behind me.</p><p>As I drive away, I have to examine why I’m so annoyed. Because honestly, I’m pissed. And it shouldn’t be my business.</p><p>What it boils down to, though, is that I thought Alex was a decent person. One of the only decent people I’ve met in LA. And the fact that she’s like everyone else is depressing.</p><p>Everyone wants to use everybody else. They want something, they need something. They are willing to do anything to get what they want. They’ll break marriage vows, cross lines of decency, stretch bounds of propriety.</p><p>Where does it end? And is there anyone out in the world who is a decent person? A person who is good on the inside?</p><p>I’m beginning to think that there’s not. In fact, I’m convinced of it.</p><p>I sigh as I drive to the airport and board my plane.</p><p>Soon, I’ll be home, just for the weekend. I can relax, soak in the wild atmosphere of Sin’s party and disappear into the shadows.</p><p>I can forget that people are greedy, black-hearted users.</p><p>I can forget it all.</p><p>As the plane takes off, I close my eyes. The weariness of the world has gotten to me. The ugly side of life, the guilt that I carry.</p><p>Sometimes, it’s all just too much to bear so I cope in the only way I know how.</p><p>It’s the only thing I can do.</p><p>“Mr. Kinkaide, is there anything else I can do for you?” I open my eyes at the polite voice and find a voluptuous blonde flight attendant bent in front of me, her chest straining at the buttons of her uniform.</p><p>I meet her gaze and smile my most charming grin, the one I’m known for.</p><p>“Well, there is one thing.”</p><p>I trail my fingers along the inside of her thigh and she smiles.</p><p>The End </p> </body></html>"]