["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Alec Kilcurt, laird of Kilcurt Holding and the most powerful werewolf inEurope , stomped through the snow and slush and wished he were anywhere, anywhere but here.</p><p>He stopped and stood obediently with the rest of the herd, waiting for the light to change. Snow was spitting down on him with malice he could almost feel. It did nothing for his mood. He disliked leaving his home for any reason, but being called toAmerica to pay homage to The Wonderful Child was a bit much.</p><p>And now he was shamed; his duty had never seemed a chore before. He admired and respected the pack leaders, Michael and Jeannie Wyndham. Michael was a good man and a fine leader; his wife was a crack shot cutie and baby Lara was adorable. Since the cooing, drooling infant was likely to be his next pack leader, Alec’s presence—the presence of every country’s werewolf head—had been required for both political and practical reasons. The pack was some 300,000 werewolves strong; unity was both a desire and a necessity.</p> <p>Unfortunately, visiting the Wyndhams in their happy home just exacerbated his own loneliness. He’d been searching for a mate for years, but had...how did the humans put it? Never found the right girl. He thought it was funny that human women complained their men didn’t commit. An unattached werewolf male was likely to want to move in after the first date. What was a man, after all, without a mate, without cubs?</p><p>Nothing, that’s what. Meeting baby Lara was a great relief; pack leaders without heirs made everyone nervous. Seeing Michael’s happiness, on the other hand, was a torture.</p><p>Now his duty was done, and thank God. His plane leftBoston tonight, and nothing was keeping him from it.</p><p>Faugh! More snow! And not likely to be much better, even when he got home. Really, there was nothing to look forward to until spring. Others of his kind might enjoy romping through the slush on all fours, but here was one furry laird who hated getting his feet wet.</p><p>AndBoston ! Grey, drizzly, drearyBoston , which smelled like damp wool and exhaust. He felt like pulling his scarf over his nose to muffle the smells of</p> <p>(peaches, ripe peaches)</p><p>unwashed masses and</p><p>(peaches)</p><p>He stopped suddenly, and felt a one-two punch as the couple walking behind him slammed into his back. He barely felt it. Hardly heard their complaints. He spun, pushed past them. Walked back, nostrils flaring, trying to catch that elusive</p><p>jangleJANGLEjangleJANGLEjangle</p><p>intoxicating</p> <p>jangleJANGLEjangleJANGLEjangle</p><p>utterly wonderful scent.</p><p>He stiffened, not unlike a dog on point. There. The street corner. Red suit trimmed with white. White gloved hand shaking that annoying bell. Belly shaking like a bowlful of jelly. The glorious smell was coming from Santa Claus.</p><p>jangleJANGLEjangleJANGLEjangle</p><p>He charged across the street without looking, ignoring the blaring horns, the shriek of airbrakes. The closer he got, the better Santa smelled.</p><p>JangleJANGLEjan—</p><p>“Jeez, there’s no rush,” Santa said in a startled contralto, pulling down her beard to squint up at him. Her eyes were the color of Godiva milk chocolate. Her cheeks were blooded, kissed by the wind. Her nose was snub. Adorable. He felt like kissing it. “I mean, the bucket and I aren’t going anywhere.”</p><p>“Nuh,” he said, or something like it.</p> <p>“You really should forget that whole ‘pedestrians have the right of way’ attitude when you’re in this town...errr...everything okay?”</p><p>He had been looming over her, drinking her in. Now he jerked back. “Fine, everything’s fine. Have dinner with me.”</p><p>“It’s ten o’clock in the morning.” She blinked up at him. A stray snowflake spiraled down, landed on her nose. Melted.</p><p>“Then lunch.”</p><p>The woman looked down at herself, as if making sure that, yes, she was dressed in the least flattering outfit a woman could wear. “Are you feeling okay?” she asked at last.</p><p>“Never better.” It was the truth. This was rapidly turning into the best day ever. He had visions of spending the rest of the day rolling around on Egyptian cotton sheets with Santa. “Lunch.”</p><p>She peered at him with adorable suspicion. “Is that a question? Is this your first day out of the institution?”</p><p>Right, right, she was human. Be polite. “Lunch. Please. Now.”</p><p>She burst out laughing, putting a hand on her large belly to keep from falling into the street. As if he’d let that happen. “I’m sorry,” she gasped, “but the absurdity of this...you...and...it just hit me all at once.” She cut her gaze away from his to smile at the woman who had just tucked a dollar into her bucket. “Merry Christmas, ma’am, and thank you.”</p><p>Now that he was no longer gazing into her eyes, he felt much colder and realized his feet were wet. Faugh!</p><p>“I can’t have lunch now,” she said kindly, looking back at him. “I can’t leave my spot until noon.”</p><p>“Not even if you made lots of money before then?”</p><p>“Not even if thereal Santa came along to relieve me.”</p><p>“Noon, then.”</p><p>“Well. All right.” She smiled up at him with timid liking. “You’ll be sorry. Wait until you see me out of this Santa outfit.” The spasm of lust nearly toppled him into the gutter. “I’m not at all cute,” she finished with charming idiocy.</p><p>“Noon,” he said again, then pulled his roll from his coat pocket. He plucked the money clip off the wad, and dropped the eight thousand dollars or so into her bucket. “I’ll be back.”</p><p>“If that was Monopoly money,” she hollered after him, “lunch isoff !”</p><p>Chapter Two</p><p>Giselle Smith watched the visitor from the planet Hunk stride away. When he’d rushed up to her, she had nearly dropped her bell. There she was, jangling for charity, and then Hunk Man wasright there . She couldn’t believe the speed at which he’d moved.</p><p>His hair was a deep, true auburn. His eyes were a funny kind of brown, so light they were nearly gold. His nose was a blade and his mouth—oooh, his mouth! A girl could stare at it and think...oh, all sorts of things. He was tall, too; she had to crane her neck to look at him. Over six feet, for sure. Shoulders like a swimmer. Knee-length black wool coat, probably worth a grand at least. Black gloves covering big hands; the guy looked like he could palm a basketball, no problem.</p><p>He had come charging across the street to, of all things, ask her to lunch. And to give her thousands—thousands!—of dollars.</p><p>Her, Giselle Smith. Boring brown hair, dirt-colored eyes. Too short, and definitely too heavy. The most interesting thing about her was her name. Which people always got wrong anyway.</p><p>Obviously a serial killer, she thought sadly. Well, we’ll have lunch in a public place where I can scream my head off if he starts sharpening his knives.</p><p>It was too bad. He was really something. What the hell could a guy like that want from a nobody like her?</p><p>Alec watched the woman (he was still angry at himself for not getting her name...or giving his, for that matter) from halfway down the block. His spot was excellent: he could see her perfectly and, better, he was downwind.</p><p>He thought about their conversation and cursed himself again. He’d babbled like a moron, ordered her to lunch, stared at her like she was Little Red Riding Hood. Yes, like Little Red...hmmmmm.</p><p>He wrenched his mind from that delectable mental image</p><p>(the better to eat you with, my dear. eat you all...up!)</p><p>and concentrated on thinking about what an idiot he had been. It was a miracle the woman had said yes. It was a miracle she hadn’t hit him over the head with her bell. He had to be very careful at lunch; it was imperative she not spook. He thanked God he was weeks away from his Change; if he’d caught her scent any closer to the full moon, he’d have scared the pants off her. Literally.</p><p>God, she was soadorable , look at her, shaking her little bell for all she was worth. Many people stopped (pulled in, no doubt, by her allure) and threw money in her bucket. As they should! They should give her gold bullion, they should lay roses at her feet, they—</p><p>He pushed away from the wall, appalled; someone hadn’t put money in! An expensively dressed man in his late thirties had used the bucket to make change, and went on his merry way.</p><p>Alec got moving. In no time he had closed the distance and flanked the man, had snaked out a hand and pulled him into a handy alley.</p><p>“Wha-aaaggh!”</p><p>“This is cashmere,” Alec said, his hand fisting in the man’s coat.</p><p>“Let go of me,” the man squeaked, reeking of stale piss—the smell of fear. “Or I’ll yell rape!”</p><p>“Your shoes,” Alec continued, undaunted, “are from Gerbard inLondon , and didna cost you less than eight hundred pounds.” Only Samuel Gerbard used that kind of supple leather when making his footwear; the smell was distinctive. “And that’s a Coach briefcase.”</p><p>“Gggglllkkkk!”</p><p>Perhaps he was holding the man a little too firmly. Alec released his grip. “The point is, you c’n stand to share a little this holiday season.”</p><p>“Wha?”</p><p>“Go back,” he growled, “and put money. In. The bucket.”</p><p>He let go. The man fled. In the right direction—toward his Santa sweetie.</p><p>A minute later, Alec was back at his post. He checked his watch for the thirtieth time in the last half hour. Ninety minutes to go. An eternity.</p><p>An eternity later, at 11:57, he realized the skulking teenagers were ready to make their move. The three of them had been casing the block for the last fifteen minutes, had been watching his lunch date much too closely. It was the bucket, of course; they wanted lunch money...or the eight grand he’d dropped in. It would be laughable, except one of them smelled like gun oil, which meant he had to take some care.</p><p>Their path took them right past him; he reached out and slammed the one with the gun into the side of the building. The boy—a child in his late teens—flopped bonelessly to the sidewalk.</p><p>His friends were a little slow to catch on; they finally turned when they nearly tripped over their unconscious leader. And saw Alec, standing over the unconscious punk, smiling. Well, showing them all his teeth, anyway. “Take somebody else’s bucket,” he said. Oh, wait, that was the wrong message entirely. “Don’t take anybody’s bucket,” he called after them, but it was too late, they were running away. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He looked at his watch again. It was noon!</p><p>Chapter Three</p><p>“It’s Giselle,” she said to Hunka Hunka Burnin’ Love. “Giselle Smith. And you’re...?”</p> <p>“Alec Kilcurt. You have a lovely name.”</p><p>“Yeah, thanks. About that. The never-ending compliments. What is your deal? Now that I’m out of costume, you can see I’m nothing special.”</p><p>He laughed at her.</p><p>She frowned, but continued. “Too short, too heavy—”</p><p>He laughed harder.</p> <p>“—but you keep complimenting me and I’m waiting for the other shoe to drop. You’re a census taker, right? A salesman? You want to sell me a fridge. A timeshare. A kidney. Stop laughing!”</p><p>He finally sobered up, although the occasional snort escaped. He snapped his fingers, and the glorious redhead at the next table, who’d been studying him while pretending to powder her nose, gave him her full attention. Her eyelashes fluttered. She licked her red, glistening lips.</p><p>Alec held out his hand, and after a puzzled moment the redhead placed her compact in his palm.</p><p>“Obliged,” he said carelessly. Then he snapped it open, showed it to Giselle. “This is what my people call a mirror,” he said in his ultra-cool Scottish brogue. “Y’should spend more time looking in one.”</p><p>“I know what a mirror is, you goob,” she snapped. “Too damn well. Stop shaking that thing at me or you won’t get anything nice for Christmas.” She nudged the bag at her foot; it held her costume. “I’ve got friends in high places.”</p><p>“Are you getting angry with me?” he asked, delighted. He handed the compact back to the redhead with barely a glance.</p> <p>“Yes, a little. You don’t have to look so happy about it.”</p><p>“Sorry. It’s just...I’m a lot bigger than you are.”</p><p>“And almost as smart,” she said brightly.</p><p>“Most women find me a little intimidating.” He smiled at her. Giselle felt her stomach tighten, then roll over lazily. God, what a grin. “In my...family...we treasure women who speak their minds.”</p><p>“Then you’ve won the lottery today, pal. And you never answered my question. What are you up to?”</p><p>He reached out, and his big hand closed over her small, cold one. His thumb burrowed into her palm, stroked it. Her stomach did another slow roll, one she felt distinctly lower. “Why, I’m seducing you, of course,” he murmured.</p><p>Multiple internal alarms went off. “Whoare you?” she said, almost gasped.</p><p>“No one special. Just a lord looking for his lady.”</p> <p>“Oh, you’ve got a title, too? Well, of course you do. That’s the way this day is going.”</p><p>“It’s Laird Kilcurt.”</p><p>“But your name is Kilcurt. Isn’t your title supposed to be completely different? Like Alec Kilcurt, laird of Toll House? Or something?”</p><p>He laughed. “Something. But my family does things a little differently. Too bad...I like the idea of being laird of chocolate chips.”</p><p>The waiter came, refreshed their drinks, and put down the two dozen oysters she’d ordered. She pulled her hand away, not without major reluctance. Since she figured this was her first and last date with the man, she’d ordered recklessly. He’d probably flip out when the bill came. Probably spent all his money on clothes and, given his trim waistline, only ate porridge once a day.</p><p>Wrong again. He nodded approvingly at the ridiculous size of her appetizer. He was leaning back in his chair, studying her. He had, if it was possible, gotten even better looking since morning. The expensive coat was off, revealing a splendid build showcased to perfection in a dark gray suit. His brogue, she noticed, came and went, depending on the topic of conversation.</p><p>“You haven’t lived inScotland your entire life,” she observed, sucking down her second daiquiri. Normally not a big drinker, she felt the need for booze today.</p><p>“No. My family often had business on Cape Cod, so I spent a lot of time inMassachusetts . And I went to Harvard for graduate school. I’ve probably lived inAmerica as many years as I’ve lived inScotland .”</p><p>Titled, gorgeous, rich, smart. Was she on Candid Camera, or what? “That makes sense...I noticed your accent comes and goes. I mean, sometimes it’s really faint, and sometimes it’s pretty heavy.”</p><p>“It’s heavy,” he replied, “when I’m tired. Or angry. Or...excited.”</p><p>“Okay, that’sit ,” she said, slamming her glass down. “Whoare you? What do you want with me? I made $18,000 last year. I’m poor, plain, cursed with child-bearing hips—and ass—and I’m prospect-less. What the hell are you doing with me?”</p><p>His eyes went narrow. “I’ll have to find the people who convinced you of such things. And have a long chat with them.”</p><p>“Answer the question, Groundskeeper Willie, or I’m out of here.”</p><p>He looked puzzled at her pop culture reference, but shrugged and answered easily enough. “I’m planning to spend the day getting you into my bed. And I’m thinking about marrying you.That’s what I’m doing with you, my charming little chocolate treat.”</p><p>She felt her mouth pop open. Felt her face get red. If this was a joke, it was a pretty mean one. If he was serious, he was out of his fucking mind. She seized on the one thing she could safely question. “Chocolate treat?”</p><p>“Your eyes are the color of really good chocolate...Godiva milk, I think. And your hair looks like fudge sauce. Rich and dark. It contrasts nicely with your pale, pale skin. Your rosy cheeks are the...cherry on top.”</p><p>She downed the rest of her drink in two monster gulps.</p><p>Chapter Four</p><p>“I’m sorry,” she groaned. Sweaty strands of hair were clinging limply to her face and temples.</p><p>“It’s all right, lass.”</p><p>“I’m so sorry.”</p><p>“Don’t fret. I’ve been puked on before.”</p><p>She groaned again, this time in complete humiliation. She hadn’t thrown up near him. Hadn’t thrown up around him. Had actually barfedon him. Onhim !</p><p>“You promised to kill me,” she reminded him hoarsely. The elevator doors slid open and he scooped her easily into his arms, and carried her down the hallway. “Don’t forget.”</p><p>His chest rumbled as he choked down a laugh. “Now, I didna promise to kill you, sweetheart. Just to take you up to my room so you c’n get your strength back.”</p><p>“I’ll be all right once I get off my feet,” she lied. Death was coming for her! She could feel its icy grip on the back of her neck. Or was that the ice from her third—fourth?—daiquiri? “Just need to get off my feet,” she said again.</p><p>“Sweetie, you’re off them.”</p><p>“Oh, shut up, what do you know?” she said crossly, getting more and more dizzy as the ceiling tiles raced by. “And slow down. And kill me!”</p><p>“Usually ladies wait until the second date before begging me for death,” he said, straight-faced. He paused outside a door, shifted his weight, and somehow managed to produce the card key, unlock the door, and sweep her inside without putting her down.</p><p>Two hotel maids and a woman in a red business suit were waiting for them. Giselle had a vague memory of the woman in red examining her while the sound of running water went on and on in the next room. She kept fuzzing...that was the only way to describe it. One moment things would be crystal-clear—too sharp, too loud—and the next she could barely hear them for their mumbling. It was annoying, and she told them so. Repeatedly.</p><p>“—lukewarm bath make all the difference—”</p><p>“—just got so sick, it’s verra worrisome—”</p><p>“—mild food poisoning—”</p><p>“—she’ll be okay in no—”</p><p>“—close to your Change for it to be a problem?”</p><p>“—canceled my flight earlier, so she can—”</p><p>“—push fluids—”</p><p>She reached up blindly. What’s-his-name</p><p>(Alec? Alex?)</p><p>caught her hand, held it tightly. “What is it, sweetie? D’you want something to drink?”</p><p>“No, I want you to STOP YELLING! How can I quietly expire if you keep screaming?”</p><p>“We’ll try t’keep it down.”</p><p>“An’ don’t humor me, either,” she mumbled. “Oh, now, what’s this happy crappy?” Because now she was being undressed and helped off the bed. “Look, stop this! Isn’t there an ice bucket or a hammer or something in here? All you have to do is hit me in the headreallyhard and my problems will be over.”</p><p>“You’ll feel better in twenty-four hours!” the woman in red screamed.</p><p>“Jesus, do I have to get out the hand puppets so you people understand? Not so loud! And I’ll be dead,dead in twenty-four hours, thank you very much, and—where are we going?”</p><p>The bathroom. Specifically, the bathtub. She started to protest that a change of temperature in her state would kill her, but the lukewarm water felt so blissful she stopped in mid-squawk.</p><p>And that was all. For a very long time.</p><p>Giselle woke up and knew two things at once: 1) she would burst if she didn’t get to a bathroom within seconds, and 2) she was ravenous.</p><p>She stumbled through the darkness into the bathroom, availed herself of the facilities for what felt like half a day, and brushed her teeth with the new tooth brush she found on the counter.</p><p>While she swished and gargled and spat, the day’s humiliating events came back to her. Working the bell, meeting Alec, being wined and dined—and God, he’d beenflirting with her!—then throwing up on him (groan) and the table tipping away from her.</p><p>Everything after that was, as they say, a blur. Mercifully so. She wondered where Alec was. She wondered whereshe was.</p><p>She stepped back into the hotel room—Alec’s hotel room—and stole to the window. She saw an astonishing view of the New England Aquarium and, beyond that,Boston harbor. It was very late; after midnight, but well before dawn; the sky was utterly black but there was little traffic moving. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>So she was on the wharf, then. Probably the Longwharf Marriott. She’d often wondered, walking by, what it would be like to stay there with someone glorious.</p><p>Well, now she knew.</p><p>She turned to look for the light and saw Alec for the first time. He was sitting in the chair by the door, watching her. His eyes gleamed at her from the near dark.</p> <p>She screamed and would have fallen out the window if it had been open. As it was, she rapped her head a good one on the glass.</p><p>“Yes, a typical date in nearly every respect,” he said by way of greeting.</p><p>“And a good evening to you, too, dammit!”</p><p>“Morning, actually.”</p><p>“You scared thecrap out of me.” When she’d first seen him—it was a trick of the light, obviously—but his eyes had—well, had seemed to gleam in the dark, the way a cat’s did at night. Very off-putting, to say the least. “Your eyes, Jesus!”</p> <p>“The better to see you with, my dear. And it’s Alec.”</p><p>“Very funny.” She leaned against the radiator, panting from the adrenaline rush. “Never do that again.”</p><p>“Sorry.” He swallowed a chuckle. “I was watching you sleep. When you got up and made such a determined beeline to the bathroom, I was afraid to do anything that might slow you down. Were you sick again, sweetie?”</p><p>“Uh, no. And about this afternoon—”</p><p>“When you—er—gifted me with your daiquiris and oysters and swordfish and hash browns andtarte tatin ?”</p><p>“Let’s never speak of it again,” she said determinedly.</p> <p>He laughed, delighted, stood in such an abrupt movement if she’d blinked she’d have missed it, and crossed the room. In another moment he was holding her hands. “I’m so glad t’see you’re better,” he said with such obvious sincerity she smiled—for the first time in hours, it seemed. “I was worried.” Except in his charming brogue, it came outsae glad tae see yerrr betterrrrrr .Ai wooz worred.</p><p>“I’m pretty damned glad to be feeling better myself. God, I’ve never been so sick! I guess I’d be a terrible alcoholic,” she confessed.</p><p>“It wasna the alcohol. The doctor said it was food poisoning. I’fact this hotel is full...quite a few guests of the restaurant suffered from the oysters and are resting up because of it.”</p><p>She thought she ought to pull her hands out of his grip, but couldn’t bring herself to take the step. His hands around hers were warm—almost hot—and looking up into his unbelievable face was just too good right now. “What doctor? Was she the lady in the red dress? I remember someone in red who wouldn’t stop with the shrieking...”</p><p>Alec’s lips quirked in a smile. “Dr. Madison is a verra soft spoken woman, actually. You were just sensitive to noise while you were sick. I called her when you—uh—”</p><p>“Remember. We’re not speaking of it.”</p><p>“—became indisposed,” he finished delicately, but he wouldn’t quit smiling. “She helped me take care of you.”</p><p>“Oh.” Touched, she squeezed his hands. “Thanks, Alec. I guess I was a lucky girl to be out with you.”</p> <p>“Lucky?” The smile dropped away. “It was my fault you got sick, so the least I could—”</p><p>“Your fault? Held me down and shoveled in the oysters, did you?” she said dryly. “Hardly. In case you haven’t noticed the inordinate size of my ass, I’m a girl with a healthy appetite. I got so incredibly sick because I ate so incredibly much.”</p><p>He squeezed her fingers in response. She had a sudden sense of crushing power held in check. “I adore your ass.”Ai adorrrre yuir arse. Was she crazy, or was his brogue getting thicker by the second? What had he said? That it came out when he was angry or...</p><p>Or...</p><p>She snatched her hands out of his grip. “Paws off, monkey boy. Time for me to get the hell out of here.”</p><p>“I’d prefer it if you didn’t call me that,” he said, mildly enough. “It’s quite an insult where I come from.”</p><p>“They’ve got a real mad-on against monkeys inScotland , eh? Whatever. Gotta go now, it’s been fun, buh-bye.”</p><p>“Can’t go.” He folded his arms across his chest and smirked at her. “Your clothes were quite ruined in the incident-that-shall-ne’er-be-named.”</p><p>For the first time, she realized she was wearing a flannel nightgown. It had a demure lace collar which scratched her chin, and the hem fell about three inches past her toes.How could she not have noticed this before? She’d just used the bathroom, for God’s sake. Sure, she’d had to pee so bad nothing else had registered, but...she made a quick grab and found shewas wearing her old panties beneath the gown. Whew!</p><p>His eyebrows arched while she groped herself, but he wisely said nothing. “The doctor said you needed rest and quiet until you—er—purged your—”</p><p>“Oh, Christ.”</p><p>“Anyway.” He turned brisk. “I had the staff send up something for you to sleep in.”</p><p>Any thoughts he was embarked on sinister seduction fled as she fingered the gray flannel. She felt like an extra onThe Little House on the Prairie. “Thanks.” She smiled in spite of herself. “Flannel?”</p><p>He shrugged. “It’s cold where I come from. I wanted you to be comfortable.”</p><p>“And I am,” she assured him with a straight face. “But I would be more comfortable if I got the hell out of a stranger’s hotel room.”</p><p>“Stranger?” He grinned at her, all devil and mischief. “After all we’ve been through today? Shame!”</p><p>She laughed; she couldn’t help it. Quick as thought, his hand came up and caught one of her curls; he pulled it and watched it spring back. Uck. “Sorry.”</p><p>“Don’t, now.”</p><p>“No, really...I know, I look like Bozo the Clown on mescaline. If Bozo didn’t have red hair. And was really short. And was a woman. You should see it in the summer...giant fuzzball! Hide your children!”</p><p>He was eyeballing her hair. “I’d like to see it in the summer.”</p><p>“Okey-dokey,” she said, humoring him, “andI would love to see my uniform. I can wear my Santa suit on the subway home.”</p><p>“At two o’clock in the morning? Alone?” He sounded mortally offended. “I think not. Besides...” His voice became sly. “Aren’t you hungry?”</p><p>Hungry! Oh, God, no one in the history of Santa bellin’ for bucks had ever been this hungry. She actually swayed on her feet at the thought of eating.</p><p>“That’s my girl. Let’s call room service. Anything you want.”</p><p>“I’ll have to get my wallet—”</p><p>He frowned forbiddingly. “Do not get your wallet.”</p><p>“Fine, we’ll fight about it later. Where’s the menu? God, I could eat acow .”</p><p>“I know the feeling.”</p><p>She ordered a steakau jus , rare, with mashed potatoes and gravy and broccoli and half a loaf of wild rice bread. “This is going to be really expensive,” she warned him. “Are you sure I can’t...?”</p><p>“Quite sure. It’s such a relief to be with a woman who eats.” He sat beside her on the bed and sighed. “I’ll never understand the American custom of starvation. You’re the richest country in the world and the women don’t eat.”</p><p>“Hey, not guilty. As you can see by the size of my ass.”</p><p>“Tempting. Let’s see how well you do with your dinner first.”</p><p>She glanced uncertainly at him, caught his low-lidded look. It seemed incredible, but the man was actually turned on at the thought of her non-toned ass. His words hadn’t been enough to convince her, but his thickening brogue was telling.</p><p>It was all very strange. Not to mention marvelous. And oh-so-slightly alarming.</p><p>Chapter Five</p><p>She did very well. Polished it all off, then ordered ice cream. He watched in pure delight. And thanked God again he was nowhere near his Change.</p><p>Keeping his hands—and mouth!—to himself was beginning to be a sore task. It hadn’t been a problem when she’d been so miserably ill, but she was obviously feeling better...he could hardly talk to her; his tongue felt thick in his mouth. She was just so—just so adorable, alive and sexy and fragrant. When he’d tugged on one of her glossy curls, it had taken nearly everything he had to keep from plunging both hands in her hair and taking her mouth.</p><p>He’d been wild with worry for her, hadn’t left her side for a moment since she threw up her lunch on his shoes. He was going to see that chef’s head on a pike—or his name on a termination slip—before the sun set again.</p><p>“That’s better,” she sighed, patting her mouth with a napkin. It was a lovely mouth; wide-lipped and generous. When she smiled, the upper lip formed a sorceress’s bow. He had to concentrate very hard onnot sucking that lip into his mouth. “Now. About my imminent departure. Not that you haven’t been a perfect gentleman. Because you have. Yes, indeedy! But, bottom line, I haven’t known you for twenty hours.” She stood and began pacing. “So I’m definitely not sleeping in your hotel room. Anymore, I mean.”</p><p>“S’don’t sleep,” he teased, catching her hand and pulling her toward him. Her dark gaze caught him, held him. A line appeared between her eyebrows as she frowned. He kissed the line.</p><p>“Now listen here, Grabby McGee...ah!”</p><p>He kissed the sweet slope of her neck. And was lost. He might not have been, had she not instinctively leaned into the caress of his mouth. He reached up, found the soft splendor of her hair, and caught her mouth with his. She smelled like surprise and vanilla bean ice cream.</p><p>“Oh, God,” she said, almost groaned, into his mouth. “You’re like a dream. The best dream I ever had.”</p><p>“I was thinking the same thing.”</p><p>“What? I’m sorry, your accent—” She giggled and kissed his chin. “It’s so thick I can barely understand you. Which, by the way, I’ll take as a compliment to my own massive sexiness.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Y’should. Stay with me.”</p><p>“I can’t.” She was wriggling—regretfully, but still wriggling—out of his grasp. Trying, anyway. He had no trouble whatsoever keeping her in the circle of his arms. “I’m sorry. I’d love to. I can’t. Leggo.”</p><p>“But you must.” He found her breast—not easy, given its encasement in sensible gray flannel—and cupped it in his palm. The firm, warm weight made his head swim. “You’re for me and I’m for you, lovely Giselle. Besides, I’m not going to let you leave.”</p> <p>“What?”</p><p>“Besides, what if you heave?”</p><p>“Oh. I thought—look, I feel fine. I don’t think I’ll be sick again.”</p><p>“But what if y’are? I promised Dr. Madison I’d look after you for the next twenty-four hours. It’s only been about six.”</p><p>“But I feel fine.”</p> <p>“But I promised.”</p><p>“Well...if you promised...and if it’s doctor’s orders...” She was weakening. She wanted to be persuaded. So he’d persuade her, by God.</p><p>Chapter Six</p><p>One minute they were having a (reasonably) civilized conversation, and the next his hands were everywhere. Her nightclothes were tugged, pulled, and finally torn off her. His weight bore her back on the bed.</p><p>“Alec!” Surprise made her voice squeakier than usual. “For crying out loud, I feel like I’m caught in an exercise machine—yeek!” ‘Yeek’ because his head was suddenly, shockingly between her breasts, his long fingers were circling one of her nipples, then tugging impatiently on the bud. Heat shot through her stomach like a comet. And speaking of comets, what the hell wasthat pressing against her leg?</p><p>“I don’t think this is what the doctor had in mind—” she began again.</p> <p>“Giselle, my own, my sweet, I would do nearly anything you asked.” He was having this conversation with her cleavage. “But will you please stop talking for just a minute?”</p><p>“Forget it. I reserve the right to chat if you’ve reserved the right to rip up my nice new nightgown,” she informed the top of his head. And her old panties. Well, at least it wasn’t laundry day. No Granny underpants on her, thank you very much!</p><p>She was striving to sound coolly logical, matter-of-fact, but his mouth was busy nibbling and kissing and licking; it was too damned wonderful. Distracting! She meant distracting. She ought to kick him in the ‘nads. Whywasn’t she kicking him in the ‘nads? Or at least screaming for help?</p><p>Because he wouldn’t hurt her. Because he wanted her with a clear, hungry passion no man had ever shown her. Because she had a crush on him the size ofAustralia . Because if she screamed he might stop.</p><p>“Uh...help?” she said weakly, a moment before he rose up and his mouth was on hers. He smelled clean and masculine; his lips were warm and firm and insistent. His tongue traced her lower lip, then thrust into her mouth. Claimed it. His groin was pressing against hers and she could feel his...er...pulse.</p><p>She tore her mouth from his, not without serious regret. If he kissed her likethat again, it was all over. Good-bye, good-girl rep. Hello, new life as a slut puppy. “Condoms!” she shouted into his startled face. “I’ll bet you a hundred bucks you don’t have any.”</p><p>“Of course I don’t,” he said indignantly. He was—ack!—shrugging out of his shirt. His chest was tanned (in December!) and lightly furred with black hair. She actually moved to see if his chest hair was as crisp as it looked, then pulled her hands back and clenched them into fists. “I didna come here to mate. Have sex, I mean. I’m here on business. I never thought—”</p><p>“Yeah, well, that’s a problem, Buckaroo Banzai, because I didn’t exactly line my bra with prophylactics, either. Which means looky but no nooky. In fact,” she added on a mutter, “we shouldn’t even looky.”</p> <p>“But you’re on the Pill—ow, dammit!”</p><p>She’d formed a fist and smacked him between the eyes. The only way he would have known she was taking birth control pills is if he had gone through her purse while she was sick; she’d stopped at the pharmacy on the way to work and picked up her prescription.</p><p>“We had to,” he said, as if reading her mind. He rubbed the red spot on his forehead, which was rapidly fading. “Dr. Madison was concerned we’d have to take you to the hospital. She needed to know if you were taking any medication.”</p><p>“A likely story,” she grumbled, but it sounded plausible, so she didn’t follow up with a headbutt. Not that she’d ever done one in her life, but how hard could it be? “And it’s the Minipill, Mr. Knows-So-Much. Besides, I’m not worried about getting pregnant—”</p><p>“You should be,” he teased. Except she doubted he was really teasing.</p><p>“I’m worried about catching something. Without condoms our options are—thank God—limited. Saran Wrap and a rubber band? Forget it. For all I know you could be crawling with disease. I could be taking my life in my hands if I let you bone me!”</p><p>“Boneyou? Crawling—” He got up off her—weep!—and started to pace. Shirtless, and with an interesting bulge beneath his belt buckle. She struggled to keep her gaze on his face. Well, his shoulders, at least. “First of all, my family—we don’t—that is to say, I’ve never been sick a day in my life, and no one I know has ever had—er—problems in that area. Second, I know for a factyou’re disease-free.”</p><p>“How?” she asked curiously. He was right, of course, but how’d he know?</p><p>“It’s hard to—never mind. And third...third...” He laughed unwillingly and ran a hand through his hair. It stuck up in all directions but, instead of looking silly, it only made him look immensely likeable. Adorably rumpled. “Giselle, you’re unlike any woman I’ve ever known. You—” He shook his head. “There’s just something about you. I can’t put it into words. Come back toScotland with me.”</p><p>She’d been busily arranging the covers over herself, though it was a bit late for modesty, and looked up. “What?Scotland ? You mean, like a visit?”</p><p>“...sure. A visit.” He grinned. “Starting tomorrow, and ending never.”</p><p>“Yeah, yeah. Look, if you still feel like this tomorrow...later today, I mean...I could leave you my phone number.”And never hear from you again, most likely.</p><p>“We need Santas inScotland ,” he said seriously. “It can be a verra lonesome place.”</p><p>“Oh, come on!” She started to get the giggles, and laughed harder when he pounced on her like a big cat. A good trick, since he’d been standing several feet away from the bed. The man was in great shape, no doubt about it. “Now, cut it out...get off, now! I told you, no condoms, no nooky.”</p><p>“What if I could prove I wasn’t—er—how did you put it? Crawling with disease?”</p><p>“Prove it how?” she asked suspiciously. Part of her couldn’t believe they were having this discussion. The last time she’d had sex had been...uh...what year was it? Anyway, the point was, this wasso unlike her.</p><p>Well, why not? Why not jump without looking for once in her ridiculously dull life? The most interesting thing about her was her name...Mama Smith had been Jane Smith, of all the rotten jokes, and wanted her kid to be remembered. It didn’t work. Short, plump women with brown hair and brown eyes weren’t exactly noticed on the street.</p><p>Until today.</p><p>“Okay,” she said slowly, “and back off a minute, let me think.” She pinched his nipple, hard. He yelped and reared back. “That’s better. Okay, if you can prove you’re disease-free, I’ll stay the night with you.” She forced herself to meet his gaze. Her face was so red she was sure her head was going to explode, like that poor schmuck inScanners . “I’ll do anything you want until the sun comes up. You’ve got my word on it. And a Smith never goes back on her word. This Smith, anyway,” she finished in a mutter.</p><p>He looked at her, wide-eyed. Then turned so quickly—snake-quick, it was uncanny—and grabbed for the telephone.</p><p>“Wait a minute, who are you calling?” she asked, alarmed. She hadn’t thought he could prove a damn thing at two o’clock in the morning. “If it’s some buddy inScotland who’s gonna back you up—”</p><p>“I’m callingMassachusetts GeneralHospital ,” he said, grinning widely. “Good enough? Dr. Madison has staff privileges there. She’s been looking after my family for years and years. She’ll tell you all about my medical history if you like.”</p><p>He put the phone on speaker, so she could hear the hospital operator.Madison was paged, and soon came to the phone.</p><p>“How are you feeling, dear?” she asked. She also had an accent, this one the clipped intonation of a blue blood Bostonian. “I had a terrible time calming Alec down while you were ill.”</p><p>“I’m—ack!”</p><p>“No idle chit-chat,” Alec said in her ear, and ran a finger all the way down her spine.</p><p>She turned and slapped his hand away, then grabbed for the receiver so Alec wouldn’t hear the rest of the conversation. “I’m fine, much better...listen, does Alec have any STDs that I, as a potential—ack!—sexual partner should know about?”</p><p>“STDs? You mean like AIDS or—oh dear—”</p><p>Giselle held the phone away, the better not to be deafened by the woman’s shriek of laughter. A few seconds later, Doc Madison had it under control: “Sorry about that. I give you my word as a physician and a lady, Alec has never been sick a day in his life. Nor any of his family. They’re a...a healthy lot.” Another chuckle. “Why do I have the feeling I’ll be seeing more of you, dear?”</p><p>“Beats the hell out of me. Okay, then, tha—” That was as far as she got before Alec was tossing the phone across the room, and her back on the bed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter Seven</p><p>“Ah...”</p><p>“Don’t be afraid.”</p> <p>“I think this is an excellent time to be afraid. For one thing, a) you’re a lot bigger than I am, and b) I’m pretty sure you’ll tackle me before I get to the door.”</p><p>“A) you’re right, and b) you’re right. You’re welcome t’try, though.” His eyes gleamed. “I like to play Chase.”</p><p>Oh, Jesus. She slid from the bed and he was right behind her. “Now, now,” he said, almost purred, “a promise is a promise. Right, Giselle sweetie?”</p><p>Odd, the way he said that...like it was one word: Gisellesweetie. She liked it. Liked him. And a good thing, too, since they were about to get down to it. “You’re right. I gave my wormmmphhh!” His mouth was on hers, he was pulling her toward him and she went up on her tiptoes. His tongue was in her mouth, jabbing and darting, and she could actually feel that between her legs. One of his hands was on the back of her neck, holding her firmly to him. The other arm was around her waist—luckily he had long arms.</p><p>He broke the kiss. With difficulty, she was delighted to see. As for herself, she was panting as if she’d just run a marathon. And as elated as if she’d just won one. “Now,” he said, almost gasped. “You said anything. That you’d do anything. Until the sun came up.”</p> <p>“Yes.” It was hard to breathe. Black excitement swamped her. A promise was a promise, dammit, and she had his personal physician’s word that he wasn’t sick. More, she trusted him implicitly. She had been handed a fantasy on a plate, and meant to take full advantage. After tonight she’d never see him again. But by God, she had tonight. “Yes, anything. Anything you want.”</p><p>“Ooooh, verra good,” he crooned, almost growled. He sank to the bed and pulled her down with him. And kept pushing her down until she was on her knees, facing him. “Unbuckle my belt. Please,” he added with a wolfish grin.</p><p>She did, with fingers that were clumsy and stupid. She finally pulled the belt free and wordlessly handed it to him. He tossed it in a corner. “Since you’re keeping your promise—so far—we likely won’t be needing that .” She gulped—what the hell had she gotten herself into? “Now. My slacks, love. All the way off.”</p><p>She did so, and then, when asked, relieved him of his boxers. It was too dark in the room to see their color—navy blue? puce?—but by their slippery feel she guessed they were made of silk. No flannel for him .</p><p>“Now,” he breathed. “Kiss me.”</p><p>She understood him perfectly, and kissed the head of his cock, then rubbed her cheek against him like a cat. He smelled warm and musky and undeniably male. He was also quite thick; she had difficulty closing her fingers around him. “Again,” he groaned, “kiss me again, Giselle sweetie.”</p> <p>She did so, tasting the saltiness of pre-come. She licked it off, then licked up and down the length of him. She could feel his bristly pubic hairs tickling her chin on the down stroke. His hand came up, caught a handful of her curls, fisted. “Now,” he growled, “open your mouth. Wide.” His voice was so gritty she could hardly understand him, but it didn’t take a rocket scientist to understand what he wanted—needed. Then he was filling her mouth, her throat. He withdrew in time for her to take a breath, then was in her mouth again. His hips were pistoning toward her face and she realized he was fucking her mouth . While part of her was wildly excited, her practical side reminded her that although she could count the number of blow jobs she had given on one hand, she was definitely not a swallower.</p><p>His other hand had found her breasts and he was kneading, squeezing. The sensation of his hands on her, his cock in her mouth, was as exciting as it was overwhelming. She tried to pull back but his grip tightened, and then she felt him start to throb. Shockingly, suddenly, her mouth was flooded with musky saltiness and she reared back, but he had a grip like iron. In a second he had pulled free of her but clapped a hand over her mouth. “Swallow,” he murmured in her ear. “All of it. Right down.” Aoull oof it. Ret daeown.</p><p>She did. “Bastard!” she cried, making a fist and smacking him on the thigh. “A little warning next time, all right?”</p><p>“I promise,” he said solemnly. “The next time I’m about to come in your mouth, I’ll give ye ample warning. Ouch!”</p><p>“I’ve never done that before.”</p><p>He was rubbing his thigh where she’d pinched him, hard. “I could tell.”</p><p>Incredibly, pierced vanity was now warring with outraged propriety. “Well, hell , I’m not exactly known as Slut Girl around here, and besides, I didn’t exactly plan—”</p><p>He stopped her with a kiss. “You were wonderful,” he said warmly. He nuzzled her nose for a moment. “And I’m verra sorry if I startled ye. But I needed ye t’do that for me. Now I can touch you wi’ a clear head. Now the fun can really start.”</p> <p>“You’re still a bastard,” she said sulkily. She could still taste him in her mouth, her throat. “You didn’t have to make me—”</p><p>His smile flashed in the dark. “Well enough. But now it’s y’turn, sweetie.”</p><p>Her irritation lessened as he eased her back on the bed and knelt between her legs, disappeared entirely as she realized he was going to be as good as his word.</p><p>It seemed as though he spent hours between her thighs: kissing, nibbling, sucking, and licking, ah, God, the licking. Lots of it, slow and steady; the man never got tired. In no time her clit was enthusiastically throbbing, and that’s when he started paying special, extended, loving attention to the little button Giselle hardly thought of unless she was enjoying the evening with Mr. Shaky.</p><p>His tongue darted and stroked; she could feel its warm, wet length sliding and slipping between her throbbing lips. Felt him sucking on her clit with a single-minded enthusiasm that was as exciting as it was astonishing.</p><p>After a while she was squirming all over the bed, trying to get away from the delectable torture of his mouth. He wouldn’t—he—he never stopped, never got tired, just kept at her, at her, at her. Lick lick lick and suck suck suck and even small, tender bites. She could feel herself getting drenched and would have blushed if she hadn’t been so close to shrieking. She’d start to feel her orgasm approach, and he’d somehow know, and back off. Instead of giving her the last few flicks of his tongue to push her over the brink, he’d move to her inner labia and gently suck them until she was no longer close to coming, or his tongue would delve inside her—so deeply!—leaving her clit bereft.</p><p>“Oh, God , y’smell so damned good!” After that breathless declaration he buried his face between her legs and commenced tormenting her anew. His hands spread her thighs so wide her knees were almost parallel, baring her fleshy mound for his hungry mouth. He started licking her in long, slow, agonizing slurps, from bottom to top, over and over and over. Her back bowed and she was certain she was about to lose her mind if she didn’t come now .</p><p>So she squirmed and wriggled, and when she made progress getting away from him he simply grasped her thighs and pulled her back to his mouth. This went on for about seventeen years, until he tired of playing with her, sucked her clit into his mouth, and slipped two fingers inside her. The feeling of his warm lips on her, his long fingers in her, was exquisite, mind-boggling. His fingers moved, stroked, pushed hard inside her, pressure that was just short of discomfort, pressure that was amazing, mind-boggling. His lips had closed over her clit while his tongue flicked back and forth with dizzying rapidity. Her orgasm crashed over her like a wave and she shrieked at the ceiling.</p><p>When he came up to lie beside her, she was still shaking. “Better?”</p><p>“Oh my God . Do you have a license to do that? You ought to be against the law.” She reached out and did what she had longed to do an hour ago: gently stroked his chest hair, then followed a path down to his groin. She found him thick, hard, and ready for her. He sucked in breath when she gently closed her fingers around him. “By the way,” she added cheerfully, if breathlessly, “I’m on to you. There’s no way you’re an ordinary guy. Not that I mind.”</p><p>He stiffened, though whether it was from what she had said, or what her fingers were doing, she couldn’t tell. She was squeezing and releasing, squeezing and releasing. Her other hand slipped lower until she was cradling his testicles in her palm, testing their warm weight. “You’ve got a butterfly’s touch, Giselle sweetie,” he said, almost groaned.</p><p>She almost giggled; she’d never pictured her plump self as something so light and delicate as a butterfly. Alec was no doubt mumbling nonsense because all the blood had left his head some time ago, and gone significantly southward.</p><p>She slipped her hand up, down, up, down, with excruciating slowness, with all the care he had shown her a few moments ago. She wasn’t terribly experienced, but she was well read. She’d been buying Emma Holly’s books for years. “That’s why you shouldn’t mess with a bookworm,” she whispered in Alec’s ear. “We know some pretty good stuff.” He didn’t answer her, but because she had brought her palm across his slippery tip and circled, circled, circled while her other hand stroked, she didn’t expect him to.</p><p>She had meant to keep playing with him as long as she could draw it out, but he suddenly jerked away from her and kneed her thighs apart. He was terse, silent, but oh, how his hands were shaking. “Shouldn’t you buy me dinner first? Again, I mea—eeeeeeEEEEEEEEEEE!” He entered her with one brutal thrust, all the way, all at once. She was slick, more than ready for him, but it was startling—a little frightening, even—all the same.</p><p>He started to drive himself into her.</p><p>She squirmed beneath him, felt her eyes roll back in her head...ah, Jesus, this was almost too much! Almost. “Alec.”</p><p>His hips were shoving against hers, his eyes were tightly closed; his mouth was a narrow line. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Alec.”</p><p>“Sorry,” he muttered. “M’sorry. Wait. I’ll be—nice again. In a minute.”</p><p>“Alec.”</p><p>“I can’t—stop. Just yet. S-Sorry. So sorry.” His hands were on her shoulders, pinning her down, keeping her in place for him. His sex was rearing between her legs, into her, out of her. Digging, shoving, filling her.</p> <p>“Alec. If you do it a little faster, I’ll be able to come again.”</p><p>That got his attention; his eyes opened wide. And then he smiled, a grin of pure male satisfaction. And obliged. She heard the headboard start slamming against the wall and didn’t give a tin shit. She wriggled for a moment until he let go of her shoulders, then brought her arms around him and her legs up. And started doing a little pumping of her own. Their bellies clapped together, a lustful, urgent beat.</p><p>His eyes rolled back: “Ah, Jesus !” His mouth found hers and he kissed her savagely, biting her mouth, her lips. Then he abruptly pulled back, as if aware he was nearing a line he wasn’t ready to cross with her—absurd, given what they were engaged in. His head dropped and she could feel his face pressing against the hollow between her neck and shoulder. There was a sharp pain as he bit her.</p><p>He’s marking me, she thought. She heard a purring tear as he tore the sheets. He’s making me his own . That thought—so complicated, so strange, and so completely marvelous—spun her into orgasm.</p><p>He stiffened over her as she cried out; his grip tightened—painful for a split second, then he relaxed. “Do that again,” he growled in her ear, then bit her earlobe.</p> <p>“I can’t,” she gasped, almost groaned. And still he was busy, still he was fucking her with long, fast strokes.</p><p>“Yes.”</p><p>“I—can’t!” Pump, pump, pump, and her neck stung where he had bitten her. As if sensing her thought, he bent to her and licked the bite, then kissed her mouth.</p><p>“I need to feel your sweet little cave tightening around me again,” he said into her mouth. “I must insist.”</p><p>“I’m done, please, I can’t anymore, please, Alec—” Oh, but her body was betraying her, she was arching her back so as to better meet his thrusts, and she could feel that now-familiar tightening between her thighs, the feeling that told her she would do it again, thank you very much. “Alec, please stop, please, I can’t. Stop! St—” Then it was singing through her, tearing through her, and this one made the other two seem like mild tickling in comparison, this one was the biggest thing to ever happen to her.</p><p>She felt him stiffen above her again, but, oh, Christ, he wasn’t done, he was still thrusting. He seized her knees and pushed them wide, spreading her, making her wider for him. She screamed in pleasure and despair: more of this was sure to kill her. It’d be the best death ever, but it’d still be death.</p> <p>“More,” he muttered in her ear.</p><p>“...can’t.”</p><p>“Can.Will.”</p><p>She reached down, stroked his ass, felt, groped...then shoved her finger inside him, right up his ass, as far as she could. At the same time she clenched around him</p><p>(thank you, Kegel exercise)</p><p>and was gratified to hear his hoarse shout. Then he was pulsing inside her and throwing his head back and roaring at the ceiling. The headboard gave one more loud THUMP!, and was quiet.</p><p>She sobbed for breath and he soothed her with gentle strokes and small kisses. “Shhhh, sweetie, you’re all right. I just don’t think I am. Shhhh.”</p><p>“That was—that—”</p> <p>“Easy. Shush, now. Get your breath back.”</p><p>As the ripples from her last, titanic orgasm faded, she realized she still throbbing. Still wanted him. She was a bookworm cursed with the body of a slut.</p><p>“That was—mmbelievable. ‘Mazing.” Oh, great, she was babbling like a cheerleader after her fifth beer. She tried again. “Unbelievable. Amazing. I’m sure you hear this all the time, but that was the best ever . I don’t mean for me. I mean in the history of lovemaking.”</p><p>He was kissing her forehead, her mouth, her cheeks. “For me, also. And I don’t hear it all the time. I haven’t been with a lady in almost a year.”</p><p>She nearly fell off the bed. “What? Why ? You’re so—I mean, the overall package is just—and then what you can do in the bedroom—what the hell have you been waiting for? Did you lose a bet?”</p><p>“I did not. Who,” he said. “Who the hell have I been waiting for. That’s the question.” He bent and nuzzled her cleavage. “God, I could get lost in you. So easily. Which means I have to kill you or marry you.”</p><p>“Har, har. And get your nose out of there, it tickles.” She could feel his cock on her thigh, very warm, and reached out. “Jesus! You’re hard again!”</p><p>“Sorry,” he said dryly. “I can’t much help it if you’ve got the sweetest cunt. Not to mention some very talented fingers.”</p><p>“No, I mean...uh. I don’t know what I mean.” Their gaze met. Her eyes had long ago adjusted to the dark; she could see him quite well. “Do you want to keep going?”</p><p>He smiled slowly; it was like an extra spoonful of sugar being stirred into really good coffee. “Do you?”</p><p>“That’s not really relevant,” she said tartly. His eyebrows arched. “A promise is a promise, remember?”</p><p>“What I like about you—one of the things—is that you’re not done. With me.” His hand slid down the soft mound of her belly, cupped her between her legs. Then he gently parted her, and his fingers slid up inside her. She sucked in breath and moved with his hand. “You haven’t closed off,” he murmured into her mouth, “the way a lady will when she’s had enough.” She could hear herself whimpering softly as his fingers slid in and out and around, as he got slick with their juices. “Of course, you have other qualities, very fine ones.” His voice held a teasing note. “But I wouldn’t have guessed at this one while I was wooing you over lunch.”</p><p>“Wooing me?” she gasped. “Is that what you were doing?”</p><p>“What I was doing was concentrating on not bending you over the nearest table and taking you until my knees gave out. I’m amazed I was able to talk to you at all—ah, God, that’s sweet, Giselle. Those sounds you make in the back of your throat make me forget everything. Come down here.”</p><p>He pulled her until she was kneeling before the bed. She could feel him behind her, holding her around the waist, then stroking her buttocks and kneading the plump flush. “I could bite you here about a hundred times,” he muttered.</p><p>“Better not if you want to save room for breakfast.” She yelped as his kneading inched toward pinching. “Easy, Alec, I have to sit on that later.”</p><p>He swallowed a laugh. “Sorry. But Giselle sweetie, you do have the most luscious ass.” Then his hands moved lower until he was holding her open with his fingers. She could feel herself—everything in her—straining toward him. Silently begging for him.</p><p>“Oh, God, Alec...”</p><p>“I like that, Giselle. I like hearing you groan my name.” He eased into her, inch by delicious inch; she leaned forward and braced her arms on the bed. “Now, if y’don’t mind, I’d like to hear you scream it.” He thrust, hard.</p><p>He stroked, and his hands were everywhere...running up and down her back, cupping her breasts, stroking her nipples...then roughly pulling them between his fingers, as if he instinctively knew when she wanted him to be sweet and when she wanted—needed—him to be rough. She screamed his name, begged him to stop screwing around and do her, dammit . He laughed in pure delight, laughed while she writhed and groaned and shoved back at him. Then his strokes pushed her into orgasm and he abruptly quit laughing and gasped instead.</p><p>She realized the sun had come up a while ago. Well, who gave a rat’s ass? She couldn’t believe the man’s stamina. She couldn’t believe her stamina.</p><p>“Getting tired?” he panted in her ear. He was still crouched behind her, still filling her the way no man ever had. When he braced himself and thrust, she swore she could feel his cock in her throat. “Giselle? All right?”</p><p>“Yes, I’m tired, I’m exhausted, you big dolt, and don’t you dare stop.”</p><p>He chuckled and she could feel his fingers dancing along the length of her spine. Then his hand came around and found her clit. He stroked the throbbing bud with his thumb and said, “I wish my mouth was there right now. Later, it will be,” and that was enough, that tipped her into another orgasm.</p><p>She felt his grip tighten on her. “Oh, God, that’s so sweet,” he groaned. “Has anyone told you? When you come, your muscles lock.” He shuddered behind her as he at last found his release. “All your muscles.”</p><p>She giggled weakly and rested her head on the bed. Three times...or was that the fourth? The man wasn’t human. Thank God she was on the Pill.</p><p>He stood, then picked her up and cradled her in his arms as if she were a child. “You’ll sleep now,” he said, laying her in the bed and covering her. “And so will I...you’ve worn me out, m’lady.” Then, incongruously, “Do you have a passport?”</p><p>“No,” she said drowsily.</p><p>“Hmm. I’ll have to fix that. Can’t come toScotland without one of those.”</p><p>“You still want me to come?” She blushed, remember how they’d spent the last five hours. “ToScotland , I mean?”</p><p>“Of course.” He was arranging the covers over himself, pulling her into his embrace, wrapping his long legs around hers. She was instantly warm and sinfully comfortable. The throbbing between her thighs had finally quit. It quit because you’re numb, you twit. He’s fucked you numb. And it was just fine . “I said, didn’t I?”</p><p>“Well...” She yawned against his shoulder. “That was before I gave up the goods, so to speak.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Giselle, darling.” He kissed the top of her head. “I’ve never known a woman so smart and so silly at the same time. You’re coming toScotland . To put it another way, I’m not leaving without you.”</p><p>“Bossy putz,” she muttered. Then squinched her eyes shut as he turned on the bedside light. “Aggh! I think my retinas just fused!”</p><p>She could hear him swallow a laugh. “Sorry, love. I just wanted to get a good look at your neck.” She felt him push her hair back and gently touch the bite. “A bite’s a serious thing...I’m really sorry if I hurt you. You know that, right, Giselle?”</p> <p>“Don’t worry about it. At the risk of making you more arrogant than you already are—though how that’s possible I just can’t imagine—I loved it. Hardly even hurt.”</p><p>“Oh.” She could hear the unmistakable relief in his tone. “I’m glad t’hear it. I don’t have an explanation except...I don’t want you to think I go around biting just anybody. I just...lost myself in you.”</p><p>“That, and you wanted to mark me,” she added drowsily. Ah, even with that obnoxious light on, she was going to be able to get to sleep quite nicely. Take that, bedside lamp! “It’s all right. I don’t mind wearing your mark for a while.</p><p>“What did you say?”</p><p>“Marked me.”</p> <p>“What?”</p><p>“Arked-may E-may! Jesus, for a guy with heightened senses you’re really slow.”</p><p>“What?”</p><p>“Don’t yell, I’m right here. I forgot werewolves were so touchy.”</p><p>“Oh my God .”</p><p>“Steady, pal.” Concerned, she sat up. He looked like he was going to pass out. “Hey, it’s okay. I said it was, right? You marked me so another werewolf won’t take it into his head to jump me. Theoretically, they’ll see your mark and steer clear. Or lose their minds and decide, of all things, to fight for me. Ha! Like that’d happen.”</p> <p>She saw him lurch into the chair—sitting down before he fell down. Very wise. “You know? About me?”</p><p>“Sure. Not right away,” she added comfortingly, since he looked so shattered. “Took me a while to figure it out. But come on, you’re a little too quick and too strong for a guy in his—what? Early thirties?”</p><p>“Thirty-one,” he said absently.</p><p>“Plus, your stamina between the sheets was—was really something.” Was she blushing? After what they had just shared? You’re obviously overtired. Go to sleep, Giselle. “I’ve never met one—a werewolf—but my mom used to work for Lucius Wyndham.”</p><p>He was staring at her with the most priceless look of astonishment on his face. “Your mother worked for the former pack leader?”</p><p>“Will you stop with the yelling? Yes, she managed his stables for him. ‘Course, he couldn’t come near any of his horses without them going crazy trying to get away from him. He finally had to tell her the truth, because she thought he’d abused them, and was getting ready to sic the ASPCA on him.</p><p>“Well, of course he wasn’t hurting them, it’s just instinctive for horses to stay the hell away from werewolves. So he told her, and proved it to her, and she liked the horses, and liked him, and stayed on. ‘Til she married my dad and moved toBoston . But she’d seen a lot by then. My mom,” Giselle added with satisfaction, “tells the best bedtime stories. I figured you out a little while ago. I said so...remember?”</p><p>He was shaking his head, his mouth hanging open. “I just can’t—all night I’ve been trying to figure out if I should just kidnap you t’Scotland and tell you the truth over there—”</p> <p>“Typical werewolf courtship,” she sneered. “You guys really need to work on the romance thing.”</p><p>“Or try to explain it to you tomorrow. Later today, I mean. Or wait until we knew each other better—but you knew!”</p><p>“Yup.”</p><p>“And you didn’t say anything!”</p><p>“It didn’t seem polite, since you didn’t bring it up.” She blushed harder, like that was possible. “Besides, we...had other things on our minds.”</p><p>He burst into laughter, great, roaring laughs that made her ears ring. “Giselle sweet, you’re for me and I’m definitely for you. I knew it the moment I smelled you. Ripe peaches in the middle of all those street smells and slush. The only Santa who was ovulating.” He pounced on the bed and pulled her into his arms, kissing her everywhere he could.</p><p>“Jeez, cut it out!” She was laughing and trying to fend him off. “Can’t we do this later? We ordinary humans get tired after making love all night.”</p><p>“There’s nothing ordinary about you, sweetie.”</p><p>“Oh, come on. You can’t tell me that on that whole street, where there were probably a couple hundred people, the only one ovulating was me?”</p><p>“No, I can’t tell you that.” He kissed her on the mouth. “What I can tell you is that the only woman for me was ovulating.”</p><p>“Oh. Sleep now?” she added helpful, groping for the bedside lamp.</p><p>He shut the light off for her. “Scotland?”</p><p>“Yes.”</p><p>“Forever?”</p><p>“Nope. Sorry, my parents are from here. I have friends here, too. A life I made before I ever laid eyes on you, pretty boy. And, hello? Courtship, anybody? It’d be nice to date a little, before we got married.”</p><p>He mock-sighed. “Humans, oh, Lord help me. A house inBoston , then, but at least half the year at my family home. After,” he sighed again, “an appropriately lengthy courtship.”</p><p>“Done.”</p><p>“Naked courtship?” he asked hopefully.</p><p>She laughed. “We’ll work out the details. Doesn’t really matter, though. Wither thou goest, I will go. And all that.”</p><p>“And all that,” he said, and kissed her smiling mouth.</p><p>The End </p> </body></html>"]