["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Scythia, 2257 CE</p><p>Women in the warrior society of Scythia had no need of men. Men, it was universally acknowledged, were good for only one thing—making babies.</p><p>Tolerated only for short periods of time as a necessary, though inconvenient, evil, men were banned from even living on the planet. It was imperative, then, that no one ever find out about Princess Kai, of the Royal Family of Scythia, second daughter of the High Queen Ashlan. Princess Kai hid a terrible secret from the moment of her birth. Princess Kai was a man.</p> <p>His mind distracted with these heavy thoughts, Kai walked resignedly into the dressing chamber to allow his body servants to assist him with the heavy ceremonial robes. The rich, purple robes the Scythian royal family wore to all state occasions were oppressive in the heat, but the wedding this day was that of the royal heiress to the throne, Princess Delanon, and would be a solemn and momentous occasion.</p><p>The heavy robes were good for one thing—hiding Kai’s shame. On Scythia, where males were considered defective and undesirable, the secret would surely mean imprisonmentor even death for Kai and his mother. While the queen was a powerful and respected monarch, the laws were quite clear on the subject. The only men or non-persons who were allowed to enter their world were traders or ambassadors from other planets, and then only temporarily.</p><p>The worst thing was that time was running out for Kai. His mother’s council was already urging her to find Kai a husband, and Kai was very afraid that when that time came, he was doomed. His sister, Princess Delanon, was already making plans to take over the throne from the aging queen. In their war-like society, the queen was expected to lead the army, and Queen Ashlan was far too old to go into battle. She would be stepping aside soon for the royal succession, and once Delanon became queen, Kai knew she would insist a consort be found for him immediately to get him away from Scythia.</p><p>Delanon’s wedding ceremony on this day was the first step in the process. Once a female child was born, Delanon and her consort would go their separate ways until such time, if any, as Delanon might want another child. The consort would return to his home planet in the meantime, and Delanon would be free to live her own life. The arrangement was mutually beneficial. The royal consort was well-compensated with a rich dowry, and it was common for male consorts to take love slaves when they got back home to satisfy their sexual needs outside the marriage. As for Delanon, she would have a girl child to rear who would one day, in her turn, become queen, and in the meantime she was free to take lovers of her own.</p><p>Kai was the queen’s youngest child. His sister, Delanon had been born a healthy, beautiful girl, the heiress to the throne, so another child was not required, but his mother had done something almost unthinkable in their culture. The warrior queen had fallen in love at first sight with her royal consort. After the Princess Delanon was born, the queen managed to visit her consort again and again, telling her advisors she was trying for another child. When she became pregnant for the second time, she was ecstatic, but her happiness was short-lived. Her beloved consort, Willon, was killed in a battle on his home planet of Alger.</p> <p>The queen was almost inconsolable with grief, and when her child was born a male, she was paralyzed by fear and dread. The child looked so much like his father that it hurt her heart to gaze on him, but neither could she bear to part with him. The idea of giving the boy child to the priestesses was unthinkable. Instead, since the hour of Kai’s birth, his mother concealed his gender by demanding that only she or the women of her chamber tend to Kai. It was almost unheard of not to hire a royal nursemaid, but she was the queen and her word was law. The women of her chamber were all fiercely loyal to their queen, and they agreed to keep her secret.</p><p>Her people whispered about her unnatural attachment to the child, but never to her face and never within her hearing. As Kai grew older, the queen warned him that it would be disastrous beyond measure for both of them should anyone discover Kai was a boy.</p><p>When it was time to show himself on the royal dais behind his sister, Kai remembered to make short steps like he’d been carefully taught, and keep his eyes demurely down. As a royal princess, he was carefully guarded, and he stood between two of the large women who were his personal escorts. Kai had taken after his father’s people, and he was even larger than the tall, heavily built Scythians. He was taller than both his mother and his sister, though his body was lean. His mother had long encouraged him to lift weights to develop pectoral muscles in his chest, to simulate the swelling of a woman’s breasts. The weights also kept his waist trim, so his chest and abdominal muscles were large and well-defined.</p><p>His undesirable genitals were a constant trial to him, and as they grew, it was getting harder and harder to push things between his legs and cover up the leftover bulges in his leggings. He bitterly resented having to live the lie, but it was all he’d ever known. He was also fiercely protective of his mother and would do anything she asked of him.</p><p>His sister, Delanon, came forward on the dais, wearing her diamond-studded crown. She cast a glance over at Kai and frowned. They’d never gotten along as he’d once longed to. She was jealous of the attention he was paid by his mother, not knowing the true reason behind it. Their mother had never trusted the envious child not to reveal the secret, and from the looks she gave Kai when she thought their mother wasn’t looking, Kai was only too glad she didn’t have that ammunition to use against him.</p><p>Her new husband, another prince of Alger like Kai’s father had once been, stepped up beside her for the formal vows. Kai was fascinated by him. Not because he was particularly good looking—the poor man’s teeth were too big and stuck out in front, and he had a little bald spot on the back of his head. But because he was a man, and Kai had never seen many men outside of a few pictures. When he turned to take Delanon’s hand for the final vows, Kai could see the large bulge in the front of his leggings, and he felt an odd little flutter down deep inside, one that shot straight to his own carefully strapped-down genitals, and made them ache a little. What in the world was that about?</p> <p>He’d been around females all his life in various stages of undress and had never been aroused before. Now, with just one look at his new brother-in-law’s large bulge, the long piece of flesh between his legs was trying to thicken. Thank the gods Kai was wearing his robes. Surreptitiously, he tried pinching his thigh really hard to keep his own flesh from swelling and hardening.</p><p>It had been happening more and more often since he was about twelve cycles, and recently it had been occurring almost every day—sometimes several times a day. He had disturbing dreams and often he would awaken in the mornings to find a sticky mess on his stomach. He never told his mother, but he worried that something was wrong with him. He squirmed a little in embarrassment, just thinking about it. He’d confided to Merrial, a servant who’d been with him since he was a baby, but she hadn’t been much help. She told him she had no idea what the substance might be, or why the flesh between his legs grew so rigid, but not to worry his mother with the problem. She had so much on her mind already.</p><p>Merrial had never had children of her own, and therefore she’d never seen a man naked. The laws of Scythia were so strict and narrow that even pictures of males in any state of undress were strictly forbidden. Punishments for infractions were severe, and few Scythians ever tried to circumvent this law. Really, most women had very little interest in seeing the male form anyway. It was whispered that there were deviants, of course, who seemed to like the men they mated with, but these women were cast out and forced to leave with their mates.</p><p>Their priestesses were quite clear on the subject. The goddess of their religion had forbidden love and affection between the sexes. She had been quite clear on that subject. Anyone who loved a member of the opposite sex was a deviant, plain and simple, and would be cast from their society.</p><p>His mother, the noble Queen Ashlan, had warned him never to reveal his true sex, as it was far too dangerous. It was said on his planet when a woman had a male child, which was roughly half the time, she had delivered a baby that was a non-person. This child would then be immediately turned over to the priestesses, who followed the ancient law and custom of re-assimilation of all non-persons born to Scythian women. According to their ancient beliefs, males had birth defects between their legs and in their brains.</p><p>In Scythia’s ancient past, most male children were simply cast off—except, of course, those kept as breeders—and sent to their biological father’s planet to be raised. Centuries before, however, men who had been cast off while children mounted a bloody rebellion against the Scythian monarchy.It had been a terrible, costly war, even though the rebels had eventually been defeated, and all the leaders executed. After that, it was decided that if these brain-damaged creatures were born to Scythian women, they would be handed over to the priestesses to be re-assimilated back to the goddess. They said the children were then reborn as females. It was supposed to be a quick and merciful process. Scythian males were too volatile, too unpredictable to be allowed to grow up.</p><p>Kai’s sister interrupted his daydreams by giving him an evil look that froze the marrow in his bones. He stopped fidgeting right away and cast his eyes back down, not wishing to get into yet another argument with her.</p><p>When the ceremony was finally over, he followed the crowd back into the banquet room for the wedding feast, wondering how quickly he could make an excuse to go back to his rooms. His mother caught his eye and motioned to him to come near. When he got close to her, she drew him aside, clearly excited about something, and Kai didn’t think it was only his sister’s wedding.</p> <p>“The matchmaker I hired has found you a match, darling. A husband!”</p><p>Kai felt the blood drain from his face and he staggered back a step. “B-but Mother, I-I can’t! What will he do when he finds out? He’ll send me back, or even get so angry he’ll have me executed.”</p><p>“He won’t do that,” she said firmly. “I’ve chosen carefully and had a wonderful stroke of luck. I’ve been looking for a chance like this ever since you turned sixteen. Thanks to the gods we finally have the perfect man.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“But who? Who is it?”</p><p>“It’s a powerful Lycan alpha. From the notorious—I mean, the famous Balenescu family. His people are pressuring him to find a wife so that he might have an heir to his kingdom, and he’s chosen you, darling.”</p><p>“What? B-But I can’t give him an heir!”Kai clutched at his mother’s arm. “Males are so violent. He’ll kill me when he finds out. I know he will.”</p> <p>“Calm down, sweet one.He won’t do that. First of all, the Balenescus are known for their generosity. Second of all,” she lowered her voice but still managed to sound absolutely delighted, “he likes men.”</p><p>“He does? More than women? But how is that possible?”</p><p>“Some men like other men more than females, darling. It’s just the way of the other worlds, and it’s this alpha’s preference. He’s only taking a female consort to satisfy his people and get an heir.”</p><p>“An heir? I can’t give him an heir!”</p><p>“Don’t worry, dear. By the time he finds out, you’ll be a long way from here, and his pride will prevent him from letting the secret get out. I’m sure of it. Anyway, he won’t be able to harm you when you’re so beautiful. I just know it.”</p> <p>“But what if you’re wrong, Mother? What if he’s angry because we tricked him?”</p><p>The queen got a look of unease on her face, but quickly covered it up with a bright smile. “That won’t happen, darling. After all, you’re of royal blood, and I’ve never seen a male more beautiful. No, I’m sure of it. He won’t be able to resist you. Now go over and find your table, and we won’t discuss this until later. We don’t want to steal your sister’s thunderclaps. The matchmaker said he’ll travel here in half a quarter-cycle’s time to meet you. It’s not much time, but we’ll make it work. Don’t worry about a thing, darling. Leave it all to me.”</p><p>Trembling with reaction to the news, Kai went back to the wedding feast and found his table near the front of the hall. He tried to eat some of the delicious foods that were offered to him, but most tasted like ashes in his mouth. Only half a quarter-cycle’s time until he went to meet what would surely be his doom. How could his mother be sure the powerful alpha wouldn’t kill him when he learned of the deception? His mother said she would take care of everything. Kai shook his head and sighed. That’s what got him into this mess in the first place.</p><p>Lycanus 3, 2257 CE</p><p>Lucas looked around his living room, which was currentlycrowded with five other big Lycan alphas—his brother and his cousins—the closest people to him in the galaxy, people he would give up his life for—and they were pissing him off. They’d arrived at his home over an hour ago, calling their visit an intervention. Bullshit—it was more like a trap, an ambush by the very people he trusted most. Lucas supposed they thought they were doing what was best for him, but he felt as if they’d put his back against the wall, and he was not happy.</p><p>“Just talk to the woman, Lucas. That’s all I’m asking you to do. She’s supposed to be really good at this. The best matchmaker in all of Lycanus.” His brother, Blayde, leaned toward him and put a hand on his shoulder. To his credit, Blayde only flinched a little when Lucas showed his teeth and growled at him. Then he grinned at him and slapped him on the back.</p> <p>Konnor spoke up from the other side of him. “Really, Lucas, getting mated is great, and you know how much I resisted it. I couldn’t do without Ethan now.”His cousin, Konnor had just been happily mated to a beautiful Lycan omega named Ethan. His mate was definitely sexy and desirable, and Lucas was happy for Konnor, happy for all three of his cousins who had recently found their mates. That didn’t mean he was in any hurry to join them.</p><p>For the past three months, his family had been urging him to get a wife. He’d had three challenges to his leadership in the last three months, and though he’d easily defeated each of the challengers, the disruptions to his schedule had been inconvenient to say the least. It had all started when three of his family members had found their own mates within a short period of time. The members of his pack started looking at him and wondering when he might find a mate.</p><p>Then a member of the council, a distant relative and a troublemaker named Boris, had begun running his mouth about the fact that their alpha preferred males.</p><p>“Even when he marries,” Boris said to anyone who would listen, “The union won’t produce any heirs. Our alpha needs to do the right thing and have children to carry on our ancient Balenesculine. If he refuses, then perhaps he just needs to step down, and let someone else in the family lead us.”</p><p>At first, no one had paid Boris much attention. Other alphas in the past had used surrogate females, after all, and Boris was known to be a meddler. Lucas was popular, and had been an excellent alpha for the pack. But as time wore on, and Boris got even more vocal, people began thinking perhaps it might be a good idea for Lucas to find a wife and settle down. The murmuring had grown louder and now recent challengers had come forth. His family had finally stepped in and come to see him to convince him to see a matchmaker and give the people what they wanted.</p><p>The three mated members of his family were the most vocal. Nikolai, mated to a handsome Jayronian prince, had tried to reason with him, and he started his arguments up again now.</p><p>“Look, Lucas, no one expects you to fall in love. But find a female and breed her. She’ll have the status of being the alpha’s mate, and of course, she’ll have the children, and then you can go on with your life. Find a male concubine for your personal pleasure, like Grandfather did. Maybe you’ll even find your true blood mate. Then you can have your cake and eat it too.”</p><p>“No fucking way,” Lucas said in a loud, firm voice. “First of all, that’s a disgusting idea. I would never hurt some poor woman that way. It’s dishonest and I won’t be a party to it. As for finding a male concubine, that’s pretty much what got our grandfather into so much trouble and started this whole curse we have to live with.”</p> <p>Nikolai’s great-grandfather, Gunnar, had seen a beautiful human woman on a voyage to Europa, one of the moons of Jupiter, and had taken her by force. The inhabitants of the moons of Jupiter had long been rumored to practice witchcraft, but Gunnar was unafraid and defiant. He wasn’t interested in the woman for himself—his preference was for handsome males, but the female Lycan who was his mate liked other females. He kidnapped the woman to give to his mate as a present. At that stage in their history, both male and female Lycans frequently took pretty humans as companions, or to help them raise their children. Sometimes they took them as concubines. In fact, Gunnar even lay with the woman at the same time he impregnated his mate, so that both produced sons, even though it was forbidden to use humans as breeding stock. But then the wild, handsome Gunnar had always operated outside the law. The human female produced a son, red-haired and handsome, half Lycan and half human. And though she eventually grew to love her Lycan mistress, the human female never made a secret of her hatred forGunnar.</p><p>On Gunnar’s second trip to Europa he kidnapped her handsome twin brother to be his own concubine. Not only was Gunnar intrigued by his beauty, but since his mate was now really more interested in her lovely human, he was free to indulge his own needs. He thought he would make an excellent concubine. When the authorities finally caught up with him, both human siblings had decided to stay with their Lycans.</p><p>The male, whose name was Ivan, was furious with Gunnar, but also fiercely attracted almost against his will. He was a warlock, but couldn’t bring himself to hurt Gunnar. It was said, though, he led Gunnar a merry chase the rest of their lives. He’d even cursed all of Gunnar’s offspring. All of them would be males, he said, and all alphas. It was well known that alphas had great difficulty living together in harmony, so he had, in effect, ensured that all of Gunnar’s offspring would be at each other’s throats. In addition, and maybe because Gunnar left him alone so often to voyage around the galaxies, Ivan cursed them to fall madly, irrevocably in love while still very young, and never be able to be without their mates.</p><p>Lucas jumped to his feet and began pacing like a trapped animal. “I don’t want to meet any damned matchmaker and I’m not getting married—to anybody. And that’s that.”A small, soft voice by the door stopped him in his tracks.</p><p>“Oh, I do hope that isn’t your final word, Alpha. I did so wish to help you, but it’s all right. I’ll just go back home and tell the bank that they’ll have to go ahead and foreclose on my little home.”</p><p>Lucas whirled around in confusion and found the tiniest and quite possibly the oldest Lycan female he’d ever seen in his life standing just inside his front door. She had a black shawl wrapped around her shoulders and draped over her white hair, though how she could stand it in the ninety-degree heat outside the house was anybody’s guess. She leaned heavily on an ornate black cane as she tottered into the room. Her skin was as dark and wrinkled as the prunes his grandmother’s human concubine used to eat to aid in her digestion. Konnor scrambled to get up off the sofa and give her his seat. She gazed up at him as if he’d just offered her rubies and pearls, and dropped onto the sofa, sitting back with a tired little sigh.</p><p>“Thank you so much, dear. My poor old legs aren’t what they used to be, I’m afraid. And then, too, there’s my back. The doctor said if I could afford the operation, it might help, but otherwise, I’ll be completely crippled soon.”</p><p>Lucas looked down at his feet and shifted uncomfortably. “I...uh...of course, we’ll pay your fee, Mistress uh...”</p><p>“Mistress Katya. And thank you, dear, but I’m afraid I do have my pride—it’s all that’s left to me now. No, I would gladly take the fee if you had allowed me to help you, but if you won’t...” Her voice broke off tragically with a little sob, and she gave a tremulous sigh. Five pairs of eyes belonging to his family glared at Lucas at the same time. Blayde leaned over again and whispered in his ear. “Gods, Lucas. How can you be so cruel? She really needs the money.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucas whipped his head around and glared at his brother, fiercely whispering back. “I didn’t bring her here under false pretenses. You bunch did. You can just tell her now that you made a mistake. I won’t be bullied into this.”</p><p>“Oh dear, I hope you don’t think I’m trying to bully you.”</p><p>Lucas glanced back around at her with surprise. For a woman as ancient and wrinkled as the matchmaker appeared, there certainly wasn’t anything wrong with her hearing. Before he could reply, she pulled a tiny scrap of lace from her bag and started dabbing at her eyes with a gnarled hand. “I’m sorry,” she sniffled. “I don’t mean to get so upset. It’s just that it was such a long way to come, and then to find out you didn’t need me after all...that you don’t even w-want me.”Her little bosom heaved up and down as she covered her face with the handkerchief.</p> <p>“There, there, Mistress Katya, please don’t cry.” Nikolai, Lucas’s cousin jumped to his feet and patted her awkwardly on the back. The difference between his huge form and the little woman’s was so remarkable. He looked a bit like an organ grinder with his little monkey. Nikolai looked up at him pleadingly. “Just hear her out, Lucas. It’s the least you can do.”</p><p>Lucas looked from her to the accusing glares of his family and heaved a sigh. Throwing himself back down in his chair, he admitted defeat. “All right, I give up. Go ahead, Mistress Katya. Tell me what you want me to do.”</p><p>Springing to her feet like a woman half her age, she advanced quickly on him, pulling a small comp-pad out of her voluminous bag. She flipped it open and shoved it in his face. “The minute your brothers contacted me, I made inquiries on your behalf, and I’ve already found the perfect match for you. This is the female I’ve chosen for you. Isn’t she lovely? A royal, too, dear. She’s from the planet Scythia in the Andromeda system. All the warriors on this planet are female. In order to have children, they usually have relations with male warriors from a neighboring planet called Alger, but there are currently no Algeran princes available. This is a rare opportunity to mate with a Scythian. They’re a very private people, and almost never interact with outsiders, unless they are trying to forge an alliance. When the children are born, they keep only the females, and raise them in agricultural pursuits, or to hunt and be strong warriors.”</p><p>“What about the boys?” Nikolai asked, peering over Lucas’s shoulder.</p><p>“The boys are—rejected. Anyway, this beautiful female is named Princess Kai. She’s the second daughter of the Queen Ashlan, ruler of Scythia. Second daughters don’t inherit the throne, of course, so they find husbands for them. As I said, such royal marriages are with powerful kings or leaders, like you, Alpha, who can make astrong ally for her planet. The Balenescu name is legendary, even in Andromeda, so the queen is most anxious to make this match.”</p> <p>“She is, is she?” Lucas grumbled. “What about her daughter? What does she want?”</p><p>“Princess Kai will be only too happy to be the mate of a powerful alpha such as yourself. She is most willing to do her duty to her family.”</p><p>Lucas gazed down at the picture and felt a tiny flutter of something in his stomach. It must have been something he ate that disagreed with him. No way was he interested in a female, no matter how beautiful she might be. The woman in the picture had long brown hair and beautiful golden brown eyes, fringed with long lashes. Her nose started out straight, but turned up ever so slightly just at the tip, making her look young and vulnerable. Her lips were almost sinfully full and luscious. All in all, she was a beautiful woman—if Lucas had been into women.</p><p>“I don’t know, Mistress Katya. Does she and her mother know I prefer males? I could try to get an heir, but that’s about it. I doubt I could satisfy her. Hell, I don’t even know if I’d be able to do anything.”</p><p>Nikolai leaned over his shoulder. “She looks like a big girl. Maybe she could be in charge. She could use a strap-on,” he said helpfully. “Then you could just close your eyes, lift your legs and think of Lycanus.”</p><p>“Shut up,” Lucas said, cuffing his ear.</p> <p>Mistress Katya folded the comp-pad and slipped it back in her pocket. “Leave everything to me, Alpha Lucas. I’ve already arranged the meeting—just in case you did say yes,” she said at his outraged look. “Then if both of you are happy, we can arrange the immediate wedding and you can bring the princess back home to Lycanus 3.”</p><p>Lucas frowned, not overly thrilled with the prospect of bringing a female to his home. Unlike the rulers of other planets, Lucas lived modestly in a large, well-appointed home, but it wasn’t a castle or even a mansion to be sure. He could ensure she had her own room, maybe even her own servant, but that was about it. He wondered what this unknown girl’s life was like. Was she used to luxury? Did she wear silks and furs? What would she expect of him? He didn’t know much about satisfying a woman.</p><p>Could he make her happy here on Lycanus 3? It was beautiful to him, but he wondered what it might look like to an outsider. Most of the habitable portion of the planet was desert, dotted with huge volcanic rocks. The Lycan settlement was like an oasis in the middle of the vast desert, and the Lycans mostly worked in the mines. One of two sister planets to the home planet of Lycanus, Lycanus 3 was the site of one of the largest bauxite mining operations in the galaxy. Bauxite was used in the making of aluminum, and in the manufacture of space ships and space ports. The mines on Lycanus 3 had become as valuable as the diamond mines on the home planet.</p><p>The Balanescu family had ruled the planet for many centuries. Since so much of the planet was uninhabitable, not that many people actually lived there, though it teemed with visitors. Most of the ones who did live on Lycanus 3, including Lucas, lived in Balenescu City, a thriving little metropolis filled with trading posts, restaurants, bars and of course, hotels, to house the many visitors who came to the planet to trade for bauxite.</p><p>Lucas was wealthy, and could provide this princess with riches, if that was what she wanted. What he couldn’t do was love her, though he hoped they could come to like and respect each other. He would certainly try. He could buy her a male concubine, if that’s what she wanted, to keep her happy and satisfied. He sighed. They would both do their duty. He only hoped it would be enough.</p><p>“All right,” he said, his voice heavy with reluctance. “Since you’ve arranged the meeting, I’ll go. But just be sure she knows exactly what she’s getting herself into.”</p><p>Scythia, 2257 CE</p><p>Kai paced up and down in his chambers, his palms sweaty and his heart racing out of control. The Lycan contingent had arrived. Merrial had come rushing in to tell him, and his mother had sent word that the delegation would be meeting with her to sign the necessary agreements in the reception room. Merrial had been sent to get him ready to meet the man who would become his new husband. She was rushing around behind him now, throwing silks wraps and robes on the bed, trying to find something suitable for him to wear.</p> <p>“I think this blue silk would be lovely, don’t you dear? Men seem to like blue, or so they tell me, and it would go well with your coloring. Hurry, Kai, stop daydreaming. We need to get you in the bath.”</p><p>“Daydreaming? More like a waking nightmare, Merrial. ”He stopped his pacing and gazed up at the ceiling. “Gods, why did I let my mother talk me into this?”</p><p>“Because you had no choice in the matter, dear. I know your mother. A wonderful queen, but she is an unstoppable force. She’s taking a terrible risk in doing this, you know.”</p><p>Kai gave her a sharp look. “A risk? What do you mean?”</p><p>“The Lycans are known to be very important members of the Planetary Alliance. It’s a powerful group that governs the galaxies. Surely your tutors taught you about the Alliance?”</p><p>Kai shrugged. “A little. I know that they made universal laws for all the planets that belong to it. We’re in the Alliance, but very small and out of the way, so they don’t pay us much attention.”</p><p>“Yes, and some of our ancient ways would be...let’s just say frowned upon by the Alliance. If they knew about certain things, they would be most unhappy. They could even arrest your mother.”</p><p>“What? Arrest the queen? How dare they?”</p><p>Merrial patted his shoulder. “Don’t you worry your pretty head about it, child. And don’t tell your mother I even mentioned any of this to you. The royal children are always to be sheltered from the outside worlds. Come now, let’s get you ready. Now that Delanon is wed and trying to have a child, it’s even more urgent that you leave Scythia. If she ever discovered your mother’s long-ago deception, she’d be furious. She might take it as some kind of threat to her own succession. ”</p><p>Merrial was busily undressing Kai as she spoke and pushing him toward the bathing chamber. “No, dear, it’s far better to leave this planet and get as far away as possible from Delanon. You’ll just have to keep quiet about our ancient customs, and never, never let the Lycans know.”</p><p>“What do you mean?”</p><p>Merrial lowered her voice. “The male children, Kai. The Alliance must never know what happens on Scythia to the male children. Such things are strictly forbidden by Alliance law. They would punish our planet severely.”</p><p>Kai’s mouth fell open. “They would punish my mother?”</p><p>“Yes, darling.So you see why you must keep our secrets. Whatever the handsome alpha does to you for tricking him will be far better than what the Alliance would do to our planet or what Delanon would do to both you and your mother if she ever finds out.”</p><p>Kai was quiet for a moment, thinking over what she’d told him. He wished he had more education and hadn’t been kept so totally in the dark by his tutors. On Scythia, the royal heiress was given a good education, but the second or third royal children were considered to be little better than bargaining chips. They existed only to forge important alliances with other worlds through marriage. They were kept as ignorant of worldly matters as possible, the council believing their child-like innocence increased their value. “Handsome alpha? Have you—have you seen him then?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kai climbed over into the tub and began to use the sweet scented soap Merrial handed him. He refused to be bathed like a child, but Merrial still insisted on standing by to hand him things and help dry him off. She firmly declared it to be her job, and he didn’t want her to be fired, did he? She stood now holding a towel with a huge smile on her face.</p><p>“Is he handsome? Oh goddess, Kai, I’ve never seen any male better looking. Not that I’ve seen many outside of pictures, of course. He’s so tall, even taller than you, with big muscles. He has dark hair and strange, glowing red eyes, but they’re most compelling. A handsome face too, with high cheekbones and those lips. My old mother used to say to watch out for the ones with the plump bottom lip—they’re supposed to be very passionate. He’s all male, that one. I never had a male, myself, but if I had to have one, he would be the one I’d want.”</p><p>Kai pressed his fist against his stomach where the butterflies were dancing madly. “He’ll know the minute he sees me, Merrial. He’ll know I’m not a woman. Dear goddess, what if he says something in front of the council?”</p> <p>“Oh stop your worrying. He won’t know. How could he possibly know just by looking at you? All the Scythian women are tall with broad shoulders, after all, and you have a beautiful face. Just don’t say much to him and keep your head down.”</p><p>Since Kai was old enough to understand, they’d been telling him much the same thing. Believing him to be slightly brain damaged, they tried to protect him as much as possible, and always keep him calm and non-aggressive. They taught him to pretend to be a female, to walk and talk and act like one. The women of his planet were warriors and hunters, fierce and muscular, so no one thought it all that strange that Kai was strong and athletic and grew to have a warrior’s physique. Another saving grace was that Kai had long, beautiful eyelashes and full lips, and his hands and feet were small for a Scythian and almost delicate, so it wasn’t difficult to pass him off as a real person. The women showed him when he reached puberty how to dress himself to conceal his birth defect. By wearing high collars and by strapping and arranging his genitals in such a way that there was no tell-tale bulge between his legs, he’d managed to avoid detection. Most fortunate of all was the fact that his father’s people had almost no hair on their bodies and even their beards were sparse. Kai took after his father in this way, and thus saved them all from discovery. When a few hairs came in his upper lip and his chin, they were plucked with alacrity and the secret was safe.</p><p>Kai sighed heavily as he finished rinsing off and stood up to step from the tub. Merrial handed him a towel and then bustled around finding his hair brushes and combs for him to make himself presentable. When he’d finished, she brought him the straps to secure his genitals and a pale blue shift and robe for him to wear, along with matching slippers. When he was dressed, he turned to her and sighed. “I guess I’m ready.”</p><p>She pointed to the counter. “Lip gloss.Eyeliner.”</p><p>“No, Merrial, let him see me as I really am. I can’t be a party to tricking him any more than we already have. I won’t wear cosmetics, and that’s that.”</p> <p>Merrial folded her arms and tapped her foot on the floor. “All right.Send your poor mother to prison. Maybe they won’t execute a woman of her age.”</p><p>“Merrial,” Kai groaned.</p><p>“No, no, you’re right. Let the dungo fall where it may. Of course the council will know she couldn’t have kept this secret all alone, so your servants and most of hers will no doubt be arrested along with the two of you. You’ll be all right. You’ll simply be re-assimilated back to the goddess, but the rest of us! Our lives will be forfeit as well. But by all means, keep your conscience clear.”</p><p>Since he was seventeen, Kai had his own servants, handpicked by his mother, and all of them were either her former women or closely related to them. Their loyalty was above question.</p><p>Kai glared at Merrial and snatched the lip gloss from the counter, smearing it angrily and haphazardly across his lips. Merrial gave a little cry of displeasure and found a tissue to wipe it back off, and then grasped his chin in her hand while she carefully reapplied the pink gloss. Kai held still, but blew out one impatient breath after another as she applied the eyeliner next. Finally, she had him ready to her satisfaction and patted his cheek fondly. “You’re such a sweet child, despite your little fits of temper. Your alpha can’t help but love you.”</p><p>“Hmmph!” Kai grunted and strode away from the chamber on his way to the reception hall. Merrial ran along behind him, fretting.</p> <p>“Not such big steps,” she whispered fiercely. “Slow down, Kai, remember you’re a royal princess. They’ll wait for you.”</p><p>Kai paid her little mind as he strode furiously down the hallway. Brushing past the guards who looked at him with surprise, he flung open the door and stopped dead still in the doorway. Standing beside his mother, head bent a little as he listened carefully to what she had to say, was the most magnificent man Kai had ever beheld. Admittedly, he hadn’t beheld very many, but surely there were no more beautiful creatures to be found in all the galaxies. The man was, at least, a head taller than Kai’s mother. His hair was thick and dark, but cut short on the backs and sides. A few curly strands fell over his broad forehead as he tilted his head down solicitously toward the queen. His shoulders were broad and muscular, and when he looked up as Kai entered, his eyes were the most remarkable shade of burgundy, like the skies in the north at night when the twin suns set.</p><p>The alpha was surrounded by several other large males, surely Lycans as well, almost as imposing as the man standing by his mother, yet Kai only had eyes for this one man. In his heart, Kai knew this must be his Lycan. Furiously, he tried to remember what they told him his name was, and at last he came up with it—Lucas. Lucas Balenescu. What a noble-sounding, regal name.</p><p>Kai felt Merrial poke him with her elbow, and he started forward, remembering to take careful, small steps. He lowered his eyes as he got close to Lucas, because by now the Lycan had turned his gaze on Kai fully, and his close regard was taking Kai’s breath away. He stepped forward, holding out one big hand as Kai got closer to him. Kai reached out to take it and that’s when it happened.</p><p>The second Lucas’s fingertips touched Kai’s, a jolt of pure electricity seemed to jump from his body into Kai’s. Both of them gasped and the alpha literally reeled away from him, falling back into one of his companions. Kai heard him cry out, and would have cried out himself from fear except for the fact that the lightning bolt that struck his fingers had traveled up to his head and then shot back down to the thing between his legs, which unaccountably made his knees so weak he sank to the floor. Merrial’s arms went around his waist to support him, and he glanced up at his mother in horror. The queen rushed over to him and knelt beside him.</p><p>“Don’t worry,” she murmured to him. “I’ve heard about this. If this is what I think it is, there’s nothing to fear—in fact, we can rejoice, because this means you are his true mate, his beloved, and there can never be any other mate for him.”</p><p>“Whatever it was, I felt it too. It was like an electrical charge.”</p><p>His mother laughed delightedly. “That means the match is very strong. He won’t be able to resist you.”</p> <p>“But-but I thought...”</p><p>“Shhh...” his mother cautioned him. “Say nothing. Let me handle everything.”</p><p>The queen sprang to her feet, and turned her steely gaze on the Lycans grouped together around their alpha. He had already recovered and was pushing them all away, protesting that he was fine. He pulled away from the one standing closest to him and brushed past Queen Ashlan to where Merrial was helping Kai get to his feet.</p><p>He fixed Kai with a burning glare that swept over him from his head to his feet. “What-what in all the worlds are you?” he asked softly.</p><p>Chapter Two</p><p>A stunned silence fell over the assembled council members. Queen Ashlan gasped, glancing over at the council as if to gauge their reaction to his softly murmured words. From the moment he’d touched her, he’d known she belonged to him. Against all odds, he had found his true mate—in a female. But how could it be possible? He’d never before been attracted to a female—he found them pretty and even charming, but no female had ever stirred him sexually. His previous sexual partners had all been male, and indeed, even Ivan’s curse had foretold that all the alpha descendants would prefer other men. His own father and his uncles had to use surrogate females for their offspring.</p><p>This beauty before him had almost made him lose all control, and he hated that feeling. It was a weakness that he couldn’t allow in himself. The moment he touched Kai, such strong surges of possessiveness swept over him that he could barely stop himself from wrapping his arms around her. The word mine seared through his brain and he felt his incisors drop from his gums, and his claws tingled in his fingertips.</p><p>When he’d fallen back into Blayde’s arms, he heard Blayde whisper, “Oh gods.” Blayde had been the first of the alphas to find his mate, and Lucas knew he well remembered what that looked and felt like. Blayde would have recognized the overpowering instinct to rut with a mate, and his fingers had tightened on Lucas’s biceps. “Hold on,” he’d said, leaning down and putting his mouth against Lucas’s ear. “You’ll hurt her if you approach her like this.”</p><p>Lucas nodded, shaking his head in an attempt to clear it. “I know,” he growled. Finally forcing his incisors up, he took a deep breath and looked back over at the princess. He saw the beautiful, tempting Kai clutch her chest. He instantly regretted the harshness of his words if they brought such pain to those already sad brown eyes. “I-I mean, I’m sorry, Princess, if I startled you.” He managed a very creditable bow. “Your great beauty distracted me.”</p><p>Kai inclined her head, dropping her eyelids over those incredible eyes, and her mother, the queen, seemed to heave a sigh of relief. Perhaps his strange reaction had made the queen think he was rejecting Kai. Nothing could be further from the truth. Now that he’d seen Kai, touched her, he could never be parted from her, no matter what. He would fight any man or woman in this assembly who tried to take Kai from him. He no longer had any fears about being able to get it up for her, either—he was hard and aching for her even now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The queen rushed over to him and took his arm, drawing him back toward the council table. “Why don’t you sit down, Alpha Lucas, and have refreshment? Kai, darling, come and sit next to your future husband.”</p><p>Kai came forward slowly, as Lucas carefully watched every step she took, clenching his fists to keep from going to her. When she reached them, he couldn’t stop himself from taking her arm possessively. Another jolt ran through him when he touched her, not nearly so strong this time, but strong enough to make him hiss in a breath. He gave a little cough to try hiding it, and pulled her close by his side. Only when he had her close to him like this did his wolf subside a little, calming back down because its mate was close and under his control. They followed the queen back to the long table where the council members were seated, but instead of joining them at the far end of the table, he sat down among his family members, with Kai at his side. Only then did he begin to feel more comfortable.</p><p>For his mate’s part, she was wide-eyed and looked a bit frightened—not surprising, considering she was surrounded by the six huge Lycan alphas. She was tall herself, like all the Scythians, but she lacked the bulk of the Lycans. She was far more delicate, though from what he could see of it through the robes she wore, her body was beautiful. Lucas looked around at his brother and cousins and saw them giving Kai surreptitious looks of admiration and even lust. So they felt it too, though the expressions of wanting on the faces of his unmated cousins caused him to feel even more aggressive. He stretched an arm around the back of Kai’s chair and gave each of them a menacing look. Konnor laughed and shoved an elbow into Kyle’s side. Kyle had the good grace to look guilty and stare down at his plate.</p> <p>Servants brought out food that Lucas was unfamiliar with, but he sampled each of the dishes they held out to him. “I do hope you enjoy the wild gallion, Alpha. Our hunters are quite skilled. Kai herself killed this one in preparation for this feast.”</p><p>“Is that so, Kai?” he asked her quietly. “Do you enjoy hunting then?”</p><p>“Yes,” Kai answered softly. Her voice had an odd pitch—not unpleasing, but husky and soft.</p><p>When she didn’t elaborate, he tried again. “Crossbow? Or do you use other weapons?”</p><p>“We use bows, your majesty.”</p> <p>Nikolai laughed shortly. “We don’t use the fancy titles on Lycanus, Princess Kai. Just call him Lucas.”</p><p>Kai flushed and nodded. Lucas found her icy cold hand under the table and squeezed her fingers. She looked up at him in surprise and gave him the first genuine smile he’d seen from her. It was breathtaking. The smile twisted up her bow-shaped lips and lit up her golden brown eyes. The half-hard erection that remained from their first encounter became rigid again.</p><p>Lucas hardly knew what he was eating, but it all tasted delicious, and he wondered if Kai would like the Lycan food as much. Things would be so different for her on Lycanus 3. He spent a great deal of time at the mines, overseeing the operation, and he wondered what she might do to fill her days. Now that he knew she liked hunting, he could arrange an occasional excursion for her to the mountains, not far from Balenescu City. The forests there were teeming with game. He thought he might put up some targets on his property too, so she could practice with her bow. His mind was so filled with possibilities, Larssen had to say his name twice to get his attention.</p><p>“Lucas. Did you hear me? The queen said there’ll be dancing after supper. What are you going to do?” It had long been a running joke how badly Lucas danced. A large man, he still managed to move gracefully, except when it came to dancing. On the dance floor, he definitely had two left feet.</p><p>“Don’t worry about me, Larssen. I’ll sit here and talk to my fiancée.”</p><p>“And miss out on a chance to hold Kai in your arms?” Larssen shook his head. “Lucas is getting old—definitely getting old.”</p> <p>“I’ll show you who’s old, boy...” Lucas said leaning over in front of Kai to snarl playfully at his cousin. When he did, Kai’s strong scent assailed his nostrils. There was something—not quite right about it. Underneath the oils and perfumes he could detect Kai’s own delicious, clean odor, but it didn’t strike him as female. He leaned back and gazed thoughtfully at Kai again. Her hands were small, even delicate compared to Lucas’s own, but her jawline was firm and strong. Despite the beauty of her lips and eyes, she had an androgynous vibe that disturbed Lucas.</p><p>He wondered fleetingly if that could be the answer to this mystery of why he was so attracted to a female. Some planets he’d been to in his travels had three sexes, male, female and intersex, who were some combination of male and female. He dismissed the idea almost at once, though. He’d never heard of it on Scythia before, and their laws and customs were known to be conservative and very narrow-minded. Certainly word would have gotten back to the Alliance if one of the royal daughters had been intersex. The queen might have even asked for Alliance protection for her child. No, that couldn’t be it, yet there was something different about his mate, and he was determined to find out what it was.</p><p>It would make absolutely no difference in the possessiveness he felt for Kai. He would be leaving here with her, no matter what. But Lucas hated a mystery, and vowed to get to the bottom of this one.</p><p>The queen stood up to announce the musicians and Lucas applauded politely along with everyone else. He was surprised to feel Kai’s soft breath along his cheek. Leaning close to him, she whispered. “I really don’t mind about the dancing. I don’t like it much either. ” Her delectable scent wafted over Lucas again, making him feel a little light-headed.</p><p>He turned his head and found those soft, bow-shaped lips just there, only inches away. All he had to do was lean slightly forward and...</p><p>“Alpha Lucas?” Queen Ashlan said. “Would you and Kai lead out the first dance for us, please?”</p><p>Ignoring the muffled laughter coming from his end of the table, Lucas arose and held out a hand to Kai. He noticed right away that she was trembling, and he thought she must be shy. “Come Kai, let’s get it over with, and then we can find a quiet nook to talk and get to know one another.”</p><p>Kai nodded and Lucas led her to the floor. The top of her head came just past his chin, and their bodies fit together perfectly. She slid her arms around his neck and he pulled her close to him. Kai’s body felt wonderful against him, both leaner and harder than he would have thought. He knew she was active and athletic, as all the Scythians were, but he had no idea she’d be so muscular, without the soft, feminine curves of most females. She felt perfect to him, yet when he lowered his head to her neck, he was overcome again by her unique scent. There was something else in the scent that he thought he might recognize, a slight smell of arousal that reminded him of something. Hells, it smelled like—pre-cum. That was impossible—or was it?</p> <p>Seized by suspicion, he decided he’d get to the bottom of this mystery one way or the other. He pressed his body to hers, but felt no tell-tale bulging. When she felt him pressing against her, she tried to angle her body away. Was that because of modesty, or some elaborate subterfuge?</p><p>The two of them didn’t do a lot of dancing—mostly they stood in one place and swayed to the music, but it seemed to satisfy the onlookers, and soon other female couples of Scythia joined them on the dance floor.</p><p>As soon as he finished one dance, Lucas led Kai from the floor, whispering to her. “Let’s see if we can find somewhere quiet to talk.”</p><p>Kai indicated a balcony on the side of the large reception room. “We could go there, if you like,” she said in her soft, almost whispery voice.</p><p>Lucas took her hand firmly in his and moved through the dancers toward the door. He caught Blayde’s eye. A nod and a silent message passed between them, and Blayde stood up to station himself by the door to make sure they weren’t interrupted.</p><p>Lucas led Kai outside to the balcony railings. They were on a top floor of the castle, so a large courtyard sprawled out almost four stories below them. Above, Scythia’s moon hung in the sky like a golden lantern, not as big as the moon of Lycanus 3, but still exerting its arousing influence on Lucas’s wolf. He could feel its restlessness inside him. Lucas looked down at Kai, and then nervously away. He didn’t quite know how to broach his suspicions with her. He had no wish to insult her, but something was very wrong, and he needed to understand what it was.</p><p>She was shifting nervously from foot to foot beside him, so he turned to her and took her hand in his. “Princess Kai, I don’t wish to seem insulting, but something is—not right. Please, Princess, tell me what it is. ”He softly repeated his earlier question. “What exactly are you, Kai?”</p><p>A sudden intake of breath was the only indication that she’d even heard him. A long moment passed and Lucas began to think she wasn’t going to answer him. Her shoulders slumped and she turned slowly toward him. She looked deep into his eyes and there was an expression of bleak sadness in her own. Speaking in a deeper, much more masculine voice, she heaved a sigh and said, “I think you must already know what I am.”</p><p>Fury swept over Lucas so rapidly and overwhelmingly that his hand shook with it. This was a male in front of him. It was so obvious now that he was amazed—and furious—that he’d been fooled for even a moment. Kai’s eyes were pleading with him, but all Lucas could focus on was the deception. These people had taken the Lycans for fools, and tried to trick them. He was so completely angry, his hands shook, and his wolf leaped forward, uneasy and restless.</p><p>“You son of a bitch,” he said, keeping his voice soft, but the look on his face must have been menacing. Kai took what looked like an involuntary step backward. Almost immediately, he seemed to gather himself. His entire façade changed as if someone had flipped a switch inside him. His body tensed, becoming harder and more aggressive. His golden brown eyes turned dark and hard.</p><p>“It wasn’t meant to harm you.”</p><p>“Fuck that,” Lucas snarled, taking a step toward him, stalking him. “What the fuck does that mean? You and your mother and your council set out to trap me—to trick me and make a fool of me. How could that not harm me? They were going to foist you off as a female—and you...” Lucas paused, his voice trembling with rage, “You went along with it, pretending to be a woman.” He let his gaze travel up and down him. “What’s wrong with you?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Since Kai was a child, he’d had to maintain a great deal of willpower and self-control to keep up this mask he was made to wear. From the time he was aware enough to realize that he wasn’t female, that he was different from everyone else around him and a non-person, he’d had to struggle to hold onto the tatters of his self-esteem. He had to try not to loathe himself, and that was still something he still struggled with. His entire society thought of men as defective, as less than a female, and over the years, this attitude had taken its toll.</p><p>Feeling neither fully male nor female, he struggled with his identity, and now here was this powerful male, this man who fascinated and attracted him, one who was fairly dripping with testosterone, insulting and accusing him. Partly, at least, it seemed the alpha held him in contempt because of the clothing and makeup he’d been forced to wear.</p><p>The unfairness of it all rushed through him in a torrent of rage. Kai’s usually impressive control over his temper snapped, and he put a hand on the alpha’s chest and pushed him violently away. Lucas staggered back a step or two and looked at Kai with surprise before moving toward him so quickly, Kai never even saw him coming—just a blur of movement and then he was on him. He was just there, with his hand around Kai’s throat, pushing him roughly back against the castle wall and leaning down into Kai’s face. He wasn’t exactly hurting him, but exerting enough pressure to keep him still.</p> <p>His other hand moved down between Kai’s legs and he parted his robes roughly, throwing them aside to put his hand at Kai’s groin. Feeling the leather straps there, he cursed in some other language that Kai figured was Lycan, and took his other hand away from Kai’s throat to rip open the pretty blue robe and undershift he wore from the neck down. He looked down his body to the strap that fastened around his waist and cursing again, he unbuckled it and threw it to the floor.</p><p>Released from their prison, Kai’s genitals fell down between his legs and even Kai could smell the arousal. He looked down at the long piece of flesh between his legs and was horrified to see it thicken. A white drop appeared on the head and Kai bit his lip, moaning in embarrassment and shame.</p><p>Lucas glanced down at it and back up to his face. Then deliberately, he wrapped one big hand around it, his thumb softly stroking the mushroom-shaped head, smearing the drop over the top. No one had ever so much as touched him there that he could remember. His genitals had always been an object of shame, and an outward sign of his inferiority. He could only gasp for air like a landed fish as Lucas moved his hand over the silken flesh.</p><p>“You like that, don’t you? Tell me how much you like it, Kai.” Lucas’s voice was gruff and hoarse with some strong emotion, but Kai moaned and pushed at his chest again, throwing him off. Lucas growled and for a moment something peeked out of his eyes that frightened Kai. Lucas thrust Kai back against the wall again, shoving him hard and pressing his body back against Kai’s.</p><p>Unprepared, Kai’s head slammed back, almost stunning him for a moment. He quickly recovered and lifted a knee to jab it into Lucas’s groin. The alpha’s reflexes were quick, and though he twisted his body at the last moment, Kai still inflicted a little damage. Lucas gasped and winced, hunching his body over for a few seconds and breathing hard. His hand around Kai’s throat, though, never loosened its grip.</p> <p>Kai drew up his knee again, but this time Lucas was ready for him. He shifted away, and Kai’s knee landed on the side of his hip. Lucas bumped his head into the wall again, and this time, Kai saw stars dancing in front of his eyes.</p><p>He let his legs collapse under him, and Lucas, startled, pulled his hand away from Kai’s throat to catch his biceps and hold him up. Kai straightened and caught Lucas on the chin with a quick left hook. Staggering backward, Lucas shook his head, making a little huffing sound. He lowered his head and plowed into Kai before he could dance out of his reach, shoving him back against the wall. He didn’t really hurt Kai, but his shoulder caught Kai in his solar plexus and knocked the breath from his body. Kai hung from the wall, gasping, and Lucas took him by the shoulders, holding him in place and staring into his eyes.</p><p>“You done?” he snarled breathlessly and Kai nodded shortly, struggling to take in a breath of his own.</p><p>Lucas stared down at him another few seconds before he loosened his grip. Kai knew he was only toying with him, and that his strength was much greater, but Kai was fighting for his life. Even though it was probably too late, he couldn’t seem to make himself stop. He kept his head lowered, wanting the alpha to think he was finished and presented no further threat. His stomach and chest were aching, not to mention the pains in his head. He thought he felt blood trickling down the back of his neck from his scalp. Lucas was obviously much stronger than he was, but some sense of pride wouldn’t let Kai quit. The man already had no respect for him, and Kai couldn’t live with that. As soon as Lucas shifted his hands, Kai stomped down on the alpha’s foot as hard as he could. He was wearing soft slippers, so he mostly managed only to hurt his own foot, but it must have surprised Lucas because he shifted backward, allowing Kai to make a break for the door.</p><p>Kai made it about three or four steps before his feet were knocked out from under him and he crashed to the floor of the balcony, on his back and looking up at the stars. He sensed more than saw Lucas’s big booted foot coming toward him and rolled out of the way, catching only a part of it on his hip. He scrambled back to his feet and only barely managed to miss another kick at his ankles. He backed wildly away and felt the balcony railing at his back. Off balance, he tried to catch himself, but still felt his feet go out from under him. As he fell helplessly backward off the rail, a big hand hauled him back upright and set him on his feet. Lucas’s face pushed down into his, and his body plastered itself to him.</p><p>“Don’t fucking move, boy, or I’ll hurt you.”</p> <p>“Hurt me?” Kai huffed out a short, harsh laugh. “You’ve damn near killed me as it is. Go ahead. They’ll finish the job anyway.”</p><p>Lucas narrowed his eyes. “Who? What the fuck are you talking about?” His hand clutched the front of Kai’s robe, and he used the grip to haul him only inches from his lips. He shook Kai slightly. “Tell me.”</p><p>“The council doesn’t know. When they do...”</p><p>“Then what?” Lucas shook him again. “Tell me, damn you.”</p><p>“They’ll arrest my mother and re-assimilate me.” He glared up at the alpha. “Isn’t that what you want? Go ahead. Get it over with.”</p><p>Lucas frowned and straightened slowly, pulling Kai with him. He put Kai back on his feet and glared at him for a long moment. “How could that be possible? What do you mean re-assimilate you? What the hells does that mean? The council surely knows about this trickery. You and your mother almost pulled it off too.”</p><p>Kai stared at him silently. He would say no more, and he’d probably already said too much. He raised his head hopelessly and stared into implacable dark eyes. He had to try to save his mother. He had failed her, and the poor women like Merrial who tried to help him all his life would be imprisoned along with her. He felt an almost crushing guilt. “Just...just please don’t blame my mother. It was all my fault. I did it. She just went along with it for me, but it was my idea. I-I know you don’t owe meanything, after all this, but please. ”He took a deep breath, wincing as his ribs protested the move. “Please don’t blame anyone but me. I beg you.”</p><p>Lucas continued to stare down at him, with no sign he’d even heard his plea. He took a step back and blew out a long breath. “Straighten yourself.”</p> <p>Kai looked up at him in confusion. “What?”</p><p>“I said, straighten yourself.” He pulled a handkerchief from his pocket. “Wipe the blood from your face and neck. Do it now.”</p><p>Kai took the handkerchief from him and wiped it over his sweaty face, wiping away blood from his lips and nose that he hadn’t even known was there. He pulled the handkerchief down and saw that most of his makeup had come off with the dirt and blood. He pressed it to the back of his head and winced as a fresh jolt of pain shot through him. Trying to calm his breathing, he pulled at his robe to straighten and close it. It was torn and dirty and all the fastenings were gone, but he did the best he could, holding it closed around himself. His body was still taut with adrenalin and tension coursing through him, but he was thankful that the Lycan had given him a moment to gather himself before he had to face the council.</p><p>When he’d done the best he could, he handed the scrap of cloth back to Lucas, but Lucas looked down at it scornfully, then tossed it over his shoulder to the floor. Gripping Kai’s arm, he hauled him toward the council room. Kai tried one more time. “My mother...please.”</p><p>“Shut up,” Lucas snarled and Kai shut his eyes, wincing against the sudden glare of lights from inside the room. Blayde, still stationed by the door of the balcony, goggled at them in shock as they emerged, and a hush fell over the crowd. Both of them were stained and dirty, and looked as if they’d been rolling around on the floor—which they had been, of course, only seconds before.</p><p>Queen Ashlan cried out in alarm when she saw Kai and rushed toward them, but before she could reach them, Lucas held up a hand to stop her. “There was a slight accident. The. . . princess is fine. Don’t alarm yourself.”</p><p>Kai blinked and looked up at him in surprise, but he was striding across to the council, pulling Kai with him, his grip strong and sure. He stopped in front of the council’s table and Kai gazed at their shocked faces. Before they could say anything, Lucas’s voice rang out firm and loud. “The wedding between us will take place immediately. I’ve received word that I must get back to my ship right away. Have Kai’s servants prepare her things. We’ll go back to my ship directly after the wedding ceremony.”</p><p>The council members stared at Lucas in shocked surprise, but he could feel his family gathering at his back. Lucas faced the Scythians confidently, fully prepared to fight his way out of this chamber and take his mate if he had to. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The members looked to the queen, who stepped forward and held a hand out to Kai. Kai made a move toward her, but Lucas jerked him back by his grip on his elbow. The alpha growled menacingly at his mother, and Kai shook his head at her. Lucas thought he must be concerned for her safety and rightly so. His wolf was angry and restless inside him, urging him to let it free.</p><p>He glanced over at Kai and winced when he saw the blood still trickling down the back of his neck. He hadn’t meant to hurt him enough to draw blood, but when his wolf sensed his mate trying to escape, it exerted its dominance in no uncertain terms, and he’d no longer been fully in control. Lucas lifted his head to the queen.</p><p>“Does this meet with your approval, Queen Ashlan?”</p> <p>She wrung her hands a little and glanced at Kai again. “May I speak with Kai first, Alpha?”</p><p>“No,” he replied shortly. “Kai is fine, and will remain that way. There’s nothing more you need to know. ”He knew he was being abrupt and rude, but hardly cared. This woman had tried to make a fool of him, no matter what Kai had said, and Lucas’s fierce, unrelenting pride wouldn’t allow him to unbend. He was angry and frustrated. The bond between him and Kai was so strong already, that it made him physically incapable of leaving Kai behind, as his logical mind very much wanted him to do. He felt betrayed by his own body and that stupid curse, and he felt like raging at all of them. It was taking everything in him to control himself at the moment, especially after what had happened between them on the balcony.</p><p>He had very nearly fucked Kai out there. Once he felt Kai’s warm cock in his hand and smelled his sweat and arousal, he almost gave in to the strong urge to take him there against the wall, and he wasn’t normally that kind of man. Kai would have to agree to mate with him—he wouldn’t force himself on the boy, no matter how angry he was. A strong wave of lust washed over him again, just thinking of mating with Kai, and he had to clench his fists. Kai cried out softly at the increased pressure on his arm, and he forced himself to back off so he wouldn’t crush the bones under his hand.</p><p>“Well?” he asked gruffly. “Are we to have a ceremony or should I just take Kai and leave?”</p><p>He could hear the sounds of his family bristling behind him, ready to back his play, but the council members seemed to be in shock. Queen Ashlan stepped up to him, braving his wrath, her eyes flashing in her face.</p> <p>“Do you guarantee Kai’s safety? Tell me the truth, Lycan. I’m aware of your strength, and I know you can take Kai with you easily. But promise me Kai will be safe, or there will be bloodshed in this chamber tonight.”</p><p>Lucas narrowed his eyes and almost told her exactly what he thought of her and her son, but managed to bite his tongue. He grudgingly admired her fighting spirit. “I guarantee it. My word of honor as a Balenescu.”</p><p>She nodded once, seemingly satisfied. “Very well.”Turning back to the council she addressed the leader. “Minister Olan, will you do the honors, please?”</p><p>The minister rose shakily to her feet and began mumbling out the ceremony that would tie Lucas to his mate for life. For Lucas it was a mere formality—he couldn’t care less about the proprieties of this little backwater planet, but he knew it would be important to Kai. Even though he was furious at him, he would allow this one thing.</p><p>After his earlier aggression, Kai seemed subdued and shocked. The minister got to the portion of the ceremony where both of them had to agree to be wed. Lucas said yes, quickly and without any hesitation, just wanting this charade to be over. Kai glanced over at him when it was his turn and took a shaky breath before answering in the affirmative.</p><p>As soon as the minister stopped talking, Lucas shoved Kai back into Blayde. Kai stumbled into his arms and Blayde was surprised, but took hold of Kai, much more gently than Lucas had done. He whispered something in his ear. Kai looked up at him gratefully before dropping his gaze to the floor again.</p> <p>Lucas glared at the queen. “I’ve changed my mind about Kai’s things. If he has anything you want to send him, by all means do so, but I’ll provide everything else. ”He glanced back at Kai, an unforgiving look still creasing his brow. “Say your goodbyes to the princess, Ashlan. I’ll give you only a moment.”</p><p>The queen sighed, looking as if her heart were breaking and again, Lucas felt the strong tug of remorse. He hardened his heart to it though as she hurried toward her child and took his face in her hands. Blayde still held one of his arms, but Kai embraced her with the other arm, and said something softly to her. The boy touched her face, and then Lucas took Kai’s arm away from Blayde and pulled him away.</p><p>“We have to leave. Kai will contact you after we arrive back at Lycanus.”</p><p>“Thank you,” she said, suddenly looking her age, her shoulders drooping. Lucas turned without another word and the Lycans strode from the room, surrounding Kai, and holding their hands on their weapons.</p><p>The first glimpse Kai got of the Lycan spaceship was alien and frightening. The place they’d brought him to was a large open area, with two seats in the middle of the room behind complicated-looking controls. What looked like comp screens ringed the entire command center, and a large screen showing their orbit around Scythia was suspended from the ceiling in front of the chairs. Kai glanced sadly at the screen picturing his planet, wondering if this was to be his last sight of home. His life there had never been easy, but it was all he’d ever known and every person he’d ever cared for in his whole life was down there below him.</p><p>Kai was filled suddenly with an overwhelming sense of loss. He was leaving Scythia for what promised to be a short and unpleasant future. He had no illusions about whether or not the Lycan would kill him. Despite his promise to his mother, Kai believed Lucas would dispose of him quickly. Lucas believed Kai had tricked him and tried to make a fool of him, and the alpha was not only furious, but proud and unforgiving. He wondered why he hadn’t already been dispatched, along with his mother, but perhaps the alpha thought killing the queen and her child in her own council room might cause an interplanetary incident, difficult for him to explain to the Alliance. Kai figured they would take him off planet and arrange some convenient accident for him.</p><p>At least his hands were free, and Kai knew it was only because the alphas thought he presented little threat to them. They were probably right—against six huge Lycan alphas, he would have little chance. The Lycan standing beside him, the one who had spoken to him kindly in the council room, telling him no one would hurt him, shifted his feet next to him, and Kai’s attention moved to the gun at his side.</p><p>There might be one thing he could do to end this on his own terms, after all. One way he could wrest some control over how and when the moment of his own death might come.</p> <p>“Kyle,” Lucas said from one of the large chairs he’d thrown himself in as they arrived. He didn’t so much as glance over at Kai. “Take him down to my quarters and lock him in.”</p><p>Kyle and the others looked from Kai to Lucas as if he’d suddenly taken leave of his senses. “Him?” Blayde asked in confusion, looking from Lucas back to Kai. “What the hell are you talking about? Why are you calling Princess Kai him?”</p><p>Lucas glanced at him with a bitter look on his face before rising to his feet and stalking toward Kai menacingly. “Oh, I forgot to tell you in all the excitement,” he said, his voice deceptively gentle. The tone didn’t match his eyes, which were blazing with anger. “I never got the chance to explain down there. Meet my new bride, boys.” Without another word, he ripped the robes apart, displaying Kai’s genitals. Kai cried out, throwing his hands over them in shame and embarrassment, but it was far too late. The other Lycans made various exclamations of shock, as Kai jerked the robes from the alpha’s hands and pulled them back together, casting a furious, resentful glare at Lucas.</p><p>Lucas strolled casually back to his chair. “What was it all of you told me?” He smirked, and his voice took on a sing-song quality. “Getting mated is great, Lucas—you should try it. She’s the best matchmaker in Lycanus, Lucas, really.” Throwing himself in his chair again, he glared at each of his family in turn. “Yeah, this has worked out great so far.”</p><p>“But-but I don’t understand, Lucas,” Blayde sputtered. “How can this be possible?”</p><p>“Don’t you get it? They tricked us, damn it. Tried to make a fool of me—of all of us. I guess she thought we were all too stupid to realize this...” He gestured toward Kai. “...is a damn boy. I think he must be the queen’s son, though I have no idea why he and his mother tried to palm off a male instead of a female on me. Such a ridiculous subterfuge. Obviously the deception would be discovered sooner rather than later.” He glared back over at Kai. “Why don’t you enlighten us, boy? Tell us what you and your treacherous, lying bitch of a mother hoped to gain from this?”</p><p>Kai’s felt his face flame, and without thinking it through, he lunged toward Lucas, not caring if he killed him on the spot or not. No one would speak of his mother like that in his hearing without retribution. His mother had done the best she could for him. She had saved him even though he was a non-person and protected him all his life, and though he hadn’t agreed with this trickery, he knew she had done it in an attempt to save him. He made it only halfway across the space dividing him from Lucas before he was caught around the waist by Blayde and hauled back. He couldn’t break Blayde’s hold, but he twisted his body in Blayde’s arms so that he fell against him and went completely limp. Blayde tightened his hold around Kai’s waist to keep him from falling, and this gave Kai the chance to wrest the gun from the holster on Blayde’s hip. Pulling it up in front of him, he brandished it in Blayde’s face, and Blayde fell back, turning him loose and shouting in alarm.</p><p>“He’s got my gun!”</p><p>“Damn it!” Lucas shouted, jumping back up to his feet, his face blanching. “Kai, you don’t want to do this. Put it down.”</p><p>Kai held the gun in a steadier hand than he would have imagined. He swept his arm from one Lycan to another, pointing the gun at eachof them in turn. All the Lycans were staring at him in amazement, yet remarkably, none of them seemed frightened, except for Lucas. Actually, he had a look on his face that Kai couldn’t quite identify. Part anger, part regret, part fear, and Kai knew instinctively he wasn’t afraid for himself. He began to ease toward Kai, stopping only when Kai trained the gun on him and yelled, “Stop! I’ll shoot! I swear I will.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucas hesitated, but kept coming forward at an even slower pace, murmuring to him. He was telling him over and over to be calm, but Kai felt perfectly calm for the first time all evening. He would do this and it would finally all be over. This terrible half-existence he’d lived his whole life. All the worry and fear would be wiped out in a split second, and he could find peace.</p><p>“Get back. Get away,” Kai said, and shook the gun at Lucas, snarling at him. Kai backed away a few steps until he came up against a wall. Lucas kept easing slowly toward him, his hands outstretched as if trying to calm a wild animal, while the others watched in tense silence.</p><p>“Drop the weapon, Kai. Surely you know this is futile. You can’t escape. I’m sorry if I scared you, but no one will hurt you here.” Lucas was speaking to him in a soft, conciliatory voice, but Kai didn’t believe it for a second. He only wanted to prevent Kai from shooting any of his family. The thing was, Kai had no intention of hurting anyone—except himself. He would save them the trouble of arranging an “accident” for him by choosing his own method and his own time.</p> <p>“I have no interest in escape,” Kai said softly. Slowly, never taking his gaze away from Lucas’s, he brought the barrel of the gun to his own temple.</p><p>“No! Kai, please!” Lucas sounded almost anguished. Kai shook his head. He didn’t understand what they wanted from him. He took a deep breath, closed his eyes and tensed his finger on the trigger.</p><p>Before he could exert the slightest pressure, something slammed into him from behind, knocking the gun toward the ceiling so that the discharge blasted from the weapon and careened upward before ricocheting wildly around the room. He’d been so focused on Lucas, that he never noticed Blayde circling around behind him. The force of the impact pushed him forward into Lucas and his big body leaped on him, smacking him down on the floor and covering him. Kai hit the floor hard, the breath whooshing out of him. He could hear the shouts of the other Lycans as they took cover, but all he could focus on was trying to drag air back into his lungs with Lucas’s weight on his chest, pinning him down like one of the insect specimens in the royal museum. His wrist tingled up his arm and all the way to his shoulder.</p><p>The crushing weight covering him lifted and Lucas picked him up by the front of his shirt and pulled his face up to his. He gazed down frantically into Kai’s eyes and even shook him so that his head snapped back. He could feel Lucas’s hot breath against his mouth. “Are you hit? Speak to me, damn it.”</p><p>“I-I...” He shook his head a little, making a sickening pain shoot through him, and he had to close his eyes.</p> <p>“Kai? Stay awake. I took you down pretty hard. You might have a concussion. Don’t close your eyes, baby.”</p><p>Kai, whose eyelids had been fluttering, opened his eyes all the way. Baby? He wasn’t a baby. No one had ever called him that before. What could it mean? Was this even his alpha?</p><p>“Kai, damn you, don’t you fucking close your eyes!”</p><p>Okay, there he was. Kai opened his eyes and stared up into Lucas’s, blinking rapidly. Lucas let out a long breath, nodded and stood up, hauling Kai to his feet, but wrapping his arm around his waist to hold him up.</p><p>“Is everyone all right?” he asked the others. Kai decided that while he was taking inventory of the damage, he might just close his eyes for a moment and doze a bit.</p><p>“We’re all good, Lucas.” Someone answered, sounding far away. “Better watch your boy, though. He’s going out again.”</p> <p>Lucas dragged Kai around in front of him and shook him again, but very gently this time. He yelled in his face again. “Kai! I said, stop trying to go to sleep, damn it.”</p><p>Kai pulled back his fist and punched Lucas on the chin. Lucas saw it coming and tried to duck, so it more or less bounced weakly off to the side, but it must have stung a little, because his mouth fell open in shock. Kai heard Lucas’s family laughing behind him.</p><p>“I think you’ve met your match for sure, Lucas,” one of them called out. “He’s a spitfire. You better sleep with one eye open tonight!”</p><p>“Spitfire, my ass! Let’s see how fiery he is in a cold shower. ” He strode off determinedly, dragging Kai behind him by his rapidly bruising wrist.</p><p>Kai tried to dig in his feet, but it was useless. Lucas just tightened his grip and jerked his arm. On the way out of the room, they passed the chair Lucas had been sitting in, and Kai grabbed at it, but Lucas patiently pried his fingers away from the arm and dodged another blow to the head as his hands came off. This time he threw Kai over his shoulder and stalked out of the room, his family’s raucous laughter following them down the corridor.</p><p>Kai tried to raise himself up off Lucas’s shoulder and got a stinging slap on the ass for his trouble. They went into a room that must have been Lucas’s bedroom and then into a small bathroom. Lucas plopped him down on the counter and pointed a finger at him. “Don’t you move!” He kicked the door shut and turned back to the tiled shower, turning on the cold water. Ignoring him, Kai had already slipped off the counter and was at the door, trying his best to make it out of the room before he turned around, but Lucas moved too fast for him. He put his hands around Kai’s waist and dragged him inexorably toward the tub.</p><p>“Noo,” Kai said, begging now. “Please.” He was already shivering at the idea of the frigid water splashing down on his flesh and Lucas stopped, staring down at him. Something flickered in his eyes. “Are you going to stay awake?”</p><p>“Yes,” Kai said miserably, his eyes shooting darts of fury at his captor.</p> <p>Lucas regarded him silently for a moment. He drew him into his arms, and Kai looked up in his face in alarm. What now? His hands were moving over his back and his hips. He pulled him even closer to him, tucking Kai’s head under his chin. Taking a ragged breath, he spoke in a rough voice, the words seeming to be torn from him, as if he might have wanted to hold them back.</p><p>“Kai, damn it. It’s getting more and more difficult for me not to touch you. I-I want to very much.”</p><p>Kai opened his eyes wider in surprise. “You do?” Kai’s voice was muffled with his face pressed into the alpha’s chest, but he must have understood Kai, because he answered softly.</p><p>“I do.”</p><p>“But I thought you hated me. I thought you wanted me dead.”</p><p>Lucas seemed to recoil in horror, pulling him away from his chest and glaring into his face. “Dead? Whatever gave you that idea? I know I’ve been angry, but I would never harm you.”</p><p>Kai glanced at him resentfully. “You already did. You hurt my head on that wall, and you-you fought with me.”</p><p>Lucas closed his eyes as if he was in pain and ran a hand over his face. “I know. I was angry, and you gave as good as you got out there on that balcony. I have the bruises to prove it. ” Lucas pulled him back and looked down at him, regarding him with a look almost of pride. “Still, I never meant to hurt you. My wolf got carried away and tried to exert his dominance when you tried to run from me. Can you forgive me for hurting you?”</p><p>Kai shrugged, still wary, and Lucas cupped his cheek.</p><p>“I still don’t understand why you deceived me, but we’ll let that go for the moment. You’re my mate, Kai. I knew it from the moment I saw you. Like I said, I’m having a hard time not touching you right now.”</p><p>“You are touching me.” Kai raised his eyes to gaze directly into Lucas’s dark red ones. “I-I suppose I belong to you now.”</p><p>“You suppose?” Lucas hissed in a sharp breath, and his eyes flashed. “Make no mistake, Kai, you belong to me, all right.” He leaned toward him and inhaled again, shutting his eyes tightly and making a low, groaning sound in his throat.</p><p>“Kai...I won’t force you, no matter how I feel. But do you—do you like men? Is that why you dress as female? Am I reading you right?”</p><p>A wave of uneasiness coursed through Kai. He glanced away and then back up at Lucas. “Do men who dress as women on your planet always like other men, then?”</p><p>“There aren’t any that I’ve ever heard of. But on other planets, sometimes—I guess. ” He shook his head. “No, not always.” He raised his eyes upward. “Hells, I don’t know, Kai. Tell me why you dressed as a female.”</p><p>“I-I can’t,” Kai said, his voice low but firm. He pushed away from Lucas. “I won’t. If I disgust you, then perhaps you can be released from your vows. Your world probably doesn’t recognize my planet’s laws anyway. There’s nothing stopping you from walking away from me.”</p><p>Lucas’s lips tightened again. “I never said anything about walking away. Is that what you want? For me to release you from your vows?”</p><p>Kai raised his chin. “I am an honorable person, despite what you think of me. I am a royal of Scythia. We honor our vows.”</p><p>“Oh, really? Just not the ones where you tell potential suitors that you’re actually a male?”</p><p>Kai wrenched himself away from Lucas and stood glaring at him. “There are reasons you’d never understand.”</p><p>“Explain it to me then, Kai. I’ll try to keep up.”</p><p>Kai glared at him, narrowing his eyes. “No.”</p><p>Lucas reached for him again, taking hold of his wrist. Kai responded with a little gasp as Lucas’s big fingers pressed into the bruises there. Holding tightly to him, Lucas yanked back the shower curtain, adjusted the spray to add some warmer water, then picked Kai up in his arms and stepped into the shower with him.</p><p>Kai gasped and sputtered as the spray of warm water hit him squarely in the face. Not even removing his clothes, Lucas pushed Kai back against the back wall. He began to strip the ruined robe from him and in seconds he had him naked, the robes lying in the bottom of the tub, the bright blue color running in rivulets down the drain. Lucas pressed his body against Kai’s.</p><p>“I want you so much, damn you. Tell me you don’t want this. ” Lucas growled and lowered his lips to Kai’s. One hand clutched the back of his neck while the other slid between their bodies. Lucas’s hand closed around his most private part, the part he never touched except while bathing and never allowed anyone else to touch because it was so sensitive. He hissed in a sharp breath as Lucas’s hand started to move up and down the shaft of the flesh between his legs, stroking him rapidly. The feelings that washed over him made his legs go out from under him. Lucas’s arm went around him to hold him up, and Kai raised his face to his. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I-I told you that I will honor my vows. You’re my husband, and you can do whatever you want. I won’t fight you again.”</p><p>Lucas lowered his forehead to Kai’s and sighed. “I don’t want to frighten you. How—how experienced are you?”</p><p>Kai shook his head. “I don’t know what happens between a married couple. Royal dau—children aren’t given any kind of instruction on this. We’re kept very sheltered, and our husbands are supposed to teach us. ”</p> <p>Lucas released his hold on him and stepped back, and Kai was surprised to see him trembling. Kai put his hands on Lucas’s arms and drew him back. “I want you to teach me, Alpha. If you want me...”</p><p>Lucas moved toward him with a low growling sound in his throat. Something leaped in his eyes that perhaps should have frightened Kai, but instead it excited him. He stepped forward so that the flesh standing up now between his legs brushed against Lucas’s stomach. He couldn’t imagine where he’d found the nerve to do it, but it felt so amazing, so incredible that Kai pressed a bit harder, the rough material of the alpha’s trousers making Kai shiver as little jolts seemed to pass through him.</p><p>With a growl, Lucas pulled him closer, putting his lips gently against Kai’s, then licking at the seams of his mouth until it parted. Lucas eased his tongue inside, gently exploring. Kai clutched at Lucas’s shoulders in complete dismay. No one had ever kissed him on the lips before that he could remember. Scythians didn’t kiss each other on the mouth, though he’d gotten his share of kisses on the cheek, along with hugs and cuddling as a small child. No one had shown him affection like this for years. Why was Lucas putting his tongue in his mouth? Was this some Lycan custom? And what on Scythia was he doing with his hand?</p><p>His breath coming quicker, Kai pushed at his shoulders, frightened a little, but didn’t budge the Lycan an inch. Dragging his eyes open, Kai met Lucas’s dark gaze, sparkling with some emotion he couldn’t name. His hand moved faster and Kai would have screamed at the sensation if his mouth hadn’t been otherwise occupied as Lucas lowered his head for another kiss.</p><p>Groaning, he felt like he was burning up, even with the water splashing down on him. The big Lycan finally pulled his lips away, but Kai still couldn’t breathe. Not with what was going on between his legs. The strangest feeling was coming over him. He wanted something, but he didn’t know what it was. He strained to get closer to Lucas, and his hips started thrusting forward instinctively. Hearing himself whimper, he arched his back and looked up into Lucas’s eyes again, silently begging him to help, but he didn’t know what he wanted help for. Something was building in him, and he was afraid he was about to fly apart.</p> <p>Lucas smiled wolfishly at him. “Come on,” he urged, gripping him harder.</p><p>Kai thought he must be dying. His body seized and he strained forward, making little grunting sounds. His toes tried to clench and curl. The same white, sticky substance he’d found in his bed started spurting from the end of the rod of flesh between his legs and he looked down at himself in wonder. A drop or two even hit him under the chin. Oh dear gods, what was happening to him? He fell against Lucas’s chest, totally spent and drained. Lucas held him up and rubbed his back, not saying anything, just seeming to be trying to soothe him.</p><p>This was the second time Lucas had grabbed his genitals like this. Was this sex, then? Is this what two men did together? If so, he was totally on board with it. He rubbed himself against Lucas’s stomach, the friction almost painful now, but still feeling wonderful.</p><p>Lucas whispered in his ear. “I’ll let you rest for a minute and I’ll get out of these wet clothes. I’m not through with you yet, though, Kai. Not by a long shot.”</p><p>“Yes,” Kai said, happy for the moment just to hang here in Lucas’s arms and rub against him. Lucas chuckled softly and shifted around so that the water was splashing down on Kai’s head. Kai buried his face against Lucas’s shoulder, and Lucas allowed it while he carefully soaped his hands and ran them over the back of Kai’s head and neck, tenderly washing away the dried blood.</p><p>When he was finished, he sat Kai down on the side of the tub and stepped out. He peeled off his wet clothing and threw it into the tub. Then he reached for a towel to dry his body. All Kai could do was gaze at him. He’d never seen anything like him before.</p> <p>His alpha was big, with broad muscles in his chest and thighs. His skin was tanned and smooth, but all these things paled in comparison with what was hanging between his legs. He had the same genitals as Kai, only larger. His big piece of flesh was long, and wider than Kai’s. It was sticking up at a slight angle and looked impossibly hard. He had thick, curly dark hair covering it at the base. The rounded flesh below the hair was big too, hanging heavily down between his legs. Just looking at him made Kai’s stomach ache and clench, but he wasn’t sure why.</p><p>When he finished drying, he reached down for Kai and wrapped a big towel around him. Rubbing him briskly, he went over and over the same spots on Kai, gazing into his eyes. Then he bent down and picked him up again to carry him to the bedroom. Kai was a big boy and not used to being carried around like this. Maybe this was part of the Lycan’s mating ritual. He threw an arm around Lucas’s shoulder and hung on, his eyes wide and confused.</p><p>Lucas carried him to the bed, dropped him down on it and climbed in after him. Kneeling over him, his eyes hungry and savage, he almost growled at him. “I’m going to fuck you now, Kai. Tell me you know what that means.”</p><p>Frightened, but trying not to show it, Kai shook his head. “No,” he admitted. “Is it different from what we just did? Will you hurt me?”</p><p>Groaning, Lucas fell down beside him, the flesh between his legs an angry red and sticking up from his body. “Can you really be as innocent as you’re pretending? Tell me you’re really not a virgin.”</p><p>“I-I’m not sure.”</p><p>“How can you not be sure?” Lucas was almost yelling at him.</p><p>“Because I don’t know what that is,” Kai snapped back, raising his own voice.</p> <p>Lucas propped himself up on one elbow and narrowed his eyes at him. “What do you mean you don’t know what it is?”</p><p>“I mean I don’t know. I never heard that word before.”</p><p>“Well, what do you call someone who hasn’t ever had sex before?”</p><p>“I don’t know,” Kai said irritably. “I don’t call them anything because I’m not supposed to discuss things like that. I’m sure there’s probably a word for it, but it never came up in conversations with my mother and my servants.”</p><p>Lucas blew out an exasperated breath. “Surely you have friends. You read, don’t you?”</p><p>“Not about sex. I wasn’t allowed to, and royal children never play with other children. You don’t seem to realize how isolated I’ve been all my life. Everything I was allowed to read was carefully screened before it was given to me. As I told you, a royal is not supposed to know anything about such things before marriage, and that’s how I was brought up.”</p><p>“Your mother said you hunted. You must have seen animals mating or had friends who talked about it as you got older.”</p><p>“Not really. I did hunt with the royal guard, but I never saw animals doing—that. Scythians don’t keep animals as pets. My tutors told me that’s done sometimes on other planets. I overheard some conversations occasionally, of course. But they were all females. They never discussed anything about males. Not ever. Scythian women don’t like males.”</p><p>“Yes, but surely...” Lucas broke off in irritation. “What about when you masturbated?”At his blank look, Lucas blew out another long-suffering breath. “When you touched yourself—down there? You know, to make yourself come.”</p><p>“Come?”</p><p>“Oh for the gods’ sake! Do what you just did in the shower.”</p><p>“I never did that before,” Kai said shyly. “Not like that. I had dreams sometimes. Sometimes I’d rub myself against the sheets, and it would feel good. But my servants always bathed me. I didn’t take showers by myself.”</p><p>“B-But...you...that can’t be...oh, fucking gods!”</p><p>“Why are you so angry? I can’t help it—I live on a planet with all women. Don’t you get it? I don’t know anything about men. No one ever taught me anything like this.” Kai could feel his cheeks heat up and he squirmed uncomfortably. “I know you think I’m stupid and a liar. But I’m not lying about this. I don’t know anything about sex.”</p><p>“If there aren’t any men on your planet, why did your mother keep you?”</p><p>“She loved me, I guess,” Kai said sharply. “She had fallen in love with my father, even though that was highly irregular. Almost unheard of, really.When he died she was already pregnant with me. When I was born, she decided to keep me. But she had to pretend I was female.”</p><p>“What?”Lucas stared down at him incredulously. “So no one knew your true sex except your mother?”</p><p>“And the servants loyal to her, of course. No one else, no.”</p><p>“She raised you as a girl?”</p><p>Kai flushed. “She raised me as a person. Don’t you see? Males are non-persons and defective.” He had dropped his gaze telling this part, but he chanced a peek back up at his mate. He could tell from Lucas’s outraged expression that he thought pretending to be a person was wrong and something Kai should be ashamed of. Unable to meet his gaze, Kai kept his head firmly down.</p><p>“But why did you go along with it? I mean, once you got older. Didn’t you...?” Lucas shook his head. “I just don’t understand.”</p><p>Kai felt his face flaming. He was ashamed, but not of pretending to be a female. “Males are...I’m sorry, but males are deformed, in a way. That’s why we have this extra flesh between our legs, Merrial said. She’s my servant and told me all about it. Naturally, I tried to hide it. I wanted to be a member of the superior sex.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What?” Lucas’s eyebrows rose and he glared down at Kai. “Why in the hells did they fill your head with that drivel? You listened to a servant? Males are not defective.” Lucas’s tone was outraged and Kai shrank away from him a little.</p><p>Kai shrugged. “Naturally, you would say so...”</p><p>Lucas passed a big hand over his face. “So you mean to tell me...” his voice was deliberately calm. He took a deep breath. “You mean to tell me you pretended to be a female because you didn’t want to be thought of as defective?”</p> <p>“Yes, partly.There were other reasons, of course.”</p><p>“Which you won’t share with me.”</p><p>“I can’t share them with you, no. But we had our reasons. Can’t you just let it go at that?”</p><p>“No!” Lucas shouted. He scooted up in bed and put his back against the headboard. “A Lycan mate tells their alpha everything. There should be no secrets between us.”</p><p>“I’m sorry. I know I’m a disappointment to you.”</p> <p>Lucas shook his head glared at him again. “So you had no idea what I was doing to your cock in there?”</p><p>“My what? You mean this-this flesh between my legs?”</p><p>Lucas just looked at him and then tilted his head. His eyes got even narrower. “You’re fucking with me. You have to be.”</p><p>Kai looked down at himself. “I-I don’t think so. I don’t think I’m doing anything.”</p><p>Lucas took his flesh in his warm hand. Almost immediately, that weak feeling came over him again and he shuddered with excitement. “This...is your cock,” Lucas said. “Your penis. Understand?”</p><p>“Yes. I’m not stupid, just ignorant of your name for it.”</p> <p>Lucas didn’t answer—just glared at him.</p><p>“Well, I’m sorry,” Kai said a bit sharply. “I don’t know any of this. No one ever told me.”</p><p>Lucas raised his eyes toward the ceiling and seemed to be counting. “From now on,” he said. “Ask me things you don’t know, and I’ll tell you.”</p><p>“All right,” Kai said quietly.</p><p>“We’ll start...” Lucas said, rolling back toward him. “We’ll start with how a man makes love to another man.” He moved his big hand to Kai’s stomach. “Now pay attention and we’ll go slowly.”</p><p>Chapter Three</p><p>“First, Kai, you have to realize exactly what it is we’re going to do. We’ve gone through your wedding ceremony on your planet, and I’ve agreed to be your husband. You say you want to honor your vows. Understand that this is an irrevocable step. Once we’re mated, I won’t be able to release you—not ever.”</p><p>“I understand.”</p> <p>“Do you want to do this? Do you fully understand what it means? I’ll claiming you as my mate.”</p><p>“I understand, but-but I thought you despised me. You said we tricked you.”</p><p>Lucas regarded him silently for a few seconds. “Despise is too strong a word. I’m angry, yes. I don’t like being made a fool of, Kai. And I hate deceit of any kind. I still don’t think I know the whole truth, and so far, neither you nor your mother has been willing to tell me.”</p><p>Kai shifted his gaze. He would never expose his mother’s secrets to this Lycan if he could help it. Merrial had told him Lycans were powerful leaders in the Planetary Alliance. She said they’d be furious and outraged if they knew the truth about the boy babies on Scythia. His mother might be arrested and killed, even though she was only following the ancient ways of their people, established long before the Alliance came into being. He had to protect her, if he could.</p><p>Lucas was still looking at him. “Do you want to tell me now why your mother didn’t just admit who you were? You may have been ignorant of what a man was, but she surely couldn’t have been with two children. Why didn’t she send you to live with your father?”</p><p>“My father died, as I told you.”</p><p>“His people then.Damn it, didn’t she realize she could have damaged your mind, making you think that men are all defective? Making you act like a girl?”</p><p>“Do you think I’m damaged?”</p><p>Lucas let out a long breath. “I don’t know, Kai,” he said softly.</p><p>The words made Kai’s stomach clench, but he nodded sadly. “I will release you from any vow you made to me. I’ve already told you.”</p><p>Lucas glared at him. “I don’t want to be released. I only want the truth.”</p><p>Kai shook his head. “I can’t.”</p><p>Lucas looked disappointed and disgusted, and it hurt Kai’s heart to have to keep telling him no. Lucas turned his head away, and Kai reached out to touch him gently on his cheek. He turned his head in surprise and stared down at him for a long time before his eyes finally softened.</p><p>“You’re so damned beautiful. So desirable,” he said, almost as if he were talking to himself. “I don’t think I can resist you—I don’t think I want to.”</p><p>“Don’t,” Kai said softly. “I-I want you to be my husband. In every way.”</p><p>Lucas groaned and pulled Kai into his arms. Lucas kissed him for a long time before gazing down at him and giving him a little bite on his bottom lip, then licked it. Kai was beginning to associate this strange combination of pain and pleasure with his mate. It was very disconcerting. “Are you sure you understand what’s going to happen, baby? You’ll be a Lycan mate. Do you know what that means?”</p><p>“No,” Kai said with a little shake of his head. “But if it means I can stay with you, then I want it.” And Kai was almost surprised to find that it was true. This huge, frightening man was oddly fierce yet gentle. He’s already made him feel things that excited him more than anything he’d ever felt before. Even though he’d been taught to find women’s bodies more visually appealing, this gorgeous creature’s body excited him.</p><p>“Teach me. Please, Alpha.”</p><p>Lucas moaned and buried his face in Kai’s throat. “Gods, you smell so sweet.”</p><p>Getting to his knees, he looked down on Kai. “This will hurt, Kai. This first time at least. I’ll try to make it as good as I can for you, but you’ll be so tight. I don’t want to hurt you anymore.”</p><p>“I want you to be my husband. In every way.”</p><p>“Balenescu mates need to be with their husbands all the time. They can’t ever be intimate with another man once they mate with their husbands—it would be physically impossible for them to get satisfaction. Do you understand?”</p><p>Kai shook his head, and Lucas sighed. “This is so difficult to explain when you know so little about things.” He tried again. “Your cock—this piece of flesh between your legs—will never get hard for anyone but me, ever again. Do you understand?”</p><p>Kai nodded and smiled. “But that’s as it should be, isn’t it?”</p><p>Lucas’s eyes softened again, and he seemed to shiver. “Sweetheart. Yes, that’s as it should be.” Slowly, he rolled Kai over to his stomach, lifting his hips to pull pillows under them. Kai watched his every move from over his shoulder. He took some oil from the table next to the bed and splashed some on his fingers. “I’m going to put this on you, baby. It will help when I enter you.”</p><p>He put one oiled finger at Kai’s hole and Kai tensed immediately. Gasping, he looked up into Lucas’s face. “W-What are you doing?”</p><p>His hard fingers began to massage oil gently into his crease and ghosted over his hole as Kai shivered. “This is where I’ll make love to you. You have to open to me, love. I’ll try not to hurt you.”</p><p>Very gently, he eased one finger inside this most intimate place in Kai’s body. Kai hissed in a breath and tried to squirm away, but Lucas held him firmly in place. “Easy, Kai.Try to relax. I’m showing you what men do together.”</p><p>Kai nodded and tried hard to relax his body, opening his legs even further, but he was beyond amazed by this turn of events. Lucas stroked his back and with an oiled finger gently probed inside Kai’s hole. No one had ever touched him there, and it felt strange and burned a little. The finger slowly pressed further inside and when Kai tensed against the burn, Lucas leaned over him and kissed his ear, licking at the nape of his neck until he relaxed again. He whispered in his ear as he slowly moved the finger in and out. “Have you ever touched yourself here, love?”</p><p>Kai shook his head, and Lucas gave a soft chuckle as he kissed his ear. “Good. This is mine, and you’ll never feel anyone else’s touch here again.” Those whispers in his ear were driving him crazy and he arched his back. He couldn’t decide whether to lean into the fingers or pull away. He felt another finger go inside him and he groaned at the stretch of those fingers within. They only moved in deeper and Kai cried out, trying to get away from Lucas’s strong hand on his hip until the fingers suddenly brushed against something inside him. It was a spot so sensitive he couldn’t decide at first if it hurt or if it felt incredibly wonderful. The fingers brushed over the spot again and again until Kai was whimpering for more, thrashing his head wantonly and pushing his ass up into the air to get it.</p><p>Suddenly the fingers pulled away and Kai almost sobbed in frustration and need. Was it over so soon? Then he felt something else nudging his hole, something larger, and he felt a moment of panic. Before he could move away, Lucas’s hand pushed under him and closed around his flesh, pulling down and back up hard several times in a row. He couldn’t decide whether to arch forward or back—he needed more pressure, more sensation. He whimpered in confusion and Lucas whispered to him.</p><p>“Shh, baby. Try to relax. Push out when you feel me. Let me take care of you.”</p><p>The fingers pushed in at his hole again, and the pain was back. Lucas took his time, pushing in slowly, a tiny bit at a time and then pulling out just a little until all of Kai’s focus was on this one incredible thing that was happening to his body. “Relax for me. Don’ forget to push out a little,” Lucas instructed and when he did, it began to feel a little better. He still felt tight and full, and it still burned, but the burn was getting less and the pleasure was overriding it. Lucas’s other hand continued to work the flesh between his legs until he thought he’d lose his mind. He couldn’t decide if he should beg him to stop or beg him to do it harder. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m going to give you the mating bite, Kai. It will hurt for just a moment, but I’m here. I’ll take care of you.”</p><p>“Yes,” Kai whimpered softly and Lucas bit deeply into the side of his neck. His teeth were like needles boring into him, and Kai tightened his mouth against the scream that threatened to burst out of him. A burning pain surged into his neck and spread throughout his body. Right away he felt something different at his entrance. The hard rod of flesh seemed even bigger, harder, and it surged inside him and filled him uncomfortably full.</p><p>Lucas withdrew until just the fat head of the thing he called his cock was stretching Kai wide, and he just as slowly pushed back in. Kai could feel every inch of Lucas’s beautiful cock as it slowly filled him and drew back again. Every time he brushed over the tender place inside him Kai felt a bolt of ecstasy rush through him.</p> <p>“You’re doing perfectly, baby. Are you all right? Does it hurt too much?”</p><p>“No, I-I love it. Don’t stop.”</p><p>Lucas kissed him on the side of his face and then trailed kisses down his neck. “I’ll give you everything you need, Kai. I’ll take care of you.”</p><p>Almost as soon as he said the words, Lucas began to thrust harder, faster, really hammering at him. Cries of surprised pleasure flew from Kai’s lips and his fingers clutched at the sheet beneath him. The pleasure was almost too much and he wondered fleetingly if it might kill him, simply stop his heart with its intensity. Even if it did, he didn’t want this ever to stop.</p><p>Lucas gave a loud cry as he strained against him. The next instant, feelings like he’d never had before, even in the shower with Lucas, surged through Kai, filling him with intense pleasure. The wetness spurted from his flesh uncontrollably, while at the same time, he felt something hot and liquid inside him, filling him and running down the backs of his legs. Instead of dissipating, the feelings only got stronger and he was completely overcome with joy like he’d never known. In some other part of his brain, he knew that Lucas was licking his neck where he bit him, bathing the bite in saliva, and it felt—incredible. He tried to get closer to Lucas, pushing back into him. He realized suddenly that his breath was coming in short gasps, and he couldn’t seem to get enough air inside his lungs. His heart was pounding wildly.</p> <p>Trying to let Lucas know he must be dying, he reached back and found his fingers. Lucas squeezed them tightly in his and leaned down to whisper again in his ear. “It’s the venom, Kai. You’ll be fine. I won’t let anything hurt you. Sleep now, sweetheart. Try to rest. ”</p><p>Kai sagged beneath him, totally spent. His husband said he wouldn’t let anything hurt him. Kai wondered as he drifted into sleep if he could keep that promise. Especially since, it was Lucas, himself, who was most dangerous to his well-being.</p><p>Lucas was drinking Lycan tea in the lounge area when Blayde came in to get himself a cup. He and Larssen were piloting the ship, yet Blayde still sat down beside him.</p><p>Lucas glanced up at him. “Shouldn’t you be helping Larssen?”</p><p>“He’s fine for the moment. I wanted to find out if you’re okay.”</p><p>“Why wouldn’t I be?”</p> <p>“What’s going on with this boy, Lucas? Why did they tell everyone he was a female?”</p><p>Lucas shook his head. “I still don’t know for sure. Crazy-ass laws on Scythia. Boy children are rejected, didn’t the matchmaker say? I certainly didn’t see any men the entire time we were there. Kai claims his mother wanted to keep him even though he was a male child, so she pretended he was a girl.”</p><p>“What? Well, on a planet where the women are so big and muscular, I can see that it could work. But she had to know it would come out eventually. How did he feel about it?”</p><p>Lucas shrugged. “He won’t tell me much. I think he’s trying to cover up his mother’s lies. She must have wanted him gone too, and that’s why she pulled this shit to get him off the planet once he got older. The matchmaker must have told her I preferred males anyway. Kai’s not talking, but he seems almost too innocent. No one at his age could possibly be as naive as he pretends. I think he’s still lying to me and trying to gain my sympathy.”</p><p>“Yet you mated him anyway.”</p><p>“You know I don’t have much choice in the matter. My wolf would have taken over if I hadn’t. ” Lucas looked at Blayde sardonically. “You must remember how that is. You were ready to mate with Ryan even believing him to be a murderer.”</p><p>Blayde nodded. “You’re right. Nothing could have stopped me. At the time, I thought maybe I could train him to be a good person.”</p><p>“I guess I’m thinking the same thing. If I can, I’ll train the deceit right out of him—teach him to act like a man and always tell me the truth. I may have to keep that bottom of his reddened and well-spanked for a while to do it.”</p> <p>Blayde laughed. “Lucky you.He’s got a nasty temper, though. I don’t envy you.” Blayde got up and stretched. “Then again, maybe I do,” he said, laughing. “I’d better get back to the comm deck. Larssen will already be cussing me. Why don’t you curl up next to your new mate and get some rest? You look exhausted.”</p><p>Lucas nodded. “Maybe I will. I’ve been sitting here thinking about what I’ll tell them when we get home.”</p><p>“And?”</p><p>“The truth, of course, but as little as possible.I won’t tell them about the deceit. They’d blame Kai, and hate him for it, and I won’t do that to him. No, I’ll take the blame. My mate is a male, and they’ll have to accept it. If they want an heir, I’ll have to use surrogates, like our father did. If Boris and his friends don’t like it, they can leave and go back to the home planet.”</p><p>“Now you’re talking,” Blayde said with a smile. “That’s what I’ve said all along. Perhaps we should strongly suggest that anyway, as soon as we get back. His disloyalty doesn’t set well with me.”</p><p>“Nor me. Yes, it may indeed be time to tell Boris and his friends to relocate. I don’t want them upsetting Kai.”</p><p>“You’re very protective of him, despite the fact you think he’s lying.”</p><p>“Not lying exactly. From how tight he was, and how surprised and ignorant of lovemaking, I know he was telling the truth about some of it. He’s incredibly innocent. My wolf is happy about that, of course. But he’s keeping something more from me, and I need to find out what it is. I hate lies.”</p><p>Blayde left with a little wave, and Lucas finished his tea and went back to his quarters. Kai had moved over to the center of the small bed and was stretched out over it. He was lying on his back, and his face looked young and vulnerable in sleep. Overcome by his strong scent in the small room, Lucas quickly took off his clothing and lay down next to him, scooting him over and spooning him. His body was warm, and Lucas knew the venom was at work, changing his boy into a Lycan mate. From this point on, they would need to be together or at least in close proximity at all times. Even now, Lucas could sense the restlessness of his mated cousins as they hurried to get back home to their mates.</p><p>If Lucas was upset or angry with Kai, his mate would feel that anger as a physical pain in the gut and feel the need to be submissive until the pain stopped. He would never be able to feel passion for another man, though Lucas would be unaffected. Not that Lucas would ever want anyone else—he belonged to Kai as surely as Kai belonged to him.</p><p>Kai pulled back the string on his bow and let fly at the target, hitting it squarely in the middle. Lucas had set up the targets for him soon after they arrived on Lycanus 3, and Kai spent time practicing every day. Not because he was really interested, but because he wanted to please Lucas, who liked him to do things he considered manly, like sports and hunting and watching action flicks on the vid machine.</p><p>From the moment they’d arrived, he hadn’t seen much of Lucas, who had been busy with things Kai didn’t fully understand. He knew he was close by, and he saw Lucas every night, but there was apparently some kind of problem with council members that he needed to take care of, and he’d worked late almost every night since they’d arrived. When he was at home, there was a distance between them that Kai strongly felt, but he didn’t know what to do about it. He knew it was mostly because of the trickery and deception that lay between them like a poisonous cesspool, slowly seeping into every facet of their life together, no matter how hard either of them tried to get away from it or pretend otherwise.</p><p>Kai couldn’t explain properly about the lies to the matchmaker and he couldn’t tell his mother’s secrets and risk the Alliance taking action against her. Yet since he’d come to this planet, and seen the male children walking around openly, no one acting as if there were anything wrong or shameful about them, he’d begun to feel terribly confused and uneasy.</p><p>What if everything he’d been taught all his life had been one big monstrous lie? What if male children weren’t truly defective and the priestesses had lied to the Scythian women? The women of Scythia turned the boy babies over to the priestesses to be mercifully re-assimilated back into the goddess, but what if they could have kept their children? What if the goddess was wrong about males? But that couldn’t be. That would make everything he’d ever known a falsehood, and the priestesses nothing more than monsters. It would make the goddess herself—what?</p><p>Kai shook his head, scared by the thought and refusing to contemplate such blasphemy. All his life, he’d been afraid of the goddess’s wrath. As a child, he’d expected any time to be snatched up by the goddess and re-assimilated. These blasphemous thoughts could get him cast into the hells where he would burn forever. He could only hope that the goddess had lost track of him so far away from Scythia. He stood still in the backyard of the alpha’s home, his new home, and looked around him uneasily.</p><p>This planet was very different from Scythia. Instead of the verdant forests of his home world, the landscape seemed to be mostly desert, though Lucas had told him it wasn’t all so barren. They had first landed in the middle of the night, and Lucas whisked him away to the city as soon as they arrived. The moon had been huge, easily twice as big as the moon on his planet and clearly lit up everything around them. Kai had found the landscape to be strange and beautiful. In the hills beyond the city, Lucas said there were lush forests and streams. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They needed to be close to the bauxite though, so they made their homes in the desert. Lucas’s home was nowhere near as luxurious as the palace Kai had grown up in, but it was large and comfortable, and Kai loved the freedom from servants always hovering over him. Here he was allowed to bathe himself—well, most of the time, that is, when Lucas let him shower alone. He could dress himself too, though Lucas usually undressed him every night. Still, Kai had no complaints. He found that he enjoyed Lucas’s attentions very much. He loved the fact that his husband made love to him every night, and in ways he could never have imagined. His husband had taught him a lot about the ways men made love since he’d come. Kai had grown to crave Lucas’s presence, and the hours during the day when Lucas was at the mines were increasingly difficult for him.</p><p>After that first violent fight on the balcony the night they met, Lucas had never lifted a hand to him in anger. He always treated him with consideration and even affection. All in all, Kai’s life had been busy since he arrived on Lycanus 3, and he was content, but he knew Lucas was holding back some of his affection and it bothered Kai. What if he decided to put him aside? Kai had heard of things like that.</p><p>His aunt Robesia, his mother’s sister and a second daughter, had married a prince from Alger, their closest neighboring planet, and after only six months of marriage, he’d put her aside and sent her back home in disgrace. Kai had never been told what happened between them, but she lived in the palace after that, a stooped, lonely figure that kept mostly to her rooms. Kai shuddered. What would he do if Lucas sent him back home?</p> <p>Sighing, Kai strode over to the target to retrieve his arrows, his movements still a little awkward in the stiff leather trousers Lucas insisted he wear outside. Inside, he allowed him to wear his soft leggings, but he said they were way too tight to be decent for anyone but him to see. He sighed and rubbed absently at his stomach. Ever since he’d awakened after they had made love on the ship, he’d felt this nearly constant cramping in his stomach. Most of the time it was only a dull ache, but lately, the pains had grown worse. Just the other night, as they got ready for bed, Lucas saw him wince and clutch at his stomach.</p><p>“What’s wrong?”</p><p>“Nothing,” Kai said, slipping under the covers and curling up around the cramps. “Maybe something I ate.”</p><p>Lucas came to stand beside him, and then sank down to gather him up in his arms and pat him on the back. Surprised, Kai looked up at him. “What?”</p><p>“It’s not something you ate. Remember how I told you there’d be physical changes from the mating? This is one of them, I’m afraid.”</p> <p>“These cramps in my stomach? What causes them?”</p><p>Lucas sighed. “It’s me. I’m sorry, Kai. Whenever I’m upset with you or have any negative feelings toward you, this will happen. ” He snuggled him closer and kissed the side of his neck and Kai was amazed to find the dull achiness in his stomach that had been plaguing him all day begin to fade away.</p><p>“You’re upset with me? What did I do? You mean you’re doing this to me? But why?”</p><p>“I’m not doing it consciously, baby. I’m sorry. ”He bent to kiss his lips tenderly again. “Is that better? Still as much pain?”</p><p>“No, it’s easing now, but I don’t understand.”</p><p>“The venom in our mating bite causes a psychic connection and causes you to feel physical discomfort if I’m upset with you.”</p> <p>“But what have I done?”</p><p>Lucas sighed. “Nothing.It’s just the lies you and your mother told me to bring me to Scythia. I was just thinking about them. I still feel torn about it and I sense you’re hiding something from me. I don’t like it, yet you still refuse to tell me everything. I’ll try harder to get my mind off it.” He gazed down at Kai. “Unless you feel like unburdening yourself now? You know you can tell me anything, don’t you? I promise I’ll try to understand.”</p><p>Kai pulled away, miserable at being put in this position again. It always came back to this. “But you wouldn’t understand. You couldn’t. If I told you, you’d take action and I can’t let you do that.” He buried his head in his hands. “Oh goddess, what if I’m wrong about this? Then you’ll hate me like you’ll hate my mother and my whole people.” He turned toward Lucas desperately. “I don’t think I could stand it if you hated me, Lucas. You’re the only one I have now.”</p><p>Lucas pulled him closer and kissed his lips. “I could never hate you. I promise you that won’t happen. Let me help you with whatever secret you’re keeping. Please, Kai.”</p><p>Completely miserable, Kai could only shake his head, and then bent over clutching himself as a sharp pain sliced through him. Lucas saw it and wrapped his arms around him, making soothing noises and rubbing his back until the pain subsided. “I’m not consciously doing it, Kai. I don’t mean to hurt you, sweetheart.” He blew out a heavy breath. “Maybe I should just try to stay away from you more. If we had separate bedrooms...”</p><p>Kai flinched again at his words. He loved sleeping with his husband, but perhaps Lucas didn’t enjoy it as much and was using this as an excuse to get away from him.</p><p>“Whatever you think,” he replied, unable to meet Lucas’s eyes.</p><p>A tense silence fell between them. Lucas stood up abruptly. “All right then. I’ll sleep in the other room tonight. Maybe that will help us both.”</p> <p>He’d walked quickly toward the door without looking back and it had taken Kai a long time to get to sleep with the dull ache throbbing inside him. Trouble was, he couldn’t tell if the ache was coming from his stomach or his heart.</p><p>Since that night, he and Lucas still made love, but now Lucas left afterward and slept in the spare bedroom. He still visited him almost nightly, seeming to be unable to stay away, but Kai could feel things slipping away from him, and he had no idea how to stop it.</p><p>In an effort to fill his time, he sometimes visited with the other mates of Lucas’s family members. Lucas’s brother and two of his cousins had been recently mated, and Kai was getting to know the family better, especially the mates. They were often either coming or going from their trips around the galaxies with their mates, though, so he didn’t get to spend as much time with them as he would have liked. He particularly enjoyed talking to Ryan, the handsome blond mate of Lucas’s brother, Blayde.</p><p>Ryan had been at the docks to meet them the night they returned and Kai witnessed the passionate reunion between him and Blayde. Ryan had thrown himself on Blayde the minute he’d jumped down off the ship and wrapped both his arms and legs around him. Kai had been amazed at such a public display of affection—such things just weren’t done on Scythia.</p><p>Blayde had peeled Ryan off him eventually, though he kept a big hand on his waist and kept Ryan pulled possessively close to him. “Kai, this is my mate, Ryan. You two will probably be seeing a lot of each other in the days to come. Our home is next door to yours.”</p><p>The handsome little blond held out a hand to him, but his eyes were wide with surprise. “But I thought you were going to be a girl.” He clapped his hands in delight. “This is a wonderful surprise.” He turned to Blayde in confusion. “What happened? Did Lucas arrange for a different mate?”</p><p>“I’ll tell you later,” Blayde said quietly.</p><p>Kai, who was feeling overwhelmed with all the males swarming over the dock, looked around for Lucas. Not finding him, he started to tremble a little, but tried to smile and gave Ryan his hand. “N-nice to meet you,” he said softly.</p><p>Ryan smiled back at him. “You’ll like it here—and I know we’ll be good friends.”</p><p>Lucas came up beside Kai then, and Kai stepped close to him. Looking a little surprised, Lucas reached for Kai’s hand. “I think Kai is feeling a little nervous. Maybe you can come over tomorrow to talk to him, Ryan? Once he’s had a chance to settle in a bit. It would be good for him to talk to one of the other mates.”</p><p>Ryan nodded happily. “I’d love to. I’ll see you tomorrow then, okay, Kai?”</p><p>Kai smiled as Blayde pulled Ryan down the ramp and into one of the waiting vehicles. They looked like the land vehicles on his own planet, but the wheels were huge and the tires knobby. When Kai followed Lucas to one of them and stepped off the wooden dock, he sank down into the sandy soil and realized the wheels had to be so large to navigate through the terrain.</p><p>When they arrived at Lucas’s large home, Kai got an overall impression of low white walls with a stone fence wrapping entirely around the home. He followed Lucas inside and stood hesitantly by the door, not sure what to do next. Lucas put down his bag and turned toward him. He looked exhausted, yet his big body as he leaned against the counter was incredibly attractive, stirring something deep with- in Kai. Predictably, the flesh between his legs started to get hard. He’d noticed this whenever he looked at Lucas over the past two days of the voyage. Kai angled his body away, so that Lucas wouldn’t notice. Lucas had his hand down there on Kai most of the time anyway, and Kai figured he’d touch him there again if he noticed, as if it was his duty to see to it. Even though Kai ached for his touch, he knew his mate needed rest more than anything else.</p><p>“Where do I sleep?” Kai asked, and Lucas tilted his head as he stared at him.</p><p>“With me. My room is at the end of the hall. I did make provisions for you to have your own space, though, in the room next to mine. I’m afraid we’ll have to redecorate. It’s very...frilly,” he said, wrinkling his nose.</p><p>Kai shook his head. “Oh no, I like frilly things. In my room at home...”</p><p>“I said we’d redecorate,” Lucas said, his voice tight with anger. “You’re not a female, so stop acting like one.”</p><p>Kai lowered his head, but anger surged through him. He tried hard not to show it, not wishing to argue so soon after arriving, but he was getting very tired of people telling him what he was supposed to like. Who decided these things, anyway? Why was his natural preference for soft colors, frills and lace so wrong? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He nodded and Lucas walked closer to him. “I’m sorry. I didn’t mean to snap at you. I know this must be hard for you. I’m finding it’s a little hard for me too.”</p><p>Sighing, he pulled Kai close to him and kissed his forehead. “Go on to the last bedroom at the end of the hall and get in bed. You look exhausted. I have a few things to check on, and then I’ll come join you.”</p><p>It wasn’t hard to get ready for bed, since he had no clothes at all. He’d been wearing some of Lucas’s things on board the ship, but usually slept naked, since that was what Lucas seemed to want. Kai wandered down the hall to Lucas’s room. He got into Lucas’s big bed, sinking down into a soft, comfortable mattress. The pillow smelled like Lucas, and the familiar smell relaxed Kai enough that he soon fell asleep. He awoke sometime in the night to find Lucas’s big, hard body spooning him, his arm wrapped tightly around Kai’s waist. Kai snuggled back against him and let sleep overtake him again.</p> <p>Now, only a few weeks later, his husband no longer slept by his side at night. How had things unraveled so much between them in such a short time? Sighing, Kai gathered up his arrows and walked back toward the house. He’d been standing in the yard daydreaming so long that he looked around nervously to make sure none of the neighbors were watching him. Ryan had told him many of the Lycan people had wanted a female consort for their alpha, so Lucas could get an heir. When Ryan saw the stricken look on Kai’s face, he blushed and said he talked too much and not to worry about it in the least. Lucas and Blayde and the rest of the family were handling everything.</p><p>Kai caught a glimpse of his reflection in the glass doors that led inside the house. He looked very different from the person known as Princess Kai, and he no longer resembled a woman at all. Lucas had made him cut his long hair to a much shorter length. Not quite as short as his and the other Lycans, but close. He never wore makeup any more. He’d been glad about the makeup, and hadn’t minded at all about his hair. He liked the freedom of the shorter cut, and he’d wanted to look more like Lucas, whom he considered very handsome. Still, he wondered if there was anything about him that Lucas did like, and he felt little pieces of himself slipping away.</p><p>Kai’s body looked longer and leaner in the clothing he wore now too. Lucas had purchased an entire wardrobe for him, consisting mainly of the trousers and shirts and soft leather boots the other Lycans wore. They were comfortable enough, though still stiff and new. He still preferred his comfortable leggings and since he was back inside, he went to his room to change into them.</p><p>Afterward, he checked his compnetto see if his mother had sent him a message. Lucas himself had sent the queen a brief message telling her they’d arrived on Lycanus 3 safely. But, at first, he’d forbidden Kai to contact her. When he saw how unhappy it made Kai, he’d relented, and now allowed him to send messages to her regularly. Kai was well aware that Lucas read his messages, probably hoping to learn the secrets Kai was keeping from him. It did him no good whatsoever.</p><p>The lines weren’t secure into Scythia, so neither Kai nor his mother ever sent messages of any importance. Kai and Merrial had long ago worked out a system of secret communication, though, starting when he was only a child. Merrial had a beautiful wife named Lythiquo. As a young girl, Lythiquo had been quite beautiful and when she’d first come to Scythia as a love slave, she worked in the royal palace. Merrial met her there, and when Lythiquo became too old to be desirable any longer, Merrial was allowed to purchase her for herself.</p> <p>Lythiquo came from a tiny planet on the outskirts of the known universe. Its sun had super-novaed and the few inhabitants who managed to escape sought refuge all over the galaxies. Lythiquo had sold herself into slavery in order to survive. Her planet, QVR 7, had a strange, obscure language known as Quevarian, and it was so obscure and difficult to master that no one really knew it any more, except, of course, for the few refugees like Lythiquo. She had taught it to Merrial, who in turn, taught the language to Kai when he was very young, and he had spent many hours practicing with both Merrial and Lythiquo. Thus, they could have entire secret conversations no matter who was nearby to hear them.</p><p>Occasionally, he and Merrial still used this language to send their messages to each other. Lucas must have noticed, but he’d never questioned it. Perhaps he thought messages to a servant were beneath his notice.</p><p>Kai was sitting in the main living area, his leg swung over the arm of the big lounge chair when Lucas came in late that afternoon.</p><p>As always, Kai’s heart leaped at the sight of him. Lucas came over to sit on one of the sofas. “Are you all right?” he asked.</p><p>“Yes,” Kai said quietly. “I’m fine.”</p><p>“No pains?” Lucas asked solicitously. “I’m trying very hard not to think about any of the...issues...between us. I hate the thought of you in pain.”</p> <p>“None,” Kai said, lying only a little. He was beginning to be able to live with the discomfort. It wasn’t too bad so long as he kept busy. “I practiced with the bow you bought for me today.”</p><p>“You did? Did you have a good day then?”</p><p>“Oh yes, fine. Maybe a little...”</p><p>“A little what?”</p><p>“A little lonely. But I understand you have to work, and the other mates are all off on trips with their spouses. I’m fine, really, but I was thinking. Maybe I could come with you sometimes? To the mines?”</p><p>Lucas shook his head. “It’s really hot and dirty. I don’t want you in that kind of environment.”</p><p>“Oh. All right then.” He chanced another plea. “I wouldn’t mind. I’d try not to get in the way.”</p><p>“I said no.” Lucas said sharply and then shifted uneasily as he glanced down at Kai. “Don’t look like that. I want you to be with me, but it’s not a place for you. Some of the workers are very rough men.</p> <p>The way you were brought up—I’d be too worried about you to be able to work.”</p><p>“It’s all right. I understand.”</p><p>“Look, I was thinking,” Lucas said, leaning forward. “You said once that Scythians don’t have any household pets.”</p><p>“That’s right.” Kai said. “Animals are for outside,” he said firmly, repeating the words Merrial had told him so many times.</p><p>Lucas smiled. “Not always. When we were kids, Blayde and I had a windiga. Do you know what that is?”</p><p>When Kai shook his head, Lucas continued. “They’re pets—about so high,” he held his hand out by his knee, “with lovely brown fur. They’re fiercely loyal and surprisingly gentle to their owners, though they can be vicious to outsiders. It’s all in the way they’re trained, of course. My foreman told me his windiga had kits not long ago. He said you could have one, if you like. I thought it might be good for you, and they make very good watch animals. I like the idea that he can protect you when I’m at the mines all day.”</p><p>“But won’t they make a mess in the house?”</p><p>“Not if you train them properly. They’re very intelligent and easy enough to train. I can show you. If you want.”</p><p>“Yes,” Kai said, nodding. “When can I have him?”</p><p>“I’ll bring him home tomorrow.” Lucas stood up and held out his hand. “Let’s eat something. I’m starving.”</p><p>Kai followed his mate into the kitchen area and watched while he pulled two dinners from the cabinet. Kai had never seen these kinds of dinners before he came to Lycanus 3. They were already prepared, ready in seconds and absolutely delicious once they were put through the food processor, a small appliance on the countertop. He usually let Lucas pick out the dinners for him, since he had no idea what most of them were anyway. So far, he liked the Lycan food and almost always ate whatever Lucas fixed for him.</p><p>Lucas pulled out some kind of small red fruit and popped one inside Kai’s mouth. It was deliciously sweet and so juicy. The sweet liquid stained his lips. “Do you like them? They’re kaiberries,” Lucas said with a grin.</p><p>“Kaiberries?” Kai looked up in delight. “Like my name?”</p><p>“Yes, exactly. They have a very short growing season and are considered a delicacy.” He leaned over and licked the juice remaining on Kai’s lips. “Absolutely delicious,” Lucas said, and Kai felt a blush starting on his neck and working its way up.</p><p>Kai picked up a berry and held it out teasingly in front of Lucas’s lips. He’d only recently felt bold enough around his husband to tease him a little. Lucas seemed to like it. He opened his mouth to take the berry, but Kai held onto it, keeping the sweet, red berry just at Lucas’s lips. “Wait,” he said, “Hold the berry between your lips a moment.”</p><p>Lucas widened his eyes, but did as Kai asked, holding the berry between his lips and quirking up an eyebrow. Kai leaned forward and nibbled at the berry, feeling the juices running down his and Lucas’s chins, feeling Lucas’s soft lips against his. Lucas moaned, and Kai nuzzled his nose in closer, taking the last bite in his mouth, and licking the juice carefully off Lucas’s lips. He sat back and looked up at Lucas innocently. “There,” he said. “That’s the way to eat a kaiberry, I think. And you’re right. They’re quite a delicacy.”</p><p>Lucas swallowed hard and took Kai’s face in his hands. He bent his head and took his mouth, making a little sound that was half-groan, half-growl. “Dinner later,” he said hoarsely and hauled Kai across the counter into his arms. Grabbing the berries off the counter, he pulled Kai down the hall toward the bedroom. “I can think of another way to eat a kaiberry,” he said, and Kai squealed and pretended to try and get away.</p><p>Throwing his boy onto his stomach in the middle of the bed, Lucas ripped at his clothing before turning his attention to his own. When he had them both naked, he looked down at Kai and saw him laughing up at him over his shoulder, sticking his ass up in the air and wiggling it.</p><p>Almost mad with desire, Lucas fell down behind him and pried open the cleft between his pretty, round ass cheeks. Burying his face in the crevice, he laughed to hear Kai scream and wiggle as if he were trying to get away. He raised his head slightly. “Oh no, you started this. I was perfectly happy to eat my dinner, but you had to get cute. “He bent back to his task, swiping his long tongue all the way up from the back of Kai’s heavy balls to the round little pink nub that was his prize. He grabbed a berry or two from the carton on the bedside and stuck them just inside the little wrinkled hole. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kai squealed again when he felt the icy cold berries and tried to buck him off, but Lucas simply enjoyed the ride and then spanked his bottom a couple of times. He bit his ass cheek. “Stay still, boy. Accept your punishment for teasing me,” he said, laughing. He bent to his task, nibbling and biting at the sweet berries, licking them from Kai’s delectable ass. Kai was moaning and alternately sticking his little ass back up higher and then trying to pull away. Lucas held him still as he ate several more of the berries, enjoying Kai’s screams and groans.</p><p>When he had Kai trembling and thought his boy’d had enough, he licked the juice off Kai’s balls and his thighs and reached beneath him to grab his rigid cock. “Had enough, baby? We can save the rest for later if you want.”</p><p>Unable to speak, Kai nodded frantically, and Lucas moved up behind him, turning Kai to his side and spooning him. He slid his cock inside Kai as he stroked his shaft, setting up an unhurried rhythm that soon had Kai gasping.</p> <p>“I-I won’t be able to last,” he said, moaning and trying to thrust harder in Lucas’s hand. “Please, please, Lucas, I’m going! I’m going!”</p><p>Lucas smiled against the nape of his neck and crooned in his ear. “You mean you’re coming. So do it. Go ahead. Come in my hand, baby.”</p><p>Kai writhed in his arms as the first wave of his orgasm hit, screaming out his name. He seemed to be hit again and again by fresh waves of the climax, and he reached behind him, gripping Lucas’s hip as if reassuring himself Lucas was still there, still with him, watching over him.</p><p>Seeing Kai’s pleasure brought Lucas to the edge too. He pushed harder into Kai, beginning to pound into him, making him arch his back and cry out. He pushed himself in so far his balls were resting against Kai’s ass. Kai surprised him then by snapping his hips back at him and with a harsh cry, Lucas slammed into him so hard the bed shook. His hips jerked as his cock throbbed over and over inside Kai, filling him with his cum.</p><p>They both lay spent in the aftermath of the storm, and Lucas was physically incapable of pulling out. He felt himself softening, and made himself stop stroking Kai, because he knew how that could become almost painful once he’d come so hard. Finally, he was able to move, and he slid out of Kai and off the bed, going into the bathroom to clean up. He brought a cloth for Kai and tenderly washed him and moved him away from the red berry stains on the sheets.</p> <p>“I hope the cleaners can get that stain out,” he said with a laugh, and Kai looked down at it and blushed.</p><p>“Oh no, what will they think?”</p><p>“They’ll think we spilled some juice, baby. What do you care what they think?” He pulled him from the bed. “Come on. I’m still starving, and I need to feed you.” He pulled Kai along behind him, but stopped at the doorway and looked at him very seriously. “I think, considering your reaction to the berries, that I need to visit the fresh market more often. I had no idea the Scythians were so fond of fruit.”</p><p>“Oh yes,” Kai said solemnly. “We love fruit.”</p><p>“Hmm.” Lucas started out of the room again and stopped. “How do your people feel about vegetables? The cucumbers they eat on Earth are very nice.”</p><p>Kai nodded solemnly. “I’m always open to new things. You know the kinds of things I like to eat.”</p> <p>“Oh, these wouldn’t be for eating. Not at all.” He laughed at the curious expression on Kai’s face and led him to the kitchen.</p><p>Chapter Four</p><p>Kai bent over to scoop up the mess his little windiga left on the floor of the kitchen. He didn’t want Lucas to see it and perhaps get angry at his little pet. Kai had named the female windiga, Merri, after his old nurse and friend Merrial, whom he still dearly missed, despite her foolishness. She’d been almost a second mother to him over the years and he missed seeing her every day.</p><p>He snapped his fingers at his pet now, like he’d seen Lucas do, and she followed him eagerly from the room and outside to one of the trash containers at the back of the house. Kai didn’t bother to snap the leash on her—they were just going right outside and she’d been getting really good about minding him when he gave her little orders lately, like to sit or stay. He didn’t anticipate any problems with her now, and she hated the leash so much, digging in her little paws and pulling back against it until Kai was afraid she’d choke herself.</p><p>It was a gorgeous day outside, the sun beating down as mercilessly as ever, but there was a bit of a breeze coming out of the north that made the morning pleasant. Later in the day, the temperatures would rise, but for now, it wasn’t too bad, and Kai lifted his face up to the sun to enjoy the warmth.</p><p>He snapped his fingers again and started back toward the house, thinking he might go in the pool for a while before it got too hot. Merri trotted along behind him. Gazing across the courtyard to where Blayde and his mate Ryan lived, Kai wished they were at home. Blayde and Ryan chased bounties all over the galaxies and were gone sometimes for quarter cycles at a time. Kai had met Ryan briefly when he’d first arrived on Lycanus 3 and had liked the young man right away. He was such a pretty little thing, and being around him made Kai wish he wasn’t so tall and big boned. Maybe if he were petit like Ryan and Nikolai’s mate, Prince Jagger, Lucas would be as crazy about Kai as the others were about their mates.</p><p>Not that Lucas didn’t like Kai, or at least he certainly seemed to like the things he did to Kai in the bedroom. But there was something missing—a look in the eyes of the other mated pairs that Kai never saw in Lucas’s. He supposed it was because of the things he still couldn’t bring himself to tell Lucas, for fear it would bring down retribution on his mother.</p><p>Kai plopped down on the back steps and idly petted Merri’s thick fur. He wanted to tell Lucas everything—he had a nagging feeling that some of the things he’d been taught about the goddess might have been lies. And if it was all lies, then every day, every hour he hesitated, innocent boy babies could be lost. Not re-assimilated into the goddess’s body, like he’d always believed, but terminated, ended, destroyed. His mind shied away from the idea—it was too horrible to contemplate. The headache started back up again and he rubbed at his temple. He wished he knew the right thing to do.</p> <p>A loud wail at the end of the alley caused him to put up his head as a large, black windiga yelped at his pet again and bounced away, heading down the alley at a fast clip. Instantly, before he could grab for her, Merri took off at a rapid pace, chasing the other animal. Kai yelled for Merri to return, but she kept going, so he had no choice but to take off after her.</p><p>They were headed away from the back of the houses, out into the desert. He could see Merri up ahead, still following the large black windiga, and she was getting farther and farther away from him. The rocky ground was hard to run on, and he kept tripping over small rocks and stumbling into small depressions in the earth.</p><p>Kai had been trained as a hunter, and was used to running long distances after game, though not in this deep sand. It made running much more difficult. He was so intent on keeping his footing and catching up to Merri that he had gone some distance before he pulled up to look around behind him. Surprised at how far he’d come, he had a momentary twinge, thinking Lucas wouldn’t like him being so far out in the desert alone, but he could still easily see the city, so he wasn’t afraid of getting lost. There wasn’t much out here, really, except the volcanic rocks. When he turned back, Merri was out of sight.</p><p>Kai turned and began running again, up toward the high hills in the distance, the direction in which he’d last seen Merri. He figured she’d tire soon, and then she’d need him to carry her back home. He glanced up at the sky. It wasn’t even midday yet—he had hours before Lucas would be home. If he was lucky, he could catch up to Merri soon and get back with her long before Lucas got off work. He tried to put on a bit more speed and scanned the horizon in front of him for some sign of his little windigo. Thus, he failed to see the storm clouds that had begun to gather behind him to the south, and never even realized it was about to rain until the first big drops hit the back of his neck, and he stopped to look up at the threatening sky.</p><p>Just this side of frantic, Lucas tightened his grip on the steering wheel and drove through the desert, looking for any sign of Kai. Beside him, Larssen scanned the horizon with his night vision scopes and spoke very little. Lucas figured Larssen knew how close he was to losing it, and was trying to give him a chance to pull himself together.</p><p>After searching all night the night before, and most of the day, Lucas was getting badly frightened. The search parties, though still actively looking for Kai, had all come up empty. The anger Lucas had felt at first had quickly shriveled up to this cold feeling of dread that they wouldn’t find Kai alive. He knew it was probably unreasonable, but he couldn’t shake it, and the idea was making him feel desperate.</p><p>Lucas and Larssen were searching the northern perimeter again because of a chance remark Kai had made once about the forests. Rising up from the deserts, the foothills to the north of Balenescu City were covered in scrub brush, graduating to a thin treeline and then, as they rose higher, thick, green forests where the underground water sprouted out in rivers and streams. Kai had been fascinated by the forests, so much like his home planet. He’d said he’d like to go to them one day and do some hunting with his bow. Knowing it was highly unlikely Kai would have taken off on his own to hunt, Lucas still needed to check out every possibility, no matter how slim. He was running out of ideas. Kai had been missing for almost thirty hours, and despite the best efforts of the search teams, they’d found no sign of him.</p><p>Lucas discovered him gone when he returned from the mines in the afternoon the day before. The doors were open, the compnet was turned on, but there was no sign of Kai and his little windiga. At first, Lucas thought he might be out walking the animal, but when he failed to return, he went out looking for him. His failure to find Kai anywhere precipitated this search and these escalating feelings of panic.</p><p>At first when he’d found Kai gone, Lucas had feared a kidnapping, but search animals had tracked Kai directly north from their home to the desert. It was there, in the rocky terrain, that they lost the scent. The northern perimeter had been thoroughly scoured and they had come up empty-handed. Now other teams were searching the desert in various directions, but Lucas had a nagging feeling that Kai might be somewhere in the forests to the north. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“When you find him, you need to tan his bottom for causing so much trouble,” Larssen said teasingly, no doubt trying to lighten Lucas’s mood, which had gone from brooding agitation to near full-blown terror in the last few hours.</p><p>Lucas snorted. “If I find him, you mean.” He’d meant that to come out in the same tone as Larssen’s remark and was surprised to hear a little sound like a sob just there at the end.</p><p>Larssen gripped his knee. “We’ll find him. He’s a smart boy. He probably took shelter from the storm that came through, and he’s waiting for daylight to start back home. You know, the winds didn’t let up until midday today, and then the temperatures dropped. He’s probably staying warm and getting his bearings before he starts back.”</p> <p>Lucas nodded, though his mind conjured up far more lurid scenarios. His mind kept playing images of Kai injured and bleeding somewhere, needing his help. He saw him falling from a cliff, or attacked by wild animals. His Lycan wolf had been trying to force the change on him all afternoon, so it could run howling to the woods to search for its mate. If he thought it would have done any good, he’d have already shifted, but he knew his best bet to find Kai wasn’t on foot, at least not yet.</p><p>“The forests are ahead. Pull out the map again, and let’s figure out which trails he might have taken.”</p><p>“I was thinking,” Larssen said. “The search party went along this main trail, but there’s a smaller one on the far northern side that would be worth taking a look at. Maybe we can find some tracks or pick up his scent.”</p><p>Lucas nodded, his stomach in knots. If Kai had taken the trail, he might be able to catch his scent—he’d know that sweetness anywhere—but he was afraid the rains had wiped most of it out. If he’d ever had any doubts about how he felt for Kai, they were all gone now. He was beginning to feel like someone had reached into his chest and ripped out his heart, but he was still somehow walking around. Or like he’d felt once during the cliff diving he’d done on a vacation on Milanos Minor, when the sea was rushing up to meet him, and he knew he was about to slam into it, but there was nothing he could do to stop it. If he lost Kai, it would finish him, plain and simple. He swallowed down the bile that was rising into his chest and kept driving.</p><p>Kai gazed out toward the headlights coming toward him from the direction of Balenescu City and sighed. He knew he was in big trouble, and there was no way out of it. That was more than likely Lucas driving toward him so fast, and though he was happy to be rescued, he knew he was in for it. His stomach had been killing him all day, so he knew exactly how angry Lucas must be at him, and he dreaded facing that anger almost as much as he yearned to see Lucas. He’d spent a long, miserable night and day in the forest and he was more than ready to be back home. He was tired, hungry and terribly thirsty, and he wouldn’t even mind the tongue-lashing he was about to get, just so Lucas would take him home—not much, anyway. He just hoped Lucas wasn’t too angry at him.</p> <p>He’d followed Merri into the woods and chased her into the bushes when she ran away from him. He was so intent on finding her that the storm was on top of him before he knew it, only becoming aware it was so close just minutes before it hit. The trees started whipping their branches around, trying to warn him of the storm’s stealthy approach, and he realized then how much darker it had gotten. He stepped out in a clearing to see the dark purple clouds roiling almost directly above him. Rain was so infrequent on Lycanus 3 that this was the first storm he’d experienced here, so he didn’t quite know what to expect, but he knew he had to find some kind of shelter away from the trees by the looks of the lightning lighting up the skies. This looked like a really bad one.</p><p>He doubled back to a stream he’d just crossed that was down in a gully with sheer rock sides. Thinking he might find some kind of cave or at least an overhang in the rock wall, he made his way back toward it and spotted a good sized outcropping a little way downstream. Climbing down to it proved tricky, though, when he lost his footing on the slippery walls and crashed down into the icy stream below, twisting his ankle and soaking his pants. He got himself up, hobbled down to the overhang and hunkered under it just as the storm hit in earnest. The winds were violent, but he had some shelter from the rain and the lightning under his rock outcropping. He was already pretty much soaked by that time. It passed through after an hour or so, but by that time, it was beginning to get dark and Kai’s ankle was throbbing. He decided he’d better stay where he was until morning, even though he knew Lucas would be worried about him.</p><p>As it got darker, the temperatures dropped, and he started to shiver. He had no way to start a fire, especially with everything so wet around him, so he hugged his arms around himself, curled up and tried to go to sleep, despite the shudders that wracked his body. He awoke a short time later to something hot and wet on his face, and he jumped up, startled and overjoyed to find Merri licking him with her big, black tongue. He wrapped his arms around her, alternating between scolding her and kissing her. She settled down beside him, obviously as happy to see him as he was to see her. Her thick fur and body heat helped to keep him warm until first light when he managed to climb out of the gully to find his way back down the mountain.</p><p>Fashioning a lead out of his belt, he looped one end of it around Merri’s collar so she wouldn’t run away again, but he had trouble locating the trail where he’d followed her up the mountain. After stumbling around half the day looking for it, stopping often to rest as his ankle swelled again and set up a painful throbbing, he’d finally found a clearing in the trees and located the city in the distance, so he knew what direction to go in, at least. Since then, he’d given up on trying to find the trail and made his way down through the thick trees toward the direction of Balenescu City.</p><p>It was slow going and had taken him most of the day, but he and Merri finally made it almost down the mountain. It was growing dark and he was wondering if he should try to make it across the desert in the dark, with his ankle in such bad shape, or wait until morning. It was then that he spotted the lights of a vehicle coming toward them fast. He watched the vehicle’s approach across the sand and started to limp towards it, shouting and waving his free hand in the air.</p><p>What looked like one of the all-terrain vehicles suddenly veered directly toward him and Kai stopped and stood still as it approached. As it got closer, he could see Lucas behind the wheel with his cousin, Larssen, sitting in the seat next to him. Lucas’s face was much stormier than any of the clouds he’d seen the day before, and Kai squared his shoulders, preparing himself for the tongue lashing that he knew was headed his way. He just hoped a tongue-lashing was the only kind he’d get.</p> <p>When Larssen yelled, “I’ve spotted him! He’s there, up ahead,” something icy and brittle turned loose in Lucas’s chest, and he was able to take a deep breath for the first time that whole, long day. Whipping the ATV around in the direction Larssen was pointing, Lucas raced toward Kai, relief that he was safe and fury that he had scared him so badly flooding him in almost equal measures.</p><p>He could see Kai up ahead in the headlights, just standing there, holding onto his little windiga by some kind of strap. Lucas threw the vehicle in gear and was out of it and running toward Kai almost before the wheels stopped spinning. His wolf clamored at him, and for once, Lucas unleashed him and let him have his way. Kai startled when he saw what was coming for him, his eyes round with horror. He stumbled backward a few steps, holding up his hands defensively.</p><p>Roaring at him, Lucas, who was by this time fully shifted into his Lycan wolf, swiped his hands out of the way and fell on him, taking him down to the ground on his back. He tried to keep the bulk of his weight off him, but he was pretty far gone by this point, and his wolf was almost out of control. Lucas heard Kai yelling and felt blows on the side of his head, but he sank his teeth deeply into the side of Kai’s neck to hold him still as his body rutted at Kai’s. A big hand came down on his shoulder and he lifted his head to see Larssen yelling something at him. He became aware of the little windiga going crazy next to him, too, nipping at his side and trying to protect Kai. His wolf didn’t comprehend much of anything at that point except claiming his mate, and he showed his teeth to Larssen, growling over Kai.</p><p>Larssen shifted too, and shoved him off Kai, then hunched protectively over the boy, snarling. Furious that Larssen would come between him and his mate, Lucas’s wolf leaped on him and a vicious struggle ensued. Since they were both alphas and more or less evenly matched, it could have gotten very violent, very fast. But when Lucas pinned Larssen on his back, some semblance of reason came back to him before he did him any serious injury, and he managed to push his wolf away and force the change on himself.</p><p>Lucas surged to his feet, shaking his head to clear it and saw Kai limping into the desert to get away from him. It took him only moments to overtake him, but Kai turned on him as he caught up to him, his chest heaving and blood running down his neck from the open puncture wounds on his throat. Thank the gods Larssen had interrupted him before he could do Kai any real harm. He would never have knowingly hurt Kai in either his Lycan or humanoid form, but his overreaction to finding him could have injured the boy. The sight of the blood on Kai’s neck horrified Lucas.</p><p>“Baby,” he said. “Come here.”</p><p>Kai drew back a fist and slammed it into Lucas’s nose with such force that Lucas fell backward, stunned.</p><p>“Get away from me!” Kai shouted, his voice raspy and breathless. With a jolt, Lucas realized Kai had never seen his wolf before, though surely he’d known that the Lycans were shapeshifters.</p> <p>Kai stood over him in a fighting stance, his fists up to cover his face. When he saw Lucas make no effort to stand up and fight him, he backed a few steps, then turned and tried to run again, limping badly on one of his ankles.</p><p>“Kai, stop running, please!” Lucas sprang to his feet and ran after him, grabbing for Kai and wrapping his arms around him, holding Kai’s arms down by his side as he struggled violently. With his arms wrapped around Kai’s chest, Lucas could feel his heart racing wildly as Kai shouted and struggled. He bent his head to Kai’s throat, bathing it in his saliva so it would heal quickly. When Kai realized he wasn’t trying to hurt him anymore, he relaxed a little, even turning his head in what Lucas’s inner wolf recognized as submission. It helped calm Lucas, and he crooned to Kai as he tended him and held him in his lap. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After several minutes had passed, Lucas became aware of Larssen standing nearby, and Lucas turned to him, his eyes pleading with him to forgive him and understand that he’d been out of control. Larssen put a hand on his shoulder. “It’s all right. I knew you didn’t realize what you were doing.” He glanced down at Kai, whose face was red and furious, his eyes tightly shut, his face scrunched up and full of tension.</p><p>“Kai, it’s all right now. Lucas is back to himself, and he’s not going to hurt you.”</p><p>“Get away from me, both of you. You’re both monsters.” Kai’s voice was calmer, but still hoarse and breathy. Lucas kissed the side of his face and whispered to him.</p> <p>“Baby, you know we shift to our wolves when we’re angry or upset. I thought you understood that. We didn’t mean to frighten you.”</p><p>Kai opened his eyes and glared up at him. “Who said I was frightened? I was startled—shocked, that’s all. It’s nothing I’ve ever seen before. And you tried to kill me.” His voice broke on the last few words, and he turned his face away again.</p><p>“No, no, Kai. I didn’t mean to hurt you. I’ve been—upset. I’ve been looking for you everywhere. I thought you were lost.” Lucas could hear his voice rising, and made a conscious effort to calm himself. It was suddenly all he could do not to shake Kai to make him understand that he could never disappear like that again, but he clamped down on his anger, not wishing to frighten him any further.</p><p>Kai nodded, and turned his face away, doubling over and hugging his stomach. He closed his eyes. Lucas kissed him again on the side of the face, trying to ease his pains, but Kai pushed him away.</p><p>Larssen patted Kai’s shoulder as well, turning an accusing look on Lucas. “I’ve got the windiga in the vehicle. Take care of your boy.” He glanced down at him again. “He’s obviously in pain and frightened half to death. Come when you’re ready.”</p> <p>He headed back to the vehicle and Lucas took a deep breath. “Kai,” he said softly. “Kai, I can’t tell you how sorry I am for hurting you and scaring you like that. I didn’t mean it. I let my wolf get out of control. I’m so sorry, baby.”</p><p>At the use of the rare endearment, Kai opened his eyes and stared up at him accusingly. “You attacked me,” he said, pushing at his chest. “I thought you were trying to kill me.”</p><p>“I know it must have seemed that way to you, but my wolf was claiming you. He was trying to mate with you, not kill you. I-I should have had better control, but I was...I was so...” He sagged a little in exhaustion. “There’s no good excuse for my actions.” He stood up and hauled Kai back to his feet, still holding onto his wrist, realizing that he was absolutely incapable of turning Kai loose.</p><p>The sheer violence of his feelings scared him a little. He was the alpha and he should never allow his feelings to overwhelm him so, but he couldn’t help it. He’d known the attraction to Kai was strong from the first time he’d seen him, but he’d fallen totally in love with this boy when he wasn’t looking, and the idea scared him to death. He took another deep breath to calm himself and tried to make his voice non-threatening.</p><p>“Where have you been, Kai?”</p><p>“Up there,” Kai said, gesturing toward the mountain with a jerk of his head. “Merri ran away, and followed another windiga up in the forest. I was chasing her.”</p> <p>“You mean to tell me you came all this way over that damn little...” Lucas could hear himself getting loud again, so he made another conscious effort to calm down. “Did you ever think about coming back and letting me know, so I could go after Merri for you?”</p><p>Kai looked confused. “No. I was perfectly capable of going for her, and you were at work. I didn’t want to disturb you. I used to go on hunts that lasted for days, Lucas. I know what I’m capable of. I would have been back sooner if not for the storm—oh, and I twisted my ankle when I fell.”</p><p>“Fell?” Lucas looked him up and down. “That’s right, you were limping. Where are you hurt?”</p><p>“Just my ankle.It’s nothing, really, but it’s a little swollen so I had to take it slow this morning. Then I couldn’t find the trail again, so...I know it all sounds dumb now, because you’ve probably been looking for me some. I hope you didn’t have to take a whole day off work.”</p><p>Looking for him some? Hope you didn’t take a whole day off work? Could he be serious? Lucas had shut down the entire mining operation for over twenty-four hours and had most of the pack out scouring the area for him. He rubbed a hand over his face and pulled Kai gently toward him, checking first to make sure he came willingly. After scaring him so badly, he wouldn’t have blamed him if he’d shied away and never spoke to him again. Kai allowed him to draw him closer, though, and even pressed his face into Lucas’s neck. “I just want to go home. I’m thirsty and hungry.”</p><p>Lucas sighed, kissing the top of his head. “Yes, Kai.We can go home.”</p><p>“What’s the matter, Kai?” Ryan asked, using the tiny remote device to flip through the choices on the screen of the vid machine. “Not in the mood for a vid? We can just talk, if you’d rather.”</p><p>“No, it’s not that,” Kai said, scratching furiously at his upper arm. “It’s just that I’m so furious at Lucas for putting this thing in me.”</p> <p>“The locator chip?” He came over to inspect the swollen place on Kai’s arm. “Oh hells, they’re not so bad once the scab heals over. Blayde put one on me a while ago.”</p><p>Kai’s mouth fell open. “And you allowed it? He put a chip in your arm like you were some kind of pet animal, and it doesn’t make you angry?” He tightened his jaw. “I tried my best to kill Lucas, but he gave me some kind of sedative. Damn him.”</p><p>Ryan shrugged. “Kai, listen to me. You have to understand the reason behind it. The family is so well known and powerful that the mates are at risk for being kidnapped and held for ransom. Or even worse. It’s kind of a long story, but when Blayde and I first got together, I was running away from this powerful official of the Alliance. The guy had everyone fooled, and he’d killed my best friend and then blamed it on me. Blayde took me back to Earth to try and clear my name, or at least get me immunity, and while we were there, I was kidnapped by the bastard who accused me. Thank the gods Nikolai was kidnapped right along with me and they had no idea of just how fierce the Lycans are. He saved me from being raped and killed before Blayde found us.”</p><p>“Oh dear goddess,” Kai said softly. “But no one’s after me, Ryan. The whole thing’s stupid.”</p><p>“Look, you were a member of the royal family back home, right? So you must have had guards and stuff, all the time.”</p><p>Kai shrugged and nodded.</p><p>“Well, things are more relaxed around here, but Lucas is still our leader—our alpha. That’s the same as royalty in the Lycan world. Would you rather he put guards on you to follow you around all day?”</p><p>Kai, not ready to give up his anger at Lucas just yet, pursed his lips and stared out the window.</p><p>“So when Blayde wanted to chip me,” Ryan continued. “I didn’t put up a fuss. The Balenescus are bounty hunters, you know, along with their other enterprises, and chip prisoners all the time so that if they escape, they know just where to find them again.”</p><p>Kai crossed his arms and huffed out a breath. “I’m not a prisoner either. Though I’m beginning to feel like one.”</p><p>“No, of course not, but the chip helps Lucas keep you safe, at least in his mind. He was pretty frantic when you got lost in the woods.”</p><p>“I wasn’t lost, I keep telling everyone. I’m not an idiot, and I was heading back home when they found me. I had a little trouble locating the trail, but that’s to be expected, surely. I’m not familiar with these woods on Lycanus 3. But I located the city and I’d started walking back when they found me. I just hurt my ankle, that’s all, and I was walking slowly.”</p><p>“Oh, you don’t have to explain it to me.” Ryan said. “It was Lucas who was going ballistic.”</p><p>“What does this mean, going ballistic? You mean he was angry? I know.” Kai folded his arms across his chest and got a hurt expression on his face. “He attacked me when he found me, and bit my neck. “He turned to show Ryan the healed over puncture wounds that hadn’t quite faded yet. “See what he did?”</p><p>Ryan raised his eyebrows. “Wow, he really was torn up if he tried to give you the mating bite again. Was he in his Lycan wolf?”</p><p>“Yes, it frightened me half to death. I’d never actually seen that before. I knew they shifted, of course, but to actually see it...And to see it coming after me! I admit I panicked a little. Then when we got home, it was even worse. He put me in his bed and made love to me for hours. So long, I think I passed out for a little while.”</p><p>Ryan’s eyebrows shot up. “Ooh, nice. Fucked unconscious. It’s been a while since Blayde did that to me.”</p><p>Kai felt the hot stain of a blush on his cheeks. “He must have gone to sleep that way because when I woke up he still had his—you know, his thing—still up inside me, and his hand was holding onto my flesh. The one between my legs,” he whispered conspiratorially.</p><p>“Your flesh? His thing? Honey, don’t you even know what to call your dick?”</p><p>Kai felt the hotness spreading over his face. “Ryan. It’s not nice to talk like that. Yes, I know the names for it—Lucas has told me, but I was brought up not to discuss such things. Besides, isn’t a cock some kind of bird? Why would you give it a name like that? And a prick is a cut and Dick is a man’s name. Aren’t they? I just don’t understand all these names you have for it.”</p><p>Ryan laughed so hard he fell down on his back on the sofa. Kai smiled at him indulgently. “I know you’re laughing at me, but it’s true. I don’t understand.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m sorry, Kai. I don’t mean to laugh, but what you say is true. I never thought about it like that before. It doesn’t really matter what you call it, does it? Just so long as you enjoy it.”</p><p>“Anyway, since that night, Lucas comes to our bedroom every night to make love to me and then goes to sleep. He never sleeps in the spare bedroom anymore.”</p><p>“You should be happy about that,” Ryan said.</p> <p>“I am. Or I was until he wanted to put this chip in my arm. But I don’t understand. If he’s so angry at me for going after Merri, why does he want to love on me all the time?”</p><p>“Well, you scared him. He thought he’d lost you. You know he had the whole pack out looking for you, and he even shut down the mines—he never shuts down the mines.”</p><p>Kai tilted his head, his mouth falling open. “He did? But he didn’t tell me any of this. Why would he do such a thing?”</p><p>Ryan smiled. “Because he’s so crazy about you, you big dummy.” He socked Kai lightly on the arm to show him he was teasing. “Blayde said he’d never seen Lucas so upset. He was frantic when he couldn’t find you.”</p><p>“He was?”</p> <p>“Of course he was.”</p><p>“No,” Kai said, shaking his head. “He lusts after me, but I think he doesn’t really like me. He hates the idea that my mother tried to trick him and make him think I was a female.”</p><p>“I think you’re wrong.” Ryan looked at him curiously. “But why did she do that, Kai? Can you tell me?”</p><p>Kai shook his head stubbornly. “No. I can’t tell anyone. I’m sorry, but if I told someone, and it got back to the wrong people, my mother’s life could be in danger. I just can’t.”</p><p>“It’s okay. I understand. But there’s one thing I learned since I’ve been with the Balenescus and that’s the fact that they can always surprise you. Just when you think you have them all figured out, you find out that you don’t. Sometimes Blayde overreacts, for example, and blows up, but once he calms down, he can really be wonderful. They only overreact because they care so much. Lucas is a good alpha and a good person. Don’t be afraid to trust him with your secrets.”</p><p>Kai shook his head. “He’d never understand this one. It goes against Alliance law, and you know how he is about that.”</p> <p>“In the meantime, you’re letting this secret of yours tear the two of you apart. Give him a chance, Kai. You’ll be glad you did.”</p><p>A small device on Ryan’s wrist sounded a beeping tone, and he glanced down at it. “There’s my lord and master now,” he said with a laugh. “I guess Blayde’s got the prisoners ready for transport. We’ll be gone for a while, but think about what I said, okay?”</p><p>Kai nodded and Ryan gave him a quick hug and took off to find his mate.</p><p>It was that same afternoon that Kai got the message from his mother. It wasn’t long and chatty like her usual messages. It simply stated that she was no longer the queen, having abdicated in favor of his sister, Princess Delanon. Kai had known this time was coming soon, but it still surprised him a little. She had told him soon after he’d arrived on Lycanus 3 that Delanon was pregnant, but he hadn’t realized so much time had passed. She must be ready to have her baby by now. The gestation period for Scythians was three quarter cycles, and with a start, Kai realized he had been on Lycanus 3 for well over two of them. Still, it seemed to Kai they would have waited until after his sister was delivered of any children to ascend to the throne, and he wondered at the timing.</p><p>The next message he received was from his old nurse and body servant Merrial, and it was just as cryptic. Toward the end of the message, she had written a few lines that made Kai instantly uneasy and worried.</p><p>Princess Delanon has had unfortunate news. Her child, according to the physicians, will not be a person. As soon as it is delivered, it will be re-assimilated into the goddess. When your mother asked her to consider sending the child away, Delanon was not pleased.</p><p>Not a person? In Scythia, that could mean only one thing—the child was a male. All the doubts he’d been harboring since he’d left Scythia came rushing back. The priestesses told the women that Scythian males were brain damaged and defective, but surely Kai wasn’t the only exception to this rule. He knew he was intelligent and Lucas had carefully taught him that his genitalia were nothing to be ashamed of either. Truly, though Lucas’s were a bit larger, they looked very similar, and Lucas seemed to like them very much. Ryan had even shown him some of his porn vids, as he called them, and Kai’s were no different than Ryan’s or the other humanoids in the vids. So what made them so defective?</p><p>Again, the blasphemous thoughts assailed him so strongly he felt a little sick. What if the goddess’s teachings were wrong? What if all those children hadn’t had to be re-assimilated? The idea was staggering in its enormity. He felt uneasy to even think such blasphemous thoughts.</p> <p>Why was Delanon really taking the throne from his mother so soon? Delanon had long cultivated a following among the guards. Was she staging some kind of coup? And was she doing it because her mother had blasphemed the goddess by suggesting she spare her male child from re-assimilation?</p><p>A half-buried memory came back to Kai as he sat there wondering. Once when he was a small child, he’d asked Merrial what it meant to be re-assimilated. She had shaken her head and told him to be quiet, but her mate, Lythiquo, had looked troubled.</p><p>“Tell the child the truth, Merrial.”</p><p>“Hush, Lythiquo. We don’t know anything for sure. It’s all rumors and lies. It has to be. Besides, it’s forbidden by law to speak of such things.”</p><p>Lythiquo had put a hand on Merrial’s arm. “My friend Gasheea worked in the temples. She has seen with her own eyes the priestesses carrying them to the secret chamber. They were also carrying ceremonial knives, Merrial.”</p><p>Merrial pulled her arm away sharply. “It’s the foolish prating of slaves, that’s all.”</p><p>Lythiquo dropped her head. “Like me...”</p><p>Merrial looked shocked and pulled Lythiquo into her arms. “No, darling, I didn’t mean it that way.”</p><p>They had kissed then and made up their argument, but the memory came back strongly now to Kai. They were carrying ceremonial knives. Kai got a chill down his spine so strong it shook him to his core and he shuddered with horror. A strong voice behind him made him jump in his seat.</p><p>“Kai? What is it? Are you ill?”</p><p>Lucas came up behind him and put his hands on Kai’s shoulders. He glanced down at the compnet screen in front of Kai. “What’s the matter, baby? Did you get bad news from home?”</p><p>Without a word, Kai turned and buried his face against Lucas’s stomach, throwing his arms around his waist. He nodded and Lucas rubbed a slow circle on his back. “Tell me, Kai. Let me help you.”</p><p>Kai tilted back his head and gazed up at Lucas. He saw nothing in Lucas’s eyes but concern. Taking a deep breath, Kai made his decision. “I need to tell you, Lucas. Tell you everything. I’ve been so confused and worried about my mother, but-but now I think she may be in danger because of this secret, in a way.”</p><p>“You can tell me anything, Kai. I’ve told you that so many times.”</p><p>Kai shook his head sadly. “I’m afraid when you hear what I have to tell you—I’m afraid you’ll never want anything to do with me or any other Scythian ever again.”</p><p>Lucas sat in his chair on the command deck of the star cruiser, leaning on one fist, brooding and silent. They would enter Scythia’s atmosphere by morning, and beneath him in the decks below, slept an entire army of Alliance forces.</p><p>The preliminary strike force, masquerading as an Alliance inspection team, had been hastily assembled in the short span of time since Kai had informed Lucas of his suspicions, but other star cruisers were standing by for his signal, ready to launch a full invasion, if necessary. Lucas would speak to the new queen soon by satellite transmission, to see if she was amenable to an inspection of the temples. If she resisted in any way, he was fully prepared to force the issue, with full Alliance backing.</p><p>Lucas had been placed in charge of the preliminary force because of his close connection to the royal family, and Alliance officials still had hope that the children who were rejected were simply ferried off planet by the priestesses. The idea of the wholesale slaughter of thousands and thousands of innocent children, right under the collective nose of the Alliance, was simply unthinkable. If it were found to be true, retribution and justice would be swift and merciless.</p><p>Kai had cried himself to sleep the night before, though he’d tried to hide it from Lucas, probably thinking Lucas would call him unmanly. The truth was, Lucas could well understand how he must be feeling. If the suspicions he conveyed to Lucas were confirmed, then his mother and sister would be arrested and made to answer for their crimes under Alliance law—this meant almost certain execution. Since Delanon had so recently ascended to the throne, there might be a chance of leniency for her, but Kai’s mother had been monarch for over thirty years. During that time, how many children might have been murdered?</p><p>The queen had to have known of the temple practices—she had saved her own son, after all, while allowing countless others to be slaughtered in the name of her religion. If what Kai told him was true, she’d also made a bid to save her grandson, but the plan had backfired. According to Alliance sources, there had been a takeover, with the dowager queen now confined to her rooms, and Queen Delanon was due to deliver her child any day. They needed to get to her before she could turn the child over to the priestesses.</p><p>Kai’s planet would undergo vast changes when the Alliance took over. The Scythians would more than likely remain under martial law for the conceivable future, and the population would be required to undergo re-education for years. While the Alliance would make no efforts to change natural sexual orientation, it was to be hoped that with re-education and counseling, the women of Scythia would accept males on their planet again one day without rancor, and their society would allow natural heterosexual relationships to be accepted once again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>All in all, the changes would be vast and far-reaching, and would take many years to accomplish. After all was said and done, it was Kai who had blown the whistle, and caused the changes to be made. It would have been daunting without the very real possibility of his own mother’s imprisonment and execution—the mother who had saved him and given him to Lucas as a mate, thereby inadvertently bringing about her own destruction.</p><p>Kai himself, though a royal, would be immune from prosecution. Lucas had made this deal with the Alliance officials an absolute prerequisite for his and Kai’s cooperation and information. He’d done it because he loved Kai, no matter what. The Balenescu curse, as well as his own feelings made anything else unthinkable, but he had barely spoken to Kai since the night he’d made his tearful confession. Rationally, he knew Kai had no real knowledge of anything to do with the priestesses—in fact, he was a victim of the ugly bigotry himself, forced to hide who he really was for all those years. If they’d known about him, he would have been murdered too, and that thought gave Lucas a chill down his spine.</p><p>His own words to Kai came back to haunt him, though. You can tell me anything. Anything, that is, except the fact that your people are fucking child murderers. Don’t tell me that because I cannot handle it. No matter how much I love you, how much I keep telling myself you’re a victim, I keep hearing the screams of those other tiny victims in my head—all those babies who were being slaughtered as I enjoyed your beautiful body.</p> <p>The night Kai finally told him, he’d said it was only after he’d married Lucas and come with him to Lycanus 3 that he’d understood. It was then he realized most of what he’d been told all his life had been terrible lies told to cover up what the priestesses were really doing in the name of the goddess. He said that at first he thought the goddess would strike him dead for even thinking such things, so he’d pushed the thought away and refused to believe it. And there was his mother to consider.</p><p>And though Lucas’s rational mind reminded him of all this over and over, the idea that Kai knew and hadn’t told him sickened him, and he hadn’t been able to forgive Kai—or himself. He hoped, in time, he would be able to, but for now, he could hardly bear to be in the same room with Kai.</p><p>When he’d left Kai in his quarters to come to the comm deck he’d tried to be quiet and not awaken him, especially since he knew it had taken Kai such a long time to go to sleep. Kai rolled over to his back, though and raised himself on his elbows. “Are we there yet?”</p><p>Lucas shook his head, still putting on his shoes. “No, but it won’t be too long. It will be mid-morning Scythian time when we arrive and open up a channel to the planet.”</p><p>Kai sat up, plucking at the blanket, avoiding looking directly at Lucas. “Could I—would it be possible for me to go down with the inspection team? I-I need to see my mother.”</p> <p>Lucas paused and looked over at him incredulously. “You know that’s not possible. Don’t be foolish.”</p><p>“Lucas, my mother was raised to believe the same things I was. Maybe she didn’t realize...She could have been lied to by the priestesses, too, couldn’t she?”</p><p>“Then she and her lawyers can make that case to the judges at her trial.” Lucas stood up and walked toward the door. “Don’t waste your sympathy on her, Kai. Think about the lives your people have taken over the years. That’s what you should be worried about.”</p><p>“Lucas...”</p><p>The plaintiveness in Kai’s voice brought Lucas up short at the door. He stopped and inclined his head back toward the bed, waiting.</p><p>“Lucas, she’s my m-mama.”</p> <p>The raw grief in Kai’s voice made him sick at his stomach, but he steeled himself to it. He knew he was punishing Kai—punishing himself too—but he couldn’t make himself unbend. “I know. I’m sorry. I have to go, Kai. Try to get some sleep. ”</p><p>“Wait!”</p><p>He turned to see Kai still sitting up in bed, his arms wrapped around his midsection, rocking himself a little. “You hate me now, don’t you, Lucas? I can see it in your eyes, hear it in your voice when you speak to me. I’ve really lost everything, haven’t I?”</p><p>Lucas wanted to go to him, take him in his arms and tell him how much he loved him. He wanted to, but he couldn’t. Not yet, at least. Still he couldn’t bear to leave him like that either. He walked slowly toward the bed and sat down beside Kai. He shook his head and mumbled something like, “Don’t be foolish,” taking Kai’s hand. He tried to kiss him tenderly, to let the love he felt for him communicate itself to him, but when he touched him and inhaled his sweet scent, a powerful lust for his mate swept over him. He pushed Kai to his back and tore away the sheet. He’d taught Kai to sleep naked since he’d found him, and the sight of his beautiful body, already half-hard for him undid him even further.</p><p>Lucas pulled his pants down around his thighs and fell on top of him, grinding against him, his copious pre-cum spreading over Kai’s groin. He wrapped his hand around Kai’s cock and stroked it, pleased to feel it become rigid against his stomach. He got to his knees with a growl, pushing Kai’s legs back. He spit in his hand and rubbed Kai’s hole, but that was all the lubrication he’d get—he was too excited to wait.</p><p>Plunging into him, he felt Kai’s tight ring pop as he entered him. He hesitated for just a moment, allowing him to adjust to his size before he thrust in one smooth, hard motion. Kai cried out, but did nothing to resist the invasion. Kai was breathing rapidly, but he was still with him, still seemed to be caught up in Lucas’s passion. His grip was tight on Lucas’s shoulders, and he thrashed his head on the pillow, moaning. Lucas began to fuck him in earnest, pulling out almost to the tip of his cock and then sliding back in again. Kai was grunting with each thrust, so Lucas pulled him up a little higher to change his position and reach his prostate. When he nailed it, Kai screamed and arched his back. Pulling him up higher on his lap, he impaled him there, using his strength to pull him up and then push him back down on his cock over and over again, picking up the pace until he was fucking him rapidly, really pounding him.</p><p>He’d never been so rough with Kai before, so out of control, but he couldn’t seem to stop himself or even slow down. He did have the presence of mind to wrap his hand around Kai’s erection and stroke him, keeping time with his own deep thrusts, but he was pretty far gone in his lust. In moments, Kai cried out and came copiously, his cum splashing up over his stomach and chest, even hitting him on the face. Lucas leaned forward to lick it from his chin and at the first taste of Kai’s musky sweetness, he came hard, his cock throbbing and pulsing with each thrust. When he was finally spent, he collapsed against Kai’s chest. He still held him on his lap, and he wrapped his arms around Kai’s shoulders, holding him close. He felt Kai’s tears splashing down on his back and he pulled away to peer into his eyes.</p><p>“Don’t cry,” he ordered. “Men don’t cry, Kai.” Kai turned his head away, gulping hard, his breath hitching. He laid Kai down on the bed and got up, wiping at himself with the sheet. He went into the bathroom to clean up, wetting a cloth with warm water to bring to Kai. He cleaned him tenderly while he lay on his back, his hand over his eyes. When he finished, he stood regarding him quietly for a moment before turning back to the door.</p> <p>“Get some sleep. We’ll be there by morning.”</p><p>A hand falling on his shoulder startled him from his thoughts and made him turn to see his cousins, Kyle and Nikolai behind him. Nikolai was holding out a cup of coffee to him. “It’s not Lycan tea, but maybe it will do. This coffee is all they had in the commissary, but it’s pretty strong,” Nikolai said. “And hot, at least.”</p><p>Lucas nodded, reaching for it thankfully and taking a sip.</p><p>“You’ll need the caffeine. You should have gotten some rest before morning,” Kyle said. “We’re entering the Scythian atmosphere, so your conference call to the Scythian council isn’t far away.”</p><p>“I’m going to try not to tip our hand. I’ll ask them to allow an inspection team to land first, tell them it’s routine, and a new Alliance regulation. They won’t be happy about it, but I think they’ll agree, with restrictions on the temples and the palace. The team can pretend to make a cursory inspection. Then when the Scythians drop their defensive shields to allow them to come back up, we’ll send down the first wave of the invasion team to force a real inspection. They’ll take over the palace and the primary temple and be able to run things from there. If they find the evidence we think they will, the rest of the strike force will be right behind us. In the meantime, we’ll put the queen and the council members in the dungeons below the palace, as well as the dowager queen, Ashlan.”</p><p>His cousins nodded solemnly and Nikolai cleared his throat and looked uncomfortable. “That’s Kai’s mother, right? How’s Kai doing anyway? I haven’t seen him at all since we left Lycanus 3.”</p><p>“That’s because I confined him to quarters. His meals are being brought to him.”</p><p>Nikolai looked startled. “Confined to quarters? He’s your mate, Lucas.”</p><p>“I’m well aware of what he is to me, Nikolai. I don’t need you to remind me,” Lucas snapped.</p><p>Nikolai raised his chin and stared Lucas down. “No matter how upset I was with Jagger, I’d never leave him alone to suffer like that. With you being so upset, the pain must be pretty bad, and this is his home—his mother and his sister we’re talking about. That’s a little hard-ass even for you, isn’t it, Lucas?”</p><p>Lucas snarled at him, barely keeping his temper in check. “Why the fuck do you think I’m sitting up here instead of down there in my quarters getting a little sleep? It’s precisely because I am upset with him and it’s hard to control it. The distance mitigates the pain a little, at least.”</p><p>“Not much,” Nikolai said with an accusing snort. “The poor kid must be feeling awful.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah, well, if the poor kid had been honest with me from the beginning, there’s no telling how many lives we could have saved. It’s been three quarter cycles since we mated. Three!”</p><p>“But he didn’t know for sure, did he?” Kyle asked. “Didn’t he believe the lies the priestesses were telling everybody—that the babies were being re-assimilated or some such and then reborn as females?”</p><p>“That’s what he says, yes.”</p> <p>“But you don’t believe him?” Kyle asked.</p><p>Lucas sighed. “I don’t know what to believe anymore. I’m keeping some emotional distance until I can get a little perspective and get my emotions under control.”</p><p>Kyle jammed his hands down into his pockets and looked miserable. “I’m sorry we had a hand in bringing this about, Lucas. If we hadn’t been so insistent about you getting a mate...”</p><p>Lucas shook his head. “Don’t be ridiculous. He’s my mate, Kyle. My fated mate, according to the fucked-up curse, and if I hadn’t met him then, I probably would have some other way. At least I hope so.” Lucas blew out a long breath. “I love him, damn it. And most of the time I realize it wasn’t his fault—they brainwashed the kid since he was born. Made him pretend to be female, for the gods’ sake. No, intellectually I know he’s innocent, but I just wish he’d told me—trusted me sooner.”</p><p>“Can you really blame him, Lucas?” Nikolai asked softly.</p> <p>When Lucas angled a surprised and furious glance at him, Nikolai held his ground and glared back at him. “You practically attacked him when he admitted to you he was a male that first night, remember? Then again when you found him after he got lost? He confided to Jagger and the other mates how you treat him sometimes. How you imply you’re angry that he deceived you and make him feel he’s not manly enough. Then you expect him to trust you? To turn over his own mother like it’s nothing? I think you’re asking rather a lot, don’t you?”</p><p>Lucas glared at him for a long moment before deflating like a balloon with the air let out. He put a hand to his forehead and leaned into it. “You’re right. How can he possibly love me? I’ve been such an asshole.”</p><p>Nikolai grinned. “You won’t get any argument from me there, but you must have done something right. Jagger says Kai’s crazy about you.”</p><p>“He is?” Lucas raised his head and stared urgently at Nikolai. “Did he say so?”</p><p>“Don’t you two talk at all?” Nikolai said, laughing. “Yeah, he said so.”</p><p>“I need to talk to him before this all goes down. While the team is on its way down to the planet, I’ll go talk to him and apologize if he’ll still speak to me.”</p> <p>Kyle squeezed his shoulder. “He will. You’re doing the right thing.”</p><p>“I know. I only hope I can make him understand.”</p><p>Nikolai looked down at the timepiece on his wrist. “Well, if you want to talk to him before the team lands, you’d better hurry. They’re loading up in the bay now. They’ll be launching shortly.”</p><p>Kai stood somewhere in the middle of the crowd of soldiers, over a hundred of them, filing into the shuttle craft. His heart was racing, and he kept his head down in case someone recognized him. He didn’t think it was likely, though. Lucas had confined him to his quarters from the moment they’d come on board, and many of the soldiers he was standing in line with were the hastily assembled Alliance forces from various planets, including Earth. A fortunate thing, since even though he had the height of the Lycans, he didn’t have their bulk. In this mixed force, however, he blended right in.</p><p>He pulled the helmet a little lower over his face anyway and shuffled slowly forward with the others as they took their places on board the ship. He couldn’t help wondering what Lucas would do when he found him missing. He’d be angry, of course, but maybe it would be a relief to him. What Kai was doing was an act of treason he couldn’t very well ignore.</p><p>He’d have an excuse now to put Kai aside and be released from his vows. Ryan, Jagger and Ethan had tried to tell him about the mating curse of the family, but Kai hadn’t really believed it. Besides, Lucas didn’t feel about Kai the way their mates felt about them. That much had always been obvious, even though the last few days before he’d finally confessed his suspicions to Lucas had been...but no use to think of that now.</p><p>After Lucas left him that morning, it had finally become crystal clear to Kai what he had to do. He had to get down to the planet, find his mother and sister and warn them of the impending invasion. Lucas said they wouldn’t destroy his planet, but he’d heard stories about the Alliance aggression before he’d come to Lycanus 3. If even half of what he’d been told was true, he doubted his planet would survive, but at least he might be able to save his mother. He didn’t—he couldn’t—believe she had known about the children. If he could get to her before the main strike force landed, he might be able to help her escape and find sanctuary at some planet that was not in the Alliance.</p><p>Having made his plan, it had been simple enough to carry it through. When the soldier brought his breakfast tray an hour before, Kai had been waiting for him. He’d hidden behind the door and struck him on the head with the slender iron bar from the closet used to hang up clothing. He’d only stunned him, of course, but it gave him time to strip the man of his uniform, take his weapon and tie and gag him with strips he’d torn from the sheets. He’d left him there, locked in and made his way below decks without any challenges. Once he found the crowded locker room where the soldiers were changing into their combat gear, he’d picked up a helmet and a jacket and blended in with the others. If his luck held out, he’d be on the planet’s surface before anyone even knew he was gone.</p> <p>Taking his seat on board with the others, he fastened the safety belt around him and then waited nervously for take-off.</p><p>“The transport is ready to launch, sir.”</p><p>Lucas glanced up from his screen and nodded. “Good. Give the signal.”He turned to Kyle and Nikolai. “Well, looks like my talk with Kai will have to wait until this is over.”He turned back to the screen that showed the huge doors of the cargo bay slowly opening and the shuttle craft launching from its decks. It quickly cleared the ship and began making its way to the surface of the planet, while Communications opened a channel to the council. The face of a council representative quickly came into view.</p><p>“Good morning. We’ve received your hail and have dropped our shields to allow your shuttlecraft to enter our airspace. May we ask the nature of this visit?” The woman looked angry, her face stiff and unyielding, but that was to be expected. The Scythians had never liked surprises. It was easy now to see why.</p><p>“The Alliance is conducting random surprise inspections of planets in the system. A new Alliance regulation, and we’ll try to be as unobtrusive as possible. We’ll need access to a few of your military facilities, of course, and the palace itself. ” Lucas kept his voice disinterested and slightly bored. He had no wish to tip their hand, if this was to fall into place the way he’d planned.</p><p>“New regulation?” The emissary raised one eyebrow. “We were not informed of this new regulation, or of this visit.”</p><p>“No,” Lucas replied. “Surprise inspections are not usually announced beforehand.”</p><p>The Scythian’s face turned red and her lips tightened, but she’d been well trained. She managed to incline her head gracefully enough. “I’ll see to it that the queen is informed. “She is—indisposed at the moment, however.”</p><p>Indisposed? Having the baby that she planned to turn over to the priestesses? If so, they may be in time. “Her presence won’t be required,” he said. “The inspection team will be landing momentarily, I believe. Please see to it they’re given the access they require.”</p><p>He cut off the transmission even as the woman was trying to formulate a reply, and turned to his cousins. “See to it that the commander of the landing force sends soldiers to both the palace and the temple as soon as they arrive. Inform him that the queen may just have given birth or be in the process now.”</p><p>“Right away,” Nikolai said, turning away.</p><p>“Kyle, go below decks and make sure Kai is awake, please. I need to see if he knows how soon they turn the babies over to the damn temples after they’re born and what the usual procedure would be. If there’s any chance to save this baby, I want to make sure it doesn’t slip through our fingers.”</p><p>Lucas turned his attention back to the monitor showing the shuttlecraft landing on the planet. The doors opened quickly and the team, some hundred and twenty soldiers strong, began to jump down to the landing dock and disperse in several different directions. He watched them for a few moments, seeing them spreading out under the watchful and surprised eyes of the Scythian representatives. The cameras from the shuttlecraft showed land transports pulling up and the soldiers climbing in the backs.</p><p>His personal communication device beeped urgently and he picked it up, seeing Kyle’s name on the screen. “Yes? Is something wrong?”</p><p>“Lucas, it’s Kai. He’s—missing. I found the soldier who brought him his breakfast this morning tied up on the floor of your quarters. Kai knocked him on the head when he came in this morning.”</p><p>“What?” Lucas shouted, rising to his feet. “What are you talking about? How could he be missing?” He touched a button on his console. “Comp, give me the location of Kai Balenescu.”</p><p>The impersonal voice replied. “Kai Balenescu is not on board the ship.”</p><p>“What the fuck do you mean he’s not on board the ship?” Lucas yelled futilely at the comp. Kyle came running into the room from below decks, his face blanched of color. Lucas whirled around to look at him blankly. “How could he not be on board the ship?”</p><p>“The shuttle,” Kyle said hoarsely. “He took the guard’s uniform.” Kyle cast a wild glance down at the transport on the screen. “Lucas, he’s on Scythia.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As soon as they arrived on Scythia, Kai used the confusion of landing to cover his escape. Edging toward the end of the column of soldiers as they loaded the land transports, he ducked behind one of the trucks and made his way to the line of shuttle transports that always parked near the docks, hoping to pick up a paying fare from visitors to the planet. He slipped into the back seat of one at the back of the line, and held his weapon to the back of the driver’s head. “Drive me to the palace. Quickly.”</p><p>The driver froze in place for a moment, then Kai saw her hand moving toward her communicator device. “Don’t even think about it.” He nudged the gun into the back of the driver’s head. “Take me to the palace, I said. Do it now.”</p><p>“All right. Don’t shoot.”</p> <p>The woman, who didn’t look Scythian—probably an indentured slave—put the vehicle in gear and pulled off rapidly, glancing at him continually through the rear-view mirror. Kai concentrated on the route she was taking, making sure she was taking the shortest possible route. When they arrived at the palace, he directed the driver around to the tradesman’s entrance and waited while she lowered his window. He quickly punched in the code and shoved the barrel of the gun in the back of her head again to get her to move forward.</p><p>He directed the driver to the door he sometimes used when he went out hunting with the guards—it was a side entrance that led directly to the kitchens. Often, as a boy, he’d come in from a long day’s hunt ravenously hungry and the palace cook, a friend of Merri’s named Coova, had always given him sandwiches to help hold him off until dinner, clucking her tongue at his huge appetite and warning the princess she would soon get fat if she continued to eat so much.</p><p>He shook the old memories aside as they pulled up outside the door and turned to the driver, who was giving him baleful glares through the mirror. Kai leaned over her and jerked out the cord to the communicator on the dash. “Look,” he said to her. “You saw the soldiers landing, so you must know something is happening. Despite what you must think, I’m not here to harm anyone. I don’t want to hurt you, either, but you have to listen to me. I’m here to help the queen. If you raise an alarm, someone will get hurt. More soldiers will be arriving soon, so the best thing you can do is get out of here.” He looked her over carefully and saw that she was listening carefully to him. “I can see that you’re not Scythian, so you probably have little reason to be loyal to them. Go home and help your family. Stay inside until this is over.”</p><p>He got out of the transport quickly. There was nothing he could do to stop her from raising an alarm, but he hoped his words had been enough to frighten her into leaving quickly and going home. If not, he had his weapon, and he was prepared to do whatever it took to get him to his mother.</p><p>Running to the door, he opened it with the use of another code and ducked inside. For a moment, no one reacted in the bustling kitchen and then a woman cooking something on the big stove next to him gave a start and a little scream. He grabbed her around the neck and pulled her back into him, holding his weapon to her head. The others froze at the sight, giving distressed little whimpers and backing away from him. “No one move. I’m not here to hurt anyone, but I will if I have to. Where’s Coova?”</p> <p>A surprised grunt from the back of the room and then the tall, portly woman stepped forward, wiping her hands on an apron. “I’m Coova. What do you want here?”</p><p>“Come closer.”</p><p>She walked closer to Kai, hesitating only a little. “Let her go,” she said, nodding at the woman Kai still held in his arms. “She won’t cause any problems, will you, Hilva?”</p><p>The woman, clearly terrified, shook her head wildly, and Kai released her. Coova pulled the woman behind her and stood bravely facing Kai, her eyes sharp and angry.</p><p>“Who are you and how dare you burst into my kitchen this way?” she demanded.</p><p>Kai took a step closer and pushed back his helmet to expose his forehead. “It’s Kai, Coova. Don’t you recognize me?”</p> <p>Her hand flying to her throat, Coova took an involuntary step backwards, her mouth flying open. “But...but how? How are you here? Why are you dressed like that? Your hair. Your voice...”</p><p>Kai held out a hand to her, palm up. “I know, Coova. It must be shocking. But it’s me—Kai.”He changed his voice, using the soft falsetto he’d used for the past few years he’d lived in the palace. “Don’t you recognize me?”</p><p>“Oh, goddess,” she said, touching her head and then her chin in the sign of the old religion. “It is you. But...”</p><p>“No time to explain, Coova, but you have to help me. The Alliance soldiers are coming for my mother. I have to save her, Coova. Please help me.”</p><p>She started and then blinked at him rapidly for a long moment, but seemed to gather herself, straightening her shoulders. She inclined her head. “Of course I’ll help you, Princess. Come with me.”</p><p>Barking orders at her staff to keep quiet and tell no one of what was happening, she motioned for Kai to follow her and led him to the servants’ stairway. She whispered fiercely to him as she led him up the dark, narrow stairs. “Your mother is in Queen Delanon’s chambers. She had her child this morning, and the last I heard they were-they were waiting for the high priestess to arrive. You’d have heard about the child, I suppose.”</p><p>Kai nodded, his face a grim mask. “The priestess hasn’t arrived, though?”</p><p>“Not the last I heard. I was preparing tea for the queen to help her regain her strength, and no one indicated the need for an extra service.” They had come to the hallway outside the queen’s bedchamber, and Coova put a finger to her lips. She motioned for Kai to hide himself in the shadows of the doorway across the corridor and then eased open the door. Kai could hear soft sounds of weeping from inside the room, and watched as Coova motioned to someone inside to come to the door.</p> <p>Moments later, Merrial’s tear-stained face poked around the edge of the door. “What is it, Coova? This is not a good time. ”</p><p>Coova reached around the door and yanked Merrial by the arm. She sputtered and fussed as she was pulled out to the corridor. “Gods, Coova, can’t it wait? What on Scythia do you mean by this interruption...” She glanced up in alarm as Kai moved out from the shadows, backing away, her hand going to her throat.</p><p>“It’s me, Merrial. It’s Kai,” he said, pulling off the helmet and stepping out of the shadows.</p><p>Merrial’s eyes grew impossibly wide and she put a hand to her heart. “Kai! What are you doing here? How can this be possible?” She stepped closer to pull him in her arms and then held him at arm’s length, staring at him in dismay. “But what has that horrid man done to you? Your beautiful hair!”</p><p>Kai pulled away from her. “It’s not important, Merrial. You have to listen to me. Go get my mother and bring her here. Quickly.”</p><p>Before Merrial could move, the door behind her swung wide and Delanon herself stood framed in the doorway, her cruel eyes glittering at him. “That won’t be necessary, I think. Come in, sister. I think you and our mother have some explaining to do.”</p><p>Lucas was silent on the way to the palace. The presence of Kyle and Nikolai on either side of him in the transport normally would have been a comfort to him, but he was too firmly focused on holding himself together at the moment.</p><p>Someone—his mind shied away from the idea of its being Kai—had warned the Scythians of their intent, and there had already been some minor skirmishes near the primary temple. So far there had been no casualties and resistance had been surprisingly light. Their satellites had picked up signs of a large resistance force gathering near the palace, but from all appearances, it was disorganized and somewhat chaotic. No one had even given the order to raise the planet’s shields, so the remainder of the strike force was already on the ground. The invasion promised to be a complete rout.</p><p>In a few minutes, they’d be there and able to engage whatever was left of the Scythian forces. Was Kai involving himself in this resistance? Was it possible that he could soon be facing his own mate in battle? The idea of Kai being hurt or even—no, his mind refused to go in that direction, totally shutting out the possibility. He’d given orders to his men to make locating Kai and returning him unharmed a top priority, and he was currently on his way to make sure those orders were carried out.</p><p>He was so angry—make that enraged—that Kai had put himself in such a position that his mind could barely hold any other thoughts, especially the idea that he, himself, was mainly responsible for this cluster fuck they now found themselves involved in.</p><p>As Nikolai had pointed out earlier, he’d mishandled Kai from the very beginning, certainly not inspiring any trust, let alone love in the boy. At first, he’d let his own fucking pride get in the way. And then, after promising Kai over and over again that he could confide in him and that he’d understand anything Kai told him, he’d callously broken that promise, even as late as the night before. He heard Kai’s voice echoing even now in his head. You hate me, don’t you Lucas? I can see it in your eyes. I’ve really lost everything, haven’t I?</p><p>Rather than taking Kai in his arms and making sure he knew he’d never leave him, never stop loving him, Lucas had fucked him and walked out the door, letting his stubborn anger and pride get the better of him once again. He’d even told Kai to bottle up his emotions, like he did, in order to be a real man. Don’t cry. Men don’t cry, Kai, even if their whole world is falling apart.</p><p>If anything happened to Kai because of his actions, because of his stupid pride, he wouldn’t be able to live with this crushing guilt he was feeling. He’d die without Kai—worst of all, he’d deserve to.</p><p>Kyle leaned over and spoke quietly in his ear. “We’ve arrived. Let me get out and talk to the strike force commander on the ground. See what he knows.”</p><p>Though it was excruciating, Lucas nodded and waited the few minutes it took for Kyle to come back. They had followed the transmission coming from the chip in Kai’s arm, and traced him to this area. He must be inside the palace. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jumping back on board, Kyle came immediately to Lucas’s side. “So far, there’s been no sign of Kai, but the queen and the dowager are inside the palace. The army on the palace grounds is not as well-organized as we’d feared. The ground commander is negotiating with their leader now for a total surrender.”</p><p>“Any sightings of Kai?”</p><p>“Not exactly.The Scythian leader claimed she hadn’t seen him, but said there’d been reports from some of the staff that Kai could be inside the palace with the queen. Some of the palace kitchen staff apparently saw him going up to her rooms.”</p> <p>Lucas surged to his feet, ripping at his clothes, unable to hold the shift at bay any longer. He felt his wolf spring eagerly forward and saw that Nikolai and Kyle followed his lead.</p><p>Leaping off the back of the land transport, the three Lycans rushed through the gates of the palace grounds, the strike force falling in behind them with many of the Lycans tearing off their uniforms and shifting to their wolves as well. Moving at an incredible speed, Lucas raced toward the palace, aware of the Scythian army falling fearfully away in front of him and making no effort to hold him and his cousins back.</p><p>Once he burst through the palace doors, Lucas followed his nose, able to pick out his mate’s strong scent clearly, even inside this huge structure. Racing to the second floor, he caught the scent even stronger in the upstairs corridor. Kai must have come this way only a short time before. The scent led to a set of double doors halfway down the hallway. The three Lycans burst easily through the locked doors, but had to duck quickly as shots rang out. The bullets from the weapon hit the wall above their heads and embedding themselves in the wood above the door.</p><p>A confusion of shouting as they skidded to a stop, crouching over, and then Lucas looked up wildly and saw who had shot at him.It was Kai, standing protectively in front of his mother, holding out one of the soldier’s weapons. He had a small cradle behind him, and he was pointing the Alliance weapon straight at Lucas’s chest. Lucas straightened slowly, making all his moves deliberate and easy, not wishing to startle him into firing again. Kai stared directly at him, his eyes wide and scared.</p><p>“Kai,” Lucas tried to say in a low voice, “I’m not going to hurt you.” As the words fell on the charged air around him, he realized his voice was too deep and garbled with the extra teeth in his mouth. Lucas and his cousins stood up, panting heavily for a moment that seemed to stretch out impossibly long. With a hoarse growl, Lucas forced the shift back on himself and stood in front of Kai, naked, his chest heaving. Kai’s eyes were round with fright, but he held the weapon steadily on Lucas.</p> <p>Kai’s sister, Delanon, was standing beside him, supporting herself by holding onto the bed. Her long, white gown was stained with blood, confirming Lucas’s suspicions that she had only recently given birth. Lucas was vaguely aware of several others in the room, most of them falling away to press themselves against the walls, but he couldn’t spare any of them any attention. All of it was focused on Kai.</p><p>Kai shook the gun at him. “Get back, Lucas. Please.”</p><p>“Are you planning to use that on me again, Kai?” Lucas managed to say, his voice still a bit harsh and raspy.</p><p>“Not unless I have to,” Kai said, lifting his chin. “I don’t want to hurt you. Please don’t make me, Lucas.”</p><p>“You’ll have to kill me then. Can you kill me, Kai? I wonder,” he said, taking a step forward. “Try for the heart when you shoot me, so it’ll be quick. Mine is here, baby,” he said, pointing low on his chest. “A little different than yours.”</p><p>Kai trembled, the gun wavering in his hand. “Don’t. Please Lucas, don’t do this.”</p> <p>“You know I can’t let you go. I have to take your mother and your sister until we get this straightened out. I promise you they’ll get a fair hearing. No one will hurt either of them—do you believe me?” He took another step closer and Delanon hissed a warning at Kai.</p><p>“Shoot him, damn you. My guards will take care of the rest and we can make it to my private transport. We can get away, Kai, if you shoot him!”</p><p>Kai glanced over at her and then back at Lucas. “Give me the gun, baby,” Lucas said softly. “Can you really kill me?”</p><p>Kai held his gaze for another moment before he crumpled in defeat, dropping his arm. “No, no, I can’t.” He turned his face toward his mother. “I’m sorry, Mama. I’m so sorry.”</p><p>“Maybe you can’t, but I can,” Delanon said, raising a small gun and leveling it straight at Lucas. She’d been holding the weapon down by her side, between the folds of her long gown and the foot of the bed, so Lucas had never even seen it with all his focus on Kai. She leveled it on him and Lucas braced himself for the bullet, knowing he couldn’t reach her in time to save himself.</p><p>“No!” Kai screamed and leaped on his sister, who’d been standing only a few steps away from him. He knocked the barrel of the gun upward, and as it fired into the ceiling, he wrenched the gun away from her. She fell back on the bed, but she wasn’t done yet. The birthing knife used by the midwives to cut the cord had been discarded on a table by the bed. Delanon rolled toward it, seized this knife, and then drew back her arm to leap for Kai, screaming mostly incoherent words of hatred and jealousy.</p><p>Lucas jumped for him too, but Kai’s mother got there first, and Delanon’s blade plunged deep into her chest. Lucas heard Kai’s hoarse shout of horror as he grabbed for his mother, but Lucas reached him first. Pulling Kai into his arms, he shielded him while Kyle and Nikolai subdued his sister. By the time they were secured, and Lucas was able to let Kai go, his mother was gasping out her final breaths and died in Kai’s arms.</p><p>In the chaos that followed, Delanon and her guards were led from the room by some of the Alliance soldiers who had finally caught up with the three Balenescus. Unable to even look at the bitch who’d tried to kill Kai, Lucas had given the orders over his shoulder, looking down at a sobbing Kai.</p> <p>“Take her to a bedroom somewhere and allow her these women to attend her,” he said, gesturing toward the women who must have been the midwives, their backs still pressed to the wall. “Kyle, go with them and see it’s done properly. Just because they’re barbarians doesn’t mean we are, and she just had a child. Take the guards outside with the rest.”</p><p>Merrial stepped up beside him and curtsied. “Sir, might I be allowed to take the child somewhere and find a wet nurse for the little mite?”</p><p>Lucas hesitated, but leaned over and asked Kai if it was safe to let the woman take the baby and he nodded, still unable to raise his head. Lucas turned back to her. “All right.Take him, but not too far. Keep him here in the palace and I’ll send a guard with you.”</p><p>She wrapped the baby in a blanket and left, touching Kai on the shoulder and leaning over to murmur something softly to him. When she’d gone, leaving only Kai, Lucas and Nikolai, Lucas put his hand on Kai’s shoulder. “We need to put your mother on the bed, Kai.” He nodded and moved out of the way while Lucas and Nikolai arranged the body on the bed and covered her with the sheet.</p><p>Kai sat down on the bed beside her, and Lucas bent down next to him. Wrapping his arms around his waist, he rocked Kai gently in his arms while he grieved silently. When the Alliance doctors came in, Lucas helped Kai to his feet, had a quiet word with the doctors and then pulled Kai gently from the room.</p><p>It was only then that Lucas realized he and Nikolai were both still completely naked. Kai saw them notice and jerked his head to a room a few doors down. “That’s my old room. I probably still have some leggings in there or maybe some robes.”</p><p>Lucas and Nikolai grinned at each other over his head. Nikolai headed down the hallway to the room. “Some robes maybe,” he said over his shoulder. “Definitely no leggings, though. These Scythian women simply aren’t ready for that.”</p><p>Lucas smiled and tightened his arm around Kai. Kai looked up at Lucas and then glanced away quickly. “Will they put me in a room like Delanon or will they send me to the dungeons?”</p><p>“They aren’t sending you anywhere. You’re coming with me.” Lucas pulled him close and whispered in his ear. “You’re exhausted, Kai. I have so much to tell you, to explain to you, if you’ll let me. Come on, love, let me take you home.”</p><p>Epilogue</p><p>Lycanus 3, First Month, 2258 CE</p><p>Lucas held the baby on his lap while he played with Lucas’s fingers, putting one knuckle solemnly in his mouth and sucking it. Lucas smiled down at him, and pulled him closer to his chest. Even though he was just Kai’s nephew, he still looked so much like him.</p><p>They had just returned from his naming ceremony, performed when a Lycan child was into his sixth quarter cycle, and now Ashton Balenescu sat in his father’s lap while his other father was in the kitchen with Ryan and Ethan, preparing a family luncheon. The little windiga, Merri, lay at their feet, totally in the way, hoping to scoop up any scraps that might fall.</p><p>Blayde sat down beside Lucas, plucking the baby neatly away, plopping him down in his lap, and placing a kiss on the top of his head.</p><p>“You and Ryan should adopt your own,” Lucas said, smiling.</p><p>“No, Ryan and I travel too much. I’ll just spoil my nephew,” he said, holding the baby up in the air and making funny faces at him while the baby stared down delightedly at him.</p><p>“He just had a bottle, so if he throws up all over you, don’t say I didn’t warn you,” Lucas told him and then laughed when Blayde quickly lowered Ashton back to his lap.</p><p>Konnor sat across from them and glanced over at Ethan, who was in the kitchen helping Kai prepare lunch. “Kai said there might be more babies coming up for adoption soon. Ethan and I have thought about adopting one of them. ”</p><p>“I highly recommend it,” Lucas said, pulling the baby back into his own lap. “I suppose I’ll still have to have a Lycan surrogate give Ashton a little brother one day, but you can see what beautiful babies these Scythians produce.” He glanced over at Kai when he said it, and received a warm smile in return. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Baby, you and Ethan stop fussing with that and come over here. Blayde and Konnor are perfectly capable of working a food processor, and if they’re not, they deserve to go hungry.”</p><p>Blayde stole the baby back and danced out of reach when Lucas made a grab for him. “I’m taking him out to the pool for a little swim with Ryan and me. C’mon Konnor, Ethan, let’s throw the baby in the pool and see if we can teach him how to do the Lycan backstroke,” he said, teasing Lucas.</p><p>“Yeah, yeah, very funny. Put his hat on when you get him outside—I don’t want him to get too much sun. Use the sunscreen.”</p> <p>Blayde waved a dismissive hand at him and carried the baby out toward the pool, tossing him up in the air as he went. Ashton’s delighted laughter was the only thing that kept Lucas on the sofa.</p><p>Kai sank down beside him. “You know he only does that to irritate you,” he said, poking him in the side.</p><p>“Well, it worked.”</p><p>Kai settled himself against Lucas’s side. “Ashton’s already spoiled by you people. When you’re at work, he expects me to sit around and hold him all day like you do.”</p><p>Lucas pulled Kai over into his lap and smiled down at him while he blushed and tried to get away.</p> <p>“Well, it wouldn’t hurt you to hold him a little. He misses his father.”</p><p>Kai pushed at his chest, laughing. “I’m too big to sit in your lap, Lucas.”</p><p>“Never,” he said and leaned him back in his arms to give him a proper kiss, his hands straying down beneath the waistband of Kai’s pants. “It’s probably a very good thing you didn’t turn out to be a female—I’d have kept you breeding all the time.”</p><p>Kai punched him in the chest and pushed again to get away, but Lucas held on tightly. Still laughing, Kai subsided in his arms. “Are you going to hold me all day too, like you do with Ashton?”</p><p>“If you’d let me, I would. I came too close to losing you, baby. I’ve been working hard to earn your forgiveness.”</p><p>Kai got very quiet, and played with the buttons on Lucas’s shirt. “I do forgive you, though for a long time...”</p> <p>“I know,” Lucas said somberly. “I have to win your trust. I realize it’ll take a while.”</p><p>Kai shook his head. “It’s not that, so much, though I did think for a long time that you never loved me. I knew you liked the sex between us, but I didn’t think you loved me. Part of that was the way I was brought up—to think that who I was made me unlovable.”</p><p>“You’ve always been lovable. The fact that ignorant people made you feel you weren’t was always their problem, not yours. The Scythians let a narrow, cruel view of religion make half their people feel like defective throwaways. And the priestesses—the very ones who should have been teaching their people were the ones who were leading the charge. It still makes me sick to think of how many lives were destroyed because of them.”</p><p>Kai looked thoughtful, staring down at his hands on Lucas’s chest. “What about my sister? I haven’t even asked since we got home. It wasn’t that I didn’t care, but I couldn’t-couldn’t bear to think of her. And the priestesses? What will happen to them?”</p><p>“For now the temples have been closed and all the priestesses involved in the murders are in prison awaiting trial. Your sister is in prison too, honey, and I think they’ll all be found guilty and have to face the judgment of the Alliance Council. That will probably mean life imprisonment on one of the prison planets, at the very least.”</p><p>Kai nodded and sighed. “She was so angry, all her life. I don’t think she ever loved anyone.”</p><p>“None of this was ever your fault, Kai. I’ll spend the rest of my life trying to make you realize that and how wonderful you are. If I’d lost you...” His voice broke and he pressed his lips to Kai’s throat.</p><p>“You didn’t,” Kai said, pulling back to look into his eyes. “But I still think you need to make it up to me for a long, long time.”</p> <p>“Then that’s just what I’ll do,” Lucas said. “Starting right now.”</p><p>*THE END* </p> </body></html>"]