["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Rick Steele tipped the bottle of beer to his lips and scanned his surroundings. The famous club at the Castillo Hotel and Resort packed in both the celebrities and current “in” crowd, and tonight was no exception. The tri-level dance floor already held a rowdy group, baring more flesh than glittery clothes and grinding away with new dirty dancing. The music pounded and both male and female entertainers hung suspended in glass cages, revving up the masses as they rocked and rolled in G-strings.</p><p>He bit back a groan and wondered what the hell he was doing there. His long shift was over, and he craved some downtime. Instead, he’d let his boss talk him into a one-night stand for the evening on the pretense the whole experience would be good for him.</p><p>Shaking his head, he glanced at his watch again. He’d had a bitch of a day. Dealing cards called to his soul, but a bunch of sore losers and drunks had remained at his table to torture him. Now he waited in the trendiest club in Vegas for a woman he’d never met and tried to ignore his throbbing head.</p> <p>He curbed his impatience and took another sip of beer. Ever since leaving Atlantic City for a change of scene, he’d been grateful. Vegas satisfied his sense of adventure and hard play and the past year proved he’d made the right decision. After the breakup with his fiancée, his old friend and owner of the Castillo hotels, Jackson Castillo, urged him to start new. He’d met Jackson years ago at a mutual friend’s bachelor party, and they’d indulged in a drunken fest that rivaled The Hangover. They had emerged close friends and kept in touch. Jackson kept bugging him to deal in Vegas and work for his hotel. Rick always refused, until he’d walked in on his fiancée giving his groomsman a blowjob.</p><p>He moved to Vegas the next week.</p><p>Though it was difficult leaving his brothers, Jackson had been right. As always. He rented a beautiful apartment, made good money, and had endless women stretched out before him in one glorious chorus line. He’d moved past his heartbreak and unleashed his single status on a number of very willing participants.</p><p>So why am I unhappy?</p><p>He pushed the annoying thought away and tried to get a grip. Okay, so it had been months since he’d last taken a woman to bed. His choice. Hell, he’d thought Jackson would applaud his selectiveness instead of urging him to accept a date through Madame Evangeline’s 1Night Stand dating service. Of course, it didn’t help that Jackson met his own wife through the famous, yet mysterious, Madame. And when Madame Eve actually requested Rick to meet this particular woman, well, Jackson declared the whole coincidence a sign. Rick decided his friend wouldn’t shut up until he agreed, so he’d bitten the proverbial bullet and given in.</p> <p>His lips twisted in mock humor as he set the empty bottle down on the glass table. He wondered briefly why anyone would hand select him to meet any woman, let alone this Tara Denton—who’d apparently been through a brutal past according to the report Eve sent—and needed a tender hand. He liked to keep his distance from women. Get in and get out with his soul and heart intact. A little respect, a lot of pleasure, and no boundaries crossed. Of course, that’s another reason he’d taken a break. Easier to wake up alone than face the empty feeling of meeting a woman’s sleepy gaze and realize she’d never be the one. Or even the one for another evening.</p><p>His phone vibrated in his pocket. Muttering under his breath, he fished it out and read the flashing text.</p><p>Bonsoir, Rick. Are you ready for your adventure?</p><p>His fingers paused on the keys. A slither of unease skated down his spine. His gut screamed once he agreed, his life would never be the same.</p><p>Ridiculous.</p><p>He typed his answer with the ease of an expert and sealed his fate. Good evening, Madame Eve. I shall put myself in your capable hands.</p> <p>A smiley face popped up on the Blackberry screen. Wonderful. Your date is in the Blue Room awaiting your arrival. Right corner table.</p><p>The screen went blank.</p><p>He shook his head at the enigmatic conversation and headed past the bar. The pulsing hip hop music dimmed as he made his way through a large tunnel of elaborate glass where an impressive number of gold statues were displayed in different forms of eroticism. He took a hard left, and entered the Blue Room.</p><p>Aptly named, the quieter lounge area spilled an eerie blue light, reminding him of the Blue Grotto in Capri. The room shimmered from the floor to the ceiling with stunning crushed turquoise crystals embedded in every surface. A large aquarium tank took up one wall, displaying exotic fish in all sizes and colors, sea turtles, and stingrays. The sensual sounds of a flute and trickling water spilled from the background speakers a few feet down from the main club, and gave the impression of another reality. The room was soundproofed to close out the loud dance music and invoke a different experience. The exotic atmosphere impressed him every time he entered the themed room, even in Vegas.</p><p>He let his eyes adjust to the change of light and focused on the far right corner.</p><p>She sat with her legs crossed, neatly tucked under the glass table. A pink frothy drink rested in front of her, and she fiddled with the paper umbrella. Obviously nervous, she didn’t look up, and he grabbed the moment to study her.</p><p>God, her body was killer. The plain photo tucked into the report Madame Eve provided didn’t do her justice. He estimated she barely topped five foot, even with the three inch heels she wore. She’d obviously gone all out for their meeting, evident in the sequined silver top clinging to lush breasts, and the short black skirt she kept yanking down, revealing a good few inches of rounded thigh. She sported the perfect hour glass figure that always pushed his lust buttons, but never seemed fashionable for women nowadays.</p><p>Her hair was jammed up in some sort of elaborate design, and she wore a ton of makeup. In a few seconds, he summed up one of her problems immediately—she was a gorgeous woman who didn’t know it. She seemed uncomfortable in her flashy clothes, makeup, and heels. He bet she’d be ready to flee within minutes if he didn’t walk over and close the deal.</p> <p>He waited one beat. Two.</p><p>She lifted her head.</p><p>A strange longing rose up and caught him in a chokehold. Her eyes widened as they locked with his. The anxious worry he glimpsed deep in their depths caused a protectiveness to surge from within. His second thought centered on what she would look like when he thrust deep inside her and brought her to orgasm.</p><p>He hardened instantly. Son of a bitch. It was going to end up being an interesting night after all.</p><p>He held her stare for a moment longer. Then strode over to the table.</p><p>Tara stirred her cotton candy drink for the fifth time and glanced at her watch. He was late. He wasn’t coming. Sheer relief surged through her. Thank God she could escape to her room. Yes, a one-night stand sounded like a wonderful idea when she’d discovered Madame Eve’s service. But sitting in a trendy Vegas bar, waiting for a man she intended to sleep with, completely freaked her out. She didn’t do things like that. Hell, she couldn’t remember the last time she had on heels and makeup, let alone knew how to flirt or go to bed with a man. She’d tried though. No reason to blame herself. In moments, she’d rip off the hellish clothes and be in her comfy PJs under the covers. Alone.</p><p>She reached over to grab her purse then did one last sweep of the room.</p><p>A man towered in the entrance with an authoritative power that shot tingles down her spine. Like a deer caught in the headlights, she sensed a predator and stilled. Please don’t let this be my date.</p><p>He met her gaze head on.</p><p>Oh, God.</p><p>He looked like Thor.</p><p>Her eyes widened. He easily stood over six feet, with massive shoulders and muscled arms that seemed able to rip a tree out of the ground. Thick white-blond hair tumbled over his brow, a little long and shaggy around the edges. His face was a contradiction of hard and soft with a strong jaw, slashing cheekbones, and full lips. Black pants and a silk button down shirt only accented his power. Energy shimmered around him and pumped up the room. There probably wasn’t a female within miles who didn’t bend to his unconscious male will. The group by the bar halted their conversation to stare.</p><p>Her heart stopped—then pounded against her chest in something close to a panic attack. It was him. Why did he look so different in his picture? There was no way she’d spend a night with him. He’d tear her apart.</p><p>She reached down and gripped the edge of the table. Breathe. She’d talk to him for a few minutes, explain she changed her mind, and walk away. Who cared if he was literally sex-on-a-stick? No way would she sleep with someone more attractive than her. With her fat ass and scars, she needed someone to ease her into the experience, someone with gentleness and compassion. Not Thor, who’d burn up her panties in seconds and have her running in terror for the door. Her ex had ruined her for normal sex. She’d be lucky to get through the experience without flinching, and no way did she want to embarrass herself with this man.</p><p>He walked over.</p><p>She cleared her throat and forced herself to appear calm.</p><p>“Tara Denton?” His question was more of a command.</p><p>She had no spit left when she opened her mouth to answer, and managed only a squeak. “Yes.”</p><p>“Good. I’m Rick Steele.” His green-gold eyes gentled as he pulled back a stool and took a seat. “Don’t you like your drink? I’d be happy to get you another.”</p><p>She looked down at her barely touched concoction and shook her head. “This is fine, thank you.” She took a large sip and swallowed, as if proving her point. The sweetness was a bit cloying on her tongue, but the vodka burned hot down her throat. Since she rarely drank, she fought a cough, determined to act cool. The slight curl of his lip told her she’d failed.</p><p>He signaled the waiter over and ordered a beer. She forced her gaze upward, away from the large fingers inches from her own. Fingers that looked talented. Her cheeks heated at the sudden image of his hands gripping her hips as he thrust inside of her. She took a deep breath and discreetly wiped her damp palms on her skirt. “Well, Mr. Steele–”</p><p>“Rick.” Another quirk of amusement curved his lip. “I think we should at least be on a first name basis, don’t you?”</p><p>His drawl reminded her of smoke, sex, and sweat. She folded and refolded the cocktail napkin so she didn’t pick her fingers and ruin her new manicure. “Oh, yes, of course. Well, I just wanted to let you know it will be perfectly acceptable if you’d like to cancel. I’m not sure if you saw my photo or read my requirements, but I understand if you decide to leave after our drinks.”</p><p>He took a long pull of his beer, then pushed away from the table and studied her with interest. “You don’t like me?”</p><p>She sputtered with embarrassment. “God, no! I mean, you seem fine. You’re attractive, and I’m sure you’re experienced. But this is new to me. I just don’t think I’m the type you expected for this, for a....”</p><p>“One-night stand?”</p><p>“Yes, that’s right.” She nodded again and cleared her throat. “Please don’t feel bad. I appreciate you meeting me.”</p><p>One brow shot up. “That’s quite polite of you. But unnecessary.” A wolfish grin transformed his face. A rush of sexual heat squeezed through her blood and settled between her thighs in an ache. “You see, I’m just counting the minutes until I get you into bed.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The breath whooshed out of her lungs. She blinked in confusion. Had she heard him correctly? No, he seemed to be staring at her with an open sort of...hunger. Nerves and arousal mingled and fought for dominance. She took another gulp of her drink then looked him squarely in the eye. “Why?”</p><p>He laughed. The sound drifted across her ears in a caress, and her tummy dipped. She squirmed on the narrow seat. What’s happening to me? Her body revved like a race car ready to shoot from the starting gate. She’d specifically requested a gentle, unassuming man who could slowly introduce her again to the art of lovemaking. How long had it been since she’d desired a man? Most of the time she needed to force herself out of the physical deep freeze with her vibrator. With her ex, sex followed a beating, so she’d learned not to anticipate it. Men usually caused a fear within her that drained away any lingering passion.</p><p>But not Rick Steele.</p><p>Hell, he’d probably command her body and soul if he got the chance. His dominant personality leaked from his every pore. Why on earth would this type of man ever be attracted to me?</p> <p>She waited with curiosity for his response.</p><p>“I think the question is more like why wouldn’t I? You have a figure to die for, and in a matter of two minutes, you’ve made me laugh. Let’s just say I’m dying to find out how many shades of blue your eyes will turn when I thrust between your thighs.”</p><p>Hot color flooded her face. She shook her head and steeled herself to face the truth. Maybe Madame Eve hadn’t told him. Damn it, she’d thought the man meeting her would know a bit about her past and what he’d walked into. She gritted her teeth and lifted her chin in pride. “I’m sorry, but you must not have heard. I don’t...I don’t have a good body. Something happened to me and I have several deep scars that are quite...well, ugly. The man I met tonight was supposed to know that.”</p><p>His tawny eyes turned ice cold and his voice lashed like a whip across tender flesh. “I know about your scars. I will not allow you to call them ugly again in my presence. Scars are the evidence of survival and life. Now, I’d suggest we continue this conversation in my suite.”</p><p>He dropped a few bills on the table, stood and offered his hand.</p> <p>Seconds ticked by. She swallowed around the lump in her throat. Her gut screamed in warning. The moment she touched him, she’d lose all control over the date, and be led down a path Frost would term ‘the road less traveled.’</p><p>She placed her hand in his and allowed him to lead her out.</p><p>Chapter Two</p><p>The door clicked shut behind them.</p><p>Rick stepped back and let her gain her bearings. Jackson had set him up with the luxury suite for agreeing to meet Tara, and the opulence stunned most newcomers. He watched with amusement as she tried not to let her eyes pop out of her head. Her gaze swept over the rich burgundy carpeting, expensive watercolors, and 14-carat gold trim on the walls. The living area showcased a series of plush cream sofas with plump pillows, a large wet bar, and a private balcony that overlooked the entire skyline of Vegas. The tables were burnished mahogany and held endless vases of exotic blooms, their scent curling into the air in sensual abandon. Through the hallway, the bedroom beckoned. The oversized king bed, covered with a spread of rich silvers and gold, sat so high he’d need to lift her up. The image of her stretched naked on it teased him mercilessly. He imagined milky skin and gorgeous strawberry blonde hair fanned out on the pillow, her aqua blue eyes begging him to take her.</p><p>His opinion of Madame Eve took a positive turn. Bored for months by an endless parade of women, Tara intrigued him within minutes of speaking. She was a mixture of prickle and heat, both shy and direct. Her discomfort about her body challenged him to change her mind.</p> <p>He never backed down from a challenge.</p><p>Even now, her teeth reached for her lower lip and nibbled with worry. She picked at the edge of her nail with a rhythm that warned him she thought of running and desperately searched for a polite way to disappear. He tamped down a chuckle and made his way to the bar. “White wine?” he asked. “Pinot?”</p><p>When she nodded gratefully, he uncorked a fresh bottle and poured a glass. Her spike heels sank into the plush carpet as she took in the view from the balcony. Thousands of bright lights twinkled and flashed across the night sky, resembling exotic stars. But, the view of Vegas was nothing compared to his view of her ass.</p><p>The lush curves made his fingers itch to touch and stroke, to sink his teeth into the sensitive flesh and take a bite. His cock hardened and he battled for control. He brought her the glass of wine and hid a grin when she grabbed it gratefully.</p><p>She took a sip and then a deep breath. He waited.</p><p>“What do we do now?”</p><p>Damn, she’s cute. He loved her natural fluster and how she barreled right through her own barriers. The woman had great courage, especially if her past was accurate. He lowered his voice to a sexy murmur. “What do you want to do?”</p><p>She stepped back and caught herself. “Umm, well, I guess we get undressed, right? Would you mind dimming the lights? Or do you just want me to wait under the covers for you?”</p> <p>She wasn’t joking. Anger took hold and shook him deeply, but he didn’t reveal the emotion on his face. What asshole taught her sex was dirty? Or that she wasn’t worth any more than a quick screw in the dark? Madame Eve’s report told him of her scars, and her self-consciousness, but not how she’d received them. Had another man beat her?</p><p>He’d fucking kill him.</p><p>“Stay here a minute.” He turned on his heel and marched into the bedroom. Yanking open the closet, he took out one of his white shirts then returned to the living room.</p><p>“Honey, can I ask you to do a few things for me?” He gentled his voice to put her at ease. After a moment, she nodded. “I’d like you to put this shirt on, take your hair down and remove all your makeup.” He reached out and caressed her cheek. “Please.”</p><p>She stared at the fabric. “Why?”</p><p>He smiled at her confusion. “Because I want to see your face and I want you to be comfortable.”</p><p>He waited patiently while she digested his request. “Now?” she asked.</p><p>“Yes.”</p><p>She walked to the bathroom. In a matter of minutes, she came out and stood in front of him. “Better?”</p><p>His heart stopped.</p><p>Gorgeous.</p><p>Heavy waves of strawberry blonde strands fell over her shoulders and tumbled in abandon. Her skin glowed, freshly scrubbed of all makeup, and showed off a generous smattering of freckles across her nose. Her skin was creamy white and smooth. He resisted the urge to taste her with his tongue and see if her flavor was as sweet. Her plump lips were a pale pink. But her body....</p><p>His shirt swallowed her up, and he caught the barest shadow of nipples poking at the fabric. The hem fell past her knees, and showed off muscled calves and pretty cotton candy painted toes.</p><p>“Oh, yeah, much better,” he growled. “Turn around?”</p><p>Her face reddened, but she turned slowly in a circle to please him. Her natural manner to give struck him. She obviously liked to bestow pleasure, and probably had that gift exploited to such an extent it frightened her. As she pivoted, the line of her purple panties showed through the shirt, the full cheeks of her ass begging for his fingers. She wasn’t ready yet. He needed to relax her first.</p><p>“Do you know how beautiful you are?”</p><p>Disbelief shimmered in her eyes. “Thank you, but—”</p><p>He closed the distance between them. She gasped as he grabbed her hand and laid it on his straining erection. “This is what you do to me. From the moment I laid eyes on you I wanted you. By the end of the night, you’re going to believe it, sweetheart. Make no mistake.”</p><p>She shook hard and power surged through him. He wanted to make her scream with delight, to cry his name as she orgasmed until she couldn’t remember the last time another man ever laid a hand on her. Possessiveness was not a natural part of him, but he didn’t fight the urge. Instead, he embraced the basic male tendency to hunt. Conquer. Claim.</p><p>Her soft hand paused then gently stroked him. He groaned, and she looked up in surprise. Bolder, she squeezed around the fabric of his pants and followed the ridge from base to tip. He held perfectly still and allowed her to explore. She took a step closer, until the tips of her breasts pressed against his chest. He fisted his hands to keep from touching her. Her arms came up to hold his shoulders, her sweet breath rushing over his lips as she arched on her tiptoes.</p><p>Then pressed her lips to his.</p><p>The tentative kiss rocked his world. Her lips were soft and sweet. He allowed her to explore the line of his mouth, gaining confidence, until the tip of her tongue slowly pushed between the seam of his lips. With a low growl, he opened for her, desperately trying to hold back his instinct to throw her on the bed and dive between her legs. Her tongue swept in and swirled around his in a teasing battle.</p><p>He slid his hands down, grabbed her lush rear, and lifted her against him. She made a little mewling noise, but he swallowed it and claimed her mouth the way he craved. He drank deep, drowning in her taste as the scent of strawberries and flowers swam in his head. Within seconds, she slumped against him and surrendered, letting him drink his fill as her fingers thrust into his hair and held his head still for her own demands. Slowly, he eased back and looked down at her face.</p><p>Her lips were swollen and wet. Aqua eyes held a dazed sheen as she stared back at him. “Oh, my,” she whispered. “That was so...good.”</p><p>He laughed at her open response. “Believe me now? I want to throw you on that bed and get you naked. Touch and taste every part of your body. Then make you come so hard the only thing you can scream is my name. Get it?”</p><p>She nodded, unable to speak.</p><p>“But I don’t want to scare you. You specifically requested a man who’s gentle and non-threatening. I have some dominant tendencies, but I would never hurt you. In fact, I’d like to tear apart the motherfucker who wrecked you for sex and caused you pain.”</p><p>He watched her face carefully. There. A glimmer of arousal and need. She definitely had submissive tendencies, which he enjoyed in the bedroom. She responded to a commanding attitude but had been seriously scared off by that type of man. It was time to show her what she’d been missing with the right partner.</p><p>And he had all night.</p><p>“I have to ask you a question. It will help me if you tell the truth. Did your last boyfriend cause your scars? Did he hurt you?”</p><p>The muscles in her body tightened as if to ward off a blow. He watched her fingers curl into fists. Seconds ticked by, and she stuck her chin out in the air with sheer determination. “Yes. And because of him, I don’t think I’m going to be good at this.” Misery etched her face. “I want to. But he made me scared of....”</p><p>He battled his instinct to find the gutless coward and make him pay. Instead, he forced back the rage and concentrated on her. “Thank you for telling me. And you are going to be good at this. I’m asking you to trust me. Let go of your control and let me take care of you. I want to show you everything you’ve been missing. The moment you tell me to stop, I swear to God I’ll take my hands off you. ‘Stop’ is the word when you panic, Tara. Okay?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She chewed on her lip. Indecision flickered over her face, but she seemed tempted. He waited with all the patience and calm in the world, knowing she had to trust her gut. “Yes.”</p><p>Excitement shimmered in blue depths. Triumph surged through him. He took her hand and led her into the bedroom.</p><p>She stopped before the huge bed and swallowed back her instinct to yell stop right then. Her senses swam with the overload of visual and physical indulgence. The luxurious suite closed around her with a pull to follow her baser urges. The huge mirror mounted on the ceiling both fascinated and terrified her. Her body hummed as his fingers intertwined with hers in a firm grip she couldn’t break. Sweat broke over her as she fought the memory of another time, when she had given her trust and found everything turned against her. But for some reason, she trusted him. There was a core of gentleness within his control that spoke to her and promised no pain. Since she had signed up for a one-night experience, she’d push herself to the limits. She needed healing, and maybe the man holding her hand would be the one to finally give it to her.</p><p>“Lie on the bed, sweetheart.”</p><p>Humiliation washed over her. He’d look at her under the bright lights. His body was perfect and hers was completely damaged. Can I do this in front of practically a stranger?</p><p>He must have sensed her nervousness and dropped a soft kiss on her lips. “Turn off your thoughts and do what I say. I’ll dim the lights.” His voice raked across her ears in a low, hypnotic tone.</p><p>She swallowed then obediently climbed onto the high platform bed, laying her head on one of the stuffed pillows. Tugging the hem of the shirt down as far as it would stretch, she waited for his next command.</p><p>Amusement gleamed in his eyes. “You look like you’re awaiting an execution rather than my touch.”</p><p>“I’m so sorry,” she said. “I told you I’m not good at this.”</p><p>“No more speaking. The only word I’ll listen to from now on is ‘stop.’”</p><p>As if on cue, a rush of heat sizzled down to her pussy. Her nipples strained against the cotton of his shirt in direct response to his take charge attitude. He nodded as if pleased. Then he stripped.</p><p>The black silk shirt slid down his arms and hit the floor. His bare chest was carved and covered with golden brown hair. A thin line snaked down his tight abdomen and disappeared into the waistband of his pants. She held her breath as he paused at his belt. With quick, economic motions, he undid the buckle, slid down the zipper, and shed the material. He stood in a pair of black briefs that did nothing to hide an impressive erection. Instead of fear, she bit back a moan at the idea of having that length tight inside of her. A vibrator just couldn’t compare to the experience of a man’s body, and it had been so long....</p><p>His thumbs hooked into his underwear and her heart galloped like a pack of racing thoroughbreds. Then he revealed himself.</p><p>She sucked in a breath. Sheer, raw power beat from him in waves. He stalked over to the bed and stood proudly before her. His wolfish grin told her he liked her gaze on his cock and a drop of liquid essence gleamed from the smooth tip.</p><p>A surge of feminine satisfaction washed through her. She gripped the silk fabric of the sheets and struggled to process the knowledge that he desired her.</p><p>He placed one knee on the edge of the bed and leaned over her. She caught the scent of soap, musk and man. Blond strands framed his face as he bent forward, accenting the hard lines of his cheeks and jaw. Carved lips paused an inch from hers.</p><p>“Now it’s your turn.”</p><p>He began unbuttoning the shirt. She closed her eyes, dreading the moment of truth when he saw her naked, exposed. How often had her boyfriend called her ugly and maimed? Not worthy of his sexual attention?</p><p>“Look at me, Tara.” Her eyes flew open at his commanding tone. “Gaze on me the whole time.” She obeyed, helpless to break away. He undid each button with deliberate slowness, then raised her to guide the fabric over her shoulders.</p><p>Her bra and panties were the only barriers left between them. His gaze lingered on the scars—cigarette burns on her shoulders and breasts—the wicked knife cut across her ribs—the ugly, gouged pockmarks on the tops of her thighs. As he looked at her, she imagined her reflection in the mirror, the same one she saw every day, but she didn’t hide from him.</p><p>After a while, he lifted his head. Her breath caught.</p><p>No revulsion, no shrinking away. Instead, he stroked each nasty mark with gentle fingers. “If I ever catch him, I’ll kill him.” His dark words shocked her system like a thrill ride, but she waited for his erection to wither away from the raw evidence of violence. Waited for him to pity her and turn away.</p><p>As if he read her thoughts, his hard length pressed against her in demand. Blistering male desire gleamed from his eyes. She shook under his intense stare, her body hot and needy, and the sudden realization took root deep in her soul.</p> <p>He still wants me.</p><p>With one quick action, he unclasped her bra and removed the straps. “Fuck, you’re gorgeous.” His fingers traced the curve of her breasts and lingered on the tight tips begging for his touch. He followed one blemish down the valley of her cleavage then lowered his head.</p><p>His tongue ran over her skin, wet and hot. Her body jumped like an electrical current, and she arched upward as he licked his way around her breasts. Sensations raked over her and took merciless hold. A whimper escaped her lips. He palmed and plumped both breasts, then his lips closed around one rigid bud.</p><p>She cried out his name. The delicious sensation of her nipple rolled around between soft lips, wet tongue and sharp teeth all came together in a mingle of delight. He murmured encouragement as her mind fogged and refused to work, before giving up to the demands of her body. Finally, he lifted his head and looked down. Her swollen flesh begged for more of his attention.</p><p>“Beautiful,” he whispered. “Look how responsive you are. How sensitive. Your body was meant for a man’s hands. I can’t wait to see if you taste like strawberries.”</p><p>Her hips arched in demand. “Rick?”</p><p>He laughed low. “No talking”</p><p>He pinched her nipple lightly. Hot currents sizzled down to settle between her thighs. His thumbs flicked the peaks back and forth while his mouth moved downward to kiss her belly. Dipped into her belly button. Nibbled teasingly along the line of her panties, pulling at the edge of the elastic with his teeth. Each time the fabric snapped back, she tightened with anticipation, but he ignored her unconscious pleas and busied himself elsewhere.</p><p>He pressed a kiss to the nasty wound on her inner thigh. Used his tongue to sample the crease between her hip and thigh, while his hands moved from her breasts to cup her ass. Through the barrier of fabric, he settled his open mouth on her core. Took a deep breath—and blew.</p><p>She shot up and cried his name. His moist breath teased her pounding clit. He pushed her back on the bed and took the top of her panties between his teeth. Inch by inch, he pulled them down.</p><p>Cool air hit her exposed folds. The intense contrast of hot and cold wracked her with raw sensations. Oh, God, when was the last time a man had his mouth on me? The vulnerability of her position struck her—he had her fully under his control. She stiffened as her mind flashed an array of images. Pain. Humiliation. Betrayal.</p><p>“Tara.”</p><p>The sound of his voice snapped her away from the memories. His command brooked no argument as he looked up from between her spread thighs.</p><p>“Eyes on me.”</p><p>His voice told her not to think, dominated every part of her soul, until she couldn’t fight him, and she slipped firmly back into the present. Then he lowered his head.</p><p>His wet tongue parted her swollen cleft and dived in. Her pussy throbbed under him while he licked and tasted her juices. His thumbs parted her wider, exposing her, and she slid into surrender, glorying at her erotic abandon. The mirror on the ceiling showed his head buried between her splayed thighs, while his thumbs flicked her nipples.</p><p>She cried out and twisted against the bed, drowning in the delight of watching him command her response and push her toward orgasm. So close, she reached hard and desperately, but release eluded her. “Please!” She shuddered,, panting, as his tongue traced circles around her sex and his fingers rubbed and stroked. The exquisite tension tightened every muscle until she thought she’d die of the delight.</p><p>“Tell me what you want me to do, sweetheart. Tell me.”</p><p>“Help me! Please help me....”</p><p>“Here you go, baby.” His mouth sucked on her nub as his fingers plunged inside of her.</p><p>She came hard, screaming as convulsions shook her over and over. He milked her orgasm and drew it out, until she shattered. The sheer intensity of her climax overwhelmed her. Spent, she melted into the mattress. Sudden tears ran down her face.</p><p>He whispered her name and slid up her length. He kissed her tears away and held her tight. His muscled arms cocooned her in a secure warmth she never experienced; a promise of shelter from pain and heartbreak. Who is this man? How had he snuck past the barrier she’d erected in order to protect her heart and soul?</p><p>“Thank you.” She snuggled closer as his legs entwined with hers. His steady heartbeat thundered against her ear. A low chuckle stirred in her hair.</p><p>“Sweetheart, you have no clue how much I loved watching you orgasm. Thank you for trusting me to take you there.”</p><p>She stiffened. I never got him off. Guilt assuaged her, and she broke his comforting grip, flipping over. The gorgeous lines of perfect, carved chest muscles greeted her, and she dipped her head, kissing her way down. His breath hissed in surprise as she tried to make up for her selfishness. She ran her hands down his thighs and gripped him between her palms.</p><p>“Christ, Tara.” She opened her mouth and took him inside. His musky taste assaulted her senses. What had begun as a job turned to a desire for more, as her tongue swirled around the tip and she sucked him deep into her mouth.</p><p>He let out a curse then dragged her back up. Dread curled in her tummy as he forced her to settle against him. His ragged breathing cut through the air. Disappointment squeezed her heart. She hadn’t done it right. He’d looked pleased, but her ex had consistently told her he’d gotten better blow jobs from a doll than her.</p><p>“Dammit to hell, stop thinking!” She jerked back. He lowered his voice and spoke through gritted teeth. “I almost lost it with the first lick of your tongue. But that’s not what I’m looking for. I’m not ready to get off until I’m buried inside you, making you mine. Understand? Now get that dickwad out of your head and come back to me.”</p><p>Her mouth hinged open like a guppy. How did he know what she’d been thinking? How did he know her so well, after just an hour? And why in the world would he want her to be his?</p><p>Need beckoned and tempted like Satan offering the apple to Eve. To belong completely to a man again without fear. To give of herself without worry of being hurt. What a gift.</p><p>But one she promised herself she’d never receive again.</p><p>The truth struck hard. No matter how much satisfaction Rick Steele gave her, no matter how well he read her thoughts, she’d disappear in the morning. She would never belong to another man again. Only herself. The night was about breaking down her walls and fear of sex. She refused to spend the rest of her life cowering from a man’s touch. He’d already shown her the best orgasm of her life. By dawn, hopefully, she’d be more whole and able to walk away with a full body and heart. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alone.</p><p>He kissed her. His tongue swept in and took over, possessing every hidden nook and cranny until she dug her nails into his muscled shoulders and hung on. When he finally lifted his head, his eyes blazed with demand.</p><p>“Sex isn’t about tit for tat. Next time you take my cock in your mouth, make sure it’s because you’re dying to taste me. Not because you owe me an orgasm. Got it?”</p><p>His directness reignited the ache between her legs. She forced the word past her lips. “Yes.”</p><p>“Do you want more?”</p><p>Lust speared her belly. Her nipples rose and tightened even further. His hand flicked one swollen peak and she shuddered.</p><p>“I’ll take that as a yes. Let’s just make sure.” His fingers slid down and delved into her heat. She bucked under the sizzle of fire tearing through her center. He laughed. “Oh, yeah, that’s the spot.” He added another finger as he worked his way in and out, setting a teasing rhythm. Her over stimulated clit throbbed and burned from the attention. In seconds, she neared orgasm again, completely swept up in his voice and tongue and fingers.</p><p>He reared up, grabbed the condom packet from the bedside drawer, and sheathed himself. His hands encircled her ankles and thrust her legs wide apart. Again, her gaze snuck up to the mirror. Her pussy lay open and vulnerable to his every whim. Her swollen lips gleamed with wetness as she stared at her reflection. His huge, throbbing length lay right at her entrance, poised to push forward. She wanted him, ached, and then the memory surfaced....</p><p>A different face flashed before her, his expression twisted with rage. Ugliness. He pushed inside her, over and over, while she tried to lie still and bury the pain, her mind screaming the same word again and again.... No....</p><p>“No, stop!” The words broke from her throat and she panted, trying to push the ugliness away.</p><p>“Look at me, Tara. Now.”</p><p>She turned away from the mirror. Golden eyes met hers, glittered and seared with heat. His hands gripped her ankles, but his touch was gentle. He kept still as he waited for her to calm and direct him.</p><p>“I would never hurt you. Say it.”</p><p>She reined back sobs and shuddered out a breath. “You will never hurt me.”</p><p>“That’s right baby. Do you still want me to stop?”</p><p>She relaxed, inch by inch. Rick would never hurt her. The last of the memory leaked away and left her body open, empty, needing him to fill her.</p><p>“More. I want more.”</p><p>His hands stroked her inner thighs. His cock pushed one inch into her pussy. She moaned, past the fear, only craving the bliss he offered. Another inch. The tip buried into her wet heat. Her channel tightened and begged for more. One more inch. Another. Then....</p><p>“Ahhhhh!” She cried out as he buried himself to the hilt. His massive length and width filled her until there was nothing else left but him. She clutched his shoulders, digging her nails into solid muscle as she struggled with the invasion. The breath whooshed out of her lungs.</p><p>“Okay?” he asked between gritted teeth. “God, you feel like heaven.”</p><p>“Yes.” She lifted her hips upward. “More.”</p><p>“Here we go, baby. Hold on tight.”</p><p>He pulled completely out and surged back. The demanding pace wiped every thought out of her mind but giving him everything he asked. Again and again he drove deep inside. Her sex squeezed him and her clit pounded in demand. The tension tightened and every muscle in her body screamed for release. Still, he kept her at the edge, not allowing her to fall over, but demanded she surrender to each thrust until she had nothing left to hold back.</p> <p>Something shattered deep within her and broke free. She arched and cried his name.</p><p>“Come for me, baby. Now!”</p><p>He pinched her clit and drove his cock inside one final time.</p><p>She shattered. Her pussy milked every inch of him as she convulsed, and he followed her over with a hoarse shout.</p><p>No tears ran down her face. She succumbed to the delicious fall into a cloak of warmth and safety, and finally surrendered to the darkness.</p><p>Chapter Three</p><p>Rick smoothed back the strands of strawberry blonde hair from her face and watched her sleep. The physical and emotional release had pushed her right into slumber, and he enjoyed the soft expression on her face when her mind shut off and there were no more barriers.</p><p>In a few short hours, Tara Denton had wrecked his world.</p><p>He’d never been with a woman who gave him such an honest, open surrender. Sure, he liked to play, and enjoyed Dom/sub fun in the bedroom with willing partners. But he’d never felt so connected to another woman through physical intimacy. Not since Rebecca.</p><p>Her name skittered across his memory, but without the usual sharp pang. Her betrayal cost him big time. He’d stopped trusting and believing his partners, even in the bedroom, and that was a dangerous combination. Trust was implicit in a good relationship and he used to pride himself on his ability to sniff out a liar a mile away. He lost confidence in his own abilities, like Tara lost her trust. A wry grin crossed his lips. They made quite a pair.</p><p>He studied the scars marking her body. Rage simmered, but he clobbered it back, knowing the emotion useless. Amazing how she imagined herself to be ugly. She awed him with her strength. She endured, fought back, and survived. Each wound was a testament to her soul, and he appreciated every damn one, like a soldier overseas battling in a war.</p><p>Her eyes flew open.</p><p>He watched her thoughts flicker across her face as she realized where she was. He enjoyed the easy way she blushed, which was a total contradiction from her open response in the bedroom. The way she screamed as she came made him hard all over again.</p><p>“Hungry?”</p><p>She sat up, propped on the pillows, and peered at the plates of food on the bed. “Starved. Are we having a picnic?”</p><p>He smeared some creamy goat cheese on a cracker and fed it to her. She moaned at the taste, and right then, he was ready to rock and roll. “Just building up your energy for the rest of the night.”</p><p>A flicker of lust danced from her eyes. Yes, she was aroused at the idea of more play. He grinned and handed her a chilled glass of Pinot Grigio. “So, why don’t you tell me about yourself?”</p><p>She gave a hearty laugh. The pleasant sound caressed his ears with delight. “You probably read everything in Madame Eve’s report. There’s not much else to tell.”</p><p>The dry facts of the sheets given to all 1Night Stand participants barely scratched the surface. The black and white text told him her physical attributes, what she required in a one-night stand, and that she withstood a violent encounter she may or may not share with him. He craved so much more.</p><p>He wanted everything. Of course, he’d scare the crap out of her so he kept his tone light. “Oh, I don’t know. The report didn’t tell me how much you liked me to suck on your clit before thrusting my fingers inside you. It didn’t tell me your eyes are a thousand shades of blue and reveal every emotion, or that your breasts spill so perfectly in my hands.”</p><p>She blushed. “Okay, you win. What do you want to know?”</p><p>Evidently, she guarded her secrets well. “What do you do for work?”</p><p>Her muscles relaxed and she nibbled on some salted almonds. “I work for the local battered women’s shelter part time. They don’t have the funds to pay very well, so I supplement with a bookkeeping job. Jackson Castillo gave me a shot at his hotel, and now I’m working on my degree in accounting.”</p><p>The pride in her voice warmed his heart. Son of a bitch! So Jackson knew Tara personally all this time. How odd the man went along with Madame Eve’s request. He figured Jackson would’ve kept his buddy far away from his employees. “I bet you’re very good with numbers,” he said. “Numbers you can control. If you work hard enough, everything fits into place, with no surprises.”</p><p>Her eyes widened. Bingo. His little accountant needed a place in her life where she felt empowered. He bet she’d squeeze out every dime of profit for Castillo Resorts and admired Jackson for seeing the potential in her.</p><p>“You’re right. I never thought about it like that,” she murmured. “I was always really good in math and numbers.” Her voice drifted off as if she fought the memory of her past and she shook her head.</p><p>He wrestled with his instinct to push. God, he wanted to know every thought and every hurdle she’d gone through.</p><p>“Did you graduate high school?” he asked gently.</p><p>She smiled. “Oh, yes, with high honors. I loved school. I just never got to college because Tim wouldn’t let me.”</p><p>A dark cloud passed over him. “The one who hurt you?”</p><p>She seemed to struggle with her decision to share. Emotions shifted across her face, replaced with determination. She raised her gaze to his and looked him straight in the eye. “I don’t like to talk about him much, but I’d like to tell you the story. If you want to hear it.”</p><p>He grabbed her hand. Then squeezed. “Yes, baby. I do want to hear it.”</p><p>She took a deep breath. “I met him senior year in high school. At first he was the perfect boyfriend. Sweet, protective, caring. He took care of me. My father had taken off when I was young, and my mom wasn’t really around.” She crinkled her nose in distaste. “She had a series of boyfriends I liked to avoid, and I had no rules. No curfew, no need to show up at school. But I wanted to go to college, have a career, and be independent. I thought that’s what he wanted, too.”</p><p>He waited patiently as she paused. “Things began to change. He got controlling. Angry. Hated my friends, and refused to let me talk to other boys. He said he needed me to concentrate on him. His father beat him, so Tim moved out and wanted me to live with him. I agreed, thinking I could go to the local community college and we’d support one another.”</p><p>She swallowed. “I don’t know when I realized he changed. He flew into rages over things I did. I started getting nervous all the time, trying to do everything right. The first time he hit me, I was so shocked, but he cried and swore he’d kill himself if I left.”</p><p>Rick nodded with encouragement. He noticed she slipped into telling mode, her voice monotone. “I stayed. He began to beat me. My mother didn’t want me anymore since she was shacked up with her new boyfriend. I had no money, and Tim controlled everything in my life. I kept missing classes from the bruises, so I dropped out of college.”</p><p>“How long did you stay with him?”</p><p>“Three years. Two months. Five days.”</p><p>“How did you get away, sweetheart?”</p><p>She shuddered. “I collected change. Loose dollar bills when I knew he’d been drinking. I stashed the money in one of the tiles in the ceiling until I had enough. He always told me he’d kill me if I ever left. And I believed him. I had to be careful who I involved myself with because I didn’t want anyone else to get hurt.</p><p>“He worked at an auto shop days. He kept a close eye on me and I wasn’t allowed to leave the house when he worked his shift. But that day I did.”</p><p>She shut her eyes. He wondered what horrors she watched behind her closed lids, and his gut wrenched. “I cut off all my hair. Put on a knit cap and Tim’s clothes. Had a cab take me to the bus station. And I bought a ticket to the next town. And the next. And the next.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His eyes widened. “You just kept traveling?”</p><p>She nodded. “I traveled for two days straight to throw him off. I walked into the first church I saw and begged to be sent to the nearest women’s shelter. This was back in California. I had a different name, but I’m not that person any longer. Tara Denton would never stay with a man who raised his hand. She’s successful and making her own way. And she’ll never be caught again.”</p><p>Her last words shot at him like cannon fire. Son-of-a-bitch. She has no plans to extend a relationship past tonight. A strange panic coursed through him at the idea of letting her walk away. But her intentions had always been clear. Only his had changed. Suddenly, he wanted much more than a one-night stand.</p><p>“Do you live in Vegas now?” He stroked her hair.</p><p>“Yes. I knew I’d have a new start here. Get lost. Find my own way.” A glimmer of a smile ghosted her lips. “I like the idea of a tarnished city being my home. I can paint myself up with makeup and glitter and clothes, but in the light of day, I always felt lacking. Tim used that to keep me a prisoner.”</p><p>“But not anymore.” Pride and admiration cut though him.</p><p>“Not ever again. Now, I can give back. I stopped being afraid he’d find me. Therapy helped. But I still wonder....”</p><p>“Wonder what?”</p><p>She looked embarrassed, almost shy. “How a man like you could want me.”</p><p>Her admission rocked him. “A man like me?”</p><p>“Yeah. Beautiful. There must have been a dozen women staring at you in the bar and wondering why you were taking me home.”</p><p>Anger sizzled so hot he wanted to beat his chest like a caveman and howl at the moon in frustration. He never thought twice about how women viewed him and felt damn lucky when a female wanted him back. But evidently she saw things differently. Her sense of feminine confidence had taken such a pounding, she didn’t see what he did.</p><p>Words wouldn’t help. Rarely did. But action would.</p><p>He studied her and wondered how hard he’d be able to push without causing her any painful memories. As a naturally dominant lover, he decided to trust his gut, and watch her carefully. Lust speared right to his cock as he envisioned the scene laid out in his mind.</p><p>“Tara, did you like watching us in the mirror?”</p><p>The change of topic surprised her. She flushed, but he gave her credit—she didn’t lie. “Yes.”</p><p>He forced her chin up when she tried to bow her head. “Don’t ever be afraid to say what you want or what turns you on. I loved how you snuck glances at the mirror and watched your body respond to mine. Do you know what my first thought was when I saw you sitting at the table?” She shook her head in obvious misery. “I couldn’t wait to fuck you.”</p><p>Disbelief shimmered over her face. “Really?”</p><p>He smiled. “Really. I wanted to rip off that bra and suck on your nipples. I couldn’t wait to see the look in your eyes when you came. And when you got up, all I could think of was getting my hands on your ass. In fact, I think that part of your anatomy has been sorely ignored tonight. Let’s change that now.”</p><p>Panic flared in misty blue depths. “No.”</p><p>He arched a brow. “Why not?”</p><p>“I have more scars on my back.” Her words were soft.</p><p>“Then I’d say they need my loving attention.” He plucked the wine glass from her fingers and put it on the bedside table along with the plates of snacks. “Lie on your stomach, baby.”</p> <p>“No.”</p><p>He gazed back at her with implacable demand. “Do you want to please me tonight?” She nodded. “Then I’m asking you to trust me.”</p><p>He wouldn’t have blamed her for refusing. Instead, after a few moments, she slowly turned around and laid down on the bed. Her hands cushioned her head. Her breath came out in ragged gasps as she fought the sheer vulnerability of being naked with her secrets exposed. A deep joy and satisfaction speared his gut as he stared at the woman before him. Her pleasure came from submitting to her mate, no matter how scared she was. He swore she’d never regret giving him the chance to show her how precious she was. Her gift to him was priceless.</p><p>He took in the brutal wounds scattered over her back and ass. “What are these, sweetheart?” He pointed to the perfect circles marring her upper back.</p><p>“Cigarettes.”</p><p>“And these?” His fingers lightly traced the line of her spine and settled on the permanent welts on her buttocks.</p><p>“A whip. Sometimes a belt.”</p><p>He winced at the thought of the pain she endured under the asshole’s hands, but made his assessment as quickly and clinically as possible. If possible, her scars made him want her more, to replace the horror with memories of bliss.</p><p>“He was a sick bastard, Tara. But no one will ever hurt you again. Close your eyes and relax. Enjoy my touch.”</p><p>He moved his hands to her shoulders and began a slow massage. The stiff muscles under his fingers refused to yield, but after a few minutes, her body loosened. Her breath evened out, and her muscles relaxed with his touch. He spent a long time working her shoulders and upper back, enjoying the firm, white skin, and couldn’t help slip to the side to caress her ripe breasts. She uttered a low moan and arched upward to give him access. He slid his hands underneath and gently plucked at her nipples, circling his thumbs around the rigid peaks. With a final pinch, he returned to his main task.</p><p>He worked the indents along her spine and watched goose bumps pepper her flesh. When her body was completely under his control, he concentrated on the swell of her buttocks. He massaged the lush curves and kneed her legs apart, squeezing her inner thighs as he continued without pause.</p><p>Her musky scent greeted his nostrils. He grinned at the swollen cleft, her juices gleaming in the light. Damn, she was a responsive little thing. His cock grew to full length and pulsed with demand.</p><p>“You’re already wet for me, baby. Since you can’t see yourself, I’ll tell you what I see. A beautiful pink pussy, just begging for my fingers or my tongue. Your clit is hard but not enough. We can do better than that.”</p><p>She wiggled on the bed and he laughed low at her reaction to the verbal play. “But I really wish you could see this gorgeous ass of yours. All flushed and trembling. Arched high in the air, ready for my cock. But we have a long way to go.”</p><p>He separated the globes and blew his hot breath on the sensitive rosette between her cheeks. She bucked, but he held her down with a gentle firmness that told her she had no reason to run. He lowered his mouth and ran his tongue down the line of her ass, nibbling on the high curves as her arousal and the scent of strawberries mixed in the air. He opened her up wide and slid one finger across her slit. Her juices greeted him and he murmured his approval.</p><p>He settled his mouth over the plump, right cheek. Then sank his teeth into the quivering flesh as he plunged two digits into her channel.</p><p>She bucked and screamed. The orgasm took her hard and by surprise and he rubbed her clit back and forth, forcing her climax to extend for long, long moments. His erection throbbed with demand, and he quickly sheathed himself with a condom, rose up, and pushed his cock into her wet, tight heat.</p><p>He massaged her ass, pinching gently then moved up to play with her breasts. She trembled, not able to see where his fingers would touch her next, and satisfaction ripped through him. He drove in and out with a steady pace, and flicked the nub as it hardened and swelled again, poised for another orgasm.</p><p>“This is what you do to me, baby,” he said. “You’re beautiful inside and out, scars and all. My cock loves your juicy pussy, all tight and welcoming.”</p><p>“Please, Rick!”</p><p>He laughed as she arched her ass toward him, silently begging. “Not yet. You’re not getting off again until I’m positive you believe me.”</p><p>Sobs broke from her throat as he pulled out and flipped her over with one quick movement. He pushed up her knees and spread her legs wide. “Look up,” he commanded, then reunited them in a single thrust. Her dazed gaze rose to the mirror, the reflection of their naked, joined bodies in vivid detail. Her inner muscles immediately clenched. Yes, she enjoyed watching them. He made a note to play more with her visual senses.</p><p>He plumped her breasts and lowered his mouth to suck her nipples, tweaking the tips until they stood out, ruby red and glistening. “This is all for me,” he said, pointing to the mirror at her swollen peaks. Then he rose up and claimed her.</p><p>She cried out. He imagined the picture they made in the mirror as he varied short and hard thrusts until he found her G-spot. With a wicked grin, he pulled completely out and teased her clit with his finger, rubbing in tight circles, over and over.</p><p>“I can’t take anymore! Please, oh, please.”</p><p>“Your body is beautiful. Do you believe me now?”</p><p>“Yes!”</p><p>“Say it.”</p><p>“My body is beautiful!”</p><p>He drove in deep and hit her G-spot again.</p><p>“Ahh!” She screamed and her body convulsed around him. He kept up the pace and wrung every last ounce of pleasure from her then let himself go.</p><p>His climax shattered him. The release started from his toes and shuddered out of every pore. Her name broke from his lips, and he tucked her tight into his chest and held her.</p><p>The first weak ray of light struggled through the break in the blinds, reminding her that morning threatened. She pushed the thought away, and snuggled closer to her lover. Her body ached, but she relished her sore muscles. She’d never been so delightfully used.</p><p>Rick Steele shattered every illusion she ever believed. Her limitations with sex. The fear of her appearance. The confidence in her sexuality.</p><p>And about getting caught by another man.</p><p>Unease stirred her heart. She’d never felt more treasured or loved in her entire life. The way he touched her, spoke, and gave her satisfaction unlike anything she’d ever experienced before. Would she ever find another man in her life to match him?</p><p>“What are you thinking about?”</p><p>His low voice pulled her back into the moment. She smiled up at him, loving the golden arch of his brows, the rough slope to his jaw. She traced the curve of his lower lip and he bit down on the pad of her finger, his tongue darting out to taste. Her breath caught as her pussy clenched. He laughed, as if he knew.</p><p>“Why on earth would you ever need to book a one-night stand?” She caressed the stubble of his beard, loving the scratchiness against her fingers. “I’m sure women are begging you to take them on a daily basis.”</p><p>He laughed again and pressed a quick kiss on her lips. “Thanks, sweetheart. What a nice compliment.”</p><p>“No, tell me. Why did you do this?”</p><p>The humor eased, and she caught a glimpse of vulnerability shimmering in his green eyes. “I haven’t been with a woman in a long time.”</p><p>Her mouth popped open. “Get out.”</p><p>A ghost of a smile settled on his lips. “No, truth. I haven’t been with a woman for ten months now. My choice.”</p><p>She absorbed his perfect naked form. The man was a sex god and he’d been celibate for almost a year? Her mind whirled. “Why?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I used to live in Atlantic City. That’s where my family is from—I have two younger brothers, well, really four. Mom took in two of my best friends so I consider them my brothers also. Anyway, we all followed my father and make our living as dealers in casinos. First, my dad made us get a college degree before we were allowed to go to dealer school. In college, I met a girl, Rebecca, and we were together the whole four years. On graduation day, I asked her to marry me.”</p><p>Jealousy pierced her heart. She hated the idea of another woman being claimed by him. She locked the messy emotion away and concentrated on his story. “What happened?”</p><p>“We began planning a wedding. Moved in together. Then I came home from work early one day and found her in bed with one of my groomsman.” He gave a humorless laugh. “Talk about a cliché all the way around, huh? At least he wasn’t the best man.”</p><p>Horror filled her eyes as she imagined the scene. The betrayal he must have struggled with. Already in one night, she realized he gave his heart and soul without holding back. He’d demand the same of his partner.</p> <p>A dozen condolences skittered through her mind. “Bitch,” she muttered.</p><p>His laugh held genuine humor. “Yeah, that about says it. Needless to say, things got pretty ugly. After a few months, I realized I couldn’t handle living there any longer. I needed a change. Jackson Castillo invited me out to Vegas, offered me a job, and I haven’t looked back.”</p><p>“That doesn’t explain why you stopped having sex.”</p><p>He shrugged. “When I first settled in Vegas, I went a bit crazy. Dated a lot, experimented with different women. Then my need fizzled out, and I only felt empty when I woke up in the morning. So, I took a break and concentrated on other stuff for a while. My hand has been my new best friend this past year.”</p><p>He waggled his eyebrow in a bad Groucho Marx imitation. She giggled. “Sounds like my vibrator. It almost caught on fire these past few months and broke from overuse.”</p> <p>They laughed together. She stroked his chest, enjoying his crisp hair against her palm. “Do you still miss her?”</p><p>“No. Not anymore.” Suddenly, his gaze locked on hers, glittering with a fierce intensity. “I miss this.”</p><p>Joy broke through her at his words. Her heart pounded in confusion. What was he saying? Had he experienced the same strong connection she did? Did he want to continue when the night was over? Reality crashed around her. No. As much as she wanted more time with him, she had to stick to her plan. Work. Volunteer. College. She’d made herself a promise to never get involved with a man until she was completely whole. He’d given her a precious gift, but she couldn’t risk pushing herself. What if she was too fragile? What if he broke her heart? What if she became so enamored of him she gave up everything she was for a man?</p><p>She wasn’t ready. So, at dawn, though it would break her heart, she would leave him behind.</p><p>She pushed away the strangled grief at the idea and climbed on top of him. Surprise lit his eyes as she straddled his hips, her hair falling around his face to wrap him in a curtain as she kissed him. She gave him everything he asked for in that kiss: her surrender, her gratitude, her desire.</p><p>Her tongue swept in and she greedily tasted his dark, male hunger. When she lifted her head, her gaze burned into his with promise. “I’m doing this because I can’t stand the idea of not having your cock in my mouth.”</p> <p>He tensed at her words. And then she slipped down his body, cupped his balls, and sank her mouth over his hard, throbbing length.</p><p>He groaned. Cursed. She took her time, enjoying the taste of his salty skin, licking to the tip and then swirling around in teasing circles. His muscles locked, and her nails dug into his hard thighs. Finally, she opened her mouth wide and sucked, rubbing and stroking the underside of his cock, scraping her finger nails over the sensitive flesh of his balls, while her name rang like music in her ears.</p><p>He stiffened and grabbed her shoulders. She knew he was about to explode, but she refused to move. His excitement blended and melded with hers, and her juices flowed as she rubbed herself against his leg like a cat in heat, sucking harder, harder, and....</p><p>He exploded in her mouth. She swallowed him as he jerked helplessly under her touch and slowly eased her mouth off of his length. Sheer feminine power surged through her at his response, and in that moment she finally slew all her demons.</p><p>“What have you done to me?” he groaned.</p><p>She laughed, and resumed licking him. She stroked, rubbed, and caressed. In minutes, his cock was hard again. She fisted his powerful length, enjoying the texture of iron sheathed in silk. He lifted her in one quick movement, and settled her on her hands and knees. A tearing sound echoed.</p><p>“Rick, I, oh!”</p><p>He grasped her hips and entered her. She moaned and pushed back into his hands as he rubbed her ass. Slow, delicious strokes filled her, driving her higher and higher. Her breasts hung down free, and he played with them as he thrust in and out of her. The erotic abandon pumped through her body, tightening her muscles as she neared orgasm. She circled her hips, searching for it, but he only laughed and kept his strokes shallow enough to tease but not get her off.</p> <p>His hands pinched her nipples. Slid down her belly, and found the tight nub of her clit. He rubbed, using her juices to coat it, and tapped hard with his fingers. Sharp pleasure grabbed, attacked, and threw her over. She cried out his name and ecstasy shot in waves over her. He came again, and collapsed on top of her in the bed, their limbs entangled. Her heart squeezed with a mingle of raw emotions. Tears pricked her eyes as she held him close and wished dawn had never come.</p><p>His lips traveled over her soft skin. The heady scent of sex and musk and strawberries hung heavily in the air. He stroked her lush breasts, her silky hair, the curve of her buttocks. The red digits on the clock flashed with alarming rapidness.</p><p>He wasn’t ready to let her go.</p><p>He closed his eyes and reached for courage. His one-night stand had become much more. He wanted the chance to date her. Cook her dinner. Make love to her in the daytime. Wash her in the shower.</p><p>Would she give him the opportunity?</p><p>Since Rebecca, he’d never had a soul connection to another woman like he’d found in a single evening with Tara. He also knew in his gut she was different. He knew by experience, his ex-fiancée had always been selfish in her core. Tara held the soul of a giver, and a man would be safe offering his trust.</p><p>So, he ripped down the last barriers of his heart and uttered the words. “Stay with me.”</p><p>She stiffened and sat up. Her curls tumbled wildly around her face. Blue eyes held a mixture of emotions at his words. Fear. Hope. Joy. Resolve. “What do you mean?” she asked. “The contract specifically states by dawn we need to walk away.”</p><p>“Let’s change the contract.” He reached to take her hand. “Remember when we spoke about not getting caught? It’s too late for me. I know it’s crazy, that we’ve only been together one night. But you caught me. I want to see where this can lead. I want to see you again.”</p><p>She flinched. He fought uneasiness at her reaction and waited. It was time to push out of his comfort zone. This woman would walk away if he didn’t try and fight for her. And by God, he would give it his all before he surrendered.</p><p>Her voice broke. “I can’t.”</p><p>His gaze dared her to speak the truth. “Why? You’re attracted to me. We formed a connection last night. There’s no reason not to take this further.”</p><p>Suddenly, he knew. Her eyes filled with tears as she stared at him, all the naked emotion and vulnerability and fear on display. “I’m not ready. What you gave me tonight...the things you made me feel...I don’t think another man will ever come close. But I made myself a promise. I’m not ready to commit to someone else yet. You gave me back my body, my mind, my freedom. You changed my life.”</p><p>She closed her eyes and one tear leaked down her cheek. When she opened them, a hard resolve glimmered and shattered his heart. “But I’m too afraid. Afraid I’m not ready for a relationship. Afraid I’m not strong enough not to stand on my own. I need time. I need to find my own way.”</p><p>He looked at the woman before him and realized he’d fallen in love with her.</p><p>She was stronger than anyone he’d ever met. Sexy as hell, sweet as sugar, and not ready to give him everything. Emptiness poured into the spaces of his soul and threatened to stay. But damn, he needed to let her go, needed to give her the time to realize what he did. She had already found her own path. She just needed to trust herself again.</p><p>If he didn’t leave, he’d overpower her. Make her have so many orgasms she’d beg him to stay. Force her to accept they were meant to be together, and then she’d always wonder. So, he shoved his need and want to the depths of darkness and locked it tight, bent his head and kissed her. Her sweetness swam in his head and he breathed in her scent one last time. Then rose from the bed and dressed.</p><p>“Thank you, Tara Denton.” He paused at the door. “Thank you for giving me the best night of my life.”</p><p>He opened the door and left.</p><p>Epilogue</p><p>Tara rolled her neck in circles and tried to ease the tension from her muscles. She groaned and closed the journal in front of her, pushing her calculator aside. Between school and working more hours at the Castillo Resort, she had a serious case of tired eyes. It may be time to invest in some reading glasses. Getting up from the chair, she stretched her arms overhead.</p><p>Now, she’d be able to afford them. Satisfaction thrummed through her veins. Her work had caught the eye of Jackson Castillo, and he’d offered her a full time job, including benefits. She switched to finishing her bachelor’s degree online, which saved her commuting time, and gave her the opportunity to graduate faster. Everything she worked for finally clicked into place. She was finally happy. And almost complete.</p><p>Almost.</p><p>His face flickered in her vision, never far from her mind. Three months. She dreamed of him every night, and woke up with a fierce need wracking her body. How many times had she picked up the phone to call him? How many times had she walked through the casino, hoping to catch a quick glimpse of him, knowing if she did, she’d never be able to walk away again?</p><p>She refused to do that to him. He was probably with a woman now. She pictured him kissing her, caressing her, giving her orgasms that shimmered with ecstasy. She imagined his wicked laugh, the grin on his face as he touched her, the tender way he stroked her wounds.</p><p>She swallowed back the pain and straightened her back. It had been her decision. She had needed the time to realize she was strong enough. Funny, she’d finally been convinced that giving herself to another man wouldn’t change who she was. She’d grown up, grown strong, and stood on her own two feet. But now it was too late.</p><p>Too late to let him catch her.</p><p>She pushed away the sadness and opened the door.</p><p>“Hello, Tara.”</p><p>She blinked. Then gasped as the figment of her imagination walked into her office and stood before her. Immediately, her body softened and trembled, the intense waves of sexual energy whipping around her. God, he was gorgeous. She soaked up his figure with greed. His long blonde locks tumbled over his brow, framing glittering green-gold eyes. He wore his usual uniform of black shirt and pants, his muscles evident under the thin fabric. She remembered how he’d lifted her that night like she weighed nothing, sprawling her over his thighs as he rocked inside of her and.... </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Hot color flooded her cheeks. His lush lower lip curved upward, as if he knew her naughty thoughts. She squeezed her fingers into tight fists and fought for composure. “What are you doing here?”</p><p>“I wanted to congratulate you on your promotion. I ran into Jackson and he told me how well you were doing. Working full time now?”</p><p>The casual, polite conversation cut deep. She breathed around the pain, and ached to touch him. She dug her nails into her palms to keep still. “Thank you. Yes, I’m very excited about it.”</p><p>“Still in school?”</p> <p>He paced the small office with deliberate steps, glancing around. Stacks of papers in folders were piled on the desk, all neatly labeled and categorized. Her space was tiny, with only a desk, a few pictures on the wall, filing cabinets and a water cooler. But it was comfortable and clean and she loved every inch of it.</p><p>She watched the tight swing of his ass as he moved then bit her lip hard to keep back a moan. “Um, yes. Taking classes online now, which gives me more time.”</p><p>“Sounds like a great plan. And the shelter?”</p><p>He walked to the water cooler and grabbed a paper cup. She swallowed hard and watched his lips close over the edge as he drank. An image of his lips sucking her nipple blasted her concentration. Heat coursed through her. “Huh? Oh, the shelter. I volunteer on weekends.”</p><p>He smiled. Her heart sputtered. “That’s good news. I’m glad you’re doing well.”</p> <p>Irritation prickled her nerve endings. “Is that why you’re here? To check up on me? Make sure I haven’t fallen apart?”</p><p>“Nope. I knew you’d do fine. It’s just that time is finally up.”</p><p>She blinked. “What time?”</p><p>He grinned, a wicked, bad ass grin that curled her toes and promised all sorts of delights. “Your three months. I figured it would be long enough to convince you.”</p><p>“Convince me to do what?”</p><p>“To let me catch you, Tara.” He closed the distance between them and reached for her. The sizzling heat of his skin filled her up, made her dizzy, and she clung to him as he towered over her. His breath hit her lips and she moaned. “I wanted to give you time to realize you’re strong enough to handle me, or any man. I want to court you, make love to you, learn all your secrets. I want to know your favorite color and food, the shampoo you use, and what side of the bed you prefer to sleep on at night. I want to support you in every way, watch you graduate, and stand beside you while you fly. And then I’ll be right there to welcome you back. Do you get it now?”</p> <p>Oh, yeah, she got it. Rick Steele had given her a gift more priceless than diamonds. Time. She choked on a sob and flung her arms around his neck. And kissed him.</p><p>His taste swamped her. She thrust her tongue against his, greedy for everything he had, and he held her tight as he gave it all back. “I missed you so much,” she murmured against his lips. She stroked his face, his brow, scattering kisses over him as her heart exploded.</p><p>“Missed you too, baby.”</p><p>“Thank you for giving me what I needed.”</p><p>“Welcome. Now let’s get out of here.” He grabbed her hand and dragged her to the door.</p><p>She laughed. “Where are we going?”</p><p>“We’re going to do a little catching up. And I have some very wicked plans.”</p><p>She followed him out the door and realized he’d caught her heart the moment he’d laid eyes on her in the club. She gave a mental thank you to Madame Eve and went home with the man she loved.</p>  </body></html>"]