["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>The Proposal</p><p>My fingers moved fast but quietly across the keys of my laptop, and I’d adjusted the screen light so it wasn’t so blaring. I’d woken up in the middle of the night, wide-awake and itching to finish the chapter in my manuscript where my dad finally makes progress in his relationship with my mom. Much of what I’d written was conjecture since I only knew the basic history of my parents’ relationship, but their world, or the world I’d given them, had taken me over these past few months and I found myself enjoying writing in a way I had never before.</p><p>This often meant late-night type-fests and despite the fact that I was partially consumed by their story, I was also very much aware of my considerate bedfellow and was trying to act as he would and not wake him up.</p> <p>I’d been typing for just over an hour and finally I’d come to the end of the chapter. After saving the file, I shut the laptop down and stared at it for a while. Breathing in and out, slowly, evenly, I controlled the wound inside of me. Pain slashed me deep across my chest and when I thought on the loss of my parents, of my little sister, Beth, that cut would widen into an agonizing gash. Before my considerate bedfellow, I’d have sewn that cut completely shut and put a numbing agent over it. Now I felt it. I just didn’t let it overwhelm me by turning it into a gaping hole.</p><p>Braden helped a lot with that.</p><p>My considerate bedfellow.</p><p>Among other things.</p><p>I smiled and turned in my chair to look at him in the dark room. His bare back was uncovered, the sheets drawn up to his waist, his long legs tangled in them in the middle of the bed. We didn’t have “sides of the bed.” Braden was a cuddler—he insisted we didn’t need sides.</p> <p>He’d had an exhausting day yesterday. He’d called me late, explaining how he’d gone from meeting to meeting, and then he had been pulled into some emergency at his nightclub Fire, which turned out not to be such an emergency but a case of crap management. When he’d returned home I must have already fallen asleep but I wasn’t surprised that I woke up in his arms. Or that he’d been so tired he didn’t wake up when I extricated myself from his embrace.</p><p>Gazing longingly at his muscular back and strong arms, I wanted to slip back into bed and wrap him around me. But looking at his sleeping face in profile I stopped myself. I was afraid I’d wake him up and he obviously needed his rest.</p><p>Standing up slowly so my chair wouldn’t squeak, I tiptoed in the dark across to the bed and very gently eased myself back into it, checking constantly to make sure I hadn’t woken him as I pulled the sheets back up over me. I lay down on my side, my hand tucked under my cheek, and I stared at him.</p><p>He was beautiful.</p><p>Just looking at him caused a different kind of ache inside of me.</p><p>This was a man who’d fought long and hard to keep me, even when I was bent on self-destructing us. This was a man who understood I could be difficult and stubborn and a little bit irrational (okay, maybe a freaking lot irrational), and still loved me. I wasn’t the best at expressing my emotions. I’d spent so long guarding them so I wouldn’t be vulnerable to heartbreak that even now I wasn’t the gushy, emotional type of girl who could tell her boyfriend every single day that she loved him.</p> <p>But Braden knew I loved him.</p><p>Sometimes I wondered, though, if he knew how much. I wondered if he knew that just watching him sleep made me scary happy, breathless even. I wondered if he knew that he was absolutely, without a doubt, everything to me.</p><p>Usually that wasn’t something I’d want anyone to know because it meant admitting it out loud, and if I admitted it out loud and then lost that person, then I couldn’t pretend I’d never felt so much for them in the first place. But that was the old me. Dr. Pritchard, my therapist, wouldn’t be happy with me if I held on to that kind of thinking.</p><p>I wouldn’t be happy with me.</p><p>Worse, Braden wouldn’t be happy with me.</p><p>I snuggled a little closer, just needing to feel the heat from his body against my skin. My eyes dropped to his mouth, his beautiful mouth, which said and did a lot of nice things to me.</p><p>I was everything to Braden. I knew this because he told me so. He never made me doubt how much I meant to him.</p><p>“Is there a reason you’re over there and I’m over here?” he suddenly muttered, his eyes still shut.</p> <p>I’d jerked back at the sound of his voice but was now smiling as I slid closer. “You’re awake,” I whispered, wrapping my arm around his waist, entwining my legs with his as he draped a strong arm over my back and snuggled me against his firm chest. I sighed. Content.</p><p>“I’ve been awake for the past ten minutes, waiting for you to get your arse back in beside me.”</p><p>I snorted at his disgruntled tone.</p><p>His warm hand slid down over my back, caressing my butt before smoothing back up my spine. “You get what you needed to get down?”</p><p>“Mmmhmm. Finished my chapter.”</p><p>“Good, babe. Now go back to sleep.”</p><p>I smirked against his chest. “Okay, caveman.”</p><p>A minute or so passed and just as Braden was drifting back off I whispered, “You’re my everything. You know that right?”</p><p>His arm tensed around me at my words and then I found myself pushed back, his eyes boring intensely into mine. After searching them, his sleepy mouth curled up at the corners. “You don’t need to sweet-talk me to get sex, babe.”</p><p>My eyes smiled. “Well that kind of knowledge could have saved me months of uncomfortable expressions of love.”</p><p>Wide-awake now, Braden tightened his arms around me and as he flipped onto his back he hauled me with him so I was sprawled across his chest, my legs straddling his hips. A note of seriousness entered his gaze as he drew his thumb across my mouth. A shiver rippled through me and I loved that he excited me so much. “I know how you feel about me. I feel the same way. You never have to worry that you don’t tell me enough, okay?”</p><p>There he went again, being all perceptive to the point of being creepy psychic mind reader guy. “You’re creepy psychic mind reader guy.”</p><p>He raised an eyebrow. “Creepy?”</p><p>“In a hot way.”</p><p>“There’s a hot way to be creepy?”</p><p>“Slide your hand south and creepy will certainly become hot.”</p><p>Braden’s teeth flashed in the dark, his wicked smile jump-starting my heart. His hand drifted south, down my back, over my pert ass he liked so much and under my nightdress.</p><p>“Am I hot now?” he asked, his voice low and rumbling with arousal as his fingers slipped beneath my panties.</p><p>I arched into his touch, bracing my hands on his chest. “Baby, you don’t know how to be anything else.”</p><p>My words jacked Braden up, his torso lifting from the bed, so I found myself sitting in his lap, our chests pressed close, his arms holding me tight. His lips brushed gently over mine as he shifted me so his erection throbbed between my legs. “You’re killing me with compliments.”</p><p>I shrugged, my reply whispered against his mouth, “I just wanted you to know that just because I don’t say it all the time, doesn’t mean I don’t feel it.”</p><p>This time he kissed me, tongue and all, deep and wet. When he pulled back for air, he promised me, “I know.” His hands pushed at my nightgown until he caught the hem and tugged it up over my head. Braden’s heated gaze moved over my naked body and I abruptly found myself on my back as he pushed down his pajama bottoms. “Believe me, I know.”</p><p>The wind was beating against my back and the sad, gray clouds above me were giving me this apologetic little pout. When I’d left the flat this morning the sun had been out and I’d dressed weather-appropriate. I had on a thin T-shirt and my best pair of black skinny jeans. Now it was threatening rain and I was shivering in my shirt, wondering how I’d managed to let myself be talked into the trek I was on and trying not to be as pissed as I was feeling.</p><p>After the emotionally fueled sex Braden and I had had early that morning, I was a little surprised to find him so distracted when we’d gotten up. Sure, he was tired from lack of sleep, but that had never stopped him from paying attention to what I had to say. However, he’d hurried into a shower, shooed me (yes, shooed!) me out of our bedroom while he got dressed, given me a quick kiss, told me Ellie wanted to spend the day with me and I should call her, and then hurried out of the flat.</p><p>It left me feeling confused. I felt like I was missing something.</p><p>Instead of sitting at home on a Saturday, stewing over it, I’d let Ellie talk me into accompanying her. Sometimes she’d get something in her head that she just had to have or had to do and she’d drag me all over the city to these obscure little shops. This time I’d let her talk me into the thirty-minute walk to Bruntsfield. Way back in my pre-Carmichael years I used to live in Bruntsfield. It was this kitschy little area of the city with kitschy little shops. It was popular with students. I’d say I missed it but it hadn’t come with an adorably annoying best friend like Ellie or her brother Braden, the man who was currently driving me to distraction.</p><p>The journey to Bruntsfield had a purpose. Or at least that’s what Ellie told me. Apparently she’d passed this little clothing boutique that had on sale “the most gorgeous vintage shoes ever” and Ellie was kicking herself for not buying them. We were back, trying to find the shop and hopefully the shoes.</p><p>“Are you even listening to me?” Ellie asked, a teasing smile in her voice as she studied me, her short blond hair blowing into her face.</p><p>“Of course.” I really was listening. Mostly. I knew the discussion pertained to our friend Jo and her new boyfriend, Cameron. “You were telling me you think Cam is moving pretty fast with Jo?” I asked it with a slight hint of a question in my tone, since I wasn’t too sure if that was the point she’d been trying to make.</p><p>“A little. Don’t you?”</p><p>Absolutely. “Uh-huh.” And I did. However, my gut told me Cam was a good guy. “But I don’t think it’s a bad thing. In fact, I pretty much think he’s the best thing that could have ever happened to her.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ellie shrugged. “I like him. I do. I just don’t want Jo to get hurt.”</p><p>I raised an eyebrow at her. “Since when did you get so . . . normal?”</p><p>“Normal?” she glared at me. “You mean unromantic? I do realize there are times when romance needs to take a back burner to reality. Jo’s had it tough. As much as I think Cam’s great and as much as I’m rooting for them, I hope he really is going to be there for her. Taking her home to meet his parents this weekend? He’s telling her he’s serious. I hope he means it.”</p> <p>Although Ellie’s caution surprised me, I understood where she was coming from. Our friend Jo had been messed around by too many guys because she’d chosen them for the wrong reason. Struggling to look after her little brother and her alcoholic mother, Jo always chose men who had financial security. Cam wasn’t one of those guys. He was a struggling graphic designer who’d gotten a job as a bartender alongside me and Jo at Club 39, this swanky little basement bar on George Street. The sparks had started flying as soon as they met, though, and Jo had finally set aside all her silly little dating rules to take a chance on a man who seemed to want her for her.</p><p>Despite understanding Ellie’s reservations, I didn’t share them and finally I found myself being distracted from my own boyfriend as I tried to convince Ellie. “I think he’s serious. I think they have a connection. There’s no way to slow that down when you just fit with someone like that. If I hadn’t been so stubborn with Braden, we probably would have been a done deal within a few weeks of meeting each other.”</p><p>A mysterious, secretive smile flirted with Ellie’s lips.</p><p>What the . . . ?</p><p>“What? Am I missing something? Did I say something funny?”</p> <p>“No,” she answered hurriedly, eyes drifting up over the old Evangelical church. Abruptly she stopped. “We’re here.”</p><p>“Where is here?” I looked around. There were no vintage shoes in sight.</p><p>Ellie glanced at her watch and then out at the traffic on the cross junction, then back at her watch, then back at the road . . .</p><p>“Ellie?” My heart started to thump as the day’s events began to fall into place, like pieces of a puzzle. “What is going on?”</p><p>Her eyes were wide when they hit mine.</p><p>“Jesus C, Ellie, what is it? You’re freaking me out.”</p> <p>For once, however, her lips were tightly sealed. Literally. They were pinched closed so tightly the color was bleeding from them. Her eyes swung back out to the road and as I watched her shoulders deflate with relief, I followed her gaze.</p><p>She was smiling at an approaching black cab.</p><p>That excited, eyes-twinkling-bright-with-utter-joy smile swung my way. “I’m going to go now.”</p><p>Uh . . .</p><p>I whirled around as she strode past me, heading back the way we’d just come.</p><p>Baffled, I threw my hands up. “Ellie?”</p><p>She was still grinning as she looked back at me over her shoulder. She pointed behind me and I turned back to see the black cab had pulled up to the curb beside me.</p><p>The door swung open and I was greeted by a surprising but always very welcome sight.</p> <p>My boyfriend.</p><p>“Braden?” I gave him a quizzical smile as he leaned toward me. He was wearing one of his fitted, expensive three-piece suits I loved. This one was a dark gray and was molded perfectly to his broad shoulders and fit physique. The sight of him sitting in the cab in that suit on this spot where we first met—</p><p>My heartbeat skittered to a stop as I finally processed the intensity in his gaze and the fact that the floor of the cab he was sitting in was strewn with dark red rose petals. Fuckity, fuckity, shit, fuck. His distraction this morning, his shooing me out of our room . . . it all added up and the breath just whooshed right out of me at the realization of what this meant.</p><p>“Get in,” he said, his voice low, brokering no argument.</p><p>Limbs trembling, I took his offered hand, ducked my head, and let him settle me close to him on the cab bench. “Braden, what is . . .” My words trailed off as he held up a gray suede ring box.</p><p>Everything around me stopped.</p><p>There was no cab, no rose petals, no nosy cabdriver grinning at us in the rearview mirror, no traffic going by . . . nothing but Braden and a ring box that symbolized so much to me.</p><p>Years ago I’d lost everything that meant anything to me.</p><p>Losing that left me lost.</p><p>Until Braden.</p><p>I’d given him the fight of his life when he’d tried to convince me that loving him was the best thing for the both of us, but when he won, when I eventually realized the truth in that, I knew our path wouldn’t always be smooth. I’d thought if this moment ever came, I’d be searching for a brown paper bag to stem my panic attack. To my utter surprise, I felt no such thing. Yes, the fear was there. The fear of giving in . . . only to lose him to life’s unpredictability. However, greater than the fear was my excitement. My excitement that this impossible, too-perceptive-for-his-own-good, arrogant, stubborn, kind, caring, sexy man was about to ask me to spend the rest of my life with him.</p><p>Braden’s pale blue eyes shone with emotion as he flipped open the ring box to reveal an elegantly simple platinum band with a princess-cut diamond perched upon a raised prong with a small diamond nestled on either side of it.</p><p>It was so me.</p><p>Shit, he knew me so well. Do not cry, do not cry!</p><p>“Jocelyn,” his voice was rough, like he was struggling to get the words out. “You’re my best friend. My everything. I love you and I want to be with you always. Marry me. I promise to try not to fuck it up if you promise to try not to fuck it up.”</p><p>I burst out laughing, tears falling without my say-so as I nodded, completely unable to speak. Braden grinned huge and I reached for him, needing to feel his mouth on mine. My tears mingled with our heated kiss and when he finally let me go, we were both a little out of breath. He took hold of my trembling hand and slipped the ring on my finger. We both stared at the diamond glittering on my left hand. My stomach and heart were jumping all over the place.</p><p>Threading my fingers through his, I clasped his hand tight and stared into his beloved face.</p><p>“I love you,” I whispered hoarsely. “You’re my favorite person.” The tears blurred in my eyes again. “And if you ever tell anyone I cried during this moment I will withhold sex for a year.”</p><p>His warm, husky laughter spread through me as he wrapped his arms around me, hauling me close. I tightened my own arms around his shoulders, shivering with delicious anticipation as he murmured against my mouth, “I’d like to see you try.”</p><p>Cocky, arrogant caveman. “Marriage will drive the cockiness right out of you,” I murmured back.</p><p>“The only thing that’ll drive the cockiness out of me is you faking an orgasm. And I don’t see that happening any time soon.”</p><p>“Hmm.” I nuzzled my nose against his, the tingling between my legs growing more insistent. “You’ve got a point there, Mr. Carmichael.”</p><p>“Mr. Carmichael, I do believe I’m tipsy,” I threw him a wonky smile over my shoulder as I turned the key in our door.</p><p>We’d just returned from having celebratory drinks with Ellie and Adam. Honestly, I think Braden and I would have preferred a quiet night in together on the night of our engagement, but Ellie was having none of that, and Alistair, my colleague at Club 39, had given us two bottles of champagne on discount, so I wasn’t complaining. It had been a fun night.</p><p>As I pushed the door open, I felt Braden’s strong hands on my hips and his warm breath on my ear as he asked softly, “Tipsy or drunk?”</p><p>I grinned, stepping into our flat with him close at my back. “Tipsy.”</p><p>It was true. I was feeling a little giddy and more talkative than usual, but my vision was clear and my coordination was intact.</p><p>“You sure?”</p><p>Turning around, I reached past him and shoved our door shut, leaning my breasts into his chest as I turned the lock. I was still grinning as I tipped my head back to meet his heated gaze. “If you’re wondering if I’m sober enough to fuck but drunk enough for it to be especially hot, the answer is yes.”</p><p>Braden fought a smile. “Have I ever told you how much I love that filthy mouth of yours?”</p><p>Yes, on many occasions. “Well, I hope so,” I teased, “because it’s going to be your filthy mouth for a long time to come.” I smoothed my hand up over his hard chest. “Speaking of coming . . .”</p><p>His hand on my hip tightened, drawing my eyes back to his. To my surprise he’d gone from teasing to intense. I knew that look well. My fiancé was in the mood to play “caveman.” I shivered, feeling my breasts swell with arousal. “Strip,” he uttered quietly, deadly serious.</p><p>The tingles started. “Here?”</p><p>He nodded to the space in front of him, smack-bang in the middle of our hallway. “There.”</p><p>“Okay,” I agreed. “But I get to be bossy tomorrow.”</p><p>The intensity in his eyes lightened for a second as he gave me a little nod of acquiescence. Of course he would acquiesce to that. My version of sexually bossy was insisting on being on top and although it wasn’t Braden’s favorite sexual position, he certainly enjoyed it and the view.</p><p>Eyes locked, I took a few careful steps backward until there was enough distance between us for him to enjoy the show. I shrugged out of my light blazer first, letting it pool at my feet, and then I reached for the first button on my black sleeveless silk shirt.</p><p>“Everything but the ring,” Braden murmured, his expression all smoldering as he leaned back against our front door, crossing his arms over his chest, and one ankle over the other. His pose said casual, possibly even bored. His eyes, however, were burning my not-even-naked-yet skin.</p><p>I shivered at his command, my own gaze dropping to the glitter on the fourth finger of my left hand. Braden had a possessive streak. He hadn’t even known he had one until he met me. The thought of me with someone else cut him, just like the thought of him with someone else cut me. It was part of the undeniable connection between us. More than that, I’d made it hard for him to win me over. That had not been intentional, believe me. I got the impression, however, that winning me over not only brought Braden peace, but it made him feel a bit like a conqueror. Not that he would ever admit it, but I knew my fiancé, and he definitely had caveman mentality. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Thus, I knew that having me stand before him, wearing nothing but the symbol of my promise to be only his for the rest of always, was a huge turn-on for him. And that meant it was a huge turn-on for me.</p><p>My fingers drifted from my buttoned shirt to the studs in my ears. I took them out and reached over to the sideboard, the sound of metal clinking against wood as I dropped them there filling the hallway. I then removed the necklace I was wearing, followed by my watch. Once all the jewelry but the ring was off, I went back to my shirt.</p><p>Braden’s pale eyes were already blazing.</p> <p>I kept mine on him as I slowly unbuttoned my shirt, shrugging my shoulders so the fabric would slip down my arms and flutter to the ground.</p><p>The zip on my pencil skirt was next. I slid it down in increments, enjoying the way the muscle in Braden’s jaw flexed at the sound. My eyes lowered.</p><p>He was hard already.</p><p>My nipples tightened and I felt my breath hitch with anticipation.</p><p>Once my skirt fell to the ground, I stepped out of it, marveling at my own stability. I was still tipsy, and tipsy, four inch heels, and good balance usually didn’t go hand in hand. Thankfully, I kept my grace and I bent down to slip the heels off. Flat on my feet, I lifted my eyes to watch Braden again as I reached behind me for the clasp of my bra. I unhooked it but slowly peeled the straps down, teasing the fabric away from my body.</p> <p>Goose bumps erupted over my breasts and areolas, my nipples hardening to little points. Braden’s hard-on pressed against his suit pants and I hid a pleased smile. For someone who had dated a lot of women with small chests, Braden certainly was obsessed with my D-cups. He had gone from being a leg man to a boob man.</p><p>Not that he didn’t like my legs, because he definitely liked those too.</p><p>Unconsciously I licked my lips, watching his eyes flare as I gently pushed down my panties. They were damp with my arousal. I was dying for Braden to touch me, to feel how wet I was with only his eyes on my body.</p><p>“Now what?” I asked quietly, my voice thick.</p><p>His eyes burned a path that touched every inch of me. “Let down your hair.”</p><p>I smirked at him as I reached up and unpinned my hair, letting the mass of waves fall heavily down my back. I threw the pins on the sideboard and massaged my head, my breasts rising provocatively with the movement. “And now?”</p> <p>He stood up from the door, his relaxed pose gone as he replied in his low, rumbling tones, “Now walk into the bedroom, lie on your back on the bed, stretch your arms above your head, spread your legs, and prepare to take me. Hard and deep.”</p><p>Desire shot through my belly and straight to my core at the imagery. I had to admit I loved how confident and commanding Braden was in bed. Still, I couldn’t allow him to be too bossy. “If I’m spreading my legs for you, I want your mouth between them before anything else.”</p><p>He gave me a slight smile and a knowing nod. “Deal.”</p><p>“Deal.” I smiled saucily back at him and turned around, feeling a surge of empowerment at the sound of his indrawn breath.</p><p>As I walked toward our bedroom he said, “Later, I want you on your stomach and that gorgeous arse in the air.”</p><p>“First your mouth,” I replied before disappearing inside our room.</p><p>My heart was beating fast with excitement as I crawled onto our cool sheets, reached across, and flicked on the bedside lamp before turning on my back, stretching my arms above my head, and spreading my legs.</p><p>My whole body shivered at being in such a position.</p> <p>Eyes on the door, my pulse raced as Braden appeared in the doorway.</p><p>“Fuck,” he breathed, moving toward me, stripping much more quickly out of his clothes than I had done. “How did I get so fucking lucky?”</p><p>“You were a very good boy this year,” I teased.</p><p>He smiled devilishly in the low light as he pushed his pants and boxer briefs down. My hungry gaze settled on his huge, throbbing erection as he moved on to the bed, his beautiful hands sliding up my spread legs. “And have you been a good girl, Jocelyn?”</p><p>I tilted my hips up, telling him silently I wanted his mouth on me and I wanted it on me now before I combusted. “Yes,” I breathed. “I haven’t made any grown men cry this year. I’d call it an improvement upon last. Now give me your tongue.”</p><p>His hands gripped my thighs. “Who’s in charge here?”</p><p>Despite having started the teasing, I was losing patience. I knew one way to speed things up. “Just put your mouth on me, Braden, please.”</p><p>His growl was the last thing I heard before his head descended and his tongue parted my labia. I rocked against it, feeling the build start as he circled my clit over and over before sucking it between his lips. My panted pleas for more filled the apartment, my fingers curling into the sheets as his tongue drew down and entered me.</p><p>“Braden,” I gasped, my hands automatically reaching for his hair.</p><p>This halted him immediately. “Hands back,” he demanded, looking up at me with fire in his eyes.</p><p>I instantly did what he asked and Braden returned to tormenting me.</p><p>Just when I was on the brink of orgasm, he stopped.</p><p>“What are you doing?” I panted as he moved up my body. He’d promised me his mouth first.</p><p>He threaded his fingers through mine, holding my hands firmly to the mattress. I felt his thumb rub over my engagement ring as our eyes held. “I want the first time you come as my fiancé to be around my cock.”</p><p>My inner muscles squeezed and my reaction was surprisingly docile. “Okay.”</p><p>As his mouth moved over mine, he thrust into me.</p><p>It was hard. It was deep. And it was beautiful.</p><p>Just like always.</p><p>Chapter 2</p><p>Mission Accomplished</p><p>“I’m thinking of quitting Club 39,” I called out to Braden from the bedroom. He’d gotten home from work earlier than usual and was in the kitchen making us coffee.</p><p>“Why?” he called back. “I thought you liked it.”</p><p>I closed my laptop, deciding to go back later to the chapter I was working on. It wasn’t very often Braden finished a workday at five o’clock, and I was determined to take advantage of that fact.</p><p>Wandering into the kitchen, I drew to a stop at the sight of the table. Braden’s laptop was open, surrounded by papers and clippings. “Um . . .” I looked up at him as he stirred sugar into his coffee. “I’m sick of missing out on the weekends with you, and Jo’s leaving, so . . .” I gestured to the table. “What’s all this?”</p><p>He handed me my coffee. “Wedding plans.”</p><p>“Wedding plans?”</p><p>Braden sat down in front of his laptop and nodded at me to take the seat beside him. “I said I’d organize this thing and you said you’d help. I’m not finalizing anything until I get your opinion.”</p><p>Since I was more than grateful he’d decided to take over the wedding plans from Ellie, who was determined to pinkify our wedding, I had agreed to help Braden. Sipping my coffee I sat down and stared at everything. It didn’t look like much, but our decisions were worth thousands of pounds, so we needed to be sure. We’d decided to split the wedding costs, which I thought was very evolved of my fiancé considering his tendency toward caveman mentality.</p><p>“So what have we got?”</p><p>“The church is booked, but we have to make a decision on the reception venue.” Braden turned the laptop toward me. “I like the Balmoral Hotel. I’ve priced it. What do you think?”</p><p>I was looking over the PDF the hotel had sent him when our doorbell rang, followed by the sound of it opening. That either meant it was Ellie or Adam.</p><p>“It’s me!” Ellie called. “Before I come any farther, are you both dressed?”</p><p>Laughing, I assured her we were. Somewhere along the way she’d gotten the impression that Braden and I didn’t do anything together but have wild monkey sex.</p><p>His sister appeared in the doorway, smiling broadly. She held up a bag of delicious-smelling food. “Braden told me about the wedding plans. I brought Indian!”</p><p>“Even though I fired you from the wedding plans, I’m going to let you stay because you brought takeout.” I slid out of my seat to help her plate up the food.</p><p>“I know.” She smiled sheepishly. “But it’s exciting. I just wanted to be here to see what decisions you make.”</p><p>“No refuting those decisions,” Braden muttered, eyeing her sternly. “That’s why I ended up as the wedding planner in the first place.”</p><p>“I’ll be good.” She promised. “Oh, I brought you these.” She shoved a white plastic bag at me as I fumbled with a plate.</p><p>“What is it?” I asked warily.</p><p>“Candles.” Ellie shrugged out of her jacket. “This place is so bare since I moved out. I thought those might make it a bit homier.”</p><p>Sharing an amused look with Braden, I put the bag on the counter. Ellie was known to like clutter. Her idea of bare wasn’t a normal person’s idea of bare. “We’re minimalist. But thanks.”</p><p>“Ooh,” Ellie cooed over Braden’s shoulder as she tilted the laptop screen. “The Balmoral? What do you think, Joss?”</p><p>“I think it’s beautiful,” I replied honestly, having already decided after looking at the photos that I was just going to agree to Braden’s ideas. It would make the process a lot less of a headache, and it wasn’t like we didn’t share the same taste.</p><p>“Yeah?” he asked.</p><p>“Definitely.” I approached him with a plate of curry and rice, my eyes dipping to the floor. My gaze caught on Ellie’s feet. I tried and failed not to smile as I asked Els, “Sweetie, have you looked at your feet lately?”</p><p>Wrinkling her nose in confusion, Ellie looked down. She sighed. “Bugger.”</p><p>Curious, Braden looked down too after accepting his plate from me and immediately choked on his bite of curry.</p><p>I laughed.</p><p>Ellie was wearing two different shoes. They were flats of a similar style, but one was definitely brown and the other black. “I’ve been wandering all day over New Town like this.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I doubt many people noticed your feet, Els.”</p><p>She kicked off her shoes and we all settled around the table, eating and planning. Well, Braden had done all the planning, so it was mostly just me nodding my head to his suggestions and covering Ellie’s mouth when she got too vocal in her opinions over the flowers.</p><p>We were just winding down when Ellie’s phone rang. It was Adam, requesting her company, although from the way she blushed I doubted the request was that polite or lacking in sexual innuendo.</p> <p>She got up hurriedly, giving me a smile and her brother a kiss on the cheek. “This was fun. Thanks for letting me crash it. Speak soon!” She floated out of the kitchen, in her mind already out of the flat and with Adam.</p><p>“Tell Adam I said hey!” I called to her.</p><p>“Will do!” The door slammed in her wake.</p><p>I pushed my plate away, cupping my chin in my palm as I smiled at Braden. “Thank you for doing all this.”</p><p>“You’re welcome.” His smile turned into a yawn. He ran a hand through his hair, looking exhausted. “The only thing left to plan is the hen and stag nights.”</p> <p>A hen party was what the Brits called a bachelorette party, and a stag night a bachelor party. “Won’t Ellie and Adam be organizing those?”</p><p>“Aye, at least that’s something.”</p><p>I huffed. “That’s okay for you to say. I doubt Adam is going to arrange an elegant tea party for yours.”</p><p>“Nah,” Braden grinned. “Casino night.”</p><p>I pouted. “I want a casino night.”</p><p>“Have a casino night. I’ll get Adam to nudge Ellie in the right direction.”</p> <p>“We can’t end up in the same place for our parties.”</p><p>Braden leaned toward me, his gaze curious. “Why not?”</p><p>Surprised by the question since I thought the answer was pretty straightforward, I blinked a few times. “Uh, because it’s supposed to be a symbolic evening where we celebrate our last night of singledom.”</p><p>“But we’re not single. We’re married without the certificate. Let’s change the symbolism of it. We’ll celebrate together. We’ll celebrate how we mean to go on for the rest of our lives.”</p><p>I loved the way he looked at me. So full of . . . everything. “You could charm the pants off absolutely anyone,” I told him quietly.</p><p>He smirked. “I take it that means you like the idea?”</p><p>“I love the idea. I love everything you’ve said. But I know Ellie’s excited about this, so we’re going to give our friends what they want.”</p><p>“Adam mentioned strippers,” Braden warned me, his eyes twinkling.</p> <p>“If Adam books a stripper for you, I’ll force Ellie to book a stripper for me.”</p><p>Chuckling, Braden relaxed back in his chair. “Let’s agree to no strippers.”</p><p>I raised my glass of water and waited for Braden to do the same. “To no strippers.”</p><p>“To no strippers,” he repeated.</p><p>“And let’s just make that a motto for our marriage.”</p><p>Laughing, Braden nodded. “I can guarantee it.”</p><p>I gestured to our plans and gave him a smile. “So are we done for the night? Can we lounge in front of a movie now?”</p><p>“Definitely.”</p><p>Together, we cleaned our dishes and cleared the wedding plans away. Half an hour later we lay on the sofa together, my head on Braden’s chest, his arm around my back, as we watched an action movie on pay-per-view.</p><p>Forty minutes in, I tilted my head back to look into his face and said, “Sometimes I can’t believe that I get to do this with you for the rest of my life.”</p><p>Surprised at my sentiment, Braden looked at me, eyes glittering with amusement. “What? Watch a movie?”</p><p>“Yes,” I answered honestly. “Lie in your arms and watch a crappy movie. It might seem simple to other people, but it’s everything to me.”</p><p>The amusement left his expression, quickly replaced with something far more intense as he reached up to stroke my cheek with his thumb. “I’m glad you’re quitting the bar.”</p><p>“You are?”</p><p>“Yeah. I’ve never liked you working there, and I miss you at the weekend.”</p><p>“Why didn’t you say anything?”</p><p>“Because you seemed happy. It’s sort of my life mission to make sure you stay that way,” he teased.</p><p>I grinned. “Gotcha. Well, mission accomplished. I have lots of new friends, so I don’t need the bar for a social life anymore. And I want to concentrate on my writing and on us. I’ll hand in my resignation this week.”</p><p>Braden nodded and squeezed me closer. “Sounds good, babe.”</p><p>Snuggling into him, I let out a contented sigh and turned my gaze back on the movie. “Pfft.”I mocked the screen as we soaked in each other’s warmth. “Like a cop would start shooting in a public place like that. What is this crap we’re watching?”</p><p>“Something about ‘everything to you,’ I believe.”</p><p>“Hmmph. Well, it will be if we become a little more discerning in our rental choices. Oh, God,” I groaned at the screen. “This guy is a tool.”</p><p>“Jocelyn?” Braden tightened his arm around me and I looked up at him to find him grinning. “Just so you know, this is everything to me too.” He bent down to give me a sweet kiss before turning back to the television. “Perhaps minus the commentary from the peanut gallery.”</p><p>Chapter 3</p><p>The Wedding</p><p>Clark, Ellie’s stepdad, and thus father figure to Braden and me, threaded my arm through his elbow and patted my hand in a comforting way.</p><p>At the gesture, I glanced sharply at his kind face. “What? Do I look nervous?”</p><p>He smiled softly at me. “A little.”</p><p>“I don’t want to look nervous,” I whispered back.</p><p>Although his mouth didn’t laugh, his eyes definitely did. “Just take a deep breath.”</p><p>We were standing out of view of the double doors that had opened up onto the red-carpeted aisle of the church and my bridesmaids were already walking their way up it. It was nearly my turn.</p><p>I couldn’t believe our wedding day was here already. It didn’t seem that long ago that I’d woken up the day after my engagement to Ellie knocking on my door with a bunch of bridal magazines in her hands. Although I’d had moments of doubt, I’d fiercely fought them back.</p><p>It was kind of a shock then to find myself standing at the bottom of the aisle, freaking out.</p><p>Fuckity, fuckity, fuck, fuck.</p><p>Deep breaths.</p><p>I could not have a panic attack. I wanted to spend the rest of my life with Braden. The problem was I was terrified I was going to find some way to fuck it up. Even after months of proving to myself that I was capable of being in a committed, loving relationship, I was still afraid. I was afraid I was going to hurt him.</p><p>“What if I mess this up?” I murmured.</p><p>Clark’s hand tightened over mine. “It’s not going to be perfect because no marriage is. You’re going to fight, clash, say things you don’t mean . . . When you love someone, these things can happen. But, Joss”—he dipped his head to meet my gaze—“the good you two will have together, will always outweigh any bad.” He smiled. “And I think Braden’s proved there’s not much you can do to chase him off.”</p><p>“True.” I squeezed his hand and took a shuddering, deep breath. “Thanks.”</p><p>“You’re welcome. Now let’s do this.”</p><p>The strains of the guitarist and violinist grew louder as the double doors swung open, their beautiful instrumental version of Paul Weller’s “You Do Something to Me” sending shivers up my neck. We stepped out onto the carpeted aisle of the church and at first all I could see was the flowers, the guests who had turned to stare at me, their approving smiles, their curiosity. At the squeeze of Clark’s hand around mine where I clutched fiercely to my bouquet of white lilies interspersed with thin reeds of champagne gold, I began to focus. My eyes found my bridesmaids, Ellie, Hannah, Jo, Rhian, and Liv, dressed in their floor-length champagne-colored dresses, looking elegant and happy. The closer we got I could see Ellie was tearing up. I caught Elodie in the front pews along with Cam; Cole; Jo’s Uncle Mick; his new girlfriend, Dee; Cam’s best friends, Nate and Peetie; and Peetie’s girlfriend, Lyn. I didn’t have any family here so we’d decided not to divide the room into groom and bride sides. Still, there were just my colleagues from Club 39. Everyone else was associates or friends of Braden and the Nichols family. And of course his vapid socialite mother hadn’t turned up. She was feeling under the weather. More like we’d met at Christmas last year and I’d made my distaste for her clear and vice versa.</p><p>My eyes found Adam and Dec, who were standing on the opposite side of the altar. They wore the same as Clark and Braden—what was referred to as a Prince Charlie gray jacket and matching three-button waistcoat. Their silk champagne ties were intricately knotted against their dark gray shirts, and because the Carmichaels were associated with the Stewart clan they were wearing a subdued Stewart gray tartan. Adam’s kind, bolstering smile finally made me look at Braden.</p><p>I almost faltered on the walk up the aisle.</p><p>The look in his eyes was like a physical pressure on my chest. The love there caused my throat to constrict and I leaned more heavily against Clark as I attempted to float toward Braden in my wedding dress. My dress was simple. It was strapless with a heart-shaped neckline, and the upper half of the bodice was ivory with crystal beading and lace. The finest white silk chiffon pulled across the bodice in a tight drape, fitted to my waist. From my hips the layers of chiffon, shot through with silver, fell to the floor in simple elegance. I could tell by the look on Braden’s face as Clark and I approached that he liked the dress.</p><p>Still shaking, I kissed Clark on the cheek, so honored that he’d walked me down the aisle in absence of my father. I thanked him sincerely, almost choking up at the sheen of wetness in his eyes as he handed me over to Braden. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Instead of turning me to face the minister, Braden took my hand and pulled me into his side, his eyes burning intensely into mine. His head lowered and I felt his warm breath on my ear, “You look stunning, sweetheart, but deep breaths. This is just you and me.”</p><p>“Tell that to the hundred people sitting behind us,” I told him a little shakily.</p><p>He chuckled, pressing an amused kiss to my mouth.</p> <p>When he pulled back, Braden’s expression was reassuring as he murmured against my lips, “I love you, you love me, our family loves us and they’re right here beside us. Nothing else matters. So no fears for the future, no fear that you’ll fuck it up beyond repair. Life isn’t perfect, we aren’t perfect, but I’m telling you now, Jocelyn, we’re indestructible. Stop shaking, and just marry me.”</p><p>I pressed deeper into him, brushing my mouth over his. “You got it.”</p><p>The minister cleared his throat, drawing my and my smiling groom’s attention back to the ceremony and out of the little bubble we’d been in. I heard our guests titter behind us and the music stopped.</p><p>This was it.</p><p>There was something a little surreal about sitting next to Braden at the top table, my wedding band sitting prettily against my engagement ring, everyone referring to us as husband and wife, and people being cute and calling me Mrs. Carmichael instead of Joss. It was weird. But the good kind of weird.</p> <p>Our wedding reception was held at the Balmoral Hotel. The banquet suite was this grand hall with tall ceilings, pillars, elaborate chandeliers, and huge arched windows with views of Edinburgh Castle. It was stunning and classy and beyond anything I’d ever imagined for this moment.</p><p>After dinner, Clark tapped his champagne flute, drawing everyone’s attention as he stood up to give his father-of-the-bride speech. I’d told him he didn’t have to, but he said he wanted to. And watching how comfortable he was as he lifted the mic, I knew as a university professor he wasn’t that daunted having to talk to a large crowd of people.</p><p>I didn’t know what to expect from Clark’s speech. I felt butterflies in my stomach as he smiled down at Braden and me.</p><p>“Braden is one of the finest men I know.” He began. “He’s a son to me. And he’s a friend. So when it became clear that what he and Joss had together was something special, I couldn’t have been more delighted for him. Because Jocelyn is without a doubt one of the strongest, most extraordinary young women I have ever met.”</p><p>Jesus C.</p><p>I swallowed past the hard lump of emotion in my throat, leaning into Braden, who automatically wrapped an arm around me without my even having to ask.</p> <p>“I am sorry that your dad can’t be here with you on this day, Joss,” Clark continued, his voice low with enough emotion that it threatened to spill the tears over my lids, “but I know that he would be so proud of you for the woman you’ve become, and so happy that you’ve found a family in Braden, and in us. I was honored to walk down the aisle with you for him. Tonight”—he lifted his glass, turning to our guests—“I ask you all to raise your glasses to my son and daughter. To Braden and Jocelyn.”</p><p>As everyone said our names in unison, lifting their glasses to us, I fought back the tears. Just barely.</p><p>The truth was I did feel part of the Nichols’s family. But it was kind of more than a little beautiful that the Nichols family thought of me as part of them.</p><p>Next to stand up was Adam as Braden’s best man. He lightened the mood, joking about his and Braden’s past, about Braden’s reputation with women, how different he was with me, and how much fun he had had watching Braden work his ass off to get me. Upon Adam raising his glass to us in toast, Braden kissed me, waited for his best man to sit down, and then stood up himself.</p><p>I looked up at him. More than anything I wanted the reception to be over; I wanted to not be center of attention anymore. Mostly, I just really wanted to be alone in a room with my new husband.</p><p>Braden stood tall in his kilt, looking every inch the delectable Scotsman, and he stared out at the room with a familiar air of intimidating confidence. “Over two and a half years ago,” he began, his voice deep, his tone serious, “I shared a taxi with a complete stranger. A young woman with a smart mouth and”—he smirked down at me—“a great pair of legs.”</p><p>The guests chuckled as I shook my head slightly at him, a small smile playing on my lips.</p><p>“I knew then,” Braden spoke loudly to the guests, but his eyes remained on my face, “my life had changed. I just wouldn’t know until you walked out of Ellie’s bathroom without a towel on how happy I was with that coming change.”</p> <p>I rolled my eyes, feeling my cheeks burn as everyone laughed.</p><p>“I’m not joking.” Braden turned back to them. “The second time we met, Jocelyn was starkers. Up to that point it was the best day of my life.</p><p>“Even after being caught in the buff she gave me attitude.” He grinned down at me again, and I felt the warmth inside my chest turn into a burn of overwhelming emotion. “You’ve challenged me since the day I met you. No woman has ever challenged me more. Nor made me laugh harder. There is not a moment that passes where you don’t make me feel more alive than I ever thought I could, and today you gave me something I thought was lost a long time ago for the both of us. You’ve given me peace, babe. You’ve given me everything.” The timber of his voice had deepened with emotion and I swear to God I was close to bawling my eyes out as he lifted a glass of champagne from the table and raised it in the air. “To my wife, Mrs. Jocelyn Carmichael.”</p><p>The guests repeated his words as he bent down to me, his eyes warming at the sight of my unshed tears. “To my wife,” he murmured again, cupping a hand behind my nape to bring my lips to his.</p><p>While making the rounds of the reception, attempting to stop to chat with all our guests, the unsettled fluttering in my stomach had called a cease-fire and I was feeling a lot more relaxed. The champagne was helping.</p><p>I stood by Braden’s side while he introduced me to distant cousins, relatives of Elodie and Clark, friends and business associates. We’d nearly made our way through the entire guest list when we came upon Jenna and Ed. Jenna was one of Ellie’s friends and Ed was her husband. When I’d first met Ellie, Jenna and Ed had been a close part of their group, but after their wedding Jenna fell pregnant and for some reason they stopped hanging out with a lot of their friends. Ellie had been a little put out at first but Jenna seemed more content to spend time with married friends who had children and I reassured Ellie that she hadn’t done anything wrong. Some people were just like that. Still, it was nice to see them.</p><p>“Joss, you look beautiful,” Jenna said, giving me a tight hug.</p><p>“Who’s looking after Andrew?” Braden asked, referring to their baby boy.</p><p>Ed grinned. “I talked my parents into babysitting tonight. We haven’t had a real night off in God knows how long. I actually had to talk Jenna into coming here, into leaving him.”</p><p>Jenna frowned at her husband. “I don’t like leaving him. There’s nothing wrong with that.”</p><p>Hearing the bite in her tone, I shot Braden a look that suggested we should move along.</p><p>He nodded at me and turned to speak but Jenna cut him off by jerking me toward her.</p><p>“So, when are you thinking about having a baby, Joss?”</p><p>The Jenna I knew was chilled out, down-to-earth, uninquisitive. Whoever this was, I wanted to kill her. “Uh . . .” I glanced around the room, looking for help.</p><p>“We haven’t had a proper talk about it,” Braden offered, his hand resting on my lower back in a way that suggested he knew I was about to run away. “But kids are definitely in the plans.”</p><p>My shoulders tensed, my stomach cramped, and the champagne sloshed unpleasantly in my stomach.</p><p>This morning I’d been optimistic as I’d looked at myself in the mirror. I’d thought about my mini meltdown I’d had a few weeks ago when Braden first mentioned having kids. I’d thought that it was something I’d get over.</p><p>But once again, the thought of children paralyzed me.</p><p>Worse, the thought that Braden believed they were in our immediate future paralyzed me.</p><p>I couldn’t have kids yet. I wasn’t emotionally ready for that. No. I definitely wasn’t. “There’s Alistair and his girlfriend.” I pointed over Ed’s shoulder. “I better go say hello.” I pulled away from Braden’s touch and almost sprinted from them, two steps from Alistair when a strong arm wrapped itself around my waist and hauled me about.</p><p>I crashed against Braden’s hard chest, blinking up at him in surprise. “Was that necessary?”</p><p>My husband frowned at me. “Something’s wrong.”</p><p>“No.” I shook my head in denial. “I just . . . Jenna bothers me a little now. I just wanted to get away.”</p><p>As Braden searched my face, I wondered if he believed me. In the end I didn’t know if he did or not. But he let it go, bending down to press a soft kiss to my mouth. It was our wedding.</p><p>No fighting allowed.</p><p>Chapter 4</p><p>The Honeymoon—Part 1</p><p>“Does that say what I think it says?” I asked, leaning my cheek against Braden’s upper arm. With his hand clasped in mine, I stood next to him before the departures board in Edinburgh Airport quietly excited about our honeymoon to Hawaii, and trying not to be deflated by the information on the board.</p><p>Braden gave my hand a squeeze. “Yeah. Delayed.”</p><p>Our flight was delayed by a few hours, which meant being stuck in the airport. Luckily Edinburgh wasn’t grimy. In fact it was kind of shiny. We were surrounded by designer shops, restaurants, and an old-fashioned oval bar at one end of the international departure lounge. Still. It was an airport. As human beings we were genetically predisposed to hate them.</p><p>My husband let go of my hand to curl me into his side, his hand resting low on my opposite hip. “Do you want to wait in the first-class lounge, get a drink there, or do you want to get a drink at the bar we just passed?” he asked, absentmindedly pressing a kiss to my temple. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This was one of the things I loved about him. After having starved myself of affection for years it had taken me a while to get used to Braden’s tactility but now I wouldn’t know what to do without it. His affection for me came so easily he touched and kissed me all the time, even when he was half-distracted. I’d gone from being uncomfortable with it, to expecting and coveting it.</p><p>“Here.” I nodded, taking a reluctant step back. “I need to go to the restroom. I’ll meet you at the bar.”</p><p>After I peed, I stood in front of the washstand, searching my face in the mirror. After the wedding Ellie had said I looked different. I hadn’t known what she meant at the time but gazing at my reflection I had to wonder if it was something different about my eyes. They were gunmetal gray and tip tilted. They weren’t warm, friendly eyes. I knew from photographs of myself that my eyes tended to come off intense, sometimes kind of bedroomy, even though most of the time it was unintended. The warmth only entered them in photographs that caught me laughing. However, staring into my eyes I could see a shift in them. The intensity hadn’t totally left them, but there was definitely something new reflected there. Something good. Something warm.</p> <p>I ducked my head, smiling as I dried my hands.</p><p>My eyes dropped to my legs. They were bare in the sundress I’d chosen to wear in anticipation of the hot weather in Hawaii. My olive skin was ready to deepen to a tan as I lazed by the pool for the next fourteen days. Vacations weren’t something I ever bothered about because I’d lost all that stuff when I lost my family. However, I’d never been somewhere like Hawaii before. And I’d be there with my hot husband.</p><p>Braden and I had busy lives. This was the first time we’d spend a solid fourteen nights just enjoying each other’s company with no interference from work or friends or family. Days by the pool or on the beach, and nights of hot, energetic sex.</p><p>My smile turned smug.</p><p>Strolling out into the departure lounge I wandered slowly toward the bar, glad at least not to be rushing around in a sweaty, flustered mess as some late passengers were. Eyes drifting over the quiet bar, I found Braden’s back facing me as he sat on a stool. The female bartender kept throwing him surreptitious looks as she pretended to be busy.</p> <p>Braden wasn’t a classically handsome guy, but he was rugged, sexy, very tall, well built, and he wore his suits better than an Armani model. Since the moment I’d met him I’d been struck by his natural confidence. It was hot. Even when it veered into arrogance, annoying the hell out of me, I still found it hot.</p><p>So it didn’t surprise me that a lot of people found my husband attractive too.</p><p>When we first started our no-strings-attached relationship I’d pretended not to care when I saw other women flirting with Braden. Afterwards, once I stopped putting him through the wringer and admitted that I loved him as much as he loved me, I’d found it hard not to chase the obnoxious flirts away from him. In fact, sometimes I lost my cool and wasn’t very diplomatic about telling those women that Braden was mine. Of course, he found this amusing and a total turn-on.</p><p>Not so much when the shoe was on the other foot.</p><p>Still, as our relationship had grown, so had my confidence in us, as had Braden’s, and together we’d mellowed somewhat. Not completely, but enough that right at that moment I didn’t want to stride up to Braden in front of the bartender and stake my claim.</p><p>I was going on my honeymoon. I’d taken a huge leap toward putting my issues behind me by even getting married. I was in a damn good mood.</p> <p>I wanted to play.</p><p>Hiding my mischievous grin, I smoothed my features until they were perfectly blank and sauntered toward the bar. However, I didn’t take the stool next to Braden. My heels clicked on the hard, shiny floor as I sashayed onto a stool that gave me a good view of Braden . . . on the opposite side of the bar.</p><p>“What can I get you to drink?” the female bartender asked politely.</p><p>“A glass of red wine, please.”</p><p>I felt Braden’s eyes on me as the bartender turned to get me my drink. Flicking my gaze his way I saw his eyes dancing at my mischief.</p><p>He knew exactly what I was up to.</p><p>The bartender slid the glass of wine toward me as I attempted not to laugh.</p><p>“Hi,” I greeted casually down the bar. “I’m Jocelyn.”</p> <p>He eyed me for a moment with those intimidating, gorgeous pale blue eyes of his. And then he obviously decided to just go with it when he slipped out of his stool and made his way over to the one next to mine. He gave me a smirk as he reached out to take my hand in his. I felt his thumb rub over my wedding rings. “Braden.”</p><p>I gave him a small, flirty smile. “Can I get you a drink?”</p><p>“I really should say no.” He held up his ring finger with his wedding band on it. “I’m married.”</p><p>“Oh?” I hid my smile, feeling a rush of excitement go through me at our little game. “I didn’t realize. I take it your wife isn’t with you this evening?”</p><p>“Apparently not,” Braden answered, his mouth twitching with definite amusement now as our eyes met.</p><p>Pretending we weren’t at a bar in an airport but at home, my gaze turned heated in a way Braden understood. “That’s good news.”</p><p>“It is?” he glanced down at my left hand.</p><p>I turned my diamond so that it sparkled beautifully in the light. “Yeah, I’m married too.”</p><p>Eyes staring into mine again, Braden’s reply was thick with a sincerity that somehow managed to be as emotional as it was sexual. “He’s a very lucky man.”</p><p>I tilted my head flirtatiously. “That’s what I hear.”</p><p>Braden leaned into me and I knew he didn’t even realize he was doing it.</p><p>My smile grew. “So can I buy you a drink?”</p><p>“I actually think I’d like that.”</p><p>The air was charged between us as he waited for my next move. I looked away and called the bartender over. After ordering him a drink, I waited to see if Braden would keep up the pretense with me.</p><p>“So, where are you traveling to?” he asked, his tone amused but slightly rough.</p><p>I didn’t have to look into his eyes to know he was aroused, but I looked anyway because I needed to.</p><p>“Hawaii.” I pressed my leg against his thigh, wishing we weren’t in a public place. I wanted his hands on me.</p><p>“Me too.”</p><p>“Your drink.” The bartender slid Braden’s drink to him.</p><p>We took hold of our glasses and clinked them together.</p><p>“Business or pleasure?” I asked saucily.</p><p>“Oh, I’m definitely hoping pleasure,” he said as I took a sip of wine.</p><p>Slowly I licked a drop of wine off my lower lip, triumphing over the suffocated groan it produced from the back of Braden’s throat. “That makes two of us.”</p><p>Eyes still on my mouth, Braden’s hand tightened around his glass. “My wife wouldn’t be too pleased to find a strange woman flirting with me at a bar.”</p><p>“Is your wife the jealous type?” I teased.</p><p>My amusement was stifled by the intensity of our connection as our eyes held. “She can be,” he murmured.</p><p>I sucked in a breath. “Are you the jealous type?”</p><p>“Abso-fucking-lutely.”</p><p>I smiled. “So you’re both a little possessive, huh? I don’t suppose she’d like what I’m thinking about doing to you, either.”</p><p>Braden ran his gaze over my face before replying. “No, she definitely wouldn’t. But, you know . . . you remind me of my wife.”</p><p>Chuckling, I pressed my leg harder against his. “Yeah, you remind me of my husband.”</p><p>Eyes glittering with laughter, Braden asked, “What would your husband do if he were here right now?”</p><p>“Well, he’s a little possessive himself, but a gentleman, so he’d be polite when he made it perfectly clear to you that I wasn’t yours to flirt with.”</p><p>“Smart man.”</p><p>“That’s what I hear.”</p><p>His laughter always made me feel like I’d won something.</p><p>I stared, relishing everything about him. Slowly, his laughter faded and we were staring at each other like we were about to start going at it right there on the bar. “Then what would he do?”</p><p>The tingling between my legs flared to life and I felt my breasts swell against the thin material of my sundress. Shifting closer, inhaling his familiar scent, I wished we were somewhere we could do something about being this turned on.</p><p>“Jocelyn?”</p><p>I cleared my throat. “He’d probably kiss me. And then he’d insist on hearing about all the things I’m going to do to him when I get him alone.”</p><p>Braden’s eyes instantly darkened, his head descending toward mine before I could blink. His kiss was deep and hot, and I found myself clinging to him. I shivered at the feel of his hand sliding discreetly under my dress, his touch making my nipples pebble with need. I gasped breaking our kiss.</p><p>Barely cognizant of anything around us, I drew his ear to my lips. “As soon as I get you alone,” I whispered, “I’m going to let you fuck me as hard as you want.” I then went on to elaborate until my breathing grew hitched, and the muscles in Braden’s jaw were tense.</p><p>In fact, every line of his body was. His hand was clamped tightly around my thigh. I dropped my forehead to the side of his jaw, trying to control my breathing.</p><p>After a few very long minutes, Braden’s grip on me loosened and he pulled me into a hug. I nuzzled his neck, feeling the burn of unsatisfied lust. “Sorry,” I murmured against his skin.</p><p>He stroked my back in comfort. “Don’t be. It was hot.”</p><p>“Too hot for an airport.”</p><p>I felt him shake slightly, obviously laughing. “Probably. I’ll take care of you later, though. And, hey, at least you don’t have a hard-on in public.”</p><p>My turn to laugh now. Pulling back I glanced down at his lap, hidden under the bar, to see he was not lying. Glancing up into his face I said, “Your mother. Naked.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A look of distaste took the heat out of his eyes.</p><p>He took a swig of whiskey and eventually muttered, “Thanks.”</p><p>I looked down at his lap. The erection was gone.</p> <p>Trying not to smile, I looked away casually and asked airily, “What do you want to talk about until the flight is called?”</p><p>“Cold wind. Sleet. The ugly doorman at Club 39. Porridge.”</p><p>I burst out laughing. “You mean anything that won’t give you an erection?”</p><p>He smiled at me, his eyes roaming my face lovingly. “Maybe we should just stop talking altogether. And put a bag over your head. And cover your legs.”</p><p>“Just don’t look at me.”</p> <p>“I can still smell you.”</p><p>“I could move.”</p><p>“Dare move away from me and I’ll put you over my knee, Wife.”</p><p>“That doesn’t sound so bad.”</p><p>Braden cut me a dirty look and I covered my mouth with my hand so he couldn’t see my grin.</p><p>We were silent for a few minutes and then I leaned my elbow on the bar, resting my chin on my palm as I told him softly. “I’m loving our honeymoon so far.”</p> <p>He took my other hand in his. “I am too.”</p><p>I shifted closer to him, resting my knee against his. “Do you want to wait in the first-class lounge? I’m sure it’s filled with stuffy businessmen types who will certainly shatter the very sexual mood we’ve got going on here with all their stiff-upper-lippishness.”</p><p>Braden’s mouth twitched. “Stiff-upper-lippishness?”</p><p>“Stiff-upper-lippishness.”</p><p>He nodded, laughing softly now as he got up out of the stool and helped me down from mine. Wrapping an arm around my waist, he said as he walked us toward the lounge, “Maybe we should stop using the word ‘stiff’ since apparently being married to you means losing control over my body and any self-respect I might have.”</p><p>“Grounds for divorce?” I teased as we showed our boarding passes to an airline attendant at the lounge doors.</p><p>“Grounds for a marathon fucking,” he answered dryly, not caring that the airline attendant had turned purple at his reply. “You won’t be able to walk for a while when I’m done with you,” he continued, gently guiding me into the lounge, leaving the gasping attendant behind.</p><p>I determinedly tried not to show my embarrassment, as I was used to him sometimes saying hot, blush-inducing shit like that to me in public. The key was to not let him know he’d flustered me.</p> <p>“I’m happy with that as long as we’re talking multiple orgasms.”</p><p>Three suits turned their heads toward me from the small bar in the lounge, their eyebrows raised.</p><p>Braden and I stopped and I felt his hand squeeze my hip. “We’re going to get thrown out of the first-class lounge.”</p><p>I smirked. “You started it.”</p><p>“Actually, you started it.”</p><p>I heaved a sigh and glanced at my watch. “Well, unfortunately we’ve got about ten hours before we can finish it.”</p><p>Not looking too happy about that, Braden’s eyes swept the room, a glint entering them when they stalled on the restroom door.</p><p>“No,” I said immediately.</p><p>He threw me that boyish grin that was very, very difficult to resist.</p><p>Shit, fuckity, shit, fuck.</p><p>“Braden, no,” I hissed. “There’s no way we can do that discreetly.”</p><p>“So?”</p><p>“Braden—”</p><p>He let go of my hand. “Follow me in after a minute.”</p><p>I grabbed his hand back. “No, we’re acting like teenagers.”</p><p>His grin widened as he leaned his head toward mine. “We’re on our fucking honeymoon, babe, that’s the whole point.” He glanced back at the restroom and squeezed my hand. “I’ll go and then you follow me after a minute. Pretend I’m ill or something and you’re just checking up on me.”</p><p>Before I could refuse again, Braden strolled away from me, disappearing into the restroom.</p><p>I looked around the lounge. There were only four men in it and one woman and not one of them was watching me. Still . . .</p><p>“I’ve never been in first class,” I muttered, “and I’m going to get thrown out before I even hit the plane.”</p><p>Frowning I waited what felt like a millennium but was only a few seconds and wandered over to the restroom door. Feeling like a total idiot I knocked on it and asked, “Baby, you feeling okay?”</p><p>When no answer came, I slipped inside like I was a concerned spouse and nothing more.</p><p>We so couldn’t be fooling anyone with that crap.</p><p>Once inside I discovered there were separate doors for men and women.</p><p>I knocked on the men’s, and my knuckles had barely left the door before it opened wide enough for Braden to haul me inside, slam it shut, lock it, and press my back against it.</p><p>I slid my arms around his shoulders as he pressed his hard body against mine. “We’re so getting kicked out of first class.”</p><p>His hand caressed my ass before coasting down my thigh and then back up under my dress. His talented fingers slipped beneath my panties and he whispered hoarsely, “Then let’s make it worth it.”</p><p>Chapter 5</p><p>The Honeymoon—Part 2</p><p>From the moment we stepped into our plantation-style villa in the luxury resort Braden had booked for our honeymoon in the Pacific, I didn’t want to go home.</p><p>A few minutes’ walk from the main resort, up a landscaped, lamp-lit path, sat our villa. A huge deck with a plunge pool and a cabana overlooked the ocean. Inside was a huge airy, beautiful living room with white furniture I was almost afraid to touch and a gorgeous bedroom with a four-poster bed draped in white voile and a walk-in-closet. The final touch of beauty was the marble bathroom, which must have been bigger than Olivia’s entire flat.</p><p>Braden and I had been there for three days. We’d spent our days lazing by our private pool, enjoying spectacular views that filled you with the kind of contentment I wished every day would bring. At night we’d choose from one of the three amazing restaurants, head off to one of the bars to have a few drinks, and then we’d head back to the villa where we made love for hours.</p><p>Best. Honeymoon. Ever.</p><p>For a change of scenery, we’d left the villa on the third day and grabbed a couple of sun loungers under a cabana on the beach. Every now and then a courteous member of staff would approach us and ask us if we wanted anything to eat or drink while we both lay there, reading on our e-readers and soaking up the sun.</p><p>Just an hour before Braden had finally managed to coax me into the sea. I hadn’t been too keen on entering the water, but it was so beautiful its tranquility and Braden’s persistence finally got to me and I decided to wade in.</p><p>Lulled by Braden’s patience, I was completely taken off guard when he dunked me.</p><p>You did not dunk Jocelyn Butler Carmichael and get away with it.</p><p>Thus commenced a water wrestling match that had children swimming out of the way to avoid us while their parents shot us dirty looks. Braden was cracking up. He would be. He was winning. It was only after he lifted me and cannonballed me into the water so hard that I almost lost my bikini top in front of the entire resort that he decided the game had hit its peak. I spluttered and coughed as he swam up to me and retied the strings of the bikini around my neck.</p><p>“Happy now?” I’d slapped water at him, throwing him a mock-dirty look.</p><p>He’d kissed my neck and wrapped his arms around my waist under the water. “Always.”</p><p>There really was no way to be crabby at an answer like that, so I’d let him off the hook, letting him lead me back to our loungers where we were currently drying out. Braden was lying on his stomach, his tall body too big for the lounger, but he seemed comfortable enough. I had turned onto my side, watching him doze in the afternoon sun. Everything about the moment was perfect. From the sound of the water lapping gently to shore, the cries of happy kids, the soft chatter of couples, the smell of suntan lotion and seawater, the tiny flutter of my husband’s lashes as he dreamed beside me . . .</p><p>I should be terrified.</p><p>It was a lot to lose.</p><p>That fear niggled at me and I determinedly pushed it back out.</p><p>“Why are you staring at me?” Braden asked quietly, eyes still closed against the sun.</p><p>“I’ve never seen you relax for this long. It’s nice.”</p><p>“It’s actually nice to be relaxing.”</p><p>Raising an eyebrow, I teased, “You’re telling me you’re not missing keeping busy?”</p><p>His eyes opened slowly, blinking in the sunlight. He shifted up onto his elbows. “I have uninterrupted access to my wife for the next two weeks. Believe me, I’m not missing a thing.”</p><p>A delicious shiver rippled through me and I leaned over so my mouth was almost touching his. “Them be fighting words.” I brushed my lips against his. “I think someone is trying to get into my bikini bottoms.”</p><p>“What do you mean, ‘trying’?” Braden grunted as he cupped his hand around the nape of my neck so his next words were muffled against my lips. I got the gist of it, though. Some cocky comment about having unhindered access to what was beneath my bikini bottoms. I bit his lip gently in retaliation, which only made him groan into my mouth and deepen the kiss.</p><p>Like always the world disappeared and I found myself balancing precariously half on, half off my lounger, clinging to Braden’s biceps as he drugged me with kisses that still knocked me off-kilter.</p><p>The sound of a sharp, playful child’s scream broke us apart, and I smiled ruefully as Braden brushed my lower lip with his thumb. He glanced over in the direction of the scream and my gaze followed his. A young boy was chasing what appeared to be his little sister, his delighted laughter and her mock-screams annoying a young couple that lazed near the spot of their antics.</p><p>Braden looked back at me. “We can return to the villa, lie by the pool, if the kids are bothering you.”</p><p>Frowning, I shook my head. I didn’t mind the kids. Their excitement and joy only added to the overall atmosphere of the resort. “The villa seems a long way away right now and I honestly don’t mind the kids.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My reply caused Braden to tilt his head and ask in obvious surprise, “Really?”</p><p>I snorted and lay back down. “Really.”</p><p>“Well, that’s a good sign.”</p> <p>The smile in his voice for some reason caused my stomach to flip. And not in a good way. “What’s a good sign?” I asked, not really sure if I wanted an answer or not.</p><p>“You. Not minding the kids.”</p><p>Yup, I definitely didn’t want the answer.</p><p>“If you don’t mind the noise of other people’s kids, then you’ll definitely not mind the noise our kids will make.”</p><p>He might as well have wrapped his hand around my throat. I tried to swallow past the constriction his words had caused and I knew I had to get up, walk away, do anything, so that I didn’t have a panic attack. So it wouldn’t be obvious he’d freaked me out I waited as long as I could before saying, “You want a drink? I’m going to get a drink.”</p> <p>I felt his eyes on me as I shoved on my flip-flops and sunglasses, hurriedly tying my sarong around my waist. Not once did I look at him but I knew from his quiet, “Sure, babe,” I hadn’t been successful in keeping my freak-out to myself.</p><p>The whole time the bartender was making up our drinks the guilt clawed at me. I’d left Braden back there wondering what the hell had happened and if I was shutting him out. That was something I’d promised never to do to him again, and I had to keep that promise. With that in mind I took the drinks back to him and settled back onto my lounger.</p><p>After a few minutes of quiet I said, “Let’s go lie on our deck at the villa.”</p><p>Glancing over at Braden I found him staring at me, his brow puckered in consternation. “Why?”</p><p>I held his gaze and answered pointedly, “Because I like the peace and quiet. I want that for a while yet.”</p><p>Braden drew in a deep breath and slowly sat up to face me. Resting his elbows on his knees he leaned in and asked, “But one day you’ll want the noise, right?”</p> <p>My heart started to bang around in my chest at the thought but I nodded tremulously. “Yes. But I just want it to be us for a while.”</p><p>Something dark I didn’t quite understand flashed in his eyes but he kissed me, cupping my face in his hand, and he murmured against my lips, “All right.”</p><p>When he pulled back his eyes moved behind me and he frowned at something. Feeling like there was definitely something off about his acquiescence, I asked, “You okay?”</p><p>I got a reassuring nod and he pulled back, standing up to gather his things.</p><p>Turning, I did the same, shoving my flip-flops back on and bending down to find my e-reader, which I’d hidden under my lounger in the shade.</p><p>“Do you fucking mind?” Braden snapped.</p><p>My head jerked up at his tone and my eyes collided with my neighbor. He was an older man, perhaps in his late forties, early fifties, he wasn’t with anyone, and he was staring in mild amusement over my shoulder at my husband. His eyes flicked to my boobs and then back to Braden.</p><p>Great.</p> <p>I didn’t need to look around to know that Braden’s sharp aggression had drawn all of our neighbors’ gazes.</p><p>“Your woman is very beautiful,” the stranger commented in a thick accent.</p><p>I tensed and quickly turned around to face Braden, giving him a shake of my head. “Leave it.”</p><p>He didn’t leave it.</p><p>He gently took hold of my wrist and pulled me behind him so he could lean into the stranger’s face. “My wife is very beautiful. But to you she’s invisible. Understood?”</p><p>The stranger nodded. “Understood.”</p><p>I understood too. I understood I was mortified.</p><p>Not wanting to cause more of a scene, I let Braden hold my hand as we walked up the beach but as soon as we were out of sight I tugged out of his hold.</p><p>“You’re pissed off.” He sighed.</p><p>“Yes, I’m pissed off. There was no need to speak to him that way. It was embarrassing. You were peeing all over me.”</p><p>I heard his snort of laughter but didn’t dare look at him because I was afraid I’d kill him.</p><p>“That arsehole was ogling you all fucking day and ignoring every warning look I gave him. I don’t appreciate another man staring at my wife like he’s imagining fucking her when he knows I’m standing right fucking there.”</p><p>“Is dropping the f-bomb three times really necessary?”</p><p>He sighed, heavily this time. “You’re still pissed off.”</p><p>Yes, I’m still pissed off. “I’m confused. You overreacted and you know you overreacted. I’m just thinking the overreaction had nothing to do with that idiot staring at my breasts.”</p><p>Instead of agreeing, instead of telling me he was bothered by the unspoken issue that was on our minds, Braden shook his head impatiently and began striding toward the villa without me.</p><p>Dinner was a quiet affair.</p><p>I’d spent the rest of the afternoon lying by the pool with my headphones on listening to Bastille while Braden took a walk around the resort. By the time he came back I was in the shower. When I got out of the shower to get ready for dinner, he got in. Afterward Braden attempted conversation with me. I grunted answers at him, not so much pissed at him anymore as pissed that he’d given me reason on our honeymoon to be pissed at him.</p><p>He’d scowled at me when I strode out of the walk-in wearing a figure-hugging blue dress. The fabric was a thin, stretchy jersey, so although it covered me, it pretty much left little to the imagination. It was a hot dress and I’d bought it for my hot husband.</p><p>At the time the thought hadn’t been to torture him, but I was pissed, so now it was about torturing him.</p><p>Our walk to dinner was quiet. The night before we’d dined at the Oceanview, a restaurant situated on the beach. Tonight I silently led us to the Great Room in the main house of the resort.</p><p>That silence reigned between us all through dinner.</p><p>The tension between us was thickening and I could tell Braden was losing patience with it. Or me, rather.</p><p>Deciding the best thing for us was to get a good night’s sleep and put the stupid argument behind us, I quietly suggested we leave out drinks tonight and just return to the room. I took his brusque nod as agreement.</p><p>Dinner over, we strolled back to the villa. I kicked off my heels to sink my feet into sand, only reluctantly trailing back onto the landscaped path to our villa, all the while secretly dreading a quiet night in with annoyed silence and no sex.</p><p>Inside the air-conditioned heaven, I threw my heels to the floor and padded on cool tiles toward the bedroom. I heard Braden’s footsteps behind me seconds before I found myself jerked back against his body.</p><p>I gasped at the sudden movement, my breath hitching as one hand coasted roughly up my stomach to cup my breast, while the other gripped lightly to my hair. Braden gently tugged my head back, exposing my neck. Those familiar shivers tingled through me as he kneaded my breast, and pressed hot, wet kisses down the side of my neck.</p><p>Just as abruptly as he’d pulled me to him, Braden pushed me forward until I hit the bed. My torso bowed over the end of it as he nudged my legs open with his feet. In the same motion he slipped his hands under the hem of my tight dress and shoved the fabric upward until it hit me midback, baring my ass to him.</p><p>By this point my breathing was as hot and heavy as his.</p><p>Cool air touched my skin as Braden tugged my panties down. I stepped out of them and kicked them aside, quickly widening my stance again and biting back a moan at the feel of Braden’s erection pressing against my ass.</p><p>His fingers dug into my hips as he tormented me with the promise of him.</p><p>“Braden,” I whispered, his name a plea.</p><p>He rubbed his cock between my legs, teasing me mercilessly. I rocked back and forth against him until it was too much.</p><p>“Please,” I whimpered.</p><p>I lost his heat, but it was quickly replaced with his strong fingers slipping between my legs and deep inside.</p><p>He groaned to find me already wet and just like that his fingers were gone, a zip sounded, and his cock slammed into me. I whimpered again, my chest pressed to the bed, my hands gripping the sheets as Braden held me tight by the hips and thrust roughly in and out of me.</p><p>The build started quickly and I found myself rearing back against his dick in desperation.</p><p>“Harder?” he growled.</p><p>“Harder,” I gasped.</p><p>He pumped harder into me and just as I was on the cusp of coming, Braden pulled out, flipped me over onto my back as if I weighed nothing, and took hold of the hem of my dress, pulling it up over my head. He tossed it aside, hurriedly removing his own shirt before gripping my thighs, spreading my legs, and jerking me toward him so only my back was pressed against the bed.</p><p>Our eyes locked and we both moaned as he slid back inside me.</p><p>As he fucked me toward oblivion we kept our eyes locked, the connection heightening our arousal, shooting us toward climax faster. His panting breaths and my gasp filled the night air until his cock drove deep, shattering the fragile tension inside of me.</p><p>“Jocelyn,” he groaned as my inner muscles squeezed him. He jerked hard against me, shuddering as I felt his release inside of me.</p><p>After a moment he wrapped his arms around me and I wrapped my limbs around him, allowing him to drag me farther up the mattress. As soon as I was fully on the bed, Braden collapsed over me, his mouth nuzzling my neck as I squeezed my thighs around his waist and stroked the damp skin of his muscular back.</p><p>He lifted his head to press a soft kiss to my mouth, asking as he pulled back, “Did I make my point?”</p><p>I raised an eyebrow. “That you’re still a freaking caveman? Yes.”</p><p>His chuckle made him shake against me in a way I loved and I was disappointed when he rolled off of me. That disappointment quickly faded when he pulled me into his side.</p><p>“I should clean up,” I murmured.</p><p>“In a bit.” He sighed. “I didn’t like the way that guy was looking at you. I made a point.”</p><p>“It was embarrassing . . . also . . . was it really just about the guy? Honestly?”</p><p>“Of course.” He kissed my hair. “And . . . maybe the bikini. Maybe you shouldn’t wear that one again.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I thought you liked that bikini.”</p><p>“I do like that bikini, but so does every man on this resort with a dick he knows how to use.”</p><p>“Hmm, okay.”</p> <p>He snorted. “You know I hate to point this out since we’re speaking again, but you’ve acted worse when you’ve found women flirting with me.”</p><p>Dammit.</p><p>“Okay, true. But I thought we were trying to be grown-ups now that we’re married.”</p><p>“Is that what you were doing at the airport?” He chuckled again. “Being a grownup?”</p><p>He had a freaking answer for everything. “Fine,” I grumbled. “I’m sorry for being pissed. I guess I was a little edgy. . . .”</p> <p>“Because I mentioned kids again?”</p><p>I tensed against him. “I just . . . I want to wait a few years, but I don’t want you to be upset about that. I don’t want to disappoint you.”</p><p>I quickly found myself on my back, my husband braced over me. “You’re not,” he promised. “We’ll wait.”</p><p>In answer I kissed him.</p><p>Thinking back on it, I kissed him so I didn’t have to see the disappointment he was trying so hard to hide.</p><p>Chapter 6</p> <p>The Homecoming</p><p>Something nudged me into consciousness, but I refused to open my eyes. Instead I kept my face buried in the warm, familiar skin of Braden’s neck.</p><p>It became clear that the thing that woke me was my husband. I could feel him trying to extricate himself from my hold as gently as possible.</p><p>I held on tighter.</p><p>Braden shook against me, his tone rumbling with laughter as he asked, “Am I not allowed out of bed this morning?”</p><p>“Nope,” I mumbled against his skin. “If you move, I’ll have to move. If I have to move it means facing the fact that we’re no longer in Hawaii. I don’t know if I’m ready to deal with that.”</p><p>He rolled me onto my back, laughing at the fact that I refused to open my eyes. “So is the plan to stay here forever?”</p><p>“Yes.”</p> <p>“That might become a problem.”</p><p>I shook my head against the pillows. “I don’t foresee any problems. It’s a sound plan.”</p><p>“Well.” Braden sighed. “We will eventually start to smell. And needing the toilet might become a problem. And with your issues with flatulence—”</p><p>I punched him on the arm, opening my eyes so I didn’t miss. My husband fought me off, laughing as though he was the funniest man on earth.</p><p>“One year,” I growled at him. “All I’m asking for is one year without you bringing that up!”</p><p>“You getting adorably embarrassed when you fart in front of me?”</p><p>After throwing him a narrow-eyed glare, I rolled off the bed. “I am not adorable,” I snapped, stomping out of the bedroom.</p><p>“You’re fucking adorable!” he called to me as I made my way into the kitchen. I rolled my eyes. Braden could be pretty adorable, too, but he’d like it even less than me if I told him that.</p><p>I reached for the kettle, about to call through and ask if he wanted coffee when a wave of nausea caught me completely off guard and I found myself swaying against the counter.</p><p>“Babe, you okay?” Braden rushed to my side, grasping my hip in his hand.</p><p>Breathing through my nose, I fought to hold the sickness down. After a moment I rested my forehead on his chest. “I don’t feel so great.”</p><p>I felt his lips in my hair. “Jet lag. Sit down.” He ushered me toward the kitchen table and planted my ass at it. As he began to make the coffee the nausea rose again and I knew this time there was no fighting it. Without a word I shot up from the table and rushed out of the kitchen to the bathroom.</p><p>The toilet lid was barely up when I heaved everything inside me into it.</p><p>“Jocelyn?” I could feel Braden behind me.</p><p>I waved him off. “I’ll be okay.”</p><p>Sensing I wanted privacy, he left.</p><p>After waiting a few moments to make sure the nausea was dealt with, I got up on shaky legs and washed and brushed my teeth. Seeing my pale face in the mirror, I glowered at it.</p><p>Home sweet freaking home.</p><p>“Better?” Braden asked as I entered the kitchen.</p><p>“Yeah,” I smiled, gratefully accepting the coffee. “Much.”</p><p>Sitting in the waiting room, listening to people cough and sniffle, I felt breakable for the first time in a long time. My chest was heavy, like the air all around me was much too thin, and my thoughts were too harried, making me feel like a crazy person.</p><p>I just needed to know one way or the other.</p><p>If I knew . . .</p><p>I just needed to know.</p><p>“Jocelyn Carmichael, Room Five, Dr. Orr.”</p><p>Here we go. . . .</p><p>Braden was sprawled in the armchair, his shirt sleeves rolled up, his tie askew, and he was staring at the television as if he was only half-interested in what was going on.</p><p>He’d had a long day at work.</p><p>I’d just had a long day.</p><p>And now I was terrified. Terrified of answers. Terrified of fucking up. Of losing . . . everything.</p><p>We’d been home from Hawaii for almost four weeks and I’d been hiding my sickness from Braden ever since that first morning. After a visit to the doctor’s that day I was almost sure of the diagnosis, but I wouldn’t know until they called to confirm the results.</p><p>“Jocelyn?”</p><p>I turned my head to look at my husband.</p><p>He was frowning at me in concern. “What’s wrong, babe?”</p><p>“Nothing,” I whispered, my heart beating hard against my ribs.</p><p>“It’s not nothing. You’ve been quiet. Tense.”</p><p>I shrugged. “I’m just on tenterhooks waiting to see if that lit agent in New York wants to sign me.”</p><p>After months and months of rejection letters I’d gotten an e-mail back from a lit agent from one of the top agencies in New York asking me for the first three chapters of my manuscript. When she e-mailed back asking to see the rest, I couldn’t believe it. I’d been trying not to get my hopes up, and my secret worry was helping keep my mind off it.</p><p>“You sure that’s all it is?”</p><p>I felt sick lying to him. So I didn’t. Instead I got up slowly and sauntered over to him, climbing onto the chair with him so I was straddling his lap. “I wish we were back in Hawaii,” I whispered against his mouth as he ran his hands down my back. “I wish, I wish, I wish . . .”</p><p>“Joc—”</p><p>I cut him off with a hard, desperate kiss, and that night I made love to my husband as if I knew what was coming next could change everything.</p><p>Ellie and Adam had fallen in love with a property on Scotland Street, and in a bid to distract me, I let Ellie set up another viewing so that the girls and I could check it out. Jo, Liv, and I followed Ellie and her estate agent around the Georgian-period flat, and for a while Ellie’s exuberance and exciting plans for the flat took me away from my problem. For a moment I even forgot I had a problem, so it was a bit like being jolted back into reality when my phone rang as we were leaving the property.</p><p>My stomach churned.</p><p>I gave the girls an apologetic smile and wandered off to the side to answer.</p><p>“Mrs. Carmichael, this is Dr. Orr. We have the results of your pregnancy test. I’d like to be the first to say congratulations, you are pregnant.”</p><p>The world skewed to the left.</p><p>“Mrs. Carmichael?” Dr. Orr asked softly. And then his tone became more careful. “I’ll give you time to process the news. Please do call as soon as possible to arrange your prenatal care. We’ll set you up with your first appointment with a midwife.”</p><p>“Thanks,” I somehow managed to mutter, every nerve trembling like I’d just run the New York City Marathon. I hung up and slipped my phone back into my purse.</p><p>I could hear someone trying to speak to me.</p><p>I’m going to be a mom.</p><p>Someone was questioning me.</p><p>I’m going to have a child.</p><p>“Joss, what is it?” Ellie’s frantic voice finally broke through.</p><p>I looked up at her, her pretty face a little fuzzy in my distress. “I have to go.”</p><p>“Go where?”</p><p>“I just—” The world skewed to the right. “I have to go.”</p><p>“Seriously, you’re scaring me. What’s going on?”</p><p>She was scared? She was scared! “Ellie,” I snapped, feeling an invisible hand wrap around my throat and constrict my breathing. “Just . . .” I stopped cold at the unadulterated concern in her eyes. “I need to be alone for a little while.”</p><p>I waited for her nod and as soon as I got it, as soon as I knew she understood I wasn’t shutting her out—I just needed space—I turned on my heel and started walking, almost running, toward the castle.</p><p>Somehow a thirty-minute walk was over in a flash. I was buying my ticket into the castle, I was hoofing up Lang stairs, and striding up onto the elevated section of Edinburgh castle where St. Margaret’s Chapel was situated. And right outside the chapel was my place.</p><p>My place with the canon, Mons Meg, and the best view of Edinburgh.</p><p>I leaned against the cannon for a moment, ignoring the tourists who were trying to get a photograph of it. Feeling its cool cast iron under my hand, I drew in a deep breath.</p><p>I was going to be a mom.</p><p>Limbs still quivering like a mess of jelly, I walked over to the parapet, leaned my elbows on the wall, and gazed out over my home.</p><p>Here was where I found my calm. For whatever reason, this place on Castle Hill allowed me to sort out my feelings, to process them, to deal with them. It was my special place. And I hadn’t needed it in a while.</p><p>But now that I was going to be a mom . . . now, on top of having Braden and Ellie and all of my family and friends to lose, I had something miraculous to lose. My child.</p><p>The tears burned in my throat, the fear becoming something raw inside of me.</p><p>“Jocelyn?”</p><p>I whirled around at the sound of Braden’s voice, knowing that everything I was feeling had to be written all over my face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ellie must have called him and he’d guessed exactly where I’d go.</p><p>Braden’s features grew alarmed at the sight of me and he hurried toward me, gripping my arms in his hands. “Sweetheart, what happened?”</p><p>“I’m pregnant,” I blurted out, the tears spilling down my cheeks.</p> <p>Braden jerked back like I’d hit him. He stared at me a long time, as if trying to figure me out. Just like that he looked like he’d been punched in the gut. “So you came here?” he whispered incredulously.</p><p>I didn’t know what that meant, but I realized quickly it didn’t mean anything good.</p><p>“Braden—”</p><p>“Don’t.” He cut me off, turning from me. “Not here.”</p><p>There was an uneasiness, a new fear, in leaving my place before I’d gotten a chance to work through everything in my head. I’d just wanted that chance before Braden and I . . .</p> <p>We walked in tense silence back down the hill and out of the castle. Braden had a taxi waiting for us on the esplanade. I was so out of it I didn’t even realize Braden hadn’t touched me. He opened the door for me but he didn’t put his hand on my arm to help me in. He didn’t scoot near me once we were inside. I’d realize this all later, when my brain wasn’t a tumult of thoughts and my stomach and chest weren’t awash with too many feelings.</p><p>Not a word was spoken between us, not until the door to our flat was closed behind us and we stood facing each other in the kitchen.</p><p>Braden’s features were hard in a way I didn’t like. “You’re pregnant with my child and that’s such fucking awful news you go to the castle?”</p><p>I couldn’t believe he thought . . . That wasn’t it at all!</p><p>“Braden—”</p><p>“Are you happy or are you unhappy?” he snapped, his glittering with desperation.</p> <p>My heart was pounding so hard in my chest, I thought I might vomit. “Braden.” My lips trembled, my nose stinging. “It’s not that simple.”</p><p>He jerked back again, a pain in his eyes that he quickly banked.</p><p>“Let me—”</p><p>I didn’t get a chance to finish. He was out of the flat too fast.</p><p>Trembling, I sank into a chair. Not only hadn’t I been given a chance to process my own feelings, I was left confused and afraid of Braden’s. He was the kind of man who gave you a chance to explain, but he’d obviously taken my reaction to the pregnancy the wrong way, and now he was too hurt to listen.</p><p>I just needed to explain.</p><p>He had to listen.</p><p>It was late, but I left a message on Dr. Pritchard’s work voice mail asking if I could schedule an appointment that week. Dr. Kathryn Pritchard was my therapist and she’d helped me come a long way in dealing with my post-traumatic stress disorder. She’d helped me grieve for my family and she’d helped me work through my fears. I hadn’t scheduled a session with her in a while, but I needed someone impartial to talk to.</p> <p>Braden stayed gone for hours. I got a text from Ellie asking me if I was okay. It was a dead giveaway that Braden had told Adam about my pregnancy and Ellie knew. She was trying to figure out how to deal with me. I knew this because normally she’d call me or even come around to the flat. A text for news this huge . . . Yeah, she didn’t know how to handle my reaction.</p><p>Staring down at the photo of me with my family Braden had framed and given me for Christmas, I tried to force my insides back together again. I gazed at Beth, my baby sister who I held tight in my arms, and I attempted to do this by understanding exactly what it was I was feeling. The fear was coloring everything, I wasn’t even sure that I was unhappy with the idea of being a mom. It was soon. Sooner that I’d wanted, but if I could just get past the fear, maybe I would see it wouldn’t be such a bad thing. Not such a bad thing at all. This baby was a product of Braden and me. A part of him. A beautiful piece of him. A gift we’d given each other.</p><p>As much as I loved the makeshift family I’d created in Edinburgh, this was my chance at my very own family again.</p><p>That clawing pressure pushed and ripped at my chest but I fought through it, taking deep, even breaths.</p><p>Now I just had to explain all this to Braden so he’d see I wasn’t pulling another “Ellie moment,” pushing him out when things got tough like I did when Ellie was diagnosed with a brain tumor. I just wanted him to understand what was going on inside of me.</p><p>See. I had come a long way.</p><p>I jumped at the sound of the door opening and shutting. My pulse throbbed harder beneath my skin as Braden’s footsteps grew louder the closer he got to our bedroom.</p><p>He stood against the dark backdrop of the hall, the soft light in our bedroom barely casting him out of the shadow, but I could see his expression was tired. Grim, even.</p><p>I sat up, waiting.</p><p>“Today was supposed to be the happiest day of our lives.”</p><p>Guilt gnawed at my stomach and I winced apologetically.</p><p>“I need an answer,” he demanded softly. “I need to know if you’re happy to be pregnant with my kid. After everything we’ve been through, I need that answer.”</p><p>I shifted, reaching out to him. “Please, just let me explain. I’ll—”</p><p>“Wrong answer,” he uttered bitingly, his expression shutting down. “I can’t believe you . . . after everything . . . that we’re back here again.” He turned, leaving me shocked, openmouthed as he stormed down our hall. A door slammed and I hopped off the bed and into the hall to watch a light come on, shining under the guest bedroom door.</p><p>Tears choked me and I swallowed the hitch in my breathing as I tiptoed back into our bedroom. My husband and I had fought quite a few times in the last few years, but not once had Braden let it come between us. He always slept in our bed with me and he always pulled me close at night.</p><p>The hot tears slipped down my cheeks.</p><p>I’d hurt him.</p><p>And for the first time in a really long time, he’d hurt me too.</p><p>That whole night I tossed and turned, my eyes on the hallway. A big part of me wanted to go into our guest room and shake Braden awake and make him listen to me, but the more I lay there and the more I thought everything over, I thought it best to let him sleep so we could have a rational conversation in the morning.</p><p>Except, I was exhausted from lack of sleep. I got up just before six in the morning, sitting in the kitchen drinking coffee and attempting to read a book. Just before Braden’s alarm was set to go off, I got up and made some fresh coffee for him.</p><p>Not too long after, he wandered into the kitchen in his pajamas, his hair in disarray, and I ached with hurt and love as he avoided my eyes.</p><p>“I made you coffee,” I told him quietly, trying to gauge whether or not this would soften him up.</p><p>“Thank you,” he muttered, taking hold of the mug. He leaned against the counter, staring at the wall.</p><p>My stomach flip-flopped unpleasantly.</p><p>I had to explain so he’d stop thinking the worst of me.</p><p>“Braden—”</p><p>“I have to shower.” He walked out of the kitchen abruptly.</p><p>“We need to talk!” I yelled at him angrily.</p><p>His answer was to slam the bathroom door.</p><p>This was a whole new side to my husband. And I did not like it one bit.</p><p>I got up, ready to do battle, when a knock at the door stopped me. That knock was followed by a key turning in the lock, and I knew then it was Ellie.</p><p>Bracing myself, I wondered if I’d be able to handle two of my favorite people being so mad at me. Three years ago that would have been a piece of cake. But these idiots had softened me up, whether I liked to admit it or not.</p><p>Ellie appeared in the kitchen doorway, her blue eyes instantly finding me.</p><p>Whatever she saw in my face made her pale and she came straight at me, arms wide-open.</p><p>I relaxed into her hug, not even realizing until right then how much I needed it.</p><p>“I don’t even know if I should say congratulations.”</p><p>I tensed.</p><p>Ellie pulled back, peering at me cautiously. “Braden’s really upset.”</p><p>I couldn’t speak. I wanted to. But I was afraid if I did I would scream.</p><p>“Look, I’m here, Joss.” She rubbed my shoulder in comfort. “I’m here if you need me.”</p><p>Swallowing past the gust of screams, I nodded and thanked her hoarsely.</p><p>We were quiet as I made her a cup of tea and we sat down at the table together. It occurred to me as we sat in silence that maybe if I told Ellie everything I was feeling, Braden would listen to her. I didn’t know what was going on with my usually understanding and compassionate husband, but what I did know was that he was angrier than I’d ever seen him, and clearly unwilling to listen to anything I had to say. He might listen to Ellie.</p><p>I opened my mouth to speak when the sound of the bathroom door opening halted me. Both Ellie and I turned to watch for Braden and as he passed the doorway he gave his sister a taut nod of hello and continued on into the bedroom to get ready for work. On a Sunday.</p><p>Ellie turned to me, her eyes questioning.</p><p>I took her hand and squeezed it. “He slept in your old room last night,” I whispered. “He’s never done that before.”</p><p>My friend’s expression grew pained. “Joss . . . talk—”</p><p>Nausea hit me before Ellie could finish her sentence and I was up, bending over the kitchen sink. I felt her hands in my hair, holding it back. After spitting up the last of my morning sickness, I sank back against Els, glad for her comforting presence. A flicker of movement out of the corner of my eye drew my gaze and I froze at the sight of Braden staring at me, a muscle ticking in his jaw. He turned to Ellie. “Give Elodie my apologies for missing Sunday dinner. I’ll be in meetings all day. And, uh”—he cut me a look before glancing back at his sister—“stay with her until she feels better.”</p><p>Anger burned through me as Braden walked out of the flat, ignoring Ellie’s shocked and questioning calls of his name.</p><p>Ellie’s pitiful and sympathetic looks suddenly became painful rather than comforting.</p><p>I pulled out of Ellie’s arms. “I’m sorry, hon. I just . . . I’m going back to bed.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She nodded carefully and let me go.</p><p>I couldn’t sleep. I kept playing everything over and over in my head, trying to work out what to say to Braden first to make him stop and talk to me. I had it all planned, but dinner passed and he still didn’t turn up.</p><p>Then evening.</p> <p>I texted him and didn’t get a reply. I called. No reply.</p><p>I texted Adam but he wasn’t with Adam.</p><p>Finally, just after two in the morning, our front door opened. Fury propelled me out of our bedroom and I stormed into the hall as Braden shut the door behind him. His eyes moved to me but it was like he was staring right through me as he started toward the guest room.</p><p>Oh, no! Not again!</p><p>“Where have you been?” I snapped, grabbing hold of his arm so he’d look at me.</p> <p>He jerked his arm away from me like he couldn’t stand to be touched by me. “Out,” he told me simply, his tone cutting. And then he disappeared into the guest room, not even aware that I probably looked like he’d run me over with a car.</p><p>I had theories as to why he was so angry. I knew he thought I didn’t want his kid. I wondered if he was questioning everything about us. I wondered if he was scared. I wondered why he couldn’t just tell me all that. I thought we had come further than that. No . . . I guess I’d just, probably unfairly, thought he’d see me through anything.</p><p>A long time ago he’d almost left me for good for shutting him out. And now he was shutting me out. He’d dived inside his head and he wouldn’t let me near him.</p><p>He didn’t even want me touching him, and that hurt and scared me so much I didn’t want to feel anything. I’d sleep to help with that, but sleep was eluding me. Instead I shut myself in the bathroom and undressed. I switched on the shower and stepped into the freezing-cold water, allowing the shock to dissipate into numbness. My mind adrift, my hands covered the small of my stomach protectively, and I closed my eyes. I could be numb everywhere but there.</p><p>I thought I heard a muffled “Fuck” and it brought my eyes open just as Braden was sliding the shower door open. He reached in, his features like granite as he switched the nozzle to warm. His eyes cut to me. “Are you trying to catch fucking pneumonia?”</p><p>Chittering, I blanched. I hadn’t been thinking. Obviously.</p> <p>“Stay in there until you warm up,” Braden snapped.</p><p>Where was my husband?</p><p>Everything I’d been feeling suddenly broke out of the numbness. All the fear, the guilt, the anger, the loneliness of the past few days, and most especially the hurt.</p><p>Braden jerked back, confusion and something like fear entering his expression.</p><p>But since this man was a stranger . . . I couldn’t give a fuck how he felt.</p><p>I reached over, staring at him blankly, shut the shower door, and turned my back on him.</p><p>Chapter 7</p><p>Castle Hill</p> <p>“It’s been a while, Joss. What’s been happening?” Dr. Pritchard asked in that careful voice of hers. She had mastered the art of not sounding concerned. Nor too breezy. Just calm. Soothing.</p><p>It used to bug the crap out of me. There was a time I would have given anything to hear her yell at her kids for some wrongdoing just so I could hear a little bit of raised blood pressure in her voice. I wanted proof she was human.</p><p>Now I knew she was human. She could be a little on the sarcastic side. That’s probably why I liked her so much.</p><p>“Braden and I got married,” I informed her quietly, my hands resting on my stomach.</p><p>She smiled. “Congratulations.”</p><p>“Thanks.”</p><p>Dr. Pritchard raised an eyebrow. She gave good eyebrow-raising. “Anything else?”</p><p>Easing into the reason for my visit, I avoided the subject altogether. “I got an agent.” It was true. Dana had called at the beginning of the week and I’d signed with her. It should have been one of the most exciting moments of my life. “She has a publisher interested in my manuscript.” Already. Again, should have been one of the most exciting moments of my life.</p><p>“That’s great news.”</p><p>Dr. Pritchard also seemed to fear hyperbole and expressions of excitement. Again, another reason I liked her so much.</p><p>“I’m pregnant.”</p><p>The good doctor was quiet a moment as she processed my blurtage. “Is that why you’re here?”</p><p>I nodded, trying to ignore the lump of tears in my throat as I thought over the last few days. Our home had been a silent, cold place recently. My whole life had. Ellie and Adam had refused to get in the middle, so they were staying out of it completely. I think Ellie must have talked Elodie into the same because I hadn’t heard from her. I’d gotten tentative texts from my friends but no one wanted to bring the subject up. “It’s slammed up this huge wall between me and Braden.”</p><p>“It has or you have?”</p><p>“Actually, he has.” I shrugged. “I was scared when I suspected I was pregnant. I was terrified when I found out that it was true. But I knew that wasn’t all. I just . . . I had to get away, go to my place to process. Before I could, Braden got there, I told him, and he took one look at my face and assumed . . . the worst.”</p><p>“The worst?”</p><p>“That I’m unhappy. That I don’t want a child with him. He’s so mad, so hurt, he wouldn’t and still hasn’t let me explain.”</p><p>“And what would you tell him if he gave you the chance?”</p><p>My hands pressed tighter against my stomach. “That our kid means more to me than anything ever has before. That it scares me to feel that much for anyone. It always will. But that I’m working through it now. That I’m still scared, and I’m scared about screwing it all up, but that I want this with him. I just needed time to work out what I was feeling.”</p><p>“And that was?”</p><p>I smiled at the irony. “So happy I was paralyzed.”</p><p>“You still believe that everything good will be followed by bad?”</p><p>“I haven’t for a long time,” I shook my head. “But this is a huge deal. I had a relapse.”</p><p>“Joss, you’re allowed to feel this way. You recognized it and you’re working through it. That’s all anyone can ask.”</p><p>We were quiet a moment as I studied my wedding rings, twisting the bands on my finger. “He hurt me,” I whispered, not wanting to admit it out loud.</p><p>“Braden?”</p><p>I nodded.</p><p>“He’s not perfect, Joss. You’ve always known that he was a family man. It must be hard for him to wonder if he’s married to a woman who could be unhappy about carrying her own child, his child.”</p><p>“But he won’t let me explain.”</p><p>She cocked her head to the side, giving me a small, reassuring smile. “Maybe he’s afraid to hear what you have to say. So make him listen.”</p><p>“I would . . . but . . .”</p><p>“Joss—”</p><p>“When he’s gone I blame myself,” I admitted. “The way I reacted . . . I can see why he would feel this way, act this way. But when he’s right in front of me, looking through me, not wanting me to touch him, unable to bear my touch, I almost hate him. I feel so alone.” The tears spilled down my cheeks. “And he promised I wouldn’t feel that way again.”</p><p>Dr. Pritchard leaned over and pressed tissues into my hand, giving it a comforting squeeze as she did so. “You have to try to get past that feeling long enough to talk to him. This is a case of total miscommunication, and you two have come too far to let that derail you.”</p><p>I nodded as I wiped the tears.</p><p>“And Joss.”</p><p>“Yeah?”</p><p>She smiled kindly. “Congratulations.”</p><p>She was the first person to say it to me in person, and although I understood it was my own fault that no one else had, it was still nice to hear it. “Thank you.”</p><p>I shutdown the laptop after having just bought up every self-help book Amazon had on being a first-time mom. After my session with Dr. Pritchard I’d come home to an empty apartment and gone into this hyper mode, cleaning and tidying, throwing things out. I’d also ignored reminders that Braden and I weren’t sharing the same bed when I went into the guest room to measure up and saw his stuff scattered everywhere. This was going to be our kid’s nursery. I was thinking yellow or green for a color scheme since those were both gender neutral.</p><p>I’d then opened up my laptop to an e-mail from my new agent, telling me she’d sent off my manuscript to the publisher, and she would like me to start thinking up concepts for a new book. For a while I typed up notes for several ideas I’d come back to, to flesh out later.</p><p>And then I’d started freaking out that I knew nothing about being a mother and began an online shopping spree.</p><p>Nerves frayed, I stood in front of the mirror in our bedroom and lifted my T-shirt.</p><p>No bump yet.</p><p>I smoothed my hand over my stomach thinking how weird it was that there was a little person inside of me whom I already loved beyond reason.</p><p>Now if only my husband would give me a chance to tell him that.</p><p>I glanced at the space between the window and the bed and wondered if there was room to put the baby’s crib there for a while. I wanted him or her to be close to us. I already knew I’d find it difficult to sleep if I didn’t know our kid was safe and at arm’s reach.</p><p>After a few minutes of fruitless search for the measuring tape, I wandered back into the guest room to see if I’d left it in there. I found it on the bedside cabinet, but as I moved away, the address on a letter half-hidden under a book drew me up short.</p><p>Heart beating obnoxiously loud, I slipped the letter out from under the novel and fear prickled my skin in cold shivers as I read it.</p><p>My fingers went numb and the letter fluttered out of my grasp to the floor.</p><p>It was a letter to Braden’s tenants, asking them to vacate the premise in one month’s time. It was his bachelor penthouse on the Meadows. The one he’d put up for rental when he moved in with me.</p><p>The one he could take back from tenants on a short notice if he needed it for personal usage. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My doorbell rang.</p><p>A welcome distraction from the pure fear running cold in my veins.</p><p>“Liv?” I said, after I opened my front door, surprised to see her on my doorstep.</p> <p>Olivia and I were good friends, but for some reason she wasn’t the first person I expected to see. Jo and I were closer. Liv and I only knew each other because of Jo, but we’d quickly banded together as fellow Americans and book enthusiasts.</p><p>Liv’s eyes washed over me in concern and I instantly tensed. I knew what she was seeing. Dark circles under my eyes because I hadn’t been sleeping; a pale, icky complexion; and hair that was all over the place.</p><p>“Is Braden here?” she asked casually as she barged right past me and into the flat.</p><p>There was no need for barging. I welcomed her presence as long as we talked about anything else but Braden and my pregnancy.</p><p>“No, he’s at work,” I replied as I followed her into the kitchen.</p> <p>When I got there she was already making coffee. She frowned at me. “You need to take better care of yourself.”</p><p>“I’ve been busy,” I hopped onto a different subject quickly. “A literary agent in New York now represents me.”</p><p>Liv smiled in excitement. “She loved your book?”</p><p>“She loved my book.”</p><p>“Joss, that’s amazing.”</p><p>I smiled back, knowing out of everyone Liv would be the one to really get how cool it was. Liv was a librarian. Books were her passion.</p> <p>When her eyes dipped to my stomach, uncertainty entering their depths, I cut off her obvious next question.</p><p>“She thinks I should start working on another.”</p><p>To my relief, Liv let me get away with the distraction, listening to me yammer on about my different ideas as we settled in the sitting room with coffee and biscuits. Anything, anything, to forget the letter I’d just found.</p><p>I was in midsentence about this crazy dystopian idea I had that was completely not what my agent had in mind when she asked me to think up new concepts, when the front door opened.</p><p>Braden.</p><p>I felt my whole body lock with tension as I stared, waiting with this horrible sick feeling in my stomach, for Braden to appear in the doorway and crush me.</p><p>He appeared, looking just as tired as I felt, and stopped in the doorway. “Liv,” he greeted her before glancing at me. His eyes instantly narrowed at the sight of me. “Did you sleep today?”</p><p>Are you leaving me? “I couldn’t.”</p> <p>Appearing annoyed, he sighed. “You need to get some sleep.” Tugging on his tie, he strode out of sight.</p><p>“Joss?” Liv’s whispered anxiety brought my attention back to her. She looked so worried for me. “Girl, what are you doing?”</p><p>What am I doing? What am I doing? “Don’t.” She didn’t know shit.</p><p>We sat in taut silence, sipping on coffee.</p><p>“I’ve got a late meeting with Adam,” we heard Braden say as he wandered down the hall. Another lie. The front door slammed behind him. I flinched and desperately tried not to cry. This pregnancy was turning me into an emotional black hole.</p><p>“Oh, honey,” Liv stood up as if she was coming to hug me.</p><p>I held up a hand to stop her. “You hug me and I won’t stop crying. And I need to not cry.”</p><p>She froze, looking helpless and angry that she felt that way.</p><p>I knew exactly how she felt. “It’s not me.” I needed someone other than Dr. Pritchard to know that. “I haven’t shut him out. I’m just having a really hard time right now and I ruined it. I ruined this for him.”</p><p>“He’s the one not talking to you?”</p><p>“He talks. But it’s . . . it’s like he can barely stand to be in the same room as me. He hasn’t asked me how I feel about it now that the shock has worn off. He doesn’t want to know. He doesn’t want me to touch him. . . .”</p><p>“I’m sorry, Joss.”</p><p>“He’s never been like that.” The letter came back to mind and I felt that panic swallow me whole. “I think I’ve fucked up.” My hysterical laughter immediately turned into loud, hard sobbing I couldn’t control. I couldn’t even be mortified that I was breaking down. I was crying too hard to care.</p><p>I felt Liv’s comforting warmth as she gently nudged me aside on the chair and snuggled in beside me so she could pull me into her arms. And then everything just disappeared as I let her comfort me, the tears soaking her shirt a testament to the fact that I wasn’t alone.</p><p>I wasn’t aware of the shaking stopping, or the tears drawing to a halt. Everything was just black as I finally fell into the deep relief of sleep.</p><p>My eyes felt crusty as I tried to open them, consciousness coming to me, and with it the feel of a heavy warmth resting on my waist.</p><p>As I opened my peepers I realized they felt swollen and that’s when I remembered why. I tensed at the memory of crying in Liv’s arms at the same time I looked into my husband’s sleeping face.</p><p>The heavy warmth across my waist was his arm.</p><p>We were lying in bed together.</p><p>I didn’t know how we’d gotten there.</p><p>I started to cry again.</p><p>Braden’s arm tightened around me and through the blur of tears I saw I’d woken him.</p><p>“I wasn’t not happy,” I whispered, licking the salt water off my lips. “I was so happy I was terrified.”</p><p>His warm fingers brushed my chin and I felt the gentle pressure of his touch as he tilted my head back so I would meet his questioning eyes. “Terrified?”</p><p>I nodded. “Just because I’ve come a long way, doesn’t mean I still don’t feel that way. You wouldn’t let me explain. I’m still terrified of losing all the good we have together.” Had together.</p><p>Braden frowned as he sat up. “You’re afraid of losing our baby, so you shut me out before I—”</p><p>“No!” I sat up, glaring at him. “You shut me out.”</p><p>“I thought we were past all this.”</p><p>“Then let me fucking explain!”</p><p>He glowered at me but shut up.</p><p>I glowered back. “You know I’m afraid of losing the people I love. But my kid, our kid, I already love this kid so much I can’t breathe. The thought of something happening . . .”</p><p>Braden shook his head slowly. “You kept avoiding talking about having kids. . . . I started to worry that you didn’t want them. I thought with you running off to the castle it meant you were gearing up to shut me out because . . . you didn’t want our kid. Then when you tried to explain, I was . . .” He sighed.</p><p>“You were what?”</p><p>“Scared,” he admitted softly, his eyes locked with mine. “My mother never wanted me, Jocelyn. Never. I was not a happy kid and I would never wish that kind of childhood on anyone, let alone my own kids. I promised myself if I ever had children I’d be the kind of father mine never was and I certainly wouldn’t marry a woman who wouldn’t treat them like they were her whole world. So I didn’t know how to feel about my wife not wanting our kid. I didn’t know how to react to that and what it meant for us.”</p><p>A knifelike pain cut across my chest. “Is that why you’re moving out?”</p><p>“What?” he asked incredulously, his eyes darkening. “What are you talking about?”</p><p>“The letter.” I lifted a shaky hand, pointing out to the hall. “I found the letter in the guest room. The one asking the tenants of your old apartment to move out within the month.”</p><p>A thick silence fell between us.</p><p>Braden slipped out of bed, staring at nothing for a moment before turning to me with a very familiar anger. “That’s the second letter to those tenants. The first one told them they were being evicted because of the complaints I’d received from residents of the building. The letter you saw was a standard notice telling them how much time they had to get out.”</p><p>Oh.</p><p>Fuck.</p><p>“You thought without talking to you, or trying to work this shit out that I . . . that I . . . was leaving you!” he yelled in disbelief.</p><p>Oh, no, he did not get to be angry anymore. I got out of the bed on the opposite side. “You froze me out. I was scared and confused and you left me on my own!” My voice cracked as I yelled back at him, and the break lowered my voice. “You wouldn’t let me touch you. You flinched from me.” I watched his face soften. “You promised me I wasn’t alone anymore, but instead you made me think you hated me. And I think I hate you a little for that.”</p><p>I turned away so he wouldn’t see me cry again.</p><p>Two seconds later he was turning me into his arms. “Fuck, baby,” he whispered hoarsely. “You could bring a man to his knees.”</p><p>There was so much relief in feeling his arms around me, his chest beneath my cheek. Inhaling his scent. Soaking him in. But I didn’t hold him in return.</p><p>“I’m so sorry,” he said gruffly, desperately, in my ear, easing me back to stare into my eyes. He brushed my hair off my face before cupping it in his hands. There was something like panic in them. “Jocelyn, I will never make you feel that way again. I promise. I’m so sorry.” He kissed me hard, tasting my tears. “I was scared. I acted like an idiot but it was just because this is our kid. It means more to me than anything ever has. I fucked up. I fucked up this time, but I’m sorry. I’m so sorry, sweetheart. I love you. You believe me?” He pulled me against him, his hands running down my back. “You believe me?”</p><p>I took a deep breath, trying to let go of the last few days. It would be so easy to hold on to the hurt and anger. But instead I looked back a few years when I was lying in Braden’s arms, grateful he’d forgiven me for everything I’d put him through.</p><p>I lifted my arms and wrapped them around his back. “I believe you.”</p><p>He kissed me again, this time slower, deeper. When he pulled back he was frowning. “I fucked up,” he repeated quietly.</p><p>“Well, it was your turn.”</p><p>“There will be times,” he murmured against my lips, “when we don’t like each other very much, but I need you to know that I will never stop loving you. This time it was me who was terrified of losing you, and I pushed you away because I was afraid to hear what you had to say. If, God forbid, I ever hurt you again, tell me. Don’t lock me out. Don’t shut the shower door on my face. Scream at me. Don’t let me get away with it until you’re storing that shit up and looking at me like you’re haunted. Because . . . I swear to God, that look in your eyes that night, it almost broke my fucking heart. We need to stop doing that to each other. Right now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I nodded, clinging tighter to him, relief and forgiveness melting my body into his. “I promise. And not just for me, and not just for you. We have a baby to think of now too. Congratulations, by the way.”</p><p>Braden’s eyes brightened. “Congratulations, sweetheart.”</p><p>I laughed. “Oh, Jesus C, that took us long enough.”</p><p>He pulled me up into his arms, so my feet left the ground. I automatically clung to his neck and wrapped my legs around his waist, only to find myself being lowered to my back on the bed.</p><p>Braden lay over me, his loving eyes staring straight into mine. “I’ve missed you.”</p><p>I slipped my hands under his shirt, feeling his warm, muscled back beneath my fingers. “I’ve missed you too,” I told him thickly. “I love you so much. Even when I didn’t like you very much, I loved you completely.”</p><p>His thumb brushed across my cheekbone. “Back at you, babe. And I won’t ever stop loving you. But just in case you have your doubts”—he threw me a quick, heated smile as his fingers curled around the waistband of my sweatpants—“let me show you how hard and deep . . . and desperately I love you.”</p><p>I tilted my hips, giving him better access to slowly peel the sweatpants off. As soon as they were gone I wrapped my legs around his back and my arms around his shoulders. “Let’s do this in the shower,” I murmured hungrily against his mouth.</p><p>Holding me tight, Braden stood up and cupped a hand to my nape, bringing my mouth to his. We savored one another in that kiss, tasting each other, our lips growing swollen from the passionate makeout.</p><p>“I love making out with you,” I confessed, nuzzling his neck as he began walking us toward the bathroom.</p><p>He smiled in agreement and slowly lowered me to the ground once we were inside the bathroom. I pulled off my T-shirt and reached in to switch on the shower while Braden undressed. Divesting myself of my bra and panties, my hungry eyes roamed my husband’s body as he slipped off his boxer briefs. My lower belly clenched with need as he pulled me gently to him, his pale eyes burning with desire as his hands stroked down my spine, to caress the curve of my bottom.</p><p>I sighed, running my own hands over his chest, before pressing soft kisses across his pecs, stopping to tease his nipple with my tongue.</p><p>He squeezed my ass, groaning and pressing his erection deeper into my stomach. I continued to explore him, my mouth trailing kisses across his skin, while my own hands brushed down across his hard abs, smoothed around his narrow hips, and grabbed his taut ass.</p><p>In retaliation, Braden let go of my bottom, stroking up my sides until he cupped both of my tender breasts in his hands. A pleasant pain shot through me when he kneaded them and I gasped, arching my neck. “They’re tender,” I whispered, reminding him of my pregnant state.</p><p>He kneaded them harder and I felt a rush of arousal shoot between my legs.</p><p>“Braden,” I moaned, pushing deeper against him.</p><p>To my disappointment he eased his hold on me.</p><p>I eyed in him question and he smirked, silently answering it by arching me over his arm and lifting my breast to his hot, wet mouth. I cried out at the sensation of his teeth gently scraping my nipple and then I was holding on for dear mercy as he sucked it deep into his mouth.</p><p>My breasts had never been this sensitive before.</p><p>“Oh, God, I think I’m going to come,” I panted in disbelief, my hips undulating against him.</p><p>As if to test that theory, Braden sucked harder, circling my nipple with his tongue, while he squeezed and kneaded my other breast.</p><p>I was on fire, my whole body hot and stiff.</p> <p>And then I felt the ripple in my stomach and the slick wetness between my legs. I’d just had a mini-orgasm from Braden playing with my breasts.</p><p>He lifted his head when he felt my body relax, his eyes questioning.</p><p>Breathing heavily, I smiled languidly, brushing his hair from his face. “Yes.”</p><p>Braden coasted his hand down my stomach and I shivered, my sex clenching in anticipation. He slid two fingers inside me easily and his eyes darkened.</p><p>“You’re soaked.” He pumped his fingers and I rocked against them. “This is going to be fun, babe,” he muttered darkly.</p><p>I held on to his shoulders, moving on his fingers. “Baby, don’t stop.” I was close again.</p><p>“I want to taste you,” Braden said, stopping the penetration. “I want you to come on my tongue.”</p><p>I wasn’t going to argue with that.</p><p>In seconds I found myself inside the shower, my back against the wall, Braden on his knees. He hooked my leg over his shoulder and I dug my fingers into his hair as he lowered his mouth as the shower water sluiced down his back. Consumed with pleasure, with chasing orgasm, nothing else mattered but his tongue circling my clit, his fingers pumping inside of me. My body stiffened as the climax came rushing for me. I cried out my husband’s name as I shuddered my release against his lapping, talented tongue.</p><p>Drowsy, languid, my hands slipped to rest on Braden’s shoulders, moving down his chest as he stood up, kissing me in a wet erotic kiss. With one hand he gripped the back of my right thigh, with the other my ass and I somehow managed to hop up, wrapping my legs around him so he could ease his hot, throbbing dick inside of me. My inner muscles quivered at the pressure of him pushing deep and Braden groaned against my lips.</p><p>Our eyes held as he moved slowly in and out of me, our breathing growing steadily more shallow. “I missed you,” he growled, his grip on me hard as his thrusts came a little faster.</p><p>“I missed you too.” I kissed him. I kissed him with everything I had and Braden bent his knees, his cock thrusting so deep into me as he surged up that my cry broke our lips apart.</p><p>My fingernails dug into his skin as he continued to fuck me with a slow intensity that was sure to kill me. All my muscles were stiff as he worked me toward another climax.</p><p>Braden’s warm breath puffed against my mouth. “Come for me, babe,” he gasped, his hips flexing faster as it approached. “I need you to come, Jocelyn.”</p><p>As if on cue the pressure in my lower body blew out and I shattered on a muffled scream, my sex rippling around Braden. “Fuck,” he grunted, pressing his face into my neck as he fucked me harder, faster, until his own shout of climax was muffled against my skin. His hips jerked against mine, shuddering hard as his cock flooded my womb with his warm release.</p><p>I stayed there, locked around him for a while as we tried to gain control of our breathing.</p><p>Finally, Braden lifted his head and before I could say it he smirked and murmured, “Best. Shower. Ever.”</p><p>Braden stared out at the view and then turned back to me with a pucker of confusion between his brow and a hint of annoyance in his eyes. “And we’re here why?”</p><p>Standing beyond Mons Meg at Edinburgh Castle, I wrapped my arms around my husband’s waist and pressed in close, tilting my head back to meet his eyes. “Somewhere you got the impression that I only come here when I’m in despair. I think that’s why you shut me out. You were angry that I came here when I found out about our baby.”</p><p>He nodded, his grip on my hips tightening. “We don’t need to rehash this, Jocelyn.”</p><p>It was a week after our reconciliation and things since then had been tentative, a little fragile, but good. We were finding our feet again but this time as a pregnant couple. Braden was so excited to be a dad that he was really helping me work through my fears. I also talked to him about seeing Dr. Pritchard again and we’d agreed to see her together, so he’d understand what I was going through even better. Seeing a therapist was not on the list of things Braden ever wanted to do, but he was doing it for our family.</p><p>“I’m not rehashing,” I promised him. “I need you to know that I don’t come here when I’m in despair.”</p><p>He frowned. “You don’t?”</p><p>“No.” I smiled, shaking my head. “I come here whenever I need quiet. Some peace and quiet to process stuff. When I found out I was pregnant everything just filled my head. My mom and dad. Beth. You. Ellie. Elodie. Clark. Everyone I love. And the baby, our baby. I didn’t know if I was scared or happy or sad or excited. It’s an uncomfortable feeling to have all that crap colliding without focus. I came here to focus it so I could work out what I was feeling. But you showed up before I could.”</p><p>“And jumped to conclusions.”</p><p>“Yup. Then I wanted to talk it out with you. I really did. I wanted your help.”</p><p>“And I was a complete bastard.”</p><p>I laughed. “That’s not why I brought you here. I brought you here so you’d know that this isn’t three years ago. When I need to work something out I won’t run from you. But if I come here I need you to know that it’s just a place I like to come for peace and quiet. I’m not shutting you out of it. I want to share it with you.”</p><p>He bent his head to speak quietly against my mouth. “This is your place. You don’t need to share it with me. Just as long as you share what’s going on with you, I’m happy.”</p><p>“I can definitely do that.”</p><p>Smiling, Braden ducked his head as he opened his coat and pulled a small package out of the inside pocket. It was a weird shape and very badly gift-wrapped. “For you.”</p><p>Bemused, I took the present. “What is it?”</p><p>He shrugged, still smiling. “Just something to remind you of who you are and what a great mum you’re going to be.”</p><p>Grateful that he thought so, I quickly unwrapped the gift, my heart flipping over in my chest when I recognized it. It was a silver baby’s rattle and if I turned it I’d find my name engraved on one side and my little sister Beth’s engraved on the other. It had been my rattle and when Beth came along I had my mom get Beth’s name engraved on the other side so I could give it to my little sister. My mom had kept it in a silk-lined box, in the hopes that we’d started a new tradition of passing it down through the family. It wasn’t a story I’d told Braden, even when I’d rescued it from the storage facility in Virginia when we’d gone there to clear out my family’s belongings. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Even without knowing the story, he’d known it meant a lot to me.</p><p>“I got it out of the box with all the things you’ve kept from your family, had it polished up.” He turned it in my hand so Beth’s name was facing upward. “I was thinking if we have a wee girl, we could name her Beth.”</p><p>Swallowing past the lump of emotion clogging my throat, I nodded. “I’d like that. Thank you.” I threw my arms around his neck, the rattle clenched tight in my fist, as I kissed him.</p> <p>We kissed, sweet brushes of our lips that grew quickly heated. My breathing was heavy as I pulled back, my forehead pressing against his. “Do you think we’ve finally made it through?”</p><p>“Made it through?”</p><p>“All the crap.” I grinned cheekily. “Do you think we finally get everything about each other?”</p><p>Braden shook his head, pressing another kiss to my lips as I clung to him. “No, babe. We’re going to spend every day growing up. We’ll learn new things about ourselves, never mind each other.”</p><p>I pulled back. “Did anyone ever tell you that when your fear doesn’t get in the way of your perceptiveness, you are an incredibly wise man, Mr. Carmichael?”</p> <p>He rolled his eyes. “Am I ever going to live this down?”</p><p>I snorted, threading my arm through his as we started to stroll back down the castle hill. “When I fucked up you joked about it inappropriately for months and then pulled it out every now and then when you wanted to make a point.”</p><p>He grunted. “I’ll allow you to emotionally manipulate me with it for a week.”</p><p>“A year.”</p><p>“A month.”</p><p>“A year.”</p> <p>“Six months.”</p><p>I thought about it. That was a fairly lengthy period of torture and it probably fit in better with our pregnancy time frame. “Okay, six months. But I should warn you that it’ll include more than emotional manipulation.”</p><p>“Elaborate.”</p><p>I smiled up at him. “I’m pregnant. My requests, cravings, they may get a little outrageous.”</p><p>His body shook with laughter. “You’re carrying my child. I’d probably take the blame if you murdered someone.”</p><p>“You’d probably do that anyway, pregnant or not.”</p><p>Braden smiled softly down at me. “No probably about it.”</p><p>Chuckling, I held on tighter. “I’m going to make you come shopping with me for maternity clothes.”</p> <p>“I can handle it. In fact, I’m rather looking forward to you having a bump.” He smoothed a hand across my stomach, something he’d taken to doing a lot.</p><p>“My bump? Why?”</p><p>“It’s a caveman thing,” he joked.</p><p>“Elaborate.” I repeated his word back at him.</p><p>“I’m not sure you want to know. You’ve just recently stopped being pissed off at me.”</p><p>“Braden . . .”</p><p>He stopped just as we were about to walk outside the castle entrance onto the esplanade. I let him pull me against him as he bent to whisper his answer in my ear. “When every man sees our bump, they’ll know I was the one you let inside you, they’ll know you’re mine and I’m yours, and that growing inside you is our kid.”</p><p>My lips parted as I pulled back to meet his eyes. “The idea of the bump turns you on,” I said more succinctly.</p><p>He grinned unrepentantly.</p><p>I shrugged. “That’s fine with me. I start showing during my second trimester, and I’ve heard that’s also when I’ll get horny as hell.”</p><p>Braden grabbed my hand as we began walking down the esplanade. “I’ll do my best to accommodate you.”</p><p>“I’m expecting a lot,” I teased. “Filthy comments in restaurants, sex in bathrooms, cars, elevators, the changing rooms of maternity clothes shops . . .”</p><p>My husband laughed, letting go of my hand to wrap his arm around my shoulders and draw me into his side. “You missed the couch, the kitchen table, the shower, the bathtub—and the bed could work, too, you know.”</p><p>“We need to get a cab.” I began walking faster down the Mile.</p><p>I felt Braden grinning at me. “Pregnancy hormones?”</p><p>“Braden-induced hormones,” I grumbled, flagging down an oncoming black cab. I turned to him, my eyes glittering with anticipation. “Since you fucked up last week, I’m in charge. And on top. We’ll see how it goes from there.”</p><p>He sighed heavily, as if it was such a hardship. “Ah, and so it begins.” </p> </body></html>"]