["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Christmas music swelled from the tuxedo-clad orchestra, filling the ballroom of the Edinburgh mansion where two dozen beautiful couples danced beneath garlands of crisp holly and fragrant evergreen boughs. High overhead, giant chandeliers dripping with cut crystals and glittering gold accents scattered soft light like diamonds onto the Darkhaven gathering below. It was night outside the eighteen-foot windows that ran the length of the ballro drom, daytime shutters folded back from the glass to reveal a pristine, moonlit spread of rolling Highland hills blanketed in wintry white.</p><p>The scene was as picture perfect as a page in a glossy magazine.</p><p>Elegant, urbane. Utterly enchanting.</p> <p>Danika could hardly stifle the urge to scream.</p><p>She didn't belong here. Coming back to Scotland for the holidays and to this Breed social gathering tonight-both at the insistence of Conlan's well-meaning relatives-had been a mistake. Two days in Edinburgh and already she was itching to book the next flight home to her quiet life in Denmark. She'd been in her high-heeled sandals and black cocktail dress only two hours, struggling to make small talk with a hundred people she didn't know, and more than half that time she'd been eyeing the mansion's front door with a longing she could scarcely hide.</p><p>\"Are you having a nice time, Danika?\"</p><p>God, it was all she could do not to pivot and bolt.</p><p>Instead, she smiled politely at the young woman beside her. \"Of course. The party is lovely, Emma.\"</p> <p>\"You see? I knew you'd enjoy getting out for a while,\" the petite redhead said. She was the Breedmate of one of Con's distant cousins, a mere child in her twenties, still fresh with the shine of unspoiled youth and glowing with the promise of the eternal bond she shared with James, the handsome Breed male at her side. His dark eyes were tender on Emma, his strong arm holding her protectively at his side. When he smiled at his pretty mate, it was impossible to miss the press of his emerging fangs behind his lip. Desire transformed his gaze too, his irises flashing with heated sparks of amber.</p><p>The couple obviously adored each other, and it was hard for Danika not to envy them their future. Hard to remember what it was like to be newly blood-bonded and so in love, looking forward to time together without end.</p><p>Danika glanced away from the pair and smoothed the scarlet silk mourning sash tied around her waist. She'd forgone the traditional white widow's gown, but even a year and a half after Conlan's death in Boston, she found it difficult to give up this last symbol of her loss. Being in Scotland-Con's homeland-only made his absence more obvious. They'd forged a history together here, in the Highlands. Centuries of time bonded as one, living a peaceful existence, until Con's sense of duty and honor took them to America some hundred years ago, where he'd pledged his sword in service as a warrior of the Order.</p><p>They'd wanted for nothing, except the child they'd finally decided to have. Their son, Connor, conceived just three months before Conlan was killed on an Order mission gone awry. She'd hated leaving the baby back at her guest cottage with Con's family tonight, even for a couple of hours. He was all she had, her only link to the life she'd shared with Conlan MacConn. Danika glanced out at the sea of strangers all around her, civilian Breed males and their mates, a hundred unfamiliar faces in an unfamiliar place. She looked at them all, never having felt so alone.</p><p>\"Will you excuse me for a moment?\" she asked the couple beside her. \"I should call the house again, make sure everything is all right with Connor.\"</p><p>\"But you just checked in on him five minutes ago&amp;nbsp;...\"</p> <p>Danika let the comment trail off behind her, already moving toward the quiet perimeter of the ballroom and fishing her phone out of her little evening clutch. The update from the guest cottage where Danika and Connor were staying was the same as it had been every other time she'd called. Everything was fine with the baby, no need for Danika to worry.</p><p>She thanked the Breedmate watching Connor and ended the call, knowing it was wrong to wish for a reason to leave the party and rush back to her child. She was supposed to be having a nice time tonight. Since she was stuck there until her companions decided to leave, maybe she should at least make an effort to enjoy herself a little.</p><p>Slipping the phone back into her purse, she began a slow circuit of the room. The red sash around her waist deflected the interest of all but the boldest of the unattached Breed males. Then again, at five foot eleven without the added height of her four-inch spike heels and possessing long blond hair, she realized she was hard to miss. She could ignore the assessing stares of the men at the gathering. It was the pitying looks of the other Breedmates that made her feel the most awkward.</p><p>Widowed after so long together? I would rather die myself than lose my mate like that.</p><p>Danika briefly closed her eyes as the thought sailed at her from across the room. She didn't know whose mind she'd tapped into, nor could she bar the intrusion. Every Breedmate was gifted with a unique extrasensory talent. Hers was the ability to read thoughts, be it Breed, Breedmate, or basic Homo sapiens. Unfortunately, since Conlan's death, that ability had become unpredictable, unmanageable. His Breed blood had kept her youthful for centuries; it had also fed her talent and kept it strong.</p><p>Several times already tonight she'd been blindsided by a sudden uninvited mental commentary. Most were mundane prattle and insipid cocktail party drivel, but some thoughts bore sharp edges that zeroed in on her like arrows.</p><p>Never would've happened if Conlan had stayed in Scotland where he belonged. Never should've taken an outlander as his mate.</p><p>Danika lifted her chin and strode deeper into the throng of Darkhaven civilians. Let them stare. Let them cast their silent blame and suspicion. Let them gape at her like the outsider she was. She had never needed anyone's approval; she sure as hell didn't need it now.</p> <p>She walked right through the center of the gathering, her steps unrushed, head held high. Overheard, muffled conversations joined the barrage of unwelcome psychic input, until it was nearly impossible to discern which words were spoken aloud and which were given voice only in her mind. Pointless musings on uncomfortable wardrobe choices and pending holiday plans overlapped with opinionated debates on Breed politics and the dismal economic situation of the human world.</p><p>By the time Danika reached the far side of the ballroom, her sk stroom, hull was ringing from the combined cacophony of sensory input. Some fresh air would help clear her head. She made her way toward a closed pair of French doors that opened onto an outdoor terrace.</p><p>As she neared, she saw the dark shapes of several Breed males standing outside. Their voices were little more than low rumbles on the other side of the glass. She paused at the mention of a pending live cargo shipment overdue at Edinburgh airport-something expensive, requiring discreet handling. That alone was enough to make her instincts prickle, but it was the next comments that froze her feet to the floor where she stood.</p><p>\"Does the cargo include anything&amp;nbsp;...&amp;nbsp;exotic?\"</p><p>\"Perhaps\" came the airless, arrogant reply. \"So, be sure to bring your best offers. And your appetites, whatever they may involve.\"</p><p>Low, conspiratorial chuckles answered from the group of vampires. As they continued talking, their voices dropped to a level too quiet for her to make out. But she tried, edging a bit closer to the terrace doors and feigning rapt interest in a hideous painting framed on the wall beside her.</p><p>Eavesdropping is a very rude habit.</p><p>The thought slammed into her mind from out of nowhere, as deep and rich as molasses and thick with a rolling Scots burr.</p><p>Can be dangerous too, lass.</p><p>Did she know that thick, dark voice? Even more unsettling, did its owner know her?</p><p>Danika sent a quick glance around the gathering, looking for familiar faces among the throng in the ballroom and the smaller groups clustered at its perimeter. Aside from Conlan's handful of cousins and their mates, there were none but strangers all around her.</p><p>Yet she was sure she'd heard that slow, sardonic Highland drawl before. She thought about the conspiring handful of Breed males on the terrace outside, and she wondered&amp;nbsp;...</p><p>Just then, the French doors opened and the four vampires started to file into the mansion. Danika drew back, too late to pretend she hadn't been standing there for more than a few minutes.</p><p>The male leading the pack latched on to her instantly with chill, slate-gray eyes. Impeccably dressed in his Armani tux, black hair slicked artfully back from his face, he gave her a thin smile. \"What have we here?\" The voice that had reeked of arrogance from the other side of the terrace doors now softened with oily charm as all but one of his companions-a towering wall of muscle, broad shoulders, and brooding, dark menace-melted into the rest of the gathering. \"To think I might have left the party tonight without the pleasure of being properly introduced to someone as lovely as you.\"</p><p>Danika offered nothing in response. Far from impressed by his attention, she was too busy trying to get a better look at the Breed male standing behind him. Bodyguard or thug, she couldn't be sure. Tall and formidable, he wore more than one firearm beneath the conservative cut of his graphite wool suit coat. His gaze was partially concealed by the careless tousle of his thick chestnut-brown haih=\"ut-browr, but she could make out the savage line of a knife scar down one beard-grizzled cheek, and the bridge of his nose bore the jag of a poorly healed break. As she stared at him, his generously sculpted mouth turned grim, lips pressed flat and forbidding above his square chin.</p><p>Something prickled deep in her veins. The face was all wrong, but the grave twist of that mouth&amp;nbsp;...</p><p>She knew that dark look. Didn't she?</p><p>\"My name is Reiver,\" said the vampire with the dry voice and oily air that made her skin crawl. His gaze traveled the length of her, brows lifting when he noticed the scarlet sash around her waist. \"And you must be the widow MacConn. A shame about your man. Dangerous business he was in.\"</p><p>Danika flinched at the reference to her dead mate. In fact, she could've sworn she detected the faintest quirk of reaction from Reiver's menacing associate too. \"Conlan was killed doing something he believed in. Dangerous or not, he served the Order with honor.\"</p><p>He lowered his head in a vague acknowledgment. \"Of course. And you have my sympathy for your loss.\"</p><p>She might have believed him even a little, if not for the leering glint in his eyes. \"I'm not particularly interested in anything you have to offer. Now, if you'll excuse me-\"</p><p>When she pivoted to walk away, his hand came down firmly on her arm. Danika heard the rumble of a growl but had no time to register if it came from Reiver or the guard behind him, whose body had gone rigid and alert, vibrating with menace. \"Such a sharp tongue. The heathen warriors of the Order might find that attractive in a female, but you're a long way from Boston, my dear. A little courtesy would serve you well.\"</p><p>She glanced down to the long fingers that were snaked around her wrist and holding on like a vise. His bodyguard moved forward as though prepared to step in, but Danika refused to be cowed by either of them. \"Let go of me.\"</p><p>Reiver's smile became a thin-lipped sneer. \"We've hardly had a chance to get acquainted. Stay. I insist.\"</p><p>\"I said let go.\"</p><p>He didn't. And in that next instant, the ballroom echoed with the sharp crack of her open palm connecting with his face.</p><p>It seemed as though the entire room froze in response.</p><p>Bodies ceased moving on the dance floor. The orchestra faded into quiet. Conversations halted, heads turned. Everyone stared at Danika and at the vampire who was seething in cold fury, blocked from delivering a return strike by the barricading wall of his bodyguard, who had placed himself between them.</p><p>\"Danika!\" Emma rushed over with James from across the gathering. They gaped at her as though she were a child who'd just poked a stick at a coiled viper. \"Danika, what have you done?\"</p><p>\"Get my car,\" Reiver snarled to his bodyguard. His fury was o\"0es fury bvious, glowing in the amber transformation of his eyes and the thinning slits of his pupils. Behind the curled edge of his lip, his emerging fangs gleamed razor sharp. \"This spectacle is over. I'm leaving.\"</p><p>\"Mr. Reiver,\" James interjected, clearly anxious. \"I cannot apologize enough for this&amp;nbsp;...&amp;nbsp;whatever this was about. Please pardon our cousin. She couldn't possibly have intended-\"</p><p>\"No,\" Danika said. \"You don't have to make excuses for me. I can speak for myself. And if I felt an apology was warranted, I'd give it.\"</p><p>Reiver's bodyguard muttered a curse under his breath while his employer's glare burned even hotter. \"The car, Brandogge. Now.\"</p><p>As the big male moved off to carry out the command, Reiver raked Danika with a scathing look that practically stripped her bare. \"Perhaps a little time in Scotland will help smooth the coarse edge America has left on you, Widow MacConn. For your sake, I hope so.\"</p><p>Before she could tell him where to stick that suggestion, Conlan's kin steered her away to let Reiver leave the party without further incident.</p><p>Bran swung Reiver's black Rolls-Royce around to the front of the Darkhaven and put the sedan in park on the paved half-moon drive outside the entrance. His hands itched on the steering wheel, his pulse hammered hard in his ears. Every instinct was on full alert, telling him to get his ass back inside and make sure the situation didn't escalate with his boss and the widowed Breedmate from Boston.</p><p>Not that he had to worry about Reiver. His reputation would insulate him from the worst of the gossip following his public rebuke and the attention it attracted from everyone tonight. Tomorrow it would be all but forgotten, or at least hushed into nonexistence. There were few members of the Breed nation in Scotland who didn't know better than to invite the wrath of Edinburgh's most sinister resident. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>If Reiver wanted problems to go away, they tended to disappear quickly. True to the origins of his name, he had long grown accustomed to taking whatever he wanted. No one refused him anything, and no one dared stand in his way. When fat bribes and illicit favors didn't suffice, Reiver had no qualms about resorting to less civilized tactics to ensure his interests were protected.</p><p>What might Reiver do if he suspected that his private discussion this evening had been overheard by the Breedmate with a longtime connection to the Order?</p><p>It wasn't a stretch to imagine. Bad enough that she'd dented his ego and topped it off with a physical insult in the middle of a crowded ballroom. If Reiver worried that she might know details of his current business dealings, Bran hated to think how his employer would go about securing her silence.</p> <p>Bran despised the son of a bitch. He felt that contempt simmer through his veins and boil into his vision with amber fire as he watched Reiver come out of the mansion and make his way toward the waiting vehicle. It took some effort to tamp down hid ntamp dos hatred and school his features into a mask of professional calm before the other Breed male reached the car and opened the back passenger door.</p><p>He slid into the backseat, slamming the door behind him. \"That uppity bitch better hope our paths never cross again. Be a shame to ruin such a pretty face, but damn if she's not begging for some hard discipline.\"</p><p>Bran grunted, his eyes narrowed on Reiver in the rearview. \"Where to, boss?\"</p><p>\"The club,\" he snarled. But then the mansion's front door opened and out came the tall blonde and the mated couple who'd come to her defense inside. As they headed for the sea of luxury vehicles parked along the wide driveway, Reiver's seething gaze followed her. \"Yes, that's a female in need of a firm hand. Among other things.\"</p><p>Reiver chuckled darkly and Bran's hands tightened to a death grip on the wheel. It was all he could do to resist the urge to reach behind him and smash the other male's face into the bulletproof glass of the back window.</p> <p>But he had to play it cool.</p><p>He hadn't come this far, worked this hard to win Reiver's trust, only to lose it now.</p><p>As Bran stepped on the gas and the Rolls eased into motion, Reiver settled back against the leather seat. \"If there's one thing I can't stand, it's a haughty female. Even less ones who don't know their place.\" Demanding eyes met Bran's gaze in the mirror. \"I want you to find out all you can about that widow of the Order. Report back to me on everything you discover.\"</p><p>Bran gave an obedient nod, then went back to studying the night road ahead.</p><p>He already knew plenty about the woman.</p><p>But that was a long time ago-centuries, in fact. Back in a different time, when he was a different man.</p> <p>And before the beautiful Danish Breedmate had given her heart to his best friend, Conlan of the clan MacConn.</p><p>Chapter Two</p><p>Danika hadn't gone to the party looking to make new friends, but she surely hadn't expected to have a one-on-one clash with the Breed's most feared crime boss in Edinburgh.</p><p>Not that she'd lost any sleep over her run-in with Reiver the night before, despite the terror Emma and James had tried to instill in her after they'd left the Darkhaven gathering. According to them, Reiver's dirty business dealings began a few hundred years ago on the northern border marches, where he acquired livestock, lands, and loyalty at the end of his sword. Now it was payoffs and personal favors that allowed him the freedom to do whatever he pleased. That and his reputation as a man few, if any, dared to cross.</p><p>Danika was more offended by Reiver than afraid.</p><p>And she couldn't dismiss the troubling conversation she'd overheard. Ler\"zive cargo shipments arriving any day now. Whispered requests for exotic offerings that would command hefty prices and ignite the hunger of Reiver's lascivious society friends.</p><p>The very idea chilled her to her marrow.</p><p>Although it was forbidden by Breed law, Reiver wouldn't be the first of their kind to peddle humans as if they were nothing more than cattle meant for slaughter. Skin traders were a despicable scourge, usually ranking among the lowest of the low in Breed society. Base street scum like that generally didn't stay in business for very long.</p> <p>But if someone with Reiver's reputed power and connections had decided to deal in mortal suffering and death, how many innocent lives would he be allowed to steal and destroy before someone had the courage to take him down?</p><p>It was that disturbing thought that had Danika dialing a scrambled phone number in the States while she sat alone inside an Edinburgh coffee shop the next morning.</p><p>\"Gideon, it's Danika,\" she told the Breed warrior on the other end of the line, in Boston.</p><p>\"Hey,\" he replied. The British-born vampire ran the command center of the Order's compound. \"You all right? You need anything? I hope things are good in Denmark.\"</p><p>Normally quick with wry humor, today Gideon seemed cautious, an odd intensity edging his voice. \"I'm fine,\" she said. \"Everything's fine. And I'm in Scotland, actually. I decided it might be nice to spend the holidays here in Edinburgh with Connor.\"</p><p>\"Ah. That's good.\" Relief in his answering exhalation. \"How is the little guy?\"</p><p>She couldn't help smiling when she thought of her sweet baby boy, back at the cottage with Emma this morning while Danika ran daytime errands in the city. Her son was Breed; for him and the rest of his kind, sunlight was a deadly threat. \"Connor's great. Getting bigger all the time. He's so much like his father already. Calm and good-natured. I'm blessed to have him.\"</p><p>\"It's good to hear you're both okay.\" There was a question in the warrior's slight pause now. \"But that's not why you called, is it?\"</p><p>\"No,\" she admitted. As a fresh wave of customers strolled in to place their orders, Danika got up from her table and walked outside for a little privacy. \"Do you know anything about a vampire from the Edinburgh area named Reiver?\"</p><p>\"Let me check the IID.\" The clack of a keyboard sounded in the background as Gideon tapped into the Breed's international identification database. \"Not much on record. Looks like he's been around since the 1700s. Currently holds several properties in the Highlands and a handful of businesses in and around Edinburgh.\"</p><p>\"What kind of businesses?\" She crossed the street and headed for the car lent to her for the day by Conlan's kin. \"Anything out of the ordinary?\"</p><p>\"Import/export companies, couple of antiques shops. And a private gentleman's club on South Bridge. Appears the place has been registered to him for the past century and a half.\"</p><p>She knew that area, a historically notorious part of the Old Town now clogged with tourist shops and pubs. She was only a few blocks away. Danika got into the car and turned the key. \"Do you have the name and address of that club, Gideon?\"</p><p>His answer came in the form of a prolonged silence. Then: \"What's this really about, Danika? You're not being straight with me.\"</p><p>She told him about the incident at the party last night, including the snippet of conversation she'd overheard. \"I can't be sure, but I think he was talking about human cargo, Gideon.\"</p><p>\"Jesus,\" the warrior hissed on the other end of the line. \"And you put yourself within arm's length of this guy? I don't need to tell you what Conlan would say about that-\"</p><p>\"Con's gone. And I'm fine. I just wanted to make you and the rest of the Order aware of what happened.\"</p><p>\"You did the right thing,\" he told her. \"Now do us all a favor and steer clear of the whole situation. We'll take a closer look at Reiver. Don't mention this to anyone-not even the Enforcement Agency. Shit, especially them. The way things are going around here right now, we have to assume that no one can be trusted.\"</p><p>\"That bad?\"</p><p>\"I'm not sure how it could get worse, unfortunately.\" The uncharacteristically grave edge to Gideon's voice had taken on an even darker tone. Although the time she'd been away from the Order had kept her removed from their day-to-day operations, she was still in touch with her old friends and was aware of the war they'd been embroiled in with a powerful enemy named Dragos. The fact that Gideon was unable to make light of that battle now, even to dismiss some of her worry, could only mean bad news. \"The compound's location has been compromised. We're scrambling for temporary headquarters, but the whole plan got more complicated yesterday when Dante and Tess's baby arrived ahead of schedule.\"</p><p>Danika wanted to be happy for Dante and his Breedmate, whom she had yet to meet, but she'd been a part of the Order long enough to understand that a newborn was both a blessing and a burden to a group of warriors who lived-and sometimes died-to make the world a better place.</p><p>\"As if that wasn't enough,\" Gideon went on, \"one of our own is AWOL. Chase disappeared the other night. Based on the way he's been acting lately, we're all dreading that we've lost him to Bloodlust.\"</p><p>\"I'm sorry,\" she said. Of all the warriors, she never would have guessed the most rigid, by-the-book enforcer of Breed law would be the one to fall victim to an irreversible blood addiction. In light of everything the Order was dealing with now, she regretted that she'd called to trouble them with her suspicions about a petty gworut a peangster like Reiver. \"I wish I were there with you all, Gideon. I wish there was something more I could do.\"</p><p>\"Don't worry about us. You take care of you, understand?\" She heard him typing something more on the keyboard in his tech lab. \"You want me to send someone your way? Reichen's in Europe on a mission, but you say the word and I know Lucan will pull him-\"</p><p>\"No,\" she said as she turned the corner from cobbled High Street and slowly made her way along the hodgepodge collection of Victorian-era brick buildings and modern storefronts that lined the South Bridge. \"It's not necessary, Gideon. I'm perfectly fine. I shouldn't have bothered you.\"</p><p>\"No bother, Danika. You're kin, always will be. We all feel that way.\"</p><p>\"Thank you,\" she replied, warmed by the thought. \"I have to go now.\"</p><p>\"Keep out of trouble,\" he cautioned grimly. \"And you get in touch ASAP if you need anything at all. Right?\"</p><p>\"Yeah. I will.\" She told him good-bye and ended the call just as the car's GPS announced that she had reached her destination.</p><p>Although Gideon hadn't spoken the address when she'd asked him for it, his mind had given up the answer to her ESP talent. The building that housed Reiver's club had no signage, only a bloodred door with a brass wolf's-head knocker.</p><p>Danika drove around to a side street where she could park, then walked back to have a closer look. She shouldn't have been tempted to try the front door, but a tentative squeeze of the cold metal latch was too much to resist.</p><p>The building was unlocked. Strange. Unless Reiver's business encouraged straying visitors to enter. She eased the heavy door open and walked into the dim vestibule. Interior shutters blocked the daylight from outside as she closed the door behind her, the soft glow of a fluted wall sconce the only illumination inside. She didn't bother to call into the gloom to see if anyone was there. All she wanted was a quick look, something to either confirm her suspicions about Reiver or dismiss them.</p><p>She ventured farther inside and tried one of the interior doors toward the rear of the vestibule. It was shut tight, bolted. Another door appeared to lead to a stairwell, but it too was locked. So much for a quick look around.</p><p>Danika released a pent-up breath but sucked it short when movement sounded from somewhere inside the building.</p><p>She wasn't alone here.</p><p>She pivoted and raced back to the front door. It was locked now. She struggled with the latch, but it wouldn't budge no matter how hard she tried. \"Damn it!\"</p><p>\"What the hell do you think you're doing?\"</p><p>Danika wheeled around on a gasp.</p><p>It was him.</p><p>Not Reiver, but his menacing bodyguard with the mane of shaggy brown hair and the savagely scarred face. Gone was the dark suit and weaponry. Now he stood before her in nothing but loose jeans and bare feet, looking like he'd just rolled out of bed. It jolted her, seeing his naked, muscled chest and strong arms. Breed dermaglyphs tracked across his torso and over his bulky shoulders in swirling arcs and flourishes. As he moved toward her, the color of those genetic skin markings deepened from the golden tone of his flesh to dark shades that broadcast his displeasure.</p><p>His overlong hair drooped low into his eyes, but she didn't need to see his narrowed gaze to know that it was fixed on her in growing, dangerous anger. She glanced away from him, throwing an anxious look at the locked door behind her.</p><p>\"You don't belong here, lass.\"</p><p>Maybe it was the fact that he was out of her line of sight in that moment, but when he spoke just then-when he called her lass-she realized she knew that gravel-and-velvet voice. She'd heard it in her head at the party, when he'd sent a chiding thought her way for eavesdropping on Reiver. Yet he hadn't outed her to him when he had every chance to do so.</p><p>And there was something else familiar about him, she realized now.</p><p>Something that spoke to her from a distant yet undeniable place.</p><p>She looked at him again, trying to see past the bearded jaw and battle-scarred face that hid behind the thick fall of his hair. \"Do I know you?\"</p><p>\"No.\"</p><p>His curt answer should have been enough to convince her. Instead it only made her study him more. She stared at him, trying to make sense of what her instincts were telling her. \"Mal&amp;nbsp;...&amp;nbsp;?\"</p><p>The hard line of his mouth pressed flat, unreadable. \"My name is Brannoc.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She didn't think so, despite the forbidding glower he pinned on her. \"Brannoc what?\" When he didn't answer, she tried a different tack. \"Reiver called you Brandogge last night. Is that what you are to him, his personal watchdog?\"</p><p>\"When need be.\" He took a step forward, the bulk of his huge body crowding her back against the door. The roll of his Scottish accent deepened with each syllable. \"It was unwise of you to come here. You're trespassing, and my employer does not tolerate intruders in his place of business.\"</p><p>The closer he got to her, the more the air seemed sucked from the room. He was heat and danger and dark menace, a storm pushing her to retreat. Danika held his simmering gaze, mere inches between them now. \"Just what kind of business goes on in here?\"</p> <p>He didn't answer, merely took more space from her, his gunmetal gray eyes throwing off sparks through the tendrils of dark hair that hung into them.</p><p>\"Reiver's running a blood club, isn't he.\" Not a question, because her eso,ecause arlier suspicion had now hardened into a cold certainty that settled like ice in her stomach. \"You know this, and yet you can serve him? What kind of man could willingly protect someone like Reiver and turn a blind eye to the way he makes his living?\"</p><p>\"We all make choices in life. We do what we have to.\"</p><p>\"At the expense of your honor?\" she challenged hotly. \"Even at the cost of your own soul?\"</p><p>He stared at her for the longest moment. Then the lock on the door behind her sprang free with a sharp metallic snick that made her flinch. \"Go back where you belong, lass.\"</p> <p>She didn't move. She didn't care now whether she knew him or if he was simply the hired guard dog of a skin-trading thug. Contempt for what he stood for-for what he was able to condone-put a defiant spark in her veins. \"If you think I'll walk away without doing something about this, you're wrong. I won't be silent knowing innocent people are being hurt-\"</p><p>His answering snarl cut her words short. \"Yes, you bloody will be.\"</p><p>Suddenly she was pressed flat against the carved wood panels of the door, his body scorching hers everywhere they made contact. Which was too many places to count. She felt each contour and muscled bulk, from the unyielding planes of his naked chest and iron-clad abdomen, to the blatantly sexual heat of his pelvis and thick-hewn thighs.</p><p>\"You will be silent,\" he commanded her tightly, full lips drawn back off his teeth and fangs. Fire crackled in his eyes now, but there was more than fury or threat in his wild gaze. There was concern in that hard look. A concern that bordered on desperation. \"You'll say nothing to anyone, Danika. Do you understand?\"</p><p>She gaped at him as the realization of how she knew him finally settled on her. It was an old memory-as old as her love for Conlan. Older, still, for she'd known this man even longer. Might have been tempted at one time to give him her heart, if she hadn't feared he'd leave it crushed under his boot heels one day. \"Oh, my God,\" she murmured, reaching up to touch the grizzled, battle-worn face that had once been so handsome and bold. \"It really is you&amp;nbsp;...\"</p><p>He didn't let her fingers light for more than an instant on his cheek. His grasp was firm, his mouth grim as he gave a slight shake of his head. Danika couldn't breathe. She felt as if she'd been knocked to the ground and lifted high aloft, all at the same time. A tangle of emotion swamped her as she struggled to accept what she was seeing, what she was feeling in that moment.</p> <p>But where she was awash in confusion and a hopeful sense of relief, the man she knew to be Malcolm MacBain projected utter control. Cool and deliberate, devoid of any tenderness, he guided her hand back down to her side and held it there. \"Forget what you heard. Forget Reiver.\" He let go of her, but his eyes still trapped her in their penetrating stare. \"Forget me too.\"</p><p>He reached past her then and freed the latch on the club's front door. A gust of cold, damphe f cold, December wind sifted in around them. Street noise intruded, an unwelcome savior that jolted Danika out of the stupor that gripped her as she stared up into the face of someone she'd once considered a beloved friend but who was now worse than a stranger.</p><p>\"Go,\" he said, and stepped back to give her space and keep himself out of the wan daylight that was reaching into the vestibule.</p><p>Danika looked at him one last time, searching for words that wouldn't come. Then she turned around and numbly walked back into the bustle of the street outside.</p><p>Chapter Three</p><p>\"Boss wants to see you in his office, Bran. Doesn't look happy.\"</p><p>Another of Reiver's personal security detail, Thane, leaned against the doorjamb of Bran's quarters at the club. The vampire was built like a tank, tall and immense, his massive shoulders and arms straining the fabric of his dark suit, the muscled bulk of him filling the doorway. Tonight, his shoulder-length black hair was pulled back in a short queue, the vee of his sharp widow's peak and slashing ebony brows giving his cool green eyes a hawkish quality as he watched Bran finish cleaning his pair of Glock 20s. The guns didn't need the attention, but after the day he'd had, if Bran didn't keep his hands busy, he was liable to punch someone. Starting with the bastard he worked for.</p><p>Taking his time on the weapons, he angled a scowl in Thane's direction as he reassembled the second of the pistols. \"Tell the boss I'll be up in a minute.\"</p> <p>\"And tempt him to shoot the messenger?\" Although he gave a low chuckle as he said it, Thane's shrewd eyes showed no humor. \"You got a problem with Mr. Reiver, you take it up with him yourself, man.\"</p><p>Bran casually inspected both of his service weapons, then shoved them into the cross-body holsters that rode over the top of his graphite-gray shirt. \"I've got no problems with him.\"</p><p>\"You sure about that?\" Thane stared, letting the question hang between them.</p><p>In the seven months since Bran had entered Reiver's employ, Thane had proven the hardest of the other guards to read. Tough, smart, hardcore when needed, if anyone were to suspect Bran's true motives where Reiver was concerned, it would without a doubt be Thane.</p><p>Bran stood up and crossed the small room to retrieve his black suit coat from the back of the wooden chair where it hung. He felt Thane's eyes on him as he shrugged into the coat, completing his thug's uniform, and prepared to face his boss.</p><p>\"I don't know how you do it, man. Living here at the club, day in day out.\" Thane studied him. \"Don't you have a place of your own, or kin somewhere to take you in?\"</p><p>Bran cast a bland look at the thin cot and sparse furnishings of the room that had been his home since he'd come on board with Reiver. He shrugged. \"I have a place to lay my head. I don't need anything more.y sp01D;</p><p>Not for now, at least.</p><p>Not until he had what he came for: vengeance.</p><p>Then, perhaps, he would return to his true home. Try to find some way to live again, in the empty place where Reiver had left nothing but death.</p><p>He brushed past Thane into the hallway. \"The boss say what he wanted?\"</p><p>\"Nope. Just told me to find you and send you up to see him.\" The big guard crossed his arms over his chest. \"Better hope you've got nothing to hide.\"</p><p>Bran ignored the warning and strode through the main floor of the club, past the members' lounge and gaming tables, where a few of Reiver's wealthiest clients had recently arrived to begin their night of deal making, debate, and discreetly arranged debauchery. Reiver's office was upstairs, a lavish suite that spanned the entire third floor of the building. The pair of vampires posted at the door admitted him with expressionless nods.</p><p>He walked in and found Reiver standing in front of a large flat-screen monitor, remote control gripped in his hand. \"You sent for me?\"</p><p>\"Yes.\" The word was little better than a hiss. When Reiver swiveled his head to look at him, his face was hard with displeasure. \"I've been informed that roughly an hour's worth of security camera feed from inside the club today has been damaged irreparably.\"</p><p>\"Really.\" Bran feigned a measure of surprise, even though he'd been the one who destroyed the video surveillance footage personally. Right after Danika's appearance in the building.</p><p>Reiver grunted. \"What's the use of keeping a watchdog on the premises if he isn't aware of everything that goes on in here at all times?\" He set the remote down on his desk, his movements too deliberate. Too calm to be trusted. \"Did anything unusual happen today, Brandogge?\"</p><p>Bran bristled at the insulting nickname but kept his head. Just one more means of Reiver testing him, goading him to see what he was truly made of. \"We had a visitor this morning,\" he said. No sense in denying it; he suspected Reiver already knew anyway and was testing his loyalty. \"The female from the party last night.\"</p><p>\"Danika MacConn.\" The sound of her name on Reiver's lips made Bran's pulse spike with a contempt he fought hard not to show. \"I did some investigating of my own after Thane recovered a backup feed from the lobby this morning. Would you like to see it?\"</p><p>Bran gave a nonchalant shake of his head, his suspicion confirmed that he was being tested and judged. Leave it to Thane to throw him under the bus. But what was worse was the fact that Danika's appearance at the club today had only heightened Reiver's interest in her.</p><p>\"Apparently the meddling bitch is in Scotland only temporarily, staying at the little cottage near the river on the MacConns' lands.\"</p><p>Jesus Christ. He knew where Danika was and how to find her. Details that could prove more than dangerous in the hands of a heartless bastard like Reiver.</p><p>\"The question is, what was she doing nosing around my place of business today?\"</p><p>Bran shrugged dismissively. \"She didn't say what she wanted, but since you saw the camera feed, you know she didn't get far. And she won't be coming back anytime soon. The way I left things with her, I don't think she'll pose any further problems for you.\"</p><p>\"No,\" Reiver said, all too readily. \"No, I'm certain she won't. I saw to that myself a few minutes ago.\"</p><p>All the blood in Bran's head made a swift, cold rush into his boots. He held the flat stare of his employer, careful to betray none of the dread he was feeling. \"What do you mean, you saw to it?\"</p><p>\"I sent a couple of men over to the MacConn lands to look in on the woman. I'm sure they'll be able to persuade her that she might be more comfortable staying out of my affairs. Unfortunately, Edinburgh can be a very dangerous place for a strong-headed woman.\"</p><p>\"Who did you send?\" The words were dry in Bran's throat, his limbs wooden as he waited to hear the answer.</p><p>\"Kerr and Packard.\"</p><p>Two of his most brutal henchman. Where Thane and some of the other Breed males in service to Reiver were threatening in their own right, Kerr and Packard were reserved for only the ugliest jobs. They were the bone-breakers of Reiver's stable, the ones dispatched when he wanted to make his point with someone in the bloodiest of terms.</p><p>It was all Bran could do not to leap on Reiver and tear out the son of a bitch's throat right where he stood. But killing him now wouldn't spare Danika the pain that was heading her way. There would be time to deal with Reiver later-time for Bran to see his vengeance through as he'd long planned.</p><p>Right now, all that mattered was reaching Danika.</p><p>Before Kerr and Packard had the chance to do their worst.</p><p>Bran cleared his throat to dislodge the icy knot that had settled there. \"If there's nothing else you need from me&amp;nbsp;...\"</p><p>\"No,\" Reiver said, casual despite the fact that he'd issued a likely death warrant for an innocent woman. \"That'll be all for now, Brandogge. I'll send for you if I have need of anything further.\"</p><p>Bran inclined his head, then pivoted to make his exit. Each calm stride was a test of his self-control as he made his way back downstairs and through the now-bustling club.</p><p>He had to get out of there. He had to get to Danika, and fast.</p><p>Hell, it might already be too late.</p><p>As he cleared the membershe he membx2019; lounge and turned the corner down a stretch of empty hallway, his steps hastened. Worry and rage snarled in his gut when he thought about Reiver's evil touching someone else he cared about. He couldn't bite back the curse that boiled out between his teeth and emerging fangs.</p><p>\"I gather it didn't go well.\"</p><p>Bran paused, swung a dark look over his shoulder at Thane. The guard stood behind him in the hallway, one beefy shoulder pressed against the wall, his booted feet crossed at the ankle. His expression might have been mistaken for boredom, if not for the glint of suspicion in his eyes.</p><p>\"Something went wrong with the surveillance camera feed today. But I guess you already know that,\" Bran said, wrestling his concern and fury into a semblance of curt frustration. And it didn't escape him that the best defense was often a good offense. \"Thanks for not telling me that my ass was on the line with the boss.\"</p><p>\"Wasn't my place to tell you,\" Thane said. \"You going down to the control room to have a look?\"</p><p>\"Yeah.\" Bran nodded, well aware that there was a back exit to the building down there too.</p><p>Thane started walking toward him. \"I'll go with you.\"</p><p>Bran scoffed. \"You've helped me enough for one night, don't you think? Why don't you do something useful and send a few of the girls up to the boss for a while, tell them to take good care of him, make him real happy. Pick the best ones too, the ones with the most skilled mouths. Maybe if we keep him busy, he'll lay off the rest of us for the night.\"</p><p>Thane stared at him, unsmiling. \"All right, Bran. You do what you have to. I'll handle things with Mr. Reiver.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bran might have questioned the cryptic response, but all his focus was zeroed in on one task now. He stalked toward the club's security control room, casting a quick look behind him as he neared the back exit. The hallway was empty. Thane was gone.</p><p>Bran punched open the door and stepped into the bracing wintry chill outside. Too risky to take one of Reiver's fleet vehicles and hope it wouldn't be missed. Besides, he was Breed. He'd get where he was going even faster on foot.</p><p>He summoned the speed of his preternatural genetics and vanished into the night.</p> <p>Chapter Four</p><p>Danika got up from the rocking chair and gently placed little Connor into the nest of blankets in his crib, careful not to wake him. His face was as innocent as a cherub's as he slept, sated from his evening feeding at her wrist. She savored these tender moments with her baby.</p><p>Watching the small bundle nestled in the center of the delicate crib, it was easy to forget how fierce and unbreakable he'd be one day. How bold and courageous his father's noble Breed blood would make him. In just a few years' time, by the age of five or six, Connor wouldwha be old enough to hunt his own prey. A short decade more and he would be full grown, lethally so, a Breed male ready to make his mark on the world. Would he accept a civilian life, perhaps find a Breedmate to give him sons of his own and centuries of peaceful existence? Or would he follow in his father's footsteps, pledging himself to a greater purpose?</p><p>In her heart, Danika knew the answer to those questions, difficult as it was to accept. Each time Connor grasped her finger in his tight little fist, his innocent eyes far too knowing, too fathomless for a mother's peace of mind, she knew. Her son would be a warrior, like his father.</p><p>And it killed something inside her to think she might lose him one day too.</p> <p>With a soft kiss to Connor's velvety head, Danika drew away from the crib to let him sleep. She retrieved her empty tea mug from the table beside the rocking chair, then clicked off the bureau lamp on her way out of the bedroom, her gaze lingering on her child as she quietly closed the door.</p><p>Even before she turned around, she realized she and Connor weren't alone anymore.</p><p>\"Nice little place,\" said one of the two vampires who stood inside the living area of the cottage. \"Cozy, ain't it, Kerr?\"</p><p>\"Secluded too,\" murmured his companion with a leer that threatened more than simple violence.</p><p>Her fingers tightened around the earthenware mug in her hands. There was no need to wonder how the pair got in. Locked doors were nothing but a moment's mental effort for a Breed vampire who wanted something on the other side. As for the two thugs who dripped melting snow from their boots and dark menace from their every pore, there was no doubt where they'd come from.</p><p>Reiver.</p> <p>For what wasn't the first time that day, Danika regretted her visit to his private club. She was still sick to have discovered that someone she once knew-someone she had cared for-was part of a despicable organization like Reiver's. Whatever Malcolm MacBain was calling himself now, and for whatever reason he seemed determined to deny his true identity, Danika hadn't been fooled. Not even the scars that marred his face had been enough to convince her that he was someone other than Mal. But knowing his name and face from the past was not the same thing as knowing the man he'd become.</p><p>And as she stood before these two terrifying intruders now, part of her wondered if it was Reiver who'd sent them or his loyal guard dog back at the club, who'd demanded her silence with a cold fury that had left her shaken to her core.</p><p>\"What do you want?\" she asked them, lifting her chin to face this threat, even though her legs felt like sand beneath her.</p><p>\"Mr. Reiver asked us to come and see you,\" said the one named Kerr. His big hands were gloved in black leather, sinister mitts that looked large enough to crush her skull. \"He wants you to know there's a storm could be heading your way. He thinks it best if you don't stick around to see it arrive.\"</p><p>\"Is that right?\" As the pair of them stalked toward her, Danika edged away from the bedroom door where Connor slept. Whatever might happen to her tonight, she didn't want to give them any reason to search the rest of the tiny cottage.</p><p>\"Mr. Reiver's of the mind that Edinburgh's going to prove inhospitable to you if you stay any longer.\" As Kerr spoke, the other thug aligned himself with the path she was subtly taking, moving so that he could block her if she had thoughts of making a break. \"My associate Mr. Packard and I are here to help you. Come with us now, and you can avoid what's sure to be a very bad situation.\"</p><p>\"A painful situation,\" added the second vampire, his lips splitting in a chilling grin, baring sharp white fangs.</p><p>Their minds were black with awful intentions, thoughts so brutal she found it hard to breathe as she watched them close in further. She didn't need her extrasensory talent to understand that the odds of her surviving this confrontation weren't good. Even if she agreed to go with them and swore never to speak Reiver's name to another living soul, she knew the trip would end with her death.</p> <p>The idea of Connor being left without his only parent or, worse, dragged into this impossible scenario along with her was more than she could bear. She flung the heavy mug at Packard and bolted into action in the instant his attention was diverted.</p><p>The kitchen was only a few feet away, but she barely made it there before Kerr was on her with hard, punishing hands. She fought his bruising hold, crying out as her skull knocked sharply against the unforgiving edge of the stove. Her arms swung out, hands flailing, scrabbling and searching for any means of defense.</p><p>As she struggled with Kerr, Packard came at her now too. He tossed off his companion with an otherworldly growl. \"Leave her to me,\" he snarled, fangs dripping saliva, eyes wild with amber fury.</p><p>Danika fumbled in a blind panic, hissing when her fingers brushed the hot copper of the teakettle. It was heavy with water on the stove, still scalding from the tea she'd made a short while ago. She grabbed the handle and swung it at Packard with every ounce of strength she possessed.</p><p>He howled when the pot connected with the side of his head. Hot water exploded from out of the spout and the opened lid, dousing his face and neck. A nasty gash bled at his temple. He wiped it with his fingertips, then pierced her with a murderous glower. \"You'll pay for that in shredded pieces, bitch.\"</p><p>Danika backed away in utter terror. She had nowhere to go, nothing else to use against them. No hope of anyone hearing her screams.</p><p>Packard wheeled on her like an animal moving in for the kill. He lunged, and Danika closed her eyes. She waited to feel his huge body collide with her, but in the next instant the entire cottage seemed to erupt into total chaos.</p><p>Cold air swept in from outside in a frigid gust. And with it came a dark shape, moving so fast she could hardly register his movements.</p><p>It was Malcolm.</p><p>\"ka watched in stunned disbelief as he leapt on Packard and slashed the vampire's throat open with the edge of a wicked blade. The guard went down in a bleeding heap, and then it was Kerr who felt Mal's fury. The fight was swift and brutal, fists and knives and flashing, deadly fangs. When it ended, Malcolm's breath was sawing from between his lips, his eyes throwing off fierce sparks as he let go of Kerr's dead bulk and stepped over the body like forgotten rubbish.</p><p>\"Malcolm,\" Danika whispered, aware only then of the shudders that were racking her from head to toe where she stood.</p><p>In the hard, heavy silence that followed, a muffled cry rose up from behind the closed door of the bedroom.</p><p>Mal's wild gaze narrowed on her. \"You have an infant?\"</p><p>\"My son, Connor.\" Her eyes were moist, her voice choked with fear for what might have happened to them. Might still, if the searing look Malcolm pierced her with was anything to go by.</p><p>He raked a hand over his scarred and grizzled jaw, then expelled a vivid curse. \"Get the child, Dani. It's not safe for either one of you now.\"</p><p>Two of Reiver's guards were lying lifeless in pools of blood inside the cottage.</p><p>A widowed Breedmate with an infant son-the family of his one-time best friend and a member of the Order besides, for fuck's sake-were waiting in the dead men's car parked behind him near the end of the snowy driveway.</p><p>And in his hand, a locked-and-loaded pistol aimed at the front window of the small guest house several hundred feet away, its chamber ready to release a hail of rounds and ignite the stream of gas that was leaking from the pipe he'd disconnected on the stove.</p><p>Bloody hell.</p><p>He'd spent half a goddamn year serving a criminal he hated with every ounce of his being, hiding who he was, burying his past and the future yanked out of his grasp, all for one purpose: so he could prepare for the ideal moment when he could take Reiver and the rest of his untouchable cronies down in one fell swoop.</p><p>Only to risk throwing it all away, right here.</p><p>Malcolm MacBain exhaled a low oath in rusty Gaelic. Then he pulled the trigger and turned to stalk back to the idling car.</p><p>Glass shattered behind him. An answering vacuum sucked in some of the chill night air from around him as he walked, pulling with it a flurry of snowflakes that danced on the Highland breeze.</p><p>The world went quiet, but only for a second.</p><p>Then the cottage exploded and the ground beneath his boots shook with an earth-rattling boom.</p><p>Malcolm felt the destruction in his bones. He saw it reflected in the windshield of Reiver's fleet sedan, bright orange flames shooting skyward, the light from the blast illumingn=&gt;ilating Danika's awestruck, horrified face behind the glass.</p><p>He slid into the driver's seat without comment and threw the car into a sharp reverse turn. As he roared away from the burning house, he felt Dani's eyes on him. She held her baby close to her breast, shielding his head protectively with her hand. \"Malcolm, what have you done?\"</p><p>\"The only thing that could be done.\" He kept his focus on the dark road ahead, knowing they had to get where they were going before the fireworks brought all of Conlan's clan out to see what had occurred.</p><p>\"Where are you taking us? Why don't you want Con's family to know what happened back there?\"</p><p>He felt her ability prodding into his skull. He scoffed a rough curse and slanted a sharp look on her. \"Stay out of my head, lass. Leave my damned thoughts alone.\"</p><p>\"They're going to worry about me. I need to let them know that Connor and I are all right-\"</p><p>\"You'll do no such thing.\" His voice grated out of him, harsher than he intended. \"What I did just now was buy you time. Time you'll need to get as far away from Scotland as you can. And it will all be for naught if anyone-even Conlan's kin-know that you and the baby are alive.\"</p><p>Danika was staring at him, shaking her head. \"It's cruel to let them think anything else.\"</p><p>\"Two of Reiver's worst enforcers are dead inside that blaze. He sent them to kill you, Dani. Don't think for a second he won't retaliate on you or the rest of the MacConns if he has even the slightest cause to suspect you might have walked away from this thing tonight.\"</p><p>He let her answering silence fill the quiet of the car as he drove deeper into the night, farther into the rolling hills and wilderness plains of the Highlands where he was born. \"As of right now, you're dead, Danika. You have to trust me. It's the only way.\"</p><p>\"Where will I go?\"</p><p>\"Somewhere he won't think to look for you.\"</p><p>She went quiet beside him again, murmuring soft words to her baby as the bundle in her arms began to fidget and fuss. Malcolm couldn't keep his gaze from straying to her now and then as the miles fell away behind them. She was lovely still, with her pale blond hair and smooth-as-cream skin.</p><p>Time had made him forget how regal yet feminine her Nordic features were, but seeing her now was like looking through a glass to all those years that had passed-the centuries, in fact. Danika MacConn's beauty hadn't faded even a little, despite the faint shadows riding under her eyes that hinted at how long she'd apparently gone without a fortifying taste of Breed blood.</p><p>He regretted the loss she'd suffered with Conlan's death. Losing one's blood-bonded mate was the worst kind of suffering. Con was the lucky one, relieved of the grief Danika had to carrnd had toy without him.</p><p>And watching her interact so tenderly with her baby son opened up a deeper ache inside Malcolm-the ache of a recent loss of his own. It was an anguish that had nearly destroyed him but now gave him reason to breathe. To have patience. To avenge.</p><p>The last thing he wanted was a vulnerable female and baby in his care. All the worse that it should be this female, at this time&amp;nbsp;...&amp;nbsp;in this place.</p><p>Steeling himself to the consequences of his actions that night, Malcolm turned the sedan onto a rambling path that could hardly be called a road. They bumped and jostled through a thick heath, following the line of an old cow fence of tumbledown stones. The fortress dominated the vista up ahead, looming as dark as pitch against the wintry night sky.</p><p>Danika leaned forward in her seat, peering out the windshield. \"I know this place,\" she murmured softly.</p><p>\"Aye,\" he agreed. \"You should know it well enough, I reckon.\"</p><p>She was quiet for a long moment, staring straight ahead as he slowed to a stop in front of it. \"This is the castle where Conlan first asked me to be his mate.\" Danika's face glowed milky white in the lights of the dashboard as she turned to look at him now. \"Malcolm&amp;nbsp;...&amp;nbsp;this is your castle.\"</p><p>Chapter Five</p><p>The fifteenth-century stone tower house had been modernized extensively inside. Cold gray stone walls had been coated with white plaster and adorned with contemporary paintings and black-and-white art photographs of the surrounding Highlands. Roughhewn plank floors were now gleaming hardwood, warmed by thick wool rugs. In place of tallow candles and mounted torches spewing soot and smoke from their open flames, Mal had turned on beautiful lamps to chase away the shadows of the castle's interior. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But it was the room he'd brought Danika and Connor to on the second floor that gave her the most unexpected jolt of surprise. A nursery. Unfinished, by the look of it. A wooden crib stood empty in the center of the cozy chamber. A tall chest of drawers stood against the wall to her left, beside a basket overflowing with a menagerie of stuffed animals and plush baby toys that looked like they'd never been moved. On the far wall, someone had begun painting a whimsical mural-grinning lions and monkeys, wide-eyed elephants and giraffes, frolicking together on a colorful, half-completed landscape of jungle trees and tall green grasses.</p><p>And, draped with a pale sheet in a forgotten corner of the charming little chamber, a rocking chair sat alone in the gloom like a specter.</p><p>\"There are blankets and pillows in the chest,\" Mal said from beside her. \"Use whatever you like.\"</p> <p>When she turned to thank him, he was already gone.</p><p>A few minutes later, after settling Connor in to sleep, Danika made her way back down the curving stairwell through the heart of the castle. She could hear Malcolm in the kitchen at ground level, boots moving over the slate floor, cabinets be waing opened and closed. Warm yellow light seeped out from the open doorway as Danika approached.</p><p>Mal had his back to her as he scooped something out of a bowl on the counter into a plastic zipper bag. His black suit coat and leather weapon holsters were draped over one of the four chairs at the table in the center of the kitchen. Without looking at her, he asked, \"Find everything you need up there?\"</p><p>\"Yes. Thank you.\" She stepped inside the rectangular kitchen. She looked around at the curved white walls, granite-topped cabinets, and glistening stainless steel stove that outfitted the place. \"I remember when this room was just a vault and open fireplace hollowed out of the stone. You and Con would sit down here for hours, arguing philosophy and bragging of your varied conquests. As I recall, yours were often female related.\"</p><p>He grunted. \"A long time ago.\"</p> <p>\"Doesn't seem that long, now that I'm here again,\" she said, marveling at how true that was. The span of time evaporated further when he turned to face her now, his stony gray eyes sober with concern. The sight of him here, in this place, after the danger they'd faced together just a short while ago, made her heart constrict. He walked toward her, holding the filled plastic bag in his hand. It dripped water off one corner, the snow inside already beginning to melt.</p><p>\"No ice in the house, so I collected some snow while you were upstairs.\" He gestured to the table and chairs. \"Sit, Dani. Let me have a look at that bump on your head.\"</p><p>She did as he asked. He walked with her, sinking down onto his heels as she took a seat facing him. She hadn't realized she'd been hurt until she felt the cold touch of the homemade compress against her brow. She winced, sucking in a sharp breath. In reflex, her hand went up to her forehead, where Mal still held the ice pack in place. His skin was warm beneath her fingertips, the feel of his strong bones and tendons burning instantly into her brain.</p><p>The touch lingered, too long.</p><p>Too heavy with unspoken, unbidden, meaning.</p><p>They were too close like this, intimately so. He crouched before her. She with her legs spread on either side of his large body as he leaned in to tend her. His face was level with hers, near enough that she could see the first glimmer of amber burning into the cool gray of his irises. Near enough that she could feel the air crackle in the few inches that separated their bodies, electrified with a palpable tension neither of them seemed to expect.</p> <p>With a scowl, he pulled his hand away from her, placing the compress of melting snow onto the table behind her. \"This wasn't a good idea.\"</p><p>Danika swallowed, her throat suddenly dry. \"You mean helping me tonight, or&amp;nbsp;...\"</p><p>\"All of it,\" he replied tersely, a thick growl that rasped through his teeth and the lengthening points of his fangs.</p><p>But he didn't withdraw from where he hunched before her, and his eyes remained fixed on her face, tormented and stormy. C an\" aSmoldering with the same dark longing that had begun to kindle inside her. He snarled a curse, low under his breath. \"I have to go. I have to get back to the club before Reiver notices I'm gone.\"</p><p>\"Don't,\" she blurted, shaking her head when he started to move away from her. The thought of being left alone, just Connor and her, after the night they'd already had put a chill in her veins. And she couldn't bear the idea of Reiver possibly finding out what Malcolm had done for her and meting out punishment. \"Don't go back there. How can you even think of going back now?\"</p><p>\"I have a job to do, Dani. Simple as that.\"</p><p>\"Reiver is an animal,\" she reminded him. \"He's a beast who trades in human lives. You said yourself he would've had me and my child murdered in cold blood.\"</p><p>\"Yes,\" Malcolm agreed tightly. \"Reiver is all those things. Worse, in fact. A pity you didn't realize that sooner, before everything went to hell tonight.\"</p> <p>There wasn't much blame in that accusation. Rather, a stark dread. A fear in his eyes that his anger didn't quite mask. She searched that haunted gaze, hurting for him, wanting to understand who he'd become. \"What happened to you, Malcolm? What happened to your face, to your name&amp;nbsp;...&amp;nbsp;to the man you used to be?\"</p><p>\"He's gone, as dead as you are now.\" His mouth was a grim line, a muscle ticking in the side of his savaged, beard-shadowed jaw. \"A hell of a lot can happen in a few hundred years, lass.\"</p><p>\"Yeah,\" she said. \"I guess it can. I never thought I'd see the day that Malcolm MacBain tossed away his honor and his good name in order to serve someone like Reiver.\"</p><p>\"We all make choices. And I have my reasons,\" he murmured. With that hissed reply, he finally did withdraw from her. Dark lashes shuttering his gaze, he rose to his feet.</p><p>She stood with him, nose to nose, refusing to let him shut her out. \"Tell me.\"</p><p>\"Let it go, Danika.\" The words were a deep rumble, coming from his chest.</p><p>But she couldn't let him walk away. She stared at him harder, pushing her wayward talent in his direction. \"You hate him.\"</p><p>He didn't answer; but then, he didn't have to. His big body radiated loathing.</p><p>\"It's not loyalty that makes you serve Reiver,\" she said. \"It's rage. Isn't it?\"</p><p>His thoughts answered her like a reflex: He took something precious from me. Everything I had. I will stop at nothing to make him pay.</p><p>Danika closed her eyes as the grief of that pledge sank into her consciousness. \"Mal, I'm sorry.\"</p><p>He roared a dark curse, and then his hand Cthe1C;Mal,s were on her arms, gripping her firmly, hauling her into the shadow of his powerful body. Into the face of his fury. \"Goddamn it, woman! Stay out of my thoughts.\" His grasp held tighter, his eyes bright and wild now, lips peeled back from his enormous fangs. \"Why couldn't you have stayed the bloody fuck out of my life?\"</p><p>Danika had never cowered before a man, not Conlan or any other Breed male. Not even Reiver, or the brutal messengers he'd sent to her cottage earlier that night. But Malcolm's fury was a storm that slammed into her, stripping her of her courage. Buffeting her with a ferocity that left her shaking, breathless.</p><p>He was a dangerous man. Even more so because he was wounded, deep down. Festering with a hatred that was eating him alive. She saw that now. And something more in the searing amber fire of his eyes.</p><p>Desire.</p><p>The interest that had sparked between them before was burned away now. Turned into something far more consuming as Malcolm's hot gaze bore into her, then slowly settled on her parted lips. Another thought arrowed from his mind into hers, uninvited this time, dark and startling in its carnality.</p><p>She could have told him to release her. As formidable as he was, as volatile and strong as she knew him to be, he would have taken his hands off her in an instant if she'd wanted him to.</p><p>But that wasn't what she wanted.</p><p>And he knew it as well as she did.</p><p>\"Danika,\" he rasped thickly, eyes flaring hotly. Then his mouth was on hers.</p><p>The contact was explosive, staggering. It had been so long since she'd been touched, kissed, desired. Malcolm's lips seduced, demanded, claiming hers with a passion that stole all the breath from her lungs. She hadn't realized how much she'd missed the feeling, and even though a part of her had not let go of Conlan-might never fully let him go-the part of her that was still vital, still alive and warm and female, could not deny this need for comforting. For physical, intimate contact.</p><p>The fact that it was Malcolm kissing her now, his hands stroking her arms and throat, strong fingers slipping into the fine hair at her nape as he pulled her deeper into his embrace, deeper into his dizzying kiss, only made her need quicken even more.</p><p>He dragged his mouth to the sensitive skin below her ear, breath scorching, voice gravelly and dark. \"Christ, lass. You shouldn't feel this good. I shouldn't want you like this.\"</p><p>She moaned her reply, lost to the same overwhelming need. For Malcolm. For the feel of his strong hands on her, familiar and yet so very new. No stranger could have stirred her the way he did now, and she let him sweep her into the current of his passion.</p><p>The edge of the table pressed into her backside; Malcolm's hard, masculine body hemmed her in from the front. Even through their clothes, the heat between them was undeniable. The thick jut of his arousal was a heavy demand against her hip, a delicious friction that ground into her in a primal rhythm, his palms and fingers stroking her C sthe he breasts over the soft knit of her sweater.</p><p>Her hands craved to explore him too. She ran them up his broad chest, following the taut slabs of muscle that felt like iron beneath his dark T-shirt. The dermaglyphs on his bared biceps surged with the colors of his need. Dark wine, burnished gold, and deepest indigo pulsed like living tattoos, intensifying with each fevered beat of his heart.</p><p>When she lifted her gaze back to Malcolm's face, she found his expression fierce, his fangs stretched long and sharp, his pupils transformed to catlike slits, all but eclipsed by scorching pools of amber. That light flashed hotter when he reached between her thighs and rubbed the seat of his palm against the aching core of her body. Danika arched into his touch, panting as he stroked her, every nerve ending exploding in waves of hot need.</p><p>\"Tell me to stop,\" he whispered thickly against her mouth, the sharp points of his fangs grazing her lips. \"Tell me you don't want this.\"</p><p>But she could say no such thing. Her cry of mounting release was all she could manage as a dam inside her crumbled away like rubble under the skill of his touch. She broke apart, gasping his name and holding on to his thick shoulders as he pressed her spine down onto the table and covered her with his body.</p><p>Clothing came off in a rush, flung away in mere seconds.</p><p>And then they were naked together. Skin to skin, hands roaming over bare flesh. Mouths teasing, testing, taking.</p><p>Malcolm's thick sex cleaved the wet petals of her body, a heavy demand that made her thighs part wider to take him. He entered her with a curse huffed coarsely between his lips. His long thrust filled her completely, made her arch beneath him in boneless pleasure. His cock invaded and coaxed at the same time, aggressive yet careful, steel sheathed in softest velvet. In that fevered moment, she couldn't get enough.</p><p>Although they'd never kissed before, never touched-certainly never as they had tonight-he knew just how to move with her, when to push her to the edge and where to let her take control of their tempo.</p><p>She opened her eyes and saw a man she knew, a man she trusted with this fragile, needful reawakening of her body. \"Malcolm,\" she panted, reaching up to caress his rough jaw and savaged cheek as he rocked into her with a relentless rhythm. \"Oh, God, Mal&amp;nbsp;...\"</p><p>She didn't know what she meant to say to him. She didn't know if there were words. But then he kissed her and the need to speak left her. He drove harder, deeper, until another orgasm raced up on her and swept her over a steep ledge. He came with her. His shout of release was raw and possessive, taking with it her need to think, or to question how they could have ended up like this, together after lifetimes apart.</p><p>Naked and burning in each other's arms.</p><p>Chapter Six</p><p>It wasn't until the roar of his orgasm subsided that Malcolm felt the full weight of what he'd done.</p><p>Sex, with Danika.</p><p>The widowed Breedmate of a male who'd been like a brother to him all that time ago. The woman who'd put herself in Reiver's crosshairs and was liable to derail Malcolm's entire purpose for living. A female he had no right to desire, let alone seduce-least of all at a time when neither of them could afford the distraction.</p><p>It hadn't been his intention to have Danika naked beneath him tonight. Far from it, in fact. Yet he couldn't muster the good sense to regret what had happened here.</p><p>Carnal, fevered, incredible sex.</p><p>And his greedy body only wanted more.</p><p>He stared down at her, laid out before him like an offering on the kitchen table.</p><p>Christ, she was beautiful. Milky skin and long, lean limbs. Supple curves in all the right places. He stroked his hands over her perfection. Brushed his fingers across her breasts and down her abdomen, where a small red birthmark in the shape of a teardrop and crescent moon stamped her as a Breedmate-a female meant for his kind, capable of bearing Breed young and bonding to one of his race eternally through blood. Only death could sever it.</p><p>The sight of that diminutive mark on Danika MacConn sent a jolt of possessiveness through him-unbidden, but hard to ignore. His fangs were still filling his mouth from the passion he'd shared with her. Now a darker need put a throb in his gums, made his amber-hot eyes burn brighter in his skull&amp;nbsp;...&amp;nbsp;made his pulse quicken with the urge to feed. To take her delicate throat in his mouth and pierce the pretty vein that ticked there. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>To drink from her and bind this female to him at last.</p><p>That urge boiled past his lips on a low growl.</p><p>Danika's dusky blue gaze lifted to him, and he could only hope her ability hadn't betrayed his thoughts to her. \"Come, lass,\" he rasped, disengaging from her heat to take her into his arms.</p> <p>He lifted her up and carried her away from the table, striding naked with her, out of the kitchen and up the castle stairwell to the master bedroom on the second floor. His bedroom. The one he hadn't set foot in for months.</p><p>Not since he'd buried the ruined pieces of his old life and his quest to destroy Reiver began.</p><p>He brought Danika into the room and set her down on the king-size four-poster bed. The thing was a relic, only a couple hundred years younger than he was. Its headboard, canopy, and carved supports were made of tooled black walnut, its thick down mattress cloaked in creamy sheepskin coverlets and wool blankets woven in MacBain red and black. Danika looked sexy as hell in the middle of it, propped up on her elbows, one slender leg bent at the knee.</p><p>Malcolm wanted her all over again.</p><p>Still.</p> <p>Her heavy-lidded gaze raked his naked body and she gave him a knowing smile, all the invitation he requir Kionn he red.</p><p>He prowled onto the bed and covered her, sank back into her welcoming warmth. He made love to her slowly this time, properly, the way a woman like her deserved to be pleasured. When they were both slicked in clean sweat and sated again, he stretched out alongside her and gathered her close. He stroked her pretty breasts, caressed her delicate throat and jawline. Tried to will his eager, all-too-obvious erection to heel. An exercise in futility when Danika reached down to touch him, wrapping her fingers around the shaft and tenderly petting its length.</p><p>He groaned, savoring the feel of her hands on him. His curse was raw in his throat, as dark as the guilt that was suddenly rising up on him. He'd been able to push it aside so long as his senses were consumed with need, but now it gnawed at him.</p><p>Danika's touch went still. She was looking at him in concern now, forehead creased. \"What is it, Mal? Am I doing something wrong?\"</p><p>\"No.\" He cursed again and brought her hand up to his mouth to place a kiss in her palm. \"Nothing you've done is wrong. As for me&amp;nbsp;...&amp;nbsp;Christ.\" He met her searching gaze, hated that he was making her think she was at fault somehow. He couldn't keep his hands from seeking her out. His fingers craved the feel of her the same way his cock longed to be back inside her. \"I feel like I'm betraying Conlan when I touch you. I'm betraying him by wanting you&amp;nbsp;...&amp;nbsp;now, as I did then.\"</p><p>She stared at him in silence, a flicker of surprise in her eyes. \"You wanted me?\" She gave a small shake of her head, dismissing the idea with a quiet laugh. \"As I recall it, through all your travels and exploits at the time, there was hardly a woman you met that you didn't eventually charm out of her virtue.\"</p> <p>\"But not you. And you were the only one I loved,\" he confessed, too late to bite it back.</p><p>He and Conlan had been friends for years, neighbors for even longer. They'd defended their lands together, rode into battles as a single force, as brothers. But as close as they'd been on the field and in duty, the two Breed males couldn't have been more different. Malcolm craved adventure and was always ready to chase it. Conlan was the steady one, the reliable one. The one most deserving of an extraordinary female like Danika.</p><p>Mal could still picture the night he and Con first saw her-the golden, Nordic beauty and adopted daughter of a powerful Darkhaven leader from Copenhagen. She was in Scotland on sojourn, independent even then, a mere girl of eighteen, staying with Breed relations in Edinburgh. Mal had wasted no time making introductions, seeking to impress her with stories of his travels all over the world and his dangerous exploits.</p><p>But it was Conlan who eventually won her over. Calm and considerate, steady Con.</p><p>\"You were so unsettled, always unpredictable,\" she remarked now. \"You would have broken my heart.\"</p><p>\"Probably,\" he admitted. \"But I was an idiot then. I didn't realize what you meant to me until Con confided that you and he were to be mated.\"</p><p>She swallowed, scarcely breathing now. \"I never knew.\"</p><p>\"Would it have made a difference if you had?\"</p> <p>Her eyes fell away from him for a moment, considering. \"No, it wouldn't have. Conlan was a good man, a good mate to me through all our time together. I loved him completely. I always will.\"</p><p>Mal nodded, even though the words tasted bitter. \"He honored you well. As I knew he would.\"</p><p>Danika reached for him now, her fingertips light on his clenched jaw. \"Con's gone, and I'm still alive. I still mourn him, but I can't tell you that my heart isn't glad to be looking at you now, Malcolm. I won't deny that it feels good to be touching you, to be lying here with you, like this. I didn't realize how alone I've felt this past year until I had your arms around me.\" She stroked his scarred cheek, the pad of her thumb brushing tenderly over the poorly healed knife wound. \"Conlan's not the only one you feel you're betraying here tonight, is he?\"</p><p>He turned his head to avoid the contact, wishing he could avoid reliving the failure that earned him that brutal gash. Before Danika had a chance to prod his mind for answers, he mentally slammed the gate down hard on his past. Locked it behind a wall of cold fury. \"I don't want to talk about that, Dani.\"</p><p>\"You have an unfinished nursery upstairs,\" she murmured, sitting up with him when he started to move away from her on the bed. \"You obviously don't live here anymore, or haven't in quite some time. And even though I can tell you're blocking me from your mind right now, downstairs in the kitchen, your thoughts gave away that you lost someone you loved. I know you're grieving and angry-\"</p><p>\"I said I don't want to talk about it,\" he snapped harshly. \"All of that is personal.\"</p><p>She exhaled a quiet scoff. \"There's nothing more personal than what we shared tonight. How can telling me about your past-about the mate it's obvious you loved and lost-be more intimate than this?\"</p><p>\"Because the less you know, the safer it will be for you.\" He swung his feet to the floor. \"I have to go. I've been away from the club for too long.\"</p><p>Danika swung off the bed before he could, putting herself in front of him. Her hands were on his shoulders, her eyes searching his. \"How long have you been plotting to kill Reiver?\"</p><p>Mal hissed a curse. \"Just drop it, Dani.\"</p><p>He felt her push harder at his mind. A determined prod, and then she was inside his thoughts, pulling the truth out of him against his will. \"Seven months,\" she whispered, staggering back on her heels. \"You've had to look at him, work for him&amp;nbsp;...&amp;nbsp;all this time. Why?\"</p><p>\"Because I needed to get close to him,\" Mal ground out. \"I needed to ge K ne&gt;</p><p>\"What happened to your Breedmate, Mal?\" Danika reached out, smoothed her hands over his scarred, broken face. \"Have you told anyone at all?\"</p><p>He shook his head, mute for a long moment as the memories swelled, black as acid. \"I hadn't planned to take a mate. I'd been alone for so long, I'd gotten used to my freedom. I fed from human females, found pleasure with more than a few. But I made it my habit to steer clear of the women with this damnable mark,\" he said, tracing the edges of the Breedmate birthmark on Danika's trim belly. \"But then I met Fiona. She was sweet and gentle and innocent-just a girl of twenty-two. Everything was fresh to her, everything a new adventure, something magical. She looked at me in much the same way, like some kind of goddamned hero from a fairy tale. I had centuries of living behind me, battles won and lost. I looked at Fiona and realized I'd forgotten what it was like to be so carefree and open.\"</p><p>Danika gave him a tender, wry smile. \"You were never either of those things, Mal. Brooding and enigmatic, yes. And devastatingly charming, in your own grim way.\"</p><p>He nodded, unsure why it should come as such a surprise that Dani would know him so well, even after all this time. His mouth quirked with humor, despite the gravity of his memories. \"I tried to keep that cynical, world-weary side of me away from Fiona. Figured I'd let it out a little at a time, lest I scare her off too soon.\"</p><p>\"But she didn't scare away,\" Danika said, holding him in a gentle gaze.</p><p>Mal shook his head. \"No, she didn't. We were together less than a year when I found myself falling in love with her. We blood-bonded, making our home together here at the castle. It wasn't long before she asked me to give her a child. She was only a few months pregnant when&amp;nbsp;...\"</p><p>Danika's breath hitched in her throat. \"You lost them both at the same time? Oh, Mal.\"</p><p>\"She'd gone to Edinburgh to pick up some custom-made bedding-something to match the mural she was painting on the nursery walls.\" He grunted, throat still rough with regret. \"It was morning, so I stayed home. As it was, I'd been working on a surprise for her that I hoped to finish while she was gone. The rocking chair was almost finished when I felt a jolt of terror through our blood bond. Fiona was in danger, in pain. And I was trapped in this bloody fortress by the sunlight burning outside its walls.\"</p><p>Danika swore softly, pulling his head against her breast. \"I'm so sorry, Malcolm.\"</p><p>\"I called her cell phone,\" he murmured, remembering all too vividly the fear that had gripped him in those frantic first moments. \"I called six times, a dozen&amp;nbsp;...&amp;nbsp;it K6;&amp;;&amp;nbsp;irang unanswered. I had no choice but to go out and look for her.\"</p><p>Danika's heart thudded beneath his ear. \"In broad daylight-knowing it would kill you?\"</p><p>\"I didn't care. I went on foot to the city, the fastest means of reaching her. I followed her through our bond, into the crudest of Edinburgh's slums. It was near noon, and my skin was turning to ash. But she was alive, and I still had a chance of saving her.\" He shook his head. \"I wasn't in the city more than a few minutes when I felt our connection go still. It severed, and I knew she was dead. I'd failed her.\"</p><p>She sat down next to him on the edge of the bed. \"You did all you could, Malcolm. More than anyone would expect.\"</p><p>\"No,\" he said. \"Not yet. But I will do right by her. I don't know how long I stood there in the street after she was gone, sensing my flesh was burning but feeling only the emptiness of loss. But then dark clouds moved in and a heavy rain started. It bought me time, which I used to search the city. I looked for her until I found a drug dealer who'd heard of a pimp scoring large off finders' fees for pretty young women-even some men and children-in demand by a client of particular tastes.\"</p><p>\"Live human game,\" Dani breathed. \"For Reiver and his blood clubs.\"</p><p>Mal nodded. \"I never knew such rage as I did when the pimp who took Fiona coughed up Reiver's name. It was the last thing he did. He admitted attacking her that day. He'd grabbed her a few blocks away from the shop she'd visited and took her back to the filth of his flat, where he'd arrange for her sale. But she fought him. She fought for herself and our baby. The pimp had a knife. She tried to get away, and he stabbed her through the heart.\"</p><p>\"Oh, my God.\" A tear streamed down Danika's cheek.</p><p>\"The bastard used that same knife on my face in the moments before I crushed his skull in my bare hands,\" Malcolm said, his voice flat in his ears. \"Part of me wanted to go after Reiver right away. I wanted swift, brutal justice. But Fiona was more important. I couldn't leave her in that place, with that human garbage. So I brought her home. I buried her here that same day, and I swore to her that Reiver and all those who funded his operation would pay with their lives. I won't rest until I've destroyed them all.\"</p><p>\"And so you've forced yourself to serve those same men. All this time.\" Danika was looking at him, sorrowful, almost pitying. \"But at what cost to yourself, Mal?\"</p><p>\"At any cost.\" He got up hastily, tension riding him for the unplanned, unwanted baring of his soul. \"It's late, Dani. I can't risk more time here. I want you to stay put at the castle while I'm gone. I'll try to come back before daybreak.\"</p><p>He didn't wait for her to agree. He stalked toward the adjacent bathroom, willing the shower on with his mind, leaving Danika in silence behind him.</p><p>Chapter Seven</p><p>Reiver was waiting for him when Malcolm arrived back at the club.</p><p>\"Busy night, Brandogge?\" Reiver was in the public room of the establishment, reclined on a leather sofa, his dress shirt and suit pants unbuttoned. With him was a topless brunette under one arm, a blonde scantily clad in a red lace bra and panties under the other-club regulars whom Reiver kept in frequent rotation in his own personal stable. The women were in his thrall, puncture marks still faintly visible on their necks and limbs, hands roaming all over him as he watched Malcolm with shrewd, untrusting eyes. \"I looked for you a couple of hours ago. Thane mentioned he thought you went out for a bit. An important errand or something, he guessed.\"</p><p>Thane, the ass-kissing bastard. Was he worried Mal might be his chief competition as Reiver's right arm? Little did the other guard know what Mal had in store for their employer. And if he got in the way when the time came for Mal to make his move, he wasn't opposed to taking Thane out too.</p><p>At least he'd sent the feminine diversion as Mal had asked. For that alone, he was tempted not to wish the guy dead in the fallout yet to come.</p><p>And whatever Thane's intentions, Mal knew better than to let Reiver think he had him caught in a lie or betrayal of trust.</p><p>\"I went out to check on Packard and Kerr,\" he volunteered. \"I didn't tell Thane where I was going, since I wasn't sure you'd want anyone else privy to your instructions where the woman was concerned. I figured Thane would know if you wanted him to know.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Reiver grunted, toying with a lock of the brunette's long hair. \"There was a house fire reported on the MacConn lands tonight. Packard and Kerr haven't come back.\"</p><p>\"They're dead,\" Mal replied flatly. \"By the time I got there, things were already going south. The woman wasn't about to go down easy. Turns out she had a child to protect too. She was putting up a hell of a fight. It was getting messy.\"</p><p>He didn't have to fake the bitterness of his report. It echoed a similar one that had occurred seven months earlier, in the filthy hovel of a pimp's dank flat. Only Malcolm hadn't reached that altercation in time to make a difference.</p> <p>He muzzled his hatred and channeled it into a mask of cold indifference. \"Packard and Kerr were botching your orders. I had no choice but to finish things as cleanly as possible and obliterate the evidence.\"</p><p>\"The Breedmate and her child?\"</p><p>Malcolm shrugged, nonchalant. \"As was your concern, she would've been a persistent problem. So I made sure the situation was snuffed out permanently. Packard and Kerr were collateral damage.\"</p><p>Reiver's dark brows lifted as he considered the account. Then he chuckled darkly and got up from the sofa, bringing his pair of human playthings along with him. He walked over to Malcolm and cuffed hi Sandckls shoulder. \"Good work, Bran. No doubt you've worked up an appetite taking care of so much important business for me.\" Reiver shoved the blonde at him. \"She's yours to do with what you will. Never let it be said I don't reward my loyal hounds with a juicy bone when they've earned it.\"</p><p>Malcolm caught the woman as she stumbled into him, dazed and unsteady from her service tonight. She reeked of liquor and narcotics, sex and blood loss. Mal's stomach recoiled, but his revulsion centered on the vampire who watched him closely, waiting to see how Malcolm would respond.</p> <p>He had no thirst that needed slaking in this place, least of all when it would come from Reiver's leavings. But in seven months of indenture to his vow of vengeance, he'd passed worse tests than this. He'd be damned if he failed now, when Danika and her son were in his keeping, their lives in his hands.</p><p>It was rage for what Reiver had ordered tonight that made Mal's hands rougher than intended on the whore tossed at him. It was thoughts of Danika, the impulse he'd felt to pierce her pretty, unspoiled throat and bind her to him, that brought his fangs out to their full, razor-sharp length.</p><p>And it was stone-cold determination-a chill and hollow resolve-that made him latch on to the human's neck and swallow gulp after gulp of her fouled blood while Reiver held his gaze, chuckling with sick amusement.</p><p>Mal drank until Reiver was gone. Only then did he set the woman away from him, a sweep of his tongue sealing the wounds he'd made before he eased her down onto the sofa, where she fell into a hard sleep.</p><p>He wiped the back of his hand across his face, cursing a string of crude Gaelic between his gritted teeth and fangs. The taste in his mouth was rank, bitter. He spat some of it out, startled to hear a throat clear behind him.</p><p>Malcolm wheeled around to find Thane in the room with him. \"What the fuck are you looking at?\"</p> <p>The black-haired vampire glanced from the limp form of the human female, back to Malcolm. \"Don't mean to interrupt, but we've got a couple of patrons causing problems with some of the girls on the main floor. Slapping them around, getting too rough. I told the boss but he says he ain't running a public relations firm in here.\"</p><p>\"Yeah?\" Mal countered, still vibrating with unvented violence. \"What are you telling me for?\"</p><p>Thane lifted one of his massive shoulders in a vague shrug. \"Boss said he doesn't want to be bothered with club issues tonight, so I was thinking I'd go down and dole out some etiquette lessons to the assholes. Wondered if you might feel like joining me.\"</p><p>Mal narrowed a look on the guard, trying to get a read on him. He didn't know if this was yet another test of Reiver's making or some trap of Thane's own. Somehow, he didn't think so. And at that moment, he didn't care.</p><p>\"Let's go,\" he snarled, leading the way.</p><p>In the hour before dawn, Malcolm arrived back at the castle. Danika was dozing with little Connor in her arms, nestled together in a large, overstuffed chair in the great hall on the first floor. She woke when Mal entered, heard his booted footsteps, his long-legged stride, coming up the short flight of the stairwell from the tower house's entrance on ground level.</p><p>He paused in the arched entryway, his dark brows furrowing as his eyes lit on her and her sleeping son. \"After the way we left things between us, I half expected you to be gone when I got here,\" he murmured.</p><p>His face looked so weary and grim, his expression so bleakly tormented, she had no choice but to ask. \"Expected, or hoped?\"</p> <p>A quiet scoff, then a slow shake of his head. \"Both, maybe.\"</p><p>He started walking farther up the stairwell.</p><p>\"Mal, wait.\" She tucked Connor into a secure cocoon of blankets and pillows on the chair, then went to follow Malcolm. \"Where are you going?\"</p><p>His deep voice rumbled from the floor above. \"To wash off the stink of Reiver's club.\"</p><p>By the time she reached him, he was already in the master bedroom, already stripping off his weapons and clothing. In moments he was naked, gloriously so. Thick muscle rippled as he strode across the floor toward the adjacent bathroom. Danika reached for his hand, forcing him to pause. The copper tang of human blood was ripe on him.</p><p>\"You've been feeding tonight.\" She looked at his fisted hand, so large and powerful, heavy in her grasp. The knuckles were tinted dark with bruises, recent contusions not quite healed over. \"You've been fighting. What else did you do tonight?\"</p><p>He stared at her for a long minute, then drew his hand out of her hold and raked his battered fingers through his hair. \"It's a job, Dani. Don't make me explain how I have to do it.\"</p><p>As if that was all he needed to say, he stalked into the bathroom and flipped on the shower. He stepped under the spray, began a vigorous scrub of his body.</p><p>She watched him for a moment, stung by his dismissal. And more than that, she worried for what his need to avenge his loss was doing to him. She dreaded what it might cost him.</p><p>\"I think I have a right to be concerned about you, Mal. It's not as if we're strangers, after all.\" He didn't answer her, just kept up his furious scouring of his skin. He shampooed his dark hair with equal anger, then doused the suds from his head and body under the steaming hot water. \"I care about you, Malcolm. I'm afraid for you.\"</p><p>\"Don't be.\" His eyes blazed as he cut off the shower and pulled a towel off the wall hook outside the tiled alcove. \"If you want to fear something, be afraid for yourself if Reiver realizes what I've done. Now more than ever, I need to bring that bastard down.\"</p><p>She shook her head, understanding only in that moment how consumed he was with the hatred he felt for Reiver. \"This quest for revenge is destroying you, Mal, not him. How long can you brush up against evil and not come away stained with it yourself?\"</p><p>\"My problem. Not yours.\" He dried off hastily, then tossed the towel aside to step past her. \"Don't worry about my life when you have your own and your child's to think about.\"</p><p>\"You arrogant jackass.\" She glared at him, hating him for his self-sacrifice as much as she loved him for it. Oh, God. Yes, loved him. Some part of her probably always had. \"There was a time I considered you among my dearest friends, Malcolm MacBain. And now-\"</p><p>\"Now what?\" His voice shook with a tightly leashed rage as he wheeled on her, eyes blazing. \"We had sex, Dani. Great sex, I'll grant you, but your timing sucks. My life is in motion. I'm on this path, and there's too damned much at stake here. I won't put you any closer to the fire than you already are.\"</p><p>\"And I can't stand by and watch you burn.\" She swallowed past the icy clump of lead that sat in her throat. The feeling sank as she stared up at him, the cold settling heavily on her heart. \"I've lost one man I loved, Malcolm. I can't put myself through that kind of pain again.\"</p><p>Only then did his face lose some of its hard line and vicious tension. A muscle ticked wildly in the grizzled side of his jaw, and now his eyes smoldered with a darker, less terrifying fury. \"Danika, I&amp;nbsp;...\" He scowled abruptly, blew out a raw curse. When he reached out to her, his hand shook a little. His fingers found her cheek with aching tenderness, curved around gently to cup the back of her neck. He brought her to him, placed a heartbreaking kiss to her lips.</p><p>She melted into him despite the hurt and anger that tore at her inside. His embrace was firm and warm, his mouth a soothing balm when all she wanted to do was rage at him, demand things she had no right to expect from him.</p><p>His fangs grazed her lightly as he let his mouth drift away from hers, then lower, to the sensitive skin of her throat. She held her breath with a needful anticipation, her veins calling to him, hearing his own heartbeat-his unspoken thoughts-echoing through every electrified nerve ending in her body. Her head tilted as though pulled on invisible strings, granting him access to the throbbing of her pulse. He kissed her there, tender and sweet. Teased the delicate spot with his tongue and teeth and fangs. A moan escaped him then, guttural with denial.</p><p>\"I can't,\" he murmured against her lips. \"I won't turn the mistakes I've made with you into something irreparable, Dani.\" He drew back, pressed his forehead to hers as he held her against his naked body. \"Time was never on our side, was it? Fate gives us nothing more than a taste of what might have been.\"</p><p>She couldn't speak. Couldn't deny him as he kissed her once more and led her toward the bed. They made love in a breathless tangle, no promises or denials. No words at all. Only passion.</p><p>Danika Sstiem\" wept for the pleasure he gave her, and for the inescapable fact that these would be the last moments they had together.</p><p>Because she'd meant what she told him: She could not stand by and watch his hatred for Reiver destroy him. Her heart couldn't bear another loss.</p><p>So as he slept beside her in a heavy doze, Danika slipped out of bed to make a cowardly call on his cell phone from downstairs. \"Gideon,\" she whispered when the scrambled number in Boston connected. \"I need to get out of Scotland, and I need the Order's help.\"</p><p>Chapter Eight</p><p>It was harder than he cared to admit, leaving Danika that evening at sundown so he could be back at the club before Reiver showed up and wondered where his suddenly straying \"Brandogge\" had been all day. Malcolm bristled at the role he'd been forced to play. His collar was beginning to chafe-all the more so when he couldn't shake the feeling that it was costing him something he hadn't expected to crave so deeply.</p><p>Saying good-bye to her a couple of hours ago had a queer feeling of finality to it. Her kiss had been too resigned. Her embrace had been too tender, too lacking in demand.</p><p>He was losing her.</p><p>Hell, he'd practically pushed her away himself.</p><p>It should have come as a relief in many ways. Romantic entanglement was the dead last thing he needed. He'd been so careful to avoid even casual dalliances since he'd buried his innocent mate and unborn child. Months of work hammering the molten iron of his grief and rage into a resolve made of cold, unbreakable steel.</p><p>He'd had it all under his control. Until three nights ago, when he'd chanced to spot the pale, beautiful light that was Danika MacConn, standing mere yards away from him at the Darkhaven party. If only he hadn't seen her. If only he hadn't made it his mission to follow her all night with his gaze, torn between wanting to avoid her notice and wanting nothing more than to place himself in front of her and see if she would remember him. If she would know him, through the mask of his scars and the shield of his false name.</p><p>Calling her out that night through his knowledge of her talent had been a reckless move. An arrogant one that he'd known, even then, he would be unable to call back.</p><p>Now it was much too late to wish he'd kept his distance.</p><p>Too late to think he could go back to what things were like before she arrived in Scotland.</p><p>Too late to try to convince himself that he didn't care for Danika&amp;nbsp;...&amp;nbsp;that he couldn't possibly have lost his heart to her all over again.</p><p>He loved her.</p><p>There was a part of him that always had.</p><p>The realization hit him with such staggering force, it was all he could do not to storm out of Reiver's damnable club and tell D V&gt;Thanika exactly how he felt about her. Words he should have given her already today, when she was kissing him good-bye and he was trying to convince himself that he couldn't keep her. That it wasn't killing something inside of him to consider what he might be throwing away with Dani by holding on so tightly to the need to avenge his dead.</p><p>Malcolm cursed roundly and sent his fist into the side of a priceless Roman urn in one of the club's private salons. The ancient objet d'art exploded, shattering into a thousand tiny airborne shards.</p><p>\"That's gonna cost you heavily with the boss.\"</p><p>Thane chuckled from behind him, and at the sight of the other guard, Malcolm lost it. He flew at the vampire on a roar, fangs erupting in his rage. In truth, no one was more deserving of his fury than himself, but he was ripe for a fight and Thane was the closest target. Besides, the son of a bitch had been giving him about a hundred good reasons lately to kick his ass. Mal snarled with violent intent. \"You picked the wrong damn time to be in my face, Thane.\"</p><p>\"I didn't come in here to pick a fight with you,\" he snapped back. \"I came to tell you Reiver's drafted us as security for tonight's gathering.\"</p><p>Malcolm narrowed a glare on him. \"What gathering?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Thane gave him a shrewd, knowing look. \"Reiver called from the airport. His cargo came in. He's moving it to one of his country estates as we speak.\" He shoved Mal's arm away from him, hissing a hard curse as he straightened his rumpled dark suit coat. \"Since Kerr and Packard are no longer in service, that leaves you and me to head up security tonight. Reiver's expecting his top-tier clients at this thing, so he wants total discretion.\"</p><p>Blood club.</p><p>Malcolm knew this moment would come one night, but it still took him aback. This was it-his shot, at last, to take out Reiver and all of his untouchable cronies in one fell swoop. \"When do we leave?\" he asked, hoping the tight edge of his voice would not betray his eagerness to Thane.</p> <p>\"The boss wants us out there right away.\"</p><p>Mal nodded. Malice coursed through his veins like acid. He met Thane's inscrutable look and gave the guard a cold smile. \"So, what the hell are we waiting for?\"</p><p>Half a dozen gleaming luxury vehicles sat parked outside Reiver's hunting estate, as if their owners were gathered inside for a black-tie event, not the sick, bloody game soon to take place on the snow-covered grounds.</p><p>And there would be blood tonight, Malcolm silently vowed, as he and Thane walked up to the front of the palatial Highlands residence. His jaw was clamped tight, veins vibrating malice as another of Reiver's guards opened the door to permit them inside. \"This way,\" said the Breed thug with a jerk of his head. \"Mr. Reiver has been waiting for you.\"</p><p>He was of his has in a lavish salon, its high-ceilinged walls paneled in dark mahogany and adorned with painted masterworks depicting all manner of hunting scenes. Graceful stags being felled by medieval archers' arrows; small red foxes on the run from a pack of brown-and-white hounds and red-jacketed gentlemen on horseback; a majestic lion snared and surrounded by spear-wielding natives before a white-skinned adventurer toting a long black rifle. The room was a celebration of slaughter, and assembled within it stood Reiver and the nearly dozen members of his privileged, secret cabal of savages.</p> <p>\"Ah,\" said Reiver with a thin smile. \"About time you arrived. We're just about to view the evening's game selection.\" His bloodthirsty friends exchanged eager looks, but Reiver's gaze stayed rooted on Malcolm with cool scrutiny. \"Shall we get started?\"</p><p>Reiver touched the frame on the fox hunt painting. In response, from behind the group of elegantly attired vampires, a doorway on the back wall of the salon opened into a dimly lit corridor. With a look that bade Malcolm and Thane follow him, Reiver strode through the center of the throng to lead the way.</p><p>Inside the long corridor was still more violent art. Here the depictions of hunter and hunted became more gruesome, scene after scene showing all manner of human degradation and bloodshed. It was horrific art, a profane collection no doubt intended to inflame the basest Breed appetites. Malcolm paid it little mind. All of his focus was centered on Reiver, senses taut and at the ready, waiting for the prime opportunity to lodge his offensive strike on the vampire and his cronies.</p><p>As they neared the end of the corridor, Reiver touched another hidden panel on the wall. Cold air gusted in as a thick wooden gate lifted, revealing a covered walkway leading to the outside grounds of the estate. Flanking both sides of the walkway were iron-barred kennel cages, but the cells did not contain animals.</p><p>\"My God,\" one of Reiver's cronies breathed from behind Malcolm. \"Just look at them all. One more tempting than the next.\"</p><p>Reiver chuckled, so full of himself. \"As promised, something for every taste.\"</p> <p>The humans were bound and gagged inside their cages, upwards of twenty men and women, all shapes and sizes and ages. They shivered in the wintry night air, eyes wide and fearful. Bile rose in Malcolm's throat as he glanced at the terror-stricken faces. He could not let this sick game proceed any further. Reiver and his blood club associates would die tonight-here and now.</p><p>He started to reach for his weapons, prepared to unleash hell on the whole lot of them.</p><p>\"Oh, but there's more,\" Reiver announced, snapping his fingers at one of the other guards, dispatching him in unspoken command. \"Tonight I have something very unexpected to offer you, and most certainly&amp;nbsp;...&amp;nbsp;exotic. Brandogge, I think you'll have particular interest in this.\"</p><p>Malcolm went stock-still at the remark, a cold dread locking down his senses even before he glimpsed what the guard had gone to fetch.</p><p>Danika.</p><p>width=\"1em\" align=\"justify\"&gt;Unlike the others, she wasn't shackled or muzzled. No, the pistol pressed to the back of her head was enough to ensure she didn't fight or flee her captors.</p><p>Her long blond hair hung limp over her face as she shuffled ahead of Reiver's thug, little Connor held tight in her arms. Malcolm's heart lurched as her stricken gaze lit on him through the crowd. There was apology in her moist blue eyes, a regretful twist to her pale lips.</p><p>Before Malcolm could react-before he could calculate the terrible risks of wheeling on Reiver and his associates and hoping to take them out before the guard with the gun on Danika pulled the trigger-Thane and two other guards pounced on him. Dani screamed, and it nearly undid him to hear the terror and worry in her voice. Worry for him, when it was his personal need for retribution that brought them both to this awful moment.</p> <p>The cold metal nose of Thane's loaded nine-millimeter jabbed hard and ready to fire into Mal's temple. \"Don't do anything stupid, asshole.\"</p><p>Malcolm roared, but it was impotent rage. He couldn't attempt to throw off his captors. He couldn't do anything-not so long as Danika and her baby were at equal risk as he. \"Thane, you goddamn bastard. I'll kill you too, before this is over.\"</p><p>The guard seemed unfazed, keeping a steady hand on the weapon poised to blow Malcolm's brain out of his skull. One of the other guards stripped Mal of his Glocks and pocketed them.</p><p>While Reiver's associates inched away, he strode forward, slowly shaking his head. \"You lied to me. You betrayed my trust.\" He paused in front of Malcolm, seething with thinly held malice. \"You could have risen far in my service. I thought that's what you were aiming for, Brandogge. So, the only question I have is, why would you be so fucking stupid to cross me now?\"</p><p>Malcolm growled his reply. \"I'm not your dog. I've never been your anything, you arrogant son of a bitch.\" He could see the flicker of confusion in Reiver's dark eyes, and he kept going, glad to finally voice his intentions. \"I've been waiting for the chance to kill you and your blood club cronies ever since your pimp in Edinburgh told me your name.\"</p><p>Reiver's confusion deepened, turned to uncertainty and a sick look of surprise. \"My pimp?\"</p><p>\"Aye,\" Mal ground out. \"The human rubbish who'd been supplying game for your sick gatherings. The same human offal who grabbed a young woman off the street in Edinburgh seven months ago for the purpose of selling her to you.\"</p><p>Reiver scoffed. \"Am I to fret over every ant that gets crushed under a boot heel? Or mourn every beast sent to the abattoir? This is no different, except it's us on the top of the food chain, not mankind.\"</p><p>\"She was a Breedmate,\" Malcolm hissed. \"And she was newly pregnant. She put up a fight with your supplier. He killed her. My mate, my unborn child.\"</p><p>Reiver's bark of laughter erup [laumy unbted out of him. \"All this for a female, Brandogge? And a dead one besides?\" His cruel gaze slid to Danika. \"And now this other one too? What does she mean to you?\"</p><p>\"Leave her out of this,\" Mal snarled. \"She has nothing to do with it.\"</p><p>\"Oh, but she does.\" Reiver's eyes turned brutal, sparking with amber. \"She matters to you, and that means she and her brat will suffer worse than you now. Pity you won't live to see that.\" He glanced to Thane. \"Kill him.\"</p><p>The icy metal of the gun bit harder into Mal's temple, Thane's finger on the trigger.</p><p>Then, in a blur of movement and speed, he pivoted, firing instead on the guard holding Danika.</p><p>The guard went down, head blasted apart. Chaos erupted. Reiver's cronies scattered as Thane shot one of the guards on Malcolm and Mal snapped the neck of the other.</p><p>\"Dani, run!\" he shouted, grabbing his weapons from the dead vampire and wheeling around to fire a hell storm of bullets into Reiver.</p><p>Too late.</p><p>Reiver was already on her.</p><p>Malcolm's vision burned amber hot as he raised both loaded Glocks and aimed them in the center of Reiver's sneering face.</p><p>Except it wasn't Reiver's face he saw down the barrels of his guns&amp;nbsp;...</p><p>Ah, Christ.</p><p>It was Danika's baby boy, wailing and squirming, dangling by the pudgy little arm that Reiver clutched tight in his fist. In his other hand, Reiver held a fistful of Danika's hair. She struggled against his brutal hold, her eyes wild with horror, hands reaching for her squalling child.</p><p>Reiver's smile was a deadly baring of his fangs. \"You lose, Brandogge.\"</p><p>Chapter Nine</p><p>Danika could hardly breathe for the fear that gripped her as she watched Connor flailing in Reiver's cruel grasp. Her own pain meant nothing, her own panic and regret-none of it mattered when her child's life literally hung in the balance.</p><p>And Malcolm.</p><p>Oh, God&amp;nbsp;...&amp;nbsp;Mal.</p><p>She'd thought things couldn't have gotten worse when Reiver spotted her and Connor arriving at the airport earlier tonight for the flight Gideon had arranged for them back to Denmark. Reiver and his thugs had been there to pick up a live cargo shipment at a private hangar-that same cargo she'd overheard him talking about at the Darkhaven party, a night that seemed a year ago now. They'd grabbed her and Connor and tossed them into the vehicle with the rest of the people intended for Reiver's sick hunting party.</p><p>Danika had dreaded what Reiver had in mind, not only for her and her child but for Malcolm as well. Most of all, for him. Reiver had been unable to hide his fury at having been deceived by Mal about the fact that she was still breathing. Still able to create trouble for him and his sinister business dealings.</p><p>And so she had created trouble for Reiver-at least, she hoped so, now more than ever.</p><p>Her call to the Order had been about more than just arranging passage out of Scotland for Connor and her. She couldn't bear the thought of Malcolm's life in danger, even if it meant interfering in his quest for personal vengeance. She'd brought the Order into the situation. Although the compound in Boston had been thrown into chaos since she'd last talked with Gideon, his immediate inquiries to an Enforcement Agency ally of the Order's revealed that an elite squad of Agents in London were already aware of Reiver and working to bring him down. They even had one of their own embedded in his organization, working as one of his bodyguards.</p><p>Danika glanced at the dangerous-looking Breed male with the black hair swept back in a disheveled queue at his nape. The guard called Thane, who'd defied Reiver to help her and Malcolm both. Several of Reiver's cronies lay dead thanks to Thane, the rest having fled, some back into the mansion, others across the snowy expanse of the back lawn.</p><p>And now the undercover Enforcement Agent stood as cautious and still as Malcolm, both of them understanding how precious Danika's baby was to her; neither willing to give Reiver the excuse to bring little Connor harm.</p><p>\"Drop your weapons, both of you.\" Reiver's voice was otherworldly, a gravelly snarl of menace. \"Drop them, or I'll tear this child's arm from its socket and feed it to his mother while you watch.\"</p><p>\"Oh, my God,\" Danika moaned, unable to keep the horror from erupting from her lips. \"Please, don't hurt my baby. Please&amp;nbsp;...\"</p><p>Even though it was the only solution she could see, she didn't know what was more terrifying: Reiver's heinous threat, or the fact that it made both Malcolm and Thane slowly disarm and set their guns down on the ground.</p><p>\"Now back up. Keep moving until I tell you to stop.\"</p><p>They obeyed, both Breed males' eyes simmering with amber fire. \"Let them go,\" Malcolm growled. \"Goddamn it, you sick fuck&amp;nbsp;...&amp;nbsp;let them go.\"</p><p>Reiver chuckled. \"As you wish.\"</p><p>The fist in Danika's hair loosened and suddenly she was pitching forward, a violent shove with a force so punishing she felt as if she were flying. Malcolm moved in a flash of motion, catching her before she fell.</p><p>But Reiver wasn't finished yet.</p><p>Danika sensed her child in danger even before Reiver sent Connor airborne. She swung her head around and there he was-her baby, her heart itself-flung aloft like a rag doll as Reiver pivoted, then vanished into the night to mak c nias othere his escape.</p><p>Danika screamed as she stared up at her helpless child, her chest exploding in abject terror.</p><p>Malcolm jolted into action.</p><p>With a running vault, he leapt to catch Connor in midair, bringing him down safely in the cradle of his arms. Danika was on her knees, holding her face in her hands and shaking as Thane stood nearby, making a feeble attempt to console her.</p><p>\"Dani,\" Mal murmured. \"Danika, it's all right. Connor is safe.\"</p><p>She lifted her tearstained face and sucked in a hitching sob as she took the crying baby out of his hands. \"Oh, Mal.\" She wrapped one arm around his neck, pulling him into her embrace along with her precious child. \"Malcolm, thank you. Thank you for saving my son. You saved us.\"</p><p>He kissed her brow and hugged her close, never loving her more than in those terrifying moments when he thought he might lose her to Reiver's fury. \"It's all right,\" he assured her. \"You're both safe now. But you have to get out of here.\"</p><p>He helped her to her feet. However, inside he knew he couldn't go with her. Not yet. Not after what Reiver had done here tonight. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Thane, the guard who was no guard at all, gave Mal a grim look. \"Reiver won't get far. Neither will his cronies. The Agency is aware of what was going down here tonight. My squad will be here any minute, if they're not waiting outside right now to round everyone up.\"</p><p>Malcolm gave a slow shake of his head. He couldn't trust anyone else to finish this. Not after everything he'd been through. He couldn't rest for a moment thinking Reiver or his murderous colleagues were still walking free, able to hurt more innocent people.</p><p>Able to hurt Danika or Connor, the two people who mattered more to him than anything else in his life.</p> <p>He looked at Dani, his heart squeezing with a love so profound it rocked him. As determined as he was to see Reiver dead, there was only one thing that could keep him from pursuing that goal now. Danika could stop him. With a word, a tear, a pleading look.</p><p>But she held his gaze with a steady courage. A faith that humbled him, even as it gave him new resolve.</p><p>His strong, beautiful female.</p><p>His Breedmate, once this was finally over.</p><p>He knew what her courage right now cost her. It was written in her haunted blue eyes as she gave him a subtle nod of permission, of stoic understanding.</p> <p>Malcolm gathered her close and brushed his mouth against hers in an unrushed kiss. \"I have to finish this.\"</p><p>Her reply was quiet but resolved. \"I know.\"</p><p>It was a struggle t c a ght=\"0em\"o let her go, but he released her and glanced to Thane. \"Keep her safe. I'm counting on you.\"</p><p>The other Breed male gave him a solemn nod. \"You have my word.\"</p><p>Mal couldn't take his eyes off Danika. She held his gaze, her own unwavering, as proud and stalwart as the regal Nordic princess she truly was. \"Go and finish this, Malcolm. Then come back to me, and never leave me again.\"</p><p>Epilogue</p> <p>He came back to Danika two nights later, haggard and worn, but the most welcome sight she'd ever seen. She opened the door of her little farmhouse in Denmark and there was Malcolm, standing on the cold front stoop in the December moonlight, snowflakes dancing all around him. Her heart swelled so swiftly, she couldn't speak. And while the urge to throw herself into his arms was a need that arrowed through her as basic as the need for air, she held back, trying to read his grave, unsmiling expression.</p><p>\"Reiver is dead,\" he told her. \"The others too.\"</p><p>She exhaled the breath she'd been holding. Relief flooded her, not so much for the final justice Malcolm had delivered on his enemies but for the simple fact that he was standing in front of her now, whole and hale, safe and sound.</p><p>Mal didn't move. He cleared his throat. \"Thane tells me his contact in Boston, an Enforcement Agency director by the name of Mathias Rowan, has alluded to big trouble brewing over there. If things get as ugly as Rowan and the Order seem to feel they will, Thane and his men may be called on to help them out.\"</p><p>The news worried her deeply. She'd been trying to get in touch with Gideon since she'd arrived home, but the private number she had for the Order's compound in Boston was out of service. Which had never happened in all the time the direct line to the warriors had existed.</p><p>If the Order was off grid-by their own choice or by force-and gearing up to combat something awful, she hated to imagine what that could mean.</p><p>\"Thane's offered me a place in the Enforcement Agency,\" Mal added. \"He wants me to be part of his team.\"</p><p>Danika's heart sank like a stone. The two days he'd been gone had been torture, but she'd made it through. She'd had faith because she knew he'd come back once he'd done what he had to do. She'd endured his absence because she trusted that when he returned, he'd be back to stay.</p> <p>But she put on a brave face as she looked at him now. \"When do you leave?\"</p><p>\"I turned him down, Dani.\" He took a step closer now and caught her face in the warm, callused palms of his hands. \"There's only one place I want to be, and that's with you.\"</p><p>Elation filled her, but she couldn't celebrate if it was her fear for him that was holding him back. \"Don't do this just for me, Mal. I know I f a ghould2019;ve told you that I can't bear the thought of you in danger, and it's true. But I don't want to be the one keeping you somewhere you don't want to be. I can't ask that of you.\"</p><p>\"You didn't,\" he said, caressing her cheek with his thumb. \"Thane and his offer will wait, but this won't. I love you, Danika. Be with me. At my side, as my mate.\"</p><p>She held his intense gray gaze, love swelling inside her, filling her up with joy and hope. \"Yes, Malcolm. I will be with you. As your mate, your partner, your friend.\"</p><p>He pulled her against him as an amber fire began to spark in his eyes. \"My everything, Dani.\"</p><p>She gave him a happy nod. \"Forever.\"</p><p>\"Starting now,\" he said, possession raw and thrilling in the deep growl of his voice.</p><p>He kissed her passionately, the sharp points of his fangs grazing her lip with dark promise. Then he swept her into his arms and carried her into the house and up to her bed, where their forever was about to begin.</p><p>Can't get enough of the Midnight Breed?Get ready to sink your teeth into the next book in Lara Adrian's bestselling seriesDARKER AFTER MIDNIGHTOn sale 1/24/2012</p><p>CHAPTER ONE</p><p>\"THE CHARGES ARE SET, Lucan. Detonators are ready whenever you say the word. On your go, it all ends right here.\"</p><p>Lucan Thorne stood silent in the dusk-filled, snow-covered yard of the Boston estate that had long served as a base of operations for himself and his small cadre of brothers in arms. For more than a hundred years, on countless patrols, they rode out from this very spot to guard the night, maintaining a fragile peace between the unwitting humans who owned the daytime hours and the predators who moved among them secretly, sometimes lethally, in the dark.</p><p>Lucan and his warriors of the Order dealt in swift, deadly justice and had never known the taste of defeat.</p><p>Tonight it was bitter on his tongue.</p><p>\"Dragos will pay for this,\" he growled around the emerging points of his fangs.</p><p>Lucan's vision burned amber as he stared across the expansive lawn at the pale limestone facade of the Gothic mansion. A chaos of tire tracks scarred the grounds from the police chase that had crashed the compound's tall iron gates that morning and come to a bullet-riddled halt right at the Order's front door. Blood stained the snow where law enforcement gunfire had mowe n a gho a bd down three terrorists who'd bombed Boston's United Nations building then fled the scene with a dozen cops and every news station in the area in close pursuit.</p><p>All of it-from the attack on a human government facility, to the media-covered police chase of the suspects onto the compound's secured grounds-had been orchestrated by the Order's chief adversary, a power-mad vampire called Dragos.</p><p>He wasn't the first of the Breed to dream of a world where humankind lived to serve and served in fear. But where others before him with less commitment had failed, Dragos had demonstrated astonishing patience and initiative. He'd been carefully sowing the seeds of his rebellion for most of his long life, secretly cultivating followers within the Breed and making Minions of any humans he felt could help carry out his twisted goals.</p><p>For the past year and a half, since their discovery of Dragos's plans, Lucan and his brethren had kept him on the run. They had succeeded in driving him back, thwarting his every move and disrupting his operation.</p><p>Until today.</p><p>Today it was the Order pushed back and on the run, and Lucan didn't like it one damn bit.</p><p>\"What's the ETA at the temporary headquarters?\"</p><p>The question was aimed toward Gideon, one of the two warriors who'd remained behind with Lucan to wrap things up in Boston while the rest of the compound went ahead to an emergency safe house in northern Maine. Gideon glanced away from the small handheld computer in his palm and met Lucan's gaze over the rims of silvery blue shades. \"Savannah and the other women have been on the road for nearly five hours, so they should be at the location in about thirty minutes. Niko and the other warriors are just a couple hours behind them.\"</p><p>Lucan gave a nod, grim but relieved that the abrupt relocation had come together as well as it had. There were a few loose ends and details yet to be managed, but so far everyone was safe and the damage Dragos had intended to inflict on the Order had been minimized.</p><p>Movement stirred on the other side of Lucan as Tegan, the other warrior who'd stayed behind, returned from the latest perimeter check. \"Any problems?\"</p><p>\"None.\" Tegan's face showed no emotion, only grim purpose. \"The two cops in the unmarked stakeout vehicle near the gates are still tranced and sleeping. After the hard memory scrub I gave them earlier today, there's a good chance they won't wake up until next week. And when they do, it'll be with one hellacious hangover.\"</p><p>Gideon grunted. \"Better a mind scrub on a couple of Boston's finest than a very public bloodbath involving half the city's precincts and the feds combined.\"</p><p>\"Damn straight,\" Lucan said, recalling the swarm of cops and reporters who had filled the estate grounds that morning. \"If the situation had escalated and any of those cops or federal agents had decided to come banging on the mansion door&amp;nbsp;...&amp;nbsp;Christ, I'm sure I don't need to tell either of you how fast or ho sow ow fasw far things would have gone south.\"</p><p>Tegan's eyes were grave in the rising darkness. \"Guess we've got Chase to thank for that.\"</p><p>\"Yeah,\" Lucan replied. He'd lived a long time-nine hundred years and then some-but for however long he'd walk this Earth, he knew he would never forget the sight of Sterling Chase strolling out of the mansion and squarely into the aim of a lawn full of heavily armed cops and federal agents. He could have died several ways in that moment. If the adrenaline-fueled panic of any one of the armed men assembled in the yard hadn't killed him on the spot, spending longer than half an hour under the full blast of morning sunlight would have.</p><p>But Chase apparently hadn't cared about any of that as he'd allowed himself to be cuffed and led away by the human authorities. His surrender-his personal sacrifice-had bought the Order precious time. He had diverted attention from the mansion and what it concealed, giving Lucan and the others the chance to secure the subterranean compound and mobilize the evacuation of its residents once the sun set.</p><p>After a string of bad calls and personal fuck-ups, most recently a failed strike against Dragos that had inadvertently landed Chase's face on the national news, he was the last of the warriors Lucan would have turned to for answers. What he had done today was nothing short of astonishing, if not suicidal.</p><p>Then again, Sterling Chase had been on a self-destructive path for some time now. Maybe this was his way of nailing that coffin shut once and for all.</p><p>Gideon raked a hand over the top of his spiky blond hair and exhaled a curse. \"Fucking lunatic. I can't believe he actually did it.\"</p><p>\"It should have been me.\" Lucan glanced between Tegan and Gideon, the warrior who'd been with him when he'd first founded the Order in Europe and the one who'd helped him establish the warriors' home base in Boston centuries later. \"I'm the Order's leader. If there was a sacrifice to be made to spare everyone else, I should have been the one to step up.\"</p><p>Tegan eyed him grimly. \"How long do you think Chase would have been able to keep his Bloodlust at bay? Whether he's in human custody or loose on the streets, his thirst owns him. He's lost and he knows that. He knew it when he walked out that door this morning. He had nothing left to lose.\"</p><p>Lucan grunted. \"And now he's sitting in police custody somewhere, surrounded by humans. He might have spared us from discovery today, but what if his thirst gets the better of him and he ends up exposing the existence of all the Breed? One moment of heroism could undo centuries of secrecy.\"</p><p>Tegan's expression was coldly sober. \"I guess we'll have to trust him.\"</p><p>\"Trust,\" Lucan said. \"That's a currency he's come up short on more than once lately.\"</p><p>Unfortunately, right now, they didn't have a lot of choice in the matter. Dragos had demonstrated quite effectively just how f sly \"justifyar he was willing to take his enmity toward the Order. He had no regard for life, human or his own kind, and as of today, he'd shown that he would take their power struggle out of the shadows and into the open. It was dangerous ground, with impossibly high stakes.</p><p>And it was personal now. Dragos had crossed a line here, and there would be no going back.</p><p>Lucan glanced at Gideon. \"It's time. Hit the detonators. Let's get this done.\"</p><p>The warrior gave a slight nod and turned his attention back to his handheld computer. \"Ah, fuck me,\" he muttered, the traces of his British accent punctuating the curse. \"Here we go then.\"</p><p>The three Breed males stood side by side in the crisp, cold darkness. Above them the sky was clear and cloudless, endless black, pierced with stars. Everything was still, as if Earth and the heavens had frozen in time, suspended in that instant between the silence of a perfect winter night and the first low rumble of the destruction unfolding roughly three hundred feet beneath the warriors' boots. It seemed to carry on forever, not some great bombastic spectacle of furious noise and spewing fire and ash but a quiet yet thorough annihilation.</p><p>\"The living quarters have been sealed,\" Gideon reported somberly as the thunder began to ebb. He touched the screen of his handheld device and another series of deep growls rolled from far below the snow-covered ground. \"The weapons room, the infirmary&amp;nbsp;...&amp;nbsp;both gone now.\"</p><p>Lucan didn't allow himself to dwell on the memories or the history that was housed in the labyrinth of rooms and corridors being systematically exploded with a touch of Gideon's finger on that tiny computer screen. It had taken more than a hundred years to build the compound into what it had become. He couldn't deny that it put a cold ache in his chest to feel it being pulled down so neatly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>\"The chapel has been sealed,\" Gideon said, after pressing the digital detonator another time. \"All that remains is the tech lab.\"</p><p>Lucan heard the slight catch in the warrior's low voice. The tech lab was Gideon's pride, the nerve center of the Order's operation. It was where they'd assembled and strategized before every night's mission. It took no effort at all for Lucan to see his brethren's faces, a fine group of honorable, courageous Breed males, gathered around the lab's conference table, each one ready to give his life for the other. Some of them had. And some likely would in the time still to come.</p><p>As the soft percussion of explosives continued to rumble below-ground, Lucan felt a weight settle on his shoulder. He glanced beside him, to where Tegan stood, the warrior's big hand remaining a steady presence, his cool green eyes holding Lucan's gaze in an unexpected show of solidarity, as the last of the thunder faded into silence.</p> <p>\"That's it,\" Gideon announced. \"That was the last one. It's over now.\"</p><p>For a long while, none of them spoke. There were no words. Nothing to be said in the dark shadow of the now-vacant mansion and its ruined compound below.</p><p>Finally, Lucan stepped forward. His fangs bit into the edges of his tongue as he took one last look at the place that had been his headquarters-his family's home-for so many years. Amber light filled his vision as his eyes transformed in his simmering fury.</p><p>He pivoted to face his two brethren, and when he at last found the words to speak, his voice was harsh and raw with determination. \"We may be done here, but this night doesn't mark the end of anything. It's only the beginning. Dragos wants a war with the Order? Then, by God, he's damn well got it.\" </p>  </body></html>"]