["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Nicky Anderson finished his shift hot, tired, and ready for a hot tub and a nice massage, not that he was about to receive either one of them any time soon. He sank down on a stool at the bar and smiled. His friend Steven, the bartender, sat a beer in front of him.</p><p>“Thanks. I need this. Is it just me or were the customers particularly boorish today?” “If by boorish, you mean assholes, then, yeah, they were.” Steven grinned and set a bowl of peanuts closer.</p><p>“Hey, pretty boy! You off the clock?” Sam, the manager, a man Nicky detested with every fiber of his being, leaned against the end of the bar, snarling at him.</p> <p>“Yes, Sam,” Nicky replied. He tried desperately to hold onto his temper. Nicky needed this job, and Sam would love a reason to fire him.</p><p>“You better be paying for that beer, or it’s coming outta your pay.”</p><p>“Okay,” he said with a sigh. “Keep your shirt on, Sam.” Nicky pulled out his wallet, or rather he started to pull out his wallet and discovered it wasn’t in his back pocket. What the hell? He had a memory of jumping out of the shower, running incredibly late for work. He’d pulled on his clothes and rushed out the door in a hurry, no doubt leaving his wallet lying forlornly on the dresser in his room.</p><p>“Oh shit, I don’t have my wallet!”</p><p>“Uh-huh,” Sam said with his usual nastiness. “How convenient.”</p> <p>Nicky clenched his fists, biting back a sharp remark. He couldn’t even charge it. Sam had refused to let him start a tab like some of the other employees. Nicky closed his eyes for just a second thinking of how satisfying it would be to slam Sam’s face into the bar.</p><p>“Oh, for God’s sake, Sam, it’s just a beer. I’ll put it on my tab.” Steven frowned at Sam, as he wiped down the bar at the other end.</p><p>“Just so long as it’s paid for. Nobody gets anything for free around here.”</p><p>“Isn’t that the truth?” Nicky muttered under his breath as the manager walked away. “Asshole.”</p><p>“Oh, and tie that hair back before you come in tomorrow, or I’ll make you wear a hairnet. Health Department’s gonna close us down with all those pretty little curls of yours flying around everywhere.”</p><p>Nicky flushed, embarrassed over his unruly, blond hair that absolutely refused to be tamed, no matter how much product he put on it. He meant to get a haircut yesterday, but he was running short on cash before payday. He’d just have to tie it in a ponytail, sure Sam would make good on his threat if he didn’t.</p> <p>“Damn, Nicky, what have you done to Sam to make him hate you so much? I mean, he’s a jerk, yeah, but with you, it’s like he takes special delight in giving you a hard time.”</p><p>Nicky sighed. “Yeah, I know. He asked me out a few weeks ago, and when I told him I wasn’t gay, he got a little upset.”</p><p>“Upset? He looks at you like he wants to rip your head off. Hell hath no fury like a gay man scorned, I guess.” Steven laughed as he walked down to take his boyfriend another beer.</p><p>Steven was the first gay man Nicky had ever really gotten to know well, and he considered him one of his best friends. Steven had a very jealous boyfriend who came by the bar every night to give dirty looks to anyone foolish enough to hit on Steven. The boyfriend was even unfriendly to Nicky, simply because of the way he looked.</p><p>Nicky considered his good looks to be a curse, one he could gladly do without. He didn’t like a lot of attention over his handsome face. Around age eighteen, when he realized he had blossomed into an extremely attractive man, his good looks only served to embarrass him. At five feet nine inches tall, he’d been a little chubby as a teenager and started working out at a young age when he was subjected to teasing by his classmates. As a result, his body was as muscular and sculpted as a young Greek god’s, if Steven was to be believed.</p><p>Steven had been trying to build his confidence for some time, insisting he get out there and find someone to date. “Girls, boys, whatever! Just don’t let all this go to waste, Nicky!” He smiled, gesturing at Nicky’s body in the tight jeans he favored.</p><p>Nicky blushed. “Not boys, Steven. I don’t have anything against gays—not at all—but I don’t swing that way.”</p><p>“Don’t knock it till you try it, babe. I could get you a date any time you say. You’re what’s known as a gay man’s wet dream.”</p> <p>Nicky didn’t feel like anything special tonight—just exhausted. He’d had an art class earlier in the morning, spent the early afternoon cleaning his apartment and doing laundry. After finishing a grueling eight-hour late shift as wait staff in an upscale restaurant in downtown Atlanta, he only wanted to go home and go to sleep.</p><p>He finished his beer and started to get up when Steven came up to him again. “Hey, your admirer is back. Has he said anything to you yet? Made any moves?”</p><p>“Huh?” Nicky glanced over his shoulder at the young man sitting by himself at the corner table, staring at him. “No. Creepy, isn’t it? He looks like he’s about seventeen, but he’s been in here every night this week, just staring at me until I get off work.”</p><p>Steven smiled. “Like I said, you have an admirer. This might be your chance to find out if boys are for you, after all.”</p><p>“Yeah, well, even if I liked guys, which I don’t, serving time for statutory rape holds no attraction for me in the least.” Nicky stretched and yawned, almost unable to keep his eyes open. “I’m not going to find out what he wants tonight, that’s for sure. I’m so tired I’m about to pass out and I’m not in any mood to fend off unwanted advances. Thanks for the beer, Steven—I’ll pay you back. See you tomorrow.”</p><p>Steven nodded and waved, and Nicky made his way to the door. He glanced over his shoulder to see if the boy still watched. Sure enough his hazel-eyed gaze met Nicky’s blue one almost curiously, certainly without any embarrassment at being caught staring. Nicky gave him a little disapproving frown as he walked out into the cool evening.</p><p>He’d only walked about a block and was almost to the bus stop when he heard a noise behind him and turned quickly to see two men coming up fast out of a dark alley. That was the last clear memory he had for a very long time.</p><p>* * * Nicky let the voices flow over him without really paying much attention to what they were saying. Drifting in a lovely haze was easier. He couldn’t seem to get his eyes open enough to see who it was anyway. He’d just lie here where it was warm and soft and not think about anything. The voices were becoming annoyingly clear though. Despite himself, he listened to what they had to say.</p><p>“What’s wrong? Why is this pet unconscious?” “Nicky’s just—just resting, I think, and been awake for some time now. It’ll be all right. The pet’s only been turned for a short while, you know. They always go in heat right away.”</p><p>In heat? Were they talking about him? Wasn’t that something dogs did? Bitch dogs? What the fuck?</p><p>“Hmmm...pretty little thing. Beautiful long eyelashes. Her blonde hair would be nice, but it’s cut too short. She’s awfully flat-chested too.”</p><p>There was a short laugh from the other voice, and a sudden blast of cold air as the blanket was pulled back. “That’s because ‘she’ is a he! This is Marco’s new pet.”</p><p>A quick intake of breath followed. “Marco! You turned Marco’s new pet? There’ll be hell to pay over this.”</p><p>The voice sounded young and a little frightened by the mention of this Marco. “I know, but what could I do? By the time I saw what happened, he was already cut bad. His pulse was so slow I thought he was dying! I had to do something quick, and I did the only thing I knew to do to save his life—I turned him. Anyway, he’s only the least little bit in heat for me. I never fed him, and the two of them are blood mates. Once he mates with Marco and then feeds from him, it’ll overpower my bite completely.”</p><p>“You’d better hope it does,” the other voice said quietly.</p><p>Nicky went right back to wondering what the hell they were talking about again. Who was going to “mate” with Marco? Marco was a guy, right? Nicky sincerely hoped they weren’t talking about him, because he definitely was not gay. He totally had no interest in “mating” with any guy. And did someone just mistake him for a girl? He knew he’d let his hair get a little long, and maybe he had a bit of a baby face, but a girl? Nicky hated the idea someone would think he looked feminine. He once tried to grow a beard to make his young face look older than twenty. He shaved it off when Steven took him aside and apologetically told him the look wasn’t working for him. The hair on his chin was so sparse it looked like blond pubic hair.</p><p>One of the voices spoke again, sounding excited. “Marco’s here. He just arrived.”</p><p>Nicky tried to get his eyes open to see who this Marco was. He opened one eyelid a little to discover he lay on a table of some kind, wrapped in a soft, furry blanket. Several big, burly men he didn’t recognize stood around him, falling back when a cold breeze swept through the room. Some of the men standing closest to him stepped to the side to let the newcomer move up next to him.</p><p>Nicky peeked up through his lashes to get a look at the newcomer and gasped aloud when he saw him. The heads of some of the men pivoted toward Nicky in surprise. He had no interest in them. All of his focus, his entire center of being honed in to the man standing beside him as if he’d been waiting for this one person all his life and just hadn’t known it until he saw him. All the light in the universe convened and decided to shine and sparkle on this one man. Who could he be? And why in the hell was he so attracted to a man?</p><p>Tall and muscular, Marco reminded Nicky of those muscle men he’d sometimes seen on television. He was absolutely gorgeous, which was shocking, because Nicky’d never thought of a man before in those terms. His dark hair was cut very short, and his dark brown eyes were fringed with thick, black lashes. Nicky had never been so drawn to anyone before in his entire life. He heard himself whimpering deep in his throat as he wanted—no, make that craved—the man’s hands on him. His mind felt separate from his body, watching, horrified, at what his body did. Totally unable to stop himself, his arms reached out to the man, like a child begging to be picked up by his daddy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco gazed down at him and reached out to put a hand to his cheek. He pushed his arms down and patted his shoulder, leaned over and whispered in his ear. “It’s okay, sweetheart.”</p><p>Sweetheart? Apparently some kind of grievous error had been made. Horrified by his actions, but absolutely unable to control himself, Nicky rubbed his cheek against the hand like a damned puppy, trying to get his nose right up inside his palm so he could sniff him. My God, had he lost his mind? What had they done to him?</p><p>Marco stood very still, allowing Nicky to nuzzle his hand and stared down at him. Raising his head angrily, he rasped out a few words to the other men. “Who did this to him?”</p> <p>An interesting question and one Nicky would like to know the answer to himself. A voice beside him spoke up. Nicky was astonished to see it belonged to his stalker, the cute young man from the restaurant.</p><p>Standing by Nicky’s head, he spoke up right away. “I did, Marco. I’m really sorry, but I had to turn him, or he would’ve died. It wasn’t a mating bite, and I didn’t bite him too hard—really. You can see he’s in heat only for you, not me.”</p><p>Marco growled down deep in his throat. Growled? Who were these people? Frightened, Nicky whimpered a little louder, and Marco bent down to whisper in his ear. “Hold onto me, sweetheart. Don’t be frightened. You’re in heat—I’ll take care of you soon, baby.”</p><p>In heat? There were those words again, but they couldn’t be talking about him, could they? His body managed to inch even closer to Marco and tried to rest his head against his chest. Marco’s shirt was open, showing off his spectacularly sculpted abs. Incredibly, Nicky turned his head and licked them, starting low on Marco’s abs and going all the way up to the space between his nipples. He half expected the man to knock him away. Instead he absentmindedly patted Nicky’s head, putting his fingers into his hair and rubbing his scalp.</p><p>Marco made the growling sound again. “How could you have allowed this to happen in the first place?”</p> <p>The boy’s voice sounded miserable. “I’m really sorry. I was watching him like you told me. He was going home from work at the restaurant, and these two guys jumped out of nowhere. They held a box cutter on him. I headed over as fast as I could, but he acted before I could get there. I couldn’t believe my eyes when he actually fought them. They were both big dudes. He never stood a chance.”</p><p>“He’s brave.” Marco’s voice glowed with pride as he rubbed Nicky’s scalp and petted him gently. “Obviously, he has more courage than good sense. I suspected as much. That’s why I sent you to look after him until I could come for him.”</p><p>Nicky, who had been basking in the praise from Marco, didn’t think he liked that last part much. He certainly didn’t understand it one bit. Someone had been watching him? Looking out for him? What did they mean about two dudes who jumped him? He hadn’t been jumped by— wait a minute—a sudden memory of walking to the bus stop in the dark and a deep voice from behind him, gruff and menacing.</p><p>“Give us your money, man, and don’t take all day about it.”</p><p>Nicky had whirled around to find a box cutter lodged against his throat, the tip biting into his neck. Afraid to move at first, he’d been about to empty his pockets when he realized he didn’t have a dime on him. Remembering he’d left his wallet at home, he knew he was in deep trouble. These guys would never believe his excuses.</p><p>Making a sudden decision, he sucker punched the one closest to him. The idea sounded perfectly plausible in his head. The trouble came with its execution. The punch, when it landed on the biggest guy’s face, was ineffectual at best. He just shook his head and frowned like a fly landed on his nose. When Nicky tried to turn and run, the other one caught him by the arm. He simply swiped something at his throat. Nicky felt a cold blast of air hit his neck, and he put up his hand to it. Instead of skin, he felt a gaping gash. He’d tried to scream, but no sound came out.</p> <p>The two men turned and ran, leaving him sinking to the street, his blood spilling out onto the sidewalk. He clutched the skin of his throat, trying to close it together when someone else ran up and bent over him. Nicky turned frightened eyes up to see a young, dark-haired boy, the boy from the restaurant. Nicky held out a hand to him. Without a moment of hesitation, the boy leaned down and bit into his bloody throat. He sank his teeth right into the wound made by the box cutter, and Nicky passed out from horror and pain.</p><p>He knew nothing else until he woke up a few minutes ago in this strange place. He put one hand to his throat wonderingly. He felt nothing but smooth skin. Could it have been an awful dream?</p><p>Marco spoke urgently to the other men surrounding him. “I have to mate with him and feed him right away. Is a room ready close by?”</p><p>The young boy pointed behind him. “There’s a bedroom ready through there. You won’t be disturbed.”</p><p>“Good,” Marco said, picking Nicky up off the table as if he weighed nothing.</p><p>Holding him high on his chest, Marco rushed Nicky out of the room, down a dark hallway, and put Nicky down gently on the bed. Leaving him for a moment, he locked the door. Coming back to him, Marco tugged at his own clothing, keeping his eyes firmly fixed on Nicky. Nicky could only watch in awe as he stripped off his clothes.</p><p>Marco’s body was even more magnificent than Nicky first thought. His skin was tanned a golden brown. His muscles rippled up and down his chest and arms. His cock was fully erect, long, thick and magnificent, jutting proudly out of the dark brown curls covering his huge balls and curving back toward his stomach. Something didn’t seem right about it, though Nicky couldn’t quite see what it was. As he came closer, Nicky’s eyebrows sailed to his hairline. At the very base of the beautiful cock a round bulging ring encircled it. He wasn’t exactly a connoisseur of other men’s dicks, but it certainly looked odd.</p><p>Nicky, still feeling outside his own body, made those whimpering noises as Marco prowled inexorably toward him and stripped away the blanket. Nicky was shocked to see he was naked too, and like Marco’s, his cock stood up hard and proud. Nicky looked down at it in horror. How could he get excited like this by another guy? This huge, gorgeous, gay guy was crawling into bed with him, and Nicky’s own damn cock was enthusiastically beckoning him like a little whore.</p> <p>“I...I want...I need...” Nicky couldn’t seem to get a complete sentence out for the life of him. He had things he needed to say and quickly before he got fucked by that huge dick, but he couldn’t get a word out. Marco lay down beside him and took him in his arms.</p><p>“Shhh...hush baby, I know exactly what you need.” Marco’s voice soothed him as much as his presence did. Everything about him was so enticing and delicious. Even the smell coming off his skin was positively addictive. The scent of caramel and cream clouded his head so he couldn’t think clearly. He wanted to lick Marco all over. Maybe it wouldn’t be so bad after all to be fucked by this magnificent man. Just this once, maybe. No one would have to know, right?</p><p>Nicky lost all fear of what was about to happen as Marco’s scent surrounded him, overpowering his senses. He wanted the man so much he hurt. He crawled all over the guy trying to get closer to him.</p><p>Pushing Nicky on his back, Marco looked down into his eyes. “Sweetheart,” he murmured. “I’ve wanted to taste you for so long. This won’t take long, because you’re in such a hyper state. Hang on, baby.” He bent his head and put his mouth over Nicky’s cock, enveloping him in a sensation like he’d never experienced before. Marco’s mouth was warm, and he moved his tongue over Nicky in incredible ways. Nicky couldn’t stay still in any way while the man sucked and nibbled at this most private part of his body. He bucked his hips and almost lost his mind, moaning and screaming.</p><p>Marco licked at his balls, and Nicky grabbed Marco’s hair, hanging on for dear life. His cock sank deep into Marco’s throat, while Marco swirled his tongue along the underside. Nicky came explosively, unable to prevent it, and the gorgeous man between his legs swallowed every drop.</p><p>Afterward, still licking his lips, he bent down to kiss Nicky tenderly.</p><p>“Nicky, try to concentrate. I’m going to turn you over and mate with you. It’s going to hurt some, but maybe a little less from behind. Do you understand?</p><p>Nicky’s head bobbed up and down like an insane puppet. He felt totally drained, yet Nicky’s body was in a fervent frenzy wanting to get fucked by this gorgeous man mountain.</p><p>“Baby, this is going to be very intense. I’ll try to be gentle and go slow, but you won’t want me to go slow. I may get a little excited. You might be scared—especially since you’ve never been with a man before. Pretty soon you’ll start the orgasmic cycle, and you’ll have multiple, multiple orgasms. It may sound like fun, but they will be very strong. You’ll probably pass out. Most pets do, but just try to ride it out and don’t panic. I’ll be here with you every step of the way. I won’t let anything bad happen to you. Are you ready?”</p><p>Nicky’s head nodded enthusiastically and those stupid whimpering noises came from his throat. His brain screamed out, No! I’m not ready. What the hell are you talking about? Stop! I’m not gay. Wait a minute, did he say “pet”?</p><p>Nothing his brain thought mattered to his cock, getting harder than ever before in his life in response to Marco’s attentions. Marco spread some kind of oil on his hole, dipping his fingers right up inside his virgin little ass, but instead of cringing away, Nicky’s traitorous body practically wagged its tail. He laid his head down and used his arm to push his ass back to take in more of the invasion, moaning in pleasure as Marco’s delightful fingers reached a certain wonderful spot. Nicky rocked, using his arms to push his ass back, wagging to take the fingers deeper.</p><p>Where was this coming from? What’s the matter with me?</p><p>Marco oiled up his gorgeous cock before he grabbed Nicky’s hips to hold his ass still. Marco used more fingers inside Nicky to stretch and prepare him. Nicky’s ass burned, but his breathing accelerated. He rocked and wagged his ass faster. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco laughed a little and gently slapped his butt. “Be still, baby.”</p><p>He pushed his cock into Nicky’s hole, forcing it slowly through the tight ring of muscle. Stars swirled around Nicky’s eyes as he felt an intense pain unlike anything he’d ever felt before. He screamed out, but Marco smiled sweetly back at him a split second before he bit him hard in the nape of his neck. Nicky screamed again and tried to get away from the sharp fangs sinking into his flesh. Held in Marco’s strong arms, he was unable to move. He sobbed and moaned until an indescribable feeling of passion swept over him. Even though the pressure and stretching from Marco’s cock hurt like a bitch, he made no attempt to crawl free. His body, acting independently, pushed back in an even more frantic effort to take more. The cock sliding deeper into him also filled him with the most intense joy. Marco pushed in farther and farther. Nicky thought he might split any minute, still his body acting on its own would not seek escape, shoving back, rocking, wanting more.</p><p>Buried to the hilt, Marco pulled out his sharp teeth and licked him gently over and over until the pain lessened. Marco said softly, “Try to get used to the feeling of being filled up, baby. Just lie still and take it.”</p><p>Nicky tried to, he really did, but his sluttish ass squirmed in a possessed state of its own and wiggled, seeking what more he didn’t know. “I...I can’t...hold still.”</p><p>“I know,” Marco soothed. “It’s okay.”</p><p>He pulled out slowly and pushed back in, setting up a rhythm, rocking Nicky to his core. His own dick had gotten so hard, it throbbed in pain. He tried to push his hand under him to fist his cock, but Marco stopped him.</p><p>“Not yet, baby. You’ll come soon enough.”</p><p>He continued his thrusts until he made the same little noises Nicky had been making all along. With a cry, he surged against Nicky, and Nicky felt something else pressing against his hole. Though already stretched to the max, Marco’s fingers pressed, forcing something more still inside him. What felt like a small baseball had to be that ring at the base of his cock. Nicky cried out, and Marco immediately stopped, kissing him tenderly on the back of the neck.</p><p>“Be still for me, Pet. This will hurt, but you’ll be okay. You can stretch to take it. Just relax and push out against me.”</p><p>He pushed the baseball sized knot against the base of his penis tight again. Forcing in an oiled finger, he stretched and working Nicky’s tight asshole up, around, and over the knot. Nicky whimpered, moaned, and only then tried desperately to force his body to pull away. He couldn’t move an inch. Marco held onto him effortlessly with his weight, not allowing him to move away while he used both hands to drive the knot in.</p><p>“Please, please...it hurts...I can’t...” his voice said while his stupid body pushed back, trying to take the knot in.</p><p>“Relax, Pet. Almost in. Good boy.”</p><p>Suddenly, the large knot of flesh slipped inside with a distinct plop, moving past the tight ring of muscles at his entrance and left Nicky sucking air and trembling. His hole was so stretched it had to be tearing, and he was impaled and helpless even if he could have made his body obey his commands.</p><p>Fully inside Nicky, Marco moaned, laid full length over him, and without pulling in and out, rotated his hips, moving inside him. The huge, baseball-sized knot pressed directly against Nicky’s prostate. When Marco moved his hips the slightest bit, or even when he breathed, his cock manipulated Nicky’s prostate, building up an orgasm Nicky was helpless to control. A wave of pleasure, mixed with the passion the bite brought on, engulfed Nicky. Marco’s climax built as well. Pushing up on his arms, his renewed his thrusts, surging even harder, the ring making Nicky’s sweet spot sing. Almost immediately Nicky came, in a rolling wave of delight that went on and on. And on. And on.</p><p>He’d never experienced such an orgasm before. No one touched his cock, but it didn’t make the slightest bit of difference. His could feel his cum shooting out in spurts on his belly, soaking the sheets under him with each shuddering, stiffening wave of ecstasy. Marco’s dick still firmly lodged in his ass, Nicky continued climaxing, his body pumping in wild spasms. He screamed, and Marco put one hand over his mouth, while the other rubbed his back.</p><p>Nicky’s orgasm lasted a certainly record-breaking and scary length of time. Just when he thought he might be having a seizure of some sort, it began to ease off, totally exhausting him while Marco’s cock was still hard as marble inside him. Shouldn’t he be softening by now? Incredibly, almost as soon as the shocking orgasm finished, he felt another one coming on, one more intense than the last.</p><p>He panicked, awash in pleasurable but strong, intense spasms. Marco grabbed his flailing arms and held them behind him tightly, murmuring soothing words to him. Nicky couldn’t stop; the wild thrashing of his hips wouldn’t stop, and Nicky was sure this would kill him. He could no longer feel his cum spurting, probably because there was nothing left in his balls to spurt. He thrashed his head on the pillow and screamed until everything went black.</p><p>He woke up amazed to find he was still alive and Marco’s cock, still in place, was as hard as ever. He was still impaled on a shaft of rock with the bulge of that ring pressing relentlessly against his prostate.</p><p>Marco bent down over his back and whispered in his ear. “You’re awake, darling. Good. The orgasms are easing off some now. That last one only lasted two minutes. Just ride them out, honey. Ah, here comes another one.”</p><p>Sure enough, Nicky’s hips bucked, and he spasmed into another one. Gritting his teeth, he held on tight, and in only about thirty or forty seconds, it began to ease off. Marco, however, was still rigid inside him, his knot and shaft.</p><p>“What...what’s happening?” His words came out in a wheeze.</p><p>“Maybe only one or two more, baby. We won’t be tied together much longer. Hang on.” Marco soothed him sweetly, rubbing his body wherever he could reach.</p> <p>Another one came and almost took his head off. What it lacked in length, it made up for in intensity. Nicky begged for it to stop, screaming and pounding his head into the pillow. Marco tightened his hold on him, crooning to him lovingly. When it eased, Nicky looked around at Marco in wonder, trying to catch his breath.</p><p>Marco kissed his nape gently. “You did very well, sweetheart. Try to catch your breath. You’re mine now. All mine forever. We’ve mated, and you’ll never belong to anyone else again. You have to accept that. I know it will be difficult because I haven’t had time to prepare you, but you have no choice, darling, because you belong to me now. Do you understand?”</p><p>Hell no, Nicky didn’t understand. What the hell was he talking about? Nothing had made any sense to him since he woke up in this strange place, and the only thing he could hold onto to keep his sanity seemed to be this man. He found himself agreeing as he turned his head to gaze deeply into Marco’s eyes. He could deny him nothing. Nodding his head like the little slut he’d apparently become, he sighed like a lovesick calf.</p><p>He was rewarded by another soft kiss and a sweep of Marco’s tongue over his neck. Nicky shuddered and was afraid he was about to come again. Marco pulled his head away. He pushed his hand under Nicky’s belly and wrapped his forefinger and thumb in a tight circle around the base of Nicky’s cock, squeezing until Nicky settled down. “Not again, sweetheart. It’s too much. I’ll let you come again soon, I promise.”</p><p>He’d “let” him come? Since when did Nicky need someone’s permission to come? Damn, his head nodded like a stupid puppet again, and Marco patted his shoulder. “Good boy.”</p><p>There it was again—“Good boy,” like he was some kind of dog. Maybe he was dreaming— could he be dreaming? Part of him, his treasonous body, didn’t really want this to be a dream. Marco was the only thing that seemed real, and the pleasure he gave him, was the only thing he could cling to in this chaos.</p><p>Marco’s cock softened. He pulled his hips back slowly. The knot on his cock gave a little pop and a great deal of pain as it came out of Nicky’s formerly tight little ass. Nicky, exhausted, destroyed, annihilated, couldn’t move his head off the pillow.</p><p>Marco leaned over him, rolling him to his back, and Nicky’s eyes opened despite himself. Marco smelled so good. Nicky wanted to crawl up in his lap and sleep. He wanted to go to sleep with Marco’s dick in his mouth and suck on it like a pacifier. Not knowing where in the world that thought came from since he’d never sucked a man’s cock before in his life, he realized his mind still had no control over his body.</p><p>Marco bit his wrist and bright red blood flowed out onto Nicky’s chest. Marco pushed his wrist up to Nicky’s lips. “Feed from me, little one.”</p><p>Nicky did try to turn his head, but Marco wouldn’t allow it. He took Nicky’s head in one hand and pushed his wrist up to his lips. “Suck me, Pet.”</p><p>Body winning yet again over mind, Nicky sucked. The taste was not as bad as reason told him it would be. In fact, the blood was sweet and nourishing. He couldn’t quite place the taste, but somebody really should figure this out and market it, because it was some great stuff. He sucked greedily, really getting into it. Marco allowed it, holding his wrist to his mouth for several minutes before he pulled away and gazed down into Nicky’s sated, exhausted eyes.</p><p>“Enough for now. How do you feel, pet?”</p><p>“I...I...better, I think. Yes, definitely better. My head doesn’t hurt so much. I’m not so dizzy now, but I'm really tired. Don't want to move.”</p><p>Marco touched his throat. “Good. That's because you just fed. My blood will keep you feeling calmer. The wound from the box cutter that bastard used on you has healed up nicely. You don’t even have a scar.”</p><p>Nicky shook his head in wonder. “But how...how?”</p><p>“Rory’s bite changed you into werekin. It made you resistant to human ailments and conferred a supernatural rapid healing on your wound. You’re not immortal, though we do live very long lives. You are stronger now, less likely to succumb to diseases, as long as you’re fed and cared for by your mate, by me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco wrapped the blanket around him. Nicky wanted to try to get cleaned up, but he didn’t want to argue with Marco. Anything Marco wanted was all right with him. He just wished he could have a chance to suck Marco’s cock. He so wanted to hold it in his mouth all night long. Good God, what was wrong with him?</p><p>Marco picked him up like a child again and carried him back to the table in the other room. He put his butt down on the table top, but still held him to his chest. Nicky whimpered and wrapped his arms around Marco’s waist. He could hear the other men coming back to stand by the table. He hid his face against Marco as they discussed him.</p><p>“Well?”</p> <p>“It’s okay. He’s mine. We’ve mated. We were tied together for over an hour by the knot, and he had multiple orgasms. More than I’ve ever seen. I never saw any pet in heat so strong. Maybe it’s because he’s a male bitch. I don’t know. I’ve never been with a male pet before.”</p><p>Marco’s calling me a male bitch? I don’t think I like that too much.</p><p>Marco’s voice came again. “He’s my mate now, and no one touches him. He’s fed deeply from me, and I’ll feed and fuck him again in a little while once he regains some strength. In the meantime...” Marco looped something around Nicky’s neck, running a finger under it to make sure it wasn’t too tight before he fastened it together. “He’s wearing my collar now, and in the morning I’ll have him tattooed. If all goes well, we’ll have the Alpha mating ceremony tomorrow night.”</p><p>Marco leaned down to brush his lips. The words he’d spoken sailed over Nicky’s head and made little sense he was so tired, so exhausted. He closed his eyes and snuggled closer to Marco’s chest, embarrassingly aware of little sucking sounds he made with his mouth. Marco’s thumb slipped inside his lips, and Nicky sucked it in greedily, using it as a pacifier. He was too tired to even be embarrassed any longer. Not as good as his cock, but any part of Marco would do in a pinch. He put both hands around Marco’s fist, so he wouldn’t remove it and drifted gently off to sleep.</p><p>* * * When Nicky woke up he was lying in another bed, wrapped up tightly in Marco’s strong arms. His ass ached horribly, but mostly he was quite comfortable. He’d never before had a feeling of such security and safety. Confused memories assailed his tired brain, but he pushed them away to think about later. Resting securely in Marco’s arms was enough for the present, a thought he couldn’t push away, the strangeness of it making him a little uneasy. He squirmed restlessly. Marco came instantly awake and alert next to him.</p> <p>“What is it, little one? Do you need me to fuck you again?” “No!” Nicky cried in alarm, fighting what his body still wanted and his mind. “Uh, no, I think I’m fine.”</p><p>“Shhh, baby, your body knows what you need more than you do right now. Let me get the oil.”</p><p>He rolled over and reached into the drawer. Nicky tensed up helplessly, hating his weakness. He didn’t know if he had the strength for any more, even though his body squirmed to get closer.</p><p>“Don't worry, darling, it won’t be like before. The tying up will only be for special occasions from now on. It’s the knot or the gland that causes you to become multi-orgasmic. This time should be more about pleasure for you.”</p><p>“Okay,” Nicky said meekly. “It’s just...you know...I’m not gay. I’ve never been like this with another man—ever.”</p><p>“I know. Werewolves don’t have any particular preference. Sometimes we mate with men, sometimes women. It’s never anything we know for sure until we find our blood match.”</p> <p>“What? I don’t understand. Did you say werewolves?”</p><p>“Yes, sweetheart. There’s a lot you probably don’t understand. You’ve been operating off pure instinct for the past few hours, but I can’t explain it now. Your mind isn’t clear enough while you’re still in heat. Once you come out of it, I can explain everything to you. For now, just relax and let me love you. It’ll help to clear your mind.”</p><p>He rolled Nicky over on his side and gently fit himself inside as Nicky’s ass snuggled up to Marco’s crotch with a mind of its own. With Nicky stretched out from their previous encounter, his cock slid in easily. Marco moved slowly and rhythmically, in and out, in and out until Nicky felt almost hypnotized from the motion. Marco was right; it felt so good this time. Nicky’s prostate was being gently stroked, and he thought he would soon lose his mind with the pleasure.</p><p>Marco whispered foolish sweet words in his ear, calling him his baby and his sweetheart, and Nicky grew more and more excited. He shuddered, and Marco gripped his hands in his so he could hold on. The orgasm, mind-blowing and very hard, was more like a normal orgasm, and Marco followed him in a few moments. He lay joined with Nicky, softening, but not moving, and that was just fine with Nicky. He wanted to stay joined forever. After maybe twenty minutes, Marco bit his wrist, rolled Nicky onto his back and offered him his bloody wrist to suck again.</p><p>Dutifully, Nicky sucked hard, once again loving the taste of his blood and trying to lap up every drop, until Marco pulled away. “Enough, darling. Go back to sleep now and when you wake up in the morning, you should feel almost back to normal, as normal a human as you’ll be from now on.”</p><p>Trying to ignore the last part of that statement for the sake of his sanity, Nicky tried to sleep. Marco said he’d be back to normal, Nicky thought sleepily. Except for the fact his asshole was stretched to three times its normal size, and he was thoroughly, irrevocably, totally in love with a gorgeous, muscular man twice his size. A man who had a strange baseball-sized gland at the base of his penis, yet seemed to think it was perfectly normal. A man who called himself a werewolf and called Nicky his mate and his pet. Nicky was afraid to think about all the strange remarks Marco made to him about male bitches and being in heat, like some kind of dog or something. He remembered the way he licked Marco and sniffed his hand. Oh, God! Had they done something to him to make him something not human? Was he an animal now? Was he a werewolf? Marco had called him werekin before. What the hell was that?</p><p>He looked down at himself and saw nothing unusual. He shivered uncontrollably, his mind shying violently away from the thought of being changed into some kind of dog or wolf creature.</p><p>Marco gathered him into his arms again. “Is there anything I can do for you, baby? To make you more comfortable? “</p> <p>Nicky bit his bottom lip and cast his eyes down in embarrassment. He touched Marco’s penis, and Marco laughed. “Oh no, you can’t suck that, sweetheart, or I’ll never get to sleep either. You’ll have to be content with sucking my thumb again, I’m afraid. Here, sweet baby.” He rubbed his thumb against Nicky’s lips. Nicky opened his mouth and accepted it with a sigh. He closed his eyes and let the sucking soothe him. He wouldn’t think about anything else but Marco tonight. Maybe tomorrow he’d try to figure things out.</p><p>Chapter Two</p><p>Nicky awoke the next morning, alone in a strange bedroom. He sat up and looked around with interest, trying to figure out exactly what had happened to him. Was this some kind of hospital? If so, it was the most luxurious hospital room he’d ever been in. The walls were draped with some silky fabric, and the bed was massive and soft.</p><p>He stretched and yawned, feeling sore and achy all over, certain he’d been having what had quite possibly been the most ridiculous dream of his life. Weird. Maybe he’d been in some kind of accident and hit his head. Yeah, that must be it.</p><p>He had to take a shower, and that was absolutely non-negotiable. A great deal of sticky stuff crusted his stark naked body. Suspiciously, his mind went back to his crazy dream, but he pushed the thought away. He’d experienced wet dreams before, but he hadn’t had one in years. Certainly nothing compared to what he remembered or to equal the quantity of crust on his chest and abdomen. Getting out of bed to cross to an adjoining bathroom, he thought by the way his ass ached and burned he must have sprung a good case of hemorrhoids. What the hell had happened to him?</p><p>He adjusted the water on the shower and got in, enjoying the steamy feel of the spray hitting his shoulders. As he soaped his face and neck he came across a thin, soft leather strap of some kind around his neck. What the hell? He started to take it off and then decided maybe it was some kind of new identifying thing the hospital was using. Weird. He’d ask the nurse about it when she came in. He soaped himself up, shampooed his hair and began to feel human again. He paused, stricken with the notion. Why did he think that? He shook his head, not willing to even consider the possibility his “dream” had been reality.</p><p>After brushing his teeth with a new toothbrush and toothpaste he found on the counter, he wrapped a towel around his hips and drifted out to the bedroom, trying to decide what to do next. Maybe he should try to find some nurse or something and let them know he was awake.</p><p>The door opened and the young man from the restaurant, his stalker, walked in wearing jeans and a T-shirt. He regarded Nicky curiously, especially when Nicky’s mouth fell open in surprise.</p><p>“You! What are you doing here? I don’t understand. Do you work here?”</p><p>“Work here?”</p><p>“Yeah. This is some kind of hospital or clinic, right? Where am I exactly? Is this Grady?”</p><p>Nicky asked, naming a huge emergency trauma center in Atlanta. Before the boy could do much more than gape at him, a tall, gorgeous man appeared in the doorway behind him. Marco! The name screamed into Nicky’s brain even as he experienced an almost overpowering need to run to him.</p><p>“Hi, sweetheart. I thought I could get back before you woke up. I moved you to my room last night while you slept. You weren’t frightened without me, were you?”</p><p>So it hadn’t been a dream after all. Even as his heart leaped at the sight of him, a part of him, the still very human, still very straight part of him, shrank away from him in fear. “But, but I thought you were just a dream. I...I don’t understand. God, I think I must be going crazy.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco came into the room and took his hand. Nicky wanted to pull away, but was absolutely incapable of moving though Marco’s touch brought a measure of calm back.</p><p>“I was hoping you’d remember more once you were out of heat, but sometimes this happens. It can’t be helped, but you don’t have to be frightened, honey. I only broke away for a few minutes, because I have to make preparations for tonight, and you have to be...um...prepared for the ceremony. I promise I’ll explain everything properly later this afternoon, when I have time. For now, you just have to trust me.”</p><p>Marco took him by the arm, walked him to the side of the bed, sat him down, and sank down beside him. This close to him, Nicky couldn’t think straight. The almost irresistible attraction from the night before was still working. What the hell was that smell? Nicky leaned into him and sniffed at his throat.</p> <p>Marco ruffled his hair. “Do you trust me, baby?”</p><p>Nicky nodded his head wordlessly. Putting his nose right up in the hollow of Marco’s throat, he kissed him softly, breathing in the wonderful, calming caramel smell.</p><p>“Good boy,” Marco said, smiling. He bent close and brushed his lips over Nicky’s cheek and what felt like an electric shock went straight to Nicky’s cock. “Okay, do whatever Rory tells you, and you’ll be fine.”</p><p>He rose from the bed and turned to the young man by the door. “Take very good care of him for me, Rory. He’s still pretty confused. They’re waiting for him downstairs. Try to keep him calm, though—he’s very...um...excitable.”</p><p>“You know I can hear you, right?” Nicky spoke up from the bed.</p> <p>Marco turned around and smiled at him indulgently. “God, he’s adorable, isn’t he?” he said over his shoulder to the young man. The boy whose name, presumably, was Rory, looked down at him dubiously.</p><p>“We’ll talk later, beautiful, and I’ll try to explain everything. I’m sorry I can’t stay with you, but things are difficult right now.”</p><p>With a smile he walked out the door, leaving Nicky alone with Rory, who stepped warily toward the bed holding a strap of some kind in his hand.</p><p>Nicky regarded him with suspicion. He was supposed to ‘take care of him’ for somebody who was waiting downstairs. “Stay back,” Nicky said as Rory approached with the strap. “What are you going to do with that? I won’t let you beat me with it.”</p><p>Rory looked shocked. “Beat you? Why would I do such a thing? We don’t believe in beating our pets, not ever.” His tone was indignant. “I was only going to attach it to your collar.”</p><p>“My collar?” Nicky’s hands flew to his neck and felt the thin, leather strap Marco put on him the night before. “Is that what this thing is? And that’s a leash? Are you fuckin’ crazy?”</p> <p>“It won’t hurt.” Rory’s expression was very sincere. “Pets always walk on leashes. You’re can’t be allowed to run free. You could get hurt.”</p><p>“Yeah, well, I’ve been walking on my own for some time now, thanks, and doing just fine.”</p><p>“Except for the other night.”</p><p>“What?”</p><p>“I said, except for the other night when you got hurt by those two guys with the box cutter. You didn’t do too well on your own then.”</p><p>“Well, that was totally different. They were trying to take my money, and...hell, it was different.”</p><p>Rory walked up to the bed and stared down at him. “I have to take you downstairs, and Marco will be angry at both of us if you’re hurt in any way. I’m taking no chances, and neither are you. So please don’t fight me on this, Nicky. Let me put on your leash.”</p><p>Stubbornly, Nicky shook his head. “Not going to happen. I’ll walk with you downstairs if that’s what Marco wants me to do, but you can take your damn leash and stick it up your...”</p> <p>“Nicky!” Marco’s strong, disappointed voice came from the doorway. Nicky turned to see his eyes flashing. “I forgot my notebook, and I come back to find my pet being unforgivably rude. You will apologize immediately to Rory and allow him to attach the leash. This is not the way I want my pet to behave.”</p><p>Nicky was surprised and hurt by Marco’s sharp tone. Up to this point, Marco had only used a loving, tender voice with him, and the idea of Marco being displeased made him squirm with embarrassment and unhappiness. Why was that? Why couldn’t he tell them both to go to hell? He dropped his head and stared down at the floor.</p><p>“Nicky!”</p><p>“Okay, I’m sorry, Rory. Put the damn leash on me.”</p><p>Rory clipped on the leash. Marco still stared at Nicky with displeasure. As the silence stretched out in the room, Nicky grew more and more uncomfortable, unable to meet his gaze.</p><p>Finally, Marco spoke, breaking the silence. “Nicky, I’m trying to be patient with you, but I won’t allow you to misbehave or use bad language. Your behavior reflects on me as your master. You’re wearing my collar now, and you belong to me. Rory, please let me know if Nicky gives you any more trouble. If he does, I’ll come and deal with him. And Nicky, if you cause me to have to leave my business because of your bad behavior, I’ll be very unhappy. Do I make myself clear?”</p><p>Rory and Nicky both said, “Yes, sir,” at the same time and shot each other an irritated glance.</p><p>Marco turned on his heel and left without another word, and Rory tugged at Nicky’s leash. “C’mon, Nicky, they’re waiting for you downstairs.”</p><p>Nicky grabbed the leash and pulled back, bad temperedly, but stood up, looking down at himself. “Well, get me something to wear. I can’t go like this.”</p><p>Rory looked confused. “Oh,” he said, “there are some pants by the bed.”</p><p>A pair of skintight leather pants lay on a chair by the bed. He pulled them on. They fit, but barely, and showed every bulge, particularly the one in front. “No underwear? And where’s my shirt and shoes?”</p><p>“What? Pets never wear anything except pants inside the house. You really don’t know anything, do you?”</p><p>Nicky shot him another frustrated, eat-shit look and stood up. “No, Rory, I don’t. Mostly because nobody ever tells me any fuckin’ thing. You all talk about me endlessly, but nobody ever explains anything around here. You all just make cryptic little remarks and expect me to somehow know what the fuck you’re all talking about!”</p><p>Rory shifted his feet and blushed. “Shhh...don’t make me have to tell Marco you used bad language like that. He’d spank you.”</p><p>“Spank me? Spank me? What kind of place is this? Who are you people? Damn it, I demand that you let me go home!” He made a sudden jerk of his head, pulled his leash from Rory’s hand and made a break for the door. For all that Rory was young, his relaxes were quick as lightning. He snatched the leash up and pulled back on it sharply, jerking Nicky off his feet to fall back on his ass on the floor.</p><p>“Oww!” Nicky rubbed his neck and looked back at Rory indignantly.</p><p>Rory came over to help him to his feet and then pushed him down on the bed. “Okay, ask me.”</p><p>“What?”</p><p>“I said ask me what you want to know. But make it quick or they’ll come up here looking for us.”</p><p>“Okay, first of all, who in the hell will come up here? Who’s waiting for me downstairs?”</p><p>“The tattoo artist. Don’t you remember you have to get a tattoo? All pets wear their master’s names on their lower backs. They have to have his pack number on there too. It’s traditional, and you have to have one, so don’t even argue about it.” Rory stood over Nicky belligerently, his fists clenched as if ready for a fight.</p><p>“A tattoo and a number? What is this place, some kind of concentration camp?” He frowned at the determined look on Rory’s face. “I don’t suppose I have a choice, do I?”</p><p>Rory tugged at his leash again, but Nicky pulled back. “Wait! Who are you people? What are you? What did you do to me? Please, I have to know!”</p><p>Rory sighed. “Okay, but quick, and then we have to go downstairs. We’re the Dark Hollow Wolf pack, and we live in North Carolina. We didn’t do anything to you, exactly. I mean, we changed you to werekin, but we had to do that. We couldn’t just let you die, and besides you were fated to be with Marco, and you wouldn’t have been able to resist him without making yourself absolutely miserable, so you would have been changed eventually anyway.”</p><p>“Okay, you’re talking absolute nonsense to me again. Wolf pack? Werekin? What does that mean? What do you mean, pets? Why do you call me that?”</p><p>“‘Cause that’s what you are.” He shrugged. “Our adopted pets are always humans.”</p><p>The inside of Nicky’s head spun, but one thing Rory said chilled the blood in his veins. “Humans? Are you saying that you’re not human?”</p><p>“Well, we’re partly human—half of our parents are human, after all. We’re all werekin, both wolves and pets. But for some of us, the beast is strong. We’re called werewolves— shapeshifters. We are the true members of the wolf pack. Marco is our Alpha wolf, our leader. Many of the rest of us, both men and women are gamma wolves. You might think of it as sort of soldiers.\"</p><p>\"Why would you need soldiers? Are you in some kind of war?\"</p><p>“Not exactly, though we do have enemies. We've been on the edge of an all-out war with the Hunters for over a century.\"</p><p>\"The what? The Hunters? What is that?\"</p><p>Rory shrugged. \"Monster Hunters. They think we’re monsters, you see. They hate the wolves and want us all dead. They come for us from time to time and attack with silver bullets. It's the only kind of bullet that will kill a werewolf.\"</p><p>\"Like in the movies.\"</p><p>\"Yeah, like in the movies.\"</p><p>\"Who are these people—these Hunters?\"</p><p>\"They get their name from an old hunter named Abraham Van Helsing over a hundred years ago who hunted all the Fae. Fae are the special ones, the shapeshifters and vampires, werewolves, and the like. Fae are not human totally, or they may once have been, but aren’t anymore. Anyway, the Hunter’s descendants carry on the tradition, and they hire soldiers of their own to engage us in battle from time to time. The last battle was over two years ago, but they'll come again. Once they've replenished their army. They always come.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"But who—what are you all?\"</p><p>\"Shapeshifters, like I said. All the others here are just our pets or mates. All children are pets too, until they go through puberty, and it becomes clear what they are. They’re either wolves or pets—werekin. If they stay pets, then they become mates to the wolves. Unless, of course, the wolf’s blood match is human.” He shrugged. “It happens sometimes, like with you. Then the human has to become werekin with a bite. Now come. It’s time for your tattoo and your grooming. You have to look your best tonight for your mating ceremony.”</p><p>“My what ceremony?”</p> <p>“Tonight you’ll officially mate with our leader, Marco. It’s a very high honor, and he’s waited a long time to find you. You have to look your best for him.”</p><p>Nicky allowed Rory to pull him to his feet and followed him slowly down the stairs. His mind raced with a million more questions, but he knew Rory wouldn’t take the time to tell him more. He still didn’t believe half of what he’d already heard. Werewolves alone was too fantastic to be real. Shapeshifters and werewolves! He had to be dreaming or on some kind of weird acid trip. He didn’t remember taking any drugs. Could someone have slipped something in his drink?</p><p>He followed along in a daze. Along the way they met others coming and going. The place seemed to be almost like a large hotel, with three floors connected by the stairs and rooms leading off the central lobby or hall. Not a hotel, though, or not a normal one anyway, because many of the people they met were half naked like Nicky, wearing a leash, following behind someone meekly, their eyes downcast. Sometimes it would be a female, following a man, but often it was a half-naked, leashed male following a woman.</p><p>“What is this place, Rory?”</p><p>Rory looked over his shoulder at him. “This is Mountainwood, our home in North Carolina. It’s a kind of compound, in a way. The whole pack lives together, but we have our separate bedrooms, of course, leading off the main common room and kitchen. It makes us feel more like a pack—like a family. It’s much safer too. You were brought here unconscious on the night you were changed. So you don’t remember arriving at the compound?”</p> <p>Nicky shook his head, not sure what he remembered. “What does that mean, ‘changed’? You all keep saying that. What happened to me?”</p><p>Rory sighed with exasperation. “I’ve explained all that. You became werekin. Marco’s mate and a bitch in heat. His bite put you in a state of estrus or heat, to prepare you for the mating cycle. And then you’re mated. For life. So now you’re Marco’s bitch.” He gave the leash another tug. “Walk faster, Nicky. We’re already late.”</p><p>Nicky followed him, actually feeling more docile as he walked slowly along. He suspected the leash made him feel calmer, more controlled. Apparently he was Marco’s bitch, for real. Something dramatic had certainly happened to him. Never, before a couple of nights ago, would he have allowed himself to be pulled along on a leash, be multi-fucked by a man, and crave more.</p><p>Was this part of the “change” they kept talking about? That and the insane craving to be with Marco every moment of the day? Shame and humiliation crawled over him, and he stumbled a little going down the steps. Immediately, Rory’s hand shot out to steady him carefully.</p><p>“Steady, now, Nicky. No one wants to hurt you. Don’t be scared. We’re only trying to help you get settled in.”</p><p>A few minutes later, he clung to Rory’s words as he watched the tattoo artist prepare his needles. He looked nervously to Rory for reassurance and Rory immediately pet his head, rubbing his hand through his scalp like Marco did so often.</p> <p>“You’re okay, Nicky. The tattoo will sting a little, but it’s not too bad. I know how brave you are, so make Marco proud.”</p><p>The tattoo artist smiled at him kindly too. “Just turn over, dear, and I’ll be as gentle as I can. If the needle gets to be too painful, tell me, and we’ll stop for a while, okay?”</p><p>Both Rory and the tattoo artist were kind, but they treated him like a not-too-bright child or actually a pet dog. Of course, to their credit, he’d been sort of acting like one or the other since he’d arrived. His mind did feel more connected to his body than during what he’d thought was a dream, though, so that was a plus.</p><p>Nicky turned over onto his stomach on the table, and the artist began his work. They were right—the pinpricks stung a little, but it wasn’t anything he couldn’t stand. After his first flush of panic and embarrassment at someone giving him a tattoo of Marco’s name, like he was owned by him, he relaxed a little. Rory stood close, keeping his hand on Nicky’s head.</p><p>When it was over, Rory held up a mirror for him to see himself. The tattoo, probably about two inches in diameter, held Marco’s name and a number one in a lovely, flowing script, pretty, really. Nicky found he didn’t mind too badly. It was Marco’s name, after all. If that’s what he wanted, he guessed it wasn’t too bad.</p><p>“I can do a small heart too, if you’d like? Beneath the name?”</p><p>Nicky looked up at Rory who shrugged. “Up to you.”</p><p>Nicky blushed and stammered. “N-No, nothing else.”</p> <p>Rory smiled at the tattoo artist. “I think he really wants a heart, but is too embarrassed to say it.”</p><p>“Certainly.” The tattoo artist bent himself to the task and in only a few minutes, he’d finished.</p><p>“Keep petroleum jelly on it until it heals, and tell your master immediately if any kind of infection develops.”</p><p>Rory helped him off the table and led him from the room. “Now to the groomers,” he said, and tugged again at Nicky’s leash.</p><p>“Yeah, and don’t forget my shots. Maybe a heartworm pill?”</p><p>Rory turned a concerned, puzzled face toward him. “Do you think you need shots and pills? Are you ill?”</p><p>“Forget it,” Nicky said. “Take me to the ‘groomers’ and let’s get this shit over with.”</p><p>“Okay, but you really need to watch your language. Marco will punish you for those cuss words. Pets are not allowed to use them.”</p><p>“Yeah, yeah, whatever,” Nicky mumbled, following him down another long hallway off the common room.</p><p>Rory opened the door to what looked like a beauty shop, except it would have to be one in some kind of nudist colony, because almost everyone in the room except for Rory was half naked and wearing collars. A pretty little brunette came over to them and took Nicky’s hand.</p><p>“Hello, Nicky. It’s so good to meet you. I’ve never seen a man as pretty as you before. You’re so beautiful. Everyone’s talking about it.”</p><p>A couple of puzzling things were happening or rather not happening. First of all, a rather beautiful young girl stood in front of him, totally naked from the waist up, her breasts almost touching his chest, and his body wasn’t reacting at all. He looked down at his cock, and it was peaceful in his pants and perfectly uninterested. What the fuck?</p><p>Secondly, he felt almost no embarrassment at standing in front of these people while halfnaked himself, wearing only a pair of skin tight leather pants. Was he just becoming accustomed to it? Or was he still in the middle of the weirdest dream he’d ever had?</p><p>“My name is Tara, and I’ll be your groomer today. Come in and sit down, dear.”</p><p>Rory unclipped the leash, and the minute it came off, uneasiness stirred in Nicky. He allowed Tara to take his hand and lead him to a chair. Rory stood nearby shifting his feet until Tara took pity on him and said with a laugh, “Sir, you can wait outside if you wish. I promise we’ll take very good care of him.”</p><p>Rory retreated gratefully, and Tara turned back to Nicky, running her fingers through his hair. “Your hair is so lovely. So curly and shiny. A true blond, right?</p><p>Nicky nodded, a little embarrassed by all this talk of his beauty. He’d always been uncomfortable with the idea.</p><p>“Your hair’s so blond, and your skin’s so creamy. Have you noticed that most of us have dark hair and brown eyes? It’s rare that a master will choose a blond with those pretty blue eyes. They really prefer brunettes. Of course, if it’s a blood match, like yours, Marco would have had no choice.”</p><p>“All these terms you people keep tossing around are confusing to me. Please explain to me what you’re talking about. What does ‘blood match’ mean exactly?”</p><p>“Oh, I’m so sorry. I was a new pet myself, not too long ago, and I remember how confusing it all was at first. Listen, let me get you shampooed, and then I’ll explain everything while I style your hair.”</p><p>“I just washed my hair in the shower this morning.”</p><p>“Oh, good. Then let me spray it with some water to make it easier to style.”</p><p>“It’s pretty long. Go ahead and cut it as short as you want.”</p><p>“Oh, no. Marco said specifically it was not to be cut. He loves your pretty long curls. Don’t worry. I’ll take good care of you.”</p><p>“Yeah, that’s what everyone keeps telling me. So far I’ve been bitten, stripped naked, and tattooed, along with some other things I can’t talk about in front of you. You can understand if I don’t quite believe that statement anymore.”</p><p>“Sorry, dear,” Tara said as she sprayed water on his hair and ran a comb through it. “Let me tell you what I know about the werekin.”</p><p>“Please.”</p><p>“Okay, now keep in mind I’ve only been here a few months myself. My master is Tristan. He’s very handsome and wonderful.”</p><p>Her eyes took on a dreamy quality. Nicky wondered if his did the same when he talked about Marco.</p><p>“He first saw me working in a beauty shop in a small town not too far from here. We were a blood match too. That means, when a master sees a certain person, they just know instinctively that the person is for them. They can’t help themselves, really. They have to have us and are miserable without us. We feel the same way about them too, once we see them and accept the idea. Do you remember when you first saw our Alpha?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes, last night. It was the strangest thing I ever felt. I couldn’t get close enough to him.”</p><p>“Yes, you two are a blood match, so his blood sang to yours right away. That’s why you instantly recognized him. We’re totally drawn to them, you see, beyond reason, beyond any human ties. We always go to them willingly and submit to them completely. At least at first while we’re in heat. Our masters subdue us, make us submissive to them and the masters are all very skillful at it.”</p><p>“Okay, back up. What do you mean ‘master’? As in slave and master? I’m not going to be a slave for anybody, even Marco. They can all forget about that.”</p> <p>“No, dear, calm yourself. It’s not like that. Masters are the wolves, the shapeshifters. Don’t you know about that? The word refers not only to the relationship but to the hierarchy in the pack. The Alpha, ours is Marco, is the highest ranking member of the pack. Then comes his beta, or second in command. The rest of the wolves are gammas, and then come the pets. Pets are always the mates and submissive to the wolves. We call them ‘sir’ and ‘master’, and they take care of us. You see?”</p><p>“Sort of—Rory was telling me something. Do you mean this is all for real? They actually turn into wolves?” Nicky’s voice took on a horrified tone. Surely this was all a crazy dream. Or was he truly mad?</p><p>“Oh yes. Big, beautiful wolves, who are very terrifying when adopted pets first see them. Certain members of the werekin or wolf clan become shifters when they reach maturity. When a baby is born, the parents never know if they are destined to be shifters or pets. It’s not until they reach puberty that it becomes clear. It can happen to both male and female children. The ones who don’t shift become pets for other masters. Since they were born to the pack, they don’t have to wear leashes when they go out or be restrained in any way, like those of us who are adopted. The natural born pets don’t seem to have the same tendency as we do to go feral. If the masters can’t find their mate, their blood match, among the pack, they’re allowed to adopt a pet—like us. When they bite us, they turn us into werekin. Their bite and their blood literally change our body chemistry and DNA. We’re healthier, stronger, and live longer, almost impervious to illness. We’re always submissive to them. It’s just the way it is. It’s the way it has to be.”</p><p>“This is some crazy shit, Tara.”</p><p>“The wolf packs are very old and have always lived side by side with humans, but we... humans...have never been aware. There are old stories about werewolves whose bite turns a human into a monster. These stories have some basis in truth.” Tara’s voice lowered, and her expression sobered.</p> <p>“What do you mean?” Nicky voice dropped to almost a whisper, too.</p><p>“Our masters aren’t monsters of course, but if a pet is not tamed right away, if he or she is allowed to too much freedom, they can become feral, very savage. They never shift, at least not totally, but their hair grows all over their bodies, and they become like animals. They have to make us very submissive from the beginning to prevent it from happening.”</p><p>“Submissive? Like some kinky sex thing? I’m not into all that. Hell, I’m not even gay, but Marco picked me! I don’t like the sound of this whole thing.”</p><p>“It has to be this way. Hundreds of years ago, when humans were bitten, they became quite violent and savage. The masters, the shapeshifters, learned to control this in the newer ones, or they would have had to be put down. Eventually, they managed to breed docility into the natural pets, and they developed other methods to train the adopted pets. We have to become submissives. It’s the only way to keep the savagery out of our natures. Believe me, you’ll be much happier if you’re controlled. It makes us all feel safer. Didn’t you notice when you wore the leash you felt calmer?”</p><p>“Calmer? I’d have felt a whole lot calmer if I were somewhere else. Why didn’t they let me live my life? Why did they do this to me? I don’t want to be somebody’s pet dog.”</p><p>“No, no, you’re not a dog. Not at all. You’re thinking of it the wrong way. They do use the canine terms, because they’re wolves, after all, but it doesn’t mean the same to them as it would to humans. Nothing degrading. The masters cherish pets and love us very much. Remember, all of them have family members who are pets—their mothers or fathers and some siblings. The masters never adopt without careful consideration and then only when it’s a blood match. They would never treat us with disrespect.”</p> <p>She fingered his collar. “This is all about protection and safety. Once we’re bitten, we become wolf-like. Not quite human anymore. We’re only calm when we’re being controlled. Collars and leashes remind us we’re controlled by the masters. Otherwise, we’d deteriorate into something utterly savage. Believe me, you don’t want that. I heard a pet who escaped a few weeks ago wandered in the hills for over two weeks before the masters found him. He fought them savagely. Once we give in to our feral nature, it’s almost impossible to come back. Especially for someone new to the pack. When the escaped pet was finally recovered, they said he had to be in heavy restraints for two weeks, and they’re still not sure if they can save him.”</p><p>“Save him? From what?”</p><p>“From turning into a wild animal, who lives only to feed on human blood.”</p><p>Nicky’s mouth turned dry, and he was silent for a moment. “Could that happen to me?”</p><p>“It could, but I’m sure it won’t. You have a very caring master in Marco. He loves you and will always take care of you.”</p><p>“But Marco’s a guy, and he’s not even gay. I heard him say he’d never been with a male pet before. Why did he pick me?”</p><p>“You’re his blood match.” Tara shrugged expressively. “He had no control over it, just like you have no control.” She shrugged. “We love whom we love, and that’s it. From the first moment he saw you, he could no more resist you than he could stop breathing. You can’t resist him either. My master told me Marco first saw you two months ago and tried to resist you, because he found out you were straight and was afraid you’d never submit well. But he couldn’t resist. He made himself sick, and since he’s our Alpha, the whole pack suffered. When he heard you’d been injured, he dropped everything and rushed to your side. Wolves mate for life. There will never be anyone else for him but you. You’ll never be able to love anyone else again, either.”</p><p>Nicky sighed. “He saw me two months ago? He’s right. I’m straight, but with Marco...I don’t know. It’s different somehow. I’d never seen him—I would have known instantly. It’s like a drug, an addiction. He’s just so perfect.”</p> <p>Tara laughed. “I know. I feel the same way about my master, and Marco really is something special. Being the Alpha’s mate is quite an honor.”</p><p>“Is there some other reason he waited so long?”</p><p>“I’m not really sure, but don’t worry. He’ll explain everything soon.”</p><p>“What if he wanted children?”</p><p>Tara shrugged. “You really shouldn’t worry so. Our pack is large and all inter-related. There are plenty of children to go around.” She smiled at him in the mirror as she turned him back around. “You have to relax. Your fate is sealed anyway. You can’t go back. You can never leave. I’ve explained what will happen if you do.”</p><p>\"Well, what if those Hunter people attack again? Would they kill me?\"</p><p>Tara nodded. \"If they could, they’d kill all of us, but you're worrying too much. Our wolves will protect us. Always.\"</p><p>Most of the time Tara had been talking, she’d been curling his hair with a hot iron and his back was to the mirror. Now she turned him around while she brushed and shaped it with her fingers and stepped back to let him get a good look. In shock as he looked at himself in the mirror, Nicky only half heard the last of what she said.</p><p>His mouth dropped open. There was an actress in an old late night television show he’d seen once when flipping channels; Shirley Temple, and her hair always lay in her trademark tight clusters and ringlets all over her head. As Nicky gazed at himself, he could have sworn little Shirley was looking back at him. Not wanting to hurt Tara’s feelings since she was so sweet, he gulped hard and smiled at her. “Thank you,” he said, in a choked voice. He looked like a damn girl.</p><p>“Okay,” she said. “Only one more stop and you’ll be ready. You have to be waxed. It will hurt a little but will remove all the hair from your body. It will help make you feel less beast-like, less wild and feral. Besides if you don’t keep it waxed, it might start to grow out of control. This has to become a regular thing for you now. Remember, everything they do for us is for our own good.”</p><p>“Oh hell, no, I’m not getting my body waxed. Are you crazy? No way in hell.”</p><p>“Nicky,” Tara said sadly. “Please watch your language and your temper. You really have no choice. If I have to, I’ll call your master. He’ll spank you for your disobedience, and you’ll be waxed anyway. Isn’t it easier just to submit?”</p><p>Nicky put his head in his hands, and to his horror started to cry. Before all this happened to him, he hadn’t cried since he was a little kid, and now he couldn’t seem to stop acting like the little girl he looked like. Tara rubbed his shoulders, and he felt her breasts graze across his back. Still no reaction from his stupid, stubborn cock, which was apparently holding out for Marco.</p><p>“It’s okay to cry, Nicky. It’s really good for you to give in to your feelings and get in touch with your feminine side. It makes you more docile.”</p><p>Nicky gulped in shock. “Feminine side, my ass!”</p><p>“Nicky, please watch your language!”</p><p>“Now that’s another thing.” Nicky sniffed hard. “Why do I have to watch my language and never cuss? Is that more control?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, in a way. When a pet curses and is angry, they are giving into their feral nature. It’s a bad habit, and it can only lead to more anger and savagery. Your master will make you stop and won’t let you have a temper tantrum. He’ll spank you very hard and make you apologize.”</p><p>“Are you sure you’re not just brainwashed by your master? Maybe this is all just a way to make us submit to them, make us grovel.”</p><p>“No, Nicky, you mustn’t think that. Please be careful not to let your wild nature overcome you. It can happen with some of us very quickly, especially when we’ve just been turned.”</p> <p>He sighed and gave up, too confused to fight anymore. “Okay, let’s go.” She smiled in relief, and he allowed her to lead him to the back.</p><p>The next thirty or forty minutes were agonizing as hot wax was put on every part of his body and then stripped off, along with the hair. Luckily, he had little hair on his chest or back, so most of the hair came off his legs, arms, and groin. The ordeal left his skin pink and hairless, and he painfully limped along with Tara back to the door to find Rory.</p><p>Rory barely glanced at him as he clipped his leash back on and tugged him along behind him.</p><p>“Where am I going now?” Nicky asked listlessly. He was exhausted and felt like an emotional wreck.</p><p>“Back to your room. Marco’s waiting.”</p> <p>At the mention of the Alpha’s name, Nicky’s spirits lifted a little, and his whorish cock stood up. He eagerly followed Rory up the stairs. Marco waited, sitting in a chair by the window, looking even bigger than Nicky remembered and twice as handsome. Rory nodded to him respectfully, unclipped the leash and backed out of the room. Nicky stood uncertainly just inside the door until Marco beckoned to him. “Come here, baby.”</p><p>Nicky fairly flew across the room and tried his best to crawl into Marco’s lap, but Marco pushed him down to sit at his feet. Though he’d called him ‘baby,’ he still looked displeased, and Nicky’s heart thumped loudly in his chest.</p><p>“Are you mad at me, Marco?”</p><p>“It’s time you called me Master,” Marco replied in a soft, but stern voice.</p><p>“Yes, sir,” Nicky said quietly. “Yes, master.”</p><p>“Take off your pants and let me look at you.”</p> <p>Nicky dropped them quickly and pirouetted in place and his heart sank when Marco’s response wasn’t what he expected.</p><p>Marco watched him without a smile. “I’ve been hearing some negative reports about you, Pet, and I don’t like them one bit. It’s been reported to me that you continue to use bad language, and you’ve been a little rude. Is this true?”</p><p>“Who told you this? Was it Rory?”</p><p>Marco put a finger to his lips. “Hush. I didn’t give you permission to ask any questions. Now answer me. Is what I said true?”</p><p>Nicky dropped his gaze and slowly nodded his head.</p><p>“I’m trying to be lenient with you, Pet, because I know this is all new to you, and you were turned in unusual circumstances and not by your master. All of this can factor in. But you must stop the bad language immediately. Are you clear? It only leads to trouble. No more rudeness, either. I won’t tolerate your being a brat. You represent me now when you go out, and it’s not enough just to look beautiful on the outside. You must be beautiful on the inside as well.”</p><p>Nicky dropped to his knees again and nuzzled his leg. He couldn’t help himself. “You think I’m beautiful?” He looked up at Marco flirtatiously.</p><p>Marco hesitated and then smiled indulgently, pulling Nicky up on his lap and settling him there, with a hand on Nicky’s growing cock. “Yes, baby, I think you’re very beautiful. And I think you know it. You’re in danger of becoming very spoiled.” He touched Nicky’s curls. “I love your hair, and this is quite nice too.” He rubbed his hands over Nicky’s slick, waxed pubic area. “Did it hurt very much?”</p> <p>“Like a bitch...uh, like a bad word.” he corrected himself.</p><p>Marco pretended not to notice his slip and continued to rub his hands over him. Nicky’s cock throbbed, begging for more. “It’s time for me to fuck you and feed you again, baby. This will be your last feeding for a while. It will help you be strong for the ceremony tonight.”</p><p>“Okay,” Nicky said eagerly. “Can we do it now?”</p><p>Marco smiled and surprised him by picking him up in his arms and taking him to the bed, apparently as aroused as Nicky and not wanting to even talk, wanting to have hot sex as fast as he could get it. Unzipping his pants, he pushed Nicky down on the floor to his knees, and moaned as Nicky’s mouth immediately closed around him. Nicky’s lips moved over and up and down his shaft, licking him, tasting him, sucking him, trying to consume him. He had no idea where the knowledge of what to do came from. He’d never sucked a dick before and never even had it done much to him. Something instinctive took over.</p><p>Marco moved his fingers to the back of Nicky’s head and held him there, taking control, holding Nicky still to thrust his cock into Nicky’s mouth, making him take it deeper and deeper into his throat. Only when Nicky gagged, did he pull back out and allow him to take a few breaths.</p><p>Nicky wanted to resume, his mouth open and seeking. Marco pulled away and lifted him up to the bed, turning him over, directing and guiding Nicky to his hands and knees. Ready and waiting, his ass wiggled in invitation, and Marco smiled, rubbing his fingers over the cleft of Nicky’s ass. He took the lube from the bedside table and applied it liberally to his cock before turning back to Nicky and preparing him. His finger swept over his hole, dipped and probed inside, stretching him, adding one finger and then two. Nicky moaned and gripped the pillow in front of him tightly, his ass shoving back when slick cock replaced fingers. Marco entered him slowly, with a long, deep stroke, stretching, filling, and making Nicky feel complete. Nicky rocked, wanting harder, deeper thrusts. Marco didn’t hold back, pounding into him, making Nicky scream with pleasure. Marco moved again and again in a steady, forceful rhythm, burying himself to the glandular ring. Nicky matched his rhythm, shoving back with each push with one hand on the bed and the other on his own cock, squeezing and pulling.</p><p>Marco drove slowly in and pulled back, driving in over and over. No matter how hard Nicky tried to prolong the union, his body bucked, cum shooting out in long, thick streams. He called out Marco’s name, and Marco followed him in climax, pump for pump. Collapsing on top of him, Marco rolled to the side, pulling Nicky with him, grinding his softening cock into the cleft of Nicky’s ass.</p><p>“I love those little whimpers you make, baby. They drive me crazy.” He ground into him again. “Do it some more.”</p><p>Nicky obliged him and rolled over, licking Marco’s chest. Marco laughed, catching Nicky under the arms and pulling his face up to his own. Nicky thrust his tongue inside Marco’s mouth, tasting his sweetness until Marco lowered him to the bed and smiled to see him struggling to catch his breath. Giving Nicky a moment, Marco bit his wrist, offering it up to Nicky’s lips. Nicky attached to it greedily, lapping at it and trying to catch every drop as it fell. After several minutes of allowing him to feed, Marco pulled his wrist away and licked at it a few times to heal it back up. Nicky’s eyes followed his every move, always wanting more of him. When would he ever have enough?</p><p>“Never, darling. It’ll never be enough for you and me. We’re blood mates.”</p><p>Nicky looked up at him oddly. Had he spoken the words aloud?</p><p>“No, baby. I can sense your thoughts now. It takes a couple of matings for it to kick in, and it finally has. I can kind of hear your thoughts, and no, to answer your question, you can’t hear mine. It’s a one way transmission. I’ll be able to keep up with you as long as you’re close by, and I’ll know what you’re doing.” Marco nuzzled his neck. “I totally own you now.”</p><p>“But that’s not fair. I mean, I don’t even have my own personal thoughts anymore? What if I’m angry at you or what if I—?”</p><p>“Do something bad? That’s the point, baby. I don’t want you to do anything bad. My job is to keep you safe and protected always. Even from yourself. The masters take their responsibilities very seriously.”</p><p>“So it’s like I’m a dog and a child? A damn puppy?”Two stinging slaps fell on his naked ass. “Ow! What was that for?”</p><p>“Cussing. I’ll give you just a warning this time because you were surprised and still learning. Next time, you’ll go over my knee. Now say you’re sorry and be careful what you’re thinking. I can hear you.”</p><p>“Yes, sir. I’m sorry.” Nicky’s voice was sullen, but Marco seemed satisfied.</p><p>Marco put his arm around Nicky and pulled his head back around to face him. “This is hard for me too, Nicky. I don’t want to hurt you, and I never envisioned my mate to be someone like you. When I first saw you, I couldn’t believe it.”</p><p>“Someone like me?” Nicky’s heart fell with a thump. “Is it that bad?”</p><p>“You know what I mean, baby. A boy. Just a young straight boy, and I almost lost my mind the first time I saw you. I’d never been attracted to that many boys before you. Though I’ve had sex with men before, I never imagined I would take a man as a pet. The fragrance, the sight of you—I thought I’d lose my mind and throw you on the ground right there. I first saw you at an art show in Atlanta in Piedmont Park. I was in Atlanta shopping with my mother. She’s an adopted pet and can’t be out alone. I was keeping her company while my dad watched the game on TV back in the hotel. Then I saw you setting up some of your paintings.</p><p>“The blood lust was so strong I almost dragged you off into some bushes and bit you right then and there. I think I might have too, if my mother hadn’t been with me. She saw what was happening and calmed me down. She went over to you and got your card and bought one of your paintings. When she got back and gave them to me, the scent was so strong on them I was miserable and sick for a week. My mother talked me into waiting until you got a little older. She said you told her you were only nineteen, and I had to give you a few years. When I was away from you, it was hard to believe you were so irresistible. I even got cocky about it and went to the restaurant where you worked. I sat across the room from you, and when you walked in I almost lost my mind again. I had to leave before you saw me. I couldn’t wait. You being so young and a male couldn’t be helped. I had to have you. I assigned some watchers until I could make arrangements.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Watchers?”</p><p>“Guards. Like Rory. To take care of you until I could come for you. I was afraid you’d be hurt. You’re so damned beautiful.”</p><p>Nicky blushed, laughing. “Oh, you can cuss, but I can’t, huh?”</p> <p>“I’m sorry, baby. I know this is hard for you. I wish I could make it easier.”</p><p>“So you watched me, did you? Why didn’t you come over and introduce yourself?”</p><p>“I couldn’t trust myself. If you’d reacted to me, like I knew you would, I’d have taken you right there.”</p><p>“So you watched me.” Nicky flushed. “Even when I went out on dates?”</p><p>“Yes. It was torture for me, but I could sense you weren’t serious about them. I thought it would be a good idea for you to sow some wild oats, like my mother said. Get it out of your system if you could in two months, because you’ll never be with anyone else again but me.”</p> <p>Marco tightened his grip possessively on Nicky, and Nicky sighed contentedly, truth pouring out his mouth. “I’ll never want anyone else but you, ever. It makes no sense, I love you so much.”</p><p>“Is there anything else you want to ask me before tonight’s ceremony? Any more questions?”</p><p>“Yes, but I do think I understand everything that’s happened now. I still don’t quite believe it yet—I keep waiting to wake up, and it’s hard to take in all at once. Is there anything I should know about the ceremony tonight? Will I have to do anything?”</p><p>“Just follow my lead. It’s a great deal like a wedding ceremony. Except for the fact that my wolf might come out. I’ll try to control it, but sometimes during strong emotion...Don’t be frightened by it. My wolf would never hurt you.”</p><p>Nicky blushed. “Never thought I’d be getting married to a man, let alone a wolf.”</p><p>Marco kissed the tip of his nose. “Now be good and rest this afternoon. I’ll be back around six to pick you up.” He slid from the bed, dressed, and then moved to the door. “Be a good boy and don’t go outside the room without me or Rory,” he cautioned. “We’ve had reports of a rogue pack in the area.”</p> <p>“What’s that? Not the Hunters?”</p><p>\"The Hunters? Has Rory been scaring you with that? No, baby, just wolves. Rogues. Rogue packs are undisciplined packs that are wild and rootless. There are a couple in the area we’re concerned about. One group in particular has banded together, and we’re a little worried they might issue a challenge to my authority. They wouldn’t follow our laws. They roam around isolated areas, setting up camp wherever they can. Some of their pets are probably feral, because they’re allowed to run wild. We’re afraid that, with them in our area, these pets may try to hunt humans.”</p><p>Nicky gasped in horror, and Marco crossed back over to him, taking his hand. “Most wolf packs aren’t like that, honey. We’re shapeshifters, yes, but we only hunt animals. If we take a human, it’s for a pet, a mate. Never to kill or hurt them. Do you understand?”</p><p>Nicky nodded quietly.</p><p>“Until the rogue pack is out of the area for sure, I don’t want you anywhere outside. They’d love to get their hands on a pet as beautiful as you, and the leader’s mate, too.”</p><p>“What...what would they do to me?”</p><p>“Sweetheart, they couldn’t hurt you, really, because you’re changed now. Not exactly human anymore. They might try to hold you for ransom though, and use you to get some leverage over me. If they kept you away from me for too long, there’s danger in that too. You could turn so wild I couldn’t bring you back, not to mention the mental anguish it would inflict on me and thereby the entire pack. I don’t want to frighten you, but I want you to be careful. Do you understand why we keep you so close to us?”</p><p>“Tara explained a little to me while she was curling my hair. She said it’s so we don’t become savage.”</p> <p>“Well, yes, there is a great danger in that. Tara is fairly new here, too, and still learning. Her master must have explained it to her very carefully. I’m glad you listened to her. Now, listen to me. Don’t, under any circumstances, go outside while the rogue pack is in the area.”</p><p>“Okay.” Nicky nodded his head dutifully and meant it. He had no qualms about staying inside while monsters roamed the woods.</p><p>Chapter Three</p><p>Rory came for him carrying a piece of white satin. “This is for you, Nicky. Marco wants you to wear it for the ceremony.”</p><p>Nicky took it suspiciously and shook it out. “This is a dress,” he said flatly. “I will not wear a dress.”</p><p>He threw the fabric on the floor and stomped back to the bed to sit down. Rory picked it up and went over to him. “This is not a dress.” Rory sounded indignant. “It’s a traditional robe, and you’ll wear whatever your master asks you to wear and like it. Now put it on or I’ll make you put it on.”</p><p>Nicky flashed a hot look at him. “You wouldn’t dare touch me. I belong to Marco.”</p><p>“Marco sent me to get you. And don’t forget it was me who turned you in the first place. I’ll slap your ass if I have to and explain to Marco later.”</p><p>Nicky jumped to his feet with his hands in fists. “Oh no, you won’t. Just try it, you asshole!” He swung at Rory and missed, falling into Rory’s arms, but he jumped away from him and put up his fists again. “Fight me. Come on, Rory, fight me!”</p><p>The door swung open, and Marco stood framed in the doorway. He took one look at what was going on and crossed the room in two steps, picking Nicky up and throwing him on the bed. “Rory,” he said over his shoulder, not taking his eyes away from Nicky. “I’m very sorry, and so is Nicky, though he’ll be making his own apology soon. Please leave us for now.”</p><p>Nicky sat up in the middle of the bed and watched Marco’s face for any sign of leniency. He knew he’d fucked up and badly. He cleared his throat. “I guess it wouldn’t do any good to say I’m sorry.”</p><p>“Yes, of course it would—if you meant it. I think you’re only sorry you got caught.” “I...uh...I didn’t want to wear the dress. It’s for a girl.”</p><p>“It’s a robe, not a dress. It’s what I want you to wear, and you’ll wear it.”</p><p>“I’m not a damn girl!”</p><p>“You’re anything I say you are. You’ve been without a master for far too long, and now you’re giving in entirely too much to your feral nature. I won’t stand for it.”</p><p>“Don’t make me wear that, Marco.”</p><p>Marco took a deep breath, as if trying to gather himself before speaking again. “Nicky, do you care for me at all?”</p><p>Nicky bit his lip. “You know I do.”</p><p>“Then try harder for me. You’re allowing the wildness in your nature to take over. It’s traditional for all pets to wear the white robe when they go through the mating ceremony. All the pets, including the males. I wasn’t trying to single you out or humiliate you. It means you’re entering into a new life, becoming part of the werekin.”</p><p>“You all keep saying this feral nature is coming out in me, but I don’t feel any different. I don’t know what you’re talking about. Nothing has really changed for me in any way. Well, except for the gay thing.”</p><p>Marco shook his head. “No, Nicky, it’s you. You are changing.”</p><p>“Look, I get angry sometimes and irritated when Rory tries to boss me. That’s not anything new to me. Maybe I do need to clean up my language, especially if it bothers all of you so much, but I can’t stand this walking around on a leash. It’s not this so-called wildness, either. It’s the way I’ve always been. I don’t like people telling me what to do.”</p><p>Looking worried, Marco shook his head. “I know that’s what you believe, but you’re not thinking straight, Nicky. I’ve been feeding you my blood—you haven’t had anything else to eat since you were changed, have you?”</p><p>Nicky looked surprised. “Uh...well, no. I guess not.”</p><p>“Doesn’t that strike you as odd? Doesn’t the fact that you’re drinking my blood seem odder still?”</p><p>Nicky got a stunned expression on his face.</p><p>“Right. You’re not human anymore, baby. Not totally. You have to accept the idea and stop saying nothing has changed. Don’t you see? Everything has changed for you! My blood is supposed to have a calming effect. It should be making you docile and sleepy and easily controlled, but you’ve been anything but easy. You’ve been fighting almost everything and everyone when I’m not around. So far, I’m the only one who can handle you. It shouldn’t be like this, and I’m worried.”</p><p>Nicky grabbed Marco’s arm and held on, his hands shaking. “What’s going to happen to me, Marco? Tara told me about the ones who let their savage nature get the best of them. Am I going to become a monster?”</p><p>“Of course not.” Even though upset with him, Marco put his arms around him comfortingly and kissed his temple.</p><p>“Tara said there was this one guy, and you’re thinking you may have to...to p-put him down.”</p><p>“Don’t even think such a thing! She’s mistaken. We’d never do that. We’re treating him with female hormones to make him less aggressive. As for you, I’m going to keep working with you and stay with you all the time if I have to. If I’m the only one you respond to, then I’ll have to take some time off and take care of you. Feed you more often. Whatever it takes. We’ll get through this together, baby. I promise. There’s a lot more we can do.”</p><p>“Like what?”</p><p>“Training. Understanding what it means to be submissive. Or the hormones, maybe. I’ve seen that work before. But that would only be used as a last resort.”</p><p>“Hormones? Female hormones? Oh my God!” Nicky put his hands over his face and wept. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Stop freaking out. That would only be a last resort, baby. I’ll increase your feedings first and use more restraints. Train you more. Please don’t worry. We’ll work it out. I promised you I’d take care of you, and I meant it. Now get ready and let’s go down to our ceremony. I’ll get a leash. Along with my presence, that should calm you. Please tell me if you start to feel agitated again.”</p><p>Nicky nodded, walked closely behind him to the closet and held stone-still to have his leash attached.</p><p>Nicky looked up at Marco with a frightened gaze. “But what if nothing works, Marco? What if I’m a mistake? What if I can’t be like the others? What if I’m more like that other guy?”</p> <p>“Don’t talk that way, baby. You’re not a mistake! I’d never let anything happen to you. Not ever. If I have to, I’ll take you somewhere and keep you safe. Just you and me. I’d never leave you. I can’t, don’t you see?”</p><p>Nicky stepped up close to him and laid his head on Marco’s chest.</p><p>“Now put on your robe, baby. We have people waiting for us downstairs.”</p><p>Nicky slipped the robe over his head. Marco smiled approvingly and put his arm around his waist. They walked through the door and down the hall toward their mating ceremony.</p><p>Marco led Nicky down the stairs to the group assembled in the large common room. He stopped at the back of the room and unclipped the leash, laying it aside. “Stay back here, Nicky, until I call you forward.”</p> <p>Nicky nodded, unable to raise his head even to look at Marco. He could feel the eyes of everyone on him, singling him out. Embarrassed and humiliated, he desperately wished this whole thing was over, so he could go back upstairs. Hearing a soft whisper beside him, he looked up to see Tara smiling at him from the back row. Seeing her friendly face made him feel a little better, and he raised his gaze to survey the room. Probably about a hundred people were gathered there, both wolves and pets, the pets all dressed in the leather pants. They all looked quite solemn, as befitted the occasion, but whenever he caught someone’s eye, he was rewarded with a friendly smile.</p><p>He looked toward the front as Marco began to speak. For the first time, he noticed Marco was wearing a dark suit and looked very handsome. It occurred to him he’d never before noticed anything Marco was wearing—Marco’s presence was so overwhelming, nothing else mattered. Or was it because, as Marco told him, his mind had been clouded before.</p><p>“I’m here today to introduce my new mate to all of you. Nicky, please come forward.” Marco held out his hand, and Nicky moved toward him like an iron filing to a magnet. When he reached the small dais in the front of the room, Marco gave him his hand and then pulled him to his left side, his arm tightly around him.</p><p>“This is Nicky, and I hold him to my heart in the hope that he will lodge there forever. I pledge to him my love and faith, and my promise to always care for him, always protect him. My soul has found its mate, and I will never forsake him. Even unto death, my heart will follow his.” Marco turned to Nicky, seeming to be in the grips of a strong emotion. His face was flushed and his eyes glittered with tears. He bent down and kissed Nicky tenderly, and then he pulled away and gave Nicky a slight push to move him to the side. Shedding his clothes, he fell down onto his knees. Nicky watched in fascinated horror as his body morphed. He dropped his head, but Nicky could see his face elongating and changing. His arms lengthened and morphed as hair sprang out all over his body. In less than thirty seconds, Marco shifted into a huge silver wolf. He put back his head and howled—an unearthly, strangely human-like sound that chilled Nicky’s blood. He heard answering howls and dragged his gaze away to see wolves shifting all around the room in response to their Alpha’s call.</p><p>Knocked to the floor, Nicky turned his frightened gaze back toward Marco, or what used to be Marco and was now a huge, scary animal. The huge, scary animal jumped on top of him without warning, putting its paws on his chest and lowering its mouth toward his throat. Too scared even to scream, Nicky closed his eyes tightly and waited for death, but instead he felt the wolf lick him from the bottom of his chin to the top of his forehead. Nicky met the wolf’s gaze and saw Marco’s beautiful eyes gazing back at him. He instantly relaxed, knowing in his heart Marco wouldn’t hurt him.</p><p>He heard more howls before Marco leaped away and ran for the door, followed by his wolf pack. Nicky sat up slowly, still feeling stunned. The pets in the room calmly went into action, picking up knocked over chairs and generally straightening up the room as if nothing unusual at all had just occurred. Tara come up beside him and gave him her hand to help him up. He got up off his back and looked at her in wonder.</p> <p>She laughed. “Welcome to the pack, Nicky. Get used to this—it happens from time to time, whenever the wolves get emotionally charged. They’re beautiful, aren’t they?”</p><p>Nicky nodded, having to admit that even though the huge silver wolf frightened him at first, he was one of the most beautiful creatures he’d ever seen, his coat glossy and thick, and his eyes expressive and human-like. He could hear them outside the compound, calling back and forth to each other as they ran through the woods.</p><p>He moved slowly back up the stairs to his room, having to stop along the way for the well wishes and congratulations of the werekin. The room seemed empty without Marco. Nicky slipped off the robe and put it across a chair. Then he slipped out of his pants and lay down on the bed. He lay in the darkening room, listening to the sound of the wolves and waiting for Marco to return, drifting into an exhausted sleep before Marco, not the wolf, slipped into bed with him.</p><p>“Put your legs over my shoulders, darling,” Marco told him. “I want to see your beautiful face when I make love to you.”</p><p>Nicky had barely complied before an already lubed, steel hard cock slipped into him. “By the acts of mating and vows spoken before my pack, you are my mate until death takes us.”</p><p>* * * Waking next morning was difficult. Marco had kept him up half the night making love to him and making him feed until he was sated and almost unconscious with fatigue. By the time he allowed him to rest, his ass ached and burned, his limbs felt like jello, and his mouth was still making sucking motions as he wiggled his ass up into Marco’s crotch and sank down into sleep.</p><p>He awoke to find Marco gone, and Rory sitting in a chair by the window, watching him closely.</p><p>“Hi, Rory,” Nicky said, stretching. “Where’s...uh...my master?”</p> <p>“The council needed him this morning. There have been more sightings of the rogue pack,</p><p>some as close as a mile from the compound. Shawna, the mate of the one we captured, is back in the compound, demanding to see him. Marco is meeting with her.”</p><p>“Oh. Will he be back soon?”</p><p>Rory shrugged. “I’m supposed to babysit you till he gets back.”</p><p>Nicky frowned. “Do you have to use that term?”</p><p>“Yes.”</p><p>“God, Rory, why do you have to be such an asshole?”</p><p>Rory raised his eyebrows. “You really haven’t changed a bit, have you? I’m a wolf—don’t talk to me like that.”</p><p>Nicky sighed. “Whatever.”</p><p>Rory frowned again. “You know Marco is worried sick about you, don’t you? That makes all of us nervous and jumpy. Can’t you even pretend obedience?” His voice grew in volume, and he rose to his feet to stand by the bed, looking down at Nicky, his fists clenched.</p><p>Nicky looked up at him and yawned. “Guess not.”</p><p>Rory slammed his fist into the pillow next to Nicky’s head. Nicky glared at him. “Go ahead. After I break you in half, Marco will take care of the pieces.”</p><p>The door opened, and they both turned tensely to see Tara standing there quietly with her mate, Tristan, behind her, waiting for Rory to invite them in.</p><p>Before Rory could react, Nicky smiled at her. “Hi, Tara, Tristan, come on in. Rory and I were just having a little discussion.”</p><p>Tara glanced up for a moment, surprised, and Tristan glared at him with disapproval. Wolves and pets didn’t have “discussions.” They obeyed without arguments.</p><p>Rory took a deep breath and spoke to them. “Come in, Tristan, and your pet too. What do you need?”</p><p>“Marco sent me to groom Nicky here in the room.” Tara explained. “He said he’d be in restraints most of the day.”</p><p>“He certainly will.” He sent a smoldering look Nicky’s way and pulled cuffs from the bedside table. “Hold your hands out, Nicky.”</p><p>Nicky hesitated a long time, debating if he would accept another humiliation. Fear stole over Rory’s features, igniting fear in Nicky. He held out his hands, and Rory twisted his arms behind him and slipped the cuffs over his wrists, snapping them shut. His hands were now cuffed behind him. Uncomfortable and humiliating, as Nicky supposed was the point.</p><p>Rory turned to Tristan and Tara. “I’m stepping outside for while then. Please call me when you’ve finished with him.”</p><p>“Yes, sir,” she said quietly, eyes downcast.</p><p>Rory went to the door, but couldn’t resist one parting shot before he stepped out into the corridor. “That’s how well behaved pets act, brat. See if you can learn something from her while she’s here.”</p><p>Tristan gave him an equally disapproving look and unclipped Tara’s leash.</p><p>“Don’t pick up any bad habits, Pet.”</p><p>“No, sir.”</p><p>The two masters went out and closed the door firmly behind them.</p><p>As he closed the door, Nicky yelled after them. “Assholes!”</p><p>“Nicky, please!” Tara cast a frightened glance at the closed door. “What if they’d heard you?”</p><p>He sighed and turned his back to hold out his cuffed hands to her. “Unlock me, Tara. The key is in the bedside table. I saw it in there earlier when Marco took out some lubricant.”</p><p>Her eyes grew wide, and she shook her head nervously. “But I’m not supposed to.”</p><p>“Tara, listen to me. Rory’s gone for at least an hour. We can put them back on before either of them returns if you’re scared. Come on.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Hesitating only another few seconds, she went over to the table, retrieved the key, and unlocked his wrist restraints.</p><p>“Thanks, babe. I hate those things. Now what have you come to do to me?”</p><p>Tara smiled. “I just really came for a visit. I heard at the ceremony last night that you were still having some trouble adjusting. I was a little worried.”</p> <p>“So you lied to Tristan and Rory? I love it!”</p><p>Tara blushed and dropped her gaze. “I’m being very wicked. If my master finds out...”</p><p>Nicky smiled and took her hand. “Who’s going to tell him? Certainly not me.” He got out of bed and strode over to lock the door and winked at her. “We’ll just say we have no idea how that got locked.”</p><p>He walked over to the window and looked out at the mountain range. He hadn’t been allowed out yet. All he could tell about the area they were in was that they were very high on a mountain side, judging from the spectacular view from the window, and the compound was surrounded by dark and verdant forest. “It’s beautiful here. I’d like to go outside and look around, but I’m still on house arrest, I guess. Marco ordered me to stay inside while the rogue pack is out there.”</p><p>“Yes, Tristan told me the same thing.”</p> <p>“Who are they, Tara? Do you know?”</p><p>“I’ve heard rumors, you know, nothing really substantial. Some of the mistresses, the female wolves who come to my shop were talking about it yesterday. They said some of them used to be in our pack, but ran away when they couldn’t follow orders.”</p><p>“What kind of orders?”</p><p>Tara blushed again, and lowered her voice. “Well, they didn’t know I could hear them, I guess. They said it was about the pets. A few of the adopted pets couldn’t settle in well, and their masters and mistresses took them and ran, so they wouldn’t be so unhappy.”</p><p>“What?”</p><p>“Yes, and they keep coming around because it’s really hard for them to stay completely away from the pack and the ancestral land. They feel it belongs to them too.”</p> <p>“But I thought all pets had to be controlled or go feral?” A cold doubt took root in Nicky’s chest. “So it’s not just me who has a hard time settling down with this submission thing. There are others too.”</p><p>“Well, a few of the male pets in particular find it difficult.”</p><p>“So they just collar and leash us and tell us to shut the hell up.”</p><p>“Well, they can’t very well let pets go wild, like the rogues want. They may seem okay on the outside, but if their tempers get the best of them they might hurt someone, and this way, at least, they don’t have to put them down for killing some human. Pets who are uncontrolled are unpredictable, you see. Dangerous.”</p><p>“So they don’t even give us a chance? They locked that poor guy up because he refused to be controlled. God, will they do that to me?”</p><p>“Only if you give them a lot of trouble, Nicky, and then Marco would have to agree, and I don’t think he would ever do that. He really loves you. Besides, you’ve only just got here. They would give you much more time to settle in before doing anything so drastic.”</p><p>“Yeah, well, fuck that. I need to get out of here.”</p><p>“But Nicky, you can’t. I explained why. You’re different now. You’re werekin. You have a need to be with the pack, and you have to feed from a wolf. The need can’t be satisfied any other way. And what about Marco?”</p> <p>Nicky put his head in his hands. “Hell, I don’t know. I don’t know! I can’t leave him—I’d be miserable without him. I don’t even think I can live without him now. Damn it!”</p><p>“This is apparently most of the issue with the rogue packs. Their mates can’t or won’t settle for submission, and they can’t live without each other either.”</p><p>“What about this guy you told me about? Marco said they were giving him female hormones.”</p><p>“Yes, a kind of chemical castration, but they’re not working too well. When he escaped, he and his mistress were living with the rogue pack. They say she might be their Alpha. Our wolves have them both back in the pack now—she followed him back when he was captured. But they say she’s miserable, and he’s still really savage, fighting with everybody and everything they’re trying to do for him.” Tara sat up straighter with a sudden thought. “Maybe the rogue pack is here for them. Maybe they’ve come to help them escape again.”</p><p>“Look, I can’t just stand by while the poor guy loses his balls, even figuratively. I couldn’t live with myself. Think we should try to help him escape?”</p><p>“Oh no, Nicky. If they caught us, they’d punish us terribly. I don’t want another spanking. Those things are terrible.”</p><p>Nicky smiled. “Did Tristan really beat you?”</p><p>“Well, it was all on my bottom. He called it a spanking, and then he made love to me right after. I think he kind of liked it.”</p><p>Nicky laughed out loud. “I’ll bet he did.”</p><p>“What about you? Don’t you hate them too?”</p><p>“I’ve never had the pleasure.”</p><p>“What? As bad as you are and Marco hasn’t spanked you yet? He must really spoil you very badly.”</p><p>Nicky smiled again. “I guess he does. I get fucked every chance he gets.” He laughed. “Not that I don’t enjoy it.”</p><p>Tara sighed. “Me too. I love it too. I guess it’s because I love Tristan so much.”</p><p>Nicky leaned forward. “Tell me, Tara, I’ve got to know. Does he have one those gland things on the base of his cock?”</p><p>Tara blushed prettily. “Oh my God, yes, a wolf thing. It almost killed me the first night. We were tied up for over an hour.”</p><p>Nicky laughed. “Us too! Some weird shit, isn’t it?”</p><p>“Yes, but I love him, so I don’t mind. It’s just a part of who he is.”</p><p>They smiled at each other, and Tara got up to go. “My master will be coming for me soon. Let me put your cuffs back on.”</p><p>They’d only just gotten them fastened when the door jiggled, followed by a loud, frenzied knocking. Tara hurried to the door. Rory rushed in, followed closely by Tristan. They, apparently thought Nicky had overpowered Tara, and escaped. Both looked a little chagrined when they saw Nicky sitting docilely on the bed in his cuffs. Tristan snapped Tara’s leash on and led her out without even acknowledging Nicky. Rory, in a sulk, sat down, turned on the television and glanced over at him.</p><p>“I thought she was grooming you. You don’t look any different to me. Still as bratty as ever.”</p><p>Nicky ignored him, quietly watching television and biding his time, refusing to be baited. He had to behave himself if he wanted to talk Marco into letting him have more freedom.</p><p>“Hey, I’m talking to you, brat!” Rory threw a wadded up piece of paper at him, hitting him in the forehead. “Say, ‘yes, sir,’ when I speak to you!”</p><p>“Kiss my ass!”</p><p>Rory shook his head moodily. “I hate sitting in here with you all afternoon. It’s beautiful outside too.” He looked longingly at the window.</p><p>“Then let’s go for a walk,” Nicky suggested.</p><p>“Are you kidding? Marco would kill me for taking you out.”</p><p>“Just to the gardens near the house. You can tell him I begged you to go—he won’t get mad. C’mon, man. Like you said, it’s beautiful outside. I’ll even let you use the leash without a hassle. Anything to get out of here for a few minutes. I’m going stir crazy.”</p><p>“I don’t know,” Rory said, looking longingly out the window. “Marco said to stay inside. The rogue pack has been spotted nearby.”</p><p>“How will he know, Rory? I’m not going to tell him.”</p><p>“Have you forgotten he can read your mind, Nicky? Sense you, anyway. He’d know for sure if we went out.”</p><p>“Not if I jam my signals.”</p><p>“Huh?”</p><p>“I’ll sing in my head or something. That should jam his radar a little. C’mon—just ten minutes. We’ll stretch our legs a little. Get a little sun. What do you say?”</p><p>“Sing in your head, huh? You think that would work?”</p><p>Nicky grinned. “Only one way to find out.”</p><p>Rory smiled back at him, unbending a little. “Okay, let’s go, but if we get in trouble for this, I’m telling Marco you got away from me and ran outside. You really think the singing thing will work?”</p><p>“No, but I guess we’ll find out.”</p><p>Rory muttered some cuss words under his breath.</p><p>Nicky shook his head. “I heard that and back at you. C’mon, let’s go.”</p><p>Rory got his leash and firmly snapped it on, his look daring Nicky to argue. Nicky didn’t argue, keeping his promise, only too happy to be getting out of the room for a while, no matter what. After taking off his cuffs, Rory led him down the stairs and out into the warm, bright sunshine. Rory walked along the trail surrounding the big house, pulling Nicky behind him. As soon as they got out of sight of the windows, Nicky took hold of the leash, stopped walking, and jerked. Rory, strolling ahead and not paying any attention, landed on his butt on the trail. His look of utter surprise made Nicky laugh out of control, holding his sides and falling onto a bench by the side of the trail going through the garden.</p><p>“What the heck did you do that for, brat?” Rory jumped up onto his feet, looking around to make sure no one saw him fall. He was still young enough to be careful of his dignity.</p><p>When Nicky could speak again, he wiped his eyes and pointed at Rory. “You should have seen the look on your face.”</p><p>“Yeah, well, you’re gonna have a look on your face when I bust your ass!”</p><p>Nicky stood up, twirling his leash in front of him. “Bring it on, Rory. Bring it on!”</p><p>Rory stood with clenched fists, his face stormy, when a voice behind them made them both turn around. “Hey, Rory!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They both whirled toward the dark-haired young boy headed toward them. About fifteen years old, he wore the same leather pants as the other pets wore, but no collar and was unattended. He waved a bat, baseball, and glove at Rory as he jogged toward them. “Rory, do you want to play ball? My coach says I can play next week if I can improve my batting. Will you help me?” He ran up next to them and looked Nicky over with interest. “Hi. I’m Adam. You must be Nicky, Marco’s new mate. I’ve heard a lot about you. Gee, you really are as pretty as a girl.”</p><p>“Uh, thanks—I think.” Nicky smiled back at him. “Nice to meet you, Adam.”</p><p>Rory nodded at Adam and back at Nicky. “This is my little brother.”</p> <p>Nicky regarded him with interest. “Really? So, Adam, you’re one of what they call the natural pets?”</p><p>Adam shrugged. “Guess so.” He watched Nicky twirling his leash in his hand. “Are you supposed to be doing that?”</p><p>Rory growled. “No, he’s not. He’s a jerk.”</p><p>Nicky ignored him and stood up. “I’ll play ball with you, Adam. I played some in high school. I warn you, though, I’ve got a mean curve ball.”</p><p>Adam grinned and tossed Nicky the glove and ball. He ran back about twenty feet and took up a batting stance with his bat. Rory shook his head in disapproval as Nicky neatly unclipped the leash and tossed it at him before strolling over to toss the ball to Adam.</p> <p>Nicky pitched the ball to him for the next fifteen minutes, fielding the balls and calling out some tips from time to time. Rory stretched out on the lawn while they played and soon dozed in the sunlight with his mouth open.</p><p>“Okay, Adam, are you ready? Here it comes—my special curve ball.” Nicky wound up and put his best spin on the ball, but instead of sailing over the plate as he’d planned, the ball took a wild turn and shot off into the woods.</p><p>“I’ll get it,” Adam yelled, laughing and ran off into the shadows beneath the trees. Nicky glanced up to see Rory still stretched on his back, sound asleep, expecting to see Adam running back. There was no sign of him.</p><p>“Adam?” he yelled. “Can’t you find it?”</p><p>No answer came from the shadowy woods, and unease swept over Nicky. He could sense movement in the shadows just beyond where the path disappeared in the pine trees even if he couldn’t see it. He walked up closer, anxious and about to call for Rory when a burly arm shot out of the shadows. A hand clamped over his mouth, and the arm clutching him around the waist dragged him into the dimness of the trees.</p><p>Chapter Four</p> <p>Nicky decided they were definitely in some deep shit. He had no idea who these guys were, but he suspected they were wolves from the look of them, maybe some of the rogues. The two men who kidnapped him and Adam were moving fast down the trail, despite carrying Nicky and Adam over their shoulders. A damned uncomfortable way to travel, bumped and bounced along on the biggest one’s shoulder. Nicky’s hands were tied behind him, and they’d stuffed a rag in his mouth, so he couldn’t even yell. All he could do was jolt along on the guy’s shoulder and try to keep an eye on Adam behind him. Adam was also tossed over the shoulder of the young, good looking man jogging along behind him. He didn’t struggle as Nicky did, or at least it didn’t seem that way from Nicky’s vantage point. Maybe it was true that the natural born pets were more docile.</p><p>Nicky struggled so much at first it took both men to tie him up, and the big one who carried him had actually slapped his face a few times, drawing some blood on his lips. He could taste it, seeping around the cloth in his mouth. He hoped the bastard hadn’t knocked a tooth loose. He concentrated on calling out for Marco in his mind, not knowing if Marco could sense him at a distance or not. He knew they needed some help and fast. Nicky hadn’t liked the look in the biggest guy’s eye when he finally picked him up and slung him over his shoulder. He had a feeling he was about to get fucked again in the very near future if somebody didn’t intervene.</p><p>“Aaron, hold up,” the younger one in back called out. “Let’s rest for a few minutes.” The big one turned, giving Nicky a view of the trail in front of them for the first time. Not that he had any idea where they were. Wherever it was, the brush was thick, and the trail practically nonexistent. He shifted his aching stomach a little and got a hard slap on the ass for his troubles.</p><p>“We’re still too close, Cody. Two as young and pretty as these will have wolves looking for them soon. It was sheer luck they were so unprotected when we found them. This one here,” he paused and slapped Nicky’s ass again. “This one will be worth a pretty penny. No, we gotta keep moving.”</p><p>He turned and returned to a tireless jogging. These men had to be wolves. They were so large and strong. They traveled along for at least a couple more miles, and Nicky despaired of Marco finding them. True, the men couldn’t travel as fast burdened down by Adam and Nicky, but what if Rory hadn’t woken up right away? What if he was still lying on the grass snoring and no one knew they were missing?</p><p>From somewhere far away, Nicky detected a delicious odor. Marco! Nicky bucked his hips wildly, trying to get the big one to stop. He ignored him, breaking into a faster trot, as if he smelled it too, bouncing Nicky up and down even harder.</p><p>Nicky grunted in pain as the guy’s shoulder came in contact with the soft parts of his abdomen, making it harder to catch his breath. Suddenly from behind him, he heard a loud howl. The men heard it too. He was tossed down on the trail, landing with a hard thud on his stomach. Facedown and trussed up as he was, he could hardly see a thing. He lay for a moment, stunned, as he heard the two men’s panicked yelling at each other. The big man hauled him back up into his arms, producing a knife and holding the sharp blade at Nicky’s throat, with good reason. The trail and the forest beside it bristled with wolves of every shape and size, a big silver one right up front, flanked by a smaller one covered in black fur.</p><p>The sharp blade pricked against his throat and he stopped struggling. Getting his throat cut was getting monotonous, and he wasn’t a big fan.</p> <p>Aaron, the one with the knife, yelled at the wolves. “Come any closer and I’ll slit his pretty little throat.”</p><p>The wolves yipped and howled, and the big silver one shifted right in front of him. Of course, it was Marco. He was huge, naked and dangerous in his fury. Both hands in fists, he snarled out three words between his clenched teeth. “Let him go!”</p><p>“Now I don’t think I can do that, Wolf. If I do, I have a feeling you’re going to go for my throat. What do you say we make a deal?”</p><p>Marco growled low in his throat with the other wolves circling around them.</p><p>“Don’t come any closer—I’ll kill him.”</p><p>Marco, ready to lunge, was anxious, shifting tensely from foot to foot. Nicky feared Marco wouldn’t be able to hold himself back, and he would suffer the consequences when the big dude let his knife slip. He’d better do something fast to end this. Two things happened simultaneously. Nicky stomped down on Aaron’s instep as hard as he could, and dropped. He made himself go limp, sagging down in a heap and pulling the big man off balance. The man fell on top of him and, incredibly, never dropped the knife. They fell together, still struggling. The man shifted his hand to catch Nicky around the waist, the point of the knife piercing his leather pants and puncturing his abdomen near his groin. Things happened quickly after that.</p><p>Aaron was torn away from him. One minute the man gripped him as they rolled to the ground, and the next he dragged Nicky a foot off the ground before his hold slipped and he was tossed through the air, landing an incredible ten yards away. Marco and the other wolves hauled Nicky to his feet, pulling the cloth from his mouth. Several hands patted at him, trying to discover any wounds. All the while Nicky could hear the sounds of a vicious struggle taking place nearby. Snarling and growling, punctuated by loud yells and screams for help came from right next to him, but too many people and wolves were in the way for him to see anything.</p><p>Not in pain, though he could feel the blood slipping down his thigh under his pants, Nicky was jerked around and stumbled. Marco put his face up next to his. “Why did you run away from me? What did you think you were doing?”</p><p>Nicky couldn’t quite understand what Marco said. Run away?</p><p>Marco shook him until his teeth rattled and then held him out at arm’s length again. “Tell me! Why did you run away? I’m going to beat you for this, Nicky! I swear to God you won’t sit down for a week!”</p><p>“I-I...”</p><p>Marco shook him again, viciously upset and not realizing his own strength. Nicky’s head rocked back and forth violently. Things spun around dangerously, and then his knees refused to hold him up any longer. He sagged down a little. If he could only sit down for a minute. His knees gave away, and Marco caught him in his arms. Nicky winced in pain as Marco’s hand grazed his wound, making him catch his breath. Marco lowered him to the ground and shoved down his pants, gasping when he found the deep wound still oozing bright blood. Marco put his mouth over the wound and bit down. Nicky fainted.</p><p>* * * He awoke back in his own dark, quiet room, in bed. He had a slight headache, and his side stung horribly, but he felt surprisingly good, considering all that had happened. Marco lay beside him and came instantly awake when he stirred. He propped up on one hand and gazed down at him with worry.</p><p>“Are you all right, honey? I’m sorry if I hurt you. I shouldn’t have put hands on you so soon after shifting and running after that asshole.”</p><p>“I think I’m okay. A little sore.” His hand strayed down to his side.</p><p>“It’s healed over. I took care of it, but it might be a little sore for a while.” He looked down at Nicky, his expression serious. “What if I hadn’t been able to get to you in time, Nicky? What if he’d had time to get you back to his camp? He meant to ransom you and Adam, but not before he’d had his way with both of you.”</p><p>“Had his way with us? Damn, I mean, dang, Marco, it sounds like an old, very bad movie.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Make no mistake, Nicky, he meant you harm. Why, baby? Why did you run away from me? I was hoping...I thought you were falling in love with me and settling in.” Marco continued to stare into his eyes, but they shifted away a little with the last sentence, as if he were embarrassed to show he cared so much.</p><p>“I am in love with you, Marco. I didn’t run away. What makes you keep saying that?”</p><p>Marco narrowed his gaze. “You mean you didn’t get away from Rory and run into the woods?”</p> <p>Nicky began to understand. Rory had lied just as he said he would to keep Marco’s wrath off himself and put the blame squarely on Nicky’s shoulders. He opened his mouth to set the record straight but hesitated. Maybe he could work this to his advantage. Having Rory in his debt might be useful in the future. “Oh, well, not really. I mean, I was playing ball with Adam, and he went to the woods to look for a ball. I went to look for him, and those guys were there. I fought them. See?” He pointed out the cuts on his lips. “They hit me to keep me quiet.”</p><p>Marco leaned down and licked the cuts slowly and sensuously, the feeling going straight to Nicky’s cock. He moaned and held his lips for a kiss, but Marco leaned back, stroking his fingers down Nicky’s chest.</p><p>“You haven’t explained why you were outside away from Rory to start with. After I told you not to even go out because of rogues in the area.”</p><p>“Oh, well, I just wanted to go for a walk in the gardens. Then we ran into Adam, and...” He looked up into Marco’s eyes. “I was only having some fun.”</p><p>Marco sighed. “I want you to enjoy yourself, baby, but when I give you an order, it’s for a good reason. My job is to keep you safe. I should punish you for not following my orders.”</p> <p>Nicky bit his bottom lip and looked up at Marco, fluttering his eyelashes a bit. Marco smiled and leaned over to kiss him again, taking his time with it, sweeping over his lips with his tongue, and swirling it inside his mouth, leaving Nicky panting for breath. “I won’t though, because you’ve been hurt.”</p><p>“Thank you, Marco.” Nicky tried his best to sound humble.</p><p>“Until tomorrow,” he said, grinning down at him. “Tomorrow, you’re mine.”</p><p>“Uhh...what does that mean?”</p><p>He smiled. “You’ll see. Get some sleep, baby. You might need it.” He dropped one more kiss on his forehead and lay back down, pulling Nicky close and wrapping him in his arms.</p><p>“Well, what do you mean, Marco? Aren’t you going to tell me? You can’t just go to sleep.”</p> <p>“Hush. We’re both going to sleep. We’ll talk tomorrow.” Marco closed his eyes and squeezed him gently, absolutely refusing to say another word. Nicky knew from experience all he could do was shut up and go to sleep. He sighed and snuggled back into Marco’s groin trying not to think about Marco’s threats about tomorrow.</p><p>* * * The next morning when Nicky awoke alone and naked in bed. He stretched luxuriously, rolled over and saw Rory sitting sullenly by the side of the bed, staring at him.</p><p>Nicky jumped, startled. “What the hell?” He pulled the sheet more securely over him. “How long have you been sitting there?”</p><p>“Too long. Marco has put me on babysitting duty again because of yesterday. Believe me, I’m no happier about it than you are.”</p><p>“You lied to Marco yesterday.”</p><p>Rory flushed. “Yeah. Sorry. It would take a lot braver wolf than me to tell Marco I was careless enough to go to sleep when I should have been watching you and Adam.” He shifted around nervously in his chair. “I’ve never seen him like that before. When he caught the scent of the Ridge Clan along with yours and Adam’s...let’s just say I was glad it wasn’t me he was hunting down.”</p><p>“Is that who they were? Ridge Clan—what is that?”</p><p>“It’s another family of wolves. They live in the area, fairly close by, but the Mountain pack has always been at odds with them. We’re pretty sure that’s who they were. Shawna, one of our wolves from the rogue pack—you know who I mean?”</p> <p>Nicky nodded impatiently.</p><p>“Well, she said it wasn’t any of the rogues. So we think it had to be some of the Ridge Clan messing with us, trying to start something. Or maybe they just thought they could get some ransom money.”</p><p>“I heard them mention ransom.”</p><p>“You did? That must have been some of their wolves then. The younger one, the one who had Adam, threw him at us and ran. We lost him in the forest. The other one, the one who had you, is dead.”</p><p>“What?”</p><p>Rory shrugged. “He hit you, held a knife to your throat, planned on raping you. My brother heard him say so. What do you think?”</p><p>“Marco k-killed him? Because of me?”</p><p>Nicky shrugged, embarrassed. “No, Marco didn’t kill him. I did.”</p><p>Nicky raised his eyebrows. “You!”</p><p>Rory flushed. “Yeah, me. They took you and my little brother—I was angry. You were both my responsibility, and I didn’t protect you. I didn’t exactly mean to kill him, but he tried to use the knife on me too.”</p><p>Nicky was very quiet for a moment, before Rory smiled gently. “Thank you, Nicky.”</p><p>Nicky’s skin colored, and he shrugged again, embarrassed at the attention. “Did Marco sense me? Is that how he knew where to find us?”</p><p>“Yes. He senses you pretty strongly, Nicky. He knows everything you do.”</p><p>“Everything? But last night, he thought I was running away.”</p><p>“Nah. Only for a little while when I first told him you were gone. He was so upset he wasn’t thinking straight.” He shrugged. “Last night he was probably seeing if you’d be honest with him about the whole thing. He’d already figured it out by then and tore me a new asshole.”</p><p>“I didn’t exactly lie, but he did say something about training me tonight.”</p><p>“I’m sorry, Nicky. I should never have taken you outside. Then to fall asleep when I was supposed to be watching you was really stupid. You could have been badly hurt.”</p><p>His apology was so sincere, Nicky was a little touched by it. Maybe Tara was right. The wolves did seem to care a lot for their safety. “Thanks, Rory. It was mostly my fault for talking you into it.”</p><p>“I’m glad you feel that way, brat, ‘cause I gotta put you in lockdown all day.” “Huh?”</p><p>“Marco’s orders. He thinks extra restraints might help calm you some. He ordered me to cuff you to the bed all day.”</p><p>“What? Fuck that!”</p><p>“Cussing again, too. He doesn’t like that.” Rory stood up and pulled the cuffs from his pocket, advancing on the bed.</p><p>After a brief but violent struggle, Nicky was cuffed to the bed and spitting curses. Rory kept calm throughout the tussle and never lost his temper. Nicky was impressed despite his anger. Rory was becoming a more dominant wolf every day, and Nicky was surprised at his strength. He sat with him until early afternoon, uncuffing him only to go to the bathroom and eat lunch. Nicky hated every moment of it.</p><p>Marco didn’t return until around three o’clock and immediately came over to let him out of the cuffs. “Has he been in these all day?” he asked sharply.</p><p>Rory lowered his eyes. “Yes, just like you told me.”</p><p>“Good.” He chafed Nicky’s wrists and kissed his forehead. “I’m sorry, Nicky. We restrain our pets to help them adjust. I know you hate it, but it’s necessary. You’re way too rebellious, and I have to take steps to control you. I can’t let your feral nature take over.”</p><p>Rory went to the door. “Well, if you don’t need me anymore, I’ll get going.” He left before Marco could say another word.</p><p>“I’m still angry with him for his terrible lack of judgment yesterday.”</p><p>Nicky stayed quiet, still seething over being locked in cuffs all day.</p><p>“How are you feeling? Any calmer?”</p><p>Nicky wanted to be sullen, but Marco looked so worried, he wanted to make him feel better. He lied to him. “Yeah, I’m fine.”</p><p>“Are you sure? I’m picking up some untruthfulness in your thoughts.”</p><p>“I don’t like all this, Marco. I feel like I’m in prison. Maybe this was all a mistake. Maybe I’m the wrong kind of person for this to work.”</p><p>“Don’t say that, Nicky. You’re perfect. I just haven’t had the time to properly train you.” “I’m not a dog.”</p><p>“I never said you were.” Marco’s tone was amazed. Nicky could see he had no idea how demeaning all this was for him.</p><p>“I’m not a submissive.”</p><p>“Oh, but you are, darling. You just don’t know it yet. Would you like me to show you?”</p><p>Nicky squirmed a little on the bed. “No, I don’t think so.”</p><p>“Scared?”</p><p>Nicky kept his head down, refusing to make eye contact. The conversation was making him nervous. Marco put a knuckle under his chin. “Answer me.”</p><p>“Maybe a little.”</p><p>“Do you trust me, Nicky?”</p><p>“Yes, but...”</p><p>“All you have to do is say stop, and I will. I love you, and I want to show you how happy being submissive could make you, how good I can make you feel if you give yourself to me.”</p><p>There was no use in resisting. He’d do anything Marco asked. Nicky stared into his eyes. “All right.”</p><p>Smiling, Marco kissed him lightly on the lips. “Lie on your back with your arms over your head.”</p><p>“Now?”</p><p>“No time like the present.”</p><p>Marco stripped off his clothing and stood by the bed, gloriously naked. He pulled the sheet off Nicky and surveyed him from head to toe. “If you want to stop at any time, simply say so.”</p><p>Nicky took a deep breath and nodded. He trusted Marco with his life. If he pushed him beyond what he thought he could stand, he’d tell him to stop. The thought calmed the knot of fear in his stomach. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Is that a yes?”</p><p>“Yes,” Nicky said, trying to appear composed and calm.</p><p>“I’m going to tie your hands to the bedposts. After I tie you to the bed, I’m going to suck your beautiful cock.”</p><p>Nicky’s attention was drawn to Marco’s sensuous mouth, those full, soft lips. They felt so wonderful on his cock. His cock certainly liked the idea, sitting up and paying immediate attention.</p><p>“Now, let’s get you tied to the bed.” Marco pulled a length of leather strap from the drawer beside the bed. The mattress dipped down as Marco put his weight on it, rolling Nicky toward him slightly. Nicky held himself back from taking tastes and licks while Marco tied each wrist to a bedpost. With Nicky bound, Marco bent, and softly kissed Nicky’s lips. He straddled Nicky’s legs and moved down to his where his cock anxiously waited. Soft lips slid up and down, the heavy wet suction teasing an orgasm from Nicky’s balls. Marco spent a long time moving up and down, taking Nicky far back in his throat, and using his tongue to lick the underside as he made his upward slide. When Nicky thought he was about to come, Marco pulled free with an abrupt sucking sound. Cool air brushed across Nicky’s aching erection.</p><p>“No, Marco, more.”</p><p>“No, baby.” His gaze was heavy-lidded, dark with desire. “Legs up.”</p><p>Nicky drew up his knees toward his chest. Marco pulled out a longer piece of leather. He looped it under Nicky’s knees and tied both ends to the head board behind him. Nicky had never felt so vulnerable before, his hands tethered securely and his legs tied so his ass was up in the air. He whimpered in uneasiness, but Marco soothed him, caressing his legs and whispering sweet love words to him. He put some oil on his fingertips and eased one digit inside Nicky. Nicky bore down hard on the finger, remembering the fullness of Marco’s cock buried inside him, desperate to be filled again.</p><p>Marco reached into the drawer one more time and pulled out a hard, rubber dildo. He slicked it with oil and pressed it gently against Nicky’s hole.</p><p>Nicky shifted uneasily. “No, Marco. I don’t think...”</p><p>“Hush baby, I’m going to be gentle with you. Relax and let it in. It’ll feel good, sweetheart. You’ll enjoy it. We both will.”</p><p>Nicky tried to relax and Marco gently eased the hard rubber inside him. “Push out against it, honey. That’s right.” Finally, the tight ring of muscles relaxed, and the dildo slipped all the way in. The width of it was much like Marco’s, filling and stretching him. Nicky drew in a deep breath. “Oh!” The tip pressed against his prostate.</p><p>Marco waggled the end of it just a bit at the same time he bent over to enclose Nicky’s shaft with his hot mouth, working the dildo in his ass and his mouth over Nicky’s cock in unison. Nicky’s climax was nearly at the breaking point. Bucking his hips to push himself over the edge, he yelled out his pleasure. Immediately, Marco put his hand in a tight ring around the base of Nicky’s cock, effectively stopping his orgasm before it barely began, causing him to groan and plead, shudders still racking his body. Marco held the dildo very still, his thumb and forefinger tightly around Nicky’s cock until he began to settle down. Then he slowly drew it out, causing Nicky to cry out. “No, no. I need...”</p><p>“Shh...I know what you need.”</p><p>He untied the strap around Nicky’s knees and pulled his legs around his own hips, fitting his cock neatly up into Nicky’s aching opening. The blessed warmth filled and soothed him as Marco bent to kiss his lips and took hold of his cock. Moving his hand quickly up and down, at the same time Marco pumped his hips, ramming his cock deep into Nicky. In moments, Nicky came explosively, so hard it was painful, completely draining and depleting him. Marco came a moment afterward and fell down beside him, panting. He untied Nicky’s hands and pulled him into his arms, holding and soothing him as the shudders still occasionally swept over his body.</p><p>Marco held him in his arms for over a quarter of an hour, soothing and loving him. “Now do you understand what it means to submit? You’re allowing me to pleasure you and pleasure myself at the same time. It’s difficult to give yourself over to another man and let him completely own you. It takes a special kind of strong will and a great deal of trust. It’s the most intimate type of relationship, I think, requiring complete commitment on both sides. You give me the control, and I commit to taking care of your every need and dedicate myself to you totally. Do you want that for us, Nicky?”</p><p>Nicky thought about it for a moment. Yes, he wanted that kind of commitment, it was the whole submissive thing when they weren’t in bed that he had trouble with. Wanting to totally own and be owned by Marco won out against his qualms. “Yes, I do.”</p><p>Marco smiled and pulled him close again. They lay in each other’s arms and slept until it was time to go to supper.</p><p>When they woke and got dressed to go downstairs, Nicky broached the subject again of going outside. “Can I talk you into letting me go outside with you? I see how beautiful it is here from the window, and I’d love to be outside for a while. Maybe it would be okay if you take me?”</p><p>“You didn’t get enough yesterday?” He sighed. “Well, I guess that can be arranged. We can go for a walk now, if you want to, before supper. Will an hour or so be enough?”</p><p>“Perfect.”</p><p>Marco smiled down at him, his head cocked to the side as if listening. Nicky tried to make his mind as blank as possible not knowing if it worked or not. Marco moved away without any comment to give him a clue.</p> <p>Changed for walking in the woods, he said, “I’m taking you to a meal tonight, baby. I think you need some real food for a change and not just my blood. You’ve been very good today, haven’t you?”</p><p>“Yes, sir.”</p><p>“Okay, let’s go for our walk. You’re right, you do need some exercise. Then we’ll come back here and have dinner. Sound good?”</p><p>“Very good.”</p><p>Marco turned to regard him while he changed his shoes. “Are you sure you’re okay, baby? You seem kind of subdued.”</p><p>“Isn’t that what you want, sir?”</p><p>Marco looked surprised. “Uh, yeah, of course. It’s just that it doesn’t seem like you, honey. I kind of miss the little brat.”</p><p>“Do I displease you, sir?”</p><p>“No, no, of course not. I’m sorry, baby. I don’t mean to confuse you.”</p><p>Nicky dropped his eyes, saying nothing, trying to keep his mind blank.</p><p>“Okay, well, are you ready? Put on your shoes and a light jacket. It’s getting cooler outside.”</p><p>“Yes, sir.” Nicky got up dutifully and went to the closet to get ready, then crossed back over to Marco’s side, waiting for the leash to be snapped on.</p><p>Marco put his arm around him instead, and they walked out into the waning sunlight and the cool mountain air. Taking Nicky by the hand, he led him down a winding path through the woods to a small lake. The afternoon sunlight shimmered across the surface like a scattering of diamonds. The mountains of the Blue Ridge rose just beyond, the haze in the air causing them to take on their characteristic hue. Wispy clouds rose up from the hollows, looking like smoke.</p><p>The sweet-smelling air was cool after being inside for so long, and Nicky shivered a bit in the breeze. Marco slipped his arm around him again. “Cold, baby? We can go back if you like.”</p><p>“I’m fine, sir.”</p><p>“Okay, you’re beginning to sound like a Stepford Wife, and it’s creeping me out.”</p><p>“Don’t you want me to be docile and good?”</p><p>“Yeah, but not like this. I want my Nicky back.” He turned and put his arms around his waist, bending his head to take Nicky’s lips. He swept his tongue inside Nicky’s mouth and nibbled on his bottom lip. Moving his hand down inside the waistband of his pants, he took hold of Nicky’s willing cock and rubbed his thumb gently over the tip. “This is mine, isn’t it, baby?”</p><p>“Yes, sir!” Nicky sighed.</p><p>Marco moved his other hand around to the cleft in Nicky’s ass and moved his hand slowly up and down it. “And this? This is mine too, right?”</p><p>“Uh-huh.”</p><p>Marco looked around and saw a secluded area nearby behind some bushes. He drew Nicky over toward it. “Then come and tell me all about it.”</p><p>When he reached the spot, Marco tugged down his jeans and sat down on the soft carpet of pine needles, guiding Nicky in front of him. He quickly dispensed with Nicky’s pants and spit onto his hands and then turned Nicky around to spread the moisture on his hole. Pulling him onto his lap, he impaled him on his dick. Nicky gasped at the sudden burning pain, but soon the pain turned to pleasure as Marco bounced him up and down on his cock.</p><p>“Tell me how much you love me, baby.”</p><p>“So much...”</p><p>“Say it!”</p><p>“Oh, I love you, I love you.”</p><p>“I love you too, darling.”</p><p>“Marco,” Nicky breathed. Then for several minutes, it was impossible for him to do more than moan as Marco’s hips flexed, drawing in and out at the same time he moved Nicky up and down on his shaft. Each breath Nicky took made him tremble harder, and his heart raced so fast he thought he might pass out.</p><p>“Look at me, baby.”</p><p>Nicky turned his eyes toward him over his shoulder and met his beautiful gaze. Marco stilled his hands so Nicky settled down on his cock, leaning back against his shoulder, his hole rubbing up against the large gland on the base. His butt twitched and contracted around Marco’s large cock as he tried to control his breathing.</p><p>“When we’re alone, I want you, only you, my Nicky. Do you understand?”</p><p>“Yes, yes, darling.”</p><p>“Good. I’ll be very cross with you if you don’t call me that when we’re intimate, understand?”</p><p>“Yes, darling.” Nicky smiled.</p><p>He moved him up and down again, and the pleasure doubled and redoubled inside Nicky until he thought he might explode. “Need, need it faster, please, Marco,” he cried, moving himself, bouncing his body and jerking his hips, ramming the stiff cock in deeper and harder. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco’s hands closed, one around Nicky’s cock, the other squeezing his balls, sending Nicky over the edge, his cum erupting in thick spurts, arching in the air. Marco followed him seconds later, shooting so much sperm inside him, it leaked back out onto his lap.</p><p>Little by little, Nicky came back to himself, slumped tiredly on Marco’s lap, still impaled on Marco’s softening cock until Marco lifted Nicky off him. Settling Nicky beside him on the ground, Marco leaned over and took his lips again, sighing softly. “I love you so much, baby. Do you have any idea how much?”</p><p>Nicky gurgled an exhausted little laugh. “Well, you can show me again if you give me a minute.”</p> <p>Marco laughed and pulled him close, wrapping his arms more tightly around him so he wouldn’t get chilled. After a few minutes, Nicky spoke again. “You know, Tara told me I was spoiled.”</p><p>“Oh really? And how would she know that?”</p><p>“Because she gets spankings all the time and I never get any. She said I was much worse than she was.”</p><p>Marco chuckled. “Well, I’m sure she’s right about that. So maybe I do spoil my baby too much. Maybe I should give some thought to regular spankings for you, just to keep you in line.”</p><p>“Oh no, that’s okay. I don’t want any. I just wondered if you spoiled me because you love me so much.”</p> <p>“Oh really? Well, what do you think?”</p><p>“I think you’re pretty crazy about me.”</p><p>Marco laughed and pulled him into another embrace. “I think you’re right.”</p><p>He kissed Nicky for a long time, and Nicky soon lost himself in his lovemaking, but a sudden noise in the woods behind them made Marco break away and jump up, growling deep in his chest. He pulled Nicky up behind him, backing away toward the compound. Frightened by his behavior, Nicky clung to his arm. The growls kept coming from his Alpha as he moved his mate to safety.</p><p>When they got farther away from the woods, Marco picked Nicky up and ran with him, his strength amazing Nicky. When he got to the door of the compound, he turned and set him down, punching in a code on the alarm by the door. Nicky didn’t exactly know what was going on.</p><p>Marco leaned down to soothe him. “You’re all right, baby. You’re safe now, and nothing will harm you.”</p> <p>“But what was it? What alarmed you so?”</p><p>“The rogues were near us just now. Snooping around us—probably trying to get a good look at you.” Another deep growl ground up from his chest, and his grip tightened painfully on Nicky’s arms.</p><p>“Ow, Marco, you’re hurting me.”</p><p>Instantly Marco released some of the pressure, but didn’t take away his hands. Other wolves were flooding the corridor by the doorway and spilling outside beside them, firing questions in alarm.</p><p>Keeping one arm tightly around Nicky, Marco turned to face them. “The rogues were just outside, after my mate.”</p><p>Harsh sounds of growling and outrage resulted with one or two of the younger wolves actually howling in anger. Marco pushed Nicky to one of the men Nicky had learned recently was his beta wolf. “Take him upstairs and to my rooms immediately. Post guards at the doors and windows.” He dropped a kiss on Nicky’s lips, then turned quickly to the other wolves. “Shift and hunt them down!”</p><p>Nicky watched in fascination and a bit of horror as the men pulled off their clothes in a frenzy, throwing them all over the corridor. They dropped to their knees in front of him and quickly began to shift into huge wolves. His eyes were glued to Marco, his Alpha, the biggest of all of them, a beautiful silver gray wolf with burning eyes. Snarling and shoving each other, they rushed out into the night. Nicky stood silently, upset and frightened by the frenzied anger of his Alpha.</p><p>The beta wolf, whose name Nicky remembered was Ian, took him by the arm and led him upstairs quickly. Two more wolves fell in behind them as they walked up the stairs, and when they reached the room they put him firmly on the bed and stood around him, guarding him. Two others came in and stood by the window, looking out into the darkness.</p> <p>Nicky trembled and whimpered. Right away, Ian bent down to reassure him. “No harm will come to you, Pet. We’d give our lives to protect you.”</p><p>Nicky didn’t bother to tell him he wasn’t frightened for himself, but for Marco. The look on the Alpha’s face had been vicious and terrible. He was afraid he’d get in a fight of some kind and be injured. Or even be killed. The thought of Marco being killed, lying cold and still somewhere out there made him burst into racking sobs he couldn’t control. The wolves standing around him had no idea what to do with him. They took turns patting his shoulder, careful to barely touch him only with their fingertips.</p><p>Relief didn’t come until he sensed Marco close by. He could smell his distinctive caramel cream smell an instant before Marco came in the door and looked horrified to see the condition of his mate, curled up in a miserable ball, racked with shuddering sobs. “What’s happened?” he shouted. “What have you done to him?”</p><p>He gathered Nicky into his lap, and Nicky curled up around him still shaking badly.</p><p>“Nothing, sir! I swear it! He just started shaking and crying and none of us could calm him.”</p><p>“Leave us!” Marco yelled, and the room cleared quickly.</p><p>Marco held Nicky tightly in his arms, rocking him gently back and forth until he finally quieted. “Are you feeling better, sweetheart?”</p><p>“Y-yes,” Nicky gasped. “I’m so sorry and embarrassed. I never used to be like this. So, so damn needy and girly. I can’t remember crying since I was a little kid. What’s happening to me, Marco?”</p><p>“Maybe I’ve been over feeding you, honey. I’ve been trying to calm you, but perhaps I’m trying too hard, too soon. My blood is nourishing for you, but it makes you nervous without me and scared to be away from me. I guess I need to just back off a little.”</p><p>“I was terrified that something happened to you. I couldn’t stand it if anything happened to you.”</p><p>“I know, sweetheart, that’s why I reacted so strongly too. The idea of the rogues taking you away from me enraged me. I shifted in front of you, didn’t I?”</p><p>“Yes, only the second time I’ve really seen you do it. It happened at the wedding ceremony like you said it might.”</p><p>“I hope it didn’t frighten you too badly tonight. Is that why you were crying so?”</p><p>“No, not at all. I thought it was amazing to watch you shift. You’re so handsome even as a wolf. I was only afraid for you.”</p><p>Marco laughed and kissed him. “So sweet. You’ve had quite a night. I’m going to take you to bed.”</p><p>“Okay,” he said eagerly.</p><p>“Not so fast, baby. I meant to sleep. We’ve had enough excitement for one night.”</p><p>Marco picked up a disappointed Nicky and put him carefully under the covers. “Sleep tight, baby. I have to go back out to speak to the men for a few minutes, and I’ll be right back. Will you be all right?”</p><p>Nicky nodded, already feeling sleepy. Despite his eagerness for more sex, he was exhausted. He was almost asleep before Marco left the room.</p><p>Chapter Five</p><p>A strong hand took him by the throat and held on tightly, choking him. Nicky sputtered awake with a start, his arms flailing. A big hand clamped over his mouth.</p><p>“Grab his arms—he’s fighting me. Watch out, he’s kicking.”</p><p>Nicky was fighting his unknown assailants with everything he had. Fear clutched at him as he realized no one but rogues would dare lay violent hands on the Alpha’s mate. Hands all over him held him down and wrapped cords around his limbs. Another damn rag was stuffed in his mouth, and one of the dark figures threw him over his shoulder, taking him to the window.</p><p>“Hand him to me—I’ll take him.” A hoarse voice whispered below him, and Nicky was lowered down to someone on the ground. Cold and naked, he dropped the last few feet, but ready hands caught him, preventing him from injury. Several dark figures gathered around him in the bright moonlight, lifted him up and ran. Nicky bucked his hips and struggled violently.</p><p>Looking back as they entered the woods, a window lit up, spilling golden light out onto the ground below. A loud roar of rage came clearly from inside. Marco!</p><p>One of the wolves yelled back up at the window. “If you follow, we’ll kill him!”</p><p>Trying to scream Marco’s name around the rag stuffed in his mouth, Nicky’s frantic efforts to wrestle free of the hands doubled until a sudden blow behind his ear knocked him to the ground. He heard an unearthly howl of anguish and outrage before another blow put out all the lights.</p><p>When he awakened, it was daylight. He was tied up in a bed of some sort, and furs tumbled on the bed over him keeping him warm. He tried to sit up and heard a voice from across the room.</p><p>“He’s awake.”</p><p>“Thank God. I thought you might have really hurt him. Why on earth did you have to hit him so hard?”</p><p>“I don’t know; I just panicked. I heard Marco’s howl from the window, and he sounded so close and so furious. I just wanted to get out of there fast. When Marco started to leap out that window, I knew we couldn’t escape if he could hone in on him. The threat to kill his mate was enough to buy us a little time.”</p><p>“If you’d seriously hurt or killed his mate, he’d hunt us all down one by one. There’d never be peace between us. As it is, I can feel his outrage and his pain. It’s very upsetting.”</p><p>Nicky lay silently, unable to see who was speaking over the thick jumble of furs until a dark-haired woman appeared in his field of vision. He looked up at her curiously. She actually smiled at him.</p><p>“My name is Shawna. I understand your name is Nicky. Is that right?”</p><p>He nodded warily.</p><p>“No one is going to hurt you, Nicky. One of the younger members of our pack panicked last night and hit you to keep you quiet, forgetting his own strength. I’m so sorry.”</p><p>Nicky cleared his throat. “Why-why have you taken me like this?”</p><p>“Because you’re Marco’s new mate, and rumor has it he’s pretty much obsessed with you. Blood mates, right?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes.”</p><p>“That would explain it. Since we took you last night, there’s been great unrest in the pack. Even this far away we can sense the vibrations. He must be very distraught.”</p><p>Nicky whimpered, uneasy at the idea of Marco being upset. Shawna looked at him strangely. “You feel it too, don’t you?”</p> <p>Nicky nodded miserably.</p><p>“The raid was mainly for you, but we got another one of the females we’ve seen you talking to, and she’s very upset and crying a lot. Could you speak to her—calm her a bit?”</p><p>“Of course.”</p><p>Shawna nodded to someone behind her and a door opened. Nicky struggled to sit up as Tara, weeping softly with her arms tied in front of her ran over to the bed where he lay and snuggled up against him.</p><p>“Tara? Did they hurt you?”</p> <p>“No,” Shawna spoke up behind her. “She’s just very timid. We’re wondering why you were not as frightened and fought us so hard. Surely Marco has been feeding you. Are you, like my mate, one of the resistant ones?”</p><p>“Your mate? The one in the basement cell?”</p><p>She nodded, worry in her expression. “They haven’t let me see him for days. I had to take you to use as leverage to try to get him released. I was inside the compound, you see. That’s how I was able to let in my friends.” She looked down at Nicky. “Perhaps now Marco will be willing to negotiate. Trade my mate for the two of you. Her mate Tristan will be quite upset too.”</p><p>“If you don’t release us both, a terrible fight will occur. They’re probably out looking for us now. I’m surprised they haven’t already come for us. Surely you must know that.”</p><p>“They would have if we hadn’t set off some small explosions right after we took the two of you. They had to stop long enough to put out the resulting fires, and that gave us time to escape. By the time they’d got the fires in the compound under control, we were far enough away Marco and Tristan couldn’t sense the two of you. We’ve been rogues and outsiders for a long time. By now we know how to lay down enough false scent in the forest that they can’t easily track us. They’ll still find us soon, but we’re fortified and have sent messages threatening to harm you both if they try to break in.”</p><p>Nicky shivered and cast a nervous glance up at her. “You wouldn’t really kill us?” Nicky asked softly, tightening his grip on Tara as she whimpered.</p> <p>She shook her head quickly. “Of course not. Please don’t worry. We can’t hurt pets—it goes against our natures. We’re bluffing, but as far as my mate goes, they won’t listen to reason. So far, the threats are holding them off. They still have my mate, you know. I think they’ll be willing to set up a swap. We’ve been trying to convince them they’re wrong about the pets. My mate is not feral and never has been. They simply won’t listen to reason. Now they’re giving him unnatural hormones. You understand how desperate I am, surely.”</p><p>“Marco said pets who aren’t dominated go feral.”</p><p>She shook her head firmly. “That’s just not true.”</p><p>Nicky’s interest sharpened. “What? But how can you be so sure?”</p><p>“When our mates proved resistant to submission, we had to run with them or they would have been put under restraints or in cells, or even chemically altered like they’re doing to my mate. We waited nervously for something terrible to happen after we left the compound, for our mates to turn savage. It never happened. They refused to be dominated, but they weren’t violent or wild. They wanted a normal relationship with their mates—or as close to normal as we can be. We achieved that with them, and nothing terrible happened.”</p><p>“How do you account for that?”</p><p>“We don’t have any idea. The notion that pets become feral if we don’t force them to submit is centuries old and never really challenged. Some of our people have a theory that so many adoptions of humans have taken place over the centuries that at least some of our blood has become watered down—infused with too much human DNA. When humans are changed, they’re different from normal humans, but not that much. At least not enough to turn feral anymore. As long as the changed humans live with us and feed from us occasionally, they’re fine. Again, it’s just a theory, but the Mountain Wolf pack refuses to listen to us. They adamantly refuse to negotiate and keep saying the same old things they’ve said for hundreds of years. Marco is...”</p><p>“Marco’s what?” Nicky’s tone was belligerent. No one could insult Marco in his presence.</p> <p>“Well, forgive me, but he’s the most stubborn wolf I’ve ever met. He’s so dominant himself; he won’t even listen to any other ideas. He doesn’t want to allow for any other lifestyles. We didn’t want to have to resort to such means to get him to talk to us, but we felt we had no choice.”</p><p>Nicky tried to absorb what he’d just heard. Lord knows she was right about Marco being stubborn. Dominant too. Could she be right about the submission thing?</p><p>“You’re certain that non-submissive pets never go feral if not totally controlled?”</p><p>“Pretty sure. In the fifteen cases of resistant submissives in our pack, we’ve never had one become wild, so long as they stay close to their mates and feed from them regularly.”</p><p>Nicky was silent for a long moment. Then he spoke softly to Tara who still whimpered and moaned softly. “Honey, I need to talk with Shawna. No one will hurt you, I promise. Just wait in the other room for me for a little while.”</p><p>Shawna motioned to some other people in the room, and they led Tara outside.</p><p>Nicky leaned closer to Shawna. “I have an idea. Take these ropes off me, and I promise I won’t try to escape. We need to talk.”</p><p>* * * Marco paced up and down the room. He’d have wrung his hands and pulled his hair out if he thought it would do any good. His mate had been gone for two weeks, with no sign of him. Marco was desperately afraid he might be gone from him forever.</p><p>A week ago, Tara had been brought back unharmed in exchange for the prisoner they held in the basement. A note had been thrown through Tristan’s window the day before, advising they would have Tara outside ready to hand her over if a swap could be made. At first Marco wanted to hold out for Nicky’s release too, but Tristan’s abject pleas had softened him, and as the Alpha, he finally agreed, putting Tristan’s needs ahead of his own.</p><p>When they recovered her, Tara was terribly frightened and distraught—so much so Tristan had to spend over an hour with her calming her just to get her to the point where she could be interrogated. Even then, she was a mess, and Tristan sat beside her growling and whimpering uneasily, upset that his mate had gone without his protection for over a week. They all watched her carefully for signs of feral behavior, but found none so far.</p><p>“They wouldn’t let me see Nicky much, but our beds were against the same wall in the little house they held us in. I could hear him at night. He called out for you in his sleep, Marco.” Marco’s wolf was very close to the surface. He growled and whined until the entire pack was terrified and upset.</p><p>When Marco calmed down, she tried to answer questions about where they were holding them, but she had no idea. They’d covered her head both going and coming back to the rogue camp. Marco had been trying desperately to get a fix on Nicky’s mind, but he couldn’t. He could only pick up whispers and echoes. He knew that was a bad sign, meaning either that Nicky was unconscious or able to block him deliberately. Why would he do that? Had he gone completely feral? If he were dead, Marco would know, and he would have taken his own life. Living without Nicky was not an option.</p><p>After two weeks, he knew Nicky might be lost to him, even if he were found alive. Nicky had been so resistant to domination, he was in danger of becoming feral even with Marco’s constant feedings and sexual matings. Without either of these things, he feared Nicky was lost to the wildness. If that was the case, and if he could find him, he’d still take care of him, even if he had to take him away deep in the woods to live out their lives somewhere. He’d never forsake him, no matter what his condition.</p><p>A knock on the door to his office roused him, and he went dispiritedly to answer. Rory was there, holding a note addressed to Marco.</p><p>“It’s from them! The rogues! They say they’re willing to negotiate, but we’re afraid it’s a trap. They say you have to come alone today to Turtle Rock. They’ll have Nicky with them.”</p><p>“When?”</p><p>“As soon as you can get there.” Marco sprinted past Rory through the door. “Wait, Marco! It could be a trap!”</p><p>Marco hurried past him and out the door. Several members of the pack wanted to accompany him, but he shook his head. “They said to come alone, and if there’s any chance to get Nicky back, I have to take it. If I don’t come back in an hour, come looking for us.”</p><p>He ran out the door and took the path to Turtle Rock. The idea of soon being with Nicky energized and excited him. He didn’t think he could have lasted much longer.</p><p>Turtle Rock was not far from the compound down a trail leading off the gardens, maybe a half mile through the deep woods. He shifted into his wolf to cover the distance faster. The wind in the trees sang to him as he raced along, the scents of the woods sharp in his nose. He felt the wildness and the freedom that only came with shifting. All his attention was focused on Nicky, and he tried his best to sense him in the forest ahead. He reached out with his mind, and finally he got just the slightest trace of his Nicky reaching back. Heartened by the idea he might actually see him in only minutes, he raced through the trees, slowing down as he came up to the clearing that held Turtle Rock.</p><p>He could sense the presence of strangers ahead, and one former member of his pack— Shawna, the shapeshifting female wolf whose mate had gone feral. They had determined Shawna had been the one who helped disguise the scent of the rogue wolves by dressing them in pack clothing and letting them in an unguarded side door. Furious with her, he hoped he didn’t run into her alone. He might not be able to restrain himself from tearing out her throat. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He shifted to human and walked into the clearing slowly and carefully, his head pivoting back and forth, looking for rogues. From his left, three rogues stepped out of the trees. A low growl came from his throat. “Where’s my mate?”</p><p>One of the rogue males stepped forward, surprising Marco by lowering his head respectfully. “He’s in the cave behind the clearing, Alpha. He’s waiting for you.”</p><p>He wanted to run behind the clearing, but he forced himself to go slowly, looking around for a trap. He saw nothing except the three rogues, though he sensed Shawna and others in the woods behind them. Moving carefully, forcing himself to be cautious, he found the mouth of the cave. He could see the flickering of a small fire inside, and he ducked his head in and approached softly.</p> <p>The cave was dim and smelled of damp earth and wood smoke. His sharp eyes immediately picked out a small blond man sitting by the fire, with his back to him. He was dressed in jeans and a T-shirt, his curly hair tucked behind his ears.</p><p>“Nicky?” he said quietly.</p><p>When the man turned, Marco’s heart leaped into his throat. Nicky welcomed him with a smile and outstretched arms, his beautiful blue eyes sparkling.</p><p>Crossing the distance between them in three long steps, he swept Nicky up into his arms and breathed in his wonderful, addictive scent. His Nicky at last. He covered his face with kisses, not giving him a chance to catch his breath. Finally, he sat down with him in his lap in the middle of the floor of the cave, not caring about anything but touching him all over and making sure he was all right.</p><p>“Hey, it’s okay, darling. I’m fine. You don’t have to count all my fingers and toes,” Nicky said, laughing, trying to stop Marco’s questing hands from checking every inch of him.</p> <p>Marco held his face in his hands. “Let me look at you. Are you all right, baby? Did they hurt you? God, I almost went crazy. Tara said she heard you calling my name. I thought I’d go out of my mind.”</p><p>Nicky looked ashamed and shook his head slowly. “No, sweetheart. No one hurt me at all. It was my idea to stay away so long.”</p><p>“What? What are you saying, Nicky? You wanted to stay away from me?”</p><p>“No, I didn’t want to stay away from you, but Shawna said I wouldn’t become feral without your dominance, and I had to find out for myself.”</p><p>A long tense silence ensued as Marco stared at Nicky uncomprehendingly. “What are you saying?”</p><p>Marco placed Nicky on the floor of the cave beside him and stood up, looked down at him in disbelief. “Were you in on this all along? Did you run away from me deliberately?”</p> <p>Nicky stood up beside him, shaking his head firmly. “No, of course not. I didn’t know them when they took me, but they were pretty decent to me—explained to me what’s going on with your pack and the rogues.”</p><p>“They explained to you. Are you kidding me, Nicky? I don’t understand. I was worried sick. I’ve never been so upset, and it was all a trick?”</p><p>“No, Marco, I’m trying to tell you something important if you’ll just shut the hell up.”</p><p>Marco’s eyebrows rose almost to his hairline. He spoke quietly, his voice almost a whisper. “Did you just tell me to shut the hell up? Me? Your master? Not to mention your Alpha?”</p><p>“Yes, you! My Alpha, but I hope you’re also my lover, and I’d like you to be my friend, my equal. My mate, too, if you remember. I’m not a slave, Marco, and I refuse to be treated like one any longer. The rogues told me I don’t have to be. I stayed away from you deliberately for two weeks to see if I went feral. I hated to be away from you, but I had to see if what they were telling me was true. If only you’ll listen to what they’re telling you and stop being so damned stubborn.”</p><p>“What the hell are you saying?” Marco’s voice had dropped low, rough, and cold.</p><p>“You told me that without constant domination I would become a monster. Well, here I am, Marco, two weeks with none of that, and I’m fine. No feral behavior. No wildness. Just me.”</p><p>“For how long, Nicky? I can see you think you’re fine, but it might not last. What if it doesn’t? What will you do then?”</p> <p>“Well, I guess that’s my problem, isn’t it?”</p><p>Marco’s face became bright red. He looked like he might explode. “Oh, and you think it doesn’t affect me too, Nicky? Your mate? You don’t think I’m involved in this?”</p><p>“I’m doing this for you, Marco. For us. I can’t live the way you want me to. I just can’t. It’s not you—I love you. It’s the submission thing. I don’t think I can do it all the time, Marco. I don’t even mind it in bed so much—I kind of like it, but not all the time. In the real world, you told me submissives are people who willingly give their obedience to someone they love and trust to care for them and give them what they need. I never chose to do that. It isn’t me. Can’t you see that?”</p><p>“You didn’t choose? Then what did you think you were doing the last night we were together? Oh, I see all right. You want my protection and you want me to take care of you, but you’re such a brat, you want to do exactly as you see fit, even if it will put you in danger. Like walking to the bus stop late at night in a dangerous area. Like putting yourself in league with the rogues against the ones who love you the most. Like all the rest of your harebrained behavior. Smooth moves, Nicky. Very smooth. If you didn’t act like a mentally-challenged child sometimes, maybe I wouldn’t have to treat you like one.”</p><p>Nicky’s face blushed, but he took a deep breath and tried again. “Marco, I know you’re angry. The so-called rogues are trying to tell you we don’t have to all be submissives anymore. That’s all. I love that you feel protective of me and want to take care of me, but I’m not a child, no matter what you say or a pet, and I can’t be a trained dog. I can make my own decisions. Maybe they’re not the greatest at times, but I should be able to do it anyway. I should be able to do that and still be your mate, still be a part of your pack.”</p><p>“So you’re trying to tell me you’re not happy with me as your master? Do you want a new mate? Is that what this is about? Is it Rory? You two have spent a lot of time together—or maybe someone here? What did you do when I wasn’t around, Nicky?”</p><p>“My God, can you not understand what I’m saying? It’s because I love you so much that I’m trying to help the rogues. I’m trying to save our relationship. I’m like Shawna’s husband, honey. You told me I belonged to you, and I love that. I want that. But you also told me I’d have to ‘settle in’, and I can’t, Marco. Don’t you see? I’ll wind up resenting you for it eventually? Maybe even hating you.”</p><p>Marco turned on his heel and walked out. His wolf was too close to the surface for him to stay another moment. Nicky chased him to the entrance and spun him around. Marco growled and balled up his fist as he turned.</p><p>“What, you want to hit me? Go ahead, Marco. Beat me up. It’s what you wolves most like to do, isn’t it? Beat us up? Tie us? Drag us around on a leash?”</p><p>Marco glared at him, saying nothing. He turned on his heel and stalked out, hearing yet ignoring Nicky calling him as he left the cave and kept going. Angry and hurt, he couldn’t slow down, couldn’t stop. The three rogues stood at the edge of the clearing, watching him storm away. Some part of him knew he would live to regret what he was doing, knew he couldn’t live without Nicky, but he had to walk away, at least for now. He felt too betrayed, too hurt. As he stalked back to the compound, Shawna and her mate appeared before him on the trail. “Please stop, Alpha. We need to talk to you.”</p><p>“I have nothing to say to you, Shawna,” Marco growled. “You betrayed our pack and even managed to turn my mate against me. You must be very proud.”</p><p>“Alpha, please listen. All we want to do is live within the compound again. We want to come back and be a part of the pack. We would follow your rules and respect you as our Alpha. But we have to be allowed to live freely, without making our mates submit if they don’t want to. Our mates who don’t submit are not dangerous to the pack or to anyone else. We have proof of that. To keep denying it is not the sign of a good Alpha.”</p><p>“You dare speak to me that way.” Marco was aware of his face burning red with fury. Low growls emanated from his throat.</p><p>A quiet voice behind him made the blood race through his veins. “Stop being so stubborn! Listen to her, Marco. Please. You’re wrong about this.”</p><p>Marco whirled around to face Nicky on the trail behind him, looking miserable, yet incredibly lovely in the moonlight, his golden curls tipped with silver. Marco growled at him, his gaze shooting out his fury. How dare he—his own mate—say he was wrong about a pack decision? Before he could stop himself, he shifted and lunged, knocking Nicky to the ground, his teeth at his throat, ready to sink his fangs deep into the throbbing jugular. The sounds of the screaming rogues behind him swirled around him as a red haze covered his vision.</p><p>His snout was deep into Nicky’s neck, and Nicky lay very still, his eyes tightly closed, his face turned away and his throat bared. Marco could hear his heart thumping wildly. Nicky’s unique smell suddenly overcame Marco, and he faltered. “Mate,” his brain screamed at him. He pulled his head back, still snarling yet whining nervously. Nicky opened his eyes, his beautiful eyes blankly registering shock. Jumping back in horror, Marco brushed past Shawna and her mate, racing down the trail, so furious and tormented he couldn’t shift back to human shape.</p><p>Feeling horrified and shocked over almost killing his own mate, Marco tore down the trail and into the night, shame and heartbreak eating away at him like acid.</p><p>Chapter Six</p><p>Trembling, Nicky sat up and watched the huge silver wolf race away. He was devastated. He didn’t know for sure, but thought it must be pretty damn unusual for a wolf to attack his own mate. He’d made Marco so angry, he was afraid he’d never forgive him. He shuddered with reaction and fear. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her face shocked and white, Shawna ran over to him and helped him up. “I’m so sorry, Nicky. I can’t even imagine how you must be feeling.”</p><p>“I’ve been better.” Nicky tried to make a joke about it, but it hurt too much. A sob escaped his throat, and he dashed tears from his eyes. “What can I do now, Shawna? He wanted to k-kill me. He was about to tear my head off.”</p><p>“Oh, Nicky.” She patted his arm. “He didn’t know what he was doing. He shifted while he was still furious. He was totally out of control, and I know he’s feeling horrified right now at what almost happened. The fact that he was able to stop himself proves how much he loves you. Marco will come to his senses. He has to! Just give him a couple of days.”</p> <p>“Did you see his face? I did. He wanted to rip my throat out.”</p><p>“No, Nicky, he loves you. You’re his blood match and his mate. He won’t be able to stay away from you. Wolves mate forever.”</p><p>Nicky shook his head and turned to follow the rogues back to their camp, his feet dragging. He supposed he was a rogue now too. His own mate had rejected him, had almost killed him. He had hoped to be going back home with Marco tonight, to sleep in their bed together again, but Marco took what he’d tried to do as betrayal and was so humiliated he had refused to try to understand Nicky’s reasons for helping the rogues.</p><p>Now it was over. He’d gambled and lost. Marco was right about his recklessness. It had almost taken his life once, and by taking this chance and losing Marco, he had truly destroyed himself.</p><p>* * * Marco paced up and down in his bedroom, more distraught than he’d ever been in his life. Two days had passed since the terrible night on the trail. He kept thinking about what happened with Nicky. How could he have attacked his own mate? What if he hadn’t caught his scent at the last second and been able to stop himself? It didn’t bear thinking about. If he had injured Nicky or, God forbid, killed him...his throat closed up, and he was violently ill, only barely making it to the basin in time.</p> <p>He was rinsing his mouth when a knock came on his door. “Go away!” he shouted miserably.</p><p>The loud knocking only increased. “Open the door, Marco. Please, it’s about the rogues.”</p><p>Marco pulled the door open to find Rory standing in the hallway, looking pale and worried. “The rogues have come to talk to you. You won’t believe what they have to say.”</p><p>Marco frowned at Rory and then brushed past him and went downstairs to find Shawna and some of her pack members pacing nervously up and down in the common room. Nicky stood at the back of her assembled pack, keeping his head down and his gaze on the floor. Marco could pick up his thoughts, troubled and utterly sad. He wanted to rush to him and hold him, and he held himself back only with great effort.</p><p>He walked up to Shawna sternly, trying not to even glance again in Nicky’s direction. His hands shoved in his pockets, angry and upset, he to hide it behind a mask of indifference.</p><p>“What do you want, rogue?”</p> <p>Shawna stepped up to him confidently. “We have a proposition for you, Alpha.”</p><p>“I’m listening.” Marco fairly growled his answer.</p><p>“We’re here again to ask you to allow the rogues to rejoin your pack. We hoped you’d had time to reconsider. We would swear allegiance to you and follow all your orders. The only concession we would ask is that you allow our resistant males and females to live with us as your natural born pets do, without restraints and with more freedom.”</p><p>Marco snorted. “Why would I do that? I owe you nothing.”</p><p>“It is our right. We share the same ancestry as you. This land was left to us as well as you. If you deny us, we’ll declare a challenge to your pack.”</p><p>The reaction from Marco’s pack was immediate and angry. They crowded around him, upset and whining. Ian, his beta, stood frowning by his side. Marco laughed mirthlessly.</p><p>“A challenge? You dare to come in my pack with such a stupid threat? We’d annihilate you.”</p><p>“Yes, you probably would. We would take a few of your wolves with us, though. Innocent lives would be lost. Even our pets would challenge you, and your wolves would be forced to take their lives.”</p> <p>Marco and his wolves growled at such an unthinkable idea. Pets were treasured by the pack. No wolf would ever knowingly hurt a pet, no matter whose pack they belonged to.</p><p>“Even your own pet, Marco. You may not want him anymore, but would you want to see one of your wolves kill him?”</p><p>Marco leaped at her. Only the efforts of three of his strongest pack members succeeded in holding him back from ripping out her throat. The idea of another wolf attacking his pet made him ill and sickened him. Ian and some of the older pack members worked for several minutes to calm him enough to stand in front of her again, his fists clenched and his jaw set in anger. Her own pack mewled restlessly around her.</p><p>Shawna continued, a little shaken, but standing firm. “It is our right to ask for one thing before we resort to an all-out challenge, Alpha. Our ancestral fathers decreed long ago if a member of the werekin pack thought their Alpha was wrong, a single member could issue a challenge against the Alpha. Would you be willing to accept a single challenge to decide the issue?”</p><p>“To fight you? It would be slaughter, Shawna, and you know it.”</p><p>Shawna shook her head firmly. “No, not me. We do have another challenger. Another male. If you’re not afraid of the challenge?”</p><p>Marco growled menacingly, his eyes and face burning with a rage to tear someone’s throat out. Bring it on, he screamed in his mind.</p><p>“Afraid?” He laughed bitterly and flexed his muscles. “Present your challenger, Shawna. I’ll fight him in the ancestral ring.”</p><p>“We will. Our challenger is here. If you lose the fight, or if you submit before the fight is over, you must accept our bid to join the pack.”</p><p>Marco laughed shortly. “I won’t lose, and I sure as hell won’t submit. Will he not show himself now? Is he afraid? I’ll not show mercy in the ring, Shawna. No matter what. When a challenge is made to my authority, I won’t back down.”</p><p>Shawna nodded. “He’s here. He’ll show himself.” She took a step backward. The wolves behind her also stepped to the side, making a kind of aisle. Standing at the end of the improvised aisle, looking very small next to the towering hulks of the wolves, was Nicky. His chin was raised high, though it trembled a little, and his eyes were feverishly bright. He stepped forward and came up closer to Marco, standing within an arm’s reach.</p><p>His scent hit Marco like a heavy blow. Keeping himself from throwing Nicky down to the floor in front of everyone and fucking him until he begged for mercy was all Marco could do. He tore his gaze from Nicky and looked up at Shawna incredulously. “What the hell is he doing here? What’s the meaning of this?”</p><p>“Nicky is your challenger. He is werekin. It’s our right.”</p><p>A loud and violent outcry from the assembled wolves reverberated throughout the hall. A challenge from a mate and a pet was unheard of. Marco had eyes for no one but Nicky, and he watched as Nicky squared his shoulders against the chaos around him. He actually took a step closer to Marco, though, as if for protection. Marco’s arms itched to reach out and hold him close to his body. When Marco spoke, his voice was soft and only intended for Nicky’s ears.</p><p>“You want to fight me, Nicky? Are you issuing a challenge?”</p><p>A hush fell over those closest by, as they strained to hear what Nicky might say. He was silent for a long moment before raising his eyes to Marco and taking a deep breath.</p><p>“I don’t want to fight you, Marco. I want—I want the ones you call the rogues to be allowed back into your pack. They have a right to be here, and they—we—have a right to live our lives the way we want to live them.”</p><p>“No matter what your Alpha thinks?” Marco’s voice was soft, yet hard as stone.</p><p>“A-a good Alpha wants what’s best for his pack. You’re a good Alpha, Marco, but, I’m sorry, you’re stubborn and set in your ways. Someone has to make you see what your people really need.”</p><p>He laughed shortly. “And you think that’s you? You know what my kind wants?”</p><p>Nicky bit his bottom lip. It took every ounce of self control Marco had not to take charge of that sweet lip and suck it into his mouth. He clenched his fists by his side to keep from dragging Nicky into his arms.</p><p>“I’m trying,” Nicky said. “My hope is that in the long run, this might give us our chance to be together again.”</p><p>Marco laughed shortly. “By fighting me in the ancestral ring? And if I hurt you or kill you? You don’t stand a chance, and you know it. It would be a bloodbath.”</p><p>Nicky bowed his head and remained quiet.</p><p>A new idea dawned on Marco’s face. “You don’t believe I’d hurt you, do you? You think the fact that you’re my mate would stop a fight from ever taking place, and then the rogues would win by default. So this is just a trick—a clever ploy?” He looked down at Nicky with disgust twisting his features. “So you’re betraying me, Nicky, again?”</p><p>Shawna broke in. “Do you accept the challenge or not? If you do, meet us tomorrow in the forest at the ancestral ring, and we’ll bring our champion before the final battle.”</p><p>Marco gave Nicky an angry look. “I accept.” The wolves from his pack yipped loudly, pulling Marco away while Shawna and her rogues withdrew, leaving the compound, taking Nicky firmly by the arm and leading him away.</p><p>Marco stood in the common room surrounded by his pack, feeling stunned. Ian came close to him. “What are you going to do? You can’t fight your own mate, Marco. It would destroy you. Let me fight him.”</p><p>Marco leaped at his beta and was restrained again by the other wolves. “You touch him— touch one hair of his head, any of you—and I’ll kill you!” he snarled in fury.</p><p>Ian shook his head. “You talk like this, and yet you intend to face him in the ring?”</p><p>“I’ll handle this. Stay out of it. Don’t you think I know I can’t hurt him?” he growled. “At the same time I can’t allow anyone else to come near him. Shawna knows it too. Maybe this is her plan all along—to use my own mate against me to humiliate me and make me back down. Then she and her rogues can come in and take over.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco cast a bitter, hopeless look at his beta. “They’ve convinced my own mate to betray me. But it’s my fault. I didn’t spend enough time with him. It’s time I took charge of my mate again. He’s had too much freedom, and I haven’t trained him properly. He thinks he’ll be allowed to defy me. Well, he’s got another think coming. I’ll teach him a lesson he’ll never forget.”</p><p>* * * Nicky was jittery. No matter how many times Shawna reassured him Marco would never hurt him, he still remembered the hot breath of the wolf on his throat, the fangs dripping saliva on his neck. Nicky knew better. He’d seen the bitter, hate-filled look in Marco’s eyes when he left him in the cave. Hell, the very fact he’d left him behind argued for a complete break. Nicky knew enough about Marco to believe he would never leave his mate behind in what he considered an enemy camp. It must mean Marco no longer considered him to be his mate. The thought made him sick. He shuddered, wondering if Marco would tear him limb from limb or be content with just ripping out his throat.</p><p>Not that it mattered a great deal. If Marco was truly through with him, and no matter what Shawna said, Nicky believed he was, the truth was his life would be over anyway. Where would he go? What would he do? He supposed he could crawl back to Atlanta and get his old job back. That is, if his old boss, with whom he was never exactly a favorite, didn’t rip his head off for quitting without notice and disappearing. Even if he could get another job waiting tables, the need for an occasional pint of werewolf blood might tend to complicate things.</p> <p>Shawna told him he could stay with the rogues and feed from their wolves. She’d been urging him to feed from her or someone else for some time now, but he’d refused. The idea of feeding from anyone but Marco disgusted him. Besides, he wanted to see how long he could go without it. If he could do without the blood indefinitely, he would increase his chances of being free from the pack again. If he had to leave, maybe he could somehow survive. He certainly couldn’t stay and watch Marco go on with his life without him.</p><p>Shawna even promised he wouldn’t have a problem finding a new mate if the bid for rejoining the Mountain pack failed. She would hook him up with someone else from her pack if Marco no longer wanted him. Trouble was he found the idea repellent. He had no interest now in any other mate, male or female. His blood sang only for Marco.</p><p>No, if this challenge didn’t work, he didn’t know what would happen. If they did join Marco’s pack, he wouldn’t be able to stand the sight of Marco with another mate. It would kill him for sure. He began to think about taking his own life. He should have died anyway, when those muggers cut his throat. He’d cheated death then, and maybe death was trying to collect its debt.</p><p>Two of the younger members of Shawna’s pack came to tell him it was time to go to the ancestral ring for the challenge, and Nicky stood up. He was ready. To live this way had become intolerable. He was ready to get it over with one way or another. He took a deep breath, squared his shoulders, and followed the wolves to meet the rest of the pack.</p><p>The ancestral ring, a ring of stones carefully laid in a circle with grass well trampled within, lay about a mile from their camp. Nicky walked quietly toward the arena, his mind full of what was to come. Shawna walked beside him and her mate flanked him. He wondered if they thought he might try to make a break for it. He might have considered it, to avoid having to see Marco again, but he had nowhere else to go.</p> <p>As they drew closer to the ring, Nicky could see Marco, standing menacingly just outside the circle, his big form totally obscuring everyone else for him. Nicky could already smell his distinctive scent, and he yearned for it. He tried to take shallow breaths and keep his mind blank, knowing Marco could read his mind if he still wanted to. He’d decided to fight. He really had no choice. He fervently hoped Marco would kill him quickly.</p><p>* * * Marco stepped inside the ring, stalking slowly and deliberately toward his mate. Nicky walked slowly out to the center to meet him. His beautifully sculpted body looked like a Greek statue, lean, muscular and perfect. His shining, golden hair lit up the center of the circle. Marco walked slowly around him, prowling in a tight circle, never stopping, to make it harder for Nicky to follow him without getting dizzy. Nicky stood, not moving, as Marco stalked him, getting closer and closer with every turn until he stood right in front of him. He towered over the smaller man. Leaning down, he whispered angrily in his ear, making Nicky shiver from the contact.</p><p>“Well, Nicky, we both know who the Dominant one is here. Why don’t you fight me? Bite me. Kick me. Do something.” Putting out a hand he pushed Nicky provokingly on his chest. “C’mon. What are you going to do? Make a move, baby.”</p><p>Nicky raised his eyes, bright with tears, and looked directly at Marco. His chin quivered, and he hunched his shoulders. He put out one hand blindly to Marco, but Marco slapped it away in contempt. Marco felt Nicky’s pain at the gesture deep in his soul, and his pack, sensing it, made whimpering noises deep in their throats. He had to make Nicky think he hated him for making this challenge. He had to make him believe he was deeply disappointed in him, the only way to bring him around, to make him beg his forgiveness and submit.</p><p>Marco picked up on Nicky’s thoughts—pure desperation and misery. He knew he was close to the breaking point. He only needed to keep up the pressure. He had no intention of hurting Nicky, but he had to make him give in. Unless he did, they had no chance. Marco couldn’t and wouldn’t hurt him, yet if he had to submit to Nicky, it would not only destroy the pack’s confidence in him as a leader, but it would make him resent Nicky. Maybe even hate him at the same time he loved him. The split in his psyche would tear him apart. Even now, just by having his mate in the ring with him, he was terribly torn and upset, not thinking straight.</p><p>He pushed him again, and Nicky fell down. He scrambled back to his feet, though, and tried to follow Marco with his eyes. Marco circled him so quickly, Nicky spun, apparently only succeeding in making himself dizzy. He stumbled a little and shook his head as if to clear it.</p> <p>Nicky took a deep breath, and Marco heard his thoughts as plain as if he’d spoken . It’s now or never. I hope it’s over quickly.</p><p>He lunged at Marco as he came around and fell sprawling as Marco neatly stepped out of the way. Nicky got to his feet again and dove toward Marco. Marco caught him and put him on the ground, careful not to hurt him much, though he still heard Nicky’s cry of pain in his head, and it rattled him. Marco put a hand on his throat, holding him down.</p><p>“Give up! You’re going to hurt yourself, damn it!”</p><p>Doggedly, Nicky shook his head, panting from exertion. “Never.”</p><p>Marco snarled at him. “Do you really think so little of me, Nicky? Did you ever love me, or was it all pretense?”</p><p>Nicky shook his head frantically. “What do you mean? You know that’s not true.”</p><p>“Then why do you defy me? Why do you try to humiliate me in front of my pack?”</p><p>“No, I’m not!”</p> <p>“Shawna is using you. She thinks I won’t be able to hurt you, and I’ll have to give in. Then my pack will think me weak and want a new Alpha.”</p><p>“No! I don’t want to hurt your reputation, Marco. I would never do that.”</p><p>“Then submit. Now. Clearly and without leaving any doubt.” He released his hold on Nicky’s throat and stood up, looked down at him and waited. This was the moment that would shape the rest of their lives together. If Nicky refused to submit, Marco would have to fall to his knees in front of him. If that happened, it would destroy something deep in Marco’s soul.</p><p>Nicky rose to his feet, his legs shaky. He looked from Shawna and her pack back to Marco. Sighing in defeat, he sank down on his knees in front of Marco, presenting his neck. It was an instinctive sign of abject submission and humility. Nicky’s back was straight, his hands were behind his back, and he trembled. By sinking to his knees and giving up, Marco won the challenge by default. He could now rip out his opponent’s throat if he wished to.</p><p>A gasp came from the crowd when Nicky fell to his knees, but now it seemed the entire pack held its breath to see what would happen next.</p><p>Marco leaned over, putting his hands on Nicky’s shoulders, holding him in place. He brought his mouth down close to his throat to let him feel his hot breath on his neck. He could feel Nicky’s whole body jerking with fear. Marco slowly straightened and turned his back on Nicky, speaking to the wolves assembled in the ring.</p><p>“The challenge is over. The rogues’ challenger has shown his submission. Your challenge failed. Take your pack, Shawna, and get out.”</p><p>Dead silence filled the area around the ring for a long moment, and then Marco’s pack burst into excited yips and howls. The rogues watched them moodily and filed slowly out of the clearing. The wolves of Marco’s pack surrounded him, thumping him on the back, the younger wolves punching and shoving each other good naturedly.</p><p>Ian slapped his Alpha on the back. “You handled that perfectly, Marco. What did you say to make him submit to you? Where is Nicky anyway? Did he leave?”</p><p>Puzzled, Marco turned, his eyes searching the clearing. Nicky was nowhere to be seen. He had vanished, apparently leaving when the rogues left. Fear clenched at Marco. He took an involuntary step forward. Had Nicky left him again? Didn’t he want to be with him? He must have submitted only because he felt some loyalty still and hadn’t wanted to take away Marco’s rank as Alpha. Marco’s heart clenched and turned icy. Nicky had no interest in staying as Marco’s submissive mate. He’d made that abundantly clear. How many times did he have to say it before Marco’s stubborn heart understood?</p><p>Turning to Ian, he shrugged with bravado. “Who knows? Who cares? Let him go with the other rogues. I tried to make it work with him, but he’s impossible. I’m tired of him and his antics.”</p><p>Still Marco reached out with his mind to find Nicky. He could catch the faintest echo of him close by, and his heart slowed a little. Despite his words, he worried. If Nicky didn’t want him, he wasn’t sure what he would do. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Where is your mate, Alpha?”</p><p>Marco whirled around to see Shawna standing in front of him. He glared down at her. “I thought you’d have enough sense to follow your wolves and get out.”</p><p>“I feel responsible for Nicky. He tried to help us, and he had no idea you would think of what he did as a betrayal. He’s a good person, Marco, and he truly loves you.”</p> <p>“And why would you think I’d be interested in that information?”</p><p>Shawna’s eyes flashed furiously at him. “Don’t be a fool, Alpha!”</p><p>Marco’s pack members bristled at the insult to their Alpha and growled angrily, stepping closer behind Marco. Likewise, a few of Shawna’s pack members guarding her gathered closer, growling back, some baring their teeth.</p><p>Shawna put up a hand to stop all the posturing. “Even if you’re not interested in him as a mate anymore, you have a responsibility to him as a member of this pack. Your wolves brought him here. Against his will, I might add. You took his life away from him, and you at least owe him another one.”</p><p>“He’s not dead or hurt, Shawna. I could sense it if he was, and I still feel him close by. Besides, he doesn’t have any interest in being here with me or this pack. Let him leave here if that’s what he wants.” He tried to make his voice indifferent. His pride wanted no one to know he’d never let Nicky leave him.</p> <p>“He can’t go home, Marco, and you know it.”</p><p>“Why not? You keep telling us you have proof that he won’t turn feral. If your theory is correct, there should be no reason he can’t go home.”</p><p>Shawna shook her head stubbornly. “You’re not thinking straight. He’s been changed, Marco. He has to be in a pack. He still has to feed from one of us from time to time, and you know it. He’s refused all feedings I’ve offered him. I’ve even offered to find him another mate.”</p><p>The thought of Nicky with another mate, feeding from him, making love to him filled Marco with outrage and fury. Nicky was his. Only his. He would take great pleasure in killing anyone who came between them.</p><p>“If he’s on his own, I don’t know what could happen to him. He hasn’t fed in over two weeks. Our mates have never gone so long. I tried to talk him out of it, but he was insistent. He wanted to see if he was really changed. He’s very stubborn.”</p><p>“You don’t know the half of it,” Marco said, rolling his eyes.</p> <p>“Even if you can still sense him alive, he may not stay that way long. There may be Hunters in the woods. And he has to feed soon and from you, Marco. He won’t accept anyone else. He was almost destroyed by what happened between you. If you ever cared for him at all, help me find him before it’s too late.”</p><p>Marco had become more and more uneasy as she spoke and panic washed over him. Turning to his beta, Ian, he gave him a significant look. “We have to find him, Ian. She’s right. He’s so... he does things without thinking. I could sense he was terribly upset during the challenge. Maybe I pushed him too far. We have to find him.”</p><p>Ian nodded with concern, and the entire pack moved, mobilizing for the search. Marco turned back to Shawna, his voice still gruff, but with a hint of apology. “Thank you for letting me know. We’ll find him.”</p><p>“If you don’t mind, Alpha, we’ll help too. He brought all this on himself trying to help us. We made it worse when we urged him to be our champion. We knew he didn’t know what it would mean, and we took advantage of him.”</p><p>Marco nodded curtly, her words cutting into him like a knife. He brought all this on himself. She meant Marco’s wrath, partly caused by his own failure with his mate. He knew that now. He’d let his temper get the best of him with Nicky, not just because he’d sided with the rogues, but because Marco had failed to satisfy him. He’d failed to make him feel a part of his life. He’d neglected his mate, and at the end, he’d almost killed him. A sudden image of his teeth sinking into Nicky’s sweet throat made him ill again, and he barely kept the bile from bursting from his mouth.</p><p>From nearby, an unearthly, feral howl split the air, making everyone freeze in panic and fear. Marco was stricken with horror, knowing it came from Nicky. He turned, shifting as he ran, desperate to get to him.</p><p>* * * Nicky stood outside the circle, standing behind a grove of laurels, growing as twisted and crooked as his love for Marco had become. He listened to the words Marco said to Ian with disbelief and heartbreak. “Who cares? I’m tired of him.”</p><p>Each word hit him like a physical blow. Exactly as he’d feared, Marco hated him. Obvious now, and it had probably been obvious all along, but Nicky hadn’t wanted to see it. Marco made a mistake. There was no blood match with him. Nicky was a mistake, an error. He put a shaking hand to his face. A terrible pain pierced his chest. Could he actually be feeling his heart breaking? He stumbled down the path, running away from the pain.</p> <p>He was terrified, the pain emanating from his very soul, forcing its way out of him. He stumbled out into the forest, something inside him clawing to burst free. He fell on the ground, writhing in agony. A growl tore itself past his lips, a terrible sound that frightened him and filled him with unreasoning rage. He opened his mouth and a wolf-like howl issued forth, inhuman, feral, and brutish. He got up on his knees and threw back his head to let the bestial sound out freely, easing the pain a little. The howl reverberated through the trees, and startled yells came from the group still standing some fifty yards away by the ancestral ring. He jumped to his feet, aware they were coming toward him, excited yipping and growling issuing from the group as he howled out his challenge.</p><p>He tore off his clothing, which was suddenly too tight and choking him. His body was changing, morphing into something not quite human, something savage. The pack surrounded him, sniffing at him, stalking him, and in front paced a big silver wolf with beautiful, flashing eyes. Nicky wanted to kill him, to rip his heart out as he’d ripped out Nicky’s. Nicky stood with his feet planted wide apart, his chest heaving and his hands clenched into fists. The big wolf morphed into Marco again. Marco, the only man he’d ever loved, the only man he hated. He growled at him again, a low, guttural sound. Marco stared at him in horror.</p><p>“Nicky?” he whispered. “Nicky, is that you?”</p><p>“What the fuck do you care?” Nicky didn’t even recognize the sound issuing from his throat. His voice was deeper, fierce and harsh. “You said I’m impossible, remember? You’re through with me. So fuck you!”</p><p>The other wolves gathered close to their Alpha. Some had already shifted back to human form, and they all stared at Nicky in fascination and disbelief. He could see Rory at the back, his face blank with horror. Ian, Marco’s beta, stepped up beside Marco and grabbed his arm when he would have stepped forward. Marco shook him off impatiently. He kept his voice low and calm as he spoke to Nicky.</p><p>“Nicky, it’s Marco. Do you recognize me?”</p><p>“Oh, I recognize you. You’re the bastard who’s been torturing me for the last few weeks. Well, I’m through, do you understand? I never want to see you again. I don’t need anybody! I don’t need you!” Another howl escaped his lips as a terrible pain racked his body, and he fell back to his knees. His body shuddered, and the snarling tore at him. Still on his knees, the pain ripping him apart, he put back his head and another ferocious, inhuman howl tore from his chest.</p><p>Marco rushed him, putting him down on the ground with his knee in his back, pulling his arms behind him. He struggled fiercely, trying to dislodge him. Marco was much too strong. Another terrible pain racked Nicky’s body, settling in his spine. He howled again in agony. A blow struck the back of his head. His body sagged, no longer struggling, and he thought he might be dying. Sinking into oblivion, he was fleetingly sorry the last words he ever said to Marco were so harsh. He wished he might call them back, and then the darkness fell down on him like an avalanche.</p><p>* * * Nicky ran through a forest, wind in his hair. He came to a lake and jumped in, the cool water closing over his head comfortingly. He could hear someone calling him, as if from the shore, and he struggled to the surface, wanting to answer, wanting to obey. He felt the familiar touch on his lips, and the back of his head. Someone urged him to feed from their wrist. He closed his eyes and let the bright sweetness pass over his lips, the sucking motion of his lips soothing him, quieting his need to struggle to the surface.</p><p>Nicky woke up slowly, trying to stretch his arms over his head. Something held them down. He had a horrible headache and winced at the light streaming in the window, keeping his eyes tightly shut.</p><p>“Nicky? Are you awake?” He opened his eyes to see Marco sitting beside him on a chair by the bed. It wasn’t his and Marco’s bed though, and for a moment he couldn’t understand what was happening. He was lying in some kind of hospital bed, his arms strapped down to the bed rails. He pulled at the straps, panicking and breathing hard.</p><p>Marco jumped and bent over him, putting his hands on his shoulders. “Stop, baby, you’ll hurt yourself.” “What? What’s happening? Why do you have me strapped down?” He looked around himself wildly. He was in a room he didn’t recognize, stark with plain white walls and one uncurtained window high up on one wall. “Where am I, Marco?”</p><p>“Baby, calm down. Nothing bad is happening to you. I’m here with you, and I won’t leave you.”</p><p>“But where am I?” Nicky pulled against the straps and thrashed his head on the pillows. “Let me up!”</p><p>“Nicky, you have to calm down. Listen to me. You’ve been ill, but I’m taking care of you. You’re going to be fine, I promise you.”</p><p>Somewhat soothed by his quiet voice, Nicky subsided a little, looking up at Marco. “But I don’t understand. Oh my God, is this the basement cell? Did you put me here because of the challenge? I’m sorry, Marco. I’m so sorry! Let me go, and I’ll leave. I promise. You know I can’t stand being locked away. Please. I’m begging!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco bit his lip a moment and then hurried to release Nicky’s arms. He put down the side of the bed and climbed into the narrow space, lying beside him and held him close. Wrapping his arms around Nicky, he kissed his lips. “Be quiet, baby. Let me explain what I think has happened. Don’t be frightened, because I’m handling it, okay? Now are you ready to listen?”</p><p>Nicky nodded, snuggling up into Marco. Marco’s wonderful smell washed over him, and even though he knew Marco didn’t love him anymore, he reveled in his closeness.</p><p>“After the challenge, we heard a howling. We rushed over and found you—changed.”</p> <p>The way his voice tightened at the last word alarmed Nicky. “Changed? What do you mean?”</p><p>“None of our pack has ever seen it before; we’ve only read about it in old books passed down through the pack. But we think—we think you went feral, Nicky.”</p><p>Nicky jumped. “What?”</p><p>“You went without feeding for a long time, too long. We’d only changed you a short time ago, and your body couldn’t withstand the deprivation. You needed my blood.” Marco kissed the back of his neck. “It’s my fault. I should have fed you the minute I saw you in the cave. Instead, I lost my temper and left you behind. I’m so sorry, Nicky.”</p><p>“But-but how do you know? What did I do? I just remember getting really angry after I heard what you said to Ian, and I remember yelling at you. You knocked me down, didn’t you? That’s the last thing I remember.”</p> <p>“When we heard you howling, we ran over to where you were standing and you were changed.”</p><p>His voice did the same thing when he uttered the word, sounding horrified. “That’s the second time you said that. How exactly was I changed?”</p><p>“You were bigger, more muscular. Sort of beast-like. Your face was a little like a wolf’s.”</p><p>“Oh my God!”</p><p>“See, I knew you’d freak out. It’s okay. You started responding right away to my feedings, and you’re almost completely back to normal now.”</p><p>“Almost?” Nicky’s voice cracked, a couple of octaves higher than normal. He tried to pull away but Marco held him tight. Nicky sighed heavily. “Right. That’s why I woke up strapped to a bed in the basement cell, and why you won’t let go of me.”</p> <p>“Just a precaution, Nicky, until we’re sure you’re absolutely back to normal. You had to feed from Rory’s blood too, and we didn’t know if it would work as well as mine. You look like your beautiful self again.”</p><p>“Rory’s blood? But why? Didn’t-didn’t you want to?”</p><p>“Of course, baby, and I’ve been feeding you. But I couldn’t give you enough without getting sick myself. We’re in uncharted waters here. We didn’t know exactly what to do, so we’ve been feeding you every few hours. You’re the first pet to go completely feral in over a hundred years.”</p><p>“But what about Shawna’s mate?”</p><p>“After seeing you, we know now he was just angry and defiant. He was nothing like you. Your body even tried to shape shift.”</p><p>Nicky groaned. “It’s because I’m such a fuck-up. I should have listened to you when you told me. Now I’ve ruined everything.”</p><p>“You haven’t ruined anything. You’ll be back to normal in no time.”</p><p>“Then what happens? Will Rory be able to keep feeding me?”</p> <p>“Rory? No, I’ll be able to handle it alone.”</p><p>After a long silence, Nicky sighed again. “I heard what you said to Ian about not caring about me anymore. It’s okay, Marco. I don’t want to be a millstone around your neck. You made a mistake in picking me for your mate, and you deserve someone better. I’m releasing you from your vows. You don’t have to do this anymore.”</p><p>“Oh, I don’t, do I? You’re releasing me? Well, I’m not releasing you!”</p><p>“Marco, please. After what happened, I know you don’t want me back in the compound. I know how you feel about me.”</p><p>“Oh, do you now?”</p><p>“Yes. I know you don’t love me anymore.”</p><p>“Oh, you think so?”</p><p>“Yes. Marco, why do you keep asking me questions like that? And why are you looking at me that way? I don’t want to be a burden to you anymore. I know I’m a disappointment and an embarrassment. I just couldn’t settle in like you wanted. I’m a bad mate, Marco. I embarrassed you. I’m not the person you need, and I’m so sorry I challenged you.”</p><p>Marco continued to stare at him. “You know, perhaps I’ve been coddling you too much the past few days, letting you lie here in bed, when what you really needed is some good old fashioned discipline.”</p><p>“Discipline?”</p><p>“That’s right, Nicky. I think I need to give you the spanking you’ve been asking for a very long time.”</p><p>“What?” Nicky licked his lips nervously. “But I told you, I’m not into all that.”</p><p>“Yeah, well, I am, and you’re getting a spanking, sweetheart, and probably on a regular basis from now on, and that’s not a threat, that’s a promise.”</p><p>“A-a regular basis? From now on? Does that mean you still want me?”</p><p>“I told you when I first fucked you that you belonged to me. Did I stutter?”</p><p>“No, but...”</p><p>“Hush! You don’t have permission to speak.” He turned him loose. “Take your pajama pants off. Now.”</p><p>Nicky’s nerve broke, and he tried desperately to break Marco’s hold and get out of bed. Failing miserably, he was helpless as Marco sat up and pulled his body up to his own.</p><p>“I said, get your pajamas off.”</p><p>Trembling, Nicky did as he was told, scooting out of them while Marco watched him with brooding intensity and growing excitement. Finally he sat in front of Marco, naked and shivering. “Please, Marco. Tell me what you plan to do with me. I’ll do anything you say. Just don’t make me go away.”</p><p>“You’re not listening, boy. You’re not going anywhere. You belong to me. You’ll always belong to me. I’ve been angry with you, yes, and said some things I never meant. I’ve been punishing you. And punishing myself right along with you. That doesn’t mean I don’t love you.”</p><p>“It doesn’t?”</p><p>“No, baby. I love you very much. I’m sorry for scaring you like I did when I shifted on the trail. I’m sorry you overheard things that hurt you. I was trying to show off in front of my beta, but I promise I’ll never do that again. I’d rather die myself than hurt you.”</p><p>“Oh, thank God,” Nicky said fervently. “Can I come back home then? I’ll try to be submissive if you want me to. I’ll try to be whatever you want me to be. I promise I’ll do everything you say.”</p><p>“Oh, you’re coming home all right. And you’ll submit to me in the bedroom. You’ll also do what I tell you to do, because you’re way too reckless and headstrong. I will be your protector and your guide, whether you want me to or not. You’re far too important to me to risk. You’ll obey me or suffer the consequences. Do you understand?”</p><p>Nicky’s head bobbed up and down.</p><p>“However, I agree I’ve been a little too protective. You’ll still wear my collar to show who you belong to, but the leash is not necessary. I’ll give you more freedom if that will make you happy. You can start up your painting again. That should keep you occupied and out of trouble.”</p><p>“Oh, yes, Marco. Thank you, darling. Can we go back home now? I don’t like it in here.”</p><p>“Right after I remind you whom you belong to.”</p><p>“What—what does that mean?”</p><p>Marco took him by the arm and held onto him as he settled himself on the side of the bed. He pulled Nicky belly down over his lap.</p><p>“No, Marco, please!”</p><p>Ignoring him, he lifted Nicky up a bit and took a firm hold of Nicky’s rigid cock, tucked it down between his own legs and tightened his thighs. With one large hand in the small of Nicky’s back, he held him down firmly. “Your safe word is candy. Use it if this gets too intense and we’ll stop for a while. Everything will start up again later though, so don’t use it unless you have to. You’re mine, Nicky, and though we may decide not to live this lifestyle all the time as you said, we will live it in our most intimate time together. Do you understand?”</p><p>“Y-yes.” A hard slap came down on his backside, making him jump in pain. “Ow!”</p><p>“That was for even thinking I don’t want you anymore. You are never, under any circumstances to ever think that again. Do I make myself clear?”</p><p>“Y-yes, sir.”</p><p>Marco’s hand came down hard again with a loud popping sound. “That was for taking anyone’s side against me, your mate. Now tell me how sorry you are.”</p><p>“I’m sorry! Marco, please,” Nicky cried loudly, trying desperately to get away from Marco’s unrelenting grip. His cock, still tucked firmly between Marco’s legs and hard as a rock, rubbed against Marco’s thighs, driving him crazy.</p><p>Another slap came down hard. “That was for cussing me. Say you’re sorry.” “Candy!”</p><p>“Nicky? Do you need to stop?”</p><p>“Not really. I just wanted to make sure you would.”</p><p>“Are you ready to say you’re sorry?”</p><p>“I’m sorry.”</p><p>He spanked him again. “That was for staying away and not coming to ask me to forgive you. I think you know what to say.”</p><p>Nicky began to sob. “I’m sorry!”</p><p>Marco brought his hand down one more time. “And that is for even thinking of leaving me. Say it!”</p><p>Nicky was sobbing loudly and squirming in earnest. Marco waited patiently for him to gulp out his last apology. Then he turned him upright and sat him down hard on his lap, enjoying his winces of pain as his hard lap met Nicky’s abused and tender ass. “Now I’m going to fuck you, Nicky. And the way I’m feeling right now, I’m afraid my knot may come out to play. We may be here a long while.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No, Marco, not that! Please!” Nicky pleaded while the very thought of that knot teasing his prostrate made his insides clench with want.</p><p>“Nothing I can do about it, baby. It’s all up to the wolf now. And the wolf is thinking you need a very good fucking and a few orgasms to let you see what you’ve been missing.”</p><p>Marco put him back on the bed and stood up, removing his clothes. Nicky sat up suddenly and threw his arms around Marco’s neck and kissed him full on the lips. Surprised yet pleased, Marco looked down at him with a wolfish grin. “That’s not going to stop me, baby. I’m going to make love to you for a very long time.”</p> <p>“You always did talk too much.” Nicky’s fingertip stroked the wolf knot encircling Marco’s cock. “You know, actions speak louder than words.”</p><p>“That’s for special occasions, and this is very special.” His words served a double meaning as he enclosed Nicky’s hard cock with his fingers and smiled wolfishly, showing his large incisors.</p><p>Nicky gasped. “Marco, your teeth!”</p><p>“Mmmm...All the better to...oh hell, you know the rest.”</p><p>Epilogue</p> <p>The meeting with his council had been the most contentious meeting in the history of the pack. Bowing to pressure from the families of the rogues and in response to passionate and articulate pleas from both Shawna and her mate, the council decided to allow the rogue pack to rejoin the Mountain Wolf pack on a trial basis. Many of the older wolves had walked out in protest, a huge challenge to Marco’s leadership as Alpha, but he had made the final decision for the good of the pack as a whole, as a good Alpha should. They would adopt a wait-and-see attitude and allow the rogues to move back in the compound and live their lives the way they chose to as long as the pets continued to feed from their mates.</p><p>Marco walked outside to the gardens and found Nicky by his easel, painting a group of laurel trees tangled together alongside the path. He turned when he sensed Marco close by and put down his brush to run to him.</p><p>“Is the meeting over?” “Yes, baby,” Marco said, catching him in his arms. “The rogues are moving back in tomorrow.”</p><p>“Shawna and the others must be so pleased. Thank you, darling, for being willing to try.”</p><p>“I’m a very reasonable man.”</p><p>Nicky made a choking sound of laughter, though he tried hard to keep it in.</p> <p>“Oh, you don’t agree, huh?” He began to tickle Nicky’s sides as he convulsed in laughter and tried to get away. They wound up falling down in the grass, Marco turning his body so he took the brunt of the fall. He turned Nicky over on his back and held his hands helpless above his head as he kissed him thoroughly.</p><p>“I think I should take you up to our room to show you what happens to bad boys who laugh at me.”</p><p>“Mmm...promises, promises,” Nicky said, laughing. “I think I’d love that.”</p><p>Marco brushed his lips over Nicky’s again. “Good boy.”</p><p>*THE END* </p> </body></html>"]