["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>IT WAS A breezy fall morning when I entered the mirrored glass skyscraper in midtown Manhattan, leaving the cacophony of blaring horns and pedestrian chatter behind to step into cool quiet. My heels clicked across the dark marble of the massive lobby with a tempo that echoed my racing heart. With damp palms, I slid my ID across the security desk. My nervousness only increased after I accepted my visitors badge and headed to the elevator.</p><p>Have you ever wanted something so bad, you couldn’t imagine not having it?</p><p>There were two things in my life I’d felt that way about: the man I’d stupidly fallen in love with and the administrative assistant position I was about to interview for.</p> <p>The man had turned out to be really bad for me; the job could change my life in an amazing way. I couldn’t even think about walking away from the interview without nailing it. I just had this feeling, deep inside me, that working as Lei Yeung’s assistant was what I needed to spread my wings and fly.</p><p>Still, despite my inner pep talk, my breath caught when I stepped out onto the tenth floor and saw the smoked-glass entrance to Savor, Inc. The company’s name was emblazoned in a metallic feminine font across the double doors, challenging me to dream big and relish every moment.</p><p>Waiting to enter, I studied the number of well-dressed young women sitting around the reception area. Unlike me, they weren’t wearing last season’s styles secondhand. I doubted any of them had held three jobs to help pay for college, either. I was at a disadvantage in nearly every way, but I’d known that and I wasn’t intimidated...much.</p><p>I was buzzed through the security doors and took in the café-au-lait walls covered with photos of celebrity chefs and trendy restaurants. There was a faint aroma of sugar cookies in the air, a comforting scent from my childhood. Even that didn’t relax me.</p><p>Taking a deep breath, I checked in with the receptionist, a pretty African-American girl with an easy smile, then I stepped away to find a bare place against the wall to stand. Was my scheduled appointment time—for which I was nearly half an hour early—a joke? I soon realized that everyone was set for a brisk five-minute audience, and they were marched in and out precisely on time.</p> <p>My skin flushed with a light mist of nervous perspiration.</p><p>When my name was called, I pushed away from the wall so quickly that I wobbled on my heels, my clumsiness mirroring my shaky confidence. I followed a young, attractive guy down the hall to a corner office with an open, unmanned reception area and another set of double doors that led into Lei Yeung’s seat of power.</p><p>He showed me in with a smile. “Good luck.”</p><p>“Thanks.”</p><p>As I passed through those doors, I was struck first by the cool modern vibe of the decor, then by the woman who sat behind a walnut desk that dwarfed her. She might’ve been lost in the vast space, with its stunning views of the Manhattan skyline, if not for the striking crimson of her reading glasses, which perfectly matched the stain on her full lips.</p><p>I took a moment to really get a good look at her, admiring how the strip of silver hair at her right temple had been artfully arranged into her elaborate updo. She was slender, with a graceful neck and long arms. And when she looked up from my application to consider me, I felt exposed and vulnerable.</p> <p>She slid her glasses off and sat back. “Have a seat, Gianna.”</p><p>I moved across the cream-colored carpet and took one of the two chrome-and-leather chairs in front of her desk.</p><p>“Good morning,” I said, belatedly hearing a trace of my Brooklyn accent, which I’d practiced hard to suppress. She didn’t seem to pick up on it.</p><p>“Tell me about yourself.”</p><p>I cleared my throat. “Well, this spring I graduated magna cum laude from the University of Nevada at Las Vegas—”</p><p>“I just read that on your résumé.” She softened her words with a slight smile. “Tell me something I don’t already know about you. Why the restaurant industry? Sixty percent of new establishments fail within the first five years. I’m sure you know that.”</p><p>“Not ours. My family has run a restaurant in Little Italy for three generations,” I said proudly.</p><p>“So why not work there?”</p> <p>“We don’t have you.” I swallowed. That was way too personal. Lei Yeung didn’t seem rattled by the gaffe, but I was. “I mean, we don’t have your magic,” I added quickly.</p><p>“We...?”</p><p>“Yes.” I paused to collect myself. “I have three brothers. They can’t all take over Rossi’s when our dad retires and they don’t want to. The oldest will and the other two...well, they want their own Rossi’s.”</p><p>“And your contribution is a degree in restaurant management and a lot of heart.”</p><p>“I want to learn how to help them realize their dreams. I want to help other people achieve theirs, too.”</p><p>She nodded and reached for her glasses. “Thank you, Gianna. I appreciate you coming in today.”</p><p>Just like that, I was dismissed. And I knew I wasn’t going to get the job. I hadn’t said whatever she’d needed to hear to make me the clear-cut winner.</p><p>I stood, my mind racing with ways I could turn the interview around. “I really want this job, Ms. Yeung. I work hard. I’m never sick. I’m proactive and forward-thinking. It won’t take me long to anticipate what you need before you need it. I’ll make you glad you hired me.”</p><p>Lei looked at me. “I believe you. You juggled multiple jobs while maintaining your honors GPA. You’re smart, determined and not afraid to hustle. I’m sure you’d be great. I just don’t think I’d be the right boss for you.”</p><p>“I don’t understand.” My stomach twisted as my dream job slipped away. Disappointment pierced through me.</p><p>“You don’t have to,” she said gently. “Trust me. There are a hundred restaurateurs in New York who can give you what you’re looking for.”</p><p>I lifted my chin. I used to be proud of my looks, my family, my roots. I hated that I was constantly second-guessing all of that now.</p><p>Impulsively, I decided to reveal why I wanted to work with her so badly. “Ms. Yeung, please listen. You and I have a lot in common. Ian Pembry underestimated you, isn’t that right?”</p><p>Her eyes blazed with sudden fire at the unexpected mention of her former partner who’d betrayed her. She didn’t answer.</p><p>I had nothing to lose at this point. “There was a man in my life who underestimated me once. You proved people wrong. I just want to do the same.”</p><p>She tilted her head to the side. “I hope you do.”</p><p>Realizing I’d come to the end of the road, I thanked her for her time and left with as much dignity as I could manage.</p><p>As far as Mondays went, that was one of the worst of my life.</p><p>“I’M TELLING YOU, she’s an idiot,” Angelo said for the second time. “You’re lucky you didn’t get that job today.”</p><p>I was the baby of the family, with three big brothers. He was the youngest. His righteous anger on my behalf made me smile despite myself.</p><p>“He’s right,” Nico said. The oldest of the Rossi boys—and biggest prankster—bumped Angelo out of the way to set my meal in front of me with a flourish.</p><p>I’d chosen to sit at the bar, since Rossi’s was packed as usual, the dinner crowd boisterous and familiar. We had a lot of regulars and often a celebrity or two, incognito, who came here to eat in peace. The comfortable mix was a solid sign of Rossi’s great reputation for warm service and excellent food.</p><p>Angelo bumped Nico back with a scowl. “I’m always right.”</p><p>“Ha!” Vincent scoffed through the kitchen window, sliding two steaming plates onto the service shelf and ripping the corresponding tickets off their clips. “Only when you’re repeating what I said.”</p><p>The ribbing coaxed a reluctant laugh out of me. I felt a hand at my waist the moment before I smelled my mother’s favorite Elizabeth Arden perfume.</p><p>Her lips pressed against my cheek. “It’s good to see you smile. Everything happens—”</p><p>“—for a reason,” I finished. “I know. It still sucks.”</p><p>I was the only one in my family who’d gone to college. It’d been a group effort; even my brothers had pitched in. I couldn’t help feeling like I’d let them all down. Sure there were hundreds of restaurateurs in New York, but Lei Yeung didn’t just turn unknown chefs into name brands, she was a force of nature.</p><p>She spoke frequently about women in business and had been featured on a number of midmorning talk shows. She had immigrant parents and had worked her way through school, making a success of herself even after being betrayed by her mentor and partner. Working for her would have been a powerful statement for me.</p><p>At least, that’s what I’d told myself.</p><p>“Eat your fettuccine before it gets cold,” my mother said, gliding away to greet new patrons coming in.</p><p>I forked up a bite of pasta dripping with creamy Alfredo sauce as I watched her. A lot of customers did. Mona Rossi was closer to sixty than fifty, but you’d never know it from looking at her. She was beautiful and flamboyantly sexy. Her violet-red hair was teased just high enough to give it volume and frame a face that was classical in its symmetry, with full lips and dark sloe eyes. She was statuesque, with generous curves and a taste for gold jewelry.</p><p>Men and women alike loved her. My mom was comfortable in her skin, confident and seemingly carefree. Very few people realized how much trouble my brothers had given her growing up. She had them well trained now.</p><p>Taking a deep breath, I absorbed the comfort around me—the beloved sounds of people laughing, the mouthwatering smell of carefully prepared food, the clatter of silverware meeting china and glasses clinking in happy toasts. I wanted more out of my life, which sometimes made me forget how much I already had.</p><p>Nico came back, eyeing me. “Red or white?” he asked, setting his hand over mine and giving a soft squeeze.</p><p>He was a customer favorite at the bar, especially with the women. He was darkly handsome, with unruly hair and a wicked smile. A consummate flirt, he had his own fan club, ladies who hung out at the bar for both his great drinks and sexy banter.</p><p>“How about champagne?” Lei Yeung slid onto the bar stool next to me, recently vacated by a young couple whose reserved table had opened up.</p><p>I blinked.</p><p>She smiled at me, looking much younger than she had during our interview, dressed casually in jeans and a pink silk shell. Her hair was down and her face scrubbed free of makeup. “Lots of rave reviews about this place online.”</p><p>“Best Italian food ever,” I said, feeling my heartbeat quicken with renewed excitement.</p><p>“A lot of them say a great place got even greater over the past couple of years. Am I right in assuming that’s due to you putting into practice things you’ve learned?”</p><p>Nico set two flutes in front of us, then filled them halfway with bubbling champagne. “You’re right,” he said, butting in.</p><p>Lei caught the stem of her glass and stroked it with her fingers. Her gaze caught mine. Nico, who was good at knowing when to disappear, moved down the bar.</p><p>“To get back to what you said...” she began. I started to cringe, then straightened up. Lei Yeung hadn’t made a special trip just to berate me. “Ian underestimated me, but he didn’t take advantage of me. Blaming him would give him too much credit. I left the door open and he walked through it.”</p><p>I nodded. The exact circumstances of their split were private, but I’d inferred a lot from the reports in industry magazines and filled in the rest from gossip columns and blogs. Together they’d had a culinary empire comprised of a stable of celebrity chefs, several restaurant chains, a line of cookbooks and affordable cookware that sold in the millions. Then Pembry had announced the launch of a new chain of eateries bankrolled by A-list actors and actresses—but Lei hadn’t been part of that.</p><p>“He taught me a lot,” she went on. “And I’ve come to realize he got as much out of that as I did.” She paused, thoughtful. “I’m getting too used to myself and the way I’ve always done things. I need fresh eyes. I want to feed off someone else’s hunger.”</p><p>“You want a protégée.”</p><p>“Exactly.” Her mouth curved. “I didn’t realize that until you pointed it out. I knew I was looking for something, but I couldn’t say what it was.”</p><p>I was totally thrilled but kept my tone professional. I swiveled toward her. “I’m in, if you want me.”</p><p>“Forget about normal hours,” she warned. “This isn’t a nine-to-five gig. I’ll need you on weekends, and I might call in the middle of the night.... I work all the time.”</p><p>“I won’t complain.”</p><p>“I will.” Angelo came up behind us. All the Rossi sons had figured out who I was talking to and, as usual, none of them were shy. “I need to see her every once in a while.”</p><p>I elbowed him. We shared a sprawling, half-finished loft apartment in Brooklyn—all three of my brothers, me and Angelo’s wife, Denise. Most of the time we bitched about seeing one another too often.</p><p>Lei thrust out her hand and introduced herself to Nico and Angelo, then to my mom, who had wandered back over to see what the fuss was about. My dad and Vincent gave shout-outs through the service window. A menu was set in front of Lei, along with a basket of fresh bread and olive oil imported from a small farm in Tuscany.</p><p>“How’s the panna cotta?” Lei asked me.</p><p>“You’ll never have better,” I replied. “Have you already had dinner?”</p><p>“Not yet. Lesson number one—life’s too short. Don’t put off the good stuff.”</p><p>I bit on my lower lip to hold back a grin. “Does that mean I got the job?”</p><p>She held up her flute with a brisk nod. “Cheers.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 2</p><p>One year later...</p><p>“GOD, THE RUSH,” Lei said, her feet tapping beneath the dining table. “It never gets old.”</p><p>I grinned, having caught the bug from her over the months we’d been working together. We’d experienced a lot of highs, but today—a cloudless late-September afternoon—was special. After months of finessing and wooing, we were going to close a deal that would snag two of Ian Pembry’s brightest stars. Payback for what he’d done to Lei long ago and a major coup for us.</p> <p>Lei had dressed for the occasion and so had I. Her Diane von Fürstenberg wrap dress was vintage and her signature red. Paired with black boots, she looked fierce and sexy. I debuted a dark gold shell snagged from Donna Karan’s fall collection and the cigarette pants the designer had paired with them. The ensemble was chic and reflected a new me, a Gianna who’d evolved a lot over the previous year.</p><p>Impatient to finalize everything, I looked toward the entrance of the hotel bar and felt a surge of adrenaline when the Williams twins appeared as if on cue. Brother and sister made a striking pair, with auburn hair and jade-green eyes. They were a great team in the kitchen, having made a name for themselves with down-home Southern cooking updated with gourmet ingredients. The package they presented sold deluxe books and cute little tins of seasonings, but the truth wasn’t so pretty. Behind the scenes, they hated each other.</p><p>And that had been Pembry’s fatal mistake with his dynamic duo. He told them to suck it up and make it work, because they were making millions off their sibling success story. Lei had offered them what they really wanted—the chance to split up and shine on their own, while still capitalizing on their supposedly playful rivalry. Her plan was to build a chain of restaurants with dueling kitchens in the world-famous Mondego casinos and resorts.</p><p>“Chad. Stacy,” Lei greeted, rising to her feet along with me. “You’re both looking fabulous.”</p><p>Chad came over and pressed a kiss to my cheek before he even said hello to Lei. He’d been flirting with me for a while and it had become part of our negotiations with him.</p> <p>I’ll admit I’d been tempted to do more than flirt on occasion, but thoughts of his sister retaliating held me back. Chad wasn’t a saint by any means, nursing a fierce ambitious streak. But Stacy was a real piece of work and she hated me more than her brother. Despite all my friendly overtures, she’d taken an instant dislike to me and that had seriously hindered the whole process.</p><p>Personally, I suspected she was sleeping with Ian Pembry—or had been once—and was carrying a torch for him. I thought that was why she didn’t like Lei, either, but maybe she was just one of those females who hated other women.</p><p>“I hope your rooms are comfortable,” I said, knowing damn well they were. The Four Seasons didn’t have its five-star reputation for nothing.</p><p>Stacy shrugged, her glossy hair sliding over her shoulder. She had an angelic face, pale with a smattering of freckles that were adorable. It was disconcerting how someone so sweet and innocent-looking, with a syrupy Southern accent, could be such a raging bitch. “They’re all right.”</p><p>Chad rolled his eyes and held out my chair for me. “They’re great. I slept like a rock.”</p><p>“I didn’t,” his sister griped, sliding gracefully into her chair. “Ian kept calling. He knows something’s up.”</p> <p>She slid a side glance at Lei, as if gauging the impact of her words.</p><p>“Of course he does,” Lei agreed easily. “He’s a smart man. Which is why I’m surprised he didn’t do more to keep you both happy. He knows better.”</p><p>Stacy pouted. Chad winked at me. Usually I didn’t find winking cute, but it worked for him. Part of his good-ole-boy charm that was tempered by how sexy he was. There was something about him that hinted he might spank you with a spatula as expertly as he cooked with one.</p><p>“Ian did a lot for us,” Stacy contended. “I feel disloyal.”</p><p>“You shouldn’t. You haven’t signed anything yet,” I said, having learned reverse psychology worked best with her oppositional nature. “If you feel that your identity as the Williams twins has more potential than being Stacy Williams, you should absolutely go with your gut. It’s got you this far, after all.”</p><p>Out of the corner of my eye, I watched Lei’s lips twitch with a repressed smile. It gave me a thrill that she was pleased, since she’d taught me pretty much everything I knew about herding egos where we wanted them to go.</p><p>“Don’t be an ass, Stace,” Chad muttered. “You know this casino deal is a prime opportunity for us.”</p><p>“Yes, but it may not be the only opportunity,” she argued. “Ian says we need to give him a chance to deliver.”</p> <p>“You told him?” her brother snapped, scowling. “For fuck’s sake, the decision isn’t just yours to make! This is my goddamn career, too!”</p><p>I shot a worried glance at Lei, but she just gave a nearly imperceptible shake of her head. I couldn’t believe how cool and unruffled she looked, considering this deal would be the one to finally even the score between her and her mentor-turned-nemesis.</p><p>The Hollywood eateries Ian had pulled out from under her went bust when the celebrity investors got over the novelty of it and went looking for other tax shelters that didn’t involve personal appearances. And two of his heavy-hitter chefs had gone back to their home countries, leaving a lot riding on the young shoulders of the Williams twins.</p><p>“The Mondego deal is exclusive to Savor, of course,” Lei said. “What’s Ian offering you?”</p><p>What the hell had gone wrong? I glanced between the two siblings, and then at my boss. I had the contracts in my lucky satchel under the table. We were in the home stretch and suddenly our prime bet was backing away.</p><p>Later on, I’d recognize the ripple of awareness that shimmered across my skin for what it was. At the time, I thought it was foreboding, my instincts warning me that the deal had tanked long before we’d sat down at the table.</p><p>Then, I saw him.</p><p>Everything in me stilled, as if the predator couldn’t see me if I didn’t move. He came into the bar with a sultry stride that made my hands curl into fists beneath the tablecloth. That walk of his was easy and smooth, confident. And yet it somehow signaled to the female brain that he was packing heat between those long, strong legs and knew how to use it.</p><p>God, did he.</p><p>Dressed in a gray V-neck sweater and dress slacks of a darker hue, he looked like a successful man with the day off, but I knew better. Jackson Rutledge never took a day off. He worked hard, played hard, fucked hard.</p><p>I reached for my water glass with a shaking hand, praying he wouldn’t recognize me as the girl who’d once fallen hopelessly in love with him. I didn’t look the same. I wasn’t the same.</p><p>Jax was different, too. Leaner. Harder. His face made more stunning by the new sharpness in the angles of his jawline and cheekbones. I took a deep, quivering breath at the sight of him, reacting to his presence as if I’d been physically struck.</p><p>I didn’t even realize Ian Pembry was walking beside him until they stopped at our table.</p><p>“WHAT ARE THE chances Jackson Rutledge is related to Senator Rutledge?” Lei asked with silky evenness as we slid into the backseat of her town car. “Or any of the Rutledges for that matter?”</p><p>Her driver pulled away from the curb and I fumbled with my tablet just to have an excuse to keep my gaze averted. I was afraid to reveal too much, that her perceptive eyes would see how shaken I was.</p><p>“One hundred percent,” I said, my eyes on my tablet screen and the gorgeous face I’d thought—hoped—I would never see again. “Jackson and the senator are brothers.”</p><p>“What the hell is Ian doing with a Rutledge?”</p><p>I’d been asking myself the same thing as the deal I’d worked so hard on fell apart in front of me—we’d come with contracts and pen in hand and left empty-handed. Unfortunately, I’d lost track of the conversation the moment Jax had allowed Stacy to press an exuberant kiss to his cheek. The roaring of blood in my ears had drowned out everything.</p><p>Lei’s crimson-tipped fingers tapped a silent staccato on the padded door handle. Manhattan spread out all around us, the streets crawling with cars and the sidewalks with people. Steam billowed sinuously from the subways buried below, while shadows claimed us from above, the sun kept at bay by towering skyscrapers that choked out the light.</p><p>“I don’t know,” I answered, slightly intimidated by the energy she radiated, that of a tigress on the hunt. Did Jackson have any idea what he’d stirred by getting in Lei’s way?</p><p>“Jackson’s the only one of the Rutledge males not serving in political office somewhere in the country,” I continued. “He manages Rutledge Capital, a venture capital firm.”</p><p>“Is he married? Any children?”</p><p>I hated that I knew the answer to that question without looking it up. “Neither. He plays the field. A lot. Prefers pedigreed blondes in public, but won’t turn down a roll in the hay with something...flashier in a pinch.”</p><p>I couldn’t help remembering how Jax’s cousin-in-law, Allison Kelsey, had once described me. You’re flashy, Gianna. Guys like to fuck flash. Makes ’em feel like they’re banging a porn star. But that’s what turns them off, too. Enjoy him while it lasts.</p><p>Allison’s melodious voice and cruel words echoed in my mind, reminding me why I straightened my naturally wavy dark hair and had stopped maintaining the French-manicured acrylic nails that had made me feel sexy. I couldn’t do anything about the genetics that gave me an overly generous ass and big boobs, but I’d toned the rest of myself down, striving to be classy instead of flashy.</p><p>Lei looked at me sharply. “You got that from a five-minute search?”</p><p>“No.” I sighed. “I got that from five weeks in his bed.”</p><p>“Ah.” Her dark eyes took on an avid gleam. “So he’s the one. Well, this just got interesting.”</p><p>DURING THE REMAINDER of the ride back to the office, I braced for Lei to tell me the conflict of interest was a problem. I scrambled to find a way to downplay it.</p><p>“It wasn’t serious,” I told her as we rode the elevator up. At least not for him... “More like an extended one-night stand. I don’t think he even recognized me just now.”</p><p>And hell if that hadn’t stung. He hadn’t even looked at me.</p><p>“You’re not a woman a man forgets, Gianna.” She looked thoughtful. “I think we can work around this, but are you up for it? If this is going to get personal for you, we need to talk about that now. I don’t want to make you uncomfortable. I also don’t want to put my business at risk.”</p><p>My first instinct was to lie. I wished Jax had meant as little to me as I had to him. But I respected Lei and my job too much to be untruthful. “I’m not indifferent to him.”</p><p>She nodded. “I can see that. Glad you’re honest about it. Let’s keep you on this for now. You’ll throw Rutledge off balance and we’ll need that. And you’re my in with Chad Williams. He likes doing business with you.”</p><p>I breathed a sigh of relief. She was wrong about Jax, but I wasn’t going to blow my shot by pointing that out. “Thank you.”</p><p>We exited onto our floor and were buzzed through the glass doors. The receptionist, LaConnie, raised her brows at me, obviously picking up on our agitated vibe. We should have returned triumphant, not frustrated.</p><p>“Any idea why Rutledge would have a sudden interest in the restaurant industry?” Lei asked, returning to her earlier question as we headed to her office.</p><p>“If I had to make a guess, I’d say one of the Rutledges owed Pembry a favor.” That was the way the Rutledge family operated. They worked together like a tightly knit team, and even though Jax wasn’t a politician, he still played the game.</p><p>Lei went directly to her desk and took a seat. “We’ll need to figure out what chip he’s cashing in.”</p><p>I caught the undercurrent of annoyance in her voice and understood it. Ian Pembry had been undermining Lei in countless ways for years, but Lei had bided her time—it had been a study in patience that she admitted had made her a better businesswoman. She was determined to prove she’d learned his last lesson in betrayal well and I was determined to help her.</p><p>“Okay.” I knew a little of what she felt. It still made me angry that I’d jumped into bed with Jax. I’d known who he was, knew his reputation, yet I’d thought I was sophisticated enough to take him on.</p><p>Worse, I’d deluded myself into thinking he cared. He lived in D.C.; I was in Vegas. For five weeks he’d flown out to see me every weekend and the occasional weekday. I’d told myself a guy as beautiful and sexy as Jax wouldn’t go through all that trouble and expense just to get laid.</p><p>I hadn’t considered how rich he was. Rich enough to find it entertaining to jet cross-country for a piece of tail and cautious enough to find it convenient that his inappropriate mistress was far away from both the public eye and his family.</p><p>My desk phone started ringing, and I hurried out of Lei’s office to answer it. My station was set up just outside her doors, making me the last barrier visitors faced before they had an audience with her.</p><p>“Gianna.” LaConnie’s voice came clipped and quick through the receiver. “Jackson Rutledge is in the lobby, asking to see Lei.”</p><p>I hated the way my heart gave a little kick over hearing his name. “He’s here?”</p><p>“That’s what I said,” she teased.</p><p>“Have him sent up. I’ll be around in a minute to show him to the conference room.” I placed the receiver carefully back into its cradle and then walked back into Lei’s office. “Rutledge is about to arrive at reception.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her brows rose. “Is Ian with him?”</p><p>“LaConnie didn’t say so.”</p><p>“Interesting.” She glanced at the diamond-encrusted watch on her wrist. “It’s nearly five o’clock. You can stay for the meeting with Rutledge or head out, your choice.”</p><p>I knew I should probably stay. I was already feeling like I’d lost ground by freaking out at the Four Seasons. I’d been too shell-shocked by Jax’s unexpected appearance to grasp how the situation with the Williams twins had changed. Sadly, I wasn’t in any better shape now.</p> <p>“Instead of sticking around, maybe I should use this time to reach out to Chad,” I suggested. “Get a feel for where he’s at with this. I know we wanted to take the Williams twins together, but even if we get just one, it’ll hurt Pembry in a significant way.”</p><p>“Good plan.” She smiled. “It’ll do Rutledge some good to get better acquainted with me, don’t you think? If Ian’s led him to believe I’m an easy mark, it would be smart to prove otherwise now.”</p><p>I almost smiled at the thought of Jax and Lei butting heads. He was far too used to females falling all over him, for both his devastating good looks and his family name, which was as close to royalty as America got.</p><p>“I’ll do some digging after I talk to Chad—” I backed out of the room “—and see if I can find the connection between Pembry and the Rutledges.”</p><p>“Good.” She steepled her fingers together and rested her chin on the tips, studying me. “Forgive me for asking, Gianna—but did you love Jackson?”</p> <p>“I thought we loved each other.”</p><p>Lei sighed. “I wish that was one lesson women didn’t have to learn the hard way.”</p><p>Chapter 3</p><p>I GRABBED MY purse out of my desk drawer before I headed up to reception, clutching it like a talisman that would hurry me away from Jax before he realized who I was. The walk up to the front seemed to take a very long time.</p><p>It was a tough pill to swallow, realizing he still affected me so strongly. He’d only been part of my life for a short time. I’d had two other lovers since him and thought I had moved on.</p><p>He was studying a display of our bestseller cookbooks when I rounded the corner and my breath caught. His tall, powerful frame was now shown off to full advantage in an expertly tailored suit, a sign of respect for Lei I couldn’t help but appreciate. I’d never seen him dressed so formally in person. We’d met at a bar, of all places. I’d gone out with some classmates, and he was attending a bachelor party.</p> <p>I should’ve known it wouldn’t turn out well.</p><p>But God, he was magnificent. His dark hair was close-cropped on the sides and back, slightly longer on the top. His eyes were a brown so dark they were nearly black. Thickly lashed, they were relentless in their intensity. Had I really thought they were soft and warm? I’d been blinded by that lush, sensual mouth and wicked dimple. There was nothing soft about Jackson Rutledge. He was a hard and jaded man, cut from a ruthless cloth.</p><p>He raked me from head to toe with a slow, intense look that made my fingers flex as I approached him.</p><p>It was well-known that he was a connoisseur of women. I told myself I could be anyone and get that look from him, but I knew better. My body remembered him. Remembered his touch, his scent, the way his skin felt against mine...</p><p>From the way he was looking at me, the same recollections were heating his blood, too.</p><p>“Hello, Mr. Rutledge,” I greeted him formally, because he still hadn’t acknowledged that he knew who I was. I spoke each word carefully, in a controlled voice not quite my own. I usually didn’t have to think about sounding too Brooklyn anymore, but he made me forget myself.</p><p>He made me want to forget everything.</p><p>“Ms. Yeung will be out in just a moment,” I continued, deliberately stopping a few feet away from him. “I’ll show you to the conference room. Can I get you some water? Coffee? Tea?”</p> <p>His chest expanded with a deep breath. “Nothing, thank you.”</p><p>“This way, then.” I passed him, managing a strained smile for LaConnie as I walked by her. I could smell him, that subtle hint of bergamot and spice. I could feel his gaze on my back, my ass, my legs. It made me hyperconscious of my walk, which made me feel awkward.</p><p>He didn’t say a word, and I was afraid to, my throat too dry to make speech comfortable. I felt a terrible yearning—the almost desperate need to touch him the way I’d once had a right to. It was hard to believe I’d had him in my bed. Had him inside me. How had I ever had the courage to take on such a man?</p><p>I was relieved when we reached the conference room, the door handle feeling blessedly cool as I pushed it down.</p><p>His breath gusted softly over my ear. “How long are you going to pretend you don’t know me, Gia?”</p><p>My eyes slid closed as he purred the name only he had ever used.</p><p>Pushing the door open, I stepped inside, holding on to the handle so there was no mistaking that I wouldn’t be staying.</p><p>He walked right up to me, standing face-to-face. He was a little more than a head taller—even though I wore heels. His hands were in his pockets, his head bowed over me. He was in my personal space. Too intimate. Far too familiar.</p><p>“Please step back,” I said quietly.</p><p>He moved, but not in the way I wanted. His right hand slid out of his pocket, and then down my arm, from elbow to wrist. I felt his touch through the silk of my navy blouse and was grateful that the long sleeves hid the goose bumps.</p><p>“You’ve changed so much,” he murmured.</p><p>“Of course. Enough that you didn’t recognize me earlier.”</p><p>“Jesus. You think I didn’t know it was you?” He turned away, but that didn’t lessen his impact. The back view was just as splendid as the front. “You could never hide from me, Gia. I’d recognize you blindfolded.”</p><p>Shock and confusion held my tongue for a moment. We’d gone from distant and impersonal to searingly intimate in a heartbeat. “What are you doing here, Jax?”</p><p>He walked to the windows and looked out at New York. In the near distance, Central Park was a splash of green already touched with autumn-red and orange, a vibrant burst of color in a concrete jungle. “I’m going to offer Lei Yeung whatever it takes to make her go play in someone else’s sandbox.”</p><p>“It won’t work. This is personal.”</p><p>“Business should never be personal.”</p><p>I stepped back toward the threshold, eager to escape. The conference room was spacious and airy, with floor-to-ceiling windows on one side and clear glass on the other. The walls at either end were a soothing pale blue, with an expensively stocked bar to the right and a huge display screen to the left. Still, Jax dominated his surroundings, making me feel caged.</p><p>“Nothing’s personal, right?” I said, remembering how he’d just failed to show up one day. And every day after that.</p><p>“Things were between us,” he said, his deep voice husky. “Once.”</p><p>“No, they weren’t.” Not for you...</p><p>He turned abruptly, causing me to take another cautious step back even though we stood a room apart. “There are no hard feelings, then. Good. There’s no reason not to pick up where we left off. My meeting with Yeung won’t take long. When I’m done we can head to my hotel and get reacquainted.”</p><p>“Fuck you,” I snapped.</p><p>His mouth curved, revealing that delicious dimple. Oh, how that changed him, concealing how dangerous he was with a touch of boyish charm. I hated that playful little indentation as much as I adored it.</p><p>“There you are,” he said, with an unmistakable note of triumph. “You almost had me fooled into thinking the Gia I knew was gone.”</p><p>“Don’t toy with me, Jax. It’s beneath you.”</p><p>“I want you beneath me.”</p><p>I’d known he would say that, if I opened the door, but I’d had to hear it. I had to hear him spell it out. He was direct when it came to sex, sensual and natural as an animal. I loved it, because I’d been that way with him, too.</p><p>Greedy. Insatiable. Nothing else had ever made me feel as good.</p><p>“I’m seeing someone,” I lied.</p><p>Visually, he didn’t bat an eye, but somehow, I got the impression that struck a nerve. “That Williams guy?” he asked too casually.</p><p>“Hello, Mr. Rutledge,” Lei said, sweeping in on her killer Jimmy Choo slingbacks. “I’m going to assume this is a pleasant surprise.”</p><p>“It can be.” He turned his attention to her so completely, I felt dismissed.</p><p>“I’ll leave you two to it,” I said, walking out. Lei’s gaze caught mine and I understood the silent message. We’d be talking soon.</p><p>I didn’t look at Jax again, but I still got the same message from him.</p><p>I CALLED CHAD WILLIAMS as soon as I passed through the turnstiles in the lobby. “Hey,” I said when I heard his smooth Southern drawl. “It’s Gianna.”</p><p>“I was hoping you’d call.”</p><p>“Do you have dinner plans?”</p><p>“Ah—I can break them.”</p><p>I smiled, feeling a little guilty about preempting whoever was going to be ditched, but it felt good to have a little ego-stroking. My confidence had taken a beating from seeing Jax again.</p><p>I couldn’t forget how he’d been with me long ago. Frisky, teasing, affectionate. If I closed my eyes, I could still feel him come up behind me, sliding my hair out of the way to press his beautiful mouth against my throat. I could still hear the way he’d groan my name when he was inside me, as if the pleasure were too great to stand.</p><p>“Gianna? You still there?”</p><p>“Yeah, sorry.” I started pulling out the pins that restrained my straightened hair into a sleek chignon. “I know a charming Italian place. Cozy. Casual. Excellent food.”</p><p>“You’ve got yourself a date.”</p><p>“I’ll call the car service. I can pick you up in about fifteen minutes. Will that work?”</p><p>“I’ll be waiting.”</p><p>TRUE TO HIS WORD, Chad was standing on the sidewalk when the car pulled up. He wore loose-fitting black jeans, boots and a dark green Henley that went great with his eyes. As far as dates went, he was prime.</p><p>He started toward the cab, then jumped back with a curse as a bike messenger sped by.</p><p>“Christ almighty,” he muttered as he settled into the seat beside me. He looked me over as we merged back into rush-hour traffic. “I like your hair down. It suits you.”</p><p>“Thank you.” It’d taken me a while to get used to wearing it up. It was so thick and heavy, the weight of it gave me headaches...like the one I had at that moment.</p><p>“So,” I began, “I have to confess—”</p><p>“Hope it’s sinful.”</p><p>“Uh, no. I’m taking you to my parents’ place.”</p><p>His brows rose. “You’re taking me to meet your folks?”</p><p>“Yep. They own a restaurant. We won’t have trouble getting a table without a reservation—usually impossible on a Thursday night—and they won’t rush us off, either.”</p><p>“You planning on keeping me around awhile?” he teased.</p><p>“I’d like to. I think we could work really well together.”</p><p>Chad nodded, sobering. “Stacy knows what you’re offering is exactly what we need, but...she’s sleeping with Ian and it’s screwing everything up.”</p><p>“I figured.” Ian Pembry was a suave and distinguished fifty-year-old man with silvery gray hair and striking blue eyes. He wasn’t handsome in the usual sense, but he had charisma and a bank balance that made a lot of women overlook his flaws. Stacy had her work cut out for her; since Lei, he’d never stayed with any lover long. “What’s he offering you to stay with him?”</p><p>And where does Jax fit in? Had seeing me knocked him for a loop at all?</p><p>“Ian says he can put something together like you’ve presented and he can do it better, because Lei doesn’t have what it takes. That’s why she’s poaching his talent.”</p><p>“You know that’s crap.”</p><p>“I do, yeah.” He smiled. “You wouldn’t be working for her if she was second-rate.”</p><p>“And the Mondego resort chain is five-star all the way,” I reminded him. “They wouldn’t work with someone second-rate, either. This is the opportunity of a lifetime, Chad. Don’t let Stacy take it away from you.”</p><p>“Goddamn it.” His head fell back against the seat rest. “I don’t think we can make it separately. That’s why the idea of the dueling kitchens was going to work.”</p><p>“It will work. But you can do it on your own, too.”</p><p>He looked at me, his gaze searching. “Give it to me straight, Gianna. You’ll say anything to close this deal, won’t you?”</p><p>I thought about Jax and what he’d said about business not being personal. For me it was always personal. I cared.</p><p>“I’ve got my reasons,” I admitted, Jax now being one of them. I’d worked too hard to have him stroll in, toss his money around and ruin everything. “But I wouldn’t screw you over. It doesn’t get Lei or me anywhere if you’re not successful. I promise you, I won’t disappear as soon as the ink is dry.”</p><p>“And now I’ll know how to track you down through your folks,” he said, relaxing.</p><p>“Over thirty years in the same location.”</p><p>“I guess that’s as good a guarantee as anyone can get.”</p><p>MY FAMILY PULLED out all the stops when we got to Rossi’s, deducing who Chad was from my previous descriptions. We were seated at a corner table and everyone came by to introduce themselves, giving Chad a heaping dose of Rossi hospitality.</p><p>I had Chad take the bench seat facing the rest of the restaurant, while I took the single chair across from him. I wanted him to feel the energy, to see the faces of customers enjoying a great meal. I wanted him to remember why he wanted what Savor was offering him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Over a toast, he said, “You’re right. This place is great.”</p><p>“I’m never going to lie to you.”</p><p>He laughed, and I enjoyed the sound. It was a bit wild, a lot free. Very much like the man himself. I was attracted to him on a comfortable level. Nothing like the explosion of body and mind I’d felt from the very first second I’d laid eyes on Jax, but then no one elicited that reaction but Jackson Rutledge.</p><p>“Smart bringing me here,” he said, running his fingertip around the lip of his wineglass. I suspected he’d prefer beer, but he didn’t ask for it. “Making me see you’ve got the business in your blood, too. It’s not just a job.”</p> <p>“My family just opened our second Rossi’s in Upper Saddle River.”</p><p>“Where’s that?”</p><p>“New Jersey. Posh as hell. My brother Nico is spearheading it. Just passed the three-month mark.”</p><p>“So why not hook your family up with the Mondego?”</p><p>“It’s not what they want. They want this—” I gestured around the restaurant with a sweep of my hand. “Community. Franchising was never their dream.”</p> <p>He studied me. “You make it sound like your dreams are different.”</p><p>I sat back. “I suppose they are. I want to help them get what they want, but I want something different.”</p><p>“Like what?”</p><p>“I haven’t found it yet.” Although I thought I had. Once upon a time... “I figure I’ll know it when I see it.”</p><p>“Maybe I could help you pass the time while you’re waiting,” he suggested boldly.</p><p>I smiled. “It’s an idea, isn’t it?”</p> <p>Maybe he was what I needed. It’d been too long since my last boyfriend. I’d been working hard, leaving little time for socializing. I didn’t fool myself into thinking I would magically have immunity to Jax if I got laid, but it wouldn’t hurt. It would certainly take the edge off life in the interim, and Jax wouldn’t be staying in New York long. His life and work was split between D.C. and northern Virginia, and soon enough, another Rutledge would need him for something. He was the family fixer.</p><p>I leaned forward, opening myself to the possibilities.</p><p>Chad’s mouth curved in a very male smile, the slightly triumphant one of a man who knew he was going to score. He reached for my hand, his gaze drifting over my shoulder in a lazy way. Then he stilled, his brows lowering in a scowl. “Fuck.”</p><p>I knew who he was looking at before I turned around.</p><p>Chapter 4</p><p>AN ALL-TOO-FAMILIAR CHARGE swept over my skin. I decided not to turn and give Jax the satisfaction of seeing my face, which probably showed my surprise, frustration and irritation.</p><p>He had cast-iron balls to come into Rossi’s after the way he’d broken my heart. My family would remember him—remember that last night we’d all spent together. We’d been in New York on a quick weekend trip to introduce him to the family I talked so much about. We’d stayed long after the restaurant closed, eating and drinking and laughing with my brothers and my parents. They’d fallen in love with him just as I had. That was the night I’d come to believe we were in it for the long haul.</p><p>I hadn’t seen him again until he’d walked into the bar at the Four Seasons.</p> <p>Chad looked at me. “You invited Stacy, too?”</p><p>“No.” Confused, I finally looked over my shoulder. Seeing Jackson helping Stacy out of her jean jacket made my teeth grind. Chad hadn’t known where we were going, but Jax had guessed.</p><p>And sure enough, he made a beeline toward us with Stacy. My mom got in their way, her smile wide as ever but proverbial feathers ruffled in full mother-hen mode.</p><p>I looked at Chad. “We could sneak out the back.”</p><p>He laughed, but his eyes were hard.</p><p>Angelo came over. “Is he meeting you?” he asked, jerking his head toward Jax.</p><p>“No...” I looked at Chad. “They don’t have to sit with us.”</p><p>“Good.” He sat back, glaring. “Talk about keeping the wrong company. Stace can go ahead with Ian’s deal, if she wants. I’m sticking with you and the Mondego.”</p><p>“All right.” Angelo looked at me. “I’ll make sure they’re seated somewhere else.”</p><p>I took a gulp of my wine as my brother walked away.</p><p>Chad studied me for a moment. “He has your back.”</p><p>“That’s the Rossi way.”</p><p>“Stace and I used to be like that. Before Ian showed up.”</p><p>“Really?” I tried to ignore the sensation of Jax’s gaze. I could feel him looking our way. “What happened?”</p><p>He shrugged. “Hell if I know. It all went to her head. I don’t even know if she thinks about the food anymore. She’s too busy trying to be rich and famous.”</p><p>My mom came by with more wine, setting her hand on my shoulder as she refilled our glasses. I felt the gentle press of her beautifully manicured nails and heard the silent question: Are you okay?</p><p>I set my hand over hers and squeezed, answering. I wasn’t okay, but what I could say? I wouldn’t give Jax the satisfaction of refusing him service and neither would my family. He’d get excellent food, our best server and complimentary wine of his choice.</p><p>They’d pull out all the stops. Kill him with kindness. Show him that we weren’t petty and small. But oh, what it would cost us. All of us. My safe place felt invaded, his potent energy permeating the space and my senses. Every nerve tingled with awareness.</p><p>Lori, one of the waitstaff, came over to take our order. Chad and I decided to split the pasta for two. All through the appetizer and salad courses, I was expecting Jax to come over. I was terribly aware of him, unable to give Chad the attention I’d been able to before. He was subdued, too, his gaze staying firmly on his food or on my face, both of us studiously avoiding looking at other patrons.</p><p>In my mind, I was certain Jax was having a wonderful time just to spite me. Why was he taking Stacy out when she was Ian’s latest fling? Or was she freely available to both of them? After all, she’d showed no hesitation and a lot of pleasure in kissing Jax’s cheek when he first showed up.</p><p>Just before the main course was served, Chad excused himself to go to the bathroom, and I checked my smartphone. I’d missed a call from Lei. When Chad came back with a beer in hand, I smiled and said, “I’ll be right back.”</p><p>I headed toward the bathrooms, but ducked into the back office instead, closing out the noise when I shut the door behind me. I speed-dialed Lei and set the phone to my ear.</p><p>“Gianna,” she answered. “I have to applaud you for your choice in men.”</p><p>“Can I pick ’em or what?” I walked over to the far wall where a family portrait hung. I’d been around twelve years old in the picture with braces on my teeth and wild hair. Nico, Vincent and Angelo had been varying degrees of gangly. My dad was immortalized in his prime, as was my mother, who’d aged little since. “How’d it go?”</p><p>“As expected. You guessed right, by the way. Jackson said he’s stepped in as a favor for someone.”</p><p>“I haven’t had a chance to dig for more details, I’m sorry—I’ve been with Chad since I left—but it’s probably a Rutledge. When Jackson’s not gambling with millions, he’s cleaning up after family members à la Olivia Pope.” And dating beautiful women... “As for Chad, he’s on board, but I think we’d be wise to get a new contract drawn up ASAP before something happens to change his mind. Jax isn’t going home gracefully. He crashed the dinner hour at Rossi’s, bringing Stacy along for the show.”</p><p>Lei laughed. “I’m sorry, but I like him.”</p><p>My mouth quirked ruefully. “Happens.”</p><p>“Ian called.”</p><p>“Oh? How’d that go?”</p><p>“He asked if I’d see him tonight.”</p><p>“Ah. Maybe that’s why Jax has Stacy. Babysitting duty.” Irritatingly, that filled me with relief.</p><p>“Could be. I said no in any case. I feel like our men are circling the wagons, which means we need to keep doing what we’re doing. Honestly, I haven’t had this much fun in years.”</p><p>Our men. I snorted and turned in time to see the door opening...and Jax appearing. “I have to go, Lei, but I’m here if you need me.”</p><p>“We’ll hit it again fresh in the morning. Good night, Gianna.”</p><p>“You, too.” I set my phone aside.</p><p>We sized each other up for a long minute. He was wearing the gray sweater and slacks from earlier in the day, the casualness more familiar—and beloved. A lock of his dark hair fell over his brow, softening the severity of his beauty. He had his back against the door, his hands in his pockets, his legs crossed at the ankles. But only an idiot would fail to sense the predatory alertness in him. His hooded gaze was watchful and knowing, seeing way too much.</p><p>“I miss the curls in your hair,” he said finally.</p><p>I backed up to my father’s desk, resting my butt against it. I crossed my arms. “That’s a seriously delayed response.” A couple years too late...</p><p>“You were closing in on the kill when I got here. Are you thinking about fucking Chad Williams because you want to, or because you want him to sign on the dotted line?”</p><p>Some other woman might have held her tongue because the question didn’t deserve an answer. I didn’t say anything because I was too hurt. I’d never seen Jax deliberately mean or cruel—he’d just disappeared from my life.</p><p>“Gia...”</p><p>“Don’t call me that.”</p><p>“What would you prefer?”</p><p>My foot tapped restlessly. “I’d rather not see or hear from you.”</p><p>“Why not?”</p><p>“I would think that’d be obvious.”</p><p>His wonderfully sensitive mouth tightened. “Not to me. We know each other. We get along well. Very, very well.”</p><p>“I’m not fucking you again!” I snapped, feeling the walls close in on us. He’d always had that effect on me. When he was with me, I didn’t register anything else.</p><p>“Why not?”</p><p>“Stop asking me that!”</p><p>Jax straightened, and the office got even smaller. My breathing quickened, my gaze darting to the door at his back.</p><p>“It’s a valid question.” He engaged the lock without taking his eyes off me. “Tell me why you’re so angry.”</p><p>A surge of panic got the better of me. “You fell off the face of the earth!”</p><p>“Did I?” He took a step toward me. “Are you saying you didn’t know how to find me?”</p><p>I frowned, confused. “What are you talking about?”</p><p>“It had to end, and it did.” He came closer. “Quietly. No messy scenes. No ugly memories. We—”</p><p>“Neat and tidy.” I sucked in a sharp breath, more wounded than I could say. I lashed out in self-defense. “So why rehash and screw it up?”</p><p>“Can’t we be friends?”</p><p>“No.”</p><p>Jax stepped into my space. “Can’t we do business together?”</p><p>“Nope.” I unfolded my arms, feeling the need to take the defensive. “You made this personal from the get-go.”</p><p>He smiled, flashing that damned dimple. “You’re sexy as hell when you’re mad at me. I should’ve pissed you off more often.”</p><p>“Back off, Jax.”</p><p>“I did. It didn’t take.”</p><p>“Actually, it did. Go back to your world and forget me again.”</p><p>“My world.” The smile faded along with the light in his eyes. “Right.”</p><p>He’d stopped his advance, so I skirted him quickly, aware that I had been gone too long and Chad was waiting.</p><p>Jax caught my arm, his hand flexing around it. He spoke in my ear. “Don’t fuck him.”</p><p>I shivered. We stood shoulder-to-shoulder, facing in opposite directions, which mirrored our entire relationship. I smelled him, felt his warmth, was reminded of other occasions when he’d whispered in my ear.</p><p>Jax knew how to seduce and he never shirked the effort. Even when I’d been a sure thing, he’d get me hot long before he took me to bed. Giving me long, searing looks, touching me often, murmuring naughty promises that made me blush.</p><p>“Are you celibate, Jax?” I retorted.</p><p>“I will be, if you are.”</p><p>A harsh laugh burst out of me. “Yeah, right.”</p><p>He held my gaze. “Try me.”</p><p>“I’m not interested in playing games.”</p><p>The doorknob rattled, making me jump. “Gianna? Are you in there?”</p><p>Vincent. “Yes,” I called out. “Hang on.”</p><p>“Don’t fuck him,” Jax repeated, his eyes dark and hard. “I mean it, Gia.”</p><p>I shook free and fumbled the lock open, pulling the door wide.</p><p>My brother paused with the office key in his hand, then glared over my shoulder at Jax. “You got a death wish, Rutledge?”</p><p>Rolling my eyes, I pushed Vincent back. “Leave it alone.”</p><p>“Sniff around somewhere else,” Vincent went on, blocking the doorway as soon as I moved out of the way.</p><p>I briefly considered intervening, then decided against it. They were big boys. They could figure it out by themselves.</p><p>When I got back to the dining room, I found a large to-go bag sitting on the table in front of Chad, who stood when he saw me.</p><p>“What do you think about taking this back to the hotel and eating in peace?” he asked.</p><p>I looked around the dining room, easily spotting Stacy’s bright hair gleaming in the muted glow of the wrought-iron chandeliers. She was staring daggers at Chad and me.</p><p>“I’ve got a better idea,” I said, grabbing my belongings. “I know someplace we can go where no one will find us.”</p><p>I TOOK HIM to my sister-in-law Denise’s beauty salon in Brooklyn. She closed up shop, found some paper plates and we feasted on lukewarm-but-still-delicious ragù bolognese in the stylists’ lounge in back, away from the smells of dye and hair spray. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’ve got a New York accent,” Chad noted after we’d been swapping crazy customer stories for a while. “I never noticed before.”</p><p>I shrugged. “Yeah. As heard on TV in ten thousand cop shows.”</p><p>Chad laughed.</p><p>“It’s because she’s on her own turf,” Denise explained.</p> <p>I didn’t add anything. No biggie that he’d noticed. The accent always came out when I was hanging with family or friends, when my defenses were relaxed and I felt more like the me I used to be.</p><p>“It’s cute,” he teased, exaggerating his own. “Y’all know I’ve got one, too.”</p><p>“She’s gotten good at hiding it,” Denise said, her platinum hair with hot pink tips arranged into artful braids. She had piercings in her nose and brow, and a sleeve of tattoos on her left arm. She was also five months pregnant and just beginning to show. I was so excited about that. I was dying to be an aunt.</p><p>My smartphone started ringing in my purse, and I reached over to the counter to dig it out. Maybe Lei needed me after all. She hadn’t been kidding about the hours when she’d hired me. I’d had 2:00 a.m. calls and weekend calls, but I loved them all because those happened when she was really pumped about something.</p><p>Looking at the screen, I didn’t recognize the New York number and was about to let it go to voice mail when I decided to indulge Chad with my accent a little more.</p> <p>“Gianna Rossi’s office,” I answered naturally. “How can I help you?”</p><p>Silence greeted me, then... “Gia.”</p><p>I held my breath, rocked by the way Jax said my name. The way he used to when we were lovers and he’d call just to hear my voice.</p><p>“Say something,” he said gruffly.</p><p>Fortified by the sight of my stricken face in the unforgiving mirror, I replied with chilly calm. “How did you get this number?”</p><p>“Give me a break,” he snapped. “Talk like you used to. The real you.”</p> <p>“You’re the one who called me.”</p><p>He bit out something under his breath. “Have lunch with me tomorrow.”</p><p>“No.” I slid out of the chair and walked toward the front of the beauty shop.</p><p>“Yes, Gia. We need to talk.”</p><p>“I don’t have anything to say to you.”</p><p>“Then listen.”</p><p>I rubbed the tip of my stiletto over a crack in a floor tile. Denise had just started turning a profit and there were improvements she wanted to make to the shop. Still, the location was newly hip again and she’d been smart to go with gorgeous vintage pinups on the walls and great retro décor that distracted the eye from minor flaws.</p><p>God, I was a mess over Jax. My scattered brain was bouncing random thoughts all over the place.</p> <p>I focused on the man driving me crazy. “If I have lunch with you, will you go away and leave me alone?”</p><p>“I won’t promise that.”</p><p>“Then I won’t go,” I countered. “You’ve got no right to invade my life like this. None of this is your business. You shouldn’t be butting in—”</p><p>“Damn it. I didn’t know you were in love with me, Gia.”</p><p>My eyes closed against the pain of hearing those words from his lips. “If that’s true, you didn’t know me at all.”</p><p>I hung up.</p><p>Chapter 5</p><p>“I FOUND SOMETHING tying Pembry with the Rutledges,” I told Lei first thing Friday morning, following her into her office as she arrived for the day. “An article in FSR magazine.”</p><p>She glanced aside at me. “How long have you been here?”</p><p>“Half an hour, maybe.” But I’d been up late doing my homework, unable to sleep. I needed to know why Jax was meddling in my life and how to get him back out of it again.</p><p>I didn’t want an apology from him or an explanation. I didn’t want to be friends. I didn’t want any reason to hope, because it’d become painfully obvious to me that I was still in love with him. And now, he was becoming aware of it, too.</p><p>I’d learned my lesson the first time, and he’d confirmed it—our relationship had to end at some point. No do-overs.</p><p>I slid the article from Full-Service Restaurant across her desk. “A tiny mention of Pembry supporting and contributing to Rutledge campaigns in a bigger piece on restaurateurs and politics.”</p><p>“Hmm.” Her astute gaze lifted to meet mine. “I lived with Ian for five years. He never once voted in any election. And he’s too much of a tight-ass to spend the kind of money it takes to get the Rutledges’ personal attention.”</p><p>Lei leaned back, twisting her chair side to side. “That said,” she went on, “I can’t see a venture capitalist taking an interest in Ian’s business over mine without some personal motivation. It doesn’t make fiscal sense.”</p><p>Lifting my hands, I admitted, “I don’t get it, either.”</p><p>“Would Jackson tell you what sparked his interest in Ian if you asked him?”</p><p>“Maybe.” I took a seat in front of her desk. “But he’s not the deciding factor here. Stacy prefers Ian. Chad prefers us. We’ve got a grip on this.”</p><p>“Aren’t you curious?”</p><p>“Not enough to go out of my way to talk to him. He’s starting to realize I took our fling more seriously than I should have and that’s...awkward.”</p><p>Lei’s gaze was warm with sympathy. “I guess the best solution is to get this wrapped up. I’m talking with the team at Mondego today about moving forward with just Chad. They’re not as excited—no surprise there—but I think I have an appealing alternative.”</p><p>I leaned forward, and she smiled at my eagerness.</p><p>“These two.” She swiveled her monitor around to face me, revealing two very different women. One darkly exotic, the other a fresh-faced blonde. “I’ve been keeping my eye on them for a few months now. Isabelle, the brunette, specializes in regional Italian, while Inez, the blonde, has a flair for regional French.”</p><p>A soft laugh bubbled up. “Dueling kitchens international.”</p><p>“More work to get the menu right, but when you can’t deliver two, up the ante to three.”</p><p>“Awesome.”</p><p>Lei rubbed her hands together. “With any luck, we’ll still be cracking open bottles of bubbly.”</p><p>I heard my desk phone ringing through the open door and stood.</p><p>She pushed her phone over to me. “You can get that here.”</p><p>Picking up the receiver, I hit the button for my line and answered.</p><p>“Miss Rossi, Ian Pembry. Good morning.”</p><p>I raised my brows and mouthed Ian to Lei. Her mouth curved.</p><p>“Good morning, Mr. Pembry. I was just thinking about you.”</p><p>“I was waiting for you to call, then I got impatient.” The warm amusement in his voice hit me the way I suspected it hit most women. There was no doubt about it; he had a great bedroom voice.</p><p>“Would you be available for lunch sometime?” I asked, shooting a look at Lei to make sure she’d be okay with it. She nodded.</p><p>“I’m flattered you’d choose me over Jackson,” he said, putting my back up. “But I was hoping for dinner instead. I have an engagement tonight and I need a date.”</p><p>Reaching over, I hit the speaker button. “What about Stacy?”</p><p>“She’s wonderful, of course, but I’d prefer to take you. You’ll want to come along, Lei,” he posited, addressing her directly, “and look out for your girl, which is fine. The more the merrier. It’s a formal event. Be at the Midtown heliport by six.”</p><p>Lei grinned, clearly enjoying the exchange although she didn’t reply.</p><p>“You’re assuming I don’t have plans on a Friday night,” I said.</p><p>“Don’t be offended, Miss Rossi.” He sounded amused. “It’s a compliment on your dedication. Lei wouldn’t have hired you if you didn’t put the job first. See you tonight.”</p><p>The line clicked off, and I set the receiver back in the cradle. “Well...what do you think?”</p><p>“I think we need to go shopping.”</p><p>WHEN I RETURNED to my desk, I found a package waiting.</p><p>I ripped into the brown paper wrapping and discovered a foiled box of chocolates inside. The surge of desire that pierced me at the sight of that particular brand—Neuhaus—and the memories it evoked quickened my breathing. My skin heated.</p><p>I’d had the Belgian truffles only once before, when I’d sucked them off the tips of Jax’s fingers. He’d melted them with the heat of his touch...then painted words over my body that he’d licked off with wicked lashes of his tongue.</p><p>Sexy Gia. Sweet. And my favorite—mine.</p><p>My thighs clenched, and I crossed my ankles, my core tightening in greedy demand. My body didn’t care that he’d dumped me without a word. It wanted Jax. Desperately.</p><p>The note attached was simple and unsigned.</p><p>I’d know you blindfolded.</p><p>I COULDN’T TELL you where Lei took us to buy gowns. It was a small, unmarked storefront that had a permanent Closed sign on the door. Appointments only. The moment Lei’s town car pulled up out front, we were ushered inside a showroom of quiet luxury and served champagne with ripe strawberries. There were no price tags in evidence anywhere.</p><p>The next hour passed in a blur of silks and taffetas. I was dazzled.</p><p>There had been times working with Lei that I had been exposed to a world far beyond anything I knew. I always struggled to hide my wide-eyed awe on such occasions, striving to take my cues from Lei, who seemed so natural and at ease. I had to remind myself that her background wasn’t so different from mine. She’d acquired polish over the years and so could I.</p><p>I was eyeing a black gown with lace cap sleeves when Lei set her hand on my shoulder.</p><p>“That’s too old for you,” she said.</p><p>I glanced at her. “I think it looks understated and elegant.”</p><p>“It does, for a woman my age. You’re twenty-five. Enjoy it.”</p><p>“I have to be careful,” I explained. My boss was slender as a reed, graceful and lithe. I was too curvy. “My boobs are too big. And so is my butt.”</p><p>“You’re sexy,” she asserted bluntly. “You play it down at work, which I understand and appreciate, but don’t waste it. It’s a terrible myth that a successful woman can’t be sexy without it ruining her credibility. Don’t buy into it.”</p><p>I caught my lower lip between my teeth. Looking around the showroom, I was intimidated by the reek of wealth it exuded. I was out of my league. The walls were draped in billowing ivory silk, for Christ’s sake, instead of wallpaper. And the finger sandwiches they had just brought out were sitting on a platter I was positive was pure, heavy silver. “Can you help me? I’m afraid I’ll make the wrong choice.”</p><p>“That’s what I’m here for, Gianna.” She gestured at one of the three women helping us. “Let’s see what you’ve got for young, beautiful and voluptuous.”</p><p>THE WHISTLES I got when I stepped out of my bedroom a few hours later both excited me and made me nervous. Denise had come home early to do my hair, bringing Pam, one of her stylists, with her to do my makeup. Angelo was sprawled across the couch watching stuff he’d recorded on the DVR, passing the time until his eight o’clock shift at Rossi’s.</p><p>“Wow,” my brother said, sliding up into a sitting position. “Who are you and what have you done with my sister?”</p><p>“Shut up,” Denise and I retorted in unison.</p><p>“She looks like a movie star,” Pam said, returning from the kitchen, where she’d been cleaning her cosmetic brushes. “One of the real goddesses, I’d say. A Raquel Welch or Sophia Loren.”</p><p>“Who?” Denise frowned.</p><p>But I got it. I’d always thought of my mom the same way.</p><p>The gown we’d chosen in the end was still black, but much sexier. A jeweled brooch held the one shoulder strap together, with inky satin ruched across the bust, cinched at the waist with a thin diamond belt, then slit down the right leg from midthigh to hem. It occurred to me that it was a good thing Vincent was already at Rossi’s. He might’ve freaked a little at how much of my legs were showing. Nico, who was living in Jersey now, would’ve loved it.</p><p>Denise plopped down on the sofa with two beers in hand, passing one over to her husband and setting the other on the coffee table for Pam. She’d been sticking religiously to water and fruit juice since she had found out about the baby.</p><p>Gold hoops glittered from between the crimped mass of her hair. “Is Chad going, too?” she asked.</p><p>“I have no idea.”</p><p>“Is Jax?” Angelo added tightly.</p><p>I shrugged, but my pulse leaped. I had tried not to think about Jax when I’d been getting ready, but I couldn’t help hoping he could see me dolled up. I looked hot.</p><p>“You know better,” he warned.</p><p>“Yeah,” I agreed, “I do.”</p><p>My smartphone rang, and I knew Lei’s driver had arrived. “Gotta run!”</p><p>I hurried across the refinished hardwood of our joint loft to grab my heels, clutch and wrap from the bench by the door, waving at Pam before I exited through the open sliding front door. I skipped the temperamental old freight elevator and took the three flights of stairs to reach the street. Lei’s driver was used to the delay.</p><p>Nico, Vincent and Angelo had bought the loft with the expectation of fixing it up and selling it for a profit. I’d moved in after college and eventually bought Nico’s share when he moved to New Jersey. Then Vincent and I had split the cost of Angelo’s share when he’d moved out with Denise, giving the two of us 50 percent stake each. We’d been considering selling out when Denise found out she was pregnant, and she and Angelo moved back in to save money.</p><p>I liked coming home to a full house and missed Nico. I wasn’t sure what I’d have done with myself living alone. I think having someone around all the time had helped me focus on work and date less than I normally would have. I’d been comfortable with that, but maybe I had just been hiding from the fact I was nursing a broken heart. Maybe I should’ve faced that sooner. Certainly it was time to face it now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Breathless from the rush, I slid into the open backseat of the town car and we headed to Lei’s. Her part of New York was a lot different from mine. She lived in Manhattan, a bridge distance away that could’ve been another world. We crossed the East River with the sun still hanging in the sky, the light’s reflection on the water broken by an industrious towboat.</p><p>It amazed me that I’d once believed Jax could fit in here. I had come to associate him so completely with D.C. that I could no longer imagine him anywhere else.</p><p>Except my bed. I had no trouble imagining him there....</p><p>I WAS CONSIDERING how best to finagle information out of Ian Pembry when the car pulled to a stop in front of Lei’s apartment building.</p> <p>I’d seen her dress earlier, but it had a whole new impact with the hair and makeup to match. Emerald-green and Grecian in design, it glided over her willowy body as she exited her apartment building with a smile for her doorman. The rich hue of her gown showed off her flawless pale skin and emphasized the red of her lips, while a beautiful jeweled clip accented the silver strands at her right temple.</p><p>She settled on the seat beside me and I immediately caught her tension.</p><p>“You okay?” I asked.</p><p>“Sure.”</p><p>We were quiet as we took the short ride to the heliport, both of us lost in our own thoughts. Turning a corner, my gaze caught on a dog park and the boisterous furry bodies running wild and free inside it. Their playful exuberance and undisguised pleasure made me smile, despite the somber turn my reflections had taken all day.</p> <p>I hated to admit it, but I was hurt that Ian knew about Jax inviting me to lunch. When Jax had called, I’d thought the request had come from the heart. I had believed it was personal, that he truly wanted to connect with me, even if it was only to apologize. I guess I’d always expected too much from Jax. When it came to him, my instincts were seriously faulty.</p><p>By the time we were strapped into a helicopter and lifting into the air, my attention had turned outward to Lei. She stared out the window as the ground dropped farther away, laying the city out for us in a spectacular blanket of setting-sun-drenched concrete and sparkling glass. I followed suit, absorbing the panorama. The entire day had been reflective of my experience working with Lei. My family had a microscopic view of the world and they liked it. I’d always wanted something bigger, a view with a much wider lens.</p><p>“Do you know where we’re going?” I asked.</p><p>She shook her head. “Ian’s making a point with this outing. I expect we’ll be wowed.”</p><p>AROUND EIGHT O’CLOCK I found myself exiting a limousine in front of a sprawling mansion in D.C. I’d been growing more anxious by the mile, starting when we boarded a private jet at the airport and increasing exponentially when the flight attendant advised us of our destination.</p><p>“He’s outdone himself,” Lei muttered as Pembry descended the sprawling home’s wide front steps to greet us.</p> <p>The restaurateur looked impressively dapper in a classic tuxedo, his silvery-gray hair slicked back. He greeted me first by kissing the back of my hand, then turned his blue eyes onto Lei.</p><p>“You’re toying with one of my people,” she said coldly, watching impassively as he lifted her hand to his mouth. “You never used to be cruel.”</p><p>“I used to have a heart,” he drawled, “and then someone broke it.”</p><p>My gaze darted between the two, trying to read the vibrating tension between them. I got the sense I was being played and that everyone understood the rules but me.</p><p>Fine. If I kept my mouth shut and my ears open, I could catch up.</p><p>Ian turned and offered me his arm. “Shall we?”</p><p>He led me up the front steps with Lei trailing behind. A glance back at her proved she did so regally, her head held high on that long neck I envied. Light spilled out of the open double doors and limousines discharged their passengers in steady waves behind us. It was an amazing party and I hadn’t even crossed the threshold.</p><p>“I trust the flights were pleasant,” he said.</p> <p>I glanced at him and found him watching me too carefully. “Yes, thank you.”</p><p>“Have you been to D.C. before?”</p><p>“My first time.”</p><p>“Ah.” He smiled, and I could see a hint of his charm. “Maybe you’ll consider spending the weekend. I have a town house in Georgetown. You’re welcome to use it.”</p><p>“That’s kind of you.”</p><p>Laughing, he unlinked our arms and set his hand at the small of my back, urging me through the doors before him. “I hope you’ll say more than a few words at a time as the evening progresses, Miss Rossi. I’d like to get to know you, especially since both Jackson and Lei have taken such an interest in you.”</p><p>My steps slowed when I saw what looked to be a receiving line. “What is this event?”</p><p>“A private fund-raiser,” he murmured near my ear.</p><p>I suddenly understood what Lei had meant by cruelty. “For a Rutledge?”</p><p>Amusement colored his voice. “Who else?”</p><p>Passing through the receiving line went quickly, with brisk handshakes from the men and slightly warmer handclasps by the women. All of them were perfectly groomed, without a hair out of place, and all had big practiced smiles with blindingly white teeth.</p><p>I was glad to get through and accept a glass of champagne from the tray of a smiling waiter. I was even happier to see Chad, who looked as uncomfortable as I felt. His face brightened when he saw us, familiar faces in an unfamiliar crowd, and he headed our way.</p><p>“I took the liberty of pairing Chad with you, Lei,” Ian said, his gaze sliding over her.</p><p>I searched the room for Jax. I didn’t see him, but then there were so many people milling around the ballroom we’d been shown to. A ballroom, for God’s sake, in someone’s house.</p><p>Who lived like this?</p><p>I swallowed a large gulp of the cool wine in my glass. Jax lived like this. The sleek businessman I’d seen at Savor fit in here, but not the lover I’d known.</p><p>You only thought you knew him....</p><p>Chad came up to me, sliding one finger beneath the collar of his dress shirt. “Can you believe this? I just met the governor of Louisiana. And he knew who I am!”</p><p>Ian’s smile was smug. But I still didn’t get it.</p><p>“How do politics and the food-service industry mix?” I asked him.</p><p>“Strange bedfellows, I admit.” He took my empty glass and swapped it for a fresh one as a waiter walked by. “But everyone eats.”</p><p>“Not everyone votes,” Lei said, catching her own glass.</p><p>“You were always much more conscientious about that than I,” Ian agreed. “What about you, Gianna? I can call you Gianna, can’t I? Do you exercise your right to vote?”</p><p>“Isn’t politics one of those topics it’s wiser not to discuss?” I eyed a passing tray of hors d’oeuvres and realized my nerves were too shot to even consider food.</p><p>“Why don’t we dance instead?” he suggested.</p><p>Figuring it might be a rare chance to speak to him alone, I agreed. Chad took my glass of champagne and downed it.</p><p>“I’ll warn you that I’m not a great dancer,” I told Ian as he led me over to the area reserved for dancing. I’d taken a few classes to build my confidence, but I never had a chance to dance formally outside of the studio and little time to practice anything beyond the basic steps. I had definitely never danced to a live orchestra before.</p><p>“Just follow my lead,” he murmured, pulling me close.</p><p>We blended into the few couples on the floor.</p><p>I was so focused on not stepping on his feet that I didn’t say anything for the first minute or so.</p><p>“Tell me how you know Jackson,” he said.</p><p>“I don’t know him.” And that was the truth, in every way that mattered.</p><p>Ian’s brows rose, his blue eyes searching my face. “Yesterday wasn’t the first time you’d met.”</p><p>“Since I’m sure you knew that before you brought him into the mix, I’m more interested in how you two know each other.”</p><p>“I know his father, Parker Rutledge. He introduced us.” He looked past me. “Speak of the devil.”</p><p>My spine stiffened. I turned my head, my steps faltering as I watched a man who looked eerily like Jax dancing with a very pretty younger woman.</p><p>The urge to leave the event was insanely strong. I had no business at a political fund-raiser, no place in a world that had nothing at all to do with my own. I couldn’t figure out how a pair of twin chefs had led me to this point in time and didn’t really care to puzzle it out at the moment anyway. A sinking feeling that the night would go from bad to worse was getting stronger.</p><p>“What was the reason you brought us here, Ian?”</p><p>He countered with a question of his own. “How ambitious are you, Gianna?”</p><p>“I’m loyal to Lei.”</p><p>He smiled. “I was, too. Unfortunately, you won’t find her to be as faithful in return. You know as well as I do that it’s not in Chad’s or Stacy’s interest to break up. They need each other.”</p><p>“They can make it on their own. They’re both talented in their own right.” My feelings of irritation grew. “Why couldn’t we have discussed this in New York?”</p><p>“I’m fighting for my livelihood. You have to expect that I’ll pull out all the stops.”</p><p>“Lei’s in your league. I’m not.”</p><p>“You feel out of place here,” he said softly, soothingly. “I know these people. I would love to help you make connections and find your way.”</p><p>I stared up at him. “Why are you offering me that? Because of Jackson? If you think I want to insinuate myself into his life, you couldn’t be more wrong about me.”</p><p>The song ended and I pulled back, ready to find Lei and see if she wanted to leave, too.</p><p>Pembry wisely got the hint and guided me off the dance floor. I was almost home free when a tall figure stepped into my path. I looked up and caught my breath, thinking for a split second that Jax had shown up after all.</p><p>Then I realized it was his dad.</p><p>“Ian,” Parker said, thrusting out his hand in greeting. His voice carried power in it, just as his posture did. The Rutledge patriarch controlled a family with serious political clout. His reach and influence were staggering if you thought about it, which I couldn’t help doing when he turned those dark eyes to me. “I don’t think I’ve met your lovely companion before.”</p><p>I was startled to hear his slight accent, one I couldn’t place.</p><p>Ian did the honors. “Parker, this is Gianna Rossi. Gianna, Parker Rutledge.”</p><p>“Hello,” I said.</p><p>“Miss Rossi, a pleasure. This is my wife, Regina.”</p><p>I looked at the blonde beside him, the one he’d been dancing with, and thought she couldn’t be much older than me. She certainly wasn’t old enough to be Jax’s mother. Even a great plastic surgeon couldn’t preserve someone that well. “Hello, Mrs. Rutledge.”</p><p>Her smile didn’t reach her eyes. “Regina, please.”</p><p>“Dance with me, Regina,” Ian said, holding a hand out to her with a flourish.</p><p>She looked at Parker, who gave a nod. She looked back at Ian. “I want you to tell me about that new chef you brought with you tonight. What type of food does he cook?”</p><p>“Modern Southern.”</p><p>“Really?” They moved off. “I’m having a dinner party in a few weeks. Do you think...?”</p><p>“You’d never know it from looking at her,” Parker said, setting his hand at my waist before I could decline. “But she loves to eat.”</p><p>“I have a hard time understanding people who don’t.”</p><p>Parker swept me into the dance with a flourish and I held on, forcing myself to breathe.</p><p>“Regina also loves a great party,” he continued. “But then she’s young and beautiful. Like you.”</p><p>“Thank you.”</p><p>“Your interest is hospitality, isn’t it? I believe that’s what Ian told me. You must enjoy a great party, too. What do you think of this one?”</p><p>“It’s...” I scrambled for an answer. “I’m still taking it in.”</p><p>He laughed and the sound wasn’t anything like Jax’s warm chuckles. Parker had a booming laugh, one that drew attention. It was oddly infectious. I felt my mouth curve reluctantly.</p><p>“Gianna,” he said, again with that hint of a regional accent. “An unusual name, isn’t it? Jackson knew a Gianna in Las Vegas a few years ago.”</p><p>As I’d expected, the evening was quickly moving from uncomfortable to disastrous. I had assumed I’d been a secret. Instead, it seemed Jax had been telling everyone about me. That didn’t give me the warm fuzzies.</p><p>“It’s a family name,” I answered tightly, feeling terribly awkward.</p><p>“It must have been a pleasant surprise, seeing him again.”</p><p>I studied him. Would Jax look like his father when he reached the same age? I hoped not. I hoped he’d have more laugh lines around the eyes and less tension around his beautiful mouth.</p><p>“I’m more surprised that Ian felt the need to involve him in our business.”</p><p>“I involved Jackson,” he murmured, looking over my head with narrowed eyes. “Ian did me a wonderful favor when he introduced me to Regina, so I help him whenever I can.” He looked at me again. “I wasn’t aware of you, though. I’ll assume Ian was.”</p><p>Unease slid down my spine. I felt like a clown fish swimming with sharks, in way over my head.</p><p>“Excuse me.”</p><p>God. The sound of Jax’s voice reverberated through me.</p><p>“I’m cutting in.”</p><p>Parker stopped and I turned my head, my heart pounding when I came face-to-face with Jax.</p><p>“I didn’t think you’d show,” Parker said to his son.</p><p>Jax glanced at me, then back at his father. “You didn’t give me a choice.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For a second, I considered slipping away while the two men were occupied with staring hard at each other. Then Jax’s arm slipped around my waist from behind, pulling me into him and away from his father.</p><p>Parker glanced at me. “I’ll bow out and see you at dinner, Gianna. Enjoy yourself.”</p><p>Jax rounded me, cutting off my view of his dad’s retreating back. “You look amazing,” he said softly, pulling me closer.</p><p>My shoulders ached with tension. “I’m glad you approve.”</p> <p>He took the first step and I followed.</p><p>“Breathe, Gia,” he admonished. “I’ve got you.”</p><p>“I don’t want to be here.”</p><p>“That makes two of us.” He caressed my back with a soothing brush of his hand. “I hate these things.”</p><p>“But you fit right in.”</p> <p>His eyes were shadowed with an emotion I couldn’t name. “I was born into it. I don’t live in it.”</p><p>The heat of his body began to soak into mine. Every breath I took was filled with his scent; every movement he made sent echoes of memories sliding through me.</p><p>“That’s better,” he coaxed. “Relax into me, baby.”</p><p>“Don’t.”</p><p>“You’re in my world now, Gia. My rules.”</p><p>I shook my head. “I was tricked into coming here.”</p> <p>He pulled me closer, his lips at my temple. “I’m sorry.”</p><p>“You just had to get that out, didn’t you? I don’t see why. Clearly I wasn’t the dirty little secret I thought I was.”</p><p>“Not dirty.” His voice lowered. “Except when you wanted me that way. A little rough, a lot hard. Jesus. You used to turn me inside out.”</p><p>I stepped on his foot on purpose.</p><p>His low laugh rippled through me.</p><p>“You’ve been drinking,” I accused, smelling the faint trace of liquor on his breath.</p><p>“Driven to it.” He pulled back, his jaw set. “I didn’t know it’d be so damn hard to see you again.”</p><p>“I’ll make it easier. Help me and Lei get out of here.”</p> <p>“Not yet.” His soft mouth brushed over my brow. “I spent a night with your family. You owe me a night with mine.”</p><p>“Then do I get to disappear, never to be seen again?”</p><p>I really wanted to. Cinderella at the ball had turned into the unsuitable girl once more.</p><p>His chest brushed against my breasts as he urged me closer. “That’s the plan.”</p><p>JAX KEPT ME dancing through two more songs, bluntly refusing to relinquish me to Ian or two other gentlemen who attempted to cut in. I got the message as loudly as I’m sure everyone else did: I arrived with Ian, but I was now with Jax.</p><p>At that point, I decided to play my Cinderella role to the hilt. I kicked the voice in my head that had been depressing me for the past two days into a corner and flexed my toes in my proverbial glass slippers.</p><p>“I want champagne,” I announced abruptly.</p><p>Jax eyed me. “Is that right?”</p><p>“Yep.”</p><p>His eyes took on a wicked gleam I recognized. “Come on.”</p><p>Grabbing my hand, he led me off the dance floor and through the crowd. It surged around him, trying to pin us in, but he was adept at brusque acknowledgments and quick rejoinders. I caught sight of a familiar face, beautiful Allison Kelsey—the woman whose fiancé’s bachelor party had brought Jax and I together—then the view changed to a brightly lit hallway. From there, Jax led me through a swinging door into a massive industrial-sized kitchen buzzing with activity.</p><p>I looked around, noting the multiple cooking stations and the black-and-white service uniforms I’d only ever seen in movies. Jax snagged a bottle of champagne out of the hands of a waiter, slipped his ring finger around the stem of a flute in a practiced movement, then pulled me out a side door into another hallway.</p><p>“Where are we going?” I asked, still wary of being alone with him. I wanted him. I’d never stopped.</p><p>“You’ll see.”</p><p>The sounds of the party grew louder, and I ignored the pang of disappointment I felt at the possibility of rejoining it. Seriously, I had to make up my mind.</p><p>Jax led me through open French doors onto a terrace overlooking a magical garden. At least it looked that way to me, with its torch-lit gravel pathways and handsome old trees sparkling with white lights.</p><p>“Whose house is this?” I queried.</p><p>“It’s a Rutledge estate.”</p><p>The way he said it conveyed more ownership than the words themselves. “Right.”</p><p>“Pretend we crashed this party,” he said, leading me down cobblestone steps to a crescent-shaped marble bench.</p><p>I sat, watching as he poured champagne for me and passed me the glass. “Seems like we’ve been pretending all along, doesn’t it?”</p><p>Jax swigged straight out of the bottle and wiped his mouth with the back of his hand, careless and a bit defiant. “Maybe. I still know you better than you think I do.”</p><p>“I don’t feel like I know you at all.”</p><p>“So get to know me,” he challenged. “What are you afraid of?”</p><p>I sipped my champagne. “Spinning my wheels and dead ends.”</p><p>“Can’t you just enjoy the ride?”</p><p>Oh, I’d love it. A surge of heated yearning pierced me.</p><p>He set the bottle on the bench beside me. “I’m going to kiss you.”</p><p>My breath caught. “No, you’re not.”</p><p>“Try and stop me.”</p><p>I surged to my feet. “Jackson—”</p><p>“Shut up, Gia.” He cupped my face in both hands and took my mouth.</p><p>For a moment I didn’t move, frozen by the feel of his lips on mine, so soft yet firm. Achingly familiar. Tender. His tongue licked along the seam. I opened up to him with a low moan and he slid inside.</p><p>I dropped my flute. Distantly, I heard it shatter, but didn’t care. My arms were draped across his broad shoulders; my fingers were in his silky hair. I was drinking him in, tasting champagne and Jax, lifting onto my toes to deepen the connection.</p><p>As always, he gave me what I demanded of him.</p><p>Holding me still, he ate at my mouth, stroking with the velvet lash of his tongue, nibbling with lips and teeth, sliding his lips back and forth across mine. Savoring me. Turning a simple kiss into an erotic melding that had me trembling with pleasure.</p><p>God, I’d missed him. Missed the way he made me feel.</p><p>He growled, the rough sound vibrating against me. His hands slid downward, rubbing along my back, holding me in place as he rolled his hips and brushed the thick length of his erection against my cleft. Desire shot through me, flushing my skin. He smelled delicious, the subtle fragrance of his soap mixing with the virile scent that was his alone. I wanted to wallow in him the way I used to, pressing my naked body to his until even air couldn’t come between us.</p><p>“Gia,” he murmured gruffly, his lips sliding along my cheek. “Christ, I want you.”</p><p>I closed my eyes, my hands fisting in the thick strands of his hair. I was on fire for him, my skin feeling too tight and sensitive. “You had me.”</p><p>“I made the right decision walking away.” His breath gusted over my temple. “That doesn’t mean I don’t regret it.”</p><p>A tiny voice of caution was screaming. “You’ll hurt me.”</p><p>“I’ll worship you.” One of his hands captured my nape. The other gripped my hip, urging me into the slide of his hardness against my clit. “You remember how it was. Hours with my hands and mouth on you, my cock inside you—”</p><p>“For how long?” My core was clenching, tightening in demand for an orgasm.</p><p>“Weeks.” He groaned. “Months. Jesus, I’m so hard it hurts.”</p><p>I struggled out of his hold. “I need more than sex.”</p><p>He let me go, but his gaze was fierce and hot. “I’ll give you everything I’ve got.”</p><p>“For a few weeks?” I trembled from the effort of staying away from him when he was all I craved. “A few months?”</p><p>“Gia.” Jax scrubbed his hands over his face. “Damn it. Take what I can give you.”</p><p>“It’s not enough!”</p><p>“It has to be. Christ... Don’t ask me to turn you into one of them!”</p><p>I jerked back, startled by his vehemence. “What are you talking about?”</p><p>He turned his back to the house and picked up the bottle of champagne, drinking deeply.</p><p>Confused, I studied him and saw only mulish determination. I looked past him into the ballroom, seeing the glittering couples inside. Lei appeared at that moment, walking onto the terrace with Chad on her arm.</p><p>In that moment I understood how badly I wanted to unravel the mystery of Jax, bad enough that I didn’t care how much it was going to cost me.</p><p>“Mind if we join you?” Lei asked as she and Chad approached.</p><p>Her eyes caught mine. I sank onto the bench, my body still throbbing with unappeased hunger.</p><p>Glancing at Jax, I found his eyes on me. A challenge was there in those dark depths. I held my hand out for the champagne, gripping the bottle by the neck when he handed it to me.</p><p>I lifted it in toast and drank to that dare.</p><p>Chapter 6</p><p>DON’T DISAPPEAR. See me again....</p><p>Jax’s last words, whispered in my ear as we said goodbye, haunted me on the flight back to New York.</p><p>If I tangled with him I’d get hurt, because I would hope. I wanted more. But what choice did I have? I had to know what had gone so wrong before and what was still holding him back now. I’d always assumed it was me—who I was, where I came from—not meshing with who he was and what he wanted long-term.</p><p>I glanced at Lei, who was seated across from me on the plane, as she opened her clutch and withdrew a folded piece of paper. She slid it over and I smoothed it out on the table in front of us. I read the first paragraph, shot a look down to see the signature at the bottom, then lifted my head.</p><p>“Oh, my God... You got Chad to sign?”</p><p>“It’s a tentative agreement,” she qualified, “based on getting Isabelle and Inez on board—and you overseeing the first restaurant—but it’s got him on the hook.”</p><p>“Wow.” I refolded the document carefully, taking in the fact that I’d just been handed a major responsibility. “I can’t believe you had this with you. Did you know he’d be there?”</p><p>“I suspected, knowing Ian.”</p><p>I handed the agreement back to her.</p><p>“Rutledge took care of you tonight,” Lei noted. “Ian tried to throw you to the wolves, but Jackson kept you too close for that.”</p><p>And he’d wanted me even closer.</p><p>I shrugged off her unspoken query, not wanting to get into something so deeply personal. “By the way, Parker Rutledge explained the connection. Ian introduced Parker to the latest Mrs. Rutledge.”</p><p>“Did he?” Lei’s elegantly arched brows rose. “Then it’s likely Ian knows Regina Rutledge intimately.”</p><p>“Are you kidding?”</p><p>“’Fraid not.”</p><p>“Okay, then.”</p><p>She leaned her head back against the seat. “Let’s enjoy the weekend. Turn off your phone, forget about work. Just recharge. We’ll hit it fresh on Monday.”</p><p>That sounded perfect to me. “I’m more than game, but I’ll leave my phone on in case you need me.”</p><p>Lei smiled. “I won’t need you, I promise. I’ve got a date this weekend.”</p><p>“All weekend?”</p><p>“I’m overdue.”</p><p>I laughed. In the year I’d been with Lei, I hadn’t known her to date. She was due for a good time, all right. So was I. “Rock it.”</p><p>She shot me a look. “I plan to.”</p><p>WHEN I GOT HOME, it was just past two in the morning and everyone was asleep. I padded to my room on bare feet, eager to strip and scrub down to my bare skin.</p><p>I was reaching for the concealed zipper on the side of my dress when I caught sight of my reflection in the mirrored closet doors. I paused, really taking a good hard look at myself.</p><p>Was Jax attracted to the polished businesswoman I’d become in a way he hadn’t been to the girl I was before? Was I okay with that?</p><p>“God.” I sat on the edge of my bed, wishing someone were awake that I could talk to. If Nico had been around, he’d be up. He was a night owl.</p><p>Impulsively, I reached for the phone on my nightstand and speed-dialed him. It rang three times before he answered.</p><p>“Hey,” he said. “This better be good.”</p><p>I winced at his irritated and slightly breathless tone, suspecting I’d interrupted him when he had someone staying over. “Nico, hi. Sorry. I’ll call back tomorrow.”</p><p>“Gianna.” He exhaled roughly and I heard rustling. “What’s up?”</p><p>“Nothing. We’ll chat tomorrow. Bye.”</p><p>“Don’t hang up on me!” he snapped. “You wanted me, you got me. Spill it.”</p><p>I hung up, figuring the sooner I let him go, the sooner he’d get back to whatever he’d been doing.</p><p>A half second later, the phone started ringing. I answered quickly, hoping it didn’t wake up the rest of the house. “Nico, come on. It’s not a big deal. I’m sorry I bugged you so late.”</p><p>“Gianna, if you don’t start talking, I’m heading up there to kick your ass. Is this about Jackson?”</p><p>I sighed. I should have known he would’ve heard the news from someone. “I’ve got a free weekend. I thought maybe I could come visit. Give you a hard time. Harass you a little. Or a lot.”</p><p>“Now?”</p><p>Actually, I’d been thinking about it, but... “No, tomorrow.”</p><p>“Bullshit. You don’t call after two in the morning to say you want to stop by tomorrow.”</p><p>“You’re busy.”</p><p>“By the time you get here, I won’t be.” His voice softened. “You got a safe ride down?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Nico—”</p><p>“I’ll call a service, have a car pick you up.”</p><p>I closed my eyes, grateful for him and more certain than ever that hanging with him would do me a world of good. It’d been a few weeks since I’d seen him. Too long. “I need to shower and change.”</p><p>“Thirty minutes. I’ll see you when you get here.” He hung up.</p> <p>Setting the handset back into its cradle, I hurried to get ready.</p><p>IT WAS CREEPING past four in the morning when I arrived at Nico’s apartment complex. He’d called a few minutes before to check where I was and was standing on the sidewalk waiting for me when I pulled up. Dressed in sweats with a shadow of stubble on his jaw, he looked a bit dangerous in that bad-boy way so many women gravitated toward.</p><p>God knew Jax’s alpha-male qualities could put me into heat.</p><p>“Hey,” he said, taking my duffel bag from the driver and handing over cash. He slung his arm around my shoulder and led me toward his place. “It’s good to see you.”</p><p>“No, it’s not.” I bumped my hip into his and made us both stumble. “Sorry to crash your night.”</p> <p>“I got mine.” He grinned. “She got hers, too, so it’s all good.”</p><p>“Gross. TMI.” He was such a player. Always had been. “Is she anyone special?”</p><p>“Not in a serious way. Got no time for a relationship now. My hands are full with Rossi’s Two.”</p><p>He released me to unlock the lobby door, then led me through to the interior courtyard. I’d been to his apartment complex before to help him move in, but it felt different at night. Too quiet and unfamiliar. I wondered if he got lonely without the rest of us. It made me sad to think of it.</p><p>“I wish you had someone to take care of you,” I said.</p><p>“You first,” he retorted, deftly bringing it back to me. He was good at that.</p> <p>We climbed exterior steps to his apartment. Once inside, I saw that he hadn’t done much more to it since he’d moved in. It was a typical bachelor pad—sparse on decoration and laid out for comfort rather than aesthetics.</p><p>A large flat-screen TV dominated the living room, which had a black leather couch and love seat, coffee table and one end table with an open soda can on it. Light spilled into the otherwise darkened room from the open-plan kitchen and ajar bedroom door, trying valiantly to compensate for the lack of table and floor lamps.</p><p>“So, Jax is back,” he said, watching me as I dropped onto the couch. “Vincent owes me a hundred bucks.”</p><p>“Are you kidding?” I would’ve thrown a sofa pillow at him if he’d had any. “You bet on Jax?”</p><p>“Bet on you.” He sat on the love seat, setting my duffel on the floor at his feet. “He was gonzo over you, which meant he was either going to put a ring on you or run scared. I figured he’d run, then come back around once the fear wore off. He’s a guy, but he’s a smart one. Question is, is he too late? I’m guessing no or you wouldn’t be here.”</p><p>“Maybe I just wanted to see you,” I argued. “God knows why.”</p><p>“Maybe,” he said in a tone that told me he’d believe it when hell froze over and pigs flew. “You still love him?”</p><p>My head fell back against the sofa, and I closed my tired eyes. “Yeah. Damn it.”</p> <p>“And him? Where’s he coming from?”</p><p>“He’s confused.”</p><p>“Should I smack him around some? Knock some sense into him?”</p><p>I laughed softly. “God, I miss you.”</p><p>WE SLEPT PAST NOON, went out to eat, then sat on the couch and played video games until my thumbs ached from using the controller. I left my smartphone in my purse, powered off and squashed any impulse to check it. I’d left a note for Angelo and Vincent about where I’d be. With Lei off the grid for the weekend, there was no one else who needed to reach me before Monday.</p><p>When it came time for Nico to head into Rossi’s, I got up off the couch with him.</p><p>“Need an extra set of Rossi hands?” I asked.</p><p>He grinned. “Sure. I have an extra T-shirt around here somewhere.”</p><p>By seven, I found myself helping out at Rossi’s and remembering how much I loved the hands-on part of the business. I couldn’t do it long-term, like my brothers, but I was reminded that helping out every now and then was good for my soul. Dressed in jeans and a black Rossi’s T-shirt with my hair pulled back in a ponytail, I could almost believe I was back in high school. I didn’t know any of the customers coming in, but they quickly picked up on my relationship with Nico, due in large part to the playful ribbing we indulged in.</p><p>Crossing my arms on the bar, I leaned over and teased, “Where’s my Bellini order? Pick it up, Rossi. You’re laggin’. I’m waitin’.”</p><p>“Ya hear that?” he asked the pretty redhead sitting in front of him. “She’s rushing greatness.”</p><p>I felt a charge that raised the hairs on my nape an instant before I felt a hand on my hip. I turned my head...</p><p>And saw Jax.</p><p>Blinking, I stared, drinking in the sight of him in jeans and a Rossi’s T-shirt from way back, before we updated the logo. It twisted me up a little to see that he’d kept the gift. And worn it some, judging by how broken in it was.</p><p>“Jax. What are you doing here?”</p><p>“What do you think?” He smiled.</p><p>Damn it. His dimple threw me for a loop.</p><p>I turned to face him, leaning back on the bar with my elbows and hitching my shoe onto the brass foot rail. It was a deliberately provocative pose and got me the response I’d been hoping for.</p><p>His dark eyes swept me from head to toe and back again, coming to rest on my mouth. “Have dinner with me.”</p><p>“Okay.”</p><p>His brows rose at my quick reply.</p><p>“Order up,” Nico said behind me.</p><p>I turned back to him just in time to see him acknowledge Jax with a jerk of his chin and a handshake.</p><p>“Jackson,” my brother greeted him. “I was just talking to Gianna about kicking your ass.”</p><p>Jax grinned. “Good to see you, too, man.”</p><p>Nico wagged a finger at him and moved back down the bar.</p><p>As I transferred the three Bellinis onto my tray, I felt Jax’s hands come to rest lightly on my hips, an unmistakably proprietary move. His lips touched my nape, brushing softly. “I missed you,” he murmured.</p><p>My hand shook slightly as I set the last tall, slender glass down. “Don’t fuck with me, Jax. It’s not cool.”</p><p>“You missed me, too.”</p><p>“Yeah, I did. Back up.” I lifted the tray and headed toward the table awaiting the order. “Come on,” I told him over my shoulder.</p><p>I dropped the drinks off, smiling at the party of three women who were clearly out on a girls’ night. They eyed Jax, who leaned against the end of a booth with his arms crossed, his gaze on me as I leaned forward to serve.</p><p>“You training him?” the brunette asked, grinning at Jax.</p><p>“Tried to,” I quipped. “Failed miserably.”</p><p>“I’m asking her to try again,” he said, winking at the table. A really rotten thing to do since it got the women all riled up...and me, too.</p><p>“Give it a shot, girl,” the blonde encouraged. “Trying is half the fun!”</p><p>They were laughing as I walked away, exchanging words with Jax, who lingered as I hit the bar to drop off the empty tray.</p><p>“You okay?” Nico asked, intercepting me.</p><p>“Yep.” I straightened my shoulders and abruptly decided on a course of action. Jax and I could dance around each other for days if I let us. I didn’t have the patience for it. “I’m heading out for a bit.”</p><p>He nodded and reached over to squeeze my hand. “Give him hell.”</p><p>“Thanks.” I pivoted and nearly ran into Jax, who’d come up behind me. “You staying somewhere?”</p><p>The faint amusement on his face faded into something darker. Hotter. “I’ve got a room, yes.”</p><p>“Let me grab my purse.”</p><p>He caught my elbow before I walked away. “Gia.”</p><p>I looked at him, let him study me.</p><p>His thumb brushed over my skin. “There’s no rush.”</p><p>“In three days, you’ve popped up where I am across three different states. Now you’re going to cock-block yourself? Really?”</p><p>A slow smile curved his mouth. “You’ve got a point. I’ll go get the car.”</p><p>A SLEEK BMW waited just beyond the front doors of Rossi’s when I stepped outside. The car was a rental, but it suited Jax. He was standing by to open the door for me, his lips brushing over my cheek before I took the passenger seat.</p><p>It was addicting the way he touched me, as if he couldn’t help himself.</p><p>Jax slid behind the wheel. The engine purred to life, and we set off.</p><p>Sitting back, I watched him drive, turned on by his confident handling of the powerful car. His grip on the wheel was light, his arm extended in a way that showed off the beauty of his chiseled arms. He was an inherently sexy man and I was crazy in love with him, able to adore every commonplace thing he did.</p><p>Which wasn’t fair, I realized. I’d never recognized his flaws, although he surely had some. I had never acknowledged that there might be struggles in his life, circumstances and people who might pull him in different directions and away from me. I’d never scratched below the surface.</p><p>Reaching over, I set my hand on his thigh, feeling my palm tingle as the hard muscle bunched in reaction to my touch. He switched driving hands so that he could hold me in place, his skin warm and dry.</p><p>He glanced at me. “Are you nervous?”</p><p>“No.” Wary, yes, but not anxious about it. “I want you.”</p><p>He nodded and drove faster.</p><p>We didn’t say anything further on the drive to his hotel or once we arrived. He parked and we entered a center courtyard via a key-card entrance at the side of the building. We took an elevator up, standing on opposite sides of the car, our gazes locked as the seconds ticked by.</p><p>The tension was so thick I found it hard to breathe, my lips parted as I pulled air into my lungs in a near pant. I could feel the need radiating off him, sensed the hunger tightening his muscles and sharpening his focus on every response of my body to his. He was hard already, his cock straining against the button-fly of his jeans.</p><p>And I was wet and ready, aching between my legs, my breasts full and heavy. My nipples were furled so tightly they throbbed and stretched shamelessly toward him.</p><p>His gaze was there on my chest, caressing me, his tongue sliding along his lower lip in a blatant promise of what he’d be doing to me as soon as we were alone.</p><p>The elevator dinged to announce our arrival on his floor and he surged toward me, grabbing my hand in his and dragging me after him. A long hallway later, he was shoving open a door to a suite and then he was on me, grabbing me so tightly my feet left the floor. I dropped my purse and hung on.</p><p>Jax’s mouth found mine as the door clicked shut, one arm around my waist and the other hand shoved into my hair, dislodging the elastic restraining my ponytail. The finesse he’d shown the night before was gone, only animal hunger left in its wake. His lips slanted over mine, his tongue plunging rhythmically into my mouth, luring me to climb his big body.</p><p>My legs wrapped around his lean waist, my arms caging his shoulders, my hips rocking to rub my cleft against the rigid outline of his erection. I moaned as the pressure drove me mad, the layers of denim between us too thick to relieve me.</p><p>“Jax,” I gasped into his mouth.</p><p>“Hang on,” he growled, pinning me to the door.</p><p>My legs straightened, my hands going to the front of my jeans. I popped the button open and yanked down the zipper, struggling against Jax, who was shoving up my shirt.</p><p>His hands found my breasts and squeezed through the thin satin of my bra. I gasped, shocked by the intimacy.</p><p>“Christ, you’re gorgeous,” he breathed, his thumbs circling the hardened points of my nipples.</p><p>My head fell back against the door, my lungs struggling for air.</p><p>His dark head lowered, his tongue licking me through my bra, his lips wrapping around me. He sucked hard, and I writhed, my hands clawing at the door behind me.</p><p>“Hurry, Jax. Damn it!”</p><p>His dimple flashed, then he was kissing me again, his body hard against mine, his hands between us as he wrenched his button-fly open. I barely had the sense to dig his wallet out of his pocket before he shoved his jeans down and out of the way. Fumbling, I found a condom and tossed the wallet on the tiled entryway.</p><p>I was ripping open the foil with my teeth when he started pulling at my pants, tugging them roughly. I stumbled, laughing, falling into him, letting him sweep me up again and lower me to the floor.</p><p>Kicking off my shoes, I wrestled with him, our arms and legs tangling as we fought our clothing and our own desperate urgency. Jax yanked off his shirt, pulled the jeans off one of my legs and ground out, “That’s good enough.”</p><p>He ripped my panties to get at me, hissed through his teeth when I sheathed him in latex. Then he pushed my thighs wide to sink between them.</p><p>His first thrust inside me had my back bowing off the floor.</p><p>“Gia.”</p><p>With his neck arched, shoulders straining, sweat glistening on his chest, Jax was impossibly beautiful. He throbbed inside me, so thick and hard, so deep. My heels dug into the carpet, my hips churning as I struggled to accommodate him.</p><p>“Baby, wait,” he gasped, gripping my waist to hold me still. “I’m too close....”</p><p>“Jax...please!”</p><p>He looked down at me fiercely, his eyes glittering in the semidarkness of a room lit only by light spilling through the windows.</p><p>“Is this what you want?” He pulled back, sliding out of me. Then thrust.</p><p>“Oh, God,” I moaned, quivering. “Don’t stop.”</p><p>One hand at a time, he linked his fingers with mine and pulled my arms over my head. Rolling his hips, he stroked deep on the inside, rubbing me perfectly on the outside. For all his impatience to get at me, once he was there, he took his time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His lips touched my ear and he whispered, “Give it to me, baby. Let me feel you.”</p><p>Rocking upward, I wrapped my legs around him and took it, climaxing with a low pained moan, shivering with pleasure as my sex clenched in desperate ripples around him.</p><p>“That’s it,” he coaxed hoarsely, beginning to move. “Ah, Jesus, you feel amazing.”</p><p>I held on, his measured drives keeping me hot and wanting. My core tightened, reaching again.</p> <p>“You’re so hard,” I whispered, loving the feel of him, the smooth slick glide.</p><p>“It’s you.” He kissed me, his hands tightening on mine as his hips lunged again and again, taking me with long, deep plunges. “Gia, baby...you’re making me come.”</p><p>His pace quickened, then he tensed, his head thrown back as the orgasm hit him. I watched, awed, as shudders racked his powerful frame. He groaned my name, his eyes squeezed shut, his neck straining as he came with such intensity it brought me off again.</p><p>Turning my head, I sank my teeth into his forearm, muffling my cries as the hunger sharpened painfully, then receded into a hot, sweet ache.</p><p>“Gia.” He clutched me firmly, nuzzling his sweat-slickened face against mine.</p> <p>Wrapped in him, filled with him, I released my bite and pressed my lips to the mark. Wishing it was possible to so easily brand him as mine.</p><p>Chapter 7</p><p>JAX ROLLED TO his back beside me and groaned. “I can’t feel my legs.”</p><p>I laughed, knowing just how he felt. I was tingling all over, as if my entire body was reawakening after a long hibernation.</p><p>Which was sadly true.</p><p>He turned his head toward me. I looked at him.</p> <p>“Hey,” he said, reaching for my hand and lifting it to his mouth for a kiss.</p><p>“Hi.” I studied him, seeing that soft warmth in his eyes I’d missed so much.</p><p>“I’m sorry we didn’t make it to the bedroom.”</p><p>“S’okay.” I smiled. “I’m not complaining.”</p><p>“I’ll get you there as soon as I can walk.”</p><p>“Getting old, Rutledge?” I teased, knowing that at twenty-nine, he was in his prime.</p><p>He looked at the raised ceiling with its pretty moldings. “Out of practice.”</p><p>“Yeah, right.” I threw my arm over my face, hiding my reaction. I couldn’t think about him with other women. It made me crazy. “I read the papers, you know.”</p> <p>“Escorting a woman somewhere and fucking her are two different things.” He leaned over me. Catching my wrist, he pulled my arm above my head and exposed my face. “But it feels good to know you’ve been keeping tabs.”</p><p>“I wasn’t.”</p><p>Jax flashed his dimple at me. “Okay.”</p><p>He rose up to his knees and sank back on his heels, removing the condom. His movements were easy and unaffected, but the sight of his half-hard cock glistening with semen made my mouth water.</p><p>I pushed up onto my elbows and licked my lips. “Come here.”</p><p>He responded instantly, his cock stiffening and lengthening. “Jesus, Gia.”</p><p>I moved toward him.</p><p>“Shower,” he said hoarsely, pushing unsteadily to his feet, then holding out his hand to me. “I’ll taste like rubber without one.”</p><p>“I don’t care.”</p><p>“I do.” He pulled me up. “Once I slide into your mouth, I’m staying there awhile.”</p><p>I looked at him, taking him in, finding him so damned sexy standing there—tall and bare chested, his jeans open and shoved down, his cock exposed and curving upward toward his navel. I’d never seen anything so blatantly masculine and erotic.</p><p>This was the Jax I knew. And loved so much.</p><p>“Look at you,” he murmured, his thumb brushing over my swollen lower lip. “You’re so fucking sexy. So soft and beautiful.”</p><p>“Right.” My mouth curved as I checked myself out. My jeans and torn panties clung to one leg and my shirt was shoved up over my breasts. No doubt my hair was a mess. “Spoken like a man who just had an orgasm and wants another.”</p><p>“Don’t.” He caught my chin, tilting my head up. “You can’t ask me to give you everything I’ve got, then take it lightly. It’s not fair.”</p><p>“No,” I agreed. “It isn’t, is it?”</p><p>From the tightening of his jaw, I knew he got the message—he’d taken me lightly...then left me behind.</p><p>Crouching, he held my jeans down so I could pull my leg free. Then he caught my hand and led me around the wrought-iron-and-glass coffee table.</p><p>We crossed the taupe carpet to enter a bedroom boasting a king-size bed with a dark wood headboard matching the desk and armoire also in the room. There was a seating area by a window that stretched up to the high ceiling, and the entry into the bathroom was a beautifully simple archway.</p><p>I tried not to show how astonished I was when Jax flipped the light on, but was glad he didn’t look at me because I was pretty sure I failed. The room was huge, with a shower that could accommodate three people and a separate sunken tub with jets. A television was embedded in the wall and the dual-sink vanity resembled the heavy wooden furniture in the bedroom.</p><p>I had to ask. “Did you book this room thinking you’d get me to come here?”</p><p>“I hoped.” Jax let me go to turn on the shower. I whistled, impressed by the giant showerhead embedded in the ceiling, which sprayed water straight down like a waterfall.</p><p>He faced me with a smile that dazzled me. “Can I finish unwrapping you?”</p><p>A sharp ache spread through me. Gia, baby, you’re my present to myself after a long, hard day. One of the many things he’d said to me back in Vegas that had made me love him.</p><p>I wondered suddenly if that was just who Jax was and the way he talked to whatever woman was with him at the time. Maybe he hadn’t a clue about how sweet nothings like that could turn a girl inside out. Or maybe he did. The thought depressed me.</p><p>“Hey.” He caught my chin, tilting my head back. “Don’t check out on me now. I’m here. I’m in this.”</p><p>“For how long? The weekend?” I backed away, some niggling sense of self-preservation warning me to get out while I was ahead. “I can’t do this, Jax.”</p><p>His jaw tightened. “Gia...”</p><p>I turned and hurried through the bedroom to get my clothes.</p><p>“What the fuck?” he snapped, grabbing my arm as I crossed over the threshold into the living room. “You wanted this.”</p><p>“It was a mistake.” A huge mistake. I was too invested in my feelings for him to find closure this way.</p><p>“The hell it was.” He tugged me around to face him, grabbing me by the forearms so that I couldn’t get away. “Why did you ask for this? You wanted to come here. You wanted me to make love to you.”</p><p>“I wanted to fuck you,” I growled, hating how he recoiled from my words. “I wanted to get past the tension so maybe you’d start giving me the truth. I don’t want any more of your smooth-player bullshit. It’s not real. You’re not real.”</p><p>“What the fuck are you talking about? This is as real as it gets, and you know it.”</p><p>I yanked free and stalked farther into the living room, feeling foolish in only socks and my Rossi’s T-shirt. “I don’t have time for this.”</p><p>“Time for what? Me?” Jax’s long stride easily overtook mine. He reached my jeans first and stepped on the cuff, pinning them to the floor. His arms crossed his chest, displaying the raw power of his ripped body to perfection. He didn’t care at all that his pants were still undone, although he’d hitched his boxer briefs up at some point along the way.</p><p>“I don’t have the time or patience to pretend like we’re building something here when we’re not.” I fixed my ponytail, trying to focus on putting myself back together—at least on the outside.</p><p>His scowl depended. “Who’s pretending?”</p><p>I threw up my hands. “Why do you talk to me like you do? All that crap about unwrapping and missing me and...and all of it! Why can’t you just be real about what we have, what we’ve always had—nothing but great sex?”</p><p>“We’re not just fucking,” he growled, leaning forward. “You don’t fall in love over nothing but sex.”</p><p>“Do I have to be in love with you? Does it make it better for you if I am?” To my horror, I felt my eyes sting with tears. “You’ve already gotten into my pants. I don’t understand why you have to act like this is a romance. Don’t make something that should be simple so complicated for me!”</p><p>“Baby, we’ve never had simple.” He exhaled harshly and reached up to rub the back of his neck. “What do you want from me, Gia?”</p><p>“I think we need to focus on what you want from me, since what I want is irrelevant.”</p><p>He scowled. “That’s not true.”</p><p>My hands went to my hips. “I want a commitment, a chance, some effort made to see how far this thing between us could go. You’ve already shot that down. So what’s left is what you want.”</p><p>“I want you.”</p><p>“You want to fuck me,” I corrected. “Why can’t you just be matter-of-fact about it?”</p><p>“Gia.” He shook his head and sighed. “I’m an asshole to everyone else in my life. You’re the one thing I’ve cherished. Don’t make me stop.”</p><p>“See? Like that! Why do you have to say stuff like that? Why can’t you just say you like me or something—”</p><p>“Because I don’t just like you. You get under my skin. I think about you damn near all the time and I get hard. I see you and I forget who I am. You don’t know what you do to me.” Jax’s voice lowered dangerously. “You make me want to rut, Gia. I want to pull you beneath me, work my cock into you and ride until you’ve wrung me dry. You make me need—”</p><p>“Shut up!” God, I was quivering, my hunger stirring in response to the heated waves of desire sizzling off him.</p><p>“You know how it feels. You’re feeling it, too. Let me give it to you.”</p><p>“No!” The refusal cut deep, like restraining part of myself with barbed wire.</p><p>“Give me tonight.” He reached for my hand and squeezed too tightly. “One night.”</p><p>I laughed softly even as my sight blurred. “One night to screw me out of your system? That’s a cliché, Jax. It never works. Great sex doesn’t stop being great just because you gorge on it.”</p><p>“So we’ll have a night of great sex. We both want it. Need it.”</p><p>“I don’t need this.” I tried to reclaim my hand, but he wouldn’t let go.</p><p>“The hell you don’t.”</p><p>Nothing but the truth would work with Jax. He read me too easily, was too adept at homing in on a challenger’s weakness and exploiting it.</p><p>“I can’t do this,” I said again, holding his gaze. “I’m not like the women you’re used to sleeping with. I can’t do it for fun or to scratch an itch. Not with you. I fell for you the last time. I can’t do it again.”</p><p>“You’re still in love with me,” he retorted bluntly. “Give me a chance to make that something you stop regretting.”</p><p>I turned away from him, my gaze sweeping over a living room that was bigger than my bedroom back home. “I want you to take me back to Rossi’s.”</p><p>“That’s a problem.” He came up behind me, his arms wrapping around me. With his lips to my throat, he whispered, “I want to take you to bed. If you don’t want me to talk, I won’t say a word.”</p><p>I closed my eyes, absorbing the feel of him behind me. The warmth of his body, the scent of his skin now musky with sweat and sex, the soft caress of his breath.</p><p>“You left the shower on,” I said, latching on to something inane and far less personal.</p><p>“I’d turn it off if I wasn’t afraid you’d bail while I wasn’t looking.”</p><p>“You can’t keep me prisoner here.”</p><p>“I don’t want to. I want you willing. I want the Gia who demanded I bring her here and give her whatever she wanted.”</p><p>I glanced over my shoulder at him, finding his eyes glittering at me from the shadows that caressed his beautiful face. I felt the pull inside me, that inexorable tugging between us. I didn’t know how to turn it off or ignore it. Some sick cosmic joke had made me hardwired to crave him with every fiber of my being.</p><p>Did I have what it took to convince him to stay? I had what it took to get him to want more; that was a start.</p><p>“Tonight’s not enough,” I said quietly.</p><p>“Thank God. I just threw that out there to buy some time to convince you otherwise.”</p><p>“You can’t just walk away without a goodbye like last time.” I turned in his arms. “I want you to look me in the eye and say you’re through when you decide you’ve had enough.”</p><p>His lips thinned, but he nodded.</p><p>“I want monogamy.”</p><p>“Damn straight. I’m not sharing you.”</p><p>“I’m taking about you being monogamous,” I said drily.</p><p>“That’s a given.” He cupped my face. “What else?”</p><p>“My hours are erratic. My job comes first.”</p><p>“I fit into your life before—I can do it again.”</p><p>I gripped his wrists. I could go on with the list of my wants, but what I needed at that moment was distance and some perspective. I needed some time to back up, catch my breath and my bearings, then I might be able to figure out the next best move to make. “I want you to turn off the damn shower and take me to dinner. I’m hungry.”</p><p>He laughed, but it sounded strained. “You always did get hungry after sex. Can we actually take the shower first?”</p><p>“No.” I leaned forward. “I want you to smell me on your skin for the next couple hours.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jax groaned. “You want to punish me.”</p><p>“Yep,” I agreed. “That, too.”</p><p>NICO SHOT ME a knowing look when Jax and I returned to Rossi’s. I stuck my tongue out at him.</p><p>We grabbed a table and ordered shiraz. I went with lasagna, Jax went with pollo alla cacciatora. While we waited for our food, I studied him, admiring the way the small candle on the table between us gilded him. He looked softer, more relaxed, his face impossibly more handsome.</p> <p>He had the look of a well-fucked man, one who was sated and yet anticipating further pleasures ahead. I loved that I put that look on him, but I hated it, too. Because I wasn’t in danger just from the things he said; it was everything about him that made me vulnerable. The effect he had on me was in large part due to the effect I had on him.</p><p>I made him happy. Content. And it was difficult not to feel as if that made me special, even though I knew better.</p><p>“So Regina is your stepmom, right?” I asked, giving my mind something else to think about.</p><p>“Yeah.” He looked into his wineglass.</p><p>“How did that happen?” Would he mention Ian and open that door...?</p> <p>“My mom died ten years ago.”</p><p>“Oh.” Seeing how he closed up alerted me—I’d touched on a painful subject. “I’m sorry to hear that, Jax.”</p><p>“Not as sorry as I was,” he muttered before gulping down his near-full glass in three swallows. He refilled, then looked at me. “Your mom looks great.”</p><p>I nodded. “She’s happy. Her kids are doing all right, business is good and she’s about to be a grandmother.”</p><p>“How’s Angelo dealing with impending fatherhood?”</p><p>“Good. It threw off his plans to open another Rossi’s, but that’s probably for the best. Denise—his wife—has a new business of her own, so I think it would’ve been a strain for them if they’d tried juggling two startups and a new marriage.”</p> <p>“Do you like her?” he asked, his fingertips stroking up and down the stem of his glass.</p><p>“A lot. She’s great.” I looked at the party next to us, a family of four enthusiastically discussing how good their food was. “I thought I saw Allison at the fund-raiser last night. How are she and Ted doing?”</p><p>Honestly, I couldn’t care less about Jax’s cousin and his bitchy wife, but talking about Jax’s mom made me realize that he knew more about me than I did about him. Aside from his family members who made news because they were in office, I only knew Allison.</p><p>“They’re solid.” He took another drink. “She’s what he needs to run for mayor in the next election.”</p><p>“It’s good that she’s there for him.”</p><p>He snorted. “They barely talk to each other. But she knows how to work the press and she’s very active in his campaign planning. He made a good choice with her. She fits him the way Regina fits my dad.”</p><p>“I thought the political marriage/business partnership was a Hollywood stereotype.”</p><p>“No.” Jax reached over and lightly brushed the back of my hand. “You’ve got to be pragmatic about relationships. Marrying for love never works out well. My mom and dad were a love match and they made each other miserable. Now, Regina and Dad... They’ll do just fine. She knows how to play the game.”</p> <p>“He seems like he genuinely cares for her.”</p><p>“After what he went through with my mom, she’s got to seem like a gift.” He took another drink, then leaned back as our food was served.</p><p>His change in mood was another warning. Talking about his mother didn’t seem to sit well with him. I’d have to be careful about approaching the topic. “Ian introduced them, right?”</p><p>“Which turned out to be really lucky for him, didn’t it?” he said with an edge in his voice.</p><p>“Because he called in the favor and got you? You can’t save him, Jax.”</p><p>“I wasn’t asked to.” He shrugged, his gaze hard. “I’m just supposed to keep Lei Yeung at bay. I can do that.”</p><p>Nico walked over with a steaming plate of pasta in hand. “Mind if I join you two?”</p><p>Jax pushed out the chair opposite him with his foot. “The more Rossis the merrier.”</p><p>Sadly, the more Rutledges the scarier. And that had shaped Jax into the man he was.</p><p>I played with that in my thoughts as Jax and Nico settled into the easy banter of men, reminding me of how effortlessly Jax fit into my life...and how uncomfortable I was with his.</p><p>Chapter 8</p><p>AFTER DINNER, JAX and I headed out to his rental. I paused before I slid into the passenger seat. “If I go back to the hotel with you, I’ll need you to take me back to Nico’s when he gets off work.”</p><p>Jax rested his arm on the open car door. “You won’t stay the night with me? I’d like you to.”</p><p>I did want to. And once, back in the day, I had dropped everything in my life for his visits and ended up resenting him for that. I may not have learned to stay away from him, but I’d still picked up a thing or two about having a healthier relationship. “I came here to spend time with my brother.”</p><p>His chest lifted and fell on a deep breath. “Fair enough. Can I schedule time for you to spend with me?”</p><p>We stood so close to each other, pressed into the space between the car and the door, but there was a gulf between us. I’d created it, but I still wished it didn’t have to be there. “When are you thinking?”</p><p>“Any night this week and next weekend for sure.”</p><p>I nodded, then got in the car. He shut the door and rounded the trunk, giving me time to think about how the rest of the night could go. More sex. More Jax. I craved both, but it would’ve been nice not have so many doubts and reservations. I missed how carefree we used to be. But then, I guess it was only that way for me. He’d been counting down the minutes all the while.</p><p>He got in and closed the door, but didn’t start the engine right away.</p><p>“Listen,” he began, “you should know this is hard for me, too.”</p><p>“But you understand what’s going on,” I argued softly. “I’m clueless.”</p><p>Jax twisted in his seat and reached for me, catching me by the nape and pulling me in. I closed my eyes, anticipating the moment when his parted lips would touch mine. His tongue caressed the curve of my mouth, a slow sweep that had me leaning closer for more.</p><p>“So sweet,” he murmured. “I’m going to spread you across my bed and lick you from head to toe.”</p><p>“You’re good at that,” I said breathlessly, a shiver of eagerness moving through me.</p><p>He pulled back, as if to start the car, then surged forward again, catching my lips in a heated, wet, ravenous kiss. His mouth ate at mine, his tongue stroking deep and fast. I was just as greedy for him, my hand sliding into his hair, holding him by the roots while I frantically tasted him. He cupped my breast in his hand, plumping it, his thumb and forefinger surrounding my aching nipple and tugging rhythmically. I moaned, turned on and needy.</p><p>“God,” he groaned, releasing me and falling back heavily against the seat. “I want you. Right here. Now.”</p><p>I was more than tempted by the thought. If we had been anywhere but right outside Rossi’s, I might have climbed over the gearshift and gone for it.</p><p>“Drive fast,” I told him.</p><p>He laughed hoarsely and turned his head against the headrest to look at me. “Fine. But when we get to bed, I’m taking it real slow.”</p><p>“JAX!” CLAWING AT the sheets, my body arching away from the torture of his mouth, even as I craved more. I’d forgotten what he could do to me, how he could strip away my skin to get into the very heart of me, how his complete command of my body made me willing to do or say anything for the pleasure he could give.</p><p>He held me pinned at the thighs, his mouth on my throbbing sex, his tongue licking leisurely. The velvety strokes over my clit had me gasping, the need for an orgasm so fierce I was drenched in sweat, my legs vibrating from the strain.</p><p>“Please,” I begged hoarsely, squeezing my heavy breasts, the tips swollen and tender from the long minutes he’d spent drawing on them with slow, measured pulls of his mouth.</p><p>His silky hair brushed over my skin. He lifted his head. “Please what, baby?”</p><p>“Ah, God... Make me come.”</p><p>“Just a little more.”</p><p>“Please!” I pushed my hand between my legs, desperate to bring myself off.</p><p>He nipped at my fingers and I cried out, panting.</p><p>His head lowered, his tongue tracing the swollen folds. He circled my clit, then rimmed the trembling opening below.</p><p>I grabbed his head, holding him to me, struggling to lift my hips to his mouth. Jax was too strong, restraining me easily, his breath hot against my sensitive flesh. He suckled gently, moving slowly along the length of my cleft, giving me just enough pressure to drive me insane.</p><p>“Let me turn around,” I gasped. “Let me suck you.”</p><p>His chuckle was filled with such wicked amusement it sent goose bumps racing across my skin.</p><p>And then he thrust his tongue inside me.</p><p>“Jax!”</p><p>He cupped my butt and lifted me, angling me into his working mouth. His tongue fucked me swiftly, the shallow plunges into my trembling sex driving me hard toward orgasm. His growl vibrated against my clit, his pleasure feeding my own.</p><p>I clutched at his hair, moaning, digging my heels into the mattress to rock against his lips.</p><p>“Don’t stop,” I sobbed, so close, my entire body tingling.</p><p>Jax surged onto his knees, elevating me. My legs spread wide, giving him limitless access. He devoured me, so hungry and greedy. I couldn’t breathe for the pleasure. The frenzied licking against sensitive tissues overloaded my senses. I watched him, as he’d meant for me to. The sight of his dark head between my thighs, the rapid-fire flickering of his tongue, the beauty of his biceps hardened from supporting my weight...unbearably erotic.</p><p>He was gorgeous. Everything I’d ever wanted. And the fierce need that etched his face warned that his demands would take me to the edge before he was through with me.</p><p>Another low moan broke from my dry throat. “Oh, Jax...I’m going to come.”</p><p>“Wait,” he ordered. “I want you milking my dick when you lose it.”</p><p>I gave a clenched-teeth scream of frustration as he lowered me to the bed and reared, snatching up a condom and ripping it open. He was sheathed and coming over me a heartbeat later, but it was too long. I had no patience. I caught him in the cage of my arms and legs, pulling him to me, lifting to him.</p><p>He allowed me to drag him down, his palms flat on the bed by my shoulders, his biceps thick and hard. He reached between us with one hand, fisting his penis and stroking the wide crest through my slickness. I gasped and his eyes darkened, his cheeks flushing as he notched into the grasping opening to my sex.</p><p>“Jax,” I growled in warning.</p><p>He thrust hard, sinking deep in one lunge, wrenching a cry from me as I fell hard into orgasm. Neck arched and eyes squeezed shut, I lay taut as the pleasure pulsed through me, my core tightening on the powerfully thick cock inside me.</p><p>“Fuck, yeah,” he groaned, grabbing fistfuls of the sheets and pumping that long, rigid column of flesh into my quaking body. The climax grew, spurred by the rhythmic blows of his pelvis into my clit...the feel of his erection plunging relentlessly.</p><p>I writhed, helpless, lost to him, struggling to hang on to the part of my soul that wanted to surrender.</p><p>“That’s it, baby.” Jax’s lips were at my ear, his breath hot and quick. “Dig those claws into me.”</p><p>My nails were grasping at his sweat-slicked back, feeling the muscles flex as his body worked to service mine. His buttocks tensed and released beneath my calves, his thighs bunching and powering the drives of his hips.</p><p>His teeth sank into my earlobe and he groaned, his rock-hard abs contracting against my stomach, his sweat and mine sealing us together.</p><p>“Those noises you make,” he gasped. “God...they make me so hard.”</p><p>And he was. Like stone.</p><p>“So g-good.” I swallowed past a dry throat. “Jax...it’s so good.”</p><p>“You were made for me,” he said fiercely. “No one else, Gia. You’re mine.”</p><p>He drove the point home with every plunge, fucking me so thoroughly I couldn’t think beyond the need to come again.</p><p>My body was no longer my own.</p><p>Jax was the only one who could do this to me...make me mindless...an animal. I wasn’t me when I was in bed with him; I was his. Willing and ready to do whatever he wanted, to take whatever he chose to give me, knowing he would make me come again and again...</p><p>I whimpered, feeling his grip tighten, his muscles gathering as his own pleasure grew.</p><p>He nuzzled his damp face against me. “So tight and hot...Gia.”</p><p>I realized then that he was clinging to me as desperately as I was to him, that urgency laced every breath, every touch. He was screwing me as if he’d die if he stopped, as if it were possible to fuck me hard enough to delve even deeper beneath my skin.</p><p>My eyes stung with tears when the orgasm hit, stealing my breath and causing spots to blur my vision. A low noise poured out of me, unrecognizable as mine.</p><p>“Ah, sweetheart.” He kissed me, absorbing the sound, slowing until he was just circling his hips, stirring his raging erection inside me. “I love that sound you make when you come. It tells me how good you feel, how much you love my cock...my mouth...my hands.”</p><p>How much I loved him.</p><p>I was sprawled beneath him, wide open and possessed, while he felt like a dream. Something I’d conjured.</p><p>“Feel me,” he breathed, pushing up to look down at me. His eyes were so dark, his face flushed, the skin stretched tight with lust over the sculpted angles of his face. “Inside you—” he rolled his hips, then caught my hand, lifting it to his slick chest “—and you inside me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Jax—”</p><p>He took my mouth, kissing me deeply, his tongue rubbing along mine. His hips circled slowly, making me feel every throbbing inch of him. The leisurely, deliberate stroking over tender nerves kept me hot and edgy. He remembered me well, knew just how to keep me revved and needy.</p><p>“I missed you, Gia,” he whispered into the kiss. “Did you ache for me, too?”</p><p>When I didn’t reply, he brushed the wet tendrils of my hair away from my face and searched for the answer.</p> <p>My sex rippled along his length. His eyes closed and his lips parted, his body tightening. “Not yet. I’m not coming yet.”</p><p>“Please...” I was begging and I didn’t care. I just wanted him to come. I wanted it more than my next breath.</p><p>“I’m not rushing this.” He reached behind him to grab my wrist, bringing my right arm up and over my head. His other hand pushed beneath my buttock, lifting me into a smooth, easy thrust. “Umm...perfect. It’s always been perfect.”</p><p>I wanted to tease him, to play the game as coolly as he was, but I couldn’t.</p><p>“Stop thinking and feel, baby,” he murmured, nibbling on the corner of my mouth. “Let me make you feel good. That’s all I want. To make you feel good.”</p> <p>Turning my head, I caught his lips and let him.</p><p>NICO EYED ME as I slid onto a bar stool at Rossi’s after closing and I knew he saw my makeupless state, which betrayed the shower I’d taken just a half hour before. He had been cleaning up the bar, but he stopped and pulled out a beer, popping off the top before sliding the bottle over to me.</p><p>“Forgot how much I like Jax,” he said conversationally.</p><p>I nodded. I liked Jax, too. Thing was, I didn’t know which Jax was the real one.</p><p>“You two going to work it out?”</p><p>“No, it’s temporary. But this time, I know the rules.”</p> <p>“Maybe I don’t like him so much.” Nico popped open a second beer and took a long pull. “He’s in love with you, you know.”</p><p>“He’s in lust,” I countered drily, picking at the label on the bottle. “And that’s okay, I can live with that. It’s the other stuff—the way he talks to me sometimes, as if there’s more, and the head trip I’m on about why he left and came back—that’s hard for me to deal with.”</p><p>“My offer to knock some sense into him still stands.”</p><p>I smiled. “Might be easier and more effective to knock sense into me.”</p><p>“Can do that, too.” He tapped his bottle against mine. “But you’ve got plenty of sense. You know what you’re doing. You just wish you weren’t doing it. He obviously doesn’t have a clue or else he wouldn’t risk letting you get away. He’ll never find better.”</p><p>“Ah, God, don’t get sappy on me now. I can’t take it.” I wasn’t entirely kidding. I felt weepy and emotional. Sex with Jax did that to me.</p><p>Nico grinned. “Fine. Get off your ass and help me clean up so we can get the hell out of here.”</p><p>With a sigh, I slid off the bar stool. “Shit. I should’ve stuck with sappy instead.”</p> <p>AN INSISTENT POUNDING on Nico’s door woke me Sunday morning. I rolled off the couch with a curse, stumbling over with the intention of bitching out whoever it was.</p><p>When I blinked wearily through the peephole, however, I saw beloved faces.</p><p>Pulling off the security chain and turning the dead bolt, I opened the door to my brothers and Denise. “What the hell?” I groused.</p><p>“Yeah. What the fuck?” Nico wandered in from the bedroom wearing sweatpants that barely clung to his hips. Brother or not, I could still appreciate what a good-looking man he was. “You know what time it is?”</p><p>Vincent came in first. “Time to get up.”</p><p>Angelo followed Denise in, holding her hand in his. “You put Gianna on the couch? Seriously?”</p><p>“I offered her the bed.” Nico crossed his arms. “She wouldn’t take it.”</p><p>“Don’t blame her,” Vincent said. “If that bed could talk, it’d have its own reality show.”</p><p>“Don’t be jealous,” Nico returned. “I’m sure your bed will see some action eventually. Despite everything, you’re still a Rossi.”</p><p>“What are you doing here?” I interjected. I was really happy to see them. Having my family around brought back normalcy I’d lost the night before in Jax’s bed. I was back to feeling like Gianna Rossi—and not absolutely sure I was the writhing, moaning, clawing woman who’d enjoyed a half-dozen orgasms in a matter of hours. It was as if I were two different people.</p><p>And you’re mad at Jax for having two sides....</p><p>“We’re waiting for you to get dressed so we can grab some breakfast,” Denise answered. Her hair was pulled into pigtails that framed her pale face. She’d matched her lipstick to the pink in her hair, making her look like some sort of anime superheroine. “I’m starving.”</p><p>“Something’s wrong with you people,” Nico muttered. “It’s too fucking early for food or anything else.”</p><p>“It’s nine o’clock,” Vincent pointed out.</p><p>Nico shot me a look and drawled, “As I said.”</p><p>BY NOON, WE’D eaten and hit the basketball court at Nico’s apartment complex. Not to brag, but I was pretty good at the game—enough that I’d gotten a partial scholarship to UNLV for my skills. Of course, I’d learned everything I knew from my brothers.</p><p>I had just cleared a three-pointer and was waving off the usual good-natured taunts and ribbing when I caught sight of Jax walking up. I stopped right where I was, admiring his long legs in shorts and his loose-fitting T-shirt. He wore shades and twirled his keys around his finger. When Nico bounced the ball to him, Jax caught it up and dazzled me with his dimpled grin.</p><p>“Hey,” he said, coming to me first and pressing his lips to my flushed forehead.</p><p>“You found us.” A hot rush of pleasure surged through me. He’d picked me up and dropped me off at Rossi’s, so finding Nico’s place had taken initiative and effort.</p><p>“I missed waking up to you,” he whispered against my skin.</p><p>His damned sunglasses made it impossible to read him. I took the ball and backed up so I could breathe.</p><p>“Rutledge,” Angelo greeted him, bristling.</p><p>“Kick back, killer,” Denise admonished, rising from the chair her husband had dragged over from the pool area. “Hi, I’m Denise. Angelo’s wife.”</p><p>Jax shook her hand. “A pleasure.”</p><p>“I’ve heard a lot about you,” she said. “None of it good. I hope you prove the guys wrong.”</p><p>Jax glanced at me with raised brows.</p><p>“Oh, she doesn’t talk about you at all,” Denise qualified, making me smile. The woman knew how to get her digs in.</p><p>Vincent and Angelo both reluctantly shook hands with Jax, then Vincent said, “Are we playing or what?”</p><p>“I’d like to jump in when there’s a chance,” Jax said, surprising me.</p><p>“Shit.” Nico ran a hand through his hair. “Take my spot on Gianna’s team. I’m wiped, thanks to some too-fucking-early-in-the-morning visitors.”</p><p>“Pussy,” Angelo muttered.</p><p>“Whatev. We were kicking your ass.”</p><p>“We were going easy on you,” Vincent answered, catching the ball when I tossed it his way. “So we wouldn’t have to hear you bitch.”</p><p>“You wouldn’t hear me if you’d stayed home.”</p><p>“Shut up,” I told them. “Let’s do this.”</p><p>“There’s my girl,” Jax said with a smile.</p><p>We started the game. Jax was good. Really good.</p><p>I’ve played hoops now and then. Nothing like you. Never gave it the time.</p><p>I remembered those words of his from before, whispered into my hair while he cuddled me after sex. Clearly, he’d given it time since we parted.</p><p>Had he done so because of me? Was I reaching by making that connection?</p><p>Jax passed the ball and I made the shot.</p><p>If only figuring him out were as easy.</p><p>Chapter 9</p><p>MONDAY WAS A day like any other, yet it felt so different. It took a lot of work to avoid thinking about Jax. At least until I got to the office.</p><p>I arrived a half hour early, but Lei was already there. She sat at her desk, dressed in a black skirt and blazer embellished with red. Her hair was up, her red-framed glasses perched on her delicate nose. She glanced up when I stepped through the open doorway, her painted mouth set in a hard line.</p><p>“Ian got to Isabelle over the weekend and signed her.” She pulled her glasses off.</p><p>“What? How did he know?”</p><p>Lei sat back. “That’s a good question.”</p><p>I felt a flutter of unease in my stomach. “I haven’t told a soul. No one.”</p><p>She nodded grimly. “I believe you.”</p><p>“Would Isabelle leverage you against Ian?”</p><p>“It’s possible.” Leaning back, she gestured for me to settle into one of the chairs in front of her desk. “Ian is better known than I am.”</p><p>Thanks to the Hollywood-themed eateries she’d envisioned, which Ian had stolen from her. The irony was painful.</p><p>“But I don’t think so,” she went on. “One of the things that attracted Isabelle to working with us is that Savor is headed by a woman. Ian would’ve had to make an offer too good to refuse.”</p><p>“I wonder what it was.”</p><p>“I intend to find out. I’m meeting with Isabelle over lunch to see what I can coax out of her.”</p><p>I took a seat. “I should talk to Chad. Maybe take him out to lunch.”</p><p>“Yes, I was going to suggest that.” She studied me. “Did you see Jackson Rutledge this weekend?”</p><p>I hesitated a split second before answering, feeling as if a trap were closing in on me. “I did,” I confessed, “but we didn’t talk business. Not even in a roundabout way.”</p><p>“Do you trust him?”</p><p>“I...” I frowned. I trusted him with my body. I trusted him to know how much my family meant to me. Was there anything else? “With what?”</p><p>She smiled in a way that said she knew why I’d hesitated. “What are you going to do about him?”</p><p>Sitting back, I let the question really sink in. I’d been fielding variations of that same query all weekend, but I hadn’t given it much thought. What was I going to do? It struck me then that I’d never done anything when it came to Jax. He decided when our relationship began and ended, where we met, and when—and how—we had sex. All along, I’d just gone with his flow.</p><p>It was time for me to start making my own rules. Something beyond asking him to say goodbye when he decided we were over.</p><p>“I’m not sure yet,” I answered honestly. But I was going to work on it.</p><p>WHEN I GOT to my desk, I called the Four Seasons and left a message at the hotel’s front desk for Chad to call me. It was still early, and I didn’t want to risk waking him up. I needed him refreshed and sharp to go over our business plans.</p><p>Isabelle was gone. We needed a replacement. Quick.</p><p>I looked through all my notes, considering the chefs who’d caught my attention previously. There weren’t that many who specialized in Italian, mostly because my background made it really hard to impress me. Then again, going with another Italian was problematic—it would be hard to spin Isabelle’s defection in a way that wouldn’t make the new recruit feel like a second choice.</p><p>I tapped my pen against my jaw, thinking. “American, European...”</p><p>Lei walked out of her office.</p><p>“Asian!” I blurted.</p><p>She came to a halt, her brows raised. “Excuse me?”</p><p>I stood. “Chad represents American cooking. Inez represents European. I think we need to find someone to represent—”</p><p>“Asian.” Her arms crossed. “Do you have any idea how hard it would be to pull together a dueling menu with that combination?”</p><p>“Easier than convincing some chef he or she isn’t our last, desperate choice.”</p><p>Her lips pursed. “Good point. Do you have someone in mind?”</p><p>“David Lee.”</p><p>Lei’s mouth curved slightly, her eyes warming with a look of approval. “He’s good, but I’m not sure he’s ready.”</p><p>I nodded, very much in agreement with her. “That’s why I’m thinking I’ll take Chad out to the Asian bistro where Lee works. Introduce them. See how they hit it off. Or not. Chad could steer David along.”</p><p>“A mentor.” She nodded thoughtfully. “I’ll let you run with this and we’ll regroup after lunch. We’ll need to move quickly, but we have the rest of today to decide our plans.”</p><p>I was grateful for her trust and was determined not to let her down. “Thank you.”</p><p>Lei smiled. “I like your quick thinking, Gianna. I’m impressed.”</p><p>Smiling in return, I got back to it.</p><p>A BEAUTIFUL BOUQUET of starburst lilies in a lovely pink vase arrived shortly after ten. My breath caught at the sight of them being carried down the hall by LaConnie. I knew they were from Jax. They were my favorite flowers, and he knew it.</p><p>“Who sent you these, girl?” LaConnie asked, setting them down on my desk. “He might be a keeper.”</p><p>I wish.... I fingered the card, but didn’t want to open it in front of anyone. It felt too personal. “Someone with good taste.”</p><p>She shot a narrow-eyed glance at me before she backed away.</p><p>“I love your dress,” I told her, admiring the black sheath she wore that had an electric-blue piping to match her heels.</p><p>“Changing the subject won’t distract me from wanting to know who sent you those,” she warned.</p><p>“I’ll tell you later,” I promised.</p><p>She wagged her finger at me. “I’m going to hold you to that!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When she was a good distance down the hall, I pulled the card from its stake and opened it.</p><p>Dinner tonight?</p><p>The blunt query was so typical of Jax, I couldn’t help but grin. But still, things had to be different the second go-round. He’d insinuated himself into my life so well that I hadn’t been able to escape the memories until I’d left Vegas, yet I had barely dipped my toe in his life. When he broke things off again, it would be the same in New York—I’d have memories of him everywhere. But he would be safe from my ghost.</p><p>That had to change. This time, I was going to haunt the man the way he haunted me.</p> <p>I dug my smartphone out of my purse and found the number he’d called me from the night I’d taken Chad to Denise’s salon. I texted: Only if you’re cooking. Your place?</p><p>It took five minutes before my phone vibrated on my desk. His reply: What time should I pick you up from work?</p><p>The surge of triumph I felt brightened my day. 5:30. And BTW...TY for the flowers. Lovely.</p><p>Yes, you are, he sent back.</p><p>I typed out a quick response: Says the most gorgeous guy I know.</p> <p>There was another pause, one long enough that I thought he wasn’t going to answer. Then he sent, Skin deep.</p><p>That lingered with me for a long time.</p><p>WHEN CHAD CALLED me back, I asked him to meet me at Savor’s offices. I thought it’d be good to remind him of just how successful Lei was. He showed up just before noon, looking handsome in khakis and a tucked-in dress shirt, with his collar open and cuffs rolled up.</p><p>I met him at reception and led him back to my desk under the guise of fetching my purse. I wanted to use it as an excuse to show him around again.</p><p>“I’m glad you called,” he said, walking beside me. “I’m really starting to have my doubts with all that’s going on here.”</p><p>“I’m sure you are. I mean, how many roadblocks can you hit before you take it as a sign, right?”</p> <p>“Right.” He shot me a grateful smile. “You get it.”</p><p>“Of course I do. That’s why you’re going to trust me to tell you if the time comes to throw in the towel.” We reached my desk, and I stopped, facing him. “I’m not going to screw you over, Chad. I promise you that.”</p><p>He shoved his hands in his pockets. “I’m stuck in the middle of a tug-of-war between Ian and Lei, and I can’t help thinking that means no one but you is really paying attention to me. I could be anyone.”</p><p>“But you’re not anyone. You’re one of the most talented chefs in the world today, and I’m going to see that you shine.”</p><p>Leaning forward, he caught my hand in his. “Thanks.”</p><p>“Thank you. You’re giving me the chance to make this happen.”</p><p>He glanced at the lilies on my desk. “Nice flowers. You got an admirer? Do I have competition?”</p><p>“It’s not serious.”</p> <p>“Hard to be serious when you’re working as much as we do.”</p><p>“Isn’t that the truth?” I caught the handle of my purse and shut the drawer. “I’m married to my fabulous career.”</p><p>Chad nodded. “I know how that goes. I’m glad we’ll be working together so much over the next few months—if everything pans out, anyway. Maybe we can carve out some time for fun. No strings.”</p><p>My mouth curved. “Maybe. Ready to roll?”</p><p>“Have been since I met you, sweetheart.”</p><p>Laughing, I caught his arm and we headed out.</p><p>“RUTLEDGE CAPITAL.”</p><p>I glanced up as Lei reached my desk. I’d been waiting for her to get back so I could tell her the good news: David Lee was going to work out. He’d hit it off with Chad right away. Plus, when I talked vaguely with David about our plans for Chad, he hadn’t been shy. He’d said outright that he was hoping for a similar opportunity to come his way, too.</p><p>“What about it?” I asked, rising to my feet.</p><p>“According to Isabelle, Rutledge Capital committed to a significant investment in Pembry Ventures. She says she spoke with Jackson Rutledge himself on Sunday and he confirmed it.”</p><p>A heavy lump of ice settled in my stomach. “Yesterday?” A weekend Jax had spent in my life. In me...</p><p>I sank slowly back into my chair.</p><p>Lei nodded grimly. “Ian offered Isabelle a fantastically lucrative signing package. She would’ve been a fool to refuse it.” She closed her eyes and pinched the bridge of her nose. “So stupid of him! And petty. Ian isn’t making smart moves. Neither is Rutledge.”</p><p>I’d slid out of Jackson’s bed, and he’d slid a knife in my back.</p><p>“We can get David Lee,” I said hoarsely. I had to focus on the immediate goal. It would happen if I gave it my all. “He likes the idea of a trio. Less pressure and heat while he finds his way.”</p><p>“Oh,” she said drily. “Is he really that humble?”</p><p>“It’s a strategic move. He’ll want to cut loose eventually, sooner rather than later, but we can get a couple years out of him, I think.”</p><p>She gave an elaborate sigh. “I went ahead and signed Inez before Ian got to her. It’s contingent upon a deal with Mondego, but it shores us up.”</p><p>“So we’re back on track.” I glanced at the flowers on my desk. If Jax were planning on saying goodbye tonight, he was in for a surprise. I wasn’t going to let him just stroll into my life and screw everything up...again.</p><p>Paybacks were a bitch. So was I, when the situation called for it.</p><p>“You okay?” she asked, studying my face.</p><p>“I’m good,” I said calmly, feeling the chill in my gut spread and numb me. “We should sign David as soon as possible.”</p><p>“Agreed. I’ll take care of it.”</p><p>“And we should probably take Chad back on a site tour of the Mondego in Atlanta. Let him get the sense that things really are moving forward.”</p><p>“You want to do that.” It wasn’t a question.</p><p>“I think I could use a few days away.”</p><p>Lei leaned her hip against the front of my desk. “Away from Jackson?”</p><p>“I’m having dinner with him tonight, actually.”</p><p>Something in my tone must have given my thoughts away, because her lips curved wryly. “That should be interesting.”</p><p>“You can bet on it.” I exhaled the hurt I couldn’t contain and let the anger spread. Worry followed swiftly. “You don’t have a problem with me seeing him, do you?”</p><p>“I haven’t forgotten why I hired you, Gianna.” Lei headed toward her office. “Don’t worry, I’m good and you’ll be fine.”</p><p>I would be. But I wasn’t there yet.</p><p>FIVE O’CLOCK ROLLED around and my excitement ratcheted up. Not just because Chad had agreed to head to Atlanta the next day and I was ready to get out of town. The truth: I was ready to see Jax and deal with him. I had to force myself to slow down when I saw him waiting at the curb for me after work, act as if nothing were wrong in my world and I had time to spare.</p><p>He lounged against a black McLaren, a car I recognized because one of Lei’s chefs had bought one to celebrate the five-year anniversary of his first restaurant. Jax’s arms and ankles were crossed, his pose relaxed and sexy. Sunglasses shielded his eyes from the glaring reflections cast by the towering skyscrapers around him. He was dressed in black slacks, a white shirt and gray tie. His dark hair was tousled, like he’d run a hand through it and let his styling efforts go at that.</p><p>Women stared at him as they walked by, their heads turning to keep their eyes on him even as their feet moved. Men glanced his way and altered course some, instinctively recognizing an alpha male at rest. Jax always had that effect on people. When he entered a space, he immediately took it over.</p><p>Squaring my shoulders, I pushed through the revolving doors and walked straight up to him. I wore a black Nina Ricci sheath. It was an elegant, classic piece that I’d paired with the nude peep-toe Louboutins my brothers had collectively given me for my last birthday.</p><p>I looked like the kind of woman who would be seen with Jackson Rutledge. Better yet, I felt like it.</p><p>Keeping my stride, I marched up to him, fisted his tie in one hand, and stretched up to kiss him. Hard.</p><p>A low rumbling sound was my reward, followed by the rapid unfolding of his big body. He got me before I could pull away, catching me by the nape and hip, holding me to him as he deepened the kiss into a full-blown melding of our open mouths.</p><p>Standing on the street, with cars and people streaming by, we kissed as if we were alone.</p><p>“Hello, gorgeous,” he said gruffly when I broke away to pull air into my tightened lungs. He nuzzled his cheek against mine.</p><p>I broke free with a quick twist and slapped him across the face.</p><p>His head turned with the blow, his breath hissing out between his teeth. Rubbing his jaw, he looked at me with hot eyes. “I’m guessing you’re not looking to play rough.”</p><p>“You fucked me over, Jax. Right after you fucked me literally. Did you take a shower first? Or were you still smelling like me when you made the call?”</p><p>“Get in the car, Gia.”</p><p>“You’re an asshole.” I tamped down my simmering anger at him. At me. At the entire situation. But mostly at him.</p><p>“Always have been,” he agreed grimly. He straightened and opened the passenger door, which involved pulling the door out then pushing it upward. “Took you a long time to figure that out.”</p><p>I stood there a moment, staring at him. He stared back, his eyes hidden behind the damned sunglasses, his mouth an unyielding line.</p><p>“Don’t lose your confidence now,” he taunted softly.</p><p>My mind spun as it had all day. Why did he want me to go with him? Why the flowers and the invitation to dinner? “You angling for a kiss-off screw?”</p><p>“I’m not ending things. I want you. That’s not news.”</p><p>His brusque, unapologetic attitude made my teeth grind. It was like he was daring me to be the one to walk away.</p><p>I slid into the seat and clicked my seat belt into place.</p><p>Jax ducked his head down. He looked at me over the rim of his shades. “For future reference, the slap was overkill. You had me down for the count with the kiss.”</p><p>He straightened and shut the door.</p><p>I smiled grimly. In the boardroom and the bedroom, Jackson Rutledge was going to learn a thing or two about playing with me.</p><p>JAX PULLED INTO the subterranean parking garage of his apartment building and two valets greeted us. As one of the bow-tied guys helped me out of the car, I was struck again by the financial gulf between Jax and me. I wasn’t intimidated by his wealth, but it was possible the disparity was a bigger problem for him.</p><p>It didn’t improve my mood to think of it.</p><p>Reaching for my hand, Jax linked our fingers and led me to an elevator. I’d half expected him to fly us out to Virginia or D.C., and realized abruptly that I had never allowed myself to consider the likelihood of him living at least part-time in New York, too. But of course it made sense that he would have a place in the city, which was the financial center of the country.</p><p>The elevator doors closed behind us, and he immediately pulled me into him. I let him. He leaned back against the brass handrail, spread his legs, and urged me to stand between them, his hands running up and down the length of my spine.</p><p>It’d been so long since I’d been held with such intimacy and tenderness.</p><p>He’d been in New York the whole time....</p><p>I closed my eyes and absorbed the warmth of his body, the smell of his skin, the soft caress of his breath against my temple. I’d denied myself the comfort of a man’s touch for too long.</p><p>“How was your day?” he murmured.</p><p>“Busy. How was yours?”</p><p>“I couldn’t stop thinking about you.”</p><p>I closed my eyes, holding fiercely to my wrath. It was a harder task than it should’ve been.</p><p>He laid his cheek against my temple. “I’m sorry, Gia.”</p><p>“For what? Helping Pembry screw the deal I was working on?”</p><p>Jax sighed. “You knew the score. We talked about this.”</p><p>“That doesn’t excuse you. I don’t accept your apology.”</p><p>“I don’t blame you, but you’ll find a way to handle it. This is a minor setback you’ll have no problem overcoming.”</p><p>I met his gaze. “You’re damned right.”</p><p>The elevator dinged, announcing our arrival on his floor. When I turned around and saw a small foyer and double doors, I realized Jax lived in a penthouse apartment. Which explained why the elevator hadn’t stopped in between the parking garage and what I now knew to be the top floor.</p><p>Grabbing my hand again, Jax led me across gold-veined marble tiles and unlocked the door by placing his palm against a wall-mounted security pad.</p><p>“I bet your dates love this James Bond stuff,” I said as the thick walnut door swung open automatically. I managed to say the words casually, but envy ate at me as I imagined him with other women.</p><p>“What do you think of it?” he asked, looking over his shoulder at me.</p><p>“Ah, well, I’m a simple girl at heart.” My gaze raked over the sunken living room with its snow-white carpet, black-leather-and-chrome chairs and sapphire-blue area rug. A sterile, bluntly masculine bachelor pad.</p><p>I frowned. “This isn’t you.”</p><p>The door shut behind us. “No?”</p><p>I’d expected warm colors, varied textiles, colorful modern art—decor that reflected the vibrant, slightly rough-around-the-edges, occasionally quirky man I loved.</p><p>Stepping deeper into the room, I struggled with a profound sense of disappointment. Had I really been so wrong about him?</p><p>“Would you like a drink?” he asked quietly, coming up behind me. He stood so close I could feel the warmth radiating from his body.</p><p>“Definitely.”</p><p>His dimple winked at me. “You won’t throw it in my face, will you?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m tempted, I admit,” I said dryly.</p><p>His hands came to rest on my shoulders. “Remember that night at the Palms?”</p><p>My hands fisted. “Low blow, Jackson.”</p><p>I would never forget standing on the fifty-fifth floor’s outdoor sky deck with Jax wrapped around my back and a glass of white wine that we shared in my hand. The city and desert stretched for miles, the glow of the neon lights fading into inky darkness.</p> <p>What a view, I’d said, leaning into him, feeling happier than I ever had. I was dating the perfect guy, a man who made my toes curl at night and my days bright. He’s going to change my life, I’d thought. He’s going to change me, for the better.</p><p>It seemed ridiculous now. Making changes was my responsibility. Having a great guy was just a bonus.</p><p>I started to pull away, but he held me in place.</p><p>“I’m sorry,” he said again.</p><p>I tugged a little and he let me go, freeing me to face him. “Then why did you do it?”</p> <p>“Why do I do anything?” he said gruffly, his eyes dark and hard. “Because I’m a Rutledge. We fuck people over, Gia. That’s just who we are.”</p><p>“That’s a cop-out,” I snapped.</p><p>“That’s the truth.”</p><p>I walked away, my gaze roaming.</p><p>“If you want to walk out,” he said quietly, “I won’t stop you. But I’d like you to stay.”</p><p>I paused. Turning, I confronted him, hating how his features gave nothing away. “That’s what you want, isn’t it? You want me to end things. Piss me off, get me to storm out. It wouldn’t be a quiet breakup and it’d certainly be a little messy, but quick and final nevertheless. Just the way you like it.”</p> <p>“I’d hate it, but I’m no good for you, Gia.” He passed me and moved into the kitchen.</p><p>I tossed my purse on one of the armchairs. “I guess I’m a glutton for punishment.”</p><p>Jax pulled a bottle of white wine out of the fridge, then set it on the counter. The kitchen was as devoid of personality as the living room, with black cupboards and counters, and only a one-cup coffeemaker to show that anyone was in residence. Coming from a family for whom the kitchen was the center of the home, I found Jax’s depressing.</p><p>He watched me step out of my heels.</p><p>When I reached up to release my hair, I warned him, “I’m going to match your backstabbing move and raise you one round of angry sex.”</p><p>His lips parted when I reached under my dress to shimmy out of my panties. “Gia.”</p><p>“I can play this game.” I tossed my underwear at him and smiled tightly when he caught them. “And I can win.”</p><p>Chapter 10</p> <p>JAX POCKETED MY underwear and came to me, abandoning the unopened wine.</p><p>He cupped my face. Lowering his head, he kissed me, his lips clinging sweetly. His hands moved to my shoulders, then down my back, his fingers deftly lowering the zipper on my dress.</p><p>I went to work on the knot of his tie, letting the anger simmer and blend with my lust into a raging desire. I focused on him. On us. On the feel of him beneath my hands, the beloved scent that was his alone, the way his breathing deepened and his heartbeat quickened as the hunger grew between us.</p><p>I never noticed things like that with anyone else, which made it so much harder to accept that maybe Jax and I weren’t meant to be together.</p><p>“Did you have this place when you came with me to Rossi’s?” I asked.</p><p>We’d stayed in a hotel during that trip. If he’d had an apartment in town at the time, it shed a whole new light on his feelings for me. After all, how much could a guy care about his girl if he’d rather bang her in a hotel than his own bed?</p><p>“No. I bought this place last year. Gia—” Standing there with his shirt open and parted, his golden torso on display, his body so beautifully hard and defined, his dark eyes so warm and tormented...</p><p>I caught his hand and pulled him out of the kitchen. Anticipation thrummed through my veins, along with something darker. And more wicked.</p><p>JAX’S HAND CLAWED at the sheet, his stomach clenching as I mouthed the plush head of his cock. He was hard and thick, so aroused that precum streamed from the crest to coat my tongue. I fisted him at the root, milking him with my hands and mouth, relishing the curses and moans that spilled from him.</p><p>“Jesus,” he gasped as I licked along a thick, pulsing vein. Running my parted lips up and down the side, I teased him, kept him on edge, driving him to the point of no return.</p><p>“Don’t play, Gia,” he growled. “Suck me or fuck me. Make me come.”</p><p>I smiled, my gaze lingering over the tight lacing of muscle that crossed his abdomen. He was sheened with sweat, his gorgeous face flushed and eyes bright. With his gaze on me, I wrapped my mouth around him and sucked, taking him to the back of my throat.</p><p>“That’s it,” he said hoarsely, his neck arching to press his head into the pillow. “God, that’s good. Your mouth...”</p><p>I owned him in that moment. Jackson Rutledge was mine.</p><p>His fingers pushed into my hair, gliding over the damp roots, brushing the strands back from my face. “Ah, Gia. Keep sucking me like that, baby.”</p><p>He throbbed against my tongue, his flavor and desire intoxicating me. I loved it. Loved giving him so much pleasure his body quaked with it.</p><p>“Going to come so hard for you...” he groaned.</p><p>Pulling off him, I sat up, then slid off the end of the bed.</p><p>“Gia.” His heavy-lidded gaze caught mine. “Damn it. Finish me.”</p><p>“It’s tough when you’re working toward something...when the excitement builds and you can almost taste it...then someone takes it away from you, isn’t it?”</p><p>Snarling, he jackknifed upward. “Get back here.”</p><p>I smiled and snatched his shirt up from the floor. “I think you need to cool off a bit first.”</p><p>“I think you should get your gorgeous ass back in this bed first.” Jax rose from the bed like an orgasmic dream come to life, all hard rippling muscle and golden skin. His cock was thick and long, curved upward and so stiff it barely moved as he walked toward me. He was so perfectly proportioned, so boldly masculine.</p><p>It was damned hard resisting jumping on the bed and letting him fuck the hell out of me.</p><p>He reached for me, and I sidestepped quickly, laughter in my throat.</p><p>The doorbell rang.</p><p>Jax didn’t care. He stalked me with single-minded determination. I danced away, struggling to thrust my arms through his shirt. The fabric smelled like him. I liked that a lot.</p><p>“You should get that,” I told him.</p><p>“Gia,” he said, in a low warning tone. “If you want to be comfortable when I fuck you, you better get on the bed. Otherwise, I’m pinning you to the nearest flat surface.”</p><p>The doorbell rang again as I darted out of his reach. “Someone’s at the door!”</p><p>“They can wait.” He fisted his cock, stroking it. “This can’t.”</p><p>I feinted to the right, then the left, using moves I’d perfected on basketball courts. It amazed me that he could be naked while chasing me and still look both tempting and formidable. His abs glistened with sweat; his gaze was avid and hot, his body taut with muscle.</p><p>He caught me before I crossed the threshold of the bedroom door. His arms locked around me, hard as steel, his chest heaving against my back.</p><p>“Jax—”</p><p>“Say no if you mean it,” he breathed roughly. “Otherwise, I’ve got to have you, baby.”</p><p>The note of desperation in his voice swayed me, made me long to give in. Being wanted by Jax was one of the major highs in my life.</p><p>“Jackson.”</p><p>We both stiffened at the sound of Parker Rutledge’s voice in the living room.</p><p>“I know you’re here,” he called out. “We need to talk, son.”</p><p>Jax cursed. His hand slid into the open lapels of his shirt and cupped my breast possessively, his grip tightening until my feet left the floor.</p><p>“Give me a minute,” he yelled before stepping back and kicking the door closed.</p><p>I thought he’d let me go, but he turned me instead and kissed me breathless. One hand clenched in my hair, the other gripped my buttock.</p><p>When he released me abruptly, I stumbled, my legs weakened by the ferocious passion in his kiss.</p><p>He walked to the en suite bathroom and grabbed a black silk robe, belting it angrily. “Stay here.”</p><p>“Don’t you want me to say hi?” I asked, my voice tight.</p><p>Jax didn’t look at me when he said, “I’m not giving him the satisfaction.”</p><p>The door shut with a bit too much force behind him and then I heard the sound of him talking. His tone was far from welcoming and I scrambled to get dressed. I wasn’t going to hide in his bedroom like a naughty teenager.</p><p>By the time I’d finished, I couldn’t hear the low drone of conversation anymore. And when I opened the bedroom door, silence greeted me.</p><p>I padded out in search of my heels and once I had them on, I felt better prepared to deal with Parker...despite wishing my hair was tied back.</p><p>While I waited for Jax and his father to make an appearance, I wandered around the living room, examining it closely for signs of the lover I thought I knew. What I found were only a handful of framed photos, most of them vintage snapshots of a striking blonde whom I assumed was Jackson’s mother.</p><p>The photos ranged from fresh-faced black-and-whites to more recent ones in color, and the transformation the pictures documented was startling. Youthful softness had hardened over time, had been polished into a glittering facade, then faded. The upturn of pretty lips gradually migrated downward. One candid shot caught her unawares and staring out a window. The look on her beautiful face conveyed a sense of loneliness.</p><p>I picked it up, looking at it more closely, and noted another framed picture lying facedown behind it. I slid it forward, then lifted it, stilling when I discovered a photo of Jax and me.</p><p>It was a shot Vincent had captured with his cell phone and forwarded to me. He’d taken it during that first and last family dinner with Jax at Rossi’s. Jax sat behind me, supporting me as I leaned back against him. We were laughing, his arms around my waist, my arms draped over his. I’d sent the photo to Jax and made it the wallpaper on my phone until it became too painful to look at.</p><p>I propped the photo back up and returned the picture of his mother to the shelf, my heart racing along with my thoughts.</p><p>Where the hell was Jax?</p><p>The apartment was eerily quiet. I went in search of him, my gaze sliding absently past the front door, then stopping on the small security video monitor mounted in the wall beside it. Jax and his dad stood in the foyer, Jax with his arms crossed over his chest and his father with hands tucked into the pockets of his slacks. As alike as they were in physical appearance, they couldn’t have been dressed more differently, and yet Jax was clearly holding his own.</p><p>I studied the distance between them, the way they stood apart and eyed each other warily. Their family dynamic was alien to me, so far removed from the Rossi warmth that nurtured me.</p><p>The Rutledges were demanding. I didn’t know all the details of Jax’s upbringing but it was clear he’d grown up in a high-pressure environment. He’d made it obvious he didn’t hold a high opinion of Rutledges, including himself, but he had chosen his family over me—he’d made sure Ian was able to sabotage the Mondego deal—after saying I was the one person he gave a shit about.</p><p>Some long-overdue research was in order.</p><p>I took off back down the hall, shameless in my search for answers. I figured he owed me something and I’d snoop for it if I had to.</p><p>Turning into his home office, I paused on the threshold, seeing a room more in keeping with what I’d expected of him. Although the overall look was modern and masculine, the space was warmed by neutral walls and honeyed woods, with accents of red and gold. Bookcases hugged the walls, filled with a colorful array of hardcover literary volumes and dog-eared popular fiction paperbacks. There was another picture of me on the shelf, this one upright. I was solo. No Jax.</p><p>The photo was recent. No more than six months old.</p><p>From across the room, I stared at it, feeling my palms go damp.</p><p>He’d been keeping tabs on me.</p><p>The questions kept piling up, but one very important answer was made glaringly clear by the existence of that picture. I couldn’t decide if I felt joy or pain about it. Maybe it was a mixture of both.</p><p>Jax’s desk was covered in scattered pages and open folders, but I turned my back on them. I’d seen enough.</p><p>I headed back out to the living room where I grabbed my purse and set off toward the door. The men outside seemed surprised when I pulled it open. They stopped talking, and I gave a brisk nod to both of them before striding to the elevator with my head held high.</p><p>“Gia.” Jax took a step toward me. “Don’t go.”</p><p>“I’ll ride down with you, Miss Rossi,” Parker offered, coming up to me with a smile that was far too friendly. “It’s good to see you again.”</p><p>“Mr. Rutledge,” I replied.</p><p>“Call me Parker, please.”</p><p>“Dad,” Jax growled, coming closer. “You and I aren’t done talking.”</p><p>Parker patted him on the shoulder. “We can pick up where we left off later, son.”</p><p>Jax looked at me. “We’re supposed to be having dinner.”</p><p>“I’ll need to take a rain check.”</p><p>“Don’t do this, Gia.”</p><p>I smiled grimly. “Don’t worry, I’ll be back.”</p><p>The elevator car arrived, and Parker gestured me in before him.</p><p>Jax caught me by the elbow. “Give me five minutes.”</p><p>“How about I call you later?” I said, realizing I wasn’t even tempted to stay. I was too raw, too confused. I needed some breathing room.</p><p>His jaw tightened.</p><p>“It’s all right, Jackson,” Parker said quietly. “I’ll show her out.”</p><p>Jax turned his head slowly toward his father, his features set like stone. “I meant what I said.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You always do.” Parker grinned.</p><p>I stepped into the elevator just as the doors started to close again. Parker joined me, but my attention was on Jax, our gazes locked together. His hands were fisted at his sides, his jaw tense and determined. But his eyes...those deep, dark eyes...they made the same promises they always had. I believed them now. I had the proof.</p><p>Parker faced me as the car began its descent, smiling. “How are you, Gianna?”</p><p>“I’ve been better. How about you?”</p> <p>“You make it awkward to say it’s been a good day so far.”</p><p>My mouth curved. “And a good day for your friend Ian, too.”</p><p>“Ah.” His eyes brightened with amusement. “Please don’t hold that against Jackson.”</p><p>I shrugged. “It’s just business, right?”</p><p>“You’re a very practical woman. Certainly one of the many reasons why he’s so taken with you. Speaking of which...” He rocked back on his heels. “I’d like to get to know you better, Gianna. Would you and Jax come to dinner with my wife and me? Something quiet at our house in the Hamptons, maybe?”</p> <p>“I’d like that.” I’d like anything that would let me get a better handle on Jax.</p><p>“Good. I’ll let Regina know.” His smile faded a little. “Don’t let Jackson talk you out of it. He wants to keep you all to himself.”</p><p>“Does he?”</p><p>Parker sobered further. “He’s very protective.”</p><p>“Is he? What would he have to protect me from?”</p><p>“We’re men, Gianna,” he drawled. “We’re not always rational when it comes to women.”</p> <p>I nodded, gathering that Parker was as much of an enigma as his son. It seemed Rutledges were just naturally inclined to be hard to read and cryptic.</p><p>The elevator doors opened into the lobby and we stepped out into a meticulously restored pre-war space that exuded luxury and privilege.</p><p>“I have a car waiting,” he said. “Can I give you a ride?”</p><p>“Thank you but no.” I didn’t even want to contemplate the look on Parker’s face if he saw where I lived. Compared to the marble-lined lobby of Jax’s building, complete with concierge and doorman, my place would look...not so hot. I wasn’t embarrassed by the loft or my family, but I thought it might be wise to not trigger suspicions of gold digging until the Rutledges got to know me better.</p><p>“All right, then, if you’re sure.” Parker hesitated, as if waiting for me to change my mind. When I didn’t, he said, “I’ll let Jax know the day and time for dinner. I’m looking forward to it, Gianna.”</p><p>I thought of the man upstairs, high in his tower, a stranger in so many ways and yet one who knew me inside and out. “I am, too.”</p><p>I HEARD MUSIC blaring in the loft before the freight elevator clanked to a stop on our floor. As I got closer, I recognized the vintage Guns N’ Roses riff. “Welcome to the Jungle.” Considering my evening with the Rutledges, I found it fitting.</p><p>Sliding the door open, I was hit with the full force of Vincent’s rocking sound system and the sight of him doing pull-up crunches via a metal pole he’d mounted between two supporting pillars. He was drenched with sweat and gritting his teeth, the slabs of muscle on his stomach tightening as he brought his knees up to his chest. He wore his hair shorter than my other brothers, nearly a crew cut, and it suited his classically Italian features.</p> <p>I’d read books that compared the hero to a face on a Roman coin, but I guarantee none of them had anything on Vincent. Shirtless, shoeless and wearing only running shorts, he was the stuff other women’s dreams were made of. Unlike Nico, Vincent was a serial boyfriend. He had no problem committing, but he never stayed off the market for longer than several months at a time.</p><p>“Hey!” he protested, when I turned the volume down.</p><p>“You still talk to Deanna?” I asked, referring to the reporter he used to date.</p><p>“Yeah.” He dropped to the hardwood floor and snatched up the towel waiting there alongside a bottle of water. “Why?”</p><p>I set my purse down on the bench by the door and kicked off my shoes. “I need someone to catch me up on the Rutledges.”</p><p>Vincent scrubbed at his hair, scowling. “The guy’s a douche. He doesn’t deserve you.”</p><p>“I won’t argue with that.” I sprawled across the couch and stared up at the exposed pipes and beamed ceiling. “But that doesn’t mean he can’t be redeemed.”</p><p>“Forget the rehab. Find a guy who’s smart enough to know what he has from the get-go.”</p><p>I glanced at him, watching his throat work as he chugged the entire bottle of water. “You telling me you never screwed up with a girl and wanted a second chance?”</p><p>“Doesn’t count. You’re a Rossi. There’s no excuse for him screwing up besides being stupid,” he said.</p><p>“Will you ask her?”</p><p>“Fine.” He headed toward the kitchen, adding, “Only because I hope she digs up something that convinces you he’s bad news.”</p><p>“Thank you.”</p><p>“Don’t think you’re getting the favor for a simple thanks.” He tossed his towel over his shoulder and washed his hands. The kitchen was the most finished part of the apartment, with brand-new stainless-steel appliances, chef’s cooktop, double wall ovens and a massive workstation island with sink. “I’ve got a basket of laundry that needs washing.”</p><p>I sat up. “Are you kidding me?”</p><p>“Nope. Better hurry.” He grinned. “I’m out of Rossi’s T-shirts and my shift starts in two hours.”</p><p>I’D JUST CLOSED the louvered doors that concealed the washer and dryer when I heard my smartphone ringing. I ran to my bedroom to grab it, but missed the call. Didn’t matter, though, because it immediately started ringing again.</p><p>It was Jax.</p><p>Taking a deep breath, I touched Answer on the screen and said, “Hey.”</p><p>“You were supposed to call,” he accused.</p><p>“So were you,” I retorted. “Took you two years to get around to it.”</p><p>“Jesus.” He exhaled harshly. “Why did you leave?”</p><p>“It was time. Your dad invited us to dinner.”</p><p>“We’re not going.”</p><p>I shrugged. “I’ll go without you.”</p><p>“The hell you will! Damn it, Gia. You’re swimming with sharks and acting like you’re on vacation.”</p><p>“I’m definitely seeing things I’ve never seen before. Like those pictures you’ve got framed in your pad. How long have you been following me? Creepy, by the way.”</p><p>He cursed. “You’re fucking a Rutledge. Surveillance and invasion of privacy come with the territory.”</p><p>“I wasn’t fucking you at the time that picture in your office was taken.”</p><p>“You were in my office? What the hell, Gia?”</p><p>My mouth curved grimly at his inadvertent admission that there were more photos I hadn’t found. “I’m going to be in every aspect of your life—get used to it.”</p><p>Jax was silent for a long minute, then quietly asked, “What do you think you’re doing?”</p><p>“I’m processing the fact that you’re in love with me, Jax.” I heard his breath catch and felt a surge of pleasured triumph. “Still, you bailed on me. And now you’re sabotaging my work and your own chances with me.”</p><p>“Gia—”</p><p>“I’m on to you, Jackson Rutledge.” My voice was low and hard, unwavering. “I’m going to figure you out.”</p><p>“I’m an open book,” he retorted.</p><p>“You’re a head trip.” I ignored the waiting suitcase on my bed and sat at my desk instead. I woke my computer with a shake of the mouse. “And your mystery-man days are numbered.”</p><p>I hung up, shut off the ringer and started my research. </p> </body></html>"]