["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>BY ALEXANDRA IVY</p><p>Prologue</p><p>The Legend of Opela and Shakpi</p><p>Deep beneath the bayou, Shakpi stirred in the darkness of her prison. For centuries she'd been trapped beneath the choking layers of magic. Her sister, Opela's, last gift to her beloved Pantera.</p> <p>Ancient fury surged through her, sending out shockwaves that shook the land above her. It was all the fault of those damned cats.</p><p>In the beginning, it was just her and Opela. Twin sisters born of magic, meant to rule the world. They had done everything together, never needing anyone else.</p><p>Then Opela became obsessed with her desire for children. She'd claimed that there was no point of existence if she couldn't possess creatures to love.</p><p>Without thought for anyone but herself, Opela created a new race, the Pantera, to call her children.</p><p>Shakpi had done everything in her power to stop her sister. They'd had each other. Why did they need anyone else? But Opela had refused to listen to her pleas, instead lavishing her love and devotion on her Pantera.</p> <p>Consumed with envy, Shakpi had plotted to kill the freaks of nature.</p><p>Mortal creatures weren't meant to be blessed with Opela's magic. Or given the ability to shift into puma form. They were an abomination that had to be destroyed.</p><p>She'd been confident that her sister would understand her desire to return to the life they'd had before. A time when they'd both been happy. Together.</p><p>Born to destroy, Shakpi was unable to create her own children to act as instruments of her revenge. Instead she infected humans with her malevolent toxin, giving them the power to spread it among the bayou, destroying the magic that gave the Pantera their power.</p><p>How could she possibly have</p><p>suspected her sister would make the ultimate sacrifice? That Opela would use her life-force to entrap Shakpi in this tomb to save her children?</p> <p>But the bitch had underestimated Shakpi.</p><p>After centuries of being locked in stasis, her tentacles were at last reaching beyond her prison, touching the weak, the desperate, and the greedy.</p><p>Her infection was spreading and this time nothing would stop her from destroying her enemies... </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The Wildlands deep in the bayous of Louisiana would never be considered a place of peace.</p><p>The magical land of the Pantera was filled with puma shape shifters who had all the aggression of their animal nature plus the usual volatile emotions of their human nature. It was a combination that encouraged plenty of passion and conflict. Which meant that more than a little blood had been shed over the centuries.</p><p>But never before had there been enemies capable of slipping past the Wildlands' borders to directly attack the Pantera.</p><p>The shockwaves were still rippling through the gathered Pantera as Bayon raced to the edge of their territory. He couldn't help Raphael, who remained with his pregnant mate, Ashe. He had no talent for healing or for combating the mystic evil that was trying to destroy the babe she carried.</p> <p>Bayon was a Hunter. A tall, golden haired man with eyes that fluctuated from leaf green to deep gold when he was aroused, and the solid muscles of a warrior. His talent was tracking down the bastards who dared to come into his homeland, and destroying them.</p><p>Well, first he intended to torture them.</p><p>Slowly. Painfully. He needed to know who they were and if they were actually disciples of Shakpi, the Pantera's ancient enemy.</p><p>First, however, he had to complete his current mission for Raphael.</p><p>He slowed his blinding speed as he neared the private house that was practically hidden among the weeping willows.</p> <p>Most Pantera preferred to live in the main community with their various factions. There were the Diplomats who dealt with all things political, including their network of spies, as well as the Geeks who performed their magic with computers. There were the Nurturers who had built one of the world's finest medical facilities as they searched for the reason the Pantera had lost the ability to procreate. There were the elders who were the ultimate rulers of the magical race of puma shifters, and their spiritual leaders.</p><p>And then there were the Hunters.</p><p>The warriors who protected their people with a ruthless efficiency.</p><p>There were, however, a few Pantera who sought isolation.</p><p>Parish, the leader of the Hunters, had lived in the caves at the far side of the Wildlands after his sister had been killed by humans. Everyone had understood his need to mourn in private.</p><p>Bayon didn't know what had driven Jean-Baptiste, one of their finest Healers, to shut himself off from his family and live so far from everyone else, and he had no intention of asking.</p> <p>Pantera might live as a tight-knit community, but that only meant they had to have firm boundaries when it came to privacy. Shoving your nose in someone's business was a good way to get it snapped off.</p><p>Vaulting onto the wraparound porch of Jean-Baptiste's cabin, Bayon slammed his fist against the heavy wooden door, frowning when no one answered.</p><p>Dammit. He knew Jean-Baptiste was inside.</p><p>So why the hell was he ignoring him?</p><p>\"Jean-Baptiste,\" he growled, his voice edged with impatience. He didn't have time for this shit. \"I know you're in there. Open the fucking door.\" A string of ugly curses reverberated through the cabin before the door was yanked open to reveal a six foot plus, male Pantera with dark brown hair that hit below his jawline, and eyes a peculiar shade of amber. He was dressed like Bayon in faded jeans and shit-kickers with a white T-shirt pulled over his leanly muscled torso. But unlike Bayon, he was wearing a heavy leather jacket that covered the numerous tats that Bayon had only glimpsed from a distance. Oh, and he had the sort of piercings that made him look like he should be in a motorcycle gang, not walking the halls of a hospital.</p><p>\"What the hell?\" Jean-Baptiste snarled.</p><p>\"You're needed.\"</p><p>The amber eyes narrowed. \"Why?\" Bayon's hands clenched, the raw fury still pulsing through him. \"Raphael's mate was attacked.\"</p> <p>It was obvious the news hadn't yet reached the Healer. \"Where?\"</p><p>\"Here. In the Wildlands.\"</p><p>Jean-Baptiste jerked in shock at Bayon's blunt explanation, the air prickling with his angry disbelief.</p><p>\"Impossible.\"</p><p>Jean-Baptiste was right. It should have been impossible.</p><p>Which only pissed off Bayon more.</p><p>\"Yeah well, tell her that,\" he said.</p><p>There was a long silence as Jean-Baptiste struggled to wrap his brain around the unprecedented event.</p><p>\"When did it happen?\"</p><p>\"During the hunt.\"</p><p>Stepping onto the porch, Jean-Baptiste paced the wooden planks with a grim expression, his thoughts obviously dark.</p><p>\"Who would dare to enter the Wildlands?\"</p><p>Bayon peeled back his lips, revealing his elongated canines. \"That's what I intend to find out. But first, Raphael wants you at the infirmary.\"</p><p>Jean-Baptiste came to a sharp halt, his jaw clenched. \"In case it escaped your notice, mon ami, I'm not on duty.\"</p><p>\"Too bad,\" Bayon said, in no mood to tiptoe around his friend's feelings.</p><p>Whatever shit was going on with this male was going to have to be put on the back-fucking-burner. Nothing was more important than saving Ashe and her baby. \"You're needed.\"</p><p>The amber eyes glowed with the power of his cat. \"No.\"</p><p>Bayon stepped forward, one of the few not afraid to get into this male's grill. \"Look, I don't know what bug crawled up your ass-\"</p><p>\"There are other healers who are better suited to treat a human,\" Jean-Baptiste snapped.</p><p>Bayon refused to back down.</p><p>\"Raphael doesn't want your healing abilities.\"</p><p>His companion stilled. \"Then what?\"</p><p>\"They sense something is trying to possess Ashe. Or the baby,\" he revealed. \"They need you to travel to New Orleans to find a gris-gris to hold off the evil until we can determine the source of the attack.\"</p><p>\"Shit.\" With a grimace, the Healer shoved a hand through his hair, knowing this wasn't a duty he could decline.</p><p>Their very future might depend on saving the babe. \"Tell him I'll-\"</p><p>\"You tell him. I'm a Hunter, not a damned messenger,\" Bayon growled, already heading toward the edge of the porch and leaping over the thicket of yellow cow lily.</p><p>By the time he touched the ground he'd already shifted into his cat form, the surge of magic jolting through him with heart-pounding pleasure.</p><p>His roar echoed through the thick, humid air. Mere de dieu. There was nothing as intoxicating as releasing his animal to hunt. His lips stretched over his massive teeth, as his cat reminded him there was one thing more</p><p>intoxicating.</p><p>Hot, balls-deep sex that made a woman scream with pleasure.</p><p>No. Not just a woman.</p><p>The right woman.</p><p>Something denied to him for far too long.</p><p>With an impatient shake of his head, he dismissed the painful thought. Now wasn't the time.</p><p>Running lightly over the marshy ground, he used his acute senses to search for any trace of the intruders, finding nothing until he reached the narrow river where Ashe had been attacked. He growled low in his throat as he caught the sour scent of the intruders and followed the stench to the edge of their territory.</p><p>The intruders had either been the luckiest bastards in the world to have entered the Wildlands and stumbled across the very person they wanted to kill-or they had a way to track her.</p><p>Magic? Or a more mundane human technology?</p><p>He made a mental note to have Ashe searched for a tracking device small enough to have been hidden beneath her skin. Raphael said she'd been to a doctor just before the strangers tried to attack her the first time.</p><p>The medic could easily have tagged her without her knowing.</p><p>Sensing Parish's approach, Bayon reluctantly returned to his human form, straightening to watch the glossy slate gray cat prowl forward. With a shimmer of magic, Parish shifted to human form revealing a man over six feet tall with broad shoulders and long, inky black hair. His face was angular, speaking of a predatory nature emphasized by the two healed scars near his right ear and mouth.</p><p>\"They crossed here,\" Parish snarled, looking more feral than usual. Together they studied the opening between the cypress trees where the attackers had entered the Wildlands. \"Goddammit. I should have done a more thorough search. We have sensed a growing danger for years.\"</p><p>Bayon shook his head. The leader of the Hunters was as hard on himself as he was on his warriors.</p><p>Harder.</p><p>Parish had never quite forgiven himself for his sister's death.</p><p>Maybe now that he'd finally mated he could find some peace.</p><p>\"Yes, sensed, but we had no tangible proof until recently,\" Bayon pointed out.</p><p>\"There's nothing we could have done, Parish.\"</p><p>\"I cannot change the past, but I can the future.\" Parish jerked his head toward two large pumas who slid silently through the tangled foliage. \"The guards will be doubled until further notice.\" Bayon squatted down, absorbing the sour scent of the intruders. It made the hair stand up on his nape.</p><p>\"How did they get through the magic?\" Bayon demanded.</p><p>\"That is what you will discover.\" It was, indeed. Bayon had no intention of returning until he had some answers.</p><p>\"I'll need my weapons.\"</p><p>Parish nodded. \"Do you want to take backup with you? I can send Talon.\" Bayon narrowed his eyes. \"Are you trying to piss me off?\"</p><p>\"We cannot judge the level of danger,\" Parish reminded him, his features carved from granite. \"If this is truly the work of the ancient evil we fear, we cannot afford for anyone to take chances.\"</p><p>Bayon shuddered.</p><p>All Pantera grew up with the legend of the twin sisters who created the Wildlands. Opela was the ultimate mother of the Pantera, while her sister, Shakpi, had grown jealous of Opela's love for her children and tried to destroy the Pantera by using human disciples who'd been twisted by her evil.</p><p>Eventually, Opela had no choice but to imprison her sister.</p><p>Was it possible that Shakpi was actually still alive? That she was trying to break out of her mystical prison?</p><p>Perhaps even touching the world with her evil?</p><p>His thoughts shied from the</p><p>possibility. He had to focus on finding the bastards responsible for hurting Ashe and her baby.</p><p>He'd leave the potential threat of a malevolent goddess seeking revenge in the hands of the elders.</p><p>\"I won't take any chances,\" he muttered, raising his hands as Parish eyeballed him with a stern expression. \"I swear.\"</p><p>\"Fine. Keep in contact.\"</p><p>\"Aye, aye, Captain.\" Bayon turned to head back to the rooms he shared with his fellow Hunters, but before he could take off, Parish was standing in front of him.</p><p>\"Bayon.\"</p><p>\"What?\"</p><p>\"I know you enjoy testing the limits of my patience by doing your own thing,\" the Pantera warned. \"If I do not hear from you I will come hunting your ass.\"</p><p>\"I'll call.\" Bayon rolled his eyes.</p><p>\"Cross my heart and hope to die.\"</p><p>Keira didn't know how long she'd been locked in the cage hidden in the suffocating attic.</p><p>In the beginning of her captivity, she'd used a rock to scratch the passing days on the floor. She'd needed some way to maintain her sanity.</p><p>But the days became weeks, and then months, and then endless years, making it impossible to keep track of the time that was slipping away from her.</p><p>She knew this wasn't her first prison.</p><p>She had a vague memory of waking up surrounded by gray cement blocks that had held her beneath the ground. After that had been a cramped space that she'd assumed was a storage shed, followed by a root cellar that had smelled of damp earth and rotting potatoes.</p><p>There were others, but her memories were so muddled she couldn't sort through them.</p><p>They were like her. Broken.</p><p>Fractured. Some of them shattered beyond repair.</p><p>Most days she knew her name. Keira.</p><p>Keira Montreuil. She repeated it over and over, desperate to cling to her previous life.</p><p>And she knew she was a Pantera, despite the fact that she couldn't reach her cat no matter how desperately she tried.</p><p>But beyond that, her world was a blur punctuated only by occasional visits by her captors to bring her food.</p><p>And speaking of the devil...</p><p>She smelled him before he ever climbed the steps to the attic.</p><p>The rank, sour stench that assaulted her senses and made her gag in disgust.</p><p>With an effort she forced herself to her feet. She felt constantly lethargic, no matter how much she ate or rested, convincing her that she was somehow being weakened. Her guess would be the metal collar she wore around her neck.</p><p>Her captors used it to send an electrical jolt through her when they wanted to punish her. But she suspected there was something in the composition of the collar that kept her debilitated.</p><p>How else could they keep her</p><p>trapped?</p><p>A cage, no matter how well-built, would never hold her prisoner. Not if she was at her full strength.</p><p>And it wasn't as if the attic could contain her.</p><p>The window that overlooked a small backyard was narrow, but she could easily squirm through it. And if nothing else, she could climb onto the stack of dusty boxes in the corner to bust through the rotting timbers of the roof.</p><p>But she wasn't at her full strength.</p><p>That had been stolen from her, just as the comfort of her cat had been stolen.</p><p>And it didn't matter if was the result of the metal collar or poison or some magical curse. The end result was that she felt so exposed and embarrassingly vulnerable she wanted to curl in a corner and hide.</p><p>Instead, she was standing in the center of the cell when a human male crossed the warped floorboards and shoved a tray of mush that passed as food through a small slot in the door. Keira grimly moved to catch the tray before it fell.</p><p>The shit tasted bad enough without having to eat it off the floor.</p><p>The man smirked, his brown hair greasy and his narrow face in need of a shave. He wore jeans and a flannel shirt that always looked like it needed to be washed. There was a cunning</p><p>intelligence, however, in the mud-brown eyes and a sadistic hunger in his gaze as it slid slowly down her slender body.</p><p>Thanks to the old-fashioned cheval mirror in one corner of the attic she knew precisely what he was seeing.</p><p>Sleek black hair that was pulled into a braid hung halfway down her back. Eyes that looked a dull yellow. Delicately carved features. Skin that was pale from a lack of sunlight. And a sleek, too-thin body that was covered by a pair of spandex exercise pants and matching sports bra.</p><p>\"How's my pretty kitty today?\" the man taunted. She didn't know his name.</p><p>Why would she? He was just one of a long line of tormentors she'd endured.</p><p>But she'd privately named him the</p><p>'Ferret'. \"Are you ready to purr for daddy?\"</p><p>Setting the tray on the narrow cot that was the only furniture in the cell beyond the small TV, she turned back to the man with a mocking smile. She didn't know why she found it so important to remain defiant in front of her guards. She was trapped like a rat. Helpless. Abandoned.</p><p>And closer to the edge of insanity with every passing day.</p><p>What was the point?</p><p>But some stubborn, rebellious part of her refused to accept defeat.</p><p>She would spit in the face of fate until the madness consumed her.</p><p>\"Come and get it, fucker,\" she taunted.</p><p>He deliberately licked his lips.</p><p>\"Someday.\"</p><p>It was a constant threat, but so far the guards hadn't sexually attacked her.</p><p>Not yet.</p><p>Keira didn't know why they hadn't.</p><p>They'd humiliated, shamed, and taunted her in every other way. But if sexual assault was coming, she desperately hoped her luck held until she was too insane to know what was happening.</p><p>\"Yeah, and someday I'll rip your heart out and eat it with special sauce on a sesame seed bun,\" she retorted.</p><p>\"Naughty kitty.\" The bastard touched the band strapped around his wrist, sending a jolt of electricity through the collar around Keira's neck. She hissed, her heart missing a painful beat. \"But don't worry. You won't be in your cage for much longer.\"</p><p>Keira frowned. \"Why?\"</p><p>\"The word has started to filter down the ranks. Our time is finally here.\"</p><p>\"Your time? You sound like a cheesy super villain.\"</p><p>The Ferret stepped forward, his eyes glittering with a fevered lust. \"You won't be nearly so funny when we don't need you anymore. I'm going to fuck you to death.\"</p><p>She kept her smile in place even as a sick dread clenched her gut. There was a smug cockiness in his voice that warned her it wasn't yet another empty bluff.</p><p>He was truly confident he was soon going to get his hands on her.</p><p>Shit. Shit. Shit.</p><p>\"With that miniscule dick?\" She tilted her chin, refusing to let him see her fear.</p><p>\"If I'm going to be screwed, at least send a man to do it.\"</p><p>\"You bitch.\"</p><p>He pressed his finger onto the switch that sent the electrical pulses out of the collar. But this time he continued to hold it down, sending jolt after jolt through her body. Keira's teeth ground together as she fell to her knees. Holy shit. She'd gone too far. The bastard was going to kill her.</p><p>Her head was bowed and her mind going dark when the sound of a male voice floated from the doorway at the bottom of the stairs.</p><p>\"Roger.\"</p><p>Roger? Her lips twisted despite the agony searing through her rigid muscles.</p><p>His name was Roger?</p><p>Ferret fit him better.</p><p>Abruptly the pain stopped as the Ferret muttered a curse. \"What?\"</p><p>\"Meeting.\"</p><p>\"Another one?\" the Ferret shouted.</p><p>\"What the hell is this one about?\"</p><p>\"I didn't call it,\" his companion groused. \"We leave in ten minutes.\" The Ferret moved to stand near the bars of Keira's cell, his stench only adding to her misery.</p><p>\"Maybe it's good news. Maybe we're going public and I can finally have you flat on your back where you belong.\" With a laugh, he turned and left the attic, allowing Keira to take a deep, cleansing breath as she struggled to clear the fog from her mind.</p><p>\"Be careful what you wish for, asshole,\" she muttered, pressing her fingers to her temples that throbbed from the massive amount of electricity that had scorched through her.</p><p>Remaining on her knees she waited for the nausea to pass, surviving the time by picturing the various ways she could kill the Ferret if he was stupid enough to unlock her cell.</p><p>Snapping his neck would be the most efficient, but it was far too clean a death for the loathsome creature. She wanted something slow. Something that would cause maximum pain.</p><p>An hour passed. Then two. Darkness slowly filled the attic as she wearily curled into a tiny ball on the floor. Later she would try to choke down the sludge they called food. For now, she was alone with no need to act brave.</p><p>\"Keira. My name is Keira,\" she murmured. \"I'm strong. I'm brave. And those bastards aren't going to break me.\" Softly chanting the words over and over, Keira nearly missed the faint sound of footsteps that crept up the stairs. She frowned, a strange fear clenching her heart. Those steps were too light, too graceful for a mere human.</p><p>What was coming?</p><p>She remained curled on the floor, lost in the shadows as she glanced warily through the gathering gloom.</p><p>A large, male form appeared, but with obvious caution, he circled the entire room, searching for hidden enemies before at last turning his attention to the cage in the center of the floor.</p><p>Only then did he suck in a horrified breath as he caught sight of her cowering form.</p><p>\"What the hell?\"</p><p>The man stepped forward and Keira's heart missed a beat as she took in his golden male beauty. He disturbed her.</p><p>Not like the ferret-man. Or his various human partners. This was...different.</p><p>Somehow more personal.</p><p>\"Is this a trick?\" he breathed.</p><p>She scowled. \"I don't understand what you're asking.\"</p><p>\"You're dead.\"</p><p>His stark words sliced through the muddle in her mind. She blinked, struggling to process them. Dead.</p><p>Bizarrely, the thought didn't frighten her.</p><p>Actually, it explained so much.</p><p>\"So this is hell?\" She gave a short, near hysterical laugh. \"I hope I earned a spot here by partying my ass off.</p><p>Laissez les bons temps rouler.\" There was a short, nerve-scraping silence before a soft word floated on the air.</p><p>\"Keira?\"</p><p>A startled hiss was wrenched from her throat. Her name. It was the one thing that she'd been able to cling to from her past. It had kept her grounded when her captors did everything in their power to crush her will. Or when her mind threatened to become lost in the dark depths of despair.</p><p>And through it all she'd kept it protected.</p><p>No one knew that secret, precious name.</p><p>No one but her.</p><p>\"Don't,\" she breathed, her voice humiliatingly weak. \"That's mine. Only mine.\"</p><p>\"Holy shit.\" The man took another step forward. \"Is it really you?\" Keira scrambled backward, her defiance forgotten as she caught the warm, male scent. Pantera. He was like her.</p><p>\"Who are you?\" she rasped.</p><p>With a graceful leap, he was standing directly in front of the cell door, his beautiful leaf green eyes serrated with gold, glowing with a stunned joy.</p><p>\"Oh my god.\"</p><p>\"No.\" She held up a hand, her heart racing. She didn't know what was bothering her. On some level she knew she should be fiercely relieved. This man was one of her people. But there was a part of her that was terrified by his scent. \"Stay back.\"</p><p>He frowned, watching her with a searching gaze. \"Keira, it's me. Bayon.\" Bayon. She silently tested the name. It was...familiar. He was familiar.</p><p>But the confusion in her mind was too tangled to pull out the memory.</p><p>\"Stay back,\" she repeated, her voice harsh. She didn't understand what was happening, and that was as terrifying as any torture.</p><p>\"Is it a trap?\" He tilted his head to the side, sniffing the air. \"Keira, honey, will I trigger an alarm?\"</p><p>She shook her head, her mouth dry.</p><p>\"You have to go.\"</p><p>He studied her pale, frightened expression, then without warning he grabbed the bars and ripped the door off the cell.</p><p>Keira vaulted onto the cot, her palm pressed to her thundering heart as he ruthlessly moved toward her. He reached out a hand, but rather than grabbing her as she half expected, he ran his fingers over the collar around her neck.</p><p>With a hiss he yanked his hand from the metal.</p><p>\"Shit. There's something toxic in the metal.\" He gave a shake of his head. \"I have to find a key. I'll be back.\" She watched in silence as he ran lightly back down the stairs, leaving her alone.</p><p>Mutely she studied the mangled door of her cell, a voice in the back of her head urging her to make a run for it. She could slip out one of the windows, drop from the roof and take off down the road before the...before Bayon ever realized she was gone.</p><p>Her limbs, however, refused to move.</p><p>They felt as if they'd been locked into place by a compulsion she couldn't understand.</p><p>Instead she remained crouched on the cot, her breath a loud rasp as she heard the sounds of Bayon moving through the house. There was a tense wait before he was jogging back up the stairs and returning to the cell.</p><p>She hissed as the warm musk of him filled her senses, reminding her of...</p><p>what?</p><p>Something her mind wasn't ready to accept.</p><p>She trembled, shaking her head as he slowly crossed the cell and perched on the edge of the cot.</p><p>\"Just hold still, Keira,\" he urged softly, his gaze never leaving her face as he reached to unlock the collar and remove it. With a grimace he tossed it aside.</p><p>Then, his fingers returned to her throat to lightly soothe the flesh that had been rubbed raw by the metal. Instantly she was pulling away, her heart slamming against her ribs at the odd sensations that streaked through her at his soft caress.</p><p>\"No.\" She surged off the cot and pressed against the bars of the cell, hating herself for acting like a fucking mouse, but unable to halt her violent reactions. \"Don't touch me.\"</p><p>\"Okay.\" Rising to his feet, he held up his hands in a gesture of peace. \"We have to get out of here.\"</p><p>\"Out?\" She licked her dry lips.</p><p>\"Where are you taking me?\"</p><p>\"Back to the Wildlands.\"</p><p>The rising panic flooded through her, closing her throat until she struggled to draw air into her lungs. \"No. I can't.\" Bayon frowned, his fingers twitching as if he was battling the urge to physically force her from the cell.</p><p>\"Keira, we can't stay here,\" he at last managed to murmur in soothing tones.</p><p>\"Will you come with me? Please.\" Keira glanced toward the door. She wanted out. Desperately. And some part of her understood that this man wouldn't hurt her.</p><p>Still, it took every ounce of her willpower to give a jerky shake of her head. \"All right. Just...don't touch.\"</p><p>\"Okay.\" He backed out of the cell, watching her with a carefully controlled expression. \"Whatever you need, honey, just tell me.\"</p><p>\"I need space.\"</p><p>\"You got it,\" he promised without hesitation. \"Follow me.\"</p><p>She did. But it was at a cautious distance as they crept silently down the stairs and then out a small kitchen with cracked linoleum floors and a pile of filthy dishes on the counters.</p><p>Once in the backyard he paused, searching the darkness for any hint of a trap. Behind him Keira trembled, her dulled senses tingling to painful life.</p><p>Christ, was this real?</p><p>The brush of a warm breeze on her cheek. The grass beneath her feet. The distant sound of a child laughing.</p><p>Over the years she'd too often dreamed she was free, only to wake and discovered she was still trapped in her cage.</p><p>She couldn't bear to discover this was just another hallucination.</p><p>At last convinced they were alone, Bayon led her toward a gate that had been left unlatched and into a narrow alley that smelled of rotting trash and human feces.</p><p>She slapped a hand over her sensitive nose, grimly concentrating on placing one foot in front of the other. Nope. This was no dream. Her imagination wasn't capable of producing such a foul odor.</p><p>Relief surged through her even as her weakness increased with every step.</p><p>Grimly she refused to slow her pace.</p><p>She didn't care if she had to crawl.</p><p>Nothing would make her return to that prison.</p><p>They reached the end of the alley when the Pantera male halted, motioning her to stay behind him as he peered into the window of a derelict garage.</p><p>\"What are you doing?\" she demanded, nervously glancing over her shoulder.</p><p>Dammit. Why was he hesitating? Her guards wouldn't be gone forever.</p><p>\"We can travel faster in a car,\" he muttered.</p><p>\"No.\" She shook her head, a painful flash of memory searing through her confusion. She was hogtied with a hood over her head as rough hands stuffed her into the trunk of a car. There were male voices that sliced through her with the pain of a dagger. \"I can't,\" she muttered.</p><p>Bayon glanced over his shoulder, his expression concerned. \"Why?\"</p><p>\"It's a cage,\" she muttered.</p><p>A stark, brutal regret darkened his eyes before he gave a sharp nod. \"Then we run.\"</p><p>Running.</p><p>The wind in her hair. The earth pounding beneath her feet.</p><p>The stench of the humans fading from her senses.</p><p>\"Yes,\" she breathed. \"God, yes.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bayon fought for control.</p><p>He was acutely aware of the woman sprinting mere inches behind him even as they moved through the thickening shadows of Melton, the small town several miles north of the bayou where he'd tracked the bastards who'd attacked Ashe. Keira needed him calm. His mind focused on escaping into the nearby swamp before the humans returned to discover she was missing.</p><p>Not acting like a raving lunatic who wanted to grasp her by the shoulders and demand to know what the hell had happened to her.</p><p>Holy shit.</p> <p>The memory of the day she'd disappeared was seared into his brain.</p><p>Twenty-five years ago, she'd left the Wildlands to visit her human lover and then...nothing.</p><p>Her brother, Parish, had sensed she was in distress, but he hadn't been able to reach her before she'd vanished off the face of the earth.</p><p>Eventually they'd had to accept she was dead, and Bayon had secretly gone into a mourning that had matched Parish's. Only his was worse, because while Parish had received the sympathy of the entire Pantera community, Bayon had been forced to keep his own grief shoved deep inside, pretending as if his life hadn't come to a shattering end on that day.</p><p>Now...now, he didn't know what the hell to think.</p> <p>Keira was alive.</p><p>But she wasn't the same bad-ass female who'd been the leader of the Hunters.</p><p>Once she'd stood tall and proud, her body lean but powerful. Her dark hair had been threaded with hints of fire and her skin kissed with a deep honey tone.</p><p>And her eyes had been a magnificent gold with starbursts of emeralds in the center.</p><p>Now her hair was limp, her skin pale, and her eyes so dull he barely recognized her. Even worse, her mind was obviously broken to the point she couldn't even remember him.</p><p>But she was alive.</p> <p>His cat snarled deep inside him, struggling to reach out to the woman who'd once touched him at his most primitive level.</p><p>His emotions were a dangerous brew of elation, shock, guilt, and overall a murderous rage at whoever was responsible for keeping this exquisite woman locked in a cage like a fucking animal.</p><p>Keeping himself from exploding was taking everything he had as they traveled silently through wetlands surrounding Melton, the dusk turning to night as they left behind civilization and eventually arrived at the edge of the Wildlands Which explained why he hadn't immediately noticed, when he passed over the magical border, that she'd halted on the other side.</p><p>Belatedly realizing she was no longer behind him, Bayon whirled around to discover her crouching at the edge of their territory, that look of terror marring the beauty of her face.</p><p>His heart twisted as he cautiously made his way back to her shivering form. He could sense her bone-deep weariness, but this was more than just collapsing in exhaustion.</p><p>She was being tormented by some inner demon.</p><p>\"Keira?\" He kept his voice soft.</p><p>\"What is it, honey?\"</p> <p>She shook her head. \"I don't</p><p>remember.\"</p><p>He reached out to stroke a hand over her dark head, only to yank it back.</p><p>She'd asked him not to touch her.</p><p>It was a request he intended to honor.</p><p>\"Remember what?\" he prompted.</p><p>\"Anything.\" She frowned, her fingers twisting together as she stared at the lands that she'd once known with the intimacy of a lover. Her duty as the leader of the Hunters meant she'd patrolled every inch of the Wildlands.</p><p>Night after night. \"No, that's not right. I have memories, but they're like puzzle pieces I can't put together.\" There was a long pause, her heavy breathing emphasizing the effort it was taking not to bolt in terror. \"How long?\" Bayon frowned. \"What?\"</p><p>\"How long was I gone?\"</p><p>He grimaced. This wasn't a</p><p>conversation he wanted to have. Not until she was stronger.</p><p>\"Keira-\"</p><p>\"How long?\"</p><p>\"Twenty-five years.\"</p><p>\"Fuck.\"</p><p>He crouched beside her. \"It's going to be all right.\"</p><p>There was a flash of fire in the dull eyes. It was a painful reminder of the old Keira.</p><p>\"Don't patronize me.\"</p><p>He bit back a curse. Dammit. They didn't have time for this. She was sick, and exhausted, and in dire need of shifting.</p><p>\"Keira, I don't know what the hell happened to you, but I can sense that your cat has been forced into hibernation. The only way to heal you is to get you into the Wildlands.\" She licked her lips, her heart pounding so loudly he feared it would attract the natural predators of the swamp.</p><p>\"I know I need it.\"</p><p>He inched closer, hoping the</p><p>proximity of his cat could offer comfort.</p><p>\"But there's something that bothers you?\"</p><p>\"It frightens me.\"</p><p>\"I'll take you to Parish,\" he promised.</p><p>The two siblings had been closer than most since they'd been destined to be Hunters together. \"No one will bother</p><p>-\"</p><p>\"I can't.\" She reached out, her nails sinking into the flesh of his arm. \"Not Parish.\"</p><p>Bayon frowned. \"Do you remember him?\" he asked.</p><p>\"I...it's beginning to come back, but it's still fuzzy.\" She bit her lower lip, her fear palpable in the air. \"Please, don't make me do this.\"</p><p>He tilted his head so he could hold her skittish gaze. \"Easy, Keira.\"</p><p>\"Not Parish.\"</p><p>\"Then a Healer.\"</p><p>\"No.\" Her nails dug deeper, the scent of his blood filling the air. \"Only you.\"</p><p>\"Honey, there's no way I can keep your return a secret.\" He tried to calm her rising hysteria.</p><p>There was a choked sound, as Keira turned her head to hide her expression.</p><p>\"I don't want anyone to see me like this.</p><p>I'm broken.\"</p><p>A dagger being shoved into his heart would have been less painful than those low, traumatized words.</p><p>\"No,\" he snarled, his body vibrating with emotion. \"Keira, you're a miracle.\"</p><p>\"That's not what they'll see. They'll want to try and fix me. Or worse, they'll lock me away.\"</p><p>\"I would never let them hurt you.\"</p><p>\"There's something else.</p><p>Something...\" She shook her head.</p><p>\"Please, Bayon, I'm not ready.\" The brief flare of joy as his name unconsciously slipped from her lips was crushed by her heartrending plea.</p><p>\"Shit.\"</p><p>Bayon wasn't modest. He had any number of talents, not the least of which was the ability to directly connect with the inner cat of his people. It was a rare skill that was particularly useful when dealing with a Pantera who'd gone feral.</p><p>But he wasn't a Healer. Hell, his bedside manner would have him run out of the faction within the first day.</p><p>Unfortunately, Keira was depending on him.</p><p>For now he'd have to take on the role of caregiver.</p><p>He glanced toward the Wildlands, knowing he had to get Keira into the magic of their home. But how could he keep her presence a secret? Parish would scent her...</p><p>Parish.</p><p>Of course.</p><p>\"The caves,\" he muttered. \"Parish is busy organizing the Hunters, not to mention caring for his mate.\" He grimaced. Parish had hauled all of Keira's possessions to the caves where they'd played as children, refusing to dispose of them no matter how many years passed. \"No one will notice you're inside unless they come looking.\" She turned back to study him with an unsettling intensity. As if she were trying to determine if he could be trusted.</p><p>\"You'll keep them away?\"</p><p>He gave a slow nod. Parish and the others would kick his ass when they discovered he'd kept the stunning truth from them, but right now all that mattered was getting Keira home so she could be healed.</p><p>\"Yes.\"</p><p>\"You swear?\"</p><p>\"I swear.\" There could be no</p><p>mistaking his sincerity and she gave a slow, hesitant nod. Then, moving until they were nose to nose, he held her gaze.</p><p>\"But once I release your cat, Parish will sense the bond. The only way to keep your presence a secret is to imprint myself on you.\"</p><p>Long ago, a Pantera parent could deny a potential mate for one of their children.</p><p>The elders had forbidden the practice, but in olden days the purity of bloodlines had been far more important and there were families who were willing to condemn their child to a life separated from their destined mate rather than dilute their pedigree.</p><p>Of course, a Pantera male desperate to claim his lover couldn't be easily denied. They discovered a way to smother the family bond with their own scent. It was temporary, but it allowed the pair to avoid their family long enough to discover if they were truly meant to be mated.</p><p>Over time it had developed into a declaration of love between couples who weren't yet prepared to become fully mated.</p><p>Like humans becoming engaged.</p><p>She trembled, her face coated with a thin layer of perspiration. She was on the edge of collapse which was no doubt the only reason she didn't argue.</p><p>\"Fine.\"</p><p>He lowered his head until his face was buried against the curve of her neck, his lips teasing her silken skin.</p><p>\"Let me in, honey.\"</p><p>He stroked his lips to the pulse that thundered at the base of her throat, his tongue making a quick swipe over the flesh. Abruptly, his cat strained at the leash for more.</p><p>More heat. More skin. More Keira.</p><p>Christ. How had he survived even a day without this woman?</p><p>Patiently waiting until she'd tentatively relaxed beneath his touch, Bayon wrapped her in his arms. Once he was certain she wasn't going to panic, he tightened his hold, allowing his musk to wrap around her. It was the first time he'd tried to imprint himself on a female, but his most primitive instincts knew precisely what to do, trigging his male need to claim this woman.</p><p>She made a sound deep in her throat.</p><p>Not rejection. But a low sound of hunger that tumbled him over the edge of a cliff he hadn't known he was standing on.</p><p>Without warning his mouth widened and he sank his teeth into the flesh of her upper shoulder, saturating her in his scent.</p><p>She grabbed his shoulders, sighing softly as the force of his claim flooded through her, wrapping her in a layer of protection. Bayon licked the tiny wound on her shoulder as she collapsed against him, trying to be as gentle as possible as he cradled her too-thin body in his arms and rose to his feet.</p><p>A savage anger exploded through him as he realized just how delicate she'd become. Had she been starved? Beaten?</p><p>Sexually abused?</p><p>Dammit, he was going to hunt down the savages and make them scream for mercy.</p><p>Then he was going to roast them over an open fire and feed them to the gators.</p><p>Keeping well away from the patrols that guarded the borders, Bayon headed over the spongy ground toward the isolated caves at the far side of the Wildlands. Since Parish had taken them as his home no one had dared to trespass. Which meant there shouldn't be any stray intruders.</p><p>He could only hope the current leader of the Hunters was too occupied with his duties to return in the next few hours.</p><p>The moon was bathing the towering cypress trees in silver as they reached the solid land, heading toward the low rise of hills where the entrance to the caves was hidden by the thick shrubs.</p><p>Forced to bend low to keep from smacking his head on the outlying rocks, Bayon shuffled forward until he at last reached the surprisingly large inner cavern with a high, dome-like ceiling and a shallow stream on one side.</p><p>The cool, thankfully dry air wrapped around them as he headed directly to the tunnels at the back of the cavern. He felt Keira shiver and he pressed her closer to his chest, choosing the tunnel that led to the furthest end of the series of caves.</p><p>He could hear the splash of the waterfall before he hit the circular end of the tunnel. Then, stepping around the curve, he came to a halt, savoring the sight of the water tumbling off the edge of a natural opening in the ceiling to pool in the deep basin in the center of the cavern.</p><p>It was that pool that had attracted the young Pantera, their cats joyously climbing the narrow ledges that lined the walls before shifting into their human forms to splash in the fresh water.</p><p>Now the children had all grown up and there were no cubs darting through the droplets of water that shimmered in the moonlight or shouts of laughter as young boys tried to capture the interest of the girls.</p><p>The thought abruptly reminded him that he had to contact Parish. Someone had to return to tracking the bastards who'd attacked Ashe and her baby.</p><p>\"I remember this place,\" Keira whispered softly, her gaze on the waterfall as Bayon gently lowered her so she could stand beside the pool.</p><p>Bayon tugged her to face him. \"Look at me, Keira.\"</p><p>The eyes that remained unnervingly dull lifted to meet his steady gaze.</p><p>\"What?\"</p><p>\"It's time for me to call your cat.\" He heard her swallow, her eyes too large for her pale face. \"You won't let anyone take me?\"</p><p>\"I'll protect you,\" he pledged, his fingers cautiously cupping her chin. \"No one is ever going to hurt you again.\" Tilting her head back, he peered deep into her eyes and spoke the ancient words of power.</p><p>A heat prickled in the air, the magic a smothering power that slammed into Keira with a force that sent her to her knees, as a pained sound wrenched from her throat.</p><p>Bayon grimaced, hating the</p><p>knowledge that he was forcing her into an involuntary shift. It was a gift that he used when a Pantera was severely injured in their human form and needed to transform into their cat to heal. Or if the cat had become feral, unable to recall their humanity.</p><p>It wasn't something he did lightly.</p><p>Transformation was supposed to be a private, joyous event. For him to compel a shift was uncomfortably close to stealing a person's free will.</p><p>Keira tumbled to the side, then, with a burst of swirling colors, her human form was altering, the muscles thickening and the fur coating her once smooth skin.</p><p>Bayon continued to speak the low words of command, his hands held over her as her eyes abruptly glowed with power and the cat emerged with a roar of long-suppressed fury.</p><p>Sheer relief flooded through him as he took a careful step backward, giving the cat plenty of space. After being forced into hibernation for so long there was no telling what she might do now that she was wakened.</p><p>The golden eyes studied him with a predatory hunger, but clearly too weakened to pounce, she instead displayed her massive teeth before curling on the hard floor and lowering her beautiful head to her paws.</p><p>Bayon backed out of the cave, giving the cat enough privacy so she could rest in peace, while remaining close enough that the human part of her knew she was being protected.</p><p>God almighty.</p><p>He pulled a cell phone out of his front pocket. He carried two. One that was his private phone with all the bells and whistles. And one a burner phone that couldn't be traced.</p><p>He chose the burner. He didn't want anyone realizing he'd returned to the Wildlands.</p><p>Parish answered on the first ring.</p><p>\"You have them?\"</p><p>Bayon grimaced. The Hunter wasn't going to be pleased with what he had to say.</p><p>\"I tracked them to a home just one block north of the schoolhouse in Melton. They'd taken off but there's a good chance they'll return. If not, Talon should be able to follow their trail.\" Bayon winced at Parish's brutal reprimand at not having stayed on the hunt for the intruders. \"I have a lead I want to investigate. It's important.\" There was another furious chastisement that included Parish's opinion of idiots who couldn't follow orders and the threat of Bayon's manhood being removed by a rusty knife. \"Trust me, mon ami, you'll be the first to know when I have info I can share. Oh, and tell Talon that in the attic of the house he'll find a metal collar. I think it has some sort of toxin on it so he'll have to be careful, but he needs to bring it back for the Healers to study. It might be important. I'll be in touch as soon as I can,\" he promised before shutting off the phone and shoving it back into his pocket.</p><p>Parish was furious, but he wouldn't hesitate to send Talon back to the house.</p><p>Which meant that Bayon had a few hours at least to concentrate solely on helping Keira. A duty that might not be his by blood, but was surely his by right.</p><p>Keira had always belonged to him.</p><p>Even if she'd been too damned stubborn to admit it.</p><p>Keira wasn't surprised that she dreamed she was in her cat form. It was how she hung on to what little remained of her sanity.</p><p>But the dreams had never been so tangible she could actually feel the sun slanting over her slumbering body, warming her pelt with a delicious heat, or hear the sound of splashing water playing like a symphony in the background.</p><p>She desperately tried to cling to the dream. She didn't want to wake to find herself in the cramped attic with the collar wrapped around her neck and the stench of the nearby humans making her want to hurl.</p><p>But there was something that felt like a rock digging into her ass, and a strange heat pressed against her back.</p><p>Slowly she forced open her eyes, tensing as she realized she wasn't in the cage. This was...a cave.</p><p>But not just any cave. Her favorite cave.</p><p>And she was most definitely in cat form, lying in the late morning sunlight.</p><p>Which meant she'd been asleep for hours.</p><p>Without thought, she was shifting back to human, whirling around to find a beautiful golden puma slumbering directly behind her.</p><p>Bayon.</p><p>The name came easily, her mind slowly beginning to clear as she breathed in his warm, musky scent.</p><p>Home. Dear lord. She was home.</p><p>Distantly she was aware that she was completely nude, the side effect of being forced into a shift, and that there were still large holes in her memories. But suddenly she was consumed with the need to prove this was more than a dream.</p><p>That she was really, truly saved.</p><p>\"Bayon,\" she murmured softly, reaching to run her fingers through his soft pelt.</p><p>He was a magnificent cat.</p><p>Large, muscular, fiercely male.</p><p>She'd been overwhelmingly attracted to him from the moment he'd been old enough to join the Hunters. No shocker.</p><p>Bayon started breaking female hearts before he ever left the nursery.</p><p>He was gorgeous, brash and too damned charming for his own good.</p><p>And as far as Keira was concerned, he'd also been firmly off-limits.</p><p>She told herself it was because he was too young for her.</p><p>All male Pantera were horndogs, or rather horncats, once they hit puberty, and Bayon was no different. When he wasn't training or on duty his only thought was getting laid. Keira hadn't had any interest in being another notch in his bed.</p><p>Not when she'd had far more mature lovers who could ease her needs.</p><p>The sort of lovers who understood her position as the leader of the Hunters, and never crossed her barriers.</p><p>Bayon wouldn't have recognized a boundary if it bit him on the ass.</p><p>But a part of her had always known that was an excuse to shut down his persistent pursuit of her.</p><p>Deep inside she'd been a coward.</p><p>In hindsight it was easy to see.</p><p>Bayon was too bossy, too demanding, too...everything, to be a comfortable partner. And for a woman struggling to maintain her alpha status, it'd been easier to slam the door on the fragile bond she could sense trying to form between them than to struggle against Bayon's natural tendency to dominate.</p><p>Now, however, she didn't give a shit about complications or politics or any other stupid reason she shouldn't give into her needs.</p><p>Her cat had been without touch far too long, and her female knew exactly which man she wanted to ease her hungers.</p><p>On cue, Bayon lifted his head, his eyes more gold than green when he was in his cat form, warming with a genuine pleasure as he shifted in a flurry of magic.</p><p>Keira shivered beneath a blast of lust as the cat was replaced with a large, delectable male dressed only in a pair of faded jeans. Oh, shit. His chest was even broader than it had been, and tattooed with tribal markings that flowed down the side of his lean waist.</p><p>He'd hardened over the years.</p><p>Matured into the lethal warrior she'd sensed from the beginning. But there was still a twinkle of the boyish charm deep in his eyes.</p><p>Irresistible.</p><p>She growled low in her throat as she kneeled directly in front of him, shoving her fingers into the satin gold of his shoulder length hair.</p><p>\"Welcome home, honey,\" he</p><p>murmured, his voice still thick with sleep.</p><p>Acting on pure instinct, Keira leaned forward to kiss the lips that she'd fantasized about in the privacy of her bed. Instant, molten heat flared through her. Oh god, he tasted so good. Male spice and pure power.</p><p>She moaned as nerve endings she hadn't felt for years sparked to life. Her fingers tightened in his hair as his lips parted in ready response, a tantalizing musk filling the air with the scent of his arousal.</p><p>\"Christ, I missed you,\" he muttered against her lips.</p><p>Her desire flooded through her, the need to be close to this man so intense it was painful.</p><p>\"Touch me,\" she pleaded, arching her back so she could press the tips of her aching breasts against his chest.</p><p>A moan was wrenched from his</p><p>throat, but even as his hands cupped her hips, he was lifting his head to study her with a wary expression.</p><p>\"Keira?\"</p><p>With a shove, she had him flat on his back. Quickly straddling his hips, she allowed her hands to explore the smooth terrain of his chest.</p><p>\"I need to feel your touch,\" she said in husky tones, her breath hissing through her clenched teeth as he spanned her waist, before his fingers skimmed up her sides to cup the small mounds of her breasts. \"Yes,\" she said in approval, leaning forward to spread a path of kisses over the silken heat of his skin, pausing long enough to lick a flat nipple.</p><p>\"More.\"</p><p>He shuddered, his erection thickening to press against the zipper of his jeans.</p><p>Deliberately Keira ground herself against his bulge, her pussy growing wet. She needed that hard cock deep inside her.</p><p>Now.</p><p>His slender fingers teased her nipples with exquisite expertise, his touch sending shockwaves of pleasure through her shivering body. She released a shaky breath, craving him with a force that defied logic.</p><p>There was a flash of heated gold in his eyes as his cat responded to her touch, but even as a purr of approval rumbled through her chest, Bayon tensed beneath her.</p><p>\"Wait, Keira,\" he growled.</p><p>She nipped his collarbone, hard enough to draw blood. \"No, don't stop.\" With a muttered curse he surged to the side, reversing their positions until she was on her back and he was perched on top of her.</p><p>Keira might have protested if it didn't feel so damned good to have his weight pressing against her trembling body. Her legs were spread to allow his lower body to rest between them, his fully erect cock pressing near her precise point of pleasure.</p><p>Bayon scowled. \"What's going on?\" Her gaze dropped to admire the bulging muscles of his biceps, oddly disturbed by the searching question in his eyes.</p><p>She didn't want to think. She wanted to feel.</p><p>\"You're the last man who needs an explanation for what's going on,\" she said, refusing to dwell on the number of females who'd enjoyed Bayon's touch.</p><p>The thought was far more painful than it should be. Then she stiffened, struck by a horrifying fear. \"Unless you're mated?\"</p><p>His scowl deepened. \"Christ, no.\" Sheer relief had her reaching up to frame his face in her hands, tugging his head downward.</p><p>\"Then kiss me.\"</p><p>He made a sound deep in his throat as he allowed his mouth to crash into hers, kissing her with a raw hunger that demanded capitulation. A capitulation Keira was eager to give.</p><p>So long as it was on her terms.</p><p>Angling her hips so his cock pressed directly against her clit, she bit the tongue he shoved into her mouth, before sucking it with a rhythmic insistence that had him moaning in sheer male need.</p><p>Her fingers skimmed over his bronzed face, taking an amazing delight in the hard angles and planes. He wasn't pretty. He was too male, his features too bluntly carved. But he had a compelling beauty that enthralled her.</p><p>Taking her time, Keira memorized the prominent line of his cheekbone and the sensuous curve of his lips. During the brutal years she'd been held captive, she'd discovered that she had no regrets for the things she'd done, but she had plenty of regrets for the things she hadn't done.</p><p>Things like this.</p><p>She stroked the line of his stubborn jaw, relishing the rough stubble of his beard as she rubbed herself against the delicious hardness of his erection.</p><p>Bayon growled, then with a last thrust of his tongue he wrenched his lips free to bury his face in the curve of her neck.</p><p>He bit into her flesh with enough pressure to send white-hot lust jolting through her.</p><p>She hissed in pleasure. Yes...oh yes.</p><p>She needed this.</p><p>Running her hands down the</p><p>impressive width of his back, she grabbed the waistband of his jeans, impatiently trying to tug them down.</p><p>\"Off,\" she muttered in frustration.</p><p>\"Wait.\" With a harsh groan, he arched back to stare down at her flushed face.</p><p>\"Keira.\"</p><p>Her hands skimmed to the front of his jeans, struggling with the snap. \"What?\"</p><p>\"Stop.\"</p><p>She frowned, wrapping her fingers around the massive erection that pressed against his zipper.</p><p>\"Why?\"</p><p>His pained groan echoed through the cave. \"Because twelve hours ago you didn't even remember me.\"</p><p>She abruptly turned her head, pretending an interest in the nearby waterfall. \"I was...confused.\"</p><p>She could feel the heat of his gaze searing over her profile. \"And now you're not?\"</p><p>\"I know what I need.\"</p><p>\"And what's that?\"</p><p>She reluctantly turned back to meet his demanding gaze. \"I need to know you're real,\" she breathed. \"That I'm real.\"</p><p>\"Shit.\" His face twisted with an agonized regret, then before Keira could guess his intent, he was seated on the ground with her trembling body cradled in his lap. \"I have you,\" he murmured as she instinctively tried to escape his hold, pressing his cheek to the top of her head.</p><p>\"And I'm not letting go. Not ever again.\" She should have been pissed. This was supposed to be a hot, sweaty bout of sex that would ease the hunger she'd had for this male for years and prove once and for all that she was out of the damned cell.</p><p>No fuss. No muss.</p><p>Just a glorious knowledge that she was able to do exactly what she wanted.</p><p>But as swiftly as her desire had exploded, it altered to a different, but just as savage need.</p><p>Comfort.</p><p>The feel of Bayon's hand softly stroking up and down her bare back. The warm, familiar musk of his cat. The sound of his heart beating beneath her ear.</p><p>She snuggled against him, feeling the magic of the land seep inside her.</p><p>It should have added to her comfort.</p><p>The magic had healed her cat. It soothed the damage done to her human form by the damned collar. And with every passing second it was repairing the damage to her mind.</p><p>All fan-fucking-tastic things, if there wasn't something buried in the depths of her brain that was wigging her out.</p><p>Something she wasn't prepared to deal with. Not yet.</p><p>\"No one knows I'm here?\"</p><p>\"No,\" he swiftly assured her, nuzzling his face in her hair. He was such a cat.</p><p>\"But you realize they're going to skin me when they find out I didn't tell them you're alive?\"</p><p>She grimaced. It wasn't fair to force Bayon to choose between protecting her and his loyalty to fellow Hunters, but the suffocating dread that enveloped her didn't give a shit. And for now she wasn't strong enough to battle through it.</p><p>\"I'm not ready,\" she muttered.</p><p>Thankfully Bayon didn't press, perhaps sensing she was still dangerously fragile. \"Can you tell me how you disappeared?\" he instead demanded.</p><p>She paused, trying to sift through the memories that were a strange patchwork of perfect clarity and murky confusion.</p><p>Now that she was home, she could clearly remember her childhood playing in this cave with Parish. And the day she'd taken command of the Hunters.</p><p>And even eyeballing Bayon when he was too occupied to notice her fascinated survey.</p><p>But the second she tried to</p><p>concentrate on the events leading up to her kidnapping, her brain began to sputter and shut down. Like a computer with a virus.</p><p>\"It's still fragmented,\" she admitted, her voice tight with frustration.</p><p>His hand continued to run a soothing path up and down her spine. \"We thought you were dead.\" He was forced to halt and clear his throat as he relived the day of her disappearance. \"Parish could sense you were being attacked, then suddenly his connection to you was severed. He searched for you for months, but his cat was convinced you were dead.\"</p><p>She hissed with dark fury, knowing her death would have tormented her brother. It wouldn't be enough for Parish to mourn her passing. No, he would've made certain he carried the full weight of guilt for having failed her.</p><p>Damn, but she wanted to make those bastards pay for what they'd done.</p><p>\"I think they had some sort of black magic that blocked my connection to my cat,\" she said.</p><p>\"That's what Raphael said when he was ambushed.\"</p><p>Keira tilted back her head in surprise.</p><p>\"Raphael was attacked?\"</p><p>\"Yeah, just outside the borders.\" Bayon's expression was guarded, as if he were hiding something from her. \"He was shot with a dart by a human who was tattooed with a raven in front of a full moon.\"</p><p>Pain ripped through her head as a shard of memory pierced through the black hole that surrounded her kidnapping.</p><p>\"The Mark of Shakpi,\" she breathed, squeezing shut her eyes as a wave of nausea threatened to overwhelm her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bayon cursed as he felt Keira tremble in distress.</p><p>Goddammit. The last thing he wanted to do was cause this female more pain, but they had to discover if her disappearance had anything to do with the attack on Ashe. For all they knew the bastards were already plotting another assault aimed to kill the vulnerable human and her precious baby.</p><p>Now he feared he pressed the still-weakened Keira too far.</p><p>\"Keira.\" He urged her head against his chest as he reached behind him for the blanket he'd been laying on. Gently he tucked it around her naked form. \"Are you-\"</p> <p>\"I'm fine.\" She sucked in a deep breath. Then another. \"Just give me a minute.\"</p><p>\"Take your time,\" he murmured softly, savoring the feel of her in his arms.</p><p>Yeah, she was only there because he'd been the one to rescue her, but his cat didn't care. It only knew that he'd waited for an eternity to have this woman curled in his lap, her head resting over his heart.</p><p>Then, as if to remind him of just how little right he had to hold her so tight, she opened her eyes and forced herself to share what she recalled of her kidnapping.</p><p>\"I remember I was meeting with Sean.\"</p> <p>His muscles clenched at the reminder that she'd chosen a mere mortal to warm her bed while slamming the door in his face.</p><p>\"Your human lover?\"</p><p>She lifted her head from his chest, studying his rigid expression. \"He wasn't my lover.\"</p><p>Bayon frowned. \"No?\"</p><p>Her lips thinned at the disbelief in his voice. \"No, he approached me at The Cougar's Den one night. He said he'd heard rumors there was a new gang in the area who were spending a lot of time in the bayous.\"</p><p>Bayon hesitated, reeling beneath her blunt confession.</p> <p>Shit. Did she have any idea how often he'd tormented himself with the thought that her last hours had been spent with her human lover instead of with the family who would have protected her?</p><p>And now he discovered that she'd lied to him...he gave a sharp shake of his head.</p><p>\"He knew what you are?\" he</p><p>demanded. Most humans were</p><p>convinced that the Pantera were no more than a myth. A belief that the Pantera were happy to encourage.</p><p>\"Yes, and that we'd be interested in the strangers,\" she said. \"I asked him to try and infiltrate the gang and get us information.\" She shuddered at some unpleasant memory. \"He was willing, for a price.\"</p><p>His gaze narrowed. \"What price?\" Again with the thinning of her lips.</p><p>\"Not the one you're thinking.\" Bayon grimaced. His age-old</p> <p>jealously was making him behave like an ass. And why? She'd just revealed that she'd used Sean as an asset to discover information, not to be her playmate, hadn't she?</p><p>Maybe it was because at the time she'd gone to such an effort to make him think she was in the midst of a passionate affair.</p><p>\"You just pretended to be lovers so you had a reason to meet him?\"</p><p>\"Give the cat a gold star,\" she muttered.</p><p>He bent down to nip her nose. \"And to piss me off?\"</p><p>The flush staining her cheeks revealed he wasn't wrong. \"Not everything is about you, Bayon.\"</p><p>\"Says who?\" he teased before pulling back to meet her wary gaze. \"So what happened?\"</p><p>She frowned, her eyes shadowed with a fear that he desperately longed to erase.</p><p>\"I remember he cornered me as I was leaving The Cougar's Den one evening.</p><p>He told me he had information I needed to hear, but he was scared to tell me where we could be overheard. He wanted to meet me at our secret location the next evening.\"</p><p>\"And you agreed.\"</p><p>\"Yes, I had no reason not to trust him.</p><p>Although I did notice there was suddenly something off about his scent. It was-\"</p><p>\"Sour?\" he completed for her.</p><p>She gave a startled nod. \"Exactly.\" Which meant they were definitely connected to the same idiots who'd attacked Raphael and Ashe.</p><p>Dammit.</p><p>How long had their enemies been spying and plotting on them?</p><p>And why wait until now to strike?</p><p>Questions he had no answer for.</p><p>Bayon's cat snarled with the need to be on the hunt.</p><p>\"He must have decided the enemy had more to offer than we did,\" he growled.</p><p>\"Maybe.\" The shadows in her eyes darkened. \"I assume that I went to meet him.\"</p><p>\"Keira.\" He cupped her cheek as she was shook by a violent tremor. \"What is it?\"</p><p>\"I can't remember, but it's something important,\" she breathed, the acrid tang of her fear suddenly thick in the air.</p><p>\"Something that's a danger to the Pantera.\"</p><p>Genuine concern squeezed his heart as he sensed her rising hysteria. \"Shh.</p><p>Don't try to force it.\"</p><p>She shivered, abruptly trying to push him away as her fear threatened to consume her. \"Now you're a Healer?\" Bayon wished to hell he was. Maybe he'd know what to do to help her work through the stress of her forgotten memories.</p><p>All he could do was offer a</p><p>distraction.</p><p>With a speed that caught Keira off guard, he had her flat on her back, and his heavier body pressing against her.</p><p>\"I'm all Hunter, honey,\" he assured her, unleashing the hunger that was a constant ache deep inside until the musk of his arousal filled the cave. \"And one of the best despite your lack of faith in me.\"</p><p>Her eyes flashed with the golden beauty he remembered, the very center a starburst of exquisite emerald.</p><p>\"I never doubted your skills as a Hunter, Bayon,\" she snarled, her anger overwhelming her fear. \"Not ever.\"</p><p>\"Just my skills as a lover?\"</p><p>She sucked in a sharp breath. \"Bayon</p><p>-\"</p><p>\"I need to find Talon.\" With a fluid movement Bayon was on his feet and heading toward the nearby tunnel. He'd meant to distract her. Not open old wounds that for him had never healed.</p><p>But for a brief, savage moment she'd been the old Keira and he'd been the old Bayon, and he'd wanted to claim her more than life itself. \"I'll bring back lunch.\"</p><p>\"Bayon...wait.\"</p><p>It took some time, but Bayon</p><p>eventually tracked Talon to The Cougar's Den, a seedy bar owned by the Pantera and built on the edge of the swamps in a small town called La Pierre.</p><p>The younger Hunter, with dark gold hair threaded with copper highlights and eyes a pale gold rimmed with jade, had obviously just arrived. His boots were coated with dust and his LSU Tigers sweatshirt was marred with something that smelled like ash.</p><p>\"Well?\" Bayon demanded as he</p><p>joined his friend at the long bar at the back, gesturing to the bartender for a cold beer. \"Did you find the house?\" Talon grimaced, downing a shot of his private stash of tequila he kept in a silver flask. \"They burned the place to the ground before we could get there.\"</p><p>\"Shit.\" Bayon took a long drink of his beer, frustration burning in the pit of his gut. Their enemies might be mere humans, but they were managing to stay a step ahead of the Pantera with monotonous regularity. How the hell was that possible? \"Any tracks?\"</p><p>\"Yep. They led us to a hidden airport.\"</p><p>Airport. Bayon slammed his bottle onto the wooden counter. Not even someone with the finely tuned senses of a puma could track his prey through the air.</p><p>\"Then they're gone.\"</p><p>Talon reached out to give Bayon's shoulder a comforting squeeze. \"Raphael is using his contact with law enforcement to try and trace the owners of the land as well as any FAA filings from the area. Someone has to have a pilot's license.\" The golden eyes glowed with the hunger of his cat. \"Once he has a name I'll be all over them.\" Bayon bit back the urge to remind Talon that they needed at least a few of the bastards left alive.</p><p>Talon could be bloodthirsty, but he wasn't stupid.</p><p>\"How's Ashe?\" he instead asked.</p><p>\"Holding her own.\" Talon lowered his voice. Not everyone in the bar was Pantera. In fact, Ashe's mother was quite possibly seated just a few stools down.</p><p>\"For now.\"</p><p>Bayon grimaced. \"Has anyone heard from Jean-Baptiste?\"</p><p>Talon snorted. \"You know as much as I do. Probably more.\"</p><p>\"Which isn't nearly enough.\" Bayon abruptly shoved himself to his feet. He really fucking hated the sensation that they were all being shoved around like pawns on a chessboard. \"We need answers.\"</p><p>Talon lifted his brows at the savage edge in Bayon's voice. \"Why are you taking this so hard, mon ami?\" He curled his hands into tight fists, glancing toward the pool tables where a group of male Pantera were knocking balls around with an obvious lack of interest. Instead their gazes roamed over the handful of humans before moving toward the door of the club, as if expecting violence to erupt at any minute.</p><p>\"Can't you feel it?\" Bayon muttered.</p><p>\"Feel what?\"</p><p>\"Evil.\" Bayon shivered, abruptly overwhelmed by the need to be with Keira. Crazy, considering he'd left the cave because he had to get away from her. But then, that was pretty much the story of their volatile relationship. \"I have to go.\"</p><p>Ignoring the calls from the gathered Pantera to join them for a beer, Bayon left the bar and headed directly toward a nearby restaurant that reeked of stale grease and fried onions. The stench was enough to make his cat shudder in distaste, but he grimly walked to the front counter to pick up the order he'd called in before entering town.</p><p>After he'd paid, he clutched the paper bag and headed back to the caves with a speed that made the native wildlife duck for cover. Even the gators had enough sense to remain out of the path of a Pantera on a mission.</p><p>Leaping over the fallen logs and narrow channels clogged with water lilies, Bayon tried to concentrate on how he could assist Raphael in tracking the missing kidnappers. He didn't have personal contacts in the human world, but he was a Hunter who understood prey.</p><p>Once the men had returned to the house to discover Keira gone, they would have instantly realized their location was no longer secure. That discovery would no doubt have triggered a pre-planned escape, including torching the house. But they couldn't have disappeared without help.</p><p>Which meant cell phone calls. Bank transfers. New identities.</p><p>Things that he was certain were already being tracked down by the Geeks, the faction of Hunters who used technology to protect the Wildlands and to trace their enemies.</p><p>They were as dangerous as any warrior.</p><p>The various methods of locating the bastards shuffled through his mind even as his attention kept sliding back to the female who'd been so miraculously returned to him.</p><p>Christ, he'd mourned her for so long.</p><p>It'd been a constant hole in his heart that he'd hidden beneath his image of a horny puma on the prowl.</p><p>Was it any wonder he'd been reeling since he'd found her in that cage?</p><p>One minute the overprotective part of him wanted to wrap her in cotton wool until he was convinced that she was completely healed, and the next his cat was snarling with the primitive urge to claim her so she would never, ever be taken from him again.</p><p>Scowling at the tangled emotions he hadn't felt in twenty-five years, Bayon entered the Wildlands from the deepest part of the swamp and headed directly for the caves. Once at the entrance he paused to make certain that no one else had been in the area before crouching low enough to enter without banging his head. Then, with a feral smile, he followed the intoxicating scent of Keira to the back cavern.</p><p>She was seated near the waterfall, her fingers playing in the pool of water as the sunlight crept through the opening in the ceiling, bathing her in a golden glow.</p><p>The breath was wrenched from his lungs as he took in the dark satin of her hair that tumbled down her slender back and the delicate profile that was so painfully familiar. How often had he studied her striking beauty from a distance? How often had those female features haunted his dreams?</p><p>His gaze swept downward. She'd found her clothes that Parish had kept boxed in one of the caves, and was wearing a pair of low-riding jeans and a cropped top that offered a tantalizing glimpse of her slender waist.</p><p>His cat snarled in approval, the hunger that he'd kept tightly suppressed blasting through his defenses as he prowled forward.</p><p>Keira was home. Physically, at least, she was healing.</p><p>And she was his.</p><p>That was all his cat needed to know.</p><p>The man part of him would continue to worry about the bastards who'd stolen her. And why her memories refused to return. And why she feared revealing her presence to the others. But the cat...</p><p>Yes, he was satisfied.</p><p>Or he intended to be satisfied. Once he had Keira beneath him, screaming his name in pleasure.</p><p>Very, very soon.</p><p>Keira was lost in her thoughts, but her head jerked up as he crossed the smooth stone floor, her hand automatically lifting to catch the paper bag he threw in her direction.</p><p>\"I thought you might be hungry.\"</p><p>\"Starving,\" she admitted, peeking inside the bag before lifting her head to study him with a guarded expression.</p><p>\"You remembered?\"</p><p>With one pounce he was on the ledge of the pool, not bothering to hide his arousal as the scent of her warm musk wrapped around him.</p><p>\"Everything,\" he admitted, no longer willing to pretend she was just an old friend who'd come home.</p><p>Her once-bold gaze was skittish as she pulled out one of the greasy burgers and consumed it in two bites.</p><p>\"You said something about Parish being mated?\" she asked.</p><p>Bayon smiled. He didn't doubt her interest in her brother. Or his new mate.</p><p>But he also recognized a distraction when it was thrown in his face.</p><p>\"It's recent.\" He allowed his fingers to trail over her lower back. \"Very recent.\"</p><p>She demolished another burger, but she couldn't disguise her shiver of pleasure. \"Who's the lucky female?\" she choked out.</p><p>He traced the hem of her shirt. \"Julia.</p><p>A human doctor.\"</p><p>Finished with her food, she tossed aside her bag and sent him a startled glance over his shoulder.</p><p>\"Human?\"</p><p>\"Trust me, no one was more shocked than your hard-ass brother,\" he admitted.</p><p>\"After...you disappeared, he blamed the entire human race.\" His fingers teased the sensitive dip at her lower back. \"For a while I thought I was going to have to cage him to keep him from going on a bloody rampage.\"</p><p>The emerald starburst in the center of her eyes smoldered with a hunger that matched his own.</p><p>Not that she was about to admit the truth. Stubborn feline.</p><p>\"Do you approve of this Julia?\" she asked.</p><p>He shrugged. \"We don't know much about her, but she saved Ashe's baby, so she's got my vote of approval.\"</p><p>\"Ashe?\" Keira frowned in confusion.</p><p>\"Baby?\"</p><p>As concisely as possible, Bayon revealed the stunning news that Raphael had not only mated, but that Ashe was expecting the first Pantera babe in over fifty years. As well as the fact that they'd recently been attacked.</p><p>\"A baby.\" Her smile was filled with genuine joy. \"Oh my god.\"</p><p>\"This child might be the savior of the Pantera, but only if we can protect the babe from our enemies.\" His own expression was grim. \"I was tracking the bastards who attacked Ashe when I found you.\"</p><p>She turned so she was facing him.</p><p>\"Have they been captured?\"</p><p>\"Not yet.\" He grimaced. \"They torched the place and took off.\" Without warning, she surged upright, her cat eager to be on the hunt. \"I'll find them.\"</p><p>Bayon reacted without thought. One minute he was perched beside the pool, and the next he had knocked Keira flat on her back and was lying on top of her rigid body.</p><p>\"Like hell, you will,\" he snapped.</p><p>A dangerous gold flared in her eyes as her cat reacted to his display of dominance. \"Maybe you've forgotten that I'm the one who gives the orders,\" she snarled.</p><p>He pressed a finger to her lips, halting her furious words. \"Oh no, honey.</p><p>There's a new sheriff in town.\" She shook off his hand, her eyes narrowing. \"What the hell does that mean?\"</p><p>\"I don't take orders from you. In fact, for the next few hours I intend to give them.\"</p><p>She snorted, unimpressed. \"And you expect me to obey?\"</p><p>His slow smile was filled with wicked intent. \"I not only expect you to obey, I expect you to plead for more,\" he explained.</p><p>If looks could kill he'd be dead on the spot.</p><p>\"Don't make the mistake of treating me like one of your bimbos,\" she managed to warn between gritted teeth.</p><p>She was beautiful when she was jealous.</p><p>Eyes glowing with emerald and gold fire. Her hands pressed against his chest, her breasts heaving as her cat struggled to be released.</p><p>He held his upper weight on his elbows, allowing his hands to slide beneath the too-revealing shirt.</p><p>\"What would you know about my bimbos?\"</p><p>\"They weren't a secret.\" Her voice became a low rasp as his fingers found the swell of her breasts. \"There used to be bets placed in the dining hall about how long the latest would last and who would be next to crawl into your bed.\"</p><p>\"And it never occurred to you that maybe all those stories were more myth than truth?\"</p><p>\"Yeah, right.\"</p><p>She tried to sound skeptical, but he didn't miss her tiny groan of pleasure as his fingers grasped the nipples already beaded in anticipation. He tugged them with enough force to make her hiss with a growing hunger.</p><p>\"I may not be a virgin, but-\"</p><p>\"Understatement of the century.\" With an impatient motion, he yanked off the tiny top, cupping her swollen breasts with a gentle reverence.</p><p>\"But my reputation has been highly exaggerated.\"</p><p>She groaned, her claws extending to prick the skin of his chest. \"I doubt that.\"</p><p>\"Why?\" he muttered, distracted by the spectacular sight of her rosy nipples that begged for his kiss.</p><p>\"Because you flirted with every female in the Wildlands.\"</p><p>\"Did you sleep with every male you flirted with?\"</p><p>\"Fine.\" She cleared her throat. \"What about the females you kept in New Orleans?\"</p><p>Bayon lifted himself until he could shuck off his boots and jeans before kneeling between her legs as he wrenched his T-shirt over his head.</p><p>\"There were no females.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Keira shuddered, lifting herself on her elbows to regard the man kneeling between her legs like an ancient conqueror.</p><p>She should be pissed.</p><p>She was an alpha. Men didn't toss her on her back and have their way with her.</p><p>Not unless they wanted their throats ripped out.</p> <p>So why was she lying there like she was some helpless kitten?</p><p>Perhaps it was because she was so damned consumed by her hunger for this male she couldn't think of anything but getting that hard, bronzed body on top of her.</p><p>Or perhaps it was because she was struggling to accept that he wasn't the testosterone-driven playboy she'd believed for so long.</p><p>\"Then why did you let people think you had an apartment in New Orleans where you kept your latest lover?\" she husked.</p><p>A golden glow spread through his pale green eyes as his cat studied her with a restless need.</p> <p>\"Because I didn't want a bunch of curious cats pushing their noses into my business.\"</p><p>She frowned, struck by an intense need to know what Bayon had been hiding. \"Is it some secret?\"</p><p>He hesitated, as if debating whether or not to confess the truth. Then he gave a small shrug.</p><p>\"My mother was a born Nurturer,\" he at last said.</p><p>Keira nodded. Bayon's mother was beloved by all Pantera. \"I remember her being in charge of the nursery,\" she said in fond tones. \"I don't know how many times she kissed my boo-boos or slipped me a chocolate chip cookie when the other girls teased me for not playing with dolls like the rest of them. Your mother will always have a special place in my heart.\"</p><p>His blunt features softened with love.</p> <p>\"In all our hearts.\"</p><p>\"I don't understand what this has to do with New Orleans.\"</p><p>\"When the Pantera stopped having children, the nursery was closed.\" He grimaced. \"My mother was...</p><p>devastated.\"</p><p>\"Of course she would be,\" Keira breathed, wishing she'd made the effort to realize how difficult the past years had been on the Nurturers.</p><p>\"I feared that she was losing her will to live, so I found a project that would keep her occupied.\"</p><p>\"What project?\"</p><p>\"I opened an orphanage in New Orleans.\" His lips twisted as her eyes widened with shock. \"It seemed like the perfect solution. My mother has endless love to share with the human children.\"</p> <p>\"Oh.\" Her heart melted. She'd always known Bayon was special. This only proved just how special. \"Why the hell did you keep it such a mystery?\"</p><p>\"I did it for my mother,\" he said.</p><p>\"There was no need for anyone else to know. Besides-\"</p><p>\"Besides what?\"</p><p>His gaze strayed toward her naked breasts. \"Besides, I wanted you to believe that I had a harem in New Orleans.\"</p><p>\"Why?\"</p><p>\"You know why.\"</p><p>She did. It was the same reason she'd pretended that Sean was her lover.</p><p>Stupid games designed to keep barriers between them.</p><p>But now the truth had torn down those walls, and left them both unable to deny the raw, savage need that pulsed between them.</p><p>Slowly her gaze lowered to take in his massive erection that seemed to grow even larger as she studied it with an undisguised desire.</p><p>\"You're playing with fire, honey,\" he breathed, lowering himself to sprawl beside her, the heat of his naked body like a furnace.</p><p>\"This is crazy.\"</p><p>\"Not as crazy as denying what we both want.\" His cat glowed in his eyes as he reached for her hand, pressing it against his dick. \"Feel what you do to me.\"</p><p>\"Bayon.\"</p><p>Unable to resist temptation, she wrapped her fingers around his erection, exploring down to the heavy testicles before slowly skimming back up to find the broad tip that was already damp with his seed.</p><p>He shuddered, exposing his claws to slice her jeans and then her tiny lace thong into tatters. She parted her lips to protest the destruction of her clothing, only to have a groan escape as he cupped her bare ass, his fingers squeezing her flesh in a promise of pleasure to come.</p><p>\"I let you keep me at a distance for too long.\" He peered deep into her eyes.</p><p>\"I'm not letting you do it again.\" She forced herself not to look away.</p><p>There would be no more hiding. \"Do you know why I was afraid to let you near?\"</p><p>\"Because I wasn't going to let you neuter me like you did your other lovers.\"</p><p>She deliberately gave his cock a slow pump, taking full pleasure in the fine layer of sweat that suddenly glistened on his bronzed skin.</p><p>\"It was because I feared you would undermine my authority as the leader of the Hunters,\" she bluntly confessed. \"I had a hard enough time being taken seriously as an alpha without you distracting me.\"</p><p>\"I might have tried,\" he admitted, his lips curving into the boyish grin that was lethal to the female heart. \"But I have faith you would have sliced off my balls if I'd become too obnoxious.\" Clever, clever cat.</p><p>He knew precisely what to say.</p><p>And how to touch, she acknowledged, as his fingers moved from her ass to trace the curve of her waist.</p><p>\"My need for dominance doesn't bother you?\" she pressed, knowing his answer was important.</p><p>Her cat would never be happy in a subservient role.</p><p>\"Let's say I'm willing to</p><p>compromise,\" he said, the rasp of his breath filling the air. \"I don't always have to be on top.\"</p><p>Without warning his hands gripped her hips, rolling her until she was lodged on top of him. Tiny jolts of bliss speared through her as her already damp flesh was pressed to his thick cock.</p><p>\"Oh hell,\" she moaned.</p><p>\"No more denying what's between us, Keira?\"</p><p>She met his gaze that blazed a brilliant gold.</p><p>She'd fought this moment for so long.</p><p>Ever since she'd sensed this cat was destined to be more than just another lover.</p><p>She couldn't fight any longer.</p><p>\"No more,\" she whispered.</p><p>His hands skimmed to cup her breasts, his cat watching her with a sensual intensity.</p><p>\"Admit that you want me,\" he</p><p>prodded, his fingers squeezing her nipples with a pressure that was on the right side of pain.</p><p>Oh...yes.</p><p>\"I want you,\" she breathed.</p><p>\"Bayon.\" His voice was thick with need. \"Say my name.\"</p><p>\"Bayon.\"</p><p>He smiled with satisfaction. \"Now show me what you want.\"</p><p>She planted her hands on either side of his shoulders, lowering her body and tilting her head to the side in open invitation. With a growl of approval, Bayon sank his teeth into the tender curve of throat where it met her shoulder.</p><p>The same spot he'd used to imprint himself.</p><p>She shuddered, rubbing against his hard erection as his elongated fangs pressed into her flesh.</p><p>\"Wait.\" He clamped his hands on her hips, holding her still as his lips kissed the tiny wounds on her throat. \"You aren't going to freak out once you're mine, are you?\"</p><p>She gave a lift of her brows as she trailed a finger over his chest. Once you're mine. The words should be terrifying.</p><p>Instead they were oddly erotic.</p><p>After twenty-five years of brutal isolation, where she'd been cut off from everyone and everything she cared about, she understood exactly the precious gift he was offering her.</p><p>Never again would she be afraid to open her heart to love.</p><p>\"I could ask you the same question.\" He hissed in pleasure as she scraped her claws lightly over his upper chest, dangerously close to breaking his skin.</p><p>\"This is all I've ever wanted, but you're still recovering.\"</p><p>\"My memories might still be fuzzy, but otherwise I'm recovered. The bastards tortured me by keeping me locked in the damned cage and using that collar to control my cat.\" She held his gaze. \"But they never touched me.\"</p><p>\"Fuck.\" His breath rasped through the air. \"I'm going to skin them alive for what they did to you. Hell, I've already promised myself I'd chop them into pieces and feed them to the gators. But, I was so afraid-\"</p><p>She nipped his bottom lip. \"I'm fine.</p><p>And I know what I want.\"</p><p>\"Good.\"</p><p>A moan was wrenched from her throat as he allowed his lips to travel over the curve of her breast, at last latching onto her aching nipple.</p><p>Her eyes squeezed shut as raw, undiluted pleasure raced through her.</p><p>The heat of his body. The rough stroke of his tongue. The silken brush of his hair against her chin.</p><p>She'd been starved of touch for so long.</p><p>Now she savored each touch, each caress as if it were her first.</p><p>\"Oh...god, yes.\"</p><p>He used the edge of his teeth to tease the very tip. \"You like that?\"</p><p>\"Harder,\" she whispered.</p><p>\"Like this?\"</p><p>He clamped down until her back arched in delight. \"Perfect.\"</p><p>\"You're perfect.\" His mouth moved to torment her other nipple, lapping and nipping until her fingers dug into his shoulders. \"Competent. Smart. Willing to kick ass when necessary.\"</p><p>She trembled, his soft words as much a turn-on as his skillful touch.</p><p>Oh hell, she was being burned alive.</p><p>Perhaps a more girly-girl would want the first time with her potential mate to be a slow, romantic seduction, but Keira had never been that sort of female.</p><p>She took what she wanted.</p><p>And she wanted Bayon with a force that threatened to overwhelm her.</p><p>As if sensing she was tumbling out of control, Bayon studied her with a gaze that made her heart skip a beat.</p><p>It was a gaze that spoke of need and lust and...sheer male possession.</p><p>Framing her face in his hands, he pulled her down to kiss her with an aching sweetness. Keira sighed. When she was younger she'd devoted endless hours to fantasizing about this man and his kisses, but nothing could have prepared her for the reality.</p><p>Her hands explored the corded muscles of his chest. His skin was warm, silken. The perfect temptation for her cat, and with a moan of need she gave in to the urge to spread kisses over his face before licking her way down the strong column of his throat.</p><p>\"I like the taste of you, Bayon,\" she whispered as she continued to tease him with tiny nips and nibbles</p><p>\"I'm supposed to be tasting you,\" he growled, his hands clutching her hips as he sought to retain control.</p><p>Such an alpha.</p><p>\"I'm on top this time, remember?\" she whispered, moving steadily lower.</p><p>\"I...oh hell, woman.\"</p><p>\"Do you want me to stop?\"</p><p>\"Keira,\" he rasped as she reached the rippling muscles of his lower stomach.</p><p>\"Mmm?\"</p><p>\"You stop and I'll never bring you back another greasy burger,\" he ground out.</p><p>\"Such a demanding kitty.\"</p><p>She gave a throaty chuckle,</p><p>deliberately rubbing her breasts against his rigid body as she kissed her way to the tip of his massive erection. They both gasped at the electric sparks ignited by the friction of their naked skin. Damn, but this felt good. Her claws flexed, pinning him to the ground as she took the broad head of his cock between her lips.</p><p>His shout of pleasure echoed through the caverns, the musk of his cat spicing the air. She stroked her tongue over the tip, lapping the bead of pre-come and purring at the taste of him. Yummy.</p><p>Widening her lips, she sucked him deeper into her mouth.</p><p>Bayon's hips arched upward, his breath hissing through his clenched teeth as she took her time to savor every impressive inch of him, scraping her teeth down the throbbing shaft before using her tongue to trace a thick vein back up to the tip.</p><p>\"Wait.\" He threaded his fingers through her hair as she took him deep enough to feel the head of him at the back of her throat. \"Christ, honey, I need to be inside you when I come.\" With a tantalizing lack of speed she lifted her head, freeing him from the suction of her mouth with an audible pop.</p><p>He cursed, tugging her by the hair to urge her up his body. Keira growled in glorious anticipation.</p><p>It'd been so long since she'd felt such stark, uncomplicated desire. Hell, she wasn't sure she'd ever felt this kind of need before. Her every nerve was buzzing with life, sensitized to the point that she thought she might combust.</p><p>\"Bossy and impatient,\" she murmured.</p><p>\"I was just getting started.\" Without warning he grasped her hips and jerked her into place, stealing her breath as the fierce jut of his cock settled in the damp heat between her legs.</p><p>She sighed, the persistent throb in her pussy rejoicing as the wide tip of him slipped just inside her body. But instead of shoving himself home, he clutched her hips and regarded her with smoldering eyes.</p><p>\"You can play all you want next time,\" he said in thick tones. \"But Keira, I've waited for you all my life,\" he rasped. \"I can't wait another second.\" God almighty, she was in trouble.</p><p>\"Bayon.\"</p><p>\"Now...my turn for some tasting,\" he informed her, drawing her toward his waiting lips. \"I want you begging before I'm done.\"</p><p>With a smile that held a wicked promise, Bayon branded her lips with a kiss of pure hunger. The taste of his cat on her tongue sizzled through her, setting off explosions of pleasure.</p><p>Then, spreading kisses over her face, he at last stroked his tongue down the length of her arched neck. Keira's fingers dug into his shoulders as he tugged her upward, catching the tender tip of her nipple between his teeth. She gave a soft purr as he nipped her sensitive flesh, her head tilted back at the insistent bliss darting through her. He turned his attention to the other breast, deliberately urging her desire to a fever pitch.</p><p>She needed to get him inside her.</p><p>Immediately.</p><p>But Bayon wasn't finished tormenting her. Even as she struggled to slide onto his waiting cock, he was ruthlessly tugging her up to her knees. She cursed, glancing down to watch his mouth explore the clenched muscles of her stomach, his tongue darting out to send a shiver of searing lust through her.</p><p>She moaned, her heavy lashes</p><p>lowering as his extended teeth scraped over the curve of her hip and down the inside of her thigh.</p><p>Okay, she'd let him play alpha. Just this once.</p><p>Then his seeking lips found her moist pussy and any logical thoughts were destroyed. Oh, this was so fucking good.</p><p>Barely remembering to breathe as his tongue stroked the highly sensitive flesh, she speared her fingers in the thick satin of his hair.</p><p>There was something a bit naughty about straddling him as he expertly tongued her, although she intended to become a whole lot naughtier before the day was over.</p><p>Still holding her hips, Bayon found her clit, gently sucking as the magical pressure began to build.</p><p>\"I knew there was a reason I called you honey,\" he rasped. \"You taste so sweet. Cream and honey, my favorite.\"</p><p>\"Oh god, Bayon, I'm close,\" she gasped.</p><p>\"Yes,\" he muttered, guiding her back so he could position her over his straining erection.</p><p>Then, slowly he penetrated her damp channel.</p><p>Keira purred as she pressed herself ever deeper. She'd known he was large.</p><p>Hell, she'd had him in her mouth. But she hadn't realized what it would mean to have that delectable hardness stretching her to the limit. Now she groaned in fierce approval. She could become addicted to the sensation of being speared by such a large cock.</p><p>Oh, yeah.</p><p>Size really did matter.</p><p>Spreading her knees, she allowed him to sink even deeper inside her, smiling with wicked satisfaction when he hissed in approval. She liked to reward excellence. And Bayon was truly a master at pleasing a demanding female.</p><p>Savoring his slow, steady pace, Keira at last placed her hands on his chest, holding his gaze that had gone cat-gold.</p><p>With one swipe, she deliberately allowed her claws to pierce his skin, marking him from his collarbone to just above his nipples.</p><p>His roar of shock shook the air, vibrating through her as her cat stretched toward her mate.</p><p>\"Mine,\" she breathed.</p><p>\"Mine,\" he panted. \"Forever.\" Lifting herself until the tip of his cock was nearly at her entrance, she sharply plummeted downward. His hips jerked off the ground, his snarl of pleasure sweet music to her ears.</p><p>Keira chuckled, euphoria at the sensation of being bound to this male bubbling through her like the finest champagne.</p><p>This cat meant to be hers for all eternity.</p><p>How could she ever have tried to push him away?</p><p>Refusing to dwell on how close she'd come to losing this strong, loyal, astonishingly compassionate man, she concentrated on the sensation of Bayon's deepening thrusts, her soft pants filling the air as her muscles clenched in preparation for her impending orgasm.</p><p>Bayon tightened his grip and buried his face in the curve of her neck. Then, still pumping into her at a furious pace, he sank his claws into her lower back, marking her at the same time he catapulted her into a shattering climax.</p><p>Keira quivered in ecstasy, convulsing around him as he gave one more thrust and cried out with the violent pleasure of his own orgasm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bayon wrapped Keira tightly in his arms as they sprawled beside the pool, lazing in the fading rays of sunlight that peeked through the narrow opening at the top of the waterfall.</p><p>Mate.</p><p>The word seeped into his soul, filling the empty void that had made him feel half alive for far too long.</p><p>This female completed him in a way that defied explanation.</p> <p>Nuzzling the soft skin of her temple, he sensed the instant her mind cleared of the sensual fog that had held her enthralled. Lifting her head, she eyed him with a guarded expression.</p><p>\"Well, that was-\"</p><p>\"Marvelous, stupendous, the best sex you've ever had?\" he helpfully supplied.</p><p>She licked her lips, sending a jolt of raw lust through him. He'd just had the best orgasm of his life, but his cock was already hardening for a second round.</p><p>\"Unexpected,\" she said.</p> <p>He frowned, a sudden stab of fear piercing his heart. \"You don't regret becoming my mate, do you?\"</p><p>Her brows lifted in genuine surprise.</p><p>\"God, no. It's something we should have done a long time ago.\"</p><p>\"Yes, it is,\" he muttered, relief searing away the knot of dread in the pit of his stomach. Keira had battled against their mating for so long he hadn't been entirely confident she might not bolt in horror when she realized she'd actually done the deed. \"So, what's bothering you?\"</p><p>\"I feel selfish.\"</p><p>\"Selfish?\"</p> <p>\"Our people are in danger.\" The emerald in her eyes darkened with concern. \"You should be out on the hunt for our enemies, not pandering to my needs.\"</p><p>His hand cupped her bare ass, pressing her against his thick shaft. \"I like pandering to your needs.\" She narrowed her eyes. \"Bayon.\" With a chuckle he kissed the tip of her nose. \"Trust me, Keira, everything possible is being done,\" he assured her.</p><p>\"When Talon has located a name or an address I'll return to the hunt.\" Her still-pale features tightened with a surge of emotion. \"I need to help.\" Bayon had known this moment was coming. Keira was too dominant to willingly remain in these caves.</p><p>\"Keira.\"</p><p>She stiffened, clearly preparing herself for his protest. \"What?\"</p><p>\"You're not ready.\"</p><p>\"Be careful.\" There was a golden flash of danger in her eyes. \"Just because we're mated doesn't mean you can start giving me orders.\"</p><p>The scent of angry female puma filled the air, but Bayon wasn't just another Hunter who relied on brute strength. His mother had taught him that keeping his prey off guard was always preferable to direct confrontation.</p> <p>It worked the same with a powerful woman.</p><p>\"I may be occasionally dense, but I'm not stupid,\" he assured her, his fingers absently trailing up the curve of her spine. \"I have no intention of giving you orders. I was trying to point out that until your full memory returns you're a liability.\"</p><p>She hissed at his blunt words, but even as her lips parted to inform him that he was a total jerk-wad she snapped them shut, grudgingly accepting he had a point.</p><p>\"You're right,\" she at last managed to rasp. \"We can't be sure what they did to me. I could be programmed to betray the very people I've sworn to protect.\" Bayon held her gaze. It might be shitty to use her loyalty to her people to keep her from charging after her kidnappers, but Bayon knew he'd have to use every trick he possessed to handle this female.</p><p>She was cunning, strong, and utterly independent, and she would walk all over him if he wasn't careful.</p><p>\"For now it's more important that you try to piece together how you were kidnapped,\" he murmured softly. \"That might lead us to someone who can give us info on the bastards.\"</p><p>With a sudden shove, Keira was out of his arms and seated on the edge of the pool with her arms wrapped around her knees.</p><p>\"I've tried,\" she muttered.</p><p>Taking care not to startle her, Bayon moved to sit beside her. He was painfully aware that while his mate was physically healed, there was still a part of her that was dangerously fragile.</p><p>\"Do you think they had a method of erasing your memories?\"</p><p>\"No.\" Her gaze was locked on the droplets of water that sparkled like diamonds, as if they held some clue to her missing memories. \"I think it's me.\"</p><p>\"You?\"</p><p>\"I think there's some reason I'm blocking the memory.\"</p><p>His gaze skimmed her fragile profile.</p><p>Keira's personality was so forceful it was easy to forget just how delicately she was built.</p><p>\"Then we wait until you're prepared to face it.\"</p><p>She gave a sharp shake of her head.</p><p>\"No.\"</p><p>He growled low in his throat.</p><p>Damned stubborn feline.</p><p>\"Keira-\"</p><p>She turned to meet his annoyed glare, her expression one of grim</p><p>determination. \"Listen to me.\" He didn't want to. He wanted to tell her that it was too dangerous. But one look into the shadows that lurked in her eyes and he knew that Keira didn't need a protector. Not now. She needed to know he would support her.</p><p>\"I'm listening,\" he said.</p><p>\"For the past twenty-five years I've been forced to feel helpless.\" She shuddered, the days of being locked in the cell still raw in her mind. \"It nearly destroyed me.\"</p><p>Bayon reached out to brush his fingers over her pale cheek, his heart squeezing with pain. Only a Pantera with Keira's mental strength could have survived.</p><p>\"I get it, honey, I really do.\" She grabbed his fingers and pressed them to her lips. \"Then you understand I can't just sit here waiting. I have to do something.\"</p><p>He grimaced. \"Do what?\"</p><p>\"I don't...\" She surged upright, her hands clenched at her side. \"Wait.\" Bayon straightened much more</p><p>slowly. \"I'm not going to like this, am I?\"</p><p>\"I want to retrace my steps.\" It took a second to understand what she was suggesting. \"You mean the night that you met with Sean?\"</p><p>\"Yes.\"</p><p>\"Why?\"</p><p>\"It might jog a memory.\"</p><p>He gave a slow nod. It wasn't a bad plan. And as much as he hated the thought of allowing this female to leave the protection of the caves, the memories she was suppressing might very well be necessary to tracking down their enemies.</p><p>\"It's been twenty-five years,\" he cautioned. She was desperate to feel as if she were actively involved in hunting those who had tortured her, but he didn't want her to get her hopes up too high.</p><p>\"The human world has changed.\" She tilted her chin to an angle that said 'don't screw with me.'</p><p>\"I have to try.\"</p><p>\"Fine.\" Strolling forward, Bayon grabbed her by the waist and tossed her over his shoulder. \"But first, a bath.\" She gave a startled squawk. \"What are you doing?\"</p><p>He waded into the water, smiling as he caught the scent of her rising arousal.</p><p>\"You're my mate.\"</p><p>\"Yeah, I got the memo.\" She reached around to rub the marks on her lower back that had healed to silvery lines.</p><p>\"It's time you take up your wifely duties,\" he informed her, reaching the middle of the pool and lowering her to her feet.</p><p>\"Really?\" Her stern expression was ruined by the sparkle of amusement in her golden eyes. \"And what wifely duties do you expect me to perform?\" He turned, the warm water lapping around his waist. \"You can begin with washing my back.\"</p><p>He heard her laugh before she was pouncing from behind and pushing his head under the water.</p><p>\"Or I could just drown you and find a mate to wash my back.\" His cat purred, relishing her playful response. This was the Keira from their childhood. The female who'd stolen his heart.</p><p>Underwater, Bayon flipped to swim between her spread legs, breaking the surface behind her.</p><p>Before she could turn, he pinned her arms to her side and hauled her against his bare chest. Then, with a growl he sank his teeth into the side of her neck.</p><p>\"Mmm.\" The taste of sweet female musk exploded on his tongue, and with one tilt of his hips he slid his cock deep into her welcoming heat. \"My wildcat.\"</p><p>Keira flexed her claws, digging them into the mossy ground beneath her paws as she stood at the entrance to the caves.</p><p>Standing so still she appeared a part of the shadows, she simply absorbed her surroundings. The damp breeze. The scent of rich earth and vegetation. The tangible tingle of magic that touched everything in the Wildlands.</p><p>Home.</p><p>This place wasn't just where she lived. It was a part of her that was as necessary as breathing.</p><p>Her brief moment of contentment was shattered by the distant scent of her brother as he headed toward the village.</p><p>Shit.</p><p>She battled back the surge of grief at their continued separation.</p><p>When Bayon had carried her into the Wildlands, she'd been panicked at the thought of meeting Pantera.</p><p>Any Pantera.</p><p>She had no explanation. Just a ruthless fear that refused to be dismissed.</p><p>Now she understood that her</p><p>continued reluctance to reveal herself to Parish had nothing to do with that strange sense of dread.</p><p>She'd adored her younger brother from the moment their mother had placed him in her arms. He'd been a quiet, intelligent baby with an intense stare that could intimidate grown men.</p><p>A born leader.</p><p>And a born protector.</p><p>He'd smother her with the need to keep her safe.</p><p>And she couldn't risk him trying to block her search for the truth.</p><p>Not when she sensed the very future of the Pantera might depend on her discovering why she'd been kidnapped.</p><p>A low roar that assured her the coast was clear thankfully intruded into her dark thoughts. Pausing long enough to make sure she was fully focused, Keira moved with a swift grace through the underbrush. She'd been the one to demand the opportunity to search the cabin where she'd been kidnapped. The last thing she wanted was to prove she wasn't prepared.</p><p>She joined Bayon, who was waiting for her across the nearest lily-clogged channel. Like her, he was in cat form, a beautiful golden creature with golden eyes swirled with pale green. She rubbed her head affectionately against his thick neck before turning to trot across the boggy ground.</p><p>They moved in silence, but Keira didn't need to hear Bayon telling her that he was frustrated as hell by her insistence on retracing her steps. The sharp-edged scent of his temper rolled off his body in fierce waves. Still, he was wise enough keep his opinion to himself, even when they reached the edge of the Wildlands and shifted back to human form.</p><p>They were both dressed in black jeans and black sweatshirts to blend into the night, and both had strapped small firearms to their upper thighs. They could easily kill with their bare hands, even when in their human forms, but they didn't know how she'd been</p><p>overpowered by mere humans.</p><p>A little extra firepower seemed a sensible precaution.</p><p>Heading directly north, Keira grimaced as they were forced to skirt around a large bog filled with brown sludge that smelled like rotting eggs.</p><p>Christ, how had the nasty quagmires that had started to form at the edges of the Wildlands over fifty years ago spread so far?</p><p>The realization spurred her to a faster pace. She had no idea if her kidnapping had any connection to the destruction of the marshland, but the sooner she and Bayon could track the bastards down, the sooner they could start beating the answers from them.</p><p>They'd traveled several miles before Bayon at last broke the silence. \"Where are we going?\"</p><p>\"It's not far.\" She glanced over her shoulder. \"Trouble keeping up?\" Despite his lingering frustration, he flashed a wicked grin. \"I like the view from behind.\"</p><p>Of course he did.</p><p>She shook her head, slowing until they were walking side by side. \"Tell me about your orphanage.\"</p><p>He looked embarrassed, clearly unused to discussing his generous gift to his mother and the human children.</p><p>\"It's not large. Only six to ten children at a time.\" He gave a dismissive shrug. \"Most of them need temporary shelter while their parents are in rehab.\"</p><p>They ducked beneath the low-hanging branches of cypress. \"They're fortunate to be in the care of your mother.\"</p><p>\"They are,\" he agreed without hesitation. \"She's a very special lady.\"</p><p>\"True. Of course, she spoiled you shamelessly.\"</p><p>He widened his eyes with faux innocence. \"Who could blame her?\" She chuckled, leaping along small islands to cross a wide channel. Once on relatively stable ground, she turned to watch Bayon as he moved with elegant beauty at her side, his gaze constantly searching for hidden enemies.</p><p>\"I always assumed you would prefer a woman who was more a Nurturer than a warrior,\" she abruptly admitted.</p><p>He turned his head to capture her gaze. \"I adore all women, but I always knew my mate would have more spice than sugar.\"</p><p>\"Really?\"</p><p>\"Oh yeah.\"</p><p>She sniffed at his smug male</p><p>expression. \"And how did you know that?\"</p><p>\"Because I'd met you.\"</p><p>She stumbled over a hidden branch, her heart slamming against her ribs at his simple, absolutely perfect explanation.</p><p>Damn but the cat knew how to make a woman melt.</p><p>\"You-\"</p><p>His brows lifted as she struggled for words. A once in a lifetime occurrence.</p><p>\"What?\" he prompted.</p><p>\"Astonish me,\" she said softly. She lifted her hand to touch his face, only to come to a sudden halt as she realized they'd reached a familiar gate that was now rusted and nearly hidden beneath a tangle of clinging ivy.</p><p>She frowned, studying the thick layer of moss and cow lilies that covered the ground. \"There was a path here.\" Bayon kicked the gate, watching it tumble to the ground. \"It looks abandoned.\"</p><p>\"I want to get closer.\"</p><p>He placed a hand on her shoulder, his expression tight with concern. \"Let me scout the area first.\"</p><p>She leaned forward to nip his bottom lip. \"You go left, I'll go right.\" He released a rough sigh before pressing a frustrated kiss to her lips.</p><p>\"Stubborn.\"</p><p>Yep. She was stubborn as hell. But she was beginning to realize that Bayon was the one man who possessed enough self-confidence to allow her to be powerful, while refusing to let her bully him.</p><p>The perfect combination.</p><p>With a short nod, he turned to melt into the shadows, his movements as silent as hers as they swiftly searched the dense foliage that surrounded the rapidly decaying cabin.</p><p>Finding no sign of recent activity, she returned to the front of the cabin, studying it with a growing sense of familiarity.</p><p>The tin roof was rusted, and the paint peeling from the wooden planks, but she had a vivid memory of the small wooden structure with its white shutters and shallow, wraparound porch.</p><p>\"It's clear,\" Bayon murmured as he moved to stand at her side, his brows drawing together at her obvious preoccupation. \"Keira?\"</p><p>\"I remember,\" she said softly.</p><p>\"Remember what?\"</p><p>\"Coming to this place.\"</p><p>She shivered as she had the mental image of walking up the once-cleared pathway, her mind distracted by thoughts of the next week's rotation of guards she'd been working on rather than her surroundings.</p><p>There hadn't been any premonition of danger.</p><p>Not until too late.</p><p>Another shudder racked her body, threatening to steal her fragile courage until a warm arm wrapped around her shoulders, tugging her against a solid male chest.</p><p>\"I'm here,\" he promised in low tones.</p><p>\"And I'm not going anywhere.\" Absorbing the strength he offered, Keira sucked in a deep, steadying breath and allowed the memories to flow through her mind.</p><p>\"I was early. I'd gotten Parish to cover my duties.\" Her head tilted back to study the thick canopy of trees that nearly blocked out the sky. \"The moonlight was just beginning to peek through the leaves as I walked up the steps.\"</p><p>Still holding her tight, Bayon led her up the sagging steps, his gaze scanning the darkness for hidden dangers.</p><p>\"Did you smell anything?\" he asked.</p><p>\"Yes.\" She gave a sharp nod.</p><p>\"Humans. But that wasn't unexpected.</p><p>The cabin was used by the local gator hunters.\" Her nose flared as she abruptly recalled the weird, sour scent that had surrounded the cabin. \"And the same stench I'd caught on Sean the night before.\"</p><p>They stepped past the door that had rotted off its hinges and into the cramped kitchen. Bayon frowned as he moved across the floor to study the interior of the cabin. There wasn't much to see. On one wall was a row of rotting cabinets that hung at a drunken angle. Below the cabinets was a short countertop that was chipped and covered in layers of dust with a sink at the end. On the other side was a sofa and chair that had been invaded by a growing population of rodents. In the middle was a kitchen table, and at the far back a door opened to a bedroom that was barely big enough for a narrow cot.</p><p>Bayon turned back to stab her with a narrowed gaze. \"Show me where he was waiting.\"</p><p>Keira pointed toward a spot directly in front of the empty doorjamb. \"Here.\"</p><p>\"That close to the door?\" he pressed.</p><p>She paused, shuffling through her memories. She'd walked across the porch and yanked open the door. She'd been startled to discover Sean standing directly in her path.</p><p>\"Yes.\"</p><p>\"Why?\"</p><p>She frowned at her mate's</p><p>persistence. \"I don't understand.\"</p><p>\"He wasn't expecting you until later.\" Bayon waved a hand around the cramped interior of the cabin. \"Why was he standing at the door? Did he hear you arriving?\"</p><p>Oh. Keira paced the floor, struggling to clear away the murkiness that made it nearly impossible to recall exactly what had happened. The door had opened, and Sean had been standing there...</p><p>Wait. He hadn't just been standing there, he'd been pressing against the door.</p><p>\"He tried to keep me out,\" she muttered.</p><p>\"Because there was something he didn't want you to see?\"</p><p>She continued to pace, her heart suddenly lodged in her throat, and her palms damp with sweat as she pressed past the fog in her mind.</p><p>Yes. She'd shoved open the door and then forced her way past Sean, more annoyed than worried by his strange behavior. And then...</p><p>Then she'd been overwhelmed by the strange smell. It'd assaulted her nose until she'd nearly vomited.</p><p>That was when the back door had opened and two men and a woman had stepped from the bedroom.</p><p>One male had been a human. He was large, with a bald head and a tattoo of a raven in front of a full moon on his neck.</p><p>But the other two...</p><p>She hissed in pain, dropping to her knees as the memory slammed through her.</p><p>\"No. Not something,\" she forced past her gritted teeth. \"Someone.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bayon crouched down, wrapping his arms around his mate's trembling body.</p><p>\"Keira, are you hurt?\"</p><p>With an obvious effort, she lifted her head to reveal her too-pale face and golden eyes dark with some inner torment.</p><p>\"Pantera,\" she managed to rasp.</p> <p>\"What?\"</p><p>\"There was another human here with Sean,\" she said, shivering as she struggled to share the memory that had clearly traumatized her. \"And two Pantera.\"</p><p>Bayon frowned. \"They were being held hostage?\"</p><p>She slowly shook her head. \"No.\"</p><p>\"They weren't...\" He grimaced.</p> <p>\"Dead?\"</p><p>\"They were alive,\" she assured him.</p><p>There was a pause before she managed to spit out the words. \"And working for the humans.\"</p><p>Bayon sucked in a startled breath, his cat roaring in protest. For over fifty years the Pantera had been battling an unseen enemy, but never once had they considered the possibility that the rot might be coming from within the Wildlands.</p><p>\"Shit.\"</p><p>\"It was the Pantera who overpowered me,\" Keira said, her eyes as dull and bleak as when he'd first found her in the cage.</p> <p>\"Traitors,\" he growled in disgust, inwardly promising to destroy the bastards who'd been willing to torture one of their own people for personal gain. \"Did you recognize them?\"</p><p>\"Vincent and his mate, Savoy.\" It took a second for Bayon to place the names. Then he made a sound of surprise as he recalled that the two Pantera had worked with his mother.</p><p>\"They're both Nurturers, aren't they?\" Her jaw tightened. \"Yes.\"</p><p>\"This makes no sense,\" he muttered.</p><p>The two were gentle creatures who'd devoted their lives to caring for the Pantera young. \"Why would they join with our enemies?\"</p><p>With a sudden surge, Keira</p><p>straightened and turned toward the door.</p><p>\"I intend to ask them.\"</p> <p>He grabbed her arm. \"Wait, Keira.\" She glared at him in frustration. \"I've waited twenty-five years.\"</p><p>\"I know, honey,\" he soothed, his fingers brushing her pale cheek. \"But if they see you then they're going to bolt.</p><p>We need to have Parish arrange enough Hunters to take them into custody without the chance of them escaping.\" His expression hardened. \"Or hurting someone else.\"</p><p>She blew out an exasperated sigh.</p><p>\"You're right.\"</p><p>Her immediate ability to put her personal lust for vengeance aside for the benefit of protecting her people was only one of the reasons that this female had been such an effective leader.</p><p>\"I'll have to reveal that you're alive,\" Bayon warned, pulling his cell phone from his front pocket? \"Are you ready?\" There was only a brief hesitation before she was giving a firm nod of her head. \"It's time.\"</p><p>\"Okay.\"</p><p>He punched the number on his speed dial, but before Parish could answer Keira was gently taking the phone from his hand, a rueful smile curving her lips.</p><p>\"Let me.\"</p><p>He lifted a startled brow. \"You know how to use it?\"</p><p>She shrugged. \"I've seen my idiot captors using them. How hard can it be?\"</p><p>\"I'm not going to fight you for the privilege,\" he assured her. They both knew that Parish was going to kick his ass for not immediately informing him that his beloved sister was alive.</p><p>\"Wait here.\"</p><p>She left the cabin and was halfway down the path when Bayon heard Parish answer his phone. He grimaced as the male Pantera's tone transformed from impatience to shocked disbelief to a joy so pure it made Bayon's heart twist with regret that he'd forced the male to suffer even one second longer than necessary.</p><p>\"Christ, he's going to fucking kill me,\" he muttered, watching as Keira ended the call and then gestured for him to join her.</p><p>\"Let's go,\" she urged, her earlier anguish replaced by a fierce impatience to confront her kidnappers.</p><p>He was swiftly at her side. They jogged down the overgrown path and leaped over the fallen gate.</p><p>\"He's going to capture the traitors?\"</p><p>\"He's already on the hunt. He'll meet us at the Den,\" she said.</p><p>Bayon was momentarily puzzled before he realized that Parish wouldn't want anyone to know they'd discovered traitors among the Pantera, at least not until they could be certain there weren't any others.</p><p>And there was the added benefit that the prisoners couldn't shift while away from the Wildlands. They were far less dangerous in human form than in puma.</p><p>They headed directly for La Pierre, skirting the edges of the Wildlands.</p><p>Bayon kept a careful watch on their surroundings, prepared to attack anything or anyone who lurked in the shadows.</p><p>For the moment, he had to assume everyone was an enemy.</p><p>Even a Pantera.</p><p>It was a realization that wounded the heart of his cat.</p><p>\"At least a couple questions have been answered,\" he muttered.</p><p>Keira ducked beneath a low-hanging branch before glancing in his direction.</p><p>\"What are you talking about?\"</p><p>\"I now know how the enemy entered the Wildlands undetected, and how they found Ashe so easily.\"</p><p>\"And why my mind was so reluctant to remember what happened,\" she snarled. \"I could accept the treachery of humans, but not Pantera.\"</p><p>Bayon shook his head, hating the knowledge that they would have to eventually reveal the betrayal of Vincent and Savoy to the rest of their people. A damned shame. It was destined to destroy the trust they'd always had in one another. At least until the danger had passed.</p><p>Whether it could ever be rebuilt was something that was in the hands of fate.</p><p>\"I'm not sure any of us will be able to accept that we could be betrayed by our own people,\" Bayon muttered.</p><p>They slowed their pace as they reached the edge of the swamp and stepped onto the road that marked the edge of the town. Ahead of them the neon sign hung outside The Cougar's Den, but even as they stepped toward the wooden building built on heavy stilts, a dark-haired man was sprinting across the road and wrapping Keira in a smothering hug.</p><p>\"Keira,\" Parish breathed, glaring at Bayon over her shoulder. \"You, I will deal with later.\"</p><p>Keira smiled, despite the fact that she was being clenched hard enough to crush the breath from her lungs.</p><p>She was surrounded in the heat and scent of family, her cat purring in bone-deep satisfaction.</p><p>\"Are you real?\" Parish asked, his voice thick with emotion.</p><p>She rested her head on the solid width of his chest. \"I'm real.\"</p><p>\"I've dreamed of this moment a thousand times only to wake and find that you were still gone. Goddamn, I've been so alone.\"</p><p>\"Not so alone anymore.\" She lifted her head with a smile. \"I hear you've mated.\"</p><p>His bleak features abruptly softened with blatant adoration. Keira would never have believed it of her brother if she hadn't seen it for herself.</p><p>\"My Julia. She completes me.\"</p><p>\"I get that,\" Keira agreed, glancing toward Bayon, who had stepped away to give them privacy for their reunion. A low growl had her sharply turning back toward her brother. \"Don't start,\" she warned, her eyes narrowed.</p><p>Parish gave a bark of laughter as she slipped back into her role as older sister, unwilling to take shit from her brother even if he did have several inches and a hundred pounds on her.</p><p>\"Keira,\" he growled. \"I've missed you.\"</p><p>\"Brother,\" she breathed before forcing herself out of his arms and glancing toward Bayon.</p><p>Later they would have a proper reunion. Now they had to concentrate on protecting their people.</p><p>Moving to her side, Bayon regarded Parish with a grim expression. \"Do you have the traitors?\"</p><p>Parish jerked his head toward the building. \"Inside.\"</p><p>\"Are they still alive?\" Keira demanded.</p><p>A humorless smile stretched Parish's lips, the promise of death in his eyes.</p><p>\"For now.\"</p><p>\"Good.\" Keira headed for the back steps of the building, her murderous fury heating the air. \"I want some answers.\"</p><p>\"Keira.\"</p><p>She ignored her brother, taking the steps two at a time.</p><p>\"You're wasting your breath,\" Bayon murmured before he was jogging to catch up with her.</p><p>A portion of her tension eased as he lightly placed a hand at her lower back.</p><p>Just having Bayon near returned the courage she'd feared had been stripped from her twenty-five years ago. A steel door opened and a male Pantera offered her a slow nod of respect before escorting them into a secret chamber hidden behind the shelves of the storage room.</p><p>None of the humans drinking in the front bar had any idea there were meeting rooms, a high-tech surveillance room, and two large guest rooms for Pantera separated from them by a sound-proofed wall.</p><p>They found Vincent and Savoy on their knees, both stripped naked with iron shackles around their wrists and ankles.</p><p>The two Pantera were both older than Keira. Vincent was built on solid lines with brown hair and dark gold eyes while Savoy was a tiny female with reddish hair and eyes the color of spring grass.</p><p>Standing behind them, Talon held a gun toward the back of their heads, despite the prisoners' mutual appearance of utter resignation.</p><p>No one was taking chances.</p><p>Talon, who had still been in training when Keira had been kidnapped, straightened his shoulders and snapped a salute.</p><p>\"Welcome home, commander.\"</p><p>\"Just Keira now,\" she insisted, glancing toward her brother who entered the room to hold his loaded gun at the prisoners. \"I'm absolutely confident that Parish has done a brilliant job and I intend to concentrate on tracking down the son of bitches who kidnapped me.\" Her attention turned toward the kneeling Pantera. \"Starting with these two.\"</p><p>\"They're all yours,\" Talon murmured, taking a step back.</p><p>Vincent slowly lifted his head, his face gaunt and his eyes shadowed with guilt. \"Please, forgive us.\"</p><p>Parish made a sound of disgust, but Keira leaned forward, needing answers.</p><p>\"I want to know why.\"</p><p>\"We didn't know-\"</p><p>\"Stop,\" Keira snarled. \"I don't want excuses, I want answers.\"</p><p>Vincent licked his lips, glancing toward his cowering mate. \"Savoy was one of the first females to fail in becoming pregnant. It was...\" He halted to swallow the lump in his throat.</p><p>\"Difficult.\"</p><p>\"I tried everything,\" Savoy timidly offered, her once beautiful face lined with regret. \"The old herbal remedies, human drugs, even artificial</p><p>insemination when it became available, but nothing worked. At last I went to see a voodoo priestess in New Orleans.\" Keira narrowed her gaze. \"And she told you to kidnap me?\"</p><p>Savoy shook her head. \"No. She promised she had a potion that could ensure my fertility, but only if we agreed to help her people.\"</p><p>Bayon pulled a dagger from the sheath at his lower back, running a finger along the lethal edge.</p><p>\"What people?\" Bayon demanded.</p><p>Vincent curled his lips in disgust.</p><p>\"They were humans.\"</p><p>Bayon continued to stroke his finger along the dagger's blade. \"What help did they demand?\"</p><p>Sweat beaded Vincent's face. \"They wanted to study the Wildlands.\" Keira scowled. \"What?\"</p><p>Vincent grimaced. \"They said that they were ecologists who were afraid that there was some disease that was attacking our homelands. They were certain they could help if they had access to study the places where the magic was still strong.\"</p><p>Bayon snorted. \"And you believed them?\"</p><p>\"Yes,\" Savoy breathed, tears in her eyes.</p><p>Keira folded her arms over her chest, in no mood to offer sympathy. Maybe they'd been driven to desperation at their inability to conceive. Nurturers had an inbred need to care for others. But unlike Bayon's mother, who'd devoted herself to human children who needed her love, they'd thought of no one but themselves.</p><p>She didn't believe for a minute that they hadn't been well aware they were putting the Wildlands at risk.</p><p>\"Then why keep it a secret?\" she snapped.</p><p>Vincent flinched. \"They said they'd approached the elders with an offer of assistance only to be denied because of the elders' belief that humans are inferior to Pantera.\"</p><p>Bayon's low growl vibrated through the air. \"So you brought them through the borders and allowed them access to our deepest secrets and vulnerabilities?\"</p><p>\"We thought they wanted to help,\" Savoy said.</p><p>Keira grabbed the woman's chin, forcing Savoy to meet her gaze that burned with the memory of twenty-five years of hell.</p><p>\"No,\" she ground out. \"You allowed your own selfish desire for a child to blind you to your betrayal.\"</p><p>Tears streamed down the female's pale face. \"I'm so sorry.\"</p><p>Abruptly dropping her hand, Keira straightened. Beating them to a bloody pulp wouldn't give them the answers they needed.</p><p>Unfortunately.</p><p>\"What else did you do for the bastards?\" she demanded.</p><p>\"Nothing. I swear,\" Vincent said, clearly trying to draw her attention away from his sobbing mate. \"When we didn't conceive we were determined to break our agreement with the priestess. She sent us a message to meet with her at the cabin, but there were human males there who threatened to expose us if we didn't keep our promise. Then-\"</p><p>\"Then Keira appeared and we</p><p>panicked,\" Savoy finished for him.</p><p>\"We only meant to disable you long enough for us to escape.\" Vincent held Keira's gaze, silently pleading for her understanding. Yeah. When hell froze over. \"But the humans put a metal collar around your neck and told us that they'd kill you if we didn't continue to bring them into the Wildlands.\"</p><p>Parish stepped forward, his anger a tangible force in the air. \"You should have come to me.\"</p><p>\"We couldn't,\" Vincent insisted.</p><p>\"They swore that as long as we did as we were told that Keira wouldn't be hurt. Otherwise-\"</p><p>Keira made a sound of disgust. \"And you just trusted their word?\"</p><p>\"Of course not.\" Savoy licked her dry lips. \"They sent us pictures of you each week. They claimed it was to prove you were still alive, but we always understood that it was a warning that you were still in their clutches and that your life depended on us fulfilling our end of the bargain.\"</p><p>There was an explosion of curses from Bayon and Parish, but Keira kept her attention focused like a laser on the traitors.</p><p>\"Even if you knew I was alive, you couldn't have possibly known they weren't torturing me.\"</p><p>Vincent cleared his throat. \"The collar.\"</p><p>Keira scowled at him in confusion.</p><p>\"What about it?\"</p><p>\"I had a chance to study it while we were in the cabin,\" he admitted in a strained voice. \"It was made of an unfamiliar metal alloy, but I could detect a magically-enhanced toxin coating the inside of the collar.\"</p><p>Shit. Bayon's suspicions had been right. There was something about the collar that had been poisoning her.</p><p>\"That doesn't explain why you assumed I wasn't being abused.\"</p><p>\"The toxin was potent enough to cripple you, which meant it would be lethal to a human. Even touching your skin would have made them extremely ill.\"</p><p>Keira grimaced. Now she understood why they'd gone to such trouble to avoid all physical contact. Even when they took her to the bathroom, they'd kept their distance, using the electrical shocks to warn her of the dangers of trying to escape.</p><p>And, of course, they couldn't risk removing the collar. Not when they couldn't know for certain how swiftly her strength would return.</p><p>Not until they were ready to kill her.</p><p>She shied away from the thought that the nasty Roger might have been contemplating raping her dead body.</p><p>She shuddered. She had no</p><p>forgiveness for the two traitors. Not when they'd left her at the mercy of those animals.</p><p>\"They might not have raped me, or beat me with their fists, but they tortured me every day I was in that cage.\" Vincent lowered his gaze. \"I'm sorry.\"</p><p>Feeling her tremble, Bayon stepped close enough to wrap her in the comforting scent of his cat.</p><p>\"Did you ever watch to see what they were doing?\" he demanded of the two.</p><p>Vincent gave a slow shake of his head, his shoulders slumped in defeat.</p><p>\"They claimed they were taking samples, but I fear they were performing some dark ritual.\"</p><p>\"They have to be the ones causing our homelands to rot,\" Parish growled, his gun pointed directly between Vincent's eyes. At that short distance it would be a lethal shot. \"Did you tell them of Ashe's pregnancy?\"</p><p>Savoy made a low sound of distress.</p><p>\"No, they already knew.\"</p><p>\"But you told them where she would be?\" the Hunter persisted.</p><p>Vincent gave a jerk of his head.</p><p>\"Yes.\"</p><p>\"Fuck.\"</p><p>Keira lightly grabbed Parish's wrist, keeping him from squeezing the trigger.</p><p>They were all battling against the primal lust for revenge. For now they had to put the welfare of the Pantera ahead of vengeance.</p><p>She held Vincent's wary gaze. \"How many other traitors are there?\" The older Pantera frowned at the question. \"None that I know of.\" Talon slapped the back of his head.</p><p>\"The truth.\"</p><p>\"That is the truth,\" Vincent rasped, a spark of gold smoldering in his dull eyes. His cat might be cowed, but it wasn't dead. \"We never spoke of our bargain with any other Pantera.\"</p><p>\"Shit.\" Bayon exchanged a frustrated glance with Keira. \"There could be a dozen and we would never know.\"</p><p>\"There's a way,\" Savoy said in soft tones.</p><p>\"Tell me,\" Keira commanded.</p><p>\"The priestess demanded that we be marked to prove our loyalty,\" the older female admitted.</p><p>Keira lifted her brows. \"What mark?\"</p><p>\"The soles of our feet.\"</p><p>Together Keira, Bayon and Parish moved to stand beside Talon, all of them studying the outline of a raven that had been branded onto the meaty flesh of their heels.</p><p>Keira shuddered. It wasn't the full Mark of Shakpi, but Vincent and Savoy should have suspected that it represented their ancient enemy.</p><p>Parish sent her a questioning glance, clearly asking permission to take control. She gave a discrete nod. She hadn't just been trying to avoid confusion among the Hunters as to who was their leader when she said she was happy to let Parish remain in his position of authority.</p><p>It would take her time to fully recover from her years of being held captive by the humans. And just as importantly, she was determined to track down every bastard who'd been responsible for attacking their homeland and make them suffer.</p><p>\"Talon, you need to find a way to begin searching for that mark without letting anyone know what you're doing,\" Parish commanded the younger male Pantera.</p><p>\"Are you shitting me?\" Talon</p><p>protested. \"I can't start randomly inspecting people for a brand without making them suspicious.\"</p><p>\"Just do it.\"</p><p>\"Christ.\"</p><p>Talon rolled his eyes, but obediently headed toward the doors. Keira was one of the very few who'd ever been a match for Parish when he was in full commando-mode.</p><p>Vincent cautiously reached out to take his mate's hand. \"What will you do to us?\"</p><p>Parish nodded a head in her direction.</p><p>\"Keira, it's your choice.\"</p><p>She shrugged, the brutal need for revenge fading beneath the sight of Savoy's cowering body.</p><p>The two would have to be punished; maybe they would even be condemned to death. But that was something that would be decided after the danger to the Pantera had been effectively destroyed.</p><p>\"Take them to the elders,\" she ordered.</p><p>Parish arched a dark brow. \"No one would blame you if you want to-\"</p><p>\"No.\" She leaned against Bayon, absorbing his strength as her knees threatened to collapse. It was going to take a few days for her to fully regain her strength. Until then, she had utter faith she could depend on her mate. It was a knowledge that banished the last of her bitterness. The past was the past.</p><p>It was her future with Bayon, and the future of her people, that mattered. \"Just before Bayon arrived, one of my captors let slip the fact that my time in the cage was coming to an end. He believed that whatever they were plotting was about to happen. And that they were going to succeed.\"</p><p>Bayon rubbed a comforting hand on her lower back. \"They never gave a hint what that plot might entail?\"</p><p>\"No.\" She pointed toward the traitors.</p><p>\"But they might have information we need.\"</p><p>\"Fine.\" Parish gave a grudging nod, his lust for blood still lurking in his golden eyes. Shoving the gun into the holster at his waist, he reached to grab the two kneeling traitors by their hair and jerked them to their feet. \"Let's go.\" She watched as her brother hauled Vincent and Savoy from the room before snuggling against Bayon's chest, breathing deeply of his familiar scent.</p><p>\"Are you all right?\" he asked, wrapping his arms around her as he laid his cheek on top of her head.</p><p>She smiled, kissing the strong column of his neck. \"I will be, once we have answers.\"</p><p>\"We will,\" he said without hesitation.</p><p>\"The Pantera are nothing if not stubborn creatures.\"</p><p>\"True,\" she agreed.</p><p>For now, a shadow continued to hang over the Wildlands, but she fiercely held onto the belief that someday soon they would defeat their mysterious enemies and the magic would once again heal their land.</p><p>And their people.</p><p>Bayon rubbed his cheek against her hair. \"Can we go home now?\"</p><p>She planted another kiss on his neck, needing to be alone with her mate. \"The caves?\"</p><p>\"Actually I thought you might stay with me.\" He lifted his head to study her weary face. \"At least until we can decide where we want to live.\" Her hand pressed against his cheek, her gaze drinking in his male beauty.</p><p>She'd been an idiot to ever doubt her ability to be with an alpha male. Bayon didn't threaten her independence.</p><p>He only made her stronger.</p><p>\"I don't care where we go as long as we're together.\"</p><p>His eyes held a love she felt to the very depths of her soul.</p><p>\"For all of eternity, honey.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>By Laura Wright</p><p>Chapter 1</p><p>The Suit looked like shit.</p><p>Jean-Baptiste stood with his back to the window of the Medical facility, and watched the blond male pace back and forth in front of a large cypress. The leader of the Diplomatic Faction had always given off a controlled, unruffled vibe, but as the sun died around them in a glow of pale orange fire, Raphael's true state of mind was revealed. His clothes were wrinkled and hanging off his tall, lean body. The skin on his face was pulled tight over the bone, his eyes looked exhausted and sunken and desperate, and his hands were clenching and unclenching as he stalked from one end of the lawn to the other.</p> <p>\"You need to release your cat, Raphael,\" Jean-Baptiste said, the irony of his words clawing at his guts, while the Nurturer inside of him-the one who was an expert on mental issues for the Pantera-pressed on. \"When our minds grow weary with stress, our cats are trained to take over, give our human side a break. It's how we survive, how we're built.\"</p><p>\"Can't,\" Raphael muttered.</p><p>\"I get that you want to guard your mate, but your cat can be just as effective.\"</p><p>Raphael just shook his head.</p><p>Damned stubborn shifter. It seemed to be a personality flaw all Pantera males suffered from. \"You won't be able to remain in your human form the entire pregnancy without losing it.\"</p> <p>\"You don't understand.\" The words were curt, and flung at Baptiste like they were coated in alligator dung.</p><p>Jean-Baptiste didn't have a female-</p><p>and it was looking more and more like he never would-but he knew how puma males were when something was wrong with their mate. The levels of crazy ranged from \"manageable\" to \"batshit.\" But for Raphael, and what he was dealing with, it might very well be</p><p>\"rocket ship to the moon\" time. His mate, Ashe, carried the fate of the Pantera within her womb, and if she had truly been attacked inside the Wildlands as Bayon had claimed...</p><p>A low growl erupted from Jean-Baptiste's throat, but he shut it down instantly. The last thing he needed right now was to allow his cat even one claw out of its cage. Even if it was to sniff out the bastard who'd had the balls to touch a Pantera's pregnant mate on Wildlands soil. But the fantasy of catching and carving a long and deep \"P\" across the intruder's chest was the kind of revenge Baptiste and his cat were hungry for.</p><p>\"Bayon tell you what I want?\" Raphael asked, his voice stripped of emotion as a breeze kicked up off the bayou, rustling the Spanish moss coating the Cypress.</p> <p>Baptiste nodded. \"Wish I could help.\"</p><p>\"You can.\"</p><p>\"Sorry, mon ami.\" I've got problems of my own to deal with.</p><p>\"This isn't a request, Baptiste.\"</p><p>\"Maybe you're forgetting, Raphael, I'm not Diplomatic Faction.\"</p><p>\"I don't forget. Anything.\"</p><p>\"Then you know I don't report to you.\"</p><p>\"True.\" Raphael stopped pacing and turned to glare at Jean-Baptiste. \"But what I'm proposing isn't exactly official Pantera business.\"</p> <p>Baptiste's brows shot together, and the skin on his neck, where he'd gotten inked a few days ago, started to burn.</p><p>\"In fact,\" Raphael said, his voice dropping as his gaze checked right and left for Pantera in the area. \"I don't think either one of us would want it to be.\" The urge to spring at the male, drop his frail-looking ass to the ground, ripped through Jean-Baptiste. But he'd grown used to the feral cat inside of him, and he forced patience into his already sour gut.</p><p>\"I know you've been dealt a handful here,\" he said coolly. \"I respect that.</p><p>Hell, I'm as concerned about what's happening with Ashe as any Pantera.</p><p>Maybe even more so. I'm a Nurturer after all.\" He heard the bitter note in his own voice. \"But I don't have time to travel-\"</p><p>\"Why? Because you just got back?\" A flash of alarm moved through Jean-Baptiste, and he eased away from the window and started toward the male. He never talked with anyone about his personal trips into New Orleans. The fact that the leader of the Suits knew something like this was alarming at best.</p><p>\"Was it a new piercing?\" Raphael said, standing his ground as the male drew near. \"Or did you get inked again?\"</p><p>Baptiste's jaw tensed. Play it off, Shifter. Don't let him see one shred of your unease. \"Didn't know there was a problem with a puma who appreciates body art,\" he said with a casual shrug.</p><p>\"Not the art. But...maybe the reason behind it?\" Raphael's nostrils flared, and once again he checked to see if they had an audience. When he found the lawn behind Medical deserted, he turned back to Jean-Baptiste, his voice low. \"I know about your little problem.\" Nostrils flared, Baptiste stopped a foot from the Suit. Inside his body, his cat screamed and clawed to get out. It wanted to attack. It wanted to rip the voice box from the male standing before it with all kinds of accusations swimming in his green eyes. But the only thing Jean-Baptiste allowed the feline to display was a cool, confused purr. \"No clue what you're talking about, mon ami.\"</p><p>Undeterred, Raphael continued as though he hadn't heard anything at all.</p><p>\"Just don't know how it started. Or when. Few weeks ago? A month?\" His eyes locked with Jean-Baptiste.</p><p>\"Considering how many tats and holes you have in that body of yours I'd say you've been trying to push down the fact that you have no control over your cat for some time now.\"</p><p>The words sank so deep Jean-</p><p>Baptiste didn't have time to suppress his animal's reaction. With a terrifying growl, he grabbed the male's shoulders and rushed him like a linebacker. \"Who the fuck told you?\" he snarled, saliva forming in his mouth as Raphael's back hit the trunk of the cypress.</p><p>\"Perks of being a Suit,\" Raphael said through gritted teeth, his green eyes flashing gold fire. \"I have connections outside the Wildlands. That piercing there,\" he jerked his chin forward,</p><p>\"through your eyebrow-the one coated in malachite-well, it was done by the brother of one of my spies' girlfriends.\" Baptiste's eyebrow twitched. So did his lower lip-the one with the twin silver rings through it. He'd been betrayed. By a foolish, foolish soon-to-be dead human male. He forced a dark laugh. The sound was hollow. \"Proves nothing.\"</p><p>\"I don't think so,\" Raphael said.</p><p>\"Malachite is inside every tattoo and piercing you have.\"</p><p>He was going to cut the tongue out of that human before he killed him. \"I like the mineral, that's all,\" he said. \"It helps me to heal faster.\"</p><p>Raphael sniffed, his expression glib.</p><p>\"I'm sure it does. But it's also the very mineral that's purported to ground a cat inside the body. The elders use it as punishment to cage a wild puma.\" Raphael's gaze narrowed. \"And I hear the Nurturer shrinks also use it on patients who can't control their mind or their feline.\"</p><p>Dead, fetid air sat inside Jean-Baptiste's lungs as he gripped the male's shoulders. Every inch of his skin had gone tight around the muscles and bones, and his canines and claws were starting to emerge. The desperate need to kill this male, end his questioning, his accusations, his impossible truth, was almost unbearable. So he did the only thing he could do.</p><p>He released Raphael and walked away.</p><p>\"Any other time and I'd be all about helping your ass,\" Raphael called at his back. \"But today my one and only concern is my mate.\"</p><p>Stopping at the window, Jean-</p><p>Baptiste stared through the glass at that mate. Ashe. She was completely still, lying in the bed, and she looked as pale as a frog's belly.</p><p>\"Go to that voodoun you visit,\" Raphael called to him. \"The one who recommended the malachite and every tattoo that's on your body, and bring her here.\"</p><p>Fucking loose-tongued human better enjoy his last few days of breathing.</p><p>Baptiste didn't turn around.</p><p>\"Impossible.\"</p><p>\"Make it possible.\"</p><p>\"She won't come. She's terrified of the magic of the Wildlands.\"</p><p>\"You'll make her come. Because if you don't, the Pantera-starting with the elders-will know your secret.\"</p><p>\"Blackmail,\" Baptiste uttered coldly.</p><p>He glanced over his shoulder at the Suit.</p><p>\"You've fallen pretty damn far down the well, Raphael.\"</p><p>The male's eyes blazed gold fire. \"I'd fall on a fucking blade for my Ashe and our cub.\"</p><p>Jean-Baptiste stared at him, let the words and their weight sink in as the sun sank into the calm waters of the bayou beyond. The air around them crackled with tension and heat. They couldn't remain here, speaking like this for much longer. Soon the Pantera would be out, their cats playing after sharing meals with their families or Factions.</p><p>\"Why do you need the voodoun?\" Jean-Baptiste asked. \"You have the human doctor. Or was the attack more serious than Bayon let on?\"</p><p>If it was possible, Raphael's skin pulled even tighter over his bones, and his eyes grew dark with fear and rage.</p><p>\"Ashe was injected with something.</p><p>She's not conscious, and she's been...</p><p>taken over by...I don't know...\"</p><p>\"What?\" Jean-Baptiste asked.</p><p>Raphael shook his head. \"Some kind of dark force.\"</p><p>Holy shit. \"A possession?\"</p><p>\"We don't know.\" The Suit's voice broke. \"We don't know.\"</p><p>\"And the cub...?\"</p><p>\"The cub has a strong heartbeat.</p><p>That's all they know.\"</p><p>Jean-Baptiste exhaled on a curse, ran a hand through his hair. He was surprised at the sudden and deep concern he and his cat felt for the new and important life inside Raphael's mate. And yet, despite the hell he was experiencing as of late, he was first and foremost a Pantera. He wanted his kind to survive more than he wanted his next breath.</p><p>\"What the hell is happening to us?\" he whispered blackly. \"The Wildlands, the pumas, the magic?\" His question wasn't meant for Raphael, for anyone in particular, but the male answered it anyway.</p><p>\"I don't know. But it's growing worse.\"</p><p>Jean-Baptiste turned to face the male.</p><p>\"The borders aren't holding.\"</p><p>\"We must act, Baptiste.\"</p><p>\"I'll go tonight. But I will have your word, what we've said here tonight is never mentioned again.\"</p><p>Raphael nodded. \"Done.\"</p><p>\"I'll report back if there's a problem.</p><p>Otherwise, I'll see you in the a.m.\" Jean-Baptiste started to walk away, but Raphael called him back.</p><p>\"One more thing.\"</p><p>Turning, Jean-Baptiste hissed at the Suit. \"Trying to keep my cat caged here, and it's not your biggest fan right now.\"</p><p>\"You're not going alone.\"</p><p>\"Come again?\"</p><p>\"I'm sending a Suit with you.\" Baptiste shook his head. \"No. I do this alone or not at all.\"</p><p>\"I need to have backup there, a top negotiator, in case your voodoun becomes a problem.\"</p><p>\"We agreed to keep this between us,\" Baptiste growled. \"No one else can know.\"</p><p>\"She doesn't know.\" Raphael moved toward him. \"She thinks she's on assignment, bringing back someone to help Ashe.\"</p><p>\"My voodoun could tell her-reveal our connection.\"</p><p>The Suit reached the window. He glanced inside, ran his hand down the glass, then fisted it and cursed. \"That's your problem. Mine is in there fighting for her life and the life of our cub.\" He turned to glare at Jean-Baptiste. \"The cub who might very well be the savior of us all.\"</p><p>Jean-Baptiste growled. \"Who's the Suit?\"</p><p>\"The newest member of the</p><p>Diplomatic Faction, Genevieve Burel.\"</p><p>\"No,\" Baptiste stated flatly.</p><p>\"You don't even know her.\"</p><p>\"I've heard about her, and with my cat so unstable and ready to pounce on anyone who even slightly irritates me, taking her to New Orleans would be a batshit move.\"</p><p>\"She's brilliant!\"</p><p>\"She's a pain in the ass! A prickly, buttoned-up, nose-in-the-air pain in the ass,\" Baptiste returned hotly.</p><p>\"Good. Then she'll make sure the journey is a success.\"</p><p>He growled. \"Either that or my cat will take her down before we even leave the Wildlands.\"</p><p>Genevieve Burel placed the perfectly folded shirt inside her shabby overnight bag and gently slid the zipper closed.</p><p>Her critical gaze moved over her room, taking inventory: the neatly made bed with the quilt her mother had made for her when she was a cub; the ancient chair that couldn't hide its desperate need to be re-stuffed; the scuffed wood floors she'd spent hours trying to sand; and the dusty pictures and photographs that hung on the faded walls.</p><p>She exhaled heavily. She'd just cleaned an hour ago.</p><p>She slung her bag over her shoulder, then headed into the hall and down the stairs, careful not to grip the loose banister too firmly. On the small table that met her descent, the vase of Louisiana Iris she'd picked that morning were struggling to remain upright and full of color. The shockingly purple flower grew inside the magical borders of the Wildlands all year long, and was her grandparents' favorite. In fact, it was their mating day flower. Genevieve tried to pick some every day, but the bloom was becoming harder to find.</p><p>Scooping up the vase, she entered her Grands' bedroom with a bright smile.</p><p>The room had once been the parlor, but Genevieve had converted the large space into a bedroom after her mother and father left the Wildlands six months ago. It was easier for her grandparents to get around, and despite how the ancient and errant magic was slowly</p><p>depreciating the house and its furnishings, Genevieve had done her best to make the room clean and comfortable.</p><p>\"Finished with your dinner?\" she asked the pair, placing the vase down beside their bed. \"I hope it was all right.</p><p>You know I'm not so great with the stews.\"</p><p>\"It's was perfect, Be,\" her nearly bald Paw-Paw said, giving her hand a squeeze.</p><p>\"Yes, indeed,\" her pink-cheeked Maw-Maw agreed, grinning. \"Your culinary skills are far more advanced than you think they are.\"</p><p>Genevieve laughed, her cheeks warming. Her grandparents were the sweetest, dearest creatures in the world, and she didn't know what she'd do without them.</p><p>\"You leaving now?\" Paw-Paw asked.</p><p>Genevieve nodded at the pair who were cuddled up in bed together, as they were most days now, the covers pulled to their waists as they sipped their tea.</p><p>\"Shouldn't be more than a night, if that.\"</p><p>\"We'll be fine,\" Maw-Maw assured her with a broad grin. \"Lena's coming.</p><p>You know we adore that girl. Even if she is a Hunter,\" she added with a wink.</p><p>\"So take all the time you need.\" Paw-Paw nodded. \"That's right. Our Be's an important Diplomat now.\"</p><p>\"Not that important,\" Genevieve said.</p><p>\"And never too important to take care of my favorite Grands.\"</p><p>\"We're your only Grands, Be,\" Paw-Paw said with a chuckle.</p><p>Genevieve met his soft chuckle with one of her own, but inside, her heart did that squeezee thing that made her feel like tears could appear at any moment if she wasn't careful. Her Grands didn't understand what was happening around them, just that Genevieve's parents had decided to forge a life outside of the Wildlands. They saw the house crumbling of course, felt their bodies crumbling, too, but didn't think-or refused to think-it could be more than just age and wear.</p><p>Genevieve knew better.</p><p>Where the magic inside their home, infusing their ancient blood, had once been impossibly strong, now it waned.</p><p>The crackle of energy no longer permeated the air, and every item inside, every being, lacked luster. Genevieve's parents might have chosen to run instead of \"dealing with the shame of one of the ancient families being rejected by their magic,\" as they'd put it. But Genevieve was determined to stay and fight, care for her Grands, and figure out why the weakening magic along their borders was moving inward. And why,</p><p>according to the elders, hers was the only dwelling affected.</p><p>She bent down and gave each one a kiss on the cheek. They smelled like chamomile tea and soap and gentle memories.</p><p>\"I'll see you tomorrow,\" she said.</p><p>\"And no telling Lena to spike your sweet tea. I've already warned her about that trick.\"</p><p>While Paw-Paw snorted and</p><p>grumbled, Maw-Maw cupped</p><p>Genevieve's face before she could get away. \"Will you laugh at this old Pantera female if she says to have a good time? Maybe a little fun on your journey?\"</p><p>\"No laughing here,\" Genevieve assured her before straightening up.</p><p>\"I mean it, Be.\"</p><p>\"Yes, ma'am.\"</p><p>As Genevieve walked out of the room, Maw-Maw called after her, \"If anyone needs to cut loose and have a good time, it's you!\"</p><p>Placing her bag on her shoulder again, Genevieve headed for the front door.</p><p>She loved her Grands more than anything in the world, and she knew they had her best interests at heart, but they didn't understand how vitally important it was that she remain focused, controlled, and completely and utterly unflinching in her goals and assignments. Especially now.</p><p>Unbeknownst to Raphael and the Suits, she was destined for the elders' inner circle. Working alongside the three ancient females. It was a coveted position, a great honor, and it was in her blood. Many of the females in her line had worked under the elders. Even her mother had been selected as a candidate before her fear of shame had run her off.</p><p>Genevieve wouldn't be that weak.</p><p>She headed out the door and into the warm bayou evening. Breaking loose and having a good time? Her Maw-Maw's words echoed in her ears.</p><p>Unfortunately, those two suggestions weren't even on her radar.</p><p>\"Miss Burel?\"</p><p>In one second flat, Genevieve's thoughts died and her entire body went up in flames.</p><p>Standing on her rickety porch, with the chipped white paint and the sweet double swing, was the owner of that deep, demanding baritone. Genevieve stared at him like a mole who had just seen the sun for the first time. Hot, blinding and impossible to turn away from. She was sure she had never met him before. She would have</p><p>remembered if she had. Her gaze moved over him. Yes. This male in dark blue jeans and a worn, black leather jacket wasn't someone you walked past without either staring, double-taking or running into a tree. He was so tall his head grazed the roof of the porch, and so broad across the chest, the white T-shirt he wore strained against all that muscle.</p><p>But it wasn't just his size and fierce manner that had her skin vibrating with awareness, or the thick, dark hair, or the light dusting of stubble around his mouth</p><p>-or, god, even those incredible liquid amber eyes that equally mocked and studied her. No. It was the brightly colored tattooed skull interwoven with tribal markings that covered his collarbone and ran up the length of his neck.</p><p>And the piercings.</p><p>Air seemed to gather in her lungs and stay there. Her mouth was uncomfortably dry. She couldn't stop staring. At the metal barbell poking through his left eyebrow, and the two thin, silver rings fastened to his lower lip.</p><p>Besides the individual black birth markings each Pantera had, she'd never seen anything like this on their males.</p><p>She wanted to rush at him, place her hands on the skin of his neck and trace the colored lines, inspect them, study them. But instead, she backed up toward the closed front door, protective not for herself but for the two vulnerable Pantera inside. Was this indeed the Nurturer, Jean-Baptiste, who Raphael had assigned her to? Or someone else?</p><p>Someone who wished her harm? After all, the Wildlands had been infiltrated, and everyone was being cautious.</p><p>That eyebrow with the metal lifted.</p><p>\"Raphael told you I was coming.\" It wasn't a question. She suspected he wasn't the type who asked a lot of questions. At least she knew he wasn't the enemy. Not the kind she needed to be worried about anyway.</p><p>She stuck out her hand. \"I'm</p><p>Genevieve Burel.\"</p><p>He didn't touch her, just glanced at her hand, then dragged his gaze back up to her face. \"I know.\"</p><p>Heat warmed her cheeks at his slow and obvious perusal. Males didn't look her over this way. Inspect her. At least if they did, she'd never noticed it before.</p><p>\"Right.\" She dropped her hand. \"And you're-\"</p><p>\"Jean-Baptiste,\" he finished for her.</p><p>\"Yes. It's a pleasure to meet you, Mr.</p><p>Baptiste.\"</p><p>A brief flicker of what she believed to be amusement crossed his features.</p><p>\"You sure about that?\"</p><p>\"Pardon me?\" His tongue had darted out and swiped at the twin rings of silver on his bottom lip. Her mouth filled with saliva and she gripped the strap of her overnight bag until her knuckles turned white. What the hell was going on with her? She'd never felt so flustered in her life.</p><p>This is not acceptable. For a Suit, a Pantera or a female. But especially not for a disciple of the elders.</p><p>\"I'm asking,\" he pushed away from the porch railing and moved toward her with sensual, cat-like grace, \"if you're sure it's nice to meet me. Because frankly, Miss Burel, your face and body language scream the opposite.\" Body language? She touched the pearl buttons at her throat, and tried to control the sudden outbreak of sweat under her arms. Lord, this was three shades of irritating. \"I assure you, Mr.</p><p>Baptiste,\" she said, clearing her throat.</p><p>\"My body does not scream.\" Wait. Did that come out right?</p><p>His eyes narrowed. \"That's too bad.\" No. It hadn't.</p><p>\"What I mean to say is that I'm focused on our mission.\" She cleared her throat again and tried to look him directly in the eye without her legs feeling funny. \"Getting in and getting out.\" Oh Christ, that wasn't much better.</p><p>His eyebrow-the one with the metal barbell through it-raised a good quarter inch.</p><p>They needed to go, leave her porch, the Wildlands, get to New Orleans, complete their task, bring it back to Raphael, and never have contact again.</p><p>Or at least never speak to each other again. Never look at each other again.</p><p>Specifically her looking at him. And at that mouth. Those tattoos. Wondering where they disappeared to. How far down they traveled-</p><p>\"Ready?\" he said, interrupting her thoughts. Her incredibly inappropriate thoughts.</p><p>\"Absolutely,\" she said, wishing she could slap her own face without it looking odd, and possibly a little insane.</p><p>\"Shall we shift?\" she asked, moving past him and down the steps. God, he smelled good. Leather and something completely indescribable, yet almost debilitatingly mouthwatering. \"At least until we hit the border. I know the magic will refuse us once we're on human soil.\"</p><p>\"We're not heading to New Orleans on foot, Miss Burel,\" he said, suddenly appearing beside her. \"That would take too long. And I want this trip over as quickly as possible.\"</p><p>She made the mistake of turning to face him again. The sun had set completely now, and twilight ruled lavender and gray around them. The evening bayou breeze moved through his shoulder-length dark hair, batting at his dark, fearsome face. As petite as she was, Genevieve had never felt intimidated by anyone in her life. She was a strong, hard-nosed female who dealt in reality, who knew what she wanted and went after it. The fears and insecurities of her heart never made it past their respective barriers. But under this male's imperious, scrutinizing, sexually-fierce gaze, she felt like a small, tasty woodland creature who knew she was on borrowed time if she remained out in the open.</p><p>\"If we're not running,\" she said finally. \"How do you propose we get there? Did your voodoun acquaintance arm you with a generous supply of fairy dust or something?\"</p><p>His eyes flashed with heat under the cool light of the bayou moon. \"No fairy dust, Miss Burel. Just a ride.\" Genevieve's legs threatened to buckle at his words- no, just that one word-</p><p>and her mouth opened but nothing came out. Struck dumb by a great, inked-up beast of a Pantera male. She'd never been so ashamed of herself.</p><p>With a slash of a grin, Jean-Baptiste turned and started down the path. \"Come along, Miss Burel. I promise I won't go any faster than you can handle.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The female beside him would be smoking hot if it weren't for all the buttons, zippers and pins, Jean-Baptiste mused, racing down Route 90, his cat eyes stunningly sharp in the dark. Sitting bone-straight in the passenger's seat of his 1967 Jaguar Roadster convertible, her milky white fingers splayed on her wrinkle-free lap, the small, fantastically curved, wondrously-busted Suit was the very picture of prickly put-togetherness.</p><p>Except for all that honey blond hair trying to escape the confines of an overly tight bun.</p><p>Fuck, he hoped the bun lost.</p><p>\"Too fast for you, Miss Burel?\" he called over the breeze.</p> <p>\"Not at all, Mr. Baptiste,\" she returned, her eyes forward, her expression tight.</p><p>\"What about for your cat?\"</p><p>\"She's also quite content.\"</p><p>She. Jean-Baptiste's brows shot together, and his fingers wrapped around the steering wheel just a hair tighter.</p><p>He'd never heard a Pantera refer to their cat as he or she before, and damn if it wasn't intriguing as hell.</p> <p>\"Do many Pantera have cars outside the Wildlands?\" she asked, her eyes on the road in front of them.</p><p>\"There are a few of us.\"</p><p>\"Us?\"</p><p>\"Car enthusiasts. We like to buy and restore. Keep them in private garages in and around La Pierre.\" He touched the dash. \"This one was a real piece of shit when I took her on.\"</p><p>Genevieve turned to face him. Her eyes were wide with surprise. \"You fixed up this car yourself?\"</p><p>\"Rebuilt the engine, but it was mostly body restoration.\" That moonlight overhead was really working on her, he mused, and the wind whipping threads of blond hair about her face. She looked like a goddamn angel.</p> <p>\"You did an amazing job,\" she said.</p><p>\"It's beautiful.\"</p><p>Shit, Female. So are you.</p><p>\"How many Pantera are in this car club of yours?\"</p><p>\"Around ten. Something like that. It varies from year to year.\"</p><p>\"All males?\"</p><p>His mouth twitched. \"No. There are two females,\" he said. \"Both Hunters.</p><p>Both crazy for Mustangs.\"</p> <p>\"And is one of them your mate?\" she asked.</p><p>His gaze cut back to her. She was staring at him, all prim and proper. He wanted to toss out a smartass remark like, ' What do you mean, one?' over the rush of bayou air, but this female didn't seem like the type who'd find his brand of humor funny. In fact, she'd probably be insulted.</p><p>Damn, she really was just as Xavier had described her.</p><p>The Geek had told Baptiste all about Genevieve Burel, the supposed genius recruit he and his tech brethren had tried to bring on board the wannabe Faction last month. Rumor was she killed at decoding, and the Geeks had really pushed for her to give it a try. But after a couple of weeks, she'd bailed. The stories of her starched-collars, imperious attitude and one-word answers, however, had become legend.</p><p>\"I have no mate, Miss Burel.\" Jean-Baptiste let his gaze travel down her skirt to the sexy legs beyond. He might be willing to take on her imperious attitude if those legs were wrapped around him, and the starched collar removed.</p><p>Or ripped away, courtesy of his canines, he thought with a wicked grin.</p><p>\"So, this woman we're going to retrieve,\" she said tightly. \"She's just an acquaintance of yours?\"</p><p>\"Something like that.\"</p><p>\"A friend?\"</p><p>The wind turned cool around them.</p><p>\"She's not my mate or an object of my imprint, if that's what you're asking.\"</p><p>\"I'm not trying to get personal with you, Mr. Baptiste.\"</p><p>\"Clearly.\" Spotting his exit, he banked the wheel to the right sharply.</p><p>\"Since you don't even seem to know my last name.\"</p><p>The sudden movement made</p><p>Genevieve jerk, and she reached out for something to steady herself. What she got was the door handle on one side and Baptiste's thigh on the other. \"Again,\" she said yanking her hand back. \"Not getting personal.\"</p><p>But the movement came too late for Jean-Baptiste. And his cat. Her palm, her nails, had gripped him like a hungry lover, and his cock was now turning to steel behind his zipper.</p><p>\"I only want to know more about the subject we're to obtain and transport,\" she said. \"Collecting data. That's all.\" Holy fuck, he mused. This female might be prickly and buttoned-up. She might be cold as dry ice on the outside.</p><p>But her blood ran hot. Molten lava hot.</p><p>He'd felt her sensual burn through his jeans, and the strike had awakened his already restless puma.</p><p>\"I take my work seriously, Mr.</p><p>Baptiste,\" she continued.</p><p>\"I can see that,\" he uttered, his gaze narrowing as he headed for the Vieux Carre.</p><p>\"I don't have time to waste.\"</p><p>\"Why? You got a hot date later?\" He hadn't meant to say it. After all, he was pretty sure she repelled all things humorous, and when she glanced over at him, pinned him to his seat with a glare so fierce her pale blue eyes resembled twin icebergs, he knew that assessment was spot on.</p><p>\"You know,\" she said tightly, \"I was hoping you'd be more of a Pantera.\" The hard-on in his jeans, combined with the growling cat inside him-not to mention the unwanted sexual interest he was sporting for this female-caused him to abandon any shred of manners he might still have possessed. \"Oh, I'm all Pantera, baby,\" he said with a husky growl as he took the Toulouse entrance.</p><p>\"If you don't believe me, I can pull over to the side of the road and show you.\" She wrinkled her nose. \"That's disgusting.\"</p><p>\"No, that's the truth.\"</p><p>\"If you were truly Pantera you wouldn't be making inappropriate comments when there is so much at stake</p><p>-when the life and health of Raphael's mate and cub are in danger.\"</p><p>He turned onto Bienville, sharp and quick, and didn't acknowledge her squeal of concern. She was starting to piss him off. Which, along with the attraction, was a pretty shit combination.</p><p>\"Don't pretend to know the behaviors of our kind, Miss Burel. Pantera instinct, character and function are my department. You are as green as the moss that grows along the banks of the bayou. A student, an observer, barely out of your training pants-sent along to make sure I follow the rules. Which I won't.\" He raced up the street, getting hit with the scents of night-blooming jasmine and a hundred restaurants.</p><p>\"Now. I didn't ask for company. But I got stuck with it. So, my prickly little puma, you're going to have to deal with inappropriate and whatever else I toss your way.\"</p><p>He was surprised when she uttered a very calm, \"Or?\"</p><p>\"Or I get uncooperative and difficult to control. I know this is your first big Suit gig.\" He stopped at a crosswalk, waited for a passing pedestrian or two.</p><p>\"You don't want it to go badly, right?\" She was staring straight ahead, her jaw tight, a flood of color creeping up her neck. She looked damned good in pissed-off pink. And he was a jackass for noticing.</p><p>\"Raphael should've been more</p><p>forthcoming about you,\" she said tightly.</p><p>No, he shouldn't have. \"What did he say?\" He hit the gas, made a sharp right and headed down Chartres Street.</p><p>Genevieve's gaze scrolled over the crowds streaming in and out of the restaurants and galleries to her right.</p><p>\"That you're a Nurturer. An expert in the field of brain study. Brilliant and...\" Her eyes darted toward him, and she snorted. Actually snorted. \"Serious.\" He wasn't sure why, but her easy censure bothered him. \"And you think I'm not serious, Miss Burel?\"</p><p>\"With all that you've demonstrated so far, no.\"</p><p>\"You think because I crack a joke, I don't understand the magnitude of what our people are facing? Or because I come on to a hot female, I'm not swimming in concern for Ashe, and rage for whoever has dared to betray us?\"</p><p>\"That's exactly what I think,\" she said quietly. \"And don't call me hot again, unless you want a nosebleed.\" Jean-Baptiste was silent as he pulled up in front of Isi's place and killed the engine. The pale pink shotgun house was pretty unassuming, except for the massive blood-red shingle that read, THE CARE AND FEEDING OF</p><p>VOODOO, and underneath it, Isi Rousseau. But Jean-Baptiste knew the depth and intensity of the magic that lived and breathed inside, and he never underestimated it. Beside him, Genevieve turned to get out of the car, but the sudden click of the locks halted her.</p><p>She whirled around, her expression stony. \"Problem?\"</p><p>His eyes moved over her face. Pale, perfect skin, a mouth that invited hot, hungry kisses, and a severe attitude that was supposed to ward off all male attention, but somehow managed to turn Jean-Baptiste into a brain-dead, lusty, adolescent Pantera male.</p><p>Problem?</p><p>Fuck, yeah.</p><p>\"Believe it or not, Miss Burel,\" he said with barely contained aggression. \"I would do anything to help the Pantera, to help Ashe and the cub. And I am. You have no idea.\" He stabbed at the lock, growled softly as it released. \"Let's go.\"</p><p>As Genevieve walked past Jean-Baptiste into the dimly lit shop, she once again reminded herself of the rules of this game she was playing. Make sure the voodoun didn't get anywhere near the Wildlands, while acting as though that very journey was her one and only goal. All she knew was that the elders believed this human to be detrimental to the Wildlands, to Ashe and the child.</p><p>And that was all Genevieve needed to know. The elders were not to be questioned. After all, they were the essence of Pantera, the wise ones and the ultimate protectors. They and their judgment were valued beyond all things.</p><p>\"Remember, Miss Burel, I do all the talking,\" Jean-Baptiste said, following her past a row of books, crystals, voodoo love dolls, and potions, all backlit by a mass of blue-flamed candles. \"Isi's not going to be happy about this.\"</p><p>Isi. Very pretty, Genevieve thought.</p><p>Exotic. \"Why's that?\"</p><p>\"Let's just say that the Wildlands'</p><p>magic and her own don't mix well.\" Lucky for me. \"How would she know that? Has she been to the Wildlands?\"</p><p>\"She's been to the border.\"</p><p>Genevieve's insides hummed, and she glanced over her shoulder. Tall, broad, eyes wary, tattoos and piercings glistening eerily in the candlelight, Jean-Baptiste looked like the sexiest demon alive. \"Alone? Or with you?\"</p><p>\"Curb the questions, Miss Burel,\" Jean-Baptiste said coolly. \"And don't forget you're here in a diplomatic capacity only.\"</p><p>\"I know why I'm here,\" she returned.</p><p>Did the elders know about this? The voodoun at their borders? Was that their reasoning for keeping her out?</p><p>Did they believe she had something to do with what happened to Ashe?</p><p>\"Well, well, Baptiste,\" came an almost otherworldly voice near Genevieve's ear.</p><p>Startled, Genevieve whirled around to find one of the most extraordinary-looking women she'd ever seen. Not near her ear as she'd believed, or felt, but standing a full ten feet away in front of a cobalt blue curtain. For a second, Genevieve couldn't put her thoughts together. She blinked several times. A sudden blast of incense impaled her nostrils, and her head grew fuzzy and slow. She reached out for something to steady herself, but there was nothing.</p><p>\"Isi.\" She heard Jean-Baptiste's voice behind her, his tone thick with warning.</p><p>\"Cut it off.\"</p><p>\"But it's so much fun,\" she nearly whined.</p><p>\"Now,\" he growled.</p><p>The scent of incense died away, and the haze inside Genevieve's brain vanished. She drew in air, and had the most extraordinary urge to turn around and run. But her feet were planted to the floor, and her eyes pinned to the woman.</p><p>Isi.</p><p>She was dressed in skin-tight jeans, black heels, and a sleeveless red top that showed her flat stomach on one end and her firm breasts on the other. She had short, jet black hair with blue streaks running through it, a tattoo of a rose wrapped around a candle that ran from just under her right ear down to her shoulder, and a diamond piercing in each nostril. Genevieve's mind felt murky as hell, but even so she knew that this was the kind of woman Jean-Baptiste probably went for. A real kindred spirit, complete with ink and metal. And she wondered if he had lied about them being more than just friends.</p><p>\"Hello there.\" She shoved away the urge to fiddle with her top button and walked straight for the woman, her hand outstretched. \"I'm Genevieve Burel.</p><p>Diplomatic Faction for the Pantera.\" Her expression stony, the woman ignored Genevieve and her hand, and pushed past her. Genevieve watched.</p><p>Heels clicked on the stone floor and hips swayed as Isi made her way to Jean-Baptiste. Goodness, the woman moved like she knew how to work her body at all things.</p><p>When she reached him, she instantly brought her hand up to his neck. \"Looks good.\"</p><p>\"I think so,\" he said.</p><p>She ran a finger down the cord of muscle in his neck. \"Healed and ready for another?\"</p><p>He grinned. \"Always.\"</p><p>The fuzzy head thing was gone, but something else-something far more worrisome-moved through Genevieve as she watched this woman. Isi's hands moved over Jean-Baptiste's body as if they had eternal permission to do so, and her voice practically licked at him, it was so intimate.</p><p>Were they lovers? And if so, why had Jean-Baptiste not disclosed it?</p><p>\"I need to speak with you,\" he said to the voodoun, his voice grave.</p><p>\"Problem?\" Isi asked.</p><p>He nodded.</p><p>Isi glanced over her shoulder at Genevieve. \"Another foolish female fall in love with you, Baptiste? Must we administer a reverse spell?\"</p><p>\"No,\" he said with a smooth chuckle.</p><p>\"Nothing like that.\"</p><p>\"No, nothing like that,\" Genevieve returned with barely disguised irritation.</p><p>More for herself than for them. She was getting real sick of this back and forth, pseudo-flirtatious, weirdly possessive behavior she was feeling and exhibiting.</p><p>Her future, and her family's future, rested on this pick-up and delivery. Or preventing it, and that was all she was going to be focused on for the next twenty-four hours.</p><p>\"Miss Rousseau,\" she said tightly.</p><p>\"As I said before, I'm here for the Pantera. To assist Mr. Baptiste in making sure you-\"</p><p>Jean-Baptiste interrupted sternly. \"I got this.\" He took Isi's arm and ushered her down the candlelit aisle. His eyes were hard, his mouth too. \"If you'll excuse us, Miss Burel.\"</p><p>\"I absolutely will not!\" Genevieve called after him, far more passionately than she'd intended. \"This wasn't the arrangement.\"</p><p>She heard Isi grunt, and ignored it.</p><p>\"We're supposed to do this together, Mr. Baptiste,\" she continued, going after them.</p><p>\"Mr. Baptiste?\" Isi said with a husky laugh. \"What the fuck is that about?\" His expression fierce, Jean-Baptiste guided Isi through the curtain, whispered something in a terse tone, then re-emerged.</p><p>\"I warned you, Miss Burel,\" he said, halting her progress. \"I don't follow rules. Especially ones that were decided upon without me.\"</p><p>She stared up at him, hated how fast her heart was beating. \"I don't care about any of that. I have a job to do.</p><p>Raphael sent me-\"</p><p>\"Raphael sent you as a backup. In case I didn't get the job done.\" His voice dropped. \"And I always get the job done, Miss Burel.\"</p><p>Instead of muscle and bone, it felt like water suddenly resided inside her legs.</p><p>And his scent, that heady, masculine, animal-like aroma, was forcing itself inside her nostrils, battling for dominion with the remnants of Isi's head-screwing incense. This was impossible, she thought with deep irritation.</p><p>\"Now,\" he continued in a soft, deadly voice, \"You're going to remain out here, while I have a conversation with my... friend.\"</p><p>\"That's not fair,\" she growled. \"Not how this was supposed to go.\" His eyes flashed amber fire. \"Life is made up of the unfair, Miss Burel. Learn to accept that and you'll never face disappointment.\"</p><p>\"Disappointment is my elixir, Mr.</p><p>Baptiste. It gets me going, fires me up, turns me on.\" She tried to yank herself back, but she couldn't seem to curb her tongue.</p><p>\"Well then, expect to be highly aroused for the next twenty-four hours.\" She could hardly breathe as they stared at one another. Dark hair fell over his cheekbones, a few stray wisps brushing against the two hoops in his lower lip. Her eyes traveled down to the full, lush flesh. What would it be like to kiss him? How would she do it? Would it hurt him if she tried to get the tip of her tongue inside, spear one of those small rings? Tug on it? Ease him closer?</p><p>A soft, male growl pierced the thick air between them, and Genevieve's brain lurched back to the 'on' position.</p><p>Oh, Christ. What was wrong with her?</p><p>The things she was saying...the way she just openly stared at him, challenged him. The female who was all set to enter a life of service with the elders-a life where she would have no mate, no sex, no intimacy-was openly lusting over the very Pantera male she had to outwit.</p><p>This was bad.</p><p>Jean-Baptiste's eyes narrowed, and he pulled back sharply. \"I'll be back in five minutes. Look around. Maybe you'll find something you like.\"</p><p>Too late.</p><p>\"Or maybe you'll find some</p><p>happiness. Isi puts that in the gray bottles, I believe.\"</p><p>What the hell was she doing?</p><p>Genevieve thought shakily as she watched him walk away and disappear behind that blue curtain. Why was the top button on her blouse digging into her throat, irritating her, begging to be bitten off, when it had always lain so comfortably against her skin?</p><p>And why had her mission of making sure the voodoun never entered the Wildlands suddenly expanded into the disjointed goal of never allowing the dark-haired woman to put her hands on Jean-Baptiste again?</p><p>She turned to a table of potions, released a heavy breath, and started picking up random bottles. Forget happiness. There had to be something here that returned sanity to a clearly insane mind, and calm to a body that had never experienced the true meanings of the words lust and possession until just a few moments ago. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Have you lost your fucking mind?\" Jean-Baptiste eyed the petite woman with the foul mouth, quick wit and fiercely sharp brain. \"You know I have.\" Isi smacked the seat of the leather recliner in front of her and huffed, \"Then get your ass under Derek's needle again because there's no way in hell I'm stepping foot back in the Wildlands.\"</p><p>\"Derek,\" he uttered blackly. \"That idiot's cat food.\"</p><p>\"What?\"</p><p>\"When I see him again, he's dead.\"</p> <p>\"Oh, Jesus,\" she muttered, pulling on a pair of gloves. \"What happened?\"</p><p>\"The guy you hired to perform magic-laced tats can't keep his mouth shut. He told one of our spies, who informed the leader of the Suits just what goes in my ink and metal.\"</p><p>Isi sighed, picked up some tools and dropped them in the autoclave bag. \"I'm sorry. Seriously. I'm sorry. But if that's what you're looking for from me-a Wildlands house call-I can't do it.\" She gave him a pointed look. \"Don't you remember what happened the last time?\" Damn right, he remembered. It was a week after he'd realized he had a problem, that his cat wasn't behaving.</p><p>He'd popped a few capsules of the malachite drug he gave his patients, testing to see if it grounded the feline inside his body once again.</p><p>It had.</p> <p>But not for long.</p><p>He'd known right then he needed something permanent. Knew that if he didn't want to be caged liked the very ones he treated, he'd have to hide it.</p><p>He'd heard about Isi, her incredible magical abilities, and tried to get to her.</p><p>But even though Pantera couldn't shift outside the borders, his cat had. Twice.</p><p>And had nearly taken down a couple of tourists in the process. In the end, he'd slunk back to the Wildlands and begged Isi to come to him.</p><p>The attempt hadn't turned out well.</p> <p>For either of them.</p><p>\"You got sick,\" he said, trying to play down the truth as he watched her shove the autoclave bag inside the machine.</p><p>She snapped the latch, then turned to glare at him. \"What I got was the equivalent of seasickness on land, times ten. I could barely stand, keep anything down.\" She shuddered in remembrance.</p><p>\"I don't care what the reason is or how dire it is, I'm not going.\"</p><p>Jean-Baptiste sighed, crossed his arms over his chest. \"How much?\"</p><p>\"What?\"</p><p>\"How much? We'll pay. Even in stones, minerals...whatever you want. I know you've been dying to get your hands on all that ancient shit below the surface of the Wildlands' soil.\" Baptiste saw a flicker of excitement light her eyes, then a shroud of fear quickly overtake it.</p><p>\"No.\"</p> <p>\"Isi. That could've been a one-time thing.\"</p><p>She pointed to the curtain. \"You have to go. I have a client coming.\" For one brief second, Jean-Baptiste thought about putting up a fight, scaring the shit out of the human who was coming to see her, offering her more than just cash or crystals. But he knew her.</p><p>Knew what worked and what didn't.</p><p>Fear played her hard and often, and if he was going to get what he wanted, negotiation wasn't the way.</p><p>Unfortunately, the way was probably going to get him despised, hunted and, more importantly, cut off from the ink and metal his body and his feral cat desperately needed.</p><p>Anger simmered below the surface of Genevieve's skin as she watched the two males greet each other in the lobby of the swank Hotel Fils de France. At first, when Jean-Baptiste had walked out of the voodoun's shop and headed for his car, Genevieve had assumed she'd just become the luckiest female in the world. Isi had said no to the trip, and the inked Nurturer hadn't put up a fight.</p><p>She'd be home by midnight, she'd thought smugly, and standing before the elders at dawn.</p><p>Her cat had practically purred along with the engine of his Jag.</p><p>Then he'd made a call, and two minutes later they'd pulled into the valet line of a beautiful French Quarter hotel.</p><p>Before she'd even gotten a word out, a question, a demand to know just what the hell was going on, another male had pulled up beside them in an equally gorgeous car and they'd all walked inside together.</p><p>\"I appreciate this, Michel,\" Jean-Baptiste said in a low, almost conspiratorial voice as they entered the sumptuous, violet-hued lobby.</p><p>\"Anytime, mon ami.\" The suit-and-tie male was extraordinarily handsome, with a skull-shaved head, shockingly broad shoulders, and piercing green eyes that seemed to move over every inch of the hotel and its patrons. \"How are things at home? How is the human female recovering?\"</p><p>Baptiste's voice dropped to a growl.</p><p>\"You've heard.\"</p><p>Michel nodded. \"We're working on it from our end.\"</p><p>\"Any leads?\"</p><p>\"I'm afraid that's classified,\" he said, his gaze coming to rest on Genevieve.</p><p>Though his eyes remained watchful, his mouth relaxed into a very charming, confident smile. \"I recognize a fellow Suit when I scent one. And you, ma cherie, smell like magnolia flowers and twilight on the bayou.\"</p><p>Genevieve felt a sudden shock of heat hit her cheeks, and she wanted to kick herself. She wasn't appreciating this new and embarrassing side of her nature.</p><p>For goodness' sake, handsome males were a dime a dozen. So were</p><p>compliments.</p><p>He reached out. \"Michel.\"</p><p>She shook his hand. It was warm, strong, and, knowing his profession outside of the Wildlands, probably able to kill her with just the tiniest of efforts.</p><p>\"No last name?\" she asked him.</p><p>\"Oh, now you're into last names?\" Jean-Baptiste muttered.</p><p>Genevieve ignored him.</p><p>Michel drew closer. \"I find I don't need one.\"</p><p>\"How convenient.\"</p><p>His grin broadened. \"And your name, cherie?\"</p><p>\"Genevieve,\" Jean-Baptiste supplied with more than a trace of annoyance.</p><p>Green eyes raked over her. \"Beautiful name for a beautiful female.\" A low, fierce growl echoed</p><p>throughout the bustling lobby, and both Michel and Genevieve turned to look at Jean-Baptiste. The male looked ready to rip Michel's head from his body. His eyes were narrowed into slits, his nostrils flared, and if she wasn't mistaken, his canines were a hair longer than they should be outside of the Wildlands.</p><p>As a bellboy passed them, followed by a giggling young couple, Genevieve turned back to Michel and said quickly,</p><p>\"Thank you. But I'd say I'm more of an impatient, annoyed, and confused female at the moment.\"</p><p>Michel's gaze remained fixed on Jean-Baptiste. \"Are you the cause of this, mon ami?\"</p><p>\"Probably,\" the male uttered, his tone so near to menace it actually made the hair on the back of Genevieve's neck lift.</p><p>With a soft chuckle, Michel pressed something into Jean-Baptiste's hand, then clapped him on the shoulder. \"You have the entire top floor. The owner is a good friend. Anything you want, it's taken care of.\" His gaze flickered toward Genevieve, then back to Jean-Baptiste. \"And I apologize. I didn't know.\"</p><p>Jean-Baptiste nodded, then inhaled deeply, seemingly trying to get himself under control.</p><p>\"Know what?\" Genevieve asked, staring at the key in his hand. This had better be a joke. And if it wasn't, there had better be a cab waiting outside.</p><p>Hell, if she had to, she could run home.</p><p>When neither Michel nor Jean-</p><p>Baptiste answered her, she looked up.</p><p>There were plenty of humans milling about the lobby, checking in, but the Pantera spy was gone-as if he'd never been. Panic flared within her, and she turned in a slow circle looking for him.</p><p>\"Where did he go?\"</p><p>\"Come along, Miss Burel.\"</p><p>She whirled back to face Jean-Baptiste. But he wasn't there either. He was heading for the elevator.</p><p>\"Hey!\" she called after him.</p><p>He didn't respond, though several hotel employees looked her way.</p><p>\"We're not staying here!\"</p><p>\"You don't have to do anything, Miss Burel,\" he called back. \"The front door is that way. Just let Raphael know I'm on it.\"</p><p>\"On what?\" Dammit. She ran after him, bypassing three giggling, stumbling, women who had clearly been out enjoying their evening cocktails. \"Your voodoun friend said no, didn't she?\"</p><p>\"She did.\"</p><p>\"Then there's nothing else we can do.\"</p><p>\"I'm giving her some time to calm down, think.\"</p><p>\"Think about what?\"</p><p>\"Giving up a little easily, aren't we, Miss Burel?\"</p><p>\"What?\" Her heart stuttered. \"Of course not.\"</p><p>When they reached a bank of</p><p>elevators, Jean-Baptiste ignored the gathering crowd and walked straight past, to another, smaller elevator at the far end of the hall. He held his key up to a strip of metal, waited for the keypad to turn red and beep, then glanced over his shoulder at her. Dark brows lowered over amazing eyes. He studied her.</p><p>\"Isn't it your job to step in if I can't get the job done?\"</p><p>\"I thought you always get the job done, Mr. Baptiste.\"</p><p>That elicited a wry grin before he stepped into the waiting elevator. \"I think I'm starting to like that name. I'll speak to Isi again in the morning.\" Morning? \"Are you actually suggesting we stay here all night?\"</p><p>\"In or out, Miss Burel.\"</p><p>Dammit. She couldn't go back to the Wildlands without him, and she couldn't let him talk Isi into coming. She needed time to think. She needed time to-</p><p>\"Goodnight, Miss Burel.\"</p><p>Guess she wasn't getting it.</p><p>She lurched forward and slipped inside the elevator just as the doors closed.</p><p>To Jean-Baptiste's vexation and possible ruin, the female who'd just entered the elevator brought not only her ire and concern into the luxurious leather and suede box with her, but her particular brand of body heat. And the warm, honey-like sensation was quickly fusing into his skin, turning him-and his cat-into a hungry, sensual predator.</p><p>He leaned back against the wall and hissed. The last thing this mission needed was an underlying sexual attraction, and yet he'd steered it there too many times to count. Wanting what he shouldn't be wanting. The prickly Suit female. And he'd displayed his desire and possessive instincts for her in front of another Pantera male. Fuck.</p><p>Michel's flirtation had been innocent.</p><p>His gaze slid over Genevieve, taking in her stunning body and beautiful face.</p><p>He grunted. Who was he kidding?</p><p>Nothing a Pantera male did was innocent when it came to their females. Michel had been completely and frustratingly into her, and Jean-Baptiste didn't blame the randy bastard one bit. Genevieve Burel was the most desirable female he'd ever laid eyes on, and the fact that she was wrapped up too tightly for anyone, including him, to see just how true that assessment was, made it all the hotter.</p><p>\"Was this planned from the beginning, Mr. Baptiste?\" she asked in a tight voice, her eyes locking with his across the elevator.</p><p>\"What's that, Miss Burel?\"</p><p>\"The sleepover?\"</p><p>His body twitched. \"There was always a possibility our mission would take more than a few hours.\" He crossed his arms over his chest and regarded her.</p><p>\"Something you're clearly aware of as you brought a bag with you. So, what are you really asking?\"</p><p>She swallowed tightly and shrugged.</p><p>\"Just want to know if there's something more going on.\"</p><p>\"Like what?\"</p><p>She gave him a sharp look. \"You're really going to make me say it?\" His mouth twitched. \"Yes, I think I am.\"</p><p>She took a deep breath. \"Are you trying to seduce me, Mr. Baptiste?\" Just the query alone had his heated blood ratcheting up to blistering, and his fingers flexing with the need to rip clothing from skin. This female was making him crazy, and he wasn't sure exactly why. She was beautiful and sexy and intriguing, but it was more than that.</p><p>He pushed away from the wall and moved toward her. Her scent wrapped around him, infusing his skin, permeating his nostrils with every step. Michel had been right. She smelled like flowers and twilight, and it pissed him off to no end that the Suit had been the one to notice it first.</p><p>Her eyes grew wide with his</p><p>approach, and she drew back, her shoulders hitting the smooth suede walls of the elevator.</p><p>\"Seduction is a fallacy, Miss Burel,\" he said, coming to stand before her. \"A way to diminish your own wants, deny what your body needs, refuse</p><p>responsibility for taking what belongs to you.\" He couldn't help himself. He inhaled deeply. Then cursed. \"If your mouth is ready, your eyes are pleading, your hands are itching to grab and grope, and your pussy is hot and wet and turning the cool air around you into steam, then its mutual. And if it's not? A simple no is all it takes for an honorable male to back the fuck off.\"</p><p>The elevator was moving upward like a goddamn snail, yet Genevieve's breathing was rapid.</p><p>He watched as her tongue slipped from her mouth and swiped at her bottom lip.</p><p>\"I could do that for you,\" he whispered. \"I want to.\"</p><p>Her eyes lifted to connect with his.</p><p>White fire swimming in bayou blue.</p><p>God, she was gorgeous. Debilitatingly so.</p><p>\"And you want me to, don't you, Miss Burel? You want me to lick you?\" Her nostrils flared, and a soft whimper escaped her throat.</p><p>\"I'll admit it. Don't think I can stop myself.\" Or my cat. \"I've wanted to taste you since the moment I saw you.\" He leaned in, near her ear. \"And not just your mouth.\"</p><p>Her sharp inhale made him growl.</p><p>And the scent of her arousal grabbed hold of the innocent waft of magnolia flowers and the bayou at twilight and shoved them aside, claiming Jean-Baptiste's nostrils, and making his cock swell painfully.</p><p>\"The door,\" she whispered in a pained, breathless voice.</p><p>\"What door?\" he uttered, running his nose across her cheek.</p><p>\"Behind you.\"</p><p>Her skin was so damned soft. He knew it would be soft in other places, too. Her belly, her lower back, behind her knees, between her thighs...</p><p>\"We're here,\" she continued almost painfully.</p><p>Fuck.</p><p>He eased back, his teeth grinding together, his entire body rigid with a hunger he knew he shouldn't be encouraging. His cat was already scratching to get out, get at her, and the feline didn't give a shit where it showed up and who it took out these days. With the way this female was staring at him-</p><p>with longing and fear and sexual curiosity in her sleepy eyes-he wouldn't be able to control the wild cat if it broke free.</p><p>\"What now?\" she whispered, her eyes drinking him in.</p><p>\"We could take another ride,\" he uttered. Goddammit. He was an idiot.</p><p>She nodded slightly.</p><p>\"Or we could get off here.\" He grinned. Dangerous, foolish, bastard.</p><p>His words, and their double meaning, weren't lost on her, and she blushed furiously, prettily. He wondered if she grew pink all over when she was teased.</p><p>His eyes flicked up, past her blond bun, to see the open elevator and beveled glass door of the suite a few feet ahead. There was nothing he wanted more in that moment than to remove each one of those hundred or so buttons on her shirt, and stare, then touch, then feast on what was beneath. But he wasn't going to be that big of a selfish prick. Even if he could keep his cat caged long enough to taste her, he could never be the male for her. He could never offer her a mating. And she was the kind of female who would not only require it, but who wholeheartedly deserved it.</p><p>He growled softly, grabbed her hand and her bag, and led her out of the elevator. Xavier had been right about two things: her intelligence and her starched collars. But besides that, the male didn't know shit. This female was not only hot and sexy, but she was intriguing and innocent. And if Jean-Baptiste had been the male he was before, the one with unmarked skin, an optimistic attitude and a cat he could cage with only a thought, he would've dropped to his knees and asked Genevieve Burel to consider his imprint.</p><p>Shit, maybe even consider him as a mate-and the only male who would ever be allowed to see and explore the soft, sexual playground she hid beneath all that fabric. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Genevieve encircled the hotel suite's sumptuous living room furniture for the fifth time, her cell phone pressed to her ear. Her skin was still humming from the elevator encounter with Jean-Baptiste, and her mind refused to drop the memory curtain on his face, his eyes, those lips.</p><p>She didn't understand what was happening to her, and why she didn't seem capable of releasing it, forgetting it. He was gorgeous, yes. Had a body so long and heavy with muscle that she felt tiny and nondescript in comparison. He wore that dangerous, mysterious, don't-get-too-close attitude like a second and very sexy skin. But she was a smart female. Logical and thoughtful. She had a job to do. A future to procure. A home and family to save and protect. And no male-not even the very captivating Jean-Baptiste-was going to get in the way of that.</p><p>No matter how much her body begged her to think otherwise.</p><p>\"Dammit,\" she grumbled, then yanked herself back to reality as the female on the other end of the line questioned her outburst. \"No, no,\" Genevieve said quickly. \"Nothing to do with you.</p> <p>Everything's fine, and I'll be home in the morning. I promise.\"</p><p>\"Don't make promises you can't keep, Miss Burel,\" came a sharp, masculine growl behind her.</p><p>Genevieve startled, jabbed at the off button.</p><p>\"Canceling that hot date?\" he continued.</p><p>\"I told you, I don't have a...\" Her words died away, never to be found again, as she turned around and her eyes focused on the drool-worthy specimen before her.</p> <p>Standing in the bedroom doorway, only a white towel wrapped around his lean hips, was Jean-Baptiste. Clearly he'd just come from the shower because his hair was wet and slicked back from his face, and a few water droplets clung to the heavily tattooed skin of his hard chest. Her gaze ate up every inch, every marking, every color. She'd seen the skull and tribal ink adorning his neck and collarbone, but beneath that, covering his broad shoulders and down both massive biceps, were two gold and black pumas baring their teeth. Artistic lines of green and blue seemed to move beneath their paws, like water and grass, like the bayou.</p><p>Her perusal continued inward. His pectorals were free of ink, but one nipple was pierced, and down at the very base of his ripped abdominals the word Pantera was scrawled in cat-scratch markings.</p><p>For one brief second, Genevieve nearly demanded he turn around. God, she wanted to see his back, wanted to see what kind of tattoos had been inked into his smooth, tanned, thickly muscled skin.</p><p>But then her sane mind returned.</p><p>\"I thought that was my room,\" she said, gesturing behind him.</p><p>\"It is.\"</p> <p>\"And my shower.\"</p><p>He sniffed with irritation. \"I have a bathtub.\"</p><p>\"And that's a problem?\"</p><p>\"I don't do bathtubs, Miss Burel.\" His eyebrow lifted. \"Unless I have company.\"</p><p>She might have had her sane mind back, but her body was still completely and totally refusing her call for control.</p><p>Her legs were doing that made-out-of-water thing again, and her skin was pulling tight around her muscles. She could do nothing to stop it. This strange, new compulsion to attack.</p><p>Lust and deep sexual interest had never played a part in her life. She'd been too busy with establishing her career and caring for her Grands. And lately, refusing to be angry with her parents for acting cowardly and taking off, leaving her to deal with the dying magic inside their home. Sure, she'd found males attractive. But wanting them? Needing to feel their skin? Taste their lips? Run her fingers through their hair as she growled and begged them for all things dirty?</p><p>Not until now.</p> <p>Until Jean-Baptiste.</p><p>Her stomach clenched. This...this attraction, this lust, this hunger, this desire to run at him and lick her way down his throat, chest, abdominals, hipbones...</p><p>It was going to ruin her if she let it.</p><p>Working alongside the elders required full focus, a vow of chastity, and a gold star with this mission. She could not allow herself to be swayed.</p><p>\"So, who was that on the phone?\" he demanded.</p><p>Genevieve started toward him. If she could just get past him, get into her bedroom and close the door...</p><p>\"I was just letting my family know I'm all right.\"</p><p>\"They worry about you?\"</p><p>\"Of course.\" She moved around the leather couch.</p><p>\"You don't seem like the kind of female who would make a parent worry.\"</p><p>Unlike you, Mr. Baptiste. \"I'm afraid I don't know what that means.\" His mouth curved into a wicked smile. \"Yes, you do.\"</p><p>She stopped before him, waited for him to move aside. But he didn't. \"You have very strong opinions about who I am, Mr. Baptiste. I'm curious to know where that comes from. Are you listening to rumors, or simply judging a book by its cover?\"</p><p>He looked her up and down. \"Which one would bother you more?\"</p><p>\"I'm not sure.\"</p><p>\"You should be sure, Miss Burel.</p><p>Because one is understandable, the other is not.\"</p><p>\"And which one are you?\" God, he smelled good. Like soap and hungry puma.</p><p>His eyes lifted to meet hers. \"Let's just say we all make judgments based on appearances.\"</p><p>So, he'd heard rumors about her?</p><p>Who the hell was talking about her?</p><p>And what were they saying?</p><p>\"You may think it's understandable, but I don't judge others,\" she said, trying like hell to control her breathing. He was just so close. His clean scent, and all that naked, heavily inked, heavily muscled skin was making her dizzy. If her legs buckled and she fell, would he catch her? Maybe she should try it and see.</p><p>\"Come now, Miss Burel. Don't</p><p>pretend you didn't take one look at me, at this,\" he pointed to his lip, \"and these,\" he brushed a hand across his shoulder, \"and decide I'm bad news.\" Lucky hand. Lucky, lucky hand. \"I'm not going to deny it,\" she said primly.</p><p>\"But I think my judgment in this case was right on.\"</p><p>His eyebrow-the one with the metal</p><p>-jacked up.</p><p>Her eyes locked with his. \"You are bad news, Mr. Baptiste.\"</p><p>\"I've done nothing to you, Miss Burel.\"</p><p>Nothing except make me question the direction of my future. Nothing except make me forget again and again why I'm here.</p><p>He reached out then, and touched her hair, snagged a piece that had long ago escaped her miserable bun, and wrapped it gently around his index finger. \"You have beautiful hair. Feels like silk in my hand.\"</p><p>\"Thank you.\" God, what else could she say? Her heart slammed against her ribs.</p><p>His eyes narrowed on the crown of her head, at her bun. \"I have this irrepressible urge to take it down. I want to see what all that pale gold looks like floating around your face, kissing your neck, playing against the pale skin of your shoulders.\"</p><p>Her chest tightened. Her breasts and nipples, too. \"You mean against the fabric of my shirt.\"</p><p>He shook his head. \"No, Miss Burel.</p><p>That's not what I mean.\"</p><p>Her stomach clenched with</p><p>awareness, and below her waist, between her unsteady legs, she felt the heat in her sex turn liquid. Her lips parted and she started to pant. The button at her throat once again constricted her breathing, and she touched it with her fingers. Maybe she could undo just one button...</p><p>A knock at the door startled them both.</p><p>\"Dammit.\" Growling with true</p><p>menace, Jean-Baptiste stalked past her.</p><p>Genevieve took the opportunity to make a break for her room, for safety, for a place to get her head on straight.</p><p>\"You get that door,\" she called after him. \"And I'll get this one.\" The last thing she heard was a great whoosh of air as Jean-Baptiste hauled back the thickly beveled glass, then snarled at whoever stood on the other side.</p><p>He'd put clothes on.</p><p>He'd even set the table.</p><p>But as he stared across the black marble at Genevieve, all he wanted to do was strip them both bare and take her on top of the china.</p><p>She was drinking a beer. That's all she was doing. But it was the way she was doing it that was making his cock stand up tall and scream for an exit inside his jeans. Her long, pale fingers were wrapped around the bronze, pony neck, and her lips were sealed against the wet rim as she swallowed.</p><p>Fuck, he was in trouble.</p><p>His cat snarled and spit inside his chest in agreement.</p><p>Stay put, you bastard.</p><p>Never in million years would he have pegged this female for a beer drinker.</p><p>Possibly a margarita. Wine, maybe.</p><p>Shirley Temple, more like.</p><p>She looked up then and caught him staring. She gestured to the full plate in front of him with that nearly drained Bayou Bock in her hand. \"You're not eating.\"</p><p>Very observant, Miss Burel. I'm too busy watching, lusting, and trying to keep my cat caged and my steel prick from exploding.</p><p>\"I'll get to it,\" he muttered.</p><p>\"Well, don't wait until it gets cold,\" she admonished. \"It's amazing. Best etouffee I've ever had. It was nice of your spy friend to arrange this.\" She cocked her head. \"Michel, wasn't it?\"</p><p>\"Something like that,\" Jean-Baptiste said, not liking the Suit's name on her lips. \"And he's not being nice. Males don't think that way. Pantera males don't think that way.\"</p><p>She paused, fork halfway to her mouth. \"Really?\"</p><p>\"We stalk, claim and possess, Miss Burel. We're natural predators. We see something we want, and we go after it.\" He stabbed his fork into the center of the catfish and came up with a steaming chunk of white flesh. \"He was trying to impress you.\"</p><p>She looked thoughtful for a moment, then grinned. \"Well, if he really wanted to impress me he would've had them bring beignets and coffee along with this etouffee.\"</p><p>\"I'll let him know for next time,\" Jean-Baptiste said, then stuffed the fish into his mouth.</p><p>\"You will?\" she asked, slightly taken aback.</p><p>\"No.\"</p><p>She laughed. Then took another bite of her food and groaned happily. \"What do you think of the catfish? I like it spicy, don't you?\"</p><p>Did she have to keep taunting him unknowingly? Christ, he could practically feel the malachite leaching from him. \"Just like mama used to make,\" he said.</p><p>\"Really?\"</p><p>\"No.\" He glanced up. His face broke into a smile that mirrored hers. Damn, he couldn't help himself. \"She's not much of a cook. How about yours?\"</p><p>That smile suddenly died. \"She was.\" She started picking at her rice.</p><p>Shit. \"I'm sorry.\"</p><p>She shook her head. \"It's okay. It's just me and my Grands now.\"</p><p>\"You live with your grandparents?\" She nodded.</p><p>Was that who she was on the phone with? And why did that belief, that hope, fill him with far too much relief?</p><p>\"Do you live with your family?\" she asked.</p><p>\"No. Haven't for many, many years.\" He took another bite of fish. \"They're Nurturers. Very important. Very brilliant. Very consumed with their work.\"</p><p>She nodded her understanding. \"So no family dinners.\"</p><p>\"Not since I was five.\"</p><p>She studied him for a moment. \"That bothers you, doesn't it?\"</p><p>He shrugged. \"You know, what kid doesn't want his family crowded around a table, barking at him to sit up straight, to stop making disgusting noises, eat his peas?\"</p><p>She laughed. The sound was like fucking church bells. \"Most kids don't want that, Mr. Baptiste. To be bossed around.\"</p><p>\"Sure they do.\" He put down his fork.</p><p>His eyes locked with hers. \"They may gripe about it, but they want it. They want the structure and the boundaries and someone to take control so they don't have to. All that strictness and nitpicking-just means someone loves you enough to give a shit.\"</p><p>Her mouth fell open, but she didn't say anything. She just stared at him, her eyes boring a hole in his head.</p><p>\"What?\" he said.</p><p>\"You.\"</p><p>His chest squeezed with tension. And maybe the thing beating rapidly inside it, too. \"What about me?\"</p><p>\"Never judge a book by its cover?\" She shrugged, her eyes glowing a little.</p><p>\"Never again.\"</p><p>He nodded. \"Back atcha, Miss</p><p>Burel.\" He tipped his beer bottle in her direction, and she instantly scooped hers up and gave his a solid clink.</p><p>\"And who knows?\" she said, after taking a quick swig. \"Maybe you'll have it.\"</p><p>His brows knit together. \"Have what?\"</p><p>\"A cub to boss around at the dinner table.\"</p><p>His gut tightened. \"Odds are against it, don't you think? Fifty years and counting.\"</p><p>\"There's Ashe.\"</p><p>\"She human.\"</p><p>\"So, go get yourself a human.\" This time, it wasn't just his gut that tightened. It was every damn part of him.</p><p>Even his fingers curled around his fork.</p><p>\"I don't want a human.\"</p><p>\"How do you know?\"</p><p>\"I know.\"</p><p>\"Maybe you just haven't met the right</p><p>-\"</p><p>\"What are you doing, Miss Burel?\" he said, placing his fork on his plate.</p><p>She shook her head, her eyes uneasy, taken aback by his gruff response. \"What do you mean? I'm just talking-\"</p><p>\"Do you want me to go out and find a human? Really?\"</p><p>She started chewing her lip. \"I don't understand what you're-\"</p><p>\"Yes, you do. \" He leaned forward, his meal completely forgotten now.</p><p>\"Acting naive is almost as grating as believing you've been seduced.\" His eyes narrowed on her gorgeous face and his voice lowered almost</p><p>conspiratorially. \"Tell me, Miss Burel.</p><p>Can you continue to sit here, across from me and pretend there's nothing going on?</p><p>Nothing between us? Eat and drink and talk about our families and our history when all we want to do is answer the real questions on our minds?</p><p>She looked startled, and her cheeks flushed.</p><p>\"What does she taste like?\" he continued. \"How would his arms feel around me? Would she like it slow and deep, or completely and totally out of control?\"</p><p>\"Oh my god,\" she uttered hoarsely.</p><p>\"I don't think I can pretend, Miss Burel.\" He stood up. \"Never been any good at it.\"</p><p>\"Sit down and eat. Please.\"</p><p>\"No.\"</p><p>\"It's getting cold.\"</p><p>\"I'm not hungry,\" he growled.</p><p>She closed her eyes for a brief moment and whispered, \"Neither am I.\"</p><p>\"Then what the fuck are we doing?\" With a roar of lust-fueled ire, Jean-Baptiste swiped at the food on the table, sending it crashing to the ground. He heard Genevieve gasp, but all he wanted to do was get to her. He jumped onto the table, then leapt down on her side. His puma pacing inside his chest, he had her in his arms before she even had time to fully register what had happened.</p><p>\"What are we doing?\" she uttered, panic-stricken.</p><p>\"Exactly what we both want.\"</p><p>\"I can't...\"</p><p>\"You already are,\" he returned, lifting her up, placing her on the table.</p><p>\"I should go to bed,\" she whimpered.</p><p>\"And we should forget this ever happened.\"</p><p>\"What you're going to do, is keep your eyes open and brace yourself. After I take your mouth for a good long while, I'll be working my way down to all the bits and pieces you keep so tantalizingly and irritatingly covered.\"</p><p>Her eyes widened, but she whispered the only word that mattered to him in that moment. \"Okay.\"</p><p>\"Don't be afraid, Miss Burel. This won't hurt a bit.\" He ran his teeth over his lower lip, tugging at the silver hoops.</p><p>\"Unless you want it to.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Heat, tension and anticipation barreled though Genevieve as Jean-Baptiste tugged her to the very edge of the marble table, then splayed her legs with one of his powerful thighs. The table that had once held their dinner, she thought inanely- the dinner which was now somewhere on the floor. Maybe on the walls, too.</p><p>But did she care?</p><p>No, she did not.</p><p>He took up residence in the empty space between her legs, so big, so imposing, his hands plunging into her hair, and his gaze roaming over her with such predatory hunger she broke out in goose bumps. Clearly, this male was accustomed to taking what he wanted-</p><p>no questions, no invitations-and Genevieve was stunned to realize just how sexy and irresistible she found that.</p><p>His nostrils flared as he breathed her in, and his fingers pressed into her scalp.</p><p>He looked on the verge of attacking, and for one brief second, Genevieve swore she saw his puma push through his skin, saw his canines drop and his eyes flash gold.</p><p>But then his mouth covered hers, his body pressed against hers, and she forgot everything.</p><p>He feasted upon her like a starving male, his tongue plunging into her mouth, demanding a groan, a moan, a cry of his name, and she gave him all three. It was the most perfect, lusty, mind-blowing, sensual kiss she'd ever experienced, and she wanted more. So much more.</p><p>Everything above and below her waist ran hot and suddenly frantic, and she curled her arms around his neck and clung to him as he took her mouth in kiss after kiss of perfect ocean waves; wet and pliant and drugging. She could feel the smooth metal of his lip piercings pressing into her skin, and it made her crazy with desire. She dropped her head back, forcing him to release her, just enough so she could run her tongue across the cool silver.</p><p>A sexual growl escaped Jean-</p><p>Baptiste's throat, and he tried to nip at her, lap at her tongue. But she wouldn't allow it. She grinned wickedly, hungrily, and drove her fingers up into his dark hair, cupping his scalp. God, she felt out of her mind. Irrational. Uncaring about anything except this, him, her. Is this what lust was? The desperate need for another? Wanting him, needing him, as badly as you needed air or sunlight?</p><p>Because truly, Genevieve had never wanted anything or anyone more in her life.</p><p>His eyes locked on her then, but her focus was entirely on those hoops. She'd thought about them so many times since they'd met. Now she was going to know.</p><p>Slowly, gently, she let her tongue probe inside the first ring. Then, just a hair inside the second. She heard him curse under his breath, felt his arms leave her hair and grip her hips. He yanked her closer, and she felt his cock pulse against the apex of her thighs. Her breathing turned ragged, and her mind went blank except for one thing, the one impulse she knew she couldn't shake.</p><p>She curled her tongue around the silver rings and tugged.</p><p>It was as if she'd unleashed a wild animal. With that one simple movement, Jean-Baptiste's face went from a sensual hunger to a mask of fierce, feline possessiveness. He glared at her.</p><p>Snarled at her. Sweat broke on his brow, his eyes flashed burnt gold and he looked ready to attack.</p><p>Maybe she should've been scared. Or at least, cautious. But when she eased her tongue from the rings, she grinned.</p><p>\"Lie back,\" he growled at her.</p><p>\"Now.\"</p><p>Her heart slamming against her ribs in a rhythm of total thrill and desire, she let him guide her; one arm under her shoulder blades, one pressing at her hip, until she was completely stretched out on the black marble dining table. The room was lit by soft electric lights, and the pale gold walls etched in black created an intimate, opulent, feel.</p><p>\"Knees up, Miss Burel,\" he</p> <p>commanded, his voice a rough snarl of desire.</p><p>Every inch of Genevieve was shaking.</p><p>From fear, from the delicious unknown, from unbearable anticipation, from overwhelming need. Jean-Baptiste's hands found the edges of her skirt and not so slowly, or so gently, pushed the fabric up all the way to her waist. Liquid heat pooled into Genevieve's sex and trickled down her thigh. She knew he could see it, but she didn't care. She felt no shame. Only a desire to move, to demonstrate how badly she wanted this</p><p>-wanted him.</p><p>His eyes flashing gold, Jean-Baptiste found the waistband of her underwear and curled his fingers around it.</p><p>Genevieve bit her lip and groaned. Do it, she urged him, arching her back, canting her hips. Do it now before I lose my mind. Or my will. But instead of pulling down the damp, pale blue silk, he grabbed hold of it with his teeth, and ripped them right off of her.</p><p>\"Now this is what I was hungry for, Miss Burel.\"</p><p>He eased her thighs even farther apart, then shouldered his way between them.</p><p>\"So pretty,\" he whispered. \"So wet. I can see your clit pulsing, Miss Burel. It calls to me, begs me to take it in my mouth and suckle.\"</p><p>The muscles inside Genevieve's pussy clenched, and her nipples tightened beneath the soft fabric of her bra.</p><p>Jean-Baptiste dropped his head and strung kisses across her hipbones; slow, hot kisses, the silver hoops gently scraping against her flesh. Genevieve stilled, her breath little pants interspersed with swallows of saliva.</p><p>She'd never been kissed there before, but she'd fantasized about it too many times to count. A male's head between her legs, his fingers gripping her inner thighs almost to the point of pain as he slid his hot tongue through her wet folds.</p><p>\"So pink and swollen,\" Jean-Baptiste whispered, his fingers easing her lips apart, one brushing over the sensitive bud of her clit. \"As your sex cries, rains down, down, into a true river of pleasure.\"</p><p>\"Oh, god,\" she uttered, wanting to drag herself up, see what he was doing</p><p>-watch him. But she just felt too dizzy, too heavy.</p><p>His breath...it was close...so close and warm against her pussy as he circled her clit gently with his finger.</p><p>\"Please,\" she moaned, begged, her hips lifting, straining for more, for everything.</p><p>\"Soon, Miss Burel,\" he whispered, his mouth so close now she could feel the cool edges of his lip piercing against her opening. \"I just want to see how tight you are before I eat you.\"</p><p>And with that, he drove his tongue up, so deep inside her pussy Genevieve cried out. Her hands tensed and her nails scratched against the marble at her back.</p><p>She couldn't stop herself, couldn't slow herself. She writhed and pumped, the feeling so shockingly perfect, she believed in that moment that she might go mad if she didn't have this-him-</p><p>twenty-four hours a day for the rest of her life.</p><p>He eased out, lifted his head and locked eyes with her. \"You, Miss Burel, are the sweetest, most tempting thing I've ever had on my tongue.\"</p><p>She stared at him, panting, her entire body on fire, her hips thrust up in a silent plea. \"Please don't stop,\" she whimpered.</p><p>He chuckled wickedly, his eyes so gold they looked on fire. \"Oh, Miss Burel. I'm just getting started. It's a feast I plan to savor.\"</p><p>His head dropped then, and his tongue made one long sweep from her pussy straight up to her clit. Crying out softly, Genevieve closed her eyes, and gave up everything from her past and everything in her future to accept this incredible, perfect, pleasure-filled moment.</p><p>Her thighs trembled uncontrollably as he licked her, as he made slow circles around her tight, hot bud. She made sounds from somewhere otherworldly, deep in her chest, her throat. And when his lips closed around her clit, when he started to suckle, his head lifting and lowering rhythmically, stunningly, she came apart.</p><p>\"Jean-Baptiste!\" she called out, her head thrashing from side to side against the cool, hard marble. \"Yes! Please, yes!\"</p><p>A fearsome growl escaped his throat, and he forced her legs even wider apart, burying himself even deeper as he started flicking her clit with his tongue.</p><p>Over and over, back and forth, so fast, she felt tears behind her eyes. She bit down on her lip to halt them, her head pounding, her heart slamming so hard inside her ribs she was sure they were getting bruised.</p><p>Everything inside of her, every pain, every hope, every secret burst like an emotional and physical dam, and she was nothing but raw lust and</p><p>unapologetic need. As his tongue worked her, and his growls and groans intensified, Genevieve came. She came so hard she couldn't breathe, pressing her mound against his mouth and rough chin as she writhed and convulsed, circling her hips, squeezing her muscles as she took wave after wave of orgasm.</p><p>Before she was even replete, before the breath held inside her lungs had a chance to escape, Jean-Baptiste lifted her boneless frame into his arms and stood. \"I'm taking you to bed, Miss Burel.\"</p><p>\"Wait,\" she said breathlessly, clinging to him.</p><p>\"What is it?\" His tone was rough and impatient and fierce. \"I don't think I have it in me to discuss or flirt. If I don't fuck you this very instant, my cat will destroy my insides and I'll take care of the rest.\"</p><p>\"I'm not Miss Burel,\" she whispered.</p><p>\"What?\"</p><p>\"Not right now,\" she said, her drowsy eyes opening to meet his blistering amber gaze. \"Not tonight. Not when you're inside of me. Do you</p><p>understand?\"</p><p>His nostrils flared and he nodded.</p><p>\"Genevieve,\" he snarled hungrily as he headed for his bedroom. \"Beautiful, provocative Genny.\"</p><p>Jean-Baptiste stalked down the hall, removing as many pieces of clothing as he could. His. Hers. Fuck if he knew or cared. He just wanted them skin to skin as quickly as possible. He'd never felt this frantic, this desperate to connect, to feel, to know a female.</p><p>And it scared the shit out of him.</p><p>The lights were out in the bedroom, but the moon shone bride-white and brilliant through the open balcony windows. Enough for him to see her incredible face, her hungry eyes. And when his thighs hit the edge of the bed, when he gathered up the comforter, tossed it to the floor and laid her out on her back, her golden skin against stark white sheets, her exquisite body.</p><p>He growled as he settled her against the mattress. He'd done pretty damn well in stripping her. The bun was no more, and the shirt was gone, pearl buttons no doubt leading a pathway from the living room to the bedroom like opalescent breadcrumbs. All she had on now was her bra and that skirt he'd yanked to her hips on the marble table.</p><p>The skirt that was nearly ripped from hem to waist.</p><p>Shit. He'd get her a new one.</p><p>He'd get her twenty new ones.</p><p>His eyes clung to her curves, her mouth, her wide, eager gaze as he yanked off his jeans and T-shirt. When he saw her hands disappear behind her back, working the clasp on her pale pink bra, he loomed over her, growling.</p><p>\"That's my job, Genevieve.\"</p><p>Her hands stilled and her eyes flipped up to meet his. \"I like that. The way you say my name.\"</p><p>Something hot and liquid moved through him, and it had nothing to do with sexual desire. Jean-Baptiste dipped his head, slid a canine inside the front of her bra and tugged. There was a quick pop and Genevieve gasped. Both silky pink cups flew to opposite sides, revealing a pair of the most spectacular breasts he had ever seen.</p><p>His mouth started to water.</p><p>\"And I like that, too,\" she said breathlessly, her gaze raking over him; his face, neck, his chest. \"And these,\" she continued, putting her hands on his forearms, moving up, over his pumas, tracing the lines of the water and grass.</p><p>\"Did they hurt?\"</p><p>He shook his head, jaw tight. He was poised above her, his muscles straining, his skin vibrating, his cock so hard it could drill granite. He'd never wanted anything more. To be inside this female, so deep he lost himself. So wet, he drowned. So enveloped, all thought and anxiety bled from him.</p><p>\"Maybe I'll get a tattoo,\" she whispered.</p><p>Fuck. He spread her legs with one thigh and demanded, \"Where?\"</p><p>Her gaze slid from his neck to his eyes. \"I don't know. Any suggestions?</p><p>My back? My hip? My ankle? My inner thigh?\"</p><p>\"Oh, Genny,\" he breathed, dropping his head, nuzzling the underside of her breast. \"You have such beautiful skin.</p><p>So perfect.\"</p><p>He lapped at one dusky pink nipple and she gasped, wriggled beneath him.</p><p>\"I think the only mark you should have on your body is mine.\"</p><p>Her eyes slammed up to his. \"What?\" He grinned. \"You heard me. And you know what I meant by it.\"</p><p>He dipped his head again, but this time he took her nipple into his mouth and suckled it deep. A groan escaped her throat, raw and hungry, and her back arched off the bed. God, she tasted so sweet. He was never going to be able to forget it, forget her. His cat was right there with him, wanting the same thing.</p><p>Snarling, threatening to emerge if it wasn't satisfied.</p><p>For one brief second, Jean-Baptiste felt the feline at the surface of his skin, felt the beginnings of a shift, but then Genevieve reached for him-her hand sliding between her bodies, her fingers wrapping around the trunk of his cock-</p><p>and the puma growled and retreated back into its cage.</p><p>While she stroked him languidly, possessively, Jean-Baptiste turned to her other plump breast and suckled that one, too. He drew the fiercely tight nipple deep into his mouth until she cried out, until she squeezed the head of his dick-</p><p>until pre-come rushed from both their sexes.</p><p>He knew the words he'd uttered to her had been impulsive as hell. The offer, the claim to mark her. But it had also been real and true, and had come from deep within his guts. How the fuck had he managed to meet the one female in the world who was meant for him? It was a goddamn miracle-and one he wasn't about to turn away from. Maybe he wasn't the best male for her. Not now.</p><p>Not yet. But he wanted to be. He'd find a way to be.</p><p>As he circled her nipple with his tongue, then flicked it sharply up and down, back and forth, she moaned and gasped and writhed beneath him. Her thumb played with the pre-come at the head of his cock as he trailed his hand down over her ribs, to her flat stomach, to her hipbones and into the smooth curve of her sex. When he felt the fire, the molten lava between her legs, he nearly came.</p><p>\"Sweet, Genny,\" he whispered</p><p>against her breast. \"You're creaming, ma cherie. Your thighs, your hot pussy and my sheets are drenched.\" He ran his teeth over her nipple. \"Just the way I like it.\"</p><p>\"Jean-Baptiste, please,\" she said breathlessly, wriggling against his wrist, wanting his hand, needing to be filled.</p><p>And when he thrust two fingers up inside her slick, tight channel, she screamed his name again.</p><p>Tight, wet heat gripped his fingers, and he moaned and lifted his head. Her eyes were glassy and large and pinned to his face. Her lips were parted and she was panting.</p><p>Shit, he wouldn't last at this rate. One drive into her pussy and his cock was going to explode.</p><p>He took her mouth in a series of hungry, possessive, painful kisses as he growled against her lips, and his fingers pumped inside her slowly and</p><p>rhythmically.</p><p>\"Please, Jean-Baptiste,\" she</p><p>murmured, nipping at his bottom lip as she wrapped her legs around his waist.</p><p>\"Please come inside me. I need to know.</p><p>I need to know how you feel.\" I need you.</p><p>The realization, the absolute truth in that thought, thundered through him, and he eased his fingers out of her, grabbed his stiff cock and pressed it against the plump, pink folds that guarded her slick pussy. He glanced down, saw the way her flesh hugged the head of his dick, beckoned him inside, creamed around him in anticipation.</p><p>And then she jacked up her hips, taking him inside her just an inch or two.</p><p>Jean-Baptiste felt his mind retreating and his body taking over.</p><p>Mine.</p><p>You belong to me.</p><p>He slid his hands beneath her hips, cupped her ass and lifted her, letting her body take him, one inch at a time until he was buried inside of her. Her eyes dropping closed, her face tensing and her throat releasing groan after groan, Baptiste guided her back and forth, her pussy fucking his cock. It was the most perfect feeling in the world, and he knew in that moment that if anyone tried to come between them, if anyone even looked at this female with lust in their eyes, he would attack to kill.</p><p>He eased her hips to the mattress, released her, only to spread her legs wider. He placed his hands on her inner thighs and started thrusting.</p><p>She cried out. \"Yes! God, yes!\"</p><p>\"Your pussy is milking me, Genny,\" he said through gritted teeth. \"It's like blisteringly hot ocean waves all the way down my cock, ma cherie. I don't know how long I can last.\"</p><p>She was gone, her head thrashing from side to side on the mattress. Jean-Baptiste pulled out, just partway so he could see her, him, their connection. Her dusky pink lips were wrapped around his cock, coating him in her sweet juices. Christ, if he could lick her and fuck her at the same time, he would.</p><p>His head dipped and he closed his lips around one luscious tit. As he pumped inside of her, he drew on that nipple, flicking it with his tongue. Inside her pussy, the honey sweet walls were spasming, electric currents and waves of wet heat.</p><p>\"Jean-Baptiste!\" she cried out, stiffening beneath him.</p><p>He battered her womb, suckled her nipple deep, as she came. With every thrust, he growled. With every new wave of orgasm, he cursed. With every roll of his hips, he claimed what had belonged to him the moment she'd walked onto that porch and eyed him warily, that goddamn blouse buttoned up to her chin.</p><p>She wasn't buttoned up now, he mused, fucking her so deep she cried out again. She was bare. Skin glistening with sweat, stomach muscles flexed, ripe breasts bouncing with every thrust, neck and jaw tense, lips parted as she breathed heavy and lustful.</p><p>She was his.</p><p>And when her slick channel</p><p>convulsed for the third time that night, when she reached up, ran her fingers over his nipple, and tugged at the metal running through it, he exploded.</p><p>Pounding into her with utter and complete abandon, his body shaking and his balls tightening, he came, so hard and intense he felt something impossible overtake him. No. Not overtake him.</p><p>Retreat inside him.</p><p>The cat.</p><p>He thrust up inside her one last time, and stayed there, buried against her womb, her warmth. Then he rolled them both to the side, and, breathing heavily, wrapped his arms around her and pulled her close. His heart was slamming against his ribs; his mind going nuts. He found her gaze. Her eyes were the bluest he'd ever seen them. And soft and satisfied and...dare he say, happy?</p><p>But inside himself, a miracle was taking place. The out-of-control, barely caged cat that he'd been trying to keep hidden for so long was purring. Fuck.</p><p>The feline was nearly asleep. His tats and his piercings, and the malachite had never even come close to making him feel like this. Like her.</p><p>Genevieve.</p><p>His beautiful, sweet, and</p><p>debilitatingly sexy Genny.</p><p>She controlled his cat.</p><p>Genevieve ran her hand up his arm, over the bulging muscle, over the growling pumas to his shoulder and neck. He was too beautiful.</p><p>Oh, god. What had she done?</p><p>What blissful, amazing, mind-bending act had she given into? Begged for?</p><p>Wanted again, even now.</p><p>Jean-Baptiste was right. Seduction was a lie, an excuse-something you used to protect yourself from the vulnerability of asking for what you wanted.</p><p>She released a breath, her eyes connecting to his under the haze of moonlight streaming in through the window. Here she was, curled around this spectacular male, his arms protecting her, his gaze fiercely possessive, his cock still stiff and pulsing inside of her. And she never wanted to move again. Her throat felt suddenly tight. How was she ever going to walk away and forget this, forget him?</p><p>How was she going to continue her quest and her mission when the sun rose the next day? Make sure Isi remained where she was, and then return to the Wildlands and a life that could never include him? Them? This...</p><p>His brows moved together in a frown of concern. \"Genny?\"</p><p>She pulled eye contact and buried herself deeper against his chest. \"Don't go,\" she whispered into his skin. \"I want to stay like this a little while longer.\" Jean-Baptiste chuckled softly, his hands running down her back to cup her ass. \"A little while? Oh, ma cherie. We have all night.\"</p><p>No, Jean-Baptiste, she thought sadly, letting her eyes drift closed and her breathing soften. We only have one night. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Leaving the warm bed and sweet, soft body of his female had been the hardest thing Jean-Baptiste had ever had to do.</p><p>But it would pay off. In a grand surprise he hoped would please her, and show her that her first impression of him- bad news-was inaccurate.</p><p>Even at two a.m. the French Quarter was packed, in full party mode everywhere he looked-brimming with revelers. Everywhere but Isi's shop.</p><p>Jean-Baptiste slid the Jag into a vacant spot in front of the house and killed the engine. Black and quiet. This wasn't like her. Midnight to five a.m. were her prime working hours. Either she was avoiding certain customers, or straight-up avoiding him.</p> <p>She'd have known he'd return, that he wasn't going to accept one quick shut down about coming to the Wildlands.</p><p>She'd have known he'd try again. And she'd be prepared.</p><p>Jean-Baptiste evaded the front door, and circled around to the back. He wanted the window that led straight into the body art room, the one they'd spoken in earlier. The room he knew best.</p><p>He swung himself up into a nearby tree, then silently crept to the edge of a thick branch and reached for the latch on the window. But before his hand even made contact with the chipped white paint, the scent of something pungent shot into his nostrils. Whatever it was stung like hell, and made his brain go slow and fuzzy.</p><p>\"Was this head trip meant for me?\" he muttered with irritation. \"Or someone else?\"</p> <p>For anyone who wishes me harm.</p><p>The words blasted into his head, a near explosion of sound, and Jean-Baptiste whirled around, hissing as he reached for the red powder he carried in his pocket. She was somewhere above him, high in the tree, and though he couldn't see her, he could scent her.</p><p>Granted, if this had happened a few days ago-shit, a few hours ago even, before Genevieve had eased and stroked his feral cat-Isi's magic would've pulverized him, made his cat so insane he'd have been debilitated. He'd have fallen out of the tree, clutching his head and begging for the pain to stop.</p><p>But times had changed.</p><p>\"You know I don't want to hurt you,\" he said into the darkness, gripping the powder in one hand, swinging up onto another thick tree branch with the other.</p><p>\"But our kind is in serious trouble. Our borders are compromised, our magic is dying far faster than we realized, there's been an attack inside our lands, and the first Pantera cub conceived in over fifty years might not survive.\"</p> <p>\"What's wrong with you?\" Isi said, her voice strangely far away, though her scent remained immobile. \"You seem...</p><p>different. More powerful.\"</p><p>\"The cat's caged, Isi.\"</p><p>He heard her gasp. \"What?\" Then curse. \"I want to help you, okay?\" she said, her voice fearful and all over the place now. \"But I just can't.\" Jean-Baptiste took a deep breath and calmed his insides. \"I'm afraid you must.\"</p><p>His instincts were sharper than they'd been in years, and his nose had always been first rate. In under three seconds, he leapt to the top branch. He caught her gaze, her shocked expression just before he opened his hand and blew the red powder straight into her face.</p><p>\"Damn you, Baptiste,\" she uttered, her eyes rolling back in her head, her body swaying. \"I can't...I'm not meant to be there...\"</p><p>She passed out. But before she fell, Jean-Baptiste pulled her into his arms and held her close, then dropped easily from branch to branch until they hit the ground. As he headed around the side of the house and toward his car, he growled softly. He didn't relish in the fact that he was taking this female into the Wildlands against her will, but these were desperate times.</p><p>Not just for the Pantera.</p> <p>But for him.</p><p>Genevieve awoke to rich, yellow beams of sunlight, the earthy scent of coffee, the delicious feel of Jean-Baptiste's warm, thickly muscled body against her back, and the breath-stealing intrusion of his steel-hard cock slowly pushing inside her.</p><p>She instantly arched her back, groaning as she gave him better access.</p><p>Jean-Baptiste brought an arm around her waist and up to grip her shoulder. As he filled her, inch by wondrous inch, he pressed down on her shoulder, sending him as deep as possible.</p><p>Grinning, her entire body flaring with heat and hunger, Genevieve let her eyes drift downward. Jean-Baptiste's other hand had slipped between her legs and was working its way to her sex. The muscles inside her pussy clenched in anticipation, and she wasn't sure if she wanted to keep her back arched or swing her hips forward. But before she could even pull another thought from her already-fuzzy brain, she felt his teeth on her shoulder. Growling, he scraped gently over her skin as his fingers slipped into her wet pussy lips.</p><p>After that, it was impossible to do anything but give in and let her body react and respond.</p><p>Thrusting inside of her, nipping at her shoulder, circling her plump clit, Jean-Baptiste hit all the right spots, and Genevieve moaned and fisted the sheets and moved with him. God, being filled by him, taken by him, felt so right. Like the perfect breeze off the bayou, the perfect day when everything goes just as you planned it-the perfect kiss from the one male on earth who sees past your buttons and starch and into your splayed heart.</p><p>\"Genny,\" he uttered roughly. \"Just the thought of being inside you, so deep inside your tight pussy, is enough to make me come.\" He cursed and bit her shoulder again. \"But the reality...Christ, it's like a drug. A drug I never want to come off of. A drug I will never let anyone else near-\"</p><p>He pinched her clit. Lightly. But it was Genevieve's undoing.</p><p>She moaned, arched her back even farther, circled her hips over and over, feeling the volcanic rush of impending orgasm spread through her. And when he did it again-pinched her sensitive bud, a little harder this time-she screamed and came apart in his hands.</p><p>It was too much for Jean-Baptiste. He roared into the beams of sunshine cascading down upon them, gripped her, nipped her, and as she bucked wildly in his arms, he gave her three hard, deep thrusts before he came inside her, before he filled her with hot, milky seed, before he gathered her up and held her impossibly close.</p><p>It seemed like hours, days, maybe even weeks before either of them moved again. Before they even stirred. They lay still and sweaty as the sunbeams were temporarily overtaken by clouds, then returned, brighter and warmer than ever.</p><p>Then Genevieve purred and rolled in Jean-Baptiste's arms until she faced him.</p><p>She draped her leg across his powerful thigh and stared. Sweat agreed with him.</p><p>So did sex. His eyes were glowing. His dark hair fell around his neck, the tats, his jaw. And his mouth was a dusky, well-worked-over, crimson color. She wanted him again.</p><p>\"Yes, Miss Burel?\" he said, his eyes flashing with heat.</p><p>She grinned. \"I smell something amazing.\"</p><p>\"Well, thank you.\"</p><p>She laughed. \"No, not you.\"</p><p>\"Not me?\" He plastered on a frown, which frankly only made him look sexier. \"Then it must be the beignets and coffee.\"</p><p>\"You're kidding?\" Her heart pinged and she came up on her elbow. \"You did that for me?\"</p><p>He reached down and gave her</p><p>backside a playful slap. \"Just trying to impress you, Miss Burel.\"</p><p>She loved being called Genny, especially when he was inside her. It was soft and gentle and intimate. But she had to admit there was something that made every inch of her skin tingle when he called her Miss Burel. \"I can't believe you went out just to get me coffee and beignets. Where are they? I need them now.\"</p><p>He laughed. \"Easy, ma cherie. I'll get it. I'll be serving you. Feeding you.</p><p>Though, with how late it is, the coffee might be a little on the cool side.\"</p><p>\"Late?\" She looked around for a clock, but didn't see one. How late was it?</p><p>\"Nothing to worry about.\" Jean-Baptiste growled, kissed her thoroughly, then flipped the sheets back and sat up.</p><p>\"And the beignets are only part of the surprise.\"</p><p>\"Really?\" The time was momentarily forgotten as she caught sight of his smooth, broad back and the spear tattoo running up the length of his spine. God, he was truly mouthwatering. \"Are you spoiling me, Mr. Baptiste?\" she purred.</p><p>He glanced over his shoulder, gave her a heavy-lidded, highly sexual grin.</p><p>\"All day, every day, Miss Burel.\" Heat rushed through her. \"Tell me.\"</p><p>\"I took care of our little problem.\" Confusion intermingled with the heat inside her and she came up on her knees.</p><p>\"What do you mean?\"</p><p>He stood, lifted an eyebrow. \"Isi is in the Wildlands.\"</p><p>Genevieve's lips parted, but nothing came out. No breath, no gasp, no words.</p><p>Even though the sun was shining outside the glass doors, the room suddenly took on a gray cast, and inside Genevieve's brain, electric shocks of fear and warning detonated.</p><p>No. He couldn't have... she couldn't have...</p><p>\"I took her there myself,\" he continued, standing gloriously naked before her. \"It's done, ma cherie. Our mission is complete, and we can stay here all-\"</p><p>\"No!\" The word came out harsh and fearful, and Genevieve wasted no time in scrambling off the bed. \"Oh my god.</p><p>Oh my god.\" What time is it? How long did we sleep?</p><p>\"Genevieve? What the hell's wrong?\" Everything. God, how could she be so stupid? So careless? How could she have allowed herself to forget the point of this trip in a one-night-of-meaningless-fun sinkhole? Shit, the one road to her future...</p><p>What the hell time was it?</p><p>\"Genevieve,\" Jean-Baptiste said again, this time with a growl attached.</p><p>\"It's over,\" she said, grabbing clothes out of her bag and throwing them on.</p><p>\"What's over?\" His voice was low, wary.</p><p>\"My career. My shot.\" Finding a way to fix the broken magic in my family.</p><p>Where was the damned clock?</p><p>\"What are you talking about?</p><p>Raphael's thrilled.\"</p><p>She hastily toed on her shoes and zipped up her bag. \"I have to go. Right now. I have to go.\" I have to see if I can repair this damage. Beg the elders for a second chance.</p><p>\"I thought this would please you. I thought...\" He ran a hand through his hair. \"I'll call for the car.\"</p><p>\"Don't worry. I'll take a cab. I can get back on my own.\" She wouldn't make this mistake again. She'd swear it to them.</p><p>\"Okay, this is bullshit.\" Jean-Baptiste was at her side in a second, naked and tense, grabbing her by the arms. \"Look at me.\"</p><p>She stilled. She didn't want to. God, she didn't want to. When she looked at him, bad things happened. Bad things that masqueraded as amazing,</p><p>wonderful, perfect, future-killing, things.</p><p>But her eyes slid up anyway. And as she met his gaze, saw the confusion and the heat and his desperate need to understand her, her heart squeezed. And her mind whispered traitorously. Love?</p><p>\"Is this about bringing Isi in yourself?\" he asked. \"Wanting to impress Raphael? First assignment kind of thing?\"</p><p>\"No.\"</p><p>\"Then what?\"</p><p>She shook her head, bit her lip.</p><p>\"You need to talk to me.\"</p><p>\"I have to go.\"</p><p>\"Not yet.\"</p><p>\"You don't get to hold me here,\" she said, her throat tight. \"I want to go.\"</p><p>\"You want me,\" he said, his face a mask of hunger and heat.</p><p>Oh, god.</p><p>\"You want me, Miss Burel. Say it.\"</p><p>\"Of course I want you!\"</p><p>\"Then stop this. This ranting. This fear.\" He released her shoulders and took her face in his hands. \"I'm here with you, Genny. Don't you understand that? You know how I feel, what I want</p><p>-what I'm offering. My life is yours now. It's insane and too fast, but it's right. We both feel it. All I want to do is be with you, care for you, protect you.\" His eyes searched her. \"Whatever the problem is, I can fix it. Just tell me. Talk to me.\"</p><p>She shook her head, her throat raw and tight.</p><p>\"Yes,\" he assured her. \"It's what males do for their females.\"</p><p>Never in her life had someone looked at her this way. Wanted her this way.</p><p>Utterly and unabashedly. And yet, she couldn't embrace him. She'd chosen her path, made her commitment to the elders.</p><p>And you didn't go back on that. Not unless you wished to incur their wrath.</p><p>Her family needed her now. And as she'd found out with her parents, running off, giving in to selfish choices, wasn't going to solve the problem of the busted magic attacking her family.</p><p>His voice deepened to a possessive growl. \"I've claimed you, Genny. I nearly marked you with my teeth a moment ago, for fuck's sake. And if we'd been inside the Wildlands, if I'd had access to my puma's claws, I would have.\"</p><p>She gasped then, her eyes going wide.</p><p>All that he'd said when she was in his arms, beneath him, in front of him, crying out his name, came back in a rush. Yes, he'd offered for her and she'd allowed her mind to dismiss it. Pretend it never happened so she could enjoy the little bit of heaven she'd wanted so desperately.</p><p>But now, looking up into his fierce, darkly handsome face, she could no longer dismiss it. The beautiful, perfect offer, and the ugly truth.</p><p>\"No one can claim me, Jean-</p><p>Baptiste,\" she said with such deep regret it was palpable. \"I'm not a Suit. Not anymore. I work for the elders. I can never be this way with you again. And I can never be your mate.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Dusk was settling over the bayou, soft and quiet and milky. The massive sable puma watched the one he wanted above all others scamper off into the trees, her nearly white gold pelt acting as a beacon, a spotlight. He wanted to run after her, block her path, growl at her, hiss at her. At least until she listened to reason, maybe dropped to her belly and let him curl up beside her again, lick her fur. But Genevieve Burel was</p><p>determined to get to the elders, plead with them to forgive her and allow her back into their fold. And Jean-Baptiste had decided to let her.</p><p>He turned in a circle, snarling softly.</p><p>She'd lied to him. And yet, how could he be angry with her? He'd lied to her, too.</p> <p>He opened his mouth to scent her one last time, pull the sweet, delicate fragrance of her and her cat into his nostrils, then took off in the opposite direction. He'd give her twenty-four hours to come to her senses, listen to herself, her body, and her cat. Twenty-four hours to realize they belonged together. Twenty-four hours to come to terms with the fact that the elders were her past, and Jean-Baptiste was her future. Then he was going in.</p><p>Clock starts now, Miss Burel.</p><p>He yowled at a few black puma Hunters on patrol near the edge of the yellow cow lily-strewn bayou. They returned his call, and he continued on, weaving in and out of a stand of oak, catching the scents of Hunters and Suits among the pitcher plants and wild bee balm as he headed for town. Though his heart hurt like a motherfucker, he wanted to check on Ashe, Raphael, and on Isi.</p><p>See what progress was being made. See if the voodoun was awake and plotting his demise.</p><p>The village was buzzing like the cave-top hive he'd stumbled upon as a cub when he broke through a patch of anise shrub. Must be close to evening meal, Jean-Baptiste thought, heading down one of the side streets. The Pantera pumas were all shifting into their human forms, waving goodbye to friends, rushing out of shops, making their way toward their residences.</p> <p>Baptiste spotted the clinic ahead and picked up speed. A few pumas, still in their cat forms, jumped out of his way, hissing, but Baptiste didn't slow.</p><p>Already up the steps and inside, he headed for his office, a place he'd hardly been in the last few months. He'd claimed to be either ill or working from home. He hadn't wanted to risk a problem with his cat. But he didn't have that problem anymore, did he? he mused, bursting into the lab. Not since Genevieve.</p><p>His lip curled and his cat purred.</p><p>Damn, he missed her already. Maybe he should've insisted on going with her to see the elders, letting the three ancient females know just to whom their new recruit belonged. But he was trying not to be a possessive bastard. Trying to let her come to the realization that they belonged together on her own.</p><p>Of course, he wouldn't wait long.</p><p>Twenty-four hours.</p> <p>Tick. Tock.</p><p>\"Come to check on your voodoun?\" His cat's fur prickled and he turned around, eyed the party behind him.</p><p>Raphael and two of the Pantera's best physicians entered the lab, the latter wearing pale blue coats and looking very concerned.</p><p>Baptiste shifted instantly, loving the new and precious feeling of control he now had over his animal.</p><p>Raphael's tired, green eyes narrowed with the new, quick and easy act. \"Well, this a new development.\"</p><p>Not confirming or denying the Suit's assessment, Jean-Baptiste walked toward them. \"The voodoun. She awake?\"</p><p>\"She is,\" Angel said dryly, his night-black eyes and white short hair a startling contrast. \"Awake and pissed.\" Grabbing the stack of charts from Angel's hands, CJ headed for her desk.</p><p>\"I think the last time I checked in on her, she was planning your death.\" Just as he'd expected. \"Weapon of choice?\"</p> <p>The red-haired female glanced up from her charts. \"A little of everything.</p><p>She was talking blades when we examined her. Then a very dull saw when we took blood.\"</p><p>They'd done a full work-up? Christ, she was going to be spitting fire. \"Did you give her anything?\"</p><p>\"Just some anti-nausea meds. She was pretty green when she woke up. But the meds seemed to have given her some relief.\"</p><p>\"Has she seen Ashe?\" Jean-Baptiste asked.</p><p>Raphael growled before anyone could answer. \"She's refused.\"</p><p>Damned, stubborn woman. \"I'll talk to her.\"</p><p>\"You need to do more than talk, Baptiste,\" Raphael said, closing the gap between them, his nostrils flaring. \"You need to convince her to come and see Ashe, help her, cure her-\"</p><p>\"Raphael-\" he began.</p><p>But the leader of the Suits was too far gone now. Rage and fear and misery coated his skin, was the air he breathed, directed every move, every thought.</p><p>He cocked his head to one side and flashed Baptiste his fully-descended canines. \"Because if she doesn't help my female and cub, I won't be able to stop myself from killing her.\"</p><p>\"The voodoun is here?\" came the soft hiss. \"In the Wildlands?\"</p><p>\"Yes.\" Genevieve sat before the elders, her chin lifted, but her insides twisting and turning with dread and grief and desire for the male she'd left back in the bayou. The three ancient, female Pantera, who existed in their puma state, were coated in mist, and sat in the three points of a triangle on the wide, cypress bridge that extended across the calm, moonlit bayou.</p><p>\"You failed to stop her,\" said Wilu.</p><p>The brown cat's words were not a question.</p><p>Genevieve nodded. \"I know.\"</p><p>\"What is your excuse?\" Gaya asked, the blue-gray cat's matching eyes thoughtful.</p><p>I was asleep. I was in bed with a male.</p><p>I fell in love.</p><p>Her shoulders falling, Genevieve shook her head. \"I can only claim inexperience.\"</p><p>The third elder, Tyee, rose to all four paws and started toward Genevieve, her white fur, thick and lush. \"Do you wish to rectify your failure, Genevieve?\"</p><p>\"I wish to apologize for it,\" she said quickly.</p><p>The cat shook her head, her pale blue eyes narrowed. \"It's not enough if your goal is to be one of our students. An elder yourself someday.\"</p><p>Warring emotions swam in</p><p>Genevieve's blood. This was it. Her choice, her decision, and she had nothing but excuses. They wanted her</p><p>commitment to a cause she believed in wholeheartedly-a cause that could stop the decline of magic both inside her home and out-and she was hesitating.</p><p>But could she truly give up seeing Jean-Baptiste again? Never being touched by him? Kissed by him? Even the idea, the thought, damaged her heart.</p><p>She was weak.</p><p>\"It's no loss, Genevieve,\" Gaya said pleasantly. \"Just as your mother before you, it seems that you may not be suited for such an honor.\"</p><p>The words had not been meant to bruise. The elders only spoke in facts, truths, hard as they might be to face. But Genevieve winced all the same.</p><p>\"I don't believe that,\" she said, her chin lifting.</p><p>\"Your passion is elsewhere,\" Wilu said, her bright yellow eyes clinging to Genevieve. \"As is your focus. Perhaps you wish to find a mate.\"</p><p>\"No,\" Genevieve said, shaking her head, even as her brain screamed, I already have!</p><p>Tyee stopped before her, leaned in and touched her black nose to Genevieve's hand. \"Perhaps the magic inside your home wanes because your belief in the elders wanes.\"</p><p>Her heart lurched. \"Never!\"</p><p>The white puma dropped her head.</p><p>\"You have disappointed us, Genevieve Burel.\"</p><p>\"Wait-\"</p><p>\"You are released.\"</p><p>Before Genevieve could say another word, all three elders vanished from the bridge, leaving only a thick mist curling above the bayou.</p><p>\"You can forget my shop exists. No more ink. No more metal. I don't care if your cat chews your dick off, understand?\"</p><p>Standing in the middle of the lab, a six foot, black-haired linebacker of a Hunter guarding her back, Isi glared at Jean-Baptiste. Arms crossed over her chest, blue-streaked hair wild around her face, the woman looked ready to murder him, and he didn't blame her one bit.</p><p>\"How are you feeling?\" he asked.</p><p>She flipped him off. \"Don't pretend you give a shit.\"</p><p>He shook his head. \"Not pretending. I do care. I just care more about the survival of my species. And this woman who carries the first Pantera cub in fifty years is being threatened by something.</p><p>From the inside out, Isi. I swear to god, I wouldn't have gone to these lengths, been a complete asshole, if it weren't dire.\"</p><p>\"You had no right to do what you did, Baptiste,\" she said. \"I don't owe you or them anything.\"</p><p>He nodded. \"That's true.\"</p><p>Her teeth ground together. \"But...\"</p><p>\"But, shit, Isi. It's a baby.\" She stared at him for several long seconds, then slowly started to shake her head. \"I don't know what you think I can do for her.\"</p><p>\"Just take a look, see what you think.\" He walked toward her.</p><p>\"Do I even have a choice here?\"</p><p>\"Course you do.\"</p><p>\"Don't try to play nice now,</p><p>Baptiste,\" she warned as he approached.</p><p>\"I'm not forgiving you.\"</p><p>Jean-Baptiste grinned. He'd always enjoyed their almost sibling-like banter.</p><p>\"No forgiveness,\" he said, reaching out and pushing down a patch of her wild hair that was sticking straight up. \"But maybe if I need the ink or metal again...\"</p><p>She slapped his hand away. \"I told you. Hell. No.\"</p><p>\"Come on, Isi. You know you find it fascinating-\"</p><p>He stopped speaking, his nose catching the most wondrous, most delectable scent in the world. Instantly, his body went hot and hard, a hungry growl vibrating in his throat.</p><p>His nose didn't make mistakes.</p><p>Not when it came to his female.</p><p>Miss Burel was near. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Violence had never called to Genevieve until now. Until she stood in the doorway of the clinic's lab and watched Jean-Baptiste touch the voodoun's hair. Her lip peeled back and her canines started to drop. She wanted to spring, release her puma, race across the floor and leap onto the woman, claws out. But hurting Isi, or even displaying her nearly debilitating jealously, wasn't why she was here.</p><p>Trying to prove her worth to the elders and her commitment to the Pantera by removing the woman from the Wildlands without incident was.</p><p>Jean-Baptiste stepped away from Isi, and turned around to face Genevieve. If it was possible, he looked even more fiercely handsome than he had a few hours ago when she'd left him in the forest. His amber eyes were glowing with warmth and the metal in his lip winked at her.</p><p>She swallowed the saliva that had pooled in her mouth.</p> <p>\"It's good to see you, Miss Burel,\" he said. \"And much sooner than I had anticipated. Have you come to tell me your dealings with the elders are done?\" His voice enveloped her, made her insides melt, made her cat purr. She growled and shook her head. \"I've come for her.\"</p><p>Isi raised one eyebrow.</p><p>\"And what do you plan to do with her?\" Jean-Baptiste asked evenly, coming to stand in front of the voodoun.</p><p>\"Take her back. She doesn't belong here. She doesn't want to be here.\" She looked at Isi then, tried to push back the desire to rip the diamond studs from the female's nose with her teeth. \"Isn't that right?\"</p><p>\"By here do you mean the Wildlands?\" Jean-Baptiste asked. \"Or beside me?\"</p> <p>She turned to him and growled. \"Of course I mean the Wildlands.\" But inside her guts, and her heart, the latter seemed a far bigger concern at the moment.</p><p>Foolish female.</p><p>\"I think I have some of that anti-love elixir with me,\" Isi uttered dryly. \"It's yours if you want it, Baptiste.\" Genevieve whirled on the female and hissed, \"Shut up.\"</p><p>Once again, Isi's eyebrows rose.</p><p>Jean-Baptiste started toward Genevieve. \"The elders want her out of the Wildlands.\"</p><p>She lifted her chin. \"That's right.\"</p> <p>\"And you've come to do their bidding.\" Those liquid amber eyes pinned her where she stood. \"Do you even know why?\"</p><p>\"Of course I do. They believe her to be detrimental to our land, to Ashe and the child. They know what's best for our kind, Jean-Baptiste. They always have.</p><p>They've always protected the Pantera.\" It's why I've admired them so much.</p><p>Why I've given up my life to be in their service.</p><p>Jean-Baptiste didn't agree or disagree, just kept coming toward her.</p><p>\"Do you think it's wise to take on a job without knowing the reasons behind such a belief? What if they're wrong? Or misinformed?\"</p><p>\"They're the elders,\" she said as if that was the only explanation necessary.</p><p>\"They know all.\"</p> <p>\"I don't believe that. If they knew all, why is it we still can't breed? Why do we still have pools of dying magic on our borders?\"</p><p>Genevieve just stared at him. She'd had the same thoughts, the same questions, and had pushed them from her mind. Wasn't it traitorous to question the elders?</p><p>\"Isi could be the one person to help Ashe,\" Jean-Baptiste was saying. \"Help the cub.\"</p><p>\"And what if she's not?\" Genevieve said softly, her head growing fuzzy as his scent pushed into her nostrils. \"What if she does more harm than good? That could be behind the elders' motives.</p><p>They could know something about her we don't.\"</p><p>Jean-Baptiste's gaze was fierce.</p><p>\"Something they refuse to name?\"</p><p>\"They are the Pantera!\"</p><p>\"No. We are the Pantera. All of us.\"</p><p>\"Baptiste.\" It was Isi. She'd grown suddenly pale, and she moaned softly.</p><p>\"Can we do this? Now. I'm not feeling so great again.\"</p><p>\"You don't have to stay here,\" Genevieve called to her. \"You can't be held against your will.\"</p><p>\"Dammit, Genevieve!\" Jean-Baptiste roared.</p><p>But Genevieve wasn't listening. \"I can take you back myself.\"</p><p>\"No,\" Isi uttered, coming forward, reaching out for Jean-Baptiste. \"I'll see her.\"</p><p>As soon as Isi's hands made contact with his arm, Genevieve lost it. The elders didn't exist anymore, neither did her weakness and pride. And claws appeared where her hands used to be.</p><p>Instinct possessed her and she stalked forward, her eyes narrowed on the voodoun, her cat pushing through her skin.</p><p>\"Stop, Miss Burel,\" Jean-Baptiste warned.</p><p>\"Take. Your. Hands. Off. Him.\" Genevieve barely recognized the guttural, feral voice coming out of her mouth.</p><p>Isi groaned, and Jean-Baptiste turned to the guard. \"Hiss, bring Isi to Raphael.</p><p>Now. I'll be there in a minute.\" His eyes watchful of Genevieve, the male went to the voodoun and took her arm, led her from the room. When the door to the lab closed and they were alone, Jean-Baptiste rounded on Genevieve.</p><p>\"I'm not going to pretend I don't love you snarling and scratching to show not only me, but yourself, just how mated we truly are. But I'm not going to allow you to take Isi, Miss Burel-\"</p><p>\"It's Genevieve,\" she snarled.</p><p>\"Not yet, it's not,\" he returned.</p><p>She froze, and behind her narrowed eyes she felt tears form. She missed him.</p><p>How was that possible? In such a short time? His touch, the softness in his voice when he said her name, her nickname...</p><p>\"Talk to me,\" he said, moving closer.</p><p>\"Do the elders have a hold over you?</p><p>Are they blackmailing you or threatening you?\"</p><p>She shook her head.</p><p>He gathered her in his arms. \"Then what the hell is going on? You don't feel a desire for this work, for them. Your desire belongs to me now.\"</p><p>Goddammit, she hated his words.</p><p>Hated them because they both echoed the elders', and because they were true. She nearly crumpled right there.</p><p>\"Why, Miss Burel?\" he pressed.</p><p>Her head dropped back and she locked eyes with him. \"I love the Pantera. I only want to do right by them.</p><p>The elders...\" she began miserably.</p><p>\"I've always believed they were the answer to our longevity, our happiness and our peace. They are the ultimate problem solvers. And I'd hoped, once I was in their service, that they'd help me find the answer to my problem.\"</p><p>\"What problem is that?\"</p><p>Telling him the truth was far more difficult than she'd imagined. It made her feel oddly vulnerable. \"The magic isn't just waning at our borders anymore, Jean-Baptiste.\" She swallowed hard.</p><p>\"It's broken free. It's fading inside my house. Inside my Grands. Maybe even inside me. Has been for several months now. My parents ran away instead of facing it, trying to find out how to stop it.</p><p>I couldn't do that.\"</p><p>Jean-Baptiste was silent as he digested what she'd just told him. His gaze moved over her face, his brows pinned together, his mouth set in a grim line. He looked confused, possibly even angry.</p><p>Was he mad because she'd lied to him? Or was he disgusted at what was happening inside her house? To her family? Did he see her as weak now?</p><p>\"This is unbelievable,\" he uttered, shaking his head.</p><p>Her heart lurched and she felt sick to her stomach. She couldn't stand to have him look at her with disgust and censure.</p><p>Or listen as he told her he'd made a mistake-they weren't mates, and he didn't want to claim her.</p><p>She wriggled out of his grasp. \"I have to go.\" She shouldn't have told him.</p><p>Shouldn't have opened her heart.</p><p>\"Wait. Your family's magic is gone?\"</p><p>\"I won't bother you again,\" she said, turning, hurrying toward the door, \"Or your voodoun..\"</p><p>\"Genevieve!\"</p><p>Before Jean-Baptiste could say another word, Genevieve ran out. Down the hall, she thought she heard him calling to her, but the sound was drowned out by her quick shift into her puma.</p><p>Jean-Baptiste tore out of the room after her. Christ, what a screw up. Both of them. So destined, so in love with each other, so desperate to find a way out of their strange predicaments so they could be together. Yet all the while keeping secrets. Pointless, harmful secrets. This was it. No more. They were both coming clean, leaving the past behind and turning to each other for help, for a future, for the truth.</p><p>But when he passed Ashe's room, her open door, and heard Raphael's pained voice leach out into the hallway, he slowed.</p><p>\"What the hell does that mean?\" the Suit demanded. \"Is she okay? The cub?</p><p>Fuck, I hate that I can't do a goddamn thing for her.\"</p><p>\"What's wrong?\" Jean-Baptiste came to stand in the doorway, his gaze hitting on every person in the room. Doctors, Isi, Raphael, and Ashe, asleep and pale on the bed. The small space was packed.</p><p>\"The cub...\" Raphael stuttered, glancing over his shoulder. The male sat on a chair beside the bed, Ashe's hand in his own, looking like death warmed over.</p><p>\"The cub is healthy,\" said Dr. Julia, Parish's new mate. She reached down and took the pulse at Ashe's throat.</p><p>His eyes completely sunken, Raphael said, \"But it's growing faster than a normal fetus.\"</p><p>\"Our pregnancies are always faster, aren't they?\" Baptiste said, his eyes lifting to Angel.</p><p>The male doc nodded, but quickly amended, \"This seems to be more in line with a feline gestational period. I've never seen it before.\"</p><p>Shit. \"When is she due?\"</p><p>\"Three months.\"</p><p>Momentarily dumbfounded, Baptiste turned back to Raphael. The male looked ready to explode, lose his mind, maybe collapse. Baptiste prayed to god Isi could do something, because if she couldn't, if Ashe didn't make it, he feared not only what the loss would do to the leader of the Suits, but to the Pantera as a whole.</p><p>\"I see no signs of distress with the cub,\" Dr. Julia said, switching out a bag of fluids. \"And though the child is developing quickly, it looks healthy.</p><p>Ashe's vitals are strong. She should be fine- if we can stop whatever's holding her mentally.\"</p><p>Every pair of eyes in the room turned to Isi. And the woman shrank slightly under the weight of their hope and fears.</p><p>Pale as the reeds beneath the water of the bayou, she nodded at them. \"I'll try. I need time though. Time to study her, see the way she moves, smells, makes noises in her sleep-\"</p><p>\"Maybe you can do more than that,\" came a female voice behind Baptiste.</p><p>Walking into the room, Dr. CJ held up a file, her face a mask of tension.</p><p>\"What are you talking about?\" Raphael demanded.</p><p>CJ looked intently at Isi. \"Your blood tests came back.\"</p><p>The woman flinched. \"So? Did you figure out why I feel like puking every time I'm near or inside of the Wildlands?\"</p><p>\"No.\" CJ glanced at Julia, then at Angel, then back at Isi. \"But I did find out that you and Ashe share DNA.\" Isi's pale skin turned gray. \"What?\"</p><p>\"You're related.\"</p><p>A soft groan echoed throughout the room. Everyone looked back at Isi. But the sound hadn't come from her. Jean-Baptiste's gaze slid to the bed, and to Ashe, covered in wires and tubes.</p><p>\"No,\" Isi was mumbling, drawing back, fearful now. \"That's impossible. I have no family.\"</p><p>\"Blood doesn't lie, Voodoun,\" Dr. CJ</p><p>said crisply.</p><p>\"Oh, my god,\" Julia called, rushing to the bed, her stethoscope already in her ears. \"Raphael. Look.\"</p><p>Isi looked over at Jean-Baptiste.</p><p>\"There's a mistake. I don't have family.</p><p>They screwed something up-\"</p><p>\"You,\" came a breathy, pained sound.</p><p>Jean-Baptiste tore his gaze from Isi, and turned to Ashe. Her face was as pale as skim milk, her lips were dry and a dull pink, her body was still prostrate and hooked up to a ton of meds via a ton of tubes, but her eyes...holy shit, her eyes were open and pinned on Isi.</p><p>\"Ma cherie,\" Raphael said, his voice shaking as he took her hand and kissed the palm. \"My love. Oh, thank god.\" But Ashe didn't seem to recognize Raphael or his voice. She stared transfixed at Isi, her lips parting once again. \"You,\" she uttered hoarsely. \"I know you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Something's wrong with our Be.\"</p><p>\"Definitely.\"</p><p>Sitting cross-legged on her Grands' bed, Genevieve glanced up from her cards-a nearly full house-and caught them both staring at her, their own cards all but forgotten.</p><p>\"Come on, tell us,\" Maw-Maw cooed.</p> <p>\"Yes,\" Paw-Paw said. \"What</p><p>happened on that trip, sweetheart?\" She'd been home for less than an hour, and in that time her Grands had done nothing but study her and grill her about her trip. Who was on it with her, why was she home so late, was that expression on her face an indicator of success or hardship?</p><p>\"Nothing,\" she told them again.</p><p>\"Everything's fine.\"</p><p>Paw-Paw snorted. \"We may be ancient, Be love, but we know you better than anyone. Something went either very wrong on that trip.\" He turned to his wife and grinned. \"Or very right.\" Heat surged into Genevieve's cheeks, and she tried like hell to keep the image of Jean-Baptiste's face, body and mouth from entering her mind. But she failed.</p> <p>Seemed she was doing a lot of that lately.</p><p>\"Oh, my blessed knees,\" Maw-Maw began, leaning forward so Genevieve could see the female's entire hand.</p><p>Straight flush. \"You met yourself a male, didn't you?\"</p><p>\"No,\" Genevieve said quickly, the word sounding phony even to herself. \"I went to work. Nothing happened.\" God, what a bald-faced lie. \"There was no one-\"</p><p>\"Is he handsome?\" Maw-Maw asked.</p><p>\"Who cares about that,\" Paw-Paw put in. \"Can he be a good partner? Is he strong and fearless?\"</p> <p>A knock on the door not only stalled the conversation, but startled Genevieve.</p><p>\"Genny!\" called a male voice outside.</p><p>Genevieve's heart dropped into her stomach. Hell, maybe it had even burrowed itself into the mattress. What was he doing? Why would he come here after everything she'd told him? After how he'd reacted?</p><p>\"Genny!\" he called again. \"Come out here or I'm coming in!\"</p><p>Her gaze jerked back to her Grands.</p><p>They were both reclining against the headboard of their bed, white down comforter to their chests, wide eyes and even wider grins plastered to their faces.</p><p>\"Sounds handsome,\" Maw-Maw said.</p><p>\"Sounds strong,\" Paw-Paw put in.</p> <p>Oh, my god. This was humiliating.</p><p>\"I'll be right back,\" Genevieve said, scrambling off the bed.</p><p>\"Take your time, Be ,\" Paw-Paw called after her.</p><p>\"We're not going anywhere,\" Maw-Maw added with a tinkling of laughter.</p><p>Her heart slamming against its cage of ribs, Genevieve hurried to the front door and burst outside. Jean-Baptiste was leaning against the porch railing. Just like he had when they'd first met. Except tonight, he didn't have on the leather jacket. Just jeans and a T-shirt, which showed off his sexy ink and hills of muscle to mouthwatering perfection.</p><p>\"What are you doing here?\" she asked, her mouth so dry the words nearly came out a squeak.</p><p>He cocked an eyebrow at her. It was the one with the metal through it, and she fairly sighed with desire.</p><p>\"If we're to be officially mated I won't have you running from me every time there's an issue,\" he said, pushing away from the railing.</p><p>She backed up to the door. He followed.</p><p>\"Who says we're going to be mated?\" she asked breathlessly.</p><p>\"I do.\" He touched her face, smiled.</p><p>\"And you do.\"</p><p>\"You don't want to get involved with this, Jean-Baptiste.\"</p><p>\"With what? The dying magic inside your home?\"</p><p>She flinched.</p><p>\"Genny, you're right about the troubles having crossed our borders. But it hasn't just attacked your family.\" For a moment, Genevieve wasn't sure she'd heard him right. What was happening inside her home, to her Grands...was he saying they weren't alone?</p><p>\"How do you know this?\" she asked, looking at him intently, making sure she heard every word of his reply.</p><p>His thumb brushed across her cheek.</p><p>\"Because the magic is dying inside of me.\"</p><p>\"What?\" she said on a gasp.</p><p>\"Or it was. Until you came along.\" His eyes pinned her where she stood.</p><p>She shook her head. \"I don't</p><p>understand.\"</p><p>\"My cat has been out of control for a while now. It refused to remain caged.</p><p>Even outside the Wildlands.\"</p><p>\"Oh, my god.\"</p><p>\"That's why the tats and the metal. I had malachite put into each to ground my puma. It was barely keeping me sane.\" He leaned in then and kissed her. Softly, sweetly, lovingly. \"But you, my wonderful, beautiful Genny, have tamed us both.\"</p><p>Another wave of confusion, of shock, barreled through her. \"That's not possible.\"</p><p>\"I wouldn't think so either, unless I'd felt it.\" He kissed her again. \"But love and chemistry, desire and respect can work miracles it seems.\" And again.</p><p>\"We're made for each other, Genny.\" The knocking inside her heart, the heavy beats, the fear and worry and sadness, began to ease. He loved her. He wanted her. Despite everything.</p><p>Or maybe because of it.</p><p>\"The elders told me it was just my house,\" she said, a strange and powerful rush of strength running through her.</p><p>\"They lied.\"</p><p>\"Maybe not. Maybe they don't know about me, or if there are others who are suffering in silence and shame.\" His eyes grew serious. \"But it's time we as a species talked about this. What's happening to our land, to our cats, to our people. So we can work together to find an answer.\"</p><p>Genevieve's chest swelled with pride. It's what she'd wanted from the elders. Being part of something bigger then herself, something that would help the Pantera, herself and her Grands included. Jean-Baptiste was right. The only way to find the reason for the dying magic, both on their borders and now inside their lands, was to work together as a species.</p><p>As the Pantera.</p><p>\"Come, Mate,\" he said on a growl.</p><p>\"You haven't even kissed me yet,\" she teased, the blood in her body surging with a now-familiar heat. \"A little premature, don't you think?\"</p><p>He grinned, and the look nearly made her legs turn liquid.</p><p>\"Inside, Genny,\" he said. \"We may be mated in our hearts and our bodies, but I'm going to ask permission from your Grands.\" He grimaced. \"Hope they don't find me too scary.\"</p><p>She grabbed the back of his head and pulled him down for a kiss. \"They'll love you. Just like I do.\"</p><p>He kissed her hard and hungry for several seconds, then eased back. He pulled open the screen door and was about to follow her in when his phone rang. He took a quick glance at the screen and cursed.</p><p>\"Sorry, ma cherie,\" he said. \"It's Raphael. And after what just happened in the clinic, I need to get this.\" He stabbed the button. \"What's up, Raph?\" Genevieve watched him, silent as he listened to the Suit on the other end-the Suit Genevieve hoped would take her back into the fold. When Jean-Baptiste hung up, the happy, sexy, charming male who'd just kissed her dizzy and stupid was gone. In its place, stood a wide-eyed, teeth-bared male on the verge of shifting. Growling, cursing, he shook himself. Within seconds, he returned to his human form.</p><p>\"Jean-Baptiste.\" She touched his arm, worried and a little fearful. Not of him, never of him, but of what he'd just been told. \"What's happened?\"</p><p>His eyes lifted to meet hers, and black ire glistened among the amber. \"Not only is Ashe awake, but the ones who are responsible for her attack are in custody.\" His voice dropped to a dangerous pitch. \"It seems there are traitors among us.\" </p> </body></html>"]