["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Happiness</p><p>THE PSY COUNCIL TRIED TO OUTLAW CHRISTMAS ONCE.</p><p>It was in the year 2019, four long decades after the implementation of the Silence Protocol. The Protocol itself arose out of the overwhelming incidence of insanity and serial killing in the Psy populace. Driven to the edge, the Psy made a choice. They conditioned their young to feel nothing—not jealousy, not rage, and definitely not joy at the thought of Christmas morning.</p><p>So it was that by 2019, only ice ran in the veins of the Psy politicians who wanted to make Christmas illegal. Since the Psy race controlled government then as it does now, Law 5198: Deletion of Christmas and Associated Holidays was near certain to pass.</p> <p>There were a few minor hiccups. Some elderly Psy—those who had been too old at the inception of Silence to allow for true conditioning—weren’t certain they wanted the holiday outlawed. But the old ones were few; the last, unwanted vestiges of an emotion-filled past the Psy preferred to forget. They were ignored, their fading voices drowned out by the Silent majority.</p><p>Law 5198was read into the statute books and life moved on.</p><p>Except that the humans and changelings, the other two parts of the triumvirate that is the world, took no notice. Christmas trees went up as usual, gifts were bought, and carols were sung. Human business owners did a roaring trade in mulled wine, fruit cake, and roasts with all the trimmings.</p><p>In comparison, Psy who owned interests in companies that usually profited from Christmas suffered a sharp drop in income—Law 5198meant they could no longer advertise their products in conjunction with the outlawed holiday.</p><p>The Psy Council found itself faced with both a mass revolt by the other races, and considerable opposition from the very businesses that backed up its regime. Psy might not feel, but they also did not appreciate their profit margins being compromised. The businesses weren’t the only ones who felt the negative impact of Law 5198 —Enforcement could find no way to prosecute everyone who violated the law against Christmas.</p> <p>The churches simply acted as if the law didn’t exist. But they, in their solemn dignity, weren’t the worst offenders. The changelings, in particular the nonpredatory deer species, took great amusement in walking the streets in their animal forms, dressed up as Santa’s reindeer.</p><p>Then the horse-changelings decided it wouldn’t hurt their pride to be harnessed two by two to large sleds in order to transport shoppers around the cities. Finally, the humans, the weakest of the three races—with neither the psychic powers of the Psy, nor the animal strength of the changelings—came up with the killing strike.</p><p>They changed the name of Christmas to the Day of Happiness.</p><p>It was unacceptable for Psy to feel happiness. Those who did had their minds wiped clean and their personalities destroyed in a horrifying process known as “rehabilitation.” But it wasn’t illegal for anyone else to celebrate happiness. And if they wanted to do it by singing songs, gathering with loved ones, and attending certain ceremonies dressed in their Sunday best, well, that wasn’t illegal either.</p><p>The powerful, deadly Psy Council was used to instant obedience in all things. However, in the year 2021, the Councilors admitted that wasting Psy resources to ensure compliance with Law 5198 made no financial or strategic sense. The law was quietly repealed.</p><p>Now, some forty years later, Christmas is a celebration unlike any other. Though the Day of Happiness was retired soon after the repeal of Law 5198 , changelings and humans have always known that they are one and the same thing. Of course, happiness isn’t guaranteed by the magic of Christmas. Sometimes, a woman has to fight with everything in her, with her pride and her fury, her love and her anger, with her very soul, in order to claim the joy...or the man, meant to be hers.</p> <p>One</p><p>TAMSYN LOOKED ACROSS THE PACK CIRCLE TO THE MEN AND women who stood on the other side. Lachlan, their alpha, his hair going the white of wisdom and age, was saying something to Lucas, who was barely fifteen but carried the scent of a future alpha. The past and the future side by side. One day soon, Lucas would lead them. Everyone knew that. The boy had been drenched in blood, his parents murdered in front of his eyes. But he would lead. It didn’t matter that even if they waited a decade, he’d still be far too young.</p><p>Just like Tamsyn was too young at nineteen to be the senior healer for the DarkRiver leopard pack. Her mentor had been Lucas’s mother, Shayla. The attack on Lucas’s family had not only stolen their healer, it had left DarkRiver in a state of constant alert. That didn’t mean they had given up. No, they were quietly building their strength until the day they could destroy the ShadowWalkers—the pack that had murdered their own.</p><p>She knew Nate would be one of those who went after the rogue pack when the time came. He stood tall and strong beside Lachlan, his concentration on whatever it was they were discussing. At twenty-nine years of age, he was one of the pack’s top soldiers and would soon be a sentinel, assuming Cian’s position when the older man retired from active duty. The sentinels were the pack’s first line of defense. They were the strongest, most intelligent, and most dangerous predators of them all.</p><p>“Tammy, you’re back!”</p><p>Startled, she looked away from Nate and into Lysa’s bright green eyes. “I only got in an hour ago.” Even now, she didn’t quite believe she was home—the six months she’d spent at the teaching hospital in New York had been the hardest of her life.</p><p>“So the course is over?”</p><p>“Yes. That part of it anyway.” She could finish the rest of her medical training in nearby San Francisco. Most changeling healers relied on their inborn gifts, but Tamsyn had made the decision to study conventional medicine as well. It was one more way to compensate for her inexperience, for the healing gifts that hadn’t yet matured to full strength. She refused to allow her youth to disadvantage her pack.</p> <p>“Nothing went wrong while I was away?” She’d hated leaving DarkRiver in someone else’s care, though she fully trusted the healer who’d stepped in to hold the fort during her absence. “Maria?”</p><p>“She left this morning. Itching to get back home exactly like you.” Lysa smiled. “It was nice of Maria’s pack to lend her to us and she was great, but damn, I’m glad to have you back.”</p><p>Tamsyn returned her friend’s fierce hug. “I’m glad to be back.”</p><p>Lysa set her free. “Go on. I know you’re wanting to catch up with Nate.”</p><p>“No.” She glanced over her shoulder. “He’s busy with Lachlan.”</p><p>“The man’s your mate, girl. You can drag him away.”</p><p>Mate. The word made her heart skip as it had since the day she’d turned fifteen. That was when the mating instinct had awakened, when she’d realized she was one of the lucky ones—she’d been born into the same pack as her mate, had known him since childhood. “It’s not official yet.”</p><p>Lysa rolled her eyes. “As if that matters. Everyone knows you two are meant for each other.”</p><p>Maybe, but they were nowhere near to consummating the relationship. Nate was determined she get the chance to explore her freedom before settling down. What she had never been able to make him see was that he was her freedom. She didn’t want to be apart from him. But Nate was stronger than her. And at ten years her senior, he was used to giving orders and having them followed.</p><p>“I should freshen up,” she said, dragging her eyes away from him a second time. “I just dropped off my bags before coming here.” Searching for him.</p><p>“All right. I’ll see you after you’ve settled in.” Lysa smiled. “I have to go talk to Lachlan about something.”</p><p>Nodding good-bye, Tamsyn began to move away from the large clearing ringed by trees that was the pack’s outdoor meeting place.</p><p>NATE HAD SEEN TAMMY ARRIVE, WAITED FOR HER TO COME to him. And now she was walking away. “Excuse me,” he said to Lachlan, no longer caring about the discussion at hand. Some Psy named Solias King was apparently making what he thought were discreet inquiries about DarkRiver’s territorial reach and ability to defend itself. Lachlan was fairly certain the man wanted to steal their land.</p><p>“This is important—oh.” The DarkRiver alpha looked up and followed the path of Nate’s gaze. His frown turned into a grin. “No wonder you’re distracted. Guess we won’t be seeing you for a while. We’ll have to track this idiot down ourselves.”</p><p>Good-natured laughter followed Nate out of the Pack Circle as he tracked his mate’s scent through the trees. He caught her in under a minute. The second his palm clasped the back of her neck, she froze. “Nathan.”</p><p>Her skin was delicate under his hand and he was very aware of how easily he could damage her. With her hair swept up into a long tail, her neck appeared even more vulnerable. He rubbed his thumb over the softness of her. “When did you get back?”</p><p>“Around four.”</p><p>It was now five-thirty and winter-dark. “Where have you been?” The leopard who was his other half didn’t like that she hadn’t come to him first.</p><p>She turned her head, eyes narrowed. “It’s not like you left a note as to your whereabouts.”</p><p>His beast calmed. She’d gone looking for him. Gentling his hold, he slid his hand to the side of her neck and pulled her to him. She came but her body was stiff against his. “What’s the matter?”</p><p>“Juanita was very happy to tell me where you were.”</p><p>He heard the jealousy. “She’s a friend and a fellow soldier.”</p><p>“She was also your lover.”</p><p>The beast wanted to growl. “Who told you that?”</p><p>“I’m a decade younger than you,” she retorted. “Of course you’ve had women. I don’t need anyone to paint me a sign.”</p><p>The jagged edge of anger turned his next words razor-sharp. “I haven’t taken a lover since your fifteenth birthday.” He was a healthy leopard male in his prime. Sexual hunger did not sit well with him. But neither did cheating on his mate. “And if someone’s telling you different, I’ll tear out their throat.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She blinked. “No one’s telling me different.” Her voice was husky. “But I don’t like knowing you’ve had other women in your bed, that they’ve touched you, pleasured you.”</p><p>Her bluntness shocked him. Tamsyn did not talk to him like that. “What exactly did you do in New York?” The possessive fury that hit him was close to feral, a harsh thing with claws and teeth.</p><p>Her mouth dropped open. “I don’t believe this!” Breaking his hold with a quick move of her head—a move he’d taught her—she faced him, hands on her hips. “You think I would—” She gave a little scream. “You know what, if I had, whose fault would that be?”</p> <p>He folded his arms to keep them from hauling her back against his chest and proving to his beast that she still belonged to him. “Tamsyn.”</p><p>“No. I’ve had it up to here!” She jerked the edge of her hand to below her chin. “All the other females my age are taking lovers left, right, and center, and the only thing I get is frustration!”</p><p>Her raw need was simple truth. Newly mature females were very sexual, their scent intoxicating to the young males. Then there was the fact that the mating heat had shifted Tammy’s natural hunger into higher gear. He could taste the woman musk of her, the lush ripeness just waiting to be bitten into—it was an exhilarating blend, and one he alone had the right to crave. Even the idea of any other male lusting after her pushed his temperature into explosive range. “If I take you,” he said quietly, “it’ll be for life.”</p><p>“I know that! And I accept it. I need to belong to you—in every way.”</p><p>His cock wanted to take her up on it. But she was nineteen . She didn’t understand what it was she was committing to. He wasn’t some kitten who’d follow her around with his tongue hanging out like the young males did with the females. He’d take her and he’d keep her. Sexually, he was far more mature than she was, and a leopard-changeling’s sexual needs only grew more intense with time. “You don’t know what you’re asking.”</p> <p>“Dammit Nate, I’m sick of needing you so much I can’t sleep.” Her hands fisted by her sides, caramel-colored eyes rich with heat. “I’m sick of stroking myself to sleep.”</p><p>Jesus. The images that hit him were hot and erotic and so detailed they threatened his beast to madness. “We’ve had this discussion before,” he reminded her. “You’re carrying too much responsibility as it is.” Shayla’s murder had forced Tammy to step into the older woman’s position—as DarkRiver’s healer—at seventeen years of age. She’d never had a chance to be a juvenile, to mess about, to play and roam. “I’ve seen exactly how wrong things can go if leopards bond before they’re ready.”</p><p>“We are not your parents,” she spit back.</p><p>He went silent. “I told you to never bring up my parents again.”</p><p>“Why not?” She was trembling. “They’re the reason you’re being so stupid. Just because your mother was miserable after deciding to take a permanent partner at age eighteen doesn’t mean I will be.”</p><p>His mother had been more than miserable. “She committed suicide.” If not in truth, then in effect. Her drinking had escalated to such an extent that even her tough changeling physiology hadn’t been able to repair the damage.</p> <p>“We are not your parents!” Tamsyn repeated, her voice breaking on the last word. “You’re my mate . And I’m yours. Your mother and father didn’t have that connection.”</p><p>No, his parents had fallen in love the old-fashioned way, without being driven by the mating instincts of the leopard. It happened like that sometimes. Though mating wasn’t uncommon, not every changeling found his or her true mate, the one with whom they could bond on a level that was almost psychic. “Mating will demand more from you than a nonbond relationship ever would,” he told her, cognizant of the terrifying animal fury of his hunger for her. “I don’t want you walking into that before you’re ready.”</p><p>“And you’re the one who decides if and when I’m ready?”</p><p>“I’m older and more experienced.” She had years to go before she caught up.</p><p>She seemed to be gritting her teeth. “Fine! Enjoy yourself in your perfect little world where everything goes according to your plans. Don’t blame me if I get sick of waiting for you!” She turned and began to stalk through the trees.</p><p>“Tamsyn.” He used the tone of voice that made even the rowdiest juvenile stop and pay attention.</p><p>She kept walking.</p><p>“What the hell?” Striding after her, he caught up just in time to see her clothes disintegrate off her body as she shifted into leopard form.</p> <p>He froze, stunned as always by the beauty of her. Her pelt was glossy, the dark rosettes defined luxuriantly against the gold. Suddenly, she looked over her shoulder and gave him a look that could only be described as haughty. Her eyes were green-gold, not caramel, in this form, but they were very definitely all female.</p><p>He growled at the implied challenge. She snapped her teeth in response and took off. He almost went after her—his claws were already out by the time he brought himself back under control. If he ran her down in his current state...well, she wouldn’t be complaining about stroking herself to sleep again.</p><p>Oh, hell.</p><p>Now his mind was so full of images of soft feminine flesh and long stroking fingers that he was in danger of bursting out of his pants. “Shit.” Turning in the opposite direction from her, he ran toward a nearby waterfall. An ice cold bath was exactly what he needed to knock some sense into his head.</p><p>He wondered if she moaned when she brought herself to orgasm.</p><p>Two</p><p>TAMSYN SHIFTED BACK INTO HUMAN FORM NEAR HER PARENTS’ home. They lived fairly close to the Pack Circle and it was where she was staying for the time being, her life in limbo—she should have been living with Nate by now. Eyes stinging at the reminder of his rejection, she went to retrieve some clothes she’d hidden for just such contingencies. Nudity was no big deal in the pack, but she was already going to be a crybaby. At least she could be a clothed crybaby.</p><p>Dressed, she walked to the front door. Her mother opened it before she could knock. With her dark hair and pale brown eyes, Sadie Mahaire was an older, smaller version of Tamsyn. It was Tamsyn’s father who had given his daughter her height. Her mother took one look at her face and opened her arms. “Come here, my darling.”</p><p>Sobbing, Tamsyn went into her mother’s embrace. “I don’t know what to do, Mom,” she said, what felt like hours later. She was lying on the sofa, her head in her mother’s lap and her legs curled up on the cushions. “This need I have for him, it’s clawing me to pieces. But...but he doesn’t seem to feel the same.” That knowledge crushed her, made her feel as if she were bleeding inside.</p><p>“Oh, yes he does.” Sadie stroked Tamsyn’s hair off her face with gentle hands. “He’s simply had longer to get used to it.”</p><p>“Longer? How? The bond awakened at the same instant in both of us.” He’d come to the door on her fifteenth birthday and she’d felt something in her snap taut, a connection so strong, it vibrated with how utterly right it was.</p><p>“Yes, but you were fifteen. Your sexuality was young, immature.”</p><p>She remembered the wave of heavy warmth that had uncurled in her stomach whenever she’d been around Nathan, the soft ache in low places. “I wanted him even then.”</p><p>“But as a girl wants, not as a woman.” Sadie pressed a kiss to her brow. “He, on the other hand, had to have had a brutal time of it. You were a baby and he’d never have allowed himself to touch you, but he was a man and his beast knew you were his mate.”</p><p>Tamsyn began to see what her mother was saying. “He had to learn to chain the mating urges of the leopard, wait until I was ready.” For the first time, she understood the pain it must’ve caused him. “And he couldn’t be with any other woman.”</p><p>“Mates don’t cheat.” Sadie sighed. “That’s a very good thing, but it’s also a hard thing to bear when things don’t work out perfectly. But you understand about Nate now, don’t you? He’s as hungry for you as you are for him—it’s just that he’s had years to build up his will against the need.”</p><p>“He’s going to be a sentinel, Mom,” she said, proud but afraid. “You know the kind of men who become sentinels. His will was already as strong as steel before he found out about the bond. Now I’m pretty certain it’s unbreakable.” She rubbed a hand over her heart, where the bond was a savagely twisted knot. Though it was meant to be an instinctive link, Nate had somehow learned to block it. Her animal heart kept reaching out to him...only to slam up against a solid wall of resistance.</p><p>“Oh, my baby.” Sadie squeezed her shoulder and Tamsyn sat up, wiping away the final evidence of her tears. “Now listen,” her mother said, pure love in her expression. “The man’s will might be unbreakable for some, but not for you. You’re his mate. You have a direct line to his soul.”</p><p>“But he won’t listen. He’s made up his mind that we’re going to wait and wait and wait and—” She shook her head, shoulders hunching in defeat. “I know he’s thinking in terms of years, not months.” A wait that long would drive her insane. She wasn’t being overly dramatic—the lack of tactile contact between her and Nate, the denial of what their beasts craved, it physically hurt . “And it’s not like I’m some sexy little thing that can seduce him.” It was out before she could feel embarrassed.</p><p>“You’re beautiful.” Sadie’s voice was full of maternal pride. “You have courage and strength and such spirit.”</p><p>Tamsyn didn’t have the heart to tell her mom that while those qualities might be nice, they didn’t exactly make her a knockout. Her hands were practical healer’s hands, her hair a plain brown, and her eyes...well, her eyes were okay. Sometimes she thought they looked like dark amber. But what man would care about her eyes when women like Juanita with their seductive, curvy bodies were sashaying around? Tamsyn was all legs and strong bones. More horse than leopard, she thought morosely. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“If you give up,” Sadie said, cupping Tamsyn’s cheeks with soft hands, “you’ll regret it for all the long, lonely years that follow. So will he. Nathan thinks he knows what he’s doing, but starving the bond will destroy both of you.”</p><p>“How do I reach him?”</p><p>“That’s for you to figure out.” Her mother smiled. “But I’ll give you a hint—he’s a man. Treat him like one.”</p> <p>TWO HOURS LATER,TAMSYN STILL HADN’T A CLUE ABOUT what she was going to do. Frustrated in more ways than one, she stomped downstairs with the intention of finding something with which to take her mind off Nate. Maybe her mom was quilting and needed an assistant. But the house proved to be empty. Sadie had left a note tacked to the back of the front door.</p><p>Your father and I decided to go for a bit of a roam.</p><p>Translation: They were off feeding their animals’ need for the wild and who knew when they would be back. It could be days.</p><p>“Great,” she muttered, feeling sorry for herself. Trudging back into the living room, she had the beginnings of a good sulk going when she spied a box on the coffee table with her name on it.</p><p>Another note:</p> <p>Tammy, darling, I thought you might like to do these while things are quiet (and you’re sulking). We could do with some new ones. Love, Mom</p><p>Opening the box, she found it filled with homemade Christmas decorations. She smiled, unable to resist their magic. Every year until the horrible day when a bloody nightmare had forced her to step into the position of DarkRiver’s healer, she had made these with her family. There were silver cardboard angels and beads strung on fishing wire and beautifully detailed paper dolls. But what held her attention were the round glass ornaments.</p><p>Each was meticulously painted with scenes from fairy tale and legend. Most had been done by Tamsyn and her mother as they sat side by side for hours, her father content to “supervise.” She smiled. Every ornament held a memory of happiness, of love. Her hand found one decorated with the image of a running panther. She stilled.</p><p>Healing’s not just about bones and cuts, Tammy, sweetheart.</p><p>Tears pricked her eyes at the memory of Shayla’s patient voice. Lucas’s mother had been a black panther like her son. She had also been Tamsyn’s teacher, her friend—a friend whose advice and guidance Tamsyn missed desperately. But today, in this moment, it felt as if Shayla stood right beside her, telling her the truths she needed to hear.</p><p>This would be the second Christmas since the attack. No one had been in the mood to celebrate the first, but perhaps it was time to heal her family, her pack.</p> <p>Even if she couldn’t heal herself.</p><p>Her eyes narrowed at the self-pitying thought. “Snap out of it,” she ordered herself. Sulking be damned—she would not let Nate’s idiocy ruin this Christmas for her. And she was going to make sure he knew it.</p><p>Three</p><p>SOLIAS KING WAS A TP-PSY, A TELEPATH WITH A GRADIENT 8 ability. That meant he was strong enough to use mind control should he ever decide to. Solias had done so before—politics didn’t allow for such niceties as high moral principles.</p><p>His current plans, too, would have been far easier to implement had he been able to utilize his telepathic abilities to coerce and persuade. Unfortunately, changelings had rock-solid natural shields. He might be able to turn one of them—and that with considerable effort—but he couldn’t control the entire DarkRiver pack. “But it shouldn’t be necessary.”</p><p>“What, sir?” his aide and son, Kinshasa Lhosa, asked.</p><p>“Nothing of note.” Solias turned. “Do you have the details?”</p><p>“Yes.” Kinshasa passed them over. Despite his youth, the eighteen-year-old was extremely efficient. Solias had made a good investment when he’d entered into a reproduction contract with the Gradient 7 Tp-Psy who was Kinshasa’s mother. Both Kinshasa and the second child from the contract were high Gradient minds, powerful in their respective abilities.</p> <p>“Give me a précis.”</p><p>Kinshasa spoke from memory, his dark skin unlined. “The land in question is perfect for your needs. You can locate a small comm station and office there, then use it as a base for further expansion.”</p><p>“The leopard pack?” Solias didn’t trust Kinshasa—he trusted no one, blood relative or not. But the boy was undoubtedly good at research. “Will they pose a problem?”</p><p>“No,” Kinshasa said, his tone holding the cool emptiness of Silence. “DarkRiver is a small group with no real presence. If we were going up against the SnowDancer wolves, it would be a different story. They’re somewhat more aggressive.”</p><p>That was why Solias hadn’t looked into “acquiring” wolf land. “Begin preparations for development.” The leopards—animals shackled by the choke of emotion—were clearly no threat.</p><p>“Yes, sir.” Kinshasa paused. “There was another matter, sir.”</p><p>“Yes?”</p><p>“The Psy Council has requested a meeting with you.”</p><p>Solias nodded. “Forward me the details.” The Council was likely interested in the details of his political aspirations—power never changed hands without the Council’s approval. If Solias played his cards right, he might not only take over the leadership of San Francisco, he could rise to the Council itself.</p><p>The Councilors would appreciate his firm hand with the animals. And if it all ended with a few dead leopards thrown into the mix, so much the better.</p><p>Four</p><p>HAVING HALF-FROZEN HIMSELF IN THE ICY CHILL OF THE waterfall, Nate finally hunted Tamsyn down well after sunset. It wasn’t that he didn’t know where she was. It was that he wasn’t sure he could face her without doing something stupid. Like yelling, “What the hell are you doing up there?”</p><p>Her eyes were night glow as she stood on a tree limb several dangerous feet off the ground, in human form. It would have been another matter if he’d found her there in leopard form. That was normal. The same couldn’t be said for a woman with a rope of Christmas lights slung over one shoulder. Now, that woman snorted and began to string the lights around and along the boughs above her head.</p><p>“Tamsyn, I swear to God,” he grit out, tracking her so he could catch her if she lost her footing, “if you make me come up there, you won’t be sitting without wincing for weeks.”</p><p>“You won’t lay a hand on me, Nathan Ryder,” she said. “That’s the problem, as I recall.”</p><p>She was right, of course. He’d rather cut off his hand than hurt her. “Fine.” Slicing out his claws, he prepared to scale the tree and drag her down to safety.</p><p>“Don’t you dare mess up my Christmas tree.”</p><p>He stopped. “Your what ?” The fir was so tall it seemed to touch the night clouds. Only a crazy woman would attempt to decorate this. But instead of asking if she’d lost her mind and chance getting his head bitten off, he decided to point out another fact. “It’s not Christmas for weeks.”</p><p>“It’s a big tree.” She continued walking along the branch as she strung the lights. “If you’re not going to leave, make yourself useful and string the other side. There are more lights at the bottom of the trunk. Don’t insult my cat by playing catcher.”</p><p>Knowing she was right about her leopard being agile enough to ensure she’d always land on her feet, he looked down, then wished he hadn’t. “Where did you get this many lights?” He picked up the heaviest rope, shoved it over one arm, and started climbing.</p><p>“People liked the idea of a giant Christmas tree.”</p><p>“It’ll draw Psy to the area like magnets.” The other race knew nothing of the pack’s network of lairs and aeries. It was a form of protection against the Psy hunger for power. “You want to announce our Pack Circle?”</p><p>“I’m not an idiot.” The words were blades. “The lights are special low-impact ones. They won’t even show to the top of the tree, much less put out a detectable heat signature.”</p><p>He wondered if insanity was catching. “I can’t believe I’m having this conversation with you. It’s ten o’clock at night.”</p><p>“Feel free to leave if it’s past your bedtime.”</p><p>The bite of sarcasm made him grin. His cat liked being near Tamsyn, no matter her mood. And he was animal enough to appreciate her claws—no leopard wanted a weak mate. “So, what are you planning to do for an encore? A parade of giant jack o’lanterns? Maybe we can use them to scare off the wolves?”</p><p>“Good idea.” He could hear her smirk. “Shouldn’t you be out doing important sentinel stuff?”</p><p>“I’m not officially a sentinel yet.” Though he was already being allocated most of Cian’s work as the other man concentrated on his role as advisor to Lachlan and trainer to Lucas. “I have the night off.”</p><p>“And you’re here? What, Juanita was busy?”</p><p>He let her hear the angry rumble of his growl. “Are you really accusing me of cheating?”</p><p>“Not possible to cheat on something that doesn’t exist.”</p><p>“Tamsyn,” he began, intending to tear into her. Then his beast suddenly realized something. “You’re still jealous of a relationship that was over years ago.” He couldn’t understand why, not when he’d made it plain that he’d been celibate since the mating bond snapped into being.</p><p>Silence for several minutes. “It hurts me to know a woman who’s been allowed full skin privileges with you—while I’m not even worth a simple kiss.”</p><p>He froze at the amount of pain in that single statement. “Don’t you ever compare yourself to any other woman,” he said, his beast raging at the mere idea. The instant he’d realized she’d been born for him, it had blinded him to anyone else.</p><p>She didn’t answer.</p><p>“Tammy.”</p><p>“I don’t want to talk anymore.”</p><p>He was certain he heard tears in her voice. It shook him. His strong, beautiful mate never cried. “Tammy, don’t.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Don’t what? Decorate my tree in peace?” The acerbic edge was back.</p><p>“I thought...” He shook his head, relieved. “What’s next, after the lights?”</p><p>“Ornaments. They’ll take a while. I’m going to get the kids to make one each.”</p> <p>He jumped easily to the ground and picked up the last rope. Stringing that took far too little time though he tried to stretch it out. Tamsyn was waiting for him when he jumped down the second time. “Thanks.”</p><p>He fisted his hands to keep from stroking the delicate line of her profile. “You going to turn it on?”</p><p>“Not until it’s ready.” She shoved her own hands into the pockets of her jeans. “I better get inside. It’s chilly.”</p><p>He was one step from pulling her into a hug, would have done so for any other packmate who needed it—touch was the cornerstone of who they were. But if he touched Tamsyn, it wouldn’t stop at a simple hug. He’d take all of her, claim proprietary skin privileges from head to toe, spending extra time on every seductive feminine curve in between. His voice was leopard-rough when he asked, “What are you doing tomorrow?”</p><p>“Working with the kids on the ornaments. Going over some study papers.” She turned on her heel. “Good night, Nate.”</p> <p>He frowned. “You’re still angry.”</p><p>“No.” She gave him a tight smile. “But I’m also not a sucker for punishment. You might have had years to get used to resisting the full brunt of the mating heat, but I haven’t. So help me out and keep your distance.”</p><p>“KEEP MY DISTANCE.” NATE PACED ACROSS THE LENGTH OF his living room and back. “Keep my distance.” He was her mate—she belonged to him—and she’d told him to keep his distance.</p><p>Something growled deep in the forests that surrounded his home and he wondered which one of his pack was running under the moon. If he’d had to bet, he’d have said either Lucas or Vaughn, or maybe both. The two were still juveniles, but both had already seen death firsthand, been scarred by their losses. Now they waited to grow up so they could claim vengeance.</p><p>He would go with them when it was time to destroy the ShadowWalkers. The younger males would be fighting their demons, but he would be fighting for his mate’s right to be safe. Something dark and almost violent in him tightened at the thought of her, a sense of complete rightness filling his soul. She was his, wouldn’t ever be anyone else’s. The reminder calmed the visceral hunger of his beast.</p><p>He would never forget the moment when he’d realized what she was to him. Because of the disparity in their ages, they had had different friends, moved in different levels of the pack. But he had always known who she was, adored her in a way that was everything good—her laugh soothed the rough edges of his beast, her smile made him want to smile in turn.</p> <p>On the night of her fifteenth birthday, she had hosted a small sleepover party at her parents’ home. He’d dropped in to wish her a happy birthday. It had been no fleeting impulse—he’d become used to swinging by to check if she was okay, especially during the times when her parents were out. As soon as she had opened the door, he’d felt the bond snap taut. The knowledge had been in her eyes, too, shocked and bright.</p><p>He’d touched her then, cupped her cheek with his hand. She had leaned into him, soft and welcoming and everything he had ever wanted. He’d known that, at that moment, he could ask anything of her and she’d give it to him. That was what had made him draw back. “Not until you’re ready,” he’d said, ending the contact.</p><p>It was a promise he refused to break.</p><p>Tamsyn thought he was being cruel. She hadn’t seen what he had with his parents. His mother had been too young, his father too demanding. Within a decade, they had destroyed each other and themselves. The idea of doing that to Tamsyn was his worst nightmare. Because he knew he was too much like his father—he would not be an easy man to mate with. He’d expect total devotion, demand complete sexual surrender, take absolute possession.</p><p>Tonight, his body hungered for her with a fury that was more animal than man. The cat had wanted her from the first. To the leopard, she’d smelled mature at fifteen, but the man had known she was nowhere near ready. Now...now he could have her—if he was willing to look into her eyes for the rest of his life and know he’d stolen what little freedom she could have had.</p><p>“No.” He would not do that to her. She might be frustrated and annoyed with him, but she’d forgive him. It was what mates did.</p><p>TAMSYN WAS NEVER GOING TO FORGIVE NATHAN FOR PUTTING her through this! “I can’t stand it!” Her skin was so sensitive even the sheets felt abrasive. The flesh between her legs was swollen with need and there was only one man she wanted to rub against, only one thing she wanted to do. Unfortunately, Nate didn’t want to play.</p><p>Why had he turned up tonight? To torture her? Her beast had become drunk on his scent, addicted to the proud masculine taste of him. It wanted more. So much more. Maybe that was why he’d come over—because his beast was starving, too? She snorted. More likely he’d come to tell her off for daring to turn her back on him this afternoon.</p> <p>Nate was used to obedience. Particularly from her. As a fifteen-year-old, she’d taken everything he said as gospel. At sixteen, she’d given him the occasional moment of lip but had always accepted his decisions in the end. And he’d never let her down. He’d been her rock...especially after that dark day two years ago when she had failed to save Lucas’s father.</p><p>“Carlos wanted to die,” Nate had whispered in her ear, holding her tight as she sobbed over the loss. He’d still held her then. “He didn’t want to live without Shayla.”</p><p>It hadn’t taken away her sense of failure, but she’d understood. The bond between mates was beautiful, powerful. Separated mates could live without each other, but it hurt. As she knew too well. And she shouldn’t! Unlike those whose mates had been lost to death, Nate was alive but wouldn’t touch her.</p><p>That was so incredibly wrong. Changelings weren’t Psy. Touch was as necessary to them as food and air. Tamsyn thought nothing of hugging and kissing a fellow packmate who needed reassurance. That her mate wouldn’t even give her that...</p><p>“I don’t care,” she lied into the dark. “Hell, yes I do.” Shoving off the sheets and blankets, she slid off the bed and went to get a glass of water. Ice cold water. God, even her skin ached.</p><p>Filling up the glass, she took it and herself to the front window. Her plan—to distract herself by admiring her tree—disappeared the second she saw the leopard asleep on one of the branches. She couldn’t make out his markings but she already knew who it was. Nathan. The man wouldn’t take her as his mate in truth, but he thought he had the right to protect her? Damn him. Slamming down the glass, she was halfway to the door when she looked down at herself.</p><p>All she wore was an old football jersey. It was Nate’s. She’d stolen it from him in a blatant bit of thievery, needing his scent around her. But big as it was, it gaped over her full breasts and only hit her midthigh. Maybe she should change. And it was freezing outside.</p><p>Nate probably wouldn’t appreciate her walking around half-naked any—She slapped her forehead. “Tamsyn, sometimes you’re an idiot.” Of course he wouldn’t appreciate her walking around half-naked. The sight of so much skin might incite his beast, tempt it enough to overpower the man’s will.</p><p>Her lips curved.</p><p>Five</p><p>SHOVING HER FEET INTO A PAIR OF FLUFFY SLIPPERS, SHE stamped outside and to the tree, knowing he’d have woken the second she opened the door. “Nathan, you get out of here right now!” She hugged her arms around herself, well aware the move plumped up her breasts, creating a deep cleavage.</p><p>The leopard growled at her, its green eyes dangerously bright.</p><p>“Don’t you growl at me,” she said and her breath turned the air to mist. “You don’t get to pick and choose which parts of the mating deal you want. It’s all or nothing. Go away! ”</p><p>He padded along the tree limb and leaped to the ground by her feet, a stunning creature she could stroke for hours. Then he butted at her legs, urging her inside the house.</p><p>The touch of his fur against her skin made her shiver. “I’m not leaving until you’re gone.” She’d meant to tease him, but already, her own leopard was scraping at the insides of her skin, so darkly needy it scared her.</p><p>He bared his teeth and gave a short, husky roar meant to snap her to attention. His eyes told her to get her little butt back inside or he’d do it for her. She hoped he would. Because if he shifted now, he’d be naked. Skin to skin contact at last. Her thighs trembled, but she somehow found the strength to stamp her foot and point away from her home. “Out! Leave!”</p><p>He began walking toward the house. She frowned, wondering what he was up to. He got to the door and looked over his shoulder. She wasn’t going to fall for that. Then he walked inside. Her eyes wide, she hotfooted it inside, closing the door behind her.</p><p>The leopard was sitting in front of the currently unlit laz-fire, the artificial heating system designed to resemble a live blaze—but one that had zero chance of getting out of control. He glanced at her, his eyes night-glow in the darkness.</p><p>“Good idea,” she said, half-frozen. Kicking off the furry slippers, she turned on the laz-fire. The flames shot to instantaneous life. “Brr.” Rubbing her hands together, she sat down beside Nathan. She couldn’t quite think straight but that was okay. Nate was in her house. He was here. And they were alone.</p><p>He butted at her hand with his head and she began to stroke him, her body warming up from the inside out. “What were you doing out there, Nate?”</p><p>He lay his head on her thigh and growled softly in response.</p><p>“It’s because my parents are gone, isn’t it?” She sighed and tried not to tremble at the proximity of him. He was so lethally beautiful, his body pure muscle under her strokes. “When are you going to accept that I’m a grown-up? Huh?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>No response. The steady rhythm of his breathing told her he’d fallen asleep. She couldn’t bear to wake him. Tears pricked her eyes. If she shifted, they would both be cat and...No, she thought. She wouldn’t use the animals’ driving need against Nate.</p><p>It was the man who wanted to give her “freedom” and it was the man she had to convince. The animal already knew what was right. If only Nate’s human half hadn’t gotten in the way. Except, of course, she loved that part of him, too. Sighing, she stroked her fingers through his fur over and over.</p><p>It was a long while later when she curled up beside him and went to sleep.</p> <p>NATE WAITED TO LIFT HIS HEAD UNTIL HE WAS ABSOLUTELY sure Tamsyn was fast asleep. The last hour had been both pain and pleasure, torture and redemption. The animal couldn’t understand why he didn’t claim her. One thought, a split-second shift into human form, and he could take her right there on the softness of the rug.</p><p>The temptation was shockingly strong.</p><p>She was the most exquisite creature he had ever seen. A long, tall drink of woman. He could spend all night stroking his hand up and down the sleekness of her thighs—exposed by that jersey she’d stolen years ago.</p><p>He’d known, of course. It had given him pleasure to think of her covered in his scent. Since he hadn’t seen her wearing it around, he had guessed, had wanted , it to be her nightwear of choice. His claws dug into the rug as he shifted his attention to the proud thrust of her breasts. There was no question about it—Tamsyn was every inch a woman. And so heartbreakingly young.</p><p>No one would think to look at her that she’d been their healer for two years already. Oh, the few packs they had trusted after Shayla’s murder—packs with men and women seeded from DarkRiver—had sent senior healers to complete her education, but it was Tamsyn the pack looked to. She was their own and she was deeply trusted.</p> <p>Because she had never let them down.</p><p>He remembered her at seventeen. Her mentor was dead and Shayla’s mate, Carlos, lay critically injured. Their son, Lucas, remained missing. Tammy had been so slender back then, a fragile reed he’d thought would snap under the weight of the dying sentinel’s wounds. But she hadn’t broken. Instead, she’d put every inch of her abilities into healing Carlos.</p><p>She hadn’t been able to save his life, but she had given him the strength to whisper his final words—ones that told them Lucas was still alive. Tammy had been completely drained by the effort to save Carlos, but when they had rescued a badly injured Lucas, she had somehow found impossibly more to give. And she’d kept doing it for weeks.</p><p>She had slept only when Nate forced her to, worried she’d collapse under the strain. Even then, she would crawl out of bed after a few hours at most. Finally, Nate had had to half-kidnap her. He’d held her in his lap and told her to sleep. And she had, curled up trustingly in his arms.</p><p>The girl who had been that slender reed was gone. She’d grown into a woman of courage and beauty, but one who had never been given the chance to be a juvenile. Leopards valued their freedom to roam—many left the pack and came back after spending time in the wild. He, too, had left DarkRiver for several years in his late teens. Tammy had never had that choice, her wings clipped at fifteen.</p><p>Backing away from the lush temptation of her, he dragged an afghan off the couch using his teeth and pulled it over her. It would’ve been easier in his human form, but he didn’t trust his willpower that much. One touch was all it would take. He’d crumble like so much dust.</p> <p>He decided to keep watch over her from the outside.</p><p>TAMSYN WOKE UP WARM...AND ALONE.IT HURT. “I COULD hate you, Nathan.” Getting up, she hugged the afghan around herself and stared into the laz-fire. Her internal clock told her it was morning, sometime around six. Despite the fact that she’d done all she could to entice Nate, he hadn’t so much as kissed her.</p><p>Was she that disgusting to him?</p><p>A sob caught in her throat. It was the first time she’d considered that Nate’s recalcitrance might spring, not from his overwhelming protectiveness, but because he didn’t want to be tied to her. Her lower lip trembled. She hugged the afghan even tighter around her body in a vain effort to ward off hysteria.</p><p>Being unwanted by a mate was a nightmare beyond comprehension. Mating wasn’t marriage, wasn’t infatuation, wasn’t a connection you ever broke. She was tied to Nate on the level of her soul. More than that, she loved him. Some people said that there was no difference between the bond and love, but she knew there was. It was one thing to be compelled toward Nate, another to adore him like she did. She loved everything about him, from his strength to his laugh to his unashamed masculinity.</p><p>But what if, for Nate, the bond was simply a compulsion? One he couldn’t dissolve, but that he wouldn’t have chosen if he’d been given the choice? She was hardly a prize, she knew that, had always known it. Added to that, Nate was older, more experienced. Maybe he’d expected and wanted to find a mate who could match him, a woman who’d seen far more of the world than just their small corner of it.</p><p>In contrast, Tamsyn had always been tied to DarkRiver. That didn’t matter to her. She was a woman of home and hearth. It was the way of most healers. They liked to be near their people, their lands. Healers built permanent homes before most others, took in any who needed their help, and cherished those who were their own. The months in New York had almost torn out her heart, she’d been so homesick.</p><p>But Nate had roamed. He’d left the pack for years as a juvenile and come back a man, strong, loyal, and with wild horizons in his eyes. What did he see in hers? Home—calm, steady, enduring. But not very exciting. No wonder he didn’t want her!</p> <p>Tamsyn had worked herself into quite a state, something that would’ve flabbergasted those who knew her, when the comm console chimed. It was the emergency code. She blinked and snapped to attention, the healer in her taking over. “Talk to me.”</p><p>Juanita’s face appeared onscreen. “Dorian broke his arm while we were sparring near the Circle. It’s pretty bad.”</p><p>“Don’t move him.” Turning off the screen, she got up, changed at the speed of light, grabbed her emergency supplies, and headed out.</p><p>The cold air cut across her cheeks as she ran. If Dorian hadn’t been so close by, she’d have taken a vehicle. But at this distance, her changeling speed was faster than the vehicle would have been on the rutted forest roads. The roads had been damaged on purpose. It was another line of defense, meant to bog down the unwary. DarkRiver was never going to be caught off-guard again.</p><p>She found Juanita crouched beside Dorian, who was sitting propped up against a tree. Though the woman looked concerned, Dorian’s face betrayed nothing. Barely into double digits, the boy was better at hiding his feelings than most adults. “What were you two doing to break that arm?” she asked, going down beside him.</p><p>“Karate. Brown belt. San-kyu,” Juanita answered.</p><p>Tamsyn didn’t berate the other woman for using such advanced techniques against a boy. They all knew Dorian was no child. He’d been born latent and had no ability to shift into leopard form. Perhaps it was something that might have been held against him had he not made it his mission to become so dangerous, no one would dare treat him as anything but another cat.</p><p>“A single break. Clean,” she told him. “You were lucky.”</p><p>Pure blue eyes looked into hers. “How long till I can use it?”</p><p>“As long as I say.” She put a pressure injector against his arm before he could object that he didn’t need the anesthetic. Then, using the portable deep-tissue viewer to double-check the conclusions of her healing gift, she set the break and encased it in a lightweight but durable cast. Dorian had normal changeling strength and healing capacity—he’d regain the use of his arm far sooner than a human or Psy would have in the same situation.</p><p>“Nita, can you give me a minute with Dorian?” She glanced at the beautiful woman.</p><p>Juanita nodded. “I have a perimeter watch to take over.”</p><p>“I’ll make sure he gets home.”</p><p>Dorian scowled as they talked about him but didn’t say anything until Juanita had disappeared into the trees. “What?”</p><p>Shaking her head at that stubborn male expression, Tamsyn moved to sit slightly behind him. Then she threw her arms around his neck and leaned down to press her cheek against his. “San-kyu, that’s the third level, isn’t it?” With the dominant males—or with the young ones who would one day be dominant—you had to tread carefully. Demanding would get her nothing from Dorian.</p><p>He softened a little. “Yep. I’m going for black next month.”</p><p>“Impressive. When I left for New York, you were still on the first level of brown.”</p><p>He let her tug him further into her embrace. Touch was at the heart of a healthy pack. It was what bound them together, what gave them their strength. Smiling, she raised her hand and began to brush her fingers through his incongruously silky blond hair as he lay against her.</p><p>“I’m going to be past Juanita’s level soon.” It was a small boast and it was perfectly normal. Whatever had happened to break his arm, it hadn’t bruised his pride too much.</p><p>She grinned. “Then who are you going to beat up?”</p><p>He actually smiled. “You want I should do Nate for you?”</p><p>It seemed the whole pack knew how things were between her and Nathan. “Brat.”</p><p>“Yeah, but you like me.”</p><p>Laughing, she pressed a kiss to his cheek before rising. He followed, his bones showing the promise of a height that would top hers by several inches at least. “Look after yourself, Dorian. If I see you one more time this year, I’m going to do something nasty like pull healer rank and ground you.”</p><p>“Like you wish you could ground Nate—maybe in your bedroom?”</p><p>“Dorian!”</p><p>Mischief in his grin, he backed away from her before turning to run off through the trees. She kept her smile hidden until he was gone. Then she bent down and began to gather up her supplies and equipment. She was pleased. Her medical training had come in very handy today. Otherwise she’d have used up healing energy to no useful purpose. What she did came from inside her—she had to conserve her strength for the worst injuries...as had happened with Carlos. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Leaves rustled to her left and she looked up to see Juanita step out. “Did you see my—ah, there it is.” Nita picked a slender black timepiece off the ground. “Took it off while we were sparring. That boy is dangerous when he gets going.”</p><p>Nodding, Tamsyn continued to put away her things. Nita was the last person she wanted to chat to, especially after the horrible realization she’d had that morning. Then the other woman went down on her haunches beside Tamsyn.</p><p>“Hey, Tammy. I need some advice.”</p> <p>Her healer core came to the surface, consigning the sick ugliness of jealousy to one tiny corner. “Is something the matter?” She looked into that sensual, exotic face and no longer saw a rival, but a packmate who might need help.</p><p>“You could say that.” Dark eyes twinkled. “I’m wondering how to bring up Nate without putting my foot in it.”</p><p>Six</p><p>TAMSYN FROZE.“WHAT ABOUT NATE?” SHE FORCED HERSELF to say.</p><p>“Look”—Juanita tapped a finger against her knee—“he’s a wonderful guy and we had some fun together—”</p> <p>Tamsyn shut her bag and prepared to get up.</p><p>Juanita stopped her by holding onto her upper arm. “But that’s all it was. Fun. We were friends then and we’re friends now. Nothing more.”</p><p>“Okay. I have to go.” She was so hungry for Nate’s touch that even the idea of him with another woman bruised her raw.</p><p>Juanita didn’t release her. “You’re not listening, Tammy. I’m telling you that that man never looked at me with the kind of wild heat with which he looks at you. He never craved me, not like he craves you.”</p><p>Tamsyn stared at the other woman. “He left me,” she found herself saying. “I was all but offering myself to him on a silver platter and he left me. He doesn’t crave me.”</p><p>Juanita laughed. “The man wants you so much, he’s driving all the juveniles crazy. You know how sensitive they are to sexual hunger, and right now, Nate is a six-feet-plus shot of pure animal need. And he’s not interested in anyone but you.”</p> <p>“But—”</p><p>“But nothing.” Juanita stood and waited until Tamsyn, too, was up before continuing. “Don’t take this the wrong way but you’re young.”</p><p>How else could she take it? “I’m more mature than people years older.”</p><p>“Yes, you are. I wouldn’t hesitate to come to you for advice on a thousand things.” Juanita’s matter-of-fact words took the wind out of Tamsyn’s sails. “But there’s one area in which you are a babe in the woods.”</p><p>“Men,” Tamsyn whispered, embarrassment a blaze across her cheeks.</p><p>“Yep. You were one of the lucky ones—you found your mate early, but that came with a price.” Juanita didn’t need to spell it out. “So trust me when I tell you the man is dying for a taste of you.”</p><p>Tamsyn ached to believe. “He’s very good at hiding it.”</p><p>“Of course he is. He’s stubborn and he’s dominant. He wants to do this his way. It’s up to you to change his mind. Please do it before he drives everyone insane.”</p> <p>Taking a deep breath, Tamsyn swallowed her pride and put her faith in the bonds of Pack. “You have experience. Teach me what I need to know.”</p><p>Juanita grinned. “I thought you’d never ask.”</p><p>ADAY AFTER HE’D LEFT TAMMY SLEEPING BY THE FIRE, NATE returned from a meeting with Lachlan to find the area around her home crawling with children. Not all of them were exactly underage. “What are you doing?” he asked Cian, who was sitting on what looked like a bench and table set stolen from their alpha’s backyard.</p><p>The older man grinned. “Making Christmas decorations, what does it look like?” He returned to painting the small glass ball in his hand.</p><p>“Why?” Nate insisted.</p><p>Cian scowled at him. “Because Tamsyn said I had to.”</p><p>“She’s less than half your age.”</p><p>“Have you tried to argue with her when she wants to get her own way?” Shaking his head, Cian returned to his task. “Besides, it’s kind of fun. And she’s got the juveniles interested in something other than raising hell, which makes our job easier.”</p><p>Now that Cian had mentioned it, Nate realized just how many of the older kids were present. Even arm-cast-laden Dorian appeared to be having fun. Nate watched as the boy bent down to help a five-year-old paint something on her globe. When she smiled, so did Dorian.</p><p>Turning his head, Nate found Lucas sitting with another group of young ones. Several cubs were trying to use his body as a climbing frame, but from the sharp grin on his face, he didn’t seem to be worried. He called out to someone else and Nate’s eyes followed his gaze to locate another unexpected addition to Tamsyn’s gathering. Vaughn. He was even worse a loner than Dorian. But there he was, patiently helping several of the three-year-olds.</p><p>“They’re happy,” a feminine voice said from beside him.</p><p>He looked down. “You did good.”</p><p>Astonishment was open on her face. “Oh.” A pause. “Thank you.”</p><p>He scowled. “What’s wrong with me complimenting you?”</p><p>“Nothing.” She shrugged, her breasts pushing out against the softness of her black cowl-neck sweater. “You just don’t do it much.”</p><p>He reached out to pinch a bit of her sweater with his fingertips. “What is this stuff?” It was so damn strokable he was having a hard time keeping himself from doing exactly that. Shaping his mate’s body with his palms seemed like the best idea he’d had all day.</p><p>“Angora blend.” She pulled away from his touch and took a step backward. “Do you want to paint an ornament? Or you can help the children.”</p><p>He didn’t like the distance she’d put between them. “What’s the matter with you?”</p><p>Something flickered in her eyes before her lashes lowered to screen her expression. “I’m living my own life. It’s what you want, right?” A small smile. “I’m finally beginning to appreciate what you’ve been trying to tell me.” With that, she went off to check up on a group of giggling teenage girls.</p><p>Nate wondered if he looked as sucker-punched as he felt. She’d pulled that stunt out of nowhere. All these months of fighting him, of demanding he accept their bond, and she was suddenly going to fall in line? Right. He’d believe that when he saw it. Tamsyn had called him every day from New York—she couldn’t shut him out if she tried.</p><p>Twelve hours of near-silence later, long after everyone else had left, he grit his teeth and handed her an ornament. “This is the last finished one.” Many had taken theirs home to complete.</p><p>“Thanks.” She hung it on her damn tree before jumping down from the branch on which she’d crouched. “I think it’ll look fabulous when it’s done, don’t you?” Without waiting for an answer, she turned to walk up the path to her door.</p><p>“Where are you going?” He barely kept the growl out of his voice.</p><p>She threw him a confused look. “It’s dark. I’m going to have a bath and dinner.”</p><p>He waited for the invitation to join her. It didn’t come. “Your parents aren’t back.”</p><p>“Oh, don’t worry.” A tight smile accompanied her words. “A few of my girlfriends are dropping by tonight.”</p><p>“Who?”</p><p>“Friends. Actually, do you mind not coming by at all?” she asked. “We can hardly talk girl-talk if we know you’re out here skulking.”</p><p>His temper wasn’t easily stoked. But it was smoking now. “Skulking?”</p><p>She gave him an airy wave. “You know what I mean. We’ll be fine. I even asked some of the other soldiers to swing past during their night watches. You should go do your own thing.” A few seconds later, her door shut behind her.</p><p>He didn’t move, rooted to the spot by pure disbelief. She’d told him to get lost. Nobody told him to get lost. Especially not his mate. He’d taken the first step up the path to her home when he felt someone walk out of the woods behind him. He turned to find Juanita. “What?” It was the leopard speaking.</p><p>“This is part of my night route.” She gave him a curious look. “What are you doing here?”</p><p>What kind of idiotic question was that? “Looking after my mate.”</p><p>Juanita scowled. “You’re on the eastern perimeter, Nate. If you wanted a change, you should’ve told Cian. We’ll have a gap there otherwise and you know we can’t afford to. Especially not with Solias King’s men sniffing around.”</p><p>He knew she was right. “Cian factors mates into the watch assignments.”</p><p>“Yeah, but you haven’t claimed Tammy. He probably thought you wanted some space from her—you’re getting more and more irritable.” Her tone was blunt. “Look, I’d take the eastern for you, but I’m pulling a double anyway and I’d prefer to stay close to home.”</p><p>There was nothing he could say to that. He was one of the most experienced soldiers in the pack, and as such, he had a job to do. “Don’t let anything happen to her.” It was half warning, half threat.</p><p>Juanita’s response was a raised eyebrow. “Tammy’s no cub. She can handle herself.”</p><p>TAMSYN PUT OUT THE SNACKS WITH TREMBLING HANDS. SHE couldn’t believe she’d “ignored” Nate all day. The act had stretched her nerves to screaming point, the compulsion to speak to him as powerful and as intrinsic as her heartbeat. She was obsessing over their parting words when the soft buzz of the doorbell sliced her thoughts in half.</p><p>Taking a deep breath, she opened the door. “Oh, it’s you.”</p><p>Juanita grinned. “I told you it would work.”</p><p>“He’s furious.” She looked over the other woman’s shoulder, hoping to see Nate. “I thought he was going to march up here and demand I—”</p><p>“Precisely.” Juanita put her hands on her hips and shook her head. “He’s used to demanding something from you and getting it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Isn’t that what mates do?”</p><p>“Sure. But he’s being an ass about it. He’s not exactly meeting your demands, is he?”</p><p>Tamsyn scowled on Nate’s behalf. “You don’t—”</p> <p>“Don’t you dare defend him,” Juanita ordered. “And don’t you back down, either. You’re just giving him a taste of his own medicine. This is what he’s been doing to you for over a year. Let him see how he likes it.”</p><p>It made sense, but Tamsyn wasn’t a soldier, to think of love like strategy. Her heart was that of a healer—gentle and easy to forgive. “He hates it.”</p><p>“Good.” The other woman grinned. “If you don’t allow him access to you anytime he wants to feed the animal’s need to be close to you, he’s going to get desperate sooner rather than later. Then he’ll jump you and, bang, we’ll all live happily ever after.”</p><p>Tamsyn nodded. She liked the idea of being jumped by a sexually hungry Nate. “If he doesn’t do it soon, I might attack him myself.” Her sensitivity to his proximity was getting worse, the mere sound of his voice enough to melt her to damp readiness.</p><p>Juanita grinned. “I give him a week.”</p> <p>TWO NIGHTS LATER,TAMSYN DECIDEDJUANITA WAS A GENIUS. Nate was scowling at her from across the Pack Circle, such violent need in those midnight blue eyes that she could feel her stomach twist itself into a thousand knots.</p><p>“Stop staring at him,” she muttered noiselessly to herself. She hadn’t said much more than hello to him for the past forty-eight hours, but if she didn’t keep her eyes to herself, he’d figure out just how hard it was for her to maintain her distant air. She ached for him and the ache was a pulsing beat in every inch of her skin...and worse in lower, hotter places.</p><p>Breaking the connection through sheer effort of will, she focused on the dancers in the middle of the Circle. They were part of an impromptu gathering sparked by the full yellow moon, a happy diversion from the general air of wary alertness that had gripped DarkRiver since the attack by the ShadowWalkers. That wasn’t to say that their defenses were compromised. Those on watch were being spelled by off-duty packmates so everyone could join in the fun.</p><p>And it was fun—warm, friendly, brilliantly alive. Several people had pulled out instruments and the music was energetic and strong. She clapped along with the players, and when Lucas came to offer her his hand, she took it with a smile. “Watch out, I’ve got two left feet.”</p><p>He grinned, the savage markings on one side of his face—markings he’d been born with—making him look more panther than boy. “Good thing I don’t scare easy.”</p><p>Laughing, she let him swirl her around in an energetic dance that required enough of her concentration that she almost stopped thinking about Nate. When the tall juvenile snapped her back into his arms, she was breathless. “You’re in a good mood,” she said, glad to see him happy for once.</p> <p>There was darkness in Lucas, such darkness. She knew it would be there until the day he took vengeance on those who had stolen his family from him. He was four years younger than her, but looking into those eyes, she saw not a child but a man. Lucas would one day be an alpha of incredible strength, of that she had no doubt.</p><p>He held her closer, touching her with the easy friendliness of Pack. She rested her cheek against his shoulder and swayed to the gentler beat that had replaced the pounding dance music. “So?”</p><p>“So I thought you needed to be held.” The words were blunt, the tone affectionate.</p><p>“Thank you. I did.” There was no need to lie. Not with Pack.</p><p>“Dorian said you don’t want us to beat some sense into Nate.” He sighed as if in disappointment. “Are you sure?”</p><p>She laughed at his teasing. “I like him in once piece, but thanks for the offer.”</p><p>“Do you want to dance with him? ’Cause he’s heading this way.”</p><p>Seven</p> <p>SHE SMELLED THE RICH EARTHINESS OF NATHAN’S DISTINCTIVE scent before she could answer. It hit her system like a drug. An instant later, the heavy weight of his hand dropped on to her hip. “Luc. Go find a girl your own age.”</p><p>Lucas released her. “I think I like sexy older women—why don’t I keep Tammy and you find someone else?”</p><p>Nate’s growl was met with unrepentant laughter as Lucas threw Tammy a wink and walked away. She paid little attention to the exchange, her entire body focused on Nate as he placed both his hands low on her hips and pulled her back against his chest. “What the hell are you wearing?” He spoke against her ear, breath hot.</p><p>It was an effort to think. “Jeans and a sweater. Is that a crime?”</p><p>“The sweater is orange and anyone can see down your cleavage.”</p><p>She forced herself to laugh. “Nate, the vee isn’t that deep and the color is soft peach, not orange.” It went beautifully with her hair and eyes, throwing up golden highlights she’d never have believed possible.</p><p>“It’s fucking painted on your body, just like your jeans.”</p><p>“Watch your mouth, Nathan Ryder.” Firming up her tone, she put her hands over his and began to sway against him. It wasn’t a calculated act—her body simply craved the contact. “I’m nineteen years old. This is what women my age wear.”</p><p>His breath seemed to catch for an instant. “You don’t.”</p><p>No, she didn’t. It had always seemed to her that she shouldn’t aggravate the situation between them by being deliberately sexual. But tonight, she’d followed Juanita’s advice again and gone wild. The jeans—brought on a whim in New York—shaped her butt, and from the good-natured whistles she’d inspired in male packmates, it wasn’t a bad butt.</p><p>As for the long-forgotten sweater, baggy when she’d been a gangly thirteen, it was made of a soft, strokable material that did feel painted on over her now-womanly figure. That was the point. It was meant to make it hotly clear to Nate that she was a sexual young female, not a nun happy to wait for him to make up his mind.</p><p>“I decided it was time to change my personal style.” She moved against him again, exquisitely aware of the unforgiving ridge of his erection. “Have some fun before we settle down, exactly like you wanted.”</p><p>“Stop that.” But he didn’t do anything to halt her subtle erotic movements. “This kind of fun isn’t good for the blood pressure of the other men.” He pulled her even closer.</p><p>“They know I’m yours,” she murmured, feeling her skin flush. “Only yours.”</p><p>“Then why are you dressed like an invitation?”</p><p>For you, you idiot, she wanted to say. “I wanted to feel sexy.” She shrugged. “I haven’t had much of a chance to explore that side of me.” That, at least, was true. Between Nate’s pigheadedness and her responsibilities, she hadn’t had much play in her life. She did so want to play with Nate—silly, intimate, affectionate games.</p><p>His hands tightened. “And what are you going to do after getting yourself all heated up like this?” It was a half-growled question, but she knew him well enough to know that that roughness was an indication of need, not anger.</p><p>She tilted her head, looking up at him as he looked down. “I bought a friend.”</p><p>He seemed to choke for a second. “A friend?”</p><p>“Uh-huh. He vibrates.” It was a whisper meant to carry to his ears alone. “I think I’ll try him out tonight.”</p><p>His fingers were pressing down so hard, he was probably going to leave bruises. She didn’t care. Not when he was burning her up with the heat in his eyes. “Don’t.”</p><p>Raising her arms, she linked them behind his neck. “Why not?”</p><p>“Your first time shouldn’t be with that .”</p><p>She shrugged. “I’m getting older, Nathan. I have needs.” Dark, clawing needs. Needs only he could fulfill.</p><p>“Promise me you won’t use that stupid toy.”</p><p>“It’s not stupid.” She rubbed against the hardness of him and heard him suck in a breath. “It’s smaller than you, though.”</p><p>“Christ.” Pulling her arms off his neck, he spun her around so she faced him. “Don’t. Use. That. Thing. ” It was an order.</p><p>“Why not?” She pressed into him, the leopard in her inciting a desire to taunt, to torment. “Lots of women do it.”</p><p>Eyes going cat, he leaned down to speak against her ear, his lips teasing a suddenly sensitive portion of her anatomy. “If you promise not to use it on yourself tonight,” he whispered, “I’ll use it on you.”</p><p>Her legs threatened to collapse. “When?”</p><p>“Promise first.”</p><p>She was weak, so weak where he was concerned. “I promise I won’t use it tonight.”</p><p>He nipped at the shell of her ear and it was then she realized he’d danced them to the farthest edge of the Pack Circle, well away from the reach of the temporary lights. She whimpered and held on. “Nate.”</p><p>“Shh. It won’t be that long, baby.” His hand stroked over her back, a rigid inflexibility to his body that hadn’t been there before. “You need a little more time.”</p><p>A nauseous feeling twisted through her. “Nate, you said you’d—”</p><p>“When the time is right.” There it was again, that tense restraint...as if with her surrender, he had found control.</p><p>Anger and pain mixed a caustic brew inside her. “Well,” she said, wrenching away from him, “I only promised not to use it tonight.”</p><p>“Tamsyn.”</p><p>“And,” she continued, “I’m not going to fall for that dirty trick again.” She began backing into the Circle. “I’m sick of being teased and left wanting. Tomorrow night, I’m taking care of business.”</p><p>TAKING CARE OF BUSINESS.</p><p>Nate glared into his morning coffee and then at the duty roster he’d just received from Cian. Punching in the sentinel’s code on the comm console, he waited for Cian’s face to appear. “What the hell are you on? This roster is a joke!” He was so pissed, he consigned seniority and rank to Hades. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cian blinked. “I heard you wanted to be on the perimeter, away from Tammy.”</p><p>“I don’t recall asking for that particular favor .”</p><p>The other man winced at his tone. “You do make a point of avoiding her whenever she comes after you.” He frowned. “Though she seems to have stopped doing that lately.”</p> <p>That observation made Nate’s incisors threaten to erupt. The leopard was not happy with Tamsyn right now. Neither was the man. They both wanted to bite. To dominate. To mark. “Switch me with Juanita.”</p><p>“You sure?” Cian scowled. “You’re not exactly in a good mood. Do you want to be around Tammy?”</p><p>It was an insult—as if he’d ever hurt her. “If I had wanted advice, I’d have asked for it. Switch.”</p><p>“Fine.” Cian threw up his hands. “I’ll tell Nita.”</p><p>“And mind your own damn business from now on.” Turning off the comm, he finished his coffee and headed out. He was hungry, but he figured Tammy would have something—she was the best cook in DarkRiver.</p> <p>His new watch area was in the immediate vicinity of the Pack Circle and included Tammy’s home among a few others. On his first pass, it appeared she was still asleep, but he caught the sharp freshness of tea leaves on the second pass. Since he’d remained in human form, it was easy to walk up to her back door and knock.</p><p>He knew she had to have scented him, but she peered out suspiciously from the kitchen window before opening the door with a scowl. “What are you doing here?”</p><p>Okay, so she was still mad. His cock throbbed at the memory of the events that had led to their fight. He wanted to put his hands on the sweet curves of her bottom, crush her to him, and kiss the hell out of her bad mood.</p><p>“Good morning to you, too, sunshine,” he managed to say through the chokehold of desire. It was torture being near her, but that was infinitely better than the distance she’d maintained over the past few days.</p><p>“You’re just hungry.” She snorted and turned away, leaving the door open.</p><p>He walked in to find her at the counter, cutting slices of bread from what looked like a home-baked loaf. He forced himself to stand to the side instead of going behind her and bending down to draw in the lusciously feminine scent along the line of her throat. “Only bread today?”</p> <p>She lifted the knife and pointed it in his direction. “Do you want to get fed or not?”</p><p>“I love bread.” He knew how to stroke his mate when she needed stroking. His mind immediately took the image and ran with it, ratcheting his hunger past explosive. “Why are you half-dressed?” She was wearing his old football shirt and those ridiculous pink fluffy slippers. Sexy and adorable. A killer combination.</p><p>“I was minding my own business in my own house. You’re the one who decided to intrude.” She slapped some butter onto a slice of bread and shoved it in his direction.</p><p>He decided not to ask for jam. “Bad night?”</p><p>“Nate,” she said very quietly, gripping the edge of the counter with her hands. “Did you come here to gloat?”</p><p>He put down the half-eaten piece of bread. “What the hell are you talking about?”</p><p>“You know exactly what I’m talking about!” She turned and poked at his chest with a sharp finger. “Look, I can make stupid, virginal Tammy Mahaire so hot she doesn’t know which way is up. I can leave her gasping for me and walk away as if it doesn’t matter!”</p><p>“Hey.” He grabbed at her hand, but she pulled away. “I didn’t mean anything like that. I didn’t have a good night’s sleep, either.”</p> <p>“Oh, that makes it all right!” She threw up her arms. “We were both miserable. Whoop-de-frickin’-do!”</p><p>There was no missing the sarcasm. It dripped from every word. “What the hell is it with you lately?” He succeeded in trapping her against the counter.</p><p>“Nothing!” She shoved at him but he was far stronger. “Go away. Go away and leave me alone. Don’t you get that? How many times do I have to tell you?”</p><p>“You don’t get to do that—I’m your mate.”</p><p>She stopped fighting, her chest heaving. “No, Nate, like I told you before, you don’t get to pick and choose which parts of the mating bond you want to accept. As far as your treatment of me goes, I’m not your mate. I’m simply another young, uninteresting female.”</p><p>“Don’t be an idiot.”</p><p>“I’m not. I’m sexually frustrated.” She narrowed her eyes. “But as we discussed last night, that can be easily fixed.”</p><p>He snapped. How could she possibly think to replace him with some mechanical object? Masculine pride, pure need, and raw heat made for a volatile combination. “Sex? That’s really what this is about?” He pushed harder into her, crushing the softness of her thighs under his.</p><p>Instead of backing off, she pushed into him. “Yes! Yes! Yes! Clear enough for you?”</p><p>“Fine.” Grabbing her waist, he lifted her onto the counter, spreading her knees wide in the same move. Something fell to the floor and shattered, but he didn’t give a shit. “You want to fuck, we’ll fuck.”</p><p>A hint of uncertainty moved over her face. “Nate—”</p><p>He closed his hand over the bare skin of her upper thigh. “You’re backing off? Don’t want me now that you’re faced with the reality?”</p><p>Her lower lip quivered. “Not like this,” she whispered. “Why are you being so mean?”</p><p>The protective male core of him couldn’t bear to see her looking so emotionally bruised, but they had to have this out. He couldn’t handle being pushed the way she’d been pushing him since her return from New York. “I’m trying to give you something—I’m trying to love you the only way I know how, and you’re rejecting it because you’re hot for sex?” That hurt him. Her freedom was the biggest gift he could give her. Some days, the cost it demanded threatened to drive him to murder.</p><p>“No, Nathan, no.” She cupped her face in his hands. “I just need you—all of you—so much that I’m going crazy. I need your laugh. I need your company. I need you to sleep beside me and I need you to wake when I wake. I need you with everything in me.”</p><p>“Then stop with the sex talk. It’s not you.”</p><p>Her hands dropped to his shoulders. “It’s not me?” A soft question.</p><p>“No. You’re warm and practical and loyal. You don’t go around flaunting yourself like a—” He caught himself before he said something unforgivable.</p><p>“Why don’t I finish it for you—like a bitch in heat—that’s what you were going to say, wasn’t it?”</p><p>Eight</p><p>“DAMN IT, TAMMY, DON’T LOOK LIKE THAT.” HE WAS THE one who cupped her face this time—her spine was straight, but she couldn’t hide the hurt in her eyes. “All this, the way you’ve been talking and dressing, it’s not anything normal for you and you know it.”</p><p>She looked at him through her lashes. “Yeah. Don’t know what I was thinking.”</p><p>His beast didn’t like the flatness in her tone. Reacting instinctively, he bent until their foreheads touched. “Come on, where’s my sweet Tammy?” He missed the woman who had become his closest friend over the years, the one with whom he could totally lower his guard. It was something he hadn’t been able to do since the day she’d started pushing at him. “Tamsyn?”</p><p>“I’m fine and I’m also late.” She gave him a shaky smile, then pressed her hands gently against his chest. “Some of the kids will be here soon to finish up their ornaments. I’d better get dressed. I’ll talk to you later, okay?”</p><p>“You sure you’re all right, baby?” His leopard was pacing inside his skull, growling that something was wrong.</p><p>“Just a headache. Lack of sleep, you know.” She shrugged, making the former point of contention a joke. When her lips curved upward in a deeper smile, the leopard relaxed.</p><p>“Yeah, I do.” Laughing, he helped her down from the counter, then lifted her over the mess of the broken jam jar on the floor. “Go get changed. I’ll clean this up and head out to continue my watch.”</p><p>“Here.” She reached out, picked up a muffin from a tin, and gave it to him. “I made them for the kids.”</p><p>He bit into it. “Good thing I got here first.”</p><p>TAMSYN LEFT THE ROOM TO THE SOUND OF NATE’S chuckle. The knives of pain inside her stabbed with brutal force, but she kept her composure until she heard him leave the house. Then she sat down on her bed and cried. The tears weren’t of frustration or simple hurt. They were the shattered cries of a broken heart.</p><p>Juanita had been wrong. The mating heat might have forced Nate into wanting her, but he didn’t actually see her as a sexual, desirable woman. He saw her as comfortable...practical. Warm, loyal Tamsyn. If the bond hadn’t thrown them together, he’d probably never have looked at her twice, not as a man looks at a woman.</p><p>She might have lain there for hours, but she couldn’t bear to disappoint the kids. So she got up and dressed. What she saw in the mirror simply reinforced her earlier conclusions. Dressed in a pair of old jeans and a thick white sweater, with her hair pulled back into a ponytail, she looked young and...ordinary.</p><p>She was no temptress. She was safe and sensible, the one that juveniles came to for help without judgment, and mature women for ideas about how to handle rambunctious infants. Even senior packmates didn’t blink at asking her advice on Pack issues. Because she was trusted, both for her steady temperament and for her loyal heart. None of which was bad. Only she didn’t want Nathan to see her as that—she wanted him to see her as she saw him. As a lover, a playmate in the most intimate of arenas.</p><p>But he didn’t. And that blow cut so deep, she could barely think.</p><p>Something registered in her consciousness. A second later, she picked up the high-pitched sounds of children’s voices. The healer in her took over—there was no time for self-pity. Wiping her eyes with the backs of her hands, she went to the bathroom and splashed cold water over her face. Then she used her healing abilities to get rid of the redness around her eyes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The doorbell rang.</p><p>Pasting on a smile, she walked down and opened the door. The kids’ bright and excited faces turned her faux smile real, but nothing could heal the open wound that was the jagged beat of her animal heart.</p><p>NATE SAW TAMSYN AGAIN THAT DAY, BUT IT WAS HOURS later and with several others as they sat around her kitchen table eating dinner. She’d chosen not to sit next to him, but he could understand why. The awareness between them had only gotten stronger since this morning, until he could scent nothing but the sensual promise of her. She was everything he had ever wanted—that smile, that acerbic wit she seemed to show him alone, and lord help him, that body—and she was his. No other man had the right to her.</p> <p>His beast wanted to roar its claim, but he fought the impulse. He’d wait. He’d wait...but maybe not as long as he’d initially planned. He’d give her another six months of freedom at least, let her live some of her dreams. She could go roaming if she liked, explore a bit of the wild. It might be dangerous, but Tamsyn was smarter and more mature than most of the other young leopards. She’d be fine.</p><p>The cat in him didn’t like the idea, knew how badly it would hurt to be parted from her, but it had to be done. He never wanted her to turn to him—as his mother had turned to his father—and accuse him of stealing her life. That would destroy him. Because she was his life. The thought of crushing her spirit was his personal nightmare.</p><p>“Are you going to eat or do you plan on staring at Tammy the whole night?” Juanita passed him the potatoes.</p><p>“I can stare if I like.” It was his right.</p><p>Rolling her eyes, she called out to Tammy. “Hey, where’s that dress you were going to wear tonight?”</p> <p>Tammy colored. “I changed my mind.”</p><p>“You look fine to me.” Dressed in black slacks and a pale blue cardigan, she appeared soft and touchable. Strokable. Shit. His mind was going off track again. Before long, he’d start thinking about unbuttoning that cardigan and kissing his way—</p><p>“Great,” Juanita hissed, breaking into the taut eroticism of his newest daydream. “Tell your mate she looks fine.”</p><p>“What the hell’s wrong with that?” He took the peas she almost shoved into his chest. “She looks—” He cut himself off before he said what he wanted to say, which was “pretty enough to bite into.”</p><p>Juanita shot him a disgusted glance before turning her attention to the packmate on her other side. Ignoring her, Nate went back to the pleasurable task of watching Tamsyn. The beast bucked to taste her. Six months , he told it. Six more months and then you can have her. In every way. And over again.</p><p>BUT A BARE WEEK LATER, HIS HUNGER FOR HER HAD GOTTEN so bad that he had Cian reassign him to the perimeter. Tammy was no longer trying to flaunt herself at him—if anything, she seemed to be going to great lengths to give him space. Paradoxically, that only amplified the building pressure to mate, to touch and taste and claim. Without the control provided by the vivid scars of memory, he’d have given in a hundred times already.</p> <p>Still, he couldn’t keep from going to her each morning, just to see her smile. “Hey, sweetheart, any muffins today?”</p><p>She gave him one, but there was no smile on her lips. “How’s the Solias King situation? Any decisions?”</p><p>“We’re planning to make a move in a few days.” He’d already told her what they intended to do—she was his mate, and more than that, she was damn sharp, an integral part of the steel backbone of the pack. “You want to come along? Be a nice run.” He wanted to feel her beside him, strong and hotly female.</p><p>She shook her head. “This isn’t working, Nate.”</p><p>The quick change in subject rattled him. He put down the food, belatedly aware of the bags under her eyes, the lack of light in her face. “We’ll get past it.”</p><p>“Not living so close.” She shook her head. “One of us has to leave.”</p><p>He’d thought about setting her free to roam, but now that it had come down to it, he found he couldn’t let her go. “Don’t make any impulsive decisions. It’ll die down.”</p><p>“No, it won’t. Don’t lie to me,” she snapped, folding her arms. “We’re experiencing the final stages of the mating dance and it’s going to keep getting worse, especially if our beasts continuously sense each other’s presence. I was thinking I should go to—”</p> <p>“Just wait.” He fisted his hands to keep from touching her. “I’ll talk to some of the other mated pairs. Maybe there’s something we can do to lessen the impact.”</p><p>“I thought you wanted me to go out into the world?” Her voice was soft, her skin flushed with need. “Isn’t that why you keep pushing me away?”</p><p>“Stay.” That single word held his heart.</p><p>Nine</p><p>STAY, HE’D SAID, BUT TAMSYN KNEW HE DIDN’T MEAN IT the way she needed him to mean it. The mating instinct urged him to protect her and so he wanted her in sight. It didn’t make him happy just to see her. Not like it made her heart bloom simply being in the same room as him.</p><p>If the mating urge died tomorrow, there would still be no other man for her. He was her one and only. But she wasn’t his. Her throat feeling as if she’d gotten a rock stuck in it, she left the parking garage in the city and crossed the street.</p><p>She’d promised the kids she’d get more lights for the tree, but now that she was here, she decided to pop into the bookstore, too. Nate liked reading. She knew exactly what to get him for Christmas. That thought made her want to cry again. Her nose grew stuffy with withheld tears as she strolled through the small and expensive hard-copy section. Most people bought the downloads, but she wanted to give Nate something he could hold, something that made him think of her.</p><p>Her choice was sold out, so she went to one of the consoles and ordered in another copy. That done, she picked up her other purchases and began to make her way to the exit.</p><p>That was when she saw her.</p><p>The Psy woman—a stranger with eyes of darkest brown and skin the same rich shade—was occupying a booth near the door. Dressed in a black pantsuit teamed with a white shirt, she appeared a serious business professional. But then again, all Psy seemed to wear variations on the same theme. Tamsyn had never seen one of the psychic race in any color, excepting white, that didn’t fall in the range from deep gray to brown/black.</p><p>On any other day, she would have kept walking. But today, she didn’t, her motive a mystery even to herself. “Excuse me,” she said, coming to a standstill near the woman.</p><p>The Psy looked up. “Did you want the terminal? I’ll be finished in approximately one minute.” She glanced over Tamsyn’s shoulder. “There are several others that appear free.”</p><p>“No, I don’t want the terminal.” Tamsyn looked at her, at her human-seeming eyes, her clear skin and shining fall of jet-black hair. There was nothing that marked this woman as different, as Psy, part of a race that had eliminated its emotions. “I wanted to ask you a question.”</p><p>The stranger considered her request for a second. “Why are you asking me?”</p><p>“I need to ask a Psy and you’re the only one here.”</p><p>“I can’t fault your logic.” She tapped her finger on the screen to complete her purchase, then turned to give Tamsyn her full attention. “Your question?”</p><p>“Do you ever cry?” It seemed imperative that she know the answer.</p><p>The Psy didn’t react to the oddness of the question—if she had, she wouldn’t be Psy. “Even those of my race have little to no control over certain physiological reactions. If, for example, a foreign object were to accidentally enter or touch my eye, that eye would certainly produce fluid in an attempt to excrete the intruding matter.”</p><p>Tamsyn frowned at the clinical description of such a wrenching, heartbreaking act. “No. I don’t mean that. I mean, do you cry ?”</p><p>The stranger looked at her for several long moments. “As you chose to approach a Psy, you must know the answer to that question. However, I’ll respond as I see no possible negative repercussions from doing so.” She picked up a slim electronic pad from the desk near the terminal. “No. We do not cry out of fear or sadness, anger, or rage. We do not feel, therefore, we do not shed tears.”</p><p>“Don’t you miss it?” Tamsyn asked.</p><p>The Psy ran her gaze over Tamsyn’s face. “Judging from the redness of the blood vessels in your eyes and your stuffy nose, I believe I can say with certainty that crying is in no way a positive experience. Why would I miss it?”</p><p>“No. I meant...don’t you miss feeling?” Love and hope, joy and need.</p><p>“I can’t miss what I’ve never experienced,” the other woman said, as if that should have been self-evident. “My race chose to eradicate emotion for a reason. Those with emotions are weak. We’re not. It’s why the Psy rule this planet.” With that, she gave a curt nod and left.</p><p>Tamsyn stared after her, the words circling around and around in her head. Those with emotions are weak. She saw the reflection of her drawn, listless face in the terminal and found herself agreeing. For a frozen heartbeat, she wished she were like that Psy woman. Cool, controlled, focused. No attachments, no hopes, no dreams.</p><p>And no Nathan.</p><p>Her eyes, which had started to close, snapped open. “No,” she whispered fiercely. She would not, could not, live in a world where Nathan didn’t exist. He might make her cry as much as he made her laugh, but she couldn’t imagine waking up one day and having emptiness where he was.</p><p>She didn’t know much about how and why the Psy race had stopped feeling, but it had to have been a terrible thing that had driven them down this path. Her healer’s soul ached for them—for the love they would never touch, but she knew she couldn’t help them. Not when they barricaded themselves in their high-rises, their minds shut to the possibility of hope.</p><p>It’s why the Psy rule this planet. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tamsyn shook her head. The stranger was wrong. The Psy might rule, but their world was limited to towers of steel and glass. They knew nothing of the joy of running under a full moon and listening to the music played by the wind, of feeling the sensation of a packmate’s fur against human skin, of the sheer life that existed in the forests that were her world.</p><p>But the woman had been right about one thing—how could you miss something you had never experienced? Nathan had never been hers. Their beasts might cry out for each other, but if the human half of Nathan chose to repudiate that bond, who was she to stop him?</p><p>SHE LEFT THE NEXT DAY. THERE WAS NO OTHER WAY. IF SHE remained within reach, Nathan’s beast would eventually push him over the edge. And she couldn’t bear to lie with him knowing their intimacy was nothing more than the result of a physical compulsion. It would be a glimpse into her own personal vision of hell.</p><p>Her friend, Finn, was more than happy to fly in on short notice.</p> <p>“The healer in our pack’s not even forty, so I’m not going to get to do anything serious for a while,” he told her when she met him at the airport and escorted him into their territory. DarkRiver wasn’t known for its friendliness toward unknown males. They couldn’t afford to be, not after the attack by the ShadowWalkers.</p><p>“I know,” she said. “That’s why I asked you rather than Maria.”</p><p>He gave her a smile but his eyes were watchful. “I appreciate it.”</p><p>She ignored the unasked question. “I’m going to introduce you to the alpha. He knows you’re coming, of course, but the hierarchy has to be maintained.” The laws of rank and hierarchy were there for a reason—they balanced the predatory nature of their animal halves with order.</p><p>Finn nodded. “I’ll feel better once he adopts me into DarkRiver. It wouldn’t do for one of your pack to slice me up because they figured me for an intruder.”</p> <p>Since she thought the same, she made sure to take him to Lachlan first thing. Even with that delay, she was ready to be on her way out of DarkRiver territory by late afternoon. “Take care of my people, Finn.”</p><p>The twenty-one-year-old healer didn’t bother to conceal his worry this time. “What about you, Tam? Who’s looking after you?”</p><p>“I’ll be fine.” She tightened her hands around the straps of her bag. “It might be permanent, you know that, right?”</p><p>“Yes.” He stroked his hand over her hair, offering comfort in the changeling way. “But it shouldn’t be. You were born to be DarkRiver’s healer.”</p><p>“I can work with another leopard pack.” But Nathan couldn’t be replaced. Not when it was clear that Lachlan was preparing Lucas to step into his role as alpha sooner rather than later. When the time came, Lucas would need to rely on Nate’s experience and rock-solid advice. “Try it here,” she made herself say. “If everything works out...”</p><p>“No rush.” Finn’s tone was gentle. “I’ll hold your place until you come to your senses. Then I’ll happily return to the civilized world of our territory instead of this jungle.”</p> <p>She smiled at his joking, but as she walked away, she had the sick feeling she might never return. When she neared the fir she’d strung with Christmas decorations and lights, her eyes stung. “I’m sorry, Shayla,” she whispered to the ghost that reproached her for leaving her pack when it still needed her.</p><p>They would be okay, she told herself. She’d started them on the road to healing. All they had to do was follow it. Tempting as it was to pass by quickly, she made herself look up. There was the ornament Vaughn had painted, right next to the one by Cian. Around them wove the string of lights Nate had hung after he’d growled at her for putting her fool neck in danger. And there was the star she’d almost thrown at him, she’d been so mad.</p><p>“Oh God.” Blinking, she looked away...and kept walking.</p><p>Ten</p><p>NATE RETURNED HOME CLOSE TO DAWN, COMING FROM A night raid to “suggest” Solias King look elsewhere for his development. The damn, encroaching Psy would follow their advice, of that Nate was certain. Even in leopard form, he wanted to grin.</p><p>He’d stood watch for hours as Cian and a couple of others with tech training had methodically taken apart every piece of Psy equipment already onsite. While that might have been enough, Nate had gone a step further and buried several of the most expensive pieces in a section of DarkRiver land that bordered SnowDancer territory. No Psy would dare venture that close to wolf land. The feral pack had a reputation for ripping out intruders’ throats and using the bleached-out bones as fence posts.</p><p>Just in case Solias King missed their point even after all that, they had also removed the semi permanent survey markers and disabled the rudimentary comm tower erected a few days ago. It was why DarkRiver had allowed the thing to go up in the first place—so they could destroy it, and in a fashion that made it clear they would brook no further trespass on their lands.</p><p>Nate was particularly proud of the crowning touch. Inspired by Tammy, he’d taken along a large Christmas ornament—an old-fashioned picture of the man in red and white—and hung it from the now useless comm tower. Then he’d wrapped a string of blinking multicolored lights around the metal skeleton.</p> <p>He couldn’t wait to tell Tammy—she’d bust a gut over it. Taking on the Psy wasn’t usually a laughing matter, as the cold psychic race didn’t hesitate to kill. But from everything they had been able to unearth, it appeared that Solias King’s darker impulses were currently being curbed by his political aspirations. He couldn’t afford to come down hard on the changelings. Any violence and his own Council would turn against him.</p><p>Nate had no illusions that the Psy Council cared about changelings, but they damn well did care about their bottom line. And that would suffer massive depreciation if people thought the Psy were declaring a racial war. The Council would never allow such a panic to start over a small piece of land in the territory of what they considered a minor pack. Nate had a feeling DarkRiver wasn’t going to stay minor long, but until then, they could and would use the Council’s sense of arrogance to their advantage.</p><p>Shifting the second he cleared the doorway to his home, he pulled on a pair of jeans and an old cable-knit sweater. He had to see Tamsyn, no matter the ridiculously early hour. The royal blue sweater had been a gift from her. Maybe it would thaw her mood—she’d been more than a little distant when he’d dropped by this morning.</p><p>But his hopeful frame of mind disappeared the instant he got near her house—the area was blanketed in the scent of an unfamiliar male.</p><p>Unbidden, scenes of the carnage that had taken their last healer from them filled his mind. “Tammy!” He pounded on the door. “Tammy!”</p><p>The door swung open to reveal a young male. “Hel—” His voice cut off as Nate gripped him around the neck and lifted him off the floor.</p><p>“What have you done to her?” He tried to ignore the fact that the male was dressed only in a pair of pajama bottoms, his hair mussed.</p><p>I’m sick of stroking myself to sleep.</p><p>No, she wouldn’t do that to him. The agony he felt at the thought of Tammy, his Tammy, with anyone, much less this runt, was enough to call the beast to the surface. His eyes shifted to cat. He couldn’t hear anything through the pounding roar of blood in his head, was dangerously close to killing.</p><p>The single reason he didn’t do so was that his leopard suddenly started scrambling to find Tammy. He threw aside the other man and strode into the house, preparing himself for what he would find. If she was in bed—Something tore inside him.</p><p>He wouldn’t hurt her. He could never hurt her.</p><p>But that boy was going to die a slow, cruel death.</p><p>He shoved open the bedroom door...and found the bed made, with no signs of recent occupation.</p><p>“I slept on the couch,” a raspy voice said from the doorway.</p><p>He turned to find the stranger supporting himself against a wall, one hand rubbing at his throat. “Didn’t seem right to sleep in Tam’s bed.”</p><p>Tam? The leopard growled, harsh and vocal. “Who are you and what are you doing in my mate’s house?”</p><p>The other man’s eyes widened. “Mate? She never—” He slapped up his hands, palms out, when Nate started advancing. “I’m a healer. Name’s Finn.”</p><p>That stopped Nate midstep. Healers, even enemy healers, had automatic protection. Only blood-hungry packs like the ShadowWalkers broke that rule. “We already have a healer.” Claws raked his gut, twisted through his body like hard fire.</p><p>“She asked me to fly in and take over for a while.” Finn coughed a few times. “Said it might be permanent. Our pack’s got a senior healer and another apprentice, so they were happy to let me go.”</p><p>“I said we already have a healer.” Nate glared.</p><p>Finn didn’t back down. “Not anymore you don’t. She left.”</p><p>The beast wanted to lash out, to tear and scar. “Where did she go?”</p><p>The healer held up his hands a second time and Nate wondered what the other man had seen in his eyes. “I swear I don’t know. I figured she’d talked it over with your alpha—maybe a sabbatical or some extra training. She introduced me to him.”</p><p>Nate left on a mission to find Lachlan, but it was Lucas he ran into first. He would have pushed past except that Lucas stepped into his path and said, “Looking for Tammy?”</p><p>Nate stilled. “You knew she left?” At that moment, the first rays of the rising sun hit the tree line, throwing light across Lucas’s savage facial markings.</p><p>“Didn’t you?”</p><p>“Damn it, Luc. Answer the damn question.”</p><p>“Sure.” The juvenile folded his arms. “I heard her ask Nita to drive her out of the territory.”</p><p>The urge to grab Lucas and shake Tammy’s location out of him was so strong, Nate looked away and took a deep breath before saying, “And neither of you tried to stop her from leaving?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why would we?” Lucas’s tone was hard. “You made her cry, Nathan. You made your mate cry and then you didn’t hold her.”</p><p>The blow hit him with bruising force. “Where is she, Lucas?”</p><p>“I don’t know—you could ask Nita, but I don’t think she’s around.” He glanced at the sun-touched trees. “I have to get to the Circle for training.”</p> <p>Nate didn’t try to stop him from leaving, and was still standing there when Cian appeared out of the shadows. “Nate? You after Lachlan? I just left him—he’s free for the next half hour or so.”</p><p>“I’m trying to find Tammy.”</p><p>Cian’s face showed instant comprehension and not a little anger. “What the hell are you doing to that girl, Nate?”</p><p>“What’s right for her.” Cian didn’t understand what it was to watch a woman fall out of love with her man, turn bitter and self-destructive...and finally, suicidal. He’d held his mother’s dead body. He refused to hold Tamsyn’s. “She’s too young.”</p><p>“She was too young when Shayla died. But did you hear her complain?” The sentinel’s voice was a whip. “Seventeen years old and she took on a position most people don’t touch until they’ve reached their third decade.”</p> <p>“Exactly!” He blew out a frustrated breath. “All that responsibility and then a mate, too? I’d demand things she has no conception of—”</p><p>Cian swore, low and pithy. “Isn’t that your job as her mate? To demand but to let her demand as much in turn? You’re supposed to fucking share the burden, not add to it like you’ve been doing with your self-pitying bullshit.”</p><p>“You might be my senior,” Nate said, the leopard in his voice, “but you are not my father.” His father was long dead, having literally driven himself to an early grave after his wife’s death—he’d wrapped his car around a tree. “You want to take me on, go ahead.”</p><p>“Screw that.” Cian shrugged. “If I damaged you, Tammy would have my head.”</p><p>With that simple comment, the other man defused every bit of Nate’s anger. “Tell me where she is. I have to make sure she’s safe.” The leopard’s desperation grew by the minute.</p><p>“I don’t know.” Cian shoved up his sleeves. “To be honest, I don’t think you deserve to know, either. And don’t bother asking Nita—she has no idea where Tammy went after getting out of the car.”</p> <p>“What, none of you bothered to ask her?” He couldn’t believe that, not with how protective they had become after what had happened to Shayla. As this inquisition clearly proved. “You let her go off on her own without a word of protest?”</p><p>Cian’s eyes turned opaque. “She’s an adult leopard. No one has the right to question her decisions.”</p><p>And she’d made one to leave him. Nate leaned against a tree and stared up at the dawn sky. It promised to turn a pure, mocking blue. “Where did Nita drop her?” She wouldn’t be hard to track—she was carrying his heart with her.</p><p>Cian snorted. “Sorry, you’re on your own. You made the mess, you can damn well clean it up. But since you look like you’ve been gut-punched, I will tell you something she said to Lachlan when she made the request to leave and bring Finn in as cover.”</p><p>Nate straightened. “What?”</p><p>“She said you were more important to the pack. Since one of you had to go, she decided it had better be her.” The older male shook his head. “My Keelie is the most precious part of my life. How could you let your mate think she was less than you, Nate?”</p><p>Nate still hadn’t found an answer to that question seven hours later when he finally located the first hint of a trail. He was certain that this was where she’d left Nita’s car. He looked up and found himself close to Tahoe. Tamsyn had vanished somewhere in the lake city’s streets. Nathan had every intention of hunting her down.</p><p>UNFORTUNATELY, WHEN HE RETURNED TO THE DEN TO PICK up his gear, he found another surprise waiting for him, this time in his living room.</p> <p>“Where’s my daughter, Nathan?” was Sadie’s first question.</p><p>He began to grab what he needed. “I’ll find her.”</p><p>“I don’t know if I want you to find her.” Tamsyn’s mother scowled. “You didn’t do a great job of keeping her this time around.”</p><p>“I’ll bring her home.”</p><p>“Why? So you can make her miserable?” She moved to block the doorway, fierce in her maternal protectiveness. “Let her roam. That’s what you’ve been telling her to do. Well, looks like she listened. Don’t you dare go after her.”</p><p>The blunt words brought him to a halt. “I can’t do that.”</p><p>“Why not? It’s exactly what you wanted.”</p><p>“She’s mine to protect.”</p><p>“You gave up that right when you decided you didn’t want to be her mate.” Sadie shook her head. “You’ve done enough. Let my baby go.”</p><p>He stared at her, a sick feeling in his gut. “I never said I didn’t want to be her mate. Where the hell did you get that idea?” And did Tammy think the same?</p><p>Eleven</p><p>“FROM YOU, NATHAN.” SADIE GAVE HIM AN ARCH LOOK AS she shook the foundations of his world. “Tammy was practically screaming for your love and you wouldn’t so much as hold her. She got the message—she can’t break the bond, but she might be able to mute it with distance.”</p><p>“What damn message?” Impatience, anger, and a painful hunger for the scent of his mate combined to roughen his tone. “The only thing I wanted to give her was a taste of freedom before—”</p><p>“I’ve heard it all before.” She lifted a hand. “If you really mean it, then you’ll put down that pack and go sit down. After all, she’s free now, isn’t she?”</p><p>“That’s not what I meant,” he said between gritted teeth. “I wanted her—”</p><p>“You wanted her on your leash—close enough to watch over so you could satisfy your beast.” Sadie’s eyes went pure leopard. “It didn’t matter to you that her need was turning into a kind of slow torture. You are not doing that to my baby again! You let her go. Let her find someone who’ll love her for what she is.”</p><p>Violent rage turned to lethal calm. “What the hell are you talking about? She’s my mate . That is not negotiable.”</p><p>“Not if you won’t let it be. If you set her free, maybe she’ll fall for someone who’ll adore her like she’s meant to be adored.”</p><p>“I adore her!” he yelled in disbelief. “No one else has that right!”</p><p>“Do you?” Sadie’s features settled into a resolute expression. “Then show her, for goodness’ sake. Otherwise, free her in reality instead of just giving lip service to the idea.” She vacated the doorway.</p><p>Nate walked out without replying, but her words wouldn’t leave his mind, no matter how far he went. Tammy thought he didn’t want to be her mate? How could such an idiotic idea have ever entered her head? The second he saw her, he was going to growl the truth to her until she damn well listened.</p><p>Well...maybe he’d hold her first. He’d made her cry and he hadn’t held her. Lucas was right. That was unforgivable. But Tammy was his mate. She had to forgive him. And she had to come home. He couldn’t exist without her close to him. Those months she had spent in New York had almost killed him, but at least then he’d been able to tell himself that she was still a girl, not a woman.</p><p>But now that he’d felt the lush heat of her, he could no longer kid himself. Tammy had grown up. And she’d left him. “We’ll see about that.” The leopard snarled, mad as hell.</p><p>Not much later, he reached the point where he’d first picked up her trail—close to Tahoe. From there, he could try to track her by scent or...or he could do the one thing certain to lead him to her. No choice at all, really.</p><p>Taking a deep breath, he released the stranglehold of control he’d held over the mating bond since the day she’d turned fifteen and he’d realized what she was to him. It felt like the whiplash unfurling of a coiled spring—a burst of pure power that actually hurt as it boomeranged off his chest, driving him to his knees.</p><p>When his head finally stopped spinning, he felt for the bond and found it stretched out taut and clear, a vibrating cord of need, desire, and belonging. He could feel Tammy deep within his core, as if he had a homing beacon tuned only to her signal. It was perfection. And he wasn’t sure he could ever block it again. But he’d think about that later.</p><p>Right now, he had to survive the intensity of the emotions shooting down the bond. It felt like he could reach out and touch her. She was sweetness and hope, woman and fire, erotic heat and gentle affection. And she was his. Not fucking negotiable.</p><p>IT FELT LIKE GETTING BROADSIDED WITH A BASEBALL BAT.</p><p>Tamsyn staggered under the point-blank surge of pure emotion, sliding down the wall to sit with her back braced against it.</p><p>Nate had opened the bond.</p><p>She rubbed a hand over her chest, then realized the usual persistent ache, the hard knot of dull hurt was simply...gone. In its place was the blazing glory of a fully functioning mating bond. She trembled. Why had he taken that step now—after she’d done what he wanted and put distance between them? Surely he wasn’t trying to track her?</p><p>No, she thought, she wasn’t going to believe in fairy tales anymore. Nate had probably done it by accident. Okay, no. That was stupid. No one who’d been as determined as Nate to block their mating would lose that much control by accident. Her eye fell on the small silver phone sitting on the table by the sofa.</p><p>Her mother had called soon after Tamsyn arrived at the cabin. Sadie had been distraught to return from her run in the wild and find her daughter gone. Tamsyn had assured her over and over that she was fine, but knowing Sadie, she’d probably ordered Nate to locate her daughter and provide a firsthand report. Tamsyn shuddered, trying to breathe past the impact of the fully flowing bond. She had to think, had to stabilize herself before Nathan arrived, so he’d go back and tell Sadie there was no reason to worry. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That done, he would think the bond shut again.</p><p>Her blood flushed hot as the vibrant male energy of him raced through her veins. Mates were joined on an incredibly deep level. To other changelings, the scent of one half of a mated pair became difficult to distinguish from the other the longer they were together. Nate’s refusal to accept the bond had denied them that closeness, starving her. Now, her senses wanted to gorge.</p><p>“No,” she said out loud, forcing calm on herself. All healers had to learn such discipline. It allowed them to work in the chaos of a fight or when attempting to heal those they loved—a pack healer didn’t have the luxury of passing on the hard cases to another medic. Every one of their cases was hard, because Pack was family.</p> <p>Finally, after ten long minutes, she could think despite the masculine strength of the emotional connection surging through her. Then, for the first time, she tried to close her end of the exquisite pleasure/pain that was her link to this man she adored beyond life...and discovered she couldn’t. She fisted her hands. Forget the known wisdom that said the bond couldn’t be blocked—if Nate could do it, why couldn’t she?</p><p>It took her an hour to come up with some sort of answer. She remembered what her mother had said—that Nate had had to learn to suppress his needs in order to allow her the time she needed to come of age. That control seemed to have carried over into everything he did in relation to her. But now he’d thrown off the reins and let the cat out to play.</p><p>It might be impossible to put the lid back on that bottle.</p><p>Her eyes widened. Nate was not going to be pleased if that proved true. More importantly, she wasn’t pleased. She didn’t want him to want her because he’d been forced into it by the primal cravings of his beast—cravings her own beast understood far too well. She wanted him to love her.</p><p>It was a terribly impractical dream for a practical, sensible healer.</p> <p>EVEN WITH THE BOND, IT TOOK NATE THREE DAYS TO TRACK Tamsyn to an isolated cottage so far south of the lake, there was nothing else within shouting distance. “What the hell are you doing out in the middle of nowhere?” he said, the second she opened the door.</p><p>Her eyes narrowed. “Trying to get away from you.” Turning her back, she walked into the house, her hips encased in those damn painted-on jeans.</p><p>He was tired, sweaty, and hungry. Not for food. For her. Every soft, curvy, bitable piece of her. His cat wanted to test the resilience of her butt, while his—He slammed the door shut behind himself. “Jesus, Tammy. DarkRiver’s operating at red alert while we prepare to take on the ShadowWalkers and you choose this shack to hide in?”</p><p>“It’s not a shack and I’m not hiding,” she said, sitting back down to what appeared to be her breakfast. “It’s Cian’s place. He likes the water.”</p><p>Cian had lied to him. Not exactly a surprise. “It’s miles from the lake!”</p><p>“It’s not that far. He likes privacy, too.”</p> <p>Nate dropped his stuff by the door and shoved a hand through his hair. “What, this was some silly little jaunt and no one bothered to tell me?” He saw red.</p><p>Then she raised an eyebrow and that red morphed into something darker, more intense, a blatantly sexual surge of dominance. “I’m leaving DarkRiver. Finn’s agreed to stay on permanently. His agreement was what I was waiting for.”</p><p>He didn’t believe her. “You’re leaving the pack.”</p><p>“Yes.” She put down her uneaten toast and stood. “There, you’ve seen me. I’m fine.” Her smile was sharp enough to cut, her eyes sparking with anger that intrigued the leopard even more than the spicy/wild/hot woman scent of her. “You can leave the same way you came in.” She began to clear the table.</p><p>“Put those dishes down .”</p><p>She ignored him.</p><p>Covering the distance between them, he closed his hand over her wrist. She released the dishes softly to the table but didn’t turn to face him. “What do you want, Nate?”</p><p>“I want you to talk to me.” He found himself pressing against her. It took only a single move to enclose her in the circle of his arms and bury his face against her neck. He was ravenous for the scent of her, the feel of her. “Come on, baby.”</p> <p>Her body trembled so violently he felt her skin move against his caressing lips. “I can’t do this anymore.” Her voice was a whisper. “Please let me go.”</p><p>Twelve</p><p>A GROWL ROLLED UP FROM HIS THROAT. “FOR HOW LONG?”</p><p>“Why are you asking me that?”</p><p>He didn’t like the tremor in her voice. “Don’t you dare cry, Tammy. That’s not fair.”</p><p>“I won’t.” But there was a wet kind of pain her words. “I know you don’t really want me. I know it’s the cat pushing for mating. That’s okay. If I go far enough away, maybe you—”</p><p>“What?” He couldn’t believe his ears. “You really believe that load of shit?”</p><p>“You made it very clear.”</p><p>Everything went quiet inside him. Lifting his head, he turned her in his arms. Her head stayed down—she wouldn’t look at him. Keeping one arm around her, not sure she wasn’t getting ready to bolt, he used the fingers of his other hand to tip up her chin. Her eyes were shiny-wet, but she met his gaze without flinching.</p><p>God, she was so proud. Proud and strong and stubborn. And she’d decided he didn’t want her. He intended to teach her the error of her ways once and for all. Holding her gaze, he slid his hand down her neck, over her shoulder, and along her arm until he cupped the back of her hand with his. Then he lifted that feminine hand and placed it on his erection. She jerked in shock. The reflexive tightening of her fingers almost made him cry out.</p><p>“Does this feel like I don’t want you?” he grit out.</p><p>“It’s—” She paused, her breath hitching. “It’s a result of the mating dance. You don’t want me, not really.” She pulled away her hand, curling it up to her chest as if it hurt.</p><p>Oh Jesus. She was not doing this to him. “Or is it that you don’t want me ?” he asked softly. “Is that it, Tamsyn? Am I too old for you?”</p><p>Her head snapped up. “Don’t you put this on me!” The first hint of fire entered her tone. “I begged you, begged you, to make the bond real, to be my mate in truth. But you said no. You always say no! Well, you know what, I’m through with begging. I’m through with not being good enough for you!”</p><p>It felt like she’d stabbed him. “You are the best thing that’s ever happened to me,” he said, the leopard alive in his voice. “I’ve spent every day of the past four years thinking of myself as the luckiest man on the Earth—frustrated as hell, but damn lucky.”</p><p>She shook her head. “Don’t. Don’t lie.”</p><p>It was all he could do not to crush his lips to hers and kiss her into accepting his words. “I watch you work and feel such pride, sometimes I think my heart will explode. I look at your body and have to fight the urge to bare my teeth and warn off anyone else from doing the same. You want to know why I lost it when you wore those tight, sexy clothes?</p><p>“It was because others could see what was mine .” It was a possessive, animal reaction, one he usually tempered with human civility. But Tamsyn needed to see the real man, claws and all. “I don’t like to share.”</p><p>Finally a reaction. “You didn’t think I looked stupid?”</p><p>“I wanted to peel you out of those damn come-to-bed jeans”—something he was definitely going to do today—“and mount you right there in the Pack Circle.”</p><p>“Nate!”</p><p>“I wanted to show everyone that you were mine. I wanted to put my hands on your breasts and my lips on yours and my co—”</p><p>She squeaked, slapping a hand over his mouth. “Nate!” The scandalized expression on her face was very Tamsyn. His mate had come back to him.</p><p>He pulled away the restraint, using his other hand to manacle her free hand, too. “Where was I? I have wanted you so damn long, my balls are permanently blue. As—”</p><p>“I believe you!” A hint of desperation.</p><p>“I don’t want any mistakes about this.” And her time was up. The things he wanted to do to her were probably illegal in some countries. Too bad.</p><p>He backed her into a wall with slow deliberation, not stopping until her breasts were crushed warm and tempting against him, her stomach muscles clenching at the granite-hard thrust of his erection. “The sex—hell, yes, I want the sex. I want it so much I could devour you right this second, take little bites out of all those soft, delicate places.”</p><p>Her breasts rose and fell in a jagged rhythm as she watched him through her lashes.</p><p>“But baby, I fell in love with you long before the mating heat kicked in this bad. Do you know why I came to wish you happy birthday when you were fifteen?”</p><p>She shook her head, mute.</p><p>“Because I adored everything about you as much then as I do now,” he whispered, giving her words because she needed them, and because he’d made her cry. There was no excuse for that. “It wasn’t sexual—you were too young. It was just this tightness inside my chest. Every time you smiled, my world lit up. All I wanted to do was keep giving you reasons to smile. The day I realized you were my mate, the happiness almost killed me. So don’t you ever say I don’t love or want you. I chose you, Tamsyn Mahaire. I chose you.”</p><p>Tamsyn wanted to burst out crying. “Oh, Nate.” She buried her face against his chest and, when he let go of her hands, wrapped her arms around him as he wrapped his around hers. She had never heard him speak in that impassioned, romantic way, never imagined he would. And to her? To his practical, sensible mate?</p><p>“You are not leaving me,” he ordered, his voice predator deep. “If you want to go roaming, I’ll take you. But you are not leaving me.”</p><p>She wondered if he expected them to go back to the way things were. If so, he was about to get a surprise. Half of the mess that was their relationship had been her fault. She’d let him think he was the boss. Well, he wasn’t. They were a partnership. Breaking the embrace, she pushed off his jacket. He was so surprised, he let her. Then she began undoing his rough wool-blend shirt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tammy.” He grabbed at her wrist.</p><p>“Forget it, Nathan,” she snapped, tearing the shirt down the middle. Buttons went flying every which way. “I’m ready to lose my virginity and you’re going to help me do it. I don’t care if I have to kidnap you and tie you to the bed.”</p><p>He opened his mouth as if to speak, but then she flattened her palms on his wonderful, hard chest and he shuddered instead. The same head-spinning rush hit her, powered by the skin to skin contact. Skin privileges. She had the most intimate kind.</p> <p>“What about your freedom?” he whispered in her ear over a minute later, bracing his hands palms down on the wall beside her head. He made no move to stop her as she stroked and petted every inch of that sinfully gorgeous chest, all hard muscle and gleaming skin overlaid with silky-rough strands of dark hair.</p><p>“Idiot.” She nipped at his jaw with her teeth. “The only freedom I ever wanted was the right to love you.”</p><p>One of his hands stroked down to slip under her sweater. It was her turn to tremble.</p><p>“You’re a stubborn woman.”</p><p>“Yes.” The roughness of his skin felt delicious on her.</p> <p>“You’re set on making this real.”</p><p>“Try and stop me.”</p><p>He smiled and it was beautiful and strong and quintessentially male. “What, and give up the chance to finally see your pretty breasts? Not a chance.”</p><p>“Nathan!” And then his hand was squeezing her sensitive flesh and she was drowning in the rush of sensation.</p><p>“Why aren’t you wearing a bra?” he asked before kissing the wits half out of her.</p><p>By the time she could gasp in enough air to breathe, her sweater was in shreds on the floor. Nate had used his claws to slice it to bits. His hand returned to massage and mold flesh that had never known a man’s touch. She pushed into the caress. “Um...I forgot,” she whispered. “I was nervous about you—Oh!”</p> <p>He’d lifted her up so her legs wrapped around his waist. “You were right to be nervous.” He kissed her again, then ran his lips down her neck to nibble on the tender upper slopes of her breasts.</p><p>She held on to his shoulders, trying hard to find a sensible thought. “Nervous?”</p><p>“I hope you’ve been exercising.” His mouth closed over her nipple.</p><p>It might’ve been hours before she spoke again. “Exercising?” Single words seemed to be all her brain could manage.</p><p>He released her sensitive flesh...after gripping it lightly between his teeth for a heart-pounding instant. “Because you’re going to be indulging in a lot of creative physical activity over the next few days.”</p><p>Had he said days ?</p><p>Then she lost even that thought and simply felt. Nate didn’t ravage her as she’d half expected, given their combined hunger. He was excruciatingly tender and she knew how much that control had to be costing him.</p><p>“It’s okay,” she said several times.</p> <p>“It’s your first time. I’ll say when it’s okay.”</p><p>She might have taken that order badly if he hadn’t already brought her to orgasm twice by then. His tone may have been rough, but his hands were gentle and his mouth was pure magic. When he did finally decide she’d been pleasured enough, he took her with care that brought tears to her eyes.</p><p>The second time, she took him.</p><p>Thirteen</p><p>SOLIAS KING DID NOT LIKE TO LOSE. “HOW MUCH DAMAGE?” he asked.</p><p>Kinshasa repeated the number. “The missing parts will take weeks to reacquire.”</p><p>“I thought you said they were a minor pack?” He pinned his aide to the spot with his eyes. “Your risk analysis was faulty.”</p><p>“My variables were based on the known parameters of changeling intellect.”</p><p>Solias couldn’t fault Kinshasa. The general consensus among the Psy was that the animals weren’t that smart. “Find me another site.”</p><p>As Kinshasa left the suite, Solias wondered which one of his enemies had orchestrated the attack—covert Psy involvement had to be how the changelings had pulled this off. It was preposterous to think he’d been beaten by a pack of animals.</p><p>Arrogant in his belief of the Psy race’s genetic and intellectual superiority, he never once considered that he might be blind to the truth. The truth that things were changing...that the Psy no longer ruled every corner of the planet. And that this minor pack had shown the first signs of the lethal danger it would one day become.</p><p>Fourteen</p><p>A WEEK LATER, NATE WATCHED TAMSYN BANDAGE UP A JUVENILE’S arm and give the kid a stern warning about rock climbing without gear. She was firm and practical, her hands strong, her body tall. And she had breasts to make a man’s mouth water, sweet feminine curves his palms itched to shape.</p><p>Then she looked up and smiled and he felt it deep, deep in his core. He wanted to pick her up and kiss her silly, but since the juvenile’s eyes were already going wide, he decided to make himself scarce. “I’ll see you tonight. I have to make that run into San Francisco.”</p><p>Another smile. “Don’t forget to pick up the things I asked for.”</p><p>He nodded and left, recalling the list he’d shoved into his pocket. Tammy wanted a few healing supplies, a number of grocery items, and some paint to complete the Christmas decorations. He had the list in hand when he reached the city. It was easy to fill, as she’d included instructions about where to go and had called her suppliers ahead of time to let them know he was coming by.</p><p>“For Tammy?” a wizened old man asked as soon as Nate stepped into his tiny store in one of the older parts of Chinatown.</p><p>“Yes.” His beast picked up a thousand intermingled traces—herbs and spices, medicines and incense, but the mix was strangely soothing. “I’m her mate, Nathan.”</p><p>The man’s smile was fond as he bent under the counter and lifted up a box. “She’s a good soul, Tammy. You will protect her, love her. That is your destiny.”</p><p>Nate looked at the shopkeeper, startled. “Do you see the future?”</p><p>“No.” The man laughed. “I’m not Psy. Only human.”</p><p>Only human, and yet there was such ageless wisdom in those dark button eyes. Nate wondered if the Psy, for all their gifts, would ever be able to achieve that look of utter peace. “You’re right. About the loving and the protecting.”</p><p>Wrinkled hands picked up a leather-bound book and consulted something written in a strange, unknown language. “The stars say you’ll have a long and happy life.”</p><p>“I’ll take that.” Nate grinned.</p><p>A hint of mischief entered the old man’s eyes. “The women, they don’t know what they do to us. It is our secret.”</p><p>Laughing, Nate exited the shop with Tammy’s things and began to walk back to the vehicle. He was putting the box into the trunk when he realized he’d parked in front of a florist’s, though he didn’t recall seeing it the first time around. Shrugging, he closed the trunk and wandered over to the shop, Tammy on his mind.</p><p>There was no stock displayed outside, probably because of the cold, so he pushed open the door. Hothouse air greeted him. The interior was a jungle of flowers, the air thick with their competing perfumes. “Some shop,” he muttered, trying to separate out the mingled scents.</p><p>“I do try,” said a gentle voice.</p><p>He turned to find a tiny Chinese woman beside him, her smile beatific. There was a twinkle in her eye that reminded him of someone. “I don’t suppose you know the healer down the road.”</p><p>“My husband.”</p><p>Somehow, that seemed right. “Oh.” He shifted his feet, slightly uncomfortable in a place that was so intrinsically female. “I want to buy flowers for my mate.”</p><p>The woman slid her small hands into the front pockets of her apron. “Does she like roses? I just received a new batch.”</p><p>“She’s a healer, too,” he found himself saying, never having thought to ask Tammy if she liked roses.</p><p>“Ah, a sensible woman.” The florist waved him to follow as she weaved through the wild tangle of her shop. “Here.” She pointed to a sturdy green potted plant with a few white flowers. “This will last for years with a little water. Doesn’t need much care or attention. Practical. It will suit your healer.”</p><p>Nathan scowled. “No.”</p><p>She shrugged and moved to another area of the shop, to point at a bunch of daisies. “Sunny, easy to enjoy, but there will be no sadness when they fade.”</p><p>“No.” All of him—man and leopard—was getting angry and he couldn’t understand why. “That’s not what I want.”</p><p>Unperturbed, the florist took him around another corner in this shop that was far larger than it appeared from the outside. “Ah, I think this must be what you are searching for.” She touched the edges of a rough bouquet. “These flowers will survive no matter what. Very cheap,” she said with a shopkeeper’s smile. “Common, you know.”</p><p>“No.” The leopard’s claws pricked the insides of his skin, a growl building in his throat. “Show me something beautiful, something extraordinary.”</p><p>“Well...” The woman seemed to think for a while before nodding. She took him to the back of the shop, to a small glass case tucked away under special lights. “I have these. They aren’t very strong and, as you can see, require much care. But if you love them right, they will reward you with great beauty. They’re precious and rare, not easy to find or replace.”</p><p>“Yes,” man and beast said together, fascinated by the delicacy of the blooms he could see beyond the glass. “Give them to me.”</p><p>“For a healer?” The florist raised a skeptical eyebrow.</p><p>“She’s not a healer to me. She’s my lover, my mate.” Unlike these hothouse flowers, she was strong. But just like these rare blooms, she was both irreplaceable and beautiful enough to break his heart. “She’s mine to cherish.”</p><p>This time, the florist’s smile was pure brightness. “It is as it should be.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>TAMSYN HAD COOKED THE MEAL, SET THE TABLE, AND shimmied into a pretty knee-length dress. She bit her lip and looked in the mirror. The dress was an autumn red-orange that brought out the copper strands in her unbound hair. Shaping her body to the waist, it then flared out in a playful swirl. She’d paired it with heels and a fine gold bracelet.</p><p>“I look okay,” she told herself, knowing Nate probably wouldn’t even notice. It wasn’t as if the dress changed who she was. But it made her feel good.</p><p>Taking a deep breath, she went into the front room, ready to fluff the cushions for the tenth time. She delighted in living with Nate and wanted to make a good home for him, but had to admit she might be going a bit overboard. The man loved her. He couldn’t care less if the pillows were skewed or dinner was late.</p> <p>She smelled Nathan’s wild masculine scent before he knocked. Her heart tripped a beat. Thinking he must have his hands full, she pulled the door open. “Nathan, what—” Her eyes dropped to the flowers in his arms. They were a sumptuous cream color, with gold streaks that shimmered with an almost otherworldly iridescence.</p><p>“I thought you’d like these,” he said, the cat in his voice.</p><p>She touched a hesitant finger to one perfect petal. “For me?”</p><p>“Of course they’re for you.” It was more growl than anything close to human. “Do you think I go around giving other women flowers?”</p><p>Shaking her head, she looked up into the velvet blue of his eyes. “You think I’m an orchid kind of girl?”</p> <p>“Hell yes.” He put them into her arms and wiped away the tear she hadn’t been aware of shedding. “Stop that.”</p><p>She sniffed, staring at those precious flowers. Orchids. Nathan had given her orchids. Rare and precious and beautiful...the kind of flowers a man gave to a girl who was all those things. “Thank you.”</p><p>“You can thank me later,” he murmured against her ear. “When I peel this sexy dress off you.” He was behind her now, his hands caressing her hips as he pulled her back against his body. “Or maybe I’ll leave the dress on and only take off the underwear.”</p><p>“You’re making me blush.” It was a playful rejoinder—she loved his earthy sensuality.</p><p>“A dress gives a man ideas.” He nibbled at her earlobe.</p><p>Her smile turned into a full-fledged grin as her heart filled with so much love she thought it would burst. “What if I took off everything but the heels?”</p> <p>He groaned. “Put the damn orchids in water.”</p><p>“They need tender care,” she murmured, touching another petal.</p><p>“Yes.” He kissed the curve of her neck. “But I want to take care of you. Let me.”</p><p>She blinked. No one had ever offered to take care of her. She was the pack healer—she took care of everyone else. But Nate thought she was an orchid kind of girl. She had the wondrous realization that, to him, that was what she’d always been. He saw the woman behind the healer. Another tear streaked down her cheek. “Always.”</p><p>His arms came around her tight.</p><p>BY THE TIME CHRISTMAS ROLLED AROUND, SOLIAS KING was a dim memory. The Psy had removed all his equipment from their land, leaving behind only the ornament and Christmas lights. Tamsyn had been more than happy to use them on her tree, though the chosen fir had no lack of decorations—every one of her packmates had added a piece or ten, so that by Christmas Day, that tree was truly the pack’s Christmas tree.</p><p>Tamsyn thought Shayla would have been pleased. So many in DarkRiver remained damaged by what had happened, but at least this silly extravagant tree had brought some joy back into their lives. They held the Christmas party under its snow-dusted branches and it was there that Lachlan formally acknowledged her and Nate’s mating.</p><p>“For me, our anniversary will always be the day you gave me orchids,” she said to Nathan as they danced under sparkling tinsel.</p> <p>He slid his hands down to her lower back. “I vote for the cabin in Tahoe.”</p><p>She laughed. “What are we going to tell our children when they ask about our mating if we pick Tahoe? Hmm?”</p><p>“That DarkRiver looks after its own.” Sadie’s, Cian’s, and even Nita’s interference had been born of the ties of Pack, and Nate accepted it. “And that their daddy was a stupid idiot, but one who came to his senses in time.” Nate wondered what their cubs would look like. Not that he was going to ask Tammy to have children anytime soon. She was only nineteen...and part of him still wasn’t sure she wouldn’t regret having mated so young. But on this magical Christmas night, he decided to believe in happy endings. “Want a replay?”</p><p>“Of the orchids?”</p><p>It was such an innocent question he almost missed the mischief in her eyes. “I’ll make you pay for that.” He stroked his hand over her bottom.</p><p>“Behave,” she whispered with a blush. “The others will see.”</p><p>“So?” He turned her until her back was to the tree. “I’m just playing with my mate.”</p><p>This time, she cuddled into him, her hands sliding up under his sweater. “I want the replay with cream on top.”</p><p>He grinned. “Why do you think I bought those cans of whipped cream?”</p><p>Eyes wide, she licked her lips. “Me first.”</p><p>Epilogue</p><p>Eighteen Years Later: Year 2079</p><p>“WHERE’S THE WHIPPED CREAM?” NATE KISSED HIS WAY down the naked line of his mate’s back.</p><p>She glanced over her shoulder, beautiful enough to steal his breath. “Have you forgotten we have guests?”</p><p>“They can entertain themselves,” he said, referring to the houseful of packmates who’d dropped by for a family dinner.</p><p>“They’ve already been doing that for an hour.” She moaned. “Oooh, again.”</p><p>He complied, kissing the dip at the base of her spine. “I suppose I have to go play host.”</p><p>“Poor baby,” she teased.</p><p>He bit the curve of her buttock. “Don’t get smart with me, Tamsyn Ryder. I know all your secrets.” And after eighteen years together, he knew she was his, body and soul. It had taken him almost two years to really believe that truth—but when she’d only gotten happier and happier as time passed, it had become impossible not to.</p><p>She nuzzled at his neck. “Stop seducing me. I need to go finish making dinner.”</p><p>Rising halfway, he found his gaze caught by a golden envelope on the bureau. “What’s that?”</p><p>“Card from Nita,” she said, referring to the former packmate who’d mated with an outside-Pack male not long after his and Tamsyn’s mating. “Her cubs are growing up so fast.”</p><p>“So are ours.” He stroked his hand over the curve where her waist flared into her hip. “God, I’ll have to teach them about women soon.”</p><p>She laughed. “And what do you know about women?”</p><p>His reply was a kiss that stole her breath.</p><p>THE HOUSE WAS STRANGELY QUIET WHEN THEY WENT DOWN. Tamsyn soon found out why. Lucas and Vaughn were outside playing ball. They’d roped in their own mates and a couple of other sentinels, as well as the kids and several older juveniles.</p><p>“See, I told you they’d take care of themselves.” Nate kissed the pulse in her neck as they stood on the back doorstep.</p><p>She smiled. “More like the women decided we needed privacy.” They had been in the kitchen with her when Nate had walked in with the orchids. He did that every year, and every year, she turned to putty in his arms. It was hard not to melt for a man who still saw her as an orchid kind of girl after all these years together.</p><p>Her mate’s teasing reply was lost in the gleeful cries of their cubs as they spotted their parents. Nate walked out and intercepted the pair, scooping them up and hanging them over his shoulders. In spite of Nate’s worries, Roman and Julian were still babies, not even three years old. “Mommy! Help!” they cried now, between giggles.</p><p>Nate threw her a grin and something went hot and tight in her stomach. God, she loved him. Walking over, she tilted her head to peer at her babies. That knot in her stomach grew tighter. “I think you look good in that position.”</p><p>“Mommy!”</p><p>Laughing, she freed a wriggling Roman. He peppered her face with kisses before asking to be put down so he could rejoin the game. Julian was playing with his daddy, but waited to give his mom a kiss before chasing off after his twin. “They’re so tiny,” she whispered, standing in the curve of Nate’s arm. “I can’t believe they’re ours.”</p><p>“My little pistons,” Nate said proudly, watching as Vaughn threw Roman a soft pass. Instead of running, Roman threw a sneaky pass to his twin, who shot off down the field. “See that—a few more years and they’ll be pummeling everyone else on the field. So, what about the Christmas tree?”</p><p>“I drove out there yesterday.” A living Christmas tree had become a tradition, a happy memory that had survived the turmoil of the bleak years after the ShadowWalkers’ attack. “Our tree is still going strong.”</p><p>“Just like the pack,” Nate said, echoing her thoughts.</p><p>She wrapped her arm around his waist. “Just like us.”</p><p>He glanced down, a tenderness in his gaze that would have surprised those who saw him only as the most experienced of DarkRiver’s dangerous sentinels. “As if I’d ever let you go.”</p><p>“Sweet talker.” She leaned up and kissed him, thinking that her mate was simply getting sexier with age. He now had the darkly sensual beauty of a leopard in the prime of his life, pure hard muscle and a finely honed sexuality that demanded everything she had. She found him irresistible. “I love you.”</p><p>He nibbled at her lower lip and there was smug male pride in his eyes as he said, “I know.”</p><p>She laughed. It had taken her years to get him to that point, where he believed she truly was happy with their life. Never once had she regretted mating at nineteen. She’d been one of the lucky ones—she’d found her mate early. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>And then he whispered, “Always,” and she fell in love with him all over again. </p>  </body></html>"]