["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Earth, 2255 CE Ryan Henderson looked up at the camera and shivered as a cold breeze blew right across his naked balls.Christ, why couldn’t they put some heat on in here? This had to be the coldest planet he’d ever visited. He shivered and tried to stand up straight under the spotlight shining down on him and not bow his head. He was used to being on camera with no clothes on, but not in a situation like this, where he was literally putting himself up for sale.</p><p>Because of the lights shining in his eyes, h e couldn’t see a thing further than the cameraman, so hecouldn’t see anybody in the audience. The number of people actually seated in the audience had thinned, but as for potential buyers online, there were probably hundreds, if not thousands across the universe. They weren’t actually in the big hall with him, though, like these others,so he could pretend they didn’t exist for few moments while he put himself on display. He’d drawn an unlucky high number tonight, so he was one of the last to be shown in the long line of love slaves. Many would-be buyers had already left or logged off.</p><p>The loud voice of the auctioneer called out to him to hold up his number, and he reached for the card hung around his neck to stick his price up in the air above his head. Two hundred thousand diamond standard, too high to attract a lot of bidders, but still he was hopeful. Viewers bid on the slaves by sending in blind bids either electronically or by way of runners standing by in the audience. If no one was willing to meet his price, Ryan would be advised of the highest bids he’d received that night and it would be up to him to decide whether or not he wished to take them.</p> <p>Ryan had put himself up for purchase for one galactic cycle, or a period of a little more than a year in Earth terminology. Once the auctioneers received the bids,the bidder’s name went up on the board, but hewouldn’t know the amounts bid until the end of his time slot. Ryan could see a few names had already appeared up on his board. Thank the gods there were a few bidders, at least. He prayed that someone would bid high enough tonight. This was his second attempt in as many days,and though he’d received a number of good bids, so far none had matched the amount he was asking. Time was running out, and whatever the highest bid was tonight, he had to take it. He couldn’t afford not to.</p><p>He had barely managed to escape from Earth to this small moon, called Lunar 53, in the southeastern part of the galaxy, because he knew the pilot personally, a friend of a friend from his college days.He hadn’t been able to bring much with him, lucky to escape at all, so when he got to Lunar 53, he was dead broke. After trying unsuccessfully to get a job for the last three weeks, he’d spent all the moneyhe’d had in his wallet that last night and had become desperate enough to sell himself, the only commodity he had left.</p><p>Still, despite his desperation, Ryan had a few stipulations on his ownership. First of all, his buyer needed to be male, since that was where his sexual interests lay. Considering love slaves were on duty virtually twenty-four hours a day and were at theirmaster’s beck and call, he wanted to be sure he could get it up every time. He liked girls just fine, and thought they were cute, even adorable.But if a female purchased him, there wouldn’t be much he could do for her except give her suggestions on her hair and makeup.</p><p>The second thing he needed was to stay off-world, and whoever became his master would have to agree to keep him away from Earth for the entire cycle’s term, with an option for longer. Most of the buyers were off-world anyway, in faraway mining settlements, or about to embark on a long, boring space journey where they would have little to do to occupy their time. Often these men, called Voyagers, were shuttle pilots, ferrying supplies back and forth from Earth to planets and lunar stations all over the galaxy. A very lucrative job, but one which could get pretty lonely. These were the men who were most interested in love slaves, so this requirement shouldn’t be a problem.</p><p>Thirdly, Ryan wanted to remain anonymous, and he stipulated that no one, not even the auctioneers, know his true identity. Of course, he was doing something now that was pretty damned public, standing here naked in front of the gods and everybody, but he’d taken some precautions against being recognized. He was known now simply as John Smith, and he wanted to leave his former identity far behind him. His normally long blond hair had been shaven down to the length of a marine’s on the Allied Forces. He was wearing dark brown eye daubers to cover his normally very green eyes, and though he’d never had much of a beard, he’d managed to grow a lip shadow, as they were called, just a little postage stamp of hair beneath his lower lip. It wasn’t much but anything to disguise his looks was a bonus, he thought.</p> <p>Another stipulation was that payment had to be in cash only. He would sign a video contract, complete with DNA sample to ensure legalities, but his anonymity must be respected. Because of these somewhat unusual requirements, along with his non-negotiable hard limits, bidding on him had not reached the levels he needed so far. Please dear gods, let tonight be different. I need to get the hell off this moon.</p><p>Ryan glanced up at the screen and saw the auctioneer was closing off his bids to get ready for the next slave. Each slave only had five minutes to sell himself to the audience and Ryan had been so lost in his thoughts he’d done little else besides stand there. He hoped it would be enough. He knew he looked good. People had been telling him all his life how nice-looking he was. He was rather well known in some circles as an up-and-coming young star in gay films, up and coming being the operative words. Okay, it was gay male porn, but it was nicely done porn with a fairly high production standard, and the guys he’d appeared with were smoking hot. So was he, he’d been told often enough, and he’d really enjoyed his job. Or at least he had until everything went to hell in a handbasket.</p><p>He had come out in college, and joined a liberal, open-minded fraternity that consisted mostly of hot guys, some of whom were exploring their own sexuality. To say that he’d fucked his way through his last two cycles in college would be not be an overstatement. He had no real interest in his chosen major, physical education, but he’d been a jock in high school, not really good in any other subject, so naturally gravitated toward a degree in PE. He had vague plans to be an upper school football coach. Or maybe middle school. Okay, so perhaps he hadn’t thought it through thoroughly. He’d been too busy having a good time in college to worry about it overly much.</p><p>He was just out of college and trying to parlay his degree into a coaching job in Los Angeles when he was approached by a guy in a bar with an offer to do a solo film for a rather tempting amount of money. He was broke at the time, andthe job hunt wasn’t going well. So when the offer of a job in a porn film came up, he’d accepted it with alacrity and made a few quick bucks. Easy money, just him and the videographer in a hotel room and all he had to do was jack off, which, let’s face it, he did quite frequently anyway. No problem.</p><p>The next time, he had to be with another guy, also not a problem, considering said guy was gorgeous and hung like a horse, and after the shooting they went to a hotel nearby and fucked like bunnies till the next morning. The next thing he knew he was getting a lot of calls to appear in little porn films. He was young, horny, hot as hell and everybody was having fun until the night he’d got the call to join his friend Blaine in a little scene with a good “friend” of his.That’s when the shit hit the fan, and nothing had been the same since.</p><p>He moved off the small platform under the spotlight as they signaled his time was over and walked toward one of the auctioneer’s assistants who was wildly beckoning to him. He reached for his robe, but the young assistant stopped him. She smiled at him sympathetically, popping her gum.“No, sweetie, don’t put that back on yet. The highest bidder met all of your requirements and even bid more than what you asked, but he wants to talk to you before he sends the money electronically. He wants to see you up close and personal, he said. We have him on holo-cam over here, so just follow me.”</p> <p>Sighing, but hopeful, Ryan put down his robe and followed her to the small holo-cam on the side of the room. Projecting a holographic 3-D image, the camera gave the illusion of being in the same room with whomever you were talking to. Which meant, of course, that he was about to be naked in a room with a stranger, a stranger who was trying to decide if he wanted to buy him. He felt a hot blush starting down at his toes and slowly travelling all the way up to his cheeks.</p><p>Gingerly, he sat down on the cold metal chair in front of the camera and the assistant turned on the holo-cam. He wants to see me up close and personal, huh? Jesus, does he have any idea how friggin’ cold these chairs are? Suddenly appearing in front of him was a devastatingly handsome creature, tall, muscular, late twenties, with dark blond hair. One of the most remarkable things about him was his size. He was at least six foot five and he outweighed Ryan by quite a bit, most of it muscle, though Ryan was no slacker in that department himself. The other unique thing about him was his eyes. They were a dark, glowing red, and they marked him as a Lycan. Ryan had heard stories and rumors about these mysterious people for a long time, though he’d never actually seen one.</p><p>Only recently, the planet Lycanus had made an uneasy truce with the Alliance. For many cyclesthey’d been at war, but after an Alliance ship was captured by the Lycans, with the president of the Alliance on board, the Lycans had finally agreed to enter into negotiations with the Alliance for his safe return. This complicated series of talks had reopened a diplomatic channel with the warlike Lycans that eventually led to a tenuous trade agreement.</p><p>Lycanus was incredibly rich in minerals needed by the Alliance, and the government was anxious to do anything to keep the trade agreement in place. While the war raged between the Alliance and Lycanus, the Alliance warships had attacked the planet with everything they had, but were driven off time and again by the fierce and savage Lycans. The gorgeous creature in front of him was sitting at a table of some kind, his large hands folded in front of him. Ryan wondered what he was thinking as his strange, glittering gaze raked over him. The Lycan stared at him for a minute without saying a word. He had a look almost of distaste on his handsome face. And suspicion. Where was that coming from? Had Ryan somehow already made a bad impression?Fuck, he’d just sat down! Impatiently, the assistant leaned over and spoke into Ryan’s microphone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Go ahead on y our end, sir. This is John, the one you bid on, and he can hear you and see you just fine.”</p><p>Ryansmiled, feeling nervous and unsure of what he should or shouldn’t say to impress this good-looking creature. The fact that a Lycan had bid on him was exciting and far better thanhe’d hoped for. They were all known to be very wealthy and rumored to be exciting lovers. They were also said to be able to shift into huge, savage wolf-like creatures whenever they needed to, but none of that had ever been proven so far as Ryan had heard, though the rumors persisted. Ryan thought the legends came from fear of their savage nature more than anything else. The general public had been mostly kept in the dark though when it came to the inhabitants of that planet. Ryan decided it must be only talk and wild stories, probably inspired by their strange red eyes. He decided to sit quietly and lull the Lycan into thinking he was well-behaved. He’d let the huge, beautiful man make the first move. He knew most, if not all of these guys were very dominant, and he wanted to make a good impression.</p><p>He was beginning to get nervous when the Lycan finally spoke. “Stand up and turn around very slowly.” He spoke to him in Earthonian, a mixture of several of Earth’s primary languages, the official language of the Alliance. Ryan concentrated on the words spoken in a deep, melodious voice, tinged with a strange accent.</p> <p>“Do you speak English, by any chance? My Earthonian is a little rusty.”</p><p>The gorgeous creature raised oneperfectly shaped eyebrow. “Of course,” he replied in English.“Now do as you’re told and stand up.”</p><p>Dutifully, though blushing now at his imperious tone, Ryan stood and pirouetted slowly in front of the screen.</p><p>“So...” the man began.“What’s wrong with you?”</p><p>“Uh, sorry?”</p> <p>“I said, what’s wrong with you?”</p><p>“I-uh...”</p><p>“You can talk, can’t you? Or do you just stutter?”</p><p>Ryan glared at him. “There’s nothing wrong with me.”</p><p>“Don’t bristle.I’m buying you for fucking, not for conversation. What I mean to say is your price isn’t all that high for a cycle, and you’re very pretty.Why hasn’t someone already snapped you up, as you humans say?”</p><p>Ryan fumed a little at the pretty remark, but tried not to show it, though he could feel a hot blush on his cheeks. Sitting down and straightening his back, he glanced up and saw the man smirking a bit at his reaction and shifted uncomfortably on his seat.</p> <p>The fact was Ryan was a fraud.He wasn’t particularly submissive and never had been. He enjoyed a little kink, yeah, but that didn’t make him a sub. At least not a twenty-four-seven sub like these dominant guys usually liked. Ryan knew almost all of the buyers on this site had strong dominant tendencies, at the very least, and the boys who sold themselves here were usually submissive, like in the extreme. Some were masochists too. Neither of those terms applied to him, and he wasn’t into pain in any way. Hence his extensive list of hard limits.</p><p>He needed a place to hide, though, and having a nice, strong man like this Lycan around to take care of you didn’t sound too bad when vicious killers were after you, so when he’d heard about these auctions, it sounded like a good gig to him. A cycle off-planet, in some backwater of the galaxy, might give the people looking for him time to forget him, to write him off. He had to look on this as a role, like in a film.He’d played the submissive before in his porn films and never minded too much. In fact, some of it had been enjoyable, even sexy. He could do this. He raised his eyes to stare back at the handsome face in front of him.</p><p>“I don’t know that there’s anything wrong with me, other than the fact that I have certain stipulations about my contract. As you know, I want to be off-world for at least a full cycle, and I have to be anonymous.”</p><p>“I know all that,” he replied impatiently. “What else?What are your hard limits?”</p><p>“My...uh...” The words referred to BDSM and limits that subs put on their master’s discipline of them. With the right guy, a little kink might be a lot of fun. With the wrong one, however, and way off-planet in the far reaches of some bumfuck planet, things could get dicey, if he wasn’t very careful.“My, uh, limits.Let’s see, I can furnish a health certificate, and if you can too, then I can do bareback, but not without a certificate.”</p><p>“Okay, go on.” The man waved his hand in front of him.“Limits, I said. Focus, please.”</p><p>“Okay, well, no pain. No edge play. I don’t like that. A little discomfort is okay.I’ve been with guys who like to spank, or even like to have someone spank them...” Ryan looked up hopefully, but the expression on the handsome man’s face didn’t look exactly promising along that particular line of thought. As a matter of fact, the comment only made him narrow his eyes even more, before twitching his lips, like he was holding back at smile.</p><p>He tried again.“So, yeah, a little spanking, like I said. You know, a little kink. But no whips or chains. Nothing extreme.And I really don’t like to be tied down.”</p> <p>“No?”</p><p>“Oh, no,” Ryan said firmly, shaking his head. “Kind of claustrophobic, I guess. Anyway, uh, no. No bondage.”</p><p>“No bondage?” he repeated, raising one eyebrow, and Ryan thought he might have blown it. “You’d look awfully pretty tied up...”</p><p>Ryan felt a twitching in his cock at the words, and shifted again. Why in the hell is that turning me on, damn it?</p><p>“Um, no, I don’t want that, sir,” he said. “Oh, and I don’t want to sit at your feet or sleep on the floor.I’m not a dog...” Ryan flushed again and glanced up as he remembered just who he was talking to.“Um, I don’t want to be treated like...a slave. You know, eating from your hand and all that.” He shook his head emphatically.“No, none of that shit.”</p><p>“Yet you’re selling yourself as a love slave.”</p><p>Another painful flush. Fuck, what was wrong with him? This guy would think he had some kind of condition, for gods’ sake.</p><p>“Anything else?” The man almost growled.</p><p>“Well, just no body fluids, sir. You know, like enemas or golden showers. Or spitting in my mouth. Gross.” He made a face again and this time a little smile definitely played around the man’s lips.</p><p>“Not much of a sub, are you, little human?”</p><p>“Oh yes, sir, I’m all sub, but just not a really...uh...good one, I’m afraid.”</p><p>A genuine smile this time. The man regarded him closely.“A bit of a brat, aren’t you?”</p><p>“Oh no, sir. I promise I won’t give you any trouble. I mean, I don’t smart off or anything. Well, hardly ever.” He squared his shoulders.“I promise to do whatever you tell me. As long as it’s not against my limits, sir.”</p><p>“Your extensive list of limits...”</p><p>“Well, yes, sir.”</p><p>“Your list of limits that doesn’t leave much room for you to be a sub at all?” “Um...well, not exactly,sir.”</p><p>The Lycan hesitated a long time, staring at him. Finally he spoke again.“Why, John? Why are you doing this?You obviously don’t have any interest in being a submissive or a love slave. Are you in some kind of trouble? Not in trouble with the police, are you?”</p><p>“Oh no, sir. No trouble. I just have my reasons. Nothing that would affect the...uh...performance of my duties,” he replied, lying through his teeth.</p><p>The big man hesitated before asking the next question.“I suppose I’d get much the same answer if I asked why you wanted to be off-planet for a cycle.”</p><p>“Yes, sir. I’m afraid so.”</p><p>Another long pause.“Do you even have any interest in submission?Don’t lie to me, human.”</p><p>“Yes, sure. I’m definitely a submissive, really.I really want this,” he said, repressing the urge to touch his nose to see if it was growing likePinocchio’s.</p><p>The man gave him a long, hard, very suspicious look.“Obviously your name is not really John Smith. Would you like to give me your real name?”</p><p>“I’d rather not, sir, but if you don’t like that name, you can call me anything else you like. I’ll be fine with whatever you decide.”</p><p>“My name is Blayde, by the way. Blayde Balanescu. And you can call me Alpha.”</p><p>Alpha? What the hell does that mean? Is that some kind of Lycan thing? Or was it a Dom thing? Whatever, if it helped him get the hell off this shithole moon.</p><p>“Oh. Uh, yes. Alpha,” Ryan replied, nodding his head up and down.</p><p>“All right. Much as I’m enjoying myself, it’s time to wrap this up.” He stood up and looked behind Ryan.“Move on in, boys.He’s ready for pickup.”</p><p>“What? I don’t under...” Suddenly a large man came up beside him and took hold of his wrists, clapping cuffs on him. Another big guy wrapped an arm around his throat, slamming him back in the seat as he tried to rise.</p><p>Ryan’s heart shuddered to a thudding stop, and he made a short choking sound. No! Not now, after he thought he’d actually made his escape! This couldn’t be happening...</p><p>He heard a voice washing over him as from a distance.“Ryan Henderson. You have the right to remain silent. Anything you say can and will be held against you. You are under a judgment from a high court of the Allied Forces, and are sentenced to life imprisonment with no chance for parole. Resistance is futile. Prepare yourself to be taken to Lycanus 3 to be transferred to my ship for the journey to the prison moon of Omega 9, in the Copernicus star system, to serve your sentence.”</p><p>“A bounty hunter,oh fuck no!” Ryan said, closing his eyes and tilting his head back.</p><p>“Ah, but I am, indeed, a bounty hunter, Ryan. And you have just been apprehended.”</p><p>Ryan opened his eyes and stared into the exotic, handsome face floating in the air before him and feeling only searing shock. Too stunned and sick at heart to say another word, he met the steady gaze of Blayde Balanescu, hoping for some sign that it was all some terrible joke, some misunderstanding. He saw nothing in those exotic red eyes but an icy coldness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blayde smiled a tight, cruel smile as he looked inRyan’s eyes and said. “Wrap him up and put a bow on him, boys.I’ll take him.”</p><p>* * * Ryan looked out the window of the transport as they prepared for landing on the planet where Blayde Balanescu lived. It was called Lycanus 3, way at the end of the galaxy, and reachable only through a traversable wormhole. Wormholes were space anomalies that were like rifts in space, connecting two separate locations. In the case of the particular wormhole they were traveling through, it connected Earth to the western edges of the galaxy. Unlike stargates, the wormholes weren’t permanent. Their connections lasted only for a short time, usually sixteen to forty-eight hours, and collapsed if too much mass passed through them. The transports then were small and fast, though it still took almost a full day of travel time. This particular trip included a transfer after they passed through the wormhole to a different interplanetary transport on a shithole of a moon called Beta 14.</p><p>There he had to sleep on the floor of the spaceport shackled hand and foot for one night because the shuttle was running late due to a meteor shower. His taciturn guards had left the shackles on when he boarded this shuttle to Lycanus 3, and Ryan was tired, grungy and uncomfortable. He was resigned to join the prison shuttle there that would soon take off from Lycanus 3 and transport him to the prison on one of the moons of a planet in the Copernicus star system.He’d heard rumors about the place, but he couldn’t dwell on them without going stiff with fear. Shit, why did saying the word prison still make him shudder in abject fear whenever he thought about it?</p> <p>The Lycan bounty hunters who had located him were based on Lycanus 3, and the guards they’d hired were taking him to meet them there for final transport, along with any other prisoners they’d managed to track down.</p><p>He’d vaguely heard of Lycanus 3 before. One of two sister planets to Lycanus, it was the site of one of the largest bauxite mining operations in the galaxy. Bauxite was used in the making of aluminum, and in the manufacture of the transports like the one he was on now. Formerly one of the most plentiful metals in the earth's crust until mining operations on Earth extracted so much, it was becoming no longer ecologically sustainable. Bauxite was running out on Earth, so new sources had to be found. The mines on Lycanus 3 had become as valuable as the diamond mines on the home planet. He’d heard the guards say Blayde Balanescu had a home on Lycanus 3. Not that many other people lived on the planet, all of them Lycans, according to what the guards said, and most of them were members of one huge, tightly knit Lycan family. The way they whispered about the family made Ryan think there was some mystery there, but he was too sunk in his own misery to care much one way or the other.</p><p>Blayde Balanescu was a Lycan Voyager as well as a bounty hunter, he’d heard his guards say, ferrying cargo, including human, to various destinations in the galaxy. Ryan was one of his latest acquisitions, and he’d also heard the guards say that Ryan himself had quite a price on his head.He had little doubt of that. He’d known the judge was desperate to find him.</p><p>From what Blayde had said when he’d read him his rights, he had already been convicted in absentia, no big surprise there either. The judge was powerful enough to get most anything he wanted done. Ryan now faced life imprisoned on some hellhole at the ends of the galaxy. He’d a whole lot rather be dead, and he’d decided during the last long night shackled on the floor of the spaceport that he might just take care of that as soon as an opportunity presented itself. A welltimed escape attempt should do the trick. Blayde Balanescu looked more than capable of doing the job. All Ryan had to do was fight him and give him a reason to put him out of his misery.</p><p>Through the window, he could see nothing but the desolate hills of the planet, Lycanus 3 . The landing zone was almost devoid of plant life. Ryan had seen the rich forest areas in the hills, though, as they flew low over the planet, and he wondered why the Lycans built their city in this desert. The soil was red, like the red clay back in his home state of Earth’s Georgia and much the same color. Ryan got a sudden pang as he thought about how very far away from home he was, and how he would never again see the red hills of Georgia, back on Earth.</p> <p>The transport hovered briefly right over a tiny spaceport landing dock, as the pilot prepared to land. It looked like it had been raining recently and the ground looked wet and muddy. Ryan could see two huge men standing on the dock, and he recognized one of them right away as Blayde, the man who had posed as his buyer for the sting that landed him in this situation.</p><p>Ryan gazed through the window at the incredibly tall, muscular figures waiting for him on the dock and got butterflies in his stomach all over again. Gods, this son-of-a-bitch Blayde was handsome and even bigger than Ryan had thought. Dark golden hair, those strangely compelling red eyes, he had the whole package right down to that impressive bulge in his tight pants. There was an equally large and gorgeous man standing next to him, the two of them waiting impatiently for the transport to arrive. He was as tall as Blayde, but leaner. His hair was blond too, and they had a distinct family resemblance. Both too fucking gorgeous for my own good. Damn them. From this slight distance as the craft hovered just above them, Ryan could see their dark red eyes, strange and compelling.</p><p>The shuttle settled in for its landing and was tethered to the dock. One of the guards came over and helped him up so he could shuffle down the aisle of the transport, while the other grabbed his bag out of the overhead compartment. He only had one small duffle. Most of his clothes had been left behind at his old apartment on Earth when he decided he couldn’t go back there again. Besides he probably wouldn’t need much.He’d be mostly in prison uniforms from here on out.</p><p>The guard threw his bag out and waved the two men on the dock. “He’s all yours, Mr. Balanescu.”</p><p>“Thanks, guys. See you next trip,” Blayde said, nodding back at them.</p><p>The step down to the dock was pretty high, and the chain on the shackles cuffed to his ankles was too short for all but the slightest movement. The guard only stared at him impassively when Ryan glanced back over his shoulder, mutely asking for help in getting down. Ryan sighed and shrugged, then jumped awkwardly down off the bottom step. He stumbled a bit. Righting himself, he turned to shuffle toward Balanescu and found himself nose to chest with the man.</p> <p>Balanescu put his hands on his arms to steady him and looked down at him. Suddenly he reeled backward and did a double take. Theman’s beautiful eyes actually goggled, and he sniffed at Ryan, before literally recoiling in horror. Fucking sniffed at him like he had body odor. Entirely possible considering the lack of sanitary facilities on Beta 14, but Ryandidn’t think he was that bad.</p><p>Balanescuapparently didn’t agree, because he opened his mouth and roared at him.“What the fuck?”</p><p>He was so loud and sounded so furious, Ryan stumbled back from him in shock and sat down right on his ass in the middle of a mud puddle, the cold water oozing through his pants and making him gasp. He looked up into the angry face of the exotic bounty hunter, who then backed away from him holding out his hands as if to ward him off. Ryan was so shocked he couldn’t move, just sat there staring up at him.</p><p>The guards and the other big man looked alarmed and confused. The man with Blayde put a hand on Blayde’s shoulder only to have him shrug him off almost angrily. The man then stepped around him to extend a hand to hoist Ryan back up to his feet, but Blayde literally growled and jumped between them.</p><p>“Don’t touch him, damn it!”</p><p>“Blayde!” the man cried out.“What the hell? I was just trying to help him to his feet.”</p><p>As Ryan watched in amazement, Blayde flushed a dark, painful red and shrugged, mumbling, “Sorry, Kyle.Just don’t touch him. Please.”</p><p>Blayde whirled around and glared down at Ryan, extending a hand to grasp the chain between his wrists and haul him back up to his feet.</p> <p>“Thanks.” Ryan allowed him to help him stand back up. He glanced up at Blayde Balanescu and felt the hot blood rushing to stain his cheeks.“Is-is everything okay?”</p><p>“Shut up, damn it.If I want to hear anything from you, I’ll tell you. In the meantime, shut the fuck up.”</p><p>It was Ryan’s turn to flush and drop his gaze. Asshole. Fucking bastard. I only asked a simple question.</p><p>Once again the man he’d called Kyle stepped forward andtouched Blayde’s arm. “Calm down, Blayde. No need to scare himto death.” He transferred his gaze to Ryan.“Sorry, human. Are you all right?”</p><p>Ryan nodded. “I’m all right.”</p><p>“Good.” Kyle bent over and picked up his bag from where the guards had thrown it, while Blayde grabbed his cuffed hands by the chain again and hauled him along after him, turning his back on Ryan. Ryan could hear the man Blayde called Kyle talking with the guards, but he was too busy shuffling and hopping along behind Blayde, trying not to stumble and land face first on the dock to pay anything else much mind.</p><p>“C’mon,damn it,” Blayde growled over his shoulder.“Move your ass. I need to get you somewhere so I can get you out of thosepants.”</p><p>Chapter Two</p><p>Blayde drove through the desert, occasionally glancing over at Kyle, who watched him warily. He knew Kyle must be wondering what the hell was going on with him, but hecouldn’t say anything until they were alone.</p><p>He’d pulled the damn human over to the big jeep by the cuffs, not wanting to put his hands on him again. He was afraid that if he touched him one more time, he wouldn’t be able to control himself. When they came to the tall vehicle, sitting by the docks on high treads that made it possible to move through the deep sand terrain, he left him to clamber aboard by himself. The chain between his ankles was too short for him to manage, however, and he finally had to pick him up, practically throwing him in the back seat. He hadn’t meant to be so rough, but he had to get him out of his arms and quickly before he embarrassed both of them by ravishing the human right in front of Kyle. Ravishing the human? Where the hell had that old-fashioned expression come from? Yet it was strangely appropriate for what he wanted to do to the little human. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He glanced at the man in the rear view mirror and then quickly back. Goddamn, how could this possibly be happening? This was supposed to be an easy job, a quick pickup and delivery, with maybe a little fun along the way for him and Kyle. The hot little package in the back seat was born to be fucked, and the trip to deliver the human to the prison planet would only be a couple of days, but still tedious. What better way to relieve the boredom than by playing with the prisoner known in the world of porn as Randy Ryan, star of some of the sexiest damn porn films he’d ever watched? He and Kyle had actually talked about a three-way with the beautiful human. They had no plans to rape him, of course, but there was nothing to stop them from enticing him and maybe seducing him a little, if he was willing and up for it, so to speak. The bad joke now made him cringe.</p><p>Instead when the young man jumped off the transport, he got an immediate funny feeling and a whiff of something powerful and sweet that he’d never smelled before. Intrigued and almost compelled to get closer, he walked up behind him and when Ryan had turned and looked up at him, the shock almost knocked him off his feet.</p><p>Blayde’s brain screamed mate, and the strongest, most primal urge he’d ever experienced came over him, exhorting him to throw the man down on the ground, fuck him into the floor of the dock, and then carry him off somewhere to growl over him for a while. Mates for Lycans could be either male or female. In fact, many Lycans preferred males. This human male, in particular, was the closest thing to perfection Blayde had ever seen.</p> <p>This human was his mate , his beloved, and he’d known it the moment he saw him in person. Even the human’s scent had called to him, a sweet, musky smell that made his cock stand up and take instant notice.</p><p>Before he could act on it, Blayde had jumped away from him and scared the human so badly he fell on his ass in a mud puddle. He might have yelled something at him too, he couldn’t quite remember. He was just happy he could control the compulsion as well as he had, because he had never felt anything so powerful in his life. He wondered briefly if this had anything to do with the ancient family curse, and then dismissed it from his mind. He could think about that later, when his mind wasn’t full of his mate.</p><p>So now what the fuck was he going to do? Blayde sure as h ell wasn’t ready for any damn mate. Mates were the beloved and spoiled spouses of the Lycans, who mated only once and for life. Never working outside the home, their mates existed to pleasure their wolves. In return they were well-loved, pampered and jealously guarded. They took a lot of care and attention, and Blayde wasn’t ready for any of that. He glanced back at the human in the back seat.He didn’t want or need a damn mate yet. Especially a two-faced, murderous, lying little messed-up sack of shit like the gorgeous young human sitting behind him, who was so damn beautiful it made his stomach hurt to look at him. Damn him! Why did he have to sit there looking so fucking adorable and so in need of protection.Don’t bite on that lip, damn it! That’s my job! And stop looking so fucking scared! What do you think I’m going to do, eat you? Well, hell, I just might at that.</p><p>Blayde was a Lycan wolf shifter like all of his race and a bounty hunter, a damn good one, too. On his planet, everyone was Lycan and a member of the same large family group. The Lycan shifters lived in packs, and were happier in close proximity to each other. Their pack had been isolated up here running the bauxite mines for over a hundred and fifty cycles, since the first transport brought the early settlers, all his wolf clan. Descendants of an ancient Lycan pack on the home planet, Blayde’s ancestors had come to start a new life on Lycanus 3, away from their political enemies back on Lycanus. Though those political enemies were long dead, the Balanescu pack had stayed on Lycanus 3, carving a good life on the desolate, yet mineral-rich planet.</p><p>It was only physically that they were isolated, however. Their occupations as voyagers made them unusually socialized for Lycans, who usually had little to do with other species, except for occasionally using them as mates or concubines. Because of this, they had a good command of many languages and tolerated the presence of other species much better than those on the home planet.</p> <p>Because of their physical isolation, though, they’d been able to keep the bloodline pure, with only humans and a few other species brought in as mates, never as breeders. When they’d first settled the planet, the pack hierarchy, which had all but died out on the home planet, was necessary to keep order among the highly independent males. It was still firmly in place after all this time. Blayde was an alpha male, one of six alphas on Lycanus. The chiefalpha was Blayde’s older brother, Lucas, and then there were his four cousins, Kyle, Konnor, Larssen and Nikolai.</p><p>Luckily for them, only one of them was interested in running the pack, and that was Lucas. Neither Blayde nor his cousins wanted the responsibility, nor did they want to be tied down. Blayde became a bounty hunter and made a damn good living at it for himself and his pack. Kyle, Konnor, Larssen and Nikolai were also bounty hunters and voyagers, humping the bauxite to the far reaches of the galaxy and nowhere near ready to settle down. Kyle and Nikolai occasionally helped Blayde out when he had a full transport like he did for this trip, while Konnor and Larssen usually teamed up with their own bounties.</p><p>Damn it, he was too busy for this shit, not anywhere close to being ready to settle down and take care of a mate. Blayde slammed his fists onto the steering wheel, earning himself another frightened look from the little human. Ryan must already think he was a lunatic. The human had made a stupid, useless attempt to disguise himself at the auction, but Blayde would have known him anywhere, as he did from the first moment he’d seen him on the closed circuit broadcast, holding up that ridiculous sign, showing off the gorgeous body that belonged to him, damn it. He’d been scanning the auctions looking for bounties as he normally did when he’d seen the handsome boy standing naked on the stage with his little number over his head. He recognized him right away, of course, from all the movies he’d seen.</p><p>He was unprepared for the surge of pure adrenaline when he’d first spotted him, and realized the bidding was about to close out. Thank the gods, Ryanhadn’t gotten the price he was looking for the first night, and was scheduled to appear again. Blayde was able to arrange the pickup, and by the time Ryan came back the next night, he had his associates in place. All he had to do was hook him and reel him in.</p><p>It hadn’t been at all necessary to speak to him on the holo -cam, but he wanted to see him up close and for some reason, he’d had an almost physical craving to speak to him, to see those pretty green eyes staring into his. Then when he had him sitting in front of him, squirming around on the cold metal chair, he had such an immediate erection he could barely speak. The brown daubers covering his eyes enraged him, and he hated the other attempts he’d made to disguise himself. He’d never had such a strong reaction to a prisoner before. He’d even told the man to call him Alpha, a D/s term when used by humans or other species only when they were speaking to their master.</p><p>He couldn’t stop himself from toying with the pretty human a little, though he usually never played any stupid games like that with his bounties. Thenagain, he’d never had a bounty like Ryan before.</p> <p>He’d been watching this beautiful human in porn films for over a full cycle, though his hair then had been long and golden blond, and his eyes as green as the forests up in the hills. Now he’d cut his pretty hair way too short,he’d earned himself a spanking for that, and Blayde would see to it directly. He even had a stupid little patch of hair under his lower lip.He’d see to that directly too.Blayde’s pack disliked facial hair on their mates, finding hair anywhere except the head to be unattractive. Surprisingly, the wolves had almost no body hair of their own in their human forms, and never wore beards of any kind.</p><p>It was traditional to shave any and all facial hair they found on their mates, a long tradition he would find great pleasure in following. Still, nothing Ryan had done had detracted from his beauty. His closely shorn hair, for example, only highlighted his bone structure and made him look even younger and more vulnerable, and gorgeous, if that were possible. Damn, it was all he could do not to throw him down and eat him right up.</p><p>The question was, what the hell was he going to do with him now? The idea of anyone taking him away from him was like a giant fist clenching his guts and ripping them out. But he couldn’t keep him, could he? What about the fact that Ryan was a drug-addicted whore and a murderer? A fucking little blackmailer and a thief?Wasn’t that enough to make Blayde want to take him to prison as fast as he could and let him be thrown in a cell for the rest of his natural life?</p><p>Fuck no, it wasn’t! Those things barely even gave him pause, and all he could think about was how the hell was he going to get his mateout of this fucked up mess he’d gotten himself into?</p><p>It wasn’t that he didn’t need t o be punished. He did, and Blayde would keep Ryan chained to his bed naked for the rest of his life if he had to, to make sure he got exactly what was coming to him, over and over and over again. As that picture ran through his mind, his cock swelled and strained against his pants. Shit, how much more could his cock grow before bursting from his trousers? Oh yes, he would take great pleasure in teaching his mate how to behave properly.</p><p>Ryan spoke up behind him so softly Blayde barely heard it at first.</p><p>“Are you...um...are you angry about something? Have I done something wrong?” Blayde turned a furious glare on the human. Ryan. He would use his real name, even though</p><p>he’d been going by the stupid name John Smith. As if he could hide his identity from Blayde. As if he could hide anything from him. Oh, he was going to have fun teaching Ryan a few things. “No,” he said flatly and made himself turn back toward the road before he pulled over and dragged him across the seat and into his arms.</p> <p>Kyle spoke up beside him in a low tone, so Ryancouldn’t hear it over the noise of the motor.“Are you okay, Blayde?”</p><p>“Yes,” Blade replied tersely.</p><p>“Then where are you going? The holding cells are in the opposite direction.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“We’re not going to the damn holding cells. I’m not putting him in there with those fucking animals. I’m taking him to my house.I’ll lock him in my bedroom.”</p><p>Kyle widened his eyes and stared.“Are you crazy, Blayde?” He glanced back at the young man and lowered his voice even further as he leaned toward Blayde.“He’s a murderer and a thief. I knowhe’s damn beautiful, but you haven’t thought this thing through.”</p><p>Blayde shook his head impatiently.“Just let me handle it, okay?I’ll talk to you when I get him taken care of.” He glanced at Ryan again and saw him nervously casting his eyes at the back of Blayde’s head, trying to hear what they were saying to each other. Blayde tried hard to calm himself so he could speak to him evenly. He tried a conversational gambit.“We’re taking you somewhere to spend the night.We don’t leave until tomorrow.”</p> <p>Ryan nodded, and Blayde saw him looking around himself at the scenery, such as it was. Perhaps he was savoring what he thought were some of his last moments of freedom. The countryside on Lycanus 3 was so flat, you could see for miles around. Andthere wasn’t one damn thing to be seen in that whole desolate landscape but rocks and dirt. A lot of new mates went a little crazy up here after a short time, but Blayde had always thought it was beautiful in its own way. The forests in the nearby hills soothed the Lycans’ need for the greenery of their home planet, and the sunset on the planet was really something to see. The moon, well, the moon was the main attraction for the wolves. It was easily fourtimes the size of Earth’s moon, and twice as big as that of Lycanus, and it exerted a pull on the pack that was primal and strong.</p><p>Within about ten minutes, the houses of the settlement loomed ahead, and they pulled into the narrow little streets of their community. The houses were arranged in a grid, with some stores, a school, a clinic and a kind of recreation hall or saloon in the middle. The mines were some ten miles away because of the blasting.</p><p>Blayde pulled into the driveway of the last house on the left hand side of a horseshoe-shaped cul-de-sac. His brother Lucas lived next door, and Kyle lived in another of the houses on this street. The other alphas all had homes close by. Their branch of the family had always been especially close, in the nature of Lycan shifters. Still, they felt more at ease in their own separate homes, but liked to be close neighbors.</p><p>“Come inside,” he said roughly to Kyle. “We need to get him settled and then we need to talk.”</p><p>Again, Kyle glanced at him with a puzzled, worried look. Ryan managed to jump down from the jeep and stand looking around him, but Blaydecouldn’t read his expression. Part of him wanted to wrap his arms around his sweet mate and reassure him, but he tamped down the impulse and tried to pull himself together. He really had to avoid touching Ryan. Once he started touching him, he wasn’t going to stop, not for a very long time. He pulled Ryan along by his cuffs again, taking him into the house.He was moving a little fast for the short chain on Ryan’s ankles, and Ryan stumbled once, unable to keep up. He would have fallen if Kyle hadn’t caught his arm and held Ryan upright, earning himself a furious glare from Blayde.</p> <p>“I said, don’t touch him, damn it!”</p><p>Kyle shot back an angry look at Blayde.“Then slow down and stop pulling him off his feet. Shit, Blayde, what’s got into you?”</p><p>Blayde only snarled and pulled him along to the end of the hall and the spare bedroom. Opening the door, he gestured for Ryan to enter the bedroom, enjoying the view of Ryan’s delectable ass in the tight, wet pants as he passed him to step inside. He turned and held up his hands.</p><p>“Could you get me out of these so I can change clothes, please?”</p><p>Blayde got the key from his pocket and unlocked the cuffs on his wrists and ankles, again being careful not to touch his flesh. Kyle was behind them with Ryan’s bag, and he put it inside the door. Blayde nodded at the bag.“There are your clothes.Use the shower if you want. Don’t even think about trying to get out one of the windows. They all have alarms. Give me any trouble at all, and I won’t hesitate to beat your ass.Got it?”</p><p>Ryan nodded, a red blush staining his cheeks.“Yes, sir!” he said in what Blayde considered to be a smart aleck tone.</p> <p>“Call me Alpha.Don’t give me a hard time, human, and watch your mouth, or I might just fill it up for you.” Ryan’s eyebrows raised, his mouth fell open, and he dropped his gaze. Blayde gave him a wicked smile, and softened his tone, because he wanted so badly to kiss him just then.“I wonder if I need to strip search you.”</p><p>He grinned at the panicky expression that flitted across Ryan’s face. “Go ahead with your shower and get some rest. You have a long trip ahead of you.I’ll be in later to bring you something to eat.”</p><p>Ryan nodded, still with his gaze lowered. Unable to stop himself, Blayde stretched out his hand and grazed Ryan’s cheek with his fingertips. His baby needed a shave. Ryan gasped and looked up, but Blayde was already turning toward the door.“Use a razor and shave your face. Oh, and while you’re at it, take off that ridiculous patch of hair beneath your lip.I’ll give you one chance to do it yourself before I do.”</p><p>He glanced back to see Ryan still standing open-mouthed, his hand touching his chin. He got an angry expression on his face.“Why the hell do you care if I shave or not? What is it to you?”</p><p>Blayde took a menacing step back into the room, gratified to see his mate back up quickly. “Don’t question me, Ryan. Do as you’re told, and we won’t have any trouble. Defy me and I’ll make you wish you hadn’t.Got it?” Ryan nodded slowly, and Blayde turned to go to the door and lock it firmly behind him.</p><p>Blayde turned to find Kyle standing beside him with the exact same incredulous gaze as he’d left on Ryan’s face. Blayde sighed heavily.“Come with me. We need to talk.”</p><p>“Yes, I believe we do. Did I hear you tell him to call you Alpha? What the hell has gotten into you? Who is this human?You didn’t say you knew him.”</p><p>“A lot of questions, I’ll try to answer them all, but give me a minute. I didn’t know him before, Kyle. But I do now.Let’s go sit down.”</p> <p>Kyle followed Blayde into the living room and Blayde threw himself in a big chair, hooking a leg over the arm of it. Kyle seated himself across from him on the sofa and folded his arms across his chest.“All right, you have some explaining to do. First of all, why the hell did you tell him to call you Alpha? That’s only for mates and concubines, if they’re not in our pack.”</p><p>Blayde nodded slowly.“I know, I know. He’s in our pack from now on. Damn it, Kyle, he is my mate.”</p><p>“He’s your what?” Kyle’s eyebrows shot to his hairline, and he jumped back up to his feet. “You’ve got to be mistaken!”</p><p>“Hell no, don’t you think I know my own mate? My first sight of him almost knocked me down when he got off that transport. It was all I could do not to grab him up and take off with him.”</p><p>Kyle’s face had gone pale.“Oh shit, Blayde! He’s a prisoner. On his way to serve a life sentence!”</p><p>“I realize that!” Blayde rubbed his hands over his face impatiently.“Hell, Idon’t know how I’ll get him out of this.”</p><p>“I’m calling Lucas.He’ll know what to do.” Kyle got out his communicator and punched in a number. “Lucas, get over here to Blayde’s house right away. We have a fucking emergency on our hands!”</p><p>He put his communicator back in his pocket and sat down beside Blayde. The pack had become so connected since they’d come to this planet that when one of them felt pain, it upset the entire group.He could sense the turmoil in Blayde’s mind, and it was making him nervous. “Maybe you could just fuck him a few times and get it out of your system.”</p><p>Blayde pulled his hands down from his face.“It doesn’t work that way and you know it. If, when, I fuck him,he’ll become my mate.I won’t be able to control the feelings I’ll have for him. I’m pretty sure I’ve already imprinted on him. The minute I touched him, damn, I thought the top of my head was coming off! No, this is it for me, Kyle.I don’t want another mate.It’s him for life.”</p><p>“Shit. Does the prison moonallow conjugal visits?”</p><p>“Oh, ha ha, very fucking funny. He’s not going to the prison moonand that’s final. It would drive us both crazy to be separated like that.I mean, he doesn’t know I’m his mate yet, but I plan to let him know very soon.”</p><p>The front door flew open and Lucas rushed in, skidding to a stop, his big body crashing into the coffee table and causing it to collapse under his weight. He looked up from the floor at the two men staring down at him in surprise.“Might have overshot that a bit,” he said with a grin.</p><p>Kyle reached over to help him up.“Lucas, I didn’t say the place was on fire!”</p><p>“Yes, but from the tone in your voice I thought there must have been a prisoner break at the very least.” He took Kyle’s hand and got to his feet, gesturing down at the table. “Sorry, Blayde. I’ll buy you a new one.”</p><p>“Aw, don’t worry about it.That’s the least of my worries.”</p><p>Lucas looked back and forth between them.“Okay, what the hell’s going on? It’s my weekend off, and I don’t need any problems. Blayde, talk to me. You look as thoughyou’ve lost your best friend.”</p><p>“Worse. He’s found his mate,” Kyle spoke up.</p><p>“Really?Well, that’s normally considered to be a good thing, Blayde.” Lucas smiled down at him.“I know you don’t like the idea of being tied down, but maybehe’ll understand your job will take you away a lot. He can even go with youas long as it’s not a dangerous transport.”</p><p>“It’s not about being tied down,” Kyle explained.“That isn’t the problem.”</p><p>“No? Well, then, what?What are you not telling me?”</p><p>Blayde looked up at his brother, misery written in every line of his face. “He’s my prisoner, Lucas.I have to take him to Omega 9 to serve a life sentence.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What?” The look of utter shock on Lucas’ face might have been comical if not for the seriousness of the situation.“But you can’t do that! It would drive you insane to be away from your mate! A prisoner!What the hell is he charged with?”</p><p>“Murder,” Kyle said bleakly, counting off the charges on his fingers. “Theft, blackmail...have I got them all?”</p><p>“Oh, shut up,” Blayde said. “Okay, so he has some pretty bad charges on him. I still don’t care.I’m not taking him in.”</p> <p>Lucas sank down on the sofa, his face pale.“Then you’ll become an outlaw too, Blayde. The punishment for aiding and abetting an escaped convict is life imprisonment.”</p><p>“Yeah, well, so long as I can share his cell...”</p><p>Kyle touchedBlayde’s knee. “Don’t even joke about that, Blayde. You can’t be locked up. You wouldn’t be able to stand it.”</p><p>“And I can’t stand not to be with my mate, either!If I have to, I’ll take him to Lycanus. The Alliance and their court system are irrelevant there.”</p><p>The three men fell silent, their minds racing. Blayde was right, once a member of the wolf pack found his mate, he had no choice but to be with that mate. For life. Anything else was unthinkable. Then, too, there was that ancient curse put on the family by his greatgrandfather’s mate. Little did his ancestor know when he took the man for his mate that he was a powerful warlock.</p> <p>Lucas stood up and began to pace around the room. This was his problem, too, as family alpha, not to mention the facthe couldn’t stand to see his little brother in so much pain. Blayde was the first of the alpha males on Lycanus to find his mate, and the whole issue of mates was a very big deal for them, due to the curse. They had to find a solution, and quick, before Blayde did something thoughtless and irrational like running back to Lycanus with the human. Certainly Blayde could go back to the home planet, and he was correct in saying that the Alliance laws meant less than nothing on Lycanus. But Lycanus 3 was his home, and they were a closely knit pack. Besides that, Blayde had made his life as a voyager and a bounty hunter. If he had to flee to Lycanus, he’d have to make a totally new life for himself and would have to stay on Lycanus. It would probably kill him to be so tied down.</p><p>Lucas forced himself to sit back down and take a deep breath.“All right, so you say he’s a murderer. Any chance it was self-defense? Is there some way we might be able to get a good Alliancelawyer and get this thing overturned?”</p><p>“I doubt it.I don’t know the details of the crime, but Judge Partland himself, you know, the former Supreme Court judge who’s running for the presidency of the Alliance? He’s the one who was instrumental in bringing these charges against the boy. His office is the one who contacted me about the bounty in the first place.”</p><p>“Why? Was the victim some kind of relative of his?”</p><p>“I don’t know. At the time, I didn’t give a damn, and they weren’t overly informative. The human I spoke with, some kind of aide, just said the judge was very interested in Ryan’s capture. Apparently, he ran away right after the crime and then tried to blackmail the judge in some way. Stole the victim’s money after he killed him too. They offered fifty thousand diamond standards for his capture. Not because the judge is guilty of doing anything illegal, of course, but to keep down the bad publicity.”</p><p>“Fifty thousand!” Lucas looked up at Blayde sharply. “Didn’t that strike you as a little odd for a human bounty?”</p> <p>Blayde shrugged.“What did I care? I mean, I know it’s a large amount, but the judge is rich. I just figured the human had really angered him over the blackmail.”</p><p>“Unless the victim was a close relative, or a lover. Do you know if Partland likes male humans?”</p><p>“No idea. The victim was a young man, though, only twenty-one.”</p><p>“We need to talk to the prisoner.I’m sorry, Blayde, to your mate, I mean. Can we...uh...is it all rightif I question him?”</p><p>Lucas was right to be cautious, Blayde thought. He was feeling pretty damn protective right now, and hereally couldn’t think straight with his mate’s scent still in his nostrils. His sharp hearing had caught the sounds of Ryan moving around in the back room, and he was painfully hard thinking of him possibly naked, getting a shower in the en suite bathroom. All Lycans were notoriously protective of their mates, anyway, and it was an unbreakable tradition to never touch another Lycan’s mate unless absolutely necessary. Even then you might get your hand bitten off.</p><p>Blayde glanced up at Lucas moodily.“All right, but let me go get him. I don’t want you scaring him half to death.”</p><p>Kyle and Lucas’ eyebrows both went up at the same time.Kyle’s eyes even rolled, but both wisely kept their peace.Blayde thought about what he’d just said ruefully. If anybody was in danger of scaring the human to death, Blayde knew it would probably be him. He took a deep breath and tried hard to control his emotions. Blayde glanced in the mirror on the wall and caught his own reflection. He was scowling and looked a little wild-eyed. His hair was standing on end from where he’d been running his hands through it. He sighed and tried to smooth down his hair as he left the room.</p><p>Heknew he’d been hard on his mate, but he was having trouble getting his emotions under control. Besides it was difficult to think with his big head when his little one was causing him so much grief. His balls were drawn up tight against his body, and his rock-hard erection was epic. He walked with some difficulty down the hall to rap his knuckles on the door before unlocking it and swinging it open.</p> <p>Ryan was wrapped in a towel, standing by the side of the bed. Though he’d shaved, he still had his little patch of hair below his lip. Ryan narrowed his eyes as he saw Blayde notice the patch and actually squared off his body to him, as if to get ready to fight. Defiance, baby? I need to show you how to follow instructions.Blayde’s gaze dropped down to his gorgeous body, small by Lycan standards, but absolutely perfect, the washboard abs still glistening with droplets of water from his shower, and Blayde’s brain went tilt. He crossed the room in about three steps, lifted the human and bent him back across his arm.</p><p>“You’re mine!” he growled at him and lowered his mouth to cover Ryan’s. Ryan struggled only briefly before sagging against him,and he felt Ryan’s sweet arms going around his neck to hold on tight. Blayde put his hands under his mate’s hips and hitched him up higher so Ryan’s legs could wrap around his waist, then he carried him the few steps over to the bed. Blayde lowered him gently to the bed and lay between his legs, his hands cupping his mate’s sweet ass. Ryan was breathing hard, but he didn’t seem frightened, more like surprised at the interesting turn of events. He lifted his hips up to grind his naked cock against Blayde’s trousers and Blayde almost lost his mind. He drove histongue deeply into Ryan’s mouth, sweeping across the inside of it, tasting him and claiming him as his own. He brought one hand around to clench his sweet cock, pulling at it frantically, wanting to pleasure his mate. Ryan groaned beneath him and arched his back.</p><p>“Yes, please,” he murmured against Blayde’s mouth.</p><p>“Please what, baby?Do this?” he asked as his hand moved more and more rapidly up and down Ryan’s thick cock.“Or maybe this?” He bent down and nipped at Ryan’s neck, breaking the skin and bringing the blood to the surface. Blayde lapped at it hungrily and nuzzled his nose into Ryan’s neck.</p><p>A slight sound at the door caused him to whirl around to see Lucas and Kyle staring in at him. He moved his body to completely cover his mate and made a snarling sound as he turned to face them. He could feel extra hairs sprout out on his body, his claws extend, and his long incisors drop.</p><p>Lucas stood at the door and averted his face, probably because he could see the only thing keeping Blayde from attacking the other males was his need to cover and protect his mate.</p><p>“Sorry Blayde. It’s me, Lucas.” He was speaking very slowly and carefully, talking to the wolf and not the man.“No one wants to hurt your mate, but we need to talk to him. I know how you must be feeling, but Blayde, you have to control yourself.”</p><p>Blayde shook his head to clear some of the red haze from his eyes and felt his claws and incisors retract.He’d had his head turned away from Ryan, who also had his eyes closed tightly in embarrassment, so he was pretty sure Ryan hadn’t seen the partial shift. Trying to breathe only through his mouth, he nodded, letting his head sag down.“Yes,” he said, his voice still rough with passion.“Give me a minute, and I’ll bring him out.”</p><p>The two men retreated, and Blayde took a deep breath, again through his mouth only. This close, his mate’s scent was driving him wild, and would continue to do so, he knew, until they had mated properly. He dropped one more kiss on Ryan’s sweet lips and levered himself off him. He stood by the side of the bed, looking down at Ryan sprawled out on the bed for him, his gorgeous cock riding his stomach, his bright green eyes looking up at him trustingly and almost attacked him again. He pulled himself together with great effort and put out a hand.“Come on, Ryan.Come with me, and I’ll try to explain everything.”</p><p>He pulled him up and grabbed the sheet off the bed to wrap around his body, covering him from the armpits down. He looked down at his handsome face, and saw that he was bewildered at this turn of events and nervously biting the insides of his cheeks.“Don’t be scared.No one’s going to hurt you.I’m sorry if I scared you. We just need to talk to you, all right?I’ll be right beside you the whole time.”</p><p>Blayde didn’t know why that should reassure Ryan, but he felt like it was an important point to make. For some reason, it seemed to comfort his mate, who stopped biting his cheeks and gave him a little smile.“Okay,” he said, and took Blayde’s hand.</p><p>Blayde’s insides felt suddenly soft and tender, and he cleared his throat gruffly, but didn’t pull his hand away. He turned before he could change his mind and pulled Ryan behind him to the living room. He sat back down on the chair, and moved to the side to make a small space beside him. He pulled Ryan down into that tight space and put a protective arm around the back of the chair. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Lucas,” he said formally. “This is Ryan Henderson. Ryan, this is my brother, Lucas, and my cousin, Kyle.”</p><p>Lucas looked Ryan over respectfully and nodded. Blayde knew Lucas was reserving judgment for his sake, but he still felt a little resentful at the inspection. He glanced down and saw Ryan’s erection outlined clearly by the sheet, then back up to see Lucas and Kyle carefully averting their gazes. He grabbed a pillow off the sofa and threw it over his mate’s lap.</p><p>Lucas cleared his throat and began.“Uh, Ryan, we have a strange kind of situation here that you’re not aware of. We need to ask you some questions, and it’s imperative that you tell us the truth, no matter how bad it might be. We can’t help you if we don’t have the truth.”</p> <p>“Help me?” Ryan asked slowly. “Not that I don’t appreciate it and all, but why do you, all of you, want to help me?I don’t understand.”</p><p>“We’re Lycans, Ryan,” Blayde said carefully. Surely you know what we are, and that we sometimes take humans as our mates.I have chosen you.”</p><p>“You have?” Ryan’s eyebrows shot up.“But what does that mean, exactly? Why are you all looking at me like that? You’re not all planning to rape me or something, are you?” His eyes were huge in his face, and Blayde blanched at his words.</p><p>“No!” he roared, the very idea of his brother and Kyle with his mate making his blood boil and his stomach turn over.</p><p>Ryan jumped up, startled, and tried to run, but Blayde caught him around the waist easily and put him back on the chair. He leaned close, putting a hand on the arm of the chair, trapping him, and he made himself speak calmly.</p> <p>“I didn’t mean to yell and scare you, but please don’t be silly, Ryan. I told you we’re not going to hurt you.Do you believe me?”</p><p>Ryan shrugged and nodded slightly, his eyes still wide and scared.</p><p>“Before you accept me, you need to be fully aware of my wolf.”</p><p>“Your wolf?” Ryan’s eyes were still huge, but now he looked totally confused as well. “What are you talking about?” Ryan’s gaze darted back and forth between them.</p><p>“We’re Lycans.Don’t you know what that means?”</p><p>Ryan looked up at him.“You’re rich? And really big? And you have red eyes.I mean, I’ve heard silly rumors, but...”</p> <p>Blayde sighed.“Better just to show you, I think. Stay on the chair and don’t be alarmed, all right?”</p><p>Ryan replied irritably.“Alarmed?Okay, I’m not some dumb kid who’s scared of his shadow. What do you think I am, some kind of...”</p><p>Blayde shifted right in front of him.He’d seen other Lycans shift enough times to know exactly what Ryan would be seeing. A loud cracking and creaking sound came from his body, and before Ryan’s shocked gaze, his body seemed to stretch and shift, growing larger, taller and more muscular. His head seemed to melt and reform with his face pushing out, shaping itself into a huge fiercewolf’s head, his mouth dropping open to reveal wicked sharp fangs. His fingers and toes elongated with the tips gaining razor sharp claws, and his fierce glowing eyes raked over Ryan hungrily. Ryan’s mouth opened and closed several times, his face a mask of horror, and he stared. Just stared for a long moment before, elegantly and gracefully, he fell off the chair and to the floor in a dead faint.</p><p>Shit, Blayde thought, shifting back quickly to pick up his mate off the floor. Never had that reaction before. The Lycan shifters of Lycanus 3 were known for their huge size. He was even larger than most, standing at over seven feet tall once he shifted. The thick hair that sprouted all over him was a soft brown, and his eyes were the same glowing red. Taken in all, a pretty frightening creature, though he wouldn’t harm a hair on his mate’s sweet head, whether in his wolf or not.</p><p>Lucas and Kyle looked on as Blayde gathered his mate in his arms. Kyle spoke up dryly. “Not the smoothest move there, Blayde.You could have given him a little warning.”</p><p>Blayde ignored him, gathering Ryan up in his arms and kissing him until he began to stir and come back around. Lucas and Kyle looked on in embarrassment as he petted and fondled him until he seemed to be waking up. Rather than acting frightened of him as he expected, he opened his beautiful green eyes and looked at him with confusion and curiosity.</p><p>“What the hell just happened?”</p><p>Blayde held him tightly in his arms and sat down pulling Ryan into the chair with him. Ryan came along without struggle, but looked at Blayde warily as his voice rose in volume.“Explain what just happened! Did you give me some drug?I didn’t notice you slipping me anything. Am I hallucinating?”</p> <p>“Calm down, sweetheart.It’s still me. We’re Lycan shape shifters, wolves, of course, as you saw. My whole family is Lycan. Had you really never heard thisbefore?”</p><p>Ryan shook his head.“Hell no. Well, not really. The Alliance only tells us what they think we need to know. The rest comes to us only in rumors.”</p><p>“Ryan, I’m not going to hurt you. None of us would do that.Look at me.” He pulled his head back and made him make eye contact with him.“Do you believe me?”</p><p>Ryan’s green eyes still looked panicked, but he nodded slowly.</p><p>“Good,” Blayde said. “You need to know that Lycans mate for life. When I saw you this morning, when I caught your scent, I knew you were my mate, baby. My own, sweet mate, and nothing will ever come between us again.I haven’t started the mating process yet, but I will soon, make no mistake about it.”</p><p>Ryan pushed back against him and started to stand up, but Blayde pulled him back down. He twisted in irritation and glared at him.“Will you cut that out? Just because you’re bigger than I am doesn’t mean you get to manhandle me, damn it.” He pulled out of Blayde’s arms and stood up.“And you can forget this mate business. I have no intention of matingwith anybody!”</p><p>Blayde pulled him back to stare down into his face.“Look, Ryan,” he said.“You’ve done some terrible things. I know that, but gods help me, I want you anyway. To give you the benefit of doubt, you may have been on drugs when you killed that boy. We know from the reports that you’re addicted. I think you must have been, because you don’t seem to be all that violent or vicious now. Maybe I can keep you here with me, or take you away somewhere to rehabilitate you. I could take you to Lycanus, our home planet.I’ll make sure you stay off the drugs and alcohol,and I’ll make sure you never hurt anyone ever again. Of course, you’d have to go into behavior training, but that would only be good for you in the long run. I can teach you to be a good mate and make sure you always act properly.”</p><p>Ryan’s reaction took him completely by surprise. He surged back away from Blayde and fell on the floor at his feet before he could grab him. Jumping up, he stood glaring at Blayde.</p><p>“Are you crazy?I’m no drug addict! And I didn’t kill my friend!” Ryan was shouting so loudly Blayde figured half the settlement could hear him. “It was the judge! He killed him and now he’s trying to kill me too!How can you think I would do something like that?”</p><p>He backed up and turned to run, pulling the long sheet up to free his legs. This time when Blayde came after him, Ryan shoved the broken remains of the coffee table in front of him and jumped back quickly. Blayde fell over it and went crashing to the floor. Ryan backed up right into Kyle and turned with his fists up, ready to fight. The sheet slipped to the floor, but Kyle had seenthe look in Blayde’s eyes when they opened the door of his bedroom and knew better than to touch his naked mate. He held up his hands in mock surrender and backed out of the way, averting his gaze.</p><p>Ryan sprinted toward the back door and was out of it and running across the decking by the pool before Blayde could get to his feet and go after him.Blayde’s quick reflexes kicked in and he was outside and on him before he could get very far. Still, Ryan fought him, kicking out at him and losing his balance. He fell backward into the pool and sank like a stone, leaving Blayde standing on the deck looking down into the clear water.</p><p>For a split second, Blayde didn’t react. Hell, it serves him right, let him cool off that temper. Yet after a few moments when he didn’t come back up, he grew alarmed. Blayde dove in and picked Ryan up off the bottom of the pool, bringing him quickly to the surface and over to the side. He climbed out, carrying Ryan, who was coughing and gasping for breath.</p><p>“You were only in there a minute, Ryan, don’t be so dramatic!”</p><p>“My mouth was open when I fell. I-I swallowed some water, damn you!” Ryan cried out, spitting and trying to cough it up.</p><p>Blayde slapped him on the back and chuckled.“Don’t you know enough to close your mouth, you foolish human?Serves you right anyway for running from me!”</p><p>Blayde took him by the arm and dragged him back to his room, flinging him down on the bed and standing over him until he began to settle down and breathe normally.</p><p>“Was any of that true, Ryan? Did you kill that boy or not? Tell me the truth, I mean it.I’m your master now, and lying to your master has very serious consequences.”</p><p>Ryan shook his head and stared up at Blayde, his beautiful eyes earnest, though he looked very uncomfortable with the word master.“No! Iswear to you I didn’t, Blayde.”</p><p>Blayde nodded.“Alpha,” he corrected gently. His mate would call him by the proper name. To the wolves, alpha meant master, top dog. His mate would be his to command and Ryan needed to understand that. And even thoughLucas led the pack, it didn’t take away Blayde’s status. He turned to the dresser drawers built into the walls behind him and found some dry clothes. He put them on quickly, throwing his wet jeans and shirt into the bathroom. Walking over to the door, he called over his shoulder.“Get dressed, Ryan, and come back out to the living room.We need to hear the whole story.” He turned at the door and looked back at him.“Don’t worry.We’ll get to the bottom of this mess.I won’t let anyone hurt you again.” Henoted Ryan’s mouth dropping open before he turned and walked out, hearing Ryan get slowly up off the bed to get dressed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blayde came back to the living room to sit down again, facing the other two men.“Sorry about that. I guess he’s a little unpredictable.”</p><p>Kyle smiled.“Unpredictable? Yeah, you could say that.I think he’s going to give you a run for your money.”</p><p>Frowning, Blayde flopped down in his chair again, waiting for Ryan to reappear.</p> <p>Chapter Three</p><p>In only minutes, Ryan finished dressing, pulling on the only outfit he had left, a pair of pants and a Tshirt he’d borrowed from a friend when he’d run from the judge and his men. It was at least a size too small and he was almost poured into the jeans, but it was all he had now that his other pair was dirty. He could wash them later, if Blayde would let him use his cleaning machines.</p><p>Self-consciously he walked down the hallway. He was barefoot, his shoes having gotten soaked in the mud puddle when he’d first arrived. Ryan hesitated at the doorway for a moment as he came into the room. All three of the huge Lycans turned to look at him, but he felt drawn to Blayde and walked over to stand next to him. Blayde was looking at his tight pants and bare feet with a scowl, but smiled with great satisfaction when Ryan came over to him and made room for Ryan to sit beside him on the small sofa. Ryan sat and faced the other two Lycan shifters on the larger sofa in front of him.</p><p>Lucas leaned forward and spoke softly to him. “Ryan, what did you mean a little while ago when you said the judge was the one who killed your friend?”</p><p>“I mean he did it. It was the judge and those men he always keeps around him. My friend Blainewas the judge’s boyfriend. His sometime boyfriend anyway. They fought a lot because the judge always wanted him to do things he didn’t want to do. The judge had called after we got through shooting our scenes that night and asked Blaine to come see him. Blaine said he told him to try to convince me to come along. He said the judge had a kind of crush on me, and probably did it just to hurt Blaine. But Blaine insisted I come anyway, and said the judgetold him he’d give us a thousand diamond standard eachif we’d do a love scene together and let him watch. Fifteen hundred if he could join in.”</p> <p>He turned to look directly at Blayde.“All we wanted was our money. We did as he asked. We finished partying with him and two of his guys came in. The judge said they wanted to join in. They wanted to fuck us while the judge watched. We said no, and Blaine got really pissed. Told the judge he wasn’t a whore to be passed around. The judge got this pissed off look on his face, but he agreed and told us to go. We left, and got almost to the door when the judge called Blaine back. I told him not to go, but he went anyway. Told me to go home. So I did, and that was the last time I ever saw Blaine alive. Ryan buried his face in his hands. “I never saw exactly what happened, but I know they must have killed Blaine when he went back in there.”</p><p>Blayde sat quietly beside him, just letting him talk. The other two men were listening to his story intently.“The next morning one of our friends called and told me Blaine had been killed and the police were looking for me. I got out of my apartment as quick as I could. I knew the judge must have implicated me somehow. I went to a friend’s house, someone I did films with. He wasn’t home, but knew he didn’t lock his door half the time. I went in and got some clothes and found some money where he always hid it. Then I just took off as fast as I could. I left him a note and told him I’d pay him back. I got a ride with another acquaintance to Lunar 53 where I got in on the slave auction. You know the rest. They framed me for the murder! I never touched Blaine! I swear it!”</p><p>Blayde said nothing when he finished, just squeezed his shoulder.Lucas’ lips had thinned as he listened to the account.“Thank the gods you got away from the sons-ofbitches,” he said. “They haven’t forgotten you,though, and I think they won’t rest until you’re dead too. They can’t afford to leave a loose end like you walking around. They’ve probably set something up for you at the prison, like having the guards kill you as you try to‘escape.’ Rumor has it the judge will be running for President of the Alliance. One reason they were so frantic to find you and put you away before you could talk.”</p><p>Ryan’s face got even paler. He squared his shoulders and looked up at Blayde.“I guess I’m pretty much fucked,then, right?”</p><p>Blayde looked back at him and smiled.“Not yet, but I’ll get to you in a minute.” When he didn’t get the answering smile he must have been going for, he pulled Ryan more into his arms, a little surprised when Ryan didn’t resist. “I’m only kidding, honey. I’ve got you now, and no one is ever going to hurt you again. Do you believe me?”</p><p>Ryan took a deep breath and nodded, leaninginto Blayde’s chest. “I want to believe it.”</p> <p>Lucas stood up and began to pace again.“I need to think this through, Blayde, and it’s getting late. Kyle and I should go.Can I talk to you for a minute, please?”</p><p>Ryan watched the three gorgeous men move toward the door and stand in a huddle, probably talking about him.For the last three days since he’d been arrested at the auction, he’d been terrified and sick at heart, thinking his life was over. Then suddenly Blayde had come blazing into his life, and though he was still exhausted, somehow he felt hopeful again for the first time in weeks, really. For some reason, Blayde seemed powerfully attracted to him. And Ryan had to admit, the feeling was more than mutual. When Blayde first wrapped those big arms around him, he had felt all the hurt and fear inside him melting.</p><p>He’d lied to him, though, and if he found out, he would hate him for it. He’d only just met Blayde, no matter how attracted to him he was. Hedidn’t trust him with the whole truth yet, though, even if he did keep talking about keeping Ryan safe and being his mate.The story he’d told was mostly true,he hadn’t killed his friend and surely that was the most important thing. He needed the Lycans to believe him and not take him to prison. If there was any chance of getting out of that, he had to take it.By saying he wasn’t even there when Blaine was killed, it really sounded a lot better. It might give him more of a chance.</p><p>These three huge Lycans made him feel safe. Especially his Blayde. My Blayde? When did I start to think of him like that? Somehow he knew, though, that Blayde would stand between him and danger, would fight for him if necessary.Considering Blayde’s size, it was a comforting thought. He put his head back on the chair and closed his eyes. In seconds, he was drifting off, and for the first time in a long time, he allowed himself to relax.</p><p>* * * When Lucas moved over to the door, Blayde followed him. Kyle came in close too, and Lucas spoke in a low voice.“I know it’s probably useless for me to tell you not to mate with him yet.”</p><p>“Fuck that!” Blayde said angrily. “He’s mine and I’ll do what I want with him.” Lucas gave him a stern gaze, and Blayde blushed a little.“I’m sorry, Lucas. I know I gave my allegiance and my obedience to you as the pack leader, but don’t ask me to do this.”</p><p>“B layde, I understand how you must feel, I mean, I haven’t met my mate yet, but I think I understand that the feeling is overpowering.”</p><p>“Overpowering?That’s not the half of it. You can’t know it till you experience it, Lucas. There’s no way I can be with him and not fuck him.Don’t ask me to do that.”</p> <p>“Then let him come to my house for the night. Give yourself a little space.I’m right next door, and you know I’ll guard him with my life. No harm will come to him, I promise.”</p><p>“No,” Blayde said firmly. “I can’t do it.”</p><p>Lucas sighed heavily.“Isn’t there some way I can convince you not to mate with him? If you do, and something goes wrong... Look, Blayde, Kyle and Nikolai and the twins, all of us will do everything we can to help you get him out of this mess. You know that. Whatever it takes! But if you mate with him and something goes wrong, you’re my brother, Blayde, and I can’t stand by and see you get hurt.”</p><p>Blayde shook his head.“It’s already too late. I imprinted on him the moment I touched him, I could feel it.The actual mating is just a formality at this point.”</p><p>Lucas’ shoulders slumped in defeat.“I thought that would be your answer, but I had to try.”</p><p>“I know,” Blayde said miserably. He glanced over his shoulder at Ryan and saw he’d fallen asleep, curled up in the armchair like a child. He sighed again as a rush of tenderness washed over him.“Nothing I can do about it, Lucas.”</p><p>Lucas nodded, reluctance evident on his face.</p><p>“Don’t worry about the other prisoners. I’ll go by the holding cell and check on them,” Kyle said.</p><p>“See you in the morning,” Lucas said softly. “We can talk again over coffee. Just be careful with him, Blayde, until you can figure things out.”</p><p>After they left, Blayde walked over to stand beside his mate.</p><p>Ryan stirred and looked up to see Blayde staring down at him. He smiled at him tentatively and straightened up in the chair.“Sorry. I didn’t get much sleep last night at the spaceport. What with the cold floor and the shackles and all,” he said, with a sardonic little smile.</p><p>Blayde nodded.“I’m sorry you’ve had to go through all that, baby.Especially when you’ve done nothing wrong.Well, except for your lifestyle. That’s been pretty fucked up for a while.”</p><p>Ryan shifted uncomfortably.“What do you mean?”</p><p>Blayde frowned at him in irritation.“What do I mean? You can’t be that stupid. Porn films, fucking anything on two legs, drugs and alcohol. What the hell were you thinking? I know you’re young, but shit!”</p><p>“I made good money doing those films, and so what if I had a good time? I was careful, and I’m single and unattached!”</p><p>“Not anymore!” Blayde roared back at him.</p><p>“Yeah, well, who said? I don’t remember you asking me, and I sure as hell don’t remember agreeing to anything. Damn it, I just met you this afternoon!”</p><p>Blayde reached for him and yanked him up into his arms, crushing him against his chest. He lowered his lips to Ryan’s, sucking in his tongue and doing wicked things to the inside of his mouth. Ryan pushed back against his chest for about two seconds and then relaxed into him, allowing him to hold him tight to his chest. Blayde pulled his head away and stared angrily down into his face.“Is this ringing any bells? You’re mine, damn you. Say it!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He shook him a little and Ryan’s head fell back. He looked up at Blayde and gave him a teasing smile.“No. Make me.”</p><p>Blayde glared down at him.“Oh,it’s like that, is it? All right, sweetheart. Just remember you asked for this.” He bent over and leaned his shoulder into Ryan’s waist, lifting him over his shoulder as effortlessly as if he weighed a hundred kopins, instead of a hundred and sixty-five. Blayde strode rapidly down the hall with him almost before he could react. Ryan was muscular and strong himself, but since he’d arrived, Blayde had been tossing him around like he was a kid. Though an average to large-sized human, he was like a child to these Lycans. A part of him thrilled to the idea that he was able to be so controlled by this man. Or I should say this wolfman. It made him want to shiver and tease and see how far he could push his sexy lover. He didn’t mind being a bottom, in fact he loved it, with the right guy. He was anxious to see if Blayde was the right one.</p><p>Blayde carried him directly to the bathroom and sat him down on the toilet seat, standing between his legs and stripping off his shirt. Ryan allowed it, interested to see what Blayde might have in mind. Blayde stood Ryan up and pulled down his pants, then threw his clothes aside and stared down at him. Ryan was used to being naked. Hell, he spent much of his day that way when he was filming, but he didn’t like the way Blayde was looking him over. Blayde reached for the razor on the sink and before Ryan could say a word to object, he’d dry-shaved the little love patch below his lip right the hell off.“Ow!” Ryan cried, putting his hand to his chin.“What the hell did you do that for?”</p><p>“I gave you a chance to do it earlier, but you were being defiant. No facial hair, baby.It’s ugly.”</p><p>“Yeah, well, says you!”</p><p>“That’s right. I do say.”</p><p>Blayde turned around and began to remove his own clothing.Ryan couldn’t take his eyes away from him. Gods he was beautiful and big. His cock was huge, much bigger than his, and right now, very erect.</p><p>Trembling just a little, Ryan decided to see what might happen if he tried to get away. He made a break to move from where he stood, but Blayde caught him around the waist and hauled him back.“Oh no, you don’t. You issued a challenge to me, baby, and I never back down from a challenge. I need to get you to agree to be my mate. I said I would never force you to do things you don’t want to do. I didn’t say I wouldn’t seduce you.”</p><p>“You can try,” Ryan said with a little smile. His smile faltered a little when, without warning, he found himself flipped around and sitting on Blayde’s lap, facing the door.</p><p>Hecould feel Blayde’s breath on the back of his neck. “You did indicate to me earlier that you wouldn’t mind fooling around a little. Does that still stand?”</p><p>Blayde’s thighs were hot as fuck, and Ryan could feel his big cock nudging against the backs of his legs. Ryan glanced over his shoulder to stare steadily into his wine-colored eyes. “Sure, I’d like to fool around some. You’re very sexy. But you won’t make mesay what I don’t want to...” he teased, making his words an even bigger challenge.</p><p>“That’s good,” Blayde said, smiling at him.Ryan didn’t much like the looks of that smile. “So when you agree to be my mate, you can’t say I coerced you, right?”</p><p>This was a game they were playing, and he was aware they both knew it. He had a sudden tingly feeling in the pit of his stomach that Blayde would play this game very well. The butterflies in his stomach told him he was about to get schooled, and that he would enjoy every minute of it.</p><p>Blayde stood up, moving him back to his feet. Without another word he went over to the large shower enclosure. Ryan looked down at himself and groaned. His cock was riding high on his stomach, still feeling enthusiastic over being stripped naked by the sexy Lycan. Ryan covered it with his hands. Stupid cock.</p><p>* * * After adjusting the water, and pulling off his clothes, Blayde stepped inside and held out a hand to Ryan.</p><p>Ryan hesitated for a moment and then looked Blayde in the eye.“I want you to fuck me, but I’m not agreeing to being your mate.Let’s get that clear between us.”</p><p>Blayde looked him up and down and raised one eyebrow.“You want me to fuck you, baby? I’ll be glad to oblige...”</p><p>Ryan stepped slowly into his arms and didn’t protest as Blayde pressed his body close. Ryan relished the feel ofBlayde’s skin next to his, his cock rubbing against his own. Gods, it felt so good.Blayde’s hands reached for his ass, tight, hard as a rock.“So beautiful,” Blayde murmured against his neck. Ryan put his head back and closed his eyes, letting the words and the water wash over him. Blayde’s mouth traveled downward to the curve of his shoulder and he bit him, hard enough to leave a bruise.</p><p>“Ow!” Ryan pulled back, but Blayde slammed him back up against his body.</p><p>Blayde dropped to his knees in front of him and took his cock inside his hot, velvety mouth. Forgetting everything else, Ryan groaned and held onto Blayde’s shoulders as his legs suddenly felt too weak to hold himself up. Ryan had been the recipient of many blow jobs in his life, but never one as mind-blowing as this one. Just as he was getting into it and feeling like he was about to erupt, Blayde stood up and flipped Ryan around to face the shower wall. Putting a foot between Ryan’s legs, Blayde pushed his feet outward and bent him over. Blayde’s hands were on his ass, prying him apart to expose his hole. He jumped when he felt Blayde’s cock nudge up against it as he kissed the back of his neck. His cock just rubbed slowly up and down his crease, as if they had all the time in the world. Ryan thought nothing had ever felt so damned good. He wondered if Blayde felt the same.</p><p>“This is mine, Ryan. This tight little hole is all mine.”</p><p>“Whatever you say, wolf-man. Notice Ihaven’t said so yet, even though you’ve been talking a hell of a lot.”</p> <p>Ryan jumped in surprise as he felt a soapy finger ease up inside him. Blayde murmured in his ear.“Gods, I do love a smartass. My own little brat.Some Lycans don’t like brats, but I do. So much more fun to make you mind.You’re going to get everything that’s coming to you, baby. And you’ll love every minute of it. Say yes, Alpha.”</p><p>Ryan refused, shaking his head and pounding his fist against the wall.</p><p>“Say it!” Blayde swiped a finger over his prostate, making him yell and squirm away. He pulled Ryan roughly back.“I said, say it!”</p><p>“Y-yes! Alpha, whatever the fuck that means.”</p><p>Another finger slipped in beside the first one and Ryan jumped again and moaned.“It means you’re mine, sweetheart. I’m the only lover you’ll ever need from now on.” Ryan shivered and Blayde whispered in his ear.“That’s right...feel good, baby?” Blayde began to run his fingers up and down his crease, in and out of his hole until Ryan shifted his feet and trembled with need. “What do you want me to do, baby? What do you need me to do for you?”</p><p>“I-I don’t know,” he moaned miserably.</p><p>“You sure? Tell me what you like...” He slid his fingers inside to find his prostate and give it a good rubdown. Ryan groaned aloud and leaned back into it, yelling out his pleasure.</p><p>“Oh, you like that?” Again the sinful fingers swept over his prostate, and held there, pressing hard, making him spurt out his cum against the shower wall, arching his back helplessly and buckling his knees.</p><p>Blayde caught him around the waist but wouldn’t let him sag down. Instead he held him up against his body as he reached for his cock and milked it for every last drop of cum. Milked it so hard Ryan cried out for him to stop as it became almost painful, and Ryan twitched and jerked around like a rag doll in his arms.Finally Blayde stopped and pulled Ryan’s face around so he could kiss him again. He kissed him until Ryan was breathless and whimpering, until his cock began to fill out and his knees went weak all over again.</p><p>“Now whoseboy are you, hmm?”</p><p>“Fuck! Please.”</p><p>“Tell me...I can keep this up all day.”</p><p>“No, Blayde!Please!”</p><p>“Tell me...”</p><p>“Oh, I hate this.I hate you.”</p><p>“Liar. Tell me.”</p><p>“I’m yours, damn it,” he said, feeling defeated, but still excited by his control.</p><p>“Damn right you are.” Blayde laughed and grabbed the soap to lather his hands. He spent a long time lathering up Ryan’s body all over, washing all the little nooks and crannies until Ryan was shivering with need and hard as iron. Finally, he rinsed him off and pulled him from the shower to dry him. He pushed and shoved him back into the bedroom and over to the bed. Pushing him face down, he stopped long enough to grab the lube from the table next to the bed and spread it over his cock. Ryan watched him over his shoulder as he smiled down at him and put some on his fingers.“How much do you want this, sweetheart?”</p><p>Ryan ducked his head, like he was embarrassed to feel so needy.Blayde’s fingers reached inside him, smoothing the lube over his hole and up inside, and he couldn’t hold back his moans. “Tell me, love.Tell me if you want this.”</p><p>“You know I do!” he yelled. Blayde stared down at him sternly, and he dropped his gaze.“I- I’m sorry, Alpha.”</p><p>“Relax for me, then, sweetheart.” Ryan should be able to feel his cock nudging his hole. “Damn it, let me in.”</p><p>“I-I’m trying.”</p><p>“Try harder, this is my little ass, my little mate.” He pushed his way inside and buried himself deep.Then he held it there, encased in Ryan’s tight passage.Kissing the back of Ryan’s neck, he slid one hand beneath his stomach and pushed him back against him, holding him tight.</p><p>It felt so damned good to be inside Ryan, wrapped up in his heat. “That’s it, just relax for me. Damn, you’re so sweet.” He began to thrust, pushing in and sliding back out in a rhythm that he hoped was making Ryan as wild as it made him.“Tell me how much you love it, baby.”</p><p>“Shit, just shut up and fuck me! Move, damn it!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A sharp slap landed on Ryan’s ass and Blayde stopped fucking him.“Mind your damn manners, baby.”</p><p>“Please...”</p><p>“Please what?”</p><p>Ryan slammed his fist down on the bed in front of him.“Shit, I hate you! I hate this!”</p><p>“Lying again. Not going to help you onebit.”</p><p>Ryan tried to hump back against him and got another slap on the ass for his trouble.“I’ll move when you show the proper respect.”</p><p>Ryan bit the mattress below him, and Blayde chuckled, waiting him out. Damn, it felt incredible, he could feel Ryan’s ass trembling, shivering with the need for him to move, but he was so stubborn he was trying to hold out. He screamed in frustration.“Move, damn you! Do something!”</p><p>“You know what to do...”</p><p>“Okay. Will you fuck me? Please!”</p><p>“Nope. Not good enough.”</p><p>He pulled out and Ryan rolled over on his back and stared up at him.“What are you doing? You can’t leave me like this!”</p><p>Blayde gave him a positively evil smile.“Oh, I could. But I have other plans. Get up to the head of the bed.”</p><p>Ryan crawled warily up to the head of the bed and lay down. Immediately, Blayde crawled up beside him to fasten his wrists in the cuffs hanging from the back of the headboard. Ryan seemed both surprised and not too pleased by this turn of events. He kicked out at his tormentor. “Let me out of this shit!”</p><p>“Oh, temper, temper. I was going to let you come, but I might change my mind now.”</p><p>“No! I mean, I’m sorry, please.I’ll be good, I promise.” Right about then, Blayde thought Ryan would have promised him anything to get to come. He looked like he hurt so damned bad.</p><p>Blayde rubbed his hands over Ryan’s balls. He knew they must be aching by now.</p><p>“Do they hurt, sweetheart? I can kiss’em and make’em better. All you have to do is beg me a little.”</p><p>“You asshole!” Ryan spit back at him.</p><p>Blayde smiled again. He leaned down to kiss Ryan as he crawled on top to straddle him. “There’s that temper again.Are you going to be very good?”</p><p>“Yes, damn it. Please!”</p><p>“Say it again.”</p><p>Ryan hit his head on the back of the bedframe.“I promiseI’ll be good.”</p> <p>“What’s my name?”</p><p>“B-Blayde. No, Alpha.” Biting his lip, Ryan thrashed his head back and forth on the headboard.“Please, Alpha.”</p><p>“I do like the way you beg.” He sat back on his heels and looked at him.“So pretty in bondage. I knew you would be, my sweet little mate.” He bent down and began to torture him with his tongue, drawing it down his body and circling around and around his cock, but not actually landing on it. He kept it up until Ryan had real tears in his eyes and then, finally, he smiled and engulfed it in the wet, hot heat of his mouth, making Ryan buck his hips off the bed and make a sound he’d never heard him make up to this point. He wanted to hear it again. Blayde began to deep throat him, moving up and down his shaft hard and fast, but just as Ryan was about to climax, he pulled back his head again.</p><p>Ryan was beyond speech at this point, merely grunting low in disbelief and pain. He simply stared at Blayde, panting like a dog.</p><p>“Should I let you come?” Blayde reached down to lick up the shaft of his cock, eliciting a squeal of pleasure, or was it pain?“If I do, what will you do for me?”</p><p>“Anything...please, Alpha.”</p><p>“I’ll hold you to that later, baby.” Smiling, he hooked one of Ryan’s legs over his shoulder and plunged deep inside him, while at the same time grabbing his cock in one strong hand. He began stroking once, twice in the same rhythm over both his cock and his prostate at the same time.</p><p>“Come for me, sweetheart. Give it up.”</p><p>With a deep, guttural moan, Ryan began to come hard, actually screaming out his relief. Blayde reached his orgasm too, and Ryan arched up and into Blayde’s arms, holding on tightly and burying his face in Blayde’s neck.</p><p>Afterward, Blayde unsnapped the cuffs and held him in his arms until Ryan caught his breath, then stretched out beside him on the bed and held him as he slept. Blayde let him sleep in his arms for a few minutes before shaking him gently awake.</p><p>Another deep breath and he asked,“Do you agree to become my mate, baby? Make no mistake, I’ll never release you from your vow should you say yes. But if you say no, I’ll have to get you out of here and over to my brother’s house. I can’t play with you anymore and not make you my mate.”</p><p>Ryan turned to face him. He flipped himself over on the bed and wrapped his legs around Blayde’s waist, putting his sweet ass right on top of Blayde’s cock, which swelled up to welcome it. Blayde took a huge gasp of air. He was holding on by a thread.</p><p>Ryan leaned down and whispered in his ear.“I don’t know.It’s so quick.”</p><p>“It does seem pretty quick, I guess.It’s fast for me too, but I want you. I’ll never want anybody else but you.”</p><p>Ryan still hesitated, unsure of what to do. This man excited him, even as he bossed him around.He’d never been so controlled and dominated before, but he had to admit a part of him loved it.He’d had the most intense orgasm of his life just now and he knew it was because of the way he talked to him, the way he told him what to do and dominated him. The thing was, it touched some part of him deep inside he never really knew existed. He wanted to submit to this man. He wanted Blaydeto drive him crazy and make him do things he’d never done before. And he most definitely did not want to leave him tonight. Or maybe ever.</p><p>“Can I agree to do it and then if I want out in a few months, you’ll let me go?”</p><p>Well, damn. Could he agree to that? In a few months, it would kill him to let Ryan go. He knew that he wouldn’t be able to live without him after that much time had passed. But there was little chance of that. Once he gave Ryan the mating bite, it would change Ryan forever, and Blayde’s venom would ensure Ryan would probably never want to leave him. Still, if that was the only way Ryan would agree to be his mate, he had to agree to it. He wouldn’t force him. Then if Ryan became unhappy, in a few months he would let him leave if he wanted to. If he could, that is, even though it would mean Blayde’s own death. Once mated, Lycans found it impossible to live long without their mates.</p><p>All the solid bricks of the wallhe’d carefully built up over the cycles against settling down with just one mate for life were suddenly collapsing around his head and burying him under the rubble. The feel of his mate’s sweet arms around his neck, and his sweet ass against his cock had already brought out all the raging lust in his body. There was no way he could deny him anything.</p><p>“I want you, Ryan. I want you for my mate. If this is the only way I can have you, then I agree. If you want to leave me after a while, then I’ll let you go.”</p><p>Ryan leaned over to kiss him softly on his ear. His tongue darted out and licked it gently, making Blayde almost lose his mind.“Then yes, I accept you as my mate.”</p><p>Blayde put back his head and howled so loudly the whole settlement probably heard him. He laid Ryan back down on his back and reached for the lube. Ryan looked at him with huge eyes, startled by what he’d done, but he couldn’t help it. A surge of pure adrenaline was coursing through him. Laying Ryan back on the bed and pulling his legs up over his forearms, Blayde leaned down to whisper in his ear, knowing his voice would come out rough and animal-like and not wanting to frighten him.“I’m going to fuck you again, sweetheart. I’ll try to be gentle, but I can’t promise anything. My wolfis very strong, and I’m holding him at bay.”</p><p>Hands trembling with need, he prepared his darling as best he could, lubing him well and stretching him with his fingers. Then before he could stop himself, his beast took over and he plunged into him, burying himself to the balls in his ass. Ryan looked up at him questioningly, his eyes wide and scared, and Blayde tried to smile at him.“Are you okay, baby?I didn’t hurt you, did I?”</p><p>“No, it feels good. I...oh!”</p><p>Blayde had just raked across his prostate, giving it a good internal rubdown with his cock, enjoying seeing his mate squirm and cry out.“Oh, Blayde!”</p><p>“Come for me, baby. Come hard for me!”</p><p>A few more thrusts and both of them were breathing hard and gripping the mattress. Blayde reached for Ryan’s cock and gave it a hard pump and Ryan lost it totally, arching his back and screaming out his release. After he recovered, Ryan took a deep breath and then relaxed his body completely, looking nervously up at the Lycan, because he hadn’t come yet. Blayde caught the look from Ryan and smiled at him gently.“It’s all right. I wanted you to come first.”</p><p>He didn’t want to frighten his sweet mate by telling him what was coming. Besides, the more relaxed he was the better off he would be, and that was why he’d let him come first. Blayde’s hand rubbed Ryan’s balls, and at the same time caressed his cock, trying to pleasure him everywhere at once. Ryan whimpered and moaned as Blayde began to move again inside Ryan’s velvet heat, checking carefully for his response. Ryan was still relaxed and open, his eyes closed in bliss.</p><p>“Just try to relax. Push back against me.That’s it, sweetheart.” Blayde began to move deeper inside, and then drove into him, hard and fast and deep, so that Ryan tensed a little and cried out in surprise. As Blayde buried himself balls deep inside Ryan, he leaned over and whispered to him.“Hang on, baby. This might hurt a little.” Unable to wait, Blayde bit down hard on the side ofRyan’s neck, breaking the skin and sucking in the blood as it seeped out. At the same time, his knot swelled up inside Ryan’s passage, tying them together. His orgasm came moments later, rocking him to his core. Ryan screamed and tried to get away, but Blayde held his body tight, sinking his fangs deeper.</p><p>Only after he had emptied himself into Ryan did he lick at the wound, which started to heal as soon as he put his tongue down to it. It would heal over but leave a scar, marking Ryan as his mate. He had made the bite mark high on his neck so it would always show that he was owned. Between the mark and the fact that he would make damn sure Ryan would always have his scent all over him, no one would ever be foolish enough to touch his mate again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blayde had given Ryan his knot, which was another gland that secreted the venom, along with the ones in his jaws. Between the two they created the venom that brought about the change in his mate.They’d be tied together now for an hour or so until the knot released. In the meantime, he hoped Ryan would stay asleep. Blayde gazed down at him. Ryan was reacting to the venom and was already intoxicated by both the venom and the force of his orgasm. His eyes were half closed and he was breathing fast. A flush sat on his pretty cheeks. Blayde knew that he would run a high fever now for at least a couple of hours and be a little out of his head. He had to care for him for the next few hours until the fever passed.</p><p>It wasn’t a venom that would kill him, or cause any harm. It would just change his body chemistry a bit. His body would be stronger and even more beautiful, and he would be healthier and live a long, long life, as did all the Lycans. If he did decide to leave, the side effects, the ones he hadn’t told Ryan about, would eventually fade if Ryan stayed away from Blayde. Of course, if Ryan ever left him, for any reason, Blayde wouldn’t survive more than a few weeks anyway. Blayde’s venom would also help create a strong mating bond. From this time forward, neither of them would be happy away from each other and Ryan would belong to him body and soul. No matter what he’d agreed to earlier, he knew Ryan would probably be incapable of living away from his mate from this time on and would even suffer intense emotional pain if they were apart. It tended to have quite a calming effect on little brats like Ryan, too, though he still retained his free will to act out. He could do it, but it would make him uneasy. Often mates who had displeased their alphas asked to be disciplined so they would feel better again.</p><p>Blayde smiled and smoothed the hair off his brow. His little brat might need a spanking or two to calm him down. He pulled him closer, breathing in his scent and a realization hit him full force. He already loved Ryan. Not just lust, but a pure, strong love that sent a thrill all the way down to his toes. Damn it! When had that happened?</p> <p>Chapter Four</p><p>Ryan awoke slowly from a deep sleep filled with wonderful, but disturbing, dreams. He dreamed of prowling through the forest under a full moon and putting back his head to look up at the night sky. He heard a noise beside him and turned to see a beautiful, huge wolf come up beside him.Somehow, in his dream, he wasn’t frightened of the wolf. He reached out to pet his head and came fully awake. Turning on his side, he opened his eyes to find Blayde sleeping next to him, snoring softly, his mouth open a little.</p><p>Ryan was confused. What the hell had happened once he got off that transport? Within the space of a few hours he’d been stripped, chased, shaven, fucked until he passed out and now mated to a damn Lycan shifter. Even worse, the fucking mate of a Lycan.And he’d agreed to it. From what he knew of mates, they were little better than love slaves. Hell, I gotto be trippin’ on something.For the second time since he’d met Blayde he wondered if Blayde had slipped him some kind of drug.</p><p>Slowly his mind went back over everything that happened, everything he could remember and it still seemed like a crazy dream. The one constant in the whole thing was Blayde. He was everywhere in his thoughts and in his dreams. Now he was lying beside him, and all Ryan wanted to do was kiss him and snuggle up to him. What the hell was the matter with him?He’d agreed to let this huge Lycan be his mate.Ryan felt so tired still, he couldn’t think about it all right now. He snuggled down into the comfortable bed and drifted back to sleep, pushing his sore ass back against Blayde.</p><p>When he awoke again, the bed beside him was empty. He raised up on his elbows and found Blayde going through his bag by the door.</p> <p>“Hey, what are you doing, Blayde? I mean, Alpha?”</p><p>Blayde straightened up, holding a small cardboard package in his hand.“I was going to clean your clothes for you this morning before we leave, and I found these. What the fuck is this, Ryan?”</p><p>He’d been rummaging through Ryan’s few possessions and had come across a carton of Marillos, something that Ryan enjoyed from time to time.He’d had some stuck down in his duffel bag when they’d taken him at the slave auction. They were harmless, really. A kind of thin cigar, they were heavily laced with marijuana, a substance legalized for many cycles on Earth, along with various other legal drug enhancements that were intended to mellow you out and relax you. Prettyintoxicating, they weren’t something he smoked on a daily basis, by any means, but they were great to bring him down after a stressful day. Looks like I’m going to have quite a few of those if Blayde keeps this shit up.</p><p>Blayde held the Marillos up in his hand and gave him an angry glare.“No drugs, you hear me? This is the kind of stupid decisionthat got you into trouble in the first place.”</p><p>Ryan couldn’t hold back his reply. “What the hell?I mean, they’re legal.I’ll smoke them in my quarters on the ship if the smoke bothers you.”</p><p>“You don’t have any fucking quarters, sweetheart. You sleep where I do. And I said, no. I take good care of what’s mine, and one of those things is you. These aren’t good for your health, so you won’t smoke them. Period, end of discussion.” He turned and spoke softly but with irritating firmness.“No more drugs for you, baby.Ever.”</p> <p>Ryan’s mouth fell open and he jumped out of bed, pulling on a pair of sweats he found by the bed. He opened his mouth to reply but Blayde had already turned and was on the move. He strode from the room and looked over his shoulder to make sure Ryan was following. Ryan thought about staying in his room and pouting, but it was like the damn man had an invisible string attached to his belly button. His feet just wanted to follow Blayde wherever he went.</p><p>Seemingly reassured that Ryan was right behind him and that he was watching him, Blayde placed the cigars in a small covered box on the counter, closed the lid and pressed the button. Ryan fumed as the solid waste disposer ground up his expensive cigars. He’d paid a lot of money for those at the spaceport when he first arrived on Lunar 53,a fact he couldn’t keep himself from pointing out.</p><p>“Damn it, those cost a hundred and fifty diamondcertificates!”</p><p>Blayde looked back at him and nodded.“Right. See how you make bad decisions?That’s why I’ll make all of them for you from now on. If you have any more drugs hidden anywhere, let me know now. Last chance, no?Okay, go sit down and let’s talk.”</p><p>“Don’t tell me what to do! And I can and will make my own damn decisions, whether or not you approve of them.” Ryan stomped into the living room and threw himself down in the big chair. His ass was so sorefrom Blayde’s huge dick he almost jumped back up again.It wasn’t lost on him that he was doing exactly what Blayde had asked him to do, despite his words. Why had he done that?He hadn’t intended to. Hating his obedience, he turned his head away from Blayde and stared into space. Blayde followed him in and stood looking down at him.</p><p>“It’s my job now to take care of you, love. And from now on address me as Alpha.Don’t make me keep reminding you. As the mate of a wolf, you need to follow my discipline.”</p><p>“Yeah, well, I didn’t ask for the job! I had no idea that being your mate meant I have to follow your orders, damn it, causethat ain’t happening.”</p><p>Blayde walked calmly over to him, picked him up out of the chair, jerked down his sweats and bent him over a knee he placed on the seat of the chair. Holding him there with his feet dangling off the floor, Blayde slapped his ass three times in quick succession, not holding back a bit. Ryan yelled out, not really in pain, though the slaps on his bottom stung, but more in humiliation at his position.</p> <p>“I’ve been meaning to do this since you stepped off that transport. You will follow my rules exactly, or you’ll find yourself in this position often. Do I make myself clear?I’m the alpha, so I make the rules for us both to follow.”</p><p>“Who said?” Ryan yelled back over his shoulder defiantly, despite the fact he knew he’d be punished again.“And who said you were the dominant partner?Just because you’re overgrown and you shoutand stomp around and grind up people’s cigars? Well, I’m not buying it! You can’t just boss me around.” He tried to squirm off Blayde’s knee, but was held firmly in place.</p><p>Five more hard slaps came down on his tender ass. Then a big, wet finger was rammed up inside his sore hole.He arched up on Blayde’s arm and cried out.</p><p>“I can keep this up all day. Are you ready yet to apologize and beg my forgiveness?”</p><p>Frustrated and humiliated, he shook with rage, but he knew it was useless to keep resisting. “Y-yes, Blayde. Alpha.I’m sorry. Please forgive me.”</p><p>Blayde sat him down on his feet, but when he went to pull up his pants, he stopped him, and pushed him back down in the chair with his pants still down around his ankles.</p><p>Blayde stood over him scowling down at him, until Ryan dropped his head submissively. Strange how much his stomach had begun to hurt, and how uneasy he felt. Absently, he rubbed his stomach and Blayde smiled a self-satisfied little smile.</p><p>“Stomach ache, baby?That’s from the venom in themating bite.”</p><p>“What the hell do you mean? You mean when you bit me, it made me sick?”</p><p>“No, nothing like that.It’s what happens to the matewhen he isn’t pleasing his master or when he’s acting out.It’s all part of learning to become a good mate.Like I said, it’s because of the venom.”</p><p>“Acting out? Like what a fucking little kid does?Are you for real?”</p><p>Blayde sat down across from him on the sofa, leaned back and put his hands behind his neck with a little smirk on his face.“Well, you did become a member of our pack when we mated. All pack members have to learn discipline.”</p><p>“Bullshit. I thought that was just sex talk.” Ryan jumped to his feet, pulled up his pants, and stomped into the kitchen.His stomach was cramping now and he remembered he hadn’t eaten anything since lunch the day before.“My stomach onlyhurts because you’re trying to starve me to death!Isn’t there anything to eat around here?” A sudden hard cramp made him bend over and clutch his middle. He looked desperately over at Blayde and held out his hand to him.“Oh Blayde, help me!” He made a little whimpering sound that brought Blayde to his side immediately. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m not upset with you, baby. Calm down. Now what do you want to eat, sweetheart?I’ll fix you something.”</p><p>“Just some toast maybe. I may be coming down with a stomach thing, though it’s easing up some now.”</p><p>Blayde typed in something on the food processing machine and turned to gather Ryan in his arms.“I’m not mad at you, baby.Not really.” He kissed him gently and Ryan’s stomach cramps eased off. He felt immediately better too, like a load of worry had been lifted from his shoulders.</p> <p>“Why do I care if you’re mad at me or not? I’m mad at you! Oh no, wait a minute, you’ve got to be kidding! I feel like this because of you? This venom thing you keep blathering about?” Ryan’s voice was filled with disbelief and shock.</p><p>“Or you could say that you feel bad because you’re a little out of control. Six of one, half a dozen of another...”</p><p>“I hate you.” Another hard cramp almost doubled Ryan over.“Ow, Blayde! Help me, please!”</p><p>“No, you don’t hate me, sweetheart.Stop doing this to yourself.” Blayde took him in his arms, unable to bear seeing him in pain, and kissed him until the pain eased off.“Come over here and sit down, honey, and eat something. I made you some toast and eggs.Some coffee too.”</p><p>Blayde sat him down at the breakfast bar and gave him the plate from the food processor and took a cup of coffee for himself. Ryan was starving, so he ate every bite before looking back up accusingly at Blayde.“I feel like you didn’t give me a full disclosure, Blayde.”</p> <p>“A what?”</p><p>“Like when you go for a loan and the bank has to give you a full disclosure on all the fees and stuff.I didn’t get one of those for what was going to happen when I agreed to be your mate.” He glared accusingly at Blayde.“First pack discipline and now this. Are there any other nasty little surprises I should know about?”</p><p>A laugh from the front door made them both turn in surprise. Kyle and Lucas stood in the doorway. Kyle came in and sat at the bar beside them.“Have you told him about what happens if he watches porn,Blayde?”</p><p>“What happens?” Ryan asked.“What does he mean?”</p><p>“Shut up, Kyle,” Blayde said.</p><p>“No, tellme!” Ryan said.“What will happen if I watch porn?”</p> <p>“It’s not important, baby. I’ll tell you later. You won’t be watching any anyway. Kyle’s just trying to start trouble.”</p><p>Kyle sauntered in with a big grin and sat down at the counter. Lucas followed him and leaned over the end.“Got any more coffee, Blayde?”</p><p>Blayde punched in their coffees and in a few seconds sat a steaming mug in front of each of them.Lucas took a long pull of his and regarded Blayde closely. “I was awake a long time last night thinking about this and I only came up with one idea.It’s not the best idea I’ve ever had, but it was all I could think of that might keep you and your mate out of an Allianceprison.”</p><p>“Well, what is it? I’m open to anything that keeps my mate with me where he belongs.”</p><p>Ryan sat quietly, leaning a little toward Blayde almost subconsciously. This conversation made him nervous, and he wasn’t used to others deciding his fate. As a matter of fact, he’d almost forgotten about the sentence hanging over his head. Blayde was so vivid, so larger than life, he didn’t leave any room for anything else. He sat back and listened, though, knowing Blayde would do his fighting for him. Though he would never admit it to Blayde, he trusted him more every minute to take care of him.It did occur to him briefly that he’d just been complaining about Blayde taking control, but this was different. He wasn’t sure how, but he was sure it was. And exactly how is it different? the annoyingly rational part of himself asked. Oh, shut up, he told it.</p><p>“The way I see it, you have no choice but to begin your voyage to take the prisoners to the prison moon.We’ll just have to help him escape en route. Or at least make the prison officials think he did. We can say he died in the escape attempt, and we disposed of the body. In the meantime, Ryan will have to be one of those prisoners in every way, Blayde. He has to stay among them, sleep and eat among them.They can’t be aware of any favoritism on your part. They’re sure to be questioned after all the shit hits the fan.”</p><p>“Yeah, only one problem.I’m not putting my mate in there with them. Hell no, out of the question.I don’t want those animals around my mate.”</p><p>“If you don’t agree, I don’t think we can pull this off.”</p> <p>“Damn it, Lucas, look at him! One of them would take him as their bitch the first night! Hell, the first hour!”</p><p>“Hey!” Ryan interrupted heatedly, as they all turned to look at him.He wasn’t sure whether to be flattered or embarrassed.“I might have something to say about that! I can take care of myself, you know.”</p><p>All three men looked at him for a moment and then turned back to Blayde.“You may be right, but I can’t think of any way around it. They have to believe he’s really your prisoner.”</p><p>“I have an idea if anyone is interested,” Ryan said.</p><p>Blayde glanced at him.“Of course we’re interested, honey.What’s your idea?”</p><p>“Blayde can bring me on the ship like he’s already claimed me, but I resist. I make it very clear I don’t want to belong to Blayde, and I act belligerent and hard to handle. Blayde puts me in solitary to teach me a lesson, and he says it where the others can hear it. I continue to resist and we have a very public fight. He tells me I have to stay in solitary the remainder of the trip.”</p><p>Kyle laughed out loud.“Well damn! He’s smart as well as pretty!”</p><p>Blayde frowned and slid closer to his mate, not liking Kyle calling him pretty. Lucas smiled though and said,“Good idea, Ryan. Blayde, does that meet with your approval?”</p><p>“Maybe.”</p><p>Lucas looked at him seriously.“He’d have to actually be in solitary.You can’t be sneaking him out to your room.”</p><p>“How long is this supposed to last? And what’s the point,anyway?”</p><p>“The point is to establish him as a prisoner, and leave no doubt about it when the next part of the plan goes into effect.”</p><p>“Which is what exactly?”</p><p>“A prison break, in which one of the prisoners is unfortunately killed. That would be Ryan, of course, but naturally we fake his death.”</p><p>”Thanks.That would be a plus,” Ryan said in a dry tone.</p><p>Ignoring him, Blayde nodded.“Pretty dangerous, isn’t it, to allow the prisoners any kind of freedom?A break could backfire on all of us.”</p><p>“We’ll only let Ryan try to escape. All four of us will be on the trip, you two, plus me and Nikolai.We’ll plan it all carefully to make sure we control everything. When it all starts to go down, we neutralize Ryan, make sure the other prisoners see his body and then control the situation.We’ll remove him, inform the others he died in the escape attempt, even stage a body disposal in transit.”</p><p>“Wait a minute, what do you mean, ‘neutralize’ me? I don’t think Ilike the sound of that.”</p><p>Blayde patted Ryan’s shoulder and kept talking as if he hadn’t interrupted. “Where can we stow Ryan afterward?Somewhere in my quarters?”</p><p>“No, they might search there. I don’t think they will, they have no reason to doubt our word. But let’s go to the ship and find a place we can rig, just in case they decide to search the ship. It has to be secure and well hidden,” Kyle said, standing up.</p><p>Blayde and Lucas got up to follow him.Blayde bent to drop a kiss on Ryan’s forehead.“Be back soon, baby. Stay inside and rest.”</p><p>The three men barely glanced back at Ryan as they left, intent on getting to the ship and taking care of business. Ryan sat for a few minutes at the bar, feeling strangely bereft at Blayde’s absence and wishing they’d allowed him to go with them. He was out of sorts and feeling a little miserable for no particular reason. He wondered if the venom Blayde kept talking about had anything to do with the way he felt. Sighing, he wandered over to the living room and pressed the button the wall that made the movie screen descend. Maybe he could relax and watch a good movie, try to take his mind off the journey to come. Everything hinged on this going as smoothly as possible for both him and Blayde.</p><p>He turned on the screen and flipped through the listing of movies available. He saw some of his own old porn films and, smiling, he punched the menu to bring them up. It always turned him on to watch himself on screen with ahot guy. Jealous as Blayde was, he probably wouldn’t let him watch porn anymore anyway. Might as well go for a little farewell performance. As the movie unfolded, Ryan didn’t find it as stimulating or sexy as he usually did. He thought idly that it was because he’d seen it so many times, but when two of his friends came on, really going at it in a scene, he felt nothing but boredom. He glanced down at himself, surprised to see his cock was completely uninterested. He reached down to give himself a little pull or two through his pants, but nothing happened. Growing alarmed, he yanked harder, and still was unable to get even a little hard.</p><p>What was it Kyle had joked about earlier?“Have you told him about what happens if he watches porn, Blayde?” Oh, no. What has he done to me? He flipped back to the main menu and found more porn not featuring him. He watched gorgeous guys in various positions doing all kinds of things to each other from sweet to really filthy and still, nothing was happening. Oh, good gods, I’m impotent! I’ll kill him. I truly will kill him!</p><p>He sank slowly down onto the sofa, his eyes glazed over. Why had this happened? How could Blayde do something like this to him? He turned the movies off and retracted the screen. Sitting on the sofa, stunned and miserable, he waited for Blayde to return.</p><p>* * * Blayde opened the door and walked into the darkened living room. When he’d left that morning, he’d had no idea it would take them so long to locate a secure place to hide Ryan. They finally found a storage compartment, not huge, but big enough to house Ryan for a few hours while they made their way to the prison planet and dropped off their charges. It was imperative the other men think he was dead and his body disposed of in space, so no trace of him could be seen anywhere on board once they made their claims. They pulled in a mattress for him to sleep on, along with some other improvements and made sure it was totally secured and defensible before they were satisfied. Then they had to get Lucas and Nikolai on board and situated, and finally, of course, the other prisoners. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>All that had taken time, and he had returned home to fetch Ryan and get him onboard. It was barely after dark, so Blayde couldn’t figure out where his mate could be.“Ryan?” he called. “Where are you?” No answer. He walked to the bedroom, but found it empty. He was just starting to panic when he heard a noise outside. He practically ran to the door and there he saw Ryan, sitting on the side of the pool, his bare feet dangling in the water.</p><p>“Hello, baby. Are you okay?” Ryan continued to gaze down at the water, dragging his toes back and forth, making tiny ripples.He hadn’t turned on any lights, so was sitting in the dark.</p><p>“Ryan? Answer me! What are you doing out here? Why are you acting this way?”</p> <p>Ryan looked up and gave him a furious glance.“What do you care?”</p><p>“What the hell? Of course I care. Are you angry because I was gone so long? I had a lot to do to get ready for the trip.I came back to get you.”</p><p>“Why didn’t you tell me, Blayde?How could you do that to me?”</p><p>Blayde walked toward him, but Ryan held out a hand to stop him.</p><p>“No, don’t come near me.”</p> <p>Blayde stopped and folded his arms over his chest.“All right, seriously, what the fuck is up with you?”</p><p>“You know what’s wrong with me, Blayde! That-that bite you gave me last night! You said it had venom in it!You didn’t say it would make me impotent!”</p><p>“Impotent?” Blayde looked stunned for a moment, and then his eyes narrowed.“Wait a minute. Did you try to watch porn after Kyle put that shit in your head?” As realization hit him, he tried to hold in the laughter, but it came spilling out before he could stop it.</p><p>“Don’t laugh at me! It’s not funny! Yes, I tried to watch some porn films while you were gone tonight, to see what Kyle was talking about, and nothing happened! Nothing!”</p><p>“Sweetheart, you’re not impotent. You just can’t get it up for anybody but me. Look...” He pulled off his shirt and stepped out of his trousers.Blayde’s huge dick jutted out in front of him, hard enough to swing on. Ryan’s own cock bounced up enthusiastically at the sight.</p><p>“But I don’t understand. I watched the porn, and I tried to jack off and nothing worked! Wait a minute,” he said accusingly. “Are you telling me...”</p> <p>“I’m telling you my mate can’t get hard for anyone but me.”</p><p>Ryan scrambled to his feet and walked over to flop down on a lounge chair by the pool. “Are you seriously telling me I can’t ever...well, this is bullshit!”</p><p>Blayde shrugged.“Sorry darling. It’s the way it works. I don’t have anything to do with it. And it’s not forever. If, for example, you decided to leave me, and stayed completely away from me for a while, then the effects would gradually fade.”</p><p>“How gradually?”</p><p>Blayde shrugged.“A few weeks...”</p><p>“A few weeks! Are you fucking kidding me?”</p><p>“Hey, I told you, I have nothing to do with it.It’s just how it is.”</p><p>“Yeah, but you’re loving every minute, aren’t you?” Ryan stomped over to where he stood and pointed a finger at him accusingly.“You did this on purpose, and I won’t have it! I hate stupid wolves, and I hate this planet, and I hate you!” He stomped his foot again, then doubled over. More stomach cramps, Blayde realized. He picked his angry mate up in his arms and held him close to his body, his hard dick rubbing against Ryan’s.</p> <p>“Oh, baby, don’t be like that.” Bending him back over his arm, Blayde took his mouth in a searing kiss. Ryan opened his mouth in surprise and Blayde swept inside with his mouth. Ryan pulled back his head and stared at him breathlessly.</p><p>“D-don’t! You’re trying to make me forget why I was mad.”</p><p>“Is it working yet?”</p><p>Ryan struggled briefly to get away, but Blayde smiled, lowered his head and murmured to him against his lips. Ryan may not have understood the actual words, but his body responded to it, and he promptly pressed his lips to Blayde’s. Blayde answered by nudgingRyan’s mouth open again with his tongue, sweeping it gently over the inside of his mouth, exploring and tasting him. The larger man kept his hand on the back of Ryan’s head so he couldn’t pull away. As the kiss went on and on, Ryan grew breathless. By the time Ryan pulled away to escape, Blayde was sure a hot red flush stained his cheeks.</p><p>Blayde, still holding Ryan in his arms, began to walk swiftly back into the house and down the hallway to the bedroom. He put Ryan onto his feet and quickly stripped off his pants. Ryan stood very still, looking dazed and still clung to his shoulders. Blayde straightened back up and smiled a fierce smile.“Still hate me?” He took Ryan in his arms and laid him back on the mattress, pulling his legs up and pushing them back. Grabbing some lube from the table next to the bed he spread a generous amount on his fingers and pushed one gently inside Ryan’s hole. Gently stretching and pushing his finger in and out, he made sure Ryan kept his eyes on him. He took hold of Ryan’s cock in his other hand. “Look at me, sweetheart. Look at me, I said.”</p><p>Ryan turned to face him.</p><p>“I love you, sweetheart, and you belong to me.You don’t need to ever get hard for anybody else, because I’ll be fucking this little hole for the rest of your life.I’ll take care of you. Me, baby. Only me.”</p><p>“All right. Only you...Blayde.”</p><p>“That’s right, baby,” he said with a smile. He slipped in another finger and Ryan groaned, seeming to love the burn and shivering with pleasure as Blaydestroked Ryan’s prostate with the tip of one broad finger.“Want one more, darling?” He slipped in a third finger and Ryan gasped. Leaning over, Blayde kissed the head of his cock and swept it up and sucked it down in a swirling kiss. Ryan grabbed two handfuls of sheet beneath him and screamed his pleasure. Blayde pulled out his fingers, but replaced them at once with his own rigid cock, nudging his way past the guardian muscle ring and then driving his cock deep inside, so deep that his balls slapped Ryan’s ass.</p><p>Ryan arched his back in pleasure and pumped his hips up tomeet Blayde’s, but Blayde was concentrating hard on Ryan’s cock. A copious amount of pre-cum was leaking from it, and Ryan squirmed and cried out as Blayde jacked it hard, spreading the pre-cum over his hand. When Blayde’s thumb dipped inside Ryan’s slit, Ryan cried out hoarsely and came with a shudder, bucking his hips and clutching at Blayde’s waist. Blayde followed in two short, hard thrusts and then fell on top of Ryan, both of them trying to catch their breath.</p><p>After a minute or so, Blayde rolled over onto the bed beside Ryan, and pulled him up closer so he could cuddle with him. Nuzzling his nose in Ryan’s neck, he whispered. “Don’t go to sleep, sweetheart. I have toclean you up and take you to the ship.”</p><p>Ryan groaned. “I’m too tired. Can’t we wait till tomorrow?”</p><p>“No, baby. Everyone’s waiting on us now.” He heaved himself up from the bed and went into the bathroom, cleaned himself and emerged a few minutes later with a warm washcloth for Ryan. He tenderly washed him, paying special attention to his backside, until Ryan began to squirm.“Gotta make sure it’s all nice for me, baby.” He patted the cheek of Ryan’s ass. “I told you I take good care of my property.”</p><p>Ryan smirked and pushed his hands away.“I’m clean enough, thank you. Any more and you’ll have to postpone your takeoff until later.”</p><p>“Wish we could.” Blayde sat down on the bed beside him.“Lucas is worried we’ve taken too much time as it is. He wants to leaveby nine o’clock.” Blayde pulled Ryan into his arms and dropped a quick kiss on his forehead.“I’m going to miss you tonight,” he grumbled. “How am I supposed to get to sleep without you?”</p><p>Ryan laughed.“You’ve never had me before last night. Surely you canmanage.”</p><p>“Maybe, but I don’t like it. I wish there was some other way.” He stood up and sighed.“Get dressed, baby,and let’s get going.”</p><p>Ryan stood up and pulled on his underwear and pants, then crossed over to his duffle bag and found a shirt. He slipped into his shoes and turned. Blayde stood behind him, holding handcuffs. Ryan blanched at the sight, but stuck out his wrists. Blayde put them on him and stood back to look at him.“I have to say it’s a good look for you, Ryan. I might just keep you in cuffs even after this is over.”</p><p>“Oh, ha ha, very funny. I hate this.”</p><p>“Mmm, but I could make you love them. Maybe by the end of this trip, you’ll be begging me to put you back in cuffs.”</p><p>“Don’t hold your breath.” Blayde gave him a sharp look and he dropped his gaze.“I’m sorry, um, Alpha.”</p><p>“Pack discipline is hard for you, isn’t it, sweetheart? Don’t worry, it’ll get easier. I hope.” Smiling, Blayde took hold of his arm and led him out of the house, making sure the doors were secured behind him. He picked him up and put him in the front seat of the jeep and went around to the other side.</p><p>“Damn it,Blayde, I’m a grown man. Stop manhandling me like I’m some kid.”</p><p>Blayde grinned.“Don’t pretend like you don’t love it.” Blayde leaned over to kiss him and ended the kiss with a little nip on his lower lip. Ryan grabbed it and looked up at Blayde in surprise.</p><p>“That’s for being a smart ass.”</p><p>Ryan flushed and turned his head, pouting a little, and Blayde laughed.</p><p>After getting in and starting the motor, he turned to Ryan and spoke seriously to him. “Honey, when we get on board, I’ll be treating you like any other prisoner, only worse. We have to make this thing believable.Don’t be hurt by anything I say to you, okay?” He patted Ryan’s stomach.“I don’t want you to have a stomachache.”</p><p>“Okay, I understand.” Ryan’s voice suddenly sounded very small, having lost all the bravado of a few minutes before. “Just...” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Just what, baby?”</p><p>“Just promise me you’re really going to keep me with you.You wouldn’t fool me over something like this, would you, Blayde?Decide I’m too much trouble, or can’t ever learn pack stuff or something and just take me to the prison planet?”</p><p>Blayde slammed the jeep back in park and turned to Ryan.“Don’t you know how crazy I am about you?You’re my mate, Ryan.Forever.” He reached for him and held him close, rubbing his back when he felt the trembling.“This has been hard on you, baby, I know that, but don’t ever worry about me.I’ll always want you. Understand?”</p> <p>Ryan nodded, not trusting himself to look up. Blayde tipped up his chin with a knuckle.“Do you trust me, mate?”</p><p>Ryan nodded, and gazed up into his face.“I trust you, Blayde.”</p><p>“Well, all right. And for the record, you’re not too much trouble, just the right amount of trouble.” Blayde kissed his lips gently and then put the car back in gear and started back toward the ship. Within minutes they were pulling up to the dock, where Kyle had brought the ship around. It was a sleek, dark starship, built to hold a crew of twenty, with a large cargo hold. Blayde explained that although they carried many different types of cargo in their trips around the interstellar system, the cargo hold was fitted with cells for this trip, both open cells and one solitary, enclosed cell for holding prisoners considered to be dangerous. This was where he planned to house Ryan for the trip.</p><p>Walking up the gangplank, they were met by Kyle, who nodded and winked at Ryan before clapping Blayde on the back.“I was beginning to get worried about you two.”</p><p>Blayde only grunted and kept walking, pulling Ryan along behind him.“Come with us, Kyle, and back me up.We’re about to put on a little show for the prisoners.” He leaned over to put his mouth next to Ryan’s ear. “Ready,baby?”</p> <p>Ryan nodded.“You know how you told me not to pay any attention to anything you say to me in there? Well, the same goes for you, too.”</p><p>Blayde just grinned at him.“Bring it, baby.I wouldn’t mind tangling with you.” Kyle came up beside them with shackles.“Better put these on him, we want to make it look as realistic as possible.”</p><p>Ryan stood stoically while Blayde fastened the shackles around his ankles, passing the chain up through his handcuffs. He looked up at Ryan and squeezed his hand.“Okay?”</p><p>Ryan nodded.“Let’s go. It’s show time,” he said, and they turned to go to the cells.</p><p>* * * Walking into the cell area, which was deep in the bowels of the ship, Ryan felt his nerves jangling.He was glad of Blayde’s steady, large presence. Ryan shuffled down the corridor, his shackles clanking on the floor. He was flanked by both Kyle and Blayde. He felt nervous energy tingling down his spine as they entered the holding cells area. The minute they stepped in, Ryan could hear the catcalls. He smiled, feeling a rush of bravado. This was acting, just like in his movies, and he decided to put on a little show, twisting his ass as he walked slowly along, staring into the cells. There were four other prisoners besides him, two to each cell.</p><p>In the first cell, a huge man of about forty, with scars angling across half his face from his nose to his temple, stood by the bars and smiled voraciously, licking his lips.“Hey cop, put him in here with me.I’ll be happy to share my bunk with the little darlin’.”</p> <p>The other, younger man in the cell with Scarface snorted with laughter, no doubt enjoying the break in the monotony. Over in the other cell, two men, jolly-rogers by the looks of them, stood up and came closer to the bars. Jolly-rogers were pirates, called after the flag they painted on the sides of their ships. They made their living preying on the ships up and down the space corridors. They usually piloted small, fast ships that could latch onto a larger starship and once docked they would enter, rob and terrorize the crew before taking off and losing themselves in the vastness of space. Tough customers, and ruthless in a fight, they were not the sort Ryan wanted anything to do with.</p><p>One of them, a big, hulking man with a red beard nodded at Ryan and jerked his head over to the man with the scar.“It’s that kid from the porn movies. Randy Ryan. We got ourselves a genuine celebrity.”</p><p>“Yeah?” Scarface said. “Well, maybe he can put on a little show for us later on.” “Well now,” said the jolly -roger, “I’ll just bet he could. I’ll bet he could suck a watermelon up a hose pipe, couldn’t you, sweet thing?”</p><p>Ryan turned to smile at the man, refusing to be intimidated.“Whatever you want, baby. I got nothing but time from here on out. You got a watermelon you want me to try?”</p><p>A big hand pushed Ryan hard in the middle of his back, and he would have stumbled if not for Kyle’s strong hand grabbing his arm and hauling him back upright. “Shut the fuck up, prisoner.” Blayde’s voice sounded harsh and commanding. Surprised, Ryan looked over his shoulder to see him scowling down at him.“Cut the shit.I don’t want any trouble out of any of you.It’s a long way to Omega 9, and I aim for it to be a peaceful trip.”</p><p>Scarface laughed.“Oh, it will be nice and peaceful, officer. Just let me get my hands on his little ass and you won’t hear a peep out of me for the rest of the trip. Him, on the other hand...”</p><p>Blayde slammed the flat of his hand against the bars by Scarface’s head and the man jerked back quickly.“Shut the hell up, asshole! If anybody gets his hands on this humanit’ll be me.”</p><p>Blayde pulled Ryan around and put both hands on his ass, kneading the plump cheeks between his hands.Ryan reacted by pushing back strongly on Blayde’s chest with both shackled hands, shouting up in his face.“In your dreams, asshole! I don’t associate with filthy bounty hunters! Nogood bastard!” He wrenched himself from Blayde’s grip and backed away a few steps.“Leave me the hell alone!”</p> <p>Blayde followed him, pushing him up against the wall.“You little son of a bitch!You’ll take whatever I decide to dish out and like it.The warden doesn’t care what pleasure I take with prisoners I deliver to him, and I always take my share.I’ve seen you in those movies too, and I aim to sample a little of this.”</p><p>Ryan stomped down on his insole and Blayde hopped back, cursing. He drew back his fist. “Why,you...” Ryan flinched and cowered against the wall, but Kyle caught hold of Blayde’s fist before it fell.</p><p>“Enough, Blayde. You can deal with him later. We have some things to take care of before we take off. Put him in solitary and let him contemplate his sins for a while.”</p><p>“Come on, prisoner!” Blayde grabbed Ryan and pushed him toward a closed door farther down the corridor.“I’ll be back for you later.” He opened the door and roughly pushed Ryan inside, yelling in at him.“Stay in solitary and see how you like it!You’re lucky I don’t chain you to the wall!” He leaned in so his face was hidden from the other prisoners, winked at Ryan and then slammed the door behind him, leaving Ryan alone in the claustrophobically small room. Ryan, whose stomach had begun to cramp just a little at the roughness in Blayde’s voice, despite the fact he knew Blayde was only acting, felt inordinately pleased at the little wink. The idea occurred to him again that he was falling very much in love with the beautiful Lycan, and a shiver made its way up his spine.</p><p>The corridor was quiet for a few minutes and then he could hear the men outside yelling obscenities. The sound was muffled in this room, but he could still hear them calling to him. A thick mattress had been put on the floor along with some pillows and blankets. Ryan smiled a little. His mate had thought of his comfort in the solitary cell. Crossing over to it, he lay down and pulled the blankets up around his chin. Space travel always made him cold and sleepy. With a sigh, missing Blayde already, he turned over on his side and tried to get some rest. He had a long time in this cell to “contemplate his sins,” as Kyle had put it. He just wanted the time to pass by quickly,he really didn’t know how he was going to be able to stand being away from Blayde over the next few days. Damn it!He hadn’t meant to fall in love with him.</p><p>Chapter Five</p><p>Blayde was busy over the next few hours with the launch and operation of the ship. Until they achieved orbit around Lycanus and gained clearance into interplanetary space, he had to pilot the ship manually.Once clearance from the Intergalactic Command was received, he’d take the ship into interstellar space and be on the way to the nearest traversable wormhole for a trajectory back out of his solar system and into the Copernicus solar system, where they were headed. Kyle and Nikolai helped him, their actions practiced and almost automatic after a long time working together. Lucas was resting in his room, but would be out as soon as they achieved the trajectory, when they’d be able to put most of the operations on automatic pilot for the eight hours or so it would take to traverse the wormhole.</p><p>As Blayde worked, his mind kept wandering back to Ryan. He hoped he was comfortable down below decksand that he wasn’t frightened. His inner wolf was uneasy at the thought of his mate being scared or upset. In the morning when they achieved trajectory, he would go below decks to check on him and bring him something to eat. Kyle or Nikolai could accompany him and pretend to take his turn with Ryan as well, so it would look as if all the bounty hunters were pleasuring themselves with the good-looking prisoner. He had an almost physical craving to see Ryan, to be near him. He had no idea how he’d come to need him so much in such a short time, but he did, and there wasn’t a thing he could do about it.He’d always heard the mate bond for their particular pack was strong, because of the family curse, but this was ridiculous.</p><p>He needed to feed Ryan his blood too, and Ryan might not like it too much. The venom lasted for a while, and then it became necessary to feed the mate Lycan blood from the vein. It had been known to happen with new matings, that their mates rebelled against drinking the blood of their wolf, and Ryan was such a stubborn little thing. Perhaps if he resisted too much, the other prisoners would hear it and think he was forcing sex on him. Blayde smiled. As ifhe wasn’t planning on having sex with Ryan as soon as he saw him again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>By the next morning, they had entered the wormhole and could finally relax. All the functions of the ship had been turned over to the computer. Nikolai turned to him with a smile. “Ready for some coffee?”</p><p>Blayde nodded and stood up, stretching. Nikolai was his youngest cousin, only twenty-two, yet he stood taller than any of the others. He was more slender, though still well-built with a lean, muscular frame. Unlike Blayde, Lucas or Kyle, his hair was red, and it was said he took this trait after his human grandmother. Their grandmother had been from the Russian colony on Europa, one of the moons of Jupiter.Nikolai’s great-grandfather, Gunnar, had seen the woman on a voyage to Europa and taken her by force to give to his female mate as a present. At that stage in their history, both male and female Lycans often took pretty humans as companions, or to help them raise their children. Sometimes they took them as concubines. Gunnar had seen the woman and thought she was beautiful. In fact, he lay with her at the same time he impregnated his mate, so that both produced sons, even though it was forbidden to use humans as breeding stock. But then the wild Gunnar had always operated outside the law. The human produced a lovely son, red-haired and handsome, half Lycan and half human. This son was Kyle’s and Nikolai’s grandfather.</p><p>Against all odds, the human and Gunnar’s Lycan mate became good friends, even lovers, but the human female made no secret of her antipathy toward Gunnar.</p> <p>So much so, that Gunnar made a second trip to Europa and kidnapped her handsome twin brother to be his own concubine. Not only was he intrigued by his beauty, but since his mate was really more interested in her lovely human, he was free to indulge his own needs. He would make an excellent concubine, he thought. When the authorities finally caught up with him, the womanhe’d kidnapped was already in love with his mate, and opted to stay with her. The male, whose name was Ivan, was furious with Gunnar, but also attracted almost against his will. He refused to leave his sister and Gunnar behind. It was said, though, he led Gunnar a merry chase the rest of their lives.He’d even cursed all of Gunnar’s offspring.</p><p>“Better fortify yourself with a little caffeine, Blayde.It’s almost time to go down to your mate, though if you’re too busy, I could see to him for you. I’d like to get a closer look at Randy Ryan.”</p><p>Blayde snarled at him.“Don’t call him that.”</p><p>Nikolai laughed, holding up his hands in surrender.“Sorry. I was only teasing, but I should have known better. One of my best friends, Tobias, took a mate last cycle and damn near took my head off my shoulders when I patted his ass and said he had a cute,fat bottom.”</p><p>“Yeah, well, if I see you anywhere near Ryan’s cute, fat bottom I’ll do worse than that.”</p> <p>Still laughing, Nikolai went for the coffee and Blayde stared after him with a murderous expression. Kyle came over to Blayde and clapped him on the shoulder.“Don’t let him tease you.He’s never been in love and doesn’t think it can happen to him.When he does fall, he’ll fall hard, and then we’ll see who has the last laugh.”</p><p>“Fall in love?” Nikolai scoffed, looking over his shoulder.“Never! If I ever do find my mate, I’ll run the other way.I’ve seen too many of this family fall crazy in love and do everything in their power to make their mates happy, even giving up their lifestyle and the things they love. Not me. Especially considering the curse Ivan put on all of us.”</p><p>“You don’t believe that, do you, Nik? He was just a crazy old man at the end.”</p><p>“A damn scary old man is what he was, and yeah, I believe it. Especially in light of...” He glanced over at Blayde and raised his eyebrows expressively with a grin.</p><p>Blayde threw the log book at him.“Fuck you! Like you wouldn’t make love to him if you had the chance.”</p><p>“Well, that’s probably true, but you can’t go by me. I love adorable little humans! Hell, I’ll never settle for just one, though.”</p> <p>“Yeah,” Blayde said sadly. “Seems like I remember saying those same words not so very long ago, and look at me now.I can’t stand to be away from him for even a few hours. I’ve actually got a sick feeling in the pit of my stomach from spendingthe night away from him.”</p><p>Nikolai handed Blayde and Kyle a cup of coffee.“That’s what I’m talking about. No way I’m letting myself in for that.”</p><p>Blayde and Kyle gave each other a skeptical look. Kyle toasted Nikolai with his cup. “Here’s to you, brother, but when it happens, and it will happen, I’m going to be the first to say I told you so.”</p><p>Blayde stood up and stretched, trying to act nonchalant when every nerve in his body was screaming at him to rush below decks to see Ryan.“Guess we should take the food packets down to the prisoners.Make sure they’re okay. C’mon, Kyle.”</p><p>“Let me go with you,” Nikolai begged.“I want to see Rand-uh-Ryan up close.I’ve seen his movies, but they say holo-film never does you justice.If that’s the case, he must be hot stuff.”</p><p>“He’s my hot stuff, so back off.Cousin or no cousin, I’ll gut you like a fish if you mess with him.”</p><p>“Aw, Blayde, I’ll just play a little with your pretty toy.I promise I won’t break him.” He laughed and dodged as the coffee cup went sailing by his head, but followed Blayde off the command deck and down to the galley. They loaded up on food packets for the prisoners, and went down the four levels to the below-decks area of the cells. They passed out the packets to the prisoners in the cells and then Nikolai stepped around Blayde and quickly punched in the code to open the seclusion cell Ryan was in. Looking back over his shoulder at him, Nikolai gave him an innocent little smile.“I’m going to take my turn with him first, Blayde. You’re going to have to settle for seconds today.”</p><p>Blithely ignoring Blayde’s furious glare, he slipped inside and closed the door in Blayde’s face. Blayde heard a snicker behind him and whirled around with mayhem on his face to find all the inhabitants of the cells strangely quiet with carefully neutral expressions on their faces.</p> <p>Blayde leaned against the wall outside Ryan’s cell, waiting impatiently for his turn with his mate and planning how he would kill Nikolai slowly, and with great pleasure.</p><p>* * * Ryan heard the door open and sat up eagerly, hoping to see Blayde walk inside. Instead a tall, handsome man with red hair hanging to his shoulders, and eyes the color of rubies walked in and stopped short as he saw Ryan gazing at him with sleepy eyes.</p><p>“Well, damn. Blayde sure wasn’t exaggerating, you are even betterlooking in person.” He smiled at Ryan’s puzzled scowl and stepped forward with his hand out.“I’m Nikolai, Blayde’s cousin.”</p><p>Ryan held up his cuffed hands with a wry smile. “Nice to meet you, Nikolai. I’m Ryan, but I guess you already know that.” He gestured down at his cuffs.“I would shake hands but I’m kind of tied up right now...”</p><p>Nikolai grinned, dug in his pocket for the keys and quickly unlocked the cuffs from his wrists and ankles, helping him out of them.</p><p>“Where’s Blayde?”</p><p>“Oh, he’s outside. I’m teasing him a little because I know how anxious he is to get in here. I’ve never seen him like this about anybody before, so I’ve been giving him a hard time.”</p><p>Ryan blushed.“Really?”</p><p>“Oh yeah. We’ve both seen all your movies, really good ones, by the way. I mean, for porn they were very well done. Um, that’s not exactly what I meant to say...”</p><p>Ryan laughed.“I know what you mean, and thanks, I think. So you’re Blayde’s cousin? How many cousins does he have?”</p><p>“Well, first cousins, he has four of us.There’s six in all, Blayde and his brother Lucas, Larssen and his twin, Konnor, and then me and my brother Kyle.”</p><p>“Are you all close?”</p><p>“Oh yes. And all alpha males.It’s part of the curse, according to family legend.”</p><p>“Curse? What curse?’ Ryan sat forward, intrigued.</p><p>Nikolai squatted down by the wall and got into his story.“Well, my great-grandmother was sort of kidnapped away from her home by my great-grandfather. Back in those days, my family operated a little, shall we say, outside the law. She was a Russian witch, everybody said, and she stayed with her Lycan mistress for over fifty cycles, but she never forgave my great-grandfather for taking her from her home and her family. She was a sweet old lady by the time we knew her. She made us call her Nanna, and she told us stories.</p><p>He kidnapped her brother too, another witch, or warlock, as they called the males. His name was Ivan. Their family finally came to rescue them, not long after they were kidnapped but by that time she wouldn’t leave. Neither would her brother. She was pissed, though, and never got over it. And Ivan, who was even more powerful than she was, never got over it either. He put a curse on all of my greatgrandfather’s descendants and even on his entire family’s line.”</p><p>“So he cursed children?”</p><p>“No, not exactly. It was more to get back at my great-grandfather. He told him all of his descendants would be alphas, and extremely dominant, both male and female.”</p><p>“Seems a strange kind of curse.” Ryan laughed. “Did it come true?”</p><p>“Oh, yes, and it was truly evil! Alphas can’t share territory,just can’t do it. So that meant all the boys and girls born to the family would never be able to live together in harmony. At least not as rulers of the pack. They would always be fighting among themselves, or else become travelers, unable to settle down.That’s been true too, except for Lucas.”</p><p>“For real?”</p><p>“Oh, yes,Lucas was the only one who ever really wanted to lead the pack, so he’s our pack alpha. The rest of us are bounty hunters, and voyagers. We never really wanted to settle down. But that wasn’t the worst of the curse.”</p><p>“Really? Whatelse?”</p><p>“Well, he said that each of us would know our mates immediately when we saw them and we would have to have them. Have to, like no choice at all in the matter, whether we were ready to have a mate or not.Well, that’s kind of true for most wolves anyway, so he cheated a little on that part of the curse. But with us, it’s even worse. We would know them by their scent and by their looks, he said, and we would fall instantly in love. Painfully and irrevocably in love, so we have to be with our mates at all times or be miserable.You see, Ivan didn’t like being left alone all the time while Gunnar roamed the universe without him. Gunnar had exacted his promise that Ivan never curse him, so he did the next best thing. He cursed all of the descendants.” Nikolai looked Ryan over carefully.“Although if I had a matelike you, I wouldn’t want to leave him anyway, curse or no curse.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ryan blushed again.“You’d better not let Blayde hear you. He’s kind of jealous.”</p><p>Nikolai snorted.“Kind of? He’s a maniac! He’s going to kill me for coming in here first, but I really wanted to meet you. We have to make it look good in front of the other prisoners too, like I’m in here having my way with you.” He stood up and sighed. “Speaking of which, I guess we’d better make it look good.I’ll hit my fist and you shout out, okay? Make it sound good.”</p><p>Nikolai smacked his hand in his fist a few times and then jumped back, startled as Ryan let out a bloodcurdling scream like he was being killed. Ryan screamed out, “No, please stop! Please don’t hurt me!” Nikolai got a wicked grin on his face and smacked his hand again.</p> <p>Another terrified scream and the door burst open and slammed back against the wall. Blayde bounded into the room with murder in his eye, his fangs down and claws descended. He rushed across the room and flung himself down acrossRyan’s body, looking up at Nikolai with fury.</p><p>Nikolai backed quickly away and shut the door of the cell before any of the prisoners could see what was going on. Nikolai came back slowly toward Blayde, holding his hands up in surrender, and speaking softly.“It’s okay, Blayde. He’s fine. See? We were only pretending.”</p><p>Ryan, almost smothered under Blayde’s bulk, was trying desperately to push him off and allow him to breathe. “I’m all right, Blayde.Really. It was all an act.”</p><p>The red haze began to recede from Blayde’s eyes. Embarrassed, he stood up and clenched his fists.“I thought...”</p><p>Nikolai laughed.“You thought I was enjoying myself with your mate.No, Blayde, I don’t have a death wish, no matter how charming your mateis, and he’s very special, I must say. He’s completely untouched by me.”</p> <p>“He’d better be,” Blayde growled. “Get the hell out of here. I’ll be up later.”</p><p>Nikolai left, a shadow of a mischievous grin still playing around his lips. Once the door closed behind him, Blayde turned and held out his arms.“Come here, sweetheart,” he said softly, and Ryan stepped forward into his arms, wrapping himself around Blayde and breathing in his delicious scent.“Are you really all right? It scared meto death when you screamed.”</p><p>“I’m fine. Nikolai was regaling me with stories about his great-grandmother and her brother and the curse.”</p><p>Blayde groaned.“Oh gods, not that again.” He took Ryan’s face between his hands and stared at him for a few moments, then gently kissed him, licking at his lips and pressing his tongue gently inside Ryan’s mouth. “I missed you, baby.”</p><p>Ryan felt himself melting.“I missed you too.”</p><p>“I brought you something to eat, but I can’t seem to let go of you right now.”</p> <p>“It’s okay,” Ryan breathed back at him.“I’m not very hungry.”</p><p>Blayde bent his head and took his lips again, walking him backward toward the mattress and catching him around the waist to lower him to it. With a strong arm around his waist, he hoisted him up to the top of the mattress and then began expertly removing all of his clothes, starting with his pants.“We don’t need these,” he said, easing them down his legs and tossing them aside. He raised his T-shirt over his head and pulled it off.“And this is just in theway.”</p><p>Ryan began to laugh a little as Blayde dispensed with all of his clothing, leaving him naked while Blayde was still fully clothed.“Mmm, I’m going to keep you like this once I get you back home. Clothing is highly overrated for a gorgeous boy like you.Maybe I’ll put you in a thong, like they do with mates back on the home planet.This pretty skin needs to be able to breathe.” He kissed him again and ground his erection into Ryan’s bare groin. The rough material of his pants caused Ryan to shudder and buck his hips a little.Ryan reached for the buckle on Blayde’s belt, but Blayde caught his hands on one of his and took them over his head. Holding him there, heteased Ryan’s nipples with his tongue, then bit them hard enough to make him gasp. He licked at the bites until Ryan was writhing beneath him and panting for breath.</p><p>“Look at you, so beautiful.” He bit gently at Ryan’s nipples again. Ryan squirmed to get away, but he held him effortlessly.“All those men out there imagining what it would be like to lie between these sweet thighs, but no one will ever know for sure. Only me, sweetheart. This is mine.” He moved his hand down to cover Ryan’s cock and move up and down his shaft slowly, rubbing his thumb across the head as he reached it, smearing the pre-cum across the broad head. “Say it, baby. This belongs to you, Blayde.”</p><p>“It does belong to you, Blayde. And you? Do you belong to me?”</p><p>“I’m all yours, baby.” Blayde smiled and released him and pulled at his own clothes until his flesh was as bare as Ryan’s. He fell down beside him and rolled Ryan over on his stomach. Putting a hand underneath him, he raised him up and began to rim him, showing him no mercy as he cried out and gripped the mattress beneath him. He raised up long enough to reach for his pants to retrieve a small tube of lube from the pocket. He smoothed it on his cock and put some on a finger to slowly move it inside Ryan. Ryan looked back over his shoulder at him and there was no hesitation in his glance, just pure need and longing. He turned back over, dislodging Blayde’s finger and surprising him. Ryan climbed onto his lap, and Blayde fell back on his heels as Ryan smiled into his eyes and impaled himself on Blayde’s cock.</p><p>“My turn to be in charge,” Ryan said, looking up at him through his lashes.</p><p>“Gods, yes, baby,” Blayde said, his eyes fluttering closed as pleasure swept over him. “Take me!”</p> <p>Ryan chuckled, but his eyes were dark with need.He moved up and down on Blayde’s cock, holding himself up by his grip on Blayde’s shoulders. “Fuck me, baby,” Blayde said softly and Ryan grinned a feral kind of grin.</p><p>“You do love to talk, don’t you? Shut up, now, Blayde and let me concentrate. I want to love you.” Blayde did as he was told, only raising his eyebrows a littleat Ryan’s tone, but his hands clenched tightly around Ryan’s hips as he proceeded to drive him out of his mind. When it was over and Ryan collapsed in his arms, his ass still impaled on Blayde’s cock, Blayde was speechless for once, breathing hard.</p><p>When they could both move again, Blayde eased Ryan down on his back and lay beside him, spooning him and holding Ryan’s softening cock in his hand.</p><p>“Baby?” Blayde’s sounded soft and dreamy in the little room.</p><p>“Yes?”</p><p>“Uh, I hate to bring this up and get you upset, but you have to feed from me, honey.”</p><p>“What are you talking about?”</p><p>“Well, remember that full disclosure thing you were talking about-about how I didn’t tell you everything?Uh, there may be one other thing I neglected to mention.”</p><p>“Shit,” Ryan said, sitting up and swinging his legs over the side of the mattress.“What now? Am I going to sprout wings and cluck like a chicken?”</p><p>Blayde laughed,“No, but you do have to drink Lycanblood from time to time.” Ryan turned to give him a chilling glare.“Say what?”</p><p>“Just every four weeks or so...”</p><p>“That’s disgusting.”</p><p>Blayde looked hurt.“Disgusting? Really?”</p><p>“Well, duh. Drink your blood!”</p><p>Blayde smiled at the look of horror on his face.“Aw hell, it’s not that bad. They say it tastes good to our mates, actually, and it’s just a little bit of blood.”</p><p>“What!” Ryan got to his feet and paced over to the door. “Fuck that! Find yourself another bloodsucker.Count me out.”</p><p>Blayde got to his feet and warily approached him as he paced.“Now, baby, don’t make me spank you.”</p><p>“Don’t ‘now baby’ me. You can spank me all you want, but it’s not happening. Stay back.”</p><p>Blayde continued to get even closer.“Let’s discuss this reasonably, baby.” He reached for Ryan and pulled him into his arms, but Ryan pushed back against his chest.</p><p>“Leave me alone, Blayde, I’m warning you.”</p><p>“I know. And I’m listening. But this is kind of a requirement, honey.If you don’t drink the blood, you’ll get sick. Look, just try a little of it.If you don’t like it, we’ll figure something else out, okay?”</p><p>“No. I said no, and I meant no.” He wrenched himself out of Blayde’s arms and stomped back over to the mattress to sit down.“Please, Blayde. I hate the sight of blood.I’ll be sick! Stay over there.”</p><p>Blayde frowned and came over to sit beside him anyway. He stayed quiet a long time and then smiling, he put his arms around Ryan.“You know, it probably doesn’t matter what bodily fluid of mine you swallow...I mean, one is just as good as another.”</p><p>Ryan turned toward him with a grin.“Well, why didn’t you say that in the first place? Lie back, Alpha, and let me take care of business.”</p><p>Blayde lay down on his back, propped up on one elbow, watching Ryan with his glowing eyes.Ryan knelt down between his legs and took Blayde’s long, thick cock in his hand. Ryan thought it was the most beautiful cock he’d ever seen, and he’d seen plenty in his day. Looking up in Blayde’s eyes, he slowly licked its length, ending with a swirling kiss on top. Blayde sucked in a hissing breath and closed his eyes, letting his head fall back. Ryan smiled and then opened his mouth to suck him in. Instead, Blayde moved with lightning quickness, biting into his wrist and thrusting it up to Ryan’s open mouth.</p><p>Ryan fell back on his heels and pushed againstBlayde’s arm as hard as he could, but he couldn’t budge it. He could feel the hot liquid filling his mouth, and though he refused to swallow, some of it was slipping down his throat, running down his mouth.“That’s it, baby, open wide. This is for your own good.Now drink, damn it!”</p><p>Blayde’s arm was cutting off his air, his blood was choking him. Finally, Ryan surrendered and took a huge swallow of the blood. Instantly, it seemed, his throat was soothed by the thick liquid, the taste as sweet as honey. Almost against his will, his mouth latched onto the wrist, pulling the elixir close to his lips, refusing to let it go. Why had he resisted? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A lassitude swept over him, and the world became soft and fuzzy around the edges. He seemed to be floating somewhere a few feet off the ground, tethered only by his hold on Blayde’s wrist. He heard Blayde’s voice coming from a distance.“Enough, sweetheart.You’ll drain me dry.” He inserted his finger inside his mouth, breaking the suction with a soft plop and pushing Ryan away.</p><p>Ryan sagged against his knees and was pulled up into his lap. He could feel the searing heat of Blayde’s thighs under his, but couldn’t rouse himself to do anything about it. He felt a soft kiss on his forehead.“Night, sweetheart,” Blayde said. He fluttered his eyelids, but couldn’t seem to open them. Gently drifting, he floated down to sleep.</p><p>* * * Blayde walked onto the comm deck the next day and was immediately struck with the morose expressions on the faces of his brother and his cousins.“What the hell? What’s happened?</p> <p>Lucas spoke up first, glancing up at Blayde nervously. “Blayde, I have to talk to you, and you’re not going to like what I have to say. I pulled some strings and got a look at Ryan’s sealed court files.”</p><p>Blayde’s face was thunderous.“You did what?”</p><p>“Calm down, No one knows aboutRyan’s being your mate. I told my contact on the court that we had concerns about putting an innocent man in prison. I told him Ryan had told us he wasn’t guilty, and I wanted to check out his story.”</p><p>“Damn it, Lucas, you had no right”</p><p>“I said, calm down, Blayde. I’m your brother and your alpha. You swore allegiance to me, remember? I have an obligation and yes, a right, I might add, to make sure you’re safe. We can’t just take Ryan’s word for it either. Since when do we believe a convicted murderer is innocent just because he says so?”</p> <p>Blayde stood with a mutinous expression on his face.“Since I took him as my mate! What if he is guilty, Lucas? What the fuck can I do about it?I’ve already made it clear to you, I thought, that I won’t leave him. I won’t take him to that fucking prison.”</p><p>“I’m not asking you to, Blayde. I’m just asking you to listen to me for a minute.”</p><p>Kyle motioned him over to a chair.“Sit down, Blayde, please. Lucas has something he needs to tell you. We know how you feel about Ryan, and nobody is asking you to leave him, but you deserve to know the truth.”</p><p>“I can’t leave him, damn it, even if I wanted to, which Idon’t.Can’t you all get that through your thick heads?” Blayde kept the furious expression on his face, but he did cross over to sit beside Kyle.</p><p>Lucas leaned forward intently.“Blayde, you have to consider the idea that Ryan may have lied to us when he told us what happened.I know you don’t want to believe that...”</p><p>“No, and I don’t believe it. Ryan wouldn’t lie to me.”</p> <p>Lucas glanced over at Kyle and Nikolai and then back at Blayde. “Blayde...we have proof that he did.”</p><p>“Bullshit!” Blayde jumped to his feet.“I’m not listening to any more of this!”</p><p>“Damn it,Blayde, sit down!” Lucas’ voice was firm and had a tone in it that demanded obedience. Blayde frowned at him but sat back down, still glaring at all three of his relatives.</p><p>“What kind of fucking proof do you have?”</p><p>“My contact sent us a vid file. It’s the same one used in the courtroom to get the guilty verdict in absentia on Ryan. It was enough to convince the court, and I have to tell you, it convinced me.”</p><p>“And JudgePartland couldn’t have doctored a vid file?C’mon, Lucas, you know better than that.”</p><p>“It wasn’t just that file, Blayde. Partland also produced eyewitnesses. Not just his own men, but some of the other actors Ryan used to work with. Two of them were in the hotel suite at the time of the murder.”</p><p>Blayde looked confused.“Ryan said only he and the boy who was murdered were there with the judge.”</p> <p>“I know that’s what he said, but it wasn’t true. Partland provided corroborating testimony from the boys themselves, the hotel staff, even video files from hotel security. Ryan was lying to us, Blayde.I’m sorry, but it just didn’t happen the way he said it did. I’m afraid Ryan may have murdered that other boy.”</p><p>Blayde was silent for a long moment, his only sign of distress a nerve twitching in his jaw. “Let me see the vid,” he said in a quiet voice.</p><p>Lucas nodded at Kyle, who picked up a small remote device and pressed a button. A small screen shimmered into the air in front of them. Kyle pressed another button and the screen lit up with a somewhat grainy, but still clear film clip. A young man, around twenty cycles of age, with dark hair and a small goatee knelt at the feet of a tall, handsome middle-aged man Blayde knew to be Judge Partland from the many times he’d seen him on his media screen. Both men were naked.The judge put his hand tenderly on the back of the boy’s head and said something to him. There was no sound, but the judge was smiling, and the boy smiled back up at him. Two other young men stood around them, as if waiting their turn.</p><p>Suddenly a man dressed in jeans and a white shirt came into the shot and pulled viciously at the shoulder of the kneeling young man. He threw him down on his back and then practically fell on top of him, straddling him. He glanced toward the camera, yelling something, and Blayde clearly recognized Ryan’s handsome features, twisted with rage. He turned back to the young man and put his hands around his neck, choking him. Though the other men standing beside him attempted to stop him, Ryan threw them off andthen smashed the young man’s head against the marble floor twice in succession. He jumped up and backed away as the judge stumbled forward , reaching for the young man, his face a mask of horror. Ryan backed slowly away out of the frame. The film ended with a chaotic scene of the judge trying to give the injured man mouth-tomouth resuscitation as people ran to the phone to call for help. Kyle switched it off and the four of them sat quietly, not looking at each other.</p><p>Nikolai put a hand on Blayde’s knee, but Blayde pushed him away impatiently and got to his feet. His face was set and grim as he started to walk toward the lifts.</p><p>“Where are you going?”</p><p>“To see Ryan!I’m going to find out why hetried to make a fool of me.”</p><p>Nikolai and Kyle both jumped up to grab his arms, and Lucas snapped at him.“No, Blayde! Don’t go to him like this. You’ll hurt him, and you’ll never forgive yourself.”</p><p>Blayde shrugged both his cousins off him and turned to shout at Lucas.“Don’t tell me what to do about my own mate! I would never hurt him! But I’m going to get the truth out of him. He’s going to learn never to lie to me again!”</p><p>Lucas stood up and faced him, his features stern.“When you mated with Ryan, he became a member of our pack and now he’s under my protection. I forbid you to deal with him while you’re so upset.”</p><p>Blayde turned away and threw himself back down into his seat, but he turned an angry face toward his brother.“You forbid it? Don’t try to get between me and Ryan, Lucas. I’m warning you!”</p><p>“Leave this until morning, Blayde. You’re exhausted and so is he, I’m sure. Try to get some sleep and in the morning, we’ll try to sort all this out.”</p><p>Reluctantly, Blayde nodded. It was true, he was exhausted.They’d worked late the night before getting the ship into outer space and finding the wormhole. He’d only had a few hours’ uneasy rest away from his mate. He moved slowly down the corridor to his quarters and fell onto the bed, not even bothering to get undressed. He was heartsick and uneasy, finally falling into a troubled sleep.</p><p>The next morning, he overslept a little. After a quick shower, he pulled on his clothes and hurried to the comm deck. The others were already there and Lucas handed him a hot cup of coffee.“Are you ready to speak to him?”</p><p>Blayde nodded. He’d done little else than think of him all night. He badly wanted to see him, to hear his voice.</p><p>Lucas turned to Nikolai and Kyle.“Go get Ryan and bring himhere.”</p><p>Blayde jumped back to his feet.“No! Don’t youtouch him!” Hair sprouted on the back of his neck and his fangs descended. He leaped toward his cousins, but Lucas was there before him, catching him around the shoulders and pushing him back halfway across the room.</p><p>“Stop it! They won’t hurt him or even touch him more than is absolutely necessary. You’re not thinking straight when it comes to him. Now sit down over there and let them bring him in here! You’re too emotional when it comes to Ryan, and youcan’t be trusted around him right now.”</p><p>Nikolai hesitated and then spoke up urgently to Lucas.“Why don’t we take him out now? This would be a perfect time, and no one will even know about Blayde’s connection to him. I know it’s a change in plans, but with this new turn of events, Blayde can’t be trusted not to tip our hand.Kyle and I can pretend to kill him right now and bring his body up here.”</p><p>“Don’t you dare harm him!” Blayde said in a voice that sounded like a growl, his face red and blotchy with anger.</p><p>Nikolai glanced over at him.“Give me some credit, Blayde. I would never harm your mate. We’ll bring him to you.”</p><p>Instead of sitting down, Blayde prowled restlessly around the room as Nikolai and Kyle left to get Ryan. After a few moments, he seemed to get himself under control. He turned back toward Lucas, who was watching him closely.“What the hell am I supposed to do about this, Lucas?I can’t take him to prison,I won’t.”</p><p>“No,” Lucas said, shaking his head.“The pack takes care of its own.He’ll be taken back to Lycanus 3 and then we can decide what to do with him. I think you already know he can’t be allowed to go free until we settle this.If he admits it, then we’ll deal with it. Intensive training, rehabilitation. Maybe psycho-therapy. Judge Partland testified he was on drugs when he murdered that boy, so his mind may have been clouded. The judge said Ryan and the boy were lovers, Blayde.”</p><p>Blayde shot him a fierce glare and turned his head away, waiting tensely for Ryan to be brought to him. Despite his fury at the idea his matehadn’t trusted him enough to tell him the truth, he still had a physical craving to be near him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I need to talk to him,though I don’t know what to believe anymore. I can’t believe Ryan would do something like that. And no matter what you say, Idon’t trust Partland not to have faked the vid and lied about everything. I won’t be separated from Ryan. If Ihave to, I’ll take him to Lycanus. We can start over there, and no one could touch him.”</p><p>“Blayde, I’m sure he can be rehabilitated, especially if he was on drugs when this happened. Let the pack help you. You can’t give up your own life.”</p><p>“Lucas, he is my life now. I told him once that I would try to rehabilitate him. Try to help him somehow, but if hewon’t trust me, I can’t help him. I don’t know what to do.”</p> <p>Lucas walked over to put a hand on his shoulder.“I’m sorry, brother. I’ll do anything I can to help you, you know that. You just have to tell me what you need.”</p><p>“I don’t know yet. I need to talk to him, to see him. No matter what he’s done, he belongs to me.”</p><p>Chapter Six</p><p>Ryan was dreaming of the past. He and Blaine were in the hall closet, deep behind the musty-smelling clothes, hiding from Aunt Betty. Blaine was crying, so Ryan wrapped an arm around him. A nervous boy, two cycles younger than Ryan, with thin shoulders, Blaine curved inward when he was trying to hide inside himself, like now. Ryan whispered to him to stop crying, Aunt Betty might be able to hear him. Suddenly the door flew open and Aunt Betty was reaching for them, her cruel fingers pinching and pulling at their scrawny arms.</p><p>With a start, Ryan sat up in bed, gasping. It took a moment before he realized where he was so he could try to catch his breath and calm down. His stomach burned and ached, and he rubbed it absently.Something was wrong, but he couldn’t figure out what it was. Blayde would be down to see him soon, he was sure of it. The nightmare had been bad, but it was only a dream, he reminded himself firmly. He heard a noise at the door and his heart leaped in anticipation. Blayde must be coming.</p> <p>The door swung open and banged against the wall. Nikolai and Kyle stood there looking at him with undeniable disapproval on their faces.</p><p>“What is it? What’s wrong?” Ryan had a strange feeling that something was terribly wrong as he looked at the two huge men. Their faces were grim and unsmiling, their posture stiff.“Is it Blayde?” he asked nervously, sudden terror gripping him. “Has something happened to Blayde?” Confused and scared, he jumped to his feet and would have run out the door to find Blayde if Nikolai hadn’t caught his arm and pulled him firmly back.</p><p>“We’ll take you to him, Ryan. He’s fine, don’t worry.”</p><p>“Then why are you looking at me like that? Something’s going on! Tell me!”</p><p>“Calm down,” Kyle said harshly. “He told you we’ll take you to Blayde. Everything will be explained when we get there.”</p><p>Ryan looked up at the two men in confusion. Neither of them had ever spoken to him with anything but politeness, even kindness. Now there was a steely coldness fairly radiating off both of them, chilling and frightening him.“I want Blayde!” Ryan cried out, backing away from them.“I won’t leave with you until he says so.”</p> <p>Nikolai thinned his lips and stepped closer to him.“I don’t want to hurt you, Ryan. Just come with us peacefully, and I won’t have to touch you. You know Blayde wouldn’t like it.”</p><p>It was true—Ryan knew that Blayde had acted with alarm and anger whenever either of his cousins had put their hands on him. He nodded his head slowly and took a deep breath. He walked slowly over to them and followed their gestures to precede them to the door.“Blayde’s waiting for you just outside beyond the corridor, Ryan.Go to him.”</p><p>The second he hit the door, the men in the other cells started up their catcalls, but he didn’t feel as full of bravado without Blayde behind him, so he kept his head down and didn’t respond to their hoots and whistles. Nikolai stepped to the door and gestured toward the far door opening to the corridor.“Go ahead. Go to the door.”</p><p>Ryan’s need for Blayde was more like a hunger now, and he heard himself whining softly. He’d never heard himself make a sound like that before. The pains in his stomach were worsening, and he was getting more and more afraid, but he stood up straight and tried to make himself stop making the whining noise. Something was wrong. He could feel it. One of the men, Scarface, he thought, yelled what sounded like a warning to him. He turned and looked behind him and saw that both Kyle and Nikolai had their guns leveled at him. Shocked, he turned and tried to run to the door. He had to get to Blayde.</p><p>The men in the cells were screaming, and he felt something hit him hard in the back. He fell to his knees, but kept crawling toward the door. Something slammed into him again, this time on the back of his head, and the floor came up to strike him in the face. He wasn’t quite unconscious, still vaguely aware that Nikolai and Kyle had come up and taken him under each arm and were dragging him out the door. He couldn’t move or quite get his eyes to focus, but he could hear everything around him. They took him out in the corridor and hoisted him up over a shoulder. Not supposed to touch me, Ryan thought. Blayde will be so angry.</p><p>He drifted in and out of consciousness for a long time, aware only of movement. He heard someone shouting, “Give him to me!” and then he was lying somewhere soft and safe. It was okay. He could relax now, he thought, and drifted down to sleep.</p><p>He awoke maybe a few minutes later and slowly looked around himself. He couldn’t seem to move, but he was mostly awake, except for the fact he couldn’t get his eyes to open more than a slit. He tried harder and got them open just a little more. He was lying on a leather lounge in a big room. There was a huge window in front of him, showing open space, with screens and complicated looking navigational devices around the room. Blayde was sitting beside him, arguing loudly with Nikolai and Kyle.</p><p>“Did you have to shoot him twice? I swearI’ll kill both of you if anything happens to him.” Another man, Lucas, Ryan thought, spoke from outside his range of vision. Ryan still couldn’t move his head, and remembered the two shots that had been fired at him. Must have been from stun guns, he thought tiredly. They had a paralytic effect. Ryan decided to stay still and listen to see if he could figure out what was going on.He concentrated on Lucas’ voice again.</p> <p>“... will be all right in a few minutes. His pulse is already stronger, and I think I saw his eyes twitching a few seconds ago.”</p><p>Ryan felt Blayde’s lips on his face, kissing him all over.“I’m here, baby. Wake up and look at me.”</p><p>Ryan opened his eyes and looked into Blayde’s beautiful sherry-colored ones. He was very close, his face right up next to his.“Hello, sweetheart. Can you speak to me? Blink once for yes and twice for no.”</p><p>Ryan slowly blinked twice and Blayde ran his hand along his cheek.“It will wear off in a few more minutes, sweetheart.Just hold on.” Ryan felt himself being gathered up in Blayde’s arms and Blayde sat down with him in his lap, gazing down at him.“Nik and Kyle shot you with a stun gun to make the other prisoners think they’d killed you. It’s over now, sweetheart.I’ll take you back home to Lycanus3.”</p><p>Ryan nodded ever so slightly, and Blayde smiled down at him. He heard Lucas issuing orders next to him.“See to it the other prisoners see the so-called body disposal on the closed circuit monitors.Do you have the fake body ready to dispose of?”</p><p>“Yes, Alpha.How does this look?”</p><p>Ryan could just turn his head enough to see Kyle hold up what looked like a couple of long duffle bags, wrapped in a black, plastic cloth, tied at what could have been the neck, the waist and the feet of a body. It did look remarkably like a body from a distance. Kyle carried the bundle over to disposal chute and then stepped back. He stood at a parade rest stance and Lucas turned on the camera.</p><p>“Prisoners,” Kyle said. “These are the remains of Ryan Henderson, who unfortunately died of his injuries after trying to escape. We will now dispose of his body, and may the gods have mercy on his soul.”</p><p>He touched a button and the bundle shot out into open space. Ryan felt a chill go through him and Blayde pulled him closer to his body, cradling his face against his chest. Lucas turned off the camera and came over to sit beside Blayde. Kyle and Nikolai drew near also. Ryan began to feel very intimidated as they all stared at him, but he found he could move again, and struggled to sit up in Blayde’s lap.</p><p>Blayde allowed him to sit up and moved so that he could sit next to him on the lounge, keeping a hand at his back for support.</p><p>Ryan found his voice and it came out hoarse and full of anger.“Why didn’t you warn me what was going to happen?You scared me to death.”</p><p>“We wanted you to look scared,” Kyle said. “Made it look more realistic.”</p><p>“I’m an actor, asshole. I could have played the part.”</p><p>Kyle took a step forward in anger but Nikolai pushed him back.“Don’t do it, Kyle. Blayde would defend him and one of you will wind up dead.He’s not worth it.”</p><p>Stung, Ryan looked sharply at Nikolai.He’d thought they were becoming friends. Blayde’s jaw tightened at the words, but he kept quiet. Ryan looked around at the Lycans in confusion. “What is it? What have I done?”</p><p>“You mean besides lying through your teeth to our cousin? Involving him in your schemes and risking his safety?” Kyle stared down at him, a look of disgust on his face.</p><p>“Ryan,” Lucas said quietly. “We only want to help you. We know you’re Blayde’s mate and he loves you very much.You’re a part of our pack now,” he looked at Kyle and Nikolai, “and it would be appropriate for everyone to remember that. But we have some new information that is troubling to us.”</p><p>Blayde spoke up.“Ryan, we know what really happened that night in the judge’s hotel room.We’ve seen the vid of you killing that boy, smashing his head down on the marble floor. It’s no use lying anymore.”</p><p>Ryan flushed painfully.“It’s not how it looks, Blayde. Let me explain.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Go ahead. But pleasedon’t lie to me again, Ryan.”</p><p>“I’ve known Blaine since we were just kids. We were in the same foster home for three cycles until the state took us out.” He looked up at Blayde pleadingly.“You have to realize how it was for us. The woman there abused both of us, but mostly Blaine. When the state took us out, I got lucky and was sent to a nice family, but Blainewasn’t so lucky. He was abused again and again until he turned eighteen and got out of the system.That’s what he told me, and I believed him.”</p><p>“Did the two of you keep in touch?” Lucas asked.</p> <p>“No, we met again by chance in New York, when we were both doing the films. We couldn’t believe it at first. Who would have thought we’d wind up back together again, and making movies? It seemed like fate, and we made a promise to always try to take care of each other.” Ryan grabbed Blayde’s hand. “I could never hurt him, Blayde. You have to believe me.”</p><p>“Go ahead, baby. Tell us.” Blayde still looked stern, but began rubbing his arm to comfort him.</p><p>“After a while, Blaine got a new boyfriend, he told me, and he was somebody important. When he finally told me it was Judge Partland, I was worried, because I’d heard other boys say he was abusive.I tried to warn him, but he said Partland loved him, and he wouldn’t listen to reason.”</p><p>“On the night he died, he asked me to come with him to the Judge Partland’s house, and make the film I told you about.I didn’t go with him; I had to work late. By the time I got there he was acting funny. He was drunk, messed up on something.I think they’d put something in his drink, butI didn’t understand that then. I got mad at him, tried to get him to leave with me, but he wouldn’t go. He yelled at me. Said I was trying to take Partland away from him. He was acting crazy, doing and saying things he never would have done in his right mind. I left, but I couldn’t stand it and I went back for him. When I got there, the judge had him on his knees in front of him, and he was ready to do a scene in front of all those men. Blaine would never have done that if he hadn’t been messed up.”</p><p>“Is that when you attacked him?” Nikolai asked.</p> <p>“I didn’t! I went over to him and jerked him away, and he fell on his back. They just kept filming.I yelled at them to stop, but they wouldn’t. I admit I pulled him away from the judge and got on top of him to keep him there, andI might have been too rough, but I didn’t mean to hurt him. He hit his head, but he was alive—I know he was! He was breathing hard and his face was all red, but he looked up at me and told me to go away. I begged them to call for an ambulance, but they wouldn’t. They just stood there looking at me. They told me to get out and not come back. I was angry and I justleft. I shouldn’t have left him there, no matter how angry I was. But I didn’t kill him, Blayde! I know youdon’t have any reason to believe me, but...”</p><p>Kyle made a short sound of exasperation and glared down at him.“Ryan we saw you on film smashing his head on the floor several times.”</p><p>“But I didn’t! Yes, I was there, I admit it.But I didn’t do that! The judge must have faked the film.”</p><p>Blayde shook his head.“I don’t know what to believe anymore.” He passed his hand over his face and looked totally exhausted.“We’ll be landing later today at the Omega 9 moon. I need to think about all this. You have to hide for the rest of the day, anyway. Nikolai will take you, and I’ll talk to you after we transfer the prisoners.”</p><p>Nikolai came over to him and jerked him to his feet. Blayde frowned, but never said a word about his rough treatment. Ryan felt suddenly all alone in this thing. Abandoned by the one person he thought really might love him.</p><p>“Blayde, you have to believe me.”</p> <p>Blayde turned away, shaking his head.“Please take him to his hiding place for the landing, Nikolai.Make sure he’s comfortable. I’ll be in to check on him after we get through with this.”</p><p>“No!” Ryan jerked his arm away from Nikolai. “Let go of me. I want to go to Omega 9. I don’t want to stay here with you! None of you believe me? Well, fine.I’ll go to prison—it’s better than staying here with you.”</p><p>“I don’t remember giving you that option,” Blayde said grimly. “Take him, Nikolai. I’ll be in to see you, Ryan, when I get back from Omega 9.We’ll talk then.”</p><p>Nikolai pulled him along, and Ryan went with him, defiantly casting resentful, accusing glances back at Blayde and the others. He allowed Nikolai to take him to the tiny storage bin and lock the door. It was warm inside and there was a small light he could turn on and off. He had a soft mattress to sit on, magazines to read, even a portable toilet set up in the side of the small room. Water and food packets and even snacks were stacked up for him near the door, in case he got thirsty or hungry. Everything had been done to ensure his comfort, but Ryan was still locked in, and he was sunk in misery.</p><p>He felt as if Blayde hated him now, and wassorry he’d ever met him. Who could blame him?Now that he’d had a little time to process what felt like Blayde’s rejection, he knew he had no one to blame but himself. Ryan had done nothing but lie to Blayde since the beginning. He was telling the truth now, but Blayde didn’t believe him. It was simply too late.</p><p>Why had he told such a stupid lie to begin with?He’d been afraid to admit he was even there that night, that’s why. He hadn’t trusted Blayde with the truth, and now he had to pay the price.Of course, he hadn’t really known Blayde then, and Blayde had played him at the auction. He didn’t, at that time, have any real reason to trust Blayde. There had been time, since then, when he should have confessed, though, and he was kicking himself because he hadn’t. His mind in turmoil, he didn’t even know how he should feel about the situation anymore.</p><p>Somehow the judge had faked the file. Ryan was sure of it. He had enough money to do pretty much anything he wanted to do, but Ryan despaired of ever getting Blayde and the others to believe him at this point. Ryan closed his eyes. No use fighting it. Just like when he was a kid. He may as well stop trying, less chance of getting hurt that way. He had a long history of beginning to trust people with his heart, only to have it flung back in his face. Just like when he was a kid in all those foster homes. He sat with his back against the wall, curled into himself and quietly went to pieces.</p><p>* * * Blayde looked over at Lucas as Nikolai took an unresisting Ryan out of the room. How could he still love the beautiful little human so much? He was a murderer, a liar.Wasn’t he? Blaydedidn’t know, but he did love him, and it seemed there was no way around it.“Did you have the lie detector on him as he spoke?”</p> <p>“Yes,” Lucas said.“It was tracking him the entire time he told his story. He was telling the truth, so far as he believes it.”</p><p>“Then Partland somehow faked the film.”</p><p>Lucas sighed.“Hard to know what the hell is going on.It’s just possible that Ryan was drugged too, so heavily drugged that he doesn’t even know what happened. We have to get the film the court sent us to an expert to see if it was faked. In the meantime, we have to assume that either Ryan was drugged or he has something wrong withhis brain or his mind.”</p><p>Blayde felt alarm and cold fear race through him.“You think he could be sick?”</p><p>“I don’t know, Blayde. I think it’s a possibility. We’ll have doctors check him out when we get him home.”</p><p>“All right. Good. Do you think I should go with Nikolai? Maybe I should just check on him?”</p><p>Lucas smiled sympathetically.“Nikolai will be back in a minute. No need to get Ryan upset again.Let him rest and let’s go take care of the prisoners before we arrive.”</p><p>Blayde nodded uneasily and went with Lucas to get the prisoners ready for transfer. The next hours were taken up with the arrival on the planet, the transfer of the prisoners and endless paperwork on the death of the prisoner en route. When he finally made it back to the ship, it was the next day.Worried he’d left his mate alone too long, even though Lucas had remained behind and was monitoring him, he told Nikolai and Kyle to get the ship in flight and hurried to the concealed storage room where they’d hidden Ryan.</p><p>Blayde unlocked the door and found Ryan sitting on the mattress, leaning against the wall. He had dark circles under his eyes, and he needed a shave. He looked tired and sick, his eyes burned out, yet he was still achingly beautiful, like a debauched angel.</p><p>Blayde forced himself to keep his voice calm and even.“I’ve come to take you to my quarters.We’re leaving the prison moon and are on our way back to Lycanus 3.”</p><p>“I’m not going anywhere with you.”</p><p>A spark of irritation lit Blayde’s anger, but he leaned casually against the door frame.“Now that’s where you’re wrong, Ryan. You can walk on your own two feet, or I can carry you. But make no mistake, you’re going to my quarters and to my bed.”</p><p>“So you’re just like this great-grandfather Nikolai told me about. You take whatever you want and the hell with what I want. No wonder his matecursed him and all his descendants.”</p><p>“That’s right. The sins of the fathers...for my own sins, I guess I get to have you as my mate.”</p><p>Ryan’s eyes widened in pain. The cruel remark had hurt him, and Blayde felt a sharp jab of remorse. His mate could be ill. Or he could be telling the truth. Ryan was only striking out because he felt insecure and abandoned. What was his excuse? Blayde had made Ryan feel abandoned, and he knew he had to fix things between them.</p><p>“What do you want from me?” Ryan asked quietly, his voice full of anguish. He dropped his head into his hands.</p><p>“I thought I made that clear, baby. I want you in my bed. Now. We have something to settle between us.”</p><p>Ryan got to his feet and came slowly toward him, his gaze rebellious. For a long moment he stared defiantlyinto Blayde’s eyes. Blayde knew it was just bravado, to hide the hurt he was feeling. He also knew Ryan was about to fly apart, and he had to find a way to help him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Blayde took him by the wrist and pulled him down the corridor to his quarters. Once inside the door, Blayde gestured toward the bed.“Take off your clothes and lie on the bed. Spread out your arms and your legs.”</p><p>“Fuck you,” Ryan said sullenly.“You can force me to do pretty much anything you want me to, but what will that prove?I’ll only hate you for it. Is that what you want?”</p><p>Blayde stared down at him. It was true what Ryan said. He would hate him if he tried to force him in his current mood. The times before had been playful compared to this. Before they were playing a kind of sexual domination game, but this was for real. Blayde knew that how he acted toward his mate in the next few minutes would set the tone for their future together, but not only that. His mate was in emotional distress, and he had to find a way to keep him from losing it.</p> <p>“I don’t want to force you to do anything, Ryan. I want you to trust me.Maybe I haven’t given you much reason to trust me up to now, but I want you to. I want to be your best friend, as well as your lover. The one you can come to with your problems, just like I want to bring my problems to you. I said something cruel just now because I was lashing out at you, and that was wrong. I hope you can forgive me. I love you, baby, and I’ll never leave you. I’m proud to have you as my mate. You’re the best thing that ever happened to me, and I trust you with my heart. Won’t you trust me with yours too?”</p><p>Ryan didn’t answer him, but Blayde could tell he was moved by what he said.Ryan’s eyes darted up to his and then away. Blayde pulled Ryan into his arms and brought his lips to his gently.“That’s it, Ryan. Let me love you. You look so broken. Let me put you back together again.”</p><p>Slowly, almost as if he was testing Blayde, Ryan nodded and obeyed him, throwing down his clothing by the bed and then crawling up to lie on his back, his eyes wary and guarded, waiting to see what Blayde would do.“I-I feel out of control, Blayde,” he said, with a sob catching in his throat.“I don’t know what to do—my life is so fucked up!”</p><p>Blayde quietly retrieved a few lengths of soft leather strapping from the cabinet built into the wall and approached the bed. He showed them to Ryan, and then keeping eye contact with him, Blayde spoke softly to him.“I know what to do, sweetheart, and it’s not fucked up. I want to help you. Just trust me, because you need this. Now give me your wrists.”</p><p>Ryan’s eyes grew larger and he flinched in fear. Blayde remembered thatwhen they’d first talked on the holo-cam, he said one of his limits was no bondage.Yet when he’d cuffed Ryan back home, he’d seemed to enjoy it. Blayde knew he needed to regain his confidence, so he decided to take a chance.“You know I won’t hurt you, sweetheart. No matter whatyou’ve done or haven’t done, I love you. Trust me enough to give me your wrist.This isn’t about punishment. This is about trusting me. Knowing I only want to bring you pleasure.”</p> <p>Slowly, tentatively, Ryan held out his arm and Blayde quickly buckled one end of the strap around his wrist and then the other end to the bedpost.He did the same with Ryan’s other wrist and then looked down at him again.“Now your ankles.”</p><p>As he fixed the strapsaround Ryan’s ankles, he spoke softly to him. “You have to trust me, baby. You have to know that I will do onlywhat’s best for you. I have no wish to hurt you. You told me you didn’t like to be bound, but I think you do. I think it excites you. If I’m wrong, you only have to say the word and I’ll release you. You have to trust me to know what you like and know that I’ll make it good for you. You have to let me take care of you and give up that control of yours. It made you lie to me, and it drove a wedge between us. But there can’t be any barriers between us. Do you understand? If you can trust me to do this, then you can trust me with anything and know I’ll never take advantage and never hurt you.”</p><p>Ryan nodded, and his beautiful eyes stayed on Blayde as he lifted his ankle. Blayde took it in his hand and secured it. He put one hand under Ryan’s back, and pulled up the leg so he could wrap it with a longer strap to the same bedpost as his wrist. He followed suit with his other leg. Ryan’s delectable ass was now pulled up off the bed slightly, his legs wide open, exposing his tightly puckered pink hole, making him seem extremely vulnerable and helpless. Despite his position, his cock was rigid and pointed toward his face. Blayde slipped a pillow beneath his back for support.</p><p>“I’m going to make love to you, darling. Do you want me as much as I want you?”</p><p>Ryan bit his lip again, but nodded ever so slightly.</p><p>“I’m sorry, honey, but you have to tell me.Do you want me to make love to you?” “Yes!” Ryan said, his voice harsh with passion and need.</p> <p>“Good, sweetheart. Together we can find out what you like and what you need. I want to give you everything you need, so you’ll never want anyone else.” Blayde took off his clothing slowly and sensuously, seeing Ryan watch him, knowing it was making him want him more and more, but Ryan was trembling, not liking being secured with straps and perhaps feeling too vulnerable. He started crying, tears running down his cheeks.</p><p>Immediately, Blayde came forward and stroked his cheek.“If you want these off, all you have to do is tell me.Are you still okay?” Ryan bit his lip, but he nodded. Blayde climbed on the bed and took Ryan’s balls in his hand, cupping them and handling them gently. The crying stopped and Ryan’s cock stiffened again. Blaydelooked into Ryan’s eyes and Ryan dropped his gaze, giving him his submission. Blayde wanted him so badly, he had to force himself to take it slowly.He took some lube from the table next to the bed and spread it soothingly over Ryan’s hole, and his own cock, now dripping with pre cum. He gently inserted a finger to stretch him, giving him time to get used to it before inserting a second finger. As Ryan tightly closed his eyes and began to open for him, Blayde kissed the insides of his thighs, running his tongue down each of them all the way to his groin. Ryan hissed his pleasure.</p><p>Finally, when he had Ryan ready, he eased the tip of his cock into Ryan’s tight hole, pushing in until he reached his prostate and giving it a good rub with his cock.Ryan’s eyes rolled back in his head and he cried out. Blayde leaned between his legs and kissed his lips, nudging them apart with his tongue. Ryan opened to him completely, relaxing the tension in his body, offering up everything he had, and Blayde exulted at the change he felt in him. His darling mate finally trusted him, completely giving his submission to him, with no hesitation, no resistance.</p><p>Blayde thrust his cock in all the way to his groin, again and again, setting up a rhythm that made Ryan lift his hips up in invitation.Ryan’s tight passage clamped around Blayde’s cock, spreading heat and passion through every nerve in his body. He pumped harder, reaching for Ryan’s sweet cock and pumping it in time with his own. They came together explosively, his seed pumping into Ryan as Ryan screamed his pleasure and shot semen into Blayde’s hand. Blayde stroked him dry, reveling in his release, and the look of heat in his eyes. He leaned forward again, Ryan’s cock still in his hand and kissed him passionately, leaving Ryan in no doubt how much he loved him.</p><p>Finally, when they both needed to breathe again, Blayde pulled reluctantly away, stroked Ryan’s cock one more time and slipped the ropes off his ankles. He pulled the pillows out from under him and untied his wrists. Then he took Ryan in his arms and kneaded the muscles of his shoulders and back, whispering Lycan love words to him, knowing he may not understand the words, but he would respond to the tone. Ryandid respond, nuzzling his nose into Blayde’s neck and crying softly again.</p><p>“I-I thought you hated me. I thought you were sorry you made me your mate.”</p><p>Blayde pulled away and gazed down at him.“Hated you? Never, baby. I was disappointed, and I felt likeI’d failed you by not giving you enough reason to trust me to tell me the truth. I rushed you, I know that now. Tell me, darling, one last time. The last story you told me, was it the truth?”</p><p>“I swear it is, Blayde. Every word was true. I lied to you at first because I was afraid you might take me to prison. I know I should have been honest, but I was scared. I meant to tell you, eventually. II just wasn’t sure if I could trust you not to send me away.”</p> <p>“I believe you, baby. At least,and please don’t be angry at this, I believe that’s what you think really happened. It may be just as you say, and we need to find out for sure. If we find out that the vidthey sent us wasn’t faked, then I think they must havedrugged you, or there’s something else going on, maybe inside your mind.If Partland faked it, I’ll never rest until we clear your name. If I have to choke the truth out of the son of abitch, I’ll do it. Whatever it is we’ll face it together. All right?”</p><p>Ryan nodded and wrapped his arms around Blayde’s neck again, then crawled up into his lap and wrapped his legs around his waist. Blayde sat that way with him for a long time, his cock nudgingRyan’s creaseuntil Ryan’s breathing became slow and steady, then he lowered him to the bed and lay beside him, turning him around and spooning him. Kissing the back of Ryan’s neck, Blayde let sleep take him too, relaxing his tension for the first time in several days.</p><p>Chapter Seven</p><p>Ryan stood in the kitchen of Blayde’s house, preparing a meal in the processor. They’d been home for two days, and things between him and Blayde were good. Blayde had been kind and thoughtful toward him, and the sex between them was amazing. Blayde had brought over a doctor the day before who had examined him carefully with his scanner, and pronounced him healthy. That morning a human psychiatrist Lucas had flown in specially to see Ryan had come in, asking Ryan a lot of questions and even hypnotizing him after asking his permission.</p><p>The door opened and Blayde walked in, came over to him and kissed him for a long time, bending him back over his arm until he struggled for release, laughing and shoving at him.</p><p>“I got the psychiatrist’s report, sweetheart, and he says you’re perfectly fine. He said you still have a few lingering issues over your childhood, but considering how traumatic it was, it would be odd if you didn’t. All those foster homes.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, the last one wasn’t so bad. I stayed there for several cycles and I still keep in touch with those foster parents. A few before that were pretty bad though. One of them was where I first met Blaine.”</p><p>“I know. Since the doctor also gave you a clean bill of health, then the problem has to be with that film Partland sent to the court.It has to be a fake.”</p><p>“Like I tried to tell you, Partland has the money to get almost anything done.”</p> <p>“That’s just what I told Lucas. But even if we can prove the vidis a fake, it won’t solve the real problem. We’d need to get Partland to confess,or he’ll squirm out of it. He’ll say we doctored it ourselves or something. No, I don’t think we’ll ever get any justice with him, baby, but we can try to help our own situation.”</p><p>“How can we do that?” Ryan asked.</p><p>“By talking to the Lycan ambassador and having him grant you asylum. We could go to Lycanusitself, but Lucas knows the ambassador on Earth really well, and we’ll have less problems getting him to do it.”</p><p>“What good will that do?Can’t you just go on with your life and let me be a part of it? I’d like to travel with you, help you with your work.You could show me how to do that.”</p><p>“I’d love that, baby, but you’d still have this thing hanging over your head. And your handsome face is so recognizable. Even those prisoners knew who you were right away. We can’t go through life hiding out from everyone. It’s not fair to you, sweetheart. No, we’ll move to Lycanus and live there.The Alliance can’t touch us then.”</p> <p>Ryan sighed and sank down on one of the stools at the bar.“All right. What do we need to do?And don’t say let you handle it. We’re in this thing together, so don’t go all macho master/slave on me.”</p><p>Blayde looked uncomfortable.“I can’t help it. I hate the idea of you exposing yourself to danger.”</p><p>“Well, the same goes for you.”</p><p>Blayde stared at him for a long moment before pulling him back in his arms. “I love you, honey. Ican’t get enough of you, and I don’t think I ever will.”</p><p>“I certainly hope not,” Ryan said, smiling.“Now stand over there so I can think and tell me what we’re going to do.”</p><p>“The first thing to do, I think, is to figure out just how he faked that film, so we can convince the ambassador.I’ve been thinking about it, and I want you to see it, even though I know it’s hard for you to look at. The first part of the vid is definitely Blaine, and then the next part was you, pulling at Blaine’s shoulder and pushing him down, like you said you did. Even when you climbed on top of him and faced the camera. All you. But then they must have doctored it so someone else came in to slam Blaine’s head on the floor and then back away from the body. After looking back at the vidover and over, there’s no hint of the face in that part. Whoever they got to impersonate you had his hair falling over his face.”</p> <p>“Makes sense,” Ryan agreed. “But how did they make it look like me?”</p><p>“Do you know of any actors who look a lot like you? At least, the same size and general build? Maybe another blond with long, curly hair?”</p><p>“Sure, there are a lot of them. You think that’s how they did it?”</p><p>“Had to be. Put a man your size with your trademark curly blond hair in the same clothes and it would be hard to tell the difference. That and paying off a lot of people to testify against you. The hotel security videos don’t really mean anything. You admit to being there. No, it was the so-called eyewitness testimony that was so damning to you. Some of it from your own friends.We need to find them and see what he offered them to lie for him.”</p><p>“Or what kinds of threats he used, more likely. He used to threaten Blaine all the time. He even tried to threaten his family, until he found out Blaine didn’t have any. That set him back a little. He even threatened me once, Blainetold me.”</p><p>“Sweetheart, I h ave to ask you. Were you and Blaineever lovers?”</p><p>“No.” Ryan shook his head emphatically.“Not really. We messed around a little when we were high sometimes, but that’s all it was. Blaine was more like my best friend. There was never anything romantic between us.”</p><p>“Well, that’s it then.We’ll get ready to take off for Earth and the Lycan embassy.”</p> <p>“What if he just sends the police to pick me up once we get to Earth? And you too, for aiding and abetting?”</p><p>“Well he could try, but itwon’t do him any good, because we’ll have diplomatic immunity.”</p><p>“What?”</p><p>Blayde smiled.“Yes, sweetheart. We can stay at the Lycan embassy, andthey’ll be glad to have us. We’ll be perfectly safe there. The Alliance wouldn’t want another war to start up over such a trifling matter as one small human like you.”</p><p>“Thanks a lot.”</p><p>Blayde wrapped his arms around him and kissed him again.“Not that you’re a trifling matter to me, sweetheart, not at all. Would you like me to show you just how important you are to me?”</p><p>Laughing, Ryan pushed him away.“Later, Blayde. Definitely later.Right now I’m trying to understand. Tell me why the Lycan embassy would even consider letting us stay there.”</p><p>Blayde came back for more, pushing Ryan against the counter and grinding his crotch into Ryan’s, ignoring his question. “Are you sure, pet? I could give you something to occupy your sweet mouth.”</p><p>“I’ll bet you could. For now, though, I think I’ll pass. Tell me, Blayde.”</p><p>“Okay, we’re the primary suppliers of bauxite, the most valuable mineral in the universe as far as Lycanus is concerned. We use it in the manufacture of our houses, our spaceports, our ships, almost everything. So, yes, the Lycan ambassador would be more than happy to provide the alpha and his family with refuge in their embassy.”</p><p>“Even humans, like me?”</p><p>“Especially humans like you, sweetheart, though with you, they can look, but not touch.” Blaydeground his cock into Ryan’s again. “This is all mine.”</p><p>“Do they have human mates?”</p><p>“Oh yes, a few. I told you once, Lycans love to have human males for our mates,they’re the best looking by far and the most docile. We also like the Venuvians from Venuvia Minor in the Copernicus star system, but they have a tendency to bite.” At Ryan’s look of outrage, Blayde laughed.“They’re not quite as handsome as the humans anyway. Not my human, at any rate.”</p><p>“Whatever. Let me go please, so I can have something to eat.”</p><p>Blayde stepped away, still chuckling.“Sorry, sweetheart.Go ahead and eat.”</p><p>Ryan turned back to the food processor and took out his plate. Sitting down at the bar, he ate his dinner, but kept his eye on Blayde. Finally, he put his fork down with a sigh.“I’m too damn nervous to eat. I hate the idea of going back to Earth and getting anywhere near that bastard Partland.”</p><p>“You know I won’t let him hurt you, sweetheart.”</p><p>“Hurt who?” A voice from the doorway made them both look up to see Nikolai standing in the doorway.</p><p>“Nikolai, I didn’t hear you there. Come in, we’re just discussing our journey back to Earth. Do you have everything ready?”</p><p>“Yes, and Kyle’s going too.” Nikolai walked over to where Ryan was sitting at the counter and leaned over to whisper in his ear.“Have you forgiven me, Ryan? I’m sorry for being so hard on you.”</p><p>Ryan looked up and smiled.“I forgive you. I know you were only trying to protect Blayde.”</p><p>“Hey!” Blayde called over to them.“Are you flirting with my mate?”</p><p>“Maybe just a little.” He smiled and walked over to sit by Blayde in the main living area. “We’re ready to head out whenever you are, Blayde. We can leave tonight.”</p><p>“We can be ready. Ryan, go pack a bag, sweetheart.Although, considering we’re going to be staying at the Lycan embassy, if you really want to fit in, you could just pack a leather thong or two.I think I have a couple of those lying around.”</p><p>“Yeah, in your dreams. I don’t believe that their mates really wear them like you keep telling me they do anyway. You would hate all those strange Lycans looking at my ass.”</p><p>“That’s true, I suppose, but on Lycanus, it’s almost a contest to see who has the best looking mate, kind of a status symbol to parade your handsome mate in front of the others to make them envious. I could do that with you, Ryan. Just imagine how jealous I could make all those Lycan ambassadors. Besides, it will be good practice for whenwe’re living there.”</p><p>“Uh-huh. Just imagine the jealous rages those Lycans would be subjected to when you saw them leering at my naked ass.”</p><p>Blayde’s eyebrows drew together and he moved restlessly in his chair. Ryan came over to sit beside him on the chair arm.“But I’ll do it for you, Alpha, if youwant me to.”</p><p>Blayde pulled him down into his lap.“Be careful, Ryan. I could show them how I spank this little ass too.”</p><p>Nikolai laughed at the exchange.“Ryan, I have to say I never thought anybody could handle my cousin, but I think you’re well on the way to doing it. Blayde, I stilldon’t know how you managed to get Ryan to call you master.”</p><p>Ryan looked blank.“Huh? What do you mean? I never call him master. Are you kidding me?”</p><p>Nikolai looked puzzled. “You just did, Ryan. I heard you say Alpha.”</p><p>“Yeah?” Ryan looked blank. “So? It’s what he told me to call him when I first met him.It’s his rank in the pack, and I’m supposed to.”</p><p>Nikolai laughed out loud.“Is that what he told you?”</p><p>Ryan turned in Blayde’s lap and narrowed his eyes at him. “Blayde? What does he mean?”</p><p>Blayde tried to hide his smile, but the attempt was not successful. “We only call Lucas Alpha. When our mate calls usAlpha, it’s kind of like saying master.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ryan turned to look at him with his eyebrows raised.“You mean to tell me I’ve been calling you masterall this time?” He struggled to get out of Blayde’s lap, but he held onto him easily.</p><p>“Now, baby. I like the way you call me Alpha.”</p><p>“Oh, I’ll bet you do!” He wrenched himself out of Blayde’s lap and gave him a long look. Turning on his heel, he rushed out of the room and down the hall.</p><p>As he stalked into the bedroom, he could hear Blayde sigh deeply. “Shit. I suppose I’d better go take care of that.”</p><p>* * * Ryan was by the window and stood there fidgeting restlessly as Blayde came in. He whirled around to face him, but only gave him a quick glance and turned his back on him again, staring back out at the desolate landscape.</p><p>Blayde leaned against the door frame. “What now, Ryan? Angry at me because I tricked you into calling me master?I’m sorry, baby, but it was kind of a joke.”</p><p>“I don’t know, Blayde,” Ryan said softly.“Are you sure you don’t like it?”</p><p>Blayde straightened up in irritation and forced himself to speak calmly.“Well, hell, of course I like it. You know I like to bein charge, but I won’t force the issue if you hate it so much. The relationship between Lycans and their mates is an ancient tradition.I’m the head of our household, and I make the decisions for both of us.I’ll make sure you are happy and satisfied, and I’ll take care of you always. Your only duty is to me.It’s your job to give me pleasure, just as it’s my job to see to your pleasure. I told you back on the ship that you must trust me to care for you.That’s just the way it is for Lycans, and I have no desire to change it.I’ll do anything to clear your name and secure our future together. If calling me Alpha, or acting submissive is that much of a strain for you, though, then I’ll try to tone it down some. I want you to be happy.”</p><p>At Ryan’s continued silence, Blayde stepped further into the room, closing the door behind him. Nervous, despite his confident words, he edged closer to his lover.“When we get to the Lycandelegation’s embassy, you’ll see how their mates behave.They don’t stomp and yell and give their mates dirty looks.Some of them wear a thong and sit at their mates’ feet. In contrast, I’ve been pretty damn lenient with you, and patient.Are you listening to me, Ryan?”</p><p>Ryan turned slowly around and regarded Blayde with those glittering green eyes. His long lashes lowered, almost sweeping his cheeks as he dropped his gaze to the floor.“Oh, I’m listening, Blayde.I was just wondering when you’re going to stop lecturing me and start showing me the discipline I need.You’re always telling me you’re in charge.Why don’t you show me? I’ve been prettybad. A good master would take care of that.”</p><p>Blayde hissed in a breath and took another step toward his mate, his heart suddenly thumping loudly in his chest.“But I thought...you seemed angry when you left the room just then.”</p><p>“Not angry, Blayde. Surprised. Excited. Thinking about how, as my master, you can make me do anything you want. And how, as a good mate, I can please you. I want to please you, Blayde.”</p><p>Ryan’s words went straight to Blayde’s cock and his erection was straining now against his pants.“You’re right, sweetheart. I need to take care of you very badly.Take off your clothes.”</p><p>Ryan quickly unbuttoned his shirt and slipped it off, folding it neatly and placing it on a nearby dresser. He took off his jeans and underwear and placed them alongside his shirt. He turned to face Blayde then, eyes still downcast, the only hint of his excitement in the slight flush along his cheeks and the rapid rising and falling of his chest. That and the huge erection now curving up in front of him.</p><p>“Stand by the bed, pet.”</p><p>Dutifully, Ryan crossed to the bed. Blayde came up behind him.“Lean over and put your hands on the mattress.”</p><p>When he was in place, his rounded ass held up invitingly, Blayde put a hand under his stomach to support him.“I think five will be enough for this infraction, don’t you, baby? Be still, and take your punishment like a good boy.”</p><p>“Yes, Blayde,” Ryan said softly, shivering with what Blayde hoped was excitement. With his hand under Ryan’s stomach, he could feel Ryan’s erection bobbing against his hand as he shifted his weight a bit. His mate was excited, all right. His erection was hard and hot against his hand. Blaydecouldn’t resist brushing the back of his hand against it.</p><p>“Ready, sweetheart?” he asked. Then brought his other hand down smartly on the pretty cheeks in front of him, spanking Ryan squarely in the middle of his ass. Ryan grunted and shifted his feet again.</p><p>“Be still. Stop fidgeting.You’ve been bad, as you said, and you deserve this.”</p><p>“Yes, Blayde.I’m sorry, sir.”</p><p>Blayde spanked him twice more in rapid succession, and Ryan moaned softly. After quickly checking to make sure Ryan’s cock was still hard, he laid down two more hard slaps at the bottom of his ass, lifting Ryan off his feet, and then pulling him sharply back against his groin, grinding Ryan’s sweet ass into his by-now painful erection, and holding him up off his feet by one hand on his stomach and the other on his chest.</p><p>Ryan let his head fall back on Blayde’s shoulder, breathing rapidly and making soft, little whimpering sounds.“Are you going to be a good boy now?”</p> <p>“Yes, Blayde,” he breathed softly.</p><p>Unable to stand it a moment longer, Blayde laid him gently face down on the bed and almost ripped off his clothes. He found the lube by the bed, and put a hand underneath Ryan again, not trusting his voice to speak. He nudged Ryan up to his knees and quickly spread lube over his little pink hole.“I’m going to make love to you, darling.”</p><p>“Yes, please, Blayde,” Ryan answered, looking at him over his shoulder with a sexy, shy little smile that almost made Blayde come right then and there. Blayde took a deep breath and climbed onto the bed behind him, easing in one finger and sweeping it forward to find his prostate. He pressed gently against it and Ryan relaxed even more, groaning and opening for him. He bent down and bit down on Ryan’s beautiful pink ass-cheek, then licked away the sting. Another finger joined the first and Ryan began to rock back against him, urging him for more.</p><p>“You ready, baby?” Blayde nudged his cock into the crease of Ryan’s ass and found his target. Blayde was so hard and ready now he was leaking pre cum. He looked down at his large cock, as it thrustits way inside Ryan’s pink and white ass and groaned aloud. He eased his cock inside Ryan slowly and then slowly pulled out again.He took hold of Ryan’s cock and began to stroke it to the same rhythm. Blayde was consumed with passion and desire for his sweet mate who was squirming beneath him and panting hard now as he received pleasure from Blayde, who controlled his every move. If Ryan moved forward, he’d pull away from Blayde’s cock, and if he moved back, he’d lose the pleasure Blayde’s hand was giving him.</p><p>Blayde could sense his feelings of confusion as he hung there, unsure of what to do, then finally giving in and allowing his master to see to his pleasure. He could tell the exact moment of Ryan’s complete surrender, when his arms gave way and he sagged forward with a loud moan, accepting Blayde’s control and domination. With the next few strokes, Ryan came explosively, screaming out his pleasure, and Blayde followed him in seconds, emptying his balls into his mate’s ass, and keeping him impaled there at the end of his cock until his shuddering climax ended. Reluctantly, he pulled out then and let Ryan fall to the bed, and he fell down beside him, putting his leg over Ryan possessively and pulling him close.</p><p>When he could talk again, he put his hand on Ryan’s cheek and stroked it softly until Ryan opened his eyes and gazed at him with big pupils, blown with pleasure.“From now on, sweetheart, I will have to administer your discipline more frequently.I can see I’ve let you go far too long.”</p><p>Ryan’s lips curved into a sleepy smile as his eyelids lowered. “Mm, yes, Blayde. I think I need a lot more of your attention in the future.”</p><p>“Well, baby,” Blayde said softly. “I’m not sure if you’ve really learned your lesson. Before we get to the embassy, I may need to teach you a bit more about how good mates should act. Let me rest a moment,and we’ll continue.”</p><p>* * * “No, Blayde, I’m sorry,I’m not trying to be difficult, really, but it’s just not good enough!” Ryan shook his head firmly and folded his arms across his chest. They were in their rooms at the sprawling Lycan embassy complex, located in the heart of New Washington on Earth. They had arrived two days before, their small delegation consisting of Ryan and Blayde, Kyle and Nikolai. Lucas had stayed behind on Lycanus 3, with pressing concerns at the mining operation, but he had been in contact with the Lycan ambassador through holo-cam on and off for the past two days. Blayde had just come from a meeting with the ambassador and presented Ryan with the latest news about their negotiations.</p><p>“Ryan, b e reasonable. The agreement Lucas has hammered out with the ambassador is very reasonable, and quite beneficial to us, I might add. Did you understand they are prepared to give you asylum on Lycanus and Lycanus 3, and the Alliance won’t dare violate that? We won’t even have to move!You’ll be safe now, sweetheart, and they won’t be able to touch you without starting a nasty intergalactic incident. Once the Alliance finds out about the agreement, they won’t dare start anything.”</p><p>“But what about the judge? Doesn’t anything happen to him? He murdered my friend, Blayde.He could do the same to someone else if we don’t stop him! Besides, that means I can’t ever leave the planet to accompany you on your tripsunless it’s to Lycanus!We’ll be just like that Gunnar and Ivan!”</p><p>“ Once we notify the Alliance about this, Judge Partland will know, Ryan.He’ll be far more circumspect in the future.And as for traveling, I’ll just stay on Lycanus 3 and help out with the mines.I won’t leave you, baby.”</p><p>“You’d hate that! And as for the judge, what difference will it make if he knows we’re onto him?He’ll hide the bodies a little better next time?” Ryan ran his hand through his hair, just beginning to grow back in. Hedidn’t mind the golden curls, though his short hair had been much less trouble, but Blayde wouldn’t allow him to cut it, and had, in fact, threatened him severely if he so much as touched it with the scissors.He’d had to resort to time-outs and threats, because Ryan enjoyed the spankings way too much, especially since they almost always ended with sex. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“ Baby, he’s a very powerful and arrogant man.We’ll only be able to do so much to threaten him.The Alliance refuses to reopen the investigation into your friend’s death.”</p><p>Ryan began to pace around the luxurious room they’d put them in. He was wearing a leather thong, like the other mates in the embassy.He’d decided on his own to wear one while they were in the embassy, or at least alone in their rooms. He did it both to please Blayde and to drive him crazy. As he paced upand down, he felt Blayde’s warm gaze on his fully exposed ass. “What if we somehow trapped him into a confession?If we went to see him, he wouldn’t be able to resist bragging about it, Blayde. I know how arrogant and above the law he thinks he is. I could goad him into a confession, and then we could take that to the police.”</p><p>“Ryan, be realistic. We’re never going to trap him into a confession, because we’re never going to be allowed in to see him.And maybe I didn’t make myself clear, you’ll have asylum in Lycanus and its domains. Not on Earth. You step outside this embassy and you run the risk of being recognized and arrested. Once we notify the Alliance, the embassy will secure safe passage back to our ship for you, but that’s it.”</p> <p>“But wait, before the Lycans notify the Alliance, what if we could trap the judge? Sort of like you did with me at the auction? You know, like a sting. You offer him a chance at a new submissive,one he’s wanted to be with for a long time. Me!I don’t think he could resist even for a moment.He knows you’re a bounty hunter and a voyager. Many of them will do anything for a larger profit. You could tell him you faked my death only to extort more profit from him. That you’ll turn me over to him if he gives you a large sum of money.He’d believe that, Blayde! Then I could goad him into a confession of some kind. I could have a recording chip placed in me to pick it all up. When we have his confession, you could come in and get me. What do you think?”</p><p>“You don’t even want to know what I think! Of all the harebrained, ridiculous schemes I’ve ever had the misfortune of hearing...” Blayde came over to stop his pacing and take him by the arms.“You’ll go nowhere near that maniac, do I make myself clear? If I have to tie you to this bed until we leave, I’ll do it. How could you even think I’d risk you that way?”</p><p>“But Blayde...”</p><p>“But nothing! It’s out of the question!” He pulled out his communicator and punched in a number.“Nikolai? I need to get Ryan up to the ship right away. An agreement has been reached and we’ll be leaving soon. I need either you or Kyle to take him to the ship for me and watch over him until I get there.” He nodded and then turned to face Ryan.“Prepare yourself. You’ll be taken to the ship immediately while I complete negotiations. If I hear from either of my cousins that you’ve given them a hard time, I’ll make sure you never so much as think of disobeying me again.Do I make myself clear?”</p><p>Ryan flushed and nodded, dropping his gaze. Blayde relented and pulled him into his arms. Blayde tilted his chin up with one knuckle and made him look at him.“You’re too precious to me to risk you, baby, even if that plan of yours had a snowball’s chance of working. Kyle and Nikolai will take you to the ship now and I’ll join you in a few hours, so we can head back home and get on with our lives. Be good and don’t give them a hard time, all right?”</p> <p>“Yes, Blayde,” Ryan said in a sulky tone. Blayde leaned down and kissed him on his forehead, his nose, his cheeks and then finally took his lips. Ryan sighed and leaned into him more closely.“Whatever you say.”</p><p>“Thank you, sweetheart.” Blayde moved his hands down to cup Ryan’s ass. “Now put on some clothes before my cousins get here.I’d trust them with my life, but nobody could resist this sexy little ass of yours.” He dropped another kiss on the tip of his nose and gave his ass a playful tap and a squeeze.“Though don’t lose your thong, darling. I think that’s a habit I need to encourage when I get you home.”</p><p>Ryan smiled and Blayde released him to go put on some clothes before they left. He was disappointed and he sent up a silent little prayer that where ever Blaine was, he’d forgive him for not securing justice for his murder. Blayde was right,he’d probably only get himself arrested or worse if he tried to confront Judge Partland. He was too well-guarded, too firmly entrenched as a respected public official. Besides, Ryanbelieved Blayde when he said he’d punish him so badly he’d never disobey again. Of course, that might be kind of fun.</p><p>By the time he finished dressing, Blayde had packed his bag for him and was practically tapping his foot with impatience. Nikolai and Kyle were standing outside the room, ready to take him to the ship. He moved to the door and took his bag from Blayde, starting out the door to join Blayde’s cousins. Blayde pulled him back into his arms and kissed him thoroughly before releasing him.“That should keep you until I get back to the ship.” He took a cap from the coat rack on the wall and pulled it over Ryan’s shiny curls and well down over his forehead. He pulled up his collar to try to hide his face even more.Finally satisfied he’d disguised him as well as he could, he angled a look up at Kyle and Nikolai who were waiting with twin expressions of amusement for him to finish.“Take care of my mate, cousins.” He glanced down at Ryan fondly.</p><p>He released Ryan with another little squeeze and Ryan followed Kyle and Nikolai downstairs and out to await the transport they told him they’d already called for to take them to the spaceport.Once there, they’d find the hangar their shuttlecraft was anchored in for travel up to their ship. Ryan stood between the two tall Lycans, feeling dwarfed by their size but protected by them at the same time. He kept his eyes on the sidewalkas they’d told him to keep his head lowered quite sternly, so hedidn’t see the transport as it pulled up to the curb, hovering just above the sidewalk.He was surprised then when he heard Nikolai’s soft grunt of pain as he slumped down into the seat in front of him. His arm was jerked roughly as he was pulled forward and the transport took off and shot up at an alarming rate of speed.</p><p>When he straightened up in the seat, hecould feel Nikolai’s body sprawled out on the seat beneath him, still breathing heavily, thank the gods. Ryan lifted his head and found himself staring into a pair of cruel dark eyes, only inches from his own. The strange man looked both pissed and disgusted with him.</p> <p>“Welcome back to Earth, Randy Ryan. At least for a little while. The judge will be very happy to see you again, you little bastard. Now join your friend here and take a little nap, boy, so you’ll be nice and rested for the judge.” He touched Ryan’s temple with the stun stick and the pain seared through his head like fire, and he screamed in agony. He closed his eyes as the pain swirled around and around his brain until the blackness took over and he didn’t know anything more.</p><p>Chapter Eight</p><p>Nikolai had never felt more cold fury in his life. For the past hour since he’d awakened, he’d been tied naked to a rack in this room, his arms and legs spread wide. Ryan was tied to the rack beside him in a similar fashion. Ryan was still fading in and out of consciousness, and though Nikolai could hear his ragged breathing beside him, his greatest fear was that he would stop breathing any second.He’d been trying to talk to him soothingly, reassuringly for some time now, though Ryan never responded. He hoped that he could hear him on some level. It was imperative he keep Ryan alive until Blayde and Kyle found them. The stun gun had prevented his Lycan wolf from coming forward, and it was still doing it. The partial paralysis the guns caused had somehow short-circuited his abilities, and though he could feel the effects wearing off, he still didn’t have complete control.</p><p>He knew without any doubt they’d come for them . He only had to remain alive and keep Ryan alive until they got there.They’d already been tortured with pain sticks for over an hour. Only when Ryan lost consciousness did they stop, but Nik knew it would only be a matter of time before they returned. He heard a door open behind him and twisted his head around as far as he could to see who had come in the door. A tall, thin human male of about fifty, surrounded by several other large human males, bodyguards he figured, as they swarmed around him protectively, came in the room and over to where they hung on the racks.</p><p>“Well, a Lycan,I’ve never seen one up this close. You’re really something, aren’t you?” The human ran his hand over Nikolai’s hip. “Very beautiful. I understand that Lycan males pride themselves on never submitting to another male.” The human smiled, though the smile was only on his lips.“I wonder if that’s true. What a lovely challenge to undertake. The stun guns are pretty effective, I understand, at controlling you. I wonder how long it would take to have you on your knees to me?”</p><p>The human punched him low on his right side, a sickeningly hard punch, a mind-ripping jolt of pain as he connected with one of Nikolai’s kidneys. Nikolai hissed in a sharp breath and turned his head to stare at the human.“You’ll pay for that, you bastard.”</p><p>The man, who he figured must be Judge Partland, put back his head and laughed. “I’d call that bold talk for a creature in your position, Lycan. You seem to be rather at my mercy at the moment.”</p><p>“I’m not frightened of you, human scum. I can take anything you can dish out.” “Perhaps so, but what of your lover here?”</p> <p>Nikolai was quiet, knowing he meant Ryan. If he thought he was his mate, perhaps he could</p><p>somehow use it to his advantage. Then again, it might only bring Ryan more pain if he tried to hurt Ryan to get a rise from Nikolai. Uncertain of what to do, he decided to stay quiet and give the bastard no information.</p><p>“Don’t hurt him,” Nikolai said. “Do whatever you have to do to me, but leave him out of this.”</p><p>“But what would be the fun in that?” Partland walked over to Ryan and pulled his head back to peer down in his face. Ryan opened his eyes a little and stared at him blankly.</p><p>“I’ve been after this boy for a long time. I had arranged for his demise at the prison, but you and your crew of Lycans stole him from me.Did you really think I’d believe he died trying to escape?” He laughed shortly.“I knew you must have him and that it would only be a matter of time before you came to the other Lycans for help.I’ve had my people inside that embassy for a long time. Any people with that much money and that much power over the Alliance government, it pays to keep an eye on. I knew the moment you arrived with him, and I had my men wait very patiently outside until you showed yourselves. Now that I have him, I mean to kill him myself, but not before I sample a little of him.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nikolai pulled against the strong ropes that held him in outrage and blind fury. He could feel his beast very close to the surface.</p><p>“Oh, would you like to watch? Why, certainly. I think that can be arranged quite easily.” He turned his head and nodded to his henchmen.“Get the boy down, men, and make our guest more comfortable.”</p><p>The guards came forward and untied the ropes holding Ryan and let him crash to the floor. They bent over and picked him up by his arms and dragged him over to the table in the center of the room.“Bend him over the table, and hold his arms.”</p> <p>By twisting his head, he could see them shoving Ryan to land on his stomach on the table and then each of the two men took his wrists and held him securely, while Partland unbuckled his belt.“I’m finally going to take what I want from this very pretty little ass. I think after that I’m going to fill it with my cock. Any tips you can give me, Lycan? Any words of encouragement?”</p><p>Nikolai roared with rage. Whether the fury and outrage helped him overcome the effects of the stun gun, or the effects just wore off at the right moment, he never knew. But he felt his Lycan wolf spring forth with a vengeance as he shifted. Ripping and tearing his way out of the ropes, the huge creature twisted his massive body and fell to the floor. He could hear the men screaming as they tried to run from the room, letting go of Ryan’s arms and allowing him to slump to the floor. He leaped over his body and caught one guard at the door, swiping savage clawsacross his throat, the guard’s blood spurting out onto Nikolai’s chest as the man’s lifeless body dropped. Nikolai turned and snarled again as he faced the men who were huddled together on the other side of the room, holding out guns and stun sticks toward him. He heard another commotion outside in the hall, people screaming and running, loud shouts of alarm and dismay, but he was already leaping. He felt a hard blow under his chest, but his momentum brought him forward. He could feel the stun sticks burning into his flesh as he fell, and then blackness engulfed him.</p><p>* * * Since the moment Kyle stumbled into his room, his face registering horror and rage, Blayde had been almost numb with terror.He’d been going through the motions, not allowing himself to think of what might be happening to his mate and to his well-loved cousin as he informed the ambassador and gatheredthe forces he needed to storm Judge Partland’s compound. That must be where he was hiding them. Partland must have been counting on his high status in the Alliance to protect him, but the fact that the judge had really fucked up this time and taken a Lycan, and not just any Lycan but a member of a well-respected Lycan family, helped make the decision easy for the ambassador. Without a second thought, the ambassador had arranged for a complete contingent of Lycan guards, warriors in the Lycan army, to accompany him and Kyle when they made the assault. Blayde had forced himself to wait the half hour it took for the guards to arm themselves, not that Lycan warriors would need much against the humans, but they never knew what they’d be facing inside the compound.</p><p>Now as Blayde neared the target area, he was no longer just on a rescue mission. He planned on killing the judge, slowly and with extreme prejudice. If the man had harmed so much as one hair on his mate’s head, he would keep him alive and in agony for days. The hovercraft landed on the roof and they charged out and down into the complex.Partland’s guards put up a cursory fight that ended quickly when two or more of the warriors shifted into their Lycan wolf forms. At that point Partland’s guards ran screaming from the floor, stumbling all over each other to get down to a lower level. Yipping and growling, the Lycans followed them down, leaping ahead and mauling them as they ran. One captive, begging for his life, told them where to look for Partland. He told them he was in the basement dungeon with his prisoners.</p><p>As Blayde and Kyle charged down to the basement, they could hear the howls and screams coming from the last room on the hallway. Racing to the room they flung open the door to a horrific scene. Three dead guards were lying bloody on the floor, and Nikolai, naked and bleeding, was shifting back into his human form, while Judge Partland and one of the guards still cowered in the corner. But Blayde’s gaze rested primarily on his mate, and his heart almost stopped as he saw his naked body crumpled to the floor beneath the table. He reached him in two huge steps, gathering him into his arms. When he found he was still breathing, his heart started up again, and he pulled off his shirt to cover him before standing up with him cradled in his arms. Kyle was helping a wounded Nikolai, who was bleeding from wounds to his chest, to rise on shaking legs to his feet.</p> <p>More Lycan warriors rushed in behind him, and he jerked his head toward Partland and his remaining guard.“Secure the prisoners and bring them with us. Contact the embassy and let them know we’re bringing in wounded. Make sure the doctor is familiar with both Lycan and human anatomy.” Holding Ryan closely to his chest, making sure Kyle was following with Nikolai, he hurried upstairs to the waiting hovercraft. Making sure everyone had scrambled back onboard, including the prisoners, Blayde signaled to the pilot to take off before the Alliance police arrived. They had left no one alive at the complex to tell any stories about what had happened. With any luck they could make a clean escape, and avoid a galactic incident over this thing.He leaned down and rained kisses on Ryan’s face. He would never let his mate out of his sight again.</p><p>Ryan stirred restlessly and opened one eye to focus on Blayde’s face. “Oh, it’s you,” he said with a sigh.“What took you so long?”</p><p>* * * Ryan awoke to find Blayde snuggled firmly against him, one big leg thrown over his and a tight arm around his waist.Blayde’s hard erection was burning hot on his thigh and he nudged it a little closer as Ryan tried to move out from under his arm. He woke up and tightened his grip. “Where do you think you’re going?”</p><p>“I wasn’t going anywhere, Blayde, Iwas just hot.” “Oh,” Blayde said irritably. He threw the cover off both of them and then lay back down, tightening his grip on Ryan’s waist. “Go back to sleep, baby.”</p><p>“But I’ve been sleeping all day. You won’t let me out of bed long enough to do anything else. Please, Blayde. Wake up and talk to me, or let me get up and go watch some movies or something.”</p><p>“Not a chance, sweetheart. The doctor said to keep you in bed for fortyeight hours at least.”</p> <p>“And it’s been more like sixty! Please, Alpha, I’m going to get bedsores.”</p><p>Blayde snorted, but he sat up, rubbing his face and stretching.“All right, but just for a little while.I guess we could have a midnight snack.” He got up and started for the kitchen, looking back over his shoulder at Ryan as he scrambled to follow him and pointing his long finger at him.“No. You stay there.I’ll bring it.”</p><p>Sighing heavily, Ryan stacked some pillows behind him and leaned back onto them. He didn’t have long to wait before Blayde reappeared, carrying a tray with some golden Vesuvian cheese that Ryan liked, along with some crackers and red wine. There was a large glass of milk on the tray too, and Ryan could just guess which drink was for him.</p><p>Sure enough, Blayde laid the tray on his lap and plucked the wine glass off to take a sip. “Before you say anything, sweetheart, you have a head injury, and the doctor said no wine or liquor of any kind while you’re taking the medicine he gave you.”</p><p>Ryan sighed and nodded.“Okay, but tell me about Nikolai. Is he going to be okay?”</p><p>“Nik? Oh yes, he’s fine, baby. Thank goodness for what he did to protect you, or they might have hurt you even more badly before I could get to you. Nikolai said the bastards were going to rape you. They shot him in the chest, but luckily it missed all his vital organs and with his fast Lycan metabolism, he’ll heal quickly.He’ll be back on his feet in no time.”</p><p>“Good. You know I could hear him talking to me when we were tied up on that rack in the torture chamber. He tried to comfort me.I couldn’t speak back to him, but I heard him and I knew I wasn’t alone. It really helped.”</p><p>Blayde leaned in to kiss him.“I’m so sorry, darling. If that bastard had really hurt you...”</p> <p>“Speaking of which, where is he?”</p><p>“The ambassador turned him over to the police.”</p><p>“What will they do to him?”</p><p>“I hope they’ll execute him, but I don’t know.” Blayde said grimly. “I tried to get them to let me have a few words with him, but they refused.He confessed to your friend’s murder and to faking the vid the way we thought. He also confessed to kidnapping you and planning to rape you and Nikolai and then kill you both. The confession was given to the police and the Lycan ambassador is making sure your name is cleared.”</p><p>“A confession seems a little out of character for Partland.”</p><p>“Well,” Blayde said sheepishly.“There might have been a little persuasion used.”</p><p>Ryan laughed.“I can imagine the kind of persuasion Lycans used. Not that he didn’t deserve it.” Ryan shuddered and leaned over into Blayde’s chest. “Don’t tell me any more.I don’t think I feel very good after all.”</p><p>“I knew it,” Blayde said, taking the tray off his lap and pulling the pillows out from behind him.“Lie down, babyand go back to sleep.”</p><p>“I don’t need to sleep, Blayde.I need you.”</p><p>“No, sweetheart, it’s too soon.” Ryan turned his head and licked his chest, then let his tongue travel all the way down to his navel. He stuck his tongue inside and chuckled when Blayde gasped aloud. He continued down to his groin, then gave his cock a series of little licks until he reached the head and gave it a swirling kiss.</p><p>Ryan looked up from under his lashes at Blayde and smiled. “Sure I can’t convince you, Blayde?You promised you’d always take care of me.”</p><p>Blayde groaned and pulled his mate on top of him.“I did promise, didn’t I? And a Lycan never goes back on his promises.” </p> </body></html>"]