["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>1</p><p>“You were right again, love,” Criminy said.</p><p>Tish rolled over in bed to face him, her eyes hazy and still smudged with yesterday’s kohl. After a long night’s glancing, she usually slept deeply until afternoon, and she still didn’t understand how a man as busy as Criminy Stain always managed to be there when she woke up.</p><p>“You’re the one who says glancers are always right,” she answered, stretching and sighing under the quilt of patchwork silks. “In my world, the only way to learn the future is with a Magic 8 Ball.”</p> <p>“You slay me, pet,” he said. “You and your fantastical imaginings.”</p><p>The gypsy king sat at his desk in nothing but breeches and argyle stockings, his hair loose and skimming over the pale skin of his chest like ink spilled on parchment. The newspaper in his hands had been found after last night’s show, probably dropped by one of the Clockwork Caravan’s uptight and paranoid Pinky customers. No matter how many signs and certificates they posted assuring the visitors that it was perfectly safe, the silly humans still carried their parasols like weapons and jumped whenever they were addressed by someone not laced into layers of fashionable clothing. And they dropped all manner of odd objects, including piles of newspapers.</p><p>Since Criminy himself avoided cities like the plague and didn’t trust the Coppers to leave his carnivalleros unmolested within the high, guarded walls, they didn’t get news as often as Tish would have liked. Accustomed as she was to the Internet and talk radio when at home in Atlanta, she found it frustrating that fascinating things happened all over Sang that she wouldn’t learn about for several months. For example, it had taken an entire year for Criminy to learn that the Blud princesses of Freesia had disappeared, and he was still furious whenever the topic came up. As far as Tish could tell, they were the Bludmen’s version of the British royal family and much adored, especially the youngest princess.</p><p>“Has there been news of Ahnastasia—” He looked up, cloudy eyes sharp, and she stopped herself just in time. “Never mind. Just tell me what I was right about so I can act smug.”</p><p>“I seem to recall you telling our Maestro that loss would be his salvation or some such rot, yes?”</p> <p>Tish smiled and allowed herself a moment to feel wistful over the Maestro, who had left the carnival when Tish chose a vagabond life with Criminy over a settled marriage with the talented musician. She had first met Casper Sterling in her own world, where he was an unresponsive patient on her nightly rounds as a hospice nurse. And meeting him in Sang, awake and devastatingly handsome and most very responsive, had definitely been a shock. When she had touched Casper and glanced on his future, she had seen dizzying greatness followed by a fall from glory followed by hard-won redemption. Now she had to wonder which part of her glance Criminy was referring to.</p><p>“Something like that,” she murmured.</p><p>With his usual flair for the dramatic, Criminy flicked the paper around to show her the front page, which featured an ink drawing that perfectly captured Casper, right down to his nimble fingers, flowing hair, and dimples. Unfortunately, it also showed him vomiting into the strings of a harpsichord while wearing a woman’s bonnet on his head.</p><p>She grinned. “And to think that I passed that up for you.”</p><p>“Turns out our lad has just been tossed out of the London Opera,” Criminy said. “The Magistrate canceled his appointment due to disgraceful behavior and conduct unbecoming a professional.” He peered close, sharp eyebrow raised. “He’d have done better to stay here.”</p><p>“What, so you could gloat?”</p> <p>Criminy’s roar of laughter filled the wagon, and Tish grinned. It was one of her favorite sounds, that wild, unselfconscious barking. Even now, after two years with him in the caravan, it still felt as if she had won a prize.</p><p>“No, love,” he answered. “So he would remember his place. Give a weak man the world, and he’ll just make a mess of it.”</p><p>“Well, I feel sorry for him,” Tish said. “He might not have been the right man for me, but there’s someone out there for everyone. And he’s so very—”</p><p>“Good-looking?”</p><p>“Talented. Much better than that ridiculous goof we’ve got on the calliope now.”</p><p>“Carnivalleros come and go, my love, but to hell with the Maestro. He’s a lot better off here than he was in your world, anyway.” He folded the paper fastidiously, rolled it up, and stuffed it into one of the pigeonholes in his desk before standing to stalk to the bed with his usual predatory grace, and Tish smiled and scooted over to make room for him. When she became tangled in the mess of sheets and blankets, he pounced on her, pinning her wrists on either side of her head.</p><p>“Besides, he could never have tickled your ivories as I do, my delicious little pianoforte,” he whispered in her ear. “I know just where to put my fingers . . .”</p><p>A shiver ran over her as he began kissing his way up her neck. Before he could reach her mouth and claim her in one of those desperate, fiery kisses she loved so well, someone knocked on the door of the wagon.</p> <p>“Bugger off!” he yelled. “We’re busy studying musical theory.”</p><p>He licked his lips and smirked at Tish, showing pointy teeth.</p><p>“Now, where were we, my little harp that needs plucking?”</p><p>The knock came again, and he leaped to the wagon’s floor with a howl.</p><p>“What part of bugger off sounds like keep knocking?” he said, growling.</p><p>Someone mumbled from the other side of the wood, and he ran a hand through his hair and groaned as he pulled on a loose white shirt and slipped on his boots. He closed his eyes and took in a deep breath through his nose.</p><p>“You’d best get dressed, too,” he said. “It’s a stranger.”</p><p>“A Stranger?” Tish hurried out of bed, fumbling into a thick silk kimono. She wasn’t hopeless with a corset and bustle anymore, but she definitely didn’t have time to squeeze into all the layers of her usual costume.</p><p>“It’s endearing, how irrationally fond you are of people from your world,” Criminy said, smoothing his hair and tying on an indigo cravat. “But you know I can’t smell that on a person. It’s simply a Pinky lady, and she positively reeks of the city. It had better not be some bloody sightseer or doxy or reporter or undercover Copper. Or a traveling saleswoman. May Aztarte crucify her if it’s one of those.”</p><p>With a nod at Tish’s tied kimono, he shook himself like a dog shedding water and put on his most forbidding, superior face. Tish couldn’t see around him as he threw open the door, but she noticed the immediate change in his manner as he went from terrifying to polite and solicitous in response to whoever waited on the other side.</p><p>“I’m very sorry to bother you,” said a woman’s low voice in a cultured London accent, “but Mr. Dregs mentioned that I might find you here and politely inquire regarding employment.”</p><p>“Well, that depends,” Criminy said in a more kindly fashion than Tish would have expected. “What is it that you do?”</p><p>“Myself, I do very little,” the woman said, and Criminy moved aside to reveal a pale but pretty woman in a tall hat who reminded Tish of Mary Poppins, a large steamer trunk on the ground beside her. “But my act is hidden in this portmanteau.”</p><p>2</p><p>“Ah,” Criminy said, rubbing his hands together. “A mystery! They’re so very rare these days. Where would you like to set up your act? Indoors, outside, on top of the wagon? My lady wife and I could use some good amusement.”</p><p>The woman raised her chin, neglecting to fidget at all, which was rare for humans in front of a powerful Bludman like Criminy.</p><p>“After an unfortunate disagreement in the city, I am left with only my performers and no equipment. But I assure you that of all the creatures in your caravan, they eat the least, make the least noise, and require the least resources. And are the most extinct.”</p><p>Overcome with curiosity, Tish joined Criminy in the doorway, and the woman bowed with dignity.</p><p>“I like her,” Criminy whispered to Tish. “She smells of books.”</p><p>The woman smiled. “Forgive me for not introducing myself. Please call me Madam Morpho.”</p><p>“That sounds promising,” Criminy said.</p><p>Tish smacked his arm and said, “Manners.”</p><p>“I’m Criminy Stain, and this is my wife, Letitia,” he said with his own bow. “Pleased to make your acquaintance. Let’s see what’s in your trunk, and then we can speak further of employment. As much as I admire a flair for the dramatic, I never hire an act until I’ve seen it performed.”</p><p>Madam Morpho’s face fell for just a moment, but she recovered quickly. With a determined nod, she turned to unlatch the trunk. Tish was surprised at her outfit, which was a dull, worn black that resembled a graduation gown. In her experience of citydom, the clothes were as bright and colorful as possible to combat a dreary life between stone walls.</p><p>“My wards haven’t seen sunlight in years,” Madam Morpho said. “But I will wake one for you.”</p><p>When she threw back the lid of the trunk, Criminy stepped protectively in front of Tish, but he had nothing to fear. The portmanteau was full of old leather books.</p><p>“They are a fearsome lot,” Criminy said. “But I’m well acquainted with a few of them.”</p><p>He reached for a copy of Sagacity and Susceptibility, which Tish knew to be one of his favorites. She had been surprised, upon reading it, to learn that in Sang, Mr. Willowbee had eloped with Miss Maryann and run away with the circus, leaving the Colonel behind to hang himself in his enormous house.</p><p>Madam Morpho stopped him with a tsk and reached for the book herself.</p><p>“Ah, one of my favorites,” she said. “The Duke of Burgundy.”</p><p>Holding the book on one palm as if it were made of glass, she gently opened the cover. Tish and Criminy leaned in. The middle of the book had been hollowed out, the pages carefully sliced to create a rectangular pocket. In that pocket was a nest of soft cotton, and on that cotton lay the body of a butterfly, its brown wings folded. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m not denying it’s beautiful, madam,” Criminy said with a smirk, “but we do prefer our performers to be a bit more lively.”</p><p>With an answering smirk, Madam Morpho put her mouth very close to the book and whispered something. As she straightened up, the butterfly wobbled to standing, flapping its orange-dotted wings slowly as if just waking up and in need of a good stretch.</p><p>“Curious,” Criminy said. “And impressive magic. But still not enough, unfortunately.”</p> <p>Madam Morpho held a black-gloved finger to the butterfly, and it stepped up like a trained bird, careful and sure.</p><p>“I mentioned my travails in London,” she said as if addressing the butterfly. “Due to a grave misunderstanding, I cannot return there. But you’ll find I won’t drive a hard bargain, salary-wise. And given a few days’ time, I am confident that I can construct the props my performers need to amaze any audience. I don’t think I need tell you that most city dwellers have never seen a live butterfly and even the London Zoo is without a living specimen. I could easily sell this collection, even dead, for a large enough sum to purchase my own island and retire in reclusive comfort.”</p><p>“Why don’t you, then?” Criminy said sharply.</p><p>Madam Morpho stroked the butterfly’s quivering antenna and said, “I would sooner sell my own children.”</p><p>Hands on slender hips, Criminy sighed and stared down into the depths of the trunk. Other than a bulk of black cloth strapped into the lid, it held nothing but dozens and dozens of books, each of which, one had to assume, held a rare, beautiful butterfly.</p> <p>Tish put a hand on Criminy’s shoulder and gave him a meaningful look. “I think I can solve this conflict easily enough.”</p><p>He chuckled and nodded. “Smart lass.”</p><p>“If you’ll be so kind as to remove the glove on your right hand,” Tish said with a smile. The first time she had spoken the words before touching someone and reading his future, she had felt like a fraud, but now she had a professional grace and confidence about her glancing.</p><p>Madam Morpho cocked her head, making her tall hat list to the side dangerously, but she slipped off her glove without complaint and held out her hand. Tish grasped it and shuddered briefly before relaxing with a smile. She leaned over and whispered into Criminy’s ear, and he burst out in laughter so loud that the nosy tightrope girl came running from her wagon to see what all the fuss was about.</p><p>“I don’t understand,” Madam Morpho said.</p><p>“You’re hired,” Criminy said. “And that’s that.”</p> <p>3</p><p>After a comfortable night listening to the muffled but oddly melodic snoring of Abilene the Bearded Lady, Madam Morpho found herself standing under a watery morning sun. Before her was the forbidding door of a wagon painted the glittery gray of pyrite. Calligraphed in the familiar carnival curlicues were the words The Mysterious Mr. Murdoch, and underneath that, in smaller letters, Artificer and Metallurgical Zoologist. She smoothed down her jacket, made sure her hat was on straight, and knocked on the door.</p><p>She didn’t like to think of herself as one of those foolish, tremulous women who needed their hands held through life. In fact, she had elbowed her way through university with more fortitude than all the males in her class, smirking to herself each time one of them dropped like a dead fly under the pressure. She was one of the tenacious few who had earned top marks and a degree in eclipsazoology, and it had been a struggle every day, both within the classroom and without. There was no way this Mr. Murdoch was going to be a harder creature than the world-renowned Professor Beauregard under whom she had studied . . . in more ways than one.</p><p>She knocked again, and the door opened. A small man in a flapping leather coat and enormous goggles stared at her without saying a word.</p><p>“Mr. Murdoch, good morning. I’m Madam Morpho. Master Stain sent me along—”</p><p>The man gulped and stuttered, “I-I-I’m sorry, miss, but it’s not me. I mean, I’m not him. I mean, he’s someone else.”</p><p>“Could you please procure him for me?”</p><p>The man gulped again, tugging at the tightly laced leather collar of his coat.</p> <p>“Mr. Murdoch, he doesn’t much like being bothered at b-b-breakfast, miss,” he said. “Later, perhaps?”</p><p>“Sadly, no. Master Stain’s orders. Time is of the essence.”</p><p>Trembling all over like an aged poodle, the man stood back, holding the door open for her. She pointed to her trunk, and he hurried out. Before he could make a mess of everything, she said, “Please, do take the foot, and I’ll take the front. The contents are extraordinarily fragile.”</p><p>He nodded, and together they muscled the heavy trunk into the front room of the wagon. The chamber was cluttered with broken things, the walls painted the creamy gold of parchment and utterly coated with scrawling in pen and pencil. The cursive was slanted, and several bits were crossed out with varying degrees of fury. Amid the jumble on the floor, Madam Morpho identified half of a clockwork unicorn, the ruined bits of several chairs, a brass octopus on a stick, a mirror with a deep gouge through the metal, and the cunningly painted torso of a lascivious-looking redhead. A thick rug that had once been quite lovely flopped untidily in the center.</p><p>“What in the blustering blazes, Vil?” a man shouted from behind a closed door.</p><p>Although the layout of the wagon was different from the one she now shared with Abilene, she assumed that the door separated the workshop from a personal sleeping compartment. Madam Morpho blushed, saying, “I do hope he’s out of bed and dressed. Interrupting breakfast is one thing, but—”</p><p>The door slammed behind her trunk, and she turned to discover that Vil had disappeared, leaving her to face the mysterious Mr. Murdoch alone.</p><p>“Sir, Master Stain sent me . . .” she began, and the door squeaked open just enough to emit a warm glow and the confusing but musical din of ticking clockworks.</p><p>She waited several heartbeats, but no one appeared, nor did he yell anything further. After glancing into the scarred mirror and composing her face into the professional mask she’d learned to put on when facing men who thought themselves superior, she opened the door and simply stood there, mimicking his silence.</p><p>The room inside gave the appearance of simultaneous confusion and strict order in a way that she found deeply comforting. In her own study at home, the shelves had been organized in a similar fashion that made sense only to her. Her fastidious father had forever sneered at her clutter of books, bell jars, and specimens, but she had known exactly where the very last bludvole skull belonged. She suspected Mr. Murdoch held the same knowledge of his domain. The left-hand wall was entirely covered in clocks reading various times. The right-hand wall contained shelves heavy with books and half-made creations. And the wall facing her was a pegboard of instruments and tools, settled carefully over their painted outlines.</p><p>A long worktable ran the length of the pegboard, and a man huddled over it with his back to her. He was partially uncovered, which was more than a little shocking. In the city, people rarely revealed an inch of skin unless they were in carefully locked bedrooms, where neither bludrat nor Bludman could threaten their exposed skin. At the very least, he should have worn a coat to greet a visitor, and he definitely should not have left the nape of his neck bare to the world under his ponytail.</p><p>“Mr. Murdoch—” she began again, but he shushed her.</p><p>She sighed deeply and watched as he hung up the instrument in his hand and selected a different one from the wall without standing up or turning around. Fine, then. If he was going to make her wait while he fiddled with his toys, then she would take the liberty of exploring his shelves. She skipped the rows of books on clockworks, steam power, metallurgy, and other topics that bored her. Instead, she focused on a long line of books on animals both existent and extinct.</p><p>“Oh, my stars!” she cried, plucking a volume reverently off the shelf. “You’ve got a first edition of Viviparous Mammals of Sangland! And . . . good Lord. You’ve written all over the pages! Have you any idea how much this book would have been worth without all your frenzied scrawling?”</p><p>He chuckled, and she looked up from the once-priceless tome. The man had finally spun around on his stool to face her, and she was startled to find that he was far from the cantankerous old man she had envisioned. He was, in fact, quite handsome, in an outdoorsy sort of way, if one liked that sort of thing. His hair and beard were the color of hay in the summer, his eyes the color of grass in the spring. In all, he gave her the feeling of someone who belonged in a field amid nature, a hearty specimen who could handle a scythe or a butterfly net, if there had been any reason to employ one.</p><p>“I actually find that my additions make it all the more valuable.”</p><p>“Not to a librarian.”</p><p>“A librarian has never attempted to build a juggling polanda bear.”</p><p>“Touché, sir. I am Madam Morpho.” She approached and held out her hand, and he raised an eyebrow before giving it a rough shake. “And you’re the mysterious Mr. Murdoch?”</p><p>“It would appear so,” he said with a smirk. “The generally reclusive Mr. Murdoch. Since I haven’t managed to scare you away yet, I suppose I’m obliged to ask what brings you to my workshop.”</p><p>He had not yet stood, and she studied him with a scientist’s eyes. She was struck almost immediately by a pleasing sort of raw-boned honesty about him, a robust good humor that had been conspicuously absent during her time at the university and, later, the museum. Her fellow students had seemed, as a group, to be sickly and underfed, sharp and secretive. Not so this Mr. Murdoch.</p><p>His shoulder-length hair was slightly lighter than his beard and tied back neatly. He was wearing goggles, of course, brass and brown leather, with various optional magnifying lenses bristling from the corners. She had a pair much like them herself, abandoned in London with most of her belongings. Aside from a white shirt rolled back to the elbows, he was all over brown and tan, his waistcoat and pants made of rougher stuff than she would have guessed, although once she tallied the ink and oil stains and burns, she could see why. Unlike Master Stain, he wore the newer style of trousers that went all the way to the toes of his boots. She hadn’t liked the way it looked on the university men, but it seemed to suit Mr. Murdoch. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When her eyes traveled back up and reached his face, she saw that he had also been studying her like a specimen under glass. Despite her unfashionable, faded dress, he gave her an appreciative and approving nod.</p><p>“I am newly employed by Master Stain, but I require aid in building the stage for my performers,” she said.</p><p>“You have performers and no stage? How very careless of you.”</p> <p>She glared at him and cleared her throat. Although the look had terrified the reckless lads in the Natural History Museum where she had worked under her former professor, Mr. Murdoch only continued to smirk.</p><p>“You no doubt find my behavior uncouth,” he said.</p><p>“I would expect no better from a famous recluse.”</p><p>“Metal doesn’t complain about manners,” he agreed with a shrug. “And if you want my help, you should also refrain from comment. Now, show me your performers so that I can get back to being a hermetic hermit.”</p><p>With a sigh of resignation, she retrieved her trunk and wheeled it into his workshop. When she threw open the lid, he snorted. “Novels. Naturally. People will come from miles to watch them lie there and lie.”</p> <p>“Things are not always what they seem,” she answered crisply, selecting Dignity and Discrimination. With the cover facing him, she withdrew the still form within and whispered to it. When the scarlet Monarch fluttered into the air to settle on his beard, Mr. Murdoch chuckled, careful not to disturb it.</p><p>“Touché,” he said. He held up a finger to the butterfly, and Madam Morpho was gratified at the childlike wonder in his eyes when it stepped daintily onto his fingertip.</p><p>“I have detailed sketches of the required equipment, so my time bothering you will be limited,” she said, drawing a sheath of papers from the trunk’s lid. “There are three stages, the main one including a proscenium arch. There will be aerial acrobatics, a brass band in miniature, and contraptions for exhibiting feats of strength. I will also require long filaments of solid gold.”</p><p>“Filaments? Of solid gold?”</p><p>“Leashes.”</p><p>“Naturally.”</p> <p>He placed the butterfly on top of his head and took the plans from her. After flipping through them quickly, he shook his head.</p><p>“No,” he said briskly, rolling them up into a tube and handing it to her.</p><p>As he turned back to his worktable, she spluttered, “What do you mean, no? Master Stain did not anticipate any issues. He assured me you would be most accommodating. I understand that you prefer your privacy, and I am happy to respect that, but, honestly . . .”</p><p>He spun on the stool to watch her, head cocked and pencil in hand. The Monarch’s scarlet wings flapped slowly, gently, against his golden hair.</p><p>“Honestly, Madam Morpho?”</p><p>She clutched the book against her chest more tightly than she meant to.</p><p>“I need this job, Mr. Murdoch. It is veritably the only thing standing between me and destitution, possibly even death. And without this equipment, I will be unable to perform.”</p><p>He nodded and turned to his table. As he sketched, she dashed away a traitorous tear and turned to go.</p> <p>“You misunderstood me,” he said conversationally. She stopped, one hand on her trunk’s handle. “I was not saying no to you. I was saying no to these plans.”</p><p>“The plans are based on the most famous butterfly circus in history!” she barked.</p><p>“I’m sure they are, my good lady. The thing is, we can do better.”</p><p>Just a hint of a smile tugged at the corner of her mouth. “Can we?”</p><p>“We can. Give me the morning to draw plans, and we’ll review them after lunch to see if they merit your approval.”</p><p>“Thank you, Mr. Murdoch,” she said. “Truly. And please, call me Imogen.”</p><p>“You’re welcome, Imogen,” he said, pencil scratching across the paper. “And you can continue to call me Mr. Murdoch.”</p><p>She didn’t realize until she again stood outside in the warm morning sun that she had left the trunk in his workshop and the Monarch butterfly on his head. When she tried the door again, she found it locked. The strange and reclusive man had her most valuable possessions in his wagon.</p><p>For no reason that she could name, she decided to trust him.</p><p>4</p><p>With nothing to do for the next four hours, Imogen walked back to the wagon she now shared with Abilene. Since being the Bearded Lady didn’t require much outside practice, her new roommate had been taken on as an apprentice to the costumer, a former associate of Master Stain who had recently joined the caravan after tiring of city life in Manchester. From Abi’s description of the pleasant but frenzied working conditions in the costuming wagon of Master Antonin Scabrous, Imogen wanted nothing to do with it. She had not left the clutches of one slave driver just to work herself to the bone for another.</p><p>After introducing her to Abi and making sure she would be comfortable for the night, Letitia had briefly sketched out the rhythm of life in the caravan. So long as she didn’t venture too far from the circled wagons, she would be safe from the wild blud creatures of the countryside. For a naturalist, Imogen had met very few of the wild creatures she loved to study, outside of the butterflies, especially since all of the really interesting species were extinct. The paid conveyance that had delivered her to the caravan had run over several bludbunnies with a sickening thump that made the driver laugh, and he informed her that his lifetime count was well into the thousands. But she was more than familiar with what a bludrat could do, and therefore, she resigned herself to staying close to what she must consider home, for the time being.</p><p>As she walked, her boots sinking into the moist earth, she looked down. Speaking to people had never been her strong suit, and that was before she had come across such bizarre people as the carnivalleros.</p><p>“Good morning to you, ma donna,” the Strong Man called, and she bobbed her head and crisply said, “Good morning.” He seemed a kindly sort, and she liked his mustache and warm smile. By his side, a two-headed Bludman sat scouring a set of heavy barbells with sand to remove the rust, and she flinched as both heads watched her with too-hungry eyes. As she hurried on, she heard twin exclamations of pain in her wake as the Strong Man cuffed both heads at once and said, “Show some respect, my boys! That is a lady, not a steak!”</p><p>Imogen cleared her throat and sped up, away from shadowy, bloodthirsty eyes that had no reason to be polite, considering that there were no Coppers waiting with billy clubs. Master Stain had promised her she would be perfectly safe, but the prey animal inside her wasn’t so sure.</p><p>Without any warning, a vividly painted figure swept in and tucked Imogen’s arm beneath a sleeve resplendent with lurid harlequin diamonds.</p><p>“Abi’s told me all about you, she has,” said the tall girl in a bright cockney accent, and Imogen inclined her head politely and refused to look at her bold companion. Such manners! True, she hadn’t expected much from traveling circus folk. And true, she’d never really enjoyed the leering smiles of her fellows at school or the ladies of what little polite society she had been allowed. But the girl clung to her, chattering as she imagined a monkey might chatter, and Imogen felt herself swept away in a river of the girl’s chirping words.</p><p>“Nice to have fresh blood, you know. And nice to see a new girl sharing a wagon ’stead of getting her own fancy box first off. Not that the missus even used her old box, spending all her time in Master Crim’s, but it was still a ripe slap. Since ’alf the Bluddies ran off, a few years back, it’s been a little lonely, and make no mistake. Tabitha was one of them that run off, but she ’ad no time for the likes of the Pinkies when she was here. And the Mule-faced Girl took off for the city, a-following one of Lady Letitia’s glances to get her poor ears worked on. And why, I ask you? What other skills has the girl got, besides removing her hat for Coppers? But we’ve got the new acts, trickling in. You, of course. And the new acrobats, them foreign dragon sisters. And the new juggler, and the chapeaugrapher, and the daimon dancing mistress. And Master Scabrous, of course.”</p><p>“How fascinating,” Imogen said, trying to pull her arm away, but the girl wouldn’t allow it.</p><p>“And I’m one of the veterans, if you will. Emerlie Fetching, or didn’t I mention it? Been here forever, feels like, along with Abi and Mr. Dregs and Torno and Demi and Cherie and Eblick and the twins and Veruca. And Vil and Mr. Murdoch, of course. Not that I’ve ever seen ’im.”</p><p>Emerlie paused to breathe, and Imogen burst in with “What do you mean, you’ve never seen him?”</p><p>“Exactly that.” Emerlie shook her head, making the bells on her leather bowler chime. “There’s a reason his wagon says The Mysterious Mr. Murdoch. Far as I know, ain’t no one ever seen him but Master Crim and Vil. Takes all his meals in his wagon, sends notes when he has something to say. If your clockwork breaks, you give it to Vil, and he brings it back in a few days with a rude note. Last time I sent in my wee Batty, the note said, ‘This clockwork is infinitely more fragile and intelligent than yourself. Take a care to treat him better, or next time, I’ll give him fangs.’ Memorized it, I did, so as I could tell everyone. The chuff!”</p><p>“And what do you imagine he’s like?” Imogen asked.</p><p>“Like God hisself, probably. Old, fat. Big white beard. Watches everything but never helps a soul. Mean as a snake and twice as hard. Bet it smells like a sheep wallow in that closed-up wagon of his.”</p><p>“Indeed,” Imogen murmured. “And does anyone know his given name?”</p><p>“If they do, they ain’t talking. But look here. It’s nearly lunch. Shall we?”</p><p>Imogen allowed Emerlie to drag her up the steps into the dining car, where the girl paused, head up, as if showing off a new toy. Imogen was surprised to find that she was the toy in question and that every eye in the wagon was turned to follow her, vials and spoons held dripping before open mouths.</p><p>“Hello,” she said, bowing formally with a hand to her hat.</p><p>The carnivalleros responded with nods and smiles, and Imogen was glad enough when Emerlie pulled her toward the buffet. Master Stain had mentioned that the traditional introduction in a caravan was to perform for your massed fellows, but since she did not yet have an act to display, she would be expected to make her own way among them. She had heard of worse cases of hazing and could put up with curiosity, animosity, and even a bit of ferocity, if necessary. They couldn’t be worse than the vicious young men at university who had treated her like a scapegoat and a burden, even as she surpassed them in knowledge and accomplishment. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She sat in a booth with Emerlie and Abilene and stared thoughtfully out the window to the endless green moors as they chattered, bright and silly as sparrows. Imogen subtly stroked the brooch pinned to her jacket, considering the treasure folded within. She had never had a secret before, and yet she had always felt that she had been forced to keep her true self hidden. The waving grasses and wild copses of the countryside were like a dream to her, born and bred and ensorcelled in the city as she had been, but it felt good to be free from the wills of harsh men. Master Stain as an employer seemed bemused and distant, but Mr. Murdoch was a different beast altogether. Something about him drew her in and piqued her curiosity, as if perhaps he kept certain things hidden, too.</p><p>Outside, the sky hung heavy over grasses the same green as Mr. Murdoch’s eyes. Somewhere just out of view was London. And the faster they were out of its range, the better.</p><p>5</p> <p>After lunch, Imogen all but needed a crowbar to extricate herself from Emerlie’s company. The girl was like a vivacious little kraken, her arms as firm and sticky as tentacles.</p><p>“Really, my dear, I have an important appointment to keep,” Imogen said in her sternest museum-marm voice, and Emerlie pouted and finally loosed her grip.</p><p>Knowing that her next move would be carefully watched, Imogen returned to the wagon she shared with Abilene on the pretense of fetching something. With a push of the button, the orange lamps of the hallway buzzed to life, the color oddly different from the ones in London. Imogen ran a hand along the faded handbills and posters pasted to the wood. Abi had long ago claimed the inner chamber, but at least a brief corridor led to it, keeping her from moving through Imogen’s chamber at odd hours or having access to Imogen’s belongings. She unlocked her own door and turned on the lights, quickly locking the door behind her again when she was assuredly alone.</p><p>Her instinct, of course, was to check the security of her trunk, but she didn’t want Emerlie to see her go into Mr. Murdoch’s wagon. She therefore had a few moments to spend, waiting for the inquisitive creature to get bored and plague someone else. Drawn to the lamp’s warm glow, she opened the locket she wore always as a brooch, not daring to touch what lay within but feeling its almost electrical charge nonetheless. She had to wonder if its power had anything to do with her sudden need for freedom and empowerment, her drive to be liberated from meddlesome men and their foolish love of normalcy and propriety. Clicking the locket shut, she told herself it didn’t matter.</p><p>The deed was done, and here she was.</p> <p>A raindrop thumped on the roof, then another and another, until the usual afternoon showers of a Sanglish summer played a trilling song on the flat metal. The slam of the wagon door and Abi’s heavy footsteps signaled the end of luncheon, so Imogen gladly rose and turned off the lights. At the last moment, she remembered to take up her greased parasol before darting out into the storm.</p><p>Just as she had hoped, the caravan was empty as the rain hammered down from gray skies. Thanks to the windowless nature of the Pinky wagons, there wasn’t even a way for Emerlie to spy on her as she ran to Mr. Murdoch’s car.</p><p>Her boots squelched in the mud, her hems dragging heavily. The rain seemed more ferocious outside the city, and she could feel it leeching into her bones. A wild, green scent rose from the ground, and lightning rattled overhead. In the twist of a second, her exhilaration turned to fear, and she wrenched open Mr. Murdoch’s door without knocking to escape the furor of the sudden squall.</p><p>She slammed the door and leaned back against it, sodden and dripping. Mr. Murdoch gaped at her from where he stood beside her trunk, a copy of Withering Heights open in his bare hands. The extreme impropriety of her uninvited entrance crashed down upon her, and her cheeks went hot. In London, a woman would be disgraced for such actions, and he would have been well within his rights to have her fired.</p><p>“Won’t you come in, Madam Morpho?” His words sounded cold and haughty until she saw his smile.</p><p>She took pains with the boot scraper as she recomposed herself, saying only, “Thank you, Mr. Murdoch.”</p> <p>“I see you are punctual.”</p><p>“I see you are snooping.”</p><p>He closed the book, not with the snap she expected but with the gentleness she would use to hold the Common Jezebel folded within. The Monarch still sat on his head, and she was charmed that the creature had taken a shine to him. The butterflies were a choosy lot, she had learned, and it could just as easily have fluttered well out of his reach.</p><p>“I think perhaps you mean I’m curious,” he countered. “Which I admit to. It’s a big part of my job, after all. If I don’t question everything, I could never invent anything. Every invention is itself a question, you know, and the inventor himself the answer.”</p><p>“A philosopher, too,” she muttered.</p><p>“And you’re a criminal.”</p><p>The breath stuck in her throat, her collar suddenly choking her. “I don’t know what you mean, sir.”</p><p>He set the book down gently in the trunk and crossed the space between them in a few steps. The door was solid and cold against her back, and she felt sincerely trapped. He stepped closer than he should have, his spring-green eyes boring into hers and his hands in his pockets. He was taller and more heavily built than she had guessed, his shoulders wide beyond his vest. The sharp tang of metal rose off his skin, mingled with smoke and sandalwood, and she felt herself hypnotized like a mongoose facing a cobra.</p> <p>“I didn’t invite you in,” he said. “And yet here you are.”</p><p>“I simply opened the door, sir, to escape the rain.”</p><p>“My point exactly. That’s unlawful entry.”</p><p>For a long moment, they stared at each other. She understood that in such a silence, a woman was expected to explain herself, to confess or make excuses or lie. She did none of these things. Schooled among jealous and dishonest men of science and inquiry, she knew how to hold her tongue and her ground. She had thought he had guessed her secret, but now that she looked closely, she realized he was baiting her, playing with her, possibly even flirting. Under his beard, his mouth was quirked up in a lopsided smile. Despite the chill she should have felt, soaked as she was, Imogen was overtaken with an unexpected heat.</p><p>“Your eyes are the color of antique bronze,” he said, the soft warmth of his voice catching her by surprise. She blinked, and he stepped back. “And your parasol is leaving a puddle on my boot.”</p><p>“Oh,” she said, the spell broken. “I am sorry about that. Have you a rag?”</p><p>“No. Who are you, really?”</p><p>She scoffed and shot back, “Who am I, indeed? Who are you?”</p><p>“I’m sure Miss Fetching has told you as much as anyone knows of the Mysterious Mr. Murdoch.”</p><p>“Which is practically nothing, as you have ensured through your penchant for reclusiveness and your refusal to answer simple questions.”</p><p>A chuckle rumbled in his chest as if trapped there, and he took her parasol and jabbed it into a metal umbrella stand crafted to resemble an elephant’s foot.</p><p>“Did you make that yourself, and am I truly the first person besides Vil to enter your wagon?”</p><p>“Yes, and nearly,” he answered with a nod. “Master Stain has been in a half-dozen times since I’ve been here, but the man is unusually forgiving of my quirks. I simply do not have the time or patience for ridiculous people. Or, really, people at all.”</p><p>“How very odd.” She shook out her skirts and settled her hat. “I find you reasonably temperate.”</p><p>“But you are not ridiculous.”</p><p>“Indeed not. There is little room for tomfoolery in the scholarly arts. And speaking of which, have you achieved your plans? If not, I can come back later.”</p><p>“Yes. No. Stay,” he said brashly, then chuckled again and ran a hand through his hair. “I mean to say, yes, I have completed the sketches and would be glad to discuss them. May I take your coat?”</p><p>Her hand flew again to the brooch. Her instinct was to trust him, but her instincts had often failed her. She would be sure not to leave her jacket in his wagon when she departed. And considering that no one else came into his quarters, her belongings would probably be safer here than in the car she shared with Abilene, where Emerlie would surely be snooping about. She gave him a curt nod and began gingerly to unbutton the dull black coat. Feeling the peculiar man’s eyes on her, she very nearly allowed herself to flush again and moved closer to the hearth just in case. With her back to him, she gazed into the fire and absorbed its warmth as she drew her arms from the heavy, sodden sleeves.</p><p>“Let me take that,” he said, and before she could protest, he added, “I do have a proper coat rack. Well, perhaps not proper. But functional. I improved upon the original design.” She handed him the coat without turning, and he murmured, “Ah. Your coat, like your wards, keeps the brightness hidden. I approve.”</p><p>Imogen looked up, pleased and caught out at once. He stood beside a metal coat rack designed along the lines of a many-legged octopus, admiring the Monarch-scarlet lining of her outwardly drab jacket and fingering the thick silk within. A wave of unfamiliar intimacy overtook her; surely it was still warm from her body. Before she could comment, he hung it on an elegantly curling tentacle and strode purposefully into the workshop.</p><p>“Come along!” he shouted, and she hurried to follow, wet skirts leaving a trail behind her. “The original designs were both elegant and practical, to be sure.” He leaned over a long roll of parchment pegged to the table. “But we can do better. The musical instruments, for example, were powered by a hidden calliope. But why can the butterflies themselves not play real instruments? Using a combination of wood with metal strings and monofilaments, I believe they could be coerced to flap in the correct time.”</p><p>She was speechless, and he spoke faster to fill the void.</p><p>“And the feats of strength. Abominable fakery. The barbells and kettlebells were made of paper, which would be evident under magnification. What if we actually constructed metal weights and a series of pulleys and simple machines to lift them?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Would that not be a beastly amount of trouble?” She ran a glove-clad finger over the beautifully drawn plans. “I understand Master Stain wishes me to perform as soon as possible.”</p><p>“I heard differently,” he said, giving her a meaningful look. “Master Stain has decided to stay here a few more days. We’ve been selling out every night and turning customers away, and if we stay longer, we’ll accommodate more coin and blood. London is, after all, a jolly big city. We’ll be here for another week, which will be more than enough time to build and perfect your act.”</p><p>Her mouth went dry, and she swallowed hard, throat rippling under the thick lace of her collar. “I . . . no. That can’t be right. He assured me we’d soon be on the road to Foxford.”</p> <p>Mr. Murdoch looked up sharply from his plans, his eyes narrowing. “Are you perchance running away from something in that grand metropolis?” She must have blanched, for he dropped the teasing attitude and leaned closer, looking concerned. Putting a noticeably bare hand over her black glove, he said, “I did not mean to alarm you, dear lady. You are frightened. Has someone threatened you?”</p><p>Imogen drew back quickly, knocking a jar of pencils and pens to the ground, where it shattered. Glass and ink scattered across the floor, but Mr. Murdoch paid it no mind; his focus on her face was nearly unnerving. Imogen kneeled and gathered a handful of writing instruments, noting the beautiful nibs and identifying his preferred ink by scent.</p><p>“Bathory’s Borealis,” she said, her bemusement drawing her attention away from her former panic and his nearness. She held a brass nib to her nose and sniffed deeply. It had been her father’s favorite ink, and the scent reminded her of warm afternoons in the library with a cup of tea.</p><p>“So you’re an ink aficionado as well as a naturalist,” Mr. Murdoch said softly from quite close, and Imogen looked up to find him on the floor beside her, the knees of his butternut-colored pants acquiring new stains amid the muck she’d made of his things.</p><p>“I . . . yes. In university, we were only allowed to use the head professor’s favorite ink, and I confess I rather missed my Bathory’s. I learned to write with it, you see. The warm blue is just so lovely as it ages.”</p> <p>“Enforced ink at university. Let me guess. Caw’s Pure Black?”</p><p>She dropped the quill in surprise. “How did you know?”</p><p>“I’m a King’s College escapee myself.”</p><p>A hundred questions danced on her lips, but he was moving toward her with the slow, unstoppable strength of a glacier. She had only a moment to notice the small white streak in his beard before he had leaned close to brush his lips over hers, butter-gold eyelashes swept low over closed eyes. For the briefest amount of time, Imogen melted into his kiss, the tension in her unspooling and replaced with a searing, radiating heat.</p><p>His hand came up to cup her cheek, his palm rough and scarred and warm. She longed to complete the circle of connection, and as his lips moved against hers, her arm rose to circle his neck. Unfortunately, she had forgotten that she held a bouquet of his pens, and as soon as the metal touched the fabric of his vest, she felt the clammy kiss of ink running down her wrist.</p><p>She broke away, dropping the pens and murmuring, “Oh, no. I’m so sorry, I—”</p> <p>“No matter,” he said. “I collect stains as a pastime.”</p><p>He stood and walked to his worktable for a rag, and she collected the pens again, hoping her hat hid her embarrassment. The man made her blasted jittery, and that was a fact. He slid a metal can to her, and she tucked the pens inside, leaving the guilty fountain pen nib-up. The lever must have flicked open against his chest. He held out an oil-stained rag, and she dabbed at the rivulet of deep blue ink staining the sliver of skin between her glove and the cuff of her white blouse.</p><p>“Your vest, though. Shall I—”</p><p>He turned to face her, his eyes shining with a strange fire. “I don’t know what just happened. I should never have . . . you will have noticed that I am not . . . that is . . .” At that moment, a knock sounded on the outer door, and he muttered, “That will be Vil with my supplies. Will you pardon me a moment? I very much wish to complete my sentence.”</p><p>She simply nodded, still dabbing inconsequentially at her stained skin. She knew enough of Bathory’s Borealis to expect that her flesh would be tinted a deep, dark blue for a week at least.</p><p>With a determined nod and a look of frustration, Mr. Murdoch strode to the wagon’s door to admit Vil. Imogen could just see them in the other room and moved out of Vil’s line of sight, as being alone in Mr. Murdoch’s wagon and covered in his ink made her feel uncomfortably cheeky. Poor little Vil looked as if he were constantly hunted and terrified, and possibly drinking to deal with it. His eyes were huge and fearful behind his goggles as he glanced suspiciously around the room, leaning to catch sight of her and giving her a terse nod.</p><p>He motioned Mr. Murdoch closer, and the two men whispered together for some time. Imogen couldn’t hear what was said, but she could sense Vil’s excitement and Mr. Murdoch’s growing anger. Finally, he pulled away and gruffly said, “I’m going to need proof, you understand. Solid proof.”</p><p>Vil nodded, and the two men carried in several cheap pasteboard trunks. Each rain-spattered box hit the wooden wagon floor with a clank, and Vil was gone after one more meaningful glance in her direction. Mr. Murdoch walked slowly into his workshop as if he carried a great burden and simply stared at her.</p> <p>“Are those the supplies for my butterfly circus?” she asked with a bright smile, sure that despite her careful training, she was blushing like a schoolgirl. She could still feel the imprint of his lips, a warm stamp that had settled there to stay. And he had yet to finish his sentence.</p><p>“I will need time to arrange things to my liking,” he said formally, keeping a fair distance and two trunks between them. “Perhaps you should take this fellow with you. I would hate to see an innocent crushed through my clumsy machinations.”</p><p>With a gentle finger, he retrieved the butterfly from his hair, where it had been settled for so long that Imogen had forgotten it was not a part of him.</p><p>“I don’t understand,” she said. “I don’t find you clumsy at all. And the Monarch has taken an unusual liking to you. Do you not care for her company?”</p><p>“I thought her a charming companion, to be sure.” He watched the butterfly slowly flap scarlet-scattered wings. “But I feel she will be with us all too short a time for me to become attached. Perhaps you have not heard? She is a fugitive.”</p><p>“A fugitive?” She had to force herself to hold her chin up, to stop wringing her hands.</p><p>“She was apparently stolen from the vaults of the Natural History Museum in London and is worth more than this entire caravan.”</p><p>“And what will you do with this knowledge?”</p><p>“What one does with butterflies—or what one did, when they existed. I will set her free.”</p><p>With a gentle flick of his finger, he sent the Monarch fluttering into the air, and Imogen held out a black-gloved palm. The butterfly landed and flapped there, as if confused. Mr. Murdoch began to sort through the trunks, and she turned her back to whisper to the Monarch and tuck the fragile, folded body back into its book.</p><p>“Please return tomorrow morning after breakfast, and we’ll begin building the circus,” he said without looking up.</p><p>“But you said—”</p><p>He looked up, his eyes meeting hers with a searing jolt that told her that no matter what his posture and words said, the kiss was as much on his mind as it was on hers.</p><p>“I gave my word. I will build this circus, no matter the circumstances of the performers. Or their mistress.”</p><p>“Thank you, Mr. Murdoch.”</p><p>“Thank me if you’re still here when it’s complete.” He looked down at the wooden floor, where a muddy trail marked her skirt’s passing. “I would suggest you don’t mention your act to anyone else, nor should you say that we’re working together. There are people here who would do worse than send a note to the Coppers for the price on one butterfly’s head, much less the head of its thief.”</p><p>“Only you and Master Criminy and Letitia know of the butterflies,” she said carefully.</p><p>“Then I will keep your secret, provided you keep mine.”</p><p>“And my trunk?” She stared down into the nest of books and hidden miracles. Before, the trunk had held hope. Now, in the wrong hands, it held evidence enough to hang her.</p><p>“If you’ll trust me, I think I know how best to keep your charges safe.”</p><p>Their eyes met over the trunk. She felt as if she stood on a precipice, one step away from freedom or doom.</p><p>“I find that I trust you, Mr. Murdoch.”</p><p>“God help you, Madam Morpho.”</p><p>6</p><p>When she slipped from his trailer with her jacket askew and shockingly unbuttoned, the rain had turned from an assault to a gentle annoyance. She turned back to his door with a curse, but he was already holding her parasol out to her. When the door closed a second time, she heard the heavy bolts slide home and knew she had been dismissed.</p><p>What a strange man he was! Imogen’s history with men was rather limited, but he was nothing like her strict and misogynistic father, nor was he remotely like the only other man she’d known intimately, if one could call it that. Even her peers at King’s College had been cruel and treated her as an object or an opponent for four long years, not even seeing her as a woman. She couldn’t count the times she had been spat upon, and there had once been an attempt to throw acid in her face, foiled only by the fact that she was almost always hiding behind a book. Since her first day at university, she had realized that men were a species she couldn’t understand, and she had therefore avoided them as much as possible in favor of more peaceable and long-dead subjects.</p><p>Still, there was a certain warmth about this Mr. Murdoch, a sort of unassuming good humor that drew her in more than she liked to admit. A small portion of his odd behavior could be written off as a lack of polite society, but she sensed in him a fellow scientific mind with cogs too busy turning to worry overmuch about propriety. And now he knew that she was a thief, and a clumsy one at that. But if she had understood correctly, he would help her anyway. She could only hope that Vil could be trusted to keep her secret—and that no one like Emerlie ever found out. She had been counting on the caravan staying far from city news, and also on her theft not being discovered for some time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Wrong on both counts.</p><p>Imogen realized she’d been huddling under her paltry parasol in front of Mr. Murdoch’s wagon, frowning into the rain, and she hurried off toward her own car, although she had no idea what she would do there. Abilene was a nice girl, to be sure, but a simple soul with interests running to embroidery and the collecting of out-of-date fashion books. And Imogen herself had little to do, considering she had hollowed out all of her books to house the butterflies. Perhaps some other carnivalleros were keeping dry in the dining car?</p><p>But no. That door was locked. The cooks must have had rules about people mucking around and begging scraps between meals. As she stood there, she felt something tug her boot lace and gave a screech. She danced back and found her first adorably bewhiskered specimen of Oryctolagus cuniculus sanguinis, or the common European bludbunny.</p> <p>“Oh, hello, specimen,” she said, leaning down to look at the sodden thing. It was the tan of caramel and would surely have been fluffy and soft if not for the fact that it was soaked to the bone, muddy, and a bit blood-spattered about the mouth.</p><p>It looked at her with bright red eyes and lunged for her boot again. She kicked it lightly, but it just rolled over and came for her with a hiss.</p><p>“Allow me to remove that inconvenience for you, Madam Morpho.”</p><p>She looked up from under her parasol to find Criminy Stain himself, hair streaming and cravat undone, waiting in the rain. Here, more so than in his wagon, she could see the Bludman shining through. If the wild eyes and pointy smile weren’t enough to convince her, the way he picked up the bunny by the ears and twisted its neck with a pop told her all she needed to know about the difference between their species.</p><p>He fished a bit of string out of his waistcoat and tied it around the rabbit’s back feet before hooking the string over the dining car’s doorknob.</p> <p>“Don’t look so horrified,” he said with a chuckle. “My own wife nearly yarked, first time she saw me do that. Now she knows better. It’s one more bite of stew for everyone and a little less work for Cook. Besides”—he stepped close, cocking his head at her, and she watched the water droplets roll off the sharp planes of his face—“I think you’re too intelligent and practical a woman to start feeling sorry for bloodsuckers.”</p><p>“I have not had the privilege of observing the bludbunny in its native environment before,” she said, bending over to pull back the rabbit’s lips and reveal the cunningly hidden fangs within. “And yet, even in the university’s labs, they couldn’t be tamed. One of my fellows, specializing in the sanguinis mutations, even went so far as to remove all of a bludbunny’s teeth. The vicious little monster still attacked everything that moved and could gum one’s finger hard enough to cause a bruise.”</p><p>“Are you finding life outside of the city frightening, then?” he asked politely, and it was her turn to chuckle ruefully.</p><p>“The only thing that frightens me is that my past will hunt me down and drag me back,” she said. “I would imagine you’ve heard?”</p><p>He grinned. “There aren’t many cut out for caravan life, my girl. Most of those who stick around are running away from something or other. We’re a band of misfits, but we protect our own.”</p><p>“I don’t want to cause any problems for you.”</p> <p>“Piffle. Problems are strictly forbidden in my caravan. How did you find our Mr. Murdoch?”</p><p>“The man is peculiar, indeed.” She fiddled with the bludbunny’s claws. “But his improvements on the original design of my butterfly circus are rather brilliant. Tell me, is it true that no one has been in his wagon besides you and Vil?”</p><p>With a knowing smile, Criminy held out his rain-sodden arm, and she gently placed the fingertips of her glove in the appropriate place and allowed him to lead her. Her parasol didn’t quite cover him, but he didn’t seem to mind. Although she had been raised to fear Bludmen and had never actually touched one before, she found his company oddly soothing.</p><p>“As far as I know it, that’s correct,” he said, “but Mr. Murdoch keeps his deepest mysteries hidden even from me. He’s the only carnivallero on whom my wife, Letitia, hasn’t glanced, mainly because I’ve never met a finer hand with clockworks and can’t bear to lose him. He never comes outside, and no one but Vil ever goes in. They arrived on my doorstep together, and there’s not a loose lip among them. I’m surprised he hasn’t turned blind like a cavefish by now.”</p><p>“No, he’s actually rather sunny,” she said without thinking, and he threw back his head and laughed.</p><p>They were at her wagon now, and she sighed in resignation. Her first real day out of London, and there was nothing to see but rain and mutated rabbits. She didn’t want to go inside, trapped again between windowless walls.</p><p>“I’ve taken the liberty of leaving some books in your hallway,” Criminy said with a bow. “You struck me as a thinking woman who might need a little escape. Just stay inside and away from prying eyes and sharp teeth, eh?”</p><p>“Thank you, Master Stain,” she said, squeezing his arm before opening her door. “I don’t know why you’re being so kind to me, but I really do appreciate it.”</p> <p>“ ‘There are more things in heaven and earth . . . than are dreamt of in your philosophy,’ ” he said. “And a man knows when he’s got to do exactly what his wife says, or else.”</p><p>With one last charming grin, he bowed and strode off into the rain, disappearing into the haze of the hills as if out for a walk on the most lovely of summer days. Neatly stacked by her door, she found four novels, all of them racy pulp romances that had been forbidden first in her father’s house and then at university and the drudgery beyond. With her own wicked grin, she grabbed them all and retired to her room to read the first one straight through in blissful, fascinated silence as her boots dried by the fire.</p><p>7</p><p>She stood before her mirror the next morning while everyone else was at breakfast. Emerlie had been a little too nosy at dinner the night before, and Imogen wished to avoid dancing the dance of polite society and pleasant lies. She had taken extra care getting ready, selecting a small hat and fitted sleeves that wouldn’t get in the way too much while working, although she still wasn’t sure how she could help the mechanist with his more complicated plans. Folding and gluing paper she could do; welding metal was beyond her. She glanced up and down in the cloudy mirror, tugging at her blouse. Her costume was as plain as a Londoner could get—a simple blouse, skirt, and long jacket over the requisite corset, and she had never bothered with the aggressive face paint other women so favored. The ink stain was still on her wrist, of course.</p><p>Bugger it all, it would have to do. Why was she trying to impress him, anyway? They were partners. The kiss had been some silliness, probably as much of an experiment for him as for her. What a strange place caravans must be, if people found themselves kissing right after meeting! Shaking her head at her own silliness, she tugged down her sleeve and marched through the mud around the wagons to knock at his door before she lost her nerve.</p><p>“Come in,” he called, and she stepped in to find him standing in shirt and trousers before the jagged, dull gray beginnings of the butterfly circus. From the looks of it, he had been working all night.</p><p>She stared at her clasped hands, fighting a blush. “I can come back when you’re dressed.”</p><p>“I’m dressed enough for my own wagon, I hope. You’ll find that things are different in the caravan. Not that I cared about following popular beliefs even when I lived in the city.”</p><p>She cleared her throat. “I know that, as a female scholar, I can’t really argue propriety, but at least put on your boots. I can see one of your toes, for the love of heaven!”</p><p>“Bother my toes, and bugger propriety. There is nothing wrong with toes, nor with seeking knowledge, regardless of your gender. I don’t think your intelligence any less moral or useful than my own. I have always had a way with metal, an ability to bring it to life that many consider unnatural. I don’t necessarily understand how or why I came to such a prodigal talent, but I’m glad for it, and it’s a part of me. Don’t you feel that way about your mind?”</p><p>Her hands flew to her hat, smoothing the wisps of hair that had escaped it. “You wish to discuss philosophy and my dangerous past?”</p><p>“Oh, do take off your hat,” he said. “You’re perfectly safe in here, and I’m sure that’s got to be beastly uncomfortable.”</p><p>“Mr. Murdoch, are you being fresh?”</p><p>“I’m being practical.”</p><p>“This is the smallest hat I own.”</p><p>“Precisely.”</p><p>With a sigh of long suffering, she turned back to the ornate oval mirror by the door and unbuttoned the collar connecting her hat to her jacket. He took the little topper from her and whisked it away to the octopus coat rack. Her hair, of course, was tightly bunned, just the right shape to fit within the hat, and she sheepishly tucked a few strands behind her ears. It did feel nice, the air on her neck. And it would be easier to work without the hat brim bumping into things. But he was looking at her with such intensity that she had to take a step back.</p><p>“I had been betting myself that your hair was red, fiery as you are.”</p><p>“Brown,” she shot back. “Sorry to disappoint.”</p><p>“But a nice, spicy, cinnamon brown.”</p><p>“You will find, Mr. Murdoch, that I am much like my charges. The bright butterflies get all the press, but the great majority of them are dull brown with barely an eye spot to differentiate them.”</p><p>She arranged her collar, partly dreading his response. True, she didn’t take pains to showcase her beauty. But every woman liked to think herself as beautiful and magical as a glimmering Blue Morpho butterfly, even if she was still in pupa stage and waiting to bloom into a dull brown moth. When he didn’t immediately offer a small compliment, she hated herself for blushing and wished for the thousandth time that her eyes were a more interesting shade of brown. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She was finally forced to look at him, and he gazed at her as if in pain.</p><p>“Imogen,” he said, voice ragged as he stepped closer to her, his feet brushing the wide swing of her skirts. “Are you aware that I haven’t seen a woman this close in more than six years?”</p><p>“That seems excessive,” she murmured. “Are we such fierce creatures?”</p> <p>He took another step, his knees denting her skirt. “Machines are so much easier to understand,” he said. “I can puzzle out whatever ails them. But people. So many intricacies, so many signals. It has been a long time since I’ve spoken with anyone but Vil or communicated with anything but a pen. You’re going to have to forgive me if I muck it up. I’ve lost the ways of niceties.”</p><p>She fumbled with her gloves, forced into confession by his pressing nearness. “I don’t know that I ever knew them. I was barely raised by my father, who seemed to think women were less interesting than spent egg sacks. I went to university just to spite him. I was the only woman there and, as such, had no time for anything but scholarship if I was to keep up with men who longed to watch me fail and professors who thought me a joke. I can’t even keep up with Emerlie’s chatter.”</p><p>He chuckled. “From what I can tell, no one can keep up with Emerlie.”</p><p>“And how would you know?”</p><p>He ran a hand through his hair and smoothed down his beard, but he wouldn’t quite meet her eyes. “I hear things from Vil, of course.”</p> <p>“And?”</p><p>“And I devised a system for watching the caravan. It does get a bit boring in here, especially when I’ve burned a finger or otherwise injured myself and can’t work.”</p><p>“You simply must show me,” she said, as solemn as an owl.</p><p>The awkwardness fled, replaced by his mischievous smile as he led her to the workshop. There were two closed doors in the inner room, which she had assumed held a closet and a bathroom, much like her own chamber. He opened the one on the right, and it was indeed an emptied-out closet. The only thing within was a strange apparatus of pipes hanging from the ceiling and ending in a rigid set of brass goggles with well-worn leather cups.</p><p>“After hearing Criminy mention how handy the periscope was during a submarine adventure a few years ago, I decided to make my own.” He turned the goggles toward her with the vestige of a bow. “Have a look.”</p><p>Imogen moved past him with the fervor of a scientist approaching a new specimen, her skirts whispering against his trousers. He should have moved away to give her room, but instead, he leaned close as she set her eyes to the eyepieces.</p> <p>“There are four different lenses, one pointing in each direction. The device also functions as a megaphone, so the carnivalleros don’t know they’re being watched.”</p><p>“Mesmerizing,” she murmured.</p><p>The drizzle had slowed, and just the smallest slice of sun peeked out through the clouds. She could see Emerlie trying to talk to the acrobats and failing, thanks to the language barrier or the twin girls’ particular cleverness in feigning one. The two-headed Bludman was sneaking around the wagon labeled Bolted Burlesque with a sack of something Imogen didn’t care to contemplate. In the circle behind the wagons, her view was blocked by a strange patchwork tent. And Criminy and Letitia stood together, arm-in-arm and whispering as they looked far off over the hills. She could see the faintest smudge moving through the high grasses but couldn’t discern the shape.</p><p>“Can I see more to the right, please? And magnified?”</p><p>“At your service, Madam.”</p><p>His arm brushed hers as he leaned forward to flick a switch and rotate a dial. The image jumped to a different view, then focused in. She gasped and pressed closer, straining against the leather.</p><p>“Coppers! On bludmares. Criminy and Letitia look worried.”</p><p>“Probably not half as worried as you look.”</p> <p>She was shaking as she pulled back from the goggles. “Oh, heavens. What do we do?”</p><p>He nodded, looking determined. “The smart thing. We hide. Did you see dogs?”</p><p>“No. Just two men on horseback.”</p><p>“Then there’s a good chance we’ll muddle through.”</p><p>“But my trunk! The butterflies! They’ll be found.”</p><p>He set his hands on her shoulders, pinning her to the ground in a way that was strangely comforting. In the city, things were so big and busy and bustling, but she had known her place. Out in the country for the first time, she was dogged by a sense of her own small stature in the vast world. With no family, no money, and no husband, she was simply a misfortune waiting to happen. No matter how many times she forced herself to put her chin up and push through, she felt in that moment as tiny and hapless as a leaf on the wind.</p><p>“Trust me,” he said with a gentle smile.</p><p>She glanced at her trunk, which was pushed against the wall. He had stacked the pasteboard trunks of supplies from London on top of it, along with several piles of his own books. Imogen felt a brief moment of annoyance at his presumption, but it was quickly replaced with relief at the canny fortune afforded by his random mess. Perhaps the Coppers wouldn’t search his wagon at all, and if they did, there was a chance they would prefer to let the trunk go unopened rather than move hundreds of precariously teetering books.</p><p>A coded knock sounded at the door, making Imogen jump.</p><p>“Don’t worry yet. That’ll be Vil.” Mr. Murdoch ran to the door to whisper with Vil before returning to her side. “You’re right. They’re looking for you. We’re going to hide in a secret compartment. I’m going to go up first, and then I’ll help you ascend. How are you with small spaces?”</p><p>“Tolerable. I sometimes hid in the dumbwaiter as a child.”</p><p>“Fair enough.”</p><p>He squeezed sideways into the closet, past the goggles and into the darkness. “There aren’t any rungs, sadly. Too conspicuous. But I’ll do most of the work. Ready?”</p><p>His voice was muffled and yet echoing, and she tucked her skirts close as she slipped into the closet. It smelled of old wood and pipe smoke and just the faintest hint of the warm metal and oil musk she associated with his wagon.</p><p>“Up here.” She could barely see his hand hovering above her, bare and waiting for her own.</p><p>Imogen had never climbed a tree, never ridden a horse, never even enjoyed London’s notorious carousel. Her father had considered all such activities vexing to his schedule and unnecessary for the likes of a useless female. In fact, the only thing she had any history at all with climbing was the ladder in the library, and so she flicked back her skirts and set her foot onto a crosspiece. She reached up, and he caught her hand. She found another foothold, and bit by bit, they managed to wedge her and her voluminous skirts onto a narrow ledge hidden by the wagon’s apparently false ceiling. Imogen maneuvered until she was on her belly, pleased to find that although the space wasn’t tall, it seemed to cover the entire top of the wagon and therefore afforded considerable horizontal room to scoot away from Mr. Murdoch’s body.</p><p>Until the persistent man slid closer to whisper in her ear, that is.</p><p>“We must be completely silent, should they enter the wagon. There is but a thin layer of board between us and detection.”</p><p>Metal scraped on wood with a rustle of fabric below their perch, the sound of clothes on hangers shifting along the rail. The little sliver of light that had been shining in from the closet door was abruptly snuffed out as the door closed, and Imogen heard Vil’s footsteps tapping around the wagon.</p><p>“Will we be able to hear them, too?” she asked.</p><p>He leaned closer, his whisper ruffling the loose wisps of hair over her ear.</p><p>“Every word.”</p><p>She shifted, finding the position awkward. A woman’s required corset and skirts were ridiculous enough when one was reading or writing or dusting specimens in a museum. But climbing and grubbing about on one’s belly were both uncomfortable and rather awkward. At least her hat fit under the low roof . . .</p><p>But no. She gasped. Her hat, coat, and precious brooch were hanging on the coatrack below, in plain sight of the Coppers.</p><p>“My hat,” she squeaked, and he let out a low growl of frustration.</p><p>“Men don’t notice such things, and worrying won’t change it. Don’t dwell on it.”</p><p>Imogen sighed in resignation and tugged at her collar, feeling as if she were being choked with a man’s heavy hands and a lifetime’s worth of library dust.</p><p>He must have misinterpreted her distress, as he urgently whispered, “I’m sorry I can’t offer more comfortable accommodations. I hate to think of what the dust will do to your lovely dress.”</p><p>“It’s better than being caught.” She gulped, barely able to breathe. “You know as well as I do that I would be hanged for what I’ve done.”</p><p>He scooted even closer, his forearm lying on the wood boards alongside hers.</p><p>“You didn’t leave just for the chance to join the caravan. What are you really running from?”</p><p>Imogen didn’t know if it was the anonymity of the darkness or the forced physical intimacy or the warmth he radiated, but the words seemed to form themselves before she had even considered the question.</p><p>“My mother died when I was very young, and my father prized me somewhere between the aged parrot in the parlor and the stuffed bear in the front hall. Aside from one hour a day of rigid lessons, he rarely acknowledged me, offering no warmth or love. I think he actually considered me an experiment. If he came across a talking bludrat, he would have treated it no differently. I longed to impress him or, at the very least, to prove to him that I was worthwhile. I studied in secret after I had finished his assignments, won several certificates through correspondence school, and received an invitation to study at King’s College under the name John Bumble.”</p><p>“So Imogen Morpho isn’t your real name?”</p><p>She snorted. “You must be joking. Of course not. I was born Jane Bumble, the plainest, most solid of old London names. But in my most secret thoughts, I dreamed my name was Imogen and that I was destined for great things.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He paused for a second, and she could nearly hear him making the connections.</p><p>“Surely your father isn’t Randolf Bumble, dean of the London Zoo?”</p><p>“Naturally.”</p> <p>“I didn’t even know he had a daughter.”</p><p>“Few did.”</p><p>“Cripes, I barely knew he was human. Most austere man I’ve ever met, and that’s coming from someone who builds automatons for a living.”</p><p>She dropped her forehead to the wood, fighting tears. “You have pinned the tragedy of my childhood in a single sentence, sir.”</p><p>His arm twisted against her sleeve, his hand covering hers with a searing heat. “Do go on.”</p> <p>“Naturally, when I arrived for my first class at university, the scandal was great. I still find it amazing that in such advanced times as ours, one of the greatest universities of the world persists in rejecting half of the population due to gender. With the help of my maid, I had secretly sewn a conservative female version of the classic King’s College uniform, and my hope was that under my robe, it would be little noticed.”</p><p>“That you never considered the telling beauty of your face is almost laughable.”</p><p>“I was raised in near isolation. I saw the maids, the cooks. I had a governess briefly, but Father dismissed her for hysterics, by which I mean he once caught her hugging me when I broke a finger at age eight. There were few mirrors in my house, as they reminded him of my mother. I had very little idea of feminine beauty.”</p><p>“But they let you study?”</p><p>“After a great deal of debate, yes. I had thoroughly scoured the laws and had an answer to every inquiry. They could not refuse me without causing a great stir. As it was, I was allowed to continue, provided I did not reveal my scholarship to anyone outside of the college. My father was understandably furious and disowned me that very day.”</p><p>His hand tightened around hers in what she took as both anger and sympathy. “That is unspeakably cruel.”</p> <p>“And yet I took a fierce joy in it.” She chuckled. “There I was, penniless, with nothing but my class robes and a handful of secondhand books. And yet it was as if a weight had been lifted from my soul. After classes that day, I found myself sitting on the steps of the library, trying to puzzle out where I might sleep for the night without being eaten by bludrats. And that’s where Professor Beauregard found me and offered me use of the cottage on his estate in exchange for my employment in the eclipsazoology wing of the Natural History Museum. Despite his many similarities to my father in harshness, manners, and misogyny, I accepted on the spot. That night, asleep in my own bed for the first time, I felt as if I had begun a bright new period of my life. I was an independent woman at last.”</p><p>“I assume from your bitterness that such was not the case?”</p><p>“Indeed not. Professor Beauregard had more planned for me than simply cataloging new specimens in the museum.”</p><p>“Did he?”</p><p>She cleared her throat meaningfully. “He did. I was practically a slave, entirely dependent on his goodwill. I went to class in the morning and worked all night and every weekend. Even the maids had a half-day on Sunday, but not I. If his papers weren’t graded perfectly, if his museum wasn’t kept up to the strictest standards, if I didn’t make myself available in every possible way, I was well aware that I would find myself stripped of my degree and on the streets without a friend in the city and with nowhere to go but the poorhouse or the whorehouse.”</p><p>“And in the end?”</p><p>“In the end, he broke my spirit, took my innocence, taught me the cruel ways of the world, and made it clear that life among vagrants in a caravan would most likely treat me better than a life of control by the most wealthy and erudite scholar of London’s most celebrated circles.”</p><p>For a moment, the only sound in the intimate silence was their breathing and the subtle rasp of clothing on wood. The stays of her corset dug into her stomach painfully, helping her to hold back the deep, whooping breaths that might have allowed tears.</p> <p>“I am sorry that someone who should have protected you used you most cruelly for his own ends,” he whispered. “Well do I know that there is nothing more dangerous than a man who thinks he knows everything.”</p><p>“To be honest, I did not anticipate that he would discover the missing specimens so soon.”</p><p>“Men who can’t be trusted trust no one,” he said. “I’m surprised he allowed you access to them in the first place.”</p><p>“It was a fortuitous accident. I was cataloging a donation from a patron. He expected me to find nothing but dusty boxes, useless portfolios, and old handbills.”</p><p>“Instead, you found a miracle.”</p><p>“I thought so. He saw only an opportunity.”</p><p>She felt she had said too much, that he would press her further for details on the magic behind the butterflies or the other things her professor had claimed of her. Another pause strung out, Vil’s nervous scuttling below the only noise. Mr. Murdoch leaned close to her ear and whispered something so softly she could barely hear it.</p><p>“Beg pardon?” she asked, breathless from more than her crushing stays.</p><p>“Never mind,” was his only answer. Before she could press him, a sharp knock sounded on the door below.</p><p>“It’s open,” Vil called, louder than necessary.</p><p>“We must be silent until they are gone.” She felt his breath so close that she went light-headed. “Don’t move a muscle, if you can help it. I’ll not let them take you, whatever happens.”</p><p>He squeezed her hand again but did not let go.</p><p>8</p><p>The door opened, bringing the cadence of harsh voices and hobnail boots. She traced the sound as it moved from the outer chamber and into the workshop, right below her. Over the frantic thumping of her heart, she could make out most of the words.</p><p>“Vilhelm Murdoch?” The Copper’s London accent was no comfort, nor was his gruff tone.</p><p>“Th-th-that’s me,” Vil stuttered.</p><p>“Papers.”</p><p>Boots moved around the workshop, and Imogen could imagine the Coppers walking, stooping, poking a clock here and lifting a tool there, hunting for places where stolen specimens might be hidden. A fist sounded against the wood walls, but the note was solid, and the boots moved onward. For the first time, Imogen realized that she had not seen a bed in either room of the wagon and wondered where it might be hidden or if perhaps her mysterious companion never slept at all.</p><p>“Mr. Murdoch, you are aware that we hunt a fugitive?”</p><p>“I r-r-read about it in the papers. A w-w-woman, it said?”</p><p>“Indeed. Medium stature, slender build, last seen dressed as a King’s College fellow.”</p><p>“Ain’t been no one of that sort in my wagon. I’d have noticed.”</p><p>After a dangerous silence, the Copper said, “Then you won’t mind if we have a look around.”</p><p>“N-n-no, sir. Please do. I don’t need dangerous women mucking up the clockworks.”</p><p>Boots clunked around, and Mr. Murdoch’s hand squeezed hers again. Just then, it occurred to her that Vil had claimed to be Mr. Murdoch. Vilhelm Murdoch. She turned her head to face the man lying beside her in the dark and longed to ask him exactly who he was.</p><p>“Lots of books,” a different Copper’s voice growled, as if that were a problem.</p><p>“I am a literary man,” Vil said with offended conviction. “And much of my work is conjectural. See here, the diagrams?”</p><p>The Copper snorted in disgust, and Imogen heard a book fall with a thump. Frankly, she was amazed that Vil could utter such a sentence without stuttering.</p><p>“What’s in the trunks?”</p><p>“Metal, of course. F-f-for my creations.” Snap open, firm snap shut.</p><p>“What’s in here?”</p><p>“Toilets.” Door opened, door shut.</p><p>“What about over here?”</p><p>“A closet.”</p><p>Imogen held her breath as the door below their perch opened, letting in the faintest trace of light. With her head turned, she found herself looking into the wide green eyes of the mysterious man by her side, his mouth barely open and a look of wonder and worry on his face.</p><p>“Lots of suits for a recluse,” the Copper said.</p><p>“I like to stay well c-covered, sir. With so many Bludmen about, you can’t blame me.”</p><p>To Imogen’s boundless relief and amazement, the door closed, bathing them in darkness again.</p><p>“Too true, too true,” the Copper said, far more amiably. “But if you’re leery of them, why in Sang would you work for one of the bloodthirsty bastards?”</p><p>Vil barked a harsh laugh. “If you can’t b-b-beat them, join them. I keep mostly to myself, in any case.”</p><p>“That’s what we heard,” the Copper said. “Sorry to disturb you, Mr. Murdoch. Here’s a broadsheet, should you come across any strange women.”</p><p>A moment of silence passed, and Imogen imagined Vil reading the bill.</p><p>“This woman,” he said. “She could be anyone.”</p><p>The Copper grunted. “Aye. Apparently, neither her father nor her employer could give an accurate description to the artist. Should you have the unfortunate luck to meet her, you’ll know her by her dangerous mind and manly behavior. Betraying creature actually bribed her way into King’s College to study with the men. Unnatural, if you ask me.”</p><p>“Most unnatural,” Vil agreed.</p><p>Two sets of boots marched across the wagon, and the door opened.</p><p>“B-b-best of luck to you, sirs,” Vil called.</p><p>“To you as well, Mr. Murdoch,” one of the Coppers answered.</p><p>The door closed, and Imogen exhaled, laying her cheek along the smooth, cold wood of the ledge. She felt the tension likewise uncoil from the body of the man beside her, and he reached out to cup her face in the darkness.</p><p>“Henry Gladstone,” he whispered.</p><p>“What?”</p><p>“That’s my real name.”</p><p>It caught her entirely by surprise, the fever of his touch and his words. Before she could react or figure out why the name was familiar or stop herself from leaning her cheek gently into his palm, the closet door opened. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I b-b-believe you are safe,” Vil said, and her companion answered, “Thank you, Vil.”</p><p>In the faint light of the doorway, their eyes met again.</p><p>“I believe you have some explaining to do, Mr. Gladstone,” she murmured.</p> <p>“Call me Henry,” he said.</p><p>9</p><p>Getting down from their secret perch was nearly as difficult as getting up, possibly more so, thanks to the fact that Imogen was utterly discombobulated. No man had ever touched her face, much less looked at her with longing. Her assignations with Beauregard had been as swift and cold as shop transactions, and she had been neither warmed nor satisfied by his brief, harsh caresses.</p><p>The first time he had caught her and used her, she had found a quiet corner of the museum’s cellar vault and sobbed her heart out into a handkerchief. After that, she had steeled herself to be just as remote and aloof, to consider it a duty and the fine line between her and a life of begging on the streets, a fallen woman. She had never felt her professor’s hands without gloves, never known a moment of tenderness.</p><p>But now! That one ungloved hand on her face had seemed as intimate as a whisper in the night, and she was not yet ready to face him again by light of day.</p> <p>The moment her boots hit the ground, she nearly collapsed. Mr. Murdoch . . . no. Henry. Whatever his name was, he landed beside her and put a hand on her arm to steady her. The connection was no less shocking than the last touch, and she hid her disquiet by pressing her eyes to the leather cups of the periscope goggles and gazing at the caravan outside. The hillside that had held the Coppers when last she looked was now empty.</p><p>“You’ll want to see the other side, I wager,” Henry murmured as he adjusted the dials and her view.</p><p>The scene was eerie. All of the carnivalleros sat on the roofs of their wagons, their eyes pinned to the one next door to Mr. Murdoch’s. That was the engine, and Criminy Stain stood outside it, facing the door, arms crossed and eyebrows drown down in carefully controlled anger.</p><p>“May I?”</p><p>She backed away and let Henry look, her eyes straying to his backside. Imogen had never seen a man without a tailcoat or a university gown and found herself transfixed by the neat cut of his pants over lean hips, just a triangle of his shirt flashing from under his vest.</p><p>“So the engine wagon should be their last stop, then,” he said. “That’s Vil’s, you know. He hasn’t anything painted on the side, as he’s neither an act nor a figure of mystery. Poor lad has to be satisfied enough to see his own name painted on my trailer.”</p> <p>“And what of your name?”</p><p>“You already know more of me than is safe.”</p><p>He stepped away from the goggles, arms crossed and face stern and watchful. She began to wonder if he regretted their whispered conversation in the dark, secretive crawlspace, and she didn’t want to think too sharply about how much of her own soul she had bared. Glancing around the room for an occupation, she sought something, anything to keep him from looking at her like that and making her heart race. With a few quick steps, she began moving his books off her trunk, stacking them neatly on the floor. He should have offered to help, but he just watched her struggling under the weight of the great tomes as if it were rather amusing.</p><p>“Honestly, did you select only the most burdensome books to anchor my trunk?”</p><p>“My dear lady, you’re as jittery as a one-legged crow.”</p><p>She set down the encyclopedia with a slight puff of dust and drew herself up to her full height, giving him the look she had given any of the college fellows who deigned to ridicule her.</p><p>“My entire life is buried in this trunk and was very nearly discovered by those horrid hooligans,” she said. “Of course, I’m anxious about their safety.”</p><p>“Your butterflies are trapped in some fascinating state of suspended animation, Imogen, and, as such, require neither oxygen nor attention. You’re just feeling busy. It is a simple remainder from such a fright. But you needn’t worry. Your entire life is not, in fact, buried in that trunk.”</p> <p>She took a shuddering breath. “What do you mean by that?”</p><p>He gave her such a slow, honey-sweet smile that she thought he might reach for her again, touch her face, or dust her lips with another kiss. Instead, he walked to the bookshelf and selected a book.</p><p>“Olivia Twist. Let me guess. One of your favorites?”</p><p>“That’s mine! You beastly, beastly man!” Then she realized that his entire bookshelf was covered in her books. She knew every single volume, considering that she had spent the last year of her life buying them one by one from used-book sellers and hollowing them out with a penknife.</p><p>“Rather elegant a solution, don’t you think? Hiding your darlings in plain sight?”</p><p>“What if they’d picked up a book? What if they’d opened it?”</p><p>He snorted. “Do you suppose Coppers are often bibliophiles? That men trained to hurt, to kill, to capture, and especially to hate anyone but their own species—do you think that they are learned men?”</p><p>She ran a hand along the mismatched spines of her precious books. Even though she had known, upon buying them, that they would be destroyed for the most gallant of causes, she had still taken pains to buy the books she loved. It was as if by cutting out their hearts, she was still able to give them souls. Her butterflies.</p><p>Quickly, cleverly, she sought out the first book. He had arranged them in alphabetical order, the tidy creature, and she found it easily enough. Fantastic Conjectures. One of her favorites. She plucked it from its place on the shelf and opened it, careful to keep the spine facing him. With one look inside, her eyes rolled heavenward in silent thanks. Her beloved Blue Morpho was in perfect form despite time and travel and his possibly careless handling.</p><p>But no. Imogen was starting to see that nothing he did was careless.</p><p>“But what if they had opened one?” she asked again.</p><p>His face went dark, his eyes darting to the corner, where a large lump sat, covered in a canvas tarp.</p><p>“I had a plan for that, too,” he said.</p><p>“What is that, under the tarp?”</p><p>“You don’t want to know.”</p><p>“I am a scientific woman, Mr. Gladstone. The most curious of creatures.”</p><p>“Curiosity killed the cat. That’s what they say, is it not?”</p><p>“Where I came from, it was mostly bludrats or my father with a grain sack and a visit to the Thames.”</p><p>His eyes softened, and he held out a hand to her. “I think the world has been unnecessarily cruel to you,” he said softly.</p><p>She stared at his hand a moment before taking it, unsure of what he wanted. Would he pull her close for another kiss, perhaps hold her as if she were a frightened child?</p><p>Instead, he tugged her over to the worktable, saying only, “Work will soothe us both, I think.”</p><p>The plans had been covered by a few casually strewn newspapers. He stacked them neatly to the side as she ran a finger over the cunning designs, each carefully labeled and drawn as if one could see straight through the objects in question. The musical instruments were wonders of clockwork, the machines for feats of strength as magical and seemingly fragile as the butterflies themselves. These plans weren’t simply a man’s response to his employer’s request. They were a gift of rare beauty and imagination.</p><p>Holding up an ink-smeared handbill showing a drab and featureless woman with a very high price on her head, he said, “Vil was right. This isn’t you. It could be anyone. And it doesn’t nearly do justice to your beauty.”</p><p>She looked up at him, a smile trembling on her lips, one hand on his drawings.</p><p>“These plans are a credit to yours,” she said.</p><p>10</p><p>After an afternoon spent discussing butterfly species and colors while he cut and filed bits of metal, Imogen realized it was long past time to go. How odd, that one could spend the day in a room full of ticking clocks and still utterly lose track of time. When she opened the wagon door, it was dark outside, and the caravan was in full swing, a riot of noise and light.</p><p>Henry stood a little away, as if he didn’t want to be seen by anyone who might be lurking beyond his door.</p><p>“So I’ll see you tomorrow after breakfast?” he said, and she nodded and said, “Of course.”</p><p>But she paused, one hand on the door, uncertain. The sound of a calliope danced on the brisk air, interlaced with laughter and bells and the merry burble of voices. She could smell candy floss and smoked meat and popcorn, overlaid with the metal tang of the train and, nearer, of Henry. The moon was a bare sliver, high in the sky, outshone by the lanterns strung around the perimeter of the caravan. A sharp line of light divided the warm atmosphere of the show from the dark emptiness of the surrounding moors. They’d been so busy that they had missed the dinner bell, and for whatever reason, Vil had not brought a tray, which Henry had said was his usual manner of meals. Her stomach clenched in hunger, or so she told herself.</p><p>“Do I just . . . go out?” she asked. “Is it safe?”</p><p>Henry laughed and took a step closer to the door. And to her. “You’re a carnivallero now, dear lady. Have you never been?”</p><p>“Never.”</p><p>The longing was clear in her voice, and he took a deep breath and stared out the door as if a firing squad waited on the other side, crossbows poised.</p><p>“I can’t . . . I haven’t . . . It’s just been a very long time since I went out among people,” he said.</p><p>Her fingers drummed on the door in time with the calliope’s glad pipes. “You do not seem like a coward to me.”</p><p>“Nor you to me, and yet here you stand, on this side of the door.”</p><p>“Perhaps it is not fear of the carnival that keeps me here. Perhaps I remain for selfish reasons. Enjoying someone’s company is not an exhibition of cowardice,” she said, chin high.</p><p>“What a strange, plain-speaking creature you are.” His eyes seemed to seek something in the carnival’s glow behind her. “But I find that I share your curiosity. It does sound very exciting out there, doesn’t it? I so rarely open my door when the show is on. Bide a moment, and we’ll see what I can do.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She closed the door and leaned back against it. As soon as he was in the workshop, she darted to the mirror to check that her hat was set right. But no—it was still on the rack. She had almost gone outside without a hat! The impropriety was shocking, not to mention the risk, as Bludmen were about en masse and would surely be feeling their hunger. Plucking her topper from a tentacle, she buttoned it to the back of her jacket collar and set it at just the right angle.</p><p>In one afternoon, she had lain beside a man in the dark, felt the brush of his hand on her face, and then spent hours working with him, head uncovered and elbows occasionally brushing with the most fascinating electricity. If her father had known, he would have been furious. Well, had he not already disowned her. Perhaps for someone with such progressive views as herself, a clockwork caravan was not so much a fall from grace as an exit from a life that had not suited her. If Beauregard was what a woman could expect of respected scholars and businessmen in the city, she had already been treated with more dignity and kindness by Henry, and she had known him for only two days.</p><p>A muffled voice said, “I’m ready.”</p> <p>Imogen gasped and then burst out laughing. His outfit was even more outlandish than Vil’s. His wide-brimmed bowler extended down his neck, fastened firmly to a long black coat. Goggles with smoky lenses obscured his eyes. The beard and mustache that normally disguised the bottom half of his face were covered by a mask of leather and brass. His nose was the only part of him visible.</p><p>“Egad. You look a positive outlaw,” she said, fighting the chuckles.</p><p>“Perhaps. But please bear in mind that there’s only one reason I would enter into that mewling, jostling crowd. Madam Morpho, would you be so kind as to accompany me to Criminy Stain’s Clockwork Caravan?”</p><p>He held out his arm, and she took it gladly.</p><p>“I hear the clockworks themselves are quite masterly,” she said.</p> <p>“I wouldn’t know about that,” he answered, “but I understand that the mechanist is rather a genius. And they’re soon to have an arresting new act in which a beautiful woman of much mystery commands a band of exotic butterflies.”</p><p>He opened the door and helped her down the stairs to the ground. She could feel the tension in his arm and looked to his face, but he simply shook his head and said, “Now or never.”</p><p>To the left was the engine, and to the right, a crowd had gathered around Veruca the Abyssinian Sword Swallower. With Imogen’s elbow tucked firmly against his side, Henry drew her in that direction, and she gave Veruca a small wave. The powerfully built woman paused, a scimitar poised at her lips, raising one dark eyebrow at the man on Imogen’s arm. So it was true, then, that no one in the caravan had ever seen the Mysterious Mr. Murdoch. Although she had not doubted his word or that of Emerlie, who had certainly been happy to blab, it was still surprising to know that someone as sharp and watchful as Veruca had never caught a glimpse of the famous mechanist. Of course, to the crowd of amazed Pinkies, they were just one more couple out to enjoy a brief reprieve from the gilded and wired cage of the huge, overcrowded city.</p><p>Imogen had been so frightened standing before the London wall with her self-faked papers, as if the guards would see through her ruse to the rebellious soul within. But the guard had barely looked at her, and as soon as she had settled herself beside her trunk in the conveyance, her heart had seemed lighter and lighter the further she came into the countryside.</p><p>“Where are the bludbunnies?” she asked as they strolled toward the crowd.</p><p>Henry leaned over to whisper, “We can’t keep them out completely, but we try. If carnivalleros see one, they’re supposed to kill it. They get a copper for every ten bodies they bring to Cook. And there are several clockworks designed to kill the nasty little creatures, too. No matter how excellent our technology gets, there are just so many of them.”</p> <p>Still, despite the darkness of the night and the number of Bludmen and possible blud creatures about, she felt safe tucked against him. There was just something so competent about the man, and he was clearly a genius. And yet he didn’t share the hubris of the scholars she had known. Imogen wanted to ask him pointed questions, dig out truths equal to those she had revealed earlier. But before she could find the right words, he led her past Veruca to the clockwork between the engine and the red caboose.</p><p>“This is one of my favorites,” he whispered.</p><p>The great copper crocagator was beautiful, so cunningly crafted that she could imagine it crawling up from a deep river, water glistening on its riveted teeth. It sat upright, mouth wide and smiling, eyes occasionally blinking sleepily. Across its great brass stomach were stamped the words RUB MY BELLY, THEN RUB YOURS.</p><p>“Go on.” He grinned and released her arm.</p><p>She swayed in place, unsure. She knew it couldn’t be dangerous. Not if it was part of the carnival, and not if he was urging her toward it. Still, Imogen was leery of approaching such a large automaton and one with such bright, shining teeth. She still remembered the clockwork horror stories from her childhood—a rampaging metal lion in the London Zoo and the ill-fated Royal Carousel that had malfunctioned during the ribbon-cutting ceremony and nearly killed several children and the Magistrate. Even after it had been proven safe, she had never wanted to visit it and ride the moving metal monsters. But surely automata had come rather far since then, and surely a man as talented and careful as Henry would know exactly how to craft his masterpieces.</p><p>Lifting her chin high, she stepped firmly to the crocagator, her boot heels sinking in the spongy ground. The metal was cold under her glove, and she rubbed the smooth brass in a circular motion. At the press of her hand, machinery inside began to move, and the gator’s mouth opened wider with a contented sigh that verged on becoming a purr. With a hiss, a strip of paper curled out from between his teeth. When it stopped, she reached to rip it off, but for some reason she couldn’t name, she did not read it out loud.</p><p>Good things are in store for you. Bravery is its own reward.</p><p>“Is it a good fortune?” he asked with a grin.</p> <p>“Cryptic but positive. Would you like to read it?”</p><p>He threw an arm dramatically over his goggles.</p><p>“Leroi’s fortunes don’t work that way. You must read it and eat it without telling anyone. If you wish it to come true, that is.”</p><p>“Eat it?”</p><p>“Taste it.”</p><p>Tentatively, she touched her tongue to the corner of the fortune, and it dissolved in fizzing sugar.</p><p>“Candy fortunes. How charming. What will you think of next?”</p><p>She shook her head before curling the ribbon carefully in her hand and placing it delicately in her mouth. The fortune melted on her tongue, sweet but tart, like a lemon ice and light as air. When she looked up, she found Henry’s eyes watching her through the smoky glass with that strange mix of curiosity and hunger she caught every now and then, as if he were a cat amazed by a mouse or a scientist enamored of his subject or, more likely, a combination of both.</p><p>“Will you get your own fortune?” she asked.</p><p>He took her arm again, this time without asking, but she found she didn’t mind his proprietary air. As they stopped to watch the next act, he murmured, “Mine is to create the fortunes, not live them.”</p><p>Next were the Twisty Sisters, Demi and Cherie. To Imogen’s eyes, they were lithe young girls in far too little clothing posing and twisting in ways that shouldn’t have been possible.</p><p>“You can hardly tell they’re Bludmen,” Henry said near her ear, but Imogen realized that she could tell. The Bludmen had a certain look about them, a certain cool beauty and smoothness and calm that Pinkies simply didn’t possess. That, and she had never seen humans who could move that way, bent over and around each other like pretzels.</p><p>They passed the juggling polanda bear and paused for a moment to watch Charlie Dregs make magic with his Punch and Judy show. The crowd was mostly children, and they turned to stare at Henry’s get-up with malicious distrust. With a chuckle, he directed Imogen out of the crowd, past a clockwork unicorn, and on to the next wagon, where a woman with a dancing master’s baton was shooing people into two groups.</p><p>Her fiery red skin, ink-black hair, and forked tail had to mean that she was a daimon, the first that Imogen had seen outside of books. In London, like the Bludmen, they mostly kept to themselves in their own district, although she knew that in Franchia, they made up well more than half the population and filled the cabarets, operas, and stages. The woman was beautiful and exotic, in a tightly fitted dress that seemed to be made of pure glitter, and she moved with unbelievable grace and confidence, her tail waving sinuously through a slit in the skirt.</p><p>“You there,” she said, placing a bare red hand on Imogen’s arm. “Ma chère, you must go over to that side, with the ladies. And you, my fine flappy crow. You must go with the menfolk.”</p><p>“But I don’t—” Imogen began.</p><p>The woman clicked her tongue and said, “Perhaps you do not at home. But here, you do.”</p><p>Imogen looked up in confusion at Henry, but he stood already with the men, the mischievous smile she knew was there hidden under his mask. With two steps backward, Imogen stood amid the rustling crowd of London ladies in their fashionable dresses of jewel-tinted taffeta and velvet, their huge hats jostling one another to the tune of nervous giggles. When her eyes strayed to the bright red wagon, she read, Mademoiselle Caprice &amp; Sons, Dancing Masters of Paris.</p><p>Two daimon boys appeared, one with a hurdy-gurdy and the other in an indigo tuxedo spangled with stars. Bowing deeply, the dancer took his place with the men, and the musician began to play an exotic tune. Imogen lost track of Henry and of time itself as she followed the daimon woman’s example and tried her first dance steps, something most girls in London would have learned before entering society at fifteen. The rhythm was easy enough, and her feet behaved honorably. When Mademoiselle Caprice was finally satisfied with the women’s steps, Imogen looked up, panting with happy exertion, to find Henry waiting.</p><p>“May I have this dance?” he asked with great seriousness, and he took her waist and clasped her hand. His body radiated warmth and competence, and it felt utterly intimate when he pulled her close in the cage of his arms. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The hurdy-gurdy began to play, and the couples took to the dance in a confused frenzy, their laughter stronger than their dedication to rhythm and grace. But Henry had the knack, and he led Imogen in careful circles, twirls, and dips, pulling her closer each time she spun away from him.</p><p>The magic of the caravan swirled around them, and she gave herself up to giddy delirium. Glitter danced among the stars, and a wild breeze mixed the sugary sweetness of candy floss with Henry’s sharp tang of leather and metal and sandalwood. She had not, to her knowledge, ever been held—at least, not since she was an insensible child. The way he held her now, as they danced with the crowd, merged tenderness and strength, excitement and security. Although other dancers swirled around them in a riot of color and a burble of sound, all she heard was the thump of the hurdy-gurdy driving her galloping feet and her dizzy heart. All she saw were his eyes, unmistakable even through the gray-smoked goggles. When he looked at her, she felt like the only thing left in all the world. If the dance had proper steps, she forgot them and simply followed Henry.</p><p>He pulled to a halt, dipping her so low she feared the tails of her jacket would puddle in the dirt. The strength of his arm was all that kept her from falling, and her eyes locked with his, unblinking, as he bent toward her mouth. It was a shock, when the cold leather of his mask touched her lips. Only then did she notice that the hurdy-gurdy had stopped and the crowd was clapping and moving away, toward refreshment or further entertainment.</p> <p>With a mumbled “Forgive me,” he swept her back upright, and she found that her feet felt as if they were no longer connected to her body.</p><p>“Such delightful chemistry,” Mademoiselle Caprice said, appearing beside them with an exhalation of bliss. “You must come back and dance again. Oh, it is delicious.”</p><p>“Thank you, Mademoiselle,” Henry said shortly, “but we must be moving on.”</p><p>He made as if to take Imogen’s arm again but stopped himself, muttering, “Altogether too dangerous.” He all but stomped away from her.</p><p>She fought to keep her head up, mumbling, “Yes, thank you,” to the bemused daimon before she stumbled off in his wake, red with embarrassment.</p> <p>Of course, she was a horrendous dancer, as clumsy and clueless on her feet as she was with her heart. But she couldn’t begin to understand why he was so upset. Her father’s dark tempers had been deep and lasting, and she had never discovered exactly what it was about her or the world that set him off. Beauregard’s moods had been disconnected, cold as an empty hallway, and she had felt like an object whenever he was near.</p><p>But Henry’s disposition was altogether different in flavor and timing, fiery instead of cold. Even with her gifted mind, she didn’t understand why he seemed to be so often annoyed with her. She would have to find a book on male psychology, and soon, if she wished to keep working with him, much less to grow any closer to him, a hope that she couldn’t deny to herself any longer. She did not want to make the mistake of running from her father’s house to her professor’s museum to the caravan and straight into the arms of a mysterious and reclusive mechanist, and yet she found herself drawn to him.</p><p>And she wouldn’t sit around wondering, either. Picking up her skirts, she sprinted to his black, flapping coat and caught his arm.</p><p>“We must talk,” she said.</p><p>“Is the magic of the caravan not temptation enough?” he said, throwing his arms wide to encompass the wagons and shaking loose her arm in the process. “Merriment, acts of entertainment, the barest hint of danger. Is this not enough to satisfy you?”</p><p>“I am not a fool, Henry, and I have already admitted to you that I know very little of interpersonal behavior, but I must confess that you confound me utterly. Is there some underlying issue that drives you? Or am I simply so unlawful, uncoordinated, overeducated, and plain-spoken that you find yourself thoroughly disgusted by my very presence?”</p> <p>“Disgusting? You?” He took her shoulders in his hands and held her both too closely and not closely enough. “Are you mad?”</p><p>“I do not believe so. Are you?”</p><p>For a long, charged moment, they glared at each other. They had paused in front of a clockwork tiger, which roared at them fiercely, but neither of them so much as turned a head.</p><p>“Very well, madam. You wish to talk? We will talk. But I won’t be responsible for the consequences.”</p><p>He walked directly toward the tiger, diverting his path at the last possible moment to clamber over its great back. It turned its copper and silver head, and he rapped it on the nose and said, “Quadrangle obtuse perambulator. Bugger off, Garflax.” The tiger froze, the light in its eyes extinguished and the grinding within its metal body cut off. Turning, Henry helped her step up onto the pedestal and over the tiger’s back, releasing her hand quickly. A velvet curtain the color of midnight hung behind the clockwork like a solid wall, and he held it aside and leaped to the squashy ground. Without looking beyond, she landed lightly beside him.</p><p>And Imogen saw for the first time what occurred under the tent in the empty circle of space within the ring of wagons.</p><p>11</p><p>“What is this place?” Imogen asked, and he chuckled.</p> <p>“Inquisitive as you are, you never thought to look past the clockworks’ curtains? I’m surprised.”</p><p>“I’m inquisitive but not foolish. I suspected there was a mechanism to prevent one from doing so.” She tried to soften her snippy tone before he picked up on her qualms regarding the safety of his large clockworks, adding, “And of course, I’ve spent most of my time here in your wagon, as you may recall.”</p><p>The space was covered by a patchwork tent cobbled together of silks, skins, sheets, and distracting bits of costume. A long line of lights was strung between the poles underneath, the orbs glowing a warm golden orange and giving off a slight, charming buzz. Underneath the tent, areas for working or relaxing were set up with props and furniture in various states of disrepair.</p><p>“Is this a portable attic?” She ran a hand along a velvet fainting couch. It was missing a leg, and it wobbled under her touch. With a huff of annoyance, she dragged a wooden crate over to prop up the corner of the couch and pressed a hand against it, testing her fix. Satisfied, she turned back to him with an expectant air.</p><p>“When the caravan stays for longer than a week outside a big city, we put up the tent.” Hands in pockets, he rocked back on his heels. “It was Lady Letitia’s idea. Where she comes from, there are no Bludmen, and their circuses put up a huge tent to contain both the performers and the audience. So bit by bit, we built one, but only for ourselves. Now the carnivalleros can practice their acts or gather out of the rain and away from their living quarters, about which they can get quite tetchy. The Bludmen, I believe, especially appreciate it here. No one trusts them in close quarters, and in bad weather, they start to feel a bit downtrodden. And cagey.”</p><p>“But all this . . . junk?” She picked up an umbrella that had turned inside out and struggled to put it back the right way, but the stubborn thing resisted.</p><p>“It’s a bit like a free market.” He shrugged. “People bring their broken and unwanted things to share. One man’s trash is another man’s treasure, as they say.”</p><p>“I always thought that sentiment a bit cruel.”</p><p>“I myself have a soft spot for things discarded by men who think themselves great,” he said gently. “My work is to see the masterpiece hiding underneath. To fix what has been broken.”</p><p>“What if the object in question isn’t broken at all?”</p><p>She kept her back to him, and she was aware of his closeness as he stepped under the tent and stood close enough to touch her. But something held him back.</p><p>“Then I think perhaps it’s a case of finding the right mechanism to bring it alive.”</p><p>She sighed and spun around to face him, brow drawn down. “Perhaps you expect me to simper around the truth and trade dainty metaphors, but that is not my temperament. I am a scientist, and I find that the data are not adding up. You woo me with words, sir, and you dance with true passion. Why, then, do you turn away from me? You say I’m not disgusting, and yet every time we draw together, you storm away. Is it my naiveté, my lack of polish? The price on my head? Explain your behavior at once.”</p><p>“I’m not a scientist, Imogen. I’m an artificer.”</p><p>“Meaning?”</p><p>“Meaning I’m better with my hands than my words.”</p><p>He wrapped his arms around her and drew her close, one hand cupping the back of her neck in a way that made her gasp. With his other hand, he ripped off his mask, goggles, and hat in one motion and stared into her eyes with a fervor and passion that nearly made her knees collapse. When she opened her mouth to protest, he kissed her.</p><p>Pressed against him from lips to thighs, she swooned as if they still danced to the frantic music of the hurdy-gurdy. His lips were hot against hers and soft, compared with the rasp of his beard. His mouth moved against hers, his tongue parting her lips and questing intimately within. She answered as best she could, her scientific mind finally silenced by her body’s sudden hunger. She gripped his shoulders through the layers of his jacket, thrilling at the muscular strength and power of the man.</p><p>Her limited experience had not prepared her for this hot fury, for Henry’s grasping hands and claiming mouth and their shared, feverish desperation. For the strange sensation of his breath on her cheek, his hands tracing her jaw, his tongue probing with an ancient rhythm that she found she already understood. They were like a closed circuit, thrumming with electricity.</p><p>He pulled back to look at her, breathing hard and eyes wide. “Damn the consequences,” he muttered, and he shoved back her hat to let her hair tumble free, kissing her hard enough to make her rock unsteadily on her heels and grab for his jacket. She fell backward onto the couch, and he managed to catch her waist and lower her gently. He knelt beside her, stripping off his gloves and drawing long brown curls the color of cinnamon sticks over her shoulders and running his fingers through them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You did not answer my question,” she said when she remembered how to talk again.</p><p>“That was possibly the most arousing question I’ve ever been asked.” He twirled her curls around his bare fingers, sending shivers all over her scalp. “I would hope my response would communicate my feelings, but as you’ve asked for me to corroborate your findings linguistically, I can only say that when I turn from you, it’s not due to any lack of feeling on my part or any lack of perfection on yours. I am a dangerous man, and I’m hiding more than boyish good looks under this godforsakenly scruffy beard. I don’t wish to hurt you, Imogen, and that’s the truth of it. But I’m weak. I can’t help falling under your spell.”</p><p>“Oh,” was all she could manage.</p> <p>He was so disturbingly close, with his elbow on the divan’s arm and his chest pressed to her hip.</p><p>“Your knees must be very damp, Henry,” she said.</p><p>He smiled and kissed her softly. “I haven’t heard anyone say my name in years. I probably shouldn’t have told you. But I couldn’t stand hearing another man’s name on your lips when you looked at me. Say it again.”</p><p>“Henry.”</p><p>He rewarded her with a kiss, the warm electricity of his fingers trailing over her jaw.</p> <p>“Are you married?” she asked abruptly.</p><p>“No.”</p><p>“Do you have a mistress? A fiancée?”</p><p>“No and no.”</p><p>“Then I fail to see any impediments.”</p><p>He chuckled, one fingertip stroking a slow path down the tip of her nose and over her lips. “Then you’re not very imaginative, although I think you quite extraordinary just the same.”</p> <p>“So kiss me again.”</p><p>“So long as you understand that this experiment of yours is not without consequences. A butterfly’s wings flapping in Ceylon can bring a hurricane twirling to your door in London. Everything I do is done with intention and cannot be undone.”</p><p>Shocked at her own impropriety, she murmured, “So undo me.”</p><p>He leaned forward to kiss her gently, as if giving her one last chance to renege. But she was stubborn and knew well how to get what she wanted. Imogen’s tongue darted out to lick his lip, and he deepened the kiss, his hand slipping around her neck to flick the buttons one by one and release her dangling collar and hat. The thick lace and leather fell to the damp ground, and she sighed in satisfaction at the freeing, devil-may-care feel of it all. With three quick flicks, her jacket fell aside, the red of a monarch’s wings spread open around her. His nimble fingers next found the front of her blouse and began likewise exposing skin too often held hostage. When his lips moved to her throat, she stopped breathing, dizzy with the sensation of thrumming nerves and heat trailing down the tender hollow where her pulse beat like a watch wound too tight.</p><p>Without knowing it, her hands curled in his hair, pulling him closer.</p><p>“Take off your gloves,” he murmured into the sensitive shell of her ear. “I want to feel the flesh of you.” She obeyed, glad to be rid of them.</p><p>She had never felt so wanton, never known what it was to touch another person with such desperate hunger. She couldn’t stop herself from roving her fingertips all over him—the softness of the freed golden hair brushing his shoulders, the wiry rasp of his beard, the firm cut of his jaw, the heat rolling off his neck. His tongue ran up and down the pulse in her throat, her collarbone, down the white plane of her shoulder and under the lacy edge of her unbuttoned blouse.</p><p>Imogen panted under his lips, feeling like a specimen pinned down and laid bare for study. When his lips found hers again, she moaned into his kiss, her tongue seeking and feeling as he released another button on her blouse. Down and down he went, button after button springing free, until her blouse was open completely. She shrugged out of the jacket and blouse, leaving only an overbust corset and skirts between them. The night air was cool on her skin and his tongue was hot and frenzied in her mouth. With a growl, he turned her to face him head-on, sprawled on her back on the small couch. Breaking the kiss for only a heartbeat, he grasped her ankle and hitched her body until he pressed close between her open thighs, the layers and layers of skirts pressed tight between them and her knees trapping his hips.</p> <p>“Oh, my,” she murmured into his mouth. Beauregard had only met her from the back, and she was surprised and pleased and just the perfect bit scandalized to be pressed, front to front, to the mysterious mechanist. His hands never stopped their roaming, skimming down her corset and over the swells of her hips to settle firmly there, slipping into the creases where her corset met the tender skin of her haunches. His thumbs ran along underneath the thick stays, making her squirm to press more firmly against him.</p><p>“Shall we try a little experiment?” he whispered in her ear.</p><p>“You claim you are not a scientist.”</p><p>“I dabble.” He ran his fingers gently over her hips.</p><p>“Then consider me a willing subject.”</p><p>“Very good. Let’s test cause and effect. What happens when I do this?”</p><p>His hands found the sides of her corset, pressing in and up as he ran his tongue over the tops of her breasts, dipping briefly into the hollow between them. She cried out and threw her head back, squeezing him tightly with her thighs.</p><p>“Subject’s reaction was positive. What about this?”</p><p>He squeezed her corset again, this time licking just under the line of heavy satin until he found her nipple. Curling his tongue around it, he suckled, a long, lazy pull that made her tense against him, wrapping her legs around his waist and digging her bare fingers into the lapels of his coat.</p><p>“And this?”</p><p>He flicked her nipple with his tongue before releasing it, wet and taut, to float over the corset.</p><p>She whimpered, arching up off the sofa, desperate for him to lavish her other breast with the same attentions. He obliged, taking the other nipple into his mouth as he plucked and rubbed the still-wet one with clever fingers.</p><p>Eyes closed, she was exquisitely aware of his mustache and beard brushing over her skin in stark contrast with the softness and warmth of his mouth. She longed to be kissed again, but she couldn’t stand the thought of his tongue anywhere but where it was, working between her breasts, alternately teasing and aggressive.</p><p>With a grunt, he pressed closer against her, and she felt his eagerness through the folds of her skirts, a hard ridge that she couldn’t ignore. So many layers of cloth stood between them still, and yet the intimacy of firm flesh set with wicked intent against her open thighs made her feel as if she were laid completely bare. Her crossed legs pulled him closer, and she lifted herself off the couch to move against him, feeling an enticing breeze against tender skin still wet with his kisses.</p><p>“What about the blud creatures?” she murmured.</p><p>“Clockworks will stop the small ones; Criminy will stop the larger. You’re safe here. Forget them. Forget everything but this.”</p><p>He teased her nipple with his tongue and reached to unhook her legs from behind his back. His leaf-green eyes found hers as he leaned away, unbuttoned his long coat, and dropped it onto a trunk. She was caught in his gaze, wild and starving and desperate, screaming inside every second that he wasn’t touching her. With infinite slowness, he unbuttoned his vest and untucked his shirt, and she watched, scandalized and eager, for the next stage of his experiment.</p><p>Finally, he smiled, slow and lazy. “Let’s refine the idea, shall we?”</p><p>His hands found her ankles, still clad in their leather boots, and shivers raced up her legs. Slowly, his fingertips skimmed up her calves, heating her skin through thin stockings. When he found the ribbon ties above her knees, he pulled them at the same time, and she gasped as his callused palms ran up and down the tender skin on the insides of her calves. Her breasts were bared above her corset, the breeze tickling her nipples and making her pant just as much as his hands moving under her skirts. Imogen threw back her head, feeling as dizzy as the crazy quilt of fabrics above her, a lone rip in the tent showing the stars aglitter in the midnight sky.</p><p>Palms moved steadily up her thighs. His thumbs hooked under her corset in that ticklish, tender crease of her hips, and she whimpered and slid down lower, urging his fingers to seek further under her petticoats.</p><p>Sliding his hands under the tight press of her stays, his thumbs pressing into the folds of her thighs, he leaned forward to kiss her again. It was sloppy, wild, desperate, delicious, the wetness of his mouth and the firm pressure of his hands leaving her breathless.</p><p>Finally, Imogen could take no more. She caught his hair in her fists, holding him close to whisper in his ear, “This experiment demands a final conclusion, sir.” With unexpected boldness, she ran a hand down his chest to cup the hardness below, her eyebrows raised in question.</p><p>“A woman who knows what she wants.” He ran one finger down the crease of her thigh to stroke gently upward along her cleft, right where she wanted it most. “The only thing rarer than butterflies.” In answer, she let out an animal cry and whimpered against his mouth.</p><p>She slid trembling fingers up his chest to unbutton his shirt as they kissed. Below, buried in the ruffles of her petticoats and skirts, his fingers rubbed and pressed, circled and teased. Slumped against the divan and moving in time with him, she was dizzy and breathless and wet, back arched and corset digging into her ribs in the most delicious way.</p><p>As she slipped the shirt and vest from his shoulders and ran her palms down his chest, she pulled back to gasp at the white scars tracing across his skin.</p><p>“What happened to you?”</p><p>“I was careless with my clockworks once,” he said, voice husky. “A mistake I’ve not made again. Does it trouble you?”</p><p>She ran a finger along the longest scar, which was thin and raised. The others were shorter, and a few were just twists of flesh, like burns. She ended her exploration with a thumb gently tracing the white strip in his beard.</p><p>“Not if it doesn’t trouble you. It gives you a deliciously rakish air, actually.”</p><p>Leaning into him, she ran her tongue upward, following the long white line that scarred him from ribs to throat as if he’d been slashed with a knife. With a groan, he caught her under her knees and spun her so that she reclined lengthwise along the green velvet divan in a waterfall of ruffles and shed cloth and tumbled hair and creamy white skin. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So beautiful, Imogen. I’m almost scared to touch you.”</p><p>“Don’t be ridiculous. It’s a biological imperative. An ancient dance.” She swallowed hard and pulled him forward by the waistband of his trousers. He followed willingly, fitting himself over her and brushing back her hair with one hand. “So stop stalling, and let’s dance.”</p><p>“I don’t think we need a daimon to teach us the right steps this time.”</p> <p>He took her lips again, grinding his hips against her. Moaning, she ran her fingernails down his back, urging him closer. He licked down her throat to her breasts, and she writhed against him and struggled to unbutton his trousers and push them down past his hips. He lapped at her nipples, teased her, rubbing against her further down, making her as dizzy as she had been when they danced under the starlight. His clever fingers found her again, the softly slick core of her buried in petticoats, and she moaned and hooked a boot around his back. When she pulled him closer, he moaned, too, pushing up her skirts and fitting himself against her to rub so deliciously that she squirmed and whimpered, all words forgotten in the frenzy of warm flesh.</p><p>He was there and ready, easing into her with an agonizing slowness that drove her mad, and she dug her boot in and rose to meet him, taking all of him and making him gasp against her neck. He found her nipple, suckling and licking as he worked against her in a gentle rhythm driven by her bare calf and sharp boot heel. She met him with every thrust, dancing skin to skin, her hands clutching his hair, his neck, his back with desperate wonder and wild abandon.</p><p>Her mind all but shut down, lost in panting hunger. His loose hair flashed against the starry canopy above, and she felt as if she were wrapped up in the sparkling magic that seemed to spice every moment in the caravan. Half-naked in the open, wildly writhing against an almost-stranger like an animal in heat, she had never felt more alive, more wanting. When his finger found the crux of her, rubbing in time with his grinding hips, she set her teeth in his ear, moaning and panting and muttering his name as the sweetness built inside her like nothing she had ever known.</p><p>The tightness of the corset, the press of his body, the fire of his tongue, the wet slickness where they met; the sensations possessed her until they pushed her over the edge and into utter oblivion. Imogen arched her back and tossed her hair and screamed in release, and he plunged into her faster and faster and harder and harder. The moment went on and on forever, throbbing inside her as he groaned and pressed his face into her neck, shuddering against her.</p><p>In the silence that followed, she heard nothing but her own desperately thudding heart and his gasping breaths.</p> <p>“Have you reached any conclusions?” she murmured, finding it hard to form the words.</p><p>“I must admit my hypothesis was proven true. Given the chance, I will gladly be your ruination.”</p><p>Then, without warning, he dropped her skirts and sat beside her, crossing his legs demurely and bending to throw his black coat over them both. Imogen sat up, spluttering, startled by the damp cold of the leather. Torno the Strong Man stood just inside the tent, blushing fiercely under his hat and hugging an enormous barbell to his chest as if it was an infant.</p><p>“So sorry, my lady,” he said. “The twins hid my weights as a joke. Many times did I clear my throat, but . . . the caravan, it is so loud. Excuse me, signore. I will be going now. My show, it is starting soon.”</p><p>She could only shake her head numbly and blush.</p><p>“Good night, sir,” Henry said pleasantly. As soon as Torno nodded and turned away, he adjusted himself and exhaled, sliding down on the couch so that their heads were even. “Are you all right? Or do you hate me now?”</p> <p>“I’m fine. Why wouldn’t I be? Why would you think I hate you? What did you mean about my ruination?” she asked dazedly. “And where did you learn how to do that?”</p><p>“I find a good novel can be very instructive. Where did you learn?”</p><p>“As with the dancing, I simply followed your lead.”</p><p>He sighed and stood to tug up his breeches and shrug on his shirt. She also sat up to put herself to rights, enjoying the sweet calm of a man who remained after the act instead of rushing away in disgust.</p><p>Handing over her jacket and hat, he watched her dreamily for a moment before a horrified look came over his face. “Oh, my poor girl. I didn’t ask. Have you taken precautions? Do we need to . . . I’m so sorry I . . .” He gestured vaguely at her skirts, and she sat up straighter.</p><p>“Of course I take the herbs. Stop looking at me like I’m going to fall apart like a wet biscuit. And don’t change the subject.”</p><p>He sighed. “I am a dangerous man, Imogen.”</p><p>He held out a hand. After buttoning the last button on her jacket, she took it, and he helped her stand.</p> <p>She wobbled for a moment before sticking her chin out and poking him in the chest. “And what if I don’t care? What if I’m just as dangerous for you?”</p><p>“Then we’ll do what any good scientist does,” he answered, tracing one finger along her cheek. “We’ll research. And come up with a new hypothesis.”</p><p>She smoothed her skirts and set her hat at its usual jaunty angle. “I find that I like to experiment with you. But I also appreciate firm conclusions.”</p><p>He snorted. “Firm, indeed. Let us hope this experiment doesn’t backfire.”</p><p>“Backfire? My dear artificer, I find I like it better from the front.”</p><p>12</p><p>With Beauregard, it had always been awkward afterward, like two strangers who had accidentally run into each other on the sidewalk. Sometimes, in the museum, he had handed her a handkerchief before dropping her skirts and disappearing behind a convenient stuffed mammoth, leaving her to pick up the books she had dropped or the ledger she had been marking. No wonder she had never felt fire or hunger or even warmth. Most of the time, he had shown more fondness for the mammoths.</p><p>Not so with Henry. Although there was some strangeness to being caught, half-clad in his arms, his warmth and kindness in helping her get dressed warmed her even more toward him. Feeling his gentle fingers buttoning her hat to her collar was nearly as intimate as feeling them below her skirts. Whatever he had meant about being dangerous, right now, he was simply tender.</p><p>“So anyone can pass the clockworks to get back here?” she asked, trying to fill the silence under the tent with something besides the pounding of her heart.</p><p>“As you have seen, a clockwork guards each space between wagons.” He tucked his hair back under his hat and scratched his beard as if he wanted to rip it off. “And each clockwork has a safe phrase that will shut it down for one minute, long enough to allow passage through to here. I know the passcode for every clockwork, but the carnivalleros are given only one. They must enter and leave past Cadmus the cassowarrel. This is, after all, a public space. Should you ever wish to come here, simply say this to Cadmus: ‘Orangutan posthumous grotesque.’ He will freeze and allow you through, in or out.”</p><p>“What would happen if someone unfamiliar with the code attempted to bypass one of your masterpieces?”</p><p>He grinned. “First, they would receive a warning, and then they would face some rather dastardly consequences, I’m afraid. The clockworks are as much a defense as an entertainment, you see. The caravan defends her own.”</p><p>“But how do they work? Do they maim or kill? Are there other commands?”</p><p>He cupped her face to kiss her gently, surprising her. “I would love nothing more than to tell you everything I know. No one has ever shown any interest in my work, other than Criminy, and I don’t consider him nearly as kissable as you. But let us go and enjoy the last minutes of the carnival. You’ve never actually been to one before, have you?”</p><p>“No. My father didn’t believe in idleness, and my . . . well, my subsequent education didn’t include frivolity of any sort.”</p><p>He smiled indulgently at her, setting her hat just so and readjusting a button that was off with a gentle care that she found touching.</p><p>“Let us go, then, you and I. It’s been a long time since I’ve enjoyed the sights.”</p><p>He adjusted his mask and pulled down the goggles, shrouding his fine eyes in smoky gray. Together they stepped out from under the magic glow of the rainbow-streaked tent. He led her in a different direction and nudged her forward, and she spoke the passcode to the long-necked clockwork bird. It paused in the midst of laying its own egg, going still and cold so they could duck beyond its neck. Once safe on the other side, Henry paused, her arm tucked into his, until the cassowarrel came alive again, swallowing the egg in a strange, contortionist dance.</p><p>They were in a different part of the caravan now, and they moved amid the crowd with bland anonymity. Arm-in-arm, they watched Torno lift his weights, his strength defying physics thanks to Criminy’s magic. Emerlie juggled hedgehogs and rode her unicycle high up on the wire, her lime and magenta costume glowing against the velvety night sky. Next up came Abilene and Eblick and the two-headed Bludman, each waiting behind a curtain to amuse and entertain and, in the twins’ case, terrify. A collection of bizarre creatures floating in large jars of liquid was surrounded by a crowd so deep that Imogen caught only a glimpse of the horrors within. They passed Letitia in her turban, telling fortunes in a sequin-spangled tent. She looked over an awestruck city girl’s stylishly huge bonnet to grin knowingly at them, and Imogen blushed despite herself.</p><p>“And how are you enjoying the caravan?”</p><p>Criminy Stain himself materialized beside her, his grin as mischievous as Letitia’s had been.</p><p>“It’s a bit overwhelming,” Imogen said. She could only imagine how flustered she appeared to his predator’s eyes and hoped his sharp nose wouldn’t pick up on what had happened under the tent. Wrapped again in hat and goggles and oversized black coat, Henry was a solid but unreadable enigma at her side, his silent tension betrayed only by the tight squeeze of his glove on her arm.</p><p>“And if it isn’t the Mysterious Mr. Murdoch,” Criminy said, falling into step with them. “I suspect everyone else believes you to be Vil in that get-up.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s the point,” Henry said, growling.</p><p>“But won’t it bother you, my cunning recluse, to know that everyone’s tongue will be wagging with the wrong man’s name in conjunction with our lovely Madam Morpho?”</p><p>“Rumors are the food of fools,” Imogen said smartly, giving Henry’s arm a squeeze. “No one here even knows me, much less should they care on whose arm I walk.”</p> <p>“The caravan is a very small family, my dear lady,” Criminy said. “You’ll find that nothing goes unnoticed.” He bowed to her and doffed his hat. With a snap of his fingers, a small gray moth appeared to flutter in the air before her face. She reached out, enchanted but confused. The second her fingers touched it, the moth dissolved in a puff of glittery dust.</p><p>“It wasn’t real?” she said, disappointment plain on her face.</p><p>“Illusions can be deceiving,” Criminy said with a shrug and a bow. “Better to enjoy it while it lasts, rather than look behind the curtain too early.”</p><p>Flipping his topper back onto his head, Criminy grinned and disappeared into a crowd rustling around a spotlight. Imogen was curious about which act the people waited to see, if perhaps it was the ringmaster and magician himself, but Henry pulled her around the outskirts of the throng. They walked the line of lanterns delineating the caravan’s perimeter, not stopping until they stood before her wagon. She had lost track of time and space and finally realized that it was quite late—and that Henry was farther away than he had ever been. The tender affection and clever repartee of the tent had fled, and she felt as if he might bolt away from her if she let him.</p><p>“What does trouble you so?” she asked.</p> <p>“If I could say, it wouldn’t trouble me.”</p><p>“Will you kiss me good night, then?”</p><p>“Of course not. Not here. Your reputation is at stake.”</p><p>“And it is mine to decide what those stakes will be,” she said peevishly. She stood on the bottom step of the wagon so that they would be evenly matched in height and so she could see as much of his face as possible. In the shadow, her eyes couldn’t penetrate the smoke of his goggles, although she stood looking straight into where his eyes should have been.</p><p>“I don’t want you to regret me,” he said.</p><p>She snorted. “Then don’t make me, you fool!”</p> <p>She flicked a gloved finger at the glass of his goggle lens before disappearing into her wagon and slamming the door.</p><p>13</p><p>Imogen slept deeply, waking at the nudge of a body denting the thin mattress of her bed.</p><p>“What about my reputation?” she all but purred, flinging a bare arm over her eyes.</p><p>“What about it, then?” said a bright and all-too-feminine voice.</p><p>With a squawk, Imogen lurched to sitting, holding the tatty blanket up to her chin. The lights were on, and Emerlie perched on the edge of the bed, grinning. She wore yet another of her horridly bright get-ups, a short, doll-like dress and leggings of spring green, all covered with buttons.</p><p>“What on earth are you doing here?” Imogen said, and Abilene appeared in the doorway in her dressing gown, tugging nervously on her beard.</p><p>“Had to let her in.” She shrugged in half-apology.</p> <p>“Into the wagon, yes. But into my room?”</p><p>“If you jiggle the door just right, it opens.” Emerlie buffed her glove on the ruffles at her neck. “Me an’ the horse-faced girl who used to bunk in here had a deal.”</p><p>Imogen’s eyes darted around the small room, checking that what few things she owned had escaped the tightrope walker’s snooping. She had cause yet again to thank Master Stain for sending her to Henry, considering that his wagon was one of the only places in Sang where her butterflies and other secrets would be safe from prying eyes and greedy fingers.</p><p>“Considering we have no such agreement, would you care to explain why you’ve let yourself in?”</p><p>Emerlie leaned close, and Abilene checked the door to the outside before rushing close to huddle at the foot of the bed.</p><p>“We have to know.” Emerlie’s kohl-ringed blue eyes darted back and forth. “What is it you do in Mr. Murdoch’s wagon?”</p><p>“And why were you out on Vil’s arm last night?” Abilene shuddered in disgust.</p><p>With a snort, Imogen stood and slipped into her faded black dressing robe, sorry for its shabby shape and mannish cut and noting how strange it was to be self-conscious for the first time.</p><p>“Gossip. Honestly. Could this little interrogation not have waited for breakfast? Or at least after I was awake and dressed? Do you think me so silly and easily spooked that I would spill my secrets just because you caught me unawares? Does this stratagem generally yield results?” She stopped in front of Emerlie, staring down at the short strawberry-pink curls with her most dire and furious librarian’s glare. A staring contest ensued, Imogen’s eyes narrow and unblinking. When Emerlie looked away and hunched her shoulders, Imogen knew that she had won.</p><p>“Folk like to talk,” Emerlie said with fake brightness. “A word here, a word there. You can’t blame us for being curious.”</p><p>“And you’re so very mysterious,” Abilene added.</p><p>Imogen crossed her arms. “Do not think me the heroine of one of your penny dreadfuls, Abi. I’m none so colorful as all that. I will tell you the same thing I’m sure Master Stain has yielded under your prodding. I go to Mr. Murdoch’s wagon to manufacture the necessary equipment for my act.”</p><p>“Which is what, exactly?” Emerlie plucked at Imogen’s sleeve, as if she could pull information out by brute force, if necessary.</p><p>“You’ll have to wait until the equipment is complete, I’m afraid.” Imogen smiled sweetly. “Where’s the fun if I tell all my secrets?”</p><p>“But what about Vil?” Abi tugged her beard, pulling down her thick lower lip. “What’s he like, under all that leather? No one’s ever seen him without a full suit and goggles.” She took a deep breath and exhaled a sigh, ending on a hopeful note. “Is he handsome?”</p><p>“I couldn’t say,” Imogen said staunchly. “I have never seen Vil unmasked myself.”</p><p>“But does he hiccup so much around you? He hiccups around me something awful! And—”</p><p>Emerlie stopped her with a dismissive wave.</p><p>“It’s no good, Abi. She’s a steel trap, this one.”</p><p>“Anything else?” Imogen held an arm out to the door.</p><p>Emerlie took a long, leisurely look around the room before standing and stretching, her knuckles nearly grazing the ceiling. “We didn’t mean no harm. Just makin’ friends.”</p><p>“And calculating worth, I’m sure,” Imogen said under her breath.</p><p>Emerlie flounced out the door, but Abilene stopped.</p><p>“Oh, and Master Scabrous said to tell you to stop by for costume measurements,” she said. “I really did mean to tell you.”</p><p>Emerlie dragged the poor girl out the door by her beard, and Imogen ran to her armoire, flinging it open to check that the brooch was still pinned in place to her jacket. Emerlie knew she had secrets, but the poor girl wasn’t prepared for this level of danger.</p><p>Emerlie would jiggle a doorknob and toss a room for the social coin of gossip.</p><p>But for that brooch, Beauregard would kill.</p><p>After breakfast, Vil met her at the door of Henry’s trailer, his hiccuping forever distinguishing him from the man she truly wanted to see.</p><p>“He’s working with some dangerous chemicals and machinery this morning, m-m-my lady,” Vil said, blocking the door with his body.</p><p>“I was given to understand we worked in tandem.” She stepped rebelliously onto the bottom stair, sending Vil into another fit of hiccups.</p><p>“Not today, I’m afraid.” Even doubled over, he refused to budge his gloved hands from the doorjamb.</p><p>She tried to look beyond him, but the frustrating little man leaned this way and that, foiling her.</p><p>“Fine,” she said, louder than necessary. “Let him be a coward and avoid me, then.”</p><p>With nowhere better to go, she headed for the costuming trailer of Master Scabrous, which was painted the shiny canary yellow of a wet lemon drop. She knocked on his door and was admitted to a cheerful flurry of discussions, scribbled drawings, and ticklish measurements that made her blush. Although his dark skin and light hair were rather exotic, he was much like Criminy in his good humor and gentlemanly manner. As she returned his grin and his easy banter, she realized that her feelings about Bludmen were definitely changing. She felt safer within the confines of his trailer than she had felt in her own father’s house. His snapping blue eyes laughed as much as Criminy Stain’s gray ones, and she left with great confidence regarding a costume that would complement her butterflies and their act, not to mention her own coloring and figure.</p><p>At lunch, she bypassed Emerlie and her cronies to sit with the contortionists, Demi and Cherie, who were just as sweet but not nearly so young as they looked. By the time she had finished her stew, she had grown accustomed to their dimpled smiles and red-painted lips. The teacups of blood raised across the table from bowls of bludbunny stew were simply a part of carnival life. She was fascinated to learn that Demi was being a Stranger from much farther afield, saved from the brink of death and bludded by Criminy himself when a bludstag had found her on the moors. Aside from Lady Letitia, Demi was the only other Stranger Imogen had met, and it was all she could do not to badger the poor child with a scientist’s curiosity about a world she had only imagined before.</p><p>The rest of the day passed in annoyed fidgeting. Her wagon felt confining and dark, despite the lanterns. With nothing else to do, she explored the bathing car, played with makeup for the first time, and spent the bulk of the afternoon reading another of the racy novels Criminy had left for her, while munching a small apple she’d pinched from lunch. She didn’t look a single time toward Henry’s trailer.</p><p>When Abi left to play her part in the carnival, Imogen watched her go from the doorstep. The bus-tanks rumbled over the hills from London, disgorging masses of skittish city dwellers, and the countryside seemed to hold its breath, waiting for the magic of the caravan to twinkle in the air. She longed to dance again, to see the wagons and performers she had missed, to feel Henry’s arm solid and warm under her glove. Instead, she closed the door and curled up in her bed, feeling as cold and alone as she had in London. The only difference was that now she knew what she was missing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The next morning, she found a note tacked to Henry’s door in handwriting that matched the scrawling she remembered from his walls and books.</p><p>Dangerous work today. You will be contacted when needed. Signed, The Mysterious Mr. Murdoch.</p><p>She knocked anyway, but there was no answer.</p> <p>Turning in a huff, she walked directly away from the wagon, out toward the wild moors. Far off in the distance, the dirty smear of London pierced the sky like a jagged, rotten tooth, surrounded by a fug of smoke. It felt good, turning her back on that eyesore and keeping her eyes on the far horizon of endless grasses and low, blessedly blue skies.</p><p>“D-d-don’t go too far, my lady,” Vil called from somewhere within the safety of the caravan, and she waved a hand in furious dismissal.</p><p>Henry couldn’t tell her what to do, much less his nervous minion. There wasn’t a bludbunny in sight, and the sun was high and warm. She had never been in such a wide, open place, and after looking around the caravan for gawkers, she lifted her skirts and ran under the line of lanterns and out onto the moors with a delectable twitch of rebellion. The heels of her boots sank into the earth, the grasses parted with a joyful whisper, and she felt, for the first time in her life, the rush of fresh air against her face. Before she knew it, she was skipping like the schoolgirl she had never been, whooping and laughing with uncharacteristic frivolity.</p><p>She pushed herself to gallop up a hill. There, at the top, she felt cradled between the sky and the earth. The cool breeze licking her cheeks thrilled her, and she took great, deep, hungry gulps of air, wishing to take it all in. So many years of being trapped in a state of suspended animation like her butterflies, trapped between the pages of books. Her nerves felt alive, her eyes full and wide. It was delicious, the wildness of the countryside. If she never entered the dark, high gates of a city again, she would be a happy creature.</p><p>Did Henry ever do this? If being trapped in London was bad, being trapped in a caravan wagon couldn’t be much better. Of course, today, he deserved it. The chuff of the man—turning her away after what had passed between them the other night! And there was still so much work to do. But the fresh air was a miracle, the sunshine a balm to her tortured nerves. No wonder everyone seemed so sickly and weak in the city. With the factories and the air scrubbers, every puff of air had already been breathed twenty times over by someone else. But here, everything felt new.</p> <p>Imogen was at the top of the hill now, a mountain all to herself with the caravan twinkling far below. With a loud laugh she would never have uttered near another living soul, she threw herself down the hill, rolling over and over through the high, green grass. Her skirts tangled almost immediately, her corset banging painfully against her ribs with every revolution. Her hat came askew and caught where it buttoned to the collar around her neck. She didn’t care. The entire childhood she had missed, the playgrounds and ponies and toys and wide-eyed wonder—in that moment, she gave herself over to the stifled child inside.</p><p>Right until she knocked into something big and hard. It shifted away, and she sat up, dizzy, trying to figure out what sort of boulder was warm and hairy and capable of grunting.</p><p>And snarling.</p><p>With a little shriek and a hand to her forehead, she forced her eyes to focus on the gray blob just a few feet away. It wasn’t a boulder, although it did resemble one. It was a badger.</p><p>Stretching out flat, it opened its mouth to hiss with pointy, blood-streaked teeth.</p><p>Oh, sweet galloping gravy.</p> <p>Of course. She’d fetched up against a bludbadger.</p><p>As a scientist, she’d studied all of the indigenous creatures of Sangland. She knew, for example, that this rank-smelling fellow was part of the weasel family and that his species name was Meles meles sanguinis, as all of the omnivorous badgers had been turned to blood drinkers several hundred years ago. She also knew that he was a relative of the ferocious honey badger and that a group of badgers was called a cete or a clan.</p><p>More important, she knew that a cete of bludbadgers could kill a human and reduce him or her to a pile of nibbled bones in the work of a few short minutes.</p><p>All of that knowledge zipped through her brain in a second, as long as it took for her to stop seeing dizzy stars and start noticing the pretty play of stripes on the murderous creature’s back. Its nose wiggled, and it growled again, darting toward her stocking-clad leg in a sharp feint that made her startle and jerk backward. Her boots caught on her skirt, and the bludbadger almost seemed to smile, its black lips drawing back over too-sharp teeth and its tongue darting out to lick its wet nose hungrily.</p><p>Imogen struggled to her feet, cursing the layers of clothes that, in theory, should have protected her from the noses and teeth of blud creatures. Had she stayed on top of the hill like a reasonable person and not thrown her body humpity-bumpity down the slope, it might have never even smelled her. But now that she’d nearly bowled it over, the burly creature would be on her in moments, if she didn’t think quickly. And if it got her to the ground again, she would be dead.</p><p>There was a copse just a short jog away, some small saplings and older stumps nestled in a tangle of bushes. She ran for it, holding her skirts around her knees and paying no mind to the hat and the unbecomingly loose hair flapping around at her back. There was no one there to see her, which was ultimately the problem. She cast her eyes around the ground for a branch or a rock but found nothing. The trees weren’t tall enough to climb, had she even known how to go about climbing a tree. Cursing herself for foolishly walking away from the caravan without so much as a hatpin, she scrambled up onto a stump and unbuttoned her hat in one desperate rip.</p><p>“Back off, Meles,” she shouted, “or I’ll beat you to death with my hat!”</p><p>The bludbadger advanced on her, low to the ground and growling. It would have been ridiculous had it not been so deadly, waddling on thick legs and wagging its stubby gray tail. Imogen was panting now, her heart heavy and fast in her ears and her vision still dancing with dizziness from rolling down the hill. She had read once that the blud creatures had evolved faster than humans, that many innocent and foolish people had died because their eyes told them a squirrel or rabbit was sweet and innocent and possibly edible. And in that blink of a smile, the opportunistic creatures would latch onto their necks and rip open their jugulars. Imogen wouldn’t be one of those people, not if she could help it.</p> <p>She went into a crouch on the stump, bouncing on the balls of her feet, the energy shooting down her fingertips. The badger put a fat paw on the wood and wrinkled its nose at her, and she shrieked and aimed a kick at its nose. When the badger squealed and stumbled backward in surprise, she shouted, “Ha! Try it again!”</p><p>The bludbadger circled her stump, and she pivoted with it, always facing it. Its eyes looked deeply stupid, but that, too, could have been part of the farce. She began to think she could win in a fight against the strange creature, and she decided on a frontal assault. She was just about to leap off the stump and dig her pointy-heeled boots into its striped back when something rustled and grunted from the bushes in the heart of the copse. Her badger made a squealy growl, and an answering squealy growl sounded from the bushes, and she fought the lump in her throat. So it had a cete, then.</p><p>“Fine. I’ll take you on, too, you ugly beast!” she shouted. “I’ll stomp on your ugly husband, and then I’ll stomp on you, and when your nasty little kits eat me, I hope one of them chokes on my pinky bone!”</p><p>The words rasped and caught in her throat. She had always held her tongue when she wanted to answer cruel words from her father or her professors or her fellow students. Even Beauregard. Again and again, she’d swallowed her feelings. If shouting them out at a bludbadger was her last chance at venting her fury to the heavens, then she would, by God, go down shouting.</p><p>The badger turned to squawk at the copse, and she clumsily kicked it again. The odious thing growled and snapped at her, and in a sudden fit of invention, she swiftly untied her boot, wiggled her foot out, and held the pointy, earth-caked heel out like a weapon. The stump was uneven and cold under her stocking, and the badger’s nose wiggled delightedly at the toe poking from a hole in the sodden gray cloth.</p><p>“Back, manky beast!” She brought the heel down on its nose, and it lunged for her just as its twin in ugliness waddled out of the copse at an alarming pace for such an ungainly creature. Soon they were both leaning against her stump and slashing at her with teeth that would have been more appropriate on a timber wolf. She grew frantic and flurried, smacking at them again and again, shouting and twirling around as they growled and squealed and jumped at her. In her heart of hearts and in her scientific mind, she was certain the creatures were just waiting for her to get tired and give up so they could eat her at their lazy leisure.</p><p>The larger one finally made a ferocious lunge and broke the flesh of her ankle, shredding through her stocking in a white-hot gash. With its teeth firm around her skin and pressing hard on the bone, she shrieked in fury and drove the point of her boot heel into its eye. It screamed and dove away, pawing frantically at its face, and she stared at the blood-gored leather point, amazed at her own ferocity. That is, until the smaller bludbadger unleashed a ferocious, unbadgerly howl and leaped onto the stump with her.</p><p>She kicked it, and it had the temerity to grab onto her boot with fat paws tipped with sharper claws than she had anticipated. Imogen jumped, shrieking, shaking her foot and beating the badger with the boot. It grabbed a mouthful of fabric and ripped a hole in her skirt. In that moment, when the gentle breeze of the moors struck her leg in tandem with sharp teeth, she finally understood that she was going to die, out on the moors, alone, in a very undignified and ridiculous way. Pummeling the badger with her shoe, her nerves hot with the pain of bruised bone and sliced skin, she screamed at the sky.</p><p>The other badger came back, angrier than ever and splattering blud from a dangling eyeball, and the boot was ripped from her hand. She couldn’t tell what was happening, only that there was gray fur and stripes and dark blood and pain all up and down her legs, and her gloved fists fell again and again on unyielding backs. They knocked her to the ground, and the only thing that kept her throat from being ripped out was the annoyingly thick collar of her blouse, finally serving its purpose. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She had just rolled over and hidden her head under her arms when she heard one of the badgers scream. A weight disappeared off her back with another scream. She smelled metal and heard the clanking of gears, followed by the snapping of bone and the rip of flesh and heavy thumps and a dying howl. When she dared to look up, she found copper eyes regarding her, green lights in their centers glowing unnaturally. A badger’s boneless body lay beside her on the ground. Just beyond, a man’s form kneeled over another pile of gray fur. As if coming up out of a dream, she recognized Henry, clad in his flapping leather coat and holding a blood-spattered wrench.</p><p>“Imogen, are you harmed?” He kicked the badger aside to grasp her hand and help her sit up.</p><p>She was shaking all over, teeth clacking together. He held back as if afraid to touch her, but she dragged herself into his arms. Henry hugged her close as she burrowed her face against him, anxious for the man hiding underneath all the damnable layers. His hands fluttered over her, searching for damage, lingering over the rip in her skirt.</p> <p>“I’m bitten,” she managed to whisper, and he swore. Taking her in his arms, he stood and began walking quickly toward the caravan.</p><p>“If something else smells you, we might not be enough to fight them off,” he said. “I saw you with the periscope and almost didn’t bring Raith with me. Thank heavens I did. They nearly had you.”</p><p>“Some things books can’t prepare you for,” she whispered.</p><p>She looked down and realized that the copper and steel creature padding at his side was a clockwork cheetah, its silvery teeth scrawled with blood and thick gray hairs. It was eerie, how it seemed so fluid and alive, its joints moving smoothly and its eyes glowing green.</p><p>When a soft brown rabbit hopped out of the grass, Henry said, “Raith, kill the bludbunny,” and the cheetah leaped elegantly, steel fangs open to crack the rabbit’s neck. Imogen shuddered, and Henry pulled her closer. There were more bludbunnies and more cracked bones, but she didn’t look up again until she heard a wagon door open.</p> <p>The door shut behind them, and she knew from the smell that it was his car, not hers. She looked up, confused. Still holding her in a way she found suddenly intimate, he elbowed a large button hidden behind the coatrack, and a bed unfolded from the wood-paneled wall with a smooth whir. He set her down gently against the pillows and turned away.</p><p>“Henry, I shouldn’t be here—”</p><p>With his back to her, he unbuttoned his coat and threw it to the floor with the hat and goggles. He turned to her, himself again, sweat darkening his hair and green eyes burning.</p><p>“You should. I’m sorry I turned you away. If I hadn’t been such a coward, you would never have gone running across the countryside on your own.”</p><p>“It’s done. You saved me. I don’t think there’s any permanent damage.”</p><p>“There might have been. My stubborn silence was nearly the death of you. And by bludbadger, no less.” He gave a strangled sort of laugh and collapsed next to her, lifting the torn hem of her skirt and running a hand along the gash on her ankle where the creature had slashed her. “You were lucky. It probably won’t even leave a scar.”</p> <p>“I’m not worried about scars. I just want to know, once and for all, why you keep turning away from me. After the other night, I’d say I deserve to know.”</p><p>He jerked his hand away from where it had idly been stroking her ankle and rubbed his eyes. “That was unkind of me. You’re right. I should have known I could trust you from the beginning. Once I’ve told you the truth, you can decide for yourself.” With trembling hands, he unlaced her remaining boot and set it beside the bed. “I was at King’s College once, too, and there is also a price on my head—perhaps an even higher one. Do you follow the papers?”</p><p>“My father did. Sometimes I caught the front page.”</p><p>“Then you’ll remember the story about the clockworks in the London Carousel that malfunctioned and nearly killed all those children and the Magistrate?”</p><p>“Good heavens, who could forget that?” she said. “The bloody thing exploded!”</p><p>“Indeed. And do you remember the name of the foolish mechanist responsible?”</p><p>She thought back a handful of years. It had happened before she defied her father and fled to King’s College and Beauregard’s employ, in the days when she would try to catch up on the manly world through ink smeared by her father’s buttery fingerprints.</p><p>“I don’t remember. Clockworks didn’t interest me at the time. But I know he was never caught,” she said slowly.</p> <p>He smiled, swallowed, looked away, a blush riding his cheeks. “You can see why I might wish to stay hidden, then, especially around London.”</p><p>She laughed, and he jerked back as if surprised. “Henry Gladstone, are you telling me you nearly blew up the Magistrate?”</p><p>“Er. Not on purpose. I was very young.”</p><p>With a snort, she reached for his hand and pulled him around, forcing him to face her. “You look very much as if you’re going to bolt again, you silly fool,” she said.</p><p>”And you seem to think you’re immune to danger of any sort.”</p><p>She smiled and ran a fond hand over the scar in his beard. “Now, look here. I don’t care a fig about your exploding carousel. It was years ago, and we’ve all made mistakes. Whatever we were in the city, you and I, it’s clear we’re something very different outside tall walls and civilized society. Do you like me?”</p><p>“You’re bleeding on my bed, darling.”</p><p>“Answer the question.”</p><p>He reached out softly to stroke her cheek and pull her into his arms. “You are the most fascinating creature I’ve ever met that wasn’t made of metal,” he said softly, a smile lighting his face and making her wish very much to see what was under his beard.</p><p>“Well, then. I find you agreeable. I found what we did under the tent more than satisfactory. You’ve just saved me from a very ugly death. Can we admit, then, that we are happy together?”</p><p>“Gladly.”</p><p>“And so long as we keep each other’s secrets, there is no reason we can’t be honest with each other?”</p><p>“Agreed.”</p><p>“And you won’t go locking me out or getting all stiff?”</p><p>“Can’t make any promises regarding that last bit.”</p><p>She snorted. “And we agree you’ll shave that infernal beard?”</p><p>He stroked the object in question with a sly smile. “It’s been a fair disguise. But if you ask it, I’ll shave,” he said. “But you’ve got to shave something, too.”</p><p>Imogen spluttered and felt herself turning red. Fussing with her ripped skirts to hide her embarrassment, she barely had time to consider the logistics of such a plan when he caught her face again.</p><p>“And you’ve got to tell me, too.” He kissed her, just a gentle brush of warmth. “What are you really running away from, Imogen?”</p><p>It was her turn to sigh and look away. But he wouldn’t let it go so easily.</p><p>“I know Beauregard wants his specimens, darling, but there’s something else, isn’t there?”</p><p>“I wish it were only the specimens.” She cleared her throat, wiggled her toes, and generally avoided his gaze. “He was my professor and my employer and my landlord, and I took him as a lover. Or perhaps I should say that he used me as such. He wants those specimens, make no mistake. And he wants me. But what he wants most of all is this.”</p><p>Imogen carefully unpinned the brooch from her jacket and pressed the button to unlock the tiny hinge. Inside was a single red hair.</p><p>14</p><p>“That’s not a butterfly.”</p><p>He held out one finger as if to touch the thin red filament where it lay on a folded bit of scribbled parchment, and she whipped it out of reach.</p><p>“Indeed not.” She snapped the locket’s door closed, and they both exhaled in relief, as if the object within was finally safely caged. “What you saw is one of the last true hairs of Aztarte, the Bludmen’s goddess.”</p><p>“Then your butterflies . . .”</p><p>“Are dead. It’s only charmed necromancy, I fear, no true talent on my part. I wish they were alive, more than anything. I wish to see them floating on every breeze, quivering on every bush. I wish I could build a beautiful greenhouse filled with flowers for them to live out their short, brilliant lives and make hideous, monstrous babies. Alas, all I can do is call them forth for some little while and pretend, for a moment, that they are real.”</p><p>“Then why does Beauregard want them so much? Surely it’s not the money.”</p><p>“He wants the hair and the spell. If he figured out how to use the magic, he could make a mammoth tap dance or bring back the corpses of kings. He wants to become even more famous. And he’s that old-fashioned, hardheaded sort that can never rest when a woman has the upper hand. He thought to make me his plaything, and I took all that he held dear. He wants revenge.”</p><p>Henry looked around his wagon, his eyes resting with significance on the clockwork cheetah sitting still as stone by the door. “But then why did you plan on using them as your act? Surely that would call him out and invite violence against you?”</p><p>She sighed sadly. “I had heard the caravan was moving out the next day. I supposed it would take a few cities to build the equipment, that it would be months before anyone in London knew of the deception. I thought it was the only answer, as I’ve no real skills outside of research and scholarship, an area where I’m ridiculed and shunned. I nearly burst out crying when Criminy confirmed that we would be here for another week. But Letitia was so kind, patting me, promising me that it would all be for the best.”</p><p>“From what I hear, she’s never wrong,” Henry said, his gaze lingering on Imogen’s brooch. “It’s funny—I had thought to bring you good news later today. The reason Vil turned you away was true—the paints I was using for the final touches of the butterfly circus are harmful, and I wanted you far from the vapors. Perhaps you will think it bad news now, but your act is ready.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I can think of few things worse than being forced into my first performance this close to London. Can we stall?”</p><p>He hung his head, stroking her hand. “Again, I’m sorry. I informed Criminy this morning that you would be ready for your grand unveiling this very evening. I believe he has taken the liberty of printing new posters and having them hung up in town.”</p><p>“I should have told him the truth.”</p> <p>“There’s a lot of that going around. But when I told him that you had concerns, he didn’t bat an eyelash. He’s determined that everything will be fine. Hell of a will on that fellow.”</p><p>“So there is no escape for me?”</p><p>“Not unless you care to face the bludbadgers again.”</p><p>“It might be easier than facing the crowd,” she grumbled.</p><p>Back in her wagon, she found her armoire open. Her new costume hung carefully within, a pinned note sending the regards of Master Scabrous. Still trailing the blood-splattered hem of her badger-ruined skirt, she ran a hand along the costume’s coppery brown jacket, beautifully embroidered in black. Turning the sleeve, she smiled. He had outdone himself, and if she found her proper end tonight, she would do so in the greatest style of her life.</p> <p>She sat on the edge of her bed, kicking off her lone boot and imagining bludbunnies savaging its mate on the moor, freckled with the blud of the badgers. Perhaps it would have been easier if they had just taken her then. It was all going to end badly—she was sure of it. She had knocked on the ringmaster’s door, looking as pitiful as possible. But Master Stain had said simply that the show must go on, and Letitia had held her hands and assured her that everything happened for a reason.</p><p>Henry had promised her that he would be nearby, but if Beauregard had finally tracked her to the caravan, there was no hope. Weapons were strictly forbidden to the carnivalleros except for certain families that held long-standing dispensations, and Criminy wasn’t in one of them. Even Veruca’s swords couldn’t cut butter. Criminy couldn’t endanger his caravan by intervening on Imogen’s behalf, and the Coppers were always in attendance. And if Henry employed his killer cheetah, the Coppers would definitely have questions to ask, and she wasn’t willing to trade her freedom for his.</p><p>She would perform, and if Beauregard was there, she would hang.</p><p>But she would give an unforgettable show beforehand, something even Master Stain had never seen. Imogen had considered running away, asking Henry to come with her. But she now knew exactly how far they would get on the moors on foot, and she wasn’t ready to live her life on the run, two convicts without a home. She could never go back to a quiet, drab life behind city walls, not after her days with the caravan. She stroked the brooch, a single tear slipping down her face. When her eyes wandered to the door, she saw the freshly stuck poster there showing an elegant lady in silhouette with butterflies flying on strings like balloons.</p><p>SEE! The Mysterious Madam Morpho and her Butterfly Circus! it cried.</p><p>Such a pity that her first show would probably be her last.</p> <p>The sun was setting, and she rose to dress.</p><p>Solemn and silent, she laced her boots and tightened the new corset from the front. She had requested one that would require no outside help, for she had ever been a solitary creature. With a grunt, she tested her ankle, which was still sore from the bludbadger’s assault but supported her well enough. Next, she slipped on the tight-fitting black dress, whispery slim against her skin, a fashion that Londoners would consider outrageously revealing. Then she tied the skeletal dome of hoop skirts around her waist, arranging them just so around her legs, like a birdcage. Tiny paper butterflies swung from strings within, swaying with every step. Then long black gloves. Then the swallowtail jacket, a shimmering copper with black designs to mimic the Monarch butterfly. It buttoned carefully up to the neck, as it should, but she touched the hidden panels of it, smiling to herself. Master Scabrous had been more than willing to indulge her when she offered sketches for its design. She figured that what she lacked in showmanship would be more than made up for by the brilliance of her costume and the magnificence of her butterflies.</p><p>There was a knock on her door, and she unlocked it listlessly.</p><p>“The reclusive Mr. Murdoch sends this gift as a token of ’is esteem,” Emerlie read off a card before rolling her eyes and stuffing a box into Imogen’s hands. “Let’s see, then. Open her up.”</p><p>Imogen slammed the door in her face, the corner of her mouth lifting slightly when Emerlie called her a very dirty word on the other side of the door. What did it matter if she was well liked? It would all be over soon enough.</p><p>Imogen placed the box on her bed and lifted the lid. Resting gently on a nest of crumpled book pages was a mask nearly too beautiful to contemplate. She had heard of such things used by the daimons in Franchia for performances and celebrations, but she had never seen one before, much less touched the thin, flexible leather. It was contoured to fit her face, painted to match her coat in shimmering copper and black. Cupping it in both hands, she held it over her eyes and pulled back the long silk strings to tie them behind her head. With her hair coiled low on the nape of her neck and her small hat sporting long antennalike feathers, she very much resembled one of her uncanny charges.</p><p>She hadn’t told Henry, but she loved them just as much dead as if they had been alive. They had a special bond now—she was the only one who could give the butterflies back the breath of life, their fairy wings dancing on air. They couldn’t speak, couldn’t communicate. And yet they were drawn to her, as if they knew that she alone held the magic to call them. Whatever happened tonight, she was glad she had freed them from that dark, moldy attic, where they had sat, unloved and unnoticed, for decades. And she was glad Henry had thought of this beautiful mask to help hide her from Beauregard and the Coppers. She would have a chance to thank him later, she hoped.</p><p>With one last look in the mirror and her hand on the brooch pinned over her heart, Imogen stepped out and closed the door to the wagon, unsure if she would ever see it again.</p> <p>15</p><p>Henry waited for her outside, lurking near the clockwork flamingos. Even if no one else in the caravan could tell him apart from Vil, she knew him instantly. The way he carried himself, the breadth of his shoulders—or, much more simply, the fact that he wasn’t constantly hiccuping. He held out his arm, and she laid the black silk of her glove against the worn leather, feeling dainty and beautiful for the first time in her life.</p><p>“I have everything prepared,” he whispered to her. “Never fear.”</p><p>“I have never not feared,” she murmured back. “It’s a pretty enough way to go, I suppose.”</p><p>“You’re not going anywhere, fool woman. Over my dead body. And Letitia doesn’t seem worried, so you shouldn’t be, either.”</p><p>“It rankles, being ever dependent on the kindness of strangers.”</p><p>“We’re all strange, darling. But you must have faith.”</p><p>She could see it then, waiting in the last red light of the setting sun. A low, round pedestal painted velvet black with a curved backdrop like the set of a Greek tragedy, the better to show off the soft grays and vibrant blues and sunlight-spangled oranges of the butterflies. Everything they’d designed together waited, perfectly staged, and she smiled to see the golden leashes glinting under globe lanterns. If only it had been ready earlier. As it was, she had never even touched it, much less practiced with her performers.</p><p>Criminy’s Clockwork Carnival was in full swing. The air danced with magic, waves of warmth carrying the scent of caramel and chocolate and exotic spices. The hurdy-gurdy from Mademoiselle Caprice’s dancing lessons twinkled on the breeze, rising and falling merrily. It would have been perfect and beautiful, just the place to finish falling in love properly. She wished she and Henry could turn and stroll in a different direction, play games of chance and laugh at the sights. But she had a job to do. There her act sat, awaiting only her magic charm.</p><p>And there he waited, just another face in the crowd.</p><p>Professor Beauregard.</p><p>His sallow complexion stood out almost yellow against the navy top hat and cape of his professorship. His sharp nose curved downward, and his cruel smile curved up to meet it. Imogen shuddered to think how many times she had let this foul excuse for a human being touch her in her most private places with clinically painful indifference.</p><p>“Well, if it isn’t Jane Bumble,” he said as she passed. She held her chin up, her eyes staring straight through the holes of the mask, straight through him, toward the proscenium where the butterflies waited, lying dead as wisps of paper.</p><p>“Her name is Madam Morpho,” Henry said sharply. “And she doesn’t speak to the riff-raff.”</p><p>She stepped up onto the pedestal, the paper butterflies swaying in the cage of her hoop skirts. With a deep breath, she faced the gathered crowd, noting the Coppers jammed in among the city folk and a few of the carnivalleros, who, like Emerlie, couldn’t miss a first act. Swallowing down her fear, Imogen bowed at the waist, throwing her arms out in a theatrical bow. The fake wings engineered by Master Scabrous sprang outward and unfurled, the brilliant blue of a Morpho butterfly’s wings shimmering behind her. The crowd gasped, and she stood, chin up, resplendent.</p><p>She twirled and bowed, moving behind the arch to bend her face close to the butterflies. Through the holes of her mask, she saw Beauregard tense and begin to shoulder forward through the crowd, and she muttered the charm as quietly as she could.</p><p>And nothing happened.</p><p>She whispered it again, slightly louder, and the butterflies suddenly jolted to life. A spotlight shot through the darkness, landing on the stage in the center. The folded wings of the butterflies flicked up, vertical, to flutter a few times.</p><p>“Take up the baton and conduct,” Henry whispered from the shadows.</p><p>A slender golden rod that resembled a magic wand waited beside the stage. She remembered seeing it among his sketches, but it was so cleverly constructed that she couldn’t see the strings that had to be hidden, somewhere, to drive the mechanisms. With a dramatic sweep, she raised the baton and brought it down as she had seen Mademoiselle Caprice conduct her dancers. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As if they knew their duties and had performed dozens of times, each butterfly musician took to its task. The Monarch that had once played in Henry’s hair squeezed an accordion with its front legs, while a Common Jezebel tapped twin drums with every downbeat of its bright yellow and red wings. A battered Leopard Lacewing held still and aloof as it impossibly blew a tiny horn with its proboscis. A circle of Skippers rubbed their legs over miniature violins, producing an eerie warbling that was magnified by a golden gramophone. Imogen conducted in what she hoped was a waltz, and the butterflies flapped in three-quarter time with her wand.</p><p>She was grateful that the mask hid her amazement. Truth be told, she had gone into this experiment expecting to be arrested on sight. With no practice and no actual experience with her circus, she was simply bumbling through as well as she could. The butterflies were magnificent, and she would have kissed them had they not been dead and also easily damaged.</p><p>Her eyes sought Beauregard, who was whispering to the Coppers flanking him. Her baton sped up, taking the music with it, as she thought about what he might have to say about her to other citified men. Her cheeks went red with embarrassed fury behind the mask, and she wondered what was being reported about her in London by those who had never truly known her. But when she looked up again at the rest of the crowd, she saw faces slack with amazement and eyes filled with tears.</p> <p>The crowd, the rabble—they felt the magic.</p><p>Of their own volition, the butterflies ended the song with a crescendo that spun out into the night, the tiny violins thready and high and echoing. When the crowd burst into applause that was more than polite, Imogen bowed, one hand carefully on her mask. Perhaps the disguise was the only thing that stood between her and a London hangman’s rope.</p><p>The spotlight above snapped off, bathing the scene in darkness. Beauregard had just shouted, “Now!” when a new spotlight burst on, focused this time on stage left. The Coppers made no move to come for her, so Imogen leaned in to whisper to the still forms. The butterflies’ wings tottered slowly upright.</p><p>She and Henry had agreed that the feats of strength would be performed by Swallowtails and Birdwings, as they were the largest and hardiest of the lepidoptera. The butterflies in this act were each attached to a complicated machine of pulleys and levers, but they paused as if waiting for further instruction. Just as Imogen opened her mouth to speak, a smaller butterfly crawled to the front of the stage on delicate legs. It was the Lacewing from the band, and it piped a merry song on its horn.</p><p>On cue, the Swallowtails and Birdwings began to pull their weights in time with the music, adding a tinkling metallic counterpoint to the horn. Even though these butterflies were bigger than her hand, it was still amazing that they could manage to lift the metal weights at all, much less with such careful coordination and impeccable timing.</p> <p>The Goliath Birdwing crawled to the front of the stage, wearing a top hat modeled on Torno’s leather topper. It was a male and the largest in her collection, almost a foot across, with wings of proud green and gold, and it stopped before a black barbell that exactly mimicked the one she’d seen the Strong Man carrying under the tent. With a flex of its antenna, it picked up the barbell and pressed it skyward, first with one antenna and then with the other, then with its coiled proboscis. She couldn’t help smiling under her mask, thinking about how long it had taken her to find a book big enough to fit the monster butterfly. The crowd cheered, and she heard Torno’s voice raised over the rest, calling, “That is my kind of butterfly, that one!”</p><p>At this point, she realized that she was as enraptured as the crowd. When she had devised this scheme, she hadn’t considered what she, herself, would be doing. She wasn’t like a lion tamer with a whip or a clockwork artificer with his code words. She wasn’t actually necessary, and if there had been any hope of her escaping Beauregard, she would have been worried by her own lack of panache. On a whim, she slid her hand to the Goliath, coaxing it onto her palm. She was surprised at the weight of it and could feel its feet prickling through her gloves as it stepped up. She held it aloft with a flourish as it hefted its barbell, and the crowd erupted in cheers and laughter.</p><p>It was a moment of triumph, and she found that she adored the excitement of the crowd, liked being a part of the caravan. She was just about to place the giant butterfly on her hat when the spotlight winked out on the tiny strongmen and a new one flickered onto stage right. The other spots had been warm and golden, but this one was a cool silvery blue, like moonlight on water. There they were—her favorites. The Morpho butterflies. She set the Goliath Birdwing down gently in its place and moved out of the light to let her dearest treasures shine as they deserved.</p><p>At her whispered word, their fat wings wobbled upright around tiny black bodies. They had been named after Aphrodite, a pagan goddess from the islands who had been known for the lust her beauty inspired. And the beauty of the Morphos was otherworldly indeed, their wings shimmering with iridescent scales like diamonds layered with starlight. They waited in place for a heartbeat before the tiny band in the shadows began playing a lively air that echoed the caravan daimons’ hurdy-gurdy.</p><p>A Sunset Morpho in vibrant yellow and orange stepped gingerly across a tightrope so carefully that Imogen forgot for a moment that there was no danger for a winged creature on the slender filament. Butterflies of periwinkle and glittering gray and bright blue and soft brown spiraled into the sky like acrobats, tethered by golden leashes as they twirled in complicated patterns that mimicked city dances. And her beloved Blue Morpho took center stage in a tiny sparkling top hat, flapping its wings at a trio of miniature clockwork lions that sat on their haunches and roared.</p><p>Filled with a fierce triumph, Imogen held her arms out like wings, and the crowd drew closer to watch the magic of butterflies in flight.</p> <p>“They’re real!” a child whispered, and his mother answered, “As I live and breathe.”</p><p>“Never thought I’d see another one,” an old woman said, tears shining in her eyes.</p><p>“Utter magic,” a large man murmured, voice hitching as he tugged at his cravat as if it was too tight.</p><p>At the back of the crowd, Criminy waved a red handkerchief to catch Imogen’s eye. She bowed just the slightest bit, and he doffed his hat to her grandly with a grin. By his side, Letitia grinned and gave her a thumbs-up. So she had a job, then, if only she could live out the night.</p><p>The crowd was silent, barely breathing, as the Morphos spun in the air, fluttering in the spotlight. For a few moments, magic held them there, enraptured. But Imogen knew it could only last so long. She was out of acts, and her arms grew tired as she struggled to keep the costume’s wings out and steady. Finally, the tension snapped.</p><p>“I demand that this woman be arrested,” Beauregard bellowed. “These are the specimens stolen from the Natural History Museum in London. She is a thief and a fraud!”</p><p>The Coppers were through the crowd, up onto the pedestal, and on her in an instant, their leathers creaking as they wrenched her arms behind her and shattered the frames of her wings. One of them ripped off her mask, and it fluttered to the ground. She didn’t fight—what was the point? She had known it would come to this. She glanced into the shadows for Henry, hoping to give him one last, long look rife with things she should have said earlier, but she couldn’t find him.</p><p>“My dear sirs,” Criminy Stain said, appearing at her side in a glittery red tailcoat. “Whatever do you mean by manhandling my employee?”</p> <p>“You’ve seen the broadsheets, bluddy,” one of the Coppers barked. “She has his specimens. Means she’s the thief, don’t it?”</p><p>Criminy laughed that wild, charming laugh of his and whispered out the side of his mouth, “Forgive my impertinence, but surely Professor Beauregard can tell machinery from reality? These butterflies are clever frauds, forged by my chief machinist, Vil Murdoch.” With one hand, he snatched the Morpho from the tightrope, and Imogen shuddered to think of its feathery wings being crushed by his white glove.</p><p>To her great fascination, Criminy twisted some part of its anatomy, and the butterfly stopped moving. He kneeled on the edge of the platform and held it up to Beauregard. “Pretty bit of metal, is it not? Things can fool you, unless you look very closely.”</p><p>“This is an outrage!” the professor spluttered. “That is Jane Bumble, and these are my butterflies, and she has stolen also a charm of great renown. The last known hair of Saint Ermenegilda, the one the Bludmen call Aztarte. Search her! You will find it. A single red hair. It is necromancy, and make no mistake!”</p><p>The crowd crept away from the frothing man, and the Coppers began to move toward him. The ones holding Imogen’s arms let her go gently and advanced on Professor Beauregard as if he were a rabid dog.</p><p>“Now, Professor, you can see as how it’s all clockwork, can’t you, sir? ’Tis merely a caravan, a circus. All smoke and mirrors,” said one.</p><p>“Let’s calm down, now, shall we?” said another. “Won’t do to go frightening the women and children.”</p><p>“There is perfidy about! My specimens are nearby! Hidden! Search that woman now! She probably keeps the relic in her corset, thinking you won’t look there. But it’s there!”</p><p>Beauregard tried to climb onto the pedestal, but the Coppers pulled him back down.</p><p>“What’s your name, lass?” one of the Coppers said, and she almost said, “Jane Bumble.”</p><p>But Criminy’s voice rang loud. “Her name is Imogen Morpho, and I carry her papers.” He slid the packet into the Copper’s hands and grinned rakishly at her as they were examined.</p><p>“All in order.” The Copper shoved the papers back at Criminy. “Sorry, there, Professor. I understand as how you’re upset, but any bloke can see that she’s Imogen Morpho, and them’s clever bits of metal. Besides, she looks nuffin’ like the Wanted posters. Ain’t nuffin’ we can do. You understand, right?”</p><p>Right before the Coppers led him away, Beauregard’s eyes met hers, and her chin dropped just a little. Anger, unkindness, indifference—she’d seen them all in his eyes. But now she saw murder. She might have fainted, had Henry not appeared behind her, his arms wrapping possessively around her waist. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I told you not to worry, darling,” he whispered. “The caravan takes care of her own.”</p><p>“I think you mean his own,” she said, watching Criminy Stain try not to laugh as the Coppers dragged the thrashing professor away from the crowd.</p><p>Criminy leaped onto the pedestal at her side and put the butterfly into her hand. It was heavier than it should have been, its wings beating with a rhythmic click.</p> <p>“Mr. Murdoch is rather a genius, don’t you think?” he asked.</p><p>“Master Stain, I don’t know how to thank you—” she began, but he waved her off.</p><p>“Thank me by drawing a crowd and charming them over again, my lady. That’s what we do best.”</p><p>He reached down to pluck the mask from the ground and gallantly placed it into her hands.</p><p>16</p> <p>The rest of the show was uneventful. Beauregard had done her a favor by attracting so much attention, and she was busy enough showcasing the cunning butterflies and pressing the right buttons herself according to Henry’s whispered instructions. At first, it felt strange, being gawked at by so many slack-jawed strangers. But by the time the third crowd had gathered around her, she knew just how to time the music and the unveiling of her hastily repaired wings. Criminy’s clockwork monkey even came by to deliver a note of congratulations signed in red ink.</p><p>Although she could tell now by their movements that all of the butterflies were fake, the caravan visitors showed no doubt whatsoever. Children gaped, women looked on with silent tears, men debated their price on the open market, and ancient city dwellers recounted the last time they had seen butterflies in the parks of London. It was what Imogen had always dreamed—that the world could see the beauty of creatures long extinct. And yet these were not her priceless specimens. Perhaps, like the clockwork animals waiting between the caravan cars, a feat of mechanical magic was just as original, just as miraculous, as the real thing.</p><p>And yet she had to wonder what that meant for her. Anyone could run Henry’s clever contraption, his automated butterfly circus. A child could master it in moments. If Imogen’s specimens stayed forever safe on a shelf or simply fluttered around her head all day, Criminy’s caravan had no real need of her. As she had been told her whole life, she was useless. Undaunted by the painful truth, she became more determined than ever to carve a life for herself among the carnivalleros.</p><p>When the crowds finally dispersed and the last bus-tanks were rolling back to London over dark moors, Imogen was more exhausted than she had ever been. Performing onstage was both wonderful and terrible, and she had never quite believed that Beauregard was gone. He wasn’t one to give up on anything, and despite the Coppers’ assurances that he would not return, she kept waiting to see his nose cutting toward her through the crowd like a shark through murky water. She had seen him pursue a fossilized dragon’s tooth through three years’ worth of auctions and buyers, just waiting to snatch it up at the right time. And now he knew exactly where she was.</p><p>She pressed the button to turn off the mechanical butterfly circus, and the graceful bodies silently fell where they lay, the wings folding gently. It was so clever, how Henry had waited until the precise moment she had whispered to set his machinery into motion by remote control from where he stood in the shadows. Bending over, she traced a Swallowtail with one finger, boldly feeling the enamel body where it sparkled against the wooden boards.</p><p>“Even you believed it at first,” Henry said, appearing at her side, and she nearly threw herself into his arms, tucking her head against his chest.</p> <p>“All this time, you never told me. How long have you been planning this?”</p><p>“From the start. I feared some secrets had best keep themselves.”</p><p>“But you said nothing. Why?”</p><p>“Because I knew you wouldn’t accept it. The scientist in you wants the world to love the miracle of the butterflies, to know the wonder of seeing what no longer exists. But I would rather keep you safe than give them a spectacle they can’t even appreciate.”</p><p>She reached up to touch his face and drew back. It was smooth. “Your beard!”</p><p>“I told you I would shave it. For you.” He leaned back, running a hand along the sharp line of his jaw. “I thought it might be some small compensation for fooling you.”</p><p>“Another hypothesis proved true. You’re even more handsome without it.”</p><p>He helped her down from the platform and guided her to the door of his wagon. Imogen stepped in, so tired she was swaying on her feet. Henry closed the door and gently turned her, untying the mask and the cage of her skirt and hanging them both on his octopus coat rack. Next came her coat, the brilliant blue winking warmly in the lamps. Then she wore nothing but the black silk dress, which clung to her like a liquid shadow.</p> <p>She watched him as he removed the leather coat, the hat, the goggles, the gloves, a smile curving her lips as she saw his bare face and unhidden figure for the first time. So much of life in the caravan involved dressing and undressing, and she wanted to get into bed and stay unencumbered for some time.</p><p>“There you are,” she said, and he shook out his sweat-damp hair and grinned.</p><p>“I barely recognize myself.”</p><p>A footstep sounded from the workshop.</p><p>“Oh, but I recognize you, Henry Gladstone.”</p><p>They froze, hands clasped, as Beauregard stepped through the door, a small crossbow aimed at Imogen’s chest.</p><p>Beauregard chuckled. “I remember the papers. You were the one who nearly killed all those poor children and our beloved Magistrate. This caravan makes a fine hiding place for those who seek to avoid the laws of London.”</p><p>“Professor—”</p><p>“Silence, Miss Bumble. I got what I needed from you, and it appears you’ve taken what you needed from me. Tell me where you’ve stowed the specimens and the charm, and I might turn you over to the Coppers in one barely tolerable piece and let your weaselly little assistant live.”</p><p>Beyond him, in the workshop, Imogen could see Vil’s boots on the ground, not moving, and she gasped.</p><p>“Now, let’s be reasonable—”</p><p>“That’s enough out of you, sir.” Beauregard swung his arrow toward Henry, who closed his mouth and swallowed, putting his hands up.</p><p>“The specimens, Miss Bumble. Now. Or he takes an arrow. Perhaps in the face, to make him even with that little girl he blinded?”</p><p>The crossbow swiveled upward, and Henry flinched. “I hid the specimens myself,” he said. “And I’ll gladly be rid of them. But may I say one thing first?”</p><p>“Make it quick.”</p><p>Henry pointed at the crossbow. “Ambidextrous onomatopoeia asphyxiate. Kill him.”</p><p>“What?”</p><p>Beauregard spun as the metal cheetah erupted from under the tarp by the door and leaped for his throat. With an explosion of junk, the severed half of a unicorn in the corner dragged itself toward him on copper hooves. Several unfinished snakes of brass and steel slithered awkwardly across the wooden floor, striking Beauregard again and again in the legs as the cheetah ripped savagely into his neck. Part of a woman’s torso from the Bolted Burlesque struggled to crab-walk across the room, leaving gouges in the floorboards. Soon there was nothing to be seen of world-renowned naturalist Professor Beauregard but twitching boots.</p><p>His crossbow clattered to the ground to splash in a spreading pool of blood. Henry sat on the bed, drawing Imogen onto his lap and tucking her head into his shoulder, crooning as the clockwork beasts destroyed the man who had almost destroyed them both.</p><p>“Shh,” he murmured into her fallen hair. “Look away, darling.”</p><p>After a while, he laid her down gently, facing the wall. With her head turned into his pillow, she heard him walk across the floor and throw back the rug. A latch unhitched, followed by the bang of a door, and she realized that his wagon had more than one bolt hole.</p><p>“Raith, carry him away. Leave him for the bludbadgers and return.”</p><p>A wet dragging noise was followed by a thud and a metal clank, and then the smooth clicking of the cheetah grew distant as it carried its heavy load through the night.</p><p>“Return, you lot,” Henry muttered. Imogen didn’t open her eyes until the sounds of metallic tugging and slithering had ceased and the only thing she heard was her own heartbeat frantic in her ears. She looked up just as Henry’s arms encircled her.</p><p>“Is Vil hurt?”</p><p>“Knocked out but breathing. Beauregard must have forced the poor fellow to give up the passcodes to my wagon.”</p><p>“Is Beauregard gone?”</p><p>“Very, very gone.”</p><p>“Can they trace it to you? To us?”</p><p>“I’ll clean up the blood tonight. The bludbunnies will leave nothing but bones. The bludbadgers might not even leave that much.”</p><p>She sighed, snuggling close. “I should feel sorry for him—but I find I do not.”</p><p>“Bad people come to bad ends, darling. He deserved much worse. We’d best go tell Criminy what’s happened. He might wish to move the caravan before morning to avoid unnecessary questions.”</p><p>When they arrived at Criminy’s doorstep, rumpled and half-dressed and mostly in shock, the caravan master only laughed that great, wild laugh of his.</p><p>“You were right again, my love,” he called into the warm light of the wagon he shared with Letitia.</p><p>“About Casper? Has the Magistrate finally tossed him out?” she called sleepily from within.</p><p>“About Madam Morpho and the reclusive Mr. Murdoch.”</p><p>“That’s not my real name, you know,” Henry said, rubbing his jaw.</p><p>“I’ve always known, dear boy.”</p><p>“And you should know that my real name is—” Imogen started, but Criminy quieted her with a hand.</p><p>“I don’t want to know, my dear lady. Whatever name you go by, whoever wants your head on a pike, you’ll always be welcome in Criminy’s Clockwork Caravan as Madam Imogen Morpho. And you can use the clockwork butterflies or the real ones for your show. Magic is magic, as far as I’m concerned. Either way, you’re one of us now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Imogen was quite done with conjecture. “But you don’t actually need me—” she started.</p><p>“He does”—Criminy nodded at Henry—“and I need him. Besides, it’s been years since I met anyone with a flair for magic who didn’t annoy me. That’s a tricky bit of necromancy with the hair and the butterflies, you know. I could teach you a few things. You strike me as an infinitely useful woman.”</p><p>Imogen let herself sag into Henry’s arms, a weight off her soul. She felt as light as a butterfly, knowing that even one person in the world thought her useful.</p> <p>Well, two people.</p><p>“Thank you, Master Stain. That means a great deal.”</p><p>“Don’t thank me, my girl. Thank my wife. If not for her prodigious talent, I’d have tossed you out onto the moors.”</p><p>“You wouldn’t have!” Henry spluttered.</p><p>“Wicked is as wicked does, Mr. Murdoch,” Criminy said, with an overly pointy grin. “Now, go back to your trailer and do whatever it is you Pinkies do when finally free of torment.”</p> <p>With a final waggle of sharply drawn eyebrows, the gypsy king slammed the door in their faces.</p><p>“Back to my wagon, Madam Morpho?” Henry asked.</p><p>Right there on the steps of Criminy’s wagon, watched only by a lone bludbunny and the cool cat’s grin of a moon, he kissed her. Her hands caught the smooth planes of his face for the first time, and she kissed him back gladly, feeling that finally she was in precisely the place she was meant to be.</p><p>“Let’s dance, Mr. Murdoch,” she answered. </p> </body></html>"]