["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chicago, 1928</p><p>There were only a handful of cops in the area. Just the few who'd been lose enough to hear the gunshots. Officer Michael Gray stood in an alley between two buildings his gun drawn but basically useless, as rival gangs, fired at each over from opposite sides of the street. Toy guns spat fire in the darkness. Windows shattered, and people ran for their lives. A car sped past, only to stop short as its windows exploded and the driver slumped over the wheel.</p><p>That was when he saw the boy. He must have been seven or eight years old, and scared half to death by the noise. He came out of nowhere and ran right into the street-right into the crisscrossing storm of bullets.</p><p>Michael reacted on sheer instinct. He ran out of the alley, shoving his gun into his holster as he went, knowing he would need both hands. He dove on the kid, pinning him to the pavement, covering him with his own body. Sheer adrenaline drove him, and he didn't even feel the pain until he was lying still, holding the kid underneath him. And then it hurt. It hurt like hell, from a dozen places on his body. But not for very long.</p> <p>When Michael woke he was in a hospital bed, in some kind of a daze. He didn't feel anything. He couldn't seem to speak, but he could see and hear what was going on around him. He heard a doctor saying there was nothing that could be done. He saw a nurse shake her head and dab at her eyes, but then she slid a sideways glance in his direction an gave him a wink. As if she knew something he didn't. What the hell? He was laying here, dying, and the nurse was winking at him? What kind of a hospital was this?</p><p>That thought fled, though, when he saw his wife, Sally, sitting in a chair in the corner of the room, pale as a ghost, shaking. Then the doctor took her arm, pulled her to her feet and led her from the room.</p><p>As soon as they were gone, the flirtatious nurse hurried to close the door behind them. Then she closed the windows curtains tight and came to his bed. \"About time,\" she said. \"It's damn near morning. I thought they'd never leave. Listen, they'll be back soon. We don't have much time.\"</p><p>She was cute, with short dark hair and huge eyes. He tried to move his kips, to give voice to the questions swirling in his mind, but he couldn't get them out.</p><p>\"Don't try to talk,\" she said. \"Just listen, okay? I'm not a nurse. My name's Cuyler Jade. I saw what happened in the street, and the way you saved that kid, and I followed the car that brought you in. Then I sneaked in borrowed this uniform from some nurse's locker.\" She turned in a little circle, arms out. \"Nice fit for a quick grab, isn't it?\"</p> <p>He blinked slowly, wondering if this was all some kind of hallucination.</p><p>\"We have to make this quick,\" she said. \"You're a hell of a guy. A hero. You don't deserve to die, but you're going to. Probably a few minutes from now. You've got more holes in you than Swiss cheese, and I'm not whistlin' Dixie.'</p><p>Was this information suppose to comfort him somehow?</p><p>\"I can see to it you don't die, Michael Gray. I can see to it you live. You won't be like you were before, but you'll be alive. You'll be strong. Healthy. But different. Very different. Do you understand?\"</p><p>He blinked, thinking the woman was insane, and shook his head slightly, side to side.</p><p>\"Hell, of course you don't understand. And I don't have time for the full rundown. Just suffice it to say I went out the say way you did. Cross fire, lots of bullets. And look at me. I'm okay. You can be the same. So lemme ask you this. Do you want to live?\"</p> <p>He managed to nod. Barely.</p><p>\"Okay then. It's gonna feel odd at first. You need to just lie still, just like you are now, no matter what you feel. Within a few minutes, the sun will be up, and you'll sleep ore soundly than you've ever slept in your life. You'll sleep all day. I'll be there when you wake up. Understand?\"</p><p>Again he nodded.</p><p>Then the woman pulled the curtains closed around his bed, bent over him and sank her teeth into his neck.</p><p>It happened just the way she'd said it would. He felt power zinging through him-as if he'd been struck by lightning. Every nerve ending tingled, and right on the heel of that sensation came another: excruciating pain. Every bullet hole in his body burned like fire. He hurt a thousand ties more than when he'd first been shot. His entire being screamed in agony, and blood rushed from the wounds, soaking the bed.</p><p>The woman, whatever, whoever, she had been, was gone. The doors burst open, doctors and nurses rushed into the room. Beyond them he saw Sally, biting her knuckles and weeping, and beyond her, the first rays of the morning sun peered through a distant window. Then the pain faded, and everything went black.</p><p>Vaguely he felt a hand on his wrist, and heard a doctor's voice saying, \"I'm sorry, Mrs. Gray. He's gone.\"</p><p>But he wasn't gone. Not really. When he woke again, hours later, in the hospital morgue, he felt more alive than he ever had. Like magic, the bullet holes had vanished. And the woman, Cuyler Jade, explained to him what he was now. What he had become, and what that meant, as she led him out the back doors of the hospital and into the night that was to be his home from then on.</p> <p>He really cared very little for all the things she told him. All he cared about was getting back to Sally. Taking away her pain. Showing her that he was still alive, that is was okay after all.</p><p>Cuyler told him that was a very bad idea, but he didn't listen. He didn't believe her when she said Sally wouldn't understand, that she wouldn't accept him now. He couldn't believe it. It was something he had to learn for himself.</p><p>And he did, hours later, when he finally convinced the woman to leave him alone, let him do what he had to do. He went home. Where else would he go, besides home?</p><p>Sally was lying in their bed, but she wasn't sleeping. She was wide-awake, weeping. She hadn't even locked the house that night, so he was able to walk inside, just as if he were coming home from a hard day's work. It felt good to come home. And while his mind was still reeling from early dying and from the day's revelations, from all the impossible things Cuyler Jade had told him and his myriad new sensations racing through his body, he couldn't digest any of it, of even begin to explore what it all might mean. Not until he talked to Sally.</p><p>God, he missed her.</p><p>He slipped into the bedroom. She sat up in bed, with a little shriek of alarm, and he said, \"It's okay, honey. It's me. I'm here. I'm all right.\" He found the light switch, turned it on so she could see for herself.</p><p>Her eyes widened as they skimmed down his body, and it was only then that he stopped to think abut what he must look like, still dressed in the bullet-riddled uniform that was stiff with dried blood. \"Look it's okay. I didn't really die. I'm all right.\"</p><p>She slid up in the bed, pressing her back to the headboard. He thought she would have backed right through the wall if she could. \"You're dead,\" she said. \"I said with you for hours. I held your hand while it went cold as ice. You're dead.\"</p><p>\"No. No, there was this nurse-not a nurse, really. She said I could live. And she did something and-I'm not the same anymore, she says. But I'm still me. I'm still Michael, still your husband.\"</p><p>\"You get away. Get away!\"</p><p>He shook his head slowly. \"Honey, it's okay. Look the bullets holes are all gone.\" He lifted his shirt to show her.</p><p>\"Get out!\"</p><p>\"But-\"</p><p>\"My Michael died I don't know what you are-a walking corpse. A ghost.\"</p><p>\"A vampire,\" he said, an then wished he could take it back when he saw the sheer horror on her face. \"It's not like in the books, honey. It's not. It's nothing like that.\"</p><p>\"My husband is dead,\" she said. But her voice and eyes looked more dead than anything he could ever imagine being. \"Now I want you to leave.\" In a burst of motion she rolled to the side and yanked something from the nightstand. His gun. His revolver. She pointed it at him \"Go. Get out-now-and don't even come back!\"</p><p>He held up his hands palms toward her. Cuyler had told him bullets would hurt like hell, pain, she said, was magnified in his kind, just like every other sense. But bullets wouldn't kill him-unless he bled to death from the wounds. Still, he didn't have any urge to try it out.</p><p>\"Honey, don't. Look, I'll go okay? I'll go if that's what you want. But you have to believe me, I'm all right. And it really is me. It's me.\"</p><p>She shook her head hard and thumbed back the hammer.</p><p>\"I'm going.\" He backed toward the door, his mind racing with ways to prove to her that he was who he said he was. And then it hit him that he knew things no one else would know about her. So he kept backing up slowly, but talking all the while, needing her to believe him and to accept him in a way he'd never needed anything, ever. \"Your maiden name is Litchfield. You wore a white satin nightgown with tiny pink rose at the shoulders on our wedding night. You collect seashells. You hate green vegetables, except for peas, but only baby peas, and...</p><p>Tears fell from her eyes. \"If you're not dead Michael, then you're damned. And I can't live with that, either.\"</p><p>\"No, no, honey, you have it all wrong. Just listen to me and I can-\"</p><p>She turned the gun quickly, pressed the barrel to her head and pulled the trigger. Just like that. She was gone.</p><p>Cuyler Jade appeared beside him even as he stood there, paralyzed with shock. \"Oh, God,\" she said. \"Oh, God, I didn't think she'd react that badly.'</p><p>Michael grabbed her arm. \"Bring her back!\" he shouted \"Do what you did for me. Bring her back.\"</p><p>The little vampire looked up at him, her huge eyes wet, and shook her head slowly. \"I can't Michael. Only certain people can become what we are. It's something to do with the blood. You'll know when you see one. You'll feel it right to your toes. She doesn't have it.\" She glanced at the beg again. \"And besides, she's already dead.\"</p><p>He closed his eyes, regret drowning him. \"It should have been me. If I'd stayed dead, she would still be alive. This is some kind of punishment. I cheated death, so it took her instead.</p><p>Cuyler shook her head slowly. \"You're missing an awful lot, for a cop. Why do you think she had that loaded gun in here in the first place, Michael?\"</p><p>Frowning, he looked more closely at the bedside stand. He saw the glass of wine, the photo of him in his uniform-an the sheet of paper with her handwriting on it. Trembling, he moved closer, until he could see what she had written there \"Don't mourn me, I've gone to join Michael.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Present Day, Bangor, Maine</p><p>He satin the darkest corner of the smallish city's most popular \"vampire bar,\" a place called The Crypt, and watched the mortals play at being gods. They amused him. Young people most of them. Twenty-somethings who had barely lived long enough to taste life, much less immortality. The women wore skintight black velvet gowns or scarlet-red sequined ones. The men wore leather or tailed tuxes and starched white cravats with cheap fake jewels glittering from their centers. They all wore cloaks of one kind or another: satin, velvet, lined in scarlet or white fur. Some had the stand-up collar of Dracula in a style that had never existed outside Hollywood. Some were hooded. Many of the patrons wore fake fangs. A few who were, he thought, a bit too fixated and perhaps in need of mental help had actually had their own incisors fled to points. They listened to hard-driving bands whose lyrics focused on body counts, and they drank made-up mixed drinks from the creative menu Type-O-Transfusion and Plasma Punch. White Cell Watusi and Platelet Power. Everyone one who drank here knew the code-the real drink behind the morbid name. A screwdriver, for example, was known here as a \"Cranial Drill.\" All of them contained alcohol, which was perfectly legal now. Most of them also came with brilliant red coloring added for effect, and stir sticks that looked like miniature wooden stakes.</p><p>Michael knew the code. But he didn't drink here. Or hadn't. Yet.</p><p>He enjoyed watching them play, though. It was interesting to see what the pop culture world of the twenty-first century really thought of his kind.</p> <p>They were way off the mark of course Vampires didn't often wear black lipstick, and he'd only met one who still insisted on the cloak. As for the multiple piercing and tattoos, those would be less than healthy for vampires, given their tendency toward bleeding out.</p><p>Of course, the costumed customers were not the reason he came here night after night. She was.</p><p>Mary McLean stood behind the bar, hustling drinks and handling drunks with a grace and good humor that belied her situation. She wore snug jeans and a shimmering jade blouse of brushed satin beneath an apron as pristine as any cravat in the place. Her hair was pulled back in a long sable ponytail that moved whenever she did and fascinated him, too. In fact, he was expending a great deal of effort trying not to be fascinated by her, draw to her. He was here to do a job.</p><p>She glanced up in his direction though there were too many bodies, too much smoke and too little light for her to have seen her there. She felt him, though. She felt his eyes on her, maybe his presence, as well. That probably wasn't a good thing. In fact, he knew it to be a bad thing. She shouldn't be that aware of him. Mortals rarely were, even her kind.</p><p>It had occurred to him that there were probably other ways he could go about watching her than to sit here, inside the vampire bar, where the thrumming pulse of healthy heartbeats vied with the pounding bass of the music for his attention. It was risky to do if this way, and yet he couldn't resist. He wanted her to see him, to notice him to talk to him.</p> <p>Stupid.</p><p>She was one of The Chosen. The rare belladonna antigen danced in her blood, and that meant that they were related, the two of them, in some distant and abstract way. Only the children of belladonna could become vampires. And every vampire had been one of the as a mortal. Cuyler jade had taught him all that, long ago. She'd been a friend, one of few.</p><p>But that was different from anything she had spoken of, and from anything he'd felt before. Mary McLean's pull on his senses was powerful and keen. He'd felt the tug of The Chosen before. But never like this.</p><p>They tended to die young, her kind. But she wasn't yet weakening. She was strong, healthy, vibrant, alive.</p><p>For now.</p><p>She was going to be murdered soon. That's why he was here.</p> <p>She looked up again as she poured whiskey into a blood-red shot glass ,her eyes arrow, probing the shadows where he sat. He forced his gaze away, looking instead at the people who filled the space between them. Sweat-coated mortals, dressed-they thought-as vampires, gyrated in a dance that was little more than a mimicry of the sex act, while the speakers blasted the same refrain over and over again.</p><p>\"Let the bodies hit the floor./Let the bodies hit the floor./Let the bodies hit the floor.\"</p><p>A blood-red shot glass landed on the far side of the table with a tap, then slid easily across to stop just in front of him. He lifted his head slowly, letting his gaze take its time climbing her body, from her hips, level with the table, to her waist, over her chest, tracing the shapes of her breasts, ad moving very, very slowly over her throat. Finally he examined her face: chin, jaw, cheeks-God, she was surely sculpted by the hand of a master-and then he met her eyes. Jade green, like the silk blouse, and just as shimmery.</p><p>Her eyes did not flinch from his steady, probing stare. And he supposed one of them out to break the silence soon. So he said, 'I didn't order anything.\"</p><p>\"And she said, \"It's on the house.\"</p><p>Pursing his lips, giving a nod, he wrapped his hands around the tiny shot glass. \"I didn't order anything.\"</p><p>\"No need. Do you care if I sit down?\" As she spoke, she was untying the white apron's strings, pulling it off over her head.</p><p>He thought about saying yes, but he couldn't resist the opportunity to spend a little time with her. Reminding himself that the bond was only that of the blood they shared, even if it was somehow magnified with this one, he nodded. She pulled out the chair opposite his and sat down.</p> <p>\"I'm Mary,\" she said.</p><p>\"I know.\"</p><p>He lifted his brows, unsure what she meant.</p><p>\"I say, 'I'm Mary.' And then you say, 'Nice you meet you, Mary. I'm...'\"</p><p>She held a hand toward him, palm up.</p><p>\"Michael.\"</p><p>She nodded. \"Well, Michael, you've been coming in here every single night for the past two weeks. You don't eat. You don't drink. You don't dance. Mostly you just sit here in the corner and watch me. And I have to tell you, it's starting to make me uncomfortable.\"</p><p>He blinked at her, a little bit surprised. \"You're very direct aren't you?\"</p><p>\"I don't believe in playing games. So why don't you just tell me what it is you're doing here, and then we can move on.\"</p><p>\"Doing?\"</p><p>She nodded.</p><p>\"Mostly just sitting here in the corner watching you.\" She averted her eyes, and that made him curious enough to probe her mind, eavesdrop on her thoughts and feelings. What he found was fear. She was afraid of him. It hit him where he lived, and he instantly regretted his teasing reply. \"I would never hurt you, Mary.\"</p><p>She flinched a little when he said it. \"I never thought you would.\"</p><p>\"Yes, you did. What I'm having trouble figuring out is why.\" She couldn't know what he was. It couldn't be that. If she knew, then he would have expected her to be afraid of him. And repulsed and horrified and driven to-</p><p>\"Look, it doesn't matter,\" she said, breaking into this thoughts. \"It's none of your business. But you need to stop all right? Stop coming here, stop watching me.\"</p><p>\"I'm afraid I can't do that.\"</p><p>\"Then you should probably be expected a visit from the police.\" She pulled out her order pad and pen. \"I'll need a last name, address and number.\"</p><p>He smiled a little at the irony of it. \"You've going to report me to the police?\"</p><p>She nodded, never lifting her eyes from the pad, holding the pen poised above it as if she fully expected him to start supplying personal information.</p><p>\"Just because I come to this bar and happens to look your way every one in a while?\"</p><p>Another nod.</p><p>\"Why would the police think that was anything close to suspicious behavior? You're a beautiful woman, Mary. I can't be the only man who enjoys looking at you.\"</p><p>She met his eyes, held them, and her cheeks grew pink with the rush of blood. There was something in her eyes, the spark and heat of attraction. For a moment he read her thoughts and knew she felt the pull as strong as he did, but she squelched it with an inflexible will, told herself it was not only stupid but dangerous.</p><p>\"If it were just that-you coming here, watching me-they probably wouldn't find anything suspicious about it at all. But combined with the phone calls, the person who'd been following me and the break-in at my apartment-\"</p><p>He held up a hand to silence her \"Wait. You've had a break-in?\" Why hadn't he known about this?</p><p>\"That's very good, Michael. I don't suppose you know anything about it, though. Or the phone calls, either?\"</p><p>\"I haven't phoned you. And I've never broken into you apartment.\"</p><p>She swallowed hard, laid down the pad and pen but kept her eyes on the table. He sensed conflict in her. Part of her wanted to believe him almost desperately. Part of her knew, instinctively, that he was telling the truth. And a third part was afraid to give in to the other two. Deathly afraid. And no wonder he hadn't realized that she was aware she was being hunted. He should have. The others had all been aware of it.</p><p>\"So I'm supposed to believe it's just a coincidence?\" she said. \"That I've picked up some kind of obsessed lunatic stalker and a harmless bar-bound admirer at exactly the same time?\"</p><p>He reached across the table and, using just his forefinger, lifted her chin until her eyes met his. \"I suppose that would be a lot to swallow. No. I'm not going to tell you it's a coincidence. It's not. The two things are related. But not in the way you think. I'm not your stalker, Mary. I came here to protect you from him.\"</p><p>She blinked rapidly. \"If you were my stalker,\" she said softly, \"that would be the best lie you could possibly use to get closer to me.\"</p><p>\"It's not a lie.\"</p><p>\"How can know that?\"</p><p>\"Give me your hand.\"</p><p>\"What?\"</p><p>He didn't wait, just reaching for her hand and closed his around it. She gasped a little, probably at the chill of his flesh-or maybe it was at the power of the contact. Touching her made his body come alive in ways it hadn't done in years. And maybe she felt that, too. She didn't pull her hand free. He didn't need to touch her to read her thoughts. It would enhance the ability, yes. But he wanted to touch her. He was burning to touch her.</p><p>A flash swept through his mind as he opened it more fully to hers, her thoughts. He closed his eyes, the better to see it. The telephone ringing. Her picking it up wary. Then smiling. Yes.</p><p>\"Your Aunt Cherry... Cheryl... Sherry. Sherry. She phoned you yesterday morning, early. She said her dog had been ill.\"</p><p>She jerked her hand away. \"Okay, I got it. You're some kind of psychic.\"</p><p>He nodded. \"Some kind, yes.\"</p><p>\"And you came here to protect me from a stalker.\"</p><p>He licked his lips. She didn't believe him in the least. She thought he was a fraud, a con man. \"He's a little more than stalker, actually. He's... he's a killer, Mary.\"</p><p>She blinked, her face going a shade lighter.</p><p>\"He strikes on the full moon. I don't know why. I can't seem to... to read him. But I know you're the next victim. And I'm here to protect you.\"</p><p>She stared at him for a long moment. \"Are you a cop?\"</p><p>\"I was once. Not anymore.\"</p><p>\"They why are you trying so hard to scare the hell out of me?\"</p><p>He paused, studying her, feeling her thoughts. \"You were already afraid-but of the wrong thing. I'm not the threat to you, Mary. He is. Fear is healthy. It an be a powerful weapon. Misplaced, though, it can get you killed.\"</p><p>\"And trust is a beautiful thing,\" she countered. \"But misplaced, it'll get you killed even faster.\"</p><p>It was a well-aimed shot, and it hit home. He wanted her to trust him. But he was pushing too quickly. Then again, there wasn't much time.</p><p>\"So you had this vision,\" she said. \"And you showed up here to watch over me?\"</p><p>He nodded.</p><p>\"Right.\"</p><p>\"It's true.\"</p><p>She nodded at the whiskey. \"You going to drink that.\"</p><p>\"Probably not.\"</p><p>With a sweep of her hand she took the glass and downed its contents. Then she set it down hard on the table. \"I'm off duty in a half hour. I want you long gone before then. I'm going to have my cell phone and my boss's German shepherd is with me, and if I see you lurking around anywhere, I'll turn the dog on you and dial 911 while you try to keep from becoming his bedtime snack. Understand?\"</p><p>He studied her for a long moment. \"How can I be sure you make it home safely if I don't watch over you?\"</p><p>She suppressed a shiver-he felt it-then she glanced toward the window. \"You should know, being the psychic. The moon's not full yet, he said, and she pushed her chair away from the table. \"Even if you're telling the truth, I should be fine for tonight.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mary sighed in mild relief when the an who called himself Michael left the bar. She'd noticed him the first time he'd come in. Of course she'd noticed him. A woman would have to be dead not to notice him. A woman would have to be dead not to notice him. He was pale, but God, he was beautiful. The most strikingly beautiful man she had ever seen. His hair was long, a deep shade of brown. He didn't tie it back or hack it off. He left it hanging just as it grew, no apologies. He was lean but powerful. That sense of raw energy was more a palpable thing than a visible one. He didn't bulge with muscle. There was just this quiet strength about him that left no doubt about its presence.</p><p>But his eyes struck her most of all. The first time he had lifted his hooded gaze to look her way, she'd felt these eyes on her like brands, and when she'd looked back, shed felt herself falling into them. They were black, his eyes, and hypnotic. They made her heart pound harder against her chest, and her breath came quick shallow. They made her stomach knot and her hands tremble.</p><p>It was only when he'd broken the connection by looking away quickly that she'd realized he didn't want to make contact. He wasn't trying to pick her up. Throughout that night and the nights that followed, she had felt that penetrating gaze on her again and again, but each time she tried to return it, he looked away.</p><p>She was suffering the throes of an intense physical attraction to a complete stranger. She was not the kind of woman who lusted after men she'd never met. She didn't go to strip clubs or buy hunks calendars or pant for action heroes. But if this guy were on a calendar, she thought, she would buy a copy for every wall in her apartment.</p> <p>She'd fantasized about him at night, when she was alone in her room. Fantasies so bold and so unlike her that they startled her. And yet she relished every forbidden image that raced through her mind and her dreams.</p><p>It wasn't until the policeman working on her break-in complaint has asked her if there were anyone new in her life, anyone strange hanging around, perhaps paying undue attention to her, that she'd even begun to suspect her dark stranger at the bar might be the one. The cop thought that the break-in, combined with her feeling of being followed home three nights in a row and the barrage of odd phone calls, added up to a possible stalker. And that frightened her.</p><p>Not as much as Michael had.</p><p>The phone calls had begun two weeks ago. At first the caller would just phone once or twice after the bar closed, wake her from a sound sleep and hang up. Then he stated with the heavy breathing. And now he'd moved up to whispered threats. One-liners. \"I'm watching you,\" he'd tell her, or \"I'm coming for you soon.\"</p><p>She'd gotten her number changed-the phone company had taken forever, but that had been done yesterday. In the meantime, someone had broken into her apartment, though nothing had been taken. Nothing she noticed, anyway.</p> <p>So now she had all new locks on the doors and windows, and the police had promised to keep any eye on the place, whatever that meant.</p><p>When she hustled the last customer out of the bar and locked the door, chill rushed up her spine. Michael said the ma was more than a stalker-that he was a killer. And that she was next on his list. She swallowed hard, quickly rinsed the remaining glasses and wiped down the bar.</p><p>Tommy came in from the kitchen, drying his hands on a towel. \"Good night for you, Mare?\" he asked. He slung the towel over his shoulder and moved from table to table, turning the chair upside down and setting them on top.</p><p>She glanced at her tip jar. A one-hundred-dollar bill lay on top of the mounds of one and fives and change. \"Uh... yeah. Another good day.\" She wasn't surprised. There had been one in her jar every night for a while now. Ever since the stranger named Michael started coming around.</p><p>Customers did not put money into the tip jar. They left it on their tables or handed it to her themselves. She kept the jar under the mahogany bar, on a shelf, and added her tips to it herself throughout the night. She'd never seen Michael leave his table or come anywhere near it. Not once. And yet, somehow she knew he was responsible for it.</p><p>She would return the money to him if she could afford to. But so far his tips had enabled her to fend off both the car-repo company and the landlord. She could not afford to be proud.</p> <p>She put a cap on the jar and dropped it into her purse. \"Walk me to my car?\" she asked.</p><p>Tommy grinned at her. \"You bet.\" He put up the last of the chairs, tossed his towel onto the bar and then moved behind it, toward the small closet hidden on one side of the mirrored wall. \"You have a jacket in here?\"</p><p>\"The blue one,\" she told him.</p><p>He got it for her, helping her into it before putting on his own, which was denim. \"Ready?\"</p><p>\"Ready.\"</p><p>Tommy opened the door. Mary turned out the lights and stepped outside, into a light rain and a pitch-black night, pulling the door closed behind her and double-checking the lock. Sealed. Good.</p><p>The parking lot in front was deserted. Only one car was in it, and that was her own. She looked up and down the street, craned her neck to see through the warm rain, around to the back of the building. There were other businesses on either side of the bar, of course, but they were all closed up tight at this time of night. There was no traffic whatsoever, and the streetlights did little to dispel the gloom.</p><p>\"Where's your car, Tommy?\"</p> <p>\"Left the headlights on last night,\" he said with a sheepish shrug. \"Battery was dead this morning. But it's okay. I only live five blocks away.\"</p><p>\"You're walking?\"</p><p>He nodded, and flipped up his collar.</p><p>Swallowing hard, her keys in her hand by now, she argued with herself inside her head. Tommy had always had a crushed on her. Could he be the one making the calls, harassing her? It was far-fetched, even more far-fetched if this stalker really was something far more dangerous. Tommy wouldn't hurt a fly.</p><p>Then again, what if she left him walk home alone and something happened to him? Could she live with herself then?</p><p>\"Excuse me,\" said a voice from the darkness.</p><p>She knew that voice. It sent shivers of recognition dancing down her spine. Michael, her pale, wild-haired, potent-eyed admirer.</p><p>She turned and met his eyes, fell into them, felt her blood heat and her belly tighten. God, what was it about him that stirred her up this way? She licked her kip and saw his gaze shoot to them and stay there. \"I... suppose you need a ride, too,\" she said. Part of her was hoping he would-and arguing with the part of her that hoped he wouldn't.</p><p>He nodded. \"Only...five blocks.\"</p><p>Five blocks. He only wanted to ride as far as Tommy was going. Well, Tommy certainly couldn't try and anything with Michael along. And Michael wouldn't murder her in front of Tommy, either. And that was exactly what the stranger intended, wasn't it? To make her fell perfectly safe? To let her know she wasn't in any danger?</p><p>Stupid. He was not some guardian come to watch over her. He wasn't.</p><p>And yet she let him. \"Fine. Get in. Both of you.\" Tommy looked put out, but he moved toward the car. Michael beat him to the front door opened it and slid in without asking. When Tommy got into the back seat, he almost appearing to be sulking.</p><p>\"Tommy,\" Mary said as she shoved the keys into the switch and started the car, \"this is Michael. Michael, Tommy.\"</p><p>\"Hey,\" Tommy said</p><p>\"Likewise,\" Michael replied.</p><p>Mary rolled her eyes and backed out of the parking lot. She didn't fasten her seat belt. Some insane primal fear told her she should be ready to throw herself out of the car and run for her life at a moment's notice. A seat belt would slow her down.</p><p>She drove. Her cell phone bleated. She picked it up without a thought, ignoring all the public service announcements suggesting it was a bad idea. She simply hadn't gotten around to buying a Madonna-mike for her head.</p><p>\"Hello?\"</p><p>\"Are you afraid, Mary? You should be.\" The voice was the course whisper of her nightmares, and it was followed by a sharp decisive click.</p><p>She jerked the phone away from her head and glanced at the panel, but no number showed on the screen to tell her where the call had come from. She set the phone down.</p><p>Michael was looking at her. Those probing eyes staring straight through her skin and reading every thought-she could feel it. He knew exactly what that call had been. Maybe even heard it through her ears somehow. No. Impossible.</p><p>\"Mary? Anything wrong?\" Tommy asked from the back seat.</p><p>She shook her head. \"Wrong number,\" she lied.</p><p>Oh well. At least the culprit was neither of the two men sitting with her alone, in the dark, of her car.</p><p>And then it hit her, and the bottom seemed to fall out of her belly. Because if Michael wasn't the stalker, then he really had no reason she could think of to lie to her. Did he?</p><p>Sure he did, her practical mind argued. Plenty of reasons. Maybe he was trying to make his name as a psychic by meddling in criminal cases. He probably had a connection at the police department, who had put him on to her. Or maybe he just wanted to get into her pants. That would be reason enough to scare her half to death, right?</p><p>She shot him a sideways glance. His eyes were right there waiting, and he shook his head slowly left then right. \"Wrong on both counts,\" he whispered.</p><p>She felt her eyes widen. How in the hell...?</p><p>\"What's that?\" Tommy asked, leaning forward. \"I didn't hear you.\"</p><p>\"Nothing We're here.\" Mary hit the brake, brought the car to a jerky stop without even pulling over the curb in front of Tommy's building</p><p>\"Yeah. Thanks for the ride, Mary.\" He opened his door, then frowned at Michael's back. \"You coming?\"</p><p>\"Look at that, it's raining even harder now,\" Michael said nodding at the tiny beads glistening on the windshield. 'I only live a block further up. Do you mind?\"</p><p>Hell, he wasn't the stalker. But that didn't mean he wasn't dangerous.</p><p>Tommy glanced at her as he got out. \"You okay with that, Mare?\"</p><p>\"You should be,\" Michael said. \"That stun gun tucked under the side of your seat is plenty to keep me in line.\"</p><p>She jerked her hand back to the steering wheel. She'd been reaching below, just to make sure she could grab the little weapon quickly should she need it. How the hell did he know?</p><p>\"Mare?\"</p><p>\"Fine, Tommy. Go ahead. See you tomorrow night.\"</p><p>\"Yeah, see you.\" He closed the door and hurried away.</p><p>She glanced toward her passenger. \"So do you really live a block away?\"</p><p>He shook his head from side to side \"I'm going home with you.\"</p><p>She closed her eyes. \"Oh, for God's sake-\"</p><p>\"No, Mary. For your sake.\"</p><p>She sighed, gripping the steering wheel until her knuckles were white. \"So what is it, Michael? An I supposed to think you're some kind of knight in shining armor? Maybe leap into bed with you to thank you for rescuing me from the evil phone call guy?\"</p><p>He lifted his eyebrows. \"He's more than an 'evil phone call guy,' Mary. He's a killer. He's struck before-I can prove it to you, if you'll give me an hour. I brought evidence.\" He patted the shoulder bag that hung over his worn gray trench coat. \"And he'll strike against unless we stop him. But he's not going to get you.\"</p><p>She thought he was finished. He sounded reasonable, convincing and fairly sane. He also sounded like a man who only wanted to watch over and protect her. Which meant he was too good to be true.</p><p>Then he sent her a knowing smile and added, \"how you choose to think me, on the other hand is entirely up to you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Michael was not the person who'd been harassing her.</p><p>She told herself that over and over again. She refused to think 'He's not the killer\" because she didn't want to believe there was a killer. Just a nutcase with an obsession.</p><p>Michael was not easily dissuaded, and she found herself absurdly, perhaps stupidly, glad of that. She wanted to see just what \"evidence\" he was carrying in tat flat brown leather case.</p><p>She drove though the city with the wipers beating out a steady pulse and the rain cascading over the windshield, until she came to the turnoff for her apartment building. It had a parking lot in the back. No nice dry garage. No attendant, But it was well it, had a gate with a lock, and only the tenants had keys. She pulled up to the gate, stopped the car and looked into the back seat for her umbrella.</p> <p>\"I'll get it,\" Michael said. She hated to admit she'd been hoping he would offer. But she got the feeling he already knew that. She handed him the key. He was out of the car before she could offer him the umbrella and back almost as quickly. Frowning at him, she said, \"What you decide to take the umbrella after all?\"</p><p>\"It's done.\"</p><p>She looked from him to the gate. In between passes of the wiper blades, she saw the gate standing wide-open, waiting. \"That was fast,\" She frowned harder. \"You barely got wet.\"</p><p>\"I... hurried.\"</p><p>\"Right.\" She pulled the car through the gate and noticed that when Michael got out to close it again, he took a bit longer. When he got back into the car, raindrops spatters darkened his coat and glistened in his long hair. Her hand tensed, and she caught herself in the nick of time. She'd been about to reach up and brush the raindrops from her hair-an act that would be too intimate and familiar. It didn't feel too intimate, though. It felt as natural as making love to him would feel.</p> <p>Oh, God.</p><p>He handed her the keys. His hand caressed hers as she took them, and she didn't think it was an accident.</p><p>\"Thanks.\"</p><p>She drove across the lot into her parking slot, right in front of her ground-floor apartment. It had a tiny concrete patio in front of the door, no more than five by five. She had a huge potted palm sitting on it, a begonia in a hanging basket, a lawn chair, a set of wind chimes and a welcome mat it was sheltered from the rain by the overhanging balcony of the apartment above which was exactly the same size. And it sported an outdoor light.</p><p>\"You leave these things out? And no one's stolen them?\"</p><p>She shrugged. \"Guess no one's interested in lifting a plant or three-dollar lawn chair.\" She unlocked the door reached inside to flip on the light and then stood very still, staring in at the mess that had been her neat-as-a-pin apartment. The sofa cushions were on the floor; books from the tiny bookshelves had been strewn about; the lamp was lying on its side. \"Oh, hell, not again.\"</p> <p>She started to get inside, but Michael's hand on her shoulder stopped her. \"Don't. He could still be around.\"</p><p>\"If he is, he's going to be one sorry freaking stalker.\" She reached into the umbrella stand just inside the door, pulled out her trusty baseball bat and stomped inside. \"Come on out, you bastard. I've had about all of this I'm going to take.\"</p><p>She was halfway to the kitchenette when she heard Michael say, \"It's all right. He's gone.\" Did he sound slightly amused She glanced back at him. He was taking off his coat now, laying his brown case on the coffee table.</p><p>\"How do you know?\" she asked, watching him.</p><p>He tapped his head with his forefinger.</p><p>\"Oh, right. You're a mind reader.\" She rolled her eyes. \"If you don't mind, I'd just as soon back that up with a mundane look-see.\"</p><p>He smiled at her. She almost dropped the bat. His smile was potent, a killer smile, and it made her go weak in the knees. Damn him. She turned away moving across the living room to the kitchenette, which was only separated by a breakfast bar, but it was enough for someone to crouch behind.</p><p>No one was there. But the cupboard doors were all open, every last one of them, and there were dishes and food out that hadn't been out before. She stepped back into the living room and looked at the only door off it, which led to her bedroom. Her hand tightened on the bat.</p> <p>\"Let me,\" Michael offered.</p><p>She nodded. There was no sense pretending to be brave when she was scared half to death. She held the bat toward him. He glanced at it and smiled again, but he didn't take it; just turned the knob and opened her bedroom door, stepped inside, looked around.</p><p>Some hero he was; he didn't even turn on the light. She crept in behind him, bat at the ready, flipped on the light switch, scanned the room.</p><p>She didn't see anyone. But her top dresser drawer was open, and her lacy delicates had been scattered around the room. He noticed them. She saw him notice them. His gaze lingered on the negligee she'd bought at a lingerie party just to be nice. It was sheer, sheer black, and tiny, and it lay across the bed. As if she'd planned to put it on.</p><p>\"That wasn't there before.\" She said it almost defensively.</p><p>\"I'm glad to know that. I'd have thought you were expecting someone.\"</p><p>\"I wasn't. And I wouldn't wear that for anyone, anyway. I mean, for anyone I'm currently seeing, because I'm not. Seeing anyone, I mean...\"</p><p>\"I know.\" He strode to the closet, opened the door, poked around inside. Then he opened the remaining door, which led to the bathroom, where makeup and brushes were scattered all over the sink and inside it. He even moved the curtain and looked inside the shower.</p><p>\"No one where,\" he said.</p><p>He hadn't checked under the bed. She bit her lip and wondered how silly she would look if she asked him to. He came back into the bedroom, walked straight to the bed, lifted up the covers and bent low to peer underneath. Then he rose again and smoothed the covers back in place. \"Have I missed anything?\"</p><p>\"No.\"</p><p>\"Good.\" He went to the dresser, bent own and began picking up the things on the floor, pacing them back in the drawer. His big hands on her bras and panties made her stomach clench. Her mind whispered things she wouldn't want him overhearing, and her breath came shorter and faster than before.</p><p>She went to him and took the items. \"Really, um, I'll get it.\"</p><p>\"I want to help.\"</p><p>\"Then... go start on the other rooms.\" She'd thought about insisting he let her do it all herself, but she know, somehow, he wouldn't see that as a viable option. But she didn't want him handling her underwear, because she couldn't help but wish she was in them at the time, and that was a ridiculous thing or her to think about a man she had just met.</p><p>No matter what he looked like. Or how intense his eyes.</p><p>It felt as if she knew him intimately-as if she'd known him forever.</p><p>He held her gaze for a long time, until she squirmed. Then, finally, he broke eye contact as if it were an effort, turned and left her alone in the bedroom.</p><p>Michael had to force himself to move slowly. He'd made a big mistake when he'd opened the gate. He'd instinctively darted through the rain, moving at preternatural speeds no human could achieve. He was only glad it had been too dark for her to have observed his movements. She wouldn't have seen more than a streak, a blur of motion.</p><p>He put cushions back on the sofa, righted the lamp, began picking up books and glancing at the titles as he replace them on the shelf. She read the classics. Shakespeare, the Brontes, T.S. Eliot. That was in keeping with what he had observed about her. He knew she was intelligent. He believed her to be shy and uncomfortable around people. She barely talked to the customers at the bar where she worked but in a place that dark and that noisy, she didn't need to. When any of them paid her undue attention she would start fidgeting with the cross she wore, sliding it back and forth on its chain. A nervous habit, as if the clientele really were vampires and cross really would ward them off.</p><p>God, how frightened would she he if she knew what he really was?</p><p>She had surprised him, he thought, glancing through the open bedroom door to see that she had finished in there and was moving into the bathroom. When she'd grabbed the bat and challenged the intruder, he'd been surprised and pleased. He liked her even better for that. She'd been petrified, but ready to fight to protect her space. Fear wouldn't make her back down. It was a remarkable quality in a woman who kept to herself the way she did. And he wondered if he'd pegged her wrong. Maybe it wasn't that she was shy. Maybe she simply didn't like people.</p><p>She seemed to like him, though-a little too well, maybe, even though she thought it unwise.</p><p>He moved into the kitchenette and stacked the dishes in the dishwasher, knowing she wouldn't want to eat from anything the intruder had touched. He wasn't as certain about the food. Mary was not wealthy. Working a double shift at the bar to pay for rent and tuition, barely ever sleeping. She was majoring in English, hoped to teach one day. She baby-sat for some for the neighbors to earn extra cash, and when the bar's owner had been looking for someone to come in and clean the place on the weekends, she'd taken that job, as well. Her degree was slow in coming-she was twenty-seven now, and getting closer to the goal. She took only what classes she could afford, one or two at a time, fitting them around her work schedule. She was between spring and summer session right now.</p><p>He knew a lot about her. He supposed he should have expected the courage, given the determination and rive she showed in pursuing her education. He hadn't. He'd found it both surprising and endearing. And like everything else about her, arousing as hell.</p><p>She came out of the bedroom as he stood with a box of macaroni and cheese mix in his hand. He held it up, brows raised in question. \"What about the food?\"</p><p>She shrugged. \"Can't you just mutter over it? Work your mojo? Find out if he messed with it or something?\"</p><p>\"I read people. Not food.\"</p><p>She crossed the room, joining him in the kitchen, and he heard her thinking how much smaller it seemed with him in it, and that she didn't mind it, and then she thought about his hair again. She' been thinking about his hair a lot. It probably wasn't altogether wise for him to keep reading her thoughts, but he didn't want to stop. She pictured herself running her hands through his hair, and then she pictured it spread across her chest as he kissed her breasts. He almost groaned aloud. Then she forced her focus to the food on the counter.</p><p>\"Lets throw away whatever's open, keep whatever's sealed,\" she said.</p><p>\"Let's throw it all away just to be safe.\"</p><p>\"I can't afford-\"</p><p>\"I can.\"</p><p>She lowered her head, wrestling with her values, telling herself she couldn't accept money from a man she didn't know. That it was wrong an somehow sleazy.</p><p>\"Consider it payment for my room and board tonight\"</p><p>Her head came up fast. \"You really can't stay here.\"</p><p>\"Sure I can.\"</p><p>\"You won't fit on my sofa. You're too tall.\"</p><p>\"Not an issue.\" He scooped the food into the wastebasket, then closed the cupboards. \"Let's sit, so I can get rid of the doubts in your mind about me.\"</p><p>She shot him a look. \"Reading my mind again, right?\"</p><p>He felt a bit guilty. \"I'm sorry. I can't seem to help myself. I'll stop if you tell me to.\"</p><p>She smiled at him. God, she really was beautiful creature. No bigger than a breeze, with those big jade-green eyes, and cheekbones sculpted by a god. \"You don't need to apologize, Michael. I'm a total skeptic about this, in case you hadn't picked up on that already. Despite the little demonstrations you've been tossing out.\"</p><p>\"I know you don't believe me. That's the first thing we need to get out of the way. Come. Sit\" He took her arm, led her into the living room and set her on the small, floral-patterned sofa. \"Now, tell me to do something, but don't say it aloud. Just think it in your mind.\"</p><p>Her lips curved into a smile as the many voices of her own mind began to argue.</p><p>This could be fun.</p><p>Don't be an idiot. Tell him to get me a glass of water.</p><p>No, tell him to kiss me.</p><p>Honestly it's not going to matter what I tell him. I could tell him to carry me to the bed and undress me with his teeth, but he isn't going to hear any of it.</p><p>He held up a hand. \"That's enough.\"</p><p>\"But I didn't-\"</p><p>He met her eyes. \"Yeah, you did.\" Then he went to the kitchen, got a glass from the cupboard, filled it with water from the bottle in the fridge. He brought it to her but he didn't put it in her hand. He set it down on the maple coffee table instead. Putting his hands on her shoulders, he drew her to her feet, slid his arms around her waist and bent his head until his lips touched hers.</p><p>She shivered. She was mortified, realizing he had heard every single thought, yet her entire body quivered in anticipation and need. He kissed her mouth. When she wished he would pull her closer, he did, and when she wished he would use his tongue, he did that, too. She was sweet and shy, embarrassed and eager, nervous and frightened, but mostly she was hungry-for him.</p><p>He was beginning to think this little game had been a bad idea, because this had not been his intent. He hadn't come here to make love to her but that was exactly what he was going to do. And whether or not it was a good idea really didn't matter very much at this point.</p><p>He scooped her into his arms and carried her to the bedroom, still exploring her mouth with his. Then he lowered her to the bed and bent over her, dragging his mouth away from hers, over her neck, to the top button of the jade colored silk blouse. He kissed her flesh there, then freed the top button of her blouse with his teeth. Kissed her again and undid another, then kissed her again there.</p><p>\"No.\" She put her hands firmly on his shoulders and gave him a push.</p><p>Michael froze, fought down his rising passion and slowly straightened away from her. \"It's what you wanted,\" he told her.</p><p>\"It crossed my mind. That's not the same thing.\"</p><p>He nodded, conceding the point. \"You're right. A passing thought is not the same thing as real wanting. But it felt like real wanting when you thought it.\"</p><p>She stared up at him. She was still lying on the bed, was her blouse unbuttoned and her desire shining in her eyes. \"It was,\" she whispered. \"I'm trying to balance it with common sense. This isn't me, Michael. I don't act this way.\"</p><p>\"I never ever once thought you did.\"</p><p>She nodded. \"It's too soon.\"</p><p>Leaning over her, he gently buttoned her lose gripped her shoulders and helped her sit up.</p><p>\"For what it's worth, you've convinced me. I believe you now. And I'm going to take you up on that offer.\"</p><p>He lifted his brows. 'To undress you with my teeth?\" He knew that wasn't what she meant, but he couldn't resist.</p><p>\"To stop eavesdropping on my every thought.\"</p><p>\"I was afraid that was what you meant.\" He sighed, showing his disappointment. \"Al right. I knew better, I just-your thoughts were so flattering.\"</p><p>\"It's not fair. I can't read yours.\"</p><p>And it was a good thing, because a second ago he'd been thinking things that would either have driven her wild or scared the hell out of her. And he didn't want to scare her. \"Trust me,\" he said. \"You'd find mine flattering, too.\"</p><p>She smoothed her hair and got to her feet. \"So are you ready to show me what's in the briefcase of yours?\"</p><p>He nodded, took her hand, drew her back into the living room. Even though leaving bedroom was the last thing he wanted to do. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Four missing-person reports-photocopies, taken from various police departments-lay across her breakfast bar. There were names typed across the tops, and they all had three-by-five snapshots attached with paperclips: Samantha Carlson, Vivian Marie Patinski, Kathy Somerfield, Cynthia Stone.</p><p>Mary looked at the typed pages and tried to ignore the pretty, smiling faces of the women, the life in their eye. \"New Jersey, Vermont, Massachusetts, Connecticut-they all vanished from different states\"</p><p>\"All in the northeast,\" he said. \"As in Maine.\"</p><p>\"Okay. So he's a traveling stalker/\"</p> <p>\"Read the reports.\"</p><p>Swallowing heard, she tried to focus on the pages instead of on the intensity of Michael's gaze or the disturbing tingle generated by his nearness. And then she didn't have to, because he narrated for her, maybe too impatient to wait.</p><p>\"All four of them reported anonymous phone calls and feelings of being watched for a week or two prior to their disappearances. Each of them reported a break-in. Each of them vanished during the full moon.\"</p><p>A little shiver raced up her spine.</p><p>\"Did they find... any of them?\"</p> <p>He lowered his head. \"He dumps them in various places. Samantha's body was found by some fishermen in Crosswicks Creek. Vivian turned up in a city dump, underneath a mound of trash. Kathy ad Cynthia are still missing.\"</p><p>She pressed her lips together and looked again at the photos. Then she glanced at their birthdates. \"All under thirty.\"</p><p>\"That's not all they have in common, Mary.\"</p><p>She closed her eyes, not sure she wanted to know this, but certain that she had to.</p><p>\"They all share a very rare blood antigen, known as belladonna. You have it too.\"</p><p>She looked up at him fast. \"How do you know that?\"</p> <p>He held her gaze. \"The same way I know so many things about you. I feel you, Mary. Sometimes it's like I'm inside you.\"</p><p>She closed her eyes, suppressing a shiver. She had expected his so-called evidence would expose him as a fraud, or maybe a sincere but misguided do-gooder. Instead, he was convincing her. \"How were they...?\"</p><p>She didn't have to finish the question. \"It's not important how they died. Only that they were killed in the same manner.\"</p><p>\"The two that were found, at least.\"</p><p>\"All four,\" he said. \"But there are only autopsy reports on the two that were found.\"</p><p>Her gaze shifted to the brown leather case, which lay on the counter, its flap open. Then corner of a manila envelope was visible inside. Then Michael took the case, on the pretense of returning the police reports to it. He closed it and set it beside him. He really didn't want her to know how the women had died which told her it must have been horrible.</p><p>\"Did you try to warn them, too?\" she asked.</p><p>He shook his head slowly. \"I didn't know about them until after they were killed. And then not from a vision but from casual conversation among... some of my peers.\"</p> <p>\"Your psychic friends?\"</p><p>\"He tried to smile. \"Something like that. I heard about these four women, murdered, all of them bearing the antigen. I don't expect you to understand why, and I can't explain it to you, but among people like me, this was a topic that generated a lot of discussion and concern.\"</p><p>\"People like you...\"</p><p>\"And then I saw you-in a dream. I felt you. And I knew you'd be next.\"</p><p>\"How did you know where to find me?\"</p><p>He looked at the floor, gave his head a shake. \"It's difficult to explain. Besides, I'm afraid you already think I'm deluded.\"</p><p>\"So you have nothing to loose.\"</p><p>He drew a breath. \"Once I had seen your face, sensed your aura, even though it was only in a dream, I was able to home in and track you down.'</p><p>\"Kind of like a bloodhound on he gets the scent?\"</p><p>\"Something like that.\"</p><p>She licked her lips and wondered why she wasn't afraid of him. He could be the killer, for all she knew. But if he was, why was he trying to warn her? And how had he managed the trick of calling her on the cell phone while sitting beside her in the car?</p><p>Tricky. But not impossible. There were deices, recorders, timers. She'd seen her share of spy films.</p><p>And yet she wasn't afraid of him. He was odd. Different. She'd never met a man like him. But there was no sense of fear. Which might be exactly what he wanted. Want it or not, though, there was no way he could held responsible for the storm of desire raging inside her. No way. That was all her. He couldn't have planned that.</p><p>He was watching her now, studying her face. Then he nodded toward his coat, which hung on a rack just inside the apartment door. \"There's a gun in the left pocket of my trench coat. Extra bullets in the right. I brought them for you, to protect yourself.\"</p><p>She blinked. \"I don't... like guns.\"</p><p>\"I don't, either, but we're talking about your life here. Go on, take it. And while you're there, search the other pockets. Assure yourself that I'm not hiding any other weapons.\"</p><p>Pursing her lips, she slid off the stool and went to the coat, doing what he told her. The gun was a small black revolver. The bullets were in a red-and-white box. The other pockets were empty.</p><p>When she turned, he was standing beside her, though she hadn't heard him cross the room. He stood with arms out from his sides. \"Go on. I want you to be sure of me.\"</p><p>Swallowing hard, she set the gun and bullets down and put her hand on either side of his left arm, drawing them along it slowly, all the way to his wrist. She repeated the action on the other arm. He turned so she could run her palms over his back and shoulders, and she wished to God the shirt wasn't in her way. Then, as she prayed he hadn't heard that thought, he turned again. She ran her palms across his chest and belly.</p><p>Her heart was pounding so hard she thought he had to hear it. He was reacting, too; she knew he was. His eyes had closed, and his jaw was clenched tight. She moved her head to his sides, up and down them. Then she bent her knees, hunkered lowered, to rub a path along his outer thighs, to his calves. She felt him shiver when she worked her way back up the inside</p><p>Finally she straightened. \"No weapons. The words came out hoarse; she had to clear her throat.</p><p>\"No deadly ones, anyway.\"</p><p>She looked away quickly. \"What is this thing, Michael? Why do I feel so...?\" She couldn't finish. She just let the words trail off into silence.</p><p>\"I don't know. But it's... not just you.\"</p><p>She looked at him and saw it clearly in his eyes: he wanted her. As badly as she wanted him. But he broke eye contact to pick up the gun and bullets from where she had placed them, then put them into her hands. \"Keep the gun with you,\" he said. \"And keep it loaded. There's no safety to worry about, and it's fairly simple to operate.\"</p><p>She played with the catch on the side, because it was something to do to take her attention away from her body's demanding cries. He wouldn't say no if she invited him to her bed. She wouldn't even have to ask him. She could just take his hand, lead him into the bedroom. He would understand.</p><p>She made the gun's cylinder fall open, so she could see the holes where the bullets would go. Then she clapped it closed again and thought about loading it where to keep it while she slept and whether or not she could shoot someone-thought about anything but having sex with Michael Gray.</p><p>\"Between that and your stun gun, you should be able to defend yourself,\" he said.</p><p>She nodded</p><p>\"I wouldn't supply you with a gun if I mean to hurt you, Mary.\"</p><p>\"You think I don't know that at this point?\"</p><p>He nodded, glancing at the clock. \"It'll be awn soon. You should get some sleep.\"</p><p>He was right. It had been about 3:00 a.m. by the tie she' left the bar. \"So should you.\" Go on, say it. Just invite him to stay!</p><p>\"I will. We have one more thing working in our favor, Mary. He always strikes at night. Always.\"</p><p>\"So far, you mean.\"</p><p>He nodded.</p><p>\"And how is that in our favor.\"</p><p>\"I can protect you by night.\"</p><p>She frowned not sure what that could mean. Then she felt a lightbulb go on. \"You have a day job.\" Then she sighed. \"So you plan to work by day, then stay up all night watching my back? That's crazy, Michael. How long do you think you can keep up a schedule like that?\"</p><p>\"As long as I have to. And it's not as crazy as you think it is.\" Again he glanced at the clock. \"But time is awfully short. I really do have to leave you now.\"</p><p>He got to his feet, went to the door. An suddenly she felt panic nipping at her heart. She ran to the door behind him. \"Michael-\"</p><p>He stopped, turned and placed a gentle palm on her face. \"He's nowhere near here. Not now. I'd know if he was.\"</p><p>She closed her eyes. \"Besides,\" she said, \"then moon's not full.\"</p><p>\"Look the door behind me.\"</p><p>\"I will. But... when will you come back?\"</p><p>\"I'll be at the bar right after sundown. You make sure you get there before dark. That way you'll be safe. And keep your weapons with you.\"</p><p>She nodded. \"All right.\" Swallowing hard, she took his hand in both of hers. \"Thank you, Michael. I have no idea why you're doing this. Why you even care, but... thank you.\"</p><p>\"I'm doing it,\" he told her, \"because I can't not do it\"</p><p>\"I don't understand what that means.\"</p><p>He smiled gently. \"Let's just say you have some kind of power over me. I don't think I could resist it even if I wanted to. And to be honest, I don't want to.\" He cupped her cheek with his palm and leaned down to brush his lips over hers. \"Get some rest, Mary.\"</p><p>She nodded, and he stepped out the door. Mary closed it and turned the locks. Then she moved to the window and pushed the curtain aside to watch him go... but he was already gone.</p><p>As if he'd simply... vanished.</p><p>Mary slept until the ringing of the doorbell woke her. Her eyes didn't want to open, but the ringing was rapid and repetitive and stubborn as hell. She didn't want to get up. I didn't seem she was going to get a choice in the matter, though.</p><p>Rolling to one side, she pried her eyelids apart just enough to see the luminous red digits on her alarm clock-10:00 a.m. She'd been asleep for about five and a half hours-Michael had pulled his disappearing act around four-thirty. The doorbell was still firing away.</p><p>\"I'm coming, already!\"</p><p>She pushed back her cover and let gravity pull her legs until her feet hit the floor. Feeling around while yawning, she found her slippers with her toes and burrowed her feet into them. She stood up, finishing the yawn, and then she went stiff as the fog in her brain finally thinned enough to let her fear shine though.</p><p>What if it was the killer at her door right now?</p><p>But Michael had said he only struck at night. And during the full moon. It was broad daylight now. Still...</p><p>She opened the drawer in the bedside stand and took out the revolver. She'd loaded it and put it there before going to sleep last night. Where the hell to carry it, though? There was no pocket in her flannel pajamas. Licking her lips, scanning the room, with the doorbell pinging the entire time, she spotted a bathrobe on the back of a chair and snatched it up. As she pulled it on and dropped the gun into its deep terry pocket, the doorbell changed to rapid pounding, and a voice yelled, \"Open up Ms. McLean. It's the police.\"</p><p>Police?</p><p>She frowned, tugged the sash around her waist and tied it as she scuffed to the door and peered through the peephole. Two me in police uniforms stood at her door. Beyond the parking-lot gate, she could see a black-and-white car with all the right emblems and lights attached.</p><p>She unlocked the door, but left the chain on, and opened it just a little. \"Look, I don't want to piss you guys off, but I'm gonna need to call the station and verify that you're really cops, okay?\"</p><p>One rolled his eyes. He was heavyset, with a face that reminded her of a panda, dark circles around the eyes and heavy on the jowl.</p><p>The other one was younger, a blue-eyed blonde who belonged on a tanning-oil commercial. \"That's understandable, considering the nature of the complaint you filed you last week, and then the break-in,\" he said.</p><p>She blinked. \"Why are you here? You're not the cops who where handling that for me.\"</p><p>\"Well, there have been some developments, ma'am. Your case might overlap another one we're working, so-\"</p><p>\"Do you know something about this maniac who's been stalking me?\"</p><p>\"Maybe. Do you?\" asked the older one.</p><p>\"Wait here.\" She closed the door, turned the locks, glanced again at the car to see that they were city cops, then flipped open the phone book and found the number for headquarters. She got a fast answer and a quick verification that yes, two officers by the names of Strickland and Dunst were currently standing at her door.</p><p>\"Thank you,\" she said, and hung up the phone. Then she took the little gun from her pocket and tucked it beneath the huge leaves of a houseplant. Finally she opened the door.</p><p>\"I'm Officer Dunst,\" said the boy. \"This is Officer Strickland. We need to ask you a few questions, ma'am. Do you mind if we come inside?\"</p><p>\"Of course not. Sorry about the delay. You'll be happy to know you're legit.\" Neither of them so much as cracked a smile at her little joke. She stepped aside and let them precede her in; then she closed the door again, not bothering with the locks. She shouldn't need locks with two cops and a gun in a potted plant nearby. She waved them toward the sofa and took a seat in the chair opposite them. \"So what is this about?\"</p><p>\"Tommy Campbell,\" Strickland told her. \"You know him?\"</p><p>\"Of course I know him. We worked together at The Crypt-that's a bar, not an actual crypt, of course.\"</p><p>\"We know.\" Dunst's voice was softer. \"Can you tell us the nature of your relationship with him, ma'am?\"</p><p>Little chills were racing up and down her nape. \"What's going on here? Is Tommy in some kind of trouble?\"</p><p>\"Just answer the questions, ma'am. Are you involved with Tommy Campbell?\"</p><p>\"Involved? No, I'm not involved with Tommy. We're friends. We work together.\" She licked her lips and the cops stared at her, waiting. As if they knew there was more. \"He... he may be nursing a little crush on me.\"</p><p>\"What makes you think so?\"</p><p>She shrugged. \"I don't know. He's never acted on it, never asked me out or anything, but he just gives off that vibe, you know?\" Great, she thought. Now she sounded like Michael.</p><p>\"When was the last time you saw him, Mary?\" Dunst asked.</p><p>She frowned, a sudden fear gnawing at her gut.</p><p>\"Last night. I gave him a ride home from the bar. It was raining, and he didn't want to walk, so-what is going on?\"</p><p>\"What time did you trop him off?\"</p><p>She closed her eyes, thought back. \"We closed at two. It probably took us twenty minutes or so to get the customers out of there, and then we had clean-up. He only lives a few blocks-I don't know. It must have been close to three.\"</p><p>\"You're sure about that?\"</p><p>\"Yes.\"</p><p>\"Anyone else who can verify that?\"</p><p>She frowned. \"Can't you just ask Tommy?\"</p><p>The police officers exchanged a look. It was Dunst who finally spoke. \"Ms. McLean, Tommy Campbell was murdered last night.\"</p><p>She felt herself go numb, and her mind seemed unwilling to process the words. It was if he'd spoken in some other language. Then they came blear, and she shook her head in denial. \"No, that's not possible. Tommy is... Tommy is...\"</p><p>\"Dead, Ms. McLean,\" Strickland said.</p><p>She closed her eyes, squeezing them tightly as if to block out the man's words. \"But how? Why?\"</p><p>\"Someone tied him to his bed, doused him with gasoline and set him on fire.\"</p><p>\"Strickland, don't-\" Dunst warned.</p><p>Too late, though. She'd heard the horror, and her stomach heaved. She shot to her feet, lunging through her bedroom into the bathroom, and vomited. She sank to her knees in front of the toilet.</p><p>Dunst came in behind her. \"Are you all right?\"</p><p>\"I don't... understand this. Why? Why would any one hurt Tommy? He's gentle-he's harmless.\"</p><p>He reached past her, flushed the toilet, and then he wet a cloth in the sink and handed it to her. Mary wiped her face and hands and got to her feet.</p><p>\"You were the last one to see him alive, Mary,\" Officer Dunst said.</p><p>She met his eyes and shook her head side to side. \"No, I wasn't. The person who killed him was.\" The man averted his gaze, ad then she knew. \"My God, do you think I had something to do with this?\"</p><p>\"We have to question you. It's standard procedure.\" He took her arm, led her back through the bedroom toward the living room, his eyes scanning, seeming to take in everything. \"We need to know everything that happened last night, up to when you dropped Tommy off.\"</p><p>She stopped walking when she reached the living room. The other cop was on his feet, waiting. \"I've told you everything. Tommy needed a ride. I gave him one. He got out and went into his building, and I came home.\"</p><p>\"And that's all?\"</p><p>She nodded.</p><p>\"You didn't see anyone strange hanging around outside his place when you dropped him off?\"</p><p>She shook her head slowly. \"It was pouring rain. The streets were empty.\"</p><p>\"What about at the bar?\" Dunst asked. \"Anyone new been hanging around? Maybe paying extra attention to him?\"</p><p>She thought of Michael. She should tell them about him. He could verify her story, confirm that Tommy had been alive when she had left him and account for her whereabouts for the rest of the night. But something told her that would be a mistake, so she just shook her head.</p><p>\"After you came home, what did you do?\"</p><p>She blinked slowly. \"I went to bed. I didn't get up again until you two woke me just now.\"</p><p>\"You didn't leave again? Say between four-thirty and 5:00 a.m.?\"</p><p>She shook her head. \"Is that... is that when it happened?\"</p><p>They didn't reply. It occurred to her that telling them about Michael wouldn't do either of them any good anyway. Tommy had been killed after Michael had left here.</p><p>Tommy was killed after Michael left here.</p><p>She sank onto the sofa and looked up at them.</p><p>\"Someone must have seen something. Someone must know who did this.\"</p><p>Dunst nodded. \"If someone does, we'll find out.\"</p><p>She sighed and lowered her head. \"I hope to God you do.\"</p><p>The cops looked at each other again. Dunst shrugged. \"We may have more questions for you later on, once we learn more. Don't leave town for a while, all right?\"</p><p>She lifted her head sharply. \"I'm a suspect, aren't I?\"</p><p>\"Everyone's a suspect until we rule them out. We haven't rule you out yet,\" Strickland said. He went to the door, opened it and stepped outside.</p><p>\"I'll be right out,\" Dunst called. \"I'm gonna get her alternate telephone numbers so we can reach her.\"</p><p>With a nod, Strickland left.</p><p>Officer Dunst knelt in front of the sofa. \"Mary, this is between us, all right? We think Tommy might have been your stalker. Strickland thinks you found out and murdered him. I don't.\"</p><p>\"I appreciate that.\"</p><p>\"There was some evidence found at his place that links him to... some other cases. Unusual cases.\"</p><p>\"You're being awfully vague, Officer Dunst.\"</p><p>\"I'm sorry. I have to be.\" He took a card from his pocket and handed it to her. \"Theses people can help sort all this out. I know them. They're good people.\"</p><p>She glanced at the card. It had the stylized initials S.I.S. across the top, and underneath, in smaller type, it read Supernatural investigations Services.</p><p>\"Supernatural?\"</p><p>\"You didn't get it from me, understand? This conversation never happened.\"</p><p>She nodded slowly. \"What the hell is going on, Office Dunst?\"</p><p>\"I don't know.\" He averted his eyes when he said it, as if maybe he did know at last a little more than he was telling her. \"Give me your other numbers in case Strickland calls me on it.\"</p><p>She recited her cell phone number, which he scribbled quickly. Then he gave her a reassuring smile and left. She stood in the doorway, shocked ad trembling, until he got into the car with his partner and drove away.</p><p>Then she closed the door, turned the locks and sank to the floor, shaking.</p><p>Michael could have done this.</p><p>Michael didn't have anything to do with it, and you know it.</p><p>He had time, after leaving her. He hadn't seemed to like Tommy. But why? Why would he do such a horrible thing?</p><p>What if he were the stalker after all?</p><p>He's not. He can't be.</p><p>But there was a stalker, and it couldn't be Tommy. The police were wrong about that. What if the real maniac had killed Tommy because he know of Tommy's crush on her? Was it a jealous rage of some kind? Had this so-called evidence been planted at Tommy's place just to make him look guilty?</p><p>Her mind whirled with questions, and one gruesome image she couldn't erase from her mind-that of poor Tommy Campbell, burning alive in his bed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Something was wrong.</p><p>The bar was dark, only a single car in the parking lot beside his when he pulled in just after sundown. Mary's car. She tensed when his Jaguar's headlights illuminated her where she sat on her front step. He felt her fear rise up. It was palpable, even when he wasn't trying to read her thoughts. He quickly killed the engine and doused the lights, so she could see him.</p><p>Even then, though, her fear only eased a minute amount.</p><p>He opened the door and got out, and she got to her feet and came toward him. Her face was puffy, eyes red, as if she'd been crying.</p> <p>\"What's happened?\"</p><p>She held his gaze. \"Tommy. You remember Tommy, from last night?\"</p><p>He nodded.</p><p>\"He's dead. Someone killed him.\"</p><p>He went to her, put his arms around her to pull her close, the instinct to comfort her overriding his certainty that she was afraid of him all over again. But she didn't let him. She pulled away, and he let his arms fall to his sides as a clod dread settled over his heart. She suspected him.</p> <p>\"The police suspect me,\" she said.</p><p>It was the last thing he'd expected to hear. \"What? Why on earth...?\"</p><p>He was killed around 5:00 a.m. they said. I was the last person to see him alive. The last they know of, at least.\"</p><p>\"My God.\"</p><p>She kept her eyes on her shoes. He looked past her, noticing the sign taped to the entrance. \"Closed due to death in the family.\" He shook his head in disgust. Tommy had been young, early twenties at most. And while Michael had found the boy mildly annoying, he was certain the kid had done nothing to deserve this.</p><p>He looked at Mary again. She was barely holding herself together.</p> <p>\"How did it happen?\"</p><p>\"He was tied to his bed and set on fire.\" She met his eyes briefly. \"You're supposed to be some kind of psychic. Why didn't you see this coming?\"</p><p>He shook his head. \"I don't see everything, Mary. I don't have any connection to Tommy.\"</p><p>\"You don't have any connection to me, either.\"</p><p>\"Yes, I do. You know good and well I do. You feel it just as strongly as I do, Mary. Don't deny that. Not now.\"</p><p>She lifted her brows. \"Why shouldn't I deny it, when you refuse to explain it to me! I know you aren't telling me everything, Michael.\"</p><p>He was silent for a moment. She wanted to know everything. The last mortal he'd trusted enough to tell everything to had blasted a hole though her own head in reply. Mary might not react as badly as that. But she would certainly pull away from him, and if she did, the killer would find her alone, unprotected.</p><p>He couldn't tell her everything. But clearly, he had to tell her something. \"The bond we share is one of blood,\" he told her choosing every word with care. \"The antigen.\"</p> <p>\"You have it, too?\"</p><p>He only nodded. He would not tell her the rest... what he was. \"Mary, I had no reason to want to harm Tommy.\"</p><p>She licked her lips</p><p>\"You shouldn't have come here, alone like this,\" he went on. \"You could be in danger, you know that.\"</p><p>She shrugged. 'I brought the gun. I knew you'd be looking for me here. And I needed to see you. Besides, the police think Tommy might have been the stalker. Apparently that's my motive for killing him.\"</p><p>\"What makes them think that?\"</p><p>She shook her head. \"They wouldn't say. I'm not even suppose to know that much.\" Clearing her throat, she walked toward her car, parked beside his black Jag. \"The police wanted to know if anyone was with me when I dropped Tommy off last night. Anyone who could verify that he was alive when I left him. But I didn't tell them about you.\"</p><p>It as good that she hadn't told them. He didn't need the kind of snooping and investigation that would have resulted if she had. But if it would clear her of suspicion...</p><p>\"It wouldn't have mattered, anyway. He was killed after you left my place. You couldn't swear that I hadn't gone back and done this thing... any more than I could swear you hadn't.\"</p><p>He chose to ignore the latter comment. \"What evidence do they have against you?\" he asked.</p><p>\"I already told you, I was the last person to see him alive, and if he was the stalker, then...\"</p><p>\"That's circumstantial. Is there anything physical?\"</p><p>She frowned. \"I don't know. How could there be, Michael? I was never there.\"</p><p>\"Never mind. I'll find out. But first, we need to get you somewhere safe.\"</p><p>She was dangerously close to tears. \"I'm not suppose to leave town.\"</p><p>He thought about that a moment. If he took her away and the police couldn't reach her, their suspicion would increase exponentially. \"Do you have a cell phone?\" She nodded. \"And did you give the police the number?\"</p><p>\"Yeah.\"</p><p>\"Good. I want you to get into your car and follow me back to your apartment, all right? We'll leave your car there, and you can come with me.\"</p><p>She shook her head. \"I'm not going anywhere with you, Michael.\"</p><p>He held her gaze for a long time, then finally sighed, giving up. \"You think it's me. You think I killed Tommy don't you?\"</p><p>\"No. I don't think that at all, but part of me thinks that maybe I should-that maybe this... this... chemistry between us is clouding my judgment.\" She sighed, shaking her head in frustration. \"Hell, I don't know what to think. I only know that you're a stranger. As much as it feels like I've known you forever, you're a stranger to me, Michael. I don't even know your last name.\"</p><p>He swallowed hard. Why her lack of trust in him should cause him pain was beyond knowing. That it did was beyond denying.</p><p>\"I don't suppose I an blame you for being cautious. You're right. God, it seems to me that you know me better than anyone ever has, but that's just... that's just this.\" As he said it, he trailed the backs of his knuckles over her cheek, and she closed her eyes, pushing closer to his touch</p><p>Then she opened them again and met his. \"Its' powerful, Michael. Everything in me believes in you. But I have to be sure.\" She frowned. \"Isn't there some part of you that wonders if I might be guilty? If your feelings aren't clouding your judgment?\"</p><p>His eyes probed hers. \"No. Not in the least. But then again, I'm more used to trusting my senses then you are. All of them tell me you're no killer. And they've rarely steered me wrong.\" He nodded slowly. \"We'll go back to your apartment. I'll see you safely inside and leave my cell phone number with you. Program it into your phone, so you can call me quickly if you need me. You can stay there, and I'll go see what I can find out about Tommy's murder, and then I'll come back and fill you in.\"</p><p>She blinked, clearly uncertain. \"How do you think you can find anything out?\"</p><p>He licked his lips, unsure how much to tell her. \"I was a cop, Mary. For ten years, I was a cop.\"</p><p>\"In New York?\"</p><p>\"In Chicago.\"</p><p>\"Why did you quit?\"</p><p>He hesitated. \"I was shot in the line of duty. The injuries were... life altering.\" He wasn't about to tell her that he'd been on the wrong end of a Capone-era tommy gun, or that he'd been pronounced dead in a hospital, only to wake up in its morgue forever changed.</p><p>He'd been offered a choice then-live or die. He'd chosen to live.</p><p>\"I sorry. Is it still a painful memory for you?\"</p><p>He shook his head. \"It's in the past.\" Further I the past than she could ever imagine. \"But I do know something about police work. I know where to look for the answers we need, and how to get them without anyone being the wiser.\" He'd visited a great many police departments since his change. There were always unsolved crimes-things he picked up on through his ability to read the thoughts of mortals, to move about almost silently. There were always wrongs he could help right. And he did. Had for years. Evidence would turn up where none had been before; missing weapons would be located; witnesses would come forward. And the police never knew they'd had a helping hand-a cold, pale helping hand. In a lot of ways, he was a better cop now than he'd ever been before.</p><p>She pursed her lips, then nodded. \"If you really think you can learn anything, then... then yes. Let's do it. Here, take my extra gate key so you can get back into my parking lot.\" She turned away, walking toward her car.</p><p>\"Gray,\" he said to her back.</p><p>She stopped and turned to face him again. \"What?\"</p><p>\"My name is Michael Gray.\"</p><p>\"Oh.\" She smiled at him, weakly, shakily. \"Thank you for that.\"</p><p>He nodded and then she got into her car and he got into his.</p><p>After he left her, Michael went first to the building where Mary had dropped Tommy off the night before. There was no security no key card required to get into the building, and it wasn't difficult to find the right apartment. Even without the yellow police tape marking the door, he would have known. He could still feel the lingering chill of death in the air. And there was the stench. Burning flesh did not emit a pleasant aroma.</p><p>The apartment door was locked. The lock gave without much resistance to the pressure of his hand, and he went inside and closed the door behind him. He didn't turn the lights on. He didn't have to.</p><p>The place reeked of smoke and charred flesh, but the only sign of fire was in the bedroom. A ring of black surrounded the bed-it had burned through the carpet and charred the floor underneath. The headboard had been destroyed, leaving only a bit of charred wood at its base. The wall behind it was blackened, as well, and the ceiling above. The mattress was missing, probably in a crime lab by now.</p><p>Oddly, the rest of the room showed very little damage. The firefighters must have arrived in time to contain the blaze, saving most of the apartment and the rest of the building. And probably a lot of lives in the process.</p><p>The room had been ransacked. Many items, he sensed, were missing.</p><p>He went to the bed, bracing himself for the onslaught of sensations the acts would bring before he placed his hand on the bed springs.</p><p>He expected horror. Pain beyond endurance. Heat and searing torment. It wasn't what he got. He got nothing at all other than an image of a body on fire. No thoughts. No sensations. Tommy hadn't been conscious when he'd gone up in flames.</p><p>Frowning, he searched the apartment but found no clues, got no other images. It wasn't until he left the building, on his way to the police department, that he felt that death energy again. Not from within, but from the alley just below Tommy's window.</p><p>He followed his senses into the garbage-strewn alley. Rats skittered from his approach. And then he smelled it.</p><p>Blood.</p><p>Moving closer, he located the source, a dark spatter on the brick outer wall of the building next to Tommy's. He pressed his hand to the stain and immediately felt a stunning blow to his forehead, right between the eyes, and what felt like an explosion at the back of his skull. He smelled the hot sulphur scent of gunpowder, and though he didn't hear a shot his ears rang as if they had.</p><p>Someone had been shot in the head. Right here in this alley.</p><p>A young man. Early twenties, small and wiry, with brown hair.</p><p>God, Tommy had been shot right here. This was where he'd died.</p><p>It made no sense, Michael thought as he returned to his car and drove away. Someone had lured or forced Tommy into the alley only to then return him to his apartment. The risk of being seen carrying a body should have been enough reason not to do such a thing. And then to bind the boy to his own bed and burn the body-it was insane.</p><p>He was still no closer to learning what the police had found to implicate Mary, he realized. Whoever had done this had known where Tommy lived. Perhaps it was someone he knew, then. Or perhaps it was simply someone who had watched him enough to have learned that minor detail.</p><p>Hell, they could have figured that much out from the address on his driver's license.</p><p>But why? Why kill the boy at all, much less burn the body?</p><p>He found out more when he slipped into the police station and played mind games with the officers on duty to keep them away from the places where he needed to snoop. The place was no small-town PD, but it wasn't an overwhelmed, understaffed urban one, either. No, this was a wealthy community, and their police department was well funded.</p><p>There were the usual drawers full of paper files, but each folder had a pocket in the front, containing a CD-ROM. A quick check told him everything in the folder-from the crime scene photos on down-had been recorded on the CD. It couldn't have been any easier.</p><p>He found the box of unused CD-RWs and made a copy of the official records. Then he put everything back where he'd found it and slipped quietly out of the police department.</p><p>Easy. When you could plant thoughts in people's minds, convince them they needed to be elsewhere and move too fast for human eyes to detect more than a blur of color it was almost too easy.</p><p>He got into his Jag and drove back to Mary's apartment, eager to examine the evidence he'd found.</p><p>More eager, though, just to be close to her again </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She paced, torn in two about what she should be doing right now One tiny part of her brain told her she ought to be on the phone with the police, telling them everything she knew about Michael Gray-which was pathetically little. Every other part of her trusted him implicitly on nothing more than instinct.</p><p>But with her life?</p><p>Licking her lips, she picked up the business card that Officer Dunst had given her. She looked at the telephone number. Officer Dunst had said they were \"good people.\"</p><p>Glancing outside just once, seeing no sign of Michael, she picked up the telephone and dialed the number.</p> <p>\"Supernatural Investigations Service.\"</p><p>Mary had second thoughts. She certainly didn't need to add any supernatural bent to what should be a simple background check. \"I think I have the wrong number. Sorry.\"</p><p>\"Don't you think you'd better make sure of that before you hang up?\"</p><p>She sighed. \"Look, I just need an ordinary P.I. for a routine background check on someone. There's nothing... supernatural about it. I shouldn't have called.\"</p><p>\"How'd you get this number?\" the woman asked.</p> <p>\"I... um... a cop gave it to me.\"</p><p>\"Officer Dunst?\"</p><p>\"Yeah.\"</p><p>The woman said, \"Well, he sent us a lot of business. I imagine he knew we'd be more than glad to take care of your routine background check for you, even if it's not precisely our usual area.\"</p><p>\"You think so?\"</p><p>\"Either that or he has a feeling there's something supernatural about your case.\"</p> <p>That was the feeling Mary had had when Dunst gave her the card. But she didn't want to explore that suspicion too deeply. \"I just-look, there's this man who's shown up in my life. He seems to know things he shouldn't, claims to be some kind of psychic. I just wanted someone to run a background check on him.\"</p><p>\"We can usually do up a pretty thorough report within twenty-four hours. It'll cost you a hundred bucks. That's our special Dunst referral discount rate, by the way. Sound acceptable to you?\"</p><p>\"Yeah. Yes, that'll be fine. His name is Michael Gray. He's here in Bangor now, but he says he was a cop in Chicago, shot in the line of duty.\"</p><p>\"Hell, girl, with that much to go on, we won't have any problem at all.\"</p><p>\"Good.\" She heard a vehicle outside and jerked her head quickly toward the door. \"Call me. Make sure you only talk to me though. My number is-\"</p><p>\"We have it, hon. Shows right up on our caller ID box. I'll talk to you tomorrow.\"</p><p>She hung up the phone, feeling guilty as hell and hoping to God Michael would keep his promise not to go poking around in her mind, reading things that were private. The call she'd just made felt to her like a deep and unforgivable betrayal. To keep her mind off it, just in case he snooped, she thought about Tommy, and the moment she did, the horror of the way he had died came flooding back to her. She didn't think she would have any problem keeping her focus on that-she might have a problem driving it from her mind later on, though.</p><p>Someone knocked on the door, and she knew it was Michael, could almost feel his presence, but she looked first, all the same. Then she opened the door and let him in, and forcibly resisting the impulse to slide her arms around him and press herself close to him and whisper that she'd missed him.</p> <p>Maybe she was losing her mind.</p><p>He looked tired. Or it might have been worry that made his eyes seem so careworn, his face so tense.</p><p>\"Did you find out anything?\"</p><p>He nodded. \"Many thing. Still not everything. I think I ended up with more questions than I had before.\" He searched her face, and she almost squirmed with guilt, wondering what he could see there. \"How are you doing?\"</p><p>\"I'm fine. And you'll have to take my word for it, since you promised not to do any more trespassing in my private thoughts.\"</p><p>He smiled just a little. \"I wasn't. I told you I wouldn't, Mary, and I won't. I promise.\"</p><p>\"Just making sure. What did you learn about Tommy?\"</p><p>\"You want the good news or the bad news first?\" He set his brown leather bag on the floor and shrugged out of the trench coat, then hung it up on the coatrack.</p><p>\"You mean there's good news?\"</p><p>He nodded, picking up the brown bag again, and walked through the apartment taking a seat on one of the stools at the bar. \"Yeah. There's good news. Tommy wasn't burned alive. He was shot in the head in the alley outside his apartment.\"</p><p>\"But... but the police said he was tied to his bed and burned alive.\"</p><p>\"He was tied to his bed and burned, but not alive. He was already dead.\"</p><p>As Michael spoke, he pulled a laptop computer out of his case, flipped it open and pushed the button that made it come on.</p><p>She wondered how the hell he could know any of that, then guessed. \"You must have got a look at the autopsy report.\"</p><p>He shook his head as the computer went through its warm-up routine. \"The autopsy hasn't' been done yet.\"</p><p>\"Then-\"</p><p>\"I went to the apartment. I touched the bed. I got nothing. But in the alley outside, I felt the bullet. It entered here.\" He poked a forefinger to the spot between his eyebrows. \"Exited here.\" His palm open, he cupped the back of his head. \"There was an explosion of blinding pain, but very brief. Like the flash of a camera. Then he was gone.\"</p><p>She closed her eyes. \"You don't know how much I want to believe it happened that way, Michael, but-\"</p><p>\"I found the spray of blood on the alley wall. The police will find it, too. And when they do get their autopsy report, it will verify that Tommy was shot in the head and killed before his body was burned.\"</p><p>\"You're that good?\" she asked.</p><p>\"I'm that good.\" He pushed a button on the computer, and the slender CD drive popped open. Ten he dropped a shiny disk into it and closed it again. He hit a few keys. \"I stopped on the way back to take a look at this. It's gonna be hard to take, Mary.\"</p><p>\"So this would be the bad-news part?\"</p><p>He nodded. \"The police were investigating Tommy.\"</p><p>She frowned. \"For what?\"</p><p>\"He was their lead suspect in your break-in and the stalking.\"</p><p>\"They told me that. But I... I find it very hard to believe.\"</p><p>\"They were going to execute a search warrant at his place today. As it turned out, they didn't have to. The fire was pretty much contained in one part of the bedroom. The rest of his place only suffered smoke and water damage, I imagine the fire department contaminated any forensic evidence that might have been there, but... well, they did find these.\"</p><p>He flicked a button, nodded at the screen. There were rows and rows of thumbnail-sized photographs-and they were all of her. She squinted.</p><p>He moved the mouse until its arrow pointed at one, clicked it, and the photo appeared full-size. It was her making drinks, standing behind the bar at The Crypt. Taken from behind. Michael closed it and clicked on another, then another and another.</p><p>In one she was walking through the front door of her apartment. In another she was in her bed, sound asleep. There were photos of her at the grocery store, at the bank, photos of her car, with close-ups of the license plate.</p><p>\"He had an entire album full of these.\"</p><p>\"He was that obsessed with me?\" She stared at Michael, shaking her head in disbelief.</p><p>\"No, Mary. I don't think he was obsessed with you at all. I think he was hunting you. These aren't the kind of photos a man with an obsession takes. These are surveillance shots. Every one has the date, time and place noted on the bottom. And there's more.\" He clicked on another image. Enlarged, it revealing a hand-drawn map.</p><p>She frowned and looked again. \"That's my route home from work.\"</p><p>\"He made maps of all your routes. To and from the gym, the store, anywhere you went regularly. Along with charts of the times and dates you visited those places.\"</p><p>\"But... why?\"</p><p>He licked his lips. \"This is the work of a professional, Mary. Those phone calls-they weren't meant only to shake you up. They were probably also checks to see if you were home, or how much time you spent in the shower or the laundry room or whatever. He had your every movement charted and mapped.\"</p><p>She blinked slowly. \"And the break-in?\"</p><p>He sighed, clicking on another image. This one grew large enough to fill most of the screen. It was her apartment, laid out like a blueprint, every item in it, including light switches, windows, doors, furniture and telephones, marked and labeled.</p><p>\"The mess he left was just to cover what he was really doing here. Mapping the place so he'd know it backward and forward when he came to do the job.\"</p><p>She lifted her eyes to Michael's. \"He... he was in the car when that phone call came. You were there too. Remember?\"</p><p>He nodded. \"They found equipment at his place-a device that blocks any attempt to trace the call, another capable of being programmed to make a call and play a recording at a specific time before hanging up.\"</p><p>Mary couldn't believe what he was telling her. \"Tommy... was going to kill me?\"</p><p>He nodded. \"I'm afraid so.\"</p><p>\"But... but why?\"</p><p>\"I don't know. But I think it's the same reason he killed the other women with the antigen. They, uh, they found some photos of them at his place too\"</p><p>She tried to prevent the tears, but she felt so betrayed. So deceived. Tommy had seemed like an innocent, naive young man, little more than a boy nursing a crush. Not a cold, calculating murderer. He'd had her fooled.</p><p>Searching her reeling mind for answers, she hit on only one ray of hope. \"At least I don't have to be worried anymore. He's dead. The full moon is the day after tomorrow, and I'll be able to go outside and look up at it if I want to, without worrying about some maniac attacking me.\"</p><p>She tried to force a lightness to her tone. Even a false smile to her lips. But Michael still looked grim.</p><p>\"What? What is it?\"</p><p>\"I don't know. It's killing me that I don't know, but-Mary, I just don't get the feeling that the threat is gone. I still sense danger around you.\"</p><p>She searched her mind, wondering why on earth she might still be in danger. And then it hit her. \"I know what it is. It's the police. If they know all this...?\" She sent him a questioning look.</p><p>\"They do. This all came from their files.\"</p><p>She sighed. \"Then to them, it must look like I have the perfect motive for murdering Tommy. They'll assume I found out he was a serial killer, and that I killed him to keep him from killing me.\" She tapped a finger on her chin. \"What I don't understand is why they haven't arrested me already.\"</p><p>\"Because it's a far-fetched notion to think that a bartender without any special training could take out a professional killer like Tommy Campbell. That's why. They're searching for something in your background that would make it believable.\"</p><p>\"Like what?\"</p><p>\"Like that you're an expert marksman, or you have a black belt in some martial art, or that you spent ten years working as a CIA operative or something.\"</p><p>\"Or that I was a former cop?\"</p><p>He looked at her sharply.</p><p>\"Michael, you knew he killed before, and you knew he was coming after me next. I couldn't even blame you-not if you did it to protect me. Given the power of our feelings toward each other, I might have done the same.\"</p><p>He held her gaze for a long time. \"I knew he had killed before, and I knew he was coming after you next. But I didn't know he was Tommy Campbell. And I was a cop. Mary. A cop. Not a killer. If I had known, I'd have wanted him to do time for it. I'd have tipped off the police, exposed him somehow. I wouldn't have killed him unless he gave me no other choice. I'm not a murderer.\"</p><p>She had to look away from his eyes. He seemed so wounded that she would suspect he had done such a thing. \"I'm sorry,\" she said. \"Please remember, Michael, I still don't know you very well.\"</p><p>He sighed, closed a hand around hers. \"You know me inside and out. Just like I knew you. I know you feel it, Mary.\"</p><p>Closing her eyes, she let herself admit it to him. \"Yes. I do feel it. This odd sense of familiarity, as if you're my best friend. Someone I've loved, and loved me in return, for all my life. Or maybe even longer than that.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Michael made a halfhearted attempt to convince Mary that she didn't need to comb through the contents of the CD herself-that he could nutshell the important pieces of information for her. He knew before he suggested it that she would never agree. Odd, how well he knew her. As he'd expected, she insisted on seeing for herself. As she clicked through the files, the various reports statements of witnesses, evidences lists, she didn't just skim. She read every word.</p><p>\"The police knew about the other murders. And the blood connection, too. It's al right here.\" She pursed her lips, shaking her head as she scrolled down the screen. \"There's a notation to keep me under surveillance for my own protection, but it says they saw no need to alarm me, since the chances that my stalker was the same ma who'd murdered those other women was slim to none.\"</p><p>\"I can't disagree with their decision on that,\" Michael said, trying to see the case from a cop's point of view. \"If I didn't have this bond with you, then I wouldn't have known it, either. The fact that you happened to have the same rare blood marker as a handful of dead women in other states could have been a coincidence. At least they were taking precautions.\"</p><p>He took her mug from in front of her and refilled it with coffee, then replaced in on the counter. \"We really should get you out of this apartment, Mary.\"</p> <p>\"I don't see the need. The killer is dead.\"</p><p>\"But the danger is still here.\"</p><p>She frowned at him. \"I don't know what you mean by that. How can it be, when Tommy's dead?\"</p><p>He sighed, sliding onto a stool next to hers. \"I don't know, either. It's there, that's all I can tell you. It's around you like a dark cloud. It hasn't changed in the least since Tommy's death. I know I'm right, Mary.\"</p><p>She pursed her lips. \"There's no way you an be. My main goal now has to be to clear myself of suspicion in Tommy's murder. I can't do that if I go into hiding.\"</p> <p>He searched her eyes. \"If Tommy was the stalker, the murderer, then why is he dead? Who killed him?\"</p><p>She shook her head slowly. \"I don't know. A relative of one of his victims? Or maybe it was completely unrelated.\"</p><p>\"I don't believe that.\"</p><p>\"What else could it be?\" She slid a hand over one of his. \"Michael, he's dead. Maybe your... your feelings for me are messing with your reception on this.\"</p><p>He tried that theory on for size, but it didn't fit. He'd trusted his senses for too long to start doubting them now. So if it wasn't that, then what? \"Mary what if all the evidence is wrong? What if Tommy wasn't the stalker and some one planted all that stuff to make it look as if he was, then murdered him. It would certainly divert suspicion from themselves.\"</p><p>Her eyes clouded so quickly, so suddenly, that he almost winced. \"I thought of that, too. Then I told myself it was too far-fetched. The simplest answer is usually the right one, isn't that what they say?\"</p> <p>\"That's what they say. But nothing about this has been simple.\"</p><p>\"Do you think it's possible?\"</p><p>\"It's the only explanation I can think of for what I'm sensing.\"</p><p>She swallowed hard, and her chin rose a notch. \"Well, then... that's just one more reason for us to find the man who killed Tommy. We not only need to clear me of killing Tommy, but we need to clear Tommy of having been this psychopathic murderer. It's unfair to his memory.\" Lowering her eyes, she added, \"and if the killer is still out there, we need to get him before he gets me. Reason number three.\"</p><p>\"That would be reason number one,\" Michael corrected. \"And this apartment isn't essential to any of those goals.\"</p><p>She searched his eyes, probing them. Ws she wondering just what hidden motivations might be lying behind them? Did she still mistrust him? He stared back, unflinching, letting her probe as deeply as she wanted, stating without a word that he had nothing to hide. When in fact he did. Then the telephone shrilled, breaking the silence so abruptly that Mary jumped two inches off the floor.</p><p>Michael gripped her shoulders \"All right?\"</p><p>\"Yeah, fine.\"</p> <p>\"You want me to...?\"</p><p>\"No, no, I have it.\"</p><p>It rang again, and she went to the stand and picked it up. \"Hello?\"</p><p>Michael saw by the look in her eyes that there was no reply, and instantly, instinctively, slid inside her mind to listen through her ears.</p><p>\"Hello?\" she repeated. \"Who is this?\"</p><p>No answer. She closed her eyes an Michael heard her thoughts. This can't be happening. It can't be... But the silence dragged on. And then there was a single word, drawn out and raspy.</p><p>\"Soon.\"</p><p>Click. The phone went dead. Mary slammed her receiver down and spun to face Michael. \"I'll go wherever you want\"</p><p>\"It was him.\" He made it a statement, not a question. And he withdrew from her mind, feeling guilty about having broken his earlier promise to her.</p><p>She faced him and nodded. \"It's almost a relief, in a way. I didn't want to believe it was Tommy anyway. It's going to be twice as satisfying to bring this bastard down, knowing he tried to make it look as if sweet little Tommy was responsible for his crimes.\" She was speaking quickly, too quickly, not pausing for a breath between words. \"Talk abut speaking ill of the dead. Bad enough that he murdered Tommy, but to go to all that trouble to frame him, to try to ruin his memory like that, is just... is just...\"</p><p>She'd run out of steam, he thought. Her rapid fire words stopped. She closed her eyes, but the tears came through all the same, and when he pulled her close to him, this time she didn't resist. She seemed to soften in his arms, against his chest, buried her head there and let herself cry. He rubbed her back and shoulders, stroked her hair, wondered at the tightening of his throat and the burning in his eyes. It hurt him to see her in pain, and all he wanted at that moment was to ease her fear and her suffering.</p><p>\"It's going to be all right, Mary. I'm not going to let anything happen to you. I promise you that. He won't get anywhere near you. You'll be safe with me. I'll keep you safe. Trust me. Believe me, Mary, I won't let him hurt you.\"</p><p>She nodded against him, sniffling. \"I do believe you,\" she whispered.</p><p>\"Why don't you pack a few things? I'll stow the laptop in the car, then come back in to carry your bags out for you. All right?\"</p><p>\"Okay.\" She straightened away, looking up at him.</p><p>It broke his heart to see her cheeks wet with tears. \"Okay,\" he said again. It was a effort to let her go, but he managed to do so. She went into the bedroom to pack, and he popped the CD-ROM out of the laptop, shut the computer down and folded it shut. Then he slid it into his brown leather satchel and buckled it shut. He grabbed his coat and headed out to his car.</p><p>She waited until he'd stepped outside to all from the bedroom telephone. Her hands were shaking as she punched in the numbers. Her heart and soul and body were at war with her mind, ripping one another to shreds. She felt as if she were stabbing Michael in the heart by making this call. And yet some still small voice in her mind told her that someone, somewhere, ought to know where she was going and how to reach her.</p><p>The ringer sounded twice before anyone picked up. \"Supernatural Investigations Services, Stormy speaking.\"</p><p>\"Hi, this is Mary McLean. I phoned you earlier?\"</p><p>\"Hi Mary. Look, it's too soon to tell you anything yet, but-\"</p><p>\"No, no, it's not that. I just wanted to give you my cell phone number. \"I'll be away from the apartment, at Michael Gray's place. So you'll have to reach me on that.\"</p><p>\"All right. Shoot.\"</p><p>She glanced out the window. Michael was walking back across the lot toward her door already. So strong, so beautiful and so utterly devoted to her. How could she still suspect him of anything?</p><p>She didn't, and that was the truth. She was dead over heels for the guy. It wasn't Michael she didn't trust right now; it was her own judgment.</p><p>She recited the number quickly. Stormy read it back, getting the last digit wrong. Mary corrected her. Michael was opening the door.</p><p>\"Got it?\"</p><p>\"Yes.\"</p><p>\"Good.\" She hung up the phone just as he stepped inside and pulled the door closed behind him. \"I'll only be a few more minutes,\" she called. As quickly as she could, she yanked a suitcase out of her closet, opened it and began tossing clothes inside. As she slammed it shut, she tried to slam the door on her guilty feelings, as well. But that wasn't so easily done.</p><p>Michael's home was not at all what she had expected. She wasn't certain just what she had expected-something that spoke of extreme wealth, she supposed, since he drove a Jaguar and dressed in expensive clothes. The place must be casting him a bundle, but it didn't advertise that fact. It was a beach house. Just one story, not tiny, but not sprawling, either. He took a side road off Route 1, north of Bangor. A few miles later he was pulling into the neat white gravel driveway that would right up to the front doors, which were sliding glass, with heavy drapes behind them. Beyond the house was a beach, more rocks than sand, and plenty of frothing surf.</p><p>\"This is where you live?\"</p><p>He nodded. \"Only since I came to Maine, looking for you. I found it the first night. I like the ocean.\"</p><p>\"So do I.\"</p><p>They got out of the car and he handed his key ring to her. Then he opened the trunk to take out her suitcase, carrying it in one hand and his own case, with the laptop, in the other. Mary reached past him to close the trunk, then walked beside him over the flower-lined path to the door.</p><p>\"It's the square-headed key,\" he told her. \"The silver one.\"</p><p>She inserted the key in the lock, then slid the doors open and pushed the drapes aside to step in. The place was open and airy, its kitchen and dining room combined in one broad space, two steps down. Beyond them, the living room was two steps lower still, furnished with a brown velour sofa and chairs that looked as inviting as any she'd seen. His coffee and end tables were brass and glass, and another set of sliding doors stood at the far end. She dropped the keys on the table and went to them, pulling the drapes open and then she took in the view.</p><p>Steep wooden stairs zigzagged from the back door down to the rocky beach. Not a soul was insight this early in the season. But the sand and the rocks and the waves rolling gently in, one after the other, were a breathtaking sight. An soothing, somehow.</p><p>\"This place is beautiful.\" She felt as if she really had found a haven.</p><p>\"I'm glad you like it.\" He carried her bas though the living room to a door on the left. \"This is the guest room. You'll be it's first occupant.\"</p><p>\"I can't imagine why. If I had a friend with a place like this, I'd be here so much they'd get sick of me.\" She said it with a teasing smile.</p><p>\"You do have a friend with a place like this,\" he said. His tone wasn't light or teasing. \"And I doubt I'd ever get sick of you.\"</p><p>She met his eyes, saw the tension, the passion, in them. She had to look away. \"Michael, I... there's just so much going on now. I can't even think about-\"</p><p>\"I know. I wasn't trying to-\" He licked his lips and started over. \"No pressure, Mary. Not from me, can certainly not now. I just forgot to keep my feelings to myself for a second.\"</p><p>Her stomach tightened, and her face heated. \"I want to explore this... this thing between us.\"</p><p>\"So do I.\"</p><p>\"I just need time.\"</p><p>He nodded.</p><p>Maybe... maybe when this was over and she knew more about him-God, she had to learn more about him-maybe then she would be ready to take this to the next level, see where it might lead.</p><p>But until then... until then she was going to be fighting every instinct and desire in her to keep herself in her own bed in the guest room and out of his.</p><p>He cleared his throat, breaking eye contact. \"Look, my schedule is a little crazy. I'll be gong before you wake in the morning and probably won't be able to get back until after dark. I don't want you to feel trapped here. But you will be safe. No one knows where to find you here. The locks are top-notch, and there's a security system, as well.</p><p>She nodded. \"I don't feel trapped I feel rescued. It made perfect sense to leave my car at my place so not to alarm the police, and you'll need yours. I'll be find as long as can go down to the water, walk on the beach. And don't worry about your schedule, Michael. I'm used to sleeping by day and working by night, given my hours at The Crypt.\"</p><p>He only smiled at her, opening the bedroom door and carrying her bags inside. The room was small and obviously unused. Still, it was carpeted in thick pile, and the bed was huge and comfy looking. A matching dresser and a beside stand with a clock were the only other items inside.</p><p>\"It's perfect. Thank you, Michael.\"</p><p>\"You're welcome.\" He looked around the room as if inspecting it for flaws.</p><p>\"Stop. It's perfect, I told you.\"</p><p>\"I should have planned better,\" he said. \"I could have spruced the room up a little. And now that I think about it, there's probably not a crumb of food in the place.\"</p><p>\"What, you don't eat?\"</p><p>He looked at her almost as if he were alarmed, but then he saw the teasing smile she sent him and returned it. \"There's a little store just a short walk from here. We can stock up tonight.\" He looked at his wristwatch. \"They're open for another hour yet.\"</p><p>\"Then we'd better get to that right now.\" He glanced at her suitcase.</p><p>\"I can unpack when we get back.\"</p><p>\"All right.\" He led her out of the bedroom, out the back doors and down the zigzag stairs to the beach below, then turned left, and they walked side by side in the sand. As they did, his hand brushed hers and turned, as if to enfold hers, but he stopped himself.</p><p>She wanted him to hold her hand. She wanted far more than that. Mary slid her hand into his, and when he closed his around it, warmth infused her entire being.</p><p>Something bright caught her eye, and she glanced out toward the sea. The moon was shining down on the ocean, its silver light spreading over the rippling waters.</p><p>She swallowed hard. \"It's almost full.\"</p><p>\"I know.\" He squeezed her hand. \"I'll keep my promise, Mary. You're safe with me, I swear it.\"</p><p>A shiver went up her spine in spite of the warmth of being near him. It was a sudden rush of fear, of foreboding, almost a warning. She hoped to God he could keep his promise. But she wasn't certain that was possible if fate had other plans for her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He didn't want to feel the way he did about Mary. He didn't want this power between them to be anything more than the undeniable awareness that always came between her kind and his. She was one of what vampires called The Chosen-a human with the belladonna antigen. They were linked by blood, the two of them. The overwhelming urge to protect her was to be expected.</p><p>And yet he couldn't deny that there was more than that. He was compelled to walk close to her, stand close to her, sit beside her, touch her at every opportunity, smell her.</p><p>Taste her...</p><p>No. Not that. He wouldn't do that. She must never know what he was. The memory of Sally's reaction to that knowledge was as fresh as if it had happened yesterday.</p> <p>They walked to the small store down the beach, and he bought two bags of groceries. It was a difficult task, since it had been a long time since he'd had to shop for food, and the items offered today were foreign in comparison to what had filled the shelves in his own time.</p><p>He had to keep nudging her to make choices, and eventually she got over any feeling that he ought to be the one to choose and just did it. His relief must have shown on his face as the cashier rang them out.</p><p>\"Not much of a shopper, are you?\"</p><p>He shrugged. \"I usually east out.\"</p><p>She shook her head. \"You don't know what you're missing.\"</p> <p>He did know, but to be honest, he didn't miss it al that much. The appeal of food paled in comparison to the lust for blood. Of course, he couldn't tell her that. Or that while food might taste good going down, that was all it did. Blood came alive inside him, sparkling and sizzling through his veins like living energy. Electricity times a thousand. Life. It was life. Even the stale aged blood he used as his sustenance, stolen from blood banks or hospitals, held the spark of that power. He was hungry. It had been days since he'd fed. Yet he wanted to be near her, to protect her his every waking moment. He couldn't take tie away to scavenge for a meal.</p><p>He took the tow paper grocery bags from the counter and, carrying one in each arm, left the store. Mary caught up quickly and took one of the bags from him. \"You don't need to wait on me, you know.\"</p><p>\"I wasn't.\" No. He was trying to keep her from seeing the glow of bloodlust in his eyes. He fought his hunger, wrestled it into submission, buried it and focused only on her.</p><p>She walked along the path beside him, warm and alive and beautiful. Her hair was long and loose tonight. The sea wind blew it around her face. In front of the store was a small parking area, and a road beyond it. Behind it, there was a narrow, well-worn path that wound back to the beach.</p><p>\"What is it you do?\" she asked at length.</p><p>\"Do?\"</p> <p>\"Yeah. You said your work keeps you away most days remember?\"</p><p>\"Oh. My... work.\"</p><p>She smiled at him a little nervously. \"Must pay well. You drive a Jag. Live in a magnificent house on a private beach.\"</p><p>Plus, seventy years of careful investing had it's benefits, he thought.</p><p>\"Is it law-enforcement related?\"</p><p>He glanced at her, realized he was expected to come up with an answer, one that made as much sense as her suggestion did. \"Yeah, as a matter of fact, it is. I do consulting work for, uh, security companies. You know the kind that set up alarm systems and tie lock for office buildings and banks and things like that?\" He wondered if it sounded at all plausible and watched her face carefully for her reaction.</p><p>She nodded as if it made perfect sense. \"Sounds exciting.\"</p><p>\"Id far rather be here with you,\" he told her.</p> <p>She blushed in the darkness lowered her eyes, didn't answer.</p><p>They arrived back at the beach house, and he insisted on taking the bag from her as they climbed the stairs. She couldn't know it was less than weightless to a ma as powerful as he, and she argued.</p><p>\"I'm just as capable of carrying a bag of groceries up the stairs as you are, you know,\" she said, trotting up the steps behind him.</p><p>\"No, you aren't.\"</p><p>\"Am so.\"</p><p>\"Would you like me to carry you up, as well Mary?\"</p><p>She smacked him on the shoulder from behind. \"Show-off.\"</p><p>He loved her when she was in a teasing, playful mood. It meant she wasn't dwelling on her fear. They reached the top, and he turned to face her. \"Key's are still in my pocket.\" He nodded downward. \"You want to reach in and there and feel for them?\"</p><p>She smirked at him. \"You wish.\" Then she took one of the bags from him, freeing him to get his keys himself. She was more relaxed than he'd seen her since he'd first started going to the bar to watch over her at night, almost two weeks ago. The moon had been new then.</p><p>He opened the door, and she went inside, toed off her shoes and carried the grocery bags to the kitchen. Setting them on the table, she began unpacking. She turned to a cupboard to open it, then frowned and opened a couple more. \"You weren't kidding about eating out a lot, were you?\"</p><p>\"I've only been living here a couple of weeks. I really haven't stocked the place yet.\"</p><p>\"Been too busy being my guardian angel to worry about eating properly, I'll bet.\"</p><p>She couldn't possibly know how right she was about that. He shrugged, still nervous that the lack of food in the cupboards would cause her to ask questions, but Mary seemed to accept his explanations. There were dishes in some of the cupboards. They'd been there when he'd moved into the place, and he'd washed them and put them right back-even though to him they were little more than props.</p><p>\"You know, you're really roughing it here, Michael. No coffeemaker. No toaster. There's not even a microwave.\"</p><p>\"Like I said-\"</p><p>\"Oh, don't explain. I've never yet met a member of your species to be overly concerned with nesting.'</p><p>He went very still in the small kitchen. \"My... species?\"</p><p>\"Yeah. Male.\"</p><p>He closed his eyes as his relief emerged in the form of a sigh and every tense muscle relaxed. For a second he'd thought she might have known or guessed what he was.</p><p>But why would she guess? She probably didn't even believe creatures such as he existed.</p><p>When they finished emptying the grocery bags, she stretched her lovely arms, yawned and said, \"It's after midnight. I think I'll get some sleep. I cant believe you're up this late when you have to get up before dawn.\"</p><p>\"I rarely sleep much at night.\"</p><p>She shrugged. \"Well, you should.\" She smiled at him. \"You don't take very good care of yourself. You need to do better.\"</p><p>\"I'll try my best.\"</p><p>Their eyes met and held for a long moment. Finally she sighed and looked away. \"Good night, Michael.\"</p><p>\"Good night.\"</p><p>Then she headed into her bedroom. Michael sat in the living room, listening to her. Sensing her. He could close his eyes and know where she was, what she was doing, just by opening his mind. He didn't even need to probe hers.</p><p>He heard the water in the bathroom, felt her peel away her clothes and step into the shower. He wanted her. It was a hunger, like the hunger for blood. And it was just as natural in his kind. Desire, in a vampire, wasn't a mere fancy or passing impulse. It was a demanding, insatiable, driving need. He, for whatever reasons-and he didn't doubt their blood bond was one of them-desired her. He would know no peace until he had her.</p><p>He sighed and told himself that likely meant he would never know peace. Because he wasn't going to have her. The risk that he would loose himself to the need to taste her blood was too great. He knew that now as he'd never known it before. He was going to protect her until he knew she was safe, and then he was going to go on his way, long before she could learn what he was.</p><p>He continued sitting there, tuned in to her essence, if not her thoughts for a long, long while. The shower stopped running, and she put on something slight. A T-shirt, perhaps Then she slid into the bed and closed her eyes.</p><p>She slept. He felt her sinking into sleep rapidly, and he knew she hadn't been sleeping well since this entire thing had begun. She felt safe here, with him.</p><p>For a time he was content to sit there, feeling her sleep. Then he heard her, very clearly, whisper his name. Michael. At first he thought she had spoken it deliberately, called, to him, and he was on his feet and at the bedroom door before it occurred to him that she was still asleep.</p><p>She'd said his name in her sleep.</p><p>He closed his hand on the doorknob, turned it, opened the door and stepped into the bedroom. She lay on her side, and he could see her face, serene, relaxed. Yes, she was asleep, hugging he pillow. She nuzzled it's softness with her cheek, and again, she muttered his name. This tie her hips moved just a little as she did, and her arms clutched the pillow fighter to her breast.</p><p>She was dreaming. About him.</p><p>He shouldn't. He told himself he really shouldn't. She'd asked him not to pry into her mind, and he had honored that request, for the most part.</p><p>But he didn't think he knew any man, mortal or otherwise, who could have resisted just a tiny bit of exploration. He moved closer to the bed until he stood right beside it, his thighs touching the mattress. He lowered his hand, planning to lay it atop hers very lightly, to enhance their connection, let him view her thoughts more vividly and with less effort. But before he could make contact, her hand moved, turned and gripped his wrist hard. Her breathing quickened just a little. And still she slept.</p><p>He stared down at her face, then closed his eyes and focused on her mind, her thoughts, her touch.</p><p>And then he was there, inside her dream. He saw two nude people, writhing on the bed: himself and Mary. She was lying beneath him, her legs wrapped around his waist, linked at the ankles. His hips were snapping as he drove into her, and hers moved in time, receiving him. He felt her need mounting, her desire building, and yet she couldn't reach satisfaction. Not in her sleep. Not in a fantasy.</p><p>He burned with wanting her, wanting to assuage her hunger-but he knew that would mean facing the temptation to assuage his own. And he needed her trust right now. He would lose it if she learned what he was, and if he lost her trust, she would die. Even with Tommy gone, he felt the menace surrounding her lie a nimbus. She was still in danger.</p><p>He stroked her face and her hair, leaning closer, whispering to her mind with his, coaxing her dream along with erotic images projected into her mind and words spoken softly into her ear, until she shivered and trembled with the release his will and deemed inevitable. And then her arms curled around his neck and her face turned up to his. He kissed her. He knew he shouldn't, but to deny himself even this brief taste of her was more than he could bear. He kissed her, and her mouth moved beneath his, lips parting, tongue tasting. Her fingers splayed in his hair as she kissed him, and he took full advantage of the opportunity to explore her mouth.</p><p>But she was sliding ever closer to lucidity, climbing slowly from the dream state, and he knew it had to end before she opened her eyes.</p><p>He eased into her mind with the command that she must sleep. That all this was just a pleasant dream and nothing more. He couldn't quite bring himself to tell her to forget. No, he wanted her to remember, because he would.</p><p>He felt her falling away into the depths of slumber, and he lifted his head from hers. Tucking the covers around her once more, brushing astray coppery curl from her check he forcibly ignored the soft, inviting rush of blood flowing just beneath her skin, the delicate, steady thrum of its pulsing there. Involuntarily he licked his lips.</p><p>Then he closed his eyes, and forcibly turned away from her, striding out of the room, and out of the house. He needed blood. It wouldn't take long.</p><p>When he crept back into the house a half hour before dawn, sated and warm thanks to the local blood bank's flimsy locks but no less hungry for her, he smelled something that made him slightly queasy. Following the aroma and his sense of Mary in the kitchen, he found her there, scooping yellow omelettes with flecks of green and brown and red onto plates. Two of them.</p><p>Mary?\" he asked. \"Why are you up so early?\"</p><p>She looked toward him, smiling brightly. The way she sparkled his morning took his breath away. \"I set the alarm an got up early so I could make you a special breakfast before you had to leave for work.\"</p><p>He looked at the plate, then at her. His stomach twisted \"You shouldn't have gone to the trouble-\"</p><p>\"It's the least I could do, after all you've done for me.\" She shrugged. \"You said you eat out most of the time. I thought a home-cooked breakfast would be a welcome change.\"</p><p>\"That's... I don't know what to say.\" He truly didn't. He couldn't actually... eat that thing. Could he? And yet it touched him to his core that she wanted to do this for him. To take care of him-the way he wanted to take care of her.</p><p>She smiled again and pulled out his chair. I'm going to go out walking today and if I should pass a shop that sells them, I'll buy you a coffeemaker. I don't know how you manage to start the day without coffee.\" She pulled out a chair and sat down. \"Well? Dig in.\"</p><p>Licking his lips, he sat in the chair opposite her. The smell of the omelette wafted up to his nostrils, and his stomach rebelled again. He glanced at his wristwatch. \"I'm not going to have time to do this luscious meal justice.\"</p><p>\"I'm not gonna be offended if you have to eat and run. I know you have to get moving early.\"</p><p>He nodded and watched her eat a few bites. But she kept looking at him, and he knew damned well she was going to be wounded and offended and, worst of all, suspicious if he didn't eat the food. Bracing himself, he picked up the fork, squared his shoulders and shoved a bit into his mouth.</p><p>Sold food was a misnomer. It wasn't solid at all, but a mushy mass that only got more soggy as one attempted to grind it to a digestible consistency with one's teeth. He tried his best to turn the sound of revulsion leaping up from his gut into moans of ecstasy. He almost gagged when he had to swallow, but he managed to force it down, and then he shoveled in another bite, and another.</p><p>He devoured fully half of his meal, then pushed his chair away from the table. Bits of the horrible thing still clung to his teeth and tongue, and his in the crevices of his mouth. 'That was the most delicious omelette I've ever had, Mary. Truly. Thank you. I'm so sorry I have to go.\"</p><p>\"You're welcome. And don't apologize.\"</p><p>He was already halfway to the front door. His body was not designed to digest solid food. His liquid diet was absorbed into his blood stream directly from the stomach. The rest of the tract-hell, he didn't know, but he'd always assumed it was simply shut down. It certainly hadn't preformed any noticeable function since he'd been transformed.</p><p>He closed the door behind him, and stumbled to the car, his keys in his hand as his stomach convulsed. His plan was to get into the car, drive out of sight and then-but no, it was too late for that. Dropping the keys on the car's front seat, he slammed the door and ran across the narrow side road and into a decorative copse of pinon pines. And then he fell to his knees as his stomach rejected the meal in terms so violent he thought his body was being torn apart from within.</p><p>When if finally stopped, he moved a few steps away, fell to the ground, and lay there, shaking trembling, chilled trough and oddly weak. He remained that way for several moments, until disgust forced him to get to his feet again and move farther. There was a stream a few yards away, runoff from the mountains leading into the sea. He went to it, dipped his hands full of icy cold water and filled his mouth with it, over an over, swishing, rinsing and spitting until he had rid his mouth of every crumb he could manage.</p><p>He need a full bathroom, with a shower and sink and, most of all, a toothbrush. And floss. He shivered, and then he moved on into the scrubby excuse for a woodlot over the narrow deer path.</p><p>The sun was on its way. He could already feel its touch on the air, though it had yet to peek over the ocean. He followed the trail, a shortcut to the cemetery, and emerged into the place from the rear. It was an old cemetery, with several family plots, each one consisting of one large stone an several smaller ones, all surrounded by a wrought-iron fence. They occurred in various sizes and styles, but nearly all the groups here were grouped that way.</p><p>A few more recent graves stood alone. Up the hill a bit were the crypts, including his own. His name was engraved on the top, chiseled into the granite, in all caps. He'd purchased it, allegedly for his father, even staged a fake funeral a month ago, in preparation for his move here, knowing he would need a backup shelter from the daylight.</p><p>The door was sealed and looked like all the others. But there was hidden catch to release the lock from the outside. He did so, glancing around, opening his senses to be sure he wasn't observed. Then he opened the door and went inside. He closed it behind him an slid home the additional locks he'd installed on the inside of the crypt.</p><p>He sighed as he faced the four-by-eight rectangle and the stone slab upon which he was going to spend the day. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The full moon was tonight.</p><p>No matter how else Mary tried to occupy herself though the day, that was one of the three thoughts that kept circulating through her mind.</p><p>The second was a question. Why hadn't Michael taken his car this morning? She lied to think he had decided at the last minute to leave it for her-except that she'd found the keys lying on the front seat and the car unlocked. Which just didn't seem in keeping with his past as a police officer.</p><p>He'd left in such a hurry-almost as if he were desperate to get out of her sight. She'd run to the window to wave him off, but he'd seemed... almost ill, suddenly. The way he stopped near the car, fumbling with the keys, dropped them, then went staggering off at an uneven run across the street and out of sight.</p> <p>Had someone picked him up? Did he have a car pool he'd forgotten about or something?</p><p>No matter, she could just ask him when he got back home. She was sure there was some explanation.</p><p>The third thing on her mind was the dream she'd had last night. God, it ha been so real. In the dream he'd made love other, and it had been intense and incredible and the most erotic thing she'd ever experienced, real or imagined.</p><p>She cleaned up the kitchen, then took Michael's car out to do some shopping, a coffeemaker being at the top of her list. But all day long, erotic images and fluttering arousal gnawed at her, fighting for space beside the ice-cold fear in her mind. Shopping didn't help to alleviate either of the conflicting emotions. So when she returned to his place, she put her purchases away and tried to think of something else to occupy her mind.</p><p>She tried watching TV, but he didn't get many channels. She thought about planning an extravagant dinner, but she really didn't think he'd enjoyed the breakfast all that much. So she sat on the sofa, and she gave in to the more pleasant of the barrage of thoughts. She let herself relive her exquisite dream of the night before. Her and Michael, making love. The things he'd whispered in to her ear, the ways he'd make her feel, the places he'd touched her, the feeling of him inside her...</p> <p>She shivered and closed her eyes. She had never had an experience like that one in her dream. She'd had sex, but never like that. It had been-like something beyond. And she wasn't sure, but she thought she'd climaxed in her sleep. Up until last night, she hadn't thought such a thing was possible.</p><p>Oh, hell, so now she was going to sit here and have sexual fantasies about Michael for the rest of the day?</p><p>Yeah, she realized, she just might at that. She'd wanted him from her very first glimpse of him, watching her in the bar, from the darkness. His eyes, so intent and appreciative. Almost hungry.</p><p>A delicious chill raced up her spine. She shook it away, evens she wondered if he could possibly feel as powerfully attracted to her as she did to him. She thought he did, and yet it didn't seem possible anyone could feel as strongly as she did about him.</p><p>But she shouldn't even be thinking along those line, not now, when so much else was happening. The full moon was tonight.</p><p>She got to her feet and decided to explore the house. Surely that would keep her mind off sex with Michael. So she wandered. There wasn't much more to the place than what she had already seen. A laundry room in the back, with a nice jet-black washer and dryer. A garage on the side. She went into it, not expecting to find much of interest-it was a garage, after all. What would there be besides a few tools and car accessories, maybe some spare tires? But when she entered she was surprised. There was a shiny midnight-blue motorcycle leaning on its kickstand.</p> <p>And why did knowing he rode that thing make him even more attractive to her? She flashed on an image of the two of them riding it, her thighs framing his hips, her arms tight around his waist, her hair blowing in the wind.</p><p>Sighing, she wandered back into the house and went to the room she had been avoiding up to now. Michael's bedroom. Her hand closed on the doorknob, and she was almost surprised that it gave easily. Then again, why would he lock her out of his bedroom?</p><p>What surprised her even more than the unlocked door was the total and complete wall of darkness that greeted her on the other side. The place was black as pitch. She felt the wall for a light switch, found one and flipped it on.</p><p>But illuminated, the room was almost as grim as it had been in the dark. There was a bed, perfectly made not a wrinkle or rumple in it. A dresser and matching stand flanked it, but aside from that, the room was empty. It looked as rarely used as the guest room had. And the windows! There were only two in the entire bedroom, and they were covered so tightly that not a droplet of light could penetrate.</p><p>She moved closer to inspect the thick, velvet drapes of dark burgundy. Behind them were black curtain panels in a cotton woven more densely than any she'd seen. They were heavy and thick. And behind those were blue window shades that must have been custom fitted, pulled down tight.</p><p>She pulled the window shade out a just a little, to look beyond it. But the outside of the window was blocked, too, by shutters closed tight.</p><p>\"I guess he can't sleep with any light in the room,\" she muttered. Sighing, she carefully smoothed the layers of shade and fabric back into place and turned to go. But paused when she saw that he had left his brown satchel on the bed.</p><p>The one with the evidence of Tommy's murder I it, and the laptop computer, and...</p> <p>Licking her lips, she wondered suddenly if he had the evidence from the other murders in that bag, as well. She glanced around almost guiltily, but that was silly. She was doing nothing wrong. Surely she sad as much right to peruse those files as Michael did. More even. Nodding hard, she snatched the satchel from the bed and darted from the room with it.</p><p>She chose to work in the little kitchen, because its sunny front window looked right out on the driveway, so she would see him if he came back. She could also see the back doors and the steps to the beach from here. If she was careful, she would see his approach and be able to shove the files back in the case, dash to his room toss it on the bed and get back out before he opened the door.</p><p>As an afterthought, she turned the dead-bolt locks on both doors, just in case. Finally she extracted manila file folders from the bag and began to explore the records inside. Beginning with the one marked Samantha Carlson.</p><p>Before lone she wished she hadn't snooped Hell, she was fine reading the reports. The police report said the woman's body had been found by fisherman in a New Jersey river, just as Michael had told her. But the police had found photographs, as well, taken by the killer and left behind at the woman's apartment. There were several snapshots, the instant kind, and she flipped through them one by one, growing colder and sicker with every shot.</p><p>The woman was nude, her body marred by stab wounds that the coroner said had not been the cause of death. She'd been bound at the ankles and suspended by the from a light fixture. Her throat was deeply cut, and a pool of blood covered the floor beneath her.</p><p>She'd been stabbed numerous times, then strung up and finally her throat had been cut. Her arms were free and probably had never been bund. Mary guessed that from the close-up shot of the arms and hands, covered with blood, probably because the woman had tried to keep the precious fluid from escaping as she'd hung upside down and bled to death.</p><p>So that was how he killed them. And that was why Michael hadn't wanted her to know.</p><p>She finally found the ability to move again and returned to the written report. It claimed the woman had been stabbed numerous times, either in an effort to subdue her or from a desire to torture her. The killer apparently knew where he could drive the blade without causing immediately fatal injuries. The killer had some sick reason for wanting to keep the victims alive until they bled out.</p><p>She couldn't read any more. She closed the folder and returned everything to the brown bag. She glanced outside, seeing no sign of Michael, ad then carried the bag back to his room, placing it on the bed just where she'd found it. She was tiptoeing out of his room, pulling the door gently closed behind her, when a sound shot through her head like an arrow through her heart.</p><p>But it was only the ringing of her cell phone.</p><p>Sighing, she ran through the house to her temporary bedroom, rummaged in her bag while the phone rang again and again, and finally found the thing, yanked it out, her heart still pounding, and hit the answer button.</p><p>\"Mary McLean speaking.\"</p><p>\"Hi, Ms. McLean, this is Stormy from S.I.S. We've finished your background check, and I thought you should probably know about it as soon as possible.\"</p><p>\"What did you find?\"</p><p>The woman sighed. \"First, you should know that I contacted Officer Dunst and got the background on what's been going on with you. I told him nothing, just asked questions. Normally this isn't the kind of information I would pas on to a client I didn't know, but I think in your case, you need the fully story. Can you come out here I'd really rather tell you in person.\"</p><p>She glanced at the clock. \"I don't know. Where are you?\"</p><p>\"Two hours north of you, in Eaton. The address is on the card.\"</p><p>Mary shook her head. 'No. There's no way I can go that far and get back in time, and I really can't wait. I need to know now.\"</p><p>The woman hesitate but finally began talking again. \"All right. But this is going to be a lot to swallow over the phone, especially if you don't already know about... some of the things I'm going to tell you. Michael Gray was indeed an officer of in the Chicago Police Department, and he was indeed shot in the line of duty-by a member of the Capone gang in 1928.\"</p><p>\"Excuse me?\"</p><p>\"Officer Michael Gray, Chicago PD, has been dead for more than seventy years.\"</p><p>She shook her head. \"There's some kind of mistake. It was probably his father or grandfather, or someone else by the same name.\"</p><p>\"He's the only Michael Gray who ever worked there. But given human imperfection, I got my hands on a photo just to make sure. Do you have a fax?\"</p><p>\"No.\" She recalled the laptop. \"Uh, but there's a computer. Can you e-mail it to me?\"</p><p>\"Sure thing. What address?\"</p><p>She rattled off the address of her online account knowing that she could access it from Michael's computer, but hating the idea that she was going to have to go back to his room an boot the thing up. It was getting late. He would be home soon.</p><p>\"I'm sending it right now. Call me back if you want us to do anything further. But... Mary you should prepare yourself to face some things you probably never believed in.\"</p><p>\"Like what?\"</p><p>The woman on the other end sighed. \"Have you ever seen Michael during the day?\"</p><p>\"Well... no, but-\"</p><p>\"I didn't think so. Listen this is going to sound far-fetched. But, Mary, there's a chance that Michael Gray might be a vampire.\"</p><p>\"Vampire?\" She laughed, but the woman on the other end of the phone wasn't laughing, so her own died in her throat. \"You are joking right?\"</p><p>\"No. I know quite a few of them. They exist. And they're nothing like what most people think they are. They tend to be driven to protect people like you.\"</p><p>\"People like me?\"</p><p>\"It's got to do with your blood, Mary. Dunst told me you have the belladonna antigen. That's probably why he referred you to us in the first place.\"</p><p>She went cold inside, remembering how often Michael had mentioned that the antigen connected him to her. But surely this was complete and utter fantasy. Vampires? \"Okay, sure. Whatever you say. You just send me that photo. I think I can handle this myself from here.\"</p><p>\"Fine. If you change your mind-\"</p><p>\"I won't.\" She hung up the phone. Vampires. Good grief, the woman was insane. And yet, even though she knew there were no such things, she thought it a pretty sick coincidence that she'd never seen Michael during the day. And his odd reaction to her meal this morning. As if he'd had to force himself to eat it. An the way he could read her mind. And how quickly and silently he managed to move.</p><p>And the things he'd said about the antigen creating a bond between them...</p><p>Sighing, Mary forced the ridiculous notion from her mind and walked back through the house, peering outside, seeing no one. But it was dimming. It would be dark soon. He'd said he should be back by dark.</p><p>Just another coincidence?</p><p>Hell. She would just have to be quick.</p><p>She went to his room, took the computer out of its case, booted it up right there on his bed. Seconds ticked by while she waited for it to go through the motions. Then she clicked on the wireless Internet connection button, and the thing logged on immediately. As fast as her fingers could move, she typed in her online server an brought up her private e-mail account. Then she waited, drumming her fingers, staring at the mailbox icon, waiting, waiting... there! The little flag popped up. She quickly accessed the e-mail, clicked on the paperclip icon and watched as, line by line, a photograph revealed itself on the screen. Hair, the top of a forehead, eyebrows, and finally eyes and the bridge of a nose...</p><p>\"Oh, my God...\"</p><p>Line by line, his cheeks, his mouth, his chin. All of Michael's face stared at her from beneath a date policeman's hat. It was a photo ID, with his name and the date underneath. Michael Gray, born 5 February, 1899.</p><p>\"This can't be...\"</p><p>\"Mary? Hey, Mary, are you here?\" he called.</p><p>Mary stiffened and lifted her chin. And then his bedroom door opened, and he stood there, staring at her an at the computer. \"Mary what's going on?\"</p><p>Shaking her head slowly from side to side, she said, \"I don't know. But I think it's time you told me. Don't you?\"</p><p>\"I don't under-\"</p><p>He stopped speaking as she turned the computer to face him, so he could see his own face filling the screen.</p><p>He didn't know what to say, what to do. If she could only have controlled her curiosity for one more day. But God, they couldn't deal with all of this-not tonight of all nights. Tonight was the full moon. If she ran from him now...</p><p>\"I can ex-\"</p><p>\"How?\"</p><p>He pursed his lips, shook his head. \"All right. Look, I really didn't want to get into this so soon. Hell I didn't want to get into it at all. I don't want to scare you away from me, Mary. I'm not evil. I'm only trying to protect you. You have to believe that.\"</p><p>She got up off the bed, backing up a few steps. He felt as if he were reliving his worst nightmare. \"So is that you in the photo?\"</p><p>He hesitated. \"Mary, I'll tell you every thing but first-tell me where you put the gun I gave you.\"</p><p>She frowned, \"Michael, what the hell does that have to do-\"</p><p>\"Please. Deep down, you trust me. You know me. Just answer the question.\"</p><p>She licked her lips. He knew she was afraid of him, yes, but she trusted him, too. \"It's in the guest room, next to my bed.\"</p><p>\"You swear?\" He broke his promise, probe her mind to be sure she was telling the truth.</p><p>\"Yes. Now you answer my question. I that you in the picture?\"</p><p>\"Yes.\"</p><p>\"Then you're more than a hundred years old?\"</p><p>He nodded.</p><p>\"How can that me, Michael? You don't look a day over thirty.\"</p><p>\"I shouldn't look a day over twenty-nine. That's how old I was when I was shot.\"</p><p>\"By a member of the Capone gang?\"</p><p>He closed his eyes. \"There were two gangs doing the shooting. I got in between them.\"</p><p>He watched her face carefully. There was no sign of panic. No hint of hysteria he'd seen in Sally's face that night. So far.</p><p>\"Michael, I just got off the phone with some detective agency that told me you might be a... a... God, I can't even say it.\"</p><p>\"Say it,\" he told her.</p><p>She held his eyes with hers. \"She said you might be a vampire. Is that what you are, Michael?\"</p><p>He chose his words with extreme care. \"Mary, I'll tell you exactly what I am. I'm the man you see in front of you, the one who's been with you for days now, protecting you from a killer. I'm the an you know inside and out. Nothing about me is different from what you already know. But there are some things about me that you don't know yet. Things that are unique. The don't make me a freak or a monster or a demon. I'm still me.\"</p><p>She nodded slowly. \"Go on.\"</p><p>She wasn't losing it, not yet. \"I don't age. If I go out in sunlight, I'll burst into flames. And in order to keep from going stark raving mad or dying of slow starvation, I have to feed on blood. But I don't kill. I never kill. I have never taken a human life. Never.\"</p><p>She stared at him, then at the door behind him.</p><p>\"I didn't want to tell you this, Mary. I didn't want to see the fear in your eyes the way I'm seeing it now. I'm not evil. I'm not a monster.\"</p><p>\"No, of course not,\" she said. But in her min she was thinking she had to get away from him. That she couldn't think straight around him, that this was just too much to understand all at once. Humor him, she thought. Just keep him calm and get the hell out of here. He heard it all.</p><p>\"I'm trying to protect you. That's all I'm trying to do.\"</p><p>\"And I'm... so grateful\" She was only a few feet from the door. He was still by the bed. She was going to lunge fast to get past him.</p><p>He lowered his head, sighed, and let her see her chance while he wasn't looking at her. She ran for the door, but he moved, too, a burst of speed so fast that she collided with his chest.</p><p>\"What? How did you...?\"</p><p>He put his hands on her shoulders, steadying her and also preventing her from backing away. Her mind was reeling, telling her there was no way he could be there. He hadn't moved.</p><p>\"Everything I magnified in my kind, Mary. Speed and agility, physical strength and stamina, and all the senses.</p><p>She shook her head firmly. \"No. I don't believe it. I won't believe it.\"</p><p>\"What's the alternative, Mary? That I'm insane? Some kind of deluded madman? Have I done anything up to now to make you question my sanity?\"</p><p>\"Please, let me go. Just let me go, Michael.\"</p><p>Sighing, his heart breaking, he closed his eyes. \"I can't let you go. It's the full moon. He's out there.\"</p><p>Great, she thought, so now she had to choose between taking her chances with maniac or facing a killer. Unless...</p><p>\"Don't. Don't even think it. You know I'm not a murderer.\"</p><p>\"How? How could I possibly know that, Michael?\" She was shivering now. The fear in her eyes, the hurt an confusion he felt beaming from them, was so real. And so was the caring. She felt so much for him-he could see it clearly in her eyes, in her mind. She didn't know why or how, but he cared about him. Deeply. Even now, after what he had confessed.</p><p>\"I know,\" he whispered. \"I know, Mary It's the same for me.\"</p><p>She lowered her head. \"Stop invading my mind!\"</p><p>\"Shhhh.\" His hand cupped her cheek, turned her face up to his, and kissed her. His mouth covered hers, moving, caressing with his lips.</p><p>Heat pooled in his groin when her arms slid around his neck. He wrapped his around her waist, pulling her tight against his body, and his tongue parted her lips and explored her mouth. She tasted so good. His hips moved against her, and hers moved in reply. He burned for her, and though it made no sense to her, she wasn't even bothering to deny that she burned for him as well. She wanted him, and she didn't care what he was. His heart soared with that knowledge.</p><p>His hands cupped her buttocks, holding her even closer. Then he slid one hand up her back, beneath the blouse she wore, skimming her back. No bra strap blocked its path-she wasn't wearing one.</p><p>He pushed her legs with his own walking her backward until she hit the bed. He lowered her onto it, breaking the kiss while his hands pushed her blouse up over her head and flung it aside. The laptop slipped off the other side, hitting the floor, and he didn't even look up. His attention was on her breast He bent to nurse at one and used his fingers to attend to the other. She lay there, writhing in response this sucking, the gentle nips and pinches that he made steadily less playful, steadily more forceful. She was moving her head now, from side to side on the mattress. Her body was hot, on fire. He caught her hands in his, then lifted his head away, pressing her hands to her breasts, guiding her fingers to her own nipples, and pressing tighter and tighter until she whimpered. Then he slid lower, his mouth working it's way over her waist and belly, this tongue dipping into her navel. He unfastened her jeans and tugged the off. Then he pulled off her panties, as well; his hands parted her thighs, and he kissed her there.</p><p>\"Michael,\" she whispered.</p><p>\"Shhh. Let me make you scream.\" He pressed her wide open with his thumbs and kissed her again. And then his tongue slider her, teasingly, easily, before finally driving inside. He ravaged her with his mouth, tongue, teeth, driving her to the edge of ecstasy-an then he rose up over her again, naked, though she had no memory of him undressing, and he lowered himself atop her while his hands guided her knees apart. He slid into her, and a shudder moved through her from head to toe.</p><p>She locked her legs around his hips, arms around his shoulders. Her hands ran over his back, and he shivered at her touch. She was beautiful, and wonderful, and she was his. A fierce sense of possession overwhelmed him as he drove her higher. Her nails sank into his flesh as if se would never let him get up. She wanted him, all of him, something more than this physical joining. She told him so with her mind, with her body. It was a primal need, one that was foreign to her. She could no more identify it than prevent the flood of her climax from washing over her. He could identify it though. He knew what she wanted. It was the same primal instinctive urge that made her arch beneath him, tip her chin straight up and press his head to her throat. And he answered, parting his mouth over the skin there, biting down.</p><p>The stab of pain was brief, the ecstasy that followed blinding both of them as he tasted her life and her essence, taking it into him, making them one.</p><p>When her mind returned from the stratosphere and her body finally stopped shuddering with aftershocks, Mary found herself lying naked in Michael's bed, held in his arms, her head pillowed by his shoulder and chest, while one of his hands rubbed lazy circles over her back. Gradually she realized he was speaking to her, his voice soft and somewhat coarse.</p><p>\"I'll never hurt you No one else will, either, I promise you that. I'll die before I'll let anyone harm you. Know that, Mary. You have to know that.\"</p><p>She blinked slowly out of her state of bliss and careful stock. She was in bed with Michael. He had just confessed to being a vampire, a theory that both the investigation agency and the local cop had apparently found to be perfectly believable. He could move so fast that her eyes couldn't follow the progress. He could read her mind. And she thought he might have bitten her neck.</p><p>Frowning, she lift a hand to touch her neck. She felt two tender spots in her skin.</p><p>Was it possible, she wondered, that she had just had sex with a vampire? Did she even care? She loved this man.</p><p>He was still talking, rubbing her and whispering assurances of his devotion. \"I knew the blood, the antigen, connected us, but it's more than that. I swear it's more than that. I've never felt this drawn to anyone. Not ever. Belladonna antigen or not.\"</p><p>She blinked and lifted her head. \"Michael, explain to me how this... this antigen connects me to you.\"</p><p>He met her eyes, his own seeming disappointed. And no wonder. She hadn't exactly responded to his pillow talk in kind. And he must be honoring her request that he stop reading her thoughts again, or he would have known what she was thinking. It was odd, but she was getting to the point where she could sense him when he was probing around inside her mind; it was almost visceral. But she didn't feel it then.</p><p>\"Every vampire was once a mortal with the belladonna antigen,\" he told her.</p><p>She frowned. \"So a person without the antigen...?\"</p><p>\"Can never become a vampire. Those with it have the choice. I was given that choice as I lay dying in a hospital bed, riddled with bullets, all those years ago. I chose life.\"</p><p>'And... how does one become a vampire?\"</p><p>He stroked her hair away from her face. \"Another vampire has to transform you. He would first drain the blood, and then-\"</p><p>\"Drain the blood,\" she repeated, going cold all over.</p><p>\"It isn't as frightening as it sounds.\"</p><p>\"Perhaps not, but it was exactly the way the other women, all of whom shared the antigen, had been killed. By being drained of their blood. God, she felt as if she were being torn in half. How could she be so in love with him and yet so afraid of him? His power made him dangerous. But not to her. God, he could never be a danger to her.</p><p>\"You shouldn't think about that, Mary. It's not something you need to even consider. Not now. You're strong, healthy. You will be for a long time yet.\"</p><p>\"I hope you're right about that.\"</p><p>\"I intend to make sure of it. It's the first night of the full moon,\" he told her. \"And I plan to hold you close in my arms, safe and protected, until sunrise.\"</p><p>There was nothing she could do-and nothing she wanted to do more than spend the night in his arms. Her questions could wait.</p><p>She relaxed in his arms. And it felt so good, so safe and so perfect there, that she couldn't believe there could be any wrong in it. Being with Michael felt like being reunited with some part of herself that had been missing all her life.</p><p>The made love again. Then she needed a food break, and he admitted that he couldn't digest solid food, and that her breakfast had made him violently ill. That he'd forced himself to eat it, knowing how he would suffer, touched her deeply. No matter what else he was, Mary believed that his feelings for her were very real.</p><p>Then spent the entire night talking, laughing, making love.</p><p>And then, finally, he rose and pulled on his clothes as he walked to the front door, gazed out the window.</p><p>She stood behind him her hands sliding over his shoulders. Why couldn't he be an ordinary man? Why/</p><p>\"I have to leave you, my love. It will be dawn very soon.\"</p><p>\"Why can't you stay here?\"</p><p>He lowered his eyes. \"I-I can't. I don't want you to see me as I am when I sleep.\"</p><p>She decided not to argue, although she wanted to 'All right.\"</p><p>He turned wrapped her up in his arms and kissed her deeply. \"You don't know what it means to me, Mary, that you didn't run from me when I told you what I was. You can't know. Someday... someday I'll tell you. For now-just know that you have restored he pieces of a heart that was shattered. No one else could have done that, but you did.</p><p>Tears. There were tears welling up in his eyes. Swimming there, not spilling over-he had too much will to let them spill, she thought.</p><p>He stroked her hair. \"Will you still be here when I come back?\"</p><p>She nodded, looking him straight in the eyes. \"I will. I promise you, Michael, I will. I don't understand any of this, but I want to. And I'm not afraid of you. No matter what you are.\"</p><p>He averted his eye, blinking rapidly. \"Lock the door behind me.\" He glanced up at the sky. It was paling already. And yet he waited.</p><p>She knew he was delaying the moment when he would have to leave, to protect her right until he simply couldn't do it any longer. And finally, jut as the first ways of sun lit the sky, he kissed her once more, then opened the door and left at a brisk jog.</p><p>Mary watched as he crossed the road and vanished into the copse of woods just beyond. She tried to bank her curiosity, but she couldn't. She didn't fear him, didn't want to run from him. But she had to know. She had to know all of it.</p><p>He was long gone, of course, by the time she entered the woods. She already knew how fast he could move. It was no surprise. The woods were till dark; the early shafts of dawn didn't penetrate them. The warmth did, and as the dew-damp ground warmed, it released its moisture in the form of mists that rose from the ground, and swirled around her feet and ankles. There was a path. Difficult to see beyond the writhing silver mists, but there nonetheless.</p><p>Mary followed it. It meandered through the woodlot, then ended abruptly at a wide-open field that as dotted with shapes hiding in the food. Too short to be trees. Perhaps shrubs of some kind. A sound drew her attention, like a door closing, and she whirled toward it but saw only the shape of what appeared to be a miniature house among the shadowy shapes.</p><p>Then she squinted as one shape seemed to come clearer. It had wings. Angel's wings. She moved closer, then went stock-still as the rays of the sun burned through the mist and it thinned, and she saw the stones all around her. Tombstones. Monuments. A stone angel. And the little house? The little house was a crypt.</p><p>She was standing in the middle of a cemetery. And unless she was very mistaken, her loved had just entered one of the crypts and closed the door behind him. Swallowing the urge to turn and run, she reminded herself that this was Michael, her Michael. She had to know where he spent his days.</p><p>She forced her feet to carry her closer... closer... to the crypt from whence the noise had come.</p><p>And then she stood right before it, staring up at the name engraved at the top. M I C H A E L G R A Y. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mary called ahead, then drove two hours to get to S.I.S., the investigations agency. She had expected an office I a building in a town. The place at which she arrived was none of those things. It was a huge Victorian manor, recently renovated and stunning.</p><p>The supernatural investigations racket must be a lucrative one, Mary thought, as she drove Michael's Jag into the driveway and brought it to a stop.</p><p>And then she sat there for a couple of minutes, doing what she'd been doing during the entire drive. Wondering if she had lost her mind.</p><p>When a person tells you he is a vampire, you should run away. Any sane person would have spent the day putting as many miles between herself and Michael Gray as humanly possible. But no. She must not be sane, because she was up here on a fact-finding mission instead. And she knew exactly what kinds of facts she was hoping to find: facts that would tell her that it was going to be okay. That there could be some kind of future with Michael. That he'd told her everything now; there were no more secrets he was keeping for her. She wanted validation. She wanted to know everything about him.</p> <p>Yes, she'd been thrown for a loop by what he claimed to be, and by seeing him a crypt with his name on it. And yes, she was scared to death by everything that had happened over the past few days. Not of Michael. Never of Michael. Nothing else that had happened was powerful enough to override the feelings that had been steadily growing inside her from the first time he'd walked into The Crypt.</p><p>Last night those feelings had filled her to overflowing. They made her fears and her rational mind tiny by comparison. She didn't want to run away from him. She wanted to stay. Maybe forever.</p><p>As she sat there, mulling all that over, the front door opened and a woman with short blond hair and a diamond stud in her nose stepped out onto the front porch, crossed her arms over her chest and tilted her head to one side.</p><p>Mary shut the car off and got out.</p><p>\"Nice wheels,\" the woman said. \"I'm Stormy. You must be Mary.\"</p> <p>Mary nodded and walked up the steps to shake her hand. \"Good to finally meet you.\"</p><p>\"You look like hell. You okay?\"</p><p>She ran her handover her neck, where Michael's teeth had pierce her skin. It still tingled there. \"I'm not sure. I think I was bitten by a vampire lat night, but I have no idea what that means.\"</p><p>Stormy held her gaze. \"Well, you're still alive, so I'm guessing it means you had a damn good night. Lemme see.\" She pushed Mary's hand aside and peered at her neck. \"Hell, I can't be sure. The punctures heal the minute the sunlight hits them, but sometimes there's a tiny pink spot that gives it away.\" She squinted and leaned closer. \"Yeah, there's still a trace.\"</p><p>Mary closed her eyes. The woman was as matter-of-fact as if she were talking about the weather. \"Then...?\"</p><p>Story smiled at her. \"You really don't know anything about any of this, do you?\"</p> <p>Mary shook her head.</p><p>\"Come on come inside and sit down. I'll fix you some tea. Max and Lou will be here any minute.\" She took Mary's arm and led her inside.</p><p>The foyer was spectacular. It took Mary's breath away, with the crystal chandelier, the antique furniture and the stunning staircase leading up to the second floor.</p><p>\"We live in the main part of the house. The library serves as our office. Come on, it's right through here..\"</p><p>She led Mary through a set of double doors and into a library. The room contained two desks. One was neat shiny, nothing but a computer on top. The other held a computer but strewn with file folders and papers and coffee rings, and had a miniature of the Conspiracy Theory movie poster taped to one side. There was a gas fireplace along one wall and comfy-looking leather chairs, a settee and rows and rows and more rows of books lining the walls.</p><p>\"Have a seat. I'll get the tea. And relax. You're not going to grow fangs or anything fro one vamp bite. All right?\"</p><p>She couldn't believe the amount of relief that rushed through her at those words the reassurance. God, to think she had actually been worried about something as far-fetched as-hell, everything she'd ever believed to be real and normal and ordinary had been turned inside out in the past few days. She didn't suppose anything was ridiculous at this point.</p><p>Story left her in the library, closing the doors behind her. Mary started toward a chair, as instructed, but paused, drawn to the bookshelves as she noticed the titles on some of the spines. The Kybalion, The Tibetan Book of the Dead, The Key of Solomon the King...</p> <p>Every book on the shelf had some mystical title, and many appeared to be extremely old. There were illuminated manuscripts from medieval times, for heaven's sakes.</p><p>\"I see you appreciate our collection,\" a woman's voice said.</p><p>Mary turned to see her standing in the open doorway. She was petite, with short copper hair and huge green eyes. She reminded Mary of an imp or a wood sprite. She was standing beside a man who wore dress pants and a white shirt that seemed baggy on him. He was older than she was and had a tried look about him. Stormy walked in behind them and closed the doors.</p><p>\"Mary McLean, meet Maxine Stuart and Lou Malone. The three of use are Supernatural Investigation Services. Officially, at least.\"</p><p>\"Officially?\"</p><p>\"Maxine smiled, coming forward, extending a hand. \"Yeah. Unofficially we have a couple of silent but extremely helpful partners. Call me Max.\"</p><p>Mary shook her hand. \"These books are incredible,\" she said.</p><p>\"Thanks. There's a lot of incredible and accurate information in those books, stuff we need in this business. But you have to wade through a lot of superstitious bull and religious dogma to find it.\"</p><p>Mary didn't know whether to laugh or not.</p><p>\"Have a seat,\" Lou said, \"and let's hear what's been going on.\" He nodded her toward one of the leather chairs, so she took it. Story handed her a cup of steaming tea and sat down on the settee, while Maxine went behind the messy desk with the movie poster on it and sat there, booting up her computer. Lou took the remaining leather chair.</p><p>\"I hardly know where to begin,\" Mary said.</p><p>\"Start at the beginning,\" the man said. He had a gentle, easy way about him that made her feel both comfortable and safe.</p><p>\"All right.\"</p><p>So Mary sipped her tea and told them everything from the very beginning. She told them abut the phone calls an the break-in, about reporting both to the police. She told them about Michael, how he'd just started showing up at The Crypt, watching her, until he'd finally asked for a ride home so he could warn her that her stalker was a serial killer an that she was next on his hit list. And then she told them about Tommy's murder, the police suspecting her, and her going to Michael's place. And that was where she stopped.</p><p>Maxine, who'd been clicking computer keys intermittently throughout the tale, and Lou, who had been patient and silent, both looked at her waiting. She didn't say anything until Stormy prompted her.</p><p>\"What happened last night, Mary? After I e-mailed you the photo of the cop named Michael Gray who was killed in Chicago seventy-some years ago?\"</p><p>Mary sighed, licked her lips. She drank the last swallow of tea from the cup. 'He walked in while I was looking at the photo. So I showed him, and I asked him to explain.\"</p><p>\"And?\"</p><p>She lowered her head, shaking it slowly. \"He told me he was... a vampire.\" Unable to remain sitting, she got to her feet, paced a few steps, turned and paced back. \"I don't know what the hell happened after that. My logical mind told me I should run, and yet I didn't. I didn't want to I'm not afraid of him. I've got all these feelings for this guy that don't make any sense at all. He says it's partly because of my blood... something about the antigen, but it sounds like science fiction to me. But he says there's more. And, I don't know... He kissed me, and the next thing I knew, we were-I just...\" She stopped pacing, pushed a hand through her hair. \"We spent the night in bed together. And he...\"</p><p>\"He drank from her,\" Stormy filled in. \"Not much, obviously. She's not even pale. Probably just got a little carried away in the height of... well, you know how it is with vamps.\"</p><p>\"Hot-blooded little suckers, every last one of them,\" Maxine said with a wink and a grin at her own bad pun. \"So what happened this morning? You guys resolve anything?\"</p><p>She shook her head. \"He reminded me tonight's the full moon. That's when this killer usually hits, and even though Tommy's dead and al evidence points to him, Michael says he can still sense danger around me. He made me promise to be there when he returned. And I did. And then he left.\" She looked at her feet. \"I followed him. He went to a cemetery, into a crypt, I think. It has his name across the top.\" She hugged herself and shivered.</p><p>\"It's not as creepy as it sounds, Mary,\" Maxine said. \"I mean, some of them have the insides of those things fixed up nicer than a deluxe suite at the Ritz.\"</p><p>She looked up slowly.</p><p>Lou said, \"You have to understand, they need to be careful. There are people who hunt them like animals. And God knows, if there existence ever became common knowledge, there would be no peace for them.\"</p><p>\"All they want,\" Stormy said, \"Is to live their lives in peace. They aren't murderous maniacs, the way pop culture depicts them. They're just people. Just like us, with a few notable differences.\"</p><p>She had gazed at each of them in turn. They were speaking so casually about something that, until very recently she hadn't even believed in. Her knees went weak, and she bent them, landing in the chair behind her. \"You're telling me this isn't a unique situation here? Vampires are so common that you people know all about them?\"</p><p>They nodded, all three of them. Maxine turned her computer monitor toward Mary. \"And so is the string of murders Michael's been telling you about. We've been following them ourselves. All the victims had the belladonna antigen. You have it, too so his concern for your safety is valid.\"</p><p>Mary nodded, letting all her breath escape her at once. \"I was so hoping you'd tell me just the opposite. I mean, I believe Michael. I've believed him all along. But it would be nice if someone could tell me he was overreacting-that I was never really in danger.\"</p><p>\"Sorry about that.\"</p><p>Drawing a breath, Mary squared her shoulders. \"Can you explain to me a little more about this... antigen in my blood? And the bond Michael says it creates between us?\"</p><p>Nodding, Max glanced at Lou. He cleared his throat. \"First, hon, let me just tell you that in all honesty, five years ago, I thought this was the most far-fetched pile of horse manure anyone had ever tried to dump on me. But I've seen the proof. I know it's true. It's a lot to digest all at once, but it's for real. It's important you not get hung up too that part of it, because you need to get by it in order to make much sense of the rest.\"</p><p>\"I'm trying, believe me.\"</p><p>He smiled at her, reached across the space between them and patted her hand where it rested on the arm of her chair. \"Some people have the belladonna antigen. It's a rare one. And those who have it have a few things in common. For one thing, they tend to bleed a lot when cut. Some to the point of hemophilia, but others not quite so bad as that. It's tough to find blood donors when they do, because so few people have the antigen.\"</p><p>She nodded \"And what else?\"</p><p>He lifted his brows.</p><p>\"You said that was one of the few things we have in common. What are the others?\"</p><p>He sent a look toward Maxine. She pursed her lips, moved her head almost imperceptibly from side to side. They were keeping something from her; she knew it then. Why so many secrets?</p><p>\"Well, there's really a lot more than we can cover here today,\" Lou said. \"But the main thing you need to know right now is this. The only people who can become vampires are people with the antigen.\"</p><p>\"The Chosen,\" she whispered.</p><p>\"Yeah. That's what the vamps call them. They know who has the antigen and who doesn't. They sense it somehow, and they have this instinctual urge to protect them. Some of them fight it, some embrace it, but its extremely difficult for them to ignore. For a vampire to harm one of The Chosen is a rarity. It's almost impossible for them. I've only heard of one or two cases of it, and those both involved vamps with obvious mental illnesses.\"</p><p>\"That means it's highly unlikely Michael could be the killer,\" Maxine said.</p><p>\"Unlikely, hell,\" Lou added. \"It's all but impossible.</p><p>Mary nodded. \"I know that about him, but it's good to have something more solid than my own feelings to base it on.</p><p>Max got up from behind the desk. \"There's some lore that suggests each vampire will feel a bond with one of The Chosen more powerfully than with any other. It's suppose to hold true even if that person has been transformed before the two meet. The antigen remains of course. I don't know if it's true. I think it was with Dante and Morgan, though. I've never seen anything like the power of the bond between the two of them.\"</p><p>\"Dante and Morgan?\" Mary asked.</p><p>\"My sister and her husband. Our silent partners in the business. Hadn't you guessed by now? They're vampires.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Vampires. Maxine Stuart's own twin sister-the award-winning, supposedly deceased screenwriter everyone had been talking about a few years back-was alive and well. Or undead and well.</p><p>And according to Max, vampires were very well depicted in her sister's films. They were not Stoker's murderous monsters or Whedon's soulless demons. They weren't even immortal. Not really. They could die by several methods, including incineration, blood and starvation. But they did have souls, feelings, and they were fully capable of every so-called human emotion.</p><p>Mary got so caught up in learning everything about Michael what he was and what that meant, that she spent the entire day talking with Maxine, Lou and Stormy. They pulled out DVDs of Morgan DeSilva's vampire films, played them and narrated, answering Mary's questions while making judicious use of the pause function In between films, they told her tales of their own encounters with vampires in the five years since they'd first opened their agency. Mary lost track of how many times they told her their lives had been saved by one of the undead. They lamented that she couldn't meet Morgan and Dante to see for herself what they were like, but the couple were vacationing in Ireland, looking up one of Dante's oldest and dearest friends while they were there.</p><p>By the time she'd heard all they had to tell her, Mary was convinced that her instincts had been on target. There was no need for her to run away from Michael. There were issues the two of them would need to address. God, there were more challenges to this new relationship than she could even begin to think about now. But he was exactly what he'd told her he was, exactly what she had known in her heart he was all along. He was the man she loved.</p> <p>They were all in the comfortable living room, in that private section of the house now. The last video had ended, and the stories had wound down. Maxine had left the room briefly, and she returned now with a file folder in her hands which she offered to Mary. \"I think you should look at these records\" she said. \"This is just what's official. I have no way of knowing what he's done since he crossed over, but once I saw this stuff, I had no doubt about Michael Gray's character. I don't think you will, either. Not that you seem to anyway. But you said you wanted to know everything. Did you even know how he came to be shot?\"</p><p>Shaking her head slowly, Mary opened the folder, skimming its contents. It held commendations, testimonials and a 1928 newspaper report headlined, Death of a Hero.</p><p>\"There was a shootout between Capone's gang and a rival gang,\" Lou Malone said. And when she detected the catch in his voice, she remembered that he'd told her he had been a cop for twenty years before retiring and joining Maxine in this business.</p><p>Maxine sat down beside him, put a hand on his shoulder. It was a loving touch. He patted it with his own; a friendly gesture.</p><p>\"A seven-year-old kid, confused and scared by all noise, ran into the cross fire. Michael Gray ran out of a perfectly good covered position, into the storm of bullets, threw himself on the kid and acted as a human shield. The kid got nicked, nothing serious. Gray took nine bullets.</p> <p>He went silent then, his lips pressed tight.</p><p>\"A man like that doesn't turn bad,\" Stormy said. He changed, physically, from a dying mortal to a powerful vampire. But inside, he's still the same guy. The hero cop who died saving a little boy.\"</p><p>Maxine nodded. \"The official reports say that his wife, Sally, shot herself with Michael's service revolver the night after his death. I've been doing some digging, and rumor has it that he went to her after he was changed over. Told her what he was. She freaked out and blew herself away, right in front of him.\"</p><p>\"Oh, God.\" Mary had tears streaming from her eyes now. She reached out to clasp Stormy's hands. \"Thank you. Thank you all. I can't tell you how much you've helped me.\"</p><p>\"Glad to hear it,\" Stormy said. She glanced at her watch, then shook her head. \"We've been talking forever. Why don't you join us for dinner and then we'll-\"</p><p>\"What time is it?\" Mary asked. For the first tie she realized how long she must have been here, in the company of these people. Three movies, hours of conversation-and the sky beyond the windows was already growing dim. \"Oh, no.\"</p> <p>\"What's wrong?\"</p><p>\"I... I promised Michael I would be there when he came home tonight. If I'm not-he's going to think-\"</p><p>\"Look, we'll call him,\" Maxine began.</p><p>\"I have to go. I have to be there.\" She surged to her feet and ran for the door over the protests of the others. She couldn't bear the thought of Michael returning home an not finding her there. He would assume that, like his wife so long ago she couldn't deal with what he was. And it was the furthest thing from the truth.</p><p>Maxine looked at Lou as the Jag squealed out of the driveway and out of sight. \"She said the killer was dead. And Dunst agrees with that, right?\"</p><p>\"She also said Michael Gray sensed she was still in danger,\" Lou said, and he pursed his lips looking up at the sky. \"Moons gonna be full tonight.\"</p><p>\"You're right. We'd better follow her. But it's going to be damned tough to keep up with her, given what she's driving and the way she's driving it.\"</p><p>\"Then we'd better hurry.\"</p> <p>\"I'll try to reach Michael Gray,\" Stormy said, as Lou and Max ran to the car. \"I'll let him know what's going on, where she is, just in case.\"</p><p>Michael emerged from the crypt at sundown and crept through the cemetery as the darkness gathered, until he reached the woods at the rear. Once on the bath, out of sight, hidden by the trees an the night itself, he pushed for speed. But instead of feeling closer Mary with every step, he only felt an eerie, ever-growing sense of emptiness. He knew before he even saw the vacant spot in the driveway that she wasn't there.</p><p>Mary was gone. She'd taken his car, and she'd left him.</p><p>He wasn't even surprised. Gut-wrenchingly disappointed, but not surprised. He ran around to the rear of the house, down the slope to the beach and searching the shoreline as if he expected to find her out there. But he didn't find her, and he had known he wouldn't.</p><p>He hadn't sensed any doubts from her as she'd made love with him all through the night. He hadn't tasted her fear in her blood. She hadn't fallen apart, hadn't been driven insane to the point of taking her own life, the way his wife had when faced with the knowledge of what he had become. Foolishly he had let himself believe that wouldn't change when she had time to mull it over by the cold light of day. Obviously it had.</p><p>He stood there on the shore as the waves washed up over his feet and the self-pity washed up over his soul. But not for very long. As the upper curve of the huge, silver moon crested the horizon and its light trickled toward shore on the rippled mirror of the ocean, he stopped feeing sorry for himself immediately. The beam of moonlight pierced the veil of his pain with the shattering reminder that tonight might very well be the last night of Mary's life.</p><p>He didn't panic. He'd been a cop for too long to panic. Instead, he ran for the house while his mind sought order within chaos. Where the hell could she be? How the hell could he find her in time? He tried sensing her but she was either too far away or entirely closed off from him due to fear or revulsion or both.</p><p>A phone was ringing when he entered the beach house. And it wasn't his. It took him three full rings to realize it was her cell. Dammit, she'd been so eager to get away from him that she'd left her phone behind. As well as all her other belongings, he noted as he surged into the gust room and snatched up the phone.</p><p>\"Mary?\"</p><p>\"No, I'm sorry,\" a man's voice said. \"Is this Michael Gray?\"</p><p>\"Yes, who is this?\"</p><p>\"This is Officer Dunst. I've been working Mary McLean's case and the Tommy Campbell murder. I just got off the phone with an investigator who's been working with Mary. And I told her I'd contact you right after I phoned Mary. Is she there?\"</p><p>Michael's head was spinning. \"No. She left the cell phone behind. I don't know where she is.\"</p><p>\"I might. Mr. Gray, Mary spent most of the day in Easton with those investigators, and now, if all is as it should be, she's on her way back...\"</p><p>So many questions shot through his mind. He managed to ask them one at a time. What investigators? Where were they located? What time had Mary left? Was she alone? He made rapid notes cutting the officer off every time he tried to interject anything extraneous. He had no time for narrative.</p><p>Once he knew Mary had left half an hour ago from a place two hours north on Route 1, he started to hang up the phone.</p><p>\"Wait, Mr. Gray. There's more. The reason I was calling in the first place.\"</p><p>\"Make it fast. I have to get to Mary.\"</p><p>\"The body we found in Tommy Campbell's apartment-it wasn't him. He apparently killed a vagrant, then burned the body to make us thing it was him. We also learned that Tommy had a twin sister who died in a car accident at the age of ten. She bled to death. They couldn't find a donor in time to save her. She had the antigen, Gray.\"</p><p>\"Tommy's still alive,\" Michael said softly. \"And he's after Mary.\"</p><p>\"I'm gonna take Route 9. You take Route 1. She could have gone either way.\"</p><p>Michael disconnected, walked rapidly from the house into the garage, hit the button to open the overhead door and swung one leg over the eat of his bike. Seconds later he was speeding through the night toward Mary.</p><p>And the moon kept on rising.</p><p>Mary drove the Jag for all it was worth, not an easy task on a highway that meandered through scenic areas and small towns and had posted speed limits all along the way. She never touched the break petal... not until she passed another car that was off the road sitting at a cockeyed angel with one door open. A person was lying in the road, and she just barely managed to swerve and miss him. Then she skidded to a stop on the roadside, slammed the Jag into Reverse and backed up to the accident.</p><p>She was reaching for her cell phone to dial 911 before she remembered that she'd left it at Michael's place. Hell. She got out and ran back to the victim. A young man, lying very still, face down.</p><p>Kneeling beside him, Mary touched his shoulders gently. \"Hey, hey, are you all right?\" No response, but he felt warm. She pressed her fingers to his neck and felt a pulse beating there, strong and steady. \"Come on, wake up now. You have to wake up.\" She knew better than to move him, but damn he was lying in the road. Another car could come along and...</p><p>He moaned and rolled very slowly onto his back.</p><p>\"Wait, maybe you shouldn't move just yet. Hold on now.\" Then she saw his face and felt the blood drain from hers. \"Tommy?\"</p><p>He smiled very slowly and punched her in the belly. Pain lanced her and she jerked backward, her hands going instinctively to her middle. Warm wetness coated them, and she looked down to see that he had a knife clutched in his fist. He hadn't punched her. He'd stabbed her.</p><p>\"T-Tommy? Why? God, why?\" She tried to get to her feet, stumbled, but managed to get upright. She managed two staggering steps towards Michael's Jag, and then he had her by the hair, pulling her backward as the blade plunged into her back.</p><p>A cry was driven from her lungs.</p><p>\"You should have checked in with the police today, Mary. They finished the autopsy-found out that the body they found in my bed wasn't even mine.\"</p><p>Pain racked her, and she fell to her knees again.</p><p>\"They had to wait for the autopsy or they would have told you that sooner. But it doesn't matter. I'll be in a new town, using a new name, by this time tomorrow.\"</p><p>He came around to stand in front of her, his knife, dripping wit blood, still in his hand. She forced her eyes upward, away from the blade, to his face. Beyond his head, she saw the full moon rising ever higher in the sky. \"Why Tommy? Just tell me why?\"</p><p>\"You mean your precious vampire lover hasn't told you by now? About the vampire hunters? People who dedicate their lives to eradicating his kind from the planet? No?\"</p><p>\"But... but I'm not... not a vampire.\"</p><p>He smiled. \"And you never will be. See, that's the beauty of doing it my way. I take your kind out before you can ever become like them. It's way more efficient.\"</p><p>'It's murder.\"</p><p>\"To hell it is. You aren't going to live much longer anyway. Most of you never live to see thirty.\" She frowned, shaking her head in confusion. \"What, he didn't tell you that, either? It's a handy little side effect of having the kind of blood you have, Mary. You get weak, you get sick and, unless they transform you, you die.\"</p><p>She closed her eyes. He crammed the knife into her shoulder, and her eyes flew open wide again with her scream.</p><p>\"I'll admit, you probably had a few more years in you. But what the hell, now or later, it doesn't make any difference. All that matters is that I prevent any more of them from being made. You oughtta thank me, Mary. I'm about to save your soul.\"</p><p>She was fading fast. He eyes fell closed again, and she thought of Michael, wished to God she had let him tell her his story instead rushing off to find out for herself. She loved him, and yet she'd given in to her need to know all. What hadn't she trusted her heart?</p><p>She knew what was coming next. She had read the autopsy reports on this man's other victims. He would stab her repeatedly, and then he would hang her by her feet and slit her throat while she was still alive, so that everyone one of blood would drain from her body.</p><p>\"Why do you hate them so?\" she managed.</p><p>\"Why? Because they could have saved my sister,\" he told her. \"But they didn't. Not one of them came around to help her when she needed it. If she couldn't live, then I'm gonna make damn sure none of you do.\"</p><p>He stabbed her again, in the side this time. She barely felt the pain, though. She was already losing consciousness, and she whispered a prayer of thanks for that. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Maxine pointed when she saw the two vehicles on the roadside. \"There! Over there!\"</p><p>Lou swung the car off the road behind the other cars, and was out and running forward, his gun in his hand, almost before Max got the words out. She was right behind him, and she saw what their headlights illuminated. A young man, spattered in blood, leaning over a woman who was soaked in it, typing a rope around her ankles. As she ran, she saw the other end of the room was looped over the low-hanging branch of a nearby tree.</p><p>\"Freeze, buddy, or you're history!\" Lou, when he was in cop mode, had a voice that carried as if helped along by a bullhorn. \"Back away from the lady.\"</p><p>The man, the killer, straightened. He had a knife in his hand as he took two steps backward; then he dropped it, turned and raced into the woods.</p> <p>\"Take care of Mary,\" Lou barked, and he raced off after him.</p><p>\"God, I hate when he does that.\" Max knelt beside Mary McLean. \"Ah, hell, look at this,\" she muttered, as she tore at the woman's blouse, trying to decide which hole to plug first. She'd already lost a great deal of blood. Max knew too well that there would probably be no donor close enough to help her. She ran to the car for the emergency first-aid kit she and Lou kept there. God knew they'd had to stop profuse bleeding enough tie to know what to do. Pressure bandages plenty of gauze. She punched 911 into her cell phone then cradled it between her shoulder and ear, so she could use her hands to keep working on Mary as she spoke. Stormy had phoned to tell her that Dunst and Michael Gray were on the way taking alternative routs. So Max told the 911 operator to let Officer Dunst know by radio what had happened and where. Then she hung up, despite the operator's insistent \"stay on the line,\" and tossed the phone aside.</p><p>Even as she worked, plugging one knife wound after another, Max was painfully aware that while she might stop the bleeding, she could do nothing about any internal injuries, much less replace the blood the woman had already lost. She kept looking up, search the dark woods for some signs of Lou and the killer. She didn't want her stubborn partner to be the bastard's next victim.</p><p>Then the sound of a motor drew her head up. A single headlight accompanied the sound, and by the time the motorcycle was close enough for her to make it out clearly, it was already skidding to a stop, crashing to its side as the rider leaped off and ran forward.</p><p>\"I hope to God you're Michael Gray,\" Maxine said as he ran forward.</p> <p>He proved he was by falling to his knees and shouting, \"My God, no! Mary!\"</p><p>Max gripped his shoulders hard, gave him a firm shake. \"She's lost a lot of blood, Michael. He didn't cut her throat, but there are a lot of stab wounds and we're miles from a hospital. I've called an ambulance, but they're half an hour out. I've done everything I can.'</p><p>He stare into Max's eyes for a dozen heartbeats, and she thought he read her meaning perfectly well. Then he pulled free of her hands and gathered Mary to his chest, bending over her stroking her hair.</p><p>\"My partner's gone after Tommy. I've gotta go back him up,\" Max said. \"This... this is up to you now. Do what you think is right.\"</p><p>Michael held Mary close to him, an he could feel the life ebbing slowly from her body. God, he didn't want to lose her.</p><p>\"Michael...\"</p> <p>Her whisper came warm against his neck. He eased her back a little, enough so he could see her face. God forbid she should be even more frightened at a time like this. But she might be afraid-of him. She'd felt from him, after all.</p><p>\"It's all right. I won't hurt you, Mary. I could never hurt you.\"</p><p>\"I know that.\" Weakly she lifted her hand to his cheek. \"It doesn't hurt anymore,\" she whispered. \"I think I'm dying, Michael.\"</p><p>\"Hold on. We've called an ambulance. Help is on the way.\" God, once again his revelation of what he was had driven a woman he loved to her death. He couldn't bare it.</p><p>Mary's eyelids fell closed, but she popped them open again. \"I have to tell you... to explain...\"</p><p>\"It's all right. Save your strength. You don't have to explain to me. I understand why you ran away.\"</p><p>She moved her head left, then right, and it seemed to take extreme effort. \"No. I wasn't... running away. I just... I had to know.\"</p><p>He frowned, not understanding.</p> <p>\"I had to understand... what you are. What it means.\" She paused seemed to force herself to breathe.</p><p>\"So you went to... those investigators?\" It hurt that she hadn't brought her questions to him. \"You could have asked me, Mary. I'd have told you anything. Anything you wanted to know.\"</p><p>'And I'd have believed anything you told me.\" She was battling to keep her eyes open, clinging to consciousness with sheer will. \"I had to talk to someone... someone I didn't love.\"</p><p>He closed his eyes in sheer anguish at her words. She loved him. My God, she loved him.</p><p>\"I lost track of time. But I was coming back to you, Michael. I was coming back...\"</p><p>Tears filled his eyes, blurring his vision, as he leaned closer, pressing his lips to hers. When he lifted his head away, he whispered \"I want to tell you that I love you, Mary. But those words don't begin to describe what I feel for you. It's beyond love-at least beyond what I thought love could be. It's a force more powerful than heaven and earth combined.\"</p><p>\"I know,\" she said. Her voice was weaker now. So weak he had to bend closer to hear her words. \"I feel it, too.\" She stopped there, breathing hard, as if even the mere whispered words were taking every bit of strength in her. \"The ambulance... won't get here in time, will it, Michael?\"</p><p>He could barely speak past the lump in his throat. \"No.\" And then he forced himself to go on. \"But I'm here. And, God help me, I don't want to let you go, Mary.\"</p><p>She stared into his eyes, her own fierce and determined, and with what had to be the last of her strength, she raised her head and forced out tow final words in the strongest voice she could manage. \"Then don't.\" Then her head fell back again, and her eyes closed.</p><p>Did she mean...? Oh, God, he couldn't be sure. Had the investigators explained this part to her? How could he commit this act without knowing for sure?</p><p>He was out of time. Mary was dying. Her heartbeat, which he could feel as if it were his own, began to skip and stutter. Her breathing stopped entirely.</p><p>He wasn't even certain he could save her at this point.</p><p>But he had to try.</p><p>The murderer's blade lay on the pavement near Mary's feet. Michael reached for it, took it, and made his decision. Using the tip, he pierced his own throat. And then he gathered Mary closer and pressed her lips to the tiny font. Closing his eyes, he willed her to swallow.</p><p>And finally, after what seemed an endless moment she did.</p><p>Her body went rigid in his arms, and her teeth clamped down on his kin in reaction to the jolt of power she tasted. And then she relaxed, and she drank.</p><p>Suddenly she pulled her head away, her eyes open wide. \"Oh, God, oh God, it hurts! Michael it hurts!\"</p><p>He held her against him. \"I know. I'm sorry, my love, I'm sorry. We feel everything so much more than mortals do. Including pain.\"</p><p>She cried out, her head arching backwards, the veins in her neck standing out. \"H-how long?\"</p><p>\"Until dawn. Only until dawn. Then you'll sleep, and you'll heal.\"</p><p>The woman, Maxine, and the man he assumed was her partner emerged from the forest while Mary writhed and whimpered in agony. The man held Tommy in a firm grip. Maxine hurried forward knelt beside Michael, her gaze going from him to Mary, who was grating her teeth against the pain.</p><p>\"Michael, we can help you. Both of you. Get the medical kit and bring it here.\"</p><p>Michael looked where she pointed, spotted the large white box on the pavement on the other side of Mary and fetched it as quickly as he could. \"I don't know what you can do for her,\" he said as he set the box beside Maxine. \"I... she...\"</p><p>\"She's one of you now. I can see that, Michael.\" She thrust a square bandage into his hand. \"Put that on the cut in your neck. It's still bleeding.'</p><p>He took it, did as she suggested and watched Maxine work. She pulled a cellophane-wrapped hypodermic needle fro the ox, tore off the wrapper and then pulled out a vial and inserted the needle into its end.</p><p>\"What is that? What are you doing?\"</p><p>She was intent on her work, tipping the bottle upside down, drawing the fluid into it. \"You ever heard of DPI, Michael?\"</p><p>He nodded. \"They used to hunt us,\" he said.</p><p>\"They also used you as guinea pigs. I got hold of some of their files several years ago. Their research has turned out to be damn useful. This stuff, for example.\" She pulled the needle from the vial, snapping her fingers against it a few times. \"It's a tranquilizer they developed to keep their prisoners sedated-the only one in existence that works on vampires. I'm going to give her a small dose. She'll rest easy until sunrise comes.\"</p><p>Michael looked from the woman to the man. Could he trust them?</p><p>Mary cried out, and he knew her pain was beyond endurance. \"All right,\" he said. \"Do it.\"</p><p>Maxine nodded and leaned over Mary, injecting her quickly and expertly. Immediately Mary's face eased. She relaxed her body, breathed a heavy sigh. \"Oh, thank you. Thank you,\" she whispered.</p><p>Maxine smiled as she stuck a Band-Aid over the injection site. \"You're going to sleep in a minutes. The next time you wake, you'll be fine. I promise. Okay?\"</p><p>\"Yes.\"</p><p>Max turned to Michael. \"Get her somewhere safe. Watch those wounds until morning. If they start bleeding again, we could still loose her.\"</p><p>\"I won't leave her for a minute.\"</p><p>\"We'll take the bike back to our place,\" she went on. \"You can pick it up tomorrow night. Mary knows where we are.\"</p><p>He nodded, more grateful than he could imagine. Then he glanced at the prisoner. \"What about Tommy?\"</p><p>\"Tommy's going to prison,\" Lou said. \"Or maybe the mental hospital. Either way he'll never see daylight again. Mary's a missing person now, and the police are on their way as we speak. Even without a body there's enough of Mary's blood here to convince them that she couldn't be alive. A lot of it is on Tommy-boy. It's not our fault if he refuses to tell us what he did with the body. He was stalking her, faked his own death. I've got no doubt further investigation will link him to the other murders, as well.</p><p>\"You can't do this,\" Tommy muttered. \"They can't live.\"</p><p>\"Yes, they can, pal,\" Maxine said. \"Happily ever after, if you ask me.\" She packed her med kit and loaded it into the car as Lou put Tommy into the back seat. Then she went back to the motorcycle stood it upright and climbed aboard. Lou pulled away with the car and the prisoner, and Max followed on the bike, riding it as if she knew how.</p><p>As gently as he could, Michael scooped Mary up into his arms and carried her towards the Jag.</p><p>\"I'll get your seats all bloody,\" she whispered. Her speech slurred, and she was fading fast-not into death like before, but only into sleep. Painless, restful sleep.</p><p>\"I don't care about the seats, Mary.\" He opened the door and eased her down on the passenger side then worked the control to lower the back of the seat, so she was reclining. \"How's that?\" he asked.</p><p>\"Mmm.\" She sighed. \"I feel so strange, Michael. Everything seems... different.\"</p><p>\"Everything is different.\" He ran a hand through her hair. \"You're different now. Do you understand that, Mary?\"</p><p>She nodded gently. \"It's what I wanted.\"</p><p>\"I wasn't sure.\"</p><p>Smiling very crookedly up at him, she said, \"I know. But I love you, Michael. And I'm not like she was... I don't want to die rather than accept something new and different. I want to live. I want to love you for as long as the universe will let me. Forever, if that's possible.\"</p><p>\"How did I ever find you?\" he whispered, awe making hi shake his head slowly. \"How did I ever get so lucky as to find you?\"</p><p>\"I don't think luck had anything to do with it\"</p><p>He kissed her, long, lingeringly. \"Sleep, my love. When you wake, I'm going to show you a whole new world.</p><p>She smiled gently and let her eyes fall closed. </p> </body></html>"]