["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>New Orleans, 2007</p><p>Nick Gautier was home.</p><p>And he was pissed. As the taxi wended its way from the airport in the mid-morning hour toward his Bourbon Street home, and he saw the scars that were still left by Hurritcane Katrina, his blood literally boiled.</p><p>How could this have happened? Closing his eyes, he tried to blot out the boarded-up windows and fallen signs. The white FEMA trailers. But those images were replaced by the news feeds he’d seen of victims stranded on rooftops, of fires burning, of rioting in the streets...</p> <p>Nick couldn’t breathe. New Orleans was his home. His touchstone. This city had birthed him. She was his lifeblood. And in one heartbeat, she’d been torn asunder. Crippled. Never in his life had he seen anything like this.</p><p>Growing up here, he’d lived through numerous hurricanes over the years. They hadn’t had the money to evacuate for the worst storms so he and his mom would get into her broken-down red Yugo and drive up to Hattiesburg, Mississippi, where they would camp out in a grocery store parking lot, eating deviled ham sandwiches made with stale bread and mustard packets, until it was safe to return. Somehow his mother had always made those days fun and adventurous, even when they were hunkered down in the car during tornado warnings.</p><p>Then they’d come home to a sight similar to what he saw now, but within a few weeks’ time, everything would be back to normal.</p><p>It was now going on two years after the hurricane and still there were closed businesses—businesses that had been there for years and, in some cases, centuries. There were entire areas of the city that looked as if the hurricane had just blown through.</p><p>Most of his friends were either dead or relocated. People he’d known for decades.</p> <p>In one heartbeat everything had changed.</p><p>Nick gave a bitter laugh at the thought. He’d changed more than anything else. No longer human, he wasn’t even sure what he was anymore.</p><p>The only thing that kept him going was his furious need for vengeance on the ones he blamed for this catastrophe.</p><p>He moved his hand to scratch his neck, then froze as he felt the bite mark there. By taking a blood exchange, Stryker had made Nick his agent. If Nick obeyed the Daimon lord, then Stryker would give him the means to destroy the man who’d ruined Nick’s life... and his town.</p><p>Acheron Parthenopaus. At one time, they had been best friends. Brothers to the end. Then Nick had made the mistake of sleeping with a woman he hadn’t known was Ash’s daughter. Ash had torn him apart over it.</p><p>That he could handle. What had made them enemies was the night Nick’s mother had died and Ash had allowed it. Unlike the other immortal beings who made New Orleans home, Nick knew the secrets that Ash carried. He wasn’t just the Dark-Hunter leader, an immortal warrior who served the goddess, Artemis, and protected mankind from the vampiric Daimons who ate their souls.</p> <p>Ash was a god. He had the power to do anything he wanted. He could have saved Nick’s mom or at least brought her back from the dead the way he’d saved Kyrian Hunter and his wife Amanda. But Ash hadn’t done that. He’d turned his back on Nick and left Cherise Gautier dead.</p><p>Nor had Ash saved this city from the storm. Up until the night Nick had slept with Simi, Ash had loved this city more than anything. Ash wouldn’t have allowed New Orleans to suffer.</p><p>But that was before they’d become enemies. Now Ash hated him so much that he’d taken everything from Nick.</p><p>Everything.</p><p>“Nice house.”</p><p>Nick paused as the driver’s voice interrupted his thoughts. He looked at the Bourbon Street mansion that had been his home since he’d started working for Kyrian.</p><p>“Yeah,” he said under his breath. “It is.”</p><p>Or at least it had been when he’d shared this place with his mother. Nick got out and paid the fee, then pulled his suitcase from the seat. Slamming the door shut, he looked up at his house and gripped the handle so tight that his fingers ached in protest.</p> <p>He’d bought this house as a birthday present for his mother when he’d been twenty. He could still hear her squeal of joy as he handed her the key. See her standing beside him as she stared at him in disbelief.</p><p>“Happy Birthday, Mom.”</p><p>“Oh Nicky, what have you done now? You didn’t go and kill someone, did you?”</p><p>Her question had appalled him. “Mom!”</p><p>Still, she’d been relentless as she narrowed her blue eyes on him and stood arms akimbo. “You ain’t doing none of that drug dealing either? ‘Cause if you are, boy, love or no love, I’ll beat you blue.”</p><p>He’d scoffed at her warning. “Mom, you know me better than that. I would never do anything to embarrass you in front of your church friends.”</p><p>“Then how you get all this money, chere? How you able to buy a house this fancy at your age? You still a baby and I couldn’t afford two bricks off this place.”</p><p>“I told you, I’m the personal assistant for a broker down in the Garden District. He put the house in my name, but technically he owns it. He’s letting me rent it from him.” It’d been a partial lie. Part of being Kyrian’s Squire back when Kyrian had been a Dark-Hunter had meant that all of Kyrian’s properties were owned by Nick—at least on paper. This house, though, really was Nick’s. His salary was such that he could have easily bought three houses like this, but his mother would never have believed that he could make that kind of money without breaking the law.</p><p>“Broker, hmmm. That sounds like one of those euphemisms for drug dealer to me.”</p><p>“Ah, Mom, c’mon inside and see the book room. I’ve already got your chair there so you can read those novels you love so much.”</p><p>“Baby, you spoil me. You know I don’t need nothing this big and fancy.”</p><p>Yeah, but as a kid, he’d heard her crying enough times in the late night hours that she couldn’t do better for him than their rundown rented room—that the only job she could find was stripping. “My baby deserves so much better than this.” Meanwhile her parents had lived in a nice home in Kenner and had money to burn. But they’d disowned her the minute she’d become pregnant with him. His mother had sacrificed everything to keep her son—her dignity and her future. And though she cried at night that she couldn’t give him the things she thought a boy should have, by day, she was the best mom anyone could have hoped for.</p><p>Since the day he was born, it had been the two of them against the world.</p><p>“You’ve always taken care of me, Mom. It’s my turn to take care of you. I got a big house ‘cause one day I’m going to give you enough grandkids to fill it full.”</p><p>Nick winced as he swore he heard her laughter on the wind before she’d dashed into the house to inspect it. And as he stood there, rain began pouring down on him, soaking him to the bone.</p><p>He’d found his mother dead in that chair in the library...</p><p>Unrelenting pain and grief tore through him with talons made of steel. They shredded every part of him.</p><p>How could she be gone and by such vicious means? Her throat had been ripped out and her body drained of blood. She was all he’d ever had.</p><p>“I can give you vengeance.”</p><p>It was Stryker’s promise to him. The Daimon lord had told him that if Nick gave him information against Acheron and the other Dark-Hunters and the Squires who served them, then Stryker would give him the power he needed to kill Ash.</p><p>It was all Nick wanted.</p><p>Then he heard Ash’s voice in his head. “You know, Nick, I envy you your mother. She’s one hell of a lady. There’s nothing I wouldn’t do for her.”</p><p>“Why did you let her die, Ash?” he snarled under his breath. “God damn you!” But in his heart, he knew who was really to blame for all of this and that hurt even more. If only he’d been a better son. A better friend. None of this would have happened.</p><p>He’d been the one who had signed on to this world where danger was an intrinsic part. Had he just told his mother the truth, then she wouldn’t have gone home that night with a Daimon. She would be safe. She was killed because of him and that was a truth that hurt to the deepest part of his being.</p><p>Unable to stand it, he forced himself to walk to the keypad on the gate and press the code. He half-expected it not to work, but it did.</p><p>He paused by the petunias his mother had planted in a large vase next to the backdoor and moved it over so that he could get the spare key.</p><p>Everything was just as it’d been when he’d been human... Only now everything was different. His stomach churning, he opened the door and stepped into his house.</p><p>His friend Kyl had told him that there had been some damage to the place during Katrina, but that the house had been restored. Nick had to give them credit, it was pristine. Nothing, other than the absence of his mother, was out of place.</p><p>“Oh, Nicky, look! It has one of them garbage disposals! I never thought I’d own something so fancy and look at them tiles on the wall. Is that Italian marble?”</p><p>He glanced to the right where the Italian marble bake center was. “Only the best for you, Mom.”</p><p>“Oh you spoil me, baby. You’re the only thing right I’ve ever done in my life. I don’t know why God was so good to me that He sent you down from heaven, but I’m glad He did.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But Nick Gautier wasn’t heaven-sent. Like the worthless bastard who’d fathered him and then run off, he was hell-born.</p><p>He set the suitcase down by the door and laid the key on the countertop. The last time he’d been here, he’d been calling out for his mother. Screaming her name as he ran through the house, trying to locate her.</p><p>He’d found her upstairs.</p> <p>Against his will, his feet took him right to the spot. He stood in the doorway, looking at his mother’s favorite chair. In his mind, he could see her lifeless body still there. But in reality, there was no trace of her death...</p><p>Or his own. Just before where he now stood, he’d called out to the Greek goddess Artemis to make him a Dark-Hunter. When she refused and told him he’d have to be dead first, he’d blown his brains out right in front of her.</p><p>Afraid of how Acheron would react to his death, Artemis had made him immortal and marked him with the Dark-Hunter bow-and-arrow brand on his face, but he wasn’t one of her army who protected mankind. He had powers greater than the others. He could walk in daylight.</p><p>And now he shared powers with Stryker...</p><p>Nick frowned as he saw a half-empty Coke bottle on the sidetable. His mother had never touched regular Coke, only Diet, and he would never have dared left a drink in her secret sanctum.</p> <p>Someone else had been in the house, and since there was an opened paper from today, he would say that someone had moved in and made themselves at home.</p><p>In his house.</p><p>Anger tore through him. Who would dare?</p><p>Wanting blood, he stormed through the rooms, but found each one empty with no sign of who had dared trespass here. “Fine,” he snarled. “I’ll deal with you later.”</p><p>First he wanted to visit his mom. He winced at the thought. He hadn’t been to the cemetery since his worthless father had died. Even though he’d passed the St. Louis cemetery almost every day, it just hadn’t been a place where he’d ever spent much time. It reminded him of his father and of the gang he once ran with. A gang that used to rob tourists who dared to enter the cemetery alone.</p><p>But he would go now to visit his mother. He hadn’t been there for the funeral. The least he could do now was let her know he still missed her.</p> <p>His heart heavy, he walked the few blocks that separated his house from Basin Street and walked through the stone entrance of the St. Louis Cemetery. The rains had already moved on as they often did in New Orleans. Now it was sticky and hot.</p><p>Since it was morning, the wrought-iron gates were open and chained back. As a Daimon and a Dark-Hunter, Nick shouldn’t have been allowed to walk in daylight, but a higher power had spared him that curse. Like Ash, he could walk in daylight, and unlike other Dark-Hunters, he could walk in a cemetery and not be possessed by the wandering souls that were trapped there.</p><p>Without pausing, he walked toward the Gautier family mausoleum. As he passed the raised tombs that had caused New Orleans cemeteries to be called the cities of the dead, he noted how many of them still bore traces of hurricane damage. Even Marie Laveau’s tomb wasn’t as colorful as it’d been before. Many of the tombs were missing names and stones.</p><p>Fear crept into him at what he’d find waiting for him at his mother’s resting place. But as he turned the corner toward his mother’s grave, he froze.</p><p>Menyara Chartier, a tiny, frail African American woman was sitting in front of the grave, talking in a whisper to his mother while she arranged bouquets of white lilies. The Voodoo High Priestess paused mid-sentence and turned her head as if she knew who would be there.</p><p>“Ni...” she frowned, catching herself from saying the rest of his name.</p><p>“Aunt Mennie,” he said, his voice catching as he closed the distance between them. She’d been the tenant in the room next to theirs where he’d grown up and she’d been the woman who had delivered him since his mother hadn’t been able to afford a hospital stay. Menyara had been the closest thing to family he and Cherise had known. “You’re still here.”</p><p>She rose slowly to her feet. At four feet ten, she shouldn’t have been intimidating to anyone above the age of five and yet there was something so powerful about her that it had never failed to quell him. Without thinking, he swept her up into his arms and held her close.</p> <p>“I knew you would return,” she breathed, before she kissed him on his branded cheek. “Your mother, she told me to watch for you.”</p><p>To anyone else, that comment might have seemed odd. But Menyara was a gifted clairvoyant. She knew things no one else did.</p><p>“I didn’t kill my mother,” he said as he set her down again. That had been the vicious rumor that had been going around.</p><p>She patted his arm. “I know, Ambrosius. I know.” She turned and indicated the tomb. “Every day I have come for you to let Cherise know she wasn’t alone.”</p><p>He looked down at the stacks of flowers that were arranged around the tomb and saw where a small group of black roses were blooming in a tiny patch of earth. “You bring her flowers?”</p><p>“No. I only arrange those the dark-haired man sends.”</p><p>Nick frowned. “Dark-haired man?”</p><p>“Your friend. Acheron. Whenever he’s in town, he comes and he visits too. And every day without fail, he sends over flowers for your mother to see.”</p><p>His blood ran cold. “He’s not my friend, Menyara.”</p><p>“You may not be his friend, Ambrosius, but he is yours.”</p><p>Yeah, right. Friends didn’t screw each other over the way Nick had been screwed by Ash. “You don’t know him. What he’s capable of.”</p><p>She shook her head at him. “Ah, but I do. Even better than you, I think. I know exactly who and what he is. I know exactly what he can do. And more to the point, I know what he cannot do. Or what he dare not do.” Her features softened as she touched his brand, but said nothing about its presence. “All your life, I have watched you. Your mama always say that you react without thought. You feel too deep. Mourn too great. But one day, Ambrosius, you will see that you and your friend are not so different. That there is much of you inside him.”</p><p>“You don’t know what you’re talking about. I don’t walk out on my friends, and I damn sure don’t hurt them.”</p><p>She indicated the flowers with a wave of her hand. “He didn’t walk out. He was here when the devil unleashed his wrath on us. Acheron saved my life and those of many others. He brought food to us when we had nothing to eat and kept your home from being burned. Don’t judge him by one bad act when he has done so many good ones.”</p><p>Nick didn’t want to forgive Ash. Not after all that had happened, but in spite of his anger, he felt his heart softening at the knowledge that Ash had been here—that he hadn’t abandoned the city. “Why are you calling me Ambrosius?”</p><p>“Because that is what you are now. Immortal.” She touched the bite mark on his neck. “My Nicky has gone. Buried by emotions so great they mock the depth of the ocean. Can you tell me if my boy will ever come home again?”</p><p>Nick wanted to curse at her. He wanted to shout, but in the end he felt like a lost child who only craved his mother’s touch. A deep-seated sob escaped, and before he could stop it, he did what he hadn’t done since the night he’d found his mother dead.</p><p>He cried. All he wanted was for the unrelenting pain inside him to stop. He wanted time to go back to the way it’d been before when his mother had been alive and Ash had been his friend.</p><p>But how could it? So much had changed...</p><p>Menyara pulled him into her arms and held him close. She didn’t speak. But her touch soothed him even more than words could.</p><p>She pressed her lips to the top of his head and gave a light kiss. “You were a good boy, Ambrosius. Cherise still believes in you and so do I. She say for you to let go of your anger. Be happy again.”</p><p>He pulled back with a curse at her words that reminded him of something his mother would say. “How can I let everything go while my mother is dead?”</p><p>“How can you not?” she insisted. “It was your mother’s time to leave this world. She is happier now that she can watch over you and—“</p><p>“Don’t say that to me,” he said from between clenched teeth. “I hate it when people say that shit. She’s not happier. How could she be?”</p><p>Menyara shook her head. “Then go from this place and don’t taint her peace with your hatred. It doesn’t belong here. Your mother deserves better than that from you.”</p><p>He opened his mouth to speak.</p><p>“I don’t want to hear it and neither does your poor mother, God rest her soul. You go on now and get out of here. Don’t come back until you get your head on straight and think of someone other than yourself. You hear me?”</p><p>Nick narrowed his eyes. He’d argue with her, but he knew her better than that. There was no talking to Menyara when she was in a mood like this.</p><p>Disgusted with the whole thing, he turned and left with no real destination in mind. He merely slinked off toward Conti. The streets were eerily familiar and at the same time they were so empty. This time of year, there should have been tons of tourists about. Shopkeepers should have been hosing off the balconies and streets. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Instead there were orange barrels and construction sites all around. The sound of jackhammers had replaced that of morning jazz and beeping horns. Pain infiltrated every particle of his body...</p><p>Until he crossed over to Acme Oyster House on Iberville. God, how many times had he eaten here? How many laughs and beers had he shared with his mother and friends?</p><p>It looked the same, only fresher from reconstruction. He stood beside the window, watching the waiters take orders and people chat, until his gaze fell to the table near the back.</p> <p>His heart stopped beating. It was Kyrian Hunter and his wife with their daughter Marissa and a baby boy Nick had never seen before. They were laughing and chatting with other people Nick had called friends, Vane and Bride, Julian and Grace. But what absolutely floored him was the fact they were at a table with Valerius and Tabitha. Since Tabitha was the twin sister of Amanda, that wasn’t the shocker.</p><p>Valerius was what stunned him.</p><p>A mortal enemy of Julian and Kyrian, Valerius’s family had tricked and killed Kyrian—then destroyed the people and country the two of them had fought and died to protect. For centuries, they had nursed bitter hatred toward each other.</p><p>And now Kyrian was handing his son over to a man he’d once sworn to decapitate...</p><p>How had this happened?</p> <p>“Nick?”</p><p>He jerked at the quiet whisper from behind him. It was Stryker’s half-sister, Satara. Tall and dazzling, she was the epitome of feminine beauty and grace.</p><p>He stepped back so that the others couldn’t see him on the street. “What are you doing here?”</p><p>“I felt a strange sensation coming from you and I wanted to see what caused it.”</p><p>He hated that sharing blood with her allowed her to feel his emotions. It was irritating to have someone read him. “Nothing. Go home, Satara.”</p><p>She tilted her head as if looking to see Kyrian and the others inside. “It’s interesting, isn’t it? Why Acheron brought them back to life after they’d died, but refused to do the same for your beloved mother. I wonder why he chose them over her.”</p> <p>“I don’t need you to poke that scab.”</p><p>“True. I’m sure it’s still raw.”</p><p>She had no idea.</p><p>“But,” she said, stepping close enough to whisper in his ear. “Why should they be here, living happily while your mother is dead?”</p><p>“Don’t start with me, Satara. That man and his family are all I have left.”</p><p>She cocked her head. “Are they? What do you think they’ll say when they find out you’re a Daimon Dark-Hunter? That through you Stryker can see and hear all they do?”</p><p>He started away from her, but she pulled him to a stop. Her long nails bit into his forearm.</p><p>“The old Voodoo bitch told you that Acheron helped here in New Orleans after the hurricane, but did she tell you who his mother is?”</p> <p>Nick froze at her words. “Ash has a mother? Alive?”</p><p>She smiled. “Ooo, another secret he kept from you, huh? So much for being best friends. Makes you wonder what other things you don’t know, doesn’t it?”</p><p>Yes, it did. He snatched his arm from her grasp. “Who is his mother?”</p><p>“The Atlantean goddess, Apollymi. But she’s better known to the immortal world as the Great Destroyer.”</p><p>“Destroyer?”</p><p>“Yes. For no other reason than she was having a bad hair day, she has unleashed unrelenting storms against civilizations for centuries, and she was highly upset that night when Desiderius played havoc here in New Orleans.”</p><p>Nick couldn’t breathe as he recalled that night. Desiderius had been Stryker’s agent, and he had been the one who had killed his mother.</p><p>She leaned in to him to whisper again, “She’s also the mother of my brother Stryker. You know him. Leader of the Spathi Daimons. Who do you think pulls my brother’s leash? Who do you think controls Stryker’s army?”</p><p>Nick felt rage swell up inside him at all the truths Ash had kept from him and the others. “Ash’s mother is the leader of the Daimons?”</p><p>“Yes, she is. Now you know why Ash keeps so many secrets. How would it look to all of you to know his beloved mother is the one who controls your enemies? That’s why he hasn’t told any of you about the Spathi Daimons such as Desiderius. Why Ash will always stay out of such conflicts. He’s not the big bad. His mother is. Face it. Ash has been lying to all of you from the very beginning. Artemis doesn’t control him. He controls her. She lives in complete fear of him.”</p><p>Nick remembered the night he’d killed himself in front of Artemis. Satara was right. The goddess had been terrified of Acheron and his reaction to Nick’s death. That alone had caused her to reanimate him. Even against the rules.</p><p>Still, he couldn’t get Menyara’s words out of his mind. “Menyara has never been wrong about anyone.”</p><p>“Menyara has never met a god who can alter someone’s thoughts and perceptions. Think about it, Nick. How many times have the Were-Hunters tampered with someone’s mind to make them forget they saw something preternatural?”</p><p>More times than he could count. “But Ash has always refrained from doing that.”</p><p>“That’s what he says. Yet how often do people preach one thing, then do another?”</p><p>Again, she was right.</p><p>She leaned against him and rubbed his biceps. “You are blessed with the truth. Nothing in the Dark-Hunter world is what it seems. Acheron has duped everyone... but you. The question is, are you going to let him continue to get away with hurting people for his mother or are you going to stop him? How many more people must die because Acheron is a cruel sadistic bastard? It’s him or us, Nick. Whose side are you on?”</p><p>His own. To hell with the rest of them. But he didn’t want her to know that. Not yet anyway.</p><p>She toyed with his hair. “Stryker has given you the means for vengeance. The only question is, are you man enough to take it?”</p><p>He curled his lip at her. “I’m not a man, Satara. I’m an immortal with god powers.”</p><p>She inclined her head to him. “And as long as you don’t forget that, Acheron is yours.”</p><p>Nick glanced back at the restaurant and the truth pierced him hard. He would have gladly sacrificed Kyrian and his family to have his mother back. Friendship was one thing. Family was another. Though Kyrian had been like a brother to him, he wasn’t blood. Nick had been willing to sell his soul for vengeance and he still was.</p><p>“Be true to us, Nick, and we can give you what you want most.”</p><p>Nick sneered at her. “You don’t know what I want.”</p><p>“Yes, I do. You want revenge and you want your mother back.”</p><p>“I can get my own revenge.”</p><p>“True, and we can give you your mom.”</p><p>What the hell was she talking about now? The bitch was crazy. “Don’t be stupid. My mother’s dead. There’s no way back from that.”</p><p>“Isn’t there? You’re here and yet you were once dead.” She snapped her fingers. An instant later, a tall dark-haired man appeared beside them. At six foot four, Nick wasn’t used to many men who made him crane his neck, but this one did. And by the luminescent blue eyes, Nick knew exactly who and what this man was.</p><p>A Dream-Hunter.</p><p>Gods of sleep, they were sent from Olympus to help and protect dreamers. And through a pact with Acheron, many of them were sent to aid Dark-Hunters. To help them heal, especially when they were asleep, so that they could continue to protect mankind from the evil that preyed on them.</p><p>This wasn’t the first Dream-Hunter to approach him. He’d sent M’Adoc away as soon as the god had offered to help Nick forget the pain of his mother’s death. He didn’t want to forget his mother or what had happened.</p><p>Nick jerked his chin toward the newcomer. “I don’t need his help.”</p><p>“Of course you don’t, Nicky. But Kratos can do the one thing even Acheron can’t do.”</p><p>“And that is?”</p><p>“Bring a soul out of its eternal rest and return it to the land of the living.”</p><p>Nick wasn’t stupid enough to buy what she was selling. “At what price?”</p><p>“An act of loyalty to us. You bring Kyrian’s child Marissa down to Kalosis, and we will return your mother to this world.”</p><p>Still he was skeptical. “You can’t do that.”</p><p>Satara gave him a smug smile. “Kratos. A demonstration, please.”</p><p>Before Nick could move, the Dream-Hunter touched him. His grip seared Nick’s skin, making it burn and crawl as images tore through him. He saw his mother in a garden surrounded by roses. Her shoulder-length blond hair was glistening in the light while she laughed at a group of children who were playing around her.</p><p>A tear slid down his cheek as he saw her kind face again. “Mom,” he whispered.</p><p>She cocked her head as if she could hear him. “My Nicky,” she breathed. “I miss you.”</p><p>“I can take you into the Underworld,” the Dream-Hunter said. “But it won’t be easy.” He released Nick and the image of his mother instantly vanished. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nick struggled to breathe. “How do I know I can trust you?”</p><p>“I have no emotions. I only do as I’m told. Betrayal is for those who have something to gain.”</p><p>It was true. The Dream-Hunters had been cursed by Zeus to feel nothing.</p> <p>Satara smiled at him. “It’s too soon, Nick. I know. You go home now and rest. When you’re ready to have your mother back, bring Marissa to us.”</p><p>Nick nodded before he turned back and did what she said.</p><p>Satara narrowed her eyes as Nick vanished from sight. He was being rather willful, but they could still control him. He needed their blood to live and so long as they had him tied down, there was nothing he could do to escape.</p><p>At least nothing that didn’t involve him begging Acheron for help and that was the last thing Nick would do.</p><p>“Do you really want me to bring his mother out of the Underworld?” Kratos asked. “That will require a massive amount of cooperation from Hades.”</p> <p>She scoffed at him. “Of course not. We get Marissa and both he and his mother can roast in their hell for all I care. But you are another matter. I want you in his dreams, every night, working on him. He has enough anger to feed you well, my Skotos. Play on that anger. Build it higher until he will be willing to do anything to free his mother and kill Acheron.”</p><p>She saw the hesitation in Kratos’s eyes.</p><p>She curled her lip. “Oh, don’t tell me you’re going to be a wuss too. I’m sick to death of weak men around me.”</p><p>He grabbed her and shoved her against the wall. “I’m not a wuss, Satara. You’d do well to remember that.”</p><p>She tsked at him. “For a god with no emotions, you seem rather testy.”</p><p>He released her. “I’m siphoning off you and your hatred. Even in this realm, it’s pungent.”</p> <p>“Leave my hatred alone. I don’t want it diminished. Remember, Dream-Hunter, I’m a god too. Fuck with me and I’ll bring down the wrath of Zeus on you.”</p><p>“You’re only a demigod and a servant at that.”</p><p>“But dear old Grandpa Zeus will take an audience with me and then he’ll take your head. Are you willing to chance that?”</p><p>He took a step back and gave her a look that let her know she should be on guard while sleeping in the future.</p><p>“Just do your part, Kratos, and I’ll do mine. The Oneroi don’t monitor the dreams of Daimons. You help me keep Nick turned against Acheron, and I will give you a playground unimagined by your brethren.”</p><p>Kratos swallowed at her promise. Three weeks ago, he’d been one of the Oneroi. A servant of the gods who protected humans and immortals while they slept. Then Satara had summoned him in her dreams and had turned him Skoti. She’d seduced him with her body and made him crave emotions like a drug. Now he couldn’t stand the emptiness of his existence. He only wanted to feel and he was willing to do anything to keep his newfound emotions.</p><p>She was right. His kind didn’t prey on Daimons, and if they were half as enticing as she, then he would have a banquet at his fingertips.</p><p>And all he had to do was feed the Dark-Hunter’s anger and grief. Simple.</p> <p>“It’s a deal, Satara. You give me what I need and I’ll give you what you want.”</p><p>She smiled. What she wanted was simple. Nick Gautier’s loyalty and the baby Marissa. With those two things, she could bring down both the Greek and the Atlantean pantheons.</p><p>Then she would be a god and she would make Apollymi look weak.</p><p>And Nick, Acheron, and Kratos would be her eternal slaves.</p><p>FEAR THE DARKNESS AUDIOBOOK</p><p>Experience the sounds of darkness...</p><p>Enter the realm of the Dark-Hunters—listen to Fear the Darkness* audiobook and hear insider details from Sherrilyn Kenyon...</p><p>Fear the Darkness is Narrated by Holter Graham</p><p>Holter Graham is a stage, television, and screen actor. He has recorded numerous audiobooks, including The Alibi and Fade. His film credits include Home, Maximum Overdrive, and Hairspray. On television he has appeared in Law and Order and New York Undercover</p><p>Valid through 12/31/07</p><p>You must have a computer and internet connection to take advantage of this offer.</p><p>St. Martin’s is not responsible for electronic, hardware or software, network, Internet, telecommunications, or computer malfunctions, failures or difficulties of any kind, including any injury or damage to your or any other person’s computer in connection with this offer. St. Martin’s reserves the right to suspend or terminate this offer if fulfillment is prevented or impeded by causes beyond its reasonable control</p><p>Part ii:</p><p>A LETTER FROM SHERRILYN KENYON</p><p>A LETTER FROM SHERRILYN KENYON</p><p>Hi, everyone!</p><p>I hope you enjoyed the short story and I know the first question many of you will have after reading it—is that it for Nick? No! :) I promise Nick will have a full-length book in the future.</p><p>That being said, I’ve been wanting to do this short for a while, but it didn’t really fit into any of the novels. I thought that it was important for the fans of the series to understand why Nick can’t simply forgive and forget where Ash is concerned. As Ash so often says, emotions don’t have brains. And as I know firsthand, grief takes years to deal with, especially when someone is violently and unexpectedly taken too soon from your life.</p><p>Nick makes a cameo appearance in The Dream-Hunter, and here’s a small bit of that cameo.</p><p>“Ah, jeez. Nick!”</p><p>Ash turned at Kyrian’s irate shout to find the general standing in the doorway near the black mark Nick had left on the floor. A few inches shorter than Ash, Kyrian had short blond hair and was dressed in black. “I’m going to kick your ass, boy! How many times have I told you no skateboards in the house?”</p><p>Nick came up behind Kyrian with a face as white as chalk. Ash had seen condemned men look less panicked.</p><p>“It’s not Nick’s fault,” Ash said quickly as Nick stopped behind Kyrian’s back with his eyes wide. “It’s these new biker boots. Sorry. I was so stunned when M’Adoc showed up that I skidded on the floor.”</p><p>Kyrian gave him a suspicious glare, but since he couldn’t prove Ash was lying, he let it go. “Well, then, could you fix it?”</p><p>The mark vanished instantly.</p><p>“Thanks.”</p><p>“You’re the friggin best ever,” Nick mouthed at Ash from behind Kyrian’s back. He held his hands up in a silent gesture that said Ash rocked. “I love you, man.”</p><p>Kyrian turned sharply to glare at Nick who immediately acted as if he were just scratching his head. “You called me, boss?”</p><p>“No. I’ve called you a lot of things, but ‘boss’ has never been one of them. And it never will be either.”</p><p>Nick raked his hand through his long brown hair. “Dang, he’s in a bad mood tonight. You need to get laid, boss.”</p><p>“Shut up, Nick.”</p><p>I just love this whole scene (which can be read in its entirety in The Dream-Hunter). Like many others, I miss the old Nick too. But Nick is on a journey, and hopefully he’ll be a better man because of it. Or he’ll die a spectacular death. Only me and my friend Janet know for sure.</p><p>In the meantime, I’m working on the next book in the Dark-Hunter series, Devil May Cry. While The Dream-Hunter has Ash’s heroine in it, DMC has events that will greatly impact Ash and his future. Not to mention it has one heck of a HUGE surprise in it. It opens in New York during Christmas and it will take the reader someplace they haven’t gone before. It also has Urian’s return and a Simi shocker. I love this book and I hope all of you will be on the lookout for it in August.</p><p>And keep an eye out for the return of Born of the Night, the first book in the League series. St. Martins has heard our cries and has taken mercy on us. All of the out-of-print books will be back in print very shortly, and SMP was kind enough to let me go back in and edit them. So for the first time ever, they will be a cohesive series and you will get to read them the way I wanted them to be read. I’m so excited!</p><p>I hope all of you had a great holiday season and that 2007 brings nothing but warmth to your heart and laughter to your home.</p><p>Hugs!</p><p>Sherrilyn</p><p>Part iii:</p><p>Sneak Peek:</p><p>THE DREAM-HUNTER</p><p>Available February 2007 in Paperback</p><p>THE DREAM-HUNTER</p><p>Arik wanted to curse in frustration as he watched Megeara smiling at another man. Why wouldn’t she succumb to his serum? To his pleas?</p><p>How could a mere mortal woman be so strong?</p><p>“Arikos?”</p><p>As light intruded into his dark chamber once more he let out a tired sigh at the sound of his uncle Wink’s voice. Arik was getting seriously tired of these interruptions when all he wanted was to be with his human target. “What?”</p><p>“I’ve been told to retrieve my sleeping serum from you. You seem to be abusing it and making your human ill.”</p><p>Arik rolled over to face the older sleep god. Wink’s long brown hair was braided down his back as his light gray eyes danced with mischief. Even though Wink was one of the oldest gods, he had the personality of a thirteen-year-old boy. There was nothing he loved more than to play pranks and tease—two of the very things that had gotten Arik and his brethren cursed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>At one time, they’d been too easily seduced and manipulated by the other gods and had allowed themselves to be used by Wink, Hades, and the others in private jests and wars.</p><p>Until the day Zeus had put a stop to it once and for all. Funny how he’d only punished the tools and not the ones who’d wielded them.</p><p>But then, Zeus wasn’t known as a god of justice.</p> <p>“And if I want to keep the serum?”</p><p>Wink arched a brow at that, then tsked. “Come now, Arikos, you know the rules.” His face sobered. “You also know what happens to those who don’t cooperate.”</p><p>Of course he did. All of his kind knew. His back bore more scars than the sky held stars. There were times when he suspected his grandfather Hypnos, who oversaw their physical punishments, was nothing more than a sadist who could only feel pleasure when he was doling out pain to others.</p><p>How cruel was it to send the Skoti in to drain humans of excess or pent-up emotions, then punish them when they didn’t want to leave because they finally experienced something other than pain?</p><p>But that was the way of it.</p> <p>After his “chat” with M’Ordant, Arik had known it would come to this. There was no use in arguing. Wink had been sent to retrieve the Lotus serum they used on humans, and all the bribery on Olympus wouldn’t sway him. Wink was only a pawn who served the sleep gods.</p><p>Arik pulled out the small vial and handed it to Wink, who took it with a stoic smile.</p><p>“Cheer up, old boy. There are plenty of other dreamers out there for you to play with. Mankind is generous to you that way. They live for their dreams and are possessed of them constantly.”</p><p>Yes, but none of those humans held the type of uninhibited, vivid dreams of Megeara. It made Arik long to know what she’d be like outside the dream realm. What she would be like as a human...</p><p>Arik watched as Wink withdrew, then left him in the dream chamber to face the darkness alone.</p><p>Perhaps this was just punishment after all. A son of the god Morpheus, Arik had originally been one of the Oneroi. As was customary for such, he’d been assigned humans to watch over and protect against the Skoti who sometimes preyed on them. In those days, he’d spent his life monitoring his subjects, making sure the ones under his protection had normal dreams that would either help them work through their problems or inspire them.</p> <p>Until that one fateful night.</p><p>He’d gone to help one of his assignments who was ill. Because of her sickness, her dreams had become extremely vivid and emotional—so much so that one of the Skoti had latched onto her. Such a thing was common and even tolerated. Skoti fed from human emotions, but so long as they kept it under control and didn’t lead the dreams or interrupt the human’s life, they were allowed to drain humans. It was only when the Skoti began to return repeatedly and took control of the host that they were punished.</p><p>Humans held fragile psyches. A returning Skotos could easily turn human minds and either drive them insane or make them homicidal. In the worst case, a Skotos could even kill the human, which was why the Oneroi monitored them. If a Skotos spent too long with their host, then it was the Oneroi’s place to step in and drive them out.</p><p>If all else failed, the Oneroi would kill the Skotos.</p><p>At one time, Arik’s life had been dedicated to protecting his humans. To feel nothing and to only follow the orders of the elite Oneroi. In his day, he’d vanquished numerous Skoti without understanding or caring why they sought humans the way they did. Why they felt a burning need to risk their lives for their quest.</p><p>And then one night...no, one encounter had changed that and brought with it a clarification that still resonated within him.</p><p>Born of a human mother and the dream god Phobetor, Solin lived on earth, but at night he ran amok in the dreams of other humans. Completely amoral, he didn’t care what he did to others so long as he enjoyed himself.</p><p>For centuries, the Oneroi had been trying to stop and trap Solin. He was one of the few Skoti who’d warranted a death sentence. His voracious appetites and fighting skills were legendary among the Oneroi who’d been unfortunate enough to confront him.</p> <p>And Arik had been one of them. Still young by their years, Arik had thought to take Solin on his own.</p><p>Most of the Skoti fled at the approach of an Oneroi. The Oneroi had full backing of the other gods to do whatever they had to do to control the Skoti. Since a Skotos could drain emotions from any human, they normally left without issue and didn’t waste time fighting when they could simply move on to someone else.</p><p>But Solin was stronger than most. Bolder. Instead of fleeing as Arik had expected, Solin had turned the human loose on him. By their laws, Arik had been forbidden to hurt the human, and Solin had known it. Arik had tried to pry her away without harm, but the moment her lips had touched his and he’d tasted her lust, something inside him had shattered.</p><p>He’d felt pleasure and arousal for the first time in his life.</p><p>And when the human had dropped to her knees and taken him into her mouth, he’d known his war in this was lost and his conviction shattered. In one heartbeat, he’d gone Skoti.</p><p>He’d been Skoti ever since.</p><p>Drifting from one dream to the next, he’d been searching all these centuries for someone who could raise his emotions to the level of that first night. But no one had come close.</p><p>Not until Megeara.</p><p>Only she was able to reach through the emptiness inside him and make him see vivid colors again. To make him feel her emotions. After all these centuries, he finally understood why certain Skoti refused to leave their partners.</p><p>Why they were willing to risk death.</p><p>Because of Megeara, he wanted to know what the world looked like through her eyes. What it tasted like. Felt like. And her ability to pull herself away from him was starting to seriously piss him off.</p><p>But what could he do? Even if he went to earth to be near her, he couldn’t really experience her or her environment.</p><p>He wanted her passion. Her life force.</p><p>There might be a way to touch her...</p><p>Arik paused at the thought. It was true that both the Oneroi and Skoti could take human form in the mortal realm, but because of their curse, they still lacked emotions. So what was the point? They were just as cold and sterile and unable to feel in human form as they were in their own god form.</p><p>That wasn’t what he wanted.</p><p>No, he wanted to be human. He wanted feelings and emotions so that he could experience her to the fullest extent possible.</p><p>It’s impossible.</p><p>Or was it? They were gods, with god powers. Why should such a thing be unattainable?</p><p>Your powers aren’t capable of such. Zeus had made sure of that when he punished them for tampering with his dreams.</p><p>Then again, Arik’s weren’t. But there were others whose powers made a mockery of his. Gods who could make him human if they willed it.</p><p>Zeus would never concede such a thing—he hated the dream gods too much. His children would be too afraid of him to try. But his brothers...</p><p>They were a different matter entirely.</p><p>And Arik knew which one to barter with.</p><p>Hades. The god of the Underworld held no fear of anyone or anything. His powers were more than equal to any of the others’, and best of all, he hated the other gods as much as they hated him. Because of that, Hades was always open to a good bargain, especially if such a bargain would irritate Zeus.</p><p>It was at least worth a shot.</p><p>With Megeara’s niggling emotions retreating from him, Arik flew from the Vanishing Isle where most of the dream gods resided and descended down, straight into the heart of Hades’ domain. It was dark as night here. Dismal. There were no ivory or gold halls like the ones found on Olympus. At least not until one visited the Elysian Fields, where good souls were sent to live out their eternity in paradise. Those lucky enough to attain residence there had any- and everything their hearts conceived of. They could even be reincarnated should they choose it.</p><p>But the Elysian Fields were only part of a much vaster realm. One that held nothing but misery for those who were damned to it. Especially this time of year. Three months ago the god’s beloved wife, Persephone, had been sent to live with her mother in the upper realm. Until Persephone’s return, Hades would be literally hell to deal with. From the moment she left until her return, he would spend his time torturing all those around him.</p><p>A saner god would wait to try to deal with Hades after Persephone’s return, when he was more reasonable, but Arik was desperate. The last thing he wanted was to take a chance on another Skotos finding Megeara.</p><p>No, it was now or never.</p><p>Besides, Arik had never been a coward. He’d never once retreated from battle or conflict. It was what had made him one of the best of the Oneroi and what had made him one of the deadliest Skoti.</p><p>He always took what he wanted. Damned be the consequences. He had eternity to deal with those. What mattered most was the present, and that was what he focused on. Always.</p><p>As he flew past Cerberus, the three-headed dog rose up to bark at him. Ignoring it, he dove down into the catacombs made of the skulls and bones of Hades’ enemies. Many of whom had been Titans and ancients who’d had the misfortune of irritating the somber god—they didn’t even warrant Hades torturing them for eternity. He’d relegated them to nothing more than decoration. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That alone should be a warning to Arik...</p><p>But the brave and the desperate never heeded such.</p><p>Arik slowed his flight as he entered the main chamber of Hades’ domain. This was the only room in Hades’ opulent palace that was open to outsiders....But there was a lot more to his home than this one room.</p> <p>Arik knew that because no one was immune to the powers of a Dream-Hunter. No one. All gods were vulnerable whenever they rested, which was why they feared the Dream-Hunters so, and it was times such as those that Arik had ventured here to see what Hades kept so secret.</p><p>Now Arik faded to invisibility and rose up toward the black ceiling that glittered eerily in the dim light. Hades sat below, alone, on his throne. Made of Titan bones, his black throne had been polished until it gleamed like steel. Hard and intimidating as the god had intended, it dominated the dais where it sat. Beside it was a much smaller chair. One made of gold and cushioned with pillows the color of blood. It was where Persephone sat whenever she was home with her husband.</p><p>Hades stared at her throne with a look of such longing that Arik could almost feel his grief. And it wasn’t until Hades moved that Arik realized the god held a small, delicate fan in his hand. One made of lace and ivory.</p><p>Closing his eyes, Hades held it to his nose and gently inhaled the scent.</p><p>Then he cursed and tossed the fan back to the throne by his side.</p> <p>A heartbeat later, he got up to retrieve it and place it more carefully in a small holder on the right arm. Obviously that was where Persephone kept it.</p><p>Hades froze and cocked his head as if he was listening for something. “Who dares to enter my hall without summons?”</p><p>Arik lowered himself to the floor and materialized. “I do.”</p><p>The god turned about slowly and narrowed his amber eyes on Arik. “What brings you here, son of Morpheus?”</p><p>There was no need to hide what he wanted. “I would like to bargain with you.”</p><p>“For what?”</p> <p>“I wish to be human.”</p><p>Hades’ evil laughter rang out in the hollow hall, echoing around them. “You know how to be human, Skotos. Stop eating ambrosia and drinking nectar.”</p><p>“That would only make me mortal and I don’t want to die. I want to feel, and for that I need to be a human and not a god.”</p><p>Hades approached him slowly until he stood just before Arik. “Feel? Why would anyone in their right mind wish for that? Feelings are for fools.”</p><p>Arik glanced to the fan. “Even you?”</p><p>Hades bellowed in rage as he flung out his hand and pinned Arik against the wall with his powers. The jagged bones bit into Arik’s back, tearing the fabric of his clothes.</p><p>Arik fought the hold, but there was nothing he could do at the moment except bleed.</p><p>“For a god who doesn’t wish to die, you speak of things you’d best not address.”</p> <p>The force holding him receded so fast that he barely had time to recover himself before he fell. He hovered over the floor for a heartbeat until he placed his feet on the ground.</p><p>Hades raised his brows in surprise. “You’re faster than most.”</p><p>“And in my realm, I’m capable of even more feats.”</p><p>“What are you saying?”</p><p>Arik shrugged. “Only that a god of such power should be careful. Even the great Hades has to sleep sometime.”</p><p>“Are you threatening me?”</p><p>“I’m only stating a fact.” Arik looked pointedly at Persephone’s throne. “And reminding you, my lord, that there’s nothing worse than allowing a Skotos to know of a weakness.”</p><p>Hades narrowed his eyes before he again broke out into laughter. “It’s been a long time since anyone dared such boldness in my presence. Look around you, Skotos. Do you not see the remains of the people who have pissed me off?”</p><p>“My name is Arik and I see everything, including the beauty and comfort of the palace you hide behind this facade of death. But in turn, I would ask you what good does it do to threaten someone who can’t feel fear?”</p><p>Hades inclined his head. “Point well taken. So tell me...Arik, what bargain do you wish to propose?”</p><p>“I want to live in the realm of the humans as one of them.”</p><p>Hades tsked at his request. “That’s not so easy to attain, dear boy. No Olympus-born god can live on earth for very long.”</p><p>“But we can live there for a time. I would go there now, but there would be no point, since I could only witness what’s around me and not experience it. It’s the experience I want.”</p><p>“What good is this experience when you’ll only forget it once you return?”</p><p>What the god didn’t know was that Arik wouldn’t forget. He’d remember and he wanted that memory. Unlike M’Ordant and many of the others, Arik had no knowledge of true emotions or sensations—they’d been beaten out of him so long ago that he’d completely forgotten what it was like to feel. He wanted to know how much more intense feelings could be when not blocked by the curse.</p><p>“Does the why really matter?”</p><p>Hades considered that for a moment. Folding his arms over his chest, he frowned at Arik. “For what you want, there would have to be a steep price.”</p><p>“I expected nothing less. Just tell me your fee.”</p><p>“A soul. A human soul.”</p><p>That was easy enough. Taking a human life wouldn’t bother him. They lived finitely anyway and very few of them even bothered to appreciate the beauty that was the human existence. He, however, would savor his brief time as one of them. “Done.”</p><p>Hades clucked his tongue at Arik. “Child, how naive of you. You agreed too soon. It’s not just any soul I want.”</p><p>“Whose then?”</p><p>“I want the soul of the woman who has compelled you to make a deal with the devil. Surely she must have a magnificent soul for you to come here and barter with me, the most despised of all gods.”</p><p>Arik hesitated. Not out of feelings for Megeara but rather because he wasn’t sure he would be through with her by the time he was forced to return. “And if I fail to complete this bargain?”</p><p>“It will be you who suffers here in her stead. If you fail to deliver her to me, I will kill you as a man and keep your soul in Tartarus. The pain you’ve felt to date will be nothing when compared to what you’ll suffer then. And before you reconsider, remember that you’ve already agreed to this. There is no going back now. Our bargain is set.”</p><p>“How long will you give me?”</p><p>“Two weeks and not a day more.”</p><p>Arik had no time to even twitch before a strange thick blackness covered him. One moment he was standing in the middle of Hades’ throne room, and in the next he was encircled by wetness.</p><p>It was water...</p><p>And unlike in dreams, his body was heavy. Leaden. Water poured in through his mouth and nose, causing him to choke as it invaded lungs that weren’t used to really breathing. He tried to swim, but the water was too thick. It seemed to be sucking him down deeper into the sea.</p><p>Panic consumed him. There was nothing he could do.</p><p>He was going to drown.</p><p>“Geary, quick! There’s a body overboard!”</p><p>Oh good God, who had Thia attacked now?</p><p>Aggravated, Geary looked up from Tory’s notes at Justina’s call. Geary’s second in command was pointing over the side of the boat. As Geary rushed to the side to peer over, she handed the notebook back to Tory. Sure enough, there was someone struggling in the waves. And by the looks of it, he was quickly losing his battle.</p><p>“Christof!” Geary shouted for the boat’s captain. “We need...” She paused as the body sank down below the hungry waves.</p><p>There wasn’t time.</p><p>Her heart pounding from the rush of adrenaline, Geary kicked her shoes off and dove over the side. The coldness of the water stunned her as it covered her completely. Kicking her legs, she swam upward until she broke the surface so that she could look about for him.</p><p>Even though the water was clear, Geary had a hard time finding the guy below the surface. She had to keep diving down, then returning for fresh air before she dove back to search for him. Thank God she was a strong swimmer who was trained as a lifeguard and a certified diving instructor. But then, it was expected of her as an underwater recovery expert. She had to be as nimble in water as a fish.</p><p>She just wished she’d had time to get her gear before she’d come in after him. If she didn’t find the guy soon, he’d be dead, especially since he hadn’t resurfaced.</p><p>Her lungs burned from holding her breath as she dove under the water again. Her ears were buzzing and popping from the pressure as images of him drowning consumed her.</p><p>Geary had been twelve years old when Tory’s father had drowned only a few miles from this very spot. Images of her father trying to save Theron’s life tore through her now as she remembered her father diving for him. Her father pulling Theron out of the water and doing everything he could to resuscitate him.</p><p>It’d been awful and the last thing she wanted to do was relive it.</p><p>C’mon. Don’t you dare die on me. Where are you? She slowed her speed and turned about as she floated weightlessly in the sea. The light refracted and danced in the blue and green water, highlighting various fish and foliage, but there was no sight of the man she sought. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Look down.”</p><p>She frowned at the foreign voice in her head, not understanding the source of it, but she couldn’t help obeying it. Looking down, she spotted him just below her. Even though he was trying to swim, he was sinking fast....</p><p>His long black hair danced in the water as bubbles floated around him and he waved his arms and legs to no avail.</p> <p>Relieved she’d found him but scared it might be too late, she headed for him as fast as she could. She came up behind him, then pulled his large body against hers and kicked them toward the surface.</p><p>Good grief! The man was huge and made of solid muscle. With next to no fat on him, he was like an anchor in the water. It took a great deal of effort to get them to the surface.</p><p>By the time they broke through, both of them were sputtering and coughing.</p><p>“Hold on,” she said to him. “I’ve got you.” Even so, she half-expected him to fight against her. Most drowning victims did.</p><p>But not him. He went limp against her as if he trusted her completely.</p> <p>Justina and Teddy were in the water already with a life preserver. Together, they got the man into the harness and had him hauled on board, then they followed suit.</p><p>By the time Geary was on board the Simi again, she saw the unknown man lying on the deck, covered with a blanket, while Thia was giving him mouth-to-mouth. Geary couldn’t see the man’s face for Thia.</p><p>“Is he dead?” Geary asked, rushing over to them as worry tore at her.</p><p>Just as she reached his side, the man coughed up a gallon of seawater. Gasping, he turned quickly to his side and started hacking and wheezing while Thia pounded him on the back to help him clear his lungs. His slick wet skin was completely bronzed and perfect, except for the deep welts that marred his back. The scars were old, but even so they were prominent enough to let Geary know how much they must have hurt when he received them. It reminded her of the way sailors were beaten for punishment back in the old days.</p><p>Why would a modern man have such scarring? Who would have beaten him like that and why?</p><p>And he wore nothing except a thin pair of long white pants that were plastered against his perfect body...and they showed absolutely everything, right down to his religion and the fact that this man had been rather gifted in a certain department.</p> <p>He might as well be naked.</p><p>“Now there’s a man who doesn’t believe in underwear, huh?” Justina said in a low tone for only Geary’s hearing as she wrung out her hair. “Not that I’m not grateful for it. He has the nicest ass on the planet. No wonder Thia grabbed him for resuscitation. I wouldn’t mind a little mouth-to-mouth action with that body, either.”</p><p>While Geary pretty much agreed with those sentiments, she didn’t comment as Tory draped a blanket around her shoulders.</p><p>“Hell of a fish you found there,” Christof said as he brought more blankets for them. He gave one to Justina and Teddy.</p><p>Ignoring him, Geary knelt down beside her catch. The man held himself up with one muscular arm as he continued to breathe in short, sharp gasps. His tangled wet black hair fell over his face, completely obscuring it from her and the others. The tendons of his hands were well defined and beautiful, which made her curious as to what his face would look like.</p><p>Would it be as scarred as his back or as pristine and beautiful as the rest of him?</p><p>“Are you okay?” she asked in Greek, assuming since they were in the Aegean that he would understand her better in Greek than any other language.</p><p>He nodded as he continued to struggle to expel the water from his body. It was almost as if he wasn’t used to his own lungs.</p> <p>His breathing ragged, he lifted his head to look at her through the strands of his wet black hair. And as soon as their eyes met, Geary gasped and fought the urge to cross herself and spit as she came face-to-face with the intense blue eyes of her dreams.</p><p>It couldn’t be....</p><p>It wasn’t possible and yet there he was before her in all his almost naked glory. She knew those perfect, sardonic lips. The slash of his dark brows over eyes that were so pale a blue they radiated. She knew that strong jaw, dusted with whiskers. It was one she’d teased with her teeth and tongue for hours on end.</p><p>Against all reason, it was him.</p><p>Something hot and needful went through her like a sharp needle as she fought the urge to reach out and touch him to make sure he was really here.</p><p>Arik couldn’t do anything more than stare at Megeara. She was even more beautiful in reality than she’d been in her dreams. Her deep blue eyes captivated him as tendrils of her wet blond hair hung down over them. Her pale skin begged for his touch just as her partially opened mouth needed his kiss.</p><p>He started toward those lips, then coughed more as he tried to breathe through the stinging pain in his chest. His body shook uncontrollably as he was assaulted by horrifyingly intense sensations and emotions. Even the cries of the birds above him were piercing to his ears—the droning of the ocean. And the heat of the sun on his skin...it was blistering. Never had he felt so out of control. Why wouldn’t his body obey him?</p><p>Why the hell couldn’t he stop coughing and shaking?</p><p>He half-expected Megeara to pound on his back as her accomplice had done. Instead, Megeara’s touch was gentle as she lightly hit him to help dispel the water from his now human body.</p><p>Then she started to gently rub his back in a circle. Chills spread over him as he felt a heat the likes of which were unimaginable. Forget the heat of the sun, this was even more scorching.</p><p>No one had ever touched him so gently and he’d never really felt a touch before, especially not against his flesh. All he wanted was to pull her into his arms and taste the taut nipples that were so apparent through her wet white shirt.</p><p>If only his body would obey him.</p><p>“I think he’s going into shock,” Megeara said to the others. “Grab more blankets.”</p><p>Another woman pulled Megeara away. “Let me look at—”</p><p>“No!” he snarled, reaching for Megeara’s hand to keep her by his side. He hadn’t come this far to lose sight of her now.</p><p>Megeara covered his hand with hers in a soothing caress. “It’s all right. Stay calm.” She took a blanket from a young woman with glasses, then wrapped it around him.</p><p>Arik closed his eyes and savored the fleeting sensation of her hands on his shoulders. The feel of her skin on his...it was electrifying. Hot.</p><p>If only he could stop shaking.</p><p>Geary wasn’t sure what to do. She exchanged a frown with Althea, who was on board as their physician.</p><p>“I need to check him out and make sure he’s okay,” Althea said in English.</p><p>Geary agreed. “I know.”</p><p>“I’ll be fine in a few minutes,” the unknown man said in perfect, accented English. His voice was so deep and resonant that it literally echoed around them. Those intense, predatorial eyes pierced her. “Just don’t leave me.”</p><p>Geary found herself nodding even though the possessive command of that tone made her want to run. It wasn’t in her nature to let anyone tell her what to do, but in his case, there was something unnaturally compelling about him. Alluring.</p><p>Honestly, she didn’t want to leave him. And that really did scare her.</p><p>Her heart hammering, she used a corner of his blanket to towel dry his hair, then brushed it back from a face that was truly flawless. “It doesn’t matter.”</p><p>Wow. He was extremely bilingual. He was also extremely exposed, and the sight of him with those pants clinging to his every asset brought the most wicked images to her mind. In her dreams, she’d twisted that body of his like a pretzel and licked every inch of it.</p><p>Okay, so it wasn’t quite that body. In her dreams, there had been no scars. But his body was close enough to the one she was used to to evoke a fervent heat inside her.</p><p>Geary brushed a drop of water off his cheek with the blanket. “What happened to you?”</p><p>He looked away. “I don’t know.”</p><p>Thia gave her a wicked grin. “Well, it isn’t every day we fish a nearly naked god out of the sea, now is it? Glad I came back early from my shopping trip. This was definitely worth it.”</p><p>The man snapped his head toward her and gave her a fierce scowl. It was obvious her words touched a nerve with him.</p><p>“Thia?” Geary said in a steady tone. “Do you mind?”</p><p>She rolled her eyes. “Whatever. See if I save his life next time he’s drowning.” Turning around, she headed belowdecks.</p><p>Christof stepped forward. “We should report this to the authorities.”</p><p>Even more fury snapped in those pale blue eyes. “No!” His tone was firm and commanding. “No authorities.”</p><p>Teddy exchanged a frown with her. “Why? You running from them?”</p><p>“No. I just don’t want to be interrogated when I can’t remember anything.”</p><p>Christof narrowed his eyes on him. “Do you know your name?”</p><p>He hesitated. “Arik.”</p><p>“Arik what?”</p><p>He looked up at Geary with a confusion that tugged at her heart. “I don’t remember.”</p><p>Geary tilted her head, not sure what to think. Something deep inside told her he was lying, but she wasn’t sure about what. “Did you hit your head?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He nodded.</p><p>“He could have amnesia,” Tory said. “If he fell from a boat he might have been run over by it. Or maybe he was beaten and then thrown overboard. Could be pirates.”</p><p>“He’s not bruised,” Christof pointed out. “And there hasn’t been a lot of pirate activity here for several hundred years.”</p> <p>“Yes, but I said could. Weird and unusual things happen all the time. Did you know that there were seventy-five pirate attacks on civilian boats last year alone? Six more were against the U.S. Coast Guard. One group even tried to take over a cruise ship.”</p><p>Ignoring Tory’s statistics, Geary dropped the blanket to Arik’s shoulders. “What was the last thing you remember?”</p><p>“I... I don’t know.”</p><p>A strange, warm feeling came over her as she watched him. The whole moment was so surreal. She couldn’t believe she was looking at...Arikos.</p><p>That had been a dream and yet the man before her was an exact copy. A copy named Arik.</p> <p>Could they possibly...</p><p>Don’t be stupid.</p><p>It was just some strange coincidence. Maybe some sort of premonition.</p><p>Her face flamed red at the thought. Well, not that kind of premonition. She wasn’t about to jump naked into a pool of chocolate with this guy.</p><p>“Okay,” she said quietly. “Teddy, take Arik below and find some clothes for him.”</p><p>Arik started to protest leaving her, then stopped himself. She was skittish of him. He could sense it. If he pressed her too much, she might bolt and push him away.</p> <p>That was the last thing he wanted.</p><p>No, he must tread carefully in order to gain her trust. He was here, in her realm. And he’d have plenty of time to seduce her shortly. For now it was best to humor her.</p><p>He stood up slowly, his eyes never wavering from her gaze. As a wave crashed into the boat, he staggered slightly and almost lost his balance.</p><p>Megeara reached out, her hands steadying him.</p><p>Arik closed his eyes as heat from her touch seared his every nerve. There was nothing to compare to the sensation of human contact—to the feeling of those delicate hands touching his flesh—and he couldn’t wait to feel them stroking the part of him that was hard for her.</p><p>He bent his head low so that he could inhale her sweet, feminine scent of open air and woman misted with a light touch of perfume. It was even more intoxicating than it had been in her dreams, and he wanted to bask in it.</p><p>Even more he wanted to smell it on his sheets and flesh. To drink her in for hours on end until he was fully sated and content.</p><p>Geary tensed at the feel of Arik’s hot breath against her damp skin. What was it about this stranger that set her entire body on fire?</p> <p>She forced herself to step away from him even though what she really wanted to do was walk closer to that magnificently muscled body.</p><p>His eyes showed his longing as he met her gaze again and he noted her actions. “Don’t be afraid of me, Megeara.” He all but purred in her ear. “I would never hurt you.”</p><p>It wasn’t until he’d left that she realized he’d called her by a name no one used. </p> </body></html>"]