["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Derek Titan looked around the crowded room and had to force himself not to yawn. He couldn’t stand attending events where everyone drank too much, laughed too loud and tried far too hard to impress each other.</p><p>Derek knew he was what women considered a real catch. Hell, a stupid magazine had done a write up on Seattle’s most eligible bachelors and placed his picture as number one. He’d been furious and tried to have himself taken out of the article but his attorney had spouted some crap about freedom of speech. Since the article, he was being approached by even more materialistic females.</p><p>The magazine listed his net worth as equal to Bill Gates. They’d also said he was tall, dark and handsome. He stood over six feet, with broad shoulders and muscles that rippled throughout his entire body. He hated gyms but he ran every morning and sometime in the evenings too. He’d discovered at a young age running was a great form of relieving his stress.</p> <p>He knew the second best way to relieve stress was to take a woman to bed. The minute he was done with her, he walked away, though. There were many women who tried to get him to stay but no one held his interest longer than it took him to button up his pants.</p><p>After his heart had been shattered by Jasmine, he wasn’t interested in any other woman. He figured once he got his revenge, he’d think about settling down.</p><p>A woman breezed by him wearing entirely too much perfume and he snapped back to reality. He sighed as he grabbed a glass of wine from a passing waiter.</p><p>These parties were all about who had the most to offer. The women were on the prowl and the men were fishing. He wasn’t interested. If he wanted a woman, he could have one at any time. He wasn’t interested in superficial, wanna-be socialites.</p><p>He watched as a couple of ladies passed by, dripping in diamonds and low cut gowns. They were trying to catch his eye and normally he’d make their day by flirting a little, giving them the impression they stood a chance but today wasn’t that day. He had a raging headache and he was pissed he’d been summoned.</p> <p>“There you are, boy. What are you doing hiding in the corner?” Daniel Titan, his father, walked up and questioned him.</p><p>“I’m wondering why I’m here when I’d rather be home with a scotch and my feet up,” Derek replied.</p><p>“You’re here because you received a request from your father. I have some things to discuss with you later,” Daniel said in his no nonsense voice.</p><p>“And it couldn’t wait until later?” Derek questioned.</p><p>“Oh live it up a little. You’re always so busy adding a few more million to your bank account you don’t stop to smell the roses,” his father admonished him.</p><p>“I live it up plenty, hell I was in Milan last week.”</p> <p>“You were in Milan on business, that doesn’t count,” his dad told him, a bit exasperated.</p><p>“For me, the ideal time is mixing business with pleasure,” Derek told his father, with a waggle of his brows. Both men relaxed.</p><p>“Seriously, Dad I do have a headache. What’s so important it couldn’t wait until morning?” Derek asked. Once Derek had made his first million he’d moved his father to the city and Daniel was the Chief Financial Officer of his huge corporation. His father was brilliant and had helped the company grow further. His dad may have had several hard times while Derek was growing up but he was essential to Derek’s company now.</p><p>“David Freeman’s here tonight and he’s talking to some people, trying to get investors,” Daniel answered him. Derek was on instant alert. He searched the room, spotting his enemy. He was the one who’d made him the cut throat business man he’d turned into.</p><p>“It’s far too late for him. By tomorrow morning his company will be mine, no matter what he tries tonight,” Derek said with a sneer.</p><p>As Derek watched David, a beautiful woman approached him, stepping up on her tip toes to kiss him on the cheek. David didn’t even bother to turn and acknowledge her, which she didn’t seem to notice. The man noticed nothing around him if it didn’t have dollar signs on it, not even his stunning daughter. Derek’s eyes narrowed to slits. He hadn’t seen Jasmine for ten years and those years had been very good to her.</p><p>Her dress was skin tight on top, dipping low in both the front and back. Her curves were even more pronounced now that her body had matured. She had dark hair, which was swept up in a classic bun, with tendrils floating around her delicate face. Her dark brown eyes had once mesmerized him. They had a hypnotic quality, with their deceiving innocence shining through and the thick, dark lashes surrounding them.</p><p>He was angry at the tightening in his gut at just the sight of her. She’d nearly destroyed him and yet he still wanted her. His full revenge included her though, so he’d have her in his bed again and then she’d be begging him not to leave.</p> <p>“I’m leaving now. He won’t make any progress tonight and tomorrow’s a busy day for me. I appreciate you calling, though,” Derek said. He then turned away and walked out of the room, without once looking behind him.</p><p>Jasmine spotted Derek across the room and her insides went up in flames. She narrowed her eyes in anger at the man as he walked around like he owned the place. She knew the kinder, gentler side of him but that boy was long gone. He may have never really existed beyond her imagination.</p><p>He wasn’t the boy who had taken her virginity and promised her forever. She thought back to that summer so many years ago. She’d waited at the abandoned church all day hoping something had happened to make him run late. When the sun had faded from the sky she’d finally had to admit he wasn’t coming. It had all been lies.</p><p>She watched him now, as he turned and walked from the room. He was by far the sexiest man in the room, with his custom tuxedo and piercing blue eyes. He had a delectable body, even though he sat in an office all day. Her heart fluttered, remembering those long summer nights of running her hands and tongue down those hard muscles.</p><p>She had no idea her world was about to flip upside down. She was soon to learn the man she thought of as her hero, her father, wasn’t who she really thought he was. This would truly be her last night of innocence. When morning came, nothing would ever be the same again.</p><p>As Derek disappeared around the corner, she couldn’t help but think back to the summer ten years before. It had been a time when she’d really believed in fairytales and magic.</p><p>She’d grown up very wealthy in the small town outside of Seattle Washington. Her father owned a multi-million dollar company and she’d always had more than most people could ever hope to.</p><p>He’d chosen their home in the small town, she’d thought so she could live in a nicer area. She’d later learn he’d really chosen to live there so he could be the big man on campus. He liked lording his wealth over all those around him but she didn’t know any of that then. She’d been young and naïve. She’d learn in the next few months how much her father had kept from her.</p><p>Her mother died during childbirth so she’d never known her. Her father never remarried, though he dated a lot of women. None of them really acknowledged her presence so she didn’t get attached to any of them. Sometimes, she thought it would be nice to have a woman help her pick out a dress or teach her how to do her hair. The staff was great and always spoiled her a bit, which irritated her father.</p><p>She’d seen Derek in school from the time she was young but she really got to know him the summer before her senior year in high school. He’d been from the proverbial wrong side of the tracks. His family was dirt poor but he was always determined to make a success out of his own life and turn things around. He ended up helping her with her math and soon they were inseparable. She’d loved his hunger and motivation and the way he never talked down about anyone. She thought he was every one of her fairytales come to life.</p><p>She found she was spending every waking moment with him. When her father found out she was dating a boy from the poor side of town he’d been furious and demanded her to end the relationship. It was the first time in her life her father told her she couldn’t have something she wanted. It also was the first time she’d defied him.</p><p>She’d been stubborn, putting her foot down and continued to see Derek behind her father’s back. She loved that he seemed to like her for her and not her money. He wouldn’t let her spend money on him, ever. He worked hard for a construction company, which would frustrate her at times, because she wanted him to be with her and not at a job.</p><p>He’d just laugh but always made it up to her on the weekend. That last weekend they’d been together they snuck off and went camping in the woods. She’d made love to him for the first time. It was the most magical experience she’d ever had. He proposed marriage to her that night and she said yes. They were going to meet at the old abandoned church on the outside of town on Sunday and run away together. He’d been saving all his money and was heading to the city to make something of himself.</p><p>She’d gone home, after being gone all night and her father had been spitting he was so angry with her. She’d told him she was of legal age and could do what she wanted. She told her father she loved Derek and she was going to marry him. Her father had seemed to accept her decision, because he’d become eerily calm and kissed her on the cheek. That was a rare thing as he wasn’t normally a man to openly show affection.</p><p>He said she was right and he was proud of her for making adult decisions. He then asked if he could help with anything. She’d been so happy her dad accepted her decision she told him everything.</p><p>The next day she ended up being late to the church, because she had a few errands her dad had asked her to do for him. She knew she had the rest of her life with Derek so she could wait a couple of hours to run away with him. She knew he’d wait for her. She was confident in their relationship.</p><p>She got to the church and was surprised he wasn’t there but figured he’d gotten busy like her. She waited and then waited some more. She sat there all afternoon until she finally accepted he wasn’t coming as the sun started to set in the sky.</p><p>She’d dragged herself home, crying the entire way. When she walked into the house and her father saw her, he’d taken her into his arms and asked her what was wrong. She’d cried against him and finally told him Derek hadn’t shown up.</p><p>He continued to stroke her back and tell her everything was okay. He’d explained to her he never trusted the boy and that’s why he’d been so overprotective. She never suspected her father had anything to do with Derek not arriving.</p><p>Derek left the hotel and was thinking back to that summer as well but his memories were far different from those of Jasmine’s. He had so much bitterness about that day but if he really thought back to it that’s what shaped him into the man he was now.</p><p>He’d fallen head over heels for the girl. He’d never thought he was worthy of dating someone as amazing as her but he was determined to make himself so. When he ended up helping her with her school work and found a connection together, he was unable to stay away from her.</p><p>He thought she was so different from the other kids who had money. Her family was the richest in town and her father reveled in that fact. He walked around in his custom made suits and drove his expensive cars. Hell, the man’s house was a showpiece so all the people lower than him could worship at his doorstep. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When he and Jasmine made love for the first time and he’d realized she’d given him her most sacred gift, he was overwhelmed. He proposed right away and decided to run away with her, to do the right thing.</p><p>He planned on heading to the city and making something of himself so he could continue to give her all the things she was used to. He wanted to make sure she never went without anything. He wanted to place her on a throne and spoil her rotten. He’d do or give her anything she wanted.</p><p>He’d shown up at the church full of naïve teenager dreams and one bag. When he heard approaching steps he’d turned in anticipation. His heart sunk at the sight of her father. The man approached with a sympathetic smile plastered on his face.</p><p>“Derek, I’m sorry but Jasmine asked me to come and speak with you,” David had stated. Derek didn’t understand why she’d send her father. “Jasmine said she couldn’t face you but she didn’t want to leave here. I have some cash here to help you on your way. She said you planned to go to the city and I want to help you get there,” he said with that same smile on his face.</p> <p>Derek felt like his world was falling out underneath him. The man pulled out an envelope loaded with hundred dollar bills. He held it out towards Derek. David was trying to pay him off. It was as if he was saying, thanks for entertaining my daughter but your services are no longer needed.</p><p>“I don’t want your money,” Derek spat at him. David continued holding the envelope out, like he couldn’t believe the kid from the wrong side of town wouldn’t jump at having that much cash.</p><p>“Jasmine was hoping this would appease your feelings and help you get on with your life,” David had the gall to say.</p><p>“Tell Jasmine no thank you,” Derek growled at him and then turned and walked away. He never looked back. He’d been pissed when David had offered to pay him off but when he found out it was Jasmine’s idea he saw red.</p><p>He couldn’t believe how wrong he’d been about her. The thing that made him even angrier was the grief coursing through him at knowing he wouldn’t see her again. As he walked back towards his childhood home he vowed someday he’d have her begging him to take her back and then he’d be the one to walk away.</p> <p>He’d made his way home, told his father goodbye and then left for the city. He worked night and day until he purchased his first company. He was excellent at his job. He found companies that were on the verge of bankruptcy, bought them and divided them up, making huge sums of money. His first takeover had led to many, many more. He was now worth far more than Jasmine ever had been and he was about to exact his revenge.</p><p>He downed a scotch and then went to bed. His day was a full one tomorrow and he wanted to be well rested for what was to come. He’d finally have Jasmine at his mercy, when her daddy no longer had any money left.</p><p>Chapter Two</p><p>Derek sat back at his desk, with a huge Cheshire cat grin on his face. The papers were all signed and now he was the owner of The Freeman Corporation. He felt unbelievably good. He had taken it right out from under David, without the man even being aware of what was going on.</p><p>David knew his company was in trouble but he didn’t know about the hostile take-over. Derek’s victory felt so much better, knowing David had walked into his former offices today only to be met by Derek’s security.</p><p>He’d been tempted to be there, sitting in the man’s chair, just so he could see his reaction. He’d barely been able to stop himself but he had plenty of time to gloat. He turned around and stared out the huge windows of his office, looking down at the thriving city of Seattle. He always felt good when he acquired a new company but this one was different. This one was the pinnacle of everything he’d been working for over the past ten years.</p> <p>Derek heard commotion outside his office and turned around to find the man in question had barged in through his doorway. Derek’s secretary came chasing after him. “Sir, you can’t go in there,” she was trying to say, her voice and eyes panicked.</p><p>“It’s okay Lana, I can handle this,” he told her. She apologized and stood there, not knowing what to do. “You can call security, I have a feeling Mr. Freeman will need to be escorted from the building once we are done talking,” he finished. The smile never left his face. This confrontation was coming far quicker than he’d expected.</p><p>“You piece of crap!” David yelled at him.</p><p>“It’s good to see you again, David,” Derek said, never losing his cool.</p><p>“I was getting things straightened out and then you swoop in and steal my company out from under me,” the man continued to yell. He was so angry, his head was completely red and he could barely speak. The angrier David got, the calmer Derek felt.</p><p>“I guess you should’ve run your business a bit more above ground and not left it vulnerable to a takeover,” Derek said. David looked like he wanted to jump across the room and strangle him. Derek looked over the man, who had seemed so much larger than life when he was still a teenager. The man now looked shrunken and old. It was satisfying.</p><p>“I ran my business successfully, for over forty years, you pompous piece of trash. You may have the rest of the world fooled but I know where you come from and I know who you really are,” David spat at him.</p><p>Derek was losing some of his calm. He narrowed his eyes on the man who had changed his life. He knew David was trying to get a reaction from him but he refused to bite.</p> <p>“Unlike you, David, I kept a protective, watchful eye on my business. I may have started out on the wrong side of town, as you like to point out but I made choices to change my life and now you’re the one who will have nothing,” he said, with a mocking smile.</p><p>David actually lunged at him, as the security guards stepped into the room. Derek held his hand up, to stop them from grabbing the man. He wanted him to try and throw a punch. Derek was normally not a violent man but it would be his total joy to knock David across his pathetic jaw.</p><p>David saw the look in Derek’s eyes and quickly backed down. “This isn’t the last you’ll hear from me,” he said, still not leaving.</p><p>“Security please escort Mr. Freeman from my building. Let the front desk know he’s no longer welcome to step foot on the premises,” he finished. He then turned his back on him, as if he didn’t matter in the least to him.</p><p>“I will get you back for this, just you wait,” David yelled, as the men dragged him away. Derek continued to smile as he sat back down and once again looked over the papers that gave him ownership of the Freeman Corporation.</p><p>Derek pressed his buzzer, “Lana can you please pull up the full employee list for The Freeman Corporation and the financial documents.”</p><p>“Yes sir, I will have the information to you within a few minutes,” she replied, as efficient as always. He didn’t know how he’d been so lucky to find her but if she ever retired he’d have a hell of a time replacing her.</p><p>She brought the information to him and he got to work. He hadn’t done his normal homework when acquiring the corporation. He normally knew the business inside and out before he took it over. He simply hadn’t cared with this one. He was buying it up no matter what. He didn’t even care if the buy ended up costing him millions; he had the money to spare. This was about his pride and nothing more.</p><p>As he studied the papers over the afternoon, he was surprised to find there were some legitimate reasons to keep the company as it was, instead of splitting it up like he normally would do. If David had run things how he was supposed to, the corporation would’ve never gone into jeopardy of being taken over. The man was more of an idiot than Derek had originally thought.</p><p>He’d have to think about what he was going to do with this one. If he decided to leave it in tact, the first thing to go would be the name. Derek wouldn’t leave that man’s name attached to any aspect of the business.</p><p>The Corporation was a major producer of medical equipment. They actually made a quality product but had a horrible marketing department. If the right people were brought in, he may decide to keep the company together.</p><p>As he studied through the papers over the next several days, he discovered David had embezzled millions of dollars. That was one of the reasons the company was in such a weak state. He’d leave the legal department to look further into it. He wouldn’t mind if the man ended up in prison. It would just be icing on the cake.</p><p>The minute David had placed the corporation on the stock market; he had investors to be accountable too. Since David had been stealing from those investors for years, they were going to want answers. He smiled some more as he thought about David’s life continuing to go down the drain.</p><p>He left all the staff at their jobs for now but had memos sent out notifying them they were going to have to defend their jobs. He normally left all of that to his staff but since this operation was personal to him he’d be conducting many of those interviews, himself.</p><p>Derek had a couple of trusted associates coming with him and he was like a kid on Christmas morning. It was time to go to his new corporation and do some investigating. He’d made the decision to keep the company as it was but there would be a lot of people losing their jobs and a lot of new hires. It would take months to get it all straightened out.</p><p>He was getting ready to leave, when his father walked into the office. “Where are you off to, son?” his dad asked.</p><p>“I’m going over to the new company today. I have to eliminate some staff and get the HR set up to hire new employees,” he answered as he headed towards the elevator.</p><p>“I’ll come with you, since I’m a great judge of character,” he said, as he climbed in the elevator with him.</p><p>“That would be great. I could use an extra person I trust,” Derek answered. He knew his father had a soft heart but he was also a shrewd business man and would know who could be trusted to stay on and who was far too loyal to David to be trusted.</p><p>“Son, I know this has been your dream since that dirt bag hurt you but you need to remember most of these employees didn’t even know David Freeman. They’re just like you or I, trying to make a living,” his father reasoned.</p><p>“I hate it when you’re right, but I know. Most of the executive positions will be replaced. I simply can’t trust people who worked closest with David. I’m not worried about any of the factory workers. My staff will make sure all of their background checks pass but other than that I’ll leave them alone, well not completely leave them alone,” he added.</p><p>“What?” his dad asked, with confusion.</p><p>“David was by far underpaying the factory workers, while padding the executives’ pockets. They are barely making minimum wage,” Derek said with anger. “I’m going to raise their pay and offer bonuses for high work production and early completion of projects.”</p><p>“That’s why you’re so successful son, you actually care about the core of the company,” his father praised him. Derek knew what it was like to barely be able to survive and didn’t like that feeling. He always treated his employees’ well. He had a very low turnover rate. Once people came to work for one of his corporations, they didn’t leave. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“The bastard didn’t even offer health insurance for his factory workers. It really is no wonder he was losing everything,” Derek continued to rage.</p><p>“Well just remember these people are scared about their jobs and don’t know you’re different. It would be a really good idea if the first thing you do is call a meeting and reassure them,” Daniel said.</p><p>“You’re right, again. I wasn’t planning on doing that but I’ll call a meeting first thing tomorrow. I want to spend today looking around and then eliminating some of the dead weight,” Derek told him.</p><p>“Sounds like a plan, son,” Daniel offered, as he slapped Derek on the back.</p> <p>They rode to the new office in silence. Derek was immensely satisfied to see the crew working on the new sign out front. The old one was down and the new sign was going up with his corporate name on it. Each time he saw that, his heart skipped a beat with pride.</p><p>He knew he had to take apart most of the corporations he bought up. He made far too much money not to split them apart, plus some of the companies were unfixable. He did love to keep the good ones together though, turning them back around. He could provide so many jobs for people and the feeling of success, as he fixed them, was what drove him.</p><p>Derek walked into the building, surrounded by his best team members and his father. He knew they made an intimidating sight and he enjoyed the looks on the staff members faces as they walked down the hallway.</p><p>They approached security. That had been the first change he’d made. He always put in his own security team, immediately. He didn’t want the previous owners stepping foot back in the buildings after he took them over.</p><p>“Good morning, Mr. Titan, it’s good to see you,” the guard greeted them.</p> <p>“Hello Tim, how are things going here?” he asked.</p><p>“Everything has been mellow the last few days. Mr. Freeman tried to come in the day after the take-over but was escorted out and hasn’t been back since,” the man reported.</p><p>“I’ve had new badges created and no one enters without one of them. All employees who are kept will receive their badge before they leave today. There will be a lot of people let go and I don’t need them sneaking back in and causing trouble. I also want several security personnel up on the twenty-fifth floor to escort people down as they’re let go. Today, unfortunately isn’t going to be a pleasant one.”</p><p>“No problem Mr. Titan, I will send them up right away,” he answered.</p><p>“Here’s your new badge and some for your men. Some workers will be in over the next few days setting up key pads for all the elevators and exits. Here’s the list of men who will be here doing the work. These men and only these men are allowed in. If their company tries to send over replacements call me and I’ll let you know if they’re approved or not,” he finished.</p><p>“Okay boss,” Tim replied, then set to work making phone calls.</p> <p>Derek spent the first part of the morning exploring the huge building. The most time was spent down on the bottom floors, assessing the factory and its workers. They were eyeing him with trepidation and he knew his father was right; he needed to speak with them soon. The work was going slow and he noticed obvious mistakes being made. He knew a lot of that had to do with their lack of enthusiasm for underpaid work and part of it had to do with the fact they were so unsure of their futures.</p><p>He decided to call a meeting right away. It wasn’t the employees’ fault that the previous owner was a horrible man. Derek knew their attitudes would change, once they knew the changes he was making.</p><p>He spoke to his men, who went in search of the foreman on each floor. It only took about thirty minutes and he had all the factory workers assembled. He looked out at the massive crowd. There were about five-hundred faces looking up at him with fear. The job market was already terrible and all the people were in fear of joining the ranks of the unemployed.</p><p>He stood at the make-shift podium and grabbed the microphone. “My name is Derek Titan and I’m the new owner of this corporation. First, I want to assure you all we’re keeping this company open,” he started. He heard several people release the breaths they were holding. He also saw many in the crowd visibly relax.</p><p>“There will be some changes made but I think you’ll like what we have in mind. It will benefit every one of you. I’ve looked through the financial records and you’ve been woefully underpaid and not offered benefits. You’ll receive a ten percent wage increase and offered health insurance. By the end of the day you’ll receive paperwork showing the changes. You’ll have to go through a background check to continue working here but you’ll see things are going to be much better,” he continued talking.</p><p>He was now seeing smiles in the audience and some with their mouths gaped open. He had to fight his own smile from spreading across his face. He needed to appear confident and in charge. He couldn’t appear to be a friend. The boss had to be respected, not necessarily liked.</p><p>“If you work hard for me and meet production deadlines you'll be rewarded. I want to turn this company around, into what it should be. You make quality products here, so let’s be a quality company as well. I want investors to walk through these stations and see happy employee’s, doing an above quality job. The better you do, the more bonuses you'll get. We will be setting up some HR representatives down here in the offices and bringing each of you in over the next few days to sign paperwork. This is a new corporation and if you do choose to leave we'll offer you a severance package. If you have any questions, please wait until you’re called in so we can move things along quickly,” he finished.</p><p>“Please return to work and your foremen will be calling you in over the next few days. I need all the supervisors to please meet me over here,” he concluded.</p> <p>He explained what they'd be doing in more detail to the supervisors, then made his way up to the executive offices. There weren’t many people around. He saw a few secretaries, who glanced wearily at him as he passed but not many others.</p><p>He walked up to David Freeman’s old office and sighed with delight. As he stepped through the doorway, he felt an overwhelming sense of accomplishment. The furniture had already been replaced. He hadn’t wanted to sit in the same seat or use the same desk as that man. He hadn’t touched the other offices but this one would be his when he was working there and it needed to be comfortable.</p><p>He sat down in his chair and turned it toward the windows. The office wasn’t as nice as the one back at his main office but it would do. He’d already had a complete overhaul done on it so there was brand new cherry wood floors and expensive furniture. He had priceless pieces of art hung on the walls and a top of the line computer system. He liked surrounding himself with the finer things in life.</p><p>He enjoyed the view from the huge windows and his few minutes of peace, before he had to continue his day. It was going to be a very long one and he knew he’d be lucky to get out of there before midnight. People were never happy to be fired and he had a lot of people to let go. He sighed, as he turned back to the computer and started looking through files.</p><p>Chapter Three</p><p>Jasmine walked into the familiar building, having to fight back her tears. There were men outside, working on placing a new sign. It was more proof the company no longer belonged to her father. She’d been trying to reach him for days, to ask him what had happened. He hadn’t even told her the company was in jeopardy of being taken over.</p><p>He wasn’t answering his phone, or returning her calls. She’d been to his place several times and was told he wasn’t there. She tried again that morning but wasn’t able to get past the gates and found a real estate sign on his front lawn.</p><p>Jasmine was trying to understand what was going on and why her father wouldn’t speak to her. She knew the new owner of the company was scheduled to be there that day and she was determined to get some answers. She’d worked so hard throughout the years and had some day hoped to own the company she cared so much about, but those dreams were now gone.</p><p>She would’ve walked out the doors when the take-over had occurred but she didn’t only have herself to think about. Her anger drained a little bit as she thought about her beautiful son. He looked so much like his father it made her heart ache sometimes with missing the man. She had to remind herself his father wasn’t the same man he used to be.</p><p>She started to pass the security desk, when she was stopped. “Sorry Ms. Freeman but we have some new procedures now, can you step over here?” the new guard said to her.</p><p>“What’s going on Tim?” she asked, perplexed. She actually liked the man. In a stressful situation, he’d been kind and helpful. He didn’t try to bully people, like some of the old guards had done. She’d came close to filing a sexual harassment case on the last head of security but her father had talked her out of it, saying it would look bad for the company. She’d made sure to never be left alone in the building with the previous guard though because she hadn’t trusted him.</p><p>“We have a new security system being implemented,” he told her. He then looked through his computer screen until he found her name. He typed some things in the boxes and then handed her a new badge. “This is just a temporary one. The boss is doing a bunch of cuts and when everything is done, the remaining employee’s will be issued permanent badges,” he finished, looking sorry. She had a bad feeling she was one being let go. She had to suppress the tears one more time.</p><p>She got on the elevator and took a fortifying breath. If she was going down, she was certainly going to do it fighting, she thought with determination. This new boss sounded like a real piece of work.</p><p>She was currently the head of Personnel and loved her job. She loved working with people on a daily basis. She’d hired most of the factory workers and was more scared for them than anyone else. She fought her father many times to give them better wages and benefits but he had treated her like a child telling her she didn’t know how to successfully run a business.</p><p>That was a bit ironic now considering he’d lost his business. Why wouldn’t he talk to her and explain what was going on?</p><p>Jasmine walked into her office, to find several strangers there, looking through her computer and files. “What is going on in here?” she demanded.</p><p>“Who are you?” an extremely attractive blonde asked her in a snotty voice.</p><p>“I happen to be the Human Resources director and this is my office. Who the heck are you?” she replied.</p><p>“I’m Amy and we're the current HR team, working on who will be staying or going. The president asked us to escort you to his offices immediately, once you returned,” the snide woman said.</p><p>“It would be my pleasure to see the man,” Jasmine spat, as she turned on her heels. She’d give the man a piece of her mind. It was rude to have people going through her stuff without consulting her first. She figured she was getting fired anyway, so she’d say what she wanted to.</p><p>She knew the floor well and stormed towards her father’s old office figuring the man would choose it for his own. After all, it was the largest in the building and the guy seemed to have some serious power control issues. Amy was running behind her, trying to catch up. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She stalked past the secretary, who gave a surprised expression, then looked confused. Jasmine didn’t even bother knocking. She threw open the door and stalked towards the desk. The man was sitting with his back to her but she didn’t care. He’d hear her just fine.</p><p>“Who the hell do you think you are, sending a bunch of strangers into my office to go through my files? I would’ve been more than happy to show them anything they’d asked for but the way you’re running things is a complete invasion of privacy to both me and the employees,” she shouted. She rarely raised her voice but she was so angry, she couldn’t control herself.</p><p>“I’m so sorry Mr. Titan. She returned from lunch and then stalked out of the offices before I could stop her,” Amy said a bit breathlessly. Jasmine’s whole world seemed to come to a standstill as the woman said his name. He slowly turned in his chair and their eyes connected.</p><p>She couldn’t breathe, as she realized the man who had turned her world upside down again, was none other than her ex-lover. Her knees would no longer hold her up and she sank down into the chair, which was thankfully positioned behind her. They stared at one another as the seconds ticked by.</p> <p>“Thank you Amy, you can leave us now,” was all he said, in his cold, controlled voice he had developed.</p><p>“But sir, you said you wanted one of us in here as you let people go...” she began protesting.</p><p>“I said leave,” he told the woman. She looked at him with surprise and then glared at Jasmine, before heading out the door, which she slammed behind her. Jasmine could see the woman thought of Derek as more than her boss.</p><p>Jasmine wouldn’t put it past him to be sleeping with his employee’s. He was loaded now and apparently thought he could do anything he wanted.</p><p>“I didn’t realize you worked here. I guess I should have spent more time studying the personnel file,” he finally said to her. He’d figured the princess hadn’t worked a day in her life. He was sure she didn’t really work here either but more likely played at the office all day while collecting a huge paycheck. That was all over for her.</p> <p>“Why would you do this?” she asked him. She didn’t understand why he’d want to destroy her father. Derek had been the one to walk away, why would he possibly come back into her life in such a horrible way?</p><p>“It was a good deal,” he answered her with his cold eyes. She felt her anger rising again at his dismissive attitude. He really was a cold hearted bastard. They sat, staring at one another. She refused to be the one to break the silence.</p><p>“What position do you hold here?” he asked her with a smirk as if he couldn’t imagine she’d know how to work. His tone infuriated her even further.</p><p>“I’m the head of personnel and I do a great job at it,” she said between clinched teeth. He didn’t say anything as he pulled her file up on his computer. He sat there, going through the file for a full ten minutes, while she sat in the chair fuming.</p><p>“You have worked here for six years it seems. I’m surprised you went to college,” he said with a derisive look at her.</p><p>“I graduated at the top of my class and I’m excellent in my position. If you fire me, I will sue you for wrongful termination,” she spit out at him.</p> <p>Derek smiled at her words. His initial thought was to fire her but the idea of being her boss seemed far more appealing to him. He’d control her paycheck, which meant he controlled her life, because her dad wouldn’t be able to bale her out, anymore. The man was bankrupt and just about as poor now as Derek had been as a child.</p><p>Derek looked through her file some more and was surprised by how low her salary was. If she’d been working at the same position in his main company, he would’ve been paying her almost double what she made here. Her father was a selfish man, even with his own daughter, it seemed. Derek didn’t realize why that surprised him.</p><p>“You’ll soon find I don’t take well to being threatened, Ms. Freeman. I’m not firing you today but you’ll only remain on the staff for now on a trial basis. If you don’t work to my far stricter standards then you’ll be let go,” he said as he leaned back in his chair.</p><p>She wanted to stand up and slap him across his smug face. She had never in her life been so angry. How could he look at her so coldly? How could he have turned into this cruel hearted man? She was so grateful she’d never told him about her son, because she was sure he would’ve tried to acquire him the same way he acquired his businesses.</p><p>“I do my job very well. I will expect to be treated like any other employee here. I also don’t want to speak with you anymore,” she said as she stood up to leave. She needed to find a bathroom quickly, where she could break down in private.</p><p>Before she’d taken more than a few steps he grabbed her arm and she was suddenly standing there, far too close to him. She cursed her traitorous body wanting to lean up against him. His smell was invading her senses, making the heat pool up in her core. No, no, no, she shouted at herself. She refused to let him affect her.</p><p>“It would be hard to treat you like any other employee since you’re the only one here I’ve sunk deep inside while you cried out my name,” he whispered to her, bringing his lips only centimeters from her own. “And I hate to tell you this but as head of personnel you’ll be working very closely with me as we have a lot of jobs to replace over the next few weeks. If you can’t handle the position please feel free to walk out now,” he growled.</p><p>Derek was supposed to be getting to her but was angry by his own body’s betrayal. The second he touched her arm lightening shot through his fingertips, straight to his groin. Her smell, which was so much more delicate than most women, surrounded him. He wanted to pull her into his arms and take her immediately on his new desk.</p> <p>He was trying to play with her and instead he was the one who was getting burned. If it weren’t for her eyes widening in desire or the fact her breathing was getting shallow he would’ve completely lost it. Seeing her desire for him was giving him back some strength. He’d have her again but it would be on his terms and he’d be the one to walk away, leaving her wanting more.</p><p>It took every ounce of his control but he stepped back and casually propped himself on the edge of his desk. It would look like she hadn’t affected him at all. He was great at putting on masks.</p><p>She had her hands clenched at her sides as she got herself under control. His lips turned up at the corners in a mocking smile as he waited her out.</p><p>“First of all, what happened in the past is long over. I haven’t thought about you since the last day we were together. Had you not brought it up, I would’ve completely forgotten we even had sex,” she lied to him. She got some pleasure as his smile was wiped off his face and his eyes narrowed at her.</p><p>“Secondly, I can handle anything. If we need to work together I can stand being around you. I just prefer not to since you disgust me,” she spat as she made her exit. She raced down the hallway and into the ladies room, where she emptied her lunch. She sat on the floor for several minutes as she regained her composure. She didn’t know how she was going to be able to handle working for the man who’d broken her heart so badly she’d been afraid to get involved in other relationships.</p><p>She’d try and work for him as long as she could, while she started searching for other work but she couldn’t go without a paycheck. She had her son to think about. She gathered herself together and then walked proudly back into her old office. Amy looked up to glare at her. She glared right back. She had zero tolerance for the jealous woman.</p><p>“If you would please move, I need to get to my desk,” she said, proud of the authority in her voice.</p><p>“He didn’t fire you?” Amy asked in shock, before she could stop herself.</p><p>“He has no reason to fire me, I’m excellent at my job,” Jasmine replied. Amy stalked out of the room, Jasmine assumed, to find out if she was telling the truth.</p><p>“I need to gather a bunch of things together to go over with Mr. Titan, can I please have some privacy?” she asked the people in the room, with steal in her voice. She may have been asking but if they refused to leave, then she’d no longer ask, she’d demand. This was still her office and she wanted it to herself.</p><p>The other two people left without a word. She was assuming they were running to the boss to find out if she could kick them out. She simply didn’t care. She had nothing to hide but didn’t feel she had to share her space with a bunch of strangers.</p><p>Derek sat back down at his desk after Jasmine departed. He was angry with her but far angrier with himself. He couldn’t believe he’d let her get to him. The whole point of his revenge was to affect her, not the opposite way around.</p><p>He was incredibly pleased to find out she worked for the company. He’d simply been planning on cutting off her cash supply by breaking her father. He would’ve been to the offices sooner had he known she was an employee. He should’ve done more research so he could’ve been prepared to see her that afternoon. Things were going so much better than he had hoped. He’d been expecting her to show up at his door, begging him to give her father some mercy.</p><p>Instead he had her working under him. That thought made his groin tighten once again. He really wanted her under him again. He wouldn’t take her until he was more under control, though. The whole point was to teach her a lesson for walking out on him, not falling for her all over again.</p><p>He ran his hand through his hair in frustration at how easily she got to him. There was a knock at his door and then Amy walked in. He didn’t like her personally but she was a shark when it came to business and a good addition to his staff.</p><p>She sauntered over to him, not quite able to control the fury in her eyes. “I thought we were going to be discussing everyone in the executive office who was going to remain on staff or be let go,” she said in her most seductive voice. It did nothing for him.</p><p>“I’m assuming you’re talking about Ms. Freeman,” he said.</p><p>“Ms. Freeman?” she asked in surprise. “Is she related to the previous owner?” she finished, losing some of her normally cool composure.</p><p>“Yes, she’s his daughter and I’m letting her keep her position for now,” he said in a voice that brooked no room for argument.</p><p>Amy stared at him, somewhat perplexed and more than a little angry. He could tell she was trying to figure out exactly what his and Jasmine’s relationship was. He didn’t have any desire to fill her in on his personal life. It was none of her business.</p><p>“Are you keeping her as some sort of power strategy?” she asked hopefully.</p><p>“Something like that,” he answered nonchalantly. The answer seemed to satisfy her. She once again put on her seductive persona. He sighed, as he thought he was most likely going to have to let her go. She was getting far too confident and starting to push boundaries.</p><p>She sidled closer to him. “Do you want to get some lunch, I’m starving. Or I could order in and we could eat here while discussing some more strategies,” she suggested as she sat on the edge of his desk. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Normally, he would’ve been turned on by the sight of a sexy lady propped up on the edge of his desk, deliberately showing off her uncovered thighs. He’d never been attracted to Amy, though. She wasn’t his type, in the least. He liked a far less power hungry type of person in his bed.</p><p>“Why don’t you and the other’s go out to lunch? I have a lot to get done before we start bringing people in. Besides, I will be going over some records with Ms. Freeman in a while,” he told her.</p><p>Her eyes narrowed again at the mention of Jasmine, and cemented his decision of letting her go. He wasn’t going to tolerate a jealous woman in his offices, especially when she had nothing to be jealous about.</p><p>There was another knock on the door and then his two most trusted employees stepped in, looking a bit frazzled. They weren’t easily shaken, so he was concerned. “What is it?” he asked them.</p> <p>“Ms. Freeman basically kicked us out of her office and we weren’t sure of what you wanted us to do so thought it smarter to talk to you than cause a scene,” Greg said.</p><p>“I see, well you did the right thing. Ms. Freeman and I will be talking but for now go have some lunch and we will get things worked out this afternoon,” Derek said. He needed a break. It was always difficult when you had to fire people, especially when the takeover was a complete surprise to all those involved. He never enjoyed this part of his job. This company was his exception though and the ones who got fired were having it done because they deserved it.</p><p>The two men left before he could change his mind. Amy lingered for a moment and then followed them out the door. He called his head office and spoke to personnel there. He had them arrange a severance package for Amy and would have her employment ended before the day was out. Once she got back from lunch he’d send her over there. He hated when things got messy. He had a feeling she wasn’t going to go quietly, which was too bad.</p><p>He ordered some food to be delivered and then walked over to Jasmine’s office. He stood at her door and watched her for a while. She was engrossed in what she was doing and didn’t notice him standing there for several minutes. When she finally looked up and their eyes collided it was like he was being punched in the gut again. He really hoped that went away soon.</p><p>“Have you gathered together the files?” he asked her, proud his voice carried the cold note to it that had made so many people tremble in their boots.</p> <p>“Yes, everything is together but it would be easier to do it here. There’s a lot and it will take several trips to get it to your office,” she said.</p><p>“I prefer my office. We have a large table we can lay everything out on, plus that’s where we will be calling people in,” he said, expecting her to cave to his wishes. She blew her breath out in frustration before standing up.</p><p>“Fine, we can do it your way but I’m not breaking my back to lug all these boxes over there,” she told him and then walked out the door with the stature of a queen, expecting her servants to follow behind her.</p><p>Before Derek could stop himself, he felt a smile tug across his features. She was definitely hot when she was angry and she’d been angry since she had walked into his office. He was now looking forward to the incredibly drawn out afternoon.</p><p>Derek grabbed several of the security guards to transport the boxes to his office. By the time they got everything over, his lunch arrived. He ordered plenty of food and offered some to Jasmine, which she refused. He smiled at her stubbornness.</p><p>“Can we please get started, I can’t stay late tonight,” she said to him.</p> <p>He was instantly irritated she was trying to assert her authority. He decided it was time to put her in her place. She was no longer the daughter of the boss. She needed to understand that quickly.</p><p>“You need to realize during a restructuring of a company this size there will be many nights of overtime. I expect you to put in the hours needed to make this place a success, if you expect to keep your job,” he told her, with no room for mercy.</p><p>Her shoulders slumped and he was surprised to not feel joy at her defeat. He couldn’t figure out what was wrong with him. He wanted to destroy her, so why was his little victory not pounding through his veins?</p><p>She pulled out the first file and they went through it. He had two different piles on the table. There was a stack with records of the employees he was letting go, with no chance at keeping their jobs. The other was a stack of files where the employees would at least get the chance to interview with him. If he liked what they had to say, they’d keep their positions. If the interview didn’t go well they’d be let go.</p><p>Amy and his men got back and he sent her to the main offices. She huffed as she went out the doors. He didn’t miss the look she shot at Jasmine. It just reinforced his decision to let her go.</p><p>He sent his men into the conference room next door, with a handful so they could start calling in employees to be let go. He could hear the yelling through his walls as some of those employees, very vocally, expressed their outrage.</p><p>It was six in the evening when Jasmine looked up wearily. “I really need to get home. I have something I have to do tonight,” she said to him. His eyes narrowed to dangerous slits as he wondered what it was she had to get to. Was she late for a date? He knew it was none of his business but he’d decided he wanted her again and he didn’t want another man interfering.</p><p>“We can work on this more tomorrow. I can already see it will take us all week,” he said to her. He was going to find an excuse to go to her place within the next couple of days to find out why she was in such a hurry to leave the office.</p> <p>“Thank you,” she muttered, like it was choking her to say the kind words. She quickly left, needing to get far away as quickly as possible. Derek was exhausted himself and decided to call it a night.</p><p>He walked out of the building, which was pretty much empty, except for the security staff. He drove home, wanting the night to get over with so he could be with her again. He tried to convince himself it was for his revenge but the more time he spent with her the more the line faded.</p><p>Chapter Four</p><p>Jasmine rushed in the door of the school gym. She hadn’t even had time to run home and change. Her son was in the fourth grade and very proud to be on the wrestling team. He had a match that started twenty minutes ago and she was praying she hadn’t missed it. She hated missing any events in his life.</p><p>She ran through the doors and found where the kids were sitting. She walked over to him and wanted to give him a kiss but knew that would embarrass him in front of all his friends.</p><p>“I didn’t miss you wresting, did I?” she asked with concern.</p><p>“No Mom, I’m up next,” he said with a shrug. He was trying to act like it didn’t matter but she could see the relief in his eyes she was there.</p><p>“Good. I’m sorry I got here so late but there was some extra work to be done at the office,” she explained.</p><p>“It’s okay, Mom,” he told her in his far too understanding voice. He was such a good boy. She couldn’t imagine her life without him in it. She walked over to the bleachers and sat down. When it was her son’s turn to wrestle, she cheered him on and clapped the loudest in the crowd when he won.</p><p>He ran up to her and gave her a rare public hug afterwards, forgetting for a minute he was too old to give his mother public affection.</p><p>“I’m so proud of you,” she exclaimed to her son.</p><p>“Thanks Mom, I have to go back over with the team now,” he said, as he practically danced back over towards his teammates. She’d love to go back to being a kid, carefree and excited so easily. Her stomach clenched as she thought about the excitement that rushed through her body when Derek had stood so close to her.</p><p>She pushed those thoughts out of her head. She was with her son now and wouldn’t think of Derek. She had to put up with him in the office but he wasn’t allowed to invade her private time. She sighed, as she realized how hard it was going to be to keep the man out of her thoughts when she had to work with him all day.</p><p>Age had been far too good to the man. His boyish muscles had matured and when he'd taken off his suit jacket, exposing his wide shoulders and large biceps, she had to fight drooling. She'd once known his body as intimately as she knew her own and she missed the feel of his hands on her. She hadn’t had any man’s hands on her in far too long.</p><p>Maybe it was time to start dating again. She’d been asked out by Jacob’s wrestling coach and put him off. Maybe she should just accept the invitation. She’d think about it and not do something rash because her hormones were in an uproar.</p><p>The match ended shortly and she and Jacob headed to the car. “How would you like to go to dinner tonight?” she asked him.</p><p>“Yes! Can we have pizza?” he pleaded with her. The kid could eat pizza for breakfast, lunch and dinner if she let him.</p><p>“That sounds perfect,” she replied and headed to the local parlor. She gave him a bunch of quarters for video games and then sat watching him from the table. They soon ate and then headed home. Both were exhausted from their busy day and quickly went to bed.</p><p>The next morning, Jasmine rode the elevator up to her floor, trying to ignore the butterflies in her stomach. She was hoping Derek would have other things to do that day and not want to spend the entire time with her in the office again. She didn’t know how many days in a row she could stand being with him all day long, before she exploded.</p><p>The man smelled far too good for a stuffy executive and when she was with him, she couldn’t get the images of herself wrapped in his arms, out of her head. She had to remind herself not only had he walked away from her, after stealing her innocence but then he had come back to take over her father’s company as well. He was heartless and she’d be much better off remembering that.</p><p>She could in no way allow him to know about her son. He cared only for himself and anything he deemed his, he’d take mercilessly.</p><p>She sat down at her desk and no more than five minutes later, her buzzer was ringing. She picked up, already knowing who was on the other line. “When did you get in, I have been trying to get ahold of you for an hour,” Derek’s voice snapped over the line.</p><p>“I got here a few minutes ago and I’m twenty minutes early, as it is,” she said with frustration.</p><p>“Get over here, we need to go through the rest of the files,” he commanded and then hung up.</p><p>She wearily got to her feet and walked to his office. The secretary wasn’t even there and she had passed many empty offices along the way. He really was changing everything about the building. All those familiar faces were going to be gone. She didn’t particularly like any of the people who were getting fired but it was still nice to have familiar faces around her. There was some comfort in it.</p><p>Jasmine walked in the door and Derek had to make sure his features remained void. She was stunning in her green skirt suit. It matched her eyes to perfection. She once again had her hair up in the unflattering bun, which he wanted to yank out, but her face was stunning. She wore hardly any make-up, being she was one of the few women who simply didn’t need it.</p><p>She sat down at the table and he sat next to her. Her light scent drifted over to him and he could feel his pulse start to race and his pants start to get far too tight. He’d have to take her far sooner than he planned just to get her out of his system. Then he could get his libido back to normal. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He knew he was affecting her just as much as she was affecting him. He could see her chest rising faster as her breathing deepened. He could even see her pulse speed up through the delicate skin of her neck. He was going to test his limits of control that day.</p><p>He scooted far closer to her than was needed. He could see she wanted to move away but her stubborn attitude refused to allow her to show any weakness. Their shoulders were brushing together as he leaned in to look at the file she currently had opened in front of her.</p><p>“So what have you been doing the last ten years?” he asked her. For once in his life he had zero interest in the business in front of him that needed to be done.</p><p>“That’s none of your business, it has nothing to do with my job,” she snapped and tried to pull his attention back to the file. “This is Anthony, he works in accounting. I have spoken to him on a few occasions and even went to my father because it looked to me like he was into some unethical business practices but my father said it was fine. I would personally not trust him,” she finished, as she pushed the folder closer to him.</p> <p>Bringing up her father was as good as throwing cold water in his face. His libido was put on hold as he took the file. He looked through the exceptionally detailed folder and then added the man to the fire pile. They continued to go through the files one by one and they mostly agreed on who deserved a chance to stay but every once in a while they came to an impasse.</p><p>She would argue for some person to stay but she’d lose. Once he set his mind on something, it was difficult to change it.</p><p>She pulled forward another file and made her case for the man to stay employed. He looked through and decided to let him go. He tossed the file into the termination pile and she snatched it back out. “I really think you need to interview Henry. He’s a good man and does exceptional work. You don’t even know him, so you can give him the courtesy of at least speaking with him, before you end his employment,” she demanded.</p><p>Derek raised his eyes at her outburst. She’d argued for a few people but hadn’t been so emphatic about it. He wondered who this Henry was and if he was possibly her reason for having to leave yesterday. He moved him over to the interview pile, just because he wanted to see who the competition was.</p><p>“Thank you,” she said although it came out through clenched teeth and didn’t sound like a ‘thank you’ at all. It sounded more like she wanted to call him a few names.</p> <p>“I need some lunch, let’s go out,” he said, suddenly needing to get out of the offices for a while.</p><p>“I will eat in,” she said, completely shutting him down. He didn’t like to be refused, which she was better off learning now.</p><p>“It will be a business lunch so you’ll accompany me,” he demanded. He grabbed his jacket and walked to the door, holding it open for her to exit. If looks could kill, he would’ve been melted right on the spot.</p><p>She jerkily got up and followed him out. He could practically see the steam rising from her ears. He was amused by her attitude and surprised by that amusement. He wasn’t used to being so openly disobeyed but he liked that she was unafraid to challenge him.</p><p>He drove them to a diner he enjoyed several times a week. The staff knew him well and led them to a private table in the back of the restaurant. He liked the place for its privacy when he needed to talk to a client, or take a date out. He used it for many different purposes. He was a person that didn’t mess with a good thing once he found it.</p><p>Jasmine narrowed her eyes further as she looked around at the intimate restaurant. It was the middle of the afternoon and there were candles burning on the tables. She glared some more at his back as she followed him to the table in the corner.</p> <p>If he really thought he was going to try to seduce her, he had another thing coming. The hostess sat them down and then asked what they would like to drink. He ordered an iced tea. Normally Jasmine didn’t drink alcohol, especially in the middle of her work day but she had the feeling she was going to need a glass, if she was going to make it through the rest of the day without snapping at him.</p><p>“I’ll take a glass of red wine,” she said with a smile. He raised his brows at her but didn’t say anything. She was testing her limits. Let’s see if he’d fire her for having a glass of wine at a lunch he’d forced her to accompany him on.</p><p>Their appetizers came out and Jasmine found she was starving. The food was excellent and it disappeared quickly. Derek chuckled as she looked at his plate. She always had enjoyed good foods, good wine and great sex. His groin tightened once again.</p><p>The rest of their meal came out and they ate comfortably. She let her defenses down and chatted with him as the wine loosened her tongue and the food sated her stomach.</p><p>She excused herself to go to the restroom and was adjusting her hair when Amy approached her from behind. The woman didn’t look happy at all.</p><p>“I see you’re getting very cozy with the boss,” the woman snarled. Jasmine had no idea she’d been fired. She just now realized she hadn’t seen her in the offices all morning.</p><p>“It’s a business lunch, not that it’s any of your business,” Jasmine said and then made to go around her.</p><p>“It looked a lot cozier than a business lunch. I wouldn’t get too comfortable with him if I were you. He likes to add notches to his bed post but he gets bored quickly and then tosses you out even faster,” Amy said with anger.</p> <p>Jasmine stared at her as she realized what the woman was saying. She was one of his cast offs. She was horrified to have her thoughts turned into reality.</p><p>“I see the light is dawning. Yes, we’ve been intimate a long time. I’m actually expecting him to propose marriage at any moment but it seems he wants to sow some more oats before settling down,” Amy said with a smug look on her face.</p><p>“How could you want to be with a man who won’t be faithful to you?” Amy asked.</p><p>“He can have his flings now, because once he puts that ring on my finger, he will be mine and will no longer have any desire to find whores,” she said as if she really didn’t care and then looked at Jasmine, implying she was one of those whores. She walked out of the bathroom, leaving Jasmine staring after her.</p><p>Jasmine took a few more minutes, before finally walking back to the table. Derek was looking at her with curiosity. She realized she’d been gone for a while. She didn’t say anything to him, she just gathered her jacket and started heading for the door. She didn’t offer to cover her portion of lunch. He’d insisted she come with him, so he could pay for the overpriced meal.</p><p>Derek paid for their lunch and then met her out at the front curb. He couldn’t figure out what had changed from the time she’d left the table, to the time she came back from the bathroom. She’d been starting to relax around him before she’d left.</p><p>He was actually glad she was back on guard. It was too easy to forget who she was when she was being charming.</p><p>They rode silently back to the office and the elevator was filled with tension as the numbers slowly crawled up to the top floor. He heard her actually let out a sigh of relief when the doors opened. She jumped out like the hounds of hell were after her. He enjoyed the sway of her hips as he followed her along the hallway to his office.</p><p>The room was unusually warm and his mouth started watering when she slipped her jacket off, revealing a silky tank style blouse. It dipped in the front, to show a small amount of cleavage, increasing his desire to see more. It hugged her generous curves and showed her small waist off to perfection. Without the suit jacket on, he could see the curve of her hips, which the skirt enhanced. She’d grown curvier with age and now had a woman’s body, instead of the slim figure of a teenager.</p><p>His mouth went dry, as he fought not to grab ahold of her and feel how those curves fit within his hands. Her breasts used to fit perfectly in his hands. He could tell now they would spill out of his palms. His pants were once again far too tight. He quickly sat down, so she wouldn’t see his reaction to her.</p><p>She picked up another file, getting right back to work. “I need a break from looking at those folders. Let’s go ahead and do some interviews,” he told her. “Move over here to my desk and grab a notebook. I want you to jot some things down. We will start with your good friend, Henry,” he said with a grimace. He wanted to interview the man and then throw him out on his butt.</p><p>“That’s fine with me, after all, you’re the boss,” she said with a bit too much sugar dripping from her tone. He narrowed his eyes as he looked her over. He didn’t like being mocked; he was really tempted to show her a lesson or two about messing with him.</p><p>He called Henry and told him to report to the office immediately. Jasmine glared at him as he hung up. “You really don’t have to be so rude all of the time,” she mumbled. He let it go because there was a knock at the door. The man was quick, maybe because he wasn’t doing any work.</p><p>“Hello Mr. Titan, I’m Henry Andrews,” the man said, as he walked forward, with his hand out. Derek shook it and then narrowed his eyes. The man was in his late thirties and what women would consider good looking. His job was slipping through his fingers and the poor guy had no clue.</p><p>“Jasmine, I was wondering where you have been?” he said when he spotted her. He walked over to her and kissed her on the cheek. Derek was starting to see red again. He could care less what the guy had to say, he was going to be fired. It took all his strength not to physically throw the man out and tell him never to step foot on the premises again. He had to do things correctly though, or his legal department would be all over him.</p><p>“As you know Henry, we’re cutting many of the employees here. There’s always a lot of turnover when a company is taken over. You have a few minutes to tell me what it is you do here and defend your job,” Derek said in his coldest voice.</p><p>He could feel Jasmine glaring holes through him. He knew he was being even more cruel than normal but he instantly disliked the man.</p><p>“What Derek meant to say is we’re reviewing all the files of the employees and know you’re a valuable member of the team. Can you talk about your work?” she said, far nicer than he had.</p><p>Derek wanted to shout at her, that wasn’t what I meant at all but then he’d sound like a child throwing a tantrum. He sat down in his chair and pointed his cold eyes directly at Henry, who was either clueless to his aggression, or just pretending not to notice.</p><p>Henry started talking about his position in the Marketing department. He listed his projects and the various things he currently had in the works. He laid out things he had wanted to implement for months but had been ignored. Derek was getting in a worse mood, when he found that the man really knew what he was talking about and would actually make a strong asset to the company.</p><p>He placed his portfolio on the desk and Derek glanced through the organized notes. David had been holding Henry back and he figured the only reason Henry had stuck around was to be near Jasmine, because his talents were being wasted. As much as he wanted to throw the man out, he needed to have a cool head first.</p><p>He’d never once let a woman get between him and the bottom line and Henry could definitely help add to the bottom line. He never showed the man any of the thoughts going through his mind but he stood up to thank him for coming in and then sent him away. “We will let you know our decision by tomorrow,” he said, reverting to the corporation we, instead of I. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As soon as Henry left the room, Jasmine turned on him. She stalked towards him and there was fire in her eyes. He was unbelievably aroused by the picture she made. “How dare you act like a horses ass, you pompous, corporate drone!” she shouted at him.</p><p>She was less than a foot away, as she stared him down, with anger pouring off of her. He’d seen her angry before but he expected steam to start coming out of her ears at any moment. His own anger was rising to the surface. How dare she talk to him like that?</p><p>He pressed the button down on his phone. “I want zero interruptions into this room. I don’t care if the place is on fire,” he growled into the intercom.</p><p>“Yes sir,” came the reply and then the connection went dead.</p> <p>He started stalking towards her. She seemed to realize her predicament, because she began to retreat fast. Her temper evaporated, as her eyes rounded. He must have looked a little more frightening than he thought but his cool had left and his anger was boiling over.</p><p>She was the one who left him because he was poor. She was the one who thought she was still miss high and mighty. She kept trying to rub in his face he’d been replaced by her boyfriend. He couldn’t even think, he was so mad.</p><p>He backed her up until her legs hit the table. She stood pressed up against the hard surface. There was no escape. Her breath quickened, making her breasts rise and fall faster against his chest. Her cheeks were flushed, her lips were swollen from her nervously chewing on them.</p><p>Her eyes were still rounded in fear. If it had only been fear, he may have been able to pull out of his anger but he also saw some excitement in their depths. She still wanted him but she was fighting herself, as much as she was fighting him. He needed her now!</p><p>He felt a low growl rumble from his throat. He closed the small gap between them, crushing his lips onto hers. He grabbed her neck to pull her closer, pushing his tongue against her lips, demanding entrance.</p> <p>She reached her hand up to push him away but instead she ended up gripping his shirt. She couldn’t stop her own body’s betrayal. She was on fire as his lips turned from almost abusive to seductive. He accessed her mouth and then tangled his tongue with hers.</p><p>She could feel the heat pooling in her core as he deepened the kiss and pulled her so close to him she didn’t know where her body ended and his began. Her hands slipped up behind his neck and she found herself pulling him closer.</p><p>He groaned, as she tangled her tongue with his. She couldn’t get close enough. She pressed her aching core against his arousal and was surprised to find out the groan she heard was her own voice.</p><p>He suddenly grabbed her hips and sat her on the table, moving so he could fit between her thighs. Her silky skirt slid out of the way and then he was pulling her forward. The table was the perfect height, so he fit against her in the most intimate way possible. He ground his erection against her core, needing the clothing to be out of the way.</p><p>He couldn’t think beyond anything but his need. He was hungry and only she could satisfy him. He broke the kiss long enough to trail his lips down her neck. He whisked the shirt off of her in seconds and then gasped in pleasure at the scrap of lace, which was barely covering her incredibly luscious breasts. They were spilling out of the material, begging for his touch.</p><p>He didn’t disappoint her. He unlatched her bra and then cupped the glorious weight in his hands as he brought his head down to take her hardened, dusky pink nipple into his mouth. He sucked the pink bud deep inside his mouth and felt his erection jump as she groaned out her pleasure. The noises of ecstasy were quickly pushing him to completion. He couldn’t think, hell he could barely stand there.</p> <p>He moved his head to lavish her other nipple and then brought his lips back up to hers, no longer being able to keep from kissing her. As he continued to kiss her with years of pent up passion he undid his pants and then ripped her scrap of panties away. She groaned as he pressed up against her moist opening.</p><p>He reached down with his hand to feel if she was ready for him. She was wet, hot and tight and he couldn’t wait one second longer. He removed his hand and with one quick thrust, pushed himself deep within her core.</p><p>He groaned in complete ecstasy, as his shaft was gripped by her tight folds. He wasn’t going to last long. He continued to kiss her, as he grabbed her hips and thrust deeply in and out. She was crying out in pleasure, as he pushed his long length deep inside her body. She was surrounding him with her tight heat and it was the most pleasurable thing he’d ever felt.</p><p>He’d never had such intense or pleasurable sex in his life. She’d been a girl before, she was all woman now. She yelled out and then he felt her tight heat start gripping him in convulsions. Her entire body started shaking and that was all it took to send him over the edge. He groaned as he shot his release deep inside her.</p><p>His body continued shaking as he kept them connected until the very last spasm ran through their bodies. He reluctantly pulled back and then stared down at her. She was flushed, sitting there on the table, with her beautiful breasts exposed and her mouth swollen from his kisses.</p><p>Her normally perfect hair was pulled free of the bun and with her flushed cheeks, she was the most gorgeous creature he’d ever seen before. She looked like she’d just been devoured, which made him want to start all over again.</p><p>He was getting ready to kiss her, already feeling at a loss without her touch. Her expression changed from one of complete satisfaction, to horror at what she’d done. He knew the moment was over and now was the time for consequences.</p><p>She reached her hand up and slapped him hard across the face before he knew what was happening. He was shocked from the sting of it. He brought his hand up to his cheek, feeling the heat. He smiled a bit at the strength she’d exhibited. He’d never had a woman give that reaction after sex. They were usually purring with their content. He knew he was a great lover.</p> <p>He quickly took a step back, because smiling had been the wrong thing to do. She was furious. “Sorry about that Jasmine but you can’t blame the whole thing on me, you didn’t say anything to stop me,” he said to her, with his normally cocky voice back in play.</p><p>He was feeling anything but calm but there was no way he’d show that. If he thought one time was going to be enough to wash her from his system, he’d been very wrong. It would take being with her for a while before he was able to finally let her go. Just the thought of entering her tight heat again was raising his blood pressure, among other things.</p><p>Jasmine glared at him and then gathered up her clothing. She looked down at her torn panties with horror and then walked into his private bathroom and shut the door with a resounding click. She didn’t slam it in a fit of rage as so many women would’ve done. The click seemed to make much more of a statement. She didn’t reappear for a while. Derek was grateful for the time to gather himself together.</p><p>When Jasmine finally came out of the bathroom, her face was a mask. No one would be able to tell she’d just come apart in his arms. She was almost as good as him at wearing a mask.</p><p>“That won’t happen again,” she said to him, in the most professional voice she could muster. He looked at her words as a challenge and he never had been able to resist a challenge.</p><p>He said nothing to her. He was surprised she didn’t go stomping out of the office like so many women would’ve done, cursing him, or trying to yell sexual harassment. He was impressed. She sat down at the table and started going through the files again.</p><p>He called the secretary and had some drinks brought in and then had her leave the door open. He didn’t trust himself to be all alone, locked up in the office with her for the rest of the afternoon. He was having a hell of a time knowing she was right there, with nothing on underneath that skirt to keep him from touching her again.</p><p>They spent the rest of the day calling people into the office for interviews. He wasn’t real pleased to find she was correct about most of the people who came in. Those she’d fought to save were smart and knew how to do their jobs. The only one he was really struggling with letting go was Henry.</p><p>At five on the dot Henry poked his head in the door. “Hey, I don’t want to interrupt but I forgot to tell you Gina wanted to invite you over this weekend for some candle party thing she’s throwing,” he said to Jasmine. She laughed her first real laugh since Derek had stepped back into her life.</p><p>“Tell her I would love to come. Can I bring anything?” she asked him.</p><p>“She also told me to tell you not to bring a thing. She made sure I enforced that since you always go out of your way to make your own parties amazing. She said it’s her turn to pamper you a bit,” he added with a smile.</p><p>“Okay I get it, tell her I can’t wait and I’ll see you both this weekend,” she responded.</p><p>“No way am I staying with all you ladies. No offense but I’m taking off for the day with the guys to do some shooting,” he said. He then turned and left the room. Derek felt a little bit stupid of his jealousy now, considering the guy was obviously married.</p><p>At least he wouldn’t have to fire him. He thought he may even wrangle an invitation to go shooting with them, just so he could swing by the house and check up on Jasmine. She stood up and gathered her Jacket.</p><p>“We aren’t done yet,” he said automatically.</p><p>“I’m done. I have something to do tonight. It’s my normal quitting time and all the other employees are leaving. There’s nothing that will not hold over until tomorrow. Fire me if you want, I don’t even care anymore,” she said with defiance. She didn’t wait for his response; she just marched out of the room.</p><p>He sat there, a little stunned and a little turned on. He wasn’t used to being defied, ever. He was both impressed and irritated. He wasn’t sure which emotion was stronger. He decided to call it a day and gathered his stuff to head out.</p><p>It wasn’t until he reached his vehicle he realized he hadn’t used protection. He couldn’t believe how stupid that had been. He never forgot to use protection, it was just one of those rules he was emphatic about. He was sure he had nothing to worry about but he’d keep an eye on her over the next few months. He guessed her job was safe for at least that long.</p><p>Chapter Five</p><p>Derek got home and found his cousin sitting in his den with a drink in his hand and a smile on his face. He was immensely pleased to see the man. They were closer than any brothers could possibly be.</p><p>“I’m going to have to talk to the doorman again about keeping the riff raff out of here,” Derek said, not meaning one word of it.</p><p>“Yeah, I know what you mean, it seems like they will let any old bum in off the street nowadays. There’s no more home security,” Drew replied.</p><p>“At least we agree,” Derek said.</p><p>“How are you doing, Cuz?” Drew asked him.</p><p>“I’m great Drew, and you?”</p><p>“Well since I found your hundred year old scotch, I’m feeling pretty good,” Drew said, with an impish smile on his face as he held up the expensive bottle, which had considerably less liquid in it.</p><p>“Okay if you’re going to drink my best stuff, then the least you can do is pour me a glass,” Derek said, as he shed his jacket and rolled up his sleeves. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No problem. How’s the corporate take-over world treating you?” Drew asked, as he handed him the glass.</p><p>“I finally got my company,” Derek said with a genuine smile. He didn’t have to explain what that company was. Drew had grown up with him. He’d been there when Jasmine left him and he’d been there by his side as he plotted his revenge.</p><p>Drew was from the same area he was and had been just as determined to get out. It had always been him, Drew and their other cousin Ryan. Their fathers were all brothers so they shared the same last name. Ryan’s parents had died in a horrible auto accident when he was ten years old and he’d moved in with Drew, next door to Derek. The three boys had been inseparable.</p><p>They’d all left at twenty years old and made successes of their lives. They stayed in touch, as much as their work would allow and sometimes Derek really hated the distance that divided them.</p> <p>“That’s beyond great Derek, how did it all happen?” Drew asked with genuine interest.</p><p>“David was a very poor business man and all I had to do was bide my time and wait him out. He finally made one too many mistakes, leaving the doors wide open for me to come in and take over. It has felt great but I thought I would somehow feel more, like some completion or something.”</p><p>“I think you’re just growing up and getting revenge isn’t as important as it once used to be for you. What are you going to do with this one?”</p><p>“I’ve decided to keep it intact. The product is actually top quality and there are over five hundred factory employees who would lose their jobs if I divided it up. I think they will do a spectacular job once they are getting paid what they really should,” Derek answered.</p><p>“Turning soft hearted on me, huh? What happened to my cold hearted snake-of-a-cousin?”</p> <p>“I guess like you said, I’ve grown up and can think beyond myself once in a while,” Derek said, a bit uncomfortable with the praise.</p><p>“Don’t worry, I won’t tell your secrets to the world. They can all think you're still a jackal,” he said and then punched him in the arm.</p><p>“Okay enough about me, it’s been too long since we last talked, tell me what you’ve been up to,” Derek demanded.</p><p>“I just got back from Spain. We opened up another resort. You have got to come stay there, she’s a beauty,” Drew said. He pulled out a folder and Derek looked through the pictures. It was certainly an impressive resort, with all the bells and whistles.</p><p>“It has three Olympic sized pools, a full use spa, a couple top of the line workout rooms and so much more. It’s a ladies paradise and a man’s dream. I should get an award for this place,” Drew said enthusiastically.</p><p>Derek decided he’d take a vacation there, once he finished with the employee situation. He’d seen the beginning phases of this new resort and hadn’t realized it had been so long since he’d spoken to his cousin.</p> <p>Derek was used to staying in some nice spots but for the last five years he stayed at his cousin’s places whenever he could. He liked to review the service for Drew, since he wasn’t able to be in every place at once but he genuinely liked the resorts as well. They were top of the line and he got better service than he would at any regular hotel.</p><p>He’d been able to stay at them without them knowing who he was at first and get an honest review to his cousin but his name was just too big now and the employee’s knew him the moment he walked through the doors. It didn’t matter, the service was exceptional, whether they knew who he was or not.</p><p>“She’s my favorite one, so far. You know, it’s a hard life traveling to all these exotic places,” Drew sighed. He couldn’t contain the huge grin that split his face apart. The boys had never been out of the state of Washington until they hit their twenties, so the massive amount of travel they did now was almost incomprehensible.</p><p>“I seriously need to allow myself more vacations. Now that I’ve acquired Freeman Industries I can slow down a bit,” Derek said. He was only thirty years old but had experienced so much in his life he felt far older.</p><p>“Yeah, I think I see a few gray hairs in there,” Drew goaded him.</p><p>“I may be a few months older than you but I can still kick your ass,” Derek said not meaning a word off it.</p><p>“Yeah, I’m really scared. Let’s get out of here. I need a greasy burger and a beer. This scotch is okay but sometimes a cold bottle of bud is the only thing that hits the spot,” he said, before he emptied his glass.</p><p>“Sounds great to me, Drew. Work has been stressful. It will be nice to go to a grease joint,” he agreed.</p> <p>Derek quickly ran up the stairs and changed into some jeans and a t-shirt. He slapped on his favorite, worn baseball cap. He smiled as he looked in the mirror. The people he dealt with in the corporate world wouldn’t even recognize him in his off time clothing. He liked it that way. It reminded him of his roots.</p><p>Luckily, he never ran into any of them in his favorite grease joint, which happened to be a country music bar that played some of the best undiscovered talent around. He’d even helped a few of the bands, without their knowledge, by sending in their music to some of his connections.</p><p>The boys jumped into Drew’s big Ford Pick-up truck and headed out. The bar was about an hour’s drive, when there wasn’t a lot of traffic. During rush hour it could take several hours. Luckily the traffic wasn’t bad and they were sitting at a table in no time at all.</p><p>They each ordered burgers, fries and beer, then sat back to listen to the band play. This was one of the few places he knew of that played live music, seven days a week and it was always good.</p><p>He felt himself relaxing. He managed to push his stress away and enjoy the conversation with his cousin. The day was turning out to be one of the best he’d had in too long to remember.</p><p>He was sitting back, digesting his food and sipping on his beer, when his cousin interrupted his semi-comatose state.</p><p>“Have you seen Jasmine yet?” Drew asked. Derek started chocking on the sip of beer he’d just taken. Drew pounded his back, while he struggled to get his breath back. “I guess that’s a yes,” Drew surmised.</p><p>“She works for the corporation,” Derek finally managed to get out.</p><p>“Whoa, how’s that working out? Have you fired her yet?” he asked. Drew knew Derek wanted revenge from the girl who’d broken his heart.</p><p>“No, I haven’t fired her yet. I want her to regret her decision of throwing me out, before I toss her on her butt,” he said. The thought of tossing her out was less and less appealing to him. His cousin raised his brows, as he studied Derek.</p><p>“I see,” Drew said, as he pasted a smile on his face.</p><p>“What do you see?” Derek demanded to know.</p><p>“You’re falling for the girl again, instead of the other way around,” Drew goaded him.</p><p>“You don’t know what you’re talking about,” Derek snapped. He was angry, more with himself than Drew, because he thought there may be some truth to his words.</p><p>“Hey, it’s been ten years and people can change,” Drew said.</p><p>“I won’t forget what she did to me,” Derek said to both Drew and himself.</p><p>“All joking aside, you’re a smart guy. Go with your gut and you’ll know what to do,” Drew told him. One of the reasons Derek loved Drew so much was because even though the world saw him as one big playboy who couldn’t take anything seriously he was actually highly intelligent and the most caring man he knew. He liked to project an image of himself as the carefree guy but both Derek and Ryan knew better. They were allowed to see a side of Drew no one else got to. “Besides, Cuz, I always thought Jasmine was a real catch and the two of you were meant to be together. Maybe fate is stepping in for the two of you, finally.”</p><p>“Okay enough of this emotional crap. Let’s get out of here, head back to my place and drink way too much,” Derek said. Drew agreed with him. They paid the bill, leaving the waitress a very generous tip and then headed out to the truck for the long drive back.</p><p>If people could see the cousins in their off time, they’d have no idea how much they were worth. They liked to wear old clothes, which were about comfort verses style and they liked the dive bars far more than the five star restaurants. They’d vowed to never forget where they came from and in ten years-time they had been true to that vow.</p><p>Derek quickly mellowed out as they made the commute home. He knew his cousin meant well and wasn’t trying to get a reaction but it made him think too much about what his intentions really were towards Jasmine. She was the one that got away and he hoped he was strong enough this time around to not let her break him.</p><p>He knew he was certainly more mature but he seemed to revert right back to his childhood when he looked into those sea green eyes of hers. She had a way of knocking his feet right out from under him. He’d harden himself back up by the time he returned to the office.</p><p>Hell, for that matter, he was only needed there for a few more days, before he could be sure the operation would be overseen by his competent staff. He could monitor the company from his main office and not have to see Jasmine much. That didn’t sound appealing. Damn, he was going to have to put some distance between them.</p><p>He decided he’d do that once he got her out of his system for the last time. He needed to take her to bed a couple more times and then he’d lose interest. He always lost interest once the chase was over.</p><p>He smiled to himself thinking he’d figured the whole thing out. He wasn’t in love with her still; he was just enjoying the chase.</p><p>Jasmine arrived at the school just in time to pick up Jacob. He came running down the hallway and gave her a big hug. She loved the rare moments when he let himself go and allowed her to hold him.</p><p>“How was your practice?” she asked him.</p><p>“It was really cool, I pinned Timmy in like three seconds,” he muttered excitedly.</p><p>“Good job, Little Man. Did you get up and give him a handshake afterwards?”</p><p>“Of course Mom,” he said with a roll of his eyes. She loved that she’d taught her son well enough that being polite was second nature to him. She hated when men, or women for that matter, gloated their victories. She’d taught her son having good sportsmanship was just as important as winning the game.</p><p>A few of his coaches had told her how impressed they were with him. They’d told her he was unusually respectful of his teammates and his coaches. She’d beamed with pride. She was a typical mother and thought her child could do no wrong but when someone confirmed that she floated on a cloud.</p><p>“Timmy asked if I could stay the night on Friday, he has a birthday party and they’re going to Skate World,” he asked her, with excitement pouring out of him.</p><p>“I will talk to Timmy’s mom and make sure it’s okay but I don’t see any reason why you can’t.”</p><p>“Thanks, Mom, you’re the best,” he said with one of his smiles that transformed his face into looking so much like his father, actually hurting her gut. The older Jacob got, the more he looked like Derek. She prayed they never met, because the resemblance was far too great to be passed aside as a coincidence. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It really didn’t help that Jacob liked his hair cut a certain way now, which was almost the mirror image of Derek’s hair-cut. She shook off her thoughts and ruffled her son’s hair.</p><p>They stepped outside and Jacob’s coach approached them. “How are you doing, Jasmine?” he asked.</p><p>“I’m good. And how are you, Chuck?”</p><p>“I’m doing great. Jacob forgot to grab one of these fliers. We have a tournament on Saturday starting at two,” he said, as he handed her a piece of paper.</p> <p>“That sounds like fun. Is there anything I can bring?”</p><p>“I always know I can count on you,” he said with a laugh. “Would it be too much to ask you to bring a main course for lunch? I have some people bringing drinks and fruit but no one signed up for a main course. You can do sandwiches if you want but I know you like to get all fancy,” he said, with a flirty smile.</p><p>She was well known for her creative dishes and that’s most likely why no one else had signed up for the spot.</p><p>“You know me well,” she said with a laugh. “Of course, I will make something good. I have to make sure these boys get plenty of nourishment.” She could see he was trying to work up the courage to ask her out again and after her afternoon with Derek she had no desire for that date. She made her excuses and hurried off.</p><p>She really liked Chuck. He was a phenomenal coach but she wasn’t attracted to him. It was really too bad because he was such a great guy. She may have to get over herself and go on the date.</p> <p>“It sounds like you’re going to have a very busy weekend,” she said to Jacob as they drove toward home.</p><p>“I know. I can’t wait for the party. Trevor said he was having an ice cream cake,” Jacob said, practically bouncing in his seat.</p><p>“Just remember you’re wrestling the next day so if you eat too much junk food you’ll get sick at your meet and throw up all over your opponents.”</p><p>“That would be so cool,” he exclaimed. Jasmine shook her head, really not understanding boys sometimes. She realized she had to let some things go.</p><p>“Okay, remember I warned you when you’re feeling sick come Saturday morning,” she said with her mom’s knowing grin. Jacob rolled his eyes but remained silent.</p><p>They arrived home and she made them both a good dinner and then tossed him a ball in the back yard. She loved when the weather cooperated and she could spend time outdoors with her son. Even though Seattle was a terrific city, sometimes the rain was a bit much.</p> <p>She needed to save up some funds and take Jacob on a vacation in the winter, to get away from the dark skies. It got to be too much at times and she’d find herself starting to get slightly depressed. That wasn’t fair to Jacob or her.</p><p>She tossed the ball with him until they couldn’t see anymore and then finally headed in so he could take a shower and get ready for bed. She was dreading going into the office the next day but she’d do with her head held high.</p><p>Chapter Six</p><p>Jasmine walked through those doors once again and slowly made her way toward the elevator. She considered taking the stairs, just to delay the inevitable but she didn’t think she’d be able to breathe by the time she hit the twenty-fifth floor.</p><p>At least it was Friday. She could make it through one more day. The last couple had been filled with unbelievable sexual tension, for her at least. She didn’t think Derek had thought about their time on his table since he’d pulled up his pants. He barely even looked at her. She was trying to convince herself that was a good thing.</p><p>She lectured herself all the way to the top of the building. She could get through one more day. They were down to their last few files and then he’d most likely return to the head office and she could relax.</p><p>The bell on the elevator rang, which made her jump. The door’s opened and she walked out like she was on the green mile, walking her final steps to the execution room. She didn’t even bother going into her office. She knew the second she sat down, Derek would buzz her and demand she get to his office.</p><p>The strap of her bag slipped down her shoulder and her hands were full of coffee, so she could do nothing about it. She stepped into Derek’s office and sighed. Of course he was there, ahead of her. The man never slept late, or showed up even two minutes past seven in the morning.</p> <p>She was used to being the first one to work but it was impossible with him around. She couldn’t leave any earlier, since she had to get her son sent off to school. She set the extra coffee cup down in front of him and then took her place in front of the much smaller pile of personnel folders.</p><p>“Thanks,” Derek muttered, as he grabbed the cup, without so much as looking up. She had only brought him one, because the other day she’d come in with a large Carmel macchiato and he’d thrown down a fifty and told her to bring him one too, since she was stopping anyway.</p><p>He hadn’t bothered to ask her if it would be inconvenient, hadn’t bothered to ask period, he had just assumed she’d do it for him. It hadn’t been a battle worth fighting, so she just picked him up the coffee. It wasn’t like she had to go out of her way. Besides, he was now paying for hers too and the morning boosts weren’t cheap.</p><p>She seriously would live off the coffees and nothing else, if she could get away with it. She had done that a couple different days and by the end, she was shaking all over but her house had gotten incredibly clean.</p><p>“We have a couple more interviews to do today, with the last of the previous employee’s. I want you to go through the applications that have come in over the week and weed through them. Find the best candidates and schedule them for next week to come in for interviews. We need to get those positions filled as soon as possible,” Derek said, as he finally looked up.</p><p>Unfortunately for her, when he looked up, she was busy staring at his body in inappropriate places. His brows rose and she couldn’t stop the deep flush that stained her cheeks. She turned away from him, praying he’d just pretend it hadn’t happened.</p><p>She needed to get out of his office, because every time she looked at the table, she pictured herself sitting there with him between her thighs. She nodded her head and then pretended to be engrossed with the file in front of her.</p><p>Derek could feel himself tightening the second Jasmine walked into the room. No matter how subtle her scent was, he could pick it out, even if she was in a room surrounded by over scented socialites. He’d grown to crave her scent and wanted to bury his head in her shoulder and just draw the smell of her in. He wanted to bury himself in many other areas of her body as well.</p><p>When he looked up to see her eyes on the very body part he wanted to sink into her It took all of his many years of tightly reined in control not to grab her and have a repeat performance like the one earlier in the week. He found himself actually gripping the desk to keep from walking to her.</p><p>They called in the last four employees and only kept one of them on. The last interview wasn’t going well. “I appreciate your years of service with the former Freeman Corporation but Titan industries has a different vision of the future and I don’t think we will make a good fit together,” Derek said, calmly and professionally.</p><p>“You sorry bastard, you come in here with your corporate take-over and replace most of the people without even blinking. You’ll get what is coming to you,” the man shouted. He was so angry, there was spit flying out of his mouth. He stood up like he was going to come over and deck Derek. Derek stood up to his full height and narrowed his gaze at the man.</p><p>“I see you’re nice and cozy with the enemy, Jasmine. Your father would be so disappointed in you but that’s nothing new, he’s always been disappointed. He only allowed you to keep the job here because he was too embarrassed to have you out in the work force, sullying his good name. You have never done anything right. He’s complained many times about you and your bastard son,” the man continued shouting.</p><p>The second he turned on Jasmine, Derek lost his cool. He was going to deck the man and damn the consequences. He was walking over to do just that when the guy spoke his last line. Derek’s head whipped towards Jasmine with shock, as he realized she had a son. He had no idea. There was nothing in her files. He wanted to know how old the kid was and if she was involved with the father. He was far more interested than he should be. He felt like he’d been kicked in the gut.</p><p>His temper exploded again when he saw her face, though. She was as white as a ghost and looked like she was going to pass out. “My father wouldn’t have said that,” she whispered, sounding like she was going to break apart at any moment.</p><p>“He’s said that and so much more. He can barely tolerate you. You’re so unbelievably naïve,” he spat and took a step towards her.</p><p>Derek broke out of his trance and grabbed the man by his shirt. He physically lifted the man off his feet and then tossed him towards the door, where the man tripped and fell to the ground. “Get out of my building, now. If you set foot in here again or anywhere near Jasmine, charges will be filed,” Derek growled. He looked like a feral animal.</p><p>Jasmine looked from him to the ex-employee and then back again. She was in shock and frightened, all at the same time. “Security,” Derek yelled, which made her jump. Within two seconds two large men came in and didn’t have to be told a word. They took one look at the man and hauled him to his feet pulling him out of the office.</p><p>“This isn’t over,” he was screaming, as they continued to drag him away.</p><p>Derek walked over to Jasmine and pulled her into his arms. She resisted for a moment and then buried her head in his shoulder as the sobs started racking her body. She threw her arms around him and sobbed for a while. He normally couldn’t stand hysterical women but there was so much pain radiating from her, he couldn’t do anything but comfort her.</p><p>The man said some really hateful things and Derek was sure her father had said them all. She was getting a taste of what a horrible man he was. Derek had to guard himself though, because she may have seemed to change from the woman she was ten years ago but she had once tossed him out, without a look back.</p><p>She was finally getting herself under control and seemed to realize she was wrapped in his arms. She pulled back and looked up at him with red rimmed eyes and tear stained cheeks. He was about to bring his hand up and wipe the tears away, when she pulled back.</p><p>“I’m sorry,” she hiccupped at him. She then pulled away and headed into the bathroom. She didn’t come out for a while. It gave him time to go to his computer. He had to do some research on her, to find out what he could about her life. He wanted to know if she’d been married when her son was born and if she was currently married. He needed to know what was going on in her life.</p><p>He knew it was going to take a while but he’d find the information he wanted. Jasmine finally walked out of the bathroom, looking much more composed.</p><p>“Derek, we’ve finished with all the interviews today and I can easily take my lap top home and go through the applications. I haven’t had a personal day in years and would really like to take one now. I wouldn’t normally ask but I would appreciate it if you would let me head out early today,” she asked, with her shoulders back and her head held high. She was expecting to have to argue with him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That will be fine. Just have those names ready for me Monday morning,” he said, barely taking the time to look at her.</p><p>Jasmine grabbed her things and rushed out the door. She swung by her office and put together what she’d need over the weekend and was out to her car within fifteen minutes.</p><p>Jasmine walked in the door of her home and calmly set her belongings down. She called her father’s number and waited for the voice mail to beep. “Dad, this is Jasmine and this will be my last call to you. Andy got fired today and said some things to me. If you said them then you’ll know what I’m talking about and you don’t even need to bother to call me back, because I will not want to speak to you again. If you didn’t say these vicious things, then you need to call me and explain why Andy would say you did. If I don’t hear from you tonight, then I guess that’s my answer,” she spoke unemotionally and hung up.</p><p>She let herself have a hard cry, hoping to hear from her father. She’d always thought he was a hero and the reality of her recent discoveries wasn’t pleasant. She was being crushed with the whole take-over business. Learning her father wasn’t who she always thought he was seemed unbearable.</p> <p>The phone rang a couple hours later and she was reluctant to pick it up. She squared her shoulders and lifted the handle, quietly saying hello.</p><p>“It’s your father,” he said curtly.</p><p>“Dad, what’s going on? You haven’t called me. You just disappeared and now I’m hearing all this information that can’t possibly be true,” she said, trying to keep her tone normal. Her father hated displays of emotion.</p><p>“I heard you’ve gotten cozy with the new boss,” he spat at her, ignoring her questions.</p><p>“I’m trying to make the best of a bad situation,” she said, shocked by his coldness.</p> <p>“Well, you were always good at adapting, weren’t you?” he said. He continued before she was able to say anything. “You don’t leave me a message telling me not to call you. If I want to call, I damn well will. I’ve put up with you for years but I’m done now. It’s because of you that I’ve lost everything. You’re bastard of a boyfriend felt he had to take everything away and now you’re all cushy with him once more. I see where your loyalties lie,” he ranted.</p><p>“I’m not all cozy with him, Dad. I just need the job. I have a son to support,” she told him.</p><p>“You’re always just full of excuses, just like when you were a child. I’m done coddling you. If you can get that man to back the hell off me, then you can call me. Otherwise you can stay out of my life,” he shouted. The phone went dead. Jasmine stared at the beeping receiver not understanding what just happened.</p><p>She had no more tears left in her. She had to pull herself together for her son’s sake. She went to the bathroom and washed her face. She looked in the mirror and vowed she’d never get taken advantage of or be abused again.</p><p>Derek had all calls held and sat at his desk looking up information. He soon found that Jasmine had never been married. She didn’t even appear to have been in a serious relationship. It took him a while to find information on her son though, because he was thinking he’d be a toddler.</p><p>When he realized how old the boy was his world seemed to stop spinning. He was doing some major math in his head and no matter which way he looked at it, the date of his birth coincided with the time he’d been with her. He knew she’d been a virgin when they slept together and he couldn’t imagine she’d jumped from his bed into another man’s within a couple of weeks-time.</p> <p>It was possible but very unlikely. He had no idea how many hours he sat there trying to figure everything out. If he was a father, why would she not tell him? Why wouldn’t she have come after him for child support? He was a very wealthy man and she could’ve tried to exploit that.</p><p>He’d been working with her for a week and she hadn’t said a word about her son. The only explanation seemed to be that he wasn’t the father. But he didn’t understand why she wouldn’t try to pass the kid off as his. She knew the time frame would work and she could’ve thought he wouldn’t demand a DNA test.</p><p>He needed to get some answers and there was no way in hell he was waiting until Monday morning. He decided he was going to her house right then. He looked up her address and was shocked by the neighborhood. It wasn’t the poorest district but certainly not what she was used to. Hell, her father still lived in a mansion; well he did until he was forced to place it on the market.</p><p>She lived in a lower middle class neighborhood and the house had about as much square footage as his bedroom. He didn’t get it. He glanced at the clock and was frustrated to realize it was close to midnight. He’d been sitting at his computer all day and night. He’d have to wait until the morning before going over there. It was going to be a long, sleepless night.</p><p>He walked out to his car and couldn’t help himself from driving in the direction of her place. He had to see if it was really in the type of neighborhood he’d looked up. It took him about thirty minutes to reach her neighborhood and it was exactly as he'd pictured.</p><p>He slowed his car, as he looked at the house numbers, until he spotted her place. It was a nice house. No one could say she lived in the slums but he was so used to luxury condos and high-rises, that he almost forgot what working class neighborhoods looked like.</p><p>The place was a pale blue color, with white trim. He glanced at the well maintained lawn, which was due to be mowed, and the many flowers planted around and the white picket fence. She lives in suburbia, he thought, with an almost hysterical laugh.</p><p>He’d dreamed of living in a place like that when he’d been growing up. He and his cousins would go walking through the neighborhoods, picking out which house they would own and exactly what cars would be parked in the driveway. His dreams had strayed a long way from that time.</p> <p>He now lived on the top floor of a huge complex, with no yard in sight. He sat in his car, wistfully thinking it would be nice to have a yard. Her place was far too small for his tastes but the idea of a yard was greatly appealing. If the boy really did turn out to be his, he’d start looking for property to build a nice house on. Hell, even if the boy didn’t turn out to be his, he was going to start looking. It was time to have some land and maybe a few horses and other animals roaming around.</p><p>He kept fighting with himself. He wanted to pound on her door and demand answers from her. He wasn’t a patient man and he needed to know if he had a son. If it were true he’d already lost over nine years of the boy’s life and he wasn’t willing to lose one minute more.</p><p>He debated with himself for a few minutes and then decided there was no use causing a scene in the middle of the night. He moved to start the car, when there was a knock at his window. He normally wasn’t a jumpy person but his heart jumped, as he turned to see the bright end of a flashlight.</p><p>He rolled his window down to see who was interrupting him in the middle of the night. He almost hoped it was a robber so he could have an excuse to pound his frustrations out on someone.</p><p>“What are you doing parked out here son?” a stern voice asked him. Derek had to suppress the smile that wanted to rise to his lips. Only in this type of area would an officer approach and call him son.</p><p>“Sorry officer, I got lost and was looking at my blackberry to figure out how to get turned around,” the lie rolled off his lips.</p><p>“Let me see your license and registration. You can shut the motor off while I check things out,” the officer said, suspiciously. Derek had to admit he did look suspicious, sitting in front of the home, in the family neighborhood. For all the officer knew, he was some robber, or stalker. He was a little uncomfortable, considering he was actually stalking Jasmine right then.</p><p>“Here you go,” Derek said, as he passed his information through the window. The officer looked at him again and then sidled back to his car. Derek was grateful the lights weren’t flashing. He was praying Jasmine was asleep in her house and would never know of this.</p><p>Derek was still angry with her but he didn’t need a confrontation in the middle of the night, with an officer as a witness and all the neighbors’ porch lights flashing on.</p><p>The officer was gone about ten minutes, enough to make him squirm a bit, like he was back in high school and had just stolen the mayor’s car, or something. What was wrong with him? He had nothing to worry about; he was a successful and respected business man.</p><p>“Looks like everything checks out. Can I give you any directions?” the officer asked, as he silently approached the window once more and shined his far too bright light inside the vehicle once more.</p><p>“No sir, I have it all figured out,” Derek said, just wanting to get on his way.</p><p>“Okay then, I will wait here while you get going,” he said, almost like a threat. It was definitely time for him to get going. He’d be back in the morning and hoped like hell there had was a shift change because he was sure if the same officer came by he was going to be a lot more suspicious.</p><p>Derek drove off and soon hit the main roads. He was wide awake and not thrilled to walk into his empty place. He lay down and hoped he could at least manage to get a few hours of sleep.</p><p>Chapter Seven</p><p>Jasmine woke up to the sound of pounding coming from somewhere. She wasn’t ever a morning person but the insistent pounding was putting her in a far worse mood than she normally woke up in.</p><p>She climbed out of her bed and stumbled down the stairs, not bothering to put on a robe to cover up her old t-shirt and short boxers. If the person was rude enough to wake her up early on a Saturday, then whoever it was could deal with her bedtime apparel.</p><p>She knew her hair would be frightening and her eyes still only half slits. Perhaps she’d scare the unwanted visitor enough to never call so early again. She yanked open the door, “What do you want at this ungodly hour?” she snapped before looking up.</p><p>She gasped at the sight of Derek standing on her front porch. He didn’t look too happy. She had no clue what he could possibly be doing on her front doorstep at any time, much less so early on a Saturday.</p><p>“Is that how you greet all your guests?” he asked, with a mocking smile.</p><p>“Number one, you’re not my guest and number two, most people are smart enough not to show up at my doorstep at the break of dawn, on a weekend,” she snapped back at him, not even caring she was being rude.</p><p>She inhaled the scent of coffee and her eyes widened as she sought out the wonderful aroma. He was holding two large cups and she was fighting with herself on whether to shut the door in his face, or make a grab for the cup. She was awake now and she wanted that coffee badly.</p><p>Derek had to fight the smile from coming across his features at the pure look of lust that came into her eyes as she spotted the coffee he was holding. He’d made a last minute decision to swing by and grab it. Even after only a week of working with her, he already knew she wasn’t a happy person until she’d downed her first cup. He’d learned to wait to speak to her until she was at least half-way through the mug.</p><p>He held it out as a peace offering, forgetting for a moment he was there to demand answers from her. She greedily grabbed the cup and took a large sip with a sigh. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He felt the sigh all the way down to his toes. Damn she could go from almost frightening to downright exotic in a split second. He wanted that look on her face as he slipped deep inside her body. His pants were getting far too tight, the more his thoughts strayed.</p><p>“Um, thanks for the coffee, now go away and come back at a descent hour,” she said and began shutting the door in his face. He was so shocked at being dismissed so completely he almost allowed her to slam the door. At the last second he put his foot in the door, stopping her progress. He looked at her like she’d lost her mind.</p><p>“I need to talk to you,” he almost growled.</p><p>“Whatever it is, it can wait until Monday morning. I brought my work home and will have everything ready for you,” she said with exasperation. She thought he was there about work. Well, he reasoned with himself, what else would she think he was there for?</p><p>“I’m coming in Jasmine. We’re going to talk,” he said in his most authoritative voice. That tone had made more than one person back down and tremble. She merely shrugged at him as if she could care less.</p><p>“Whatever Derek, hurry up then, so I can lie back down. What time is it anyway?” she asked. She then turned towards her clock and gasped in outrage as she turned back on him. “It’s freaking six thirty in the morning,” she yelled, as if she couldn’t possibly believe he’d dare to approach her so early. “On my day off,” she continued.</p><p>She was now steadily walking towards him, with a look so full of fury, he actually found himself retreating a step. When he realized what he’d done, he stood still, not ever being willing to cede ground.</p><p>She got within inches of his face and poked her finger hard into his chest. “This had better be a life or death matter,” she growled at him. He was so unbelievably turned on he forgot about why he was there or why they needed to talk.</p><p>He grabbed her cup, which made her gasp again in fury and then set both of them on a nearby table. He then grabbed her in his arms and kissed her with all the pent up desire he’d been holding in the entire week.</p><p>She punched him in the chest for about two seconds and then her body went limp in surrender. He was only planning on kissing her, to show her he was the one in control but once his lips were connected with hers, he couldn’t seem to stop himself. His hands ran down her back, to grip her luscious behind and pull her up tight against his aroused body.</p><p>She gasped in his mouth, as her body connected with his and she felt the arousal pressed into her core. She threw her arms around his neck and held on tightly, as he devoured her mouth with his. His hand continued to grip her tightly, lifting her completely off the ground and he turned them so her back was pressed up against the wall. He ground his hips against her, trying to relieve the intense pressure in his pants.</p><p>He wanted her and if she came to her senses and told him to stop he may die right there on the spot. He was tangling his tongue with hers as his hands massaged her beautiful behind. She was so unbelievably curved in all the right places. Her backside was a perfect fit in his large hands. He squeezed a little tighter and she let out a growl of appreciation.</p><p>“Where’s your room?” he asked her, before once again kissing her senseless. She lifted her arm and pointed down the hallway, without ever speaking. He took that as a yes from her and started heading in that direction, with her wrapped around his waist.</p><p>He reached an open doorway and could smell her scent drifting out to him. He knew it was her room. He strode through the doorway and lay her down on the bed. He stripped his clothing away and then pressed down into her, connecting their lips once more, before either of them could realize they were making a mistake.</p><p>He broke contact with her only long enough to pull the shirt over her head and yank the shorts off. He threw them, not caring where they landed. He was finally stretched out against her fully, skin to skin. He knew his body was so on fire that he was most likely burning her. He couldn’t stop touching her. His hands roved from her beautiful breasts, down her thighs and back up again.</p><p>He finally stopped kissing her, only to trail his lips down the smooth column of her throat. He licked along the pulse point, feeling his own skip a beat, as he realized how quickly hers was pounding. She’d been passionate when they were young; she was downright exotic as an adult. He reacquainted himself with all her curves, appreciating the maturing her body had done.</p><p>He brought his mouth down the mounds of her breasts and sucked in the tightened nipple. She arched her back as he continued to massage the aching nipple, reaching down to hold his head close to her body. He nipped at the swollen bud and then licked over the spot, making another moan escape her body.</p><p>He switched to the other side, giving her other breast equal attention, before continuing his journey down her body. He wanted to explore every single inch of her he’d missed out on over the last ten years.</p><p>He reached her stomach and ran his tongue over the satin skin. When he got lower, towards her core, he discovered a few little scars, which only added to her sexiness. She was the most beautiful woman he’d ever made love to. He could barely keep himself from exploding all over her bed, as he continued his journey to her core.</p><p>He finally reached her sweet womanhood and flicked his tongue over the swollen pink flesh. She was so unbelievably beautiful. The taste of her made his erection pulse painfully, with his desire to sink into her tight opening.</p><p>He flicked his tongue out and kissed her in the most intimate way a man can kiss a woman, until she was writhing underneath him and moaning out his name. He slipped his fingers inside and discovered she was more than ready for him. He couldn’t wait any longer. He crawled quickly up her body and then locked his lips back with hers.</p><p>She greedily took everything she could from him. She was rubbing her hands all over his bulging muscles as she squirmed to bring them closer. “Please Derek,” she cried out, when he still hadn’t united them.</p><p>He spread her legs apart and then rubbed his engorged member along her folds. The heat from her was making his head light. She was so wet and hot, he couldn’t play any longer. He grabbed her hips and thrust deep inside her in one quick motion. She cried out, as he filled her up with his full length.</p> <p>He paused for a moment, so he could try and control himself. He wouldn’t be able to give her pleasure if he didn’t get himself under control. She wiggled her hips in need and he couldn’t take anymore. He started thrusting hard, in and out of her, while holding her hips tightly in his hands.</p><p>Their tongues continued to mimic their lovemaking, tangling and thrusting into one another’s mouths, as they both groaned out their intense pleasure. He began thrusting into her harder and faster, as he felt the exquisite pleasure shooting through his body. He felt her own body tensing, as she reached higher, towards her release.</p><p>She gasped out loud and her mouth opened wide, releasing him. She threw her head back into the bed and cried out as her body started convulsing around him. She gripped him tightly, deep within her womb and he almost lost consciousness as he felt his release shoot deep inside of her tight body. It felt like lightening shooting through him, as his erection continued to pump within her core.</p><p>She was still gripping him tightly in spasms and he drained every ounce of himself inside her. It was the most intense orgasm he’d ever felt in his life. His energy had been depleted and he fell against her sweat slickened body. They were both breathing in deep gasps of air.</p><p>He realized he had to be crushing her and turned their bodies so he was holding her tightly against him, side by side. They were still connected in the most intimate way a man and woman could be and he couldn’t find the will power to pull them apart. She wiggled, seeming to try and get even closer to him, as if she couldn’t let him go either.</p><p>They lay there for several minutes, until their breathing slowed down and the intenseness of their lovemaking began to dim. He knew the moment she realized what she’d done again, because her lax body stiffened and she began to push him away.</p><p>He reluctantly let her go and was sorry to feel the connection broken, as she pulled free from his body. He somehow felt empty and he couldn’t understand it. He’d never before wanted to stay connected to a woman. He’d always been the first one to crawl out of bed and leave before she could possibly want to do the after sex cuddling.</p><p>He realized Jasmine was truly the only woman he’d made love to, instead of just bedding. He’d never understood the difference until that moment.</p><p>Jasmine was staring at him with wide eyes, filled with shock. She quickly grabbed her sheet and covered herself up and he felt more disappointment. He enjoyed looking at her curvy body and wanted to continue to explore her.</p><p>“I...I...d...don’t know why that keeps happening,” she sputtered to him, as her cheeks filled with color.</p><p>“Because we have undeniable chemistry,” he said, with his trademark, cocky smile. He was feeling pretty good at that moment. He hadn’t planned on starting his day out ravishing her but he could think of far worse things he could’ve been doing.</p><p>“I don’t sleep with strangers,” she blurted out.</p><p>“We’re not strangers Jasmine, so don’t try that crap on me. You were a virgin the first time I took you and from the feel of your body, you haven’t taken too many more lovers,” he said, with far too much confidence. He was laying there in all his naked glory and her eyes strayed to his still half aroused body part. She quickly snapped her gaze back to his face and then her eyes narrowed as his grin became full-fledged.</p><p>She reached out her hand and slapped him hard once again before he had time to react. His smile was wiped away and he pounced on her before she could scramble away. The sheet slipped down and her body was barely covered as he held her down with his own body, which was becoming, once again, fully aroused.</p><p>“I allowed you to slap me once, it won’t happen again,” he growled, before locking his lips with hers. She tightened her own together and glared at him. He smiled and then licked the swollen bottom lip before pulling it into his mouth and gently nipping it. She gasped, as the fire started building in her stomach again.</p><p>She couldn’t figure out how he turned all her rational thoughts to jelly with barely a touch. She was already losing her battle to distance herself from him. He ran his tongue over hers again, as he held her hands up high above her head. She slowly opened to him and when he inserted his tongue back into her mouth she wiggled in pleasure. He was slowly making love to her with only his tongue and it was completely erotic.</p><p>Her stomach was clenching, as her desire woke fully back up. He held her hands together with both of his and then moved the sheet from her body as he ran his other hand down all her curves. She was soon begging him to love her again.</p><p>“Say you want me,” he growled, with his impressive manhood pressed up against her opening. Her body was on fire and she wanted him deep within her but she didn’t want to utter those words of surrender. She shook her head no.</p><p>He continued to stroke her with his tongue and then inserted his fingers deep inside her moist heat. “Say it,” he whispered in her ear, sending a shiver of delight down her spine. She couldn’t fight him anymore. She wanted him more than she wanted air. “I want you. Please,” she finally begged him. He removed his fingers and then slowly pushed back inside her. Where they were frantic and wild only moments before, he was now gentle and loving, pushing slowly in and out of her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her body was quivering with need, as he moved his impressive length in and out of her body, while continuing to kiss her lips, neck and breasts. She wanted more, she needed more. She was on the edge of a cliff and only he could push her over.</p><p>She grabbed his hips and thrust up against him, groaning as the full width of him settled against her. “Please Derek, faster, I need...” she gasped. His eyes dilated at her gasped words and he gave them both the pleasure they needed and picked up his speed until they were once again crying out in ecstasy. He flipped them over when they were done and held her close in his arms not willing to let her go.</p><p>She seemed to know she’d lost the battle and curled up in his arms. He was so depleted; he couldn’t even open his eyes. He pulled the covers up over them and fell asleep feeling better than he ever had in his life. He’d deal with the real world soon enough, was his last thought as he drifted into a deep sleep.</p><p>Chapter Eight</p> <p>“Mom, I’m home,” Jacob’s voice shouted, waking Jasmine from her deep sleep. She heard his running footsteps and then saw him peak in her door. “Yeah she is here Mrs. Winters, thanks for the ride,” Jacob said and then she heard the front door close.</p><p>“Hi Jacob,” she said to her son groggily and then glanced at the clock. She was shocked to see it was past eleven. She felt a stirring next to her and became instantly alert. She’d thought the whole thing had been a dream for a moment.</p><p>Her son’s eyes widened as he stared at Derek. “Who are you?” Jacob asked. Jasmine must have looked completely horrified. Her son had never once seen her in bed with a man. She had not been with another man since Derek. She looked at him and found his full attention was on her son. She may as well have not even existed.</p><p>She wanted to jump from the bed and hide Jacob from Derek’s knowing eyes but it was too late. She didn’t know how she could get out of this. She couldn’t believe she’d made love to him, not only once but twice and then actually fallen asleep in his arms, when her son would be returning. It was just plain stupid. Her mind was scrambling to figure out how to explain her nine year old son.</p><p>Derek continued to look at the boy, which was like looking at a picture of himself from his childhood. Derek had zero doubts the boy was his.</p> <p>He had all kinds of emotions, competing at once, inside of him. Foremost, there was joy he had a son there was extreme anger Jasmine had kept his son from him. He was confused, because he had just had the best love making of his life and yet he wanted to strangle the mother of his child. He didn’t know which emotion to embrace first. He realized his son had asked him who he was and he also realized Jasmine was sitting there like a deer caught in an oncoming car’s headlights.</p><p>“I’m your dad,” he said. He heard Jasmine’s intake of breath and didn’t even bother to look over at her. He was too afraid he may give in to his urge to strangle her. He knew he wouldn’t really do that but he was pretty infuriated with her right then.</p><p>“Really?” Jacob asked him skeptically. His face contorted into such a mirror image of his own he wanted to shout for joy. He was meeting his son. He wanted to jump from the bed and pull him into his arms but he was still completely naked underneath the protection of the bedding. He knew the only reason Jasmine was still in the bed was for the same reason.</p><p>“I really am,” Derek said, having to fight the emotions trying to break free.</p><p>“If you’re my dad, then what did you say to my mom every night before you had to leave?” the boy asked and Derek knew he was being tested. Derek hadn’t thought about those words in many years and yet he’d never forget them.</p><p>He took a deep breath and uttered the words he hadn’t said since the night before he was to meet Jasmine and run away, “Sweet dreams my princess, I will rescue you from the tower in the morning light,” he said, with a slight scratch to his throat.</p> <p>He heard Jasmine gasp again and then felt her body shake slightly. He glanced over at her and saw the tears falling from her eyes. He then grunted as Jacob jumped on the bed and threw his arms around him. He felt stunned as he held his son in his arms for the first time. He was awed and amazed by the little man. He wrapped him up tightly and held his little body against his own.</p><p>“You’re my dad,” the boy said in awe. He lifted his hands up to touch Derek’s face, as if he was trying to figure out for sure, if he was real. “Mom said you had to go away for business but she told me one day you'd come back and you did, you really came back,” Jacob said, as a tear slipped from his eye. Derek felt like his heart had just burst in his chest. Jasmine was now sobbing next to them on the bed.</p><p>She watched as father and son embraced and her world felt like it was coming apart. She had been so wrong to not tell Derek about Jacob the minute she saw him. She could see the love practically flowing from him.</p><p>She’d told her son all about Derek and how he’d seemed like her prince in shining armor. She’d never told her son any of her heartbreak, like how she’d waited for him in futile at that little broken down church. She had wanted her son to think his father would move heaven and earth to be with him.</p><p>Jacob was talking a million miles a minute, as he asked a ton of questions and Derek patiently answered each one. They continued to cling to each other and Jasmine felt like an intruder. She would’ve gotten up, to give them some time together but was trapped underneath the covers. She scooted over but her bed wasn’t that big and Derek was a large guy. No matter how much she scooted, they were still touching.</p><p>“Are you going to come to my wrestling match?” Jacob asked, with hope shining in his eyes. “If you don’t want to, we can skip it,” he said, although he loved to wrestle and had never missed a meet. It broke her heart how much her young man wanted to please his father.</p><p>“Nothing would make me happier than to watch you wrestle,” Derek said and he meant it. He had missed nine years already and wouldn’t miss one more minute.</p><p>“It’s really fun. Just ask Mom. She never misses my games. She always yells too loud but coach says it’s okay cause she’s just really proud of me,” he said, as if he couldn’t understand women. “I kinda like it, though,” he whispered to Derek, thinking she wouldn’t be able to hear. She had to fight the smile back.</p> <p>“Can you go to the kitchen for a minute so your mom and I can get ready to go?” Derek asked him. Jasmine was relieved. She needed to get out of the bed.</p><p>“You promise you won’t leave?” Jacob asked, looking on the verge of tears.</p><p>Derek grabbed him close again. “I promise you I will never leave again,” he said and then glared at Jasmine over Jacob’s shoulder. A shiver ran down her spine from the look. He wasn’t happy with her. She stiffened up her back and glared back. She wasn’t the one who walked out on him. How dare he look at her that way!</p><p>“Okay, I’ll be right out here,” Jacob said, almost like a threat, in case Derek decided to disappear on him.</p><p>He slowly left the room, closing the door behind him. As soon as he left, Jasmine grabbed the sheet and jumped from the bed. She ran into the bathroom and locked the door. She needed a few minutes to gather herself before she had to face him. She leaned against the sink and took some deep breaths. A few seconds later Derek was on the outside of the door.</p><p>“You can either open this door, or I will break it down, it’s your choice,” he said, in a deadly calm voice. She decided not to test him.</p><p>He was standing there in nothing but his pants and the man looked far too sexy after just climbing out of bed. She said nothing to him for a few moments, not knowing how to begin this conversation. She decided to go on the offensive.</p><p>“You didn’t have to blurt that out to him. What if you’re not his father?” she said and then took a step back at the fury in his eyes.</p><p>“Don’t even try and play games with me, Jasmine. It’s more than obvious he’s mine and you have already robbed nine years of his life from me. You won’t take anything else, do I make myself clear?” he growled at her, as he backed her into the corner.</p><p>She went from offensive to defensive in a matter of seconds. “I didn’t say he wasn’t yours, I just said you should have asked me first, instead of blurting it out like that,” she said, a bit shakily.</p><p>“So you could come up with some more lies? I don’t think so, Jasmine. Get yourself together. I’m going to spend the day with my son and I don’t want him to know I want to hurt his mother,” he snapped at her, before turning to leave.</p><p>Derek walked out of the bedroom and had to fight the tears from stinging his eyes, as he saw his son sitting by the front door. His son was so afraid he’d leave him again, he was guarding the door. He’d prove to the boy he’d never leave again. They wouldn’t spend one more night apart. He’d figure out what he was going to do about Jasmine later.</p><p>He took Jacob into the kitchen and fixed him breakfast. Father and son sat, eating their first meal together and getting to know one another.</p><p>Jasmine slid down to the floor after Derek stormed out. She sat there, sobbing into her hands and feeling sorry for herself. How had her life changed so much in only a week’s time? She finally got up and climbed into the shower. She stood there until the water turned cold and then reluctantly climbed out, shivering. She had goose bumps all over her body.</p><p>She pulled on thick sweat pants and a sweatshirt, threw her hair in a ponytail and didn’t bother with make-up. She had little energy to even care about her looks, even though she was going out in public. She was simply too frightened about what would happen next.</p><p>She stepped into the kitchen to the sound of her son’s laughter. She smiled at him and then kissed him on the head. “Oh Mom,” he grumbled and then rolled his eyes at Derek. Jasmine held her breath, because if Derek said that his mom kissing him was gross, her son would never let her do it again. He was already hero worshiping the man.</p><p>Derek surprised her, by grabbing her around the waist, which knocked her off balance, so she tumbled into his lap. He kissed her squarely on the lips and then released her just as quickly. She was feeling light headed as she stood back up. Even angry with the man, he still made her feel things no one else ever had.</p><p>“Jacob, we never complain when a beautiful lady wants to kiss us,” he said to her son and then wiggled his eye brows at him. Jacob giggled and Jasmine’s heart swelled. Derek had said exactly the right thing.</p><p>“Yuck, Dad,” Jacob said with more giggles and then went back to scarfing down his breakfast. He looked up every few seconds to stare at Derek, as if to make sure he wasn’t going to disappear on him.</p><p>“I need to make lunch for the boys,” Jasmine murmured and then set to work making a large pot of homemade soup and fresh bread. The smells coming from the kitchen were making Derek’s stomach growl. Whatever she was making smelled delicious.</p><p>“Coach says mom makes the best lunches ever and that’s why they always want her to make the food for our tournaments,” Jacob said with pride. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“If it tastes as good as it smells, I can understand why your coach says that,” Derek agreed. Jasmine felt a little bit of pride role through her. She enjoyed cooking for her son, heck she enjoyed cooking for anyone who appreciated it.</p><p>“Hurry up, Mom, or we’re going to be late,” Jacob called to her an hour later. She was getting the soup put into the insulated bag. She had several things to drag out to the car and was feeling flustered, since she’d overslept and was officially running late.</p><p>“Let me grab those for you,” Derek said, making her jump. She wasn’t used to having someone there to help her.</p><p>“Thank you,” she muttered, relinquishing a few of the bags.</p> <p>“We can take my car,” Derek commanded.</p><p>“Yeah,” Jacob said and then gasped as he saw the shiny black car sitting at the curb. “Is that your car?” he asked in awe.</p><p>“Yep,” Derek answered smugly. Jasmine just rolled her eyes at the rapture the two boys were sharing as they both admired the far too expensive Porsche.</p><p>“My friends are going to think I’m so cool,” Jacob said, as he was bouncing in place at just the thought of riding in the fancy sports car.</p><p>“Want to take the top down?” Derek asked.</p> <p>“Yeah,” Jacob shouted and then giggled as Derek pressed a button and the top started slowly moving back. Jasmine wasn’t thrilled to climb into the small vehicle. She much preferred her sturdy mini-van.</p><p>Jacob climbed in the back seat and buckled up. It was a good thing he was still small because he barely fit back there. No way could an adult squeeze in the back. She reluctantly climbed into the passenger side and when Derek soon sat down in the driver’s seat, she was grateful the top was down. The little car was making her feel claustrophobic and Derek was way too close for her already frayed nerves to handle.</p><p>Derek threw the car into gear and then gunned down the street, picking up speed quickly. “We aren’t in that big of a hurry,” she gasped in fear, as she held on tightly to the dashboard.</p><p>“Oh, Mom,” Jacob groaned. “Go faster,” he egged Derek on. Derek gave him a huge smile in the rearview mirror and then jumped on the freeway gunning the engine. They shot past cars like they were standing still. Jacob was full of laughter, as his hair blew back in the wind and they flew down the freeway.</p><p>Jasmine would never admit it to either of the guys but she was getting a thrill out of the ride herself, after her initial fear fell away. He was a skilled driver and whipped around the lanes of traffic smoothly, making it seem like they were flying.</p><p>They reached their exit and had to slow down. “We have to do this again,” Jacob shouted from the back seat. Jasmine silently agreed.</p> <p>“We’ll go on a long ride after the wrestling meet and then go have dinner,” Derek promised him. Jasmine didn’t appreciate how he was just assuming they didn’t already have plans. She would’ve said something but didn’t want to fight in front of her son.</p><p>They pulled up to the school and Jacob grabbed ahold of Derek’s hand. “Come on, Dad, I want you to meet my coach,” he said excitedly.</p><p>“Let me help your mom carry the food in and then I can meet him,” he answered with never-ending patience. She was impressed how well he was doing with her hyper nine year old son. A lot of parent’s couldn’t handle their children, after having years to adjust and he seemed to be falling right into parenthood. She’d see how he acted in a week, or even a month. That would be the true test.</p><p>They walked into the gym, like a million other families. Jacob had his small hand clasped in Derek’s and she walked on his other side. To the rest of the world they would seem like the perfect, suburban family. She knew the truth though. She knew the confrontation was coming and she was trying to prepare herself for it.</p><p>Derek barely had time to set the food down at the concession area, before Jacob dragged him off. He was so proud to show his father off to his coach and all his friends. She watched as he proudly crossed the room and ran to Chuck.</p><p>Chuck looked up at them with surprise and then she watched as his brow wrinkled, before he quickly managed to paste a smile on his face and shake Derek’s hand. She knew he had to be wondering what was going on between them, as she’d never mentioned Jacob’s father before.</p><p>Jacob must’ve insisted Derek sit with him in the players section, not willing to let his dad leave his side, because she saw Derek, businessman tycoon, kneel down and sit on the Matts. She would've caught flies if they were around - her mouth was so wide open. She quickly shut it and got the food all ready for the boys.</p><p>“Who is that complete hunk of man meat with your son?” one of the very single mothers said, as she edged up. “Please tell me he’s your long lost brother and single,” the woman continued. Jasmine felt instant jealousy, as she stared at the gorgeous woman, who unlike her, was dressed in a skin tight outfit, with her hair and make-up done to perfection.</p> <p>She didn’t know how to describe Derek. They weren’t a couple and hadn’t been for ten years. He was the father of her child and he’d made love to her so hotly she was surprised her sheets hadn’t gone up in flames but she didn’t have any rights to him.</p><p>“He’s Jacob’s father,” she simply said. She didn’t know what else to add to that.</p><p>“Yummy, you haven’t mentioned Jacob’s father before. Does he live out of town?” the woman asked, with too much interest.</p><p>“We just lost touch for some years but I don’t think he’s going to want to be away from Jacob anymore,” she said.</p><p>“I see,” the woman said and then snaked over to her son, who just happened to be close to Derek. Jasmine watched as the woman had the nerve to actually pretend to trip and fall into Derek. She couldn’t believe he fell for that, as he held his arms out to catch her. Then to top it off, she sat inappropriately close to him.</p><p>Jasmine could feel her anger escalating as the two of them sat and chatted like long lost friends. She wondered what the heck they found so amusing, as they laughed together. She told herself it was none of her business if he flirted with some trampy soccer mom. Hell, he could marry her and be one big happy family for all she cared, as long as the man left her and Jacob alone.</p><p>She knew she sounded like a jealous ex-spouse, even in her own head but he wasn’t even trying to hide his flirting with another woman when she was standing in the same room. It was worse, considering he had ravished her body only a few short hours ago. The man was a cad and she was better off without him.</p><p>“So, that’s Jacob’s father, huh?” Chuck, said as he came up to the table. Jasmine was hurt and angry and needed to feel good about herself, so she poured it on a little too thickly, with poor Chuck.</p><p>“Yeah, he’s been gone a long time and wants to reconnect with Jacob,” she said. She didn’t want everyone there to know all her business and that Derek had only found out he was a father that day.</p><p>“Jacob seems pretty happy about it,” he said, as they both glanced over at Jacob. Derek was looking directly at her and he didn’t seem to be laughing anymore. Maybe it bothered him a bit to have to sit and watch her flirt, she thought a bit cattily.</p><p>“Yeah, Jacob is really excited about it,” she said and then found herself giggling, as she touched his arm. What was wrong with her? She was now acting like the vixen mother, who had her hands all over Derek. She needed to get a grip on herself.</p><p>Chuck’s eyes widened at her touch and he moved a bit closer. He really was a good looking guy. He was about the same height and weight as Derek, though not quite as muscled. She knew a lot of the moms had crushes on him and had been flirting with him, in hopes of a date but he had seemed fixated on her for a while. She had simply not been interested.</p><p>“What are you doing later tonight?” he asked and she could see the wheels turning in his head. He was asking her out again, encouraged by her flirting. Damn, she really hadn’t thought about that. Before she could answer him, not knowing what she was going to say, Derek appeared and cut the conversation short.</p><p>“Sorry Chuck we are going to be in the city tonight,” Derek said, as he wrapped an arm around her, letting Chuck and every other man in the room know she wasn’t available. She didn’t get what he was doing, as they weren’t a couple and he’d been practically drooling in the other woman’s lap, not two seconds ago.</p><p>“Oh, I was just thinking about having a pizza party for the boys to celebrate the end of their season,” he said, quickly covering up. She was impressed with him; he must’ve planned a back-up in case she turned him down again. She really felt badly. She shouldn’t have let her temper get away from her and used him to appease her own feelings.</p><p>“We should think about that next weekend, I can order trophies for the boys, if you give me a list of their names,” Derek said smoothly.</p><p>“That would be very generous of you,” Chuck said with sincerity, if not a bit of jealousy.</p><p>“It would be my pleasure. I've missed out on far too much of my son’s life and I plan on making up for that now by not spending another minute without him,” Derek said, making it very clear that he wasn’t going anywhere.</p><p>“That’s great, well I better get back over there and coach the boys,” he said, as he rushed off. He knew that Jasmine was off limits and was making his quick escape. She wanted to say something to Derek about his high handed behavior but wouldn’t give the nosy parents the satisfaction of a public fight.</p><p>Derek leaned down and kissed her intimately, before letting her go. He was marking his territory for everyone there to see. She knew it was a Tarzan thing to do but she was still slightly light on her feet as he made his way back over to Jacob. She finally realized she was staring and turned away, only to notice almost every pair of eyes in the building on her. She felt her cheeks grow warm as the blush took over her features.</p><p>She really had to quit forgetting there was a world of people around her every time the man touched her. She busied herself with the food, only stopping when it was Jacob’s turn to wrestle. She was no longer the loudest fan in the audience, she thought, as she heard Derek encouraging Jacob throughout his match.</p><p>After Jacob won, he ran over to his dad, who lifted him up, spinning him around in a huge hug. Her heart tugged as he raced to her next and let her kiss him on the cheek and congratulate him. She loved him so deeply that there was nothing she wouldn’t do to make his life better, even if it meant putting up with her insufferable ex.</p><p>The meet ended and all the boys rushed to her table to scoop up the food. She was pleased with all the oohs and aahs as the boys gulped down the food like it was their last meal. It didn’t take long for every scrap to be consumed.</p><p>She always stayed to help with the clean-up and it took them about an hour before they were able to leave. Most of the parents had gone home already but she noticed Ms. Flirty mom was still hanging around, along with a few other single ladies.</p><p>They all walked out the door together, some of the women being far to flirtatious, in her opinion, with a man who was claiming to be taken. She figured they guessed if there wasn’t a ring on her hand, he was still fair game. Heck, she thought, some of them wouldn’t have cared if she did have a ring on. She was seeing a whole new side to the single parents. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As they approached his car, the mothers eyes widened even further and she could almost see the money signs cha ching in their heads. Vultures, she thought, really irritated. Chuck spotted the car and hung his head a little, thinking he was way out of his league and he took off more quickly than normal.</p><p>“I’ll see you all later,” Jasmine said, as she climbed in the vehicle. She just wanted to get away from the women, she’d once thought were her friends. She guessed friendship had a limit and that limit was the impressive Derek Titan.</p><p>“Thanks for all the help ladies. I guess I need to study up on wrestling so I know better what my son is doing,” Derek said with a wink. Jasmine looked over at him with a shocked expression crossing her features. He was encouraging the money hungry women. She couldn’t even figure out who he was. He winked at her and then ripped out of the parking lot to the sound of the ladies giggling and yelling their goodbyes. Good riddance! She thought.</p><p>Jasmine was still incredibly irritated with Derek several hours later as they made their way back to her house and he parked in her driveway. The Porsche looked way out of place next to her used mini-van. It was just another example to show how very different their lives had become.</p> <p>She was the one who’d grown up the richest kid in town, while he’d been poor and worked for every dollar he made. Now the tables were turned and not only was he a billionaire but she was the one barely getting by. She didn’t mind that so much but with his new status, also came that arrogance and distance she didn’t like.</p><p>They slowly climbed from his car and walked into the house. Jacob could barely keep his eyes open but he was fighting his exhaustion. She knew her son was afraid to go to sleep and then wake up to find his father gone.</p><p>To take the man away from her son now would be cruel, since he had a taste of being with his father. She wished she could go back to the morning and have been able to resist his charms long enough to get him out of the house so she could think. She didn’t want her son to be hurt.</p><p>“It’s time for bed baby, you can take your shower in the morning,” she said to her son, as she led him towards his room.</p><p>“But I’m not tired, Mom,” he said, before a huge yawn overtook his features.</p> <p>“I would say that yawn says you’re pretty tired,” she gently told him, still leading him towards his bedroom.</p><p>“Will you still be here tomorrow?” Jacob asked Derek, with big sad eyes.</p><p>“I promise you when you wake up in the morning I’ll be right here,” Derek said, as he bent down and lifted Jacob up into his arms like he weighed nothing. Jasmine had a hard time carrying him around now. He’d just gotten so big. He’d outgrow her in a few more years. She didn’t know where the time went.</p><p>“Will you read me my story tonight?” Jacob asked him and Jasmine was a bit jealous. Story time had always been theirs alone and she didn’t want to share it.</p><p>“I would love to,” Derek replied.</p><p>“You come too, Mom,” Jacob said, with another sleepy yawn.</p> <p>“Of course, Honey,” she replied fondly.</p><p>The three of them went to Jacob’s room. It was filled with his favorite toys and posters of Spiderman all over the walls. He’d been infatuated with Spiderman for about a year and had every poster and action figure she’d been able to find.</p><p>“I really like your room,” Derek told him.</p><p>“Thanks Dad. Mom and me look for new stuff all the time,” he said proudly.</p><p>“That sounds like fun,” Derek said. “What story do you want to hear?” he asked, as he looked over at the bookcase, which was overflowing with every book imaginable.</p><p>“You can pick, I like them all,” he said, as Jasmine helped him find his pajamas. He quickly changed and crawled into bed, sitting against the headboard. Jasmine leaned next to him while Derek chose a book.</p><p>He found a superhero book and read the story, inserting villain’s voices. When he tried to imitate a damsel in distress, both Jacob and Jasmine burst out laughing at his very poor portrayal of a woman. “Hey, I thought that was pretty good,” he said, with a smile. He finished the story and Jasmine tucked the covers up under Jacob’s chin.</p><p>“Good night love, I’ll see you in the morning,” she said and turned to leave father and son alone for a moment.</p> <p>“That’s not what you say, Mom,” he told her and waited expectantly. She glanced at Derek self-consciously and then to her son, who was waiting.</p><p>“Good night my young prince, may the dawning day bring you adventures, treasures and so much more,” she whispered to him and then quickly left the room. She’d spoken the same words to him from the time he was a baby. It was one of her ways of giving him a piece of the romantic side of his father. She was very close to tears, since Derek was there but no longer her prince charming.</p><p>He followed her into the living room a few minutes later and they stood there staring at each other. She knew it was time for the confrontation. She was just not ready for it.</p><p>Chapter Nine</p><p>“Why would you keep him from me?” Derek demanded of her, his eyes filled with fury. What was worse than that though is the pain she saw under that anger. She’d hurt him without meaning to. What did he expect of her though? He had walked out on her, when she was ready to give him her whole life.</p><p>“I didn’t keep him from you on purpose, at first. I had no idea where you were and then by the time I knew how to find you, it was simply too late. He was already walking and talking and we were fine. The years just kept falling away,” she said, in a voice barely above a whisper.</p><p>“He’s my son Jasmine,” he was almost shouting. “Were you going to tell me once we started working together?” he asked. She said nothing but the look she gave him was all the answer he needed. “I see,” he growled.</p><p>He began pacing the small room and she felt like a mouse in the path of a viper. She knew he was going to strike but she didn’t know when, where, or how. She was terrified and didn’t want to make the situation any worse than it was, so she waited him out.</p><p>“I’m so angry with you, I can’t even think. I can’t believe you could sit there with me each day, knowing it was one more day I didn’t get with my son. I can’t believe you would have sex with me and still feel no desire to tell me about him. How can you be this cold?” he spat at her.</p><p>“I...you...I don’t know,” she said, as she threw her hands in the air. He was turning everything on her. He wasn’t taking any accountability for his own actions. She knew he was angry and frustrated but he had to admit he was the one who had walked away.</p><p>“Did you know you were pregnant that last night, when we made all the plans?” he asked her.</p><p>“No, I didn’t know until at least a month later,” she answered. She really didn’t see it would’ve made any difference anyway. Why would he have stuck around for a baby, when he wouldn’t stick around for her?</p><p>“I won’t spend another day without him,” he told her with menace. She knew that it was coming down to that.</p><p>“Are you seriously going to fight me for him?” she asked, barely able to hold the sobs in. She was so close to breaking down and crying all over his feet. Her knees would no longer support her so she plopped down on the couch. She couldn’t even look at him anymore, she was hurting so badly.</p><p>He silently stood there in the room. She couldn’t look up at him, as she was fearful of the look in his eyes. His silence seemed to be the answer to her question. She knew he was going to fight her for Jacob. She had nine years of being his mother and had done the best possible job she could but he had the money for the best attorneys and if he took her to court he’d probably win.</p><p>It didn’t help her case that Jacob was so needy of a father, he’d bonded with him instantly. The courts always interviewed the kids. They’d ask him if he wanted to be with his father or his mother and in her child’s innocence, he’d tell them he wanted to be with both his parents.</p><p>They’d look at what each parent could provide and he’d win hands down. She’d fight him the entire way but she’d just be fighting the inevitable. She felt defeated and devastated.</p><p>“I won’t take you to court Jasmine but not because I give a damn what it would do to you. You don’t deserve my consideration. I won’t do it, because I won’t hurt my son by pulling him away from his mother, who he obviously loves,” he finally said. Jasmine felt a ray of hope. She could share her son. He may not like only being with his father on weekends but they could work it out.</p><p>“Thank you,” she said gratefully.</p><p>“I wasn’t finished speaking,” he said in a tone that had her snapping her head up to look at him. “I said I won’t take Jacob from you but I also told you I won’t spend another day without him,” he said and waited for his words to sink in.</p><p>Jasmine’s eyes widened, as she realized what he was saying. “You want us to live together?” she said in shock.</p><p>“I won’t dishonor my son by just living with his mother. I will not allow the other kids to pick on him because his mother is a mistress,” he said with venom.</p><p>“I don’t understand,” she began.</p><p>“Come on Jasmine, you’re smarter than this,” he sneered at her. She continued to look up at him blankly.</p><p>“We’re getting married,” he said. Jasmine gasped, as she stared open-mouthed at him. He had just asked her to marry him, no scratch that he’d just told her she was going to marry him. She didn’t even know how to respond.</p><p>“I...I don’t want to get married,” she finally managed to stutter.</p><p>“That’s very obvious from your actions ten years ago but this isn’t about you, or even about me, this is about Jacob and what is best for him, so you’ll marry me because it’s what’s best for our son,” he said. He wasn’t shouting or sneering anymore, he was deadly calm and seemed almost defeated, which was worse for her, because it made it all seem so much more real. She also didn’t understand his little comment about ten years ago, considering he was the one who left her but she was so tired of arguing.</p><p>“There should be another more reasonable solution other than marriage. We can work out a visitation schedule,” she tried one last chance to fix the situation that was quickly spiraling out of control.</p><p>“There’s no other solution, I told you I want to be with my son every single day. I don’t want to just visit him every other weekend and on alternative holidays. I’ve already lost half of his childhood, I won’t lose anymore,” he said.</p><p>“Can we at least take a few days to think about things and talk some more, this is all so new and we are both emotional?” she asked him.</p><p>“Jasmine it’s either this or else,” he said, leaving the veiled threat unsaid.</p><p>“I guess it makes sense,” she conceded.</p><p>“Good, I’m glad you feel that way but don’t think that there won’t be an iron clad prenuptial agreement. When our son turns eighteen and goes off to college, our sham of a marriage will end and then we can be free of each other. Don’t worry though, I’ll leave you with something and just think, while we’re married you get to live in the way you’re so accustomed to. I may not have been good enough for you ten years ago but I’m worth far more than your father ever was now,” he snarled. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I don’t care about your money or what you can give me; I’m not the one wanting to get married. I think we could find another solution,” she snapped and let out a sigh of frustration. She was getting far angrier the more he lashed out at her.</p><p>“I’m tired, where’s the guest room?” he asked, as he rubbed his hand through his hair for the hundredth time. She showed him the room and then dragged herself off to her own, feeling defeated and more drained than she ever had in her life.</p><p>Jasmine figured she’d climb into bed and lay there awake all night. She was grateful when her heavy eyes closed and she felt oblivion overtaking her.</p><p>“Dad,” Jacob yelled, as he came skidding into her room at the crack of dawn. Her first thought was, why did she keep getting woken so horribly early and then panic started to overcome her at the look of complete devastation on her child’s face.</p> <p>“I knew he wouldn’t be here,” Jacob said as tears started streaming down his face and he crawled in the bed next to her to sob on her shoulder.</p><p>“It’s okay baby, he’s here, he’s just in the other room, he hasn’t left,” she said, as one of her own tears escaped. She hated to see her son in pain for any reason but the unbearable heartbreak of him thinking his father was gone was the most horrible thing she’d ever experienced.</p><p>“Hey bud, are you okay?” Derek said, as he stepped into the room and saw Jacob sobbing in her arms. He looked up and the tears stopped instantly, as a huge grin overtook his face.</p><p>“You didn’t leave,” Jacob exclaimed, as he jumped from the bed and threw his arms around his father. Derek picked him up and sat down on her bed. She scrambled up into a sitting position and pulled her legs up to her chest, hugging them tightly. Derek looked over at her with an expression that seemed to say, I told you there was no other answer. She knew he was right.</p><p>“Where were you then?” Jacob asked, as he looked from his father to his mother.</p> <p>“I was sleeping in the other room, bud,” Derek said as if that would satisfy him.</p><p>“But mom and dad’s sleep together. Maryanne says when her mom and dad stopped sleeping in the same bed they stopped being married and then her dad found a new person that Maryanne has to call mom even though she doesn’t like her. She says she has to have two houses and doesn’t get to be with her mom and dad together anymore,” he said in the longest speech she’d ever heard him give. Then his tears started to fall again as he thought about it.</p><p>“Your mom and I aren’t going to live in separate houses Jacob. We figured things out last night and decided neither of us could stand to be away from you. We will stay together and be a real family,” Derek said and tried to get his son to stop crying.</p><p>“Do you promise?” Jacob asked with a hiccup.</p><p>“I promise you that. As a matter of fact you can be my best man when we get married,” Derek added.</p><p>“Really? Do I get to wear a tux...tux...Oh I can’t remember what they’re called,” Jacob said and blew his breath out with frustration.</p> <p>“It’s called a tuxedo and if that’s what you want to wear then that’s what we will wear. We will have matching tuxes,” Derek promised.</p><p>“And will mom get to wear her princess dress?” he asked.</p><p>“If she wants,” Derek replied.</p><p>“Honey, I don’t need to wear a princess dress. We’re just having a small wedding and I would look silly wearing a big poufy dress,” she said. She was actually really disappointed to settle for a justice of the peace wedding. She’d always dreamed of her wedding day looking like a fairy tale. She’d learned the hard way long ago, fairy tales didn’t always come true, though.</p><p>“But, Mom...hold on,” he interrupted himself, then jumped from the bed and ran out of the room. Jasmine looked at Derek and shrugged her shoulders. She didn’t know what he was up too.</p><p>Jacob came running back into the room and she saw the familiar book about two seconds too late. She made a grab for it but Jacob had already crawled back onto Derek’s lap and opened the cover. Jasmine could feel her face flushing as Derek looked at a book that basically told him her dreams.</p><p>“Jacob, your dad doesn’t want to look at that,” she said as she tried to grab the book again.</p><p>“You do, don’t you?” Jacob said as he looked up at Derek.</p> <p>“Of course I do,” he said. He’d agree with anything Jacob asked. The kid could probably get a brand new motorcycle from him if he just asked. She’d have to talk about that with him. Instead of arguing, she sat back and glared at Derek as he gave her a look with his brows raised.</p><p>“See, Dad, this is the dress mom wants to wear. She said when she got married it would be like a fairy tale book and she’d be the princess marrying her prince and I got to be the young prince. She said she was going to one day find a frog and give him a kiss and then he’d become her prince and rescue her from the castle. I guess that means you’re the frog,” Jacob said and then broke out in giggles.</p><p>Derek looked through the pages of the book and felt like he was somehow intruding into her thoughts. She had pictures and notes of everything she wanted for her dream wedding. He got to the back of the book and raised his brows at her one more time, as there were pictures of what she wanted to wear on the honeymoon. She had excellent taste and his mouth watered as he pictured her in a few of the outfits.</p><p>“See, she has to have a fairy tale princess wedding. She made me listen to a ton of those girlie princess books. She told me it was to teach me how to be the perfect prince for my own princess. I don’t like girls but mom says that will change. I really think she’s wrong cause girls have coodies. It’s okay if dads like girls though,” he said as if he was bestowing his greatest wisdom.</p><p>“We will give your mom the fairy tale wedding then. You can help me to make sure everything is right, can’t you?” he asked. Jacob’s eyes widened in awe as his father bestowed that honor on him.</p><p>“Of course,” Jacob said with his most serious expression.</p><p>“Good then, that’s all settled. Do you want some breakfast?” Derek asked, as he tucked the book under his arm.</p><p>“I can take that,” Jasmine said and held out her hand. Derek ignored her and walked out of the room with her book, leaving her alone, irritated and feeling a bit left out.</p><p>She was tempted to crawl back down under the covers and fall asleep again but she knew she was far too stressed to even close her eyes.</p><p>She threw the blankets back, like a child having a tantrum and stomped into the bathroom. She decided she didn’t like men very much right then. She took her time in the shower and then finally decided to face the day and walked out to the kitchen with her head held high.</p><p>Chapter Ten</p><p>“I know you really like your house but it’s simply too small. I’m going to contact an agent today and set up some appointments. I did a cursory look last night and there are some really great places on the market I’d like to see. I’d prefer to build my own place but it takes too much time and I want us to get settled as soon as possible,” Derek said, as they were sharing a picnic in the park.</p><p>Jacob was playing soccer with some other kids, leaving them alone together for the first time that day. Her whole body tensed at his words. She liked her home. She knew it was small but she’d been paying for it all on her own and she didn’t want to give it up.</p><p>“I don’t want to sell my place,” she said, while crossing her arms and glaring at him.</p><p>“You don’t have to sell it. You can rent it out if you want or just let it sit empty. I can hire a cleaning crew to come in once a week to make sure it doesn’t get moldy or damaged,” he offered.</p><p>“Do I get a choice?” she snapped at him. She knew the place was too small and she knew they would be more comfortable with extra space but her world was being uprooted and she felt like she had no control over anything.</p><p>“I’m not your enemy Jasmine; I’m trying to do the right thing for my son. How does me wanting to watch him grow make me the enemy?” he asked her with exasperation.</p><p>When he worded it like that she felt like the bad guy. It wasn’t fair he was twisting things around. She was going to have to get over her feelings of betrayal over him walking away from her, or the next nine years of her life were going to seem like forever.</p><p>“You’re right, I’m being difficult but you have to realize Jacob and I have been fine for the past nine years and it’s hard to change,” she conceded.</p><p>“Can we call a truce for now, for the sake of our son?” he asked.</p><p>“That sounds good to me,” she answered, wanting some peace.</p><p>Derek made a few calls while Jacob was playing and within the hour he had appointments at six different locations. She was amazed at the speed the man was able to get things done.</p><p>Jacob came running up to them and dove into the food. All his playing made him very hungry.</p><p>“Hey buddy, want to go look at some houses?” Derek asked him.</p><p>“Why?” Jacob asked, with no interest.</p><p>“We’re going to find a bigger place to live so you have more room to play,” Derek told him. Jacob was very interested after that. He couldn’t wait to leave the park and look at houses. The first few they went to left Jasmine in awe. She’d grown up in the biggest house of her town and she thought it was fancy but it didn’t compare to the places they were looking at now.</p><p>Each house had electronic gates, requiring a key pad to even enter the driveway. The homes were enormous and she was afraid she’d lose Jacob if they moved into one of them. She was making sure he didn’t leave her sight as they toured each one. She didn’t know what Derek was looking for but the places weren’t holding his interest. She was actually grateful for that. She was hoping the other places were scaled down a bit.</p><p>Each time they left one of the places the real estate agent seemed disappointed but Jasmine was impressed with how well she covered that. Jasmine was sure the woman was going to make a killing off of the commission if Derek purchased one of the homes, as their price tag was in the millions.</p><p>The forth house they went to had a similar gated drive and was just as big as the others but seemed a bit different to her. It didn’t seem as cold, like the people who lived there, were perhaps more real. It was a colonial style that had a huge three story entranceway that was done in white rock. The door was big enough to drive a truck through, she thought, as they entered.</p><p>“This home is only three years old and was built to entertain. The man and his wife had it custom built but he has to go back overseas for a few years and they decided to go ahead and sell because he’s not sure where they will be when they come back. I know his wife is saddened to leave this spectacular home,” the agent began.</p><p>“There’s so much to offer, as you can see from just walking in the front doors. Some key features of the home is the property contains twenty useable acres, a full sized tennis court, a full size outdoor and indoor basketball court, along with both outdoor and indoor pools. Apparently the sellers had teenage kids who also built a paintball course on the south end of the property but if you’d like that to be taken out it would be an easy task,” she said as she eyed Jacob, thinking he might like that feature. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There’s a nice open room back this way, which can easily be used for conferences, dances, or whatever form of entertainment you would like. It features this beautiful chandelier from Italy they had made specifically for the home,” she continued talking as they walked from room to room. Jasmine was thinking the chandelier was probably worth more than her house.</p><p>“There are separate living quarters above the garage that many people like to use for either guests or for relatives to live in. It has its own separate entrance for privacy,” she said as she looked at Derek. Jasmine could feel her face heating with anger as she realized she was listing a secret place he could go to for an affair as a selling point. She no longer liked the real estate agent at all and glared at her back as they continued.</p><p>“Along this hallway are several bedrooms, suitable for children or visitors. Jacob can explore if he’d like but please don’t touch the owners items,” she added as he dashed down the hallway. “Through this set of doorways is the master suite. You step through here and you have a sitting room, with another door leading into the master bedroom. It features two full size walk in closets, with beautiful cabinets in them. The master bathroom has a Jacuzzi tub, separate walk in shower and steam shower, as well as a sauna. The room has its own private balcony with a gas fireplace, both in the room and on the covered balcony. I’m sure there’s so much more I’m leaving out but if you’re interested I can give you the full listing, which has everything on it,” she droned on.</p><p>The woman did know when to talk and when to be quiet though, because she stepped out of the room and let them take their time looking around. Jasmine hated to admit it but she was impressed. The home was palatial but it had a lot of touches that made it feel more like a home than a hotel and she liked it more than any of the others. She just wished it wasn’t quite so large.</p> <p>“Mom, my room is so cool. It has a huge closet, that’s as big as my old bedroom and I found a secret doorway that led somewhere. It was dark and I didn’t have my flashlight, so I couldn’t go in but I really like it mom. I could get so many more posters cause the walls are way tall,” Jacob said as he came running into the room completely out of breath and beyond excited. Derek took one look at Jacob’s face and she could see he had made his decision.</p><p>“This is the one I want,” Derek said as he turned towards the real estate agent, who was practically drooling on his shoes. Her face lit up with total joy, as she pulled out a stack of papers for him to fill out. Jasmine was sure the woman was glad she’d decided to take a last minute call on her weekend.</p><p>Derek filled in the necessary information, while the agent talked animatedly to Jasmine and Jacob. The woman probably couldn’t wait to get out of there and go celebrate.</p><p>“Tell the sellers I will give them a hundred thousand dollars over their asking price if they can be out within a week. I will also pay all closing cost and pay for professional movers to take their things anywhere they wish. They won’t have to pack a single thing; it can be done for them in one day. I want their answer by nine tomorrow morning and I want it in writing. If they can’t meet those terms I will find another place,” Derek told the woman, whose eyes had widened. Jasmine was sure she wasn’t used to dealing with clients like him. She also knew as much as he liked the house, if his terms weren’t met, he’d walk away. She was sure that’s what made him such a fierce businessman. Once he decided on a course of action, he stuck with it, even if that meant he may not always get what he originally wanted.</p><p>“I will let them know but I’m not sure if all the necessary inspections and escrow can get everything done in that amount of time,” she said, afraid she was going to lose the huge commission.</p> <p>“I will speak to my people and there won’t be a problem getting the necessary stuff done. I will be paying cash for this house, so there will be no financing issues. If the sellers agree to my offer, I can have this place ready to close in three days maximum. I was being polite offering them a week to move,” he said, in his authoritative voice. The man had a way of speaking that made people want to jump to do his bidding. He was just so powerful; there was no other word to describe it.</p><p>If he would’ve lived in the past, he would’ve been one of the Gods people idolized, as he wouldn’t have settled for anything less. A shiver ran down her spine as she realized she was going to be marrying him. She’d have to always remember who she was and not fade away behind his shadow. She also had to admit he was incredibly masculine when he asserted his unflinching authority.</p><p>“Okay Mr. Titan, I have all the necessary paperwork to get this started. I will get ahold of the selling agent and hopefully the sellers, this afternoon. I will notify you as soon as they have given a response but I know they have been eager to sell, so there shouldn’t be a problem,” she said, looking more like the confident agent she had appeared to be when they’d met her a few hours before. She really was trying to maintain her professionalism, which couldn’t have been easy around Derek.</p><p>“I appreciate it and will be waiting,” he said as if waiting wasn’t something that was easy for him. They parted ways and headed back towards Jasmine’s home.</p><p>As they pulled up in front of her house, it looked smaller than it ever had to her. She squared her shoulders as she walked in the door. It may be able to fit into the living room of the other home but she’d made it a great place for her and Trevor and there was nothing wrong with it.</p><p>Derek came up behind her and laid his hand on her shoulder. “Jasmine I’m really not trying to put your home down, I just do a lot of business from home and need more space. Jacob will also need added security once the press realizes he’s my son. I have a lot of friends and even more enemies. When you take over companies for a living, you make a lot of enemies. I won’t let something happen to my son because some disgruntled person decides to hurt me through my child,” he said, trying to reason with her.</p> <p>“I do understand,” Jasmine said. She didn’t want to talk about it anymore, so she went off to her room to be alone for a while.</p><p>The real estate agent called a couple of hours later and was practically giggling as she explained the sellers agreed to his offer. She said she could meet him anywhere he liked the next day to get all the paperwork filled out.</p><p>Derek made an appointment for her to meet them at the offices and Jasmine’s head was practically spinning with how quickly things were moving. It was a Sunday afternoon and Derek had inspections arranged for the following day and escrow scheduled for Friday. They would receive the keys to the house before the following weekend.</p><p>Jacob was squealing in delight at having his own swimming pool, among many other things. He called his best friends up and told them all about it and asked Derek if he could have a party so they could all see his new room. Derek, of course said yes but at least he Jacob to wait a couple of weeks so they could get settled in first.</p><p>Derek offered to have a moving company box up her things and she put her foot down. She didn’t want a stranger to go through her belongings. He actually had the gall to roll his eyes at her. She knew he was thinking she didn’t have anything that they would want but that wasn’t the point. Her things were personal to her and she didn’t want it tainted by a bunch of strangers putting their fingers all over it.</p><p>She knew most of her furniture would end up being donated and that was fine with her. The things she wanted to keep she was keeping and there was nothing he was going to do to stop her.</p><p>The next morning Jacob came rushing back into her room first thing in the morning. She was starting to get used to it.</p><p>“Why don’t you and dad sleep in the same room? I thought when moms and dads were married, they wanted to be together?” he asked her.</p> <p>“Your dad and I have been apart for a long time, that’s all,” she told him.</p><p>“Does that mean he won’t stay?” he asked with his big scared eyes.</p><p>“No Jacob, I’m not going anywhere, your mom just has too girly of a room, and too small of a bed for your big dad. We’ll share a room in the new house,” Derek said, as he walked in to join them.</p><p>She didn’t like how he kept walking into her room, as if he had every right to. Once again she wasn’t going to argue in front of her son, though.</p><p>“Okay, Dad,” Jacob said, as if everything the man said was gold.</p><p>They all got ready together and Derek insisted on taking his car in the morning. He told her it was ridiculous to take two vehicles. She once again just went with it, since Jacob was so excited to be taken to school by both of his parents.</p><p>“I need to go by my place and gather a few things, since there won’t be time tonight before we have to pick Jacob up,” he told her.</p><p>They pulled up to the luxurious condo complex, which even had a security guard at the front door. Jasmine was ever intimidated by the amount of money Derek had. She missed the boy who used to wear second hand jeans and always had a smile on his face. This new man was so much more cynical of the world around him and took for granted things that the young teenager would have been awed by.</p><p>They walked into his huge condo and though it was nice, it was so cold. There was only one picture in the entire place and it was a much younger version of him with his arms slung around his two cousins. She remembered them well from when they were teenagers. They’d always been able to make her laugh. She smiled at the fond memories.</p><p>“How are your cousins doing?” she asked him. She imagined they were doing as good as him, because the three had been almost inseparable and there was no way he wouldn’t share his success with them.</p><p>“They’re doing great. I just saw Drew the other day and Ryan is off in some other country right now. We all need to get together, it’s been too long,” he said, letting his guard down for a moment.</p><p>“They always made me laugh,” she said with a fond smile, still looking at the photograph.</p><p>“They’re great guys,” he agreed. He packed up some clothing and then led her back down the elevator. They went out to the garage and instead of getting back in the Porsche; he walked up to an SUV. She was a bit jealous as he unlocked it and opened the back end to put his things in. It was a really nice vehicle. She didn’t understand why the man needed two expensive cars when it was just him.</p><p>“I figure we should switch vehicles. The sports car is fun but this has far more room for Jacob,” he said. “Do you mind driving. I have some work I could do on the commute,” he asked, as he tossed the keys to her. He asked but he expected the answer to be yes. She wanted to drive it really badly though, so she didn’t complain. She stepped inside the luxurious interior and noticed there were hardly any miles on it at all.</p><p>“You must have gotten this pretty recently,” she told him.</p><p>“I had it delivered yesterday. I figured we would need it for Jacob and my office manager said this was rated at the top for safety,” he said as if it was no big deal.</p><p>“You purchased a vehicle without even looking at it?” she asked him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I trust my staff,” he simply said and then buried his head in his lap top. Jasmine just shook her head at how truly different the man was. Money did not concern him anymore at all but when he was a teenager he had talked so much of his dreams and what he planned to do with his life. Times really changed, she thought sadly.</p><p>They arrived at the office and spent the first couple hours going over the applications Jasmine had pre-screened. Derek then had her spend the next couple of hours setting up interviews for the rest of the week. He said he wanted to get things settled quickly, so the company could do as well as it should’ve been doing all along. His statement was offensive but she let it go. She actually agreed with him on a lot of things. Her father had hired some questionable people and the company had been run into the ground.</p><p>The end of the day arrived before she knew it and for once Derek didn’t complain when it was time to leave. It seemed he liked having a son and was eager to pick him up.</p><p>“Derek, when Jacob isn’t doing sports, he gets out of school earlier. I was able to take some of my work home with me before, so I didn’t have to put him in day care. I know you run business differently but I really do work well from home and would like to continue doing that,” she asked him, afraid he was going to go off on her about her not being the owner’s daughter anymore and being entitled to special favors.</p> <p>“You can quit all together if you would like, of course our son comes first and there’s no need for you to work,” he said matter-of-factly.</p><p>“I don’t want to quit. I enjoy working and I want to make my own money. Just because you have more than any one person needs, doesn’t mean I’d ever be comfortable spending it. If you don’t want me to work here, then I can begin searching for other work,” she said stubbornly, with her arms across her chest.</p><p>“I didn’t say I wanted to fire you, I just offered for you to be able to spend more time with our son. He will be grown before you know it and I don’t want you filled with regrets,” he said, exasperated. She decided not to respond, because she felt a tightening in her chest at the thought. She really would like to be able to go to the school more often. She’d always been slightly jealous of those room moms helping at the school during the week with their kids. She spent plenty of time with her son and was there for all of his special events but Derek was right that she was also missing out on a lot.</p><p>Jacob came running outside of the school as they pulled up and looked around with an eager expression on his face. He looked right past the SUV, so she stepped outside and called to him. He walked over, with his brows puckered, disappointed the Porsche wasn’t there.</p><p>They stopped by a moving company and loaded the SUV with a bunch of boxes, picked up some take-out and headed toward her house. Jacob helped his dad carry in all the empty boxes and the two men went into her son’s room to begin the massive job of packing his belongings.</p> <p>She stood in the doorway and watched silently for several minutes, enjoying the sound of both of their laughter. They had bonded so closely in only a few short days. She was grateful she’d told her son about his father and he had a great image of the man because he really was a terrific dad. They paused in their packing and Derek tackled Jacob on the bed and tickled him until tears were falling from his eyes, he was laughing so hard.</p><p>Jasmine reluctantly walked away from the room and headed into the kitchen. She put together several boxes and started deciding what she’d keep and what she’d donate. She knew a lot of her things wouldn’t fit in with the new home, so the donation pile seemed to get bigger, while her packed boxes weren’t taking up much room.</p><p>Derek came out every once in a while and hauled her packed boxes out to the garage, where he was making a nice pile. He’d talked her into letting a moving company at least come in and transport the items. She was actually relieved about that as she hated the actual moving portion. She didn’t mind the packing at all, as it was an adventure, discovering items she’d forgotten she even owned.</p><p>There were certain things she wasn’t willing to part with, such as her thousands of books and her mother’s antique china but there were many items she let go of with no qualms. By the end of the night she was exhausted and had barely made a dent in her small home.</p><p>“Derek, there’s no way I will finish all of this in time if I’m working all day. I’m going to need to take the rest of the week off to get it done in time,” she told him, as she sat down on the couch, completely exhausted.</p><p>“I was thinking the same thing. We really just have a bunch of interviews this week anyway. Take it off and get everything done. I will help you when I get back. Don’t even worry about Jacob, I will stop and pick him up on my way home from work,” he said, sounding just as tired as her. It was really nice to have him there to help with Jacob; she wasn’t used to that at all.</p> <p>“Thank you,” she said, before crawling off to her room to fall into an exhausted sleep.</p><p>Chapter Eleven</p><p>The week flew by quickly. Jasmine made incredible progress with her packing and had the local charity stop by twice because the items were piling up and filling her living room. It was a little sad to watch her items slowly being depleted and her home becoming so empty but she felt good getting it all done.</p><p>On Friday morning Derek was signing the final papers and the movers were coming to pick up her things at noon. She woke up with both a feeling of excitement and sadness. She found herself looking forward to moving to the new place. It was all a little bit exciting. The previous owners were already vacated and Derek had sent in the cleaning crew yesterday, so all that was left was getting the keys and moving in.</p><p>Derek went to the office and called her a couple hours later, letting her know all the papers were signed and they were clear to move. He’d be there in an hour to help her with the final things she needed done.</p><p>Jasmine slowly walked around her once homey place and couldn’t stop the tears that streaked down her cheeks. This home had been her and Jacob’s first sense of real security. She had been so proud when she signed her name on those papers and knew the place was hers and no one could take it from her and now she was walking away from it. She felt like she was abandoning her safe house.</p><p>Now everything was in boxes, or gone and she was off to a new adventure. She wiped the tears away and decided she was going to sell it. The thought of returning to this home all by herself was too depressing to even contemplate. She’d walk through the rooms and see Jacob in every corner and now she’d also picture Derek’s massive presence there too. It would break her heart a little when someone else occupied it but at least then it would be loved and new memories could be created.</p><p>She’d tell Derek to make the calls, since he was so good at it. Knowing Derek, it would be sold in a matter of days. The man just had a way of making things happen much faster than the average person could ever accomplish.</p> <p>She composed her features just in time, because Derek stepped through the doors and took a look around. “I guess there really isn’t anything left to do but wait for the movers. I brought some lunch so let’s eat and I will call the company and have them get here early,” he said.</p><p>The moving company showed up about thirty minutes after his call. She was surprised they didn’t just teleport and land on her steps, while he was still on the phone with them.</p><p>The men were professionals and she didn’t have to say or do anything. They had her house loaded into the truck within an hour and were on the road toward the mansion where Derek had someone waiting to let them in. Derek was waiting for her, as she looked around the completely empty house, with a sense of total awe. She looked in every cupboard twice just to make sure she hadn’t forgotten a single item and to draw out her last time in her home for a few more minutes.</p><p>She had to give Derek credit because he didn’t say a word as she drug her feet. He even stepped outside to give her a few more minutes alone. One last tear slipped from her eye and then she squared her shoulders, wiped her face and walked out the front door, shutting it firmly behind her as she said goodbye to her old life.</p><p>“Are you okay?” Derek asked her, as they walked towards their vehicles. It was a rare and tender moment and almost started her tears right back up.</p><p>“I’m fine, it’s just a little harder than I thought it would be saying goodbye to this house. I know it’s not much but it has been home for almost nine years,” she said with a little sniffle.</p><p>“It’s a great place and you kept it beautiful,” he said a bit awkwardly.</p><p>“Thanks Derek, I appreciate it, although I know you don’t really like it,” she said with a slight role of her eyes.</p><p>“I can always have movers come and bring it to the property if you want. There’s plenty of room,” he said to her. She looked at him, with her mouth hanging open, in astonishment. She could tell he was completely serious. If she asked him, he’d actually pay the ridiculous price to have her home moved, just to make her stop crying.</p><p>She started to giggle at the thought, it was so ridiculous. They only moved houses when they were of historic value, they didn’t move a typical home, just because the person was attached. She laughed even harder when she really thought about how much money the guy spent in a single day. She was sure it was more than she spent in an entire year.</p><p>“Thank you for the laugh Derek, I’m feeling so much better now,” she said and then on complete impulse threw her arms around his neck and gave him a hug. She hadn’t initiated contact with him once since they’d reunited. He stiffened for a moment in shock and then wrapped his arms around her, pulling her in tightly.</p><p>She needed the comfort and couldn’t pull back. Derek rubbed along her back and even though he was the reason her life was changing so drastically his comforting hands were making her feel better. She’d later think about the irony of the situation. It was kind of amusing.</p><p>His rubbing stopped being comforting and he started pulling her closer to him as his hand roamed lower with each pass. Her breathing deepened, as his touch started to send fire down her body. He brought one hand up to her chin, lifting her face up. Before she had time to blink, he brought his lips down to hers in a gentle kiss. If he’d been urgent, like he normally was, she may have been able to resist him but with this gentle side of him, she had no chance.</p><p>She threw her arms around his neck and leaned closer to him as he deepened the kiss, making her stomach quiver with need. She wrapped her arms around his neck, enjoying the feel of being held and the taste of his mouth, as he slipped inside. She couldn’t seem to get close enough.</p><p>“I didn’t know you were leaving,” a voice said, bringing her back to reality. Jasmine pulled back from Derek, who looked a little shaken up and turned towards the sound, to find her elderly neighbor standing a few feet from her. Either the woman was oblivious to the embrace she was just in, or didn’t care but she seemed unconcerned she’d interrupted the two of them.</p><p>“Yes Mary, it’s all happened so fast that I haven’t spoken to anyone about it,” Jasmine told her neighbor, feeling a little guilty about moving without saying goodbye. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, we’ll sure miss you and precious little Jacob,” the woman murmured.</p><p>“I will miss you too and your wonderful peanut butter cookies,” Jasmine said with a little hitch in her voice. She walked over and gave her neighbor a hug and then said her goodbyes.</p><p>“You can follow me,” Derek said, as he climbed into his vehicle. She climbed in her own reliable van, which sadly didn’t hold any appeal to her anymore after driving his luxury SUV and followed him out of the driveway. She looked into her rearview mirror until her home fell out of view. She let out a deep sigh and knew her life would be forever changed.</p><p>They pulled up to the new house and Derek entered the code for the gate to open. She drove the long driveway behind him, taking in everything. She’d only been there the one time and so she looked at the place with new eyes, trying to drink it all in.</p> <p>The home was certainly a show piece, with its immaculately manicured lawns. There was a surprising lack of flowers and she vowed to change that as soon as possible but the fountain in the center of the driveway added a nice showpiece, which was both comforting and homey at the same time. She could grow to love the home, that is, if she could figure out how to get from one end to the other.</p><p>She had to park in the driveway, as there were two huge moving vans backed up to the massive garage. There were several men hauling things from the back of the trucks and trudging into the house. Derek and her walked in and the place looked different with the walls all barren and the furniture gone. There were a few pieces of his furniture from the condo but his old place had been much smaller and they were going to have to buy more pieces to fill the place up.</p><p>The house looked better to her though, with all the previous owners’ things out. She could now picture her own belongings filling up the spaces. The more she walked around the empty home, the better she was beginning to feel. She was actually excited to use the swimming pool. It wouldn’t be available for use until the next day, because Derek had brought people in to perform a special cleaning on it, though it had looked spotless to her before. He’d said he wanted to make sure, since his son would be swimming in it. She couldn’t argue with him.</p><p>It only took the movers a few hours to get the trucks unloaded and then they were in the huge place, alone for the first time. She headed straight for the kitchen, excited more for that room, than any other and started to unpack boxes.</p><p>Derek had tried to convince her to let the movers unpack but part of the excitement of moving was to find her treasures and place them where she wanted. She didn’t want the strangers to do it, besides she’d never be able to find anything.</p> <p>“I’m going to pick up Jacob, we’ll be back soon,” he told her and she glanced at the clock. She had no idea it had gotten so late.</p><p>“I can go with you,” she offered reluctantly. She really didn’t want to stop what she was doing. By the smile on his face, he could tell.</p><p>“Go ahead and continue what you’re doing. It looks like you’re enjoying yourself,” he said and turned to head out.</p><p>“Oh look, there are Lazy Susan’s in all the corner cabinets,” she suddenly exclaimed. “They’re made of really nice wood, too,” she added like a child who’d just discovered a brand new toy.</p><p>Derek looked at her like she’d lost her mind. The woman wasn’t impressed with the ten million dollar mansion itself but was giddy when she discovered little turning shelves. He just couldn’t understand her. He walked out the door, as she continued to explore all the crevices of the kitchen. He was actually warmed by her love of the smaller things and was trying to fight the tugging on his heart.</p><p>He’d fallen so hard for her when he was a teenager, because even though she was the wealthiest kid in town, she’d never lorded it over anyone, unlike her father. She’d always preferred a pair of worn in jeans and a t-shirt over the latest styles. She’d seemed far more like him than the other snobby kids.</p> <p>It seemed not much had changed, if he looked at her home, vehicle and possessions. She owned nice things but nothing screamed extravagance. As a matter of fact, her son had far more items in his small space than she did. It was very obvious she loved and spoiled Jacob. He knew how much salary she made as well and it was ridiculously low for what she did. Her own father hadn’t given her a raise the entire time she’d been there. He’d assumed that was all just on the books and her dad was supplementing her on the side but from the way she lived, he no longer believed that.</p><p>Maybe she wasn’t the cold person he’d thought her to be when she sent her dad to say her goodbyes. Maybe there was another reason the whole thing had happened. He was determined to find out what those reasons were, even if it broke the semi-truce they’d started to share together.</p><p>He reached the school and Jacob was out on the curb and jumped into the vehicle, barely before he had it stopped. He was talking a million miles a minute and couldn’t contain his excitement to go to the new house.</p><p>He was asking if all his things had arrived yet and if the pool was ready to swim in. He wanted to know if Derek had gotten him a basketball and if they could buy a new puppy. Derek answered every question he could but he didn’t know if Jacob even heard him, because he’d fire another one off before he’d even finished speaking.</p><p>He found himself grinning widely as he enjoyed the enthusiasm pouring out of his son. At least he had made one of the pair happy with his purchase. He had a feeling Jasmine was going to become just as attached to the home though, if her excitement over the kitchen was any indication.</p><p>He barely got parked in the garage, before Jacob jumped from the vehicle and ran through the door. He heard him yelling a greeting to his mother, before he heard his footsteps fading away as he ran up the stairs. It was amazing the kid remembered how to get around.</p><p>“I hope he doesn’t get lost,” Jasmine said with some concern, as she stared at the tornado of energy her son had just left behind.</p><p>“Well then we could play Marco polo,” Derek answered with a laugh. She looked at him for a moment and then caved in and let the amusement take over as she laughed with him. “I will make sure he found his room and then see what I can do to get the place straightened up,” he said as he disappeared. Jasmine didn’t see either of the boys for a couple hours, as they all got lost in their different projects.</p> <p>Chapter Eleven</p><p>“Well look who’s coming up in the world,” Drew said into the speaker, as he waited for the gate to be opened.</p><p>“How did you find me, I thought I was hiding,” Derek replied. He’d been wondering who was buzzing him.</p><p>“Oh, it’s always easy to find my prey,” Drew replied.</p><p>“Hey open up this gate before I climb over it and kick your sorry butt,” Ryan’s voice spoke into the microphone.</p><p>“What the heck did you bring him for?” Derek said, as he pushed in the combo for the gate to open. He walked out the front door and waited for his cousins to exit the truck.</p><p>“Nice place, got an extra room?” Ryan said, as he came up the stairs and slapped Derek on the back.</p><p>“Sure, I do need to hire a gardener,” Derek replied, which earned him another punch.</p><p>“Heck someone is growing up to be a real boy, you got the house, the kid and soon a wife, whatever happened to our vows of being bachelor’s forever,” Drew said as he made himself comfortable and walked through the doors.</p><p>“Damn, I don’t think you have enough room,” Ryan called out, with a low whistle, as he took the place in.</p><p>“Whatever Ryan, your net worth is equal, if not more than mine,” Derek replied with a roll of his eyes.</p><p>“Well yeah it’s more than yours, because I haven’t spent it all for one house,” the man replied with an evil grin. He knew the money hadn’t even dipped into what Derek had.</p><p>They made their way out towards the back and the sound of Jacob splashing in the water. He spotted the two men and his eyes filled with curiosity. Derek considered them both more like his brothers and introduced them to Jacob as his uncles. Jacob was ecstatic to find he had uncles, since his mom was an only child and he had little family.</p><p>“I hope you have extra trunks, because I’m getting in that water one way or the other and I don’t want to make you look bad in front of your fiancé by showing her how lacking you are,” Drew said with a waggle of his eyebrows.</p><p>This time Derek punched him in the arm and then directed him to the changing area next to the pool, that was already stacked with extra suits. His two cousins changed quickly and soon the four boys were having a splashing war that had Jacob giggling uncontrollably.</p><p>“So where is Jasmine, I haven’t seen her in forever?” Ryan asked.</p><p>“She had to go pick up some groceries so we could eat. Jacob, here, is a bottomless pit. Apparently he doesn’t like grocery shopping though,” Derek said fondly. He hated to go food shopping himself. He couldn’t wait to get a staff hired to take care of it all.</p><p>They played in the pool a while longer and then finally dragged themselves out, with reluctance. They got changed and then helped Derek get things unpacked. There was a floor to ceiling library Jasmine had about cried over. He wanted to surprise her, by getting all her books loaded up onto it. The room was pretty great, with a wood fireplace and a huge window with a seat in it. They were going to spend the week shopping for furniture to fill this room, along with many others.</p><p>With his cousins there helping him, they had the library and living room unpacked in no time. They even managed to get most of the artwork hung on the walls. He looked around, feeling pretty good about their progress.</p><p>They’d just sat down, when he heard the garage door open. He stood up to help Jasmine carry in the groceries and Drew and Ryan followed him.</p><p>When they stepped out into the garage Jasmine saw them and her entire face lit up. “Drew, Ryan it’s so good to see you,” she said, as she ran towards them and threw her arms around one and then the other.</p><p>“Jasmine you’re looking more gorgeous than possible. Are you sure you want to stay with this bum, I think I can convince him the kid’s mine and we can run away together,” Drew offered her with an evil grin towards his cousin.</p><p>“Drew I have so missed your sense of humor. You have to tell me everything you’ve been up to for the last ten years. I’m sure there’s a trail of heartbroken women in your wake,” she said with a genuine smile.</p><p>“Yeah Drew is just a barrel of laughs,” Derek said, not loving that Jasmine was so open and easy with Drew and so withdrawn from him.</p><p>The guys grabbed groceries and set them on the counter so she could get it put away. They sat on the counters so they could continue talking to her while she put items where they belonged and then begin making dinner.</p><p>Soon spectacular smells were surrounding all the men and she had to push them out of the kitchen, because they wouldn’t quit picking at things. “You guys go play for a while and I will let you know when everything is ready,” she told them.</p><p>“We may wither away and it will all be your fault,” Ryan said before jumping down and exiting the kitchen. She finished her salad and had the casserole in the oven, so she decided to go work on the library. She was really anxious to get it all put together. She couldn’t wait until the day the shelves were filled from top to bottom. It would take many years but part of the fun was adding new additions to it each week. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She walked in the room and gasped. The guys had unpacked everything and it looked so good. They’d even put proper books together. She only found a few were out of place. She walked back into the living room, where they were sitting and gave Derek a huge hug, which surprised him.</p><p>“Thank you so much for putting all the books up, I know it must’ve been a bit of a pain, since I have so many of them,” she gushed at him.</p><p>“You’re welcome. I wanted you to start feeling at home. I know this house is a little intimidating,” he said with a shrug.</p><p>“It was very sweet of you,” she said with a smile.</p> <p>“Hey we helped to, where’s our hugs,” Ryan said with a wicked grin. She went over and hugged both him and Drew. Derek glared at his cousins, as they held on a little bit too long to be appropriate. He knew his cousins would never actually try and take his woman but he also knew the men liked to raise his blood pressure and they were doing a fine job.</p><p>“I can’t wait to go shopping at all the used book stores and fill those shelves up,” she said eagerly.</p><p>“I bet you have them filled up within a week and then will have us over here building you more shelves,” Drew said. Jasmine had always been an avid reader in school. She never went anywhere without at least one book in her bag, for just in case she ended up stuck somewhere. If she had a book, she had a constant form of entertainment.</p><p>“I can’t wait to get one of those super cushiony couches so I can go in there and fall asleep with a good book,” she said a bit dreamily.</p><p>“Oh Cuz, it looks like you’re getting replaced by a good couch and some book hero,” Ryan teased him.</p> <p>“You’re both about to be booted out without dinner,” Derek threatened them. They knew he was all talk and they didn’t look the least bit concerned.</p><p>The timer on the oven went off and the men immediately headed for the dining room. Luckily Derek had a huge table already and there was plenty of room for all of them. She had the men carry the dishes to the table and then watched in amazement, as everything she made disappeared in no time at all.</p><p>“This is good, Mom,” Jacob said. The men quickly agreed with him, in between bites. She felt pretty great, because the kitchen was a dream to cook in and her company had enjoyed her meal.</p><p>“Seriously you should open a restaurant,” Drew told her.</p><p>“I would never want to do that, because then it would be work and no longer a joy and right now I love to cook, especially when it’s for people who like it,” she answered him.</p><p>“Well I can come over every night, so you have an audience,” Ryan offered.</p> <p>“Anytime you want,” she said, meaning it. She really did care about both of Derek’s cousins and was so glad to have them in her life again. It was like everything had come full circle. Maybe it was time to let the past go and focus on the here and now. Derek was an amazing father and he was being good to her.</p><p>She had to be careful with her heart though, because he’d already told her they would only be together long enough for their son to grow up. If she got too attached, it would destroy her when she was kicked from her home and her life.</p><p>“When’s the wedding?” Drew said, after they finished off their dessert. Jasmine looked at Derek, because they’d never discussed a time frame.</p><p>“I wanted to get settled into the house first so I think in about a month. That would give you enough time right, Jasmine?” Derek asked, putting all the pressure on her.</p><p>“That’s plenty of time,” she answered him, feeling a bit of her panic come back.</p><p>“Well then it’s settled. We will get married four weeks from today. A Saturday is always a good one to do it on right?” he asked her once again.</p><p>“That would be fine but honestly it doesn’t need to be anything fancy. We can just go to the justice of the peace or something. Jacob could still wear a tuxedo there,” she pleaded. She didn’t need to keep adding more memories that would hurt all the more when things were completely over.</p><p>“You can’t get married like that. This is your wedding. You’ll want pictures and cake and of course your guests all want food,” Drew said, which surprised her. He was the known playboy and he was talking about a wedding. It didn’t seem to fit.</p> <p>“Don’t worry, we’re having a real wedding,” Derek said and then almost glared at her; like he was offended she’d even mentioned doing it any other way.</p><p>“I was just trying to make things simpler,” she said guiltily.</p><p>“We better head out, I’m leaving for a business trip tomorrow,” Drew said, as he stood up. “Thank you for the amazing meal Jasmine, I can’t wait to get back for some more,” he told her and then bent down to kiss her goodbye.</p><p>“Yes, thank you so much, everything was great. It was awesome to meet you young man and we will be back to teach you some more bad habits,” Ryan added and gave Jacob a hug.</p><p>Derek walked them to the door and then the house suddenly seemed so much emptier without them in it. They had a way of bringing life wherever they were. She figured some things never changed.</p><p>They were all tired and took Jacob to his room. They both took turns reading him his story and then left the room. Jasmine had been so tired the night before she’d fallen asleep with Jacob while she read him a story. She realized she had no idea where she was supposed to sleep.</p><p>She stepped out into the hallway and was unsure which direction to go. “Problems?” Derek asked, not making things easier on her.</p><p>“I just don’t know which room I’m sleeping in. I’ve been so busy, I haven’t even had time to explore where everything has been placed,” she said.</p><p>“I thought you knew where the master bedroom was,” he said as he continued to stare at her. She looked at him like a deer in a headlight. She wasn’t ready to fall back into bed with him but they’d been getting along and she didn’t want the truce to end. She didn’t know what to do.</p><p>Derek grabbed her by the arms and kissed her mindlessly, as he molded their bodies together. He had her breathing heavily and her mind a complete blank. She could so easily cave into her own needs and his as well.</p><p>He let her go just as suddenly as he had grabbed her and glared down at her. “I have never had to force a woman to be with me and I’m not forcing you. You take the master room and I will take one of the guest rooms, for now. You’ll beg me to join you soon, though,” he said with an arrogance that had her teeth grinding together.</p><p>“I wouldn’t hold your breath,” she stormed and then walked away from him and shut the door in his face. Derek thought about going after her for about a minute, before he realized that would just end up with them in bed again, with nothing solved.</p><p>He could bide his time for a little while longer but if she didn’t come to him soon then he’d implode. He strode to the far end of the hall and walked into the only other room with a bed in it. He jumped in the shower and froze his erection away, before climbing into her small bed. He laid there for hours, picturing her in his huge four poster, king sized bed, which made him hard and miserable again. It didn’t help at all with her scent seeming to be soaked into the bed and surrounding him. He groaned as he tossed and turned.</p><p>They had to come to an understanding before too long, or he wasn’t going to make it. His body just couldn’t take the pain.</p><p>Jasmine slept unbelievably well. She felt a tiny bit of guilt over taking Derek’s bed but what a bed it was. It was huge and comfortable and the sheets and covers were soft and silky. She had laid down, thinking she’d be awake for hours but the next thing she knew it was morning. She stretched out her arms and realized she had no aches anywhere. She was thinking she should’ve bought a bed like this years ago.</p><p>She took a long shower in the master bathroom and was delighted when four different heads all applied varying amounts of pressure over her body. She stayed in there for about an hour and the hot water never ran out. She couldn’t wait to try out the deep tub with the jets.</p><p>Jasmine came down the stairs to find Jacob and Derek sitting at the table, eating some cereal. Jacob was his usual talkative self, sputtering about his new room and how he couldn’t wait to have his friends over. She smiled to see her son so happy and excited.</p><p>Derek looked up at her and she almost gasped out loud at how rumpled he looked. He had dark circles under his eyes, like he hadn’t slept at all and his clothing was even wrinkled. She didn’t know what to say, considering she’d slept better than she ever had in his comfortable bed, while he looked like he had tossed and turned the entire night.</p><p>“Good morning,” she finally said, almost singing the words, she felt so good. Derek said nothing; it was more of a grumble. She had to fight the laughter. He was even gorgeous grumpy, rumpled and snarling.</p><p>She cleaned up their breakfast mess, enjoying the high tech appliances in the kitchen. She wanted to get more groceries so she could do a bunch of baking. She couldn’t wait to smell the sweetness of pumpkin bread scenting the house.</p><p>“We should leave soon, I want to go to the furniture store, so we can fill up this place,” Derek finally said. He was on his second cup of coffee and seemed to be looking a little bit more alert.</p><p>“That sounds like fun,” Jasmine said. She really wasn’t all that interested in furniture shopping. She’d rather get groceries or books but she didn’t think it was a good time to mention that, not in his current mood.</p><p>“I’m going to go change, it looks like you’re ready so give me about a half hour and we’ll take off,” he said, as he practically stomped out of the kitchen.</p><p>Derek came down the stairs, still with dark circles but looking as gorgeous as ever in what he considered as his casual clothes. He was wearing dark slacks and a white button down shirt. He looked unbelievably good and it took everything in her not to run her hands up his body.</p><p>Jasmine and Jacob followed him out to the SUV and soon they were off towards town. He pulled the car off the road and parked near a huge furniture store. The building had to be at least three stories high. She got out and started to follow them towards the doors, when she spotted a second hand book store a few doors down. It was huge and calling her name.</p><p>“Can I meet you guys in the furniture store?” she asked. He raised his brows in question. “There’s a book store over there I want to check out. I should only be a few minutes,” she almost pleaded.</p><p>“You don’t need to buy used books. I can buy you whatever you want, new,” he said, perplexed that she’d want to buy second hand books.</p><p>“Oh no, there are treasures in there, Derek. You can find autographed copies and discontinued books. You can find original covers and ancient copies. It’s a total treasure hunt in a used book store,” she explained to him, with genuine excitement pouring out of her.</p><p>“If you really want too...” he said, like he couldn’t imagine the excitement.</p><p>“Perfect. Go ahead and pick out whatever you want for the house. Just leave the library for last please. Oh and please don’t get anything that is black, or any brown fabric and I really don’t like leather because makes you sweaty when you sit on it. Other than that I don’t care how we furnish,” she said in one breath. She really wanted to get to that store. Derek nodded to her and she turned and rushed through the book store’s doors. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Derek watched her as she disappeared and then looked at Jacob like she was crazy. “Mom always gets like that when she finds a new book store. She will be in there all day. I usually try and find a book to read in one of their comfy chairs, cause I know it will take forever. She always feels bad about how long she’s taking though, cause she buys me a big ice cream sundae afterwards,” Jacob said, trying to decide if it was worth it to follow his mom.</p><p>“I will take you out for ice cream and you won’t have to sit in the bookstore all day,” Derek said, as if reading his thoughts.</p><p>“Yeah,” Jacob said, clearly making his choice and following his dad into the huge furniture store. “Can I have a new bed? I know my bed is good but I’ve had it forever and I really want to get a bunk bed so my friends have somewhere to sleep,” Jacob pleaded with him.</p><p>“You can have all new furniture for your room. You’re a big boy and it’s time you got a desk and new dresser and other things that fit you better,” Derek said, not able to deny his son a single thing. “Let’s go get your stuff picked out first,” he finished and grabbed Jacob’s hand.</p> <p>Derek was starting to feel better as he watched Jacob’s excitement over his new things. The kid was so enthusiastic and excited about everything and Derek was humbled by Jacob’s appreciation of everything he got.</p><p>Derek realized Jasmine hadn’t spoiled him in a bad way. Jacob was a good boy in so many ways. He was appreciative of things and always polite to everyone around him. He was so unlike other children and he was really starting to realize Jasmine wasn’t the materialistic person he’d once thought she was.</p><p>Her choice in furniture was another example of who she was. She didn’t want the exquisite leather showpiece furniture. She wanted something that was comfortable for her and her guests. She didn’t care about what people saw when they walked into the room, she cared they were comfortable. She was going to be a breath of fresh air, in a world of corporate sharks.</p><p>They soon had the furniture ordered for every room in the house except the library and Derek realized three hours had passed and he still hadn’t seen Jasmine. “Have you seen your mom yet?” Derek asked Jacob.</p><p>“I told you. She forgot how much time has gone by, like she always does,” Jacob said, with a role of his eyes.</p> <p>“Let’s go find her,” Derek said with a slight smile. It was kind of endearing she got so lost with her books.</p><p>They walked into the bookstore and found Jasmine at the checkout counter and there were about four overflowing bags at her feet and two more on the counter. He looked from her to the bags and back again. She spotted them as the cashier ran her credit card.</p><p>“Oh I’m sorry it took so long, I lost track of time but they were having a great sale and there are just so many books here,” she explained quickly and then looked from her bags to them with a guilty expression.</p><p>“We better start hauling these out to the car,” Derek said with a smile.</p><p>“I know I spent too much and I’m sorry but those empty shelves need to be filled and they had such a great sale,” she said, following him with two of her own bags. He was going to have to make another trip.</p><p>He was really curious about what her idea of too much money was. “How much did this all cost you?” he asked.</p> <p>Her face turned red and he was thinking she spent several thousand dollars. He really didn’t care. “Two hundred and twenty dollars,” she mumbled. He could barely here her and asked her to repeat herself. When she did, he stopped and stared at her. She was feeling guilty about spending two hundred dollars on books.</p><p>He started laughing, quietly at first and then it just kept building up until he was doubled over, he was laughing so hard. He was trying to stop and couldn’t. His stomach was hurting, he was shaking so much. It took him about five minutes to get himself under control enough to speak and by that time Jasmine was glaring daggers at him and Jacob was smiling like he enjoyed the sound.</p><p>“I don’t see what you find so amusing,” she snapped at him.</p><p>“I can’t believe you’re standing there with a guilty expression on your face from spending two hundred dollars on books. Seriously Jasmine, one of the stools we bought today cost twice that amount,” he said, still chuckling.</p><p>“Well, whatever,” she huffed and then headed towards the furniture store. She was glad he wasn’t trying to guilt her over the purchase but he didn’t need to laugh at her. Her father had always told her she wasted her money on books. He couldn’t understand why she’d want to read all that nonsense, as he’d put it. She loved to sink into her fantasy worlds and she didn’t care what anyone had to say about it.</p><p>Derek and Jacob quickly caught up with her and although Derek was no longer openly laughing, she could still see the sparkle in his eyes and knew he was fighting it. She finally smiled, realizing that it was a little silly of her to be so uptight. She relaxed and then had a good time finding her furniture.</p><p>She had to like the fabric, first of all, and tested the different couches by touch. When she found a material she liked, she’d sit on it and see how comfortable it was. She must have done that with a hundred couches before she found the one she was searching for. The other furniture was easier to find and soon they were done.</p><p>She didn’t know what strings Derek was able to pull but they were delivering everything the next day. She couldn’t wait to get the library all set up.</p> <p>By the time they got back home the three of them were dragging their feet. It had been a busy day but a very successful one. Jasmine was kind of bummed to have to return to work the next morning. She was enjoying putting her new home together and didn’t want to stop.</p><p>Chapter Thirteen</p><p>Over the next several weeks the tension between Jasmine and Derek was escalating. He continued to let her have the master bedroom on her own but she was finding it was very lonely in the huge room by herself. She was afraid he may end up winning once again and she was going to beg him to join her.</p><p>They’d been planning the wedding together but for the most part he was doing everything. Her dress was being made for her and she had several fittings. She was in love with it and actually really excited for the finished product. She didn’t know how Derek had managed to get it done but the designer was making the dress almost identical to the picture she had. Jasmine had taken pieces from several different photos of dresses she liked and pieced it together. The designer was phenomenal and she couldn’t wait to wear it.</p><p>She and Derek started taking separate vehicles to the offices, as he was spending his time between the main office and his newest take-over. As the new people got hired and into place, he was only coming in about one day a week. He was also getting back to the house later and later. Jacob was beginning to complain to him.</p><p>He told Jacob he promised to be home more once he was done working on a new business deal but Jasmine thought there was a lot more to it than that. She thought she’d be happy about not having to see him so much but she’d gotten used to him being around and now that he was disappearing she felt abandoned in her huge home.</p><p>She tried to make the best of the situation and entertained Jacob as much as possible. He had his sleepover and about ten boys came and spent the night. They were in love with the swimming pool and basketball court and couldn’t figure out which to do first.</p><p>They went from activity to activity until they were exhausted and crashed in the den, watching scary movies and filling up on junk food.</p><p>Jasmine continued to keep busy with her son and the wedding and soon almost an entire month had passed. Her wedding was coming up in a few more days and she was terrified. She’d barely spoken to Derek since they had moved in and she noticed she’d actually seek him out and find reasons to be in the same room. He didn’t seem to feel the same way. It was breaking her heart all over again.</p><p>It seemed to be the same story as when she was only an eighteen year old girl. He’d gotten what he wanted, so he didn’t want to be around her anymore. She was starting to really panic about the whole situation. She was already getting dependent on him once again and she knew Jacob was and she didn’t know if she was going to be able to pick up the pieces this time if he left them.</p><p>Jasmine was sitting in the library reading, which wasn’t unusual. Jacob was at a sleepover and Derek was at the office, late once again. The buzzer sounded alerting her someone wanted in the gate.</p><p>She knew it couldn’t be Drew or Ryan, as they had the code but she couldn’t figure out who else would be there so late in the evening. She got up and answered the ringing.</p><p>“Can I help you?” she asked, still feeling a little silly speaking into a box.</p><p>“It’s Amy. I have some materials for Derek,” said the sexy female voice.</p><p>Jasmine couldn’t understand why Derek would ever let one of his ex-girlfriends come to her house but she figured he didn’t care if he threw the woman in her face. She opened the gate and just hoped she was in and out quickly.</p><p>Jasmine met her at the door, because she wanted the visit ended soon. The woman looked like every man’s fantasy come to life in her incredibly short skirt, skin tight blouse and heels making her legs look like they were endless. She had red nails to match her red lipstick and Jasmine felt a bit intimidated, as she was standing there in her sweats, without make-up and her hair thrown back in a very messy bun.</p><p>“Thank you for bringing this over. I’ll give them to Derek as soon as he gets home,” Jasmine said, as she held out her hand to take the items.</p><p>“Oh, he hasn’t made it back yet?” the woman said, as if she knew exactly why he wasn’t there. Jasmine narrowed her eyes, no longer even pretending to be friendly.</p><p>“He’ll be home anytime,” Jasmine said.</p><p>“I know, I’m meeting him here. We do have a lot of business to take care of, so I’m sure you can find something else to do,” she suggested in a manner that implied her and Derek had a lot more to do than business. Jasmine’s first instinct was to toss the woman out on her doorstep, with her fist but she was a better person than that.</p><p>“Fine, you can wait in the den,” Jasmine said through gritted teeth. She decided if he was going to bring his tramps into the house this wouldn’t work. She was going to give him a piece of her mind later.</p><p>She lay down in the library to wait for him to come home and sleep finally overtook her. When she woke it was three in the morning. She sat up quickly and looked out the window. She was relieved to see Amy’s car was gone but still angry he’d asked the woman to her house. There were just some boundaries you didn’t cross.</p><p>She climbed up the stairs and went to his room. He wasn’t in there, so instead of searching the house from top to bottom, she decided to get some sleep and then confront him in the morning.</p><p>She quickly undressed and climbed beneath the covers. She felt a movement and was startled to find Derek in her bed. “What are you doing here?” she snapped, as she tried to jump from the bed. She was far too angry with him to do anything.</p><p>“I got sick of waiting for you to come to me and I’m tired of your bed,” he said, as he snaked his arm out to grab her before she could move away. When he realized she was completely naked, he groaned in pleasure and then she felt his lips connect with hers. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The second he started kissing her, she could feel her own body’s response. She attempted one more time to pull away but he simply increased the pressure of his mouth while his hands started rubbing over her curves.</p><p>They hadn’t been together in a month and she was just as hungry as he was. She gave up the fight and wrapped her hands around his head to pull him closer to her. She was burning and needed him to take it away. She forgot all about her worries and just let her body’s desire take over.</p><p>Derek kept his mouth locked on hers, thrusting his tongue in and around her mouth. She could feel the heat pooling in her core. He was pressed to her side and she could feel his engorged arousal pressed against her hip. Her need was overwhelming, wanting him inside her.</p><p>He moved his lips down her neck and licked along her pounding pulse, making her body squirm beneath him. His hands were rubbing slowly up and down her body and when he brushed over her hardened nipple, her back arched off the bed, desiring so much more.</p><p>He finally moved down the mounds of her breasts and kissed all around the spot she needed him to touch. His tongue ran around the outer layers of her throbbing nipples and she tried to twist in his direction, so he’d take the bud into his mouth.</p><p>He finally did as her body was asking him too and sucked the tightened bud into his mouth, causing a ripple of lightening to shoot all the way to her core. She could feel the heat pooling and getting ready for his erection to push inside her.</p><p>He massaged her breasts with his hands while he sucked and licked the swollen buds. She continued to wiggle underneath him, until he finally moved down her stomach and then she couldn’t stop the shacking that was overtaking her body. He moved down her smooth surface and finally reached the throbbing core of her body.</p><p>As his tongue swiped out to caress her folds, she could feel the pressure building inside her. He sucked her sensitive nub into his mouth and she jerked with the powerful orgasm that washed through her. She continued to shake as the ripples washed through her over and over again. He slowly kissed his way up her body, not missing a single spot.</p><p>When he brought his lips back down to hers in a gentle caress, she felt like she could float away on a cloud. It was magical in its intensity. He continued to kiss her mouth and face and her body began to heat up again.</p><p>She boldly flipped him over on his back, to return some of the pleasure she had just received. She ran her tongue down his masculine throat. She loved the slightly salty taste of his body.</p><p>She continued down over his hard pecs, loving the feel of his muscles quivering underneath her tongue. His body was so incredible and she loved the texture of his smooth, hard skin. She moved down his stomach and traced the slight line of hair below his belly button. His hips jerked as she continued lower on his body.</p><p>She finally reached his engorged staff and held it within her hand, rubbing it through her fingers. She circled the head and then licked the fluid that dripped out. His hips jerked off the bed in pleasure, as a moan escaped his lips.</p><p>Jasmine finally lowered her head over the hard shaft and took him deep within her mouth. He groaned as she lowered her head up and down his member, while stroking it up and down with her hand. She enjoyed the silky smooth skin inside her mouth and continued moving up and down, faster as his moans of pleasure egged her on.</p><p>He stiffened up and then grabbed her head to pull it away, “this is going to end far too fast if you keep doing that,” he growled. He pulled her up his body and she straddled his hips. They had never made love with her on top before and she was nervous sitting there, with his eyes roaming all over her body. She felt a sense of power though and it was incredibly erotic.</p><p>He guided his throbbing shaft towards her entrance and then she slowly slid down on top of him. As her body lowered, she felt the pressure building and her body’s natural instincts took over. She started moving up and down his erection, as her body smoothed the way. She was so hot and moist and he slid easily in and out of her.</p><p>She could feel herself start to shake as the orgasm built back up inside her. He lifted his hands up to knead her breasts, as they swayed with each movement she made. He rubbed her nipples between his fingers, slightly pinching them, before smoothing his hands back over the peaks. She could feel the tug all the way down, deep inside her.</p><p>He moved one hand and started rubbing her throbbing nub in a tight circle, building the pressure up even more. She began moving quickly, as her body was tightening. She threw her head back and braced her hands on the bed. Both their bodies were quivering, as she continued the up and down motion.</p><p>She thrust down hard and then started shaking uncontrollably as the orgasm rocked through her entire body. She could feel the fire shooting down her legs, as wave after wave of intense pleasure shot through her. She lost all energy, as she slumped forward across his chest. Both their bodies were covered in a fine glaze of sweat and she was sliding against his hard chest, making her sensitive nipples quiver.</p><p>He grabbed her hips, to steady her and thrust up and down her still shaking body until he tensed and cried out as he shot his release deep within her womb. He continued to move a few more times to draw out the pleasure and then was still as she lay sprawled atop of him.</p><p>His hands ran up and down her back, smoothing over her butt, making her still sensitive body shake with the pleasure from his touch. He stroked her hair, as they both enjoyed the aftermath of their lovemaking. He finally turned her head and kissed her gently making her fall even more in love with him than she ever had been before.</p><p>She finally shifted off of him, breaking the connection of their bodies. She didn’t know what to do and was going to get up but he refused to release her. He kept stroking her hair, neck and back, turning her whole body to jelly.</p><p>Their breathing finally got under control and they lay there in a comfortable silence. She was starting to drift off to sleep when he finally spoke.</p><p>“Why would you have not only opened the gates to Amy but allowed her in our home?” he asked her. His voice wasn’t filled with anger just disbelief she would’ve done such a thing. She looked up at him in shock. He didn’t seem happy at all that she’d let the woman in. Maybe Amy had lied about their business meeting.</p> <p>“She told me she had business papers for you and you had a meeting scheduled. She actually made it sound like the two of you were still lovers, which I was going to talk to you about but you kind of distracted me,” she said, barely above a whisper. She really didn’t want him to confirm he was lovers with another woman, especially after making love to her so passionately. It was hard for her to imagine he could be with her like this and then go be with another woman.</p><p>He stared at her for a few moments, seeming to be in shock. “I have never slept with that woman, as a matter of fact she was starting to push the boundaries of her employment and I fired her over a month ago and haven’t seen her since. I was quite shocked to walk into my den to find her sitting there, half naked. I quickly escorted her off the premises,” he said, in a voice that left no doubt he was telling the truth.</p><p>“It was very obvious she came here tonight to make a play for me, which I understood in her demented mind but what was plaguing me is that I couldn’t figure out why you would’ve let her in. I guess I never mentioned she was no longer an employee and why would you have thought we were lovers?” he questioned her.</p><p>“That day we were having lunch together, she was in the bathroom and told me that not only were you lovers but that she was expecting you to propose marriage to her at any time. I thought you really wanted to be with her but found out you had a son and were doing the right thing by him. It’s really bothered me because I can’t sleep with you while you’re having sex with other women. I know we aren’t getting married out of love but I don’t want either of us taking other lovers if we share the same bed,” she said.</p><p>She had turned away from him, because she didn’t want him to see the pain in her eyes. She didn’t want him to know the truth of how much she really cared. It wasn’t unreasonable for her to ask him not to take on mistresses. There were a number of reasons besides love she’d make that request.</p><p>“I want to share a bed with you Derek, if we’re going to be faithful to each other,” she finally gained the courage to say. It was very hard for her to do, since the last time she’d opened up her heart to him, he had walked away without a backwards glance.</p><p>Derek flipped her over onto her back again and covered her body with his. She was surprised, when his fully engorged erection was at her entrance, begging to enter. He gently spread her legs open and slipped inside her still wet heat.</p><p>She instantly felt the pressure start to build, as he very slowly pushed in and out of her. She was starting to lose all thoughts, including what they were talking about.</p><p>“I have no desire to be with any other woman when I’m with you. I haven’t slept with another since you stepped back into my life and I guarantee you I won’t. You’re mine now,” he growled, before locking his lips back down on hers.</p><p>Jasmine felt a sense of peace, along with the building pressure of her body, as he continued to stroke her with his hands and body. They made love several more times that night, like there was no way either of them could get enough of each other. She’d be very tired over the next week.</p><p>Chapter Fourteen</p><p>It was her wedding day and Jasmine was having a difficult time breathing. She’d been plucked, waxed, ironed and every other unimaginable pampering so much she didn’t recognize the person who stared back in the mirror.</p><p>She turned around in a slow circle to see herself. The dress was everything she could’ve ever imagined and so much more. It had layer upon layer of silk and lace that cascaded down her body. The top was fitted and made her seem like a true princess. Derek had even purchased her a tiara, that she was more than a little suspicious, contained real diamonds on it. She hadn’t let it out of her sight for a moment.</p><p>She had to admit to herself, the crew he’d hired had done a spectacular job, because she looked really nice. She sighed as she stood in the waiting area. He’d been very secretive about where the actual wedding was taking place and she was in a huge tent with partitions in it. She was going to be picked up at any moment, to be taken to the site.</p><p>“Ms. Freeman your carriage is here,” one of the people said to her. She stepped outside and felt tears fill her eyes, as she saw the horse drawn carriage. It was something right out of Cinderella and it was absolutely perfect. There were four white horses pulling it and a doorman wearing an old fashioned tuxedo, holding open the door. Derek really had thought of everything to make the wedding a true fairytale and she was speechless.</p><p>She glided to the carriage on the soft carpet laid out to the door. One of the attendants was holding the train of her dress up, so that it wouldn’t drag on the ground. The doorman helped her inside and then a couple of people straightened out her dress.</p><p>Soon the carriage started forward and she looked out the open windows, wondering what could possibly come next. She hadn’t seen Jacob all day and couldn’t wait to see what he looked like in his little tuxedo. He’d been so excited about the whole event. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They turned a corner and then she saw where they were going and her breath hitched in her chest. Why would he do this? She knew he was angry with her for keeping his son from him but why would he go to so much trouble to give her the fairytale wedding she’d always wanted and then chose the one spot that spelled complete heartbreak for her.</p><p>As they pulled up in front of the little church she’d been left standing alone at she noticed he’d been busy. The little building, which had once been condemned, was now completely remodeled. It was the same church and looked like it must have when it was originally built but it was now completely fixed up and had flowers decorating the stairs, leading up inside of it.</p><p>She refused to leave the carriage. The doorman stood there, looking slightly panicked, as the bride refused to exit. She felt a tear slip down her face and didn’t care if her make-up was most likely ruined. She didn’t care about any of it. All she cared about was that even on her wedding day Derek felt he must punish her for some unknown reason.</p><p>She told the carriage driver to take her away and he looked at her like she’d lost her mind. She knew he’d been hired by Derek and there was no way he was leaving with the bride still in the carriage but she had to try. She saw the doors open and then Daniel was descending the stairs. She’d always loved Derek’s father and though she would’ve normally been happy to see the man, today wasn’t one of those days.</p> <p>He came up to the doors and saw her silently crying. He said nothing for a few moments as he stood there and then silently handed her a handkerchief for her to wipe her face on.</p><p>“What’s the matter, Jasmine?” he asked, with what sounded like true concern.</p><p>“Why does he want to hurt me so much? I don’t understand why he’d pick this place for our wedding. This is the place he left me standing on my own. Is he even in there, or has this all been one big joke to him?” she blurted out, not even caring it was his father she was speaking to.</p><p>Daniel’s eyes widened in surprise, as she spoke to him but he only said he’d be back. He spoke softly to the driver and then patted her hand and walked back into the church. The carriage was suddenly moving once again and Jasmine was surprised but very happy as he pulled around a corner. He didn’t move far but at least she wasn’t in view of the one place holding so much heartbreak.</p><p>She was trying to decide whether or not she should walk away in her huge dress or just sit there until the driver decided they could leave. Then, the door opened again and Derek slid in beside her. He looked at her face in confusion as her tears silently fell.</p> <p>“My father said I needed to talk to you, so here I am. We have a deal Jasmine and I hope you’re smart enough to remember that. I’ve done everything possible to make this the wedding you wanted,” he told her, in an almost cynical voice.</p><p>“Why would you choose this spot?” she questioned him, as some fresh tears escaped. He stared at her another moment before he spoke.</p><p>“I thought this place was very fitting, after all it’s the spot you sent your father to buy me out of your life. I thought it was ironic to marry in the place where you let me know I wasn’t good enough for you,” he almost spat.</p><p>It was now Jasmine’s turn to stare open mouthed at him. She didn’t know what he was talking about. He was the one who had left her, not the other way around. Her tears dried up in her confusion and she barely noticed when he grabbed the napkin and cleaned her face up.</p><p>“You left me, not the other way around,” she barely whispered to him. “Why would you say my father paid you off? Why are you saying any of this? I don’t understand,” she cried. Being in this spot was making it all new and fresh. The pain from that day still haunted her, especially when she looked into her son’s face.</p><p>They both looked into one another’s eyes as they tried to figure out what the other was talking about.</p> <p>“Why don’t you tell me about that day?” he finally asked her. He was starting to have a really bad feeling in his gut.</p><p>“Why would you want me to humiliate myself still?” she questioned him. She couldn’t believe he was so horrible that he’d get enjoyment out of her pain.</p><p>“Please just tell me everything that happened after we said goodbye that night?” he asked her and the change in his tone alerted her that something was wrong. He didn’t sound condemning or accusatory. He sounded as if he really wanted to know what she’d done, so she began to relive the worst day of her life.</p><p>She told him how she had gone home and told her dad everything and that he’d been supportive. She told him how she’d gone to the church and waited until the sun sunk from the sky. She explained she’d never been more devastated in her life and when she found out a while later she carried his child the pain had been two-fold. It was horrible. She was crying once more by the end of her talking.</p><p>Derek said nothing, as she told him the truth of that morning. He had no doubts what she said was true. He now understood it had been her father all along and the man had succeeded at breaking them up. Her father was truly a horrible man, because he must’ve known the child she carried was his and yet he still hadn’t tried to fix things. The man deserved everything that had happened to him in the last couple of months and so much more.</p><p>Derek finally took her chin in his hands and lifted her sad eyes up to meet his. She looked so heartbroken and it killed him to know he was responsible for her pain. She hadn’t left him, he realized and his heart was bursting with joy. He loved her even more than he did when they were still young and naive.</p><p>He loved the woman she was, both now and then and he couldn’t believe they’d wasted so much time and he’d purposely tried to hurt her. He felt at an all-time low and vowed to make it up to her the rest of their lives.</p><p>He said nothing as he continued to gaze down into her beautiful, sad eyes. He slowly lowered his head and captured her lips with his. The kiss was gentle and filled with the love that was overflowing from him. He kissed her for several minutes, before trailing his lips across her cheeks, to kiss away the tears and then he lowered his head to gently nip the smooth silk of her throat.</p> <p>She was no longer crying, as he continued to gently kiss her all over her mouth, face and neck. He didn’t pull her close against him, as he didn’t want to hurt her beautiful gown but his gentle touch showed her so much love it was indescribable.</p><p>He reluctantly pulled away from her and once again looked into her eyes. “Jasmine, I have so much to apologize for, so very much,” he started. “I was there at the church that morning. I was there early because I couldn’t wait to run away with you,” he said and her eyes were rounding in confusion.</p><p>“Your father showed up. He told me you didn’t want to be with me any longer and he offered me a lot of money to start my new life. I actually believed the man. I was so angry with him and extremely angry with you. I thought you’d flung me aside, like a piece of trash and I vowed to have my revenge from that point on,” he said, with regret in his voice. He didn’t give her a chance to speak as he continued.</p><p>“I was hurting so bad and that thought of revenge was what motivated me but when I saw you again, I realized I still loved you. I lied to even myself and said I just wanted to take you to bed and then leave you, like you’d left me but that wasn’t true either. That first time we were together again, after so many years, knocked me off my feet. Every time I touch you, it’s never enough. It’s so much more than sex. It’s because I love you even more today than I did ten years ago. Please tell me you’ll forgive me and this wedding can be a real marriage,” he pled with her.</p><p>Jasmine listened to him, with hope starting to fill her heart. By the time he was finished speaking, her chest was so full she didn’t understand how her heart wasn’t beating right through. She was saddened to realize all the years they’d wasted but she realized none of that mattered anymore because he loved her and she truly loved him and they could be a real family.</p><p>“I’m so sorry Derek. I really thought you had just walked away from me all those years ago. I never once suspected my father but I should’ve. He’s not a good man and over the last few months I have really come to realize that. I’m sorry he cost you half of our child’s life. I should have tried harder to find you,” she said.</p><p>He brought his lips back down to hers and kissed her with so much hunger and love, that she was tempted to skip out on the wedding and tell the driver to take them back home. As if he could read her thoughts he quickly pulled back and still not trusting himself jumped out of the carriage.</p><p>“You’re far too tempting, woman. We have a wedding to get to,” he said, with a brilliant smile. He spoke to the driver and then jogged back towards the church. This time when the carriage pulled up in front of the carpet, she was more than ready to step from its doors. The doorman looked more than relieved when she took his hand and stepped down on the carpet.</p><p>The driver must not have been taking any chances, because as soon as she was clear of the carriage, he drove away to go park. She giggled a bit at the speed in which he left.</p><p>She stood on the wide carpet and could feel her nerves overtaking her. She didn’t have any bridesmaids, nor someone to walk her down the aisle and she suddenly felt so lonely. She could now understand why the bride always walked down on her father’s arm. It was so she wouldn’t fall over, or run the other way. The thought of that long walk was intimidating when you were all on your own.</p><p>She saw the doors open, just as the attendants got her dress all situated. Daniel was once again walking down the steps and coming towards her. “I’m coming this time, I promise,” she told him, with her first real smile of the day. He leaned down and kissed her on the cheek. She was filled with warmth from the easy acceptance of this wonderful man.</p><p>“I don’t have any fears of you running away, Beautiful,” he started. “I wanted to offer my services to you. I know your own father couldn’t be here today so I thought you might like an arm to lean on,” he said to her.</p><p>Jasmine was so filled with love for this amazing man. He knew her father wasn’t there because he didn’t want to be there, not because he couldn’t be but he made sure to word his sentence in a way that wouldn’t hurt her. He was also standing in to be the kind of dad her own should have been. Her eyes once again filled up, causing the attendants around her to groan.</p><p>“Now don’t start crying again young lady, or we’ll never get you to that alter,” he said, with a gentle laugh and suspiciously bright eyes himself.</p><p>“It would be my honor to have you walk me down the aisle,” she finally managed to get past the lump in her throat.</p><p>Their arms intertwined and slowly they made their way to the front of the church. The double doors were opened and Jasmine was left speechless by what she saw inside. There were thousands of twinkling lights strung throughout and the scent of roses wafted in the air from the hundreds of arrangements placed everywhere.</p><p>The small church was packed from front to back, with guests who were all standing and turned towards her. She had to fight the tears to not fall once again. She looked down the aisle, strewn with rose petals, to Derek who looked so handsome standing at the front and Jacob by his side. Drew and Ryan were standing in the spot where bridesmaids would normally be so that her side didn’t look so empty. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The men were a stunning sight, all dressed in old fashioned tuxedo’s with tails and white shirts. They were all truly breathtaking. Jacob was smiling at her as she slowly made her way down the aisle and he looked like it was taking everything in him not to run up and hug her. She felt the same way.</p><p>When her eyes connected once again with Derek, the rest of the world seemed to fade away and she could look nowhere else. The man was beautiful and she couldn’t believe he was all hers. She picked up her pace, without even realizing what she was doing, until she heard a chuckle from Daniel.</p><p>They reached the pulpit and then Daniel reached down and gently kissed her on the cheek, before taking his place next to her son. The wedding party was complete, with all these stunning men surrounding her. She really did feel like a princess, in her fluffy white dress, in the middle of the masculine men but especially with Derek at her side.</p><p>She repeated the vows, while continuing to stare into Derek’s eyes and the whole thing passed in a blur. After the wedding, he took her around the back of the church, where huge tents were set up, with caterers running around, poring champagne and serving appetizers.</p> <p>They did all the traditional things such as cutting the cake and having their first dance. He slowly pulled her into his arms, her heart bursting in pure happiness. He was looking at her as if she was a buried treasure he’d just discovered and the lump in her throat wouldn’t go away.</p><p>“Thank you for taking such great care of my son. I’m sorry you had to do it alone all those years. I’m sorry you thought I walked away from you. I’m a real fool to think anything could’ve made you do that. You’re the purest person I’ve ever known and I promise you I will spend the rest of my life proving how special you are to me,” he said as he spun her around.</p><p>The rest of the people disappeared as they shared the intimate dance together. She felt like she was floating on a cloud. She hoped they’d remain in the stars for the rest of their lives. She loved Derek so much it seemed impossible. How could she have gotten so lucky to have all her dreams come true?</p><p>“I missed you every day. When I looked at our son I was filled with a mixture of joy and sadness. The older he got the more I missed you. The earlier days were the hardest because I wanted to share all those moments with you. I’ve never felt such pain as when I thought I’d never be in your arms again. I was never able to hate you,” she said with her eyes filled with emotion.</p><p>“We won’t even talk about the negatives anymore. From this time forward we’ll only focus on our future. If you can forgive a fool, I promise to love you the rest of our lives,” he said. She wrapped her arms more tightly around his neck, loving she’d never have to withhold her feelings from him again.</p> <p>Drew stood up and the room silenced. There was a lot of noise from the clinking of glasses. “It’s time for the toasts,” Drew said. She was struck again at how lucky she was.</p><p>“Derek and I are closer than even siblings could ever possibly be. He and Ryan are about the only two beings on this planet I’d take a bullet for until today. I have known Jasmine since she was just a tiny little tot in grade school and her beauty has only ever been outshone by her truly kind heart. It’s such a great privilege to have her as a part of my family, starting today. I’m so glad to have her and Jacob as additions and I’d take a bullet for them as well,” he said. “To a lifetime of happiness and many more babies to come, congratulations Derek and Jasmine,” he said, to the thundering applause of the crowd.</p><p>Jasmine managed to break away from Derek, to throw her arms around Drew and thank him for his kind words. She then engulfed Ryan and told him how much she loved him as well. The night continued on, with much laughter, dancing and kissing and by the time it was over, Jasmine was a little sad for it to end.</p><p>Daniel had insisted on keeping Jacob for a few days, so they could have a proper honeymoon and she knew Jacob would be spoiled rotten by his grandfather. He’d been leery at first since his only other example of a grandparent hadn’t been a good one but they were incredibly close now, in such a short amount of time.</p><p>As Derek and Jasmine ran through the birdseed, out to the awaiting carriage, she knew her life couldn’t have gotten any better than at that moment in time. She was wrong though, because as Derek took her to his bed as his wife, she realized passion and love together made everything better and better with each new day.</p><p>Epilogue</p> <p>Jasmine was in her second favorite spot in the house, cooking a huge meal. She was so happy with her life and couldn’t believe how well things had turned out. They’d spent their honeymoon at home, since neither of them had any desire to go anywhere without Jacob. They had plenty of time to take romantic vacations together.</p><p>Derek vowed to take her and Jacob to every one of Drew’s magical resorts and they were off on their first adventure to one of them soon.</p><p>On that first night they were together he’d taken the prenuptial agreement and burnt it in the fireplace. His trust in her was overwhelming and she knew nothing would ever keep them apart. They really were going to be a family together and she did get her fairytale.</p><p>His family was coming over that night to celebrate Jacob’s tenth birthday and she was on cloud nine. She turned too quickly and her protruding stomach bumped into the island. The baby kicked inside of her as if to say, hey watch it mom. She laughed out loud, as she rubbed the spot.</p><p>“What are you laughing about in here on your own,” Derek said, as he came up behind her and placed his arms around her rapidly expanding middle.</p><p>“I bumped into the island and your son or daughter decided to kick back. I don’t think he appreciated it,” she said, with another giggled. Derek immediately dropped to his knees and lifted her shirt over her stomach to check the entire area.</p><p>“Are you okay? I think we should go into the hospital just to make sure,” he demanded, as he rose to his feet. He was about to pick her up and head towards the car.</p><p>“Derek I’m fine, it was just a little bump. I need to get used to this big belly,” she said, enjoying her overprotective husband.</p> <p>“I’m just saying it’s better safe than sorry,” he mumbled and she could tell he was thinking about physically making her go in. She laughed some more and then pulled him close for a kiss. She knew how to distract the man. She rubbed up as close as her belly would allow and soon they were both groaning with pleasure, as his hands rubbed down her body, to grip her behind in his hands.</p><p>“Okay, you two are disgustingly happy together and it makes the rest of us sick, so can you please, for two minutes, manage to tear yourselves apart from each other,” Drew said, as he walked into the room.</p><p>Derek turned to glare at his cousin, not liking him much at that moment. Jasmine let him go, which furthered his dislike. She walked over to Drew and pulled his head down close, so she could kiss his cheek.</p><p>“You know you’re all talk. You’re going to fall head over heels in love soon and then I’ll get to pick on you. I love you to pieces Drew Titan and the lucky woman who gets to spend her life with you will be incredibly special,” she said. Drew’s face turned red, as he pulled Jasmine into a big hug.</p><p>“Okay, find your own woman and leave mine alone,” Derek told his cousin, before dragging him out of the room.</p><p>Jasmine watched them leave, her heart swollen with love. She had finally spoken to her father and it hadn’t gone well. He was a sad man and was running away from his problems. She was sad he’d rather she wasn’t in his life but she had a new family and they were the type of people you were proud to call your own.</p><p>“Something smells good in here but make sure you don’t overdo it,” Ryan said, as he came into the kitchen.</p><p>“You boys worry far too much, you know,” she said, as she gave him a hug. “The boys are all out at the pool,” she finished.</p><p>“Why don’t you take a break and join us, so we at least have a great view,” he asked her, with a wiggle of his brows.</p><p>“I think I’ll do that. My feet can use a break,” she told him and then threaded her arm through his and walked out back.</p><p>“What’s up with you lousy guys pawing all over my wife?” Derek asked, as they stepped out the door.</p><p>“When your wife is so extremely hot, it’s too difficult to keep your hands off her,” Ryan said, as he bent to kiss her cheek. She smacked him and then settled down into one of the comfortable lounge chairs.</p><p>Derek immediately headed over towards her and pulling up a chair and lifting her feet onto his lap. He immediately started rubbing them. She moaned in pleasure, as he inserted just the right amount of pressure.</p><p>“You can stop in about ten years,” she said, on a moan of pleasure. He leaned over and kissed her gently, before continuing. The family all came and surrounded them and as she looked around, she knew her life was so much better than it had ever been. The baby kicked her gently in the ribs and she smiled. “Don’t worry, I know you’re there,” she whispered and then she counted her blessings, as she knew she’d do the rest of her life. </p> </body></html>"]