["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>Lila</p><p>There are four things I’ve learned about the outdoors over the last month since Ethan and I first began our cross-country road trip: (1) It always feels cold living outdoors, even when it’s July and we’re in Virginia; (2) the mountains seem to breed pine needles and dirt; (3) the camping food (heavy sigh)... I’m not even sure what to say about it. Pop-Tarts and fruit snacks that don’t even taste like fruit. Beans in a can—gross. And s’mores; they’re nothing but burnt marshmallows, crackers, and messy chocolate that makes me wish I was eating the delicious s’mores cake made by Delina’s Bakery and Simple Cakes that was on the corner of the street I grew up on. The chocolate there was divine.</p><p>There is one thing, though, that I can certainly admit is a plus about being outdoors—and it’s the fourth thing I’ve learned during this trip and the one thing that I’ll miss when we head back to Vegas tomorrow—the beauty of the night sky. Nothing I’ve ever seen before can compare to it. It’s so open and full of stars and the moon is so bluntly bright, way more than in the city, since there’s no city lights to outshine it. It’s simplistically beautiful. Plus Ethan loves looking at the stars and being with him while he lies on the ground and stares up at them makes me love the sight even more... Okay, so maybe I’ve learned five things and have one more thing that I’ll miss: (5) Being with Ethan all the time—as long as Ethan’s with me, I’m fine with being cold, getting covered in pine needles, and eating beans straight from a can. I could do all those things with him forever.</p> <p>I just wish I knew that he felt the same way. But I don’t know what he thinks about our future because he doesn’t like talking about it and it makes me sad and bummed out whenever I think about the unknown that lies before me. About him and I and where we’ll end up.</p><p>“What are you thinking about?” Ethan asks as he holds a stick with a marshmallow attached to the end of it, heating it just above the fire. It’s his third one and it seems like he’s never going to stop, like he’s never going to get enough of getting his fingers sticky.</p><p>“How gross melted marshmallows are,” I tell him the partial truth, relaxing back on my hands. I’m sitting on a log and my hair hasn’t been washed in days. There’s a tent behind me, a cooler to the side of me, and campfire in front of me, blowing smoke in my face. And when I rub my thumb across my forearm, a layer of black comes off. Not one of my finest moments, but with the way Ethan’s looking at me—with want and love in his eyes—it makes me feel very attractive, even in a hoodie and dirt-stained jeans.</p><p>Ethan cocks a dark eyebrow at me, his black hair falling into his eyes as he leans down to pick up a piece of wood by his feet and toss it into the fire. “Only you would be thinking that,” he says over the crackle of the flames as he stretches his legs out and relaxes back against the cooler. He continues to roast the marshmallow in the fire, the outer part turning black and smoking. I don’t say anything about him burning it, because I know that’s how he likes them. Instead I just watch him, feeling myself warm inside like the melted goo on the end of his stick as he chews on his lip and observes the flames.</p><p>He’s so sexy, even when he hasn’t showered in days. The unshaven face, torn jeans, and wrinkled black T-shirt work so well on him. Plus his tattoos... God he’s so gorgeous, all grungy and manly. I could practically have an orgasm just looking at him.</p> <p>Suddenly he smirks at me, totally busting me for checking him out, and I blink my gaze off him and focus back on the conversation.</p><p>“What do you mean only I would think that?” I ask, tucking a strand of my chin-length blond and black hair behind my ear. “Lots of people don’t like melted marshmallows.”</p><p>“Not true. A lot of people like them,” he says, rotating the stick in his hand. “You just have weird taste in food.” A teasing look rises on his face as he grins. “Or maybe I should just say bad taste in food.”</p><p>Scowling, I reach over to the bag of marshmallows between us, pick one up, and throw it at him. It’s dark enough that he has a hard time seeing me and it ends up pegging him in the forehead. I laugh as I dust the dirt off my hands and sit up straight, feeling a little bit better.</p><p>“You’re going to pay for that one,” Ethan warns, and through the glow of the fire, his eyes look as black as the smoldering wood. He removes the stick from the flames as he gets to his feet. After blowing on it a few times, he carefully plucks the marshmallow from the end of the stick and mushes it between his fingers. At first I think he’s going to eat it, but instead he winds around the fire pit between us, heading toward me.</p><p>“Don’t even think about it.” I start to get to my feet but by the time I stand up, he’s within arm’s reach. I stumble back, shaking my head. “Don’t,” I plead as he stretches his hand out toward me, the gooey marshmallow all over his fingers inching closer to my face. “Please, I don’t want to get sticky.”</p> <p>“I think you need to get sticky.” He takes another step toward me and I match his movement, stepping back, my heels bumping against a log on the ground.</p><p>“Ethan, I swear to God, please don’t,” I plead with my hands out in front of me. “They taste so gross and my mouth will feel gross for the rest of the night.”</p><p>He sighs, lowering his hand to his side. “I won’t just as long as you tell me what you were really thinking about earlier,” he says. I open my mouth to lie to him again, but he holds up his hand. “And don’t tell me marshmallows, because I know that’s not true. You had that look on your face, the one you get when you’re thinking about something that upsets you.”</p><p>I frown at the fact that he can read me that well and I don’t want to tell him what I was thinking about. How I’m worried about our future because I have no idea what’s going to happen today, tomorrow, whether we’ll be together or whether he even wants to be with me in the future since he refuses to talk about it. I know he loves me and sometimes I think he can’t even help it. Ethan’s never been one for planning much of anything and I think talking about our future means he’d be planning for the future. I also think he might be scared of what we might become if we did commit—what would happen to our relationship.</p><p>“You’ve been so mopey ever since Chicago,” he adds through my silence.</p><p>My frown deepens. He’s right. I have been really mopey ever since we visited Ella and Micha in Chicago. Micha had been there for a few days playing at a concert. Seeing Ella and Micha again made me start really wondering about my future with Ethan.</p><p>It was Ella and Micha’s six-month anniversary as husband and wife and they seemed so happy. It makes me sad, because even though I’m happy with my relationship with Ethan, I want to be his forever, and Ethan has already made it pretty clear how he feels about weddings and marriage and all that “ridiculous nonsense” (his words not mine).</p><p>It’s not like I want to get married today or even in a year because I don’t. I’m not ready for that yet, but I want to know that five or ten years down the road we could be standing up in front of a minister, saying our “I dos.” That we could end up having what Ella and Micha have.</p> <p>“Just tell me what’s bothering you,” he interrupts my thoughts with a fake sexy pout. “Or else I’m going to have to stuff this marshmallow in your mouth and then you’re going to be grumpy because you’ll be all sticky.”</p><p>I narrow my eyes with my hands on my hips. “You wouldn’t dare.”</p><p>“You don’t think so?” he questions, elevating his eyebrows.</p><p>I sigh, knowing he would do it in a heartbeat and laugh at me. But it’s part of why I love him, because in the end I’d laugh too. “Fine,” I say, searching for a way around this without telling the truth to avoid him getting uncomfortable and weird like he always does whenever anyone starts talking about life and the future. “I’m mopey because we’ve been in the mountains for too long and I need a shower.”</p><p>He studies me intently with his head cocked to the side. I think he’s buying it until suddenly his tattooed arm springs forward and he stuffs melted marshmallow into my mouth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Dammit, Ethan!” I shout, my voice muffled by the goo. I lick my lips and wipe them with the back of my hand, trying to get rid of the stickiness while Ethan grins at me, completely proud of himself.</p><p>“That’s a good look for you,” he says, brushing his fingers along my bottom lip and wiping off some of the goo. He licks his fingers and I pull a face because I really do hate melted marshmallows. “Tastes good too,” he mutters, his humor shifting to desire as he eyes my lips. Then suddenly he’s cupping the back of my head and drawing me in for a kiss. The moment his lips crash into mine, I forget what we were talking about or even that we’re in the mountains. I just kiss him back, willingly parting my lips to let his wet tongue slide into my sticky mouth.</p><p>“Really good,” he whispers against my mouth, and then kisses me again, his fingers threading through my hair and pulling gently at the roots, making my skin tingle.</p><p>My fingers wander up his back, my hands trembling with the abundance of emotions I feel for him. Want. Desire. Need. It’s so terrifying. Knowing how bad I want this. Want him. And that one day maybe it could be all gone.</p> <p>In almost a desperate move, I pull him closer to me, clinging on to him, the heat of his body warming up the chilly breeze of the mountains. It also warms up my heart, makes me feel the slightest bit better and content, and reminds me that despite the fact that I might never get married—that I have no idea where we’re headed—having moments like these with Ethan is completely and utterly worth drifting into the unknown.</p><p>I just wish it could be different.</p><p>Ethan</p><p>We’ve been on the road for almost a month now, living off of the money we saved up after five months of working—me in construction and working part-time as a bartender, and Lila waitressing and working at a clothing store on the weekends. We were supposed to go earlier but it took longer to save up than I’d planned. But we busted our asses off, saving everything we could so we could live on the road for a month straight. It’s been amazing—every day is with Lila. The only thing that sucks is that we’re heading back to Vegas tomorrow, back to life and the real world, popping the secluded, quiet bubble we’ve built around us during our road trip.</p><p>Still, I’m trying to make the best of our last night here, especially because she seems sort of down and I hate seeing her down. It worries me a little, since in the past she used pills as a way not to feel her sadness. She was addicted to them for a very long time and I was the one who helped her with the addiction, watched her struggle with it, but conquer it. She’s had such a hard life and I want her to be happy all the time, even though that’s impossible... I wish I could find a way to make it possible.</p> <p>After I push the marshmallow into Lila’s mouth, I feel her mood lighten, which was what I was trying to accomplish. But my playfulness quickly turns to desire as she tries to lick the goo off her lips. I want to taste it—taste her—so I kiss her fiercely while I start to back us toward the tent. My hands travel up the back of her shirt and I savor the softness of her skin as I try to find the zipper to the door of the tent with my other hand. I manage to get the tent unzipped without disconnecting our lips; then I guide her inside and down onto her back onto the sleeping bags before covering her body with mine. I kiss her until she becomes breathless, until she’s clutching my arms so tightly her fingernails are scraping my skin and she begs me to be inside her.</p><p>I nearly lose it right there. She’s too beautiful for her own good and it makes lasting long nearly impossible. “Fuck, Lila, you’re going to make this end quickly if you keep saying stuff like that,” I say, pulling away to remove her jacket. She eagerly helps me, slipping her arms out of the sleeves. Then I tug her shirt off and unhook her bra, laughing when she gets the strap tangled up and stuck on her arm. Finally after a lot of laughing, I get it off and toss it aside, then lower my lips back to hers and slip my tongue deep inside her mouth, which tastes like marshmallow.</p><p>“Ethan...” She groans, lacing her fingers through my hair as she curves her back, pressing her chest against mine.</p><p>I grip her hip with one hand, pulling her closer to me until there’s no room left between us. Then my fingers slide up her side as I devour the taste of her. When I reach her breast, I graze my finger across her nipple and she gasps in response, her legs fastening around me. Our tongues tangle and our breaths mix as she grinds her hips against mine and rubs up against me. I move with her, listening to her moan and gasp and plead until I can’t take it anymore. I lean back and yank my shirt off, throwing it to the side of the tent. Then I undo the button on her jeans and she impatiently helps me as I slip them down her legs. When I get to her ankles, she kicks off the jeans and strips off her panties. Then she reaches to pull me to her, but I shake my head and hold on to her ankle.</p><p>“What’s wrong?” she says, practically panting.</p><p>I don’t respond as I kiss a path up the inside of her leg all the way to her thigh, breathing her in with each touch of my mouth. I pause at the top, looking down at her as she stares up at me, her eyes wide and full of want. It’s dark, but the glow of the moon and the fire outside glimmers in through the screen and open door on the tent. She’s beautiful, flawless skin, full lips, wide, glittering eyes, and her breathing is ravenous, revealing how nervous she is and how much she trusts me to be with her like this, touching her in a way no one else has, because I love her.</p> <p>I trace my fingers across her collarbone and she sighs, her eyelids fluttering shut. “I want you inside me,” she whispers, her back arching against my touch. “Please, Ethan... I can’t take it anymore.”</p><p>I smile as I slowly lower my mouth to her breast. “I want to touch you everywhere... God, I want you...,” I breathe against her skin, savoring the moment before taking her nipple into my mouth. She moans, her breath hitching, and her fingers find my hair again as I suck a little bit harder.</p><p>Both of us are sweaty and gasping and finally my mouth leaves her nipple just so I can breathe. I want more, though. Need fucking more. So I make a path of kisses down her stomach, sucking on her skin. When I reach her thighs, I spread them and she grasps on to me as I dip my face between her legs and slide my tongue deep inside her. My eyes slip shut... my fingers tightening around her thighs... God, the taste of her never gets old—never will. None of this will.</p><p>I continue to taste her while her hips writhe against my mouth, until I feel like I’m going to explode; then I pull away and kiss my way up her stomach and chest to her mouth. Her lips part as I slide my tongue in for a kiss that makes both of us groan. I work to get the button of my jeans undone as she grips my arms, holding me to her, kissing me fervently. I only pull away to take my jeans and boxers off. Then I get a condom out of my wallet, put it on, and situate back between her legs.</p><p>With one hard thrust, I’m sliding deep inside her. Our lips connect somewhere in the middle and I grip her thigh, bending one of her legs up to my side as I rock into her. She rhythmically moves with me, our skin dampening with sweat, until we become lost in each other over and over again. Eventually we cry out together as I give one final thrust inside her, then we lose ourselves completely.</p><p>Afterward, I lie still inside her with my head on her chest, feeling her pulse race as she rests against the sleeping bags, running her fingers through my hair. “You have the softest hair,” she whispers with an exhausted sigh.</p><p>I push up from her and look her in the eyes. “Is that supposed to be a compliment? Because I’m not sure if a guy’s hair should be soft,” I tease.</p><p>She continues to rub her fingers through my hair. “Yeah, it should be. And yours is the softest.”</p> <p>I chuckle under my breath and then return my head back onto her chest. It gets really quiet as she continues to run her fingers through my hair. I listen to the fire crackling outside, the sound of an owl in the distance, and the river flowing through the trees.</p><p>“God, it sucks that we have to head home tomorrow,” I say, letting out a loud breath.</p><p>“I know you’re sad,” she says. “And I’m sort of sad that we won’t be spending as much time together, but at the same time I’m really, really excited about taking a real shower.”</p><p>I smile, shaking my head. “Not me. If I could, I’d keep doing this forever.” I yawn, feeling exhaustion take me over. “Although, I’ll admit. I do sort of get sick of driving. I’d love to take a break from that.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You will,” she says. “As soon as we get home, we can go on a driving strike.”</p><p>“Yeah, that sounds nice, but it’ll have to be after I go back home for my mom’s birthday in August.”</p><p>Her hand stops moving through my hair. “You’re going back to Star Grove in August?”</p><p>I glance up at her. “Yeah... didn’t I tell you?”</p> <p>I can’t read her expression, but she seems tense. “No, you never mentioned it.”</p><p>Shit. I think I might’ve messed up on that one. “I’m sorry,” I say. “I thought I told you about it a while ago.”</p><p>She shakes her head, not looking at me but up at the tent roof. “Well, you didn’t.” She pauses, and I can feel that she’s struggling to breathe. “So you’re going in August?”</p><p>“Yeah...” I’m not sure what to do to make her feel better. I didn’t mean to not tell her. Sometimes I just sort of fuck up, forgetting that I can’t just do things based upon what I want—that I’m in a relationship now. “I’m only going to be gone for a few days. I promise.”</p><p>“Okay.” It’s all she says, which makes the situation way worse, because she’s obviously bothered by this. But I wonder if it’s just because I didn’t tell her about it or because I’m going alone. Or maybe it’s something else entirely—she’s been upset a lot lately. “Lila, I can tell something’s bugging you, so will you please just talk to me?” I skim my finger across her cheekbone, causing her to shudder. “You seem upset and if you’d just tell me why, maybe I could help.”</p> <p>“I’m fine... I promise.” She closes her eyes and inhales deeply and I think she’s on the verge of crying.</p><p>“I wish you’d just talk to me more about stuff,” I say quietly, not just hoping she’ll tell me what’s bothering her now but hoping she’ll finally break and spill what’s been putting her in a downer mood for the last couple of weeks as well. “You usually do.”</p><p>But she stays silent and I let her play with my hair for a few more moments before I carefully slip out of her and roll onto my back. She follows me, hitching her leg over my stomach; then she traces a circular pattern across my sweaty chest.</p><p>“I’m sorry I’ve been so cranky,” she whispers in a choked voice. “My head’s just been in a really weird place. And I don’t care if you go see your mom on her birthday—you should.”</p><p>“It’s okay to be cranky sometimes,” I reply, wrapping my arm around her and pulling her closer to me. “But you should really just talk to me and let me help make you feel better. No matter what’s bugging you, I’m here for you.”</p><p>She shakes her head and nuzzles her face against my chest. “I don’t want to talk about it tonight, but maybe tomorrow.” She sounds so sad and it hurts, not knowing what’s causing it. If it’s something because of me.</p> <p>Whatever’s bothering her—and has been bothering her—she doesn’t want to tell me, and even though Lila has opened up to me about a lot of things, I still know from past experience that she can keep a secret like no one else. All those years of popping pills and no one ever knew.</p><p>Minutes later she falls asleep in my arms and I stroke my finger up and down her back, listening to the quiet around us that only being in the mountains can bring, attempting to sort through my thoughts.</p><p>She’s been really up and down since Chicago, ever since we went to visit Ella and Micha a couple of weeks ago. I’m not exactly sure why, but I think it might have to do with the fact that she wants to get married, something that was brought up during Ella and Micha’s wedding last Christmas. Yeah, I knew Lila had certain things she wanted out of life, but I hadn’t really thought she’d need to say “I do” one day, until she started rambling about it while she was helping Ella plan things for the wedding. For a week straight, it’s all I heard about—that and babies, since Ella’s sister-in-law was pregnant. I tried to shrug and nod whenever she brought it up, and it seemed to be working for me, until she flat out asked me for a response.</p><p>“Where do you see us in five years?” she’d asked while we were tying bows at Micha’s mom’s kitchen table.</p><p>I’d glanced up from the bow I was tying, a little startled by her question. “Huh?”</p><p>Lila peered up at me with her beautiful blue eyes. “You and I as a couple. Do you think we’ll still be together in five years?”</p><p>“I’m not sure...” I’d squirmed uncomfortably in the chair. “I mean, we’ve only been dating for like a month.”</p><p>“Dating, yeah,” she said. “But we’ve been friends for longer and Ella and Micha were friends first, which makes the fact that they’re getting married so young understandable, at least from my point of view.”</p> <p>I finished tying the bow before I spoke again, deciding just to be honest with her. “Honestly, Lila, I don’t think I can ever see myself getting married... if that’s what you’re getting at.” I wasn’t sure it was. She was utterly confusing me.</p><p>She shrugged, reaching for a roll of ribbon. “I wasn’t getting at anything. Just wondering, since you seem so against marriage.” She swallowed hard, looking upset. “Glad to know where you stand.”</p><p>I sighed as she pushed her chair away from the table and got to her feet. “Lila, I—”</p><p>She’d held up her hand, silencing me. “I wasn’t expecting a proposal anytime in the near future, but the fact that you can never see yourself getting married sucks.” Then she’d left the room and I felt like the biggest asshole.</p><p>Still do.</p><p>But I can’t help how I feel. Or how I think I feel. I’m honestly unsure of what I want or how I can figure it out, since I hate figuring heavy stuff out. I don’t like complications and weddings and marriage, and forevers are more than complicated, at least from what I’ve seen. My parents’ marriage was full of fighting and abuse and that’s the last thing I want. Plus, making things really complicated means there’s a chance they could fall apart and then I’d be left dealing with the outcome. I had a girlfriend, London, who I thought I loved—although now that I’m in love with Lila, I’m not so sure I was really in love with London—and then she fell out a window and got amnesia and everything I had with her was lost. It was really hard to get over. If something like that happened with Lila and me... if I lost her in any way... I’m not sure I could ever get over it.</p><p>There are so many reasons why marriage and a future scare the shit out of me and I don’t think can’t picture myself doing it. I really can’t.</p><p>Lila eventually let the marriage thing go, obviously, since she’s here with me seven months later, but I can tell whenever the future comes up that she’s waiting for me to tell her what I want, but I still don’t have an answer to give her. I want her. That much I know. She’s amazing and smart and brave. She’s more beautiful than she realizes and even though I hate to admit it, I love giving in to her and letting her have her way... most of the time anyway.</p><p>But I’ve planned on living my life carefree and doing whatever I want, whenever I feel like it, like I am now without worrying about other stuff. And if five years down the road, I want to get up one day and take off in my truck and just drive off into the unknown by myself, I still want to be able to do it without hurting anyone or worrying about what will happen to those around me—worrying about life. That I might be breaking someone. Or that I won’t be able to because of my own feelings and attachments to certain things. But if I’m married, then that means I’ll have a wife to think about, a steady job, a house, and one day maybe even kids. God... I’m not sure how I feel about that.</p><p>The only thing I am sure about is that I never, ever want to lose Lila. She’s the only girl who’s ever made me feel like a relationship is worth the risk. And she’s not even just my girlfriend. She’s my best friend. The only person I’ve ever felt comfortable enough with to talk openly to. I tell her as much personal stuff as I tell my journal. But if we don’t want the same things, I’m not sure how long I’ll be able to hold on to her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 2</p><p>Lila</p><p>It’s our last day here—on the road together—and I’m both sad for it to end and kind of glad to be going back so I can take a real shower and eat food that doesn’t come in a can. I’m trying to keep as upbeat as I can even after my little meltdown last night. I didn’t really mean to almost cry last night in the tent, but then he started talking about how he was going up to Star Grove for his mom’s birthday. He never told me he was, which stung a little. But the worst part is that he didn’t even invite me to go with him. I don’t think he’s doing it on purpose. I just think that he’s not really thinking about the future as an us yet. It painfully reminded me even more that I have no idea where we’re going to end up—if I’ll ever visit his parents’ with him. And what added more heartache to the situation was having him near me, touching me like he does. It sets off how much I want things to always be this way.</p><p>Forever and always. Just him and I.</p> <p>I just wish he felt the same way, but I’m starting to wonder more and more if he doesn’t.</p><p>Still, I pull myself together and manage to make it through breakfast smiling. The only time I let my mood drop is when it’s time to get cleaned up, but that’s for an entirely different reason. No matter what section of the country we’re in, all places share one thing in common. The streams and ponds are freezing. Taking a bath outside and actually staying in long enough to get clean is a challenge. It takes a lot of mental preparation. As I strip off my clothing and stare at the translucent water rolling over the rocks in front of me, I shiver, even though the sun is beating down my bare body.</p><p>It’s an amazing sight, really. The small pond is tucked between rocks and trees, the water a clear blue, and there’s this little waterfall toward the back. But I know from experience that the beauty of it is going to be lost the moment I step in and I start to freeze.</p><p>“You know, you were sexy as hell before,” Ethan says from behind me. “But that tattoo makes you look so goddamn gorgeous.”</p><p>I smile to myself, remembering how I’d finally decided to get a tattoo right before we left for this road trip. It took me a while to figure out what I wanted, but then decided on a sparrow when I found out it meant freedom. It seems fitting since I’ve never felt freer in my life. Per Ethan’s suggestion, I got it right between my shoulder blades. It hurt, but it was totally worth it because with each prick of the needle, I felt freer and freer from my dark past and my parents’ control.</p> <p>I am free now.</p><p>“You know, if you want, you can just stand there all day,” Ethan adds, and I can hear the soft sound of his footsteps inching closer to me. “You make the view a hell of a lot better.”</p><p>I look over my shoulder at him, giving him a dark, playful look. “What if some hikers came up here and saw me naked? Would you still want me to stand here naked?”</p><p>He’s standing not too far off behind me near the tree line, wearing a dark green shirt with a faded logo, cargo shorts, and boots that are untied. He’s also got his journal in his hands. “That depends,” he says, taking a step forward, his intent gaze making me feel like I’m sweltering.</p><p>“On what?” I’m breathless just from the way he’s looking at me.</p><p>He cocks his head to the side, a grin gradually rising on his face as he leisurely scrolls over my body. “On if the hikers are guys or women. If it’s a bunch of women, then I’d tell them to go ahead and enjoy the view.” His grin broadens as I roll my eyes.</p> <p>“You’re such a pervert,” I say, crossing my hands over my chest.</p><p>He reaches me, assessing me, and the desire in his eyes makes me shiver. “You like that I am—it totally turns you on when I say dirty things to you.”</p><p>“It does not,” I lie, biting back a smile.</p><p>He arches his brow. “If that’s not true, then why are your nipples all perky?” He reaches out and pinches one of them softly, causing me to shudder, and a small gasp escapes my lips.</p><p>“You want to get in with me?” I ask as he cups my breast and leans in to suck on my neck. Please, get in with me. Oh my God, please...</p><p>He kisses me until I become breathless and then moves back with a glazed look in his eyes. “Maybe in a bit.” He’s totally enjoying the fact that he’s making me all hot and bothered. “I’m just going to watch you while I write for a while.”</p><p>I frown, a little disappointed as I back toward the water. “You’re such a tease.”</p><p>Pleased with himself, he heads over to one of the large rocks next to the stream that pools into the pond and climbs up on it. When he gets to the top, he sits down and situates the journal on his lap. Then he takes a pen out of his pocket, bites off the cap, and presses the tip of it to the paper as he watches me with an I’m waiting for you to get into the water so I can watch you wet and naked look.</p> <p>Sighing, I approach the edge of the stream, where the water meets the dirt. Mud oozes through my toes and rocks scrape at my bare feet as I dip my toe into the water. My body instantly jolts from the chill as I take a deep breath and wade in, squealing and sucking in huge lungfuls of air. When I reach the middle, where the water goes up to my waist, I turn around and find Ethan laughing at me.</p><p>“A little cold?” he asks through his laughter.</p><p>I shake my head, then decide the best way to get even is to torture him, so even though it’s not comfortable to do in cold water, I dip my head back into the water, arch my back, and stick my chest up in the air. As the water soaks my hair, it gives me a brain freeze, like I’ve just guzzled down an ICEE, but it’s worth it when I stand back up to see Ethan looks a little flustered.</p><p>I smile to myself and then turn around and plunge under, letting the water wash over my body, so cold not a single bad thought can form in my head. Moments later, I hear a soft thud from behind me. When I turn around, Ethan has hopped off the rock and is peeling off his shirt. Without taking his shorts off, he walks into the water, wincing from the cold as it reaches his waist.</p><p>“What are you doing?” I ask as he wades toward me. “I thought you were just going to watch and write for a while.”</p><p>He doesn’t speak, just shakes his head. His eyes are locked on mine and full of desire as he moves toward me. When he reaches me, he gives no warning, crashing his lips against mine and scooping me up in his arms. The sun hits my skin as I’m picked up out of the water and my legs fasten around his waist. He holds onto me with one hand as he feels my side and skims my breast with his other hand, kissing me until I can’t breathe. I clutch him as his fingers drift from my side, to my hip, to my thigh. Then bracing me in one arm, he slips a finger deep inside me.</p><p>I gasp as I tangle my fingers through his hair and desperately try to grasp on to him. One of my legs slides back down into the water and I stand on my tiptoes, clutching onto his shoulders, with my other leg hitched around his hip. His fingers move inside me, driving me to the edge as he buries his head into the crook of my neck, his warm breath caressing my chilly skin. I groan. I plead. I beg for more and he gives it to me, slipping another finger into me, and I move my hips with his rhythm until he pushes me over the edge. I forget about everything. Nothing exists at this moment except for him and I and the connection we’ve shared since the moment we met over two years ago.</p><p>It’s perfect until he pulls his fingers out of me and leans back a little, letting my other leg slide down back into the water. Then I just feel cold again.</p><p>“I couldn’t resist,” he says, tucking a strand of my wet hair behind my ear. “You looked too tempting not to touch... God, I have such a hard time keeping my hands off you.”</p><p>“But what about you?” I say, putting my hand on his lean chest.</p><p>“You can pay me back later,” he says with a wink and a grin.</p><p>I smile and then he kisses me before backing away to the shore, his shorts soaking wet and hanging at his hips. Beads of water drip down his chest and tattooed side as he makes his way back to the rocks, smiling at me like he’s so happy. Just like I should be. And I am. But every perfect moment could be our last one together and that makes me sad.</p><p>After he climbs back up on the rocks, I start scrubbing my body down with water, while Ethan starts to write. I finish up quickly, then wade back to the shore and out of the water. The frigid air hits my body like a wall of snow and I scurry for the towel I hung up on a tree branch. I wrap it around me and wring my hair out before heading over to Ethan. He still has his shirt off, his wet shorts drying in the sunlight peeking through the tree branches above him. He’s got his head tipped down, his black hair falling into his eyes as he jots down words, losing touch with reality like he always does whenever he writes. I climb onto the rock beside him and sit down next to him, leaning over my shoulder to get a peek at what he’s writing, even though he never wants me to see. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What are you writing about today?” I ask, and he jumps, like he didn’t even realize I was up here.</p><p>He hurries to finish what he’s writing and closes the journal. “Nothing important,” he says. “I was just thinking about stuff.... About going back home... returning to the city and life...” He gazes out at the pine trees to the side of us, looking really sad and lost. “We should probably get going if we want to make it back and have a little time to relax before we go back to normal life.”</p><p>“Are you sure you want to go back?” I ask, leaning back to look him in the eyes. “You seem so sad about it.”</p><p>He shrugs and when he meets my gaze, I can see his sadness deepen. “We kind of have to, don’t we?”</p> <p>“Unless we want to lose our jobs,” I reply sadly, because even though I can’t wait to get back and take a real shower, I’ll also really miss my time alone with him. “I mean, Denny was understanding and everything, but he’s going to flip if I call him up and ask him for more time off.” I actually lucked out with Denny, my boss at this restaurant where I waitress. When I told him my plans for this road trip, he understood and said something about only being young once. He’s having his niece fill in for me while I’m gone and promised me I’d still have my job when I get back, but I doubt that’d be the case if I stayed away too much longer.</p><p>“Yeah, I’m supposed to start work on that house being built up on Maple Street in a week.” He sighs heavy heartedly. “I guess it’s time to return to the real world.” He pauses, assessing me. “Although...” He trails off, cracking the tiniest smile.</p><p>“What?” I ask as he stares at me with this strange look on his face. “Why are you looking at me like that?”</p><p>He shrugs, his smile expanding. “Because I was thinking about taking another route back home.”</p><p>“What sort of route?” I ask curiously.</p> <p>He bites on the end of his pen, studying me, his eyes following the beads of water rivering from my hair down my chest. “I was thinking maybe the beach sort of route.”</p><p>My mood perks up and it seems to boost his too. “Are you being serious? You want to stop by the beach on our way home?”</p><p>He nods, his smile breaking all the way through. “Yeah... you’ve been saying how much you hate the cold and so I figured we could head down south to South Carolina and spend a day there before we head west... maybe to the beach you said you went to as a kid.”</p><p>I attempt not to smile, but I can’t help it. “I can’t believe you remembered that.”</p><p>He sets his journal aside and scoots closer to me. “How could I not?” he asks, cupping my cheek. “It was probably the only pleasant story you’ve ever told me about your childhood.”</p><p>“That’s because I went on the vacation with my friend’s family,” I tell him. “Not my own family.”</p> <p>“I remember,” he says. “You said it was your favorite vacation ever.”</p><p>“It was... I actually felt happy for once... and content.” I pause. “Although, this one easily tops it.”</p><p>He gives me a questioning look. “I’m kind of surprised you said that.”</p><p>I’m baffled. “Why? I’ve been having fun and I thought you knew that.”</p><p>“I did know, but...” He struggles, shifting his weight, and then he places his hands on the tops of my thighs. “You’ve been so upset since Chicago... and then last night...” He waits for me to explain, but I still don’t feel like I want to tell him.</p><p>“It’s not because of the vacation,” I promise. “Although I’m not a huge fan of the mountains, I’m still having fun with you... everything is fun with you.”</p><p>“Then why does it seem like you’ve been upset lately?” he asks, searching my eyes for something. “Ever since we visited Ella and Micha. And you won’t talk about it.”</p><p>“Ethan...” I trail off, unsure. “I just don’t think I can talk to you about this.”</p> <p>“Why not?” he asks, starting to get frustrated. “Goddammit, Lila. I wish you’d just tell me because it’s driving me crazy. You tell me a lot of things and now suddenly you won’t... it makes me think it has something to do with me.”</p><p>I shake my head. “I’m sorry, but I can’t talk to you about this... I just can’t...” I’m growing worried because I can feel a fight approaching, just like the one we had back in December.</p><p>“Why not?” he asks, but there’s wariness in his voice and I wonder if he already knows what I’m thinking about.</p><p>“Because the last time I brought it up we ended up fighting,” I say quietly. “And I don’t want to fight.”</p><p>He tenses and I know he’s figured out what’s been bothering me, that it’s about marriage and our future. He lets out a slow breath and I feel like I’m going to cry because I want him to just say it. Lila, I want you for the long run. It doesn’t have to be Lila, will you marry me? I just want to know what’s ahead of us, more than just the next few days.</p><p>“What can I do to make you feel better?” he asks with sincerity.</p><p>I shake my head, sucking back the tears. “Nothing really.” And it’s the blunt truth because even if I made him say it, if he doesn’t mean it, then it’s nothing more than words. “Just let me think through my thoughts and figure stuff out... figure out what I want.”</p><p>I’m not even sure what I mean, but he looks like I’ve just told him I’m breaking up with him. Frowning, he gets to his feet and picks up his journal. I think he’s going to take off, but then he extends his hand to me and helps me to my feet.</p><p>“Let’s go pack up and hit the road; otherwise we won’t have time for the beach,” he says, avoiding eye contact with me.</p><p>I nod, a lump forming in my throat because I still have no clue where we’re headed. To the beach in a few days. Then what? Home. And what happens when we get home? We don’t talk about it, so I have no idea. No idea what he wants, if he’ll ever want what I want. If maybe we’re just wasting our time.</p><p>Ethan</p><p>Lila needs to figure stuff out. Figure out what she wants. What the fuck does that mean? I’m not even sure what the hell just happened between us. One minute I have my fingers inside her because the need to touch her was so overwhelming it was worth getting wet and cold, and then the next thing I know we’re arguing and it feels like she might be thinking about breaking up with me. Or wanting to take a break. And I don’t want a break. I just want to keep doing what we’re doing. I’m having fun and that’s all I’ve ever wanted out of life. To enjoy it.</p><p>When I was younger, and pictured my road trip, I’d always pictured doing it myself. But then Lila entered my life and things sort of shifted when I fell in love with her. It was one of the things that made me realize I was in love with her—because being alone didn’t seem as appealing as being with her.</p><p>After we pack up the truck, we head down the mountain, barely saying more than two words to each other. As I drive down the road, heading toward the town on the outskirts of the mountains, I can’t help but wonder if in the future, Lila is going to give me an ultimatum. If she’ll demand that I either marry her or she’ll leave me... Fuck, what if she just leaves and never even gives me a choice? What if one day I wake up and she’s gone? Jesus, I never thought I’d turn into this guy, the one who gets upset at the idea of his girlfriend walking out on him. But after what Lila said on the rock... the idea that she could be thinking about ending it... I’ve definitely turned into that guy and I’m about to panic. Still, the idea of fully committing is scaring the shit of me too.</p><p>“I didn’t mean for it to sound like that,” Lila suddenly blurts out from the passenger seat, finally turning her head toward me. “Back at the rock... what I said... I’m not trying to figure out what I want. I know what I want—you. And I’m sorry if I made you think I was questioning that.”</p><p>“Don’t be sorry,” I say, gripping the steering wheel as I guide my truck around the corner. “You were just being honest, right?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She shakes her head and inches across the seat toward me. “I wasn’t, though... I was just frustrated because I worry... about stuff...”</p><p>My eyebrows furrow as I downshift for a steep hill. “About what? Marriage stuff?”</p><p>She shrugs and then looks down at her hands as she picks at her fingernails. “I just don’t want to end up alone. That’s all. I mean, if I don’t have you, then all I really have is my sister, but you know how she is—she barely even has time to talk to me on the phone. And Ella’s got her own life now.”</p><p>“You won’t ever be alone,” I promise, reaching over and taking her hand. “You’ll always have me, no matter what happens.”</p> <p>She presses her lips together and it looks like she’s on the verge of crying. “I just want to make sure that I have you forever... that you and I”—she glances up at me, gesturing her hand between us—“that this will never change because I don’t want it to change. I love being with you, Ethan. Even when I’m filthy and smell like a garbage can.”</p><p>It’s midafternoon and the sunlight reflects in her blue eyes, her blond hair is pulled up in a messy bun on her head, and she’s wearing a tank top with no bra and cutoffs. Her eyes are a little wide and have the slightest bit of fear in them because she’s basically handing me her emotions to do with as I please.</p><p>She’s fucking perfect and hearing her say that she doesn’t want anything to change between us makes me want to pull the car over and fuck her again and again. Whether I’ll admit it aloud or not, I want this—her and I. I want to travel with her. Kiss her. Touch her. Whenever I want. But at the same time I’m terrified. And I hate that I’m so scared of the idea, the idea of wanting someone so much. Yet, I can’t help it. I’ve been through too much—seen too much with my parents—that I get what comes with wanting someone so much. I’d basically be opening myself up to anything, even heartbreak. And Lila too. And the last thing I ever want to do is hurt her. “I want it too,” I admit, and she releases a trapped breath in her chest. “But I’m also worried... about what we could become. I just don’t want to rush stuff, you know. I don’t want to get so caught up in doing what people think they’re supposed to do, like...” I trail off, getting a little uncomfortable. “Like getting married and settling down... I don’t want to do it too fast and ruin the perfect we have right now.”</p><p>She nods, understanding, because I’ve told her enough about my mom and dad and their shitty relationship that she gets my fear of becoming like them. “I know... I’m worried too.” She sits back in the seat and faces forward. “My parents weren’t that great and the last thing I want to do is become them.” She pauses and it makes me nervous, wondering what else she’s going to say. “However, at the same time, I look at Ella and Micha and they’re so happy.”</p><p>“I know,” I say, and then frown. “But how do we know that we’ll be happy instead of angry and sad all the time, like our parents? I just want to make sure that I—that we—don’t turn out like them. Hating each other... yelling at each other... hurting each other... I want to make sure that we’re in the right place where we both want the same things.” And I’m not sure I’m there yet.</p> <p>She swallows hard. “Well, we can’t know for sure—no one can see the future. We just have to be willing to take the risk.”</p><p>She waits for me to agree and I want to tell her right then and there that I’m ready to take that risk. That I want to be with her forever, because I know I do, but images of my mom and dad screaming at each other surface and then I picture Lila and me in the same place, yelling at each other because I want one thing and she wants something else. My lips end up staying sealed, refusing to part and just finally say what I want.</p><p>I stew in my own regrets for the rest of our journey down the mountain while Lila stares out the window, looking sadder the more time goes by. By the time we reach the small town at the foothills, it’s getting late. The sky is bright orange and pink as the sun sets behind us. The few buildings, gas stations, and houses lining the street are shadowed by the mountains and the town is pretty quiet, only a few vehicles driving up and down the street.</p><p>“Do you want to stop at that café up there?” I ask, pointing at a small neon sign at the entry to Dina’s Café and Diner. Then I force a smile, even though it hurts. “I’m sure you’re getting sick of canned food and Pop-Tarts.”</p><p>She shrugs, finally looking at me for the first time since we stopped talking. I realize she’s had her head turned because she’s been crying. The evidence of it is all over her bloodshot eyes and red, streaked cheeks and it’s all my fault.</p><p>“Dinner sounds good, I guess,” she says, her voice strained.</p> <p>I pull the truck into the parking lot and turn off the engine. As she turns to get out of the car, I reach for her arm and stop her. She freezes but doesn’t look at me.</p><p>“Baby, look at me,” I say. Lila is actually the only person I’ve ever called that, but mainly because she’s the only girl I’ve ever genuinely been in love with, at least in a way that using endearing pet names doesn’t seem totally cheesy.</p><p>She wipes her eyes with her free hand and then reluctantly turns to me in the seat. It kills me to see the sadness in her eyes. Any other girl and I’d probably have bailed out by now. Too much pressure and heavy emotions, but with Lila, I don’t want to lose her. Ever.</p><p>I pull her across the seat toward me, not stopping until she’s right beside me. Then I take a deep breath and do the best I can to explain how I feel. “I promise I’m not going anywhere. You and I have lots of road trips and fights and hot steamy sex ahead of us.” I mentally shake my head at myself. If I was writing it down, it would have sounded a hell of a lot better. “You can even come on the road trip with me to Star Grove if you want. Granted, you’ll have to put up with my mom and dad’s arguing and shit.”</p><p>The corners of her lips quirk into an almost smile. “You want me to go with you?”</p><p>“I always want you to go with me,” I say. “I just hate taking you up there around all the fighting.”</p><p>“I can handle fighting,” she insists, seeming so much happier. “I just want to make sure that you want me to come with you.”</p><p>“Of course I do,” I say, tucking a strand of her hair behind her ear. Then I aim a teasing grin at her. “And I’m not going anywhere. As much as you’re a pain in the ass, I always want you with me.”</p> <p>Her smile breaks through and she cups my face in her hands and pulls my lips to hers. She kisses me until I become breathless, which is the fucking pussiest thing to say, yet it’s fucking happening.</p><p>Then she’s pulling away, blinking her eyes with a small smile on her lips and all I want to do is hold on to her. “All right, you won me over. I’ll drop the whole marriage and future talk for a while.”</p><p>“You’re just going to drop it like that?” I ask, stunned she’s making it that easy.</p><p>Her shoulders rise and fall as she shrugs. “Yeah, I mean, you said we have a lot of road trips ahead of us and that’s all I really wanted to know.”</p><p>“Yeah, but...” I drift off, wondering why I’m not letting it go, when she’s dropping it like I wanted... or thought I’d wanted. But she’s got me thinking about stuff and now it seems hard just to stop processing where I see us down the road together. Taking trips. Kissing. Talking. Living in a cabin somewhere in the mountains where I could watch her bathe in a pond all the time. Is that where I see myself? Is that where I see us?</p><p>Dammit, where is my head going?</p><p>She slides over to the passenger door and hops out of the truck with a spring in her walk and her ass shaking in the pair of cutoffs she’s wearing. And I’m left watching her and wondering what the fuck is wrong with my head.</p><p>Chapter 3</p><p>Lila</p><p>I’m feeling a little bit better, despite the fact that I’m starving. I’ve never been a fan of cafés but right now I’d settle for anything that didn’t come in a box or a can. After we’re seated in a booth, I search the menu, my belly grumbling as the waitress fills up our waters. We order our drinks and then I run my fingers along the list of appetizers, singing along with the song playing through the speakers, one that I don’t know the name of but have heard a ton of times. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ethan watches me with a curious expression, the sleeves of his plaid shirt pushed up so I can see all his tattoos and the lean muscles in his arms. “Since when do you know ‘Creep’ by Radiohead?”</p><p>“You’re always listening to it,” I point out. “And somehow, despite my protest, the lyrics have managed to get themselves stuck inside my head.”</p><p>He gives me this strange look, like he’s realizing something that scares him. Then he fixes his attention on the menu in front of him, his forehead creasing. He reads for a few moments and then lets out a frustrated breath, shutting his menu and turning in the booth toward me. “Okay, was that like some sort of reverse psychology or something?”</p><p>I gape at him, confused. “What are you talking about?”</p> <p>He roughly rakes his fingers through his hair, seeming irritated. “That stuff back in the truck... about being okay with not knowing now...” He lowers his arm onto the table. “About being okay not knowing if we’ll be together five or ten years down the road.”</p><p>“That’s not what I meant,” I say. “What I meant was that I felt better because you said we had a lot of stuff ahead of us and that’s all I really wanted—to know we had some sort of future ahead of us.”</p><p>He still looks confused, his lips parting, and I can tell he’s about to say something that’s going to either completely and utterly make me happy for a very long time or break me apart. But then he snaps his jaw shut when the waitress returns to take our orders. I order mozzarella sticks, a chicken sandwich, and piece of chocolate cake, and Ethan orders enough to feed a small village.</p><p>“We’ll have leftovers for the road,” he says after the waitress leaves. “That way we don’t have to stop a lot.”</p><p>I glare at him. “Please. Not the no-stopping-unless-we’re-in-dire-need policy. I revoked that after the near-peeing-my-pants accident.”</p> <p>He laughs, recollecting the memory with a thoughtful look on his face. “Hey, there was an upside to that,” he says. “I got to watch you pee in a cup.”</p><p>“You got to see me try peeing in a cup,” I remind him, narrowing my eyes. “It didn’t work.”</p><p>“Hey, it always works for me,” he says, still grinning. “It’s not my fault your girl part can’t aim right.”</p><p>I maliciously reach over and grab his manly part, giving it a good rub to mess with his head. “Need I remind you what my girl part can do to your boy part?” I take his hand and put it between my legs; then I smile when he starts to touch me between the legs. We’re completely hidden by the table, although the orgasmic look on his face might give us away.</p><p>“Never make fun of my girl part again,” I say. “And stop calling it a girl part. It’s weird.”</p><p>“What do you want me to call it?” he asks with a dark grin. “Your wet, dripping—”</p> <p>I slap my hand over his mouth, stifling a laugh. “Not so loud.”</p><p>Ethan has this thing with never getting embarrassed in public. In fact, one time he proceeded to tell me, in a very loud voice, the various positions he was going to fuck me in over the course of the night. He then proceeded to give me a demonstration of what I was going to sound like when I was coming. We were in a McDonald’s and a lot of people weren’t very happy about it. Still, he did make good with his word and tried all the positions on me and I did scream out just like he had predicted.</p><p>“What are you thinking about?” he asks, his fingers wandering to my side. They dig inward and he guides me closer to him in the booth until I’m practically on his lap.</p><p>“How you did me that one night in all those different, crazy positions,” I say, biting on my lip when his grip tightens even more and hot tingles course up and down my inner thighs.</p><p>Hunger consumes his eyes. “You want to do it again?” he asks. “I’ve got a ton more positions I can show you.”</p><p>I bite my lip harder, so hard, in fact, I taste blood in my mouth, feeling the shift in our mood and wanting it more than anything. “But we don’t have a hotel room.”</p><p>He glances around the mostly vacant café like he’s almost forgotten where we were. Then his eyes wander to the window at the front of the diner where it’s dark, a faint stream of light trickling in from the lampposts in the parking lot. “Why don’t we get a room?” he asks, turning his attention back to me.</p><p>The look in his eyes pushes me nearly over the edge. I swear if he doesn’t tone it down, I’m going to have an orgasm right here at the table, in a restaurant full of people. Granted, it’d be worth it. “I thought we had to hit the road tonight?”</p> <p>He shakes his head, his expression filling with lust and making my body feel like it’s going to combust. “We can still make it back in time... we’ll just have to make a few less stops...” His gaze flicks to my breasts. I’m not wearing a bra and my nipples have gotten so hard that they’re visible through the thin fabric.</p><p>His fingers find them and trace them in soft circular motions, while he waits for me to respond.</p><p>“We can do that,” I say, but it comes out a groan and his fingers clamp down on me.</p><p>The next thing I know we’re headed up to the counter, telling the waitress that we’d like our food to go. Then we wait very impatiently, sneaking touches when no one’s looking, and sometimes when people are looking, until our food arrives at the counter in to-go bags. Ethan pays and then we leave, driving across the street to this sketchy-looking motel that has about five rooms total. I don’t care, though. I just want him now. It’s amazing what he can do to me just with the simple promise of being inside me, how far I’ve come because of him. I remember when sex was just numbing. I felt nothing. Felt like I was too worthless to enjoy it. Then Ethan came along and all that changed. He made me feel alive and worth something.</p><p>Almost every moment is perfect with him and hopefully we’ll have a thousand more moments just like this.</p><p>Ethan</p><p>Normally, I would have said we didn’t have enough time to stay for an extra night, not if I want to stop at all the places I want to on the way home. But all of that stops mattering the moment I start thinking about being inside her. Hell, I’ll give up making a stop in Tennessee like I was planning on... see one less mountain as long as I can just touch her a little bit longer.</p><p>My dick’s so hard it fucking hurts. Touching her like that, especially in public, feels so forbidden and it’s such a turn-on, especially when she touches me back. Only Lila can challenge me like that and get me so riled up. I swear to God I was on the verge of peeling her clothes off and slipping inside her right there in the booth. Luckily for the sake of giving everyone in the café a live porn show, we managed to make it across the street to a crappy-looking motel. It’s definitely not the best place in the world and I’m a little worried that Lila’s going to flip, but as soon as we step into the room, her lips collide with mine and she’s stripping off her shirt eagerly.</p><p>And just like that I get lost in her; all the stuff bouncing around in my head momentarily dissipates as my tongue explores her mouth. Our bodies line perfectly together as she traces her fingers up my back, shivering when I do the same to her. I sketch the lines of the tattoo on her back as I steer us through the dark toward the bed. Moments later, we stumble backward and the mattress collapses beneath us as we land on it together. I brace my weight onto my arms, her head pinned between them, as I keep kissing her. Her legs drift to my hips and she bends her knees and wraps them around my waist, hitching her ankles behind my back. She starts to grind her hips against me, making my cock go rock-hard. I move with her, letting her veer toward the edge while I try to hang on, wanting to be inside of her so goddamn badly my body is pretty much sweating in desperation, but she’s too close to coming and I want to see her lose it before I slip inside her because I enjoy watching her get lost like that, especially when I’m the one doing it to her—making her feel like that. So I keep going, watching, her eyes glazing over. Finally she stops moving with me, her muscles tightening as she cries out. Her head falls back and her eyelids flutter shut as she drifts off, her fingertips delving into my shoulder blades so sharply I feel the skin break. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I’ve never been so turned on in my life.</p><p>“Jesus, Lila,” I groan, begging my body to hold on just a little bit longer.</p><p>She breathes ravenously, her chest heaving as she blinks lazily. When she looks at me again, she has a content look on her face and a faint smile. “Your turn,” she says, and then she nudges me to move.</p><p>I more than willingly obey, rolling off her and onto my back. She stands up on the mattress and slips her shorts and panties off, then undoes the button on my shorts and removes them, along with my boxers. She takes a condom out of the back pocket of my shorts before tossing them aside. My hand glides up her leg to her waist, pulling her toward my mouth, but she wiggles out of my grip, tears the condom wrapper open, and puts it on me. Before I can even respond to her touch, she’s straddling me and lowering herself onto my cock.</p><p>I grip her waist as her warmth surrounds me and I lift my hips and rock inside her, slowly, savoring every single goddamn aspect of the moment.</p><p>“God, this feels so good,” she mutters in ecstasy as she lets her head fall back and rocks her hips with me.</p><p>My hold on her waist tightens as I give another slow thrust into her, deeper this time. “Yeah, it does...”</p><p>We start to move rhythmically together, having orgasm after orgasm, getting lost over and over again inside each other. I think we break our record for how many times we have sex in one night—it’s five now. Exhausted and sweaty, we finally settle down for the night, holding on to each other as we drift to sleep. She falls asleep first and I end up just watching her breathe softly in my arms, never wanting to move. Never wanting to do anything ever again but this. In fact, I can actually see myself doing this over and over again with her. Every night...</p><p>Shit. I’m thinking about the future and I’m so... Confused... This is such a perfect and beautiful moment and I wish I could just stay like this forever with her. Yeah, we’re starting the long drive home tomorrow, but I want things to say the same when we get back. I have a revelation as I think about heading home. I meant what I said in the truck. I want more road trips like this with her. I want to hold her in my arms in a shitty motel one day again in the future. I don’t want to lose her—I realized that when I thought she was breaking up with me at the rock. I want her and I don’t want to be scared to want her so much.</p><p>I’m suddenly fucking freaking out as I realize something. My biggest fear is right in front of me and I want to get over it, but I’m not sure I can. Making sure she’s still asleep, I get out of bed, go over to my suitcase, and take my journal out. The moment the pen touches the paper, my feelings pour out of me. When I’m done, my hand is shaking, but I have the truth right here in front of me. And I’m not sure if I’m terrified, happy, relieved, or what.</p><p>But one thing’s for sure. I need to tell Lila.</p><p>Chapter 4</p><p>Lila</p><p>Last night was amazing to say the least and when morning comes around, I feel like skipping and singing because I feel that happy. But instead we end up going for a hike and I listen to Ethan chat about the wildlife. Sometimes listening to him can be magical, especially when he’s just laid back and not overthinking things. It happens a lot when we’re hiking.</p><p>“I seriously could just live up here and write all day,” he admits as he sits down on the top of the hill we just hiked up, stretching his legs out and staring down at the rolling hills and small town below.</p><p>I sit down with him and crisscross my legs. There’s a gentle breeze blowing through my hair and I have to pluck strands of it out of my mouth. “What would you write about? The view?”</p><p>He shakes his head and shrugs, squinting against the sunlight. “I’m not even sure... something, though.”</p><p>I rest back on my hands and lean my shoulder into his, breathing in his scent of cologne, mixed with campfire and a hint of dirt. “Do you think one day you’d like to become a writer?”</p><p>He shrugs again, glancing at me out of the corner of his eye. “I haven’t thought that far ahead of what I’m going to do for the rest of my life... what I want to be.” He looks down at the ground, seeming confused, and I’m suddenly reminded of the bigger problems ahead of us, ones that I want to shove aside for now.</p><p>“Well, maybe one day you should think about what you want to do,” I dare suggest. “It could be fun, you know. To write for a living. Well, at least for you since you seem to love it so much.”</p><p>“You don’t even know if I’m good,” he says with a smile.</p><p>“Well, if you can write like how you talk sometimes, then I’m sure you are.” I pause, considering my next words carefully. “Or you could just let me read some of the stuff you wrote.” I actually heard him last night when he thought I was asleep, scratching away in his journal, and I wish I knew what he was writing about.</p><p>He pauses, biting at his bottom lip, and for a second I think he’s considering it. I start to get a little excited and nervous, because I might finally get a full insight into what goes on in that head of his. What he thinks and feels—what he sees when he looks at me.</p> <p>But then he says, “Trust me. You don’t want to read what goes on in my head.” And my hopefulness crumbles.</p><p>I fake an exaggerated pout. “Yes, I do. I promise. Even if it’s bad, I want to know.”</p><p>He stifles a smile as he leans in and grazes my bottom lip with his fingertip. “Stop pouting to try and get your way,” he says, and then he kisses me.</p><p>We kiss until we’re panting and then we pull away, breathless and sweaty. We relax for a while and look out at the land below us, enjoying the view and the quiet and I know at that moment that he’s happy because it’s the kind of moment he loves.</p><p>“The thing is,” Ethan says, startling me. “I don’t really write stories. Just my thoughts.”</p><p>“But isn’t that what all stories are?” I ask. “Just someone’s thoughts?”</p><p>“Yeah, but my journal isn’t like a book,” he says. “It’s just a bunch of rambling about how I feel... about stuff... and my feelings... It’s sort of how I discover what I’m really feeling.”</p><p>“About me?” I sound a little nervous.</p><p>He looks even more nervous. “Yeah, sometimes I write about you and how I’m feeling about you.” He pauses with his mouth open, like he wants to say more, but then he snaps his jaw shut.</p><p>“Do you ever write anything mean about me?” I hold my breath in anticipation.</p><p>He shakes his head, looking stunned by my question. “I would never write anything bad about you. Ever.”</p><p>“Then why can’t I read just a page or two?” I ask.</p><p>“I’m not sure I can let you,” he mumbles. “Not sure if I’m ready yet...” He trails off, staring out at the hills in front of us, looking as lost as we probably do out in the middle of thousands of trees. If it wasn’t for him, I’d never be able to find my way back. Thankfully, he has a good sense of direction.</p><p>I want to press him more, because I’m really curious what he’s writing about all the time, but I can tell his mind’s already wandering, so I seal my lips and pretend to be happy. Eventually he starts to get up. I bend my legs to stand up, too, figuring we’re leaving, but he puts a hand onto my shoulder and gently pushes me down to the ground. Then he winds around behind me and sits down, putting a leg on each side of me and winding his arms around my waist. He pulls me against him and buries his face into my neck, kissing it. “This past month has been amazing,” he whispers, and sucks on my neck, rolling his tongue out, teasing my skin with kisses. “I really wish we could stay this way.”</p><p>I let my head fall to the side to give him more room to tease my neck. “We can’t just live in a tent forever... as much fun as it’s been, I really can’t wait to have a real roof over my head.”</p><p>He moves his lips up my neck to my earlobe. “What if we built a cabin for us to live in?”</p><p>“Why would we do that?” I ask, breathless as his kisses make my skin dot with goose bumps. “Or better yet, how would we?”</p><p>“Save up.” He makes a path of kisses down my neck as his hand slips underneath the front of my shirt. “Build one. Move out here. Live. Write. Do whatever the hell we want for the rest of our lives.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My heart hammers inside my chest, wondering if this conversation is headed where I think it’s headed. “Forever? Just you and I?” Is he talking about our future?</p><p>“Maybe,” he says distractedly, and then he presses his fingertips to the side of my jaw and kisses me deeply, leaving me more confused than ever.</p><p>But like always, his kisses make me forget my confusion.</p><p>Ethan</p> <p>I’m messing this up. Really, really bad. There was a reason why I wanted to take her up here—some things I want to say about us that I discovered last night—but now I’m chickening out and panicking. I suddenly feel like I’m fourteen again and the weight of the world—the pressure—is building up and crushing me. I need to calm down.</p><p>I start kissing her as a way around it, knowing that eventually I’ll have to break the kiss and finally just tell her how I feel. About us. About our future. But I kiss her for as long as possible, until she’s gasping against my mouth and I’m gently pulling at her hair. I can tell we’re only a few more heated moments away from peeling off our clothes and having sex right here on the trail. It wouldn’t be the first time, and yet I carefully pull away, nibbling on her lip before sitting up straight.</p><p>She looks flustered. “What’s wrong?” Her fingers travel up the front of my chest to the top of my shirt, where she grips at the fabric, trying to guide me back to her. “Don’t you want to relive the Fourth of July incident?”</p><p>I smile as I recollect the Fourth of July. Fireworks exploding over the lake in front of us. Trees surrounding us. Hiding under a blanket, listening to people chatter in the distance as we made love, knowing that at any moment someone could walk up the trail and see us. Neither of us really cared. In fact, it made things more exhilarating.</p><p>“Not just yet,” I say, cupping her cheek. “I actually need to talk to you about something.”</p> <p>Her forehead creases as she sits up, then kneels and turns to face me. “It’s not bad, is it?”</p><p>“As long as I can get it out right, it isn’t.” I let out a loud exhale, preparing to do something I never thought I’d do. “The thing is, you keep talking about marriage and stuff and it really freaks me out,” I tell her, and when she frowns I quickly add, “But it’s not like I don’t think about where we’re going to be down the road... if we’re going to end up together... be together forever.” I put my hands on her thighs as she watches me with worry. “I actually think about it a lot. More than I actually realized... Something that I sort of discovered after writing last night.”</p><p>“And what did writing reveal to you?” she asks, biting on her bottom lip as I smooth my thumb across her cheek.</p><p>“That you and I will end up together.” I swallow hard, hating that I have to add the last part, but I need to if I’m going to be honest. “However, I don’t think we should get married soon.”</p><p>She rolls her eyes, which wasn’t the response I was expecting. “I don’t think we should get married soon either,” she says, inching closer to me. “I just wanted—no needed—to know we’re headed somewhere that could maybe lead to that one day. And that you feel the same way as I do about being together in the long run.”</p><p>I tangle my fingers through her hair “You know I love you, right?”</p> <p>“Yes,” she says, leaning in for a kiss. “And I love you too.”</p><p>I pull her in for a quick kiss and then rest my forehead against hers, shutting my eyes, preparing myself for the next thing I’m going to say. Something that terrifies the shit out of me because it’s so permanent and the even scarier part is that I want it to be. “I want to do something.”</p><p>She catches her breath. “What?”</p><p>I slip my hand up the back of her shirt and place my palm over her tattoo on her back. “I think... I mean, I want to get another tattoo.”</p><p>I feel her lashes flutter against me as she opens her eyes and slants away. I open my eyes but keep my hand on her back right between her shoulder blades. She’s giving me a baffled look, her eyes wide and searching mine.</p><p>“I don’t get it,” she says. “How do we go from our future talk to you getting a tattoo? I mean, if you want to get another tattoo, that’s totally okay with me. You look hot with them... but I don’t—”</p><p>Chuckling under my breath, I cover her mouth with my hand. “Lila, I meant that we should get tattoos together. Ones to mark this trip. And the beginning of our future... ones that sort of go together.” When she looks like she’s starting to relax, I remove my hand from her mouth. “I knew this couple with really cool matching bands on their fingers and I thought maybe we could get something like that.”</p><p>“You want to get a matching tattoo with me,” she says, a little shocked. “But it’s so permanent.”</p> <p>“That’s sort of the point.” I pause, wondering why she’s not excited about this. I thought she would be, but maybe I’ve been reading her wrong. “We don’t have to. I just thought...” I trail off as she gets to her feet and starts to walk toward the trail.</p><p>I quickly get to my feet and hurry after her. “Where are you going?”</p><p>She glances over her shoulder at me, heading toward the trees at the bottom of the hill. “I want you to show me what you wrote last night.”</p><p>My expression falls. “Why?”</p><p>She turns around, walking backward with a grin on her face. “I want to see how you really feel—I want to make sure that you’re not just doing this for me because I’ve been pressuring you. That you really want this as much as I do. And if it does seem that you want to make that sort of leap with me, then I’ll totally do it, but if not, then...” She turns around as she reaches a steep spot on the hill where the ground gets a little loose.</p><p>“And if you don’t think I want this, then what?” I ask, catching up with her and placing my hand on her back to help her down the steep slope.</p><p>“Then we won’t get the tattoos right now,” she says, stumbling a little, and my fingers enfold her waist to catch her from falling.</p><p>“But I thought you wanted a commitment?” I ask, taking her hand as we reach the flat section at the bottom of the hill.</p><p>“I do,” she says as we duck to enter the trees. “But I also want to know for sure that you want it. And if you do, then great, and if you’re not ready for it, then you’re not ready for it.”</p><p>I grow a little nervous. “But what if what I wrote freaks you out?”</p><p>She aims a disbelieving look at me. “Are you kidding me? After all the stuff I put you through, you think that something you wrote in your journal is going to freak me out?” She pauses as we reach the open section of the trail where the trees are sparse. “You helped me through addiction, family problems, and helped me find myself. I don’t think anything you wrote could be more intense than that.”</p><p>“I wouldn’t go that far,” I say, unsure if I want her to read anything in my journal. It’s like giving her insight straight into my head.</p><p>“If you don’t want me to, then that’s fine,” she says. “But I’m not going to get matching tattoos until I know for sure that you want this and aren’t just saying so because I’ve been weird about commitment lately.”</p><p>“I never say anything but the truth,” I remind her. “Even if it’s harsh.” I pause, tugging my free hand through my hair, thinking about what I want and what I don’t want and which one is more important. But in the end only one thing matters—what she wants. “I’ll let you read it... but just prepare yourself... I always write what I say and sometimes... well, I’m not sure how you’re going to interpret it... whether you’re going to see it as me wanting a future with you.”</p><p>She swallows hard and then lets out a loud exhale, looking nervous. “Well, I guess we’re about to find out.”</p><p>Chapter 5</p><p>Lila</p><p>I don’t want to get too happy just yet. I need to make sure that he wants something linked to me branded on his gorgeous body forever. I don’t think that Ethan would ever lie to me, especially with something this big. He’s always been really truthful in the past, but the only way I’ll be able to truly know is if I read his words. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He looks nervous as we sit in his truck, the sun glaring in through the windows. He’s flipping through the pages of his journal, searching for the right page, and I try to stay calm in the passenger’s seat, hoping there’s nothing in there that’s going to upset me.</p><p>He finally stops flipping through the pages and takes a deep breath before he looks up at me. “Just make sure you read the whole thing. It starts off kind of”—he struggles for the right words—“unsure in the beginning, but it gets better.”</p><p>I nod and then reach across the seat toward the journal. He glances at it one more time, seeming torn, before he reluctantly hands it over. I take it and put it on my lap, feeling a little uneasy as I read the first word on the page: confusion.</p><p>“Just start right here?” I ask, tapping the top of the page with my finger.</p> <p>He nods and then turns toward the window, staring at the vacant motel parking lot to the side of us. I swallow hard, tell myself to go into this with an open mind, and then with caution, I start to read.</p><p>Confusion. That’s what I feel every time I think about the future. I hate thinking about where I’m going to be in a few years—where I’m supposed to be. If I had my way, I’d take things day by day. Never think about the next day or about the past. I’d live life in the moment. Breathe it. Live freely. It’s so much less stressful than worrying all the time about where I’m going to be down the road or who I’m going to be with. I already lost someone once that I cared for. And the idea of losing Lila is like a hundred times worse than that. I’m not even sure if I could get over her if I tried. And what if I didn’t lose her, but we just ended up despising each other like my parents and her parents do. That would be equally as hard. It seems so much easier just to stay away from that deep of a commitment and avoid all the “what ifs.”</p><p>The problem is it’s sort of selfish to think this way about life, especially when I’m not the only one in my life. Lila is such a huge part of me. She’s more than that. Over these last couple of years, she’s become my best friend and not opening up to her completely because of my fears is wrong. She’s the person I love more than anyone else in this world and if I have to open my eyes for a moment, and look forward, all I see is her. God, it’s the truth... She’s all I want. That much I know. I never want anyone else to go through all this shit with me—to go through life with me. And if I have to decide one thing right now about my future, it’s that I want to be with her. I want her with me. Even five or ten years down the road. Even when we’re thirty or forty. Even if it means we could possibly turn out like our parents, I want to try. I want to try to have a future with her. What the hell happens between now and then I’m not so sure. But do I even need to be sure about that yet? Maybe I only need to be sure about one thing. And that’s her and I always being together. Even through the shitty times. I’d never go back and change a damn thing. Every single thing that we’ve been through has gotten us to this moment where she’s lying in the bed beside me and just her being here makes me so content. I breathe easier. I don’t even want to think about being on this trip alone. Yeah, I love the quiet, but it could never compare to all the moments we’ve shared together. Fireworks. Arguments. Ponds. Kisses. Sex... God the sex is great. Every conversation with her, good and bad. Every moment, light and dark. I want to relive it over and over again. I want so many more moments and conversations.</p><p>I want this to be permanent. I want Lila and I to be permanent.</p><p>Forever and Always.</p> <p>I try not to cry. I really do. But I’m an emotional person and this... well, I never ever thought anyone would ever feel this way about me.</p><p>As my tears start to stain his beautiful words, I quickly shut the journal so the ink stays intact. I quickly wipe my tears with my hand, look up at him, and before he can speak, I say, “So where are we going to get the tattoos?”</p><p>Ethan</p><p>I wasn’t sure how she’d take what I wrote. Yeah, the ending was good, but the beginning... well it was full of my fears. And then she starts to cry and I’m a little worried she’s maybe misunderstood what I was trying to convey in my journal. I’m about to ask her what’s wrong, but then she says she wants to go get the tattoos. I’ll admit I’m a little scared, but in a terrifyingly good way. I want this. I knew it the moment I wrote the word permanent.</p><p>After we decide to get the tattoos, I drive us over to a tattoo shop on the main section of town between a row of shops. We go inside and start looking through the examples on the wall, but Lila keeps frowning at them.</p><p>“I want something that we come up with,” she says, resting her arms on top of the glass countertop. “Something that’s just yours and mine.”</p> <p>“A symbol?” I ask. “Or words?”</p><p>“Words,” she says, smiling. “I think you should come up with words that connect us.”</p><p>I point at myself. “Why does it have to be me?”</p><p>“Because.” She walks up to me and hooks her arms around my neck. “You put words together beautifully. I seriously think you should consider the whole writer thing.”</p><p>I press back a smile, feeling my heart speed up with panic and fear and excitement. “One future move at a time, please,” I say, and she laughs. I let a slow breath ease past my lips as I try to think of something to put on our fingers. There’s not a lot of room and I know the artist is probably going to tell us that more than one word is too much. I think about the last words I wrote in my journal and how they were so huge because they made me realize that moving forward with Lila was something I wanted.</p><p>“How about forever and always?” I say, taking her hand in mine and tracing my finger around her ring finger.</p><p>She glances down at her hand, puzzled. “What, you take forever and I take always? But then who would take the word and?”</p><p>I shrug. “How about both of us.”</p> <p>She glances up at me with her brows knit. “You want to split up and? Like you take the a and half the n and then I take the other half and the d?” she asks, and I nod. “Wouldn’t that look a little weird?”</p><p>“Does it really matter if it looks weird?” I ask. “It’d mean something to us and that’s all that matters, right?”</p><p>She considers what I said and then a smile breaks through. “I really love that idea.” She pulls me in toward her and we kiss until a very bulky dude with tattoos covering his arms comes into the waiting room to see what we want. When I explain it to him, he looks at me like I’m some sort of punk kid who’s stupidly in love. I don’t really give a shit what he thinks, though, and feel perfectly content with his disgusted look as he draws up the designs.</p><p>When he’s finished, I decide to go first since Lila seems nervous, like she was when she got her first and only tattoo. I take a seat and the guy puts the drawing on me, making sure it’s where I want it. When we get it in the correct place, he gets the needle ready and I shut my eyes, feeling myself change the moment the ink touches my skin. I can feel myself moving forward with each stroke. Feel myself connecting to Lila. Feel that I’m exactly where I want to be. Right in this moment with her.</p><p>Lila</p><p>I get so nervous around needles. It took a lot just to get me in the chair for the first and only tattoo I’ve ever gotten. Then I damn near fainted the first minute into it. But Ethan stood by my side and reminded me why I decided to do it. Because I want to be free and wanted to have something that would forever represent my journey toward freedom.</p><p>But watching Ethan mark his finger with something that would always connect him to me is different. It makes me feel even more free and alive. Excited. Overwhelmed. Loved. It’s the perfect moment that ends too quickly because suddenly he’s finished and it’s my turn.</p><p>“You sure you want to do this?” he teases, stretching out his fingers as we trade places.</p><p>I eagerly and very anxiously nod as I plop down in the leather chair. The large guy with a lot of colorful tattoos on his arms who did Ethan’s tattoo tells me to put my hand up on the armrest. He seems sort of cranky, but I don’t care. Nothing could ever ruin this moment, not even a cranky guy who smells like he’s in dire need of some deodorant. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I stay quiet as he positions the drawing on my finger until he gets it in the right place. Ethan holds my hand the entire time, while staring down at his free hand. The skin around the tattoo is a little red, but other than that it looks perfect.</p><p>He’s perfect.</p><p>He’s the only person who’s every fully understood me. The only person I’ve ever trusted. The only person who saw who I really am and the potential of what I could become. He loved me in a way that I thought wasn’t possible and that’s what I keep telling myself over and over again as the tattoo artist presses the tip of the needle to my finger.</p><p>I’ve gone through a lot over the last eight months or so. I’ve changed for the better. I’ve had a lot of moving, life-changing moments. But this one is different. This one is epic. I can feel it through the blissful pain that makes me hyperaware of what I’m doing. And when I’m finished, I feel genuinely happy even though my finger aches.</p> <p>“So?” Ethan says as I get up from the chair. He watches me, like he’s waiting for me to say I regret it.</p><p>I stare down at my ring finger with a big grin on my face. I’ve always pictured myself with a huge diamond on my ring finger, a carat at least, but now... well, this feels so much better. So much more personal and intimate. Nothing could mark our relationship better than this.</p><p>I glance up at him, looking him straight in the eye. “I think it’s perfect.”</p><p>He smiles back at me and then slips his fingers through mine. It makes the area of the tattoo sting a little, but there’s no way I’m going to pull back. We pay for the tattoos and walk hand in hand outside to his truck.</p><p>“You ready to start our journey back home?” he asks, opening the truck door for me.</p> <p>I nod as I climb in. “I’m ready for anything.”</p><p>There’s a sparkle in his eyes as he leans in, pausing when our lips are only inches apart. “Me too.”</p><p>He kisses me passionately before pulling away, blinking his eyes with a dazed look on his face. “We’ll have to go on one of these trips every year,” he says as he starts to shut the door. “Just you and me and the road. Living in a tent and eating camp food again. Taking baths in the pond.” He grins. “Having sex on the shore of a lake, hiding under a blanket.”</p><p>I smile, feeling happier than I’ve ever been because I know Ethan will be in my future and that’s all I ever wanted, and as long as I have him, nothing else matters. “Sounds perfect.”</p><p>About the Author</p><p>The New York Times and USA Today bestselling author, Jessica Sorensen, lives with her husband and three kids. When she’s not writing, she spends her time reading and hanging out with her family.</p> <p>Learn more at:</p><p>jessicasorensensblog.blogspot.com</p><p>@jessFallenStar</p><p>http://facebook.com/JessicaSorensensAdultContemporaryNovels</p><p>Please see the next page for a preview of The Temptation of Lila and Ethan.</p><p>Chapter 1</p><p>Present day...</p><p>Lila</p> <p>I’m having a where-the-hell-am-I moment. My arms are flailing, my pulse fitfully racing as I struggle to get my bearings. I open my eyes, but I can’t place a single thing about the room I’m in other than I’m naked in a bed, sweaty, and super gross. My head feels like it’s stuck in a fishbowl as I try to recollect where I left my pills, but I can’t even remember where I am. There are photos on the walls, none of anyone I recognize, though. The closet is open and it looks like there’s some kind of football uniform in there. Did I sleep with a football player? No, that doesn’t sound familiar. My gaze slides to the opened condom wrapper on the nightstand and I feel relief wash through me. I’m on birth control and everything, but that only protects from pregnancy. God, I really need to stop doing this.</p><p>I’ve become accustomed to these kinds of situations, waking up in unfamiliar places with a headache, panic, and consistent, recognizable shame inside me that I know belongs there, just as much as the air in my lungs and the blood in my heart. I don’t deserve to feel anything better after the decisions and choices that I’ve made. I know what I am on the inside now and I don’t fight it anymore. It’s both liberating and heartbreaking because this is how I have to be—who I am—and it’s sad. But I can smile on the outside, show the world how happy I am, since that’s what’s important, even if I’m dying on the inside.</p><p>The routine is very simple and I know it like I know the back of my hand. I open my eyes, take in my surroundings, try to remember something, and then when all else fails, get the hell out of there. I slowly sit up, trying not to wake the guy lying in the bed next to me. He’s got dark brown hair and a pretty sturdy body, but his back is turned to me and my memories are hazy, so I can’t place what he looks like from the front. Maybe that’s for the best, though. Whatever I was looking for with him—love, happiness, a blissful moment of connection—obviously never happened. And I’m at a point in my life where I doubt if it ever will.</p><p>Holding my breath, I climb out of bed and slip my dress on, covering myself up, along with the scar winding around my waist, reminding me of why I’m here. I attempt to get the back row of buttons done up, but my fingers are numb, like I was doing something weird with them last night, which could be a possibility. I do have tendency to get a little extreme when I’m that drunk. The fingernails sometimes come out, and back in boarding school I got deemed the slutty biter/screamer. Although, sometimes I wonder if I do it out of pleasure or from the fear that seems to surface when I have sex. And that confusion is his fault. I’ll always hate him for that, even if I thought I loved him and would have done anything for him at the time. But how could I really, when I was way too young to feel love? Even now, I still haven’t felt it and I’m twenty years old.</p><p>Leaving my dress unbuttoned, I collect my shoes and tiptoe toward the door. I notice a wad of cash on the nightstand beside the bed and a ring that looks like a football championship ring or something. There’s also a stale sandwich on the dresser and several empty beer glasses.</p><p>“Ew, I must have really been drunk,” I mutter, cringing at the food and then double cringing when I catch my untidy appearance in the mirror on the wall.</p><p>Making a repulsed face, I slip out of the room, thinking I’ll be out in the hallway of one of the dorm buildings on campus. But I’m in a large, open living room with columns around the walls and picture windows everywhere, letting light easily flow in. The floor is marble and there’s a large white rug spread out. It has to be a condo or something, with how fancy it is, not a dorm.</p><p>There are a couple of guys and a girl sitting on a leather couch in the middle of the room, watching a flat-screen television mounted on the wall just beside where I stepped out. I can’t remember anything other than shots, a chic club, a sleek black Mercedes, someone’s hands and lips on me, wishing I could black out, and then I must have gotten what I wanted because after that I remember nothing.</p><p>The guys simultaneously look up at me and I notice they’re older, like maybe twenty-four or twenty-five, which makes me feel too young to be here, yet older guys seem to be my thing, at least when I’m drunk.</p><p>“Hey.” One of them nods his scruffy chin at me. “You look a little lost.”</p><p>“Yep, I’m totally lost.” I force a smile, even though I’m frowning on the inside, and I hold my head high as I do the walk of shame. They start laughing at me and I find myself wishing I were someone sassier, like Ella, my best friend and old roommate. But I’m not. Sure, I can be sassy when the time calls for it, but right now I feel icky, gross, and disgusted with myself because I just woke up, my makeup’s worn off, my hair’s a mess, and my clothes smell like alcohol. Plus I’m crashing. Badly. And I don’t have anything on me to help balance my mood.</p><p>I rush across the room and throw open the door. As I step out of the condo, I hear one of them laugh and say something about me being easy and slutty, but I close the door and shut out their voices. I walk down the hall and trot down the stairs to the bottom, where I push the door open and step outside into the sunlight and the lukewarm November air. Being outside makes me feel a little better, except I still can’t recognize where I am. It’s a condo complex—that much I get. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Crap,” I mutter, pressing my fingers to the brim of my nose. I have a splitting headache and my hair smells like beer and my pores feel sticky. I hike across the lawn toward the corner of the street so I can read the street sign, knowing it could be worse. I could be in one of the lower-class areas of Las Vegas, but this looks like it’s a nice area, located near some cul-de-sacs and upper-class homes. When I reach the corner of the street, I shield my eyes with my hand and squint up at the street sign. Damn it, I’m way too far away from my apartment to walk. I can either take the bus, which I haven’t been a fan of since I was fourteen, or I can call someone. The only person I really know around here anymore—the only one who I trust seeing me like this—is Ethan Gregory. He’s the one and only bad boy I’ve ever had in my life and the one and only guy who’s never wanted to sleep with me, which makes him seem less bad to me, but to all the other girls he sleeps with, not so much.</p><p>I first met him two summers ago when I went with my best friend Ella back to her hometown. He was the best friend to the guy Ella was in love with, Micha—although she wouldn’t admit it at the time. While those two were working out their problems, I spent a lot of time with Ethan and we hit it off. There was this strange connection between us, like we understood each other, even though we were from totally separate worlds: rich and poor. Even when I went back to school in the fall, we still talked on the phone. And then he moved here and we’ve been hanging out pretty much ever since.</p><p>Cursing under my breath, I find my phone that luckily is still in the side pocket of my dress, and then I punch in Ethan’s number.</p><p>He answers after three rings and his voice is laced with amusement. “Well, hello, lovely Lila. What’d you do this time?”</p> <p>I ignore the ripple through my body that his voice always causes. After knowing him for a year, I’ve pretty much become an expert at discounting the emotions he always brings out inside me, which is a good thing for many different reasons. For one thing we live in two separate worlds: I like nice things and Ethan is very unmaterialistic. He calls me spoiled a lot and I call him a weirdo because I don’t get half the things that he does, like refusing to buy nicer clothes when he has the money for them. He’s so sexy and if he’d wear jeans without holes in them and new shoes and shirts he’d look so much better.</p><p>Plus, even though I hate to admit it, my mother’s words always echo in my head: If you can’t find a man to take care of you then you’ll end up living in a crack house, just like your sister. Find a wealthy man, Lila, and hang on to him no matter what sacrifices you make. Despite the absurdity of it, I can’t seem to get the mental picture out of my head of me curled up in a ball on a ratty old couch, dressed in rags, smoking crack from a pipe, and it scares me.</p><p>“I didn’t do anything... I don’t think anyway. I just need a ride,” I say in a whiny voice because I’m tired and filthy and disgusting.</p><p>“Again?” he replies, pretending to be annoyed but I’ve gotten to know him well enough to know he really isn’t. He just likes people to think he is because he likes to seem tough and a badass. But I know he’s not. He’s actually really sweet and talks and listens to me and gives me candy canes. I still have a drawer full of the ones he gave me, unable to eat them or throw them away because then it feels like I’m losing a nice moment in my life with a guy and those kind of moments are very rare, if nonexistent.</p><p>“Are you there?” he says, interrupting my thoughts.</p> <p>“Yes, I need a ride again.” I sink down on the curb, attempting not to think of candy canes and red lacy bras. That was a one-time thing. We both agreed that there would be no hooking up. Although, I agreed to it only because he seemed so eager to make it clear it would never happen again. “So will you or won’t you come pick me up?”</p><p>“God, you’re snippy today,” he remarks with humor in his tone. “And I don’t think I want to deal with it today. I’m too fucking tired from the woman I screwed last night. She really wore me out. Plus, I have to be to work later today.”</p><p>“Don’t be an ass.” I scowl, even though he can’t see me. “Please quit messing around and just come get me. Pretty please.”</p><p>He pauses and then sighs, defeated. “I’ll come get you though, but only if you say it.”</p><p>“I’m not going to say it, Ethan. Not today.” I prop my elbow on my knee and rest my chin against my hand. He wants me to tell him that I’ll be his sex slave, something he made me promise to say the last time he picked me up. He doesn’t really want me to be one, though. He just thinks he’s funny.</p><p>“That was the deal,” he reminds me. “If I ever had to come pick you up again.”</p> <p>“But I made the deal when I wasn’t this cranky,” I say and grimace. “When it seemed like a good idea.”</p><p>“Fine.” He surrenders way too easily and it makes me smile just a little. “But next time I’m making you... In fact, I might even actually be your sex slave the next time you call me,” he says and I sigh heavily. “I’ll head out in a few.”</p><p>“Thank you,” I tell him, stretching my legs out onto the road. “And I’m sorry for being so pissy. I’m just hung-over.”</p><p>“You didn’t go out with that douche from the club, did you?” he asks and I can hear him moving around. “Because I told you the guy seemed sketchy. Although all the guys you’ve hooked up with seem a little bit sketchy, if you ask me—rich, preppy douche bags.”</p><p>“They’re not douche bags. They’re just different from what you’re used to.” I yawn, extending my arms above my head. “And no, I didn’t go home with the guy from the club... I don’t think anyway. I can’t even remember who I went home with.” I cringe as I try to put the pieces together, but I can’t even seem to find one full piece.</p><p>“Lila...” he starts, but then decides against it, probably because he sleeps around just as much as I do. “Where are you exactly?”</p><p>I breathe a sigh of relief, grateful he’s not giving me anymore crap for my sexual mishap. I’m hung-over and having withdraws and I can feel myself verging on a meltdown, something that can never happen, let alone in the open. “I’m on the corner of Vegas Drive and Rainbow.”</p><p>“Where exactly? In like a store or a house or something?”</p> <p>“No, I’m sitting on the curb.”</p><p>He’s quiet for a moment. This isn’t the first time he’s had to pick me up under these kinds of circumstances and it probably won’t be the last. It’s kind of our thing; we share our stories and never judge each other, despite how bad and ugly the stories are. He knows things about me that no one does, like how my father treats me, and I know things about him, too, like how his dad used to beat his mother and how he despises him for it. “I’ll be there in, like, fifteen to twenty minutes. Don’t go wandering off anywhere.”</p><p>“Where would I go?” I pull my knees up and lower my forehead onto them. “It’s too damn hot outside to even breathe.”</p><p>“And try not to get into any trouble,” he adds, disregarding my comment.</p><p>“Fine.” I roll my eyes and then squeeze them shut, inhaling the sweltering air. “And, Ethan...”</p><p>He pauses. “Yeah.”</p><p>“Thank you again,” I say softly because I really do feel bad for making him do these things for me. He’s always so nice about it, too.</p><p>Another pause and then he gives an overexaggerated sigh. “Whatever. You’re welcome.”</p><p>We hang up and I feel the slightest bit better. He’s always there for me, even when he doesn’t want to be. He’s the only person I really talk to anymore and I worry what will happen if he decides to leave me.</p><p>I lie down on the sidewalk and twist my platinum ring around on my finger as I stare up at the melting blue sky and the blinding sunlight. For a moment I don’t care about how filthy the ground is or the fact that my dress is undone and my eyes are starting to sting. In fact, for a split second I know I belong there and nowhere better. But as I press my cheek against the scalding concrete, I remember that I was taught not to lie on a filthy ground. I sit up straight and trace the ugly circular scars on each ankle, the mark of my biggest imperfection both inside and out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sun bears down on me as I attempt to remember some details of the previous night. But as usual, I’m drawing a blank. If I keep it up, then I wonder if one day my head will just be as empty as my heart. But on the bright side—my mother’s bright side—at least I’ll still have my beauty and that’s all that really matters.</p><p>Ethan</p><p>You know that point where you’re about to wake up, but you can’t quite seem to get your fucking eyelids to open so you get kind of stuck between being awake and asleep? Well, that’s pretty much where I’ve been for the last four years. I feel stuck. Trapped in the same place, unable to move. In a life I’m not sure I want, yet I can’t seem to figure out how to change it. I’ve felt differently only once and the person who brought the sunnier side out of me is no longer in my life. Although, sometimes Lila gets me close to breaking out of the daze, but in a different way, one based more on anger and sexual frustration than an actual deep emotion.</p><p>I even tried to escape the trapped feeling of my life once. I packed my shit and hit the road with no real destination other than to escape the trapped feelings that had been festering inside me for years. It wasn’t bad being alone on the road with no worries about where I was going, but what I learned quickly was that you can’t escape life, no matter how much you want to.</p> <p>I wake up to “Hey Ho” by the Lumineers. It’s the ringtone Lila picked out for herself, even though I told her it wasn’t my kind of music. She insisted that it was the perfect song choice for her, and I meant to change it but I forgot and now I just don’t care. In fact, it’s kind of growing on me, like her.</p><p>I run my hand over my face, rubbing the drowsiness away, and then reach for my phone on the nightstand beside my bed. I answer it and give Lila a hard time because it seems like it’s becoming a tradition. She calls me when she needs help, usually with a guy-related issue and either I listen to her complain about it or go bail her out from whatever situation she’s in.</p><p>It’s the third time she’s called me this month and it’s only halfway into November. She told me once, over way too many shots of Tequila—which always makes her dark alter ego come out—that she’d been like this since she was fourteen, never giving me an exact reason. Honestly, she seems to be going on a rapid downhill decline since Ella left, even taking a semester off of school, but I think that might have to do with money more than anything. But I’m worried she’s lonely or something. A lot of people can’t handle being alone, and I think Lila might be one of those people.</p><p>I remember the first time we had a real talk, back in Star Grove, where we first met. Our best friends had a thing for each other and we kind of met through them. During the first real time we spent together, we drank a bottle of Bacardi while my dad repainted her car that someone had spray-painted, talking about life, our weird views on casual, meaningless sex, and how at one point in our lives our parents treated us like shit, although Lila’s still do.</p><p>I’d been flirting with her the entire night, because that’s what I do and then Lila tried to get me to screw her. I’d declined since we were both trashed out of our minds and I have rules about having sex and being wasted. I have to be sober enough that I can remember the sex—and the girl. Plus, I don’t think of Lila like that. Well, I try not to anyway. I have had a few slip-ups, where I crossed the no-touching rule I made, but I always make sure to play it off as casually as I can, reminding myself that I have rules about relationships for a reason, to keep me out of relationships because I don’t want to end up like my mother and father. My father is always yelling at my mother and I’m always worried I’ll turn out like them—or him really. Getting emotionally involved with someone leads to an unhealthy, disastrous relationship, where someone will get broken. Take my mother and father. She got pregnant while they were dating, they got married, and twenty-five years later they’re still married and hate each other, although they’ll never admit it. Instead, my father yells and tells her how stupid and shitty she is all the time and my mother pretends that everything’s okay. That it’s normal for people to talk to each other like that.</p> <p>The only exception I ever made was with London, and after what happened with her I promised I’d never make an exception again because I never wanted to feel that much loss and guilt over losing someone again. But I really struggle with following the rules when it comes to Lila. I even had to add a no-touching rule that exclusively applied to her after I gave her candy canes last Christmas, about a year ago, when I tried to put my hands on and tongue in places they didn’t belong.</p><p>Sometimes it is hard to keep my hands off her, though, and I slip up. The girl is fucking gorgeous, in a model, Hollywood, way-too-perfect actress kind of way. She’s got flawless skin, perfect curves, her body proportioned just right. But she’s kind of high maintenance. The first time I took her to a pub, she refused to eat the food because she thought eating pub food was too gross and kind of beneath her high food standards, but she’s slowly progressing and I’ve even got her to eat ribs with her hands once, which was hilarious to watch.</p><p>After I get off the phone with Lila, I put away the bracelet London gave me and my journal, filled with pages of haunting memories and thoughts. I took both of them out of my dresser during a bout of depression last night, trying to find something that doesn’t really exist anymore, because I chose to walk away from it. Or maybe it never really did exist, yet I continue to hold on to it and allow it to haunt me, never talking to anyone about it because the idea of talking about London aloud seems impossible and almost like I’d finally be letting go of her and I’m not ready for that.</p><p>I get up and get dressed in jeans and a red T-shirt, then grab a five from my stash of money hidden in a box underneath my dresser. I work part time in construction and since my apartment is dirt cheap and I don’t really need anything else besides food, gas for my truck, and occasionally new clothes, I pretty much save everything I make. Tucking the five in my back pocket, I head out the door. I make a quick stop at the nearest Starbucks and use the five to splurge on getting Lila an iced latte because I know she loves them and it might help her with her hang-over. It’s early in the afternoon, but still warm. That’s Vegas for you, though. Even the fall seems like summer in most areas.</p><p>When I finally reach the corner of Vegas Drive and Rainbow, I park the truck where Lila’s lying down on the sidewalk with her legs stretched out into the road.</p><p>I hop out of the truck and shut the door. “What the fuck are you doing?” I ask, rounding the front of the truck with the iced latte in my hand. “Trying to get run over or something? Jesus, Lila.”</p> <p>She angles her head back and peers up at me. Her blue eyes are bloodshot, her mascara is smeared, and her blonde hair is all tangled. Usually she’s so put together, even when I pick her up the morning after, and it’s a little bit shocking to see her like this. Still, she’s beautiful as hell, but I’ll never admit that to anyone out loud.</p><p>“Is that for me?” Lila eyes the coffee, licking her lips.</p><p>I hand it to her and she guzzles it down, then pulls a face. “Did you have them put nonfat milk in this?”</p><p>I shake my head. Sometimes she can be so high maintenance. “No, I forgot your specific instructions, your highness, but you’re welcome for getting it for you.”</p><p>She glares at me. “Thank you,” she says with an attitude and then starts sipping on the drink again and I struggle not to ask questions about the condition she’s in, because I want to know what the hell happened to her and how she ended up here, looking like she does. “Don’t say anything,” she mutters, then gradually straightens her legs. She gets to her feet and brushes the sand off the backs of her legs. “I’ve had a rough morning as it is.”</p><p>“You mean a rough afternoon,” I correct her and then step back from the curb with my hands up in front of me when she targets me with a death glare. “Fine. Jesus, I’ll keep my mouth shut.”</p><p>“Good.” She walks toward the truck door, drinking from the straw and swaying her hips. I notice the back of her dress is unbuttoned all the way, so her smooth skin is exposed to the sunlight. God, if I didn’t have my rules I’d seriously bend her over and have her take it from behind. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I check her out for a little bit longer and then back up toward the driver’s side. “Why’s your dress undone?”</p><p>She shrugs, swinging her shoes in her hand. “I couldn’t get my fingers to work this morning.”</p><p>My lips threaten to turn upward into a full on smirk. “Why? Were they preoccupied too much last night or something?” I joke, and suddenly way too many images of her flood my head, her fingers sliding up her inner thigh and then slowly entering herself.</p><p>She jerks the door open, narrowing her eyes at me, and I add, “What? You’re the one who brought it up. If you don’t want me to tease you, then don’t set up the punch line.”</p> <p>Shaking her head, she presses her lips together and hops into the truck. She’ll be pissed off at me for, like, the next ten minutes, but then she’ll get over it. She always does.</p><p>After I get in the truck, I pull out onto the road and turn up the stereo. We barely speak the entire drive and when I pull into the parking lot of her apartment, I figure she’ll bail and then call me in a few days when she needs me to rescue her again.</p><p>But when she opens the door, she says, “So are you coming in or what?”</p><p>“I guess, if you really want me to.” It’s not like I have anywhere else to be. Micha, my best friend and old roommate, is gone and I don’t work on the weekends anymore. “But I’m not sleeping with you no matter how much you beg.”</p><p>“I never beg,” she says and then her face contorts with confusion as she frowns down at the ground. “At least from what I can remember I don’t.”</p> <p>I climb out of the truck and meet her around the front, aiming the keys over my shoulder to lock up the truck. We make our way across the parking lot beneath the heat of the sun and I pull my sunglasses down off my head to cover my eyes. I remain slightly behind her, checking out her ass and her lower back peeking out of her still-opened dress. Finally, I have to rip my gaze away and step up beside her, otherwise I’ll end up unable to keep my hands to myself.</p><p>“You need to stop blacking out when you get drunk,” I say, nudging her playfully with my shoulder. “Drunk is okay, but getting so shit-faced you have no idea what you’re doing is really fucking bad, Lila. Even I’m not that bad.”</p><p>“You’re not bad at all.” She attempts to smooth her hair down with her hand, but it only makes it stick up more. “You just pretend like you are. But deep down, you’re a really nice guy who likes to write in a journal.”</p><p>“Hey, I told you that in confidence.” I scowl at her as we make our way up the steps to her second-story apartment. “You were never supposed to utter that aloud.”</p><p>She pats her pockets for the keys. “Well, then you never should have told me because I kind of have a big mouth.” Her arms fall to her sides and her eyes scan around her feet and then down the steps behind her. “Crap, I think I lost my keys.”</p><p>“Okay... so go ask your landlord to unlock it for you. It’s not that complicated,” I say, shaking my head at her.</p> <p>“I can’t ask him.”</p><p>“Why not?” I lean on the railing, squinting against the sunlight as I assess her.</p><p>She lowers her chin, allowing her hair to fall in her face, like she doesn’t want me to see her expression. “Because... if I do... then he’ll ask me for rent.”</p><p>“Why?” I ask. “Are you behind on it or something?”</p><p>She peers up at me through her eyelashes. “I may or may not have paid the last couple of months,” she discloses, her forehead furrowing.</p><p>“Why? You’re not broke.” I hate to say it, but it’s kind of obvious by the fancy clothes she’s always wearing. Hell, she’s got a platinum ring on her finger, for God’s sake.</p><p>“But I am,” she insists, crossing her arms over her chest. “My dad canceled all my credit cards a while ago and I have only, like, eight hundred bucks left.”</p><p>“Then pay your rent with it.” I gape at her. “Or pawn that ring on your finger.”</p> <p>Shaking her head, she covers the ring on her hand, looking almost panicked. “No way. This was a gift from someone I used to know.”</p><p>“So you’d rather live on the streets than get rid of your gift?” I cock my eyebrow at her. “Really?”</p><p>“Yes, really,” she says simply, her arms falling to her sides.</p><p>I tighten my jaw, growing frustrated. “God damn it. You do this all the time, you know that. You need to start being more responsible...” My eyes widen. Holy fucking Jesus, I sound just like my father. Shit. He’s always lecturing my mom about her flaws. This is the reason why I don’t let myself get into relationships and I’m not in one with Lila, so why am I acting like this?</p><p>She laughs scathingly and jabs her finger against my chest. “Oh, and like you are. You get drunk and sleep around and work in construction.”</p><p>“Hey, I never claim to be responsible.” I lean in, lowering my voice, trying to shake off the feeling that I’m acting just like my dad. No, this is different. You’re trying to help her, not control her. “But I do work and pay my rent.”</p><p>She huffs, stomping her foot and crossing her arms. It’s not the first time I’ve witnessed her temper tantrums when I don’t give in to her, but it still gets on my nerves as bad as the first time I saw her do it. “Ethan, will you please just help me out?”</p><p>“How the fuck am I supposed to help you out?” I ask. “Pay your rent so you can get let in? Because I’m not doing that.” But a voice inside my head laughs at me, telling me I’m full of shit. That I would pay it for her if she asks, that I’d do anything for her if she flat out asked me to.</p><p>She sticks out her bottom lip and makes me soften just a little. “You can pick the lock,” she suggests, and when I start to frown, she grips the bottom of my shirt and clutches on to it. “Please, please, please. I’ll owe you big time.”</p><p>“You already owe me big time, for being a pain in the ass and calling me all the time to come pick you up from random guys’ houses,” I tell her, dragging my hand across my face. “And I don’t want you to owe me. I just want you to get a job or something so you won’t get kicked out of your apartment.”</p><p>“Okay, I’ll work on getting some cash.” She bats her damn eyelashes at me intentionally—I can tell because there’s a smirk forming at her lips.</p><p>Sighing, I stick out my hand. “Give me one of those pins in your hair.”</p><p>She releases my shirt, plucks a pin out of her hair, and hands it to me. Grunting and pretending I’m more annoyed than I really am, I bend down in front of the door and quickly pick the lock. When I shove the door open, she jumps up and down, clapping her hands.</p><p>“Thank you! Thank you! Thank you!” She throws her arms around my neck and embraces me tightly.</p><p>“Don’t thank me,” I tell her, uneasy and kind of turned on, something I always feel whenever she hugs me. Lila is off limits. She’s a friend. Just a friend. It’ll never work out. Relationships never work out. Look at the one that you had. “Just pay your damn rent and quit losing your keys.”</p><p>“Yes, boss.” She rushes into the house eagerly, leaving the door open behind her, and hurries toward the hallway. “I’m going to take a quick shower.”</p><p>“What the hell am I supposed to do?” I ask, standing in the entryway of her two-bedroom apartment, which is much nicer than mine: painted walls, a crack-free floor, and the carpet isn’t loose. “Sit around here and wait for you? Is that what you want me to do?”</p><p>“Don’t pretend like you’re totally not enjoying the idea.” She pauses at the corner of the hall and grins. “Besides, you could just come join me.”</p><p>I roll my eyes, suppressing a smile. “I’ve already told you a thousand times that you can’t handle me, baby.” I bite down on my tongue on the baby slipup. I don’t use endearing terms with women. Ever. My dad used to use them on my mom when he was trying to kiss up to her after he beat her and she’d always let him butter her up. It made me hate affectionate terms and affection in general.</p><p>She turns around and puts her hands on her hips, arching her eyebrows. “And vice versa.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh, I don’t doubt it,” I say, because I picture Lila as being extremely bossy and orderly in bed and I like women who get caught up in the moment, who love to do things without thinking about them first and who can completely and utterly let go of everything going on in the world. Who don’t care if they have money or material things. I like women who are like London. The problem is, she seems to be the only one of her kind and she no longer exists.</p><p>Lila laughs and I roll my eyes again, feigning annoyance. Then I chuckle when she sticks out her tongue and I have to bite on my own because the movement draws all my attention to her mouth. Despite the no-touching rule I made, I still can’t help but picture the many things I’d like her to do with her mouth that would require a lot of touching.</p><p>Once she vanishes down the hall, I get comfortable on the sofa and start channel surfing, but I can find only three channels and I wonder if she hasn’t paid her satellite bill either.</p><p>“Damn it, Lila,” I mutter and then take my phone out of my pocket. I think about just calling Micha and asking him to ask Ella, Lila’s best friend, to call Lila because she’s obviously gotten in over her head, but then it just seems weird and makes me seem like I’m scared of Ella, so I call her myself.</p> <p>She answers after two rings and I can tell from her tone of voice that she’s trying to figure out why I’m calling her. “Ethan?” she asks warily. “Is something wrong?”</p><p>“No,” I say. “Or maybe... I don’t know... it all kind of depends.”</p><p>“Depends on what?”</p><p>“On whether you’ve talked to Lila lately or not.”</p><p>“I haven’t heard from her in, like, a week,” she says. “I texted her the other day, asking her how she was, and she said she was fine.”</p> <p>“Well, I think she was lying to you.” I slump back in the sofa and something pokes me in the back. “Maybe you should call her.” I reach around behind my back and pull out an empty prescription bottle. The label’s ripped off so I can’t tell what it was for. I wouldn’t think anything of it, but I used to keep my drugs in something similar and it gets me wondering. No, there’s no way Lila would be doing drugs. She’s way too fucking preppy. I twist off the cap, glance inside, and then take a sniff. It doesn’t smell like anything I’m familiar with. Shaking my head, I put the lid on and toss it onto the table in front of me.</p><p>“I’ve actually really needed to call her,” Ella replies. “Because I’ve been meaning to tell her... something...”</p><p>“You’re being weird,” I point out, kicking my feet up on the table.</p><p>“Yeah, I know,” she admits. “But I’m being like that for a reason.”</p><p>“Well, if you have a reason then I guess we’re okay,” I joke sarcastically with a heavy sigh. Ella and I have always had this issue with each other, due to the fact that it always felt like she was interfering in Micha’s and my friendship. We’re not as bad as we used to be, but our clashing personalities will always sort of hinder us from being good friends. “Look, can you just call her and talk to her?”</p><p>“Is she there now?”</p> <p>“Yeah, but she’s in the shower.”</p><p>“And where are you?” There’s insinuation in her tone.</p><p>“Sitting on the couch.” I click the television off with the remote. “Where else would I be?”</p><p>“I don’t know.” She pauses and I know whatever she’s about to say is going to irritate me. “In the shower with her or watching her take one.”</p><p>“Well, I’m not,” I say dryly, more offended than I probably should be. “Look, just call her, okay? I’m going to go.”</p><p>“Fine,” she mutters. “God, you’re in a bad mood.”</p><p>I’m not sure who hangs up first, but we probably do it at the same time. I’m about to put my phone away when I get a text. I’m guessing it’s Micha, because I figure Ella went and told him that I was being a jerk, but I’m surprised to find that it’s from London’s mom, Rae. I haven’t talked to her in more than seven or eight months, around the time I decided to give a go at living my lonely wanderer dream, living my life to the fullest, mainly because Rae had called me and reminded me of everything that happened, the stuff I’ve tried to forget—the life I tried to forget, yet I always feel imprisoned by it. But when I hit the road, there was the whole Micha and Ella drama. Micha was boozing it up, going completely fucking crazy because he thought Ella cheated on him. I remember when I got the call from Lila telling me what was up.</p><p>“You need to go to New York, now,” she’d said.</p> <p>“Um, no thanks,” I’d replied. “I’m trying to escape people, not go to a city packed with way too many of them.”</p><p>“I don’t care what you want,” she said, sound like a spoiled brat, which she did a lot. Then she proceeded to tell me how Ella had told her, after multiple shots, that she’d only told Micha she’d cheated on him because she thought it was the only way he’d let her go. That he was too good for her and her insanity and deserved someone better.</p><p>As much as I agreed that Ella was insane, I didn’t think the two of them should split up. They have the kind of love that most people, including myself, will never understand or experience. I don’t think I even had it with London.</p><p>So I’d agreed to go to a city I hated, to help fix the problem and try to make things right between the two of them even though it wasn’t my responsibility. Why do I always try to fix things? I have no fucking clue other than it drives me crazy when other people are acting crazy when clearly they have it really good.</p><p>I slide my finger over my cell phone screen and read the text over.</p><p>Rae: I know we haven’t talked in a while, but I wanted to check up on you and see how you were doing.</p><p>That’s not the real reason why she’s texting and I know it. She wants the same thing she wanted from me seven or eight months ago.</p><p>Me: I’m fine.</p><p>Rae: Have you thought anymore about taking a trip to Virginia?</p><p>Me: Not sure I can.</p><p>Rae: Why not? You know it’d be good for both of you.</p><p>Me: No, it wouldn’t.</p><p>Rae: Please, I really need your help... London’s getting worse.</p><p>And there it is. The real reason she’s texting me. She wants hope. She needs to know that she’s doing everything right. And she wants me to give her the resolution. But I can’t because giving her false hope—going there and seeing London—means finally letting go. And I’m not sure I’m ready for that yet, whether I can allow myself to let go and fully accept reality. That what’s done is done and I have to let go and move on.</p><p>Me: You know it’s not going to do any good. It didn’t the last time I tried and from what you told me seven months ago, everything’s still the same with her as it was after the accident.</p><p>Rae: But I want to change that. If you’d just come visit her, you might be able to change it. You were so close to her when it happened.</p><p>No, I can’t. No one can. You know this—everyone does—and I don’t want to see what I lost. My finger hovers of the button as I deliberate what to type back to her.</p><p>“Oh my God, I feel so much better,” Lila says, tousling her wet hair with her fingers as she walks out of the hallway wearing only a towel. My jaw nearly hits the floor. It’s a really, really fucking short towel, one that gives me a view of her thighs and if she turned around, I could probably see the bottom of her ass.</p><p>“Is that a hand towel?” I ask, half joking, half serious.</p><p>“No,” she replies simply. She seems more relaxed and laid-back than when I picked her up. “Just a normal towel.”</p><p>I try not to stare as she sinks down on the sofa beside me. She doesn’t even bother trying to keep the towel closed and I get a glimpse of her thighs, which I’ve touched once so I know how soft her skin is. Just seeing them, I have to ball my hands into fists so that I’ll keep them to myself.</p><p>“I really needed to get last night off of me,” she says, shaking her hair out. It falls against her bare shoulders, sending beads of water trickling down her skin. “I felt so gross.”</p><p>“Is that why you were being so bitchy?” I stuff my phone into the pocket of my jeans. I need some time to think and process what she’s asking me to do and if I can finally do it, not to give her hope but to say my good-bye. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She shrugs, examining her fingernails. “I guess so,” she says nonchalantly, putting her hand on her lap. “Hey, do you want to go out tonight or something?” Lila smiles cheerfully at me as she relaxes back into the sofa, with her hair swept to the side. “Drinks are on me for being a pain in the butt.”</p><p>“I don’t think I can,” I say evasively. “Did you get a phone call from Ella by chance?”</p><p>Lila shakes her head and twirls a strand of her damp hair around her finger. “No, but I left my phone in my room, so maybe I missed a call.”</p><p>“You should call her.” I pat her bare leg, slipping up again on one of my rules that I set with her: no inappropriate touching.</p><p>I’m about to quickly pull away when she shudders under my touch and my muscles ravel as my palm presses against her warm, slightly damp skin. We both freeze and I swear to fucking God I can hear both of our hearts pounding insanely. This isn’t the first time that an awkward, intense moment has happened between us and I’m starting to think it won’t be the last. I know I should pull back, because it’s going to go somewhere beyond the friend zone if I don’t, but her breathing accelerates, her chest rapidly rising and falling, her breasts heaving up and down with her deep, ravenous breaths. My cock goes hard and the idea of touching her is so tempting. Suddenly, like my damn hand has a mind of its own, it’s slipping up her leg. Her skin is as soft as I remember. I knead my fingers into her thigh and she shudders again, her whole body quivering.</p><p>As my hand drifts higher up into the towel, my thoughts wandering to how it would feel if my fingers were inside of her. Fucking good, I’m sure. Way too fucking good. I could find out. I know she’d probably let me, but the fact that she would so easily makes me feel guilty. She lets just about everyone touch her, but not because she’s a slut. I don’t believe for one second that she is. There’s something hidden inside her that she’s trying to cover up with sex. I can see it in her eyes sometimes, when she gets really quiet. Sadness. Self-doubt. Self-torture, even.</p><p>She’s not like that now, though, seeming more content and subdued than anything. My hand lingers on the top of her thigh, my fingers brushing toward the inner section, which is even softer. I can feel warmth radiating off her and wetness. God damn it, she’s getting wet and I can feel it, which only makes me want to feel more. As my fingers make a path inward, just about to brush across her wetness, she grips down on the armrest and moans. Actually arches her neck, tips her head back, and fucking moans. My pulse hammers as my fingertips press down into her skin. Fuck.</p><p>“Ethan... God...” Her hair falls back from her shoulders, her chest bowing upward, and I nearly attack her with my lips, lick a path up her leg, slip my tongue inside her, something I’ve wanted to do since the first day I laid eyes on her.</p><p>My fingers dig deeper into her skin, as confliction settles inside me. Pull my hand back. Keep going. Somehow I manage to snap my thoughts away from my cock and swiftly pull my hand away. I can’t believe I screwed up again. I’ve always had my rules about fucking around with girls who I had any sort of feelings for.</p><p>I’m practically sweating as I get to my feet, digging my keys out of my pocket, hoping she doesn’t notice my cock bulging in my shorts. “I got a few things to do, but I’ll check up on you a little bit later.” I wait for her to say something about what just happened, that I almost stuck my fingers inside her, but all she does is frown up at me.</p><p>“You don’t need to check up on me.” She adjusts the bottom of the towel over her thighs, crosses her legs, and covers herself up a little. “I’m perfectly okay by myself.” She smiles at me but it looks fake.</p><p>I move for the door. “I’ll check up on you later,” I repeat, then open the door and step out into the sunlight, angry with myself for messing up and extremely angry at the part of me that wanted to mess up and throw my rules right out the window. I set them for a reason. To stop myself and others from getting hurt.</p><p>As I head to my truck, my phone beeps from inside my pocket. I retrieve it and check the screen. Rae again. I think about texting her back and telling her that I won’t go to Virginia. But part of me wants to see London again, even if she’s not the same London I fell in love with. I want to say good-bye, yet I don’t. And part of me wants to run back to Lila because for some reason, being around her makes me feel better. I’m so confused at this point as thoughts of both London and Lila clash in my head. Who do I hold on to? London? The girl who I thought I once loved? The girl I lost and will never get back? The girl I walked away from, just left to shoot up? The girl who I wanted to know more than anything, but I missed my chance? Or should I just let her go? Release my guilt of walking away from her that day, just like that. Go around fucking girls, living life, doing whatever I want? Deep down I know I should have never walked away from her that day and that if I’d stayed instead of thinking solely of myself then things might have been different today. Perhaps I’d still be with her.</p><p>I can’t let her go yet—can’t let go of my guilt. I should just be alone. It’s for the best.</p><p>I end up skipping on sending back a text to Rae, knowing that by doing so I’m allowing myself to continue to hold on to the idea of London and continue to think of Lila sitting up in her apartment in the hand towel at the same time.</p><p>My fucked-up thoughts are giving me a headache. “Shit,” I mutter, kicking the tire.</p><p>I really fucking need a drink. </p> </body></html>"]