["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>Death carried a sword and rode a tall black stallion. Shanara stared up at the figure on the horse, unable to stop the tremors that wracked her from head to foot. The rider's clothing matched the color of his mount—black boots, black trousers, black shirt, a black hooded cloak that hid most of his face. She glanced at the sword in his hand, the wicked-looking blade stained crimson with the blood of her kinfolk, and felt the bile rise in her throat. Would he now add her blood to that of her slain family?</p><p>With a choked cry, she scrambled to her feet and shook off her fear. She would not die in the dirt like some sniveling coward. She was Lady Shanara of the House of Montiori and she would die in a manner befitting her station.</p><p>\"Do it!\" she said defiantly. \"Strike me down and be done with it.\"</p> <p>\"Eager to die, are you?\" His voice was low and deep, tinged with a hint of wry humor.</p><p>She stared at him. How, in the name of Astur and Caleron, could he find amusement at a time like this? She glanced at the field of battle, the greening grass of spring made dark and ugly with the blood that had been spilled only moments before. There were bodies everywhere, limp, lifeless, like broken dolls cast aside by a careless hand. And somewhere, lying among the dead, were the bodies of her uncle and two of her cousins. For all she knew, the hooded man had killed them. If only she had stayed home where she belonged instead of coming here! But she'd had to get away from her father and her future, if only for a little while.</p><p>Death threw back his hood and ran a hand through his hair, hair as black as ten feet down. He studied her through eyes that were the cool deep blue of a midnight sea. His brows were straight and black, his jaw roughened by thick black bristles. A thin white scar ran from the outer edge of his right eye to the curve of his jaw. With the sun setting behind him, he reminded her of a demon rising from the smoldering pit of Hel.</p><p>In a lithe motion, he swung out of the saddle and walked toward her, arrogance in every step.</p><p>With no thought save to escape, she turned and ran.</p> <p>It was a foolish thing to do. Far better to stand her ground than to give him a reason to chase her, something no true predator could resist. Fear gave wings to her feet and she flew over the ground, her heart pounding in her chest, her breathing labored.</p><p>She gasped when she heard a noise behind her. It might have been a harsh laugh. It might have been a howl. Whatever it was, it fueled her fear and added impetus to her flight.</p><p>But like a hare trying to outrun a winter-starved wolf, there was no way to escape.</p><p>She screamed in fear and defiance when his arm snaked around her waist. His momentum carried them both to the ground, his body turning in midair and sliding under hers so that he took the brunt of the fall against his back. She landed on top of him, the air whooshing out of his lungs and hers.</p><p>His arms circled her body, as unyielding and confining as prison bars. Well and truly caught, she glared down at him.</p><p>\"Unhand me this instant!\" she demanded, her voice filled with a bravado she was far from feeling. \"I am Lady Shanara of the House of Montiori.\"</p> <p>An emotion she could not fathom showed in his eyes. A muscle clenched in his jaw. The arms imprisoning her grew tighter until she feared he might break her in two.</p><p>Breathless, she gazed down at him, all bravado gone as she prayed that her death would be swift, painless.</p><p>\"Why were you at Castle Dunhaven?\" Death demanded, his voice harsh.</p><p>\"Why did you attack us?\" She thought of her uncle's keep now lying in ruins, spoiled by this man and his barbarians. She wondered if her aunt Eugenia had survived the attack.</p><p>\"Why did your father kill mine?\"</p><p>She stared at him, her fear growing as his cold blue eyes raked over her. \"He... he didn't,\" she replied tremulously, though, for all she knew, it could be true. Her father was an austere, cruel man, one who loved and lived for the heat of battle, the clash of swords, the bloody smell of victory.</p><p>\"Did he not?\" Death asked, his expression as cold as winter in the high country. He shook her until her head snapped back. \"Did he not?\" he asked again, a tremor in his voice. \"He wears my father's pelt to warm him.\"</p><p>She looked at her captor in horror, realizing, too late, who it was who had seized her. Dread uncoiled deep within her. Now that she knew who he was, death in any form would have been a blessing. She knew her father would avenge her, not because of any great love for his youngest daughter, but because it would give him just cause for another war.</p> <p>Reyes drew in a deep breath, his rage dwindling as he grew increasingly aware of the slim female form pressing against his. Lifting his head, he sniffed her skin, his senses filling with the flowery scent of her perfume, the acrid stink of her fear. Her hair was not red and not brown, but something in between, reminding him of the rich earthy color of autumn leaves. Her eyes were the green of new grass, her skin a soft golden brown. She squirmed beneath his regard, making him acutely aware of her full breasts, of the fact that her body was cradled between his thighs.</p><p>He could have taken her there and then. It was his right. No one would dare dispute it. He had wrought the victory. It was his right to claim whatever or whoever he wished. But he did not want her writhing beneath him in fright, only in ecstasy. To his surprise, he discovered that he didn't want to take her by force or fear, not here, on the fringes of a bloody battlefield. Nay, far better to seduce her slowly and gently on a bed of soft furs by candlelight.</p><p>It amazed him that he wanted her at all, knowing that it had been her father who had butchered his. Rage burned anew when Reyes recalled how Luis Montiori had taken his father's rich black pelt and then had the gall not only to line a cloak with it, but to boast to any and all who would listen of what he had done. The memory of Montiori's treachery cooled his desire as effectively as if he had plunged into an icy lake, leaving only the simmering coals of hatred and the ashes of revenge.</p><p>Putting the woman away from him, he took a deep breath. Rising, he grabbed her by the arm and lifted her onto his horse's back. Heedless of the fear in the woman's eyes, ignoring the tears trickling down her cheeks, he vaulted up behind her, took up the reins, and turned his horse toward the misty mountains of home. His men, drunk with the wine of victory, gathered up the last of the spoils and fell in behind him, eager to return home to bed their wives and boast of their victory.</p><p>Chapter 2</p><p>Shanara had never been so afraid in her whole life. The arm around her waist was thick with muscle, unmoving, unyielding. Her back bumped against his chest from time to time. It, too, was hard and unyielding.</p><p>What was he going to do with her?</p><p>It was a question that plagued her on the long ride to his keep until, weary with fear and exhaustion, sleep claimed her.</p><p>Reyes felt the woman slump in his grasp. His arm tightened around her and he drew her closer, cradling her head against his chest, all too aware of her hips and thighs cradled between his. She was warm and soft in sleep. Once, she whimpered softly. He refused to be moved by it. Hardening his heart against her, he reminded himself that she was his prisoner and nothing more, a pawn in a dangerous game. He had sworn a blood oath to avenge his father's cruel death. It was a vow he would honor no matter what the cost. If her father refused to take her place in the dungeon, then Reyes would kill the girl and send her body back to Montiori a piece at a time.</p><p>The girl was still asleep when he drew rein for the night.</p><p>Holding her in his arms, he swung his right leg over his mount's withers and slid to the ground. Cradling her against him with one hand, he untied his bedroll from behind his saddle and spread the blankets on the ground for the girl. She murmured in her sleep when he put her down, but didn't awaken. He stared at her for a moment, then drew the covers up to her chin.</p><p>In a short time, fires were laid and food was being prepared. His men sat in small groups, sharing tales of old battles, or refighting the battle they had just won.</p><p>Reyes moved through the camp, taking time to speak to each of his men, commending them for their bravery, consoling the wounded, stopping to spend time with two of the men who he knew would not survive the night.</p><p>A short time later, the women arrived—a dozen whores and camp followers who made their living the best way they knew how. They followed him and his men whenever they rode out of the keep, setting up their gypsylike wagons on the outskirts of the camp.</p><p>Reyes allowed it because his men were, after all, red-blooded fighting men. Warriors all, after facing a day of battle where death might find them at any time, they had a need for a woman. It was more than the pleasures of the flesh that they sought. It was a reaffirmation of life. Sometimes he envied his men. Though tempted, he had never bedded any of the camp followers. He knew his men wondered why he never visited any of the wagons. Some thought he must be a eunuch, but he shrugged off such speculation as idle talk. He was not a man to indulge in meaningless copulation with a woman who was available to any man for the right price. If he mated, it would be for life. Cursed as he was, he dared not spill his seed wantonly.</p><p>He sought his bed when the fires burned low. The girl was sleeping soundly, one small hand tucked beneath her cheek, her lips slightly parted. He could see the shapely outline of her form beneath the thin blanket. He took a deep breath, drawing in the sweet scent of her skin and hair.</p><p> She is here. She is mine for the taking...</p><p>His body responded to the words moving through his mind.</p><p>Muttering an oath, he stalked into the darkness.</p><p>Shanara woke to the sound of rough male laughter and the smell of food cooking. Disoriented, she sat up, her gaze darting right and left. Where was she? And then it all came rushing back to her—the battle, the stink of blood and death borne on the early morning air, being captured by Reyes, who was known among her people as the Lord of Black Dragon Keep.</p><p>Where was he?</p><p>She saw no sign of him. Many of his men were gathered around a large campfire. She saw others moving back and forth between the wagons that surrounded the camp. No one seemed to be paying her any attention.</p><p>Taking a deep, calming breath, she threw back the covers, then gained her feet.</p><p>No one noticed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As causally as she could, she walked toward the water wagon and took a drink.</p><p>No one paid her any heed. Nor did anyone seem to notice when she took a knife from a sheath someone had carelessly left lying on the ground. Tucking the weapon into the pocket of her skirt, she turned away from the wagon and headed for the darkness beyond the camp, hoping that anyone who saw her would think she was one of the camp followers seeking a momentary bit of privacy.</p><p>Had anyone noticed her departure? She didn't dare look around, only kept walking, moving deeper into the shadowy darkness beneath the trees.</p><p>A capricious wind stirred the leaves.</p> <p>Far off in the distance, she heard the melancholy howl of a wolf.</p><p>Glancing upward, she reckoned her direction by the position of the moon. All she had to do was keep heading west. With any luck at all, she would make it to her brother's estate. Thomas was her oldest brother, and her favorite. He would take her in and give her shelter until her father came for her.</p><p>She ducked under a low branch, wondering how long it would take her to reach her brother's estate. She was hungry and weary and not at all certain how much farther she had to go.</p><p>With a sigh, she increased her stride. She could rest later. For now, she needed to put as much distance as possible between herself and the camp she had left behind. She had gone only a short way when she paused, a shiver of unease prickling her spine. Someone was watching her.</p><p>\"Who's there?\" she called softly. \"Show yourself.\" Delving into her pocket, she withdrew the knife and held it close to her side, hidden in the folds of her skirt.</p> <p>A rustle to the left drew her attention. Heart pounding with fear, she turned to see a giant of a man striding toward her.</p><p>\"So, missy,\" he said in a voice like rumbling thunder, \"what are you doing out here all by yourself?\"</p><p>She shook her head, her hand tightening on the knife even as she wondered if the weapon would do her any good against a man of his size.</p><p>\"Are you lost, girl?\"</p><p>She shook her head again.</p><p>\"Are you deaf, then?\" he asked, moving closer. \"Mute, perhaps?\"</p> <p>She took a step backward, her eyes widening as he began to unfasten his belt.</p><p>\"Lucky I am that I followed you out here,\" he said with a leer. \"I was getting tired of waiting my turn.\"</p><p>Shanara's heart plummeted to her toes. She had hoped anyone seeing her leave the camp would think she was one of the camp girls. Now she saw the error in her thinking.</p><p>She turned to ran, but he was too fast for her. One beefy hand closed on her shoulder. With a cry, she twisted in his grasp, the blade glinting in the moonlight as she raised her arm to strike.</p><p>Muttering an oath, he grabbed her wrist, his hand squeezing it until her fingers went numb and the knife tumbled from her grasp. In the next instant, she was flat on her back, held in place by his knee while he unfastened his trousers, then tossed her skirt over her head.</p><p>She screamed in terror and revulsion as he parted her thighs and she felt his skin against hers. Desperate to stop him, she pounded her fists against his head and shoulders, but he only laughed, one meaty hand holding both of hers over her head.</p><p>It was difficult to breathe with her heavy skirt covering her face. Her heart was pounding so rapidly she was certain she was going to faint. She prayed that she would faint before he defiled her.</p><p>Abruptly, his weight was gone.</p> <p>She heard a horrible shriek followed by an even more horrible gurgling sound, and then silence.</p><p>Afraid to look, afraid not to, she pulled her skirt away from her face and peered into the darkness.</p><p>A huge black wolf stood over the man's body. As if sensing her watching him, the wolf lifted its head. It stared at her through midnight-blue eyes. Blood dripped from its fangs and its tongue. The man's blood.</p><p>The wolf lifted its head. A howl rent the stillness of the night and then, amid a shimmer of moonlight, the wolf's form began to change, its thick pelt undulating, changing, until the wolf was gone and a tall man stood naked before her, his long black hair awash in the light of the moon, the scar on his cheek like a ribbon of silver.</p><p>It was the last thing she remembered before slipping into unconsciousness.</p><p>When she woke again, it was morning and she was lying on his blankets back at camp with no recollection of how she had got there.</p><p>The wagons were gone. Some of the men were eating breakfast, others were saddling their horses. There was no sign of Reyes.</p><p>She sat up as the memory of what had happened the night before returned. Surely she hadn't seen what she thought she had seen! She had heard the stories of the Reyes family, how they had been cursed by a witch to run with the wolves when the moon was full, but she had never believed such ludicrous tales. Men could not transform into wolves. It was impossible... yet how else to explain what she had seen last night, when the moon was full?</p><p>\"A dream,\" she murmured. \"It was naught but a bad dream.\"</p><p>And even as she spoke the words, she saw Reyes striding toward her, his long black hair falling over his shoulders, his dark blue eyes fixed on her face.</p><p>She suddenly recalled that the wolf's eyes had also been blue...</p><p>\"Get up, woman,\" he said gruffly. \"We ride at once.\"</p><p>When he reached for her arm, she scrambled to her feet and backed away. \"Touch me not!\"</p><p>\"I've no time for your nonsense,\" he said impatiently. \"We're leaving.\"</p><p>\"Please, let me go home.\"</p><p>\"All in good time,\" he replied, and taking hold of her hand, he dragged her to his horse, lifted her into the saddle, and vaulted up behind her.</p><p>They traveled all that day. She was grateful, at least, that they rode at the head of the column as the horses behind them stirred great clouds of dust.</p><p>They stopped once at noon to rest and water the horses and again a few hours later. She had expected they would make camp at dusk, but night fell and there was no sign that they were going to stop.</p><p>She sagged against Reyes, too exhausted to care that he was her enemy.</p><p>She didn't remember falling asleep, but she woke abruptly, a huge castle rising before her eyes. Reyes guided his horse across a narrow stone bridge that spanned a moat, and then under a portcullis. They passed through the main gate and then they were inside the inner courtyard. Servants ran to and fro, offering water and wine to the trail-weary warriors. Youths led the warhorses into the barns to look after them. Wives and children filled the yard, welcoming their husbands and fathers home.</p><p>Reyes took Shanara by the arm and led her up a winding staircase to the first floor and into the banqueting hall. Inside, he bade her sit down at one of the tables. At any other time, she would have argued, but she was too tired to offer any resistance, and too hungry.</p><p>She watched through heavy-lidded eyes as serving women hurried into the hall, laying out trays laden with meat and vegetables and baskets of crusty brown bread. Tankards filled with ale were set on the tables.</p><p>Stomach growling, Shanara filled a trencher with food, acutely conscious of Reyes sitting at the head of the table.</p><p>The room was soon filled with hungry men. Laughter and conversation rose on all sides as the women joined their men.</p><p>With the edge taken from her hunger, Shanara looked around the hall. It was an enormous room. A dozen long trestle tables were scattered down its center. A huge fireplace took up most of one wall, with a pair of crossed swords hanging over the mantel. A chandelier hung from the ceiling, and fresh rushes covered the floor. On the walls were tapestries depicting a variety of hunting and battle scenes.</p><p>But it was Reyes who drew her attention again and again. Clad all in black, he sat alone at the head of the table absently picking at his dinner while he watched the goings-on in the hall. He smiled as his men toasted him again and again, sharing stories of his bravery in battle, telling how he had ridden into the midst of a fierce skirmish to save one of his men.</p><p>She found it curious that he sat at the head of the table without female companionship.</p><p>She had no sooner finished her meal than a young woman clad in a long gray gown appeared at her side. \"Please come with me, my lady.\"</p><p>Shanara sent a glance in Reyes's direction, but he was paying her no attention. When the girl gave a gentle tug on the sleeve of Shanara's gown, Shanara rose and followed her from the hall.</p><p>The maid led her up a narrow winding stairway, down a long dark corridor, and into a large room where another, older woman, also clad in gray, waited.</p><p>Before she knew what was happening, Shanara found herself being undressed and urged into a large wooden tub filled with hot water. In spite of her protests that she was perfectly able to bathe herself, the women bathed her and washed her hair, then helped her out of the tub. They dried her off, anointed her with fragrant oil, wrapped a bit of toweling around her hair, then helped her into a long, loose-fitting gown of ice-blue velvet.</p><p>\"Sit here, my lady,\" the older one said, indicating she should sit on a low stool.</p><p>Knowing it was useless to argue, Shanara did as she was told.</p><p>\"Such beautiful hair,\" the woman said, removing the toweling. \"Like auburn silk.\"</p><p>\"Indeed,\" murmured her companion, a note of envy in her voice.</p><p>Shanara closed her eyes. She had always enjoyed having someone else brush her hair. The woman had gentle hands, and for a few moments, Shanara gave herself up to the luxury of being pampered, something she had sorely missed since her mother passed away.</p><p>\"Will there be anything else, my lady?\" the older woman asked.</p><p>\"Thank you, no.\"</p><p>Looking pleased with themselves, the two women bowed in her direction and then left the room.</p><p>Sitting there, Shanara took a good look at her surroundings. A large bed covered with furs stood between two arched windows that overlooked the courtyard. There was a large wooden chest at the foot of the bed, a square table and two chairs in one corner. A fire burned in the raised hearth, providing the room with heat and light. Another, smaller round table held a flagon of wine, a pair of goblets, a bowl of fruit, and a platter of assorted meats and cheeses.</p><p>She was thinking of pouring herself a glass of wine when she heard the sound of heavy footsteps outside the door. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 3</p><p>Reyes paused at the door to his bedchamber, his hand on the latch. Why had he sent the girl to his room? He had no intention of treating his captive as a guest or using her as a whore. She was only a pawn in a dangerous game of cat and mouse.</p><p>He closed his eyes, picturing Shanara Montiori in his mind: defiant green eyes set beneath soft brown brows, a fall of reddish-brown hair as thick as his own, skin smooth and unblemished.</p> <p>Reyes swore a vile oath, annoyed by the turn of his thoughts. She was the daughter of his enemy and he would do what he had vowed to do. He would keep her imprisoned while he waited to hear from Montiori, and when her father refused to take her place, as Reyes knew he surely would, Reyes would send her back to her father a piece at a time, until the coward agreed to surrender or to face him, one on one, in a battle to the death. No armies. No spectators. Just the two of them, alone.</p><p>He had ordered that she be bathed and attired in clean clothes because he could not, in good conscience, do otherwise. Now it was time to remember that she was his prisoner and treat her as such. He would personally escort her to the dungeon. He would demand that she write a letter to her father, telling Montiori of his terms, and then it was up to Montiori.</p><p>Filled with new resolve, Reyes opened the door and stepped inside, felt his breath catch in his throat as she turned away from the hearth to look at him, her eyes wide and startled, like a doe sensing danger. The velvet gown hugged a figure any man would kill to possess. The light from the fire danced in her hair and caressed her cheek.</p><p>Clearing his throat, he closed the door behind him.</p><p>She took a step backward and then, as though thinking better of it, she drew herself up to her full height. And waited.</p> <p>And he did what he had been wanting to do from the moment he first saw her. Walking purposefully across the room, he pulled her into his arms and kissed her. He had expected her lips to be sweet, but he hadn't expected the sudden heat that flowed through him. It wasn't just the heat of desire, or the normal longing of a man for a woman. No, it was more than that, a feeling he didn't understand, one he had never known before.</p><p>Forcing himself to let her go, she stared up at him, her eyes filled with confusion. He had to get her out of here, now, he thought, before he drew her down on the bed, removed her gown, and explored the lush curves that lay beneath.</p><p>\"Follow me,\" he said curtly, and before he could change his mind, he opened the door and stepped into the corridor.</p><p>After a moment's hesitation, she followed him.</p><p>Wordlessly, he led her through the keep and down the winding stone steps that led to the dungeon.</p><p>It was a cold and dismal place, lit by torches. He heard the scurrying of rats as he opened the door to the first cell and motioned the girl inside.</p> <p>Without looking at him, she entered the cell, her head high.</p><p>He locked the door and pocketed the key. \"My steward will bring you paper and quill in the morning. You are to write to your father and tell him of your circumstances. Tell him if he wishes to see you again, he will take your place here. If not...\" He almost choked on the words. \"Your life will be forfeit.\"</p><p>\"He will never agree,\" she said.</p><p>\"You had best hope he does,\" Reyes replied. And then, unable to face her any longer, he turned and left the dungeon.</p><p>Shoulders slumping in defeat, Shanara looked at her surroundings. The floor and the walls were of damp gray stone. There was a straw tick and a ragged blanket on the floor in the corner, both of which were no doubt crawling with vermin. A vile odor rose from the slop jar in the corner.</p><p>Despite her determination not to cry, hot tears burned her eyes and dripped down her cheeks. Her father would never sacrifice himself for her. He had five strong sons and three other daughters. His youngest daughter was of little value. She doubted he even remembered her name or was aware of her absence from the keep.</p><p>If only her mother were still alive, but Elene had died last year, struggling to give her husband yet another child.</p><p>Shanara whirled around as she heard a scrabbling noise behind her, a cry of alarm rising in her throat as a large black rat crawled out from under the straw tick. Picking up her skirts, Shanara retreated to the far corner of the small cell, her back pressed against the damp wall.</p> <p>Despair settled on her shoulders like a shroud. She was going to die here, in this horrid little cell. The rats would eat her flesh, and no one would care...</p><p>She pressed her fingertips to her lips. Why had Reyes kissed her, then thrust her aside? She would not have been surprised if he had forced himself upon her, but the fact that he had pushed her away surprised her a great deal.</p><p>But it didn't matter now. Nothing mattered now.</p><p>Reyes sat in front of the hearth, his fingers drumming on the arm of his chair. Six days had passed since he had locked Montiori's daughter in the dungeon. He hadn't had a decent night's sleep since. Every time he closed his eyes, he imagined her sitting in that damned dismal cell with nothing to do but stare at the bars that imprisoned her. He imagined her horror at sleeping on a stained tick on the cold floor. He shied away at the thought of rats sharing her cell. His only concession had been to see that she received nourishing meals. Meals she had, thus far, refused to eat. Perhaps he was being too cruel. Perhaps he would tell Rolf to put a bed in her cell...</p><p>\"No!\" She was the enemy. No matter that she was young and more beautiful than any woman he had ever seen. He could not think of her as a woman. She was a means to an end, no more, no less.</p><p>He looked up as his steward entered the room. \"Did she write the letter?\"</p><p>\"Yes, sire.\" Rolf handed him a piece of rolled parchment.</p><p>Reyes read it quickly. As he had instructed, she told her father that she had been taken captive by Lord Reyes and that her life would be forfeit if Montiori did not comply with his wishes before the next full moon.</p><p>\"Shall I send the missive?\"</p><p>\"Yes. Have Mergrid take it. Tell him to wait for an answer.\"</p><p>\"Yes, my lord.\"</p><p>\"Is there something else?\" Reyes asked.</p><p>\"She still refuses to eat.\"</p><p>Reyes nodded, then dismissed Rolf with a wave of his hand.</p><p>Rolf bowed from the waist, then left the hall.</p><p>Reyes swore. He had ordered his cooks to prepare dishes to tempt a lady's taste, but to no avail. For the last six days, every tray had been returned, untouched. He took small comfort in the fact that she drank the water if not the wine.</p><p>Gaining his feet, Reyes paced the floor. She was the enemy. It should make no difference whether she supped or not. He swore under his breath. She was only a woman. When she got hungry enough, she would eat.</p><p>It was the same thought that crossed his mind later that night when he sat at the table, his plate piled high with fresh venison and an assortment of side dishes.</p><p>Muttering an oath, he grabbed a plate, filled it with meat and vegetables, and then made his way to the dungeon. She would be of no use in a trade if she starved herself to death. A harsh laugh escaped his lips. No doubt that was her intent.</p><p>He opened the door that led to the dungeon, grimaced at the stink of waste and decay that fouled his nostrils. Who could eat in a place like this? He thrust the thought from his mind as he descended the stairs and walked down the corridor that led to her cell.</p><p>She was standing in the corner farthest away from the straw tick.</p><p>His heart clenched when she turned to look at him. There were dark shadows under her eyes, her cheeks looked sunken, her skin pale. Her eyes were dull and filled with resignation.</p><p>\"I've brought your supper,\" he said, his voice gruff.</p><p>She gestured at the straw tick. A large gray rat with beady black eyes looked up at him, a bit of potato in its jaws.</p><p>A vile oath erupted from Reyes's throat. Tossing the tray in his hands aside, he pulled a key from his pocket and unlocked the cell door. The girl let out a wordless cry as he grabbed her by the arm and dragged her out of the dungeon and up the stairs to the second floor. He opened the door to one of the vacant bedchambers, pushed her inside, and locked the door.</p><p>Striding to the head of the stairs, he looked over the railing at the servants milling below.</p><p>\"Alyce! Beatrice! Attend me immediately.\"</p><p>In moments, the two maids were there, awaiting his orders.</p><p>\"There is a woman in the room next to mine,\" he said, thrusting the key into Beatrice's hand. \"Clean her up and bring her something to eat.\"</p><p>Beatrice curtsied. \"Yes, my lord,\" she said, and hurried away.</p><p>\"As you wish, my lord,\" the younger one replied with a saucy smile.</p><p>She was a pretty thing, was Alyce, with her curly brown hair and guileless blue eyes. He dismissed her with a wave of his hand, then returned to the hall and his own dinner, but food no longer held any appeal.</p><p>Late that night, he prowled the castle until, too restless to remain inside its walls, he left the keep by way of a secret passageway that emerged in the side yard. Under cover of darkness he shed his clothing, then surrendered to the beast within him, his body shifting, his bones popping and cracking as they took on a new shape.</p><p>Shanara stood at the window, her heart pounding. Surely she could not be seeing what she was seeing. But even as she watched, the man in the yard below cast off his clothing, and his body began changing, stretching, until, impossible as it was to believe, a large black wolf stood in his place.</p><p>She jerked away from the window when the wolf lifted its head. Had he seen her? She shivered as a howl rose on the midnight wind.</p><p>When she looked out the window again, the wolf was gone.</p><p>So, she had not been dreaming the last time. All the stories were true. Everything she had heard about Reyes was true. She had been afraid of him before, but not like this. It was one thing to be held prisoner by one's enemy, something else entirely when your enemy wasn't human.</p><p>She couldn't stay here any longer, clinging to the slim hope that her father would rescue her. Montiori would never agree to take her place. Still, he might consider the killing of his brother and the abduction of one of his daughters reason enough to attack Reyes.</p><p>But whether her father came for her or not, her life would be lost one way or another. If her father refused to take her place, she would be killed. If war came, her fate would be the same. Her father would not barter for her life. Alive or dead, she would be nothing but an excuse for another battle, another war. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She moved around the room, looking for anything she could use, either as a weapon or as a way to break the lock on the door.</p><p>She was about to give up hope when she saw the handle of a knife protruding from under the napkin on her dinner tray. A tray that should have been picked up hours ago. Using the tip of the blade, she pried at the lock on the door.</p><p>It gave with a soft click. Slipping the knife into the pocket of her gown, she tiptoed out of the room.</p> <p>Chapter 4</p><p>He ran through the night, every sense aware of his surroundings. He knew there was a deer hiding in the trees behind him, that another wolf had made a kill. He smelled the blood in the air. The earth was damp beneath the sensitive pads of his feet as he ran tirelessly through the darkness.</p><p>Freedom. It sang through his veins. He was no longer the lord of a great castle, no longer responsible for hundreds of lives. The woes and wars of mankind meant nothing to the wolf.</p><p>There was only freedom and the urge to hunt.</p><p>A rabbit sprang out from behind a bush. He chased it down; grabbing it in his jaws, he devoured it in a few bites.</p> <p>The kill satisfied the urge to hunt, stilled the restlessness in his soul. What would it be like to succumb fully to the wolf, to turn his back on mankind and live in the wild? Even as the thought tempted him, the image of a green-eyed woman rose in his mind, luring him back toward the keep.</p><p>He had to see her one more time.</p><p>He was halfway back to the castle when a dark gray shape materialized out of the shadows and padded silently toward him.</p><p>Reyes came to an abrupt halt when the other wolf growled, its hackles rising as it bared its teeth.</p><p>Reyes sniffed the air and immediately recognized the scent of the other wolf. They had met before. On other occasions, Reyes had backed down. But not tonight. Tonight, the image of a green-eyed woman tormented him, a woman who filled him with a yearning he dared not indulge. Tonight a fight was just what he needed to ease his frustration.</p><p>He bared his own teeth as the gray wolf walked stiff-legged toward him. Reyes was aware of other wolves nearby. He felt the weight of their eyes watching him.</p> <p>The gray wolf attacked without warning, burying its fangs deep in Reyes's shoulder. Reyes howled, the pain slicing through him like the cut of a knife.</p><p>Shaking off the gray, Reyes whirled around and charged, his own teeth leaving bloody furrows along the other wolf's hindquarters.</p><p>Backing off, they faced each other and then the gray wolf lunged forward. Reyes dodged his attack, his teeth savaging the gray's neck.</p><p>They met again, and yet again. Reyes was confident of victory until he lost his footing on the damp leaves. The gray wolf was on him in an instant, his teeth slashing at Reyes's neck and shoulder.</p><p>Knowing it was only a matter of time before the rest of the pack came to finish him off, Reyes fought back as best he could. And then, abruptly, the gray wolf let him go and backed off. Moments later, the pack had disappeared into the darkness.</p><p>Reyes lay there, panting heavily, wondering why the other wolf had broken off the attack.</p><p>And then he heard the sound of footsteps moving in the underbrush. Had it been a deer, the wolves would have attacked, but in spite of tales to the contrary, wolves rarely attacked humans.</p><p>Shanara darted behind a tree, one hand covering her mouth to stifle a gasp. The foolhardiness of leaving the castle struck home as she watched half a dozen dark shapes disappear into the underbrush. What was she doing out here, armed with nothing but a knife?</p> <p>She shook off her fears. Better to die trying to escape than wait like a lamb for the slaughter! She was about to continue when she realized that what she thought was a shadow on the ground was, in reality, another wolf. Was it dead? Wounded wolves were doubly dangerous.</p><p>Just when she was certain she had nothing to fear, it struggled to its feet, whining softly.</p><p>Pity welled in her heart as the beast stood there, head hanging, tongue lolling. Blood soaked its shoulder, dripped from its neck.</p><p>Her heart seemed to stop beating when it lifted its head and looked at her through eyes dark with pain. Midnight-blue eyes.</p><p>\"Reyes.\" His name whispered past her lips. Hardly aware of what she was doing, she moved toward him, stopping only when he bared his teeth. \"You need help.\" Even as she spoke the words, she wondered if he understood her. \"You're bleeding.\"</p><p>He growled softly and she took a step backward. Would he kill her for trying to help him? She felt a bubble of hysterical laughter rise inside her. What difference did it make if he drove a sword through her heart or savaged her with his teeth? One way or another, he intended to kill her, making her wonder why she had ever thought to help him. He was her enemy, as she was his.</p><p>He took a step forward, fell heavily as his wounded leg refused to support him.</p><p>More fool she, she had always had a soft spot for wounded animals... but this was no animal. \"Can you walk if I help you?\"</p><p>He let out a soft bark which she took to mean \"yes.\" Slipping her arm under him, she helped him stand.</p><p>\"What shall we do now?\" she wondered aloud. \" 'Tis a long walk back to the castle.\"</p><p>The wolf shook his head and started walking, not toward the castle, but deeper into the woods. Stooped over, she walked beside him, supporting him as best she could. No easy task, as heavy as he was.</p><p>Finally, after what seemed like hours, she saw a small stone cottage through a clearing in the trees.</p><p>The wolf was panting heavily by the time they reached the cottage. Shanara opened the door, waited for him to enter, then stepped inside and closed the door behind her.</p><p>When she looked at the wolf again, she saw that he had collapsed on the floor.</p><p>She searched the darkened room until she found a candle and a flint on the mantel. Lighting the candle, she glanced around the one-room cottage. Did it belong to Reyes? She moved about the room, looking into the cupboards, which were stocked with a few foodstuffs—sugar, flour, salt, a box of dried venison, as well as pots and pans, pewter plates and goblets and cutlery. A square table and three chairs stood against one wall, a narrow bed against another. A small box held an assortment of bandages and liniment, as well as a sharp knife, a needle, and sturdy thread.</p><p>After laying out the supplies on the table, she went outside and filled a bucket with water from the well, then went back into the cottage, hoping the wolf hadn't bled to death in her absence.</p><p>Reyes lay on his side, his eyes closed, his nostrils filling with the scent of his own blood. He had been injured in the past, but never this badly. Blood leaked from the cut in his neck, the deep gash in his shoulder, leaching away his strength.</p><p>He opened his eyes when he heard the woman approach, watched warily as she knelt beside him. Dipping a bit of cloth in a bucket, she washed the blood from his neck and shoulder. She threaded a needle with a long piece of thread and then, biting down on a corner of her lower lip, she began to stitch his wounds.</p><p>He whined softly as the needle pierced his flesh. If he'd had the strength to regain his human form, he could have dulled the pain with a glass of ale. In his wolf form, all he could do was endure it.</p><p>She worked quickly. From time to time she spoke to him, soft words of reassurance. Steeped in pain, he clung to the sound of her voice.</p><p>\"There.\" Laying the needle aside, she stroked his head. \" 'Tis done.\"</p><p>He licked her hand, then closed his eyes and slept.</p><p>Shanara stared at her hand, startled, and then laughed softly. No doubt it was just the wolf's way of saying thank you.</p><p>Still bemused by her reasons for helping him, she put the needle in the box and replaced it in the cupboard. Finding an old rag, she wiped the blood from the floor, then pulled a blanket from the cot and spread it over the wolf.</p><p>Feeling suddenly weak from all that had transpired that night, she dropped into one of the chairs and wrapped her arms around her waist. She was hungry and tired, so tired. She glanced at the cot against the wall, thinking how good it would feel to lie down and sleep for a few hours. And then she looked at the door. This would be the perfect time to get away from him.</p><p>And that was just what she would do. Going to the cupboard, she pulled out several pieces of dried venison. She put all but one in her skirt pocket and moved toward the door.</p><p>She stood there with her hand on the latch, unable to make herself walk out the door. It was true that Reyes had killed her uncle and her cousins and kidnapped her, but it was also true that he had saved her from being ravished by one of his own men. She couldn't leave him, not now, when he was hurt.</p><p>Turning away from the door, she went to the cot and sat down, her gaze resting on the wolf while she ate the dried venison. Then, with a sigh, she slid beneath the blankets, asleep as soon as her head touched the pillow.</p><p>Reyes opened his eyes, awakened by a shaft of golden sunlight filtering through the cottage's single window. He drew a deep breath and his nostrils filled with the scent of the woman. Was she still here?</p><p>Turning his head, he saw her curled up on the cot. She had tended his wounds last night. Even now, he found it hard to believe, not only because they were enemies, but because he had been in his wolf form. Why had she helped him? He had done nothing to incur either her friendship or her concern, yet she had stitched his cuts and covered him with a blanket. He grinned wryly, wondering which of them would be the most grateful for that this morning.</p><p>Sitting up, he ran a hand over his neck and shoulder, remembering how gently she had washed the blood from his wounds, the compassion in her voice as she sewed the gash in his neck and shoulder.</p><p>His stomach growled, reminding him that he had not eaten since the night before, and not much then, since his mind had been on the woman instead of the meal.</p><p>Rising, he wrapped the blanket around his waist, then rummaged through the cupboard until he found a few strips of dried venison. He ate three pieces, then, grabbing a cast-iron pot, he went outside to fill the container. Returning to the cottage, he lit a fire in the hearth, hung the pot from the tripod to heat.</p><p>His gaze returned to the woman. Her hair fell over her shoulders like a waterfall of auburn silk. He sucked in a deep breath as he remembered the feel of it against his cheek, the flowery fragrance that clung to each strand.</p><p>Why hadn't she left last night? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He noticed the soft curve of her cheek, the slender line of her throat, the arch of her brows, the swell of her breasts beneath the blanket.</p><p>The woman stirred, but didn't awaken.</p><p>Desire stirred within him. She was here. She was his to do with as he pleased. The words whispered through his mind, urging him to take her, willing or not.</p> <p>It was tempting, so very tempting. Had she not come to his aid the night before, he might have surrendered to the longing that burned through him, but she had not only helped him, she had stayed with him through the night. He could not repay her kindness by forcing himself on her.</p><p>Lost in thought, it took him a moment to realize she was awake and staring at him, the look in her eyes telling him that she knew every lustful thought that had crossed his mind.</p><p>\"Good morrow,\" he said, his voice gruff.</p><p>She nodded, her gaze moving over his bare chest and the blanket tightly wrapped around his waist.</p><p>\"Thank you for tending my wounds.\"</p> <p>\"You're welcome,\" she murmured.</p><p>\"How did you get past the gates last night?\"</p><p>She stared at him. Was he so foolish as to think she would tell him?</p><p>Reyes nodded. \"Why did you not leave here when you had the chance?\"</p><p>Her gaze slid away from his. \"I know not.\"</p><p>\"You should have gone when you had the chance,\" he said curtly.</p> <p>She looked up at him, a glimmer of hope in her eyes. \"You could let me go now.\"</p><p>\"No, I cannot.\" He gestured toward the hearth. \"There is hot water if you wish to bathe.\"</p><p>She nodded, but made no move to get up.</p><p>Grunting softly, Reyes left the cottage.</p><p>Throwing back the covers, Shanara slid her legs over the edge of the cot. Did she dare bathe with him prowling the grounds outside?</p><p>Keeping one eye on the door, she found a chunk of soap and a piece of toweling. Moving quickly, she washed her hands and face, then removed her stockings to wash her legs. She was drying her feet when he knocked on the door.</p><p>\"Nay, do not enter!\" she cried, her heart pounding at the thought of him seeing her bare legs.</p><p>Moving quickly, she finished drying her feet, then drew on her stockings and shoes, smoothed her skirt, ran a hand through her hair.</p> <p>He knocked on the door again.</p><p>Shanara took a deep, calming breath, then called, \"Enter.\"</p><p>Reyes stepped into the room and moved toward the hearth.</p><p>Shanara's eyes widened as he reached for the cloth she had used. \"Do you mean to bathe?\"</p><p>\"Aye.\"</p><p>\"I will wait outside.\"</p><p>\"No.\"</p><p>She stared at him, speechless. \"You cannot expect me to stay while you wash!\" she exclaimed in horror.</p><p>\"And how long would you remain if I let you but of my sight?\"</p><p>The rush of color in her cheeks was all the answer he needed.</p><p>When he reached for the soap, she quickly turned her back to him, her arms crossed over her breasts.</p><p>Grinning, Reyes dropped the blanket.</p><p>Shanara stared at the wall, trying not to listen as he washed, trying not to imagine how he looked without the blanket. She knew it was shameless of her, but she couldn't seem to help herself. Having five brothers, she was no stranger to naked men or the male body, but Reyes was not kin and, truth be told, none of her brothers was as tall as her captor, nor did any of them have shoulders as broad. Certainly none were as handsome...</p><p>She shook the thought aside. The man was her enemy. He was keeping her against her will, hoping to trade her life for her father's, and though she had little love for her father, he deserved her loyalty.</p><p>\"Let's go, lass.\"</p><p>\"Are you decent?\"</p><p>\"Not always, but I am covered.\"</p><p>She turned to find he had wrapped the blanket around his waist and tied it in place with a leather thong.</p><p>\"Do you often find yourself naked in the woods?\" she asked, then clapped her hand over her mouth, her cheeks burning with embarrassment.</p><p>\"Not often.\" Opening the door, he waited for her to cross the threshold, then followed her outside, closing the door behind him.</p><p>They walked for a time in silence. Shanara was acutely conscious of the man at her side. He towered over her. Bare-chested and barefooted, he looked more like a barbarian than ever. His skin was very brown. Dark bristles shadowed his jaw. His wounds looked red and painful. In truth, she was surprised that he was on his feet at all.</p><p>From time to time she could feel his eyes on her, as tangible as a touch. What was he thinking? She shivered, wondering what he would do to her when her father refused to take her place.</p><p>She slid a furtive glance in his direction, her mind filling with questions.</p><p>\"What is it?\" he asked gruffly.</p><p>\"Nothing.\"</p><p>He made a dismissive gesture with his hand. \" 'Tis obvious you want to ask me something. Ask it.\"</p><p>\"How long have you been cursed?\"</p><p>\"Since I reached manhood.\"</p><p>\"Were you frightened, the first time it came upon you?\"</p><p>\"Aye.\"</p><p>\"Does it hurt? I saw you one night, from the window. It looked...\" She shivered, unable to find the words to describe what she had seen.</p><p>\"It hurts,\" he admitted quietly. \"Every time.\"</p><p>\"And you have no control over it?\"</p><p>\"Some, but very little when the moon is full.\"</p><p>\"What does it feel like, to be a wolf?\"</p><p>He looked down at her. \"Like nothing you can imagine. Everything is magnified. Sounds. Smells. I can hear a leaf falling from a tree, see clearly in the darkness, run for miles and miles...\"</p><p>\"It rather sounds as if you like it.\"</p><p>\"In some ways, I do.\"</p><p>\"Can you change at will?\"</p><p>\"Aye.\"</p><p>\"And if you have a son, will he be accursed, as well?\"</p><p>He nodded curtly.</p><p>\"Why was your father cursed in this way?\"</p><p>\"He angered your father's witch,\" he said, his voice bitter.</p><p>\"Do you mean Melena?\"</p><p>Reyes nodded. \"In return, she decreed that all males in my father's line would be cursed to run with the wolves when the moon is full.\"</p><p>\"I find that hard to believe. She has ever been kind to me. What did your father do that made her so angry?\"</p><p>\"He was a handsome man, my father. She wanted a son and wished for him to sire it. When he refused to betray my mother, Melena set a curse upon him.\"</p><p>\"Did your father try to break the spell?\"</p><p>\"Aye. My father went to Melena and pleaded with her to release him. But she refused. A year later, after my mother had conceived, my father went to Montiori and begged him to order Melena to break the spell. Your father promised he would do so, but first he wanted to see my father undergo the change. My father agreed. During the next full moon, he went to your father's keep, and when the moon rose, he transformed into a wolf. And your father killed him.\"</p><p>She fell silent, thinking of what Reyes had told her. It explained why he was not married. What woman would marry a man knowing that her sons would inherit the same dreadful affliction?</p><p>\"Why did your father have to wait for the full moon? Could he not change at will?\"</p><p>\"No, though I do not know why.\" He shrugged. \"Perhaps the curse gets stronger with time.\"</p><p>Though the day was cool, a fine sheen of sweat covered Reyes's face and chest. His steps had slowed. His skin was hot when her arm brushed against his.</p><p>\"You've a fever,\" she said.</p><p>He nodded.</p><p>\"You should rest.\"</p><p>He glanced at her, bemused by her concern. Would she care whether he lived or died if she knew what he had planned for her? \"The keep is just over that rise,\" he said. \"I'll rest there.\"</p><p>She didn't argue. If he fainted along the way, so much the better for her. It would give her yet another chance to try to escape.</p><p>But he didn't faint.</p><p>They were nearing the crest of the hill when a dozen riders appeared. The men halted a short distance away.</p><p>\"My lord!\" one of them called. \"We have been searching for you since daybreak.\"</p><p>The man closest to them dismounted. \"Here, my lord, take my horse.\"</p><p>With a nod, Reyes put his foot in the stirrup. He took a deep breath, then swung his leg over the saddle. \"Bring the woman.\" Clucking to the horse, he rode toward the castle.</p><p>The rider who had given Reyes his mount lifted Shanara onto the back of one of the other horses. The knights followed their lord back to the castle. The riderless knight ran behind them.</p><p>Shanara let out a sigh as they rode through the gates into the keep. She was his prisoner yet again.</p><p>Chapter 5</p><p>Shanara followed one of Reyes's men up the stairs. He showed her to a room where the two gray-clad women who had looked after her before awaited. She frowned, trying to remember their names. Beatrice and Alyce, if she recalled aright. In less time than she would have thought possible, the maids had removed her clothing, washed her from neck to heel, and then wrapped her in a towel.</p><p>\"Now,\" said Beatrice, tapping her foot. \"What shall she wear?\"</p><p>\"The mauve velvet,\" said Alyce.</p><p>Beatrice shook her head. She was the elder of the two, with brown hair, gray eyes, and a sweet, motherly face. \"Nay, Alyce, the green silk. It matches her eyes, and you know it is Lord Reyes's favorite color.\"</p><p>\"Then I shall wear the mauve,\" Shanara decided. She had not missed the smirk on Alyce's face.</p><p>\"Will you not reconsider?\" Beatrice asked hopefully. She ran her hand over the green silk. \" 'Tis a lovely gown.\"</p><p>Shanara shook her head. \"The mauve.\"</p><p>With a sigh of resignation, Beatrice helped Shanara into the mauve gown. She brushed Shanara's hair until it gleamed, then swept it away from her face with a pair of jeweled combs.</p><p>\"You look lovely,\" Beatrice declared. \"Does she not, Alyce?\"</p><p>The younger woman nodded sullenly.</p><p>\"Come along,\" Beatrice said, and Shanara followed her down the corridor to a door she recognized all too well. It led to his bedchamber. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With a smile, Beatrice opened the door. When Shanara didn't move, the woman gave her a little push, then shut the door behind her.</p><p>The room was dark and smelled of candle wax and herbs. A fire blazed in the hearth. She took a step toward the huge four-poster bed in the center of the room.</p><p>Reyes lay under a mound of heavy blankets. As she drew nearer, she could hear the sound of his labored breathing. His brow was covered with perspiration.</p> <p>Moving to his bedside, she called his name.</p><p>He stirred restlessly at the sound of her voice.</p><p>Shanara laid her hand on his shoulder. His skin was hot. Now that she was close, she could see that the wound in his arm was discolored and swollen. He groaned when she ran her fingertips over the wound.</p><p>Leaving the room, she went down to the kitchen. The cook looked up, startled to find a stranger in her domain.</p><p>\"I need some hot water,\" Shanara said, \"and a pot of strong willowbark tea. I also need a poultice to draw poison from a wound, a sharp knife, and a needle and thread.\"</p> <p>\"Who are you to give me orders in my own kitchen?\" the cook demanded, waving a big wooden spoon in Shanara's face. \"Begone from my kitchen this instant!\"</p><p>Holding her ground, Shanara drew herself up to her full height. \"If you refuse to do as I ask and Lord Reyes surrenders to the fever burning within him, his death will be upon your head.\"</p><p>The cook's eyes widened, then, without another word, she began to fill a clean pot with water.</p><p>Certain her orders would be obeyed, Shanara returned to Reyes's bedchamber. Crossing the room, she threw open one of the windows, then dragged all but one of the blankets off the bed.</p><p>It took her a moment to realize he was awake and watching her through narrowed eyes.</p><p>Filling a glass with water, Shanara lifted Reyes's head and offered him a drink. \"Slowly, now,\" she admonished.</p> <p>He drained the glass and asked for more.</p><p>\"Why is there no one here to tend you?\" she asked, surprised that the lord of the keep would be left alone when he was obviously ill. \"Why do you not call your physician?\"</p><p>\"I sent him away.\"</p><p>\"Why?\"</p><p>He glanced at the open window. \"The moon will be full tonight.\"</p><p>She nodded her understanding. \"But surely, when you're so ill, the curse will not come upon you.\"</p><p>\"I do not know. It is a chance I cannot take. There are but few who know that the curse is more than just a fable told to frighten children.\"</p><p>Frowning, she looked at him closely. His face seemed hairy, but it was only because he had not shaved. Wasn't it? \"Why did you summon me?\"</p> <p>\"I may have need of your help later.\"</p><p>\"You have need of help now,\" she muttered.</p><p>A knock at the door drew her attention. When she opened it, she saw Alyce standing in the corridor. The maid's eyes widened when she saw Shanara. When Shanara reached for the tray in Alyce's hands, the girl stepped back, pulling it out of reach.</p><p>\"Give me the tray,\" Shanara said, irritated by the maid's behavior.</p><p>\"Nay. I have come to look after my Lord Reyes.\"</p><p>Shanara did not miss the possessive tone in the girl's voice. \"I shall attend him,\" she said imperiously.</p><p>\" 'Tis not a job for a lady,\" Alyce retorted, the word \"lady\" dripping with disdain. She leaned to one side, trying to see past Shanara and into the room beyond.</p><p>\"Perhaps not,\" Shanara said. She fixed the girl with a hard gaze. She was Lord Montiori's daughter. If there was one thing she knew, it was how to give orders and have them obeyed. \"Give me the tray and be gone.\"</p><p>For a moment, it seemed the girl might refuse; then, lips pursed in silent mutiny, she handed Shanara the tray.</p><p>Using her heel, Shanara shut the door in the maid's face.</p><p>Reyes eyed her balefully as she set the tray on the table beside the bed. She drew the blade through the fire to clean it, then she cut the old stitches from his shoulder. Taking a deep breath, she pierced the edge of the wound with the tip of the knife. Thick yellow pus mixed with blood that looked almost black oozed out in the wake of the blade. Taking the poultice, she placed it over the wound to draw out the last of the poison.</p><p>An oath hissed from between Reyes's clenched teeth as the hot poultice touched his skin.</p><p>While the poultice did its work, Shanara poured a cup of willowbark tea, then, lifting his head, she held the cup to his lips. \"Drink.\"</p><p>He shook his head.</p><p>\"Drink, you stubborn man. 'Tis good for what ails you.\"</p><p>When he still refused, she tugged on a lock of his hair. \"Drink, I say!\"</p><p>\"Shrew,\" he muttered, but he drank the tea, grimacing at the bitter taste.</p><p>Lowering his head to the pillow once more, Shanara lifted the poultice, surprised to see that the wound looked much better already. She had intended to leave it in place through the night, but that no longer seemed necessary. Was he by nature a man who healed quickly, she wondered, or was it a by-product of the curse?</p><p>Threading the needle with a length of silk thread, she endeavored to put everything from her mind but the task at hand. She tried to ignore the whisper of the needle passing through flesh, tried to pretend it was no different from sewing a piece of cloth, but cloth did not bleed. She paused frequently to wipe away the blood that oozed from the edges of the wound as her needle moved in and out, drawing the ragged edges together.</p><p>As he had before, Reyes endured her stitching in silence. Sweat beaded his brow. Using a corner of the sheet, she wiped it away.</p><p>She didn't know who was more relieved when she took the last stitch and put the needle aside. After wiping her hands on a scrap of cloth, she sat down in the chair beside the bed and blew out a sigh of relief.</p><p>Reyes looked at her, one brow arched. \"Want to change places?\" he asked with a wry grin.</p><p>She wrinkled her nose at him. \" 'Tis not so easy, putting a needle to a man's flesh.\"</p><p>\" 'Tis not so easy to be the man whose flesh you are sticking, either.\"</p><p>She laid her hand on his brow. \"We need to bring your fever down.\"</p><p>He nodded.</p><p>\"Perhaps I should call your steward...\"</p><p>\"No.\"</p><p>She glanced at the blanket where it covered his hips. \"Are you... ?\"</p><p>In spite of the pain of his wounds and the fever burning through him, he grinned roguishly. \"As the day my mother bore me.\"</p><p>With a nod, she carefully folded the blanket down to his waist, then folded the other end up to mid-thigh. She felt herself blushing under his regard.</p><p>She found a length of cloth, poured water from the pitcher into a basin, and began to draw the cool cloth over his heated flesh. The task should not have caused her any embarrassment. He was sick and she was caring for him. It was no more than that, and yet it was much more than that. She was acutely aware of his every breath, of the way his eyes followed her every movement. She couldn't help but admire the spread of his shoulders, his flat belly ridged with muscle earned from long hours of battle practice. His arms were well muscled from years of wielding a heavy sword, his legs from years of hard riding. When she ran the cloth over his neck, his hair brushed against her hand. It was softer than she had thought it would be.</p><p>She wet the cloth again and again, drawing it over his chest and belly, down his arms and legs. She wiped the sweat from his face, offered him another drink of cool water.</p><p>The room gradually grew darker, making her acutely aware of time passing. She lit the candles on the mantel, added wood to the fire. She glanced at the window, her heart pounding.</p><p>A startled cry erupted from her throat when Reyes laid his hand on hers. \"I need to go outside.\"</p><p>\"What foolishness is this? You've a fever.\"</p><p>His gaze captured hers. \"I cannot stay inside any longer. I need your help.\"</p><p>\"Wh-what do you want me to do?\"</p><p>\"Help me down the stairs. Later tonight, when the servants have gone to bed, I want you to leave my robe by the back door. Will you do that for me?\"</p><p>She nodded, wondering at her willingness to help him. She turned her back when he started to sit up, listened to the sound of his body sliding over the bedding, the soft thud of his feet on the floor, the whisper of the blanket as he wrapped it around his hips.</p><p>She wondered how he had kept his secret so long and then realized that it would be an easy thing for the lord to leave the keep whenever he wished. He didn't have to answer to anyone or explain where he might be going in the middle of the night should someone see him. Most likely, anyone seeing him would assume he had a midnight tryst.</p><p>She turned when he took her hand. \"Let's go.\"</p><p>With her arm around his waist, they made their way down the steps, through the keep, to the back door located in the kitchen. He opened the door, then paused to look back at her.</p><p>\"Be careful,\" Shanara said.</p><p>\"Do not run away again,\" he warned. \" 'Tis not safe beyond the walls. Promise me you will be here when I return.\"</p><p>She glanced past Reyes to the yard beyond, her need to go home burning within her, though she couldn't say why. There was nothing for her there, no one who wanted her. No one who needed her.</p><p>Reyes took hold of her arm. \"Promise me!\" he said again, his voice almost a growl.</p><p>She looked up at him. The change was almost upon him. She could see it in his eyes, feel it in the air around them. \"I promise.\"</p><p>As soon as the words were spoken, he was moving away from her, loping toward the shadows beneath the trees.</p><p>She watched until he was out of sight, wondering what had prompted her to promise him that she would be there when he returned. She owed him nothing. He was the enemy. Lying to the enemy was not the same as lying to a friend. She glanced at the wall in the distance. Freedom was just a short distance away. There, behind one of the shrubs, she had found a hole in the wall just big enough for her to squeeze through.</p><p>She stared across the yard for a long time; then, with a sigh she closed the door and went up the stairs to wait for Reyes to return.</p><p>Chapter 6</p><p>Montiori leaned back in his chair, his eyes narrowed, as he read the missive from his daughter, sent at the order of Reyes, the Lord of Black Dragon Keep: </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p> Father</p><p> I am being held hostage by Lord Reyes. It is his command that you present yourself at Black Dragon Keep before the next full moon and surrender yourself and your arms. If you refuse, my life will be forfeit.</p><p> Your obedient daughter, Shanara.</p> <p>He read the note again, then crumpled the parchment in his fist. Did Reyes think him a fool, that he would give up his own life in exchange for that of his youngest whelp? It was nothing to him if the girl lived or died. He had five sons to carry on the family line, and more daughters than any man needed.</p><p>Montiori turned his attention to the man who awaited his answer. \"How do I know my daughter is still alive?\"</p><p>\"You have my lord's word on it.\"</p><p>Montiori snorted derisively. \"As if I would believe anything that wretched beast has to say.\"</p><p>Mergrid took a step forward. \"My Lord Reyes says he will send the girl back a piece at a time until you surrender, or she dies.\" He withdrew a small bundle wrapped in cloth from his pocket. \"This is so you will know that my Lord Reyes means what he says.\"</p> <p>Taking the bundle, Montiori removed the wrappings. Inside, he found the first knuckle of a woman's little finger. Grunting softly, he tossed the bloody bit of bone and flesh into the fire. \"Return to your lord.\"</p><p>\"I was told to wait for your answer.\"</p><p>\"He will know it when he sees it.\"</p><p>\"As you wish,\" Mergrid said. Bowing, he turned and left the hall.</p><p>Montiori waited until Reyes's servant was out of the room, then motioned for one of his knights to follow the man.</p><p>With a nod of understanding, the knight drew his sword and followed Mergrid from the hall.</p> <p>Chapter 7</p><p>Shanara stood at the window staring out into the darkness, waiting and wondering. Where was he? What was he doing? Was he running through the deep shadows of the night in search of prey, or running just for the sheer joy of it? She knew he remembered being a wolf when he was a man, but when he was clothed in the skin of the wolf, did he remember being a man? What a sad and lonely life it must be for him. She knew now why he remained apart from the others in the keep, why he had never married. Why he would never marry. A pity, when he was such a handsome man!</p><p>She thrust the thought from her mind. He was the enemy! Why did it grow ever harder to remember that?</p><p>She dozed, then woke abruptly, wondering what had awakened her. And then she knew. The moon was setting. He was near.</p><p>Rising, she grabbed a long hooded robe and hurried down the stairs to the kitchen. But she didn't leave the garment by the door. Instead, she carried it outside and walked across the yard, following the path he had taken earlier.</p><p>She looked up at the moon, so beautiful against the black velvet sky. She wondered if Reyes saw the beauty of it anymore, or if it was a constant reminder of the curse that plagued him.</p><p>Frowning, she paused under a tree. If his affliction had been caused by a curse, then there must also be a way to undo it. But how?</p><p>A rustle in the underbrush drew her attention. She held her breath as a dark shape materialized out of the shadows. If it wasn't Reyes... but it was. She recognized him immediately.</p> <p>He trotted to her side, stood there looking up at her. If she had thought it possible, she would have said he was grinning at her.</p><p>She held up the robe. \"Are you ready to change back?\"</p><p>He whined softly, his body convulsing, muscles rippling beneath the thick black fur as his body transformed, paws becoming hands and feet, fur receding to become human skin.</p><p>It was fascinating and yet frightening to watch as bones and muscle and sinew rearranged themselves until Reyes stood before her, his body sheened with perspiration. She looked at him standing there and thought him the most beautiful thing she had ever seen.</p><p>It was only when he reached for the robe draped over her arm that she remembered to be embarrassed by his nudity. With a gasp, she put her back to him, but by then it was too late. She had seen all there was to see.</p><p>\"Why did you come here?\" he asked, his voice sharp with disapproval.</p><p>\"I... because...\" She frowned. Why had she come?</p><p>\"Because you wanted to see the monster?\" he asked quietly, but she heard the bitterness in his voice.</p><p>\"Is that how you see yourself?\" she asked, her back still toward him. \"As a monster?\"</p><p>\"Do you not?\"</p><p>She turned to face him. \"I see only a man who is being made to suffer for something that happened before he was born.\"</p><p>His gaze searched hers as if seeking to know the truth of her words. Unable to help himself, he took a step forward, his hand stroking her cheek. When she didn't recoil from his touch, he moved closer. And then he lowered his head and claimed her lips with his. As he had the first time he kissed her, he expected her to resist, but once again her response took him by surprise. Her eyelids fluttered down and then she was kissing him back, her innocence and her eagerness more powerful than any aphrodisiac. Her lips were sweeter than a honeycomb, more intoxicating than spring wine. Putting his arms around her, he drank from her lips like a man dying for sustenance. He plunged one hand into her hair, his fingers delving into the thick mass. Her scent filled his nostrils, the heat of her body turned away the chill of the night. She was the reason he had never married, he thought, the reason he had shunned the wagons of the camp followers.</p><p>He kissed her again, reveling in her sweet response. For a moment, he let himself pretend he was a normal man, let himself believe that she could be his, that he could take her as his wife and safely spill his seed within her womb. He imagined children born of their joining—strong sons and beautiful daughters, imagined the sound of their laughter filling his dreary keep. He would stop seeking battles to fight and spend his days in peaceful pursuits, and his nights... ah, his nights would be spent in Shanara's arms... Shanara. She was here, in his arms, and yet forever out of reach.</p><p>With a low growl, he released her and turned away.</p><p>Shanara stared at his back. \"Reyes?\"</p><p>\"Go back to the keep.\"</p><p>\"Have I displeased you?\"</p><p>\"Displeased me?\" An anguished laugh rose in his throat. \"Go from me, Shanara, now, before it is too late for both of us.\"</p><p>She started to reach out for him, needing to comfort him, and then lowered her arm. She didn't know what madness possessed her to let him kiss her but there could never be anything between them. He was going to kill her or her father. How could she have forgotten that?</p><p>Wrapping her arms around her waist, she ran back to the keep, grateful for the darkness that hid her tears.</p><p>She woke to the sound of shouts and harsh curses. Rising, she went to the window overlooking the courtyard. A number of men surrounded a horse. Reyes was easy to pick from the crowd. He stood head and shoulders above the others.</p><p>Curious to know what had caused such a tumult at such an early hour, she donned a robe and hurried down the stairs and out the door.</p><p>As though sensing her approach, Reyes turned to face her, his expression grim, his eyes hard.</p><p>She slowed her steps as she drew near, then came to an abrupt halt when she saw the source of the commotion. The horse she had seen from her window carried a burden on its back. She stopped, one hand covering her mouth, when she saw the headless body draped across the saddle.</p><p>She looked up at Reyes. \"Who... who was he?\"</p><p>\"The messenger I sent to your father.\"</p><p>His words sent a shiver through her. Caught up in the horror of what she was seeing, she hadn't realized that Reyes had come to stand beside her.</p><p>She looked up at him. He had sent her plea for help to her father and this was her father's reply. Coldness settled over her, leaving her numb. Her father would not save her. She had known all along that he would not, yet she had clung to some small scrap of hope, and now that, too, was gone.</p><p>As he had been the first time she had seen him, Reyes was clad all in black. He had reminded her of Death on that day not so long ago. And now that her father had abandoned her, Reyes would, indeed, be her death. Because her father would not take her place, her life would be forfeit, and then there would be another war, with more death and more killing.</p><p>\"How soon?\" she asked, her voice a choked whisper. She didn't want to die. She wanted to live, to marry and bear children, to watch them grow, to hear their laughter and dry their tears.</p><p>He frowned at her. \"How soon? How soon for what?\"</p><p>\"Until you... until you...\"</p><p>\"Speak, woman, what are you trying to say?\"</p><p>\"How soon until you... you take my head in exchange for his?\"</p><p>Reyes blinked at her. \"Is that what you think I'm going to do?\"</p><p>\"Are you not? You said my life would be forfeit if my father did not surrender to you.\"</p><p>Reyes snorted. \"I may be a monster but it is not my habit to slay women or children.\"</p><p>She stared at him, feeling suddenly dizzy with relief.</p><p>Reyes pulled her into his arms to steady her. Had she truly thought he would take her life if her miserable cur of a father refused to surrender? Reyes knew he would as soon cut off his own hand before he raised it in violence against her. He spat into the dirt. He had known all along that Montiori would never sacrifice his own life for that of his daughter, or for any of his children. Still, he had hoped that Montiori would fall for his bluff, that some spark of fatherly devotion existed in the man. He should have known better. His bluff had failed. To his regret, the finger that his physician had amputated from the diseased hand of one of the serving women had not fooled Shanara's father.</p><p>He frowned thoughtfully, his mind forming and dismissing a dozen ploys, and then he smiled. Of course! He knew exactly how to avenge himself on his enemy. Why had he not thought of it sooner?</p><p>Shanara looked up at him, obviously confused by his sudden change of mood.</p><p>\"I have a better way to avenge myself on my enemy,\" he remarked. \"A way that cannot fail.\"</p><p>\"You mean to go to war against him?\" she asked in alarm.</p><p>\"No,\" he said quietly. \"I mean to marry his daughter.\"</p><p>Chapter 8 </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Shanara stared up at him. \"And which of my father's daughters do you intend to marry, my lord?\"</p><p>A slow smile curved Reyes's lips. \"The one in my arms, of course.\"</p><p>Numbness gave way to trepidation. She could not deny that she was attracted to Reyes, or deny that the prospect of staying here, as his wife, was far more appealing than returning to her father's keep. But in the next heartbeat, trepidation turned to despair. She could not marry Reyes, could not conceive a child that would carry the same curse as its father. Not so long ago, she had been certain he would never marry.</p><p>She twisted out of his grasp. \"Nay.\"</p> <p>\"Aye. You will be my bride within a fortnight.\"</p><p>\"But why? You do not love me!\"</p><p>\"Your father's witch cursed me. Perhaps your father will reconsider my offer when he realizes the curse will now fall on his own kin.\"</p><p>\"And on your own!\" she exclaimed in horror. \"Would you be so cruel as to condemn your own son to the kind of life you lead?\"</p><p>He recoiled as if she had slapped him. Did she truly think he would get her with child, that he would condemn a son of his to the life he led? If so, so be it. Let her think what she would.</p> <p>\"My life is not as bad as it once was.\" His gaze slid over her body, his eyes dark, hot, and hungry, and filled with yearning.</p><p>\"Nay!\" she exclaimed. \"I will not marry you. I will not allow you to use me or any son we might have to avenge yourself on my father.\"</p><p>\"You will be my wife or my enemy,\" he said coldly. \"The choice is yours.\"</p><p>She squared her shoulders, her eyes flashing defiance. \"I am already your enemy!\"</p><p>\"Are you?\" he asked.</p><p>His voice, no longer cold, was as warm and seductive as honeyed wine.</p> <p>She lifted her chin defiantly. \"I will take my own life rather than marry you.\"</p><p>\"We shall see. Make whatever preparations you need. We wed in a fortnight.\"</p><p>And with those words ringing in her ears, he took her by the arm and led her into the keep.</p><p>Shanara paced her chamber, her mind in turmoil. She had to get away from here before it was too late. Save for the witch's curse, marriage to Reyes would have been far more appealing than returning to her father's keep, but she would not bear a child knowing that it would be cursed to run with the wolves at the full moon. How could Reyes expect it of her? How could he consider it himself?</p><p>Too upset to eat, she refused the tray that Beatrice brought her later that evening, flinched when she heard Beatrice turn the key in the lock. One way or another, she had been naught but a prisoner since Reyes had defeated her uncle in battle. Nay, even before that, she mused. Being a woman, she had never truly known the kind of freedom her brothers enjoyed.</p><p>With a sigh, Shanara went to the window and stared down at the yard below. She had to find a way out of here or, at the very least, get word to her father. Surely he would come to her rescue rather than see her wed to his enemy!</p><p>Dropping down onto the window seat, she rested her chin in her hands and stared into the gathering darkness. She wouldn't be here now if she hadn't gone to visit her uncle.</p><p>Rising, she began to pace the floor once again. She was still pacing when Alyce came in to light the fire and turn down her bed.</p> <p>Alyce helped her out of her dress and undergarments, helped her into a long white sleeping gown, and then glared at her. \"Why did you have to come here?\"</p><p>\"I assure you, it was not my wish,\" Shanara replied, startled by the girl's insolent tone and sullen expression.</p><p>\"Then why are you marrying Lord Reyes?\"</p><p>Shanara sighed. It came as no surprise that the news had already spread throughout the keep. Did his servants also know that she had refused his offer?</p><p>Alyce reached for Shanara's brush. \"Lord Reyes deserves a woman who loves him.\" She brushed out Shanara's hair, her touch far less gentle than Beatrice's. Laying the brush aside, she began plaiting Shanara's hair. \"If you had not come here, perhaps...\"</p><p>Shanara glanced over her shoulder. \"Perhaps what?\"</p><p>Alyce shook her head. \"Nothing.\"</p><p>\"Tell me, Alyce. It may be that I can help.\"</p><p>A single tear slid down the maid's cheek. \"No one can help me.\"</p><p>\"I cannot help you if you will not confide in me.\"</p><p>\"I love him!\" Alyce spoke the words in a rush, then clapped her hand over her mouth, her eyes widening in horror. \"Forgive me, my lady. Please do not tell him what I said!\"</p><p>\"Alyce, there may be hope for you yet.\"</p><p>\"How so? You are to wed in a fortnight.\"</p><p>\"I have no wish to marry Lord Reyes, only to return to my father.\" Strange how, having said the words, she knew them for lies. \"Can you help me?\"</p><p>\"There is a little chapel in a copse of trees behind the mews. Meet me there in three hours.\"</p><p>\"But the door to my room...\"</p><p>\"I shall unlock it when it is time to go. Do not be late.\"</p><p>Reyes paced the floor of the great hall, wondering what madness had possessed him to tell Shanara that they would be wed. He had vowed that he would never marry, thus putting an end to the curse that plagued him. But he had looked into Shanara's eyes, felt her warm breath upon his face, tasted the sweetness of her kisses, and selfishly wanted more. He could not kill her and he could not let her go. At the time, his impulsive decision to marry her had seemed like the only sensible thing to do.</p><p>He turned at the sound of footsteps, surprised to see the young serving maid Alyce up so late.</p><p>\"Is something amiss?\" he asked.</p><p>\"No, my lord,\" she replied softly. She filled a goblet with wine and carried it to him. \"You look troubled.\"</p><p>He nodded as he accepted the drink. She was a pretty girl. It occurred to him that he had seen a good deal of her of late, and then he grinned inwardly. She was young and impressionable. No doubt she was infatuated with the lord of the keep. It had happened before.</p><p>\"Is there anything else I can do for you, my lord?\" She stood near at hand, her gaze on his face. The throaty purr in her voice and the look in her eyes told him she was only too willing to do anything he asked.</p><p>For a moment, he was sorely tempted to take what she was offering so brazenly. Perhaps satisfying his lust would enable him to think more clearly, but even as he considered it, he knew he would not touch the girl. He wanted no woman in his bed but Shanara, and if he could not have her, then he would continue to remain celibate, unpleasant as that might be.</p><p>Placing her hand on his forearm, Alyce looked up at him through the veil of her lashes. \"Perhaps you would like a warm bath,\" she suggested. \"It would help you sleep.\"</p><p>He took a deep, calming breath, certain that, after accepting what she was offering, he would sleep like a newborn babe. Again, he shook off the temptation.</p><p>\"Go along with you now, girl,\" he said, dismissing her with a wave of his hand.</p><p>She lingered a moment more, then turned and flounced from the room. Reyes watched the enticing sway of her hips, then, muttering an oath, he left the hall for the room he planned to occupy until Shanara was his bride. Unfortunately, since he knew he would not be able to share her bed without possessing her, it was the room he would be occupying after the wedding as well.</p><p>On that dreary note, he stripped off his boots and shirt and sought his rest, grateful that tonight there was no full moon.</p><p>Wearing a dark cloak over her gown, Shanara crept out of her room, down the stairs, and out the back door of the keep. She cast a wary eye behind her, giving thanks for the lowering clouds that hid the moon and the stars and, hopefully, her progress across the yard toward the mews.</p><p>Once, certain that someone was watching her, she glanced up at the windows overlooking the yard. No lights shone. No moving shadows betrayed a watchful eye. Telling herself there was nothing to fear, she hurried onward.</p><p>The small whitewashed chapel, topped by a carved wooden cross, stood in a copse of ancient oaks and elms. Opening the door, she paused at the threshold. Hearing nothing, she stepped inside the dark building.</p><p>\"Alyce,\" she whispered. \"Are you here?\"</p><p>Silence was her only answer.</p><p>Heart pounding, Shanara took a step backward and then, hearing a noise off to her left, she whirled around, reaching blindly for the door. Her hand was on the latch when she felt a sharp pain on the back of her head, and then she felt nothing at all.</p><p>He woke suddenly, not knowing what had roused him. Sitting up, he stared into the darkness that surrounded him, his head cocked as he listened to the sounds of the night. He could discern nothing amiss, yet he couldn't shake the feeling that something was wrong.</p><p>Swinging his legs over the edge of the bed, he reached for his boots, then changed his mind. Padding barefoot across the floor, he left the room and walked quickly down the corridor to his bedchamber. He pressed his ear to the door, listening. There was no sound from within.</p><p>He was about to return to his own room when some inner voice urged him to try the latch. The door opened at his touch. Without stepping inside, he knew the chamber was empty.</p><p>Muttering a vile oath, he stalked down the stairs and out the kitchen door. Once he was safely in the shadows, he removed his trousers and summoned the wolf. Ah, the pain of it, the wonder of it. He dropped to his hands and knees, stared at his hands as they turned into paws. He groaned as muscles and tendons stretched and changed shape, his body contracting here, expanding there, the whole of it sprouting a thick black pelt.</p><p>When the transformation was complete, he shook himself all over, let out a low whine as her scent filled his nostrils. She had been here not long ago, and she had not been alone. Alyce's scent also hung in the air.</p><p>He broke into a trot, his nose to the ground. Alyce's scent was soon left behind, but Shanara's led him to the small chapel behind the mews.</p><p>His hackles rose when he reached the door. Her scent was strong here, and overlaying it, he detected the scent of a man. A scent he recognized. Ragan. He growled low in his throat at the thought of her sneaking out of the keep to meet another man. A man who had sealed his doom the moment he laid his hand on Shanara. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Reyes intended to have Shanara for his mate, and wolves mated for life.</p><p>She was afraid, so afraid. Her head throbbed with every breath. She could feel the sticky warmth of her own blood trickling down the back of her neck. She glanced from side to side, though there was nothing to see but blackness. She had no idea who had struck her or where she was now. She knew she was lying on her side. There was dirt beneath her cheek. When she tried to lift a hand to her head, she discovered that her hands were tied behind her back. When she tried to sit up, she realized her feet were also bound.</p><p>Willing herself to be calm, she began to twist her hands back and forth in an effort to loosen the ropes that bound her wrists. She had to get out of here, wherever here was. Tears burned her eyes and she blinked them back. She would cry later. Shaking off her self-pity, she thought of Alyce, the lying wench. It was Alyce who had done this to her. But why?</p> <p>Because of Reyes, of course. The girl had declared she was in love with the lord of the keep. Had Alyce thought that by getting rid of her lord's intended bride, she might be able to win his love?</p><p>Shanara frowned. There had been no need for Alyce to do her harm. She had told the maid she didn't want to marry Reyes, that all she wanted was to return to her father. Either Alyce had not believed her, or she had decided to make certain that Shanara would never return to Black Dragon Keep. Deep in her heart, Shanara knew that should Fate decree that she never see Reyes again, she would miss him far more than she would ever admit to herself or anyone else.</p><p>Shanara winced as the thick rope cut into the tender skin of her wrists. There was no time to worry about the maid's motives now. She had to get away before it was too late. Had to find her way home...</p><p>Home. She thought of her father's keep and the people in it. His knights were taciturn and sullen. The servants were the same. Her brothers spent their days honing their battle skills and their nights whoring, seemingly happy only when they were on the battlefield, or preparing for war. Her sisters had little time for her, preferring to spend their days pampering themselves behind closed doors or gossiping about their neighbors when they weren't simpering over one man or another. Shanara had spent most of her days in her chambers learning the fine arts from her old nursemaid. She saw her father only at meals, considered herself fortunate if he deigned to notice her presence at the table.</p><p>As she did so often, she wished her mother was still alive. Her mother had been the only one who cared what happened to her youngest daughter, the only one who took time to speak to Shanara, to cheer her when she was down, to assure her that in spite of her father's indifference, he loved her. Shanara had never believed it, but she had loved her mother the more for trying to spare her feelings.</p> <p>A sound from above drew her attention. Looking up, she saw a narrow bit of moonlight shining through the clouds. She froze as she heard movement overhead again, a low snuffling sound followed by a low growl.</p><p>Panic surged through her. With a grunt, she freed one hand and then the other. A million pinpricks rushed through her fingers as blood flowed into her hands again. Sitting up, she massaged her wrists for several moments and then reached for the rope that bound her ankles. As she did so, her hand brushed against something cold and slippery. At first she couldn't tell what it was, and then she realized it was a chunk of raw meat.</p><p>Terror clogged her throat as she scrambled to her feet. She knew where she was now.</p><p>She was out in the woods, in one of the pits that were used to trap wild animals. And she was now part of the bait.</p><p>Chapter 9</p><p>Lifting his head, Reyes sniffed the air, sorting Shanara's scent from the hundreds of others that assailed him—the scent of damp earth and trees and rotting foliage. He detected the fear rising from rabbits and mice and other small creatures that cowered in their dens and holes, hiding from the fierce predator that stalked the night.</p> <p>He howled as he honed in on Shanara's scent, growled when her spoor led him to a wolf trap. Anger twisted through him. Fearful that he might accidentally stumble into one of the pits some dark night, he had long ago declared that all such traps be filled in.</p><p>Hackles raised, he padded closer to the edge of the pit. In spite of the depth and the darkness, he had no trouble seeing the bottom of the chasm, or the woman who crouched there, looking up at him through frightened green eyes.</p><p>Giving what he hoped was a reassuring bark, Reyes backed away from the edge of the pit. Sitting on his haunches, he closed his eyes and pictured his human image in his mind, visualizing the transformation. He howled in protest as his body began to change, the man overtaking the wolf, humanity overtaking the wildness.</p><p>When the change was complete, he crawled back to the pit and peered over the side. \"Shanara?\"</p><p>\"Reyes!\"</p><p>\"I will have you out of there soon.\"</p><p>Rising, he cast around for something he could use to pull her out of the pit. Spying several long vines, he twisted them together, then tossed one end over the side.</p><p>\"Catch hold,\" he said. \"I will pull you up.\"</p> <p>Moments later, she was standing beside him brushing dirt from her gown and her hands. \"How did you find me?\"</p><p>\"I followed your scent. There was a man with you. Where is he?\"</p><p>She shook her head. \"I know not. He dumped me in the pit and...\" She shrugged.</p><p>\"And Alyce?\" he asked curtly. \"What part did she have in all this?\"</p><p>Shanara stared at him, mute.</p><p>\"Answer me!\"</p><p>\"She said she would help me get back to my father.\"</p><p>Reyes swore a vile oath. He would kill Alyce for this, and Ragan as well!</p><p>He blew out a deep breath, then took Shanara's hand. \"Is the thought of being my bride so repulsive to you that you would rather risk death than take your vows?\"</p><p>She looked up at him, not knowing what to say, afraid to admit to him, or to herself, the depths of her feelings for him, feelings she could not begin to understand. No matter how hard she tried to hate him, no matter how often she reminded herself that he was her enemy, she could not hate him.</p><p>She gasped as he drew her into his arms. She placed her hands on his chest, intending to push him away. Only then did she remember that he was naked. The warmth of his body quickly penetrated her clothing, the heat in his eyes seared her soul.</p><p>\"Shanara...\" His hand brushed her cheek, slid down her back to cup her buttocks, drawing her closer, letting her feel the visible evidence of his desire.</p><p>\"Please, do not...\"</p><p>\"What?\" he asked gruffly. \"Do not touch you? Do not kiss you...\" His gaze moved over her face. \"How can I resist? Your hair is like silk beneath my hands. Your skin smells of lavender. Your body is a temptation no man could resist. Shanara... accept your fate and be my bride.\"</p><p>In her heart, it was what she wanted, but how could she wed him now, when she knew about the curse that awaited his offspring?</p><p>His hands caressed her and then, murmuring an oath, he lowered his head and kissed her.</p><p>For the space of a heartbeat, she resisted. And then, with a sigh, she surrendered to her heart's desire. Slipping her arms around his neck, she closed her eyes and returned his kiss, reveling in the pleasure that flowed through her, the excitement that fluttered deep in the core of her being, urging her to give him everything he wanted, to surrender everything his body and her own heart were urging her to give.</p><p>Her hand slid down his back, exploring the deep vee between his shoulder blades, the indentation of his lean waist.</p><p>He groaned softly and then, with a cry that was almost a growl, he gently pushed her away.</p><p>She blinked up at him, her whole body aching and on fire for his touch.</p><p>\"Not now,\" he said tersely. \"Not here. I will not take you like a wild beast in heat.\" Tenderly, he drew her back into his arms. \"When I take you, it will not be in the dirt, but upon silk sheets. And you shall be my bride.\"</p><p>He gazed deep into her eyes, wondering at his sudden change of heart. Only days ago, he had vowed never to marry. Now he was equally determined to make Shanara his woman, in name only if nothing else. Right or wrong, he could not let her go. Should Montiori arrive on the morrow to take his daughter's place, Reyes knew he would turn his enemy away rather than lose the woman in his arms.</p><p>It was near morning when they reached the keep. He quickly retrieved his trousers, then headed for the kitchen door. Under other circumstances, he would have taken the secret passage to his chamber, but he didn't want Shanara to know of its existence. By a stroke of luck, they met no one when they entered the castle. Reyes saw Shanara to her room. Inside, he searched for anything she might find useful should she try to escape. He confiscated the knife from her dinner tray, kissed her long and hard, then locked her in her room.</p><p>Going to his own chambers, he rang for Rolf and ordered baths to be drawn for himself and Shanara, then added that he wanted a morning meal for two sent to his room in an hour.</p><p>Rolf was about to leave the room when Reyes called to him.</p><p>\"Yes, my lord?\"</p><p>\"Where is Alyce?\"</p><p>\"Belowstairs, my lord.\"</p><p>\"Send her to me immediately.\"</p><p>With a nod, Rolf went to carry out his lord's bidding. Reyes paced the floor, his anger building with each step he took. He was in a fine rage when she knocked on his door. \"Enter.\"</p><p>She stepped into his room, a smile of anticipation on her face. \"You summoned me, my lord?\"</p><p>\"Shut the door.\"</p><p>She did as he asked, her smile not quite so bright when she faced him again.</p><p>\"Why did you do it?\" He held up his hand when she started to speak. \"Do not lie to me, Alyce. I know what you did. What I want to know now is why? What did you hope to gain by murdering my future bride?\"</p><p>She stared at him, her face pale, her lower lip quivering. \"My lord, I didn't know... I...\"</p><p>\"Go on.\"</p><p>\"Forgive me, my lord! Please, be merciful. It was only that I love you so much! She said she wanted to return to her father...\"</p><p>\"And you were going to help her?\"</p><p>\"Yes, my lord. I thought if she returned to her father, you might... that is, that we—\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"So you had Ragan throw her into a pit?\"</p><p>\"How did you... ?\" She bit down on her lower lip as she realized she had given herself away.</p><p>\"You tried to kill Shanara because you love me?\" he asked incredulously. He had known the maid was infatuated with him, but love?</p> <p>Alyce looked at him, her eyes brimming with tears.</p><p>Whether she loved him or not, there was no excuse for what she had done. And she had not done it alone. Her accomplice was somewhere within the keep.</p><p>\"I want you out of the keep by nightfall.\"</p><p>With a sob, she threw herself at his feet, her arms wrapping around his ankles. \"No! Please, not that!\"</p><p>\"Count yourself lucky that I'm letting you keep your head!\"</p> <p>\"Where will I go? Please, my lord, let me stay!\"</p><p>\"Go where you will. Be gone from my sight! And take Ragan with you.\"</p><p>Sobbing, she gained her feet and moved woodenly toward the door. She paused to look back at him, her eyes begging him for mercy. Finding none, she left the room, closing the door behind her.</p><p>Reyes stared after her. He would have no one within the keep whom he couldn't trust. He held loyalty above all else. To betray someone under his roof was the same as betraying him. Alyce had crossed the line and there was no going back.</p><p>Later, after he had bathed and dressed, he summoned Shanara.</p><p>She arrived a short time later. She was more beautiful every time he saw her. This morning, she wore a lavender long-sleeved gown. The square neckline revealed a modest amount of golden-brown flesh. Her hair fell over her shoulders, a mass of thick auburn waves that tempted his touch.</p> <p>He felt his gut clench when he thought of how he had found her in the bottom of the pit. Had he not found her in time, she might have fallen prey to wild beasts, or starved to death.</p><p>He took a deep, calming breath, then gestured at the table, now laden with covered dishes. \"Sit, Shanara,\" he invited.</p><p>She walked across the room and took a seat at the table. She carried herself like a queen, he thought. Her every movement was regal.</p><p>He sat across from her, every fiber of his being aware of her beauty, her nearness. It had been a mistake inviting her to his chambers. She was far too desirable and his bed was far too near at hand for his peace of mind.</p><p>He filled her plate with the meal the cook had prepared for them. They ate in silence for a time. Reyes had no interest in food, not with Shanara sitting across from him. All he could think of was carrying Shanara to bed and making slow, sweet love to her, then falling asleep in her arms.</p><p>\"My lord, you must not stare at me so.\"</p><p>\"It displeases you?\"</p><p>She blushed prettily under his regard. \"It is unseemly.\"</p> <p>\"Unseemly?\" he asked, amused. \"There is nothing unseemly about a man admiring his bride-to-be.\"</p><p>\"I never said I would marry you.\"</p><p>\"But you will.\"</p><p>\"Nay.\"</p><p>\"I will have my way in this, Shanara. Tomorrow, the castle seamstress will attend you. We will be wed on Sunday.\"</p><p>\"You said a fortnight!\"</p><p>\"I have changed my mind.\"</p><p>Rising, he rounded the table and drew her into his arms.</p><p>\"My lord, we must not...\"</p><p>\"Just a kiss,\" he murmured, lowering his head. \"One kiss.\"</p><p>One kiss, she thought, and she was lost. What power did he possess that he could so easily make her want him? All thought of right and wrong, friend or foe, fled her mind as his lips captured hers. Her stomach fluttered at his nearness. Her legs grew weak and she leaned against him, gasping as she felt his arousal. Her body grew warm, her heartbeat erratic.</p><p>She moaned softly. It was meant to be a protest. Why then, did it sound like a sigh of pleasure? A distant voice in the back of her mind whispered that she should push him away. Instead, one arm slid around his waist while her other hand slid around his nape to bar his escape.</p><p>He broke the kiss for a moment, his eyes looking deep into hers, and then he was kissing her again, his lips moving over hers, his tongue dueling with her own in a way that made her think of their bodies joining together.</p><p>\"No. We mustn't.\" It took all her willpower to push him away. She could not surrender her maidenhead, not while there was a chance she might still escape. With her virginity gone, no other man would want her.</p><p>\"You are a wise woman,\" he said, his voice raw with desire. \"Another moment in my arms and you would not have been a maiden on your wedding day.\"</p><p>She stared up at him, her lips bereft, her body trembling. For a moment, she was tempted to return to his arms, but then she remembered that he was supposed to be her enemy, and that, even worse, he was only marrying her to antagonize her father.</p><p>Wordlessly, she opened the door and left the room.</p><p>She wasn't surprised to find Rolf waiting for her in the corridor. Silent as a shadow, he followed her down the hallway to her chambers. When she went inside, he closed and locked the door behind her.</p><p>Chapter 10</p><p>Sitting upon his throne, Lord Montiori looked down at the girl kneeling on the floor before him.</p><p>\"How do I know Reyes did not send you?\" he asked. \"Need I remind you that spies are beheaded?\"</p><p>Alyce looked up at him, her eyes red and swollen. \"I am no spy! I cannot prove otherwise, my lord, but I speak the truth. I tried to help your daughter escape from Lord Reyes and he sent me away in disgrace. I came to beg your indulgence, my lord. I have nowhere else to go.\"</p><p>\"My daughter is well then?\"</p><p>\"Yes, my lord.\"</p><p>\"The finger that Reyes sent me, was it hers?\"</p><p>\"No, my lord.\"</p><p>Montiori grunted softly. \"I thought not.\" He leaned forward. \"So, what news have you from Black Dragon Keep? Is Reyes preparing for war? Is he planning to ride against me?\"</p><p>\"No, my lord. He plans to wed.\"</p><p>\"Indeed? And what unfortunate woman will bear his accursed young?\"</p><p>Alyce took a deep breath. \"Your daughter. Shanara.\"</p><p>Montiori sprang to his feet. \"What?\"</p><p>\"Aye, my lord, 'tis true.\"</p><p>\"When is this loathsome deed to take place?\"</p><p>\"Within a fortnight, if kitchen gossip be true.\"</p><p>Descending the dais, Montiori began to pace the floor. \"How dare he mingle his foul blood with mine! My daughter, to wed that beast and bear his young! I will not have it!\"</p><p>Turning, he almost tripped over the girl. \"Be gone!\" he roared.</p><p>\"My lord?\"</p><p>\"Go into the kitchens. Tell Grendal to put you to work.\"</p><p>\"Yes, my lord,\" Alyce said, scrambling to her feet. \"Thank you, my lord!\"</p><p>Montiori scarcely heard her. He was bellowing for the captains of his armies.</p><p>Chapter 11</p><p>For Shanara, the next few days passed in a whirlwind of activity. The dressmaker came, bringing bolts of material in every fabric and color imaginable. It took most of one day for her to choose the color, and when she couldn't decide between pale pink or ice blue, she decided to go with white. She spent most of another day picking out just the right style. Her mood seemed to change from excitement to trepidation and back again from moment to moment.</p><p>She saw Reyes each evening. Now, with the moon no longer full, he was more relaxed, and quite charming. Sometimes he took her walking in the gardens in the evening after supper. Sometimes they sat before the hearth listening to the minstrels; other times they were entertained by the court jester, or by wandering jugglers or magicians.</p><p>But the best times were when he walked her to her chamber before she retired for the night. There, alone in her room, he wooed her with soft words of love and slow, sweet kisses that made her heart race and her toes curl.</p><p>There, alone in the shadowy darkness, she could forget, if only for a little while, that he lived under a curse that could only be broken by her father's witch.</p><p>Melena, Shanara mused. She was the answer. The witch had ever been kind to her. If she could find a way to speak to Melena or to send her a message, perhaps she could convince the witch to break the curse.</p><p>But no opportunity arose and then, all too soon, her wedding day was upon her.</p><p>Shanara stood in the middle of her chamber while Beatrice brushed her hair until it shone. The maid drew the sides back with a pair of jeweled combs, leaving the rest of Shanara's hair to fall down her back in an artless mass of thick auburn waves.</p><p>Next, Beatrice helped Shanara into her wedding dress, then arranged her veil with its floor-length train.</p><p>\"Ah, my lady,\" Beatrice exclaimed, taking a step back. \"You look as beautiful as a princess in a fairy tale.\"</p><p>\"Thank you,\" Shanara murmured. She ran her hands over her gown, loving the feel of the gossamer material beneath her fingertips. Made of the finest white on white silk, it was an exquisite creation, so light it might have been made of angels' wings. She couldn't help wondering what Reyes would think when he saw her. Would he be pleased? Would he think his coin well spent?</p><p>A knock at the door sent her heart to fluttering. \"I cannot do this,\" she whispered. \"I cannot!\"</p><p>\"Now, now,\" Beatrice said cheerfully, \" 'tis only a bad case of nerves, common to all brides on their wedding day.\"</p><p>It was more than mere nerves, Shanara thought. If her husband-to-be had been an ordinary man, she would have been eager to wed him and bed him, but Reyes was not an ordinary man.</p><p>Beatrice opened the door and Rolf entered the chamber. He smiled at Shanara. \"Your bridegroom awaits,\" he said.</p><p>She wanted to tell Beatrice and Rolf that the wedding was off, that she could not marry Reyes tonight, or any other night, but the words would not come.</p><p>As if caught in a trance, Shanara allowed Rolf to take her hand and lead her down the staircase to the small chapel located within the keep. Rolf paused at the door, giving her a chance to peruse her surroundings. There were flowers everywhere, some in white wicker baskets, some in tall glass vases, others in colorful pots. Tall white tapers cast shadows on the walls.</p><p>There were no guests other than two of Reyes's most trusted knights who would serve as witnesses. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Shanara felt her breath catch in her throat when she saw Reyes. He stood in front of the altar next to the priest. For once, Reyes had eschewed black. Instead, he wore buff-colored trousers, a white shirt open at the throat, a dark green jerkin trimmed in black velvet, and a pair of soft leather boots.</p><p>His gaze settled on her face, the force of it sending a shiver of excitement to the very deepest part of her being.</p><p>Rolf gave a gentle tug on her hand. She took a step forward, her gaze locked with that of the man who was going to be her husband. By the time she reached the altar, her heart was pounding so loudly she was surprised the priest could not hear it.</p><p>A rush of heat flowed into her fingers and up her arm when Rolf placed her hand in that of his lord. Bowing his head, Rolf took a step back, then sat in the front pew.</p> <p>The priest looked at Shanara and then at Reyes. \"Are you ready, my children?\"</p><p>\"Yes, Father,\" Reyes said. He smiled at Shanara, then squeezed her hand.</p><p>She tried, but she could not summon a smile. What would he do when she refused to be his bride? Would he send her back to the dungeon, or fulfill his vow to send her back to her father a piece at a time?</p><p>She felt an unexpected warmth in the region of her heart when Reyes vowed to love, honor, and protect her so long as he lived.</p><p>And then the priest settled his somber gaze on her face. She could scarcely breathe as he put the question to her.</p> <p>\"Do you, Shanara Montiori, take Alexandar Reyes to be your husband from this day forward? Will you love and honor him so long as you both shall live?\"</p><p>Her heart was beating so fast she feared she might faint. She took a deep, calming breath and then, to her utter amazement, she whispered, \"I do.\"</p><p>The priest smiled for the first time. \"Then, by the power vested in me, I now pronounce you man and wife. What the Lord God hath joined together, let no man put asunder. Lord Reyes, you may kiss your bride.\"</p><p>She trembled as Reyes put his hands on her shoulders and turned her to face him. Lifting her veil, he drew her into his embrace. For a moment, he gazed down at her, his expression enigmatic, and then he kissed her.</p><p>Her eyelids fluttered down at the touch of his lips on hers and she forgot everything else, everything but the aching sweetness of his kiss, the faint tremor in the arms that held her. Was it possible that he was as nervous as she?</p><p>She blinked up at him when he broke the kiss. Glancing around, she felt a rush of heat flood her cheeks when she saw the indulgent smiles on the faces of the priest and the knights.</p> <p>Feeling suddenly self-conscious, she started to pull away from Reyes, but his arm around her waist kept her close to his side.</p><p>He thanked the priest, Rolf and his knights, then led her out of the chapel and up the stairs to his bedchamber. The maids had laid a fire, there were candles burning on the mantel and in wrought-iron sconces on the walls. Bowls of flowers filled the room with a sweet fragrance. Someone had sprinkled flower petals across the floor and over the bed. A plate of bread and cheese and a bottle of wine awaited them on the table.</p><p>When he closed the door, she was trembling so badly that, had it not been for Reyes's arm around her waist, she feared she might have collapsed in a pool of silk at his feet.</p><p>\"Does the room please you?\" he asked.</p><p>She nodded, unable to speak for the pounding of her heart, the lump in her throat. She was his wife now, subject to his whim and will. If she cried out for help, no one would come to her aid. She belonged to him, the same as his horse and his sword. He could lock her up for the rest of her life. He could beat her, starve her, order her to spend the rest of her days in a convent, and she would have no recourse but to accept his will, whatever it might be.</p><p>He frowned at her. \"Is something amiss?\"</p><p>She shook her head, her eyes widening as his fingertips stroked her cheek.</p><p>\"Are you afraid of me now?\"</p> <p>She shivered as his fingers traveled down the length of her neck, then, ever so slowly, skimmed the curve of her breast.</p><p>\"I will not hurt you, wife,\" he said quietly and then, as if to prove his words, he kissed her gently, tenderly. His mouth was warm on hers, demanding nothing, asking everything.</p><p>And because she could not resist his kiss any more than she could cease to breathe, she kissed him back, a long slow kiss that brought all her senses vibrantly alive. Caught up in his kiss, she was scarcely aware that he was undressing her until she stood before him clad in nothing more than her shoes and her petticoat.</p><p>She looked up at him, mute, as he knelt before her to remove her shoes, then unfastened the ties of her petticoat and let it fall to the floor.</p><p>In the way of maidens since time began, she crossed her arms over her breasts.</p><p>Reyes shook his head. \"Do not hide your beauty from me, my Shanara,\" he said, his voice husky with desire.</p><p>Biting down on a corner of her lip, she slowly lowered her arms, felt herself blush from the soles of her feet to the crown of her head as his hungry gaze moved over her.</p><p>\"Beautiful,\" he whispered. \"More beautiful than anything I have ever seen.\"</p><p>Drawing her into his arms once more, he showered her with kisses, his lips like fire as they slid over her breasts and belly, then returned to her lips to drink deeply.</p><p>Desire was an ache deep inside, a longing so intense it was painful. She moaned softly, all thought of resistance melting away like morning dew. She wanted him. There was no doubt that he wanted her. Why didn't he carry her to bed?</p><p>He kissed her again, his tongue exploring the warmth of her mouth and then, abruptly, he let her go.</p><p>\"Sweet dreams, my lady wife,\" he said hoarsely, and he was gone.</p><p>She stared after him, unable to believe he had left her alone on her wedding night, or that his going could hurt so much.</p><p>Unable to believe that, in spite of everything, she had fallen in love with her father's sworn enemy.</p><p>Reyes stood in the darkness, staring up at the window of his bedchamber. Leaving his bride had been the most difficult thing he had ever done, but to stay would have been madness. No matter how desperately he wanted to make love to her, no matter that his entire body ached with the need to possess her, he could not bring himself to bed her, could not condemn any son she might conceive to endure the kind of life he now lived.</p><p>Hands clenched at his sides, he paced back and forth beneath the window, his mind filling with images of Shanara's delectable body. Her skin was creamy smooth, unblemished by wart or mole. Her body was lush, neither too plump nor too thin. His body hardened anew at the thought of hers. He groaned low in his throat as he imagined carrying her to his bed, burying himself deep within her warmth, making love to her all through the night, waking in her arms.</p><p>Taking shelter behind a bush, he summoned the wolf within him. Muttering an oath, he tore off his clothes, a howl of pain and frustration rising in his throat as his body transformed. With a last look at his chamber window, he ran away from the keep, away from the temptation that was growing ever harder to resist.</p><p>He loped through the darkness, finding a measure of solace in the touch of the wind in his face, the feel of damp earth beneath the sensitive pads of his feet. He ran for miles, effortlessly, mindlessly, ran until weariness overtook him and he flopped down on the ground, his tongue lolling out the side of his mouth, his sides heaving.</p><p>When his breathing calmed again, he lifted his head and howled at the moon, howled in rage and frustration because even here, miles and miles from Black Dragon Castle, Shanara's image lingered in his mind, and he knew that no matter how far or how long he ran, he would never be able to run away from the fact that he had fallen in love with the daughter of his sworn enemy.</p><p>But he wasn't ready to face that revelation now, or ponder the possibilities and problems. For now, he wanted to run with the wolves.</p><p>Chapter 12</p><p>Reyes ran through the night, sometimes alone, sometimes with a pack of friendly wolves. They chased each other playfully through the darkness, howled their success when they brought down a deer.</p><p>And always, in the back of his mind, was the woman. Shanara. His bride.</p><p>It was just after dawn when Reyes returned to the outer wall of the keep where he had left his clothing and took on his own shape.</p><p>Had all his senses not been centered on the woman sleeping in his bed, he might have realized sooner that something was amiss, but his whole being was focused on returning to his chambers and slipping under the bedcovers beside his bride.</p><p>Too late, he realized he was not alone.</p><p>Feeling the hairs rise along his nape, he turned and came face-to-face with the man he had sworn to kill. Instinctively, he reached for his sword, only then remembering it was lying on the ground beneath his clothing.</p><p>He lowered his hand as Montiori's laughter filled his ears.</p><p>\"And so,\" Montiori said, \"you sent for me, and I am here.\" Dismounting, he tossed his horse's reins to one of his men. With his hand resting on the hilt of his blade, he circled Reyes. \"I must confess, your battle attire is not what I expected.\"</p><p>The hearty laughter of Montiori's men filled the early morning air, then stilled abruptly as Montiori drew his weapon and laid the edge of the blade against Reyes's throat. \"Where is my daughter?\"</p><p>\"I am here, Father.\"</p><p>Reyes felt his insides grow cold as Shanara ducked through the hole in the wall, even as the fact that she had come out to meet him upon his return filled him with a wave of tenderness.</p><p>\"She is no longer your daughter,\" Reyes retorted, wincing as the blade nicked his skin. \"She is my wife.\"</p><p>Montiori's eyes narrowed ominously. \"You have defiled my daughter,\" he said coldly. \"And for that you will die, as will she. I'll have no half-human whelps as my kin!\"</p><p>Reyes looked at Shanara, fully realizing for the first time how much he had come to love her. No matter what fate awaited him at her father's hands, he would not see her killed. Shanara's life was more important than his need for vengeance, more important to him than life itself. His only hope of saving her was to confess that he had not touched her and hope that Montiori would believe him and return Shanara to her family home.</p><p>\"I have not defiled her,\" Reyes said quietly. \"Kill me if you must, but do no harm to Shanara. She is yet a maid untouched.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Do you think I would believe one such as you?\" Montiori asked scornfully.</p><p>\"Believe what you will. I speak the truth.\"</p><p>\"We shall see. Melena! Attend me!\"</p> <p>There was a restless stirring among the men as they stepped aside to make way for their lord's witch.</p><p>Reyes stared at the woman. She was small and spare, hardly bigger than a child. Though she was now old and bent, he could see she had once been a beauty. Her hair, once golden, was now dull and streaked with gray. Her skin was wrinkled and leathery, but her eyes still held the fire of youth.</p><p>She stopped in front of Reyes, a cackle rising in her throat. \"I know you,\" she said, poking her finger in his chest. \"You look much like your father before you.\" Her hand curled around his biceps. \"Tall and strong, just like him, you are.\" Her fingernails were long and sharp and she raked them down his chest, then turned and looked up at Montiori. \"You summoned me, my lord?\"</p><p>\"Before I take his head, I want to know if he speaks the truth.\"</p><p>With a nod, Melena turned her attention back to Reyes. \"The truth,\" she murmured, \"we must have the truth.\" She placed a gnarled hand over his heart, her eyes burning into his. \"Do you speak the truth?\"</p> <p>Reyes clenched his hands as he stared at the witch who had cursed his father. \"My words are true,\" he replied. \"I have not defiled Shanara, nor will I.\"</p><p>The earth seemed to hold its breath as Melena stared into his eyes. The horses stood quiet. The birds stilled their songs.</p><p>Melena withdrew her hand from Reyes's chest. \"It is as he said,\" she admitted reluctantly. \"The girl is as yet untouched.\"</p><p>Montiori's hand tightened on the hilt of his sword. \"So it ends,\" he said, and drew back his arm.</p><p>\"No!\" Shanara's cry rent the stillness that hung in the air. She ran toward Reyes as though her feet had wings, throwing herself between her husband and her father. \"You will not hurt him!\" she cried. \"You will not!\"</p><p>\"Get out of my way,\" Montiori demanded, his face mottled with rage. \"Get out of my way or you will be the first to die!\"</p> <p>Shanara lifted her head, exposing her throat. \"Then strike me down. I will not live in a world without him.\"</p><p>Grasping Shanara by the shoulder, Reyes thrust her behind him. \"This is between you and me, Montiori. She has nothing to do with it.\"</p><p>\"Indeed.\" Montiori lowered his sword. \"Long have I waited to add your pelt to that of your father's. Assume the guise of the wolf now, and I will spare the girl's life.\"</p><p>\"Reyes, no!\"</p><p>\"Be still, daughter!\" Montiori said.</p><p>\"First let Shanara return to the keep,\" Reyes said, an unwanted note of pleading in his voice. \"It is hers now, by right of marriage.\"</p><p>With a shake of his head, Montiori laid his sword against Reyes's throat once more. \"The girl is mine.\" He grabbed Shanara by the arm and pushed her toward one of his men. \"You have nothing to bargain with, Reyes, only the choice to die as a wolf or as a man.\"</p><p>\"Or not at all.\" The words, softly spoken, were uttered by Melena. With a wave of her hand, the witch conjured a sword from midair and tossed it to Reyes.</p> <p>Taking a step backward, Reyes caught the sword by the hilt, his gaze never leaving Montiori's face.</p><p>Montiori stared at Melena. \"Traitor!\" he hissed, then, without warning, he lunged toward Reyes.</p><p>Shanara ceased struggling against the man who held her, all her attention now centered on the two men crossing swords. It was a strange battle. Considering the fact that her father was attired like a king and Reyes was startlingly nude, it might have appeared comical had it not been so deadly serious.</p><p>The clang of metal striking metal filled the air, obscene in the stillness that had settled around them. Her father fought like a fury, the love of battle shining in his eyes as he drew first blood. Confident of victory, he pressed his attack again and again.</p><p>Reyes parried every thrust, his movements smooth and unhurried, his rage fueled by the blood oozing from the gash in his arm. For this moment, there was nothing else in all the world but his opponent. It didn't matter that Montiori was Shanara's father, or that Shanara was watching him, her hand pressed to her heart. Nothing mattered but avenging his father's death. It was fitting, somehow, that Montiori had come to battle wearing the cloak lined with the thick black pelt that had belonged to Reyes's father.</p><p>With a cry, Reyes carried the attack to Montiori. His blade slashed through the air, slicing Montiori's left arm open to the bone. He struck again and yet again, his sword opening wounds in Montiori's right thigh and side.</p><p>Panting heavily, both men fell back.</p><p>Montiori staggered toward his daughter and then, to the surprise of all who watched, he grabbed her by the hair and laid the edge of his blade against her throat.</p><p>Montiori sneered at Reyes. \"You will surrender,\" he said. \"You will lay down your sword now, or she dies.\"</p><p>Without hesitation, Reyes tossed his weapon aside.</p><p>A low murmur of disapproval ran through Montiori's army.</p><p>A muffled oath emerged from Melena's lips.</p><p>Reyes ignored them all. He had eyes only for Shanara.</p><p>Smiling triumphantly, Montiori flung Shanara aside. He strutted toward Reyes, then raised his sword in both hands, prepared to strike.</p><p>Reyes kept his eyes fixed on Shanara, determined that her face would be the last thing he saw in life.</p><p>But the blade did not fall.</p><p>Puzzled, Reyes darted a quick glance at his executioner. Montiori stumbled backward, the sword falling from his hands. Blood bubbled from his nose and mouth and then, with a strangled cry, he pitched forward and lay still.</p><p>Shanara threw her arms around Reyes's neck, her words incoherent as she showered him with kisses.</p><p>\"What happened?\" Reyes asked, surprised to find himself alive and his enemy dead.</p><p>Shanara shook her head, then kissed him again.</p><p>Reyes put his arm around her and drew her to his side as Melena made her way toward them.</p><p>\"Why?\" he asked the witch. \"Why did you not let Montiori kill me?\"</p><p>\"Because Shanara loves you,\" the old crone said. \"And because I love Shanara.\" Melena pointed a gnarled finger at Reyes, her dark eyes glittering. \"Be good to my girl else a worse fate come upon you than the one you had.\"</p><p>\"Had?\" Reyes asked, frowning.</p><p>\"Aye. Shanara's love for you has broken the curse. But beware, Reyes, I will be watching how you treat her.\"</p><p>Reyes smiled at his bride, then looked back at Melena. \"Have no fear, old mother. I will spend the rest of my life making Shanara happy, starting now.\"</p><p>And so saying, he swung his bride into his arms and carried her home.</p><p>EPILOGUE</p><p>Reyes sat on the edge of the bed, watching as his wife slowly disrobed. A month had passed since Montiori's death. For a time, he had regretted the fact that Melena had killed Montiori, thereby robbing Reyes of his chance to avenge his father's death. Later, he realized the witch had done him a favor he could never repay. Though he knew Shanara would have forgiven him had he killed her father, he was grateful that her father's blood was not on his hands, that his death did not stand between them.</p><p>Much had happened since then. Montiori's eldest son had assumed leadership of the Montiori clan and there was now peace between their people.</p><p>Melena had foretold that Shanara would bear Reyes twin sons within the year. To that end, the witch had moved into Black Dragon Keep to be near the infants and to care for Shanara after the birth.</p><p>Reyes felt his breath catch in his throat as Shanara removed the last of her undergarments to stand gloriously naked before him. How beautiful she was, with her hair falling over her shoulders and the lamplight bathing her face with a soft golden glow.</p><p>Murmuring her name, he drew her into his lap. \"Are you happy here, with me, my beloved?\"</p><p>She kissed the tip of his nose. \"Need you ask, my lord?\"</p><p>\"Indeed, I must. I dare not take a chance on angering Melena. Who knows what evil might befall me should she find you looking displeased?\"</p><p>Shanara smiled at him, her eyes twinkling. \"Then perhaps you should do this.\" Her hand caressed his chest. \"Or this.\" She kissed the corner of his mouth. \"Or this...\" Her hand slid down his naked belly, eliciting a groan of pleasure from his lips.</p><p>\"You have but to command, my lady,\" he said. And capturing her lips with his, he drew her down on the bed and did his best to make his wife happy that night, and every night for as long as they lived. </p> </body></html>"]