["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter one</p><p>Darcy Michaels adjusted her gloved grip on her toolbox and picked her way carefully over the charred remains of her favorite candy store. Around her, firefighters moved through the smoldering ruins, checking every crevice and corner to be certain the fire was completely extinguished. Water dripped from the blackened walls and ceiling to puddle on the floor below, and the smell of smoke and burned sugar clung to her nostrils and skin, sinking into the very fiber of her uniform.</p><p>“Third one in as many weeks,” James Ralston muttered behind her. “I’m sorry, Darcy. I know you loved this place.”</p><p>She stopped and faced her mentor, her chest gripped in a vise of pain. Like the two previous fires, this blaze had destroyed a location that was dear to her and had held precious memories. She’d celebrated her twelfth birthday at the Sweet Spot candy shop, and she stopped by every Friday to stock up on the sour lemonade straws her sister had turned her on to.</p> <p>Focus on the details, Darcy. Don’t lose it now.</p><p>“Whoever the arsonist is,” she said, “he’s not going to quit. He’s been doing this too long. It’s in his blood.”</p><p>The frequency of the acts and the terrible brilliance of the timed-delay incendiary devices being used spoke of someone who’d had time to perfect his madness.</p><p>She couldn’t help feeling violated, despite knowing how irrational that response was. As much as she’d wanted to leave Lion’s Bay as a kid, she couldn’t even contemplate abandoning the sleepy seaside town now. The same memories that had driven her parents to move away kept her bound to the area.</p><p>“I don’t know what to make of it.” Jim’s forest green eyes were warm with compassion and intent on her face. “We don’t have any new residents and it’s the off-season. Tourism is down. Anyone not from around here sticks out like a sore thumb.”</p> <p>She turned in a slow circle, her trained gaze following the burn patterns he’d taught her to read.</p><p>“This guy didn’t just crawl out of the w-woodwork,” she said, startled to hear her voice cracking. She cleared her dry throat. “I think we need to bring the big guns in on this.”</p><p>“Miller’s doing a good job. He’s meticulous and thorough.” He touched her elbow lightly. “You don’t want to be the one who steps on his toes.”</p><p>Darcy nodded, acknowledging the sensitive nature of her relationship with the town’s sheriff. “I know, but I think he needs more resources, and I think he’s too stubborn to ask for help.”</p><p>The last time the Feds had come in, they’d run roughshod over Chris Miller and his deputies, cutting him out of the loop while draining his limited resources. She remembered that tense time all too well, because the murder they’d been investigating had been the tragedy that brought her home. “And frankly, Chris’s ego is the least of our problems.”</p><p>“Let’s gather the evidence, then we’ll discuss the next best steps.” Setting his hand on her shoulder, Jim gave her a reassuring squeeze. “Maybe you should stay with someone tonight?”</p> <p>Reaching up, she set her hand over his. He knew her so well.</p><p>She wanted a particular kind of support, the kind where someone was nearby if she needed them but out of her way if she wanted time to just retreat with her thoughts.</p><p>Her gaze met Jim’s and he read her mind. “My couch is always open to you, Darcy. You know that.”</p><p>She nodded. “Thank you.”</p><p>“Anytime.”</p><p>Turning away, Darcy looked for a place to set down her kit and begin.</p><p>ROLLING OVER WITH a sigh, Darcy looked at the clock over Jim’s fireplace mantel and noted the time: quarter after five. It was still dark outside and she’d been tossing and turning all night, too wired by her restless thoughts to catch the sleep she desperately needed. There was something about the fires that was niggling at her, but she just couldn’t place it. Turning it over and over in her mind wasn’t bringing the answer she was looking for to mind.</p><p>Sitting up, she rolled her shoulders back, knowing what had to be done. She wanted her treasured equanimity back, and the only way to make that happen was to find the psycho who was stealing it from her and see him in a cage. The sooner, the better. A possible pissing match between authorities wasn’t going to be enough to hold her back. So far no one had been hurt, but their torch was barely catching his breath between fires. If he kept to his established pattern, they had only days before he struck again.</p> <p>A warm exhale over her toes brought her attention to the handsome German shepherd sprawled on the floor at the foot of the couch. When her brief relationship with Jim had fizzled out, she’d felt the loss of his dog keenly.</p><p>“Thanks for watching out for me, Columbo.” Reaching down, she scratched behind his ears.</p><p>The residents of Lion’s Bay were paying her to provide the same service to the town—to watch out for them and keep them safe.</p><p>She wasn’t going to let them down.</p><p>Chapter two</p><p>Deputy U.S. Marshal Jared Cameron waited until the Lion’s Bay sheriff sucked in a deep breath mid-rant, then he glanced at his partner.</p><p>“This winner is all yours,” he drawled, turning on his heel and leaving Deputy Trish Morales to it. She’d been assigned to him for just that reason: she had the patience of a saint and he had no patience at all. Especially not for defensive, posturing small-town authorities who whipped their dicks out and started marking their territories the moment he rolled into town.</p><p>“I’m not done. Where the fuck is he going?” Sheriff Miller snapped, followed by a far more modulated reply from Trish.</p><p>Idiot. Nothing trumped the U.S. Marshals Service’s silver star.</p><p>Jared closed the sheriff’s glass inset door behind him just to shut out the man’s voice. Pushing the irritation from his thoughts, he started through the bull pen toward the exit when an unexpected and unwanted complication walked into the station. He took scant note of her initially, but something drew his attention back.</p><p>Grudgingly he slowed, then came to a stop. Whoever she was, she was a bombshell. Not in the physical sense. In that regard, she was of average height, slim, and moderately proportioned. Her face was free of cosmetics and her brown hair was pulled back in a casual ponytail. If he’d been looking at a photo of her, he wouldn’t have looked twice. But in the flesh, watching her move, was what snared him.</p><p>She was hot monkey sex in a brown paper wrapper.</p><p>The secret of her was revealed in the sensual fluidity of her body and her heavy-lidded, bottle green eyes. The primitive male in him recognized the attraction instantly, completely disregarding his brain, which didn’t have time for this sort of distraction. Unfortunately for him, the blue uniform slacks and embroidered white button-up shirt she wore told Jared he had no chance of avoiding her unless he wanted to switch with Trish and take point with Miller instead. He was stuck with deciding which part of his anatomy was going to be the least controllable: his fists or his dick.</p><p>Maybe he’d be lucky and she would be happily married with kids, therefore not the least bit interested in getting sweaty and dirty with him.</p><p>She was lost in conversation with the female deputy manning the front desk when he approached. The glance she shot him was cursory, just as his had first been with her. Then it snagged. Her focus zeroed in, sliding over his body from the top of his head down to his scuffed work boots and back up again. When her gaze collided with his, she sucked in a breath and licked her lower lip.</p><p>Fuck. He was screwed. His brain was screaming at him to turn his ass around and take his chances with the sheriff instead. Assaulting the local authorities for getting on his last nerve would garner him less trouble than playing with the sizzling awareness arcing between him and the sexpot fire inspector.</p><p>“Here he is,” the deputy said unnecessarily, pointing at him.</p><p>Jared thrust out his hand and introduced himself. The moment his palm touched the bombshell’s, his blood rushed south and gave him a semi. He looked at her left hand almost desperately, cursing the lack of a wedding ring. A simple gold band would’ve killed his interest right then and there.</p><p>“Darcy Michaels,” she replied, in a voice pitched high enough to be this close to girlish. “I’m a fire inspector with the Lion’s Bay Fire Department.”</p><p>The pretty blond deputy at the front desk smiled at him with the same invitation she’d given him when he first walked in. “Darcy’s the one who asked me to put out the information about the arsonist.”</p><p>The blonde was the type of woman he preferred to fuck—attractive enough to stir the most superficial interest and easy enough to want nothing more than a good time. Darcy Michaels was rousing something far deeper, igniting a hunger that was full-bodied and complex. The kind that overrode a man’s better sense.</p><p>Giving himself a mental kick in the ass, Jared caught the inspector’s elbow and steered her toward the exit. “Let’s go.”</p><p>They’d barely stepped outside when she said, “You got here quick, Deputy.”</p><p>He considered her voice. It was a cross between Marilyn Monroe and Jennifer Tilly. If anyone had asked him that morning what he thought of girly voiced women, he’d have said they annoyed the shit out of him. It was just his damn luck that Darcy Michaels was the exception. Every time she opened her mouth, his mind went straight into the gutter.</p><p>Harder, Jared. Deeper...</p><p>Christ. His teeth grit.</p><p>“We have to move quickly,” he bit out, trying to regain his focus. “If he keeps to his pattern, he’ll burn something else before the week is out. What have you got so far?”</p><p>She gestured down the street to a brick-faced fire station. “My office is over there. Do you have a suspect in mind? You came because you recognized the MO, right?”</p><p>“It’s similar to a known arsonist, yes.”</p><p>“We’re three weeks in with him. Where was he four weeks ago?”</p><p>“No clue.”</p><p>Frowning, she persisted, “So there are intervals between bursts? How long?”</p><p>“Twenty years. Give or take.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She stumbled to a halt. “Are you kidding?”</p><p>He scowled for a variety of reasons, one of which was that her arm had slipped free of his grasp when she’d stopped abruptly. “Why would I?”</p><p>“Is he a recent parolee?”</p> <p>“Escapee,” he corrected. “Seventeen years ago. He torched a bathroom in the courthouse during an appellate hearing and escaped in the ensuing clusterfuck. Haven’t seen hide nor hair of him since. But the supervisory deputy marshal in the Seattle office helped to apprehend Merkerson the first time, and she recognized the pattern.”</p><p>Darcy’s frown cleared. “Merkerson. That’s it! I’ve been trying to place the MO. He was way before my time, but we studied him briefly in school. What the hell has he been up to all these years? How has he stayed under the radar?”</p><p>“He might have been incarcerated under a false name or out of the country. Or he might have trained a junior asshat to follow in his nutjob footsteps. It doesn’t matter. We’re going to nail the bastard.” Grabbing her elbow again, Jared urged her toward the fire station.</p><p>“The hell it doesn’t matter. In just three weeks, he’s torn this town apart.”</p><p>He heard the fury underlying her words and made note of it. Personal involvement clouded judgment. One of the many reasons why spending time with her was a really bad idea. He was already feeling the effects. While his brain was working the case, his body was straining toward hers, wired and revved and hot to screw her raw.</p> <p>They were about to cross the street to the fire station when he urged her into a corner diner instead.</p><p>“I missed lunch,” he explained, hoping low blood sugar, not his hormones, was responsible for handicapping his common sense. He could fix the former.</p><p>“I just ate. But I’ll grab a shake.”</p><p>Another mark in her favor, he thought. A woman who might not be counting every damn calorie she put in her mouth.</p><p>He nearly groaned as visions of other things she could do with her mouth swept through his testosterone-muddled mind. If he’d needed any proof that he was working too hard and not playing enough, he had it now. He should take the blond deputy up on her offer and ease himself down a notch.</p><p>Reaching the counter, Jared grabbed a menu from beside the register and ran a quick glance over the limited offerings. It was a burger-and-fries joint, with a couple salads thrown in for the calorie-conscious.</p> <p>A waitress in a ’50s uniform with “Ginny” embroidered over her heart approached with her notepad and a smile. “Hey, Darcy. You brought the Fed with you. Bet Miller’s in a snit. I know how he gets when outsiders come in.”</p><p>“How do you know everything?” Darcy looked genuinely impressed. “I just found out that the Marshals Service was here not more than five minutes ago.”</p><p>Ginny shrugged. “Prime location for news. Welcome to Lion’s Bay, Marshal.”</p><p>“Deputy,” he corrected, his attention returning to the menu. “Thanks.”</p><p>“How are you doing?” Darcy asked Ginny with the easy familiarity of old friends.</p><p>“Better. Just had a new security system installed this morning. It’s supposed to sense heat and alert the alarm company. And I had our existing fire alarms rechecked a couple days ago to make sure everything is working properly.” Ginny jerked a thumb over her shoulder at the bulky-looking chef visible through the kitchen pass-through. “Tim joked about retiring on the insurance if the place burned. He slept on the couch last night for that one.”</p><p>“Oh, hell. Ginny, I’m sorry. I—”</p><p>Jared stepped into the conversation before she could say anything further. “Proactive, thoughtful steps, Ginny. Good job. If your burgers are half as good as your planning, I’ll order a double.”</p> <p>Ginny grinned at the praise. “Big strapping man like you, absolutely.”</p><p>“Suggestions?”</p><p>“Depends. Hot or sweet?”</p><p>“Both. I’m starved.”</p><p>“One chipotle bacon BBQ double-cheeseburger and fries coming up. Everything on it?”</p><p>“Yeah. And two of whatever kind of shake Inspector Michaels wants. All to go.”</p><p>Jared paid the bill, waving off the five-spot Darcy pulled out of her pocket.</p><p>Closing the register, Ginny stepped away to make the shakes, leaving Darcy standing there with a grim expression. He gestured her over to a red vinyl booth by the window.</p><p>“So,” he began when she sat. “How often has Lion’s Bay had cause for the Feds to come in?”</p><p>One of her brows arched and she sized him up. The caveman in him beat his chest at the challenge. Damn it, he hadn’t been this interested in a woman in a long, long time.</p><p>It was a good thing she had some fire to her. When he got her beneath him, he wasn’t going to be gentle...</p><p>Fuck that. What the hell was he thinking? He was not going there.</p><p>“Just once,” she answered.</p><p>“When?”</p><p>“Three years ago.”</p><p>“Why?”</p><p>She hesitated just a second, but he caught it. “A local woman was murdered.”</p><p>“What made that interesting?”</p><p>Her lips pursed and her eyes took on a hardness that startled him.</p><p>“Don’t glare at me, Darcy. It’s a valid question. The Feds have bigger fish to fry than a small-town murder. What caught their interest about this one?”</p><p>She exhaled in a rush. “The MO was a match to a serial killer they were looking for.”</p><p>From the moment Darcy had spotted Jared Cameron in the police station, she’d known he was going to tear through her orderly life like a whirlwind.</p><p>His looks had knocked her back first. It had taken everything she had to keep her mouth from falling open when he’d walked up to her epitomizing the description of tall, dark, and dangerous. Then, he’d swept her right out the door, his touch sending tingles racing up her arm and through her body. Now she was sitting across from him, faced head-on with how seriously freakin’ delicious he was. Her mother would call him a “cool drink of water,” but Darcy wouldn’t. Every time their eyes met, her mouth went dry. Despite his purely professional discourse, the way he looked at her with those electric blue eyes was with raw animal hunger.</p><p>And damned if she didn’t want him right back. It was a primal response she couldn’t suppress. Socially, he was gruff and abrupt, so she was inclined to imagine him screwing her senseless without talking. Sweaty, grasping, grinding fucking. That’s what he radiated with his agitated energy and fierce gaze, and she was sold. It had taken his force-of-nature energy to make her realize she’d been dead for a while. A no-holds-barred one-night stand was just what she needed to knock the dust off.</p><p>“Which serial killer?” he asked in that clipped rough voice that brought to mind golden whisky in a crystal tumbler. He brushed back a lock of inky black hair with a careless hand, and she couldn’t help but notice the veins coursing along his powerful forearms and biceps. He was perfectly built to her tastes—lean, ripped, and not the slightest bit bulky.</p><p>“Some guy from the Midwest who carved Mayan symbols in his victims’ torsos.”</p><p>“The Prophet.” Jared leaned back in the booth, the casual pose doing little to soften him. “Counting down to doomsday. Sick fuck.”</p><p>Her brows rose. “Is that your professional opinion?”</p><p>“In my professional opinion, he was a whack job. And so is this guy torching your town.”</p><p>She almost smiled. Jared Cameron was a blunt object, no doubt about it, but it made her feel better knowing he was here. She couldn’t fathom anyone getting anything over on him.</p><p>“Listen.” His fingertips drummed on the table. “You can’t carry around guilt and blame for these fires.”</p><p>“I’m not.”</p><p>“Bullshit. The waitress tells you she’s taking steps to protect her property and you start apologizing like it’s your fault.”</p><p>Darcy’s hackles rose. “This is a small town, Deputy. People around here aren’t exactly rolling in the dough. She spent—”</p><p>“The name’s Jared. Use it.”</p><p>“You’re just full of charm, aren’t you?”</p><p>“You don’t want charm, and we’re talking shop.”</p><p>“How the hell would you know what I want?”</p><p>“Because I want the same thing.” He leaned forward and lowered his voice, his blue eyes burning like flame. “I want it so badly my dick’s been half hard since the moment I saw you.”</p><p>Arousal swept through her like a sudden fever, flushing her skin. No man had ever talked to her so crudely, so there’d never been a chance for her to learn it turned her on. Now she knew, and she couldn’t help but wonder if he’d be vocal in bed. Just thinking about him growling raunchy and obscene statements while screwing her made her ache with desire. She struggled not to squirm, but she couldn’t resist goading him for more. “And what is it we both want, Deputy?”</p><p>He didn’t move a muscle for a moment. Then his lips curled on one side in a wickedly carnal smile. His eyes glittered with fierce, hard lust. “You want a sheet-clawing, back-arching, mind-blowing fuck, and I want to pound my cock into you until I’ve come my last drop.”</p><p>Darcy sagged into the seat back, her hand lifting to her throat. “Whew.”</p><p>Her pussy throbbed greedily, the tender folds slickening with her growing hunger. She’d known the man less than twenty minutes, but she was suddenly quite committed to knowing him even better. Well, his body, at least...“You’re on. My workday ends at six.”</p><p>The deputy’s nostrils flared. Anticipation sharpened the blades of his cheekbones and made the precisely drawn lines of his beautiful mouth harsh. She could say, in all honesty, that he was the most gorgeous man she’d ever seen.</p><p>“I’m gonna regret this,” he muttered, scowling at her.</p><p>Oddly, his reluctance about wanting her only spurred her desire to have him. It betrayed how intense his attraction to her was, so much so that he couldn’t fight it even though he wanted to. And she responded as any red-blooded woman would to the ferocious sexual need of a deliciously handsome, potently masculine creature: she provoked him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Leaning forward, she whispered, “No, you won’t. You’ll be seeing stars when I’m done with you.”</p><p>“Christ.” Grimacing with discomfort, he arched his hips up from the seat and adjusted the fit of his jeans.</p><p>“Back to the shoptalk,” she said, inwardly smiling with female triumph and heated expectation. “Ginny spent money she likely doesn’t have on safety precautions that won’t do her a damn bit of good. You know how Merkerson works. If he goes after this diner, he’ll do it in the bright light of day right under her nose.”</p> <p>And later, after the diner closed and the streets were quiet, the devious little time bomb would explode and engulf the structure in flames within moments.</p><p>“You heard what she said,” Jared argued, rallying. “She feels better. And whether or not the modifications she made were necessary in this particular instance, they were still smart.”</p><p>“It’s my job to help make her feel safe, and clearly she wasn’t feeling that way.”</p><p>“Right.” His gaze bore into her. “And people should sleep with their doors open because we have law enforcement.”</p><p>“Not quite the same thing.” The residents had been horrified at the first fire but trusted her and Jim to deal with it. The second fire had made things a little shakier, but they’d still been sure an arrest was imminent. By the third fire, people stopped thinking the authorities were just a step away from catching the arsonist and they started thinking about fending for themselves.</p> <p>“Get over yourself, Darcy. Unless you totally fucked up the evidence collection and analysis, you’ve done your job and you’re continuing to do your job by sending for help when you need it. Pat yourself on the back and give props to the people who are thinking forward instead of backward.”</p><p>“I’m not sure if I like you or not.”</p><p>“Don’t like me. Let’s keep this simple.”</p><p>She nodded without hesitation. After all, she was willing to indulge herself with him precisely because he was just passing through. Anything more than sex was beyond her at this point in her life. “Works for me.”</p><p>He was on his feet before Ginny reached their table with a takeout bag of food and a cardboard drink carrier. “Let’s go, Inspector. We have a lot of work to get through between now and six o’clock.”</p><p>JARED SET THE take-out bag down on the desk in Darcy’s office and swept the narrow room with an examining glance. As he dug out his foam box, he considered the logistics of nailing her on the six-foot-long folding table set beneath the window that looked into the firehouse’s heavy apparatus bay. Unfortunately, its flimsiness wouldn’t hold up to the abuse, and it certainly wouldn’t be professional, although a quickie would do a lot to restore his concentration. He didn’t trust her desk, either, with its ultramodern glass top artfully balanced on a network of thin chrome bars.</p> <p>“Miller’s bark is worse than his bite, by the way.” She reached around him for her shake, and he breathed her in, smelling warm clean woman.</p><p>The sheriff was in his mid-thirties and an obvious devotee to free weights, but he was no threat. Jared had spent six years with Delta Force before he’d joined the U.S. Marshals Service’s elite Special Operations Group. There wasn’t a human alive he couldn’t severely maim or kill.</p><p>“My partner will deal with Miller. Even if she feels like killing him, she’ll restrain herself.” He took a bite out of his burger before occupying one of the two chairs in front of her desk. Pausing midchew, he mumbled an awed, “Holy shit.”</p><p>Her lips curved around her straw. “Damn good burger, isn’t it?”</p><p>He swallowed. “Insanely.”</p><p>It was nearly as good as she looked when she smiled. You’ll be seeing stars when I’m done with you. Fuck of it was, he was inclined to believe her. She was doing a number on him already without even trying. What would she do to him if she put some effort into it...?</p><p>She rounded the desk and pulled open the top drawer of the filing cabinet. His gaze moved from her to the wall of cantilevered glass and chrome bookshelves behind her. Either the city invested a lot in the comfort of their civil servants or she’d spent her own dime dressing the space up. He was inclined to think that the utilitarian gray metal folding table and chairs were provided courtesy of the city. The run-of-the-mill filing cabinet, too. But the bookshelf unit and matching desk were all her—strong, eye-catching, and sexy. And the indulgence suggested that she spent a lot of time working...or felt the most at home in her office.</p><p>His gaze caught on a silver-framed picture on a shelf behind her. It was a snapshot of her when she was younger, wearing a cheerleader uniform and standing with her arm thrown across the shoulders of a mirror image of herself dressed in a band costume.</p> <p>“You’re a twin.”</p><p>She pushed the drawer shut and returned to the desk, setting three manila folders on the glass. “Yes.”</p><p>He wondered if her sister was anything like her. Maybe Darcy was the naughty twin. The thought made his overeager dick harden all over again. The word “naughty” thought of in conjunction with “Darcy” seemed to have that now-predictable effect on him.</p><p>“Shall we start with the first fire?” she asked, moving right along.</p><p>He resumed eating and nodded, but found himself slightly irritated by her lack of elaboration, which was a stupid response. Keeping things simple meant keeping them impersonal. He should be glad she was on the same page.</p><p>Pulling the bottom file free, Darcy opened it and began to carefully spread out photographs on her desk. Aside from a quirky blown-glass pen holder and red metal toolbox, there was nothing cluttering the pristine surface.</p><p>Jared chewed on a perfectly crispy French fry and studied the crime scene photos. She began to explain what he was looking at.</p><p>“The fire began at approximately ten o’clock in the evening. The owner locked up at eight. It started here,” she pointed to the third picture, “in the hallway outside the restrooms.”</p><p>“It was a brick-faced building?” he queried, noting the rubble.</p><p>“Yes. Florinda’s Dance Studio took over the old firehouse after the town moved all the civil services into this one area and called it a town square.” Darcy pulled another photo out of the file, this one a close-up framed with an L-square ruler, and set it in front of him. “See these curled aluminum shavings? They tested positive for traces of white phosphorous. It’s likely that the incendiary device was hidden in a soda can dropped into a waste bin.”</p><p>“Interesting.”</p><p>“You know what I think is interesting?” Setting her palms on the desktop, she leaned forward. “An arsonist who picks a brick building. There are buildings in Lion’s Bay that have been around for over a century. Good, old-fashioned wood-sided and shingled structures that would light up like a match, in areas where other buildings nearby would light up just as quickly.”</p><p>He’d been thinking along those same lines. “Any possibility this is insurance fraud?”</p><p>“With the extra fires being a deflection? The incendiary device is too sophisticated for a dabbler. Our subject is a pro.”</p><p>“Right. Go on.”</p><p>“Structure number two was an old animal shelter, built mostly from cement block.” Darcy slid the photos from the first fire into a neat pile and put them away before grabbing the second folder. She set the new photos out with care. “This location is very out of the way, but there’s a lot of vegetation. It might’ve gotten ugly if we hadn’t just had days of rain that saturated the area.”</p><p>Jared dragged one of the photos closer. “You received the anonymous tip about this fire, correct?”</p><p>“Yes.”</p><p>After he examined the images, she put them away and showed him the most recent property casualty.</p><p>“What was this place?” He eyed the unidentifiable twisted shapes that lined the floor along the walls.</p><p>“A candy shop. Those weird-looking things used to be the plastic bins the candy was kept in. The store shares a wall with a costume jewelry shop. The sophisticated fire alarm system ensured we responded quickly. The jewelry store sustained only minor damage.”</p><p>Shutting the lid of his empty food container, Jared stood and moved to the map pinned to the wall. Three red arrow stickers marked spots. “Are these where the fires took place?”</p><p>“Yes.”</p><p>He heard her put the files away while he studied the seemingly random locations. Different parts of town, different types of businesses. He sucked down the rest of the best shake he’d ever had, and said, “Let’s head to the dance studio.”</p><p>“It’s been three weeks. There’s nothing left to find.”</p><p>“It’s not evidence we’re looking for.” He met her gaze as she straightened. “The subject saw something in these targets that we’re not. If we’re going to get inside his head and anticipate his next moves, we need to figure out what’s catching his attention.”</p><p>“I’ve pored over everything until my eyes bled. I can’t see anything but random chaos.”</p><p>“A fresh perspective never hurts.” She’s reluctant to go back, he realized, wondering why and hoping that seeing her at the location would give him a clue.</p><p>“Hey.”</p><p>Jared turned toward the open doorway and the man who leaned casually into the frame there. His uniform of short-sleeve white dress shirt and navy slacks was the same as Darcy’s, except for a few extra patches on the sleeves and some gold braiding.</p><p>“Hey, Jim.” Darcy quickly introduced them.</p><p>Chief Fire Inspector James Ralston straightened and shook Jared’s hand, taking his measure with a sweeping glance. “I just heard that Darcy called in the cavalry. Hope you can help us nail this bastard.”</p><p>“Working on it.”</p><p>“Do you want to take over?” Darcy asked. “Deputy Cameron wants to check out the studio. You’ll be more help to him than I’ll be.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’ll be fine.” Ralston’s eyes softened when he looked at Darcy. “And I can’t go anyway. The mayor has me reinspecting all the public buildings as part of a planned overhaul of the alarm systems.”</p><p>“Panic’s spreading,” she muttered, pulling a set of keys out of her pocket. “Don’t let them keep you out all night.”</p><p>“I won’t, but I may be late. Let yourself in if I’m not there.”</p> <p>She shook her head. “Thank you. I’m fine.”</p><p>Frowning, Ralston asked, “You sure?”</p><p>“Don’t worry about me. I’m good.”</p><p>“Okay, then. See you tomorrow.”</p><p>The man left, but Jared’s jaw didn’t relax even then. “He’s a little old for you, isn’t he?”</p> <p>Darcy paused in the act of rounding her desk. “Excuse me?”</p><p>“He’s what? Forty? Forty-five?”</p><p>“We’re not talking about this.” She walked right past him.</p><p>Damn it, when she got stern in that voice of hers, it made him hot. He’d just reached the point of being too occupied by his work to pay attention to her sex appeal, then Jim Ralston had fucked it all to hell by showing up and starting a territory war.</p><p>Jared followed. “How long has it been over between you two?”</p><p>“Long enough.”</p> <p>“For you, maybe. Not for him.”</p><p>“You’re way off base.” She strode right out of the open bay door and into the parking lot, making a beeline for a city-owned pickup truck with emblems on the door and a light bar on the roof. “He was there for me during a rough time in my life. It was never serious and it’s been over for nearly two years—not that it’s any of your damn business.”</p><p>“The hell it isn’t,” he shot back, rounding the front end and yanking open the passenger door. “If he’s going to be a problem, I have a right to know.”</p><p>“He’s not a problem. Drop it.”</p><p>“That bit about you letting yourself into his place was like a dog lifting his leg.”</p><p>She met his gaze through the window. “You don’t have any right to my personal history. You don’t have any rights at all where I’m concerned. You’re a possible good time and that’s it. And even that’s debatable at the moment.”</p><p>“Is it, now?” He glanced at his watch, then slid into the truck and slammed the door shut. It was four thirty. “Let’s go.”</p><p>Chapter three</p> <p>Darcy got behind the wheel and slid the key in the ignition, her thoughts roiling. Backing down from Jared Cameron wasn’t an option. At the tiniest show of weakness, he would steamroll right over her. And the alternative—keeping him at a distance—wasn’t an option she considered for more than a second. She wanted him. Badly. Almost desperately, if she was being honest. So, as overbearing and aggravating as he was, she was inclined to put up with his social Asperger’s if that’s what it took to have him in her bed.</p><p>They drove to what was left of Florinda’s Dance Studio in silence. Jared’s gaze slid back and forth over the city, taking everything in. There was a story behind his precise focus, something that explained the edge to him that set him apart from other law enforcement officers she’d met. He was hyperaware and highly perceptive. He moved like a predator, with an economy of movement and lightness of stride. And he never let his guard down.</p><p>A man hunter. That’s what he was. Someone had spent a lot of money training him to be dangerous. The military, she guessed.</p><p>She parked on the street in front of the studio and got out. There were already bulldozers on the lot and giant Dumpsters to collect the rubble. Her stomach clenched tight with grief and sadness so thick it was hard for her to swallow past it.</p><p>Sucking in a deep breath, she joined Jared at the curb. He turned slowly, examining the surrounding neighborhood.</p><p>Darcy steeled her resolve and moved forward into the roofless ruins, trying to picture the place as it had once been. She was sorry it had been so long since she’d last visited. Her memories were cobwebbed from childhood. There were only faint echoes of bygone times when she and Danielle had playfully competed against one another and shared ballerina dreams.</p><p>“Adults or children?” Jared asked, breaking into her reverie.</p><p>“Excuse me?” She looked at him.</p><p>His gaze narrowed. “Are you okay? You don’t look so good.”</p><p>“Gee, thanks.”</p><p>“Cut it out. You look”—he frowned—“sad.”</p><p>“Both adults and children,” she answered, skipping over the too-close-to-home comment. She was recovering her composure by the moment. Thanks to him, and the aura of strength and security that surrounded him. “And all styles, from ballet to hip-hop to ballroom.”</p><p>“You were a student.” It wasn’t a question.</p><p>She took a deep breath, knowing it would be useless to deflect him. Nothing slipped by him. “A long time ago.”</p><p>He nodded. His hands went to his hips as he looked over what was left. “Considering the size of the town, how large were the classes?”</p><p>“Five to fifteen students. The owners used to be professional dancers. People came from all over the country to study with them.” She pointed at the quaint motel across the street. “They had arrangements for out-of-towners with the Daniels family.”</p><p>“We’ll have to dig into those former students.”</p><p>“Sheriff Miller has been working on that.”</p><p>Jared nodded. “Morales is on it, then.”</p><p>At her questioning glance, he filled in, “My partner.”</p><p>She watched him walk the perimeter of the crumbling brick walls, his cool cop’s eyes taking in everything. Her chest tightened as her past combined with her present, but she put it aside and answered his questions.</p><p>Nearly an hour later, he glanced at his watch and pointed out, “It’s quarter to six.”</p><p>There was a wealth of promise in those words and the heat in his eyes.</p><p>Darcy nodded. He would dull the pain, at least for a little while. “Let’s go.”</p><p>THEY MADE A quick stop at Darcy’s office, where she grabbed the files Jared had perused earlier and swapped out her work truck for a convertible BMW that was incongruous in a town filled with pickups and modest compacts.</p><p>She glanced at him, showing no doubts or trepidation. “Your place or mine?”</p><p>“Dinner first?” he asked, because he wasn’t a completely one-track-minded Neanderthal. Okay...he was. But he didn’t want this go-round with her to be his last. If he was going to ignore his better sense, he might as well do it all the way.</p><p>“Dinner later.”</p><p>Fuck yeah. “Your place, then. Mine is a motel with paper-thin walls.”</p><p>“Right.” She backed up with speedy precision, and the sleek sports car purred out of the parking lot.</p><p>“Drugstore.” He met her gaze when she glanced at him. “I didn’t come prepared for this.”</p><p>She got to the store quick but declined to go in with him. “It’ll be all over town in a half hour anyway, but I’d rather not encourage the spread if I can help it.”</p><p>Once he got inside the store, he realized quickly that she hadn’t been kidding. The woman at the register eyed his purchases with an avid gaze and smiled at him with a delight that rankled. If he’d been any less impatient, he would have had Darcy drive him to the next town to buy condoms. As it was, he made it in and out of the store in less than ten minutes, dropping the bag on the floorboard between his feet when he slid back into the passenger seat. Darcy was turning back onto the street before he got his seat belt on.</p><p>Jared leaned his head back against the headrest and closed his eyes, relishing the slow simmer in his blood. He hadn’t been this eager to get into a woman’s pants in a very, very long time. He was also inordinately curious about Darcy’s home and what it would reveal about her. “How long have you lived in Lion’s Bay?”</p><p>“My whole life, except for a brief stint around college.”</p><p>There was something in her voice that made him open his eyes and look at her. She’d released her ponytail from the elastic band, freeing the chocolate strands to whip around in the evening air. Her head was tilted in a way that could be described only as deeply sensual. She sought the feel of the wind rushing over her skin and through her hair as she would a lover’s caresses.</p><p>He took a deep, slow breath. Darcy was clearly a tactile woman who wanted to be touched. And he was going to touch every inch of her, inside and out.</p><p>They pulled up to a small, dated, one-story ranch-style home. It was so diametrically opposed to what he would have pictured her gravitating to that he thought they’d made another pit stop at first. Then she pulled into the carport on the side of the house.</p><p>He frowned. She was modern, sexy, and fierce. He’d gotten that impression from the way she decorated her office and from the car she drove. But the house she lived in was retro and uninspired. There was a story there. He’d dig it out.</p><p>He followed her to the back door with a deliberately moderated stride, stretching out the last moments of delicious anticipation. There was nothing in the world like the buildup to a mind-blowing orgasm, and there was no doubt that he was minutes away from having the first of many tonight.</p><p>Darcy preceded him up the utilitarian cement walkway to a matching set of three steps and a small porch. She was through the door before he reached the tiny staircase. He climbed slowly, his cock getting harder with every step he took.</p><p>When he reached the threshold of the open door, he paused. Took another deep breath. Let it out. He absorbed the fact that somewhere over the course of a few short hours, fucking the sexy fire inspector had become damn near necessary to his sanity.</p><p>On an intellectual level, he understood the pull between them. He’d spent most of his life studying human behavior and pinpointing how best to hunt and kill men. He was well aware that they were all animals at their core, creatures of instinct and hormonal impetuses. He and Darcy had an explosive attraction at that base level, and neither of them was inclined to fight it. But that didn’t mean he was taking it gracefully. He needed control and unadulterated reason, and Darcy was fucking with both of those. He was hanging on by a thread, and knowing that it was going to snap at any second had him edgy and frustrated. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She stepped into view, unabashedly undressing in the living room. Only the kitchen stood between him and her, the pathway delineated by the preparation/cooking area to his left and an older, sturdily built wood table to his right.</p><p>Her shirt was already off and her arms were reaching behind her, unclasping a sensible bra that was notable only for its color—black—and the saucy red bow that nestled between her small breasts. “Are you going to stand out there all night, Deputy?”</p><p>She was running in overdrive. Christ. Not that he minded, but...</p><p>Actually, he did mind. He was too wound up to just fuck her into a good time and get shown the door. He wanted his fill, needed it, so he could get his damn brain out of his pants and back in the game.</p><p>His T-shirt was already clearing his head when he crossed into the house and kicked the back door closed. He threw the dead bolt and turned back to her, tossing the condoms on the dining table before dealing with his holster, badge, and belt.</p><p>Darcy continued to strip while he did, her movements rushed and without artifice yet still sexy as hell. Those heavy-lidded eyes...the flushed cheeks...the glistening parted lips...</p><p>Everything about her screamed “sex” to him. He almost tripped in the process of toeing out of his boots, and forced himself to stand still while he tore open the button fly of his jeans. The freeing of his engorged cock was such a relief he groaned, a sound he repeated with more vehemence when she kicked off her panties and set her hands on her hips. Waiting. Naked. Ready.</p><p>He grabbed one of the two boxes of condoms and ripped it open, snagging a string of foil-wrapped packages in grasping fingers. Prowling forward, Jared separated one square and caught the rest between his teeth, deftly suiting up as he closed the distance between them.</p><p>Wide-eyed, she backed away. Her chest heaved with panting breaths; her tongue darted out to wet dry lips. He pursued her to the couch, watching as the backs of her legs hit the edge of the cushions and she sprawled into them.</p><p>He shoved the coffee table aside with a push of his foot, his focus solely on her and the feminine hunger that poured off her in waves of near-tangible heat. She stared at his dick with an avarice that made his balls tighten. His jaw unclenched on a deep inhale, releasing the condoms to fall to the floor.</p><p>Crowding her into the corner, Jared caught the back of the sofa with his left hand and cupped her pussy with his right, looming over her.</p><p>“Oh!” she gasped in that little girl voice that drove him crazy.</p><p>“Good,” he growled, his fingertips gliding through silky moisture. “You’re wet and hot. Primed for fucking.”</p><p>Her neck arched back as he parted the lips of her cunt and massaged her clit. “Yes. Do it.”</p><p>Bending his head, he caught her upraised lips before he thought about it. Kissing wasn’t an act he much cared for himself. Or so he’d thought. But then his mind had shut off at some point between the unhooking of her bra and the removal of her panties. He was eating at her mouth as if he could sate his hunger that way, devouring her, delving into the silken recesses with a greed he couldn’t control.</p><p>Her low moan only goaded his ferocious need. He sucked on her tongue as she licked into his mouth, sliding the circle of his lips up and down the slender protrusion, relishing the way she shivered and slickened the hand massaging her pussy.</p><p>With eyes half lidded with desire, Jared lifted his head and watched her as he pushed two fingers into her, watched the way her swollen lips parted on a gasp. He penetrated her slowly, deliberately, holding her gaze with his so that he owned her pleasure. He took her to the knuckles, then withdrew, biting his lower lip at how tight and plush she felt. How slick and hot.</p><p>“Umm,” he purred, his dick aching with the need to be where his fingers were. “Open your legs wide, Darcy. Let me get to you.”</p><p>Her lithe thighs spread gracefully, her heels lifting to the couch and her knees falling open. Presented with a beautifully pink and depilated pussy, Jared felt his tenuous control slipping by the moment. He pumped his fingers deep and fast, over and over, fucking her pretty juicy cunt until she was grinding her hips into his hand and making sexy little noises. She cupped her tits in a kneading grip, her fingers tugging at the hard little nipples, her breath escaping her arched throat in mewling pants.</p><p>All the while he hovered over her mouth, teasing her with tantalizing flicks of his tongue, staying just far enough out of reach that she couldn’t have the deep French kiss they both craved. It would be too much, he’d lose his mind and his restraint, and he needed her to come first. Needed to ease the desperate tightness of her pussy. Because once he got into her, all bets were off.</p><p>“Yes.” She gasped, her slim torso glistening with perspiration. “Yes, I’m going to come...Oh, God...”</p><p>Darcy fell into climax with a violent full-body shudder, her cunt clutching at his working fingers with a strength that nearly set him off. He dropped to his knees, his mouth replacing his hand, his tongue spearing through her tender convulsing tissues. He consumed her like a man possessed, burying his face in her silky wet core, tonguing her cunt until she came again. And again. Her short nails clawing at the sofa as she cried out words he couldn’t hear over the rushing of blood in his ears. He couldn’t get enough. Needed more of her taste, her pleasure, her surrender.</p> <p>Her damp palm pressed to his sweat-slick forehead, pushing him away. “Jared...Jesus...I’m going to pass out before you get inside me.”</p><p>Fuck that. He’d eat more of her pussy later, when she was too wiped out to argue and his dick wasn’t throbbing like a son of a bitch. Damned if she’d check out before he got his cock in her.</p><p>Wiping his mouth on her inner thigh, Jared rose and caught the back of her leg over his arm. He pulled it high and wide, opening her completely.</p><p>She grasped him in both hands, making him wince as the pleasure of her touch threatened to send him over the edge. Her gaze stayed with his as she positioned him at her opening, sliding the crown around in her wetness before notching him into her tiny slit.</p><p>“God, Darcy. This is gonna be so fucking good.”</p><p>The weight of his body was the force behind his entry. As his cock sank into her cushioning pussy, his breath hissed out in agonized pleasure. He’d never been so hard or his body so tense.</p><p>Whimpering, she writhed beneath him. “Jared.”</p><p>The way she said his name, in that breathless girly voice, did him in. He dug his feet into the floor and he drove deep, spearing into her with a mindless thrust. Her back bowed, crushing her small breasts into his chest. The feel of her pressed against him was like a punch to the gut. His abdomen clenched, his blood raged, and his adrenaline spiked. Her cunt quivered around him, massaging his tormented dick, stealing any possibility that he might’ve reined himself in.</p><p>He groaned, his hips churning against hers. “You feel amazing...so damn tight and plush...”</p><p>Darcy’s teeth sank into his shoulder, her hands clutching at his waist. The bite of pain was perfect, enough to jolt him out of the haze of near-painful pleasure and goad him into moving.</p><p>Shoving his arms beneath her, Jared caught her to him, crushing her against him from shoulder to hip. With her pelvis tilted up to cradle him and her body completely restrained by the bands of his arms, he possessed her completely. He gave a tentative thrust, withdrawing partway, then shoving back inside her.</p><p>She released his shoulder, her head falling back to once again arch over the armrest. She moaned. “Do that again.”</p><p>“All night,” he promised darkly, taking her with another fierce stroke, watching the need flare higher in the depths of her jade green eyes. “You won’t remember what it felt like to go without my cock inside you.”</p><p>Darcy’s cunt clenched around him and he broke. Rearing back, he lunged hard and deep. His tempo increased, faster and faster, until he was riding her relentlessly. Pounding into her. Nailing her to the couch with powerful drives of his hips.</p><p>In a distant part of his mind, he knew he was taking her too roughly, working her snug pussy too hard, but she was taking everything he had to give her and demanding more.</p><p>“Harder,” she gasped, throwing her hips at him. “Deeper. Ah...you’re so big. It’s so good...”</p><p>It was beyond good. She was killing him with her enthusiasm—the raking of her nails across his back, her heels in the backs of his thighs spurring him on, her silky tissues rippling up and down his aching cock. And her voice, which rivaled the rhythmic slap of his heavy balls against her damp flesh as the most erotic thing he’d ever heard.</p><p>“You’re driving me crazy,” he growled, unable to stop fucking her, needing to get deeper inside her. He was bottoming out with every plunge, filling every inch of her, his eyes rolling back because she was deliciously tight and scorching hot. The softly feminine smell of her skin was going to his head, intoxicating him, making him dizzy. Just when he thought he might blow it and go off without her, she began to tense.</p><p>“Oooh.” She shivered violently. “I’m going to come again.”</p><p>“Do it.” Jared bit down on her shoulder, relishing the way she jerked and tightened around him in response. He grunted as she pulsed in tiny spasms. “Just like that...Milk my cock. Ah, hell...”</p><p>She climaxed with a cry, the delicate tissues that hugged him tightening into a velvet fist before convulsing in the milking grip he’d demanded of her. Pinning her shoulders, he held her immobile and jackhammered through her orgasm, his own spiraling like molten metal down his spine and pooling in his balls.</p><p>His head fell back on a serrated groan, his body bowing as her pleasure fueled his, enflaming him. Cum spurted from the tip of his cock with a ferocity that rocked him, stinging his eyes and tightening his throat. His straining muscles burned and quaked, his entire body rigid as he emptied himself into the condom.</p><p>He might have lost his sanity in that mind-blowing moment if not for Darcy. She was right there with him, meeting him stroke for stroke.</p><p>Chapter four</p><p>Despite the sweat that ran in rivulets down her overheated body, Darcy missed Jared’s weight and the feeling of him inside her the moment he rolled away. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He collapsed on the seat beside her, his chest heaving with deep, gulping breaths. His eyes were closed, his head pressed into the sofa.</p><p>“Holy shit,” he said finally. “I can’t feel my legs.”</p><p>She closed her eyes, telling herself that rapid separation and focus on pleasure was the way to go. Keep it simple. They were just screwing. And since it was phenomenal, she couldn’t complain.</p><p>His lips brushed over her shoulder. “I was rough and you allowed it. Thank you.”</p><p>Soothed by the gesture and sentiment, she kept her eyes closed and smiled.</p><p>He shifted. His mouth sealed over hers without warning, stealing her breath. Frozen for a moment, it took a few soft licks of his tongue to kick-start her brain. When she opened to him, he kissed her with a gentleness very much at odds with the impatience with which he’d taken her body. His hand cupped the back of her neck, his fingers pushing into the sweat-dampened roots and holding her just where he wanted her.</p><p>The stroke of his tongue along hers was soft and slow, the press of his lips firm but not hard. It was a lush, hot, wet melding that curled her toes.</p><p>When they parted, they were both breathing hard. Their gazes met. A long, somewhat awkward moment passed.</p><p>She cleared her throat. “I need to take a shower.”</p><p>“I bought a bag of Epsom salts, in case you’d like to soak.” Jared pushed to his feet. “Bathroom?”</p><p>Startled by his thoughtfulness, she managed to point down the hall. “Left side.”</p><p>He set off, presenting her with a view of a really gorgeous ass. Her gaze was riveted to its rhythmic clenching as he walked away, her heartbeat elevated by the realization that she’d pushed such a gloriously masculine creature to his limits.</p><p>Taking a moment to collect herself, Darcy stood and moved into the kitchen, realizing as she went that Jared had known the state of her body before she did—she was slightly sore. Breaking a year-long abstinence with a hard, pounding fuck with a well-hung man would do that to a woman, she supposed.</p><p>She was just digging through the shopping bag for the salts when she heard the rush of bathtub water surging through the house’s old pipes. He had purchased men’s combo hair/body wash and razors, too, which gave her an odd flutter of delight—he’d planned on staying from the get-go. She wasn’t going to read anything into it, but it was nice to know he hadn’t planned on yanking his pants back up as quickly as he’d dropped them.</p><p>When she joined him, Darcy found the bathroom door open and her new lover leaning over the triangular-shaped tub, testing the temperature of the water. He glanced at her as she filled the doorway.</p><p>“Now, this room,” he said, “fits you.”</p><p>“I had the bathroom redesigned after my parents moved out.”</p><p>She’d hired a contractor to gut the closet in the adjacent den to expand the home’s one bathroom into something she could live with. The room was still small, but it now accommodated a separate bath and shower, instead of the combo tub with showerhead that had been there before. The café au lait walls and tile, paired with accents of eggplant, gave the room a warm modern elegance she found soothing.</p><p>Jared held his hand out for the Epsom salts.</p><p>An odd tenseness spread through her tummy. “You came prepared. I take it riding a woman hard is par for the course with you?”</p><p>He stilled, his extended fingers curling into a fist. “Not really, no.”</p><p>She stepped closer and handed him the bag. She hoped his answer meant she got to him in a unique way, especially considering how he so easily devastated her.</p> <p>Looking almost...chagrined, Jared dumped a heaping handful of salt under the running water. “I have a sister with no concept of TMI,” he said gruffly. “You might know what that’s like.”</p><p>She nodded.</p><p>“She said salt baths worked wonders after overenthusiastic nights. It seemed like a good idea to grab some, considering where things were heading.” He gestured her over. “Is this too hot?”</p><p>It wasn’t. With a grateful, slightly bemused smile, Darcy stepped into the small corner tub and sighed her delight. “Thank you.”</p><p>Turning off the water, he stood. He grabbed his toiletries and moved over to the floating glass shower stall. She relaxed into the neck pillow she kept on the ledge and watched as he stepped beneath the oversized showerhead. He was tall, but the flexible arm adjusted for that, and soon enough he was putting on a show she would have paid top-dollar for.</p><p>Completely oblivious to her avid perusal, he soaped his hair and chest, his hands roaming over his gorgeously ripped body with brisk efficiency. The scent of his soap filled the air and she swallowed hard, her mouth watering. A flush swept over her skin that had more to do with her new lover than it did with the heat of the bathwater. Jared Cameron was her darkest sexual fantasies in the flesh, his thick biceps flexing as he moved, his abdomen and pectorals clenching as his arms lifted to scrub at his hair. Soapy water sluiced down his tanned skin, making her pussy clench in renewed hunger.</p><p>When he turned his attention to washing his genitals, stroking his long thick penis in one hand and rolling his scrotum with the other, Darcy couldn’t ignore the pulsing between her legs any longer.</p><p>Laying one leg on the lip of the tub, she cupped her slick pussy and massaged the tender knot of her clitoris. The fingers of her other hand caught a nipple in their grip, rolling and tugging the aching point, sending shards of delight straight to her womb. She made a soft noise of need and his head lifted abruptly, catching her in the act of pleasuring herself.</p><p>She bit her lower lip in a deliberately provocative come-on, feeling sexy and naughty as his desire rose in response to hers. His cock thickened in his hand and she arched her back, remembering how the hard length felt moving inside her.</p><p>His resultant scowl wasn’t what she’d expected. Neither was the haste with which he finished rinsing off and vacated the shower. As he strode out of the bathroom with her towel wrapped around his lean hips, she wondered if she’d crossed a line.</p><p>Deflated and embarrassed, her hands fell away from her body. She sank her head beneath the water, submerging herself as long as her lungs would allow.</p><p>When she came up for air, Jared was there. Standing by the tub with his arms crossed and a new condom rolled over his raging erection. She quickly swiped the water off her face with her hands, blinking up at him.</p><p>He uncoiled, stepping into the tub before she knew he intended to. Catching her beneath the arms, he hauled her up and set her ass atop her neck pillow on the wide ceramic edge.</p><p>“I wanted to wait,” he muttered, kneeling in the water and spreading her legs. “At least until after dinner.”</p><p>He dove for her pussy, his mouth latching on to her tender core and tonguing her cleft. He pushed inside her and she gasped, her hips arching. His tongue slid in and out, licking quick and shallow, luring her slickness until she heard how wet she was. He groaned and tilted his head, thrusting deeper into her, drinking her in as if he couldn’t get enough.</p><p>When she started to tremble, hovering on the edge of orgasm, he wiped his mouth on her inner thigh and stood. Darcy shivered at the look he shot her, the edgy hunger that seemed little appeased by their animal screwing on the couch.</p><p>He caught himself in hand and gently nudged her. A rough sound escaped him. “Fuck, I wanted to wait,” he said again, with more vehemence. “You’re swollen.”</p><p>“I can’t help it if you hit all my hot buttons.” She gripped his hips to stabilize her perch. “You looked so damn hot in the shower. Turned me on watching you stroke yourself.”</p><p>“You were looking at my dick like you’d die if I didn’t give it to you. I almost blew my load in the shower.” He began a slow slide into her, exerting minimal pressure to ease past tender tissues. “After what you did to me on the couch, I shouldn’t have anything left to blow.”</p><p>“I would have loved to watch,” she said, breathless with lust. Every inch he pushed into her stole another piece of her sanity; every coarse word he spoke ratcheted up her need.</p><p>Cupping her cheek in one hand and her hip in the other, he shook his head, nudging deeper. His thumb pushed into her mouth. “I want this mouth first.”</p><p>She drew on the callused pad, rubbing her tongue over it, watching his eyes darken.</p><p>“You’ll suck my dick just like that,” he said hoarsely. “I’ll have you on your knees, deep-throating my cock. After this, it’ll take me longer to come. I’ll be fucking your mouth for a good, long while. I’ll make it last because it’s going to feel so damn good. Everything about you makes me feel good.”</p><p>He pulled his thumb free and lowered his head to kiss her, his tongue thrusting into the warm recess in imitation of the act he spoke of. With his lips whispering over hers and his hand at her throat, he said, “You’ll swallow every drop of my cum, sucking it from the tip of my dick until I’ve got nothing left to give you.”</p><p>“Yes...” she breathed, wanting him in her mouth now. Wanting to see the pleasure sweep across his face as she took him to orgasm.</p><p>With a roll of his hips, he sank into her to the root. His groan hardened her nipples. “You’re even tighter than before and your cunt was perfect then.”</p><p>Tilting her head back, Darcy’s lips and teeth followed the sharp line of his jaw. “You’re thicker than before and your cock was big then.”</p><p>“Because now I know how good it’s going to feel when I go off.” He leaned his head back to invite her attention to his throat. “How good it feels when you lose it and squeeze me like a fist.”</p><p>“You make me come so hard,” she whispered by his ear, licking delicately into it and smiling when he shuddered. She deliberately tightened her pussy around him.</p><p>Jared cursed and withdrew, then slid balls deep in a measured glide. “Play all you want, sweetheart, but you’re not rushing me.”</p><p>Gripping his taut ass in her hands, she squeezed and held him close so she could grind into him. She nearly came from the fleeting pressure of his pelvis against her clitoris, her sex spasming greedily around his erection. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Shit.” He groaned, reaching behind him to grab her hands and pull them away. He crowded her, forcing her to lean back. Then he pinned her hands to the tile with his own and gave her a breathlessly perfect stroke with a practiced swing of his hips. “You’re not going to quit until I’m an idiot over you. A pussy-whipped, salivating piece of shit who can’t think about anything but nailing you everywhere and every way he can, no matter how often he has you.”</p><p>Darcy’s head fell back with a mewl as he began to shaft her aching pussy with smooth measured thrusts. She couldn’t speak for the pleasure, the fit of his thick, long cock so perfect it filled every centimeter of her. Eyes closed, she absorbed the rhythmic impact of his hips into hers and the arousing smack of his heavy balls against the wet curve of her buttocks. The push and pull of his erection was an erotic massage over her hypersensitive flesh, the wide crest rubbing over a spot that made her shake uncontrollably.</p><p>“I could do this all day,” he growled. “All night.”</p> <p>“Don’t stop, Jared. Don’t. Stop.”</p><p>His tongue flickered over her nipple and she nearly climaxed.</p><p>“Oh, yeah.” His breath blew hot over her damp skin. “We’re doing that later. I’m going to slide my dick into you, then suck on your nipples until your hungry little cunt milks me dry.”</p><p>His lips surrounded the tip of her breast. He suckled her with drawing pulls that were perfectly timed with his plunges between her legs. His tongue lashed at the hardened nipple, flickering over it in a way that sent pulses of heated delight racing across her nerve endings. She heard herself whimpering, her body moving separately from her mind, her hips rocking to meet his and hold the incredible fullness of him deep inside her.</p><p>Jared released her wrists, his hands moving to cradle her spine and mold her body to his. It was the singularly most carnal experience of her life. And the most intimate.</p> <p>“Yes,” she breathed, suspended in his arms. “I’m coming...”</p><p>The orgasm swept through her like a gentle wave, lapping at her senses, gaining strength until she quivered uncontrollably. All the while he continued the leisurely thrusting of his rigid penis, swelling with his own imminent release, spurring her to climax again.</p><p>Wrung out and on an emotional precipice she hadn’t expected, Darcy gave herself over to him. Let him pleasure her until she was certain she couldn’t take any more, until her legs hung limply in the cold water and her nipples throbbed.</p><p>Only then did he let go, holding her torso against his scorching-hot skin, his chest heaving as he jerked violently and came endlessly.</p><p>Chapter five</p><p>“They’ve actually made some good headway with the student list from the dance studio.” Trish’s voice came clearly through Jared’s cell phone speaker, accompanied by the rustle of papers in the background. “They’ve already confirmed alibis for most of the repeat students going back one year. Miller is territorial, but he’s got good instincts.”</p> <p>Jared slid the phone aside to make room for a cutting board on the kitchen counter. “My concern is whether or not the town’s residents are a blind spot in his investigation.”</p><p>“I’m working him around to thinking more along those lines. At least considering them.”</p><p>“He lets you get a word in edgewise? You’re a miracle worker.” He deseeded a bell pepper, then chopped it quickly into small squares.</p><p>“He’s not that bad,” Trish said. “His only experience with federal law enforcement wasn’t a good one.”</p><p>“About that.” He worked on an onion next. “I’d like the name and contact information of whoever was the primary on that case.”</p><p>“You going to thank him or her for making our job so much easier?”</p><p>“Don’t give me ideas.” Using the knife, he scraped half the vegetables into a heated skillet. “It might be worth it to see if anyone in Lion’s Bay rubbed the Feds the wrong way. Aside from Sheriff Congeniality.”</p><p>“What time are you coming into the station tomorrow?”</p> <p>“Not sure. I want to check out the other two locations in the morning. Why?”</p><p>“Wouldn’t want Miller to be out and miss you.”</p><p>Gripping the handle of the skillet, he jerked the pan to flip the sizzling vegetables. “I’ve requested courier manifests going back six months. While it’d be stupidly obvious to ship hazardous materials in and leave that trail—”</p><p>“We don’t want to be the ones who overlook the obvious.”</p><p>“Right. I’m hanging up now. Call if you need me.”</p><p>“What is that noise?”</p><p>“Dinner. I’m hungry. Good night.” Jared tapped the disconnect button on his phone and turned his attention to cracking eggs to finish up the omelets.</p><p>As he moved, he mentally cataloged the state of his body. His damned legs were jellied and there was an odd knotting in his gut that he told himself was hunger. He was having trouble staying focused, his thoughts drifting to the woman presently soaking in a fresh Epsom bath.</p><p>The sexpot fire inspector had fried his brain. A wild lay was not supposed to make a man feel strange. It was supposed to relieve stress, provide a workout, and clear a man’s head. Instead, he didn’t even hear Darcy enter the room until she spoke.</p><p>“Whatever you’re cooking,” she said, “smells delicious.”</p><p>He glanced at her, cursing inwardly for being caught unawares. “Omelets.”</p><p>“Awesome.” She maneuvered around him and opened a cupboard to pull out plates. Dressed in jeans and a T-shirt, her composure irritated him. He’d tugged his pants back on because they were about to eat, but he’d left the fly partially open, exposing the waistband of his boxer briefs. He was shirtless and barefoot, comfortable and relaxed, while she looked like she was ready to leave the house.</p><p>“Where are you going?” he asked, scrambling the yolk with enough vehemence to make it frothy.</p><p>“Excuse me?”</p><p>“You got dressed.” And her hair was damp and slicked back into a ponytail.</p><p>“I didn’t know I was supposed to eat naked. You’re not.”</p><p>He unclenched his jaw. “You could have put on a robe.”</p><p>Setting the plates on the dining table, Darcy returned to the kitchen. “I didn’t want—” She exhaled harshly. “I don’t want you to feel like I’m assuming anything or taking anything for granted. You made it very clear that things need to be simple.”</p><p>“No assumptions, but you assume I’ll get antsy if you follow the evidence that says I prepared to spend the night.” He poured the eggs into the pan with the veggies, then added the ham he’d chopped before he called Trish. “Unless what you’re not saying is that you’re ready for me to go.”</p><p>She straightened and approached him. “Sex doesn’t improve your humor, I see.”</p><p>“Maybe because I’m not done.”</p><p>“Okay, then.” She pulled silverware out of a drawer. “That’s settled.”</p><p>A moment later, Jared heard her moving the plastic shopping bag off the table. From the sounds of it, she was looking inside, perhaps noticing the toothbrush, antiperspirant, and razor sitting next to the two boxes of condoms. As far as he was concerned that wasn’t optimistic, that was practical. He flipped the omelet with a deft flick of his wrist.</p><p>“I wish I had a camera,” she said. “You look sexy as hell doing that.”</p><p>She looked sexy as hell when he was doing her, all soft and warm and flushed. The memory of her in the bathtub was going to haunt him for a while.</p><p>He jerked his chin toward the table. “Sit down.”</p><p>Darcy exhaled in a rush. “I wanted to put a robe on. Just so you know, I originally thought about ordering something in, answering any questions you might have about the case, and maybe watching TV if it wasn’t too late.”</p><p>“You should’ve gone with your instincts.” He tossed some shredded cheese into the omelet, then slid it onto her plate in a practiced fold. “Dig in. Don’t wait for me.”</p><p>“This looks as awesome as it smells. Thank you.”</p><p>Returning to the stove, he started cooking for himself.</p><p>She moaned, making his dick twitch with interest. “Jared. Wow. This is phenomenal. You’re as good in the kitchen as you are in bed.”</p><p>He watched her lift a second bite to her mouth, her eyes closing as she chewed and hummed her pleasure.</p><p>Swallowing, she went on. “Not that we’ve made it to the bed.”</p><p>“Yet.”</p><p>“Yet,” she agreed. “You know, I should get some credit for being concerned about scaring you off. I’m giving you credit for being offended at the possibility of a brush-off.”</p><p>Jared stared into the skillet. Simple would be taking the out she’d offered him and heading back to the motel to sleep in a solitary bed. Simple would be keeping his eye on the job he was here to do and his hands off the smoking-hot inspector who flooded his system with so much testosterone he couldn’t think straight.</p><p>Rubbing the back of his neck, he said gruffly, “Keeping things simple means not making things complicated. You’re overthinking.”</p><p>Of course, he was hardly thinking at all. He was running on pure animal instinct when it came to her.</p><p>Darcy laughed softly. “You can’t put this on me. I know how men work when they start off with the warning to keep it simple. That means don’t get clingy. Don’t expect me to be there for you when we’re not fucking. I get that, and it works for me. That said, I know all men have hot buttons, but I don’t know what yours are.”</p><p>He grunted. As far as he was concerned, everything about her was a hot button. And this conversation had veered into a direction certain to drive him crazier than she did.</p><p>“You know what I’m talking about.” She set her fork down. “Things that freak you into thinking the situation is becoming more involved than you want it to be.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He slid his own omelet onto his plate, returned the pan to the stove, and joined her at the table. Too late for the freak-out warning. It had been going off since he’d drilled her into the sofa. He had no control with her. No cutoff switch or throttle.</p><p>Darcy leaned forward. “You can’t tell me that a woman assuming a sleepover when you’re in a wham-bam frame of mind doesn’t make things dicey.”</p><p>Shoving a bite of his food into his mouth, he chewed through his frustration. He didn’t want to analyze this...them. He’d rather stick with orgasmic ignorance. “I can tell you that as long as we’re both in the same place at the same time wanting the same thing, I really don’t give a shit.”</p> <p>Darcy pushed back from the table. “All right. Excuse me a moment.”</p><p>He scowled at the sight of her half-eaten omelet, then glared at her retreating back. He’d give her five minutes to get her tight little ass back in her chair or he was going to drag her back in to finish eating...</p><p>She returned in a short white satin robe that revealed her bare legs and the lack of a bra. Jared forgot his aggravation.</p><p>As Darcy resumed eating with obvious relish, he leaned back in his chair, watching her.</p><p>“In a town of this size, with only one fire station, how does the city council justify paying for two fire inspectors?”</p> <p>When she looked up at him, her eyes were lit with amusement. “A combination of nepotism, being willing to work part time, and a good word from Jim.”</p><p>Jim. He reined in his irritation with a long, slow exhale. “Who’s the family member?”</p><p>“My uncle. He moved several years ago, but memories are ageless in Lion’s Bay.”</p><p>“And the rest of your family is gone, too?”</p><p>“Yep. Although my parents didn’t go far. They bought a place on Lake Horton.”</p><p>Which wasn’t all that far from his place in Seattle. “Why do you stay? What’s here for you?”</p> <p>Darcy pushed back from the table and picked up her plate. “Why not?”</p><p>He studied her as she came toward him to collect his plate, too. “It doesn’t suit you,” he said. “The town. This house.”</p><p>“You don’t know that.”</p><p>Standing, he followed her to the sink. “I do.”</p><p>“Maybe I’m not as easy to read as you think.”</p><p>Jared backed off, noting the tension in her shoulders and the way she avoided his gaze. Coming up behind her, he pushed her ponytail aside and brushed his lips over her nape. He’d get the story out of her eventually. In the meantime, he wanted her soft and warm. He wanted to explore what it was about her that made him want to kiss her all over.</p><p>She turned to face him. “Why did you join the Marshals Service?”</p><p>He gripped the counter on either side of her, trapping her in the cage of his arms. She smelled sweet and clean, and he was hyperaware of the fact that she was mostly naked beneath the thin wrap of white satin. “Because the military and I were done with each other and there’s nothing else I’m good at.”</p> <p>“You’re a good cook.”</p><p>“Thanks.”</p><p>Her hands went to his hips, her fingers twining in his belt loops. “You’re seriously hot. You could be a calendar model. Or a Chippendales dancer.”</p><p>“That’s not flattering.”</p><p>“You’re outrageously good in bed. Although monetizing that is illegal.”</p><p>“I like it on this side of the law,” he murmured, bending his head over her. “And I’m picky about who I go to bed with. I’d starve to death.”</p><p>“Well, that’s flattering.”</p><p>Darcy was a confident woman; she knew the force of her sex appeal. Since it was highly doubtful she would’ve picked up that level of sensual sophistication around a town of this size, where the dating pool had to be painfully small, he was even more curious about the time she’d spent away from this place. And what had brought her back. Maybe she was licking her wounds after a bad breakup, swearing off men for a while and retreating to a place where she’d be left alone.</p><p>He stepped back. “Wanna watch TV?”</p><p>Her eyes sparkled with silent laughter. She knew damn well he wanted another go at her, but he was going to hold off. He needed to be more careful or risk her burning out on him. He also needed to get a grip on himself.</p><p>“Find something you like,” she urged. “I’ll join you after I load up the dishwasher.”</p><p>He went along with the suggestion only because he wanted to get a closer look at her place without making her nervous about it. Moving into the living room, Jared took notice of all the details he’d been too lust addled to appreciate earlier. His gaze went to the now infamous couch first. Its modern lines and extra deep cushions were very much in keeping with how he saw Darcy, as was the sixty-two-inch flat-screen TV hung over the fireplace. Both were out of place against dated wallpapered walls. The coffee and end tables were sturdy wood pieces as retro in style as the dining table, while the knickknacks around the room were contemporary pieces.</p><p>Pausing by the fireplace, he looked at the framed photos on the mantel. Some were of Darcy with her parents, some were of her sister. He could tell the two apart easily, a difference confirmed by pictures of the two sisters together. The set of Darcy’s shoulders and the cant of her chin were unique to her, displaying a self-possession and boldness that wasn’t as evident in her sister’s shy smile.</p><p>He turned away from the fireplace as she entered the room, his gaze hungry as it swept over her slender frame. He should be wrung out by the two explosive orgasms she’d already given him, and there was no denying she was sore. But that didn’t stop her from looking at him like she wanted to ride him ’til morning or him from seriously weighing the pros and cons of letting her. He’d experienced potent sexual attraction before, but this was inexorable. Feeling his cock stir, he shucked his jeans but left his boxer briefs on.</p><p>“Don’t get excited,” he warned, when she caught her breath, “I’m just getting comfortable.”</p><p>Catching her lower lip between her teeth, she gave him a deliberately provocative look. She ran a finger down her throat to her cleavage.</p><p>“Keep it up,” he drawled, grabbing the remote before dropping into the corner of the couch where he’d had her pinned just hours before. He spread his legs and patted the spot between them. “Now be a good girl and lay here against me.”</p><p>She came to him with a wry smile. “You don’t strike me as the type of man who likes good girls.”</p><p>“I like you.” He wrapped an arm around her as she settled her back against his chest. “And I don’t expect you to behave.”</p><p>“You know me so well,” she teased, raking her short nails across his thighs.</p><p>Not yet, but he would.</p><p>Chapter six</p><p>The sun had barely risen when Jared finished poring over Darcy’s files. Finding his cell phone a poor substitute for the big screen of his laptop, he availed himself of Darcy’s office. He powered on her desktop, praying she didn’t have it password protected. Whether she always slept like the dead or he’d just worn her out, he figured she needed the sleep, considering the demands he’d be making of her over the length of his stay.</p><p>When the computer screen flickered to life, he found himself looking at an image of Darcy and her sister, which served as the desktop wallpaper. They were children in the photo, not quite teenagers. Their hair was arranged in matching pigtails and they wore identical pale pink leotards. A reflection of their backs in a wall of mirrors was behind them, with a ballet bar that traversed the full width.</p><p>He tucked the image away along with the other bits and pieces he was collecting in his mental file for her, then he got to work. He accessed the Merkerson case files, comparing the information with what he’d just acquired from Darcy’s. The similarities were irrefutable. In fact, they were nearly perfect.</p><p>The only anomaly he could pinpoint was the incendiary devices in relation to the rapidity of the timeline. Merkerson had started out with smaller devices, such as soda cans, but he’d been more intermittent. Months passed between arsons, until later in his rampage, when he advanced to using paint can–sized devices and striking every seven days. His illness had progressed to where he wanted the entire world to burn. Fire was his obsession and his mistress. This new combination of smaller devices and frequency melded his earlier work with his later freneticism, but whether that was evolution, devolution, or simply a poor fit to the pattern was debatable. And any of those options left the field wide open.</p><p>Jared drafted a quick report to his superior, giving a rundown of his thoughts and impressions. She’d lived the case the first time around, which gave her insight worth tapping into. He also asked for an update on the anonymous 911 call that alerted the authorities to the second fire. Miller had ascertained that the call originated in Seattle and was placed via a burner phone. But the sheriff had stopped investigating at that point, leaving the thread dangling. Why?</p><p>With that question in mind, he powered down Darcy’s computer and checked the time. Seven thirty.</p><p>Heading back into the bedroom, he stopped by the nightstand and checked her alarm. It was set for eight, which gave him just about enough time. He looked down at her, finding her just as luscious while resting as he did when hit with the seething sensuality of the way she moved. She lay on her back with one arm bent around the top of her head and the other at her side. The sheet was loosely draped over her, exposing the upper swell of her tits and the bent knee of one leg.</p><p>He pinched the sheet between his fingers and tugged it down, exposing her body in delicious increments. She slept on, innocently luring him to start the day with a bang...</p><p>DARCY AWOKE WITH a gasp, heat flaring across her skin in a molten wave. As her brain lurched into awareness, another heated lash across her clit had her moaning and instinctively closing her legs.</p><p>But they wouldn’t close. Strong hands held them down and spread for the next leisurely lick. Her heart raced with surprise and fear. Her eyes wrenched open, her hand thrusting downward to protect her intimate flesh. Her fingers sank into luxurious strands of thick hair, sliding through the mass to stroke over the scalp beneath. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A low masculine sound of approval slid across her skin like a caress.</p><p>The spearing of a tongue into her pussy woke her fully, arching her back and ripping a cry from her throat. Her mind was just catching on, but her body was already there, her nipples beaded hard and tight, and her sex clenching with demand for more attention.</p><p>“Morning, sunshine,” Jared rumbled, his breath gusting warmly over her damp skin.</p><p>“Jared...?”</p><p>“Who else?” He lifted one of her boneless legs over a thick shoulder and pushed the other up and to the side, opening her completely. “Now just lie there and come for me.”</p><p>She opened her mouth to reply, but a slow, deliberate swipe over her clitoris stole her breath. Whimpering, she lifted her hips to him, seeking more.</p><p>“Umm...” he purred, nuzzling against her with his lips. “You have the softest, most succulent cunt.”</p><p>Her head pressed hard into the pillow as he traced her folds with the stiffened tip of his tongue. Her pussy was creaming for him, her desire seeping from her body in silky skeins of moisture. He lapped at her, teasing the clenching opening of her sex with taunting flutters. Her womb tightened to the point of pain.</p><p>“Please.” Her hips churned. “Fuck me with your tongue.”</p><p>“Oh, yeah.” He gave a shallow thrust, then circled her clit. “I’m going to do everything to you. Fuck you everywhere, in every way.”</p><p>He moved sinuously, shrugging out from under her and gaining his knees. Pushing her legs up and back, he exposed her even more fully. Her hips were lifted from the bed, her shoulders supporting her weight as he bent his head and licked the length of her upraised slit. The vulnerability of her position only heightened the fever raging through her. His hands cupped the backs of her thighs, his thumbs holding her open for the tantalizing forays of his devious tongue. The scrape of his morning whiskers was an added stimulation, the slight discomfort soothed by the soft brush of his hair against her sensitive inner thighs.</p><p>And she could watch it all—the way his mouth sealed over her pussy as he pushed his tongue into her in a raw, erotic French kiss; the way his eyes darkened as she panted and fisted the bottom sheet; the way his lids lowered on a groan as she grew hotter and wetter.</p><p>His thumb slid through the building slickness, coaxing it lower, using it to massage the tender pucker of her ass. Lust shot through her like a strike of lightning while sweat bloomed over her skin in a mist of heat.</p><p>Jared’s head lifted. “You want me here.”</p><p>“I want you everywhere.” She felt as if she no longer fit in her skin, as if she were trying to crawl out of it. Her hunger for him was raging through her, boiling through her veins and stealing every remaining shred of her sanity.</p><p>His thumb exerted the tiniest bit of pressure and she pushed out for him, flowering open and accepting his touch inside her. A violent tremor shook her, pushing her to the edge of climax. It had been a long time since she’d trusted a man to take her there. Too long. And even then, the relationship hadn’t been so raw and sexual. Jared’s unabashed carnality stripped her of her normal boundaries, violated her sensibilities, opened her to torment both physical and...otherwise.</p><p>Every time he touched her, she wanted more. More of him. More of who she was with him.</p><p>Squeezing her aching breasts, she tightened around his thumb. “Eat me ’til I come. Then fuck my ass until you come.”</p><p>“Jesus.” His skin stretched tight over his cheekbones. “You don’t know what you do to me. How crazed you make me. I want to defile your body. Own it. Possess it...”</p><p>“Yes.”</p><p>“Beg me, Darcy. Beg me to do it all to you. Everything I want.”</p><p>“Now. All of it.”</p> <p>He dove for the saturated flesh between her thighs, latching on with a greed that tore through her. His tongue fucked her spasming pussy hard and fast, his head angling to get deeper. His thumb thrust in and out of her rear, the dual shallow penetration making her mindless.</p><p>She begged as he’d demanded her to, pleaded with him to finish her, to make her come before she broke from the strain...</p><p>The moment his lips surrounded her clit, the climax hit her hard, bowing her back and blackening her vision. She cried out as he sucked her, drawing on her with rapid measured pulls. The orgasm barreled through her senses, building and building until she thought she might lose consciousness. Then it ebbed, taking her breath and energy with it. She melted into the bed, barely aware of the gentleness with which he lowered her.</p><p>“Darcy.”</p><p>Her breathing rasped in the semidarkness of the bedroom. She struggled to open her eyes, finding Jared kneeling between them, pushing his boxer briefs down to free his raging cock. His balls were hard and full, drawn up close to the base of his heavily veined shaft. The wide crest was purpled by the need to expend the semen dribbling from the tip and he fisted it with a harsh curse.</p><p>As he had in the shower, he rolled his scrotum in one hand and jacked himself off with the other.</p><p>She watched with a dry mouth as he stroked his cock with a brutality that pounded through her blood. It was a primitive demonstration of how wild she made him, soothing her with the proof that he was as lust crazed as she was.</p><p>Pinching and tugging on her nipples, she urged him on. “I’m imagining you in me—how deep you get, how thick you are just before you come. You fill me so full the pleasure is almost pain. I don’t know how I’ll bear it when you take my ass, but I know I’ll love it. I’ll—”</p><p>“Fuck.” Semen exploded from him in a scorching stream across her torso. His fist flew, pumping the creamy fluid up the shaft to spurt over her nipples, coating her skin with the evidence of his virility. He came long and hard, cursing as his powerful body was wracked by wrenching shudders.</p><p>But when he finished, he was still hard, and the gleam in his eye was as rapacious as she’d come to expect.</p><p>The blaring of her alarm was jolting, kicking her racing heartbeat into overdrive. Reaching down, Jared caught her by the nape of her neck and lifted her to his mouth. He kissed her hard and swift, his free hand kneading his cum into her breasts.</p><p>“Saved by the bell,” he said roughly.</p><p>Darcy spoke with her lips against his. “Later. We’ll finish this later.”</p><p>“I’m counting the seconds.”</p><p>DARCY SET COFFEE to brewing while Jared showered, then turned her attention to the files on the arsons that lay on the dining room table. At some point during the night, he must have gone out to her car to retrieve them. She wondered what conclusions he’d drawn, if any, and if he had any theories or questions she might help him with.</p><p>The shower turned off, leaving a sudden void as the noisy pipes quieted. In the ensuing silence, she could almost hear her body humming. She felt strangely energized and exhausted, content and apprehensive. In less than a day, Jared had found a loose thread in her life and he was slowly pulling it, unraveling her at the seams. She didn’t see how she would be able to continue the searingly intimate sexual exploration they were engaging in without becoming attached to it.</p><p>Already she craved him. Picturing an addiction to him wasn’t that big of a leap.</p><p>“I’d kill to have some of that coffee I smell,” he said, entering the kitchen with damp hair and nothing but his jeans on.</p><p>She drank him in, resisting the urge to run her fingers through the light dusting of hair on his chest. Truth be told, she couldn’t stop her mind from imagining her tongue tracing the line of his happy trail from his navel to his cock below. Her mouth watered with the desire to lick and suck him to orgasm, to fully own his pleasure when he came. And her proprietary feelings extended beyond that to encompass the whole of him.</p><p>“Stop looking at me like that,” he said sharply. “You’re making my dick hard.”</p><p>“Stop teasing me with your rockin’ body,” she shot back, stung and frightened by the sting, which hinted that she might be in too deep with him already. “How would you like it if I walked around topless all the time?”</p><p>He scowled. “I’d love it and you know it, but we have shit to do besides fuck each other’s brains out. I need you to give me a break.”</p><p>“You’re one to talk,” she muttered under her breath, turning toward the coffeemaker. He was irascible, grumpy, and rude as a rule. But that was part of his charm. Even if his gruffness did rub her raw at times. “How do you take your coffee?”</p><p>“Black.”</p><p>Darcy pulled a mug out of the cupboard. She felt him come up behind her, then closed her eyes as he nuzzled his way past her ponytail to her nape. His arms came around her and she tensed, fighting to keep the tremors she felt on the inside from being discernible on the outside.</p><p>His embrace tightened and he spoke roughly. “I’m sorry.”</p><p>Reaching for the carafe, she took a deep slow breath. “Nothing to be sorry about.”</p><p>“Bullshit. I can’t take it out on you when it’s my own damn self I can’t seem to control. We’re on fire for each other. Keeping that in check is going to take work and some concessions. I hate putting clothes on when my skin’s damp, but I’ll get over it.”</p><p>“Okay.”</p><p>His teeth bit lightly into the muscle between her shoulder and neck, a primal possessive gesture that sent an unwanted thrill of awareness through her. “I love the way you look at me, Darcy. Like you want to eat me alive. It’s not a bad thing, it’s just inconvenient.”</p><p>She slid the full mug to the side. “I’ll work on looking elsewhere. Here you go.”</p><p>Jared didn’t move for a minute, then he released her with a muttered curse. He left the kitchen, and she took the breather to give herself a mental kick in the ass. She straightened when he returned, moving away and toward the living room as he passed her on his way toward the coffee she’d poured him.</p><p>They needed some distance from each other. They hadn’t had any since they’d met and that was a mistake.</p><p>“Don’t you dare walk out of this room,” he said in a voice too even to be anything but dangerous. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It’s my house.”</p><p>“And if I’ve worn out my welcome, you’ll look me in the eye and say so.”</p><p>Pausing by the dining table, Darcy faced him, feeling grateful that she wore her uniform, which gave her the look of having her shit together even if she didn’t. Jared had put his shirt on. He was now leaning with his hip against the counter and his legs crossed at the ankle. The leisurely pose didn’t fool her for a minute. He was coiled tight. Watchful. Ready.</p> <p>She hit him with something certain to give him pause. “I’m feeling fragile this morning.”</p><p>One arm crossed his chest; the other lifted his mug to his lips. He swallowed and nodded. “I’m a bit raw myself.”</p><p>His confession made her feel better and she managed a smile. “I was thinking maybe it would be a good idea for you to work with Jim today. I’ll see what I can do to help your partner and Miller. We can sleep off some of the hormones...pheromones...whatever, separately, and see how things look tomorrow.”</p><p>There was a long stretch of silence, then, “I’ll agree to the break, but it would be best for everyone if I didn’t see Ralston again.”</p><p>“He’s damn good at his job. He trained me.”</p> <p>“He could be the best damn fire inspector in the country; that won’t stop me from laying him out cold if he tries that territorial bullshit again.”</p><p>“He had no way of knowing we’d made arrangements to hook up,” she argued. “He was just trying to be a good friend, which is all he’s been for the last couple of years.”</p><p>Jared took another sip, his gaze locked with hers over the lip of the mug. “I’m a trained observer, Darcy. So is he. We both got the measure of each other from the first. He knew I was stepping in, and he pushed a little to try and put me in my place. He pushes again and I’m pounding him back.”</p><p>Her anger spiked. “I don’t need this right now. I don’t have anything to give you. I’m all tapped out. You were just supposed to be a vibrator that didn’t need batteries.”</p><p>His eyes were as hard and beautiful as sapphires. “And you were just supposed to be a hot piece of ass. Instead, this is getting messy. Deal with it. I want you and I can’t turn it off. And when I’m touching you, I don’t want to turn it off, and you don’t want me to, either. If you’re hoping to shut us down with some distance, I’ll roll with it just to prove you wrong, but we’ll be back at each other in no time.”</p><p>“It won’t work out.”</p> <p>“I’m not taking your word for it. I’ll see for myself.” He finished his coffee and refilled his mug. “I need to change into fresh clothes and grab some things from the motel. Then I want to head out to the other two scenes. I’d prefer it if you’d take me, but if you’re opposed to that, I’ll work something else out.”</p><p>“Opposed,” she repeated, laughing without humor. “If only.”</p><p>“We’re in the same boat. If it sinks, we go together.”</p><p>She stood and mentally dusted herself off. “Do you need to eat?”</p><p>“Not yet.”</p><p>“Okay, then. I’m ready to go when you are.”</p><p>Chapter seven</p><p>Trish was just leaving the motel when Darcy pulled her BMW into a spot in front of Jared’s ground-floor room. He climbed out and met his partner at the curb.</p> <p>“Hey,” he greeted her, frowning at her obvious agitation. “What’s up?”</p><p>“Miller is champing at the bit to hold a press conference. He thinks if we put the heat on the arsonist, he’ll move on.”</p><p>“Genius,” Jared muttered. “Make our torch someone else’s problem.”</p><p>“I reminded him—firmly—that this is our case and we’ll decide how to proceed.” Her pretty face was hard and her choice of attire betrayed her determination to establish her control of the situation. Usually a jeans and blouse sort of gal, she was wearing slacks and a blazer today.</p><p>“How well does he listen?”</p><p>She shrugged with a wry smile. “Well, he called me to give me a heads-up. That’s something, at least. I’m going to head into the station and keep an eye on him. You heading out to the other two sites?”</p><p>“Yes. I’ve got the inspector’s files for you to run through while I’m out. You’ll find she’s very thorough.” He glanced at Darcy and gestured for her to join them. “We also need to follow up on the vacation homes. There’s a steady stream of seasonal residents and rental transients running through the town. The full-time residents aren’t the only ones who know the ins and outs of the area.”</p><p>“I like your jeans, by the way,” Trish said, as Darcy unfolded from behind the wheel. “They looked good on you yesterday, too.”</p><p>He shot her a withering glance, to which she laughed. When Darcy came up beside him, he introduced the two.</p><p>“Can you pass the files on to Morales while I get what I need?” He moved on without waiting for an answer.</p><p>Entering his room, Jared unzipped his as-yet unpacked suitcase and pulled out a change of clothes. When he was done, he grabbed his laptop case and the sunglasses he’d left on the dresser the day before, then headed back out to the parking lot. He found Darcy and Trish standing with their heads bent over the front end of the Marshals Service’s SUV he’d driven to Lion’s Bay, discussing a file they had spread open on the hood.</p><p>Darcy glanced up when his room door shut. The way she looked at him was like a physical caress, and his heartbeat quickened. Her feminine hunger was a drug he couldn’t quit. Even knowing it was fucking him up, he couldn’t stay away.</p><p>Trish straightened, frowning at him. “I’ll be interested in hearing your thoughts when you get through surveying all three scenes. On paper, I’m missing the connection. I find it odd that the subject would be so meticulous in his timing and the creation of the incendiary devices, and yet so random in his location choices.”</p><p>“Join the club.” Jared pushed his shades onto his face. “Once we find the connection, we’ll crack this case wide open.”</p><p>Darcy said good-bye and moved back to her car. He was right behind her. They headed to the fire station to change vehicles. It was just Jared’s luck that the guy he least wanted to see approached Darcy the moment they entered the building.</p><p>“You didn’t have to come in on your day off,” Ralston said as she searched the rack on the wall for the keys to the department’s truck. “I can help Deputy Cameron with whatever he needs.”</p><p>Jared smiled grimly. The easiest card Darcy could have played to gain some distance was one she hadn’t used—she wasn’t working today. He took it as a good sign, as far as signs went.</p><p>“Actually, Inspector,” Jared replied, “we could use your help reining Sheriff Miller in. He’s pushing for a press conference, which will either feed the ego of our subject, run him off, or both.”</p><p>Ralston sighed. “The last thing we need is media scrutiny. We’d never get anything done. We know that all too well. Don’t we, Darcy?”</p><p>“He’ll listen to you, Jim. You have a way with people.”</p><p>“Chris will listen to you, too. He’s still got a soft spot for you. Don’t suppose you noticed that he keeps a picture from prom in his office.”</p><p>“Oh, God. I didn’t want to know that. I’m going to take Deputy Cameron up to the Animal Friends site, then back around to the Sweet Spot.”</p><p>Stepping closer, Ralston lowered his voice and said, “Let me take care of the one for you. You shouldn’t have to go up there again.”</p><p>She exhaled harshly. “It’s okay. You’ve got to deal with Miller, and Deputies Cameron and Morales need to make as much progress as possible before we have another blaze. The sooner we get through the sites, the better. I’ll be all right.”</p><p>“You keep saying that, darlin’, but sayin’ it doesn’t make it so.”</p><p>Jared took a step forward, reminding the other man that he was there. He did nothing overt, didn’t reach out to Darcy or make any proprietary moves. He didn’t have to. The look he shot the inspector said it all and more—evolution hadn’t altered the silent communication between males.</p><p>Ralston sized him up again. There was no challenge in the once-over he gave Jared. Just quiet, calm curiosity.</p><p>“I can do this,” Darcy said, oblivious to the exchange taking place over her head. “I probably need to.”</p><p>Ralston glanced at her again. “Okay. I just don’t want you pushing yourself into something you might not be ready for.”</p><p>She responded with more assurances, then asked, “Do you know where the truck keys are?”</p><p>“Mitch had it around back, giving it a wash.”</p><p>They went to collect the truck, with Darcy explaining that aside from two trained EMTs on payroll, the other firemen were local volunteers. “Mitch Quinn is one of the most active,” she said as they rounded the corner and found a trim blond man in dark blue uniform drying off the pickup. “I’m hoping he’ll get a permanent position if the city ever approves a budget increase. He deserves it.”</p><p>She made quick introductions, then hopped in the cab, raring to go. They cleared the town quickly, then turned off the coastal highway and began climbing into the wooded area that scaled one end of the U-shaped ridge of hills that hugged Lion’s Bay to the ocean. Darcy’s knuckles turned white on the steering wheel and her lips thinned. Mentally, she drifted away from him, became lost in some thought or memory that absorbed all of her vitality.</p><p>“Tell me about this place we’re going to,” he said, engaging her because he wanted her with him. Wanted to be there for her, with her, while she dealt with whatever she was struggling with.</p><p>She jolted as if the sound of his voice had startled her. Looking at him, she revealed green eyes that were stark and lost. “What?”</p><p>“Your impressions of the animal shelter. Any thoughts you might have about its selection. What you know of its history.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh. Right.” She slowly came back to him, exhaling her tension in a rush. “The shelter was built with funds provided by the Darmody family, who’ve owned the land up here for three generations. Lucy Darmody spearheaded the project in response to teasing from her family that she was turning her house into a zoo, due to her tendency to pick up stray, wounded, and unwanted animals. When she passed away, her children didn’t want the hassle of it, so they donated the equipment and planned on razing the building and kennels. Since then, it’s been tied up in litigation. They can’t agree on the best way to monetize the land.”</p><p>“How often do you come up here?”</p><p>“Not a lot.”</p> <p>He studied her covertly from behind his shades. “But you used to.”</p><p>“Years ago. My dad is a vet and he used to donate one weekend a month to coming up here to spay and neuter. He conscripted me and Dani—my sister—into odd jobs whenever he could. That’s how Dani found out she loved the practice of veterinary medicine.”</p><p>“Too tame for you.”</p><p>She glanced at him. “Yes. I love animals, but it just wasn’t a vocation for me.”</p><p>“Where is she now?” Jared wanted to meet Danielle. He wanted to see Darcy with her sister, see the emotions and reactions she had to someone she loved and trusted.</p> <p>“Near my parents.”</p><p>Why was Darcy still here? he wondered again. Without family ties, what was rooting her?</p><p>They pulled into a gravel parking lot riddled with weeds. At the end of the lot, charred cement block walls outlined the building that had once stood there. The kennels were obvious, the chain link and cement having weathered the fire well.</p><p>Darcy entered the building, her shoulders high and tight, the beam of illumination from a Maglite leading the way. “This was the main office. There wasn’t a whole lot left in here. Some built-in bookshelves and boxes of records for deceased pets. The boxes were moved into that corner there, with the incendiary device placed in the middle. We estimate the fire began sometime around ten in the evening.”</p><p>“And the unidentified witness called at quarter after. From Seattle.”</p><p>“With the timed delay, he could have set the stage and made the drive with time to spare.”</p> <p>He glanced at her. “Where’s the fun in that?”</p><p>She stepped into a slender ray of light entering from a hole in the ceiling and gave an approving nod. “Exactly. What pyromaniac doesn’t stick around to watch the show?”</p><p>“One who isn’t obsessed with fire,” Jared answered, which he knew was impossible.</p><p>“Then he’s not a pyro, is he?”</p><p>“I’m following. We’ve already noted that the materials used to build the structures our subject selected were not the most flammable choices.” Jared rested a hand on the butt of his gun. “What are some of the other reasons to start a fire? We talked about insurance payouts. Maybe revenge? Damn it, the incendiary devices are tripping us up. Like you said, they’re too sophisticated, too meticulously built.”</p><p>“Right. Someone loves them, loves working on them, loves imagining the destruction they’re going to cause.”</p><p>“So we’re back to a pyro who doesn’t get off on his own fires.” He stared at her. “What are you thinking?”</p><p>“That maybe what you said about Merkerson passing the baton to a protégé is spot-on. What if they’re working together, with Merkerson teaching the ropes, deliberately starting off with a small town and structures that are manageable?”</p> <p>“A training ground.”</p><p>“Yeah.”</p><p>Jared’s mouth curved grimly. “I’m liking this.”</p><p>“It pulls more of the threads together.”</p><p>Impressed, he asked, “How long have you been thinking along these lines?”</p><p>She stepped deeper into the building. “Since the tip came in. How do you have a torch igniting a fire in one town and a tipster in another? Two people. Occam’s razor.”</p><p>“But you waited until the third fire to shout out for help?”</p><p>“It wasn’t my call.” Darcy opened a door that led outside, flooding the interior with dappled sunlight. “Then I made it my call.”</p><p>He followed. “I’m hung up on something.”</p><p>“You, too?”</p><p>“Those sophisticated time bombs you talked about—they’re better than they were back in the day. If it is Merkerson, he’s upped his game over the years. He’s been honing his weapons of destruction, modernizing them, which means he’s been somewhere he could acquire the tools and substances he needed.”</p><p>“Not jail, then.” She paused at the end of a walkway that emptied into a small patio surrounded by the kennels. Her eyes took on that faraway look again.</p><p>Drawing to a halt beside her, he asked quietly, “What are you seeing?”</p><p>“Memories.” She pointed to a kennel and her breath left her in a rush. “Dani locked me in there once—for an hour—because I ripped the knee on her favorite pair of jeans when I borrowed them...without her permission.”</p><p>He set his hand at the small of her back, offering what support he could. “I knew you were a troublemaker.”</p><p>Darcy leaned into his touch. “I always thought it was stupid that so many fugitives stick around familiar locations. If they value their freedom, I’d think they’d want to get out of the country. Maybe that’s what Merkerson did. Canada, maybe? Or Mexico?”</p><p>“We can share his photo and see if anything shakes loose.” Jared took another look around. “But this location is remote. He would’ve had to hear about it from someone familiar with it, or he would’ve had to come here himself and find it on his own. Wouldn’t be something he’d accomplish in a day.”</p><p>“He might’ve stayed here awhile? Is that what you’re thinking?” She turned toward him. “A snake in the grass, how creepy.”</p><p>Cupping her face, he took her mouth. The kiss was slow and simmering, a gentle stroking of tongues and brushing of lips. He continued until his breathing was fast and she was pressed against him. Pulling back, he studied her eyes and found them dazed and hot with desire, which was a damn sight better than seeing them filled with shadows. “That’s better. Now we can go.”</p><p>DARCY’S LIPS WERE still tingling when they pulled up to the curb in front of the Sweet Spot. More profound—and infinitely scarier—was the warmth he’d pushed through her with his kiss, thawing the knot of ice that had settled in her stomach.</p><p>Jared got to her. Far too deeply and easily, and she didn’t know how to deal with it. It was outside the scope of her experience.</p><p>She loved men. She was fascinated by them and enjoyed the hell out of them, but they were accessories. There was too much going on in her life, too many things that took up her time. Dani called her a heartbreaker. Darcy hadn’t ever set out to hurt anyone, but it had been known to happen.</p><p>Looking at Jared over the hood of her work truck, Darcy wondered why he had to be the one to get under her skin. What was it about him? He was testy and brusque when he was in a good mood, and an ass when he was in a bad one.</p><p>One of his brows arched over the top of his sunglasses, a gesture that said, What are you staring at?</p><p>You. You’re affecting me. Stop it. Instead she said, “You can’t blame me for ogling. You’re the hottest man I’ve ever seen.”</p><p>“Keep thinking that way. Are you coming?”</p><p>“Not unless you need me. I don’t have anything to add to my report.” She couldn’t face the ruins of another place she loved. The shelter had been bad enough. Visiting the site again had hit her harder than she would have expected. Because of Jared. He’d opened her up, found a way inside her through the hairline fractures he had created, and left her vulnerable to the reality of her losses in a way she hadn’t been before.</p><p>With a curt nod, he ducked under the crime scene tape and stepped through the frame of what used to be a large front display window. It had exploded outward during the fire, showering the sidewalk with glass.</p><p>The proprietress of the adjacent jewelry store waved at Darcy through her matching window, then stepped outside. She was a statuesque brunette with cornflower blue eyes and bone structure to make a plastic surgeon weep in awe. With her waist-length black hair swaying around her shoulders, Nadine Bender glided over and joined Darcy in leaning into the truck. “Is that the Fed?”</p><p>“Deputy U.S. Marshal,” Darcy qualified, her eyes riveted to Jared as he examined what was left of the shop. He got a particular look on his face when he was focused on work. It was laser bright, sharp as a blade, and sexy as hell.</p><p>Nadine whistled. “He’s a looker.”</p><p>“Absolutely.”</p><p>“You sure can pick ’em. You’ve got a thing for men in uniform. Chris, Jim, and now this guy.”</p><p>“Deputy Cameron,” Darcy supplied as Nadine bumped shoulders with her.</p><p>They’d gone to school together, from kindergarten through high school. Like Darcy, Nadine had fled Lion’s Bay as soon as she graduated, then came back. They joked that the town was like a vortex, inexorably sucking natives back into it.</p><p>“All I did was call in the cavalry.” Darcy shrugged. “I can’t take any credit for his hotness.”</p><p>“And you snagged him straightaway. I can see it in the way he looks at you. If I thought you were purposely grabbing all the sexy men, I’d hate you. You’ve always been the biggest guy magnet. Makes me pea green.”</p><p>“You’re way prettier than I am, Nadine. Always have been.”</p><p>“Doesn’t matter. You have this vibe that drives men wild.”</p><p>“That’s not always a good thing,” she muttered as a patrol car parked behind her truck.</p><p>Miller grabbed his hat off the passenger seat and unfolded from behind the wheel. His gaze was on Darcy as he set the hat on his head and shut the door.</p><p>“Hey, Chris,” Nadine greeted with a wave. “How are you this fine early afternoon?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’ve been better.” He glanced at Nadine long enough to manage a smile. “How’s the store?”</p><p>“A little worse for wear, but open for business. The insurance adjuster will be out later to take a look.”</p><p>“Good.” He nodded and came to a stop before Darcy, his warm brown eyes shaded by the brim of his hat. “Everything all right with you?”</p> <p>“Yes, sir, Sheriff. Deputy Cameron is just checking out the scene.”</p><p>Nadine backed away. “I’m going to head back to work.”</p><p>Darcy shot her a look that said, Don’t you dare, but the other woman just grinned mischievously and backed away.</p><p>Chris leaned back against the truck next to her. Too close. When he crossed his arms, his biceps brushed hers.</p><p>“Where’s Deputy Morales?” Darcy asked.</p> <p>“She was making some phone calls and Jim was helping her out with some things. So I thought I’d find you and see if you needed anything.”</p><p>She exhaled softly, feeling that tiny twinge of discomfort that came with knowing someone’s interest was deeper than could be reciprocated. She and Chris had dated in high school. He’d been prom king to her prom queen. They’d had fun together, been wild and reckless as kids usually were, and she’d enjoyed being with him, but it had never been serious for her. He was a good guy in a lot of ways. Plus, he kept himself in prime shape and was great looking. But he didn’t get to her, not the way she needed.</p><p>“I’m set,” she answered. “I’ve turned everything I have over to Deputy Cameron.”</p><p>“I’d heard that.” The intimation in his tone put her back up.</p><p>Darcy straightened away from the truck and faced him from the sidewalk. “Watch it, Chris.”</p><p>“I think we need to talk about this. Why are you always going for a dead end? First Jim, then this guy—” He gestured toward Jared with a flick of his wrist. “I’m right here, Darcy. We’re good together. You know that.”</p> <p>“Seriously? We dated when we were kids for chrissakes.”</p><p>“We have history,” he argued. “Who knows you better?”</p><p>“Honestly, Chris, you don’t know me at all.” She thought back to when she’d woken up to Jared in her bed. The things she’d said to him...the raw sexual things she’d demanded of him...She could never say such things to Chris. It didn’t matter how long she’d known him. The connection she needed to be so open wasn’t there. “Where is this coming from anyway?”</p><p>“I’ve been patient, Darcy.” Pushing off his hat, he ran a hand through his thick mahogany hair. His eyes were hot with frustration. “I mean, you’re back in Lion’s Bay. I figured that was the big step. I knew you had some adjusting to do so I’ve kind of hovered on the side.”</p><p>“Come on, Chris. Are we going to have this conversation now? Here? Really?”</p><p>“I know you’re going through a rough time. You need someone solid, Darcy. Someone who can anchor you. Not Jim and not some fly-by-night outsider.”</p><p>“We’re not talking about this,” she said, low and quiet. “You’re under a lot of pressure at the moment. We all are. So I’m going to give you a pass today and forget you brought this up.”</p><p>“I should’ve asked you out before now. Is that what you’re saying? I tried to do the right thing by giving you some space, but I gave you too much space.”</p> <p>She sighed. “Who knows? Maybe if you’d asked me out when I first got back, I might have said yes. Maybe I wouldn’t have. We’ll never know. It’s a moot point right now. I’m working. So are you. And I’m presently involved with someone.”</p><p>“Involved?” he snorted. “He’s passing through, Darcy. Don’t forget that.”</p><p>“I haven’t, but you seem to have or your boxers wouldn’t be in a twist and we wouldn’t be having this conversation. We’re going to collar our torch, Chris, and everything is going to go back to the way it was, then you’ll be embarrassed over this conversation. Let’s put it behind us.”</p><p>Jared walked out of the building. “Everything all right?”</p><p>“Everything’s fine,” Darcy said. “Sheriff Miller just wanted to offer his assistance.”</p><p>“You get Deputy Morales the list of part-time residents, Sheriff?”</p><p>Chris straightened and shoved his hat back on his head. “Your partner’s got everything she asked for.”</p><p>“Good.” Jared bared his teeth in a semblance of a smile. “Morales will let you know if we need anything further.”</p><p>She waited until Chris had driven away to say, “See? You underestimated yourself. You worked with him just fine...without your fists.”</p><p>“He managed not to talk too much.” He looked at her. “But he was laying it on thick for you. You handled that well.”</p><p>Shrugging, she moved to the truck. “That wasn’t his style. This case is really getting to him, I guess.”</p><p>“Or the thought of you with another man is.” He opened the passenger door and paused, looking at her. With one arm draped on the roof of the cab and the other resting on the window frame, he looked casual, relaxed, and extremely delicious. “You know, being so easygoing with your brush-offs make them harder to accept.”</p><p>“Why?”</p><p>“Because women are supposed to be emotional. Pissed off, vengeful, sad...whatever. Something. Brushing a man off like a gnat makes us realize we never got to you at all. Or that we were much too easy to get over.”</p><p>“That’s sexist.”</p><p>“Maybe. No one’s ever accused me of being PC.” He pushed his sunglasses up, revealing cool blue eyes that scorched her. “I want to go to Seattle, take a look around the area where the tipster placed his phone call. And I want to take you to lunch. Since it’s your day off, it’s not a problem for you to get away, is it?”</p><p>“No.” And she wouldn’t have to wear her uniform. She was looking forward to hitting him with something flirty. “I just need to change my clothes and my ride.”</p><p>His slow, sexy smile did a number on her. She stood there a moment, absorbing the sensation of being so highly attracted to a man. Not just physically, but in every way. He’d called her easygoing and she thought that was true. She’d long avoided drama with men and anyone who was high maintenance. But her irritable lover wasn’t scaring her away. She wanted more of him, the good and the bad, the rough and the smooth.</p><p>“Ready?” he asked.</p><p>“No,” she said honestly, “but that’s not stopping me.”</p><p>Chapter eight</p><p>Jared wondered what the hell he’d gotten himself into when Darcy came out of the house. She’d changed into a strappy, fitted red dress that bared toned arms and lithe legs that ended in heeled sandals. Her dark hair drifted around her shoulders, and she’d touched up her eyes and lips with a light application of cosmetics.</p><p>His breath caught. More than her physical attractiveness, it was her sultry confidence that riveted him, the indefinable essence of her that so perfectly aligned with something deep inside him.</p><p>“Are you still there, Cameron?” Supervisory Deputy Holt asked through his cell phone’s speaker.</p><p>“Yes, ma’am. Sorry.”</p><p>“We’ve pulled the photos and video from the surveillance cameras around the payphone. They’re not very helpful. The subject wore a hooded sweatshirt and kept his head down, but they’re being e-mailed to you. Maybe one of the locals will see something familiar in the body language.”</p><p>“We’ll run it through. Thanks.” He straightened as Darcy reached him. “I’m going to visit the location myself. I want to time the trip and see if something in the vicinity jumps out at me. It’s possible he picked the payphone at random, but just in case, I’ll check it out.”</p><p>“Send me an updated report by morning.”</p><p>“Yes, ma’am.” He killed the call, shoved the phone in his pocket, and caught Darcy by the hips to pull her close. “You look amazing.”</p><p>“Thank you, Deputy.” She accepted the compliment with an easy self-assurance.</p><p>A heartbreaker, he thought grimly. The kind of woman a man was never sure he possessed completely. That aloofness stirred his most primal proprietary instincts, and he was slightly irritated that he was no more immune to her allure than any other member of the male species.</p><p>But then she’d confessed today that they were “involved,” and she wasn’t the type of woman to use one man as an excuse to extricate herself from another. For now, she was his. It was up to him to decide if he wanted to keep her, and if he did, take the steps necessary to make that happen.</p><p>“You’re scowling at me,” she pointed out wryly, her cool fingertips smoothing the line between his brows.</p><p>“Sorry.”</p><p>“What’s wrong?”</p><p>Jared shook his head. “You’re perfect, Darcy. Just the sort of uncomplicated and undemanding female a guy like me hopes to pass some time with. It’s driving me fuckin’ crazy.”</p><p>“That makes absolutely no sense,” she said wryly.</p><p>“Tell me about it. Kiss me.”</p><p>“All right. Don’t move.”</p><p>He forced himself to relax. “Go for it.”</p><p>Stepping closer, she brushed her mouth across his. The kiss was soft as a butterfly’s wings, barely there. Her tongue darted out, licking the seam of his lips, dipping just a tiny bit inside. He groaned, fighting the urge to drag her close and take over. He wanted her to give to him whatever she chose, however much she chose.</p><p>Her hands went to his shoulders, then the one not holding her little clutch purse cupped his nape. Her head tilted and she sealed her mouth over his. She deepened the kiss, unraveling him stitch by stitch. He couldn’t say why, couldn’t figure it out. She was a pretty woman he’d met twenty-four hours before. They’d fucked like feral rabbits, which should’ve worked her right out of his system. Physically, he’d been thoroughly satisfied. Yet he couldn’t catch his breath because of a chaste kiss. His lungs heaved and burned, his heart pounded violently. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Pressing her forehead to his, Darcy exchanged gasping breaths with him. “I need you to touch me.”</p><p>He heard the tremulous note in her voice and caught her close, banding one arm around her hips and rubbing his hand up and down her back. He wondered if she’d ever really needed anything from any man. What twist of fate had aligned his ferocious need to take her with her unrealized need to be taken?</p><p>“Are we a pair or what?” he murmured with his lips to her crown.</p> <p>“We’re something.”</p><p>“Yeah.” Jared rubbed his cheek against the top of her head. “We’re something.”</p><p>THROUGH THE LENS of his camera, Jared stood on the street corner and photographed every possible angle from the phone booth.</p><p>“Seems so wide open,” Darcy said. “Where do you take an investigation from here?”</p><p>He lowered the camera. “Cross-check local businesses with Lion’s Bay residents. Check cab fares from that day and time and this general vicinity. He probably drove, but maybe he was cautious enough to take a cab from a parking garage to somewhere nearby. Of course, if he’s that careful, he probably paid cash, but we’ll tie off that thread to be sure.”</p> <p>She looked at him grimly. “You’re keeping yourself busy while we wait for him to strike again.”</p><p>“Building a case.” He put the cap back on the lens and put the camera back in its bag. “I’m done. Hungry?”</p><p>“There’s a great little café around the corner, although we might have to wait a bit for a seat.”</p><p>“Let’s go.” He caught her hand and led her straight to the restaurant. It was crowded, with a line out front and a harried-looking hostess who instantly brightened when she saw him.</p><p>“Jared.” Tiffany smiled and grabbed a menu. “Just in time for your reservation.”</p><p>He felt Darcy’s grip tighten on his and knew she caught the undercurrent of familiarity. He didn’t have a reservation, but Tiffany always found a spot at the counter for him...and time after work when he was in the mood for more than food.</p> <p>“For two,” he pointed out gently, pulling Darcy up to his side.</p><p>Tiffany’s brows rose and her smile widened. “Absolutely.”</p><p>“Uncomplicated and undemanding?” Darcy asked softly, following his urging to precede him to their table.</p><p>“Yes.” And suddenly far less appealing. Not that he didn’t note and appreciate Tiffany’s beauty. It just didn’t hold his attention. Instead, he found himself focused on the number of stares directed at Darcy. She looked like a million dollars and carried herself as if she was worth ten times that.</p><p>God, she was fucking hot as hell.</p><p>And he had it bad for her.</p><p>Jared pulled out her chair and took the one next to her rather than across the table. The smile she gave him was warm and it stayed warm as she accepted the menu from Tiffany.</p><p>“I know exactly what I’m getting,” she announced when they were alone.</p> <p>“Do you come here often?”</p><p>“Only a couple times, but Jim ordered this phenomenal pasta once. I’ve been dying to get a plate of my own ever since.”</p><p>Jared set his camera on the table and made sure that when he spoke his voice was smooth and unchallenging. “I’m still not getting the Jim thing.”</p><p>She set her menu aside. “Back in high school, Jim was the hot older guy all the girls crushed on, and he was a fireman, which made him even sexier. When I moved back to Lion’s Bay, some of that adolescent infatuation was still there. Turned out he’d thought I was pretty hot, too, but I’d been jail bait before. We had unfinished business, so we wrapped it up. Like I said, it was never serious.”</p><p>“Have you had any serious relationships?” He knew something had to be the catalyst that drew her back to Lion’s Bay.</p><p>Her lips pursed as she considered the question. “I’ve had long-term boyfriends, but I’ve never been engaged. Have you?”</p><p>Leaning back in his seat, he shook his head. “I’m a busy guy, Darcy. I mostly work this region, but I’m also a SOG deputy—the Marshals Service’s Special Operations Group—which means I’m on call to go anywhere at any time. I haven’t had any serious relationships. My last long-term girlfriend was back in high school and that lasted less than a year. I don’t have commitment issues, but I haven’t met anyone who was worth the inconvenience of trying to get a relationship off the ground.” He took a slow, deep breath. “Until now.”</p><p>She stared at him, her gaze darting over his face. Their waiter approached and Darcy ordered, then turned her attention to laying her napkin across her lap as he did the same.</p><p>He didn’t say anything when they were alone again, thinking he’d lobbed the ball into her court and she could either keep it in play or drop it. Maybe the duration of the case was all he’d get from her. He wondered if staying out of her bed would make it easier to walk away at the end or harder. It wasn’t a situation he’d faced before. So he asked her, because he suspected she knew. Not from her point of view, but from the perspective of the other guys in her life who’d wanted the piece of her she kept to herself.</p><p>“If I stop fucking you,” he asked in a low, even tone, “will it be easier to stop wanting you?”</p><p>Twisting in her seat, she faced him. “I’m not sure what you’re proposing, Jared. More of this?” She gestured at the interior of the restaurant with a sweep of her hand. “More dates? Or just an understanding that we’ll have sex occasionally when the mood strikes and we’re in the vicinity of each other? Actually, aren’t they both the same thing when a relationship is too erratic to be steady? One just comes with food and/or entertainment, while the other allots that bonus time to fucking instead.”</p><p>“How the hell am I supposed to know what to ask for? I’ve never done this before.” He drummed his fingertips into the tablecloth and tried to figure it out.</p><p>“Jared.” Her voice had the slow, conciliatory note of someone about to impart bad news. “I don’t think we can have a casual relationship. The attraction between us...it’s too intense.”</p><p>“I figured that out when the first sight of you hit me like a two-by-four between the eyes. Listen...I’m not talking about fitting you into my life as it is. I’m talking about changing things to fit around you.”</p><p>“Making me a priority?”</p><p>“Yes.” He held her gaze. “With the expectation that you’ll make the same effort for me.”</p><p>“Maybe you should wait a few more days before you decide I’m not going to lose my appeal.”</p><p>“Don’t start playing games. It insults both of us.”</p><p>She exhaled in a rush. “Sorry. You freak me out. And the really scary part is I don’t care. As freaked out as I am, it’s not enough to get me to blow you off.”</p><p>“Good.” The rush of relief he felt almost made him dizzy. “So we make it work.”</p><p>“It’s going to be work. A lot of it. We’re too volatile. Too...greedy.”</p><p>“Like a thirst you can’t quite quench,” he agreed softly. “The flip side being that every time you take a drink, it’s the best fucking thing you’ve ever tasted. If that’s not worth working for, what is?”</p><p>Darcy set a hand over her tummy and offered a tremulous smile. “Yes. I suppose you’re right.”</p><p>The rest of lunch became a slow exploration of the basics of who they both were. Jared talked about SOG—the Shadow Stalkers, as they were called—and some of the experiences he’d had that he could share. He told her about his sister, Casey, who fell in love every other day and was unable to keep a secret to save her life.</p><p>For his efforts, Darcy talked about growing up in Lion’s Bay, with most of her anecdotes featuring her sister, Danielle. He learned quickly that he’d pegged the sisters right. Darcy was the troublemaker; Danielle was the good girl.</p><p>Jared was sorry when the meal ended, wishing the day was already over so he could take her home to bed. The sharp bite of lust for her was always with him, but it was the sense that he was really inside her when they made love that he craved. She was cool and collected everywhere...except in bed with him. When he was inside her, he knew he had all of her. Every fascinating centimeter of her.</p><p>“I’m going to freshen up before we go,” she said when the check came.</p><p>“Meet you outside?”</p><p>“Sure.”</p><p>He’d just shouldered his way past the dwindling line at the front when his cell phone rang. Pulling it out, he didn’t recognize the number. “Cameron.”</p><p>“Deputy Cameron, Special Agent Michelle Kelley here. Your partner left a message that you had some questions for me.”</p><p>“Agent Kelley, yes. Thanks for getting back to me so quickly. I wanted to ask you about your impressions of Lion’s Bay and its residents, particularly anyone who struck you oddly.”</p><p>She snorted. “It’s a small town, Deputy. Everyone there is a bit odd in one way or another.”</p><p>“Right. Small town. What are the odds that two sets of Feds would end up there, investigating crimes with known MOs?”</p><p>“Zilch,” Kelley said bluntly. “But the MO of our Unsub was off. The basics were textbook perfect. It was the details that deviated to an unacceptable degree. I liked the mystery boyfriend, but we never got close to him. Never even dug up a name. In a town that small, where everyone knows everything, no one knew the victim had a man in her life. Not even the sister, who was—by all accounts—very close to her. But then, she hadn’t known the victim was six weeks pregnant, either.”</p><p>“Jesus.”</p><p>“Yeah, got to me, too. I don’t see how this is helpful to you, though.”</p><p>“Maybe it isn’t.” He adjusted his grip on his camera. “The arsonist is familiar with the area. He’s got a local’s knowledge, but no one is pointing any fingers. I thought maybe someone might’ve rubbed you the wrong way, give me someone to look at.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m sorry, Deputy. I wish I had something for you, but the residents of that town gave up nothing. That case still haunts me. What was done to the victim...She was so young and pretty. A vet, for God’s sake. Lived in Lion’s Bay her whole—”</p><p>“A veterinarian?” The sounds of the traffic and conversations faded from Jared’s perception, leaving a stunned silence. “Michaels?”</p><p>“Yes. Dr. Danielle Michaels.”</p> <p>Chapter nine</p><p>Darcy slid behind the wheel of her car and tucked her legs in as Jared closed the door behind her. He rounded the trunk and reached through the open top to set his camera on the backseat, then climbed in beside her.</p><p>“Wanna stop by your sister’s place?” he asked, looking out the windshield. “She’s in Seattle, right?”</p><p>She took a deep breath, then let it out. “Okay.”</p><p>Backing out of the parking garage spot, she hit the road. Her grip was too tight on the steering wheel, but she couldn’t ease up. There was a block of ice in her gut and her throat was tight. It didn’t matter how many times she saw Dani’s headstone, it still had the power to break something inside her.</p> <p>When they drove through the open wrought iron gates of the cemetery, Jared reached over and set his hand on her thigh. The knot inside her loosened. She set her hand over his and squeezed. “You’re not surprised.”</p><p>“I was when I found out.” He glanced at her, pushing up his shades so she could see his eyes. “Now I’m just glad you’re letting me in.”</p><p>“That’s why we’re here.”</p><p>His fingers linked with hers. “Is it so bad? Letting someone in?”</p><p>“No. I’m...grateful. It’s just...I can’t come here with my parents. They need me to be okay. And I try to be. For them.”</p><p>“But you’re not.”</p> <p>“Dani was half of me.”</p><p>She followed the road for a couple miles, then pulled over to the side and parked. They got out and she led him across the lawn to the Michaels family plot. Jared didn’t say anything as she stood over Dani’s grave and felt her eyes burn. He just came up behind her and wrapped his arms around her waist, setting his chin on her shoulder. They were there a long time, long enough for her to find her voice and tell him about the early-morning call that had irrevocably changed her life.</p><p>“There was talk of a boyfriend,” he said softly. “You didn’t know who he was?”</p><p>“Oh, I know him,” she said grimly. “I just don’t know his name. When Dani made it clear his identity was a secret, I knew he was someone familiar to me and she didn’t want me razzing her about him. That’s a big reason why I moved back to Lion’s Bay after she died. I wanted to figure out who he was and what he might know. I thought he’d come forward by now...that just looking at me every day would shake him up.”</p><p>“Do you know how fucking dangerous that is?” His voice was rough with fury. He turned her around to face his glare. “After what was done to her?”</p><p>She’d identified her sister’s body, although everyone in town had known who Dani was and one look at Darcy’s identical face proved it. The coroner had draped Dani’s body in a sheet from the neck down, but Darcy was aware of what the Prophet was known for...the sick mutilations he did to his victims’ bodies. “I can’t let Dani go while her killer’s still out there, Jared. And honestly, with her gone, I’m half dead anyway.”</p><p>“Bullshit. I’ve been inside you. When I’m touching you...fucking you...you’re so alive you burn me up with it. I see you trying to get out of this shell you’re just surviving in, living a life that doesn’t suit you one damn bit.” He cupped her face in his hands. “I’m going to get him, Darcy. He’s going to pay for putting that look in your eyes. I promise you that. Let me do my job. Let me keep you safe.”</p><p>Her breathing picked up. “You think he’s in Lion’s Bay, too?”</p> <p>“I think it’s likely, yes. The candy shop—your sister have any connection with that?”</p><p>Darcy frowned. “She was a customer. Dani had a sweet tooth. She stopped by there almost every day to buy a dollar or two of candy to carry around in her lab coat. And we celebrated our twelfth birthdays there. Why?”</p><p>“Every place our torch has hit has been tied to your sister in some way. You being in Lion’s Bay is shaking this guy up, sweetheart. He’s systematically wiping your sister off the map. First by taking her out, then by taking out places associated with her.”</p><p>She caught him by the wrists. “If he wants Dani gone, why not take out the woman who looks like her?”</p><p>Jared’s gaze darkened. “If I’m right, he’s saving that pleasure for last.”</p><p>“I KNOW HOW it sounds,” Jared muttered into his cell phone as they entered Darcy’s house.</p><p>She watched him cross through her kitchen into her living room, then begin to pace. Something inside her shifted as she watched him move, his stride powerful and predatory yet utterly silent. Armed and dangerous. A trained hunter. And he was now on the hunt for the man who’d killed Dani. The morass of emotions churning in her tummy had no outlet and she had no way of dealing with them. She’d never felt like this before.</p><p>Because he was also hunting her. Deliberately. Systematically. And he wasn’t going to stop until he’d captured her. She wasn’t going to let him stop.</p><p>Whatever it was she felt for him, it was important. With a little time, a little compromise, and with no effort at all, she could fall in love with him. And part of her really, really wanted to. Wanted to experience the magic she’d only ever felt faint echoes of. She could have it with him. He wanted it, too.</p><p>“What have you got on your plate now?” he asked his partner, running a hand through his hair. “Okay. Good. When you head back to the hotel, give me a buzz and I’ll meet you there. We’ll order pizza and tear into this.”</p><p>He was hanging up when she walked past him toward the bedroom, their eyes meeting in a long meaningful glance. She gave him a cheery smile because she didn’t want him to worry any more than he already was. He’d been even edgier than usual since they’d left the cemetery; he didn’t need any more on his plate.</p><p>She was crying silently before she reached the bedroom. She closed the door far enough that there was no gap, but didn’t push it all the way—she didn’t want him to mistake her desire for privacy as a desire to shut him out. Then she undressed and entered the bathroom through the door in the master bedroom. Forgoing the bath, despite how tempting it looked, she got in the shower and welcomed the brief shock of cold before the heat kicked in with a vengeance.</p><p>The tears flowed freely, mingling with the water. Darcy stood directly beneath the spray, letting it course down her face like a veil, hoping to prevent puffy eyes that would give her away. She hadn’t cried since the flight that brought her home to Dani’s dead body lying in the morgue. She knew she was due, but that didn’t make the dam burst any easier to bear.</p><p>She felt him come in behind her and was grateful he couldn’t know that she was falling apart. Setting her hands on the tile in front of her, she bent her head as if she was directing the strength of the spray on her neck.</p><p>Jared’s arms embraced her and he curled around her curved back. He didn’t say anything when an unexpected sob shuddered through her.</p><p>She tried to shake him off, feeling stupid. “I need a minute.”</p><p>“Take all the time you need.”</p><p>When he didn’t let go, she found her mouth curving ruefully. She turned in his arms. “You’re a menace.”</p><p>He shrugged. “I was trained to press every advantage.”</p><p>Her mouth quirked, her grief lifting at the gleam in his eyes. His beautiful face was stern and his sinner’s mouth unyielding. Such a hard man in so many ways, yet he could be tender. She’d like to see him with the sister he spoke of with gruff fondness and the parents he clearly admired and loved deeply.</p><p>His hands cupped her face, his thumbs brushing at her cheeks. “I can’t imagine your pain.”</p><p>“Good. I wouldn’t wish it on anyone.”</p><p>I’m still crying, she realized when the rough pads of his fingers stroked over her face again. “You know,” she said hoarsely, “I was trying to spare you a weepy woman.”</p><p>“Don’t. My job’s going to put enough between us as it is. We need to be brutal with the rest in order to make it.”</p><p>“For a guy who doesn’t do relationships, you seem to have a good handle on how they work.”</p><p>“I have a good handle on what I need.” His fierce blue gaze riveted her. “I expect that you’ll tell me what you need.”</p><p>Her hands slid down his damp back, caressing the hard slabs of muscle bracketing his spine. Steam billowed around them, but the warmth she felt came from inside her. “I don’t know what I need. It’s been a long time since I’ve thought about it.”</p><p>“So while I’m out tonight, think about it. Just make sure I’m in there somewhere.”</p><p>“I’ll be wishing you were in me.” She reached between them and fisted his erection. “You’re a deadly weapon all by yourself. Did you know that, Deputy?”</p><p>He snorted, his grip tightening on her hips.</p><p>“I bet there isn’t a woman alive who’s said no to you in your life. I’m just one of the many to fall under your irascible charm.”</p><p>“Look who’s talking. You’re a man-eater.”</p><p>With a two-handed grip, Darcy stroked him from root to tip. Her gaze lowered to the thick column of flesh in her hands, her heartbeat quickening at the impressive length and thick network of veins that coursed along it. It was a brutal-looking instrument of pleasure, as primal as Jared’s sexuality. That dichotomy—his powerfully elegant build and fallen-angel face paired with a curt temperament and raunchy sensuality—fascinated her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What a lovely idea,” she murmured.</p><p>Backing up a step, she sat on the tiled bench seat. It put her eye level with the object of her desire, which caused a hot flutter in her belly. She licked her lips, surprised at how turned on she was.</p><p>“What are you doing?” he asked gruffly. “You’re not sucking my dick.”</p><p>Her brows rose. “The hell I’m not.”</p><p>He slapped her hands away when she tried to tug him closer. “Christ, Darcy. You were just bawling your eyes out. The only reason I’m naked is because I haven’t got a change of clothes and the only way to get to you was to get wet.”</p><p>Her mouth twitched with the urge to grin. He looked so affronted. As sexual as their relationship was, it wasn’t all he wanted from her. That was good to know. Wonderful actually. Because as much as she wanted his body, she wanted more from him, too.</p><p>She pointed at his cock. “He’s ready to play.”</p><p>“What’s new? I’ve had a perpetual hard-on since I met you. Since I first laid eyes on you.”</p><p>“I cause the problem; let me take care of it.”</p><p>“It’s not a problem and I don’t want you to take care of it,” he snapped. “I want to take care of you.”</p><p>“I’m okay.” Darcy held his gaze, let him see the clarity of her eyes. The ache in her chest would never totally go away, she knew, but it was easier to bear than it had been just that morning. That she could feel differently was a miracle to her after living with it unchanged for so long, that her chronic pain could be alleviated at all. God...it had been so nice to lean on someone in the cemetery and have her grief accepted without reservation. “You wanted to make me feel better and I do.”</p><p>“Fuck that.” He scowled. “I’m a selfish bastard. I wanted to make myself feel better. Seeing you hurting was killing me. Watching you suck me off would make me feel worse. Hell...I’m not a douche.”</p><p>“When did I give you the impression that I was the type who went down on a guy without really wanting to?”</p><p>His scowl grew fiercer.</p><p>“Right.” Her gaze lowered. Her mouth watered. “You have the most perfect cock, Jared. Did you know that? It’s a thing of beauty.”</p><p>“You’re scrambled.”</p><p>“Actually, I’m ridiculously pleased with myself. I managed to snag exclusive access rights to your delicious body, which I’d like to exert now.”</p><p>His hand moved to grip the object of her desire. His fingers curled around it and stroked from root to tip. “I have work to do.”</p><p>“So stop lagging and let me have it.”</p><p>Releasing himself, he stepped forward and cupped her face in his hands. He searched her features, his gaze softening. “Are you okay, Darcy? Really okay? Or are you feeling shaky?”</p><p>She caught him by the wrists. “I think you’re feeling shakier than I am. I’ve had three years to deal with this. You’re the one who’s been blindsided by a cold case.”</p><p>“And a hot woman.” His thumbs slid gently over her cheekbones. “You’re an occupational hazard.”</p> <p>“Step a little closer and I’ll make it worth your while.”</p><p>One of his hands slid down, the pad of his thumb gliding across her parted lips. “You already have.”</p><p>He didn’t stop her when she reached for him again. He set one hand on the tile above her head and turned down the temperature of the water with the other. The spray beat down on his right side, running in rivulets down his muscular torso and washboard abs. She started there first, tracing the ridges with her tongue, her hands caressing his cock with soft, gentle pulls.</p><p>Jared’s palms pressed flat to the wall, his head hanging over her, his breath quickening. As his skin heated beneath her hands, his raw sexuality slipped its chain. She could almost see its smoky tendrils curl around her, intoxicating her. Primitive need burned in her blood, melting what few inhibitions she had. She was like a bitch in heat with him and she liked it, liked the wanton freedom his acceptance gave her.</p><p>Fisting him, she made him harder, made him shudder. She nuzzled his cock with one cheek and then the other, before moving lower to fondle his balls with her lips.</p><p>“Fuck,” he gasped, his cock jerking her grip.</p><p>Darcy took one full, heavy testicle into her mouth, sucking gently, rolling it around with her tongue. He was such a primal male. Big and hard and virile everywhere. There was a part of her that reveled in that, celebrating her claim on such a potently desirable masculine creature.</p><p>His thighs began to shake, his lungs heaving. “Payback’s a bitch, Darcy. Stop torturing me and suck it, sweetheart. Suck my cock in that hot little mouth.”</p><p>She purred and pumped him with a two-fisted grip. She wanted to eat him up, every mouthwatering inch of him.</p><p>One of his hands cupped the back of her head, his fingers flexing spastically in the soaked strands of her hair. “Wrap your lips around me, Darcy baby. Yes...just like that.”</p><p>Her mouth flowed over the thick crest, her eyes closing at the feel and taste of him. Warm satin over stone. Her tongue rubbed the sensitive underside of his cock head, every sense focused on his responses. His low groans. The tension gripping him. The sound of his teeth grinding.</p><p>“So good,” he bit out. “Your mouth is so damn good...hot...fucking perfect. You’re perfect.”</p><p>She sucked hard on the wide, sensitive crown, moaning as a hot wash of pre-cum spilled over her tongue and made her ravenous for more. She stroked him with her hands, milking him, as his other hand tangled in her hair. His hips began to move, his grip holding her still. He fucked her mouth at the depth and pace he needed, his hips lunging in a steady unfaltering tempo, his stomach clenching and releasing as his cock slid in and out.</p><p>Darcy looked up at him, their eyes meeting. Holding. As raw as the encounter was—her mouth filled with his thrusting cock, his abdomen sheened with water and sweat, the muscles flexing powerfully—it was intimate in deeper ways. His pleasure was hers, hot and sweet. Fierce.</p><p>He hissed when her cheeks hollowed. He swelled further, making her pussy ache to feel him tunneling deep into her. “Shit. Just like that, sweetheart. Suck it just like that...I’m gonna come so hard for you.”</p><p>Her pussy spasmed as his flavor sharpened. She moaned and squirmed, so turned on by an act that had never gotten her hot and bothered before. She liked it well enough, but it’d never aroused her to a fever pitch, never burned her with the stark eroticism of the act.</p><p>His fingers tightened in her hair. His face twisted in a grimace of agonized pleasure. “Fuck yeah...you’re making me come.”</p><p>Greedy, she sucked him like a woman possessed. Her head bobbing. Working the pulsing length with both lips and hands. Urging the furious spurts of semen to flood her mouth. Jared shouted a curse, his entire body wracked with violent spasms as he released stream after stream of hot, thick cum over her stroking tongue, his hips pumping his spending cock to the back of her throat.</p><p>His hands were shaking when he finished, when he tried to pull her off. She continued gently sucking, wanting everything he had. Every drop of his pleasure. Moaning in triumph when she pulled one last pulse of semen from his still-rigid flesh.</p><p>She was startled when he hauled her up and pushed her against the chilly tile, his hand dipping between her legs to thrust two long fingers into her. He took her mouth, his tongue delving into the depths that tasted of him, his moan of pleasure vibrating against her lips.</p><p>Hooking her leg over his, he set his foot on the bench, stealing her balance and opening her completely. His fingers began to rub inside her, sliding through the silky skeins of her desire, expertly finding all the tender spots and capturing her gasps of pleasure in his mouth.</p><p>Darcy clung to his shoulders, her nails digging in as he pressed his taut frame against her and pushed every thought from her head but him. “Jared—”</p><p>“You’re so fucking sexy,” he growled, his fingers sliding free of her pussy to rub the pucker of her ass. “You make me so hard. I’ve never been this hot for a woman, never felt like I’d die if I didn’t touch her. Taste her. Make her come screaming my name.”</p><p>She cried out as one finger slid into her rear, only to retreat and come back with two fingers. Ferocious pleasure pumped through her with the maddened beat of her heart.</p><p>Watching her with that fierce blue gaze, he pushed deep, then withdrew. “Only you, Darcy. You’re the only one to make me want to crawl out of my skin and into yours.”</p><p>“Yes,” she gasped. “In me.”</p><p>His fingers were driving her mad, fucking her anally with a steady, wickedly knowledgeable tempo. Her hips circled without her volition, trying to get him deeper. Harder. As close as they were, it wasn’t close enough.</p><p>“Oh, I’ll be in you, sweetheart,” he promised darkly, his breath gusting fast and hard over her ear. “Bare and deep. I’m gonna pump you full of hot, thick cum while I’m riding your ass as hard as you can take it. Pounding into you until I can’t tell where I end and you begin. You turn me into an animal, Darcy. You make me want to invent new ways to fuck just so I can own every inch of you.”</p><p>Jared’s thumb slid into her pussy and she cried out, so close to orgasm it was painful. Even the cool water couldn’t cool the fever for him in her blood, a need that grew with every hour she knew him.</p><p>He caught her breast in his free hand, squeezing with a tenderness so at odds with the ferocity of his passion. She gripped the back of his head with both hands and ate at his mouth, sucking his tongue and moaning as the orgasm hit her with the force of a hurricane. He choked out her name as she tightened around his thrusting fingers, her body trembling so violently she thought she might break apart into thousands of tiny pieces.</p><p>It was Jared who held her together as the pleasure raced across her nerve endings like an electrical charge. He sank onto the bench and pulled her into his lap, his arms banding around her as she shivered with sweet, fiery aftershocks.</p><p>Chapter ten </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jared finished his list of unusual package deliveries to investigate and began gathering up the items he needed to take with him to the motel. When Darcy’s doorbell rang, he straightened and moved toward it, waving her back when she headed for it, too.</p><p>“I’ve been perfectly safe for three years now,” she reminded dryly, but she backed off and let him get it.</p><p>Finding Jim Ralston on her doorstep with a six-pack of beer in his hands made Jared immediately irritable. He’d never been the possessive type, certainly had never cared who his lovers had fucked before he’d come along. But the animalistic drive to claim Darcy as exclusively and irrevocably his extended beyond the bedroom. He fought it back with effort.</p><p>“Inspector,” he greeted the man.</p> <p>“Deputy,” Ralston returned, his eyes lit with amusement. He was dressed casually in black jeans and a button-up shirt that was rolled up at the sleeves and open at the throat. His civilian clothes made him look younger and gave Jared his first inkling of what might’ve prompted Darcy to have a friends-with-benefits relationship with the man.</p><p>Darcy rounded Jared with a welcoming smile. “Come in, Jim. Ah, and you come bearing gifts. Deputy Cameron’s heading out for pizza with his partner, which has got me craving some. You up for that?”</p><p>Ralston stepped into the house, the storm door gliding closed behind him. “I’ll have to take a rain check. I’ve got a date with the insurance adjustor who’s looking over Nadine’s shop. She called after I’d already left the house to say she was running late, so instead of driving all the way back and waiting around, I figured I’d make a pit stop here until she calls again.”</p><p>Her eyes brightened. “Yeah, a hot date trumps pizza. Good for you.”</p><p>Returning to the coffee table, Jared grabbed what he needed along with the keys to the BMW. “I’ll be no more than a few hours. I’ll call if I’ll be back later than that.”</p> <p>Darcy came to him, looking just as hot in stretchy pants and a V-neck T-shirt as she had in the red dress she’d worn to lunch. “You know where to find me.”</p><p>“Walk me out.” He glanced at Ralston, feeling marginally better knowing the man was going out to get laid tonight. “I’d like to see you tomorrow, Inspector. Go over a few things with you.”</p><p>“Absolutely.” Ralston gave a curt nod. “Buzz me and we’ll work out a time.”</p><p>When they reached Darcy’s car, Jared dropped his stuff in the back through the open roof, then turned toward her to catch her close. He brushed his lips across hers and murmured, “When Ralston leaves, lock up the house.”</p><p>She looked prepared to argue, then seemed to think better of it. “Okay.”</p><p>“Thank you.” He kissed the tip of her nose. “For everything.”</p> <p>“It’s been my pleasure, Deputy.”</p><p>“I’ll be back quick as I can.” He smacked her ass cheeks with both hands and squeezed playfully, lifting her to her toes against him. “Set out some lube on the bedside table. Bottled water, too.”</p><p>“You’re a machine.”</p><p>Flushed and sporting kiss-swollen lips, she looked like a woman who’d been fucked long and well. It suited her. If he had his way, she’d be looking just like that every day from here on out.</p><p>She grinned as if she knew his thoughts. “Lucky for you, I can take it.”</p><p>He pressed his temple to hers, needing her safe and happy and close. He needed the time and space to explore the connection between them, both physical and emotional.</p><p>Backing away, Jared admitted that his emotions were still raw from their interlude in the shower. She was deep under his skin already. “Yeah, lucky me.”</p><p>WAVING, DARCY WATCHED Jared drive away in the car that was her last real piece of her former life. She clung to it for that reason and because she loved it. Thankfully, her parents owned the house outright and she didn’t have to pay rent. Otherwise, she wouldn’t have been able to afford to keep the car with what the town paid her.</p> <p>“Things are moving pretty fast with you two,” Jim said, coming out of the front door with an open beer in each hand.</p><p>She accepted the one he handed her and smiled. “That’s an understatement.”</p><p>Together they walked back up to her porch and sat on the swinging bench. With one leg tucked beneath her and the other on the ground, she rocked them gently.</p><p>“He likens it to being smacked upside the head,” she said. “I have to say, I did feel like I’d been sucker-punched when I first saw him.”</p><p>“I’ve been hearing the women around town talking about him. I gathered he’s considered very attractive.”</p><p>“That helps. But it’s not everything.”</p><p>“That’s true.” He tipped his bottle back and took a long drink, the muscles of his tanned throat working with each swallow.</p><p>She looked away. The sky was deepening into shades of pink, purple, and navy blue. The breeze grew in strength, cooling slightly and carrying a tinge of salt from the nearby ocean. “We’re due for another fire, aren’t we?”</p><p>“Yeah,” he said. “And we’re just sitting here. Makes me so goddamn mad that we know he’s out there and there’s nothing we can do about it.”</p><p>“Deputy Cameron thinks Dani’s murder and the fires are connected.”</p><p>Jim froze, his green eyes going wide. “What? Why?”</p><p>“He can explain it better than I can, which is why he wants to hook up with you tomorrow, I’m sure.”</p><p>“Wow.” He shook his head. “I’m speechless. Not a conclusion I would’ve jumped to.”</p><p>“I know, right?” Darcy took a pull on her beer. “Fucking insane. All of it.”</p><p>Reaching over, he set his hand on her bent knee. “I’m sorry. This has got to be really tough for you.”</p><p>She looked at the spot where her car had been and thought about Jared. Knowing he was working on Dani’s case was keeping her grounded and, for the first time in a long time, optimistic. Placing her hand over his, she squeezed. “I’m okay. Been a long time since I was able to say that and mean it.”</p><p>Her smile faded as the sheriff’s vehicle pulled up in front of her house. She watched as Chris got out and put his hat on his head, his gaze holding hers as he shut the door of his cruiser and rounded the front end. “Hey, Darcy. Jim.”</p><p>Jim returned the greeting, but she waited until Chris joined them on the porch, his boot-clad feet thudding heavily over the wooden planks and his leather holster creaking.</p><p>“What brings you out this way?” she asked.</p><p>“I need to speak to Cameron.”</p><p>“He’s not here.”</p><p>Chris cursed under his breath. “Where is he?”</p><p>“With his partner. Working the case.”</p><p>“Fuck. Did you know he thinks Dani’s murder is related to your arsonist?”</p><p>“Yes.”</p><p>“He’s in town two damn days and he’s going to wrap up a cold case along with the arsons? That’s bullshit.”</p><p>Her brows rose at his vehemence, but she wasn’t overly surprised. Chris didn’t like others digging into his cases and she couldn’t blame him. She knew how she’d feel in his shoes. “It’s an angle, but it’s not his only angle. I watched him compiling information—he’s covering a lot of bases.”</p><p>Leaning forward, Jim set his elbows on his knees, holding his beer in both hands. “Chris.”</p><p>Something about the way Jim said his name had Chris stiffening. Darcy frowned.</p><p>“What?” Chris snapped.</p><p>Jim stared at him.</p><p>“Don’t look at me like that, Ralston. You don’t know shit.”</p><p>Darcy’s gaze shot back and forth between the two men. “What doesn’t he know, Chris?”</p><p>Chris glared at Jim. “Nothing. Absolutely nothing.”</p><p>Putting both feet on the deck, she stood. “That’s crap. Don’t lie to me. Not about this.”</p><p>Jim pushed off the swing, too. “Dani told me.”</p><p>“Bullshit.” Chris ripped the hat off his head. “That’s fucking bullshit.”</p><p>“Dani told you what?” she demanded, her temper flaring.</p><p>Jim kept looking at Chris. “It’s going to circle back around to person of interest.”</p><p>“Fuck you, Ralston,” Chris shot back, turning to leave.</p><p>Darcy focused on Jim. “Jim?”</p><p>As his mouth opened to reply, his cell phone rang. “Damn it. Hang on, Darcy.” He stepped to the other side of the porch to take the call.</p><p>She set her beer on the little glass table by the swing and watched as Chris stalked back to his cruiser. She followed. “What the hell is going on?”</p><p>Then it hit her. Person of interest. There had been only one person of interest in Dani’s case...</p><p>“It was you, wasn’t it, Chris? You were the one seeing Dani.”</p><p>“No. Damn it.” He spun around halfway down her front walkway, his face red and eyes fierce. “It wasn’t like that.”</p><p>Darcy’s heart raced. “What was it like, then, Chris?”</p><p>He stared down at her when she came to a stop in front of him, his handsome face taut with strain. “She changed after you left, Darcy. A lot. She started dressing different, acting different, styled her hair and makeup different.”</p><p>“You were attracted to her.”</p><p>“No, I wasn’t.” He crossed his arms, looking ornery and defensive. “You’re the one I want. No one’s like you, Darcy. What we had...You can’t tell me you don’t think about it. We couldn’t get enough of each other.”</p><p>“Jesus, Chris.” She exhaled harshly. “We were kids. Teenagers for god’s sake. We were hormonal, and frankly, there wasn’t much else to do around this town.”</p><p>“I still get hard thinking about the things we did. Your mouth and hands on me...the noises you make—”</p><p>“What the fuck does that have to do with Dani?” Her sister wasn’t like her. She had been softer, sweeter. Sex had been highly personal for her. Darcy enjoyed sex for sex; Dani had equated sex with emotional commitment. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“She stopped by my house one night. Dressed like you, smelling like you. She came on to me like a freight train. I couldn’t help but think of you.”</p><p>“Oh my God...” Darcy turned away, feeling sick.</p><p>“I know you don’t believe me. You’re thinking Dani wasn’t like that. She was the quiet one, the good girl. But she wasn’t that way after you left. It was as if she wanted to be you.”</p> <p>She barked out a humorless laugh. “Please. Dani was perfectly happy being Dani.”</p><p>He grabbed her by the arm, squeezing hard enough to bruise her, yanking her back around. His face was so hard and furious she recoiled from it.</p><p>“Hey,” Jim yelled from the porch. “Watch it, Miller.”</p><p>“I wasn’t the only one banging her,” Chris bit out, releasing her. “Because I’m not the one who knocked her up.”</p><p>She slapped him before she knew she was going to.</p> <p>“You won’t want to do that again.” His voice was low and deep, his gaze dark and hot. The imprint of her hand glowed red on his cheek, intensifying the look of fury on his face.</p><p>Her tummy quivered with fear.</p><p>“There was someone else,” he insisted. “I gave her what she wanted that night and once more afterward. That was enough for me. She wasn’t you, couldn’t even come close. It was done and over long before six weeks prior to her death.”</p><p>“You’re an asshole. A Grade A prick.”</p><p>“For taking what was thrown in my face? Repeatedly? Does it make you feel better to lie to yourself?”</p><p>“Nothing can make this better.” She backed away.</p> <p>“Don’t fucking look at me like that.” He stepped closer. “You know me. You know I couldn’t do what was done to her.”</p><p>The awful thing was, she couldn’t imagine anyone she knew hurting Darcy the way she’d been hurt. But what did she really know about anyone, if Chris could’ve hidden this from her?</p><p>Jim came up beside her, his hand gently gripping her elbow. “You should go now, Sheriff,” he said grimly. “Go find Deputy Cameron and tell him what he needs to know.”</p><p>“Darcy...” Chris stared at her for a long minute, then cursed under his breath. “We’re going to talk about this. We need to talk about this.”</p><p>She turned her back on him and walked to the house.</p><p>“THAT’S THE WACKIEST theory I’ve heard in a long time,” Trish said bluntly. “Maybe ever. You’re trying to pin first-degree murder and arson on the same subject, with years in between crimes. It’s highly unlikely.”</p><p>Jared met her gaze and nodded grimly. “I know. But there are connections. After looking over Kelley’s notes, I found out Danielle’s obstetrician’s office is catty-corner to the phone booth where the tip came in for the shelter fire.”</p><p>“Could be coincidence.” She sat back in her chair at the small table in her motel room and rubbed the back of her neck, her dark eyes capped with a frown. “Think of the premeditation required to copy both the Prophet’s and Merkerson’s MOs.”</p> <p>“I’ve requested a cross-check of library lendings of true crime stories on both. It’s a long shot, but at least we’ll tie off that thread.” He looked at his laptop screen and the case files Kelley had sent his way. “There was DNA from the fetus, but not one man in this town—regardless of age—volunteered a sample to rule himself out. Not one? And no probable cause on anyone to justify a warrant, because no one pointed a finger anywhere. Everyone knows everyone’s business in this town, but not who’s intimate with the vet, a woman who’s lived here her whole life?”</p><p>“They don’t believe he’s one of them. Everyone’s innocent, so there’s no one to be guilty.” She sighed and grabbed another slice of pizza out of the box they’d tossed on the bed. “Small towns. When everyone knows everyone else’s business, they can’t believe there’s something they don’t know.”</p><p>“You sound like you speak from experience.”</p><p>“I grew up in a small town. Some things are universal.”</p><p>He filed that information away for further pondering. “Our subject has no imagination. He hasn’t been thinking about killing and burning for years, as we’d expect, or he’d have his own pattern, his own style. Instead he has to borrow someone else’s, right down to the tiniest details. And when he’s done what he set out to do, he puts the urge away. Goes back to being himself. Forgets about it. Because he’s crazy as a loon, but his crazy doesn’t eat at him every day. Something has to set it off.”</p><p>“So we need to figure out what set him off. Maybe it was the baby the first time around. Maybe the guy’s married. That’s why they kept the relationship under wraps. I’ll look up the men in this town who were married at the time and see what shakes loose.”</p><p>He looked up at her. “We also need to find out what happened in the last year or so that set off the fires, with a cushion for the learning curve required to build those incendiary devices. Then we can try and tie that back to the murder. I’ve already started searching through the local paper’s archived articles on the web, but they didn’t have a website three years ago, so I’ll have to hit the microfiche at the library if we need to go back further.”</p><p>“It’s a wide net we’re casting.” Trish wiped her mouth with a napkin.</p><p>“Inspector Michaels is working on drafting a list of locales in town that had some special tie or significance to her sister. All three locations so far met that criterion.” He closed his laptop. “We’ll need Miller to cover surveillance on the best options.”</p><p>She snorted. “That may be asking a little too much from our friendly sheriff. He didn’t take it well when I mentioned your theory.”</p><p>“He’ll get over it.” Jared pushed back from the table and stood. “I’ll meet up with him tomorrow and get him on board.”</p><p>“You going back to the inspector’s place?”</p><p>He shot her a look.</p><p>“Hey.” Grinning, she held up her hands. “Just surprised is all. You’re different with her, in a good way. I hope it works out.”</p><p>He’d do whatever was necessary to make sure it worked out.</p><p>He was shoving his laptop into the padded sleeve in his workbag when a faint hiss caught his awareness. He stiffened as the hairs on his nape prickled with warning. His nose twitched; his gaze darted to the door, then to the vent in the wall near the ceiling. Sleek tendrils of smoke reached into the room like skeletal fingers, curling sinuously. He yanked the bedspread off the mattress, sending what was left of the pizza flying, and tossed the floral material over Trish’s head.</p><p>“What the hell, Cameron?” she gasped as the fire sprinklers in the ceiling sputtered to life. She lifted the comforter over both their heads, shielding the table as he swept everything into his open bag.</p><p>He’d barely yanked the door open when the room exploded.</p><p>Chapter eleven</p><p>Darcy forced herself to loosen her white-knuckled grip on her phone. “How could no one know about Chris and Dani, Nadine?”</p><p>“Hell if I know. I can’t believe it. How could I not know? I didn’t even suspect.”</p><p>“God.”</p><p>“But Chris is the sheriff. If anyone would know how to cover their ass, I guess it’d be him. Not because he killed her. I could never believe that. If anything, he hid it because he knew he’d blow any shot at getting back together with you if you found out he’d tagged Dani.”</p><p>Inhaling a deep shaky breath, Darcy swiped at the tears coursing down her cheeks. It was impossibly painful hearing that Dani had changed so much. She still couldn’t quite believe it, couldn’t in any way picture it. “What the hell was she thinking? Did she love him? She had to have...How long had she loved him? And if he’s telling the truth about ending it long before she got pregnant, who else was in her life?”</p><p>Nadine sighed. “I don’t know. Maybe she missed you. Or maybe she’d been jealous of you for a while. Jealousy can make a woman lose her mind. Or maybe she was just stretching her wings and she took your example to the extreme. I’m not a shrink, doll. Or a psychic. I don’t have the answers for you. I’m sorry.”</p><p>“I have to go.”</p><p>“Want me to come over? Or is your hunky deputy with you?”</p><p>“I’m fine. Thank you, Nadine. I’ll talk to you later.” She hung up, gasping for air and drowning in grief as if she’d lost Dani all over again. She’d sent Jim off on his date, then she’d locked herself in the house, feeling too exposed to associate with anyone but Jared, who’d already seen her bared to the soul.</p><p>Clinging to the receiver, she paced, fighting the urge to call him. He had more important things to do than listen to her breakdown. Besides, their relationship was so new and had already been weighted by heavy issues. The least she could do was give him a little time to get away from her and do his job in peace.</p><p>She jumped when the phone rang in her hand. Glancing at the caller ID, she saw it was dispatch and her stomach clenched.</p><p>Another fire goddamnit.</p><p>“Michaels,” she answered. “Where is it?”</p><p>Her heart missed one beat, then stuttered back into a panicked rhythm. “My God...”</p><p>DARCY SAW THE smoke and flashing emergency lights long before she reached the scene. She parked her work truck on the street and hopped out, her heart racing as it had been since she’d received the call from dispatch twenty minutes prior. Not having a car had held her back, forcing her to beg the use of one from a neighbor to get to the fire station.</p><p>Jared.</p><p>She climbed out of the department’s truck and grabbed her field kit, forcing herself not to run or appear as panicked as she felt. It wouldn’t be fair to lose him now. It was too soon. She’d had only a taste of what he could bring to her life. Not nearly enough...</p><p>Her attempt at decorum was forgotten the moment she saw him sitting on the back of an ambulance with an EMT examining him. Her pace picked up. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Although he couldn’t possibly have heard her coming with all the chaos around them, his head lifted and his gaze met hers. He pushed to his feet, saying something to the female paramedic without taking his bloodshot eyes off Darcy. He was soot-stained but alive, making him the most beautiful thing she’d ever seen.</p><p>Shoving her kit at a passing firefighter with a hasty thanks, she broke into a run. Jared met her halfway, catching her up and squeezing the air out of her.</p><p>“I’m okay,” he said hoarsely. “It’s all right.”</p> <p>“You scared me half to death.” She held on to him with every bit of her strength. “I c-can’t let you out of my sight for a minute.”</p><p>He cupped the back of her head and pressed her close. They clung that way for a long moment, their hearts pounding in a synchronized beat. The cold knot in her stomach eased at the feel of him against her, warm and strong.</p><p>She pulled back to examine him. “How’s your partner?”</p><p>“Well enough to be in the front office typing up a prelim report. This riled her up.” He brushed his fingertips over her brows. “Walk me through the scene with you. The sooner we get through it, the sooner we can get out of here.”</p><p>Darcy drew herself together with a deep breath, then stepped back and went in search of her kit. Her hands were shaking as she reached for the box.</p> <p>Chris intercepted her. “Where’s Jim?”</p><p>“On his date. He knows what’s going on. I told him I’d handle it, and if I had any trouble, I’d give him a call.”</p><p>He nodded, then yanked off his hat to shove a hand through his hair. “Hell, Darcy. Five of the rooms were occupied. A half dozen people could’ve been killed.”</p><p>“Was anyone seriously injured?”</p><p>“Tear gas in the air duct system pushed everyone out before the fire started.”</p><p>Jared stepped into Chris’s line of sight. “You keep tear gas in inventory, Sheriff?”</p> <p>“Already looking into it, Cameron.”</p><p>She looked at the two-story building, noting the area with the most damage. “The fire started in Morales’s room?”</p><p>Jared set a grimy hand on her shoulder and squeezed. “Yeah.”</p><p>“Shit.” She reached up and set her hand over his, needing to deepen the connection.</p><p>Chris’s gaze narrowed. “Someone wants you dead, Deputy.”</p><p>“Wouldn’t be the first somebody.” The raspiness of Jared’s voice made her wince in sympathy.</p><p>“Let me do my job,” she said. “And we’ll see if we can find something that gets us closer to figuring out who our torch is.”</p><p>She moved toward the obvious point of origin with a brisk stride.</p> <p>Jared drew abreast of her. “You’re aggravated with him.”</p><p>“Some things have come up since I saw you last.”</p><p>“Oh?”</p><p>“Ask me about it when we get home.”</p><p>IT WAS JUST after midnight when they got back to Darcy’s house. Jared could see how exhausted she was but knew more than the length of the day was weighting her slender shoulders. He decided not to press her to talk, to let her decide when she was ready to share. She was a solitary woman in many ways. Joining her inner circle was going to take time and patience. The latter wasn’t one of his strong suits, but he’d make the effort for her. Not that he had a choice; he wanted her too much.</p><p>In the meantime, he showered, then made them both some cold sandwiches while she typed her preliminary report for Ralston. When they crawled into bed just after two in the morning, she turned into him, wrapping herself around him. With her legs tangled with his, her palms pressed to his back, and her face in his neck, he dropped into a deep sleep.</p><p>He woke up alone. Glancing at the clock, he noted it was barely six. He left the bed, then the bedroom, looking for Darcy. He found her in the living room, curled up on the couch beneath a chenille throw. She was watching a muted television, her eyes marred by dark circles. An open box sat on the floor by the coffee table, holding a variety of loose items, including framed photos of Darcy and Danielle.</p><p>“Hey,” he said softly. “Let me join you.”</p><p>She sat up at his urging and he settled behind her, taking her weight against his chest. He ran his fingers through her hair, brushing it back from her forehead. The feel of her bare skin against his soothed him. As the explosion had thrown him out into the parking lot, his thoughts had been with Darcy and how he’d be damned if some sick asshole blew him to hell before he figured out what he had with her.</p><p>“You wanna talk?” he asked softly.</p><p>Turning her head, she pressed her cheek to his chest. “I don’t even know where to begin.”</p><p>“Wherever you want.” He kissed the crown of her head, hating the misery that radiated from her and his helplessness to alleviate it. “I can pull it all together later.”</p><p>“How much crap can I dump on you, Jared, before you run screaming?”</p><p>“I never scream and I damn sure never run away.” He gripped her shoulders, resisting the urge to give her a little shake. “Spit it out.”</p><p>In a low halting voice, she told him about Miller’s visit and her subsequent talk with Nadine. “I knew she had to be with someone familiar to me, but Chris...? I can’t believe she didn’t say anything. I wouldn’t have been upset.”</p><p>“A lot of people have secret lives. Their loved ones are shocked when they come to light. It’s no reflection on you.”</p><p>“I can’t help thinking that I fucked up somewhere and that’s why she couldn’t trust me with this.”</p><p>“It sounds like it was a couple random encounters. Maybe she was embarrassed. Heat-of-the-moment type thing that she regretted.”</p><p>“Even more reason to tell me, so we could’ve laughed it off and put it away.” She exhaled harshly. “And Chris...Wow. He had a responsibility to disclose his affair with her to the Feds. Why didn’t he, if he had nothing to hide?”</p><p>“It’s definitely a problem. But at least we’ve got enough to get a DNA sample from him now.”</p><p>“I’ve known him forever. He was my high school sweetheart. I thought I knew him.” Her exhale shuddered out of her. “I wanted to vomit when he said he slept with Darcy as a substitute for me. It’s so sick.”</p><p>“How far would he go to keep you from finding out about it? Especially if he’s the one who got her pregnant?”</p><p>She twisted to look into his eyes. Her gaze was so haunted it gored him like a dull knife.</p><p>“I hate that I was thinking the same thing,” she whispered. “He was important to me at one time. How could I be so wrong about two people I thought I was close to? The Dani I know couldn’t stomach casual sex. She always became emotionally attached when things got physical. And Chris...he’s a sheriff, for chrissakes.”</p><p>Jared brushed his fingertips over her cheek. “It’s killing me that you’re hurting and I can’t do a damn thing about it.”</p><p>“You’re here. That’s what I need more than anything.” Leaning into his palm, she sighed. “The answers will come later. We’ll find them.”</p><p>“Did she have a bad breakup shortly before her involvement with Miller?”</p><p>Her gaze softened. “You really do pay attention when your sister talks, don’t you? Yes, she met a fellow vet at a conference, and it was hot and heavy for a while. Then she found out he was married and that she was just a piece of ass on the side. She took it hard. I thought she’d sworn off men.”</p><p>“Or became determined to prove she didn’t give a shit about them.”</p><p>Darcy sat up, the throw falling to pool in her lap. “And I’m her example for that? What the fuck does that mean?”</p><p>“That she had issues,” he said calmly, “and she didn’t know you all that well. You like men just fine. You just hadn’t met one you liked enough to get serious about.”</p><p>“Until you.”</p><p>He inhaled deeply at the admission, knowing how important it was to her. And to him.</p><p>She stood, gloriously naked, agitation pouring off her in waves.</p><p>Straightening, he tossed the throw aside and held her gaze. “None of this is your fault, Darcy.”</p><p>“Right.” She paced, her lithe muscles flexing through her thighs and buttocks. “You know, you say ‘commitment’ and I get butterflies.”</p><p>“You’ve had commitments before. This one scares you because it’s the last one you’ll have.” He set his elbows on his knees and linked his fingers together. Between his spread legs, his cock was hard and thick, thrusting upward hungrily in appreciation of the sight of his woman. “Even I find that scary.”</p><p>She paused midstride, staring at him. He saw her chest expand on a slow breath and her eyes darken with both grief and longing. Her turmoil was tangible, and unable to bear it, he pushed to his feet. She plowed into him, nearly knocking him back into the couch. Catching him by the nape, she yanked his mouth down to hers. His teeth cut his inner lip and the sharp metallic flavor of blood stirred him violently.</p><p>Lightning in a bottle. It had struck the moment they’d laid eyes on each other. Sexual creatures that they were, they’d both mistaken it as lust at first, and certainly that was a major part of what they knew about each other so far. But lust could be appeased. Sated. What they had ran much deeper, was more voracious than mere desire.</p><p>Gripping her by the elbows, Jared lifted her to her tiptoes and took over the kiss. His lips sealed over hers, his head tilting to find the perfect fit. The stroking of her tongue along his was as arousing as if she’d licked his cock.</p><p>She reached down and grabbed his ass, grinding against him, massaging his dick with the soft firmness of her lower belly. “Fuck me.”</p><p>“Darcy.” There’s nothing he wanted to do more, but the rapid-fire switch in her mood gave him pause. He couldn’t afford to screw things up with her. As fragile as she was at the moment, the intensity of their lovemaking could be too much. “Easy, sweetheart. I’ll take care of you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I need you inside me, Jared.”</p><p>He caught her face in his hands. “Let me set the pace. I know how to give you what you need, when you need it.”</p><p>Her nails dug into his flesh. “I need it now.”</p><p>She dropped to her knees and took him in her mouth. The drenching heat, followed by powerful sucking, nearly sucked the cum right out of him. Her tongue fluttered. Her cheeks hollowed with deep, drawing pulls. Maddened by her greed for his body, his balls drew up tight, the urge to blow his load almost too great to resist.</p><p>Catching her beneath the arms, Jared yanked her up. If he didn’t get a handle on her, she’d have him so spiked he’d bang her on the couch again, rutting on the woman he was falling in love with like an animal in heat. On any other day there’d be no problem with that, but not today. Today they both needed more than a quick, furious orgasm.</p><p>“We’re doing this in a bed this go-round,” he muttered, lifting her feet from the floor and carrying her to the bedroom. She wrapped her legs around his hips, wiggling, trying to align their bodies. When the satiny soft lips of her cunt slid across the crown of his dick, his step faltered, his chest vibrating with a groan.</p><p>Darcy caught his mouth, latching on to his tongue and sucking. His knees buckled and he cursed, leaning heavily into the wall to keep them both upright. “Behave, damn it. Before I nail you on the floor.”</p><p>“Yes...Do it.”</p><p>Cursing, he stumbled into the bedroom and dropped her on the bed. As she dove for his cock again, he snatched his handcuffs from the nightstand and intercepted her. He had her hands restrained at the small of her back before she knew what hit her.</p><p>She froze prone on the bed, her breathing quick and shallow. “What are you doing, Deputy?”</p><p>“Pacing us, Inspector.” He was going to give her the love and tenderness she needed, by any means necessary.</p><p>“No.”</p><p>“No?” He ran the pad of his index finger down the length of her spine, finding the sight of handcuffs against her bare back the most erotic view of his life.</p><p>“I want you now.” Her voice was even breathier than usual and it did crazy things to him, taking him to the very edge of his control.</p><p>“You’re going to get me now, sweetheart. All you can take and more.”</p><p>Chapter twelve</p><p>Darcy absorbed the feeling of heavy metal around her wrists, then she processed how she felt about it.</p><p>Jared arranged her carefully with effortless strength, until she found her feet on the floor and her torso draped across the mattress. With her hands bound, it was a vulnerable pose. A shiver of anticipation coursed across her skin in a wave of goose bumps.</p><p>His lips whispered along her arm from shoulder to fingertip. “You’re so fucking hot in handcuffs.”</p><p>Hearing the lust in his voice spurred her into a feverish desire. Her breasts were tender, the nipples furled tightly against her rumpled sheets. Her pussy was damp and swollen, aching for the feel of his big cock pounding into her.</p><p>“Jared...I need you.” She felt cold inside. Distant. As if a part of her had shied away and retreated, like it had when Dani died. Jared had lured her out when he’d entered her life, made her start thinking beyond the moment, enabling her to envision a day when she might be able to put Dani’s death behind her and get her life back. She needed him to do it again, make her feel again.</p><p>“I know.” His hands slid under her and cupped her breasts. He nuzzled his lips just below her ear. “I need you, too.”</p> <p>He caught her nipples between thumb and forefinger, tugging gently. His cock brushed against her hands and she clasped him, her eyes closing when he groaned and thrust into her touch.</p><p>He was hard as a rock and hot. She squeezed her thighs together, fighting off the building throb. She’d wanted to make him come in her mouth, wanted to hear his pleasure. Taste it. Drink it down.</p><p>“Let me suck you off,” she said in what might have passed for a plea.</p><p>“Later.”</p><p>Darcy heard him move behind her, felt his hands cupping the backs of her thighs in the crease just below the curves of her buttocks. His breath gusted gently over the slick lips of her sex. She tensed in expectation.</p><p>“Such a pretty pussy,” he murmured. “I’m going to eat this cunt every chance I get for the rest of your life, Darcy. I’m going to shove my tongue in your hot little hole and tongue-fuck you so often you’ll feel strange when my mouth’s not buried between your legs.”</p><p>The rawness of his passion for her continued to astonish her. It mirrored her own in a way that felt like...kismet, a concept her rational mind scoffed at. But there was no denying that being with Jared felt like being half of a whole, two individuals drawn to one another by a fiery magnetic pull that was irresistible.</p><p>She bit her lip and quivered violently as he licked leisurely through her cleft, tracing her folds slowly and so gently that the touch of his tongue was like the kiss of a butterfly’s wings. Her hips circled into the teasing strokes, but he wouldn’t be rushed. When he finally pushed into her as he’d promised, she moaned into the bedding, so close to coming she could taste it.</p><p>Pushing her legs apart, Jared opened her farther, thrust his tongue faster, showing her with his greedy voracity how much he loved going down on her, how much pleasure he took in the carnal intimacy. His groans made her hotter. Wild and desperate. His morning stubble scraped along her tender skin; the rough silk of his hair brushed over her in a whisper of a caress. She gasped and writhed, her skin misting with sweat as his tongue fucked relentlessly into her, making her cream for him until her inner thighs were wet with it.</p><p>“My clit,” she begged, her muscles trembling with the strain. “Lick my clit.”</p><p>Instead, he moved in the opposite direction, rimming the pucker of her ass with the pointed tip of his tongue. Darcy cried out, the tight ring of muscle flexing in delight. With a groan, he took her there with a lush dark kiss, pushing into her and thrusting shallowly.</p><p>Aroused beyond bearing, her body shook so hard the mattress vibrated with her, her hands fisting and releasing in mindless spasms. Pushing to her tiptoes on the floor, she lifted into his mouth, urging him on. Her entire body was a live wire, arcing with crackling sensual electricity.</p><p>“Yes,” she gasped. “Oh...it’s so good. I’m going to come...”</p><p>Spreading her cheeks with his thumbs, he held her open and pushed her into climax with rapid-fire licks. She ground her sweat-slick face into the sheets, muffling her scream as the release tore through her with brutal power, singeing her nerve endings and flushing her skin like a fever.</p><p>Then his fingers were there, slick with lube, expertly preparing her with deep leisurely thrusts into her rear. She pushed back into his hand, riding those two wicked digits with a barely tempered hunger. They stroked along her smooth inner walls, twisting and pumping until she thought she might go mad with the need to feel him filling her with his big, beautiful cock.</p><p>He stood. His lips touched her shoulder as his fingers left her. “How are you doing? Your arms okay?”</p><p>“Don’t stop,” she said hoarsely.</p><p>“I won’t. Not until you beg me to.”</p><p>There was the sound of foil crinkling, then the soft snap of latex. When he pushed into her pussy, Darcy jolted in surprise.</p><p>“Easy,” he murmured, steadying her with a hand on her hip. He paused a moment at the midway point, his breathing deep and even. Then he drove into her with one smooth, forceful thrust.</p><p>She came in a startled rush, crying out his name as the sensitive tissues rippled greedily along his thick length. He felt like heated stone inside her, stretching her to her limits and yet so—</p><p>“Perfect,” she breathed, closing her eyes, feeling his warmth spreading through her. Soothing her, just as she’d needed.</p><p>The terrible anxiety that had been ripping her apart since Chris’s visit the day before eased, dissipated by her bone-deep surety that she’d found the one man she could share herself with absolutely. Jared had come upon her during a terrible time and accepted it, accepted her as she struggled through it. Offering support and comfort in just the way she needed it. His quiet strength and determination gave her hope that Dani would have justice after all and that she might have a life without Dani in it, one that would fulfill her and give her a reason to strive forward every day.</p><p>But most importantly, Jared was the man she wanted to offer all those things to in return, with everything she had to give and more. She’d learn to be more for him. She wanted to be everything to him, everything he needed and wanted.</p><p>“Perfect,” he agreed, nuzzling against her temple. “It’s so good, Darcy. Do you feel it?”</p><p>“I feel it. Feel you...”</p><p>“Yes,” Jared groaned, his grip tightening on her hips. “Feel me.”</p><p>He began to fuck her with slow, deep thrusts, his rhythm perfectly controlled and fluid. He wielded his long, wide shaft with breathtaking expertise. Knowing just how to please a woman with it, but more, knowing just how to please her. Noting the nuances of her helpless response and focusing on what drove her to the edge. Stroking the thick crest over and over the sensitive spot inside her that made her insensate with pleasure.</p><p>“Feels so good...” she slurred, floating into a melting simmering orgasm with a breathless cry. He ground his hips against her, rubbing the deepest point of her, prolonging her pleasure.</p><p>“I’ll never get enough of you coming around my cock.” Flexing his fingers on her hips, he began shafting her pussy again. “Once more, sweetheart. Let me feel you.”</p><p>But once more wasn’t enough for him. He drove her to orgasm twice before pulling free and unshackling her wrists. He rolled her gently to her back, his mouth surrounding an aching nipple and sucking softly, his tongue flickering over the hardened point.</p><p>Darcy whimpered, so boneless she scarcely had the strength to run her fingers through his sweat-soaked hair. He was drenched all over, betraying the effort he’d exerted to make love to her with such selfless tenderness. He hadn’t come, forfeiting his own needs to give his attention to hers. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Take what you need,” she urged. “Take it how you need it.”</p><p>Rubbing her bent knee against his flank, she urged him on. With his gaze on hers, he rolled the condom off and wrapped it in a tissue from the bedside table, tossing it in the trash can beside it. Moving quicker now, he caught her leg and lifted it into the air to prop against his shoulder, then he did the same with the other.</p><p>He stared down at her, his features harsh with lust, his blue eyes dark and soft with emotion. “I’m crazy about you, Inspector.”</p> <p>He positioned his cock’s head against the lubricated pucker of her ass, groaning as the eager orifice flexed in invitation. She flowered open for him, catching her breath as the thick crown pushed past the tight ring.</p><p>With her heels in the air and her ass cupped in his hands, he pushed into the slick passage, his gorgeous face twisting in a grimace of tortured ecstasy as she clenched around him like a fist.</p><p>“Darcy, sweetheart, you’re so tight.” Sweat coursed down his temple and glistened on his flexing abdomen. “So damn hot. You’re scorching my dick.”</p><p>Her neck arched, her head pressing into the pillow as surrender radiated outward from the place where he pressed inexorably into her.</p><p>“Jared.” She moaned as pain mingled with her pleasure. The surfeit of sensation pulsed through her, tightening her chest and quickening her breathing.</p> <p>“I’m right here with you,” he said hoarsely. “Ah, God, I’m gonna come before I get all the way inside you.”</p><p>“Please...” She wanted that. Wanted to feel it. Wanted to know that there were no barriers between them physically, just as there were none between them emotionally.</p><p>Adjusting his grip on her hips, he pumped deeper, sliding over highly sensitive nerve endings. Her hands fisted in the disheveled sheets; her head tossed from side to side. It felt as if something feral were trying to claw its way out of her skin. She surrendered to it, surrendered to him, the uninhibited lover who took the sexuality she’d always embraced and enhanced in a way that made it new. Made it his.</p><p>Pushing onto her elbows, Darcy looked at where he entered her, her mouth drying at the sight of the thick veins pulsing along his rigid erection. He was at the limits of his control, yet still he held back for her. “Jared.”</p><p>His gaze was hot as it met hers. She tightened down on him and he jerked violently, sliding deeper. With a growl, he thrust in to the root and started coming, spurting hot and thick in the depths of her rear.</p><p>She writhed as her pussy clenched on the verge of climax, then screamed as he placed the pad of his thumb over her clit and rubbed, hurtling her into orgasm with him. They arched together, straining against the vicious ecstasy, Jared thrusting mindlessly as he pumped his semen into her willing body.</p> <p>As the tension eased and her body sank limply into the mattress, Darcy came to the awareness of the unabated erection sliding in and out of her ass. Blinking heavy-lidded eyes up at Jared, she moaned as his gentle fucking stimulated overworked and hypersensitive nerves.</p><p>“You just...”</p><p>“I did.” His voice was gravel-rough and sexy as hell. “And I have more to give you. Everything I am, Darcy. Everything I have. It’s yours.”</p><p>She set her hands over his where they gripped her hips. “Give it to me. All of you.”</p><p>Chapter thirteen</p><p>Jared ran his fingertips up and down the arm Darcy had draped over his abdomen and ran the gathered data through his mind for the hundredth time, searching for what he might’ve missed.</p><p>When Darcy bolted upright without warning, his arm shot out, his hand grasping for his weapon.</p><p>Breathing heavily, she stared at the gun he had aimed at the door, then met his gaze. “Dani never said a word to me about Chris, but she told Jim. I didn’t know they were close, her and Jim. Close enough that she’d share a secret lover with him.”</p> <p>“Okay,” he said carefully, returning his gun to its holster. “You’re following the same train of thought I had. I e-mailed Ralston’s name to Agent Kelley. She might have some questions for him.”</p><p>She pushed her hair back from her face. “I don’t want to make trouble for him. He doesn’t deserve it.”</p><p>He propped some pillows behind his back. “You deserve answers and I’m gonna see that you get them.”</p><p>“You don’t think he has anything to do with this, do you?”</p><p>“He wasn’t one of the subjects the Feds interviewed, so technically he didn’t lie to them, but it’s never a good thing to withhold information. It smacks of having something to hide.”</p><p>“Or someone to protect.”</p><p>Reaching for her hand, he linked fingers with hers. “How close is he to Miller?”</p><p>“Not very. But I do think he said what he did yesterday to protect Chris. If you tie the arsons and the murder together—which is what Chris came looking for you to talk about—outing Chris’s relationship with Dani absolves him of both. He has an airtight alibi for the first arson, he was out of town for three days prior to it—his sister just had a baby. And the night of the shelter fire he was in the station when the call came in, working on evaluations. Unless you find out differently, that makes it impossible for him to have been the one to set the fire or make the call from Seattle.”</p><p>He tugged her close, urging her to snuggle up with him again. “Can you get Ralston to talk to you?”</p><p>“Yes.” She laid her cheek against his chest. “When I talked to Nadine yesterday, she said jealousy can make a person crazy. If Chris isn’t the father of Darcy’s baby, there was someone else in her life. Maybe he found out about Chris and lost it.”</p><p>“We’ll figure out the why when we figure out the who. We’ll get there, sweetheart.”</p><p>She looked up at him. “I’m ready to put this behind me.”</p><p>“Where was home for you before you came back here?”</p><p>“Albuquerque. I wanted something arid after growing up with so much rain.”</p><p>“I can do arid.”</p><p>Her gaze softened. “Would you?”</p><p>“Sure, I can transfer.”</p><p>“When I left New Mexico, I thought it might be a while before I figured out what was next. I quit my job, sold my condo...” She ran her hand over the light dusting of hair on his chest. “I can start over anywhere.”</p><p>“I don’t care what the plan is, as long as it includes you.”</p><p>“After losing Dani and then last night...I could’ve lost you, too. A few minutes here or there and you wouldn’t be here now. I don’t want to waste any chances, Jared.”</p><p>He hugged her tightly. “We won’t. We won’t waste a thing.”</p><p>DARCY PULLED INTO the parking lot of the fire station and waved at Trish, who waited for them with Ralston by the open apparatus bay doors.</p><p>Jared stopped her from exiting with a hand on her arm. “I don’t want you leaving town. Even the animal shelter is too far. And I don’t want you in the car with someone else if you’re not behind the wheel. Don’t go anywhere private with anyone. And text me as you move around so I know where you are.”</p><p>“All right. I’m just going to pick over the motel scene with Jim, then come back here to the station to expand on my prelim report. If that changes, I’ll let you know.”</p><p>Dressed in her uniform, with her lush hair restrained in a ponytail, there was little evidence of the insatiable wanton who’d shredded him just hours before. Except in her eyes. The way she looked at him made his chest ache.</p><p>“You be careful, too,” she said quietly.</p><p>“Always.”</p><p>They split up and he watched her pull out of the lot a few minutes later, driving the pickup with Ralston in the passenger seat.</p><p>“You okay?” Trish asked.</p><p>“I’ve been better.” He faced her. “You?”</p><p>“Fired up. I want this shithead’s ass in a sling.”</p><p>His mouth twitched. “We’re starting here because of a volunteer named Mitch Quinn. There have been a few suspect shipments to the station, all under Quinn’s name. Inspector Michaels says he should be here today.”</p><p>“All right. Let’s talk to him.”</p><p>They found Quinn in the kitchen, putting away groceries. He looked up as they came in, his frown melting into a wide smile. With his shaggy blond hair and pale blue eyes, he had the look of a surfer about him, an impression strengthened by the seashell and hemp necklace visible through the opening in his uniform collar.</p><p>“Hi,” he greeted them. “Are you looking for Inspector Michaels?”</p><p>Trish returned his smile, but her game face was on, her eyes flat and watchful. “We’re looking for you, Mitch.”</p><p>He paused, then shut the refrigerator door. “What can I help you with?”</p><p>Jared stepped up to the island. “We need to talk about some of the deliveries coming through this station—”</p><p>Quinn shoved the groceries across the tile at Jared and fled.</p><p>“Well, shit,” Trish muttered.</p><p>Jared leaped over the oranges and apples spilling off the island onto the floor, and gave chase.</p><p>DARCY PICKED THROUGH the charred remains of the motel while Jim jotted notes in his folder.</p><p>“Your prelim was well done, Darcy.”</p><p>“Thank you.”</p><p>He closed the folder with a decisive snap. “When are you going to ask me why I didn’t say anything about Miller and your sister earlier?”</p><p>She faced him. “I was waiting until we got through the scene first.”</p><p>“All right. We’re finished for now. Since I was out all night, Columbo missed his morning walk. How about we pick him up and we’ll talk about it away from here?”</p><p>“Sounds good.” They headed back to the truck. She closed up the evidence collection boxes in the bed of the pickup and said, “I take it from your overnighter that the date went well?”</p><p>“Yeah...not bad. I appreciate you handling things last night.”</p><p>“You needed the break and I knew we’d need daylight to get the full scope.” She slid behind the wheel and headed to his house. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You know Chris isn’t responsible for what happened to Danielle, don’t you?”</p><p>Darcy glanced at him. “I can’t believe he’d do it. I can’t believe anyone I know could do that to another human being.”</p><p>Setting his elbow on the window ledge, Jim rested his head in his hand and sighed. “He wasn’t wrong when he said she’d changed. There’s no easy way to say this...”</p> <p>“So just say it.”</p><p>“She was...seeing a few men at the same time.”</p><p>Darcy’s grip tightened on the wheel. It was painful realizing there’d been a widening gap between her and Dani, and she hadn’t realized it. “Go on.”</p><p>“One of the guys was Mitch.”</p><p>“What?” But the moment she asked the question, she knew it wasn’t so surprising after all. Mitch was the sort of hardworking, good-humored type Dani had been drawn to. “Okay.”</p> <p>“When he caught on to her having other interests...it hit him hard. She was special to him and he hadn’t realized that feeling wasn’t mutual. So I went to see her, talk to her, try to get her to let him off the hook easy. Turned out she was upset because he’d been following her. Angling to catch her in the act, I suppose. She told me she’d been trying to cut him off for weeks and if I was really worried about him, I’d tell him to knock it off or she’d have Miller arrest him.”</p><p>She felt him look at her, his gaze heavy on the side of her face. “Darcy...I bluffed when I said she told me about her and Miller. There was just something in her voice. I wondered. When he showed up at your place so upset about tying the arsons in with the murder—I took a shot in the dark.”</p><p>Pulling up in front of his house, she parked and twisted to face him. She thought of Jared asking her about Mitch that morning and wondered what had drawn his attention in that direction. “Do you think Mitch killed my sister?”</p><p>“No! Hell, no.” He shook his head violently. “If I even suspected that, I would’ve driven him to the sheriff’s office myself. Danielle was driving into Seattle a lot. I figure that’s where she met the guy, whoever he is.”</p><p>She shoved the door open and got out, needing to stand and suck in air to get past her sudden nausea. “I really need that walk.”</p><p>“THAT WAS A real dumb move, Mitch.” Trish circled his seat at a metal interrogation table in the sheriff’s department. “Running from a marathon man like Deputy Cameron.”</p> <p>Through the two-way mirror, Jared watched Mitch Quinn sprawl insolently in his chair and shake his head. “I wasn’t running from the deputy. I left some ice cream in the truck.”</p><p>“Um, ice cream. What flavor?”</p><p>“Vanilla.”</p><p>“Ah, too bad. I like chocolate myself.” She settled in the seat across from him. “So, let’s talk about some of the packages that have been shipped to the station to your attention.”</p><p>Quinn met her gaze directly. “All packages coming into the station are addressed to me. Stuff was getting lost before. I keep things organized.”</p><p>“You’re meticulous, aren’t you, Mitch?”</p><p>“I am, yes.”</p><p>Trish nodded. “I bet building a precision incendiary device would be child’s play for a dedicated, meticulous, organized fireman such as yourself.”</p> <p>He bolted upright. “Now, wait a minute! You’re not pinning the arsons on me. I fight fires, I don’t start them.”</p><p>“But in a town of this size, there’s no budget to take on more permanent firefighters, is there? Unless there was suddenly a rash of fires in the area. An arsonist setting up shop here would be almost a blessing for a long-suffering volunteer.”</p><p>“That’s sick.”</p><p>“I agree. The supply room here in the sheriff’s office is missing a can of tear gas. Did you know tear gas was used in the motel fire last night? Our arsonist didn’t mind charbroiling me and Deputy Cameron, but he wanted to get the other guests out. You were in the supply room yesterday, Mitch. What for?”</p><p>“Because there was a note on the dry erase board in the station telling me to grab a box labeled LBFD—Lion’s Bay Fire Department, if you couldn’t figure it out.”</p><p>“Who left the note?”</p><p>“I don’t know.”</p><p>“You didn’t recognize the handwriting? A meticulous guy like you?”</p><p>Quinn’s gaze was icy. “I didn’t look at it that closely.”</p><p>“All right.” She pulled out her cell phone. “I’ll text Deputy Cameron to snap a picture of it and bring it over.”</p><p>“I erased it after I finished the job,” he bit out. “That’s what we’re supposed to do, so we don’t have guys trying to do jobs that have already been done.”</p><p>“That’s a shame. Or maybe I should call it convenient?”</p><p>“This is a witch hunt. You’re looking for a scapegoat to keep your record looking good and I’m the lucky guy. No way. I’m done talking. I want a lawyer.”</p><p>“Fuck,” Miller muttered from his place beside Jared in the observation room. “This is why I should’ve interviewed him. He’d trust me enough to hold off on lawyering up.”</p><p>“Too risky,” Jared said, although he’d already said it before. More than once. “If the arsons in any way tie back to Danielle Michaels’s murder, you and I both have a conflict of interest. This way we’re keeping it semi-clean.”</p><p>His cell vibrated and he pulled it out of his pocket, reading the text from Darcy that said she’d gone to Ralston’s house and that he’d pegged Mitch Quinn as one of Danielle’s lovers.</p><p>Trish pushed back from the table. She’d gone casual today with jeans and blouse paired with a Marshals Service Windbreaker, but there was nothing soft about her approach to the job. “Maybe your lawyer can explain why you checked out three different books on Reginald Merkerson from the Seattle public library.”</p><p>“That’s a goddamned lie!” Quinn lunged to his feet, knocking over his chair and putting Jared on alert for his partner’s safety. Quinn’s eyes were wild and hot, his face pale. “I’ve never been to the Seattle library in my life.”</p><p>She pulled a copy of the library check-out list from the folder in her hand and set it on the table. “This says different.”</p><p>“I’m being set up!”</p><p>“Tell it to your lawyer.” She reached for the doorknob.</p><p>“Why the fuck would I drive to Seattle for books on Merkerson when Jim Ralston has copies of the actual case files in his office?”</p><p>“Check the dates on the paper there, Mitch. Those books were checked out before the fires started. Months before. Plenty of time to figure out how to make nasty little toys like Merkerson was known for.”</p><p>His jaw tightened. “Someone’s setting me up.”</p><p>“Who would do that to a nice guy like you?”</p><p>“I don’t know. What I do know is that I didn’t start those fires. A dedicated, meticulous, organized guy like me wouldn’t leave such an obvious trail.”</p><p>“Ever date Dr. Danielle Michaels?”</p><p>Mitch was clearly knocked back by the unexpected change in topic. “We hooked up a time or two. Why?”</p><p>“You wanna talk?”</p><p>He sat back down and crossed his arms. “I want a lawyer.”</p><p>Chapter fourteen</p><p>“Hey, boy.” Darcy dropped to her haunches and wrapped Columbo in a big hug. “You’re looking handsome. Miss me?”</p><p>The energetic German shepherd greeted her with a bark and a tongue swipe across her cheek. She rubbed him down with both hands.</p><p>Jim set his notepad down on the dining table and pulled the leash off the rack by the door. “He does, of course. I told him after things settle down around here, he’ll see you more often.”</p><p>She stood. “I need to talk to you about the settling down part.”</p><p>“Oh?” He hooked the leash onto Columbo’s collar. “Shoot.”</p><p>“I know I’m pretty superfluous around the station...”</p><p>He arched a chastising brow at her. “That’s not true.”</p><p>“Okay, I’m copping out,” she admitted, shoving her hands in her pockets and rocking back on her heels. “It wouldn’t matter if I was indispensible. The thing is, if you really need someone to do what I’ve been doing, you should start putting out feelers.”</p><p>“Why?”</p><p>“Because.” She took a deep breath. “It’s time for me to pick up the life I left behind.”</p><p>Holding the leash loosely in one hand, he leaned casually into the wall and crossed his legs at the ankles. “Is this because of Deputy Cameron?”</p><p>“He was the spark, maybe, but the fire is my own.” She pulled out one of the dining table chairs and sank into it. “Time has been flying by and I didn’t realize it. I’ve been in a daze, I think, since Dani’s death.”</p><p>“And a couple nights of hot sex snapped you out of it?”</p><p>She shrugged, then smiled sheepishly. “It is really hot, but I’ve had great sex before. There’s something there, you know? Something more.”</p><p>“Yes, I know.” He pulled the chair out beside her. “So what are you thinking? You’re just going to drop everything and run off with a guy you’ve known a few days?”</p><p>“I dropped everything to come back here. Getting on with my life eventually had always been my plan, although I lost track of that for a while—”</p><p>“I think you’re losing track of what you’ve got here.”</p><p>“I’ve never been really happy here in Lion’s Bay, Jim,” she reminded softly. “It’s why I left in the first place.”</p><p>“And Deputy Cameron doesn’t have anything to do with your decision?”</p><p>“I already answered that question.”</p><p>He rubbed the back of Columbo’s ears. “When are you going to grow up, stop being flighty, and commit to something?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Excuse me?”</p><p>“One guy to the next, one town to the next. Without any concern for the people who care about you and went out of their way for you?”</p><p>“You sound like Chris.” Darcy slid her chair back and pushed to her feet, unnerved by his unexpected and provoking remarks. “We’ll talk later, once we’re both thinking straight.”</p> <p>“Sit down.”</p><p>“I don’t think so.”</p><p>“Sit the fuck down.”</p><p>She stared at him, finding the harshness of his words very much at odds with his calm voice and demeanor. A chill ran down her spine. “What the hell is the matter with you?”</p><p>“I’ve done a lot for you.” He gave her a mocking smile. “Don’t you think I have the right to get pissed when you throw me over for a gung-ho deputy who’ll be in and out of your cunt as fast as he’s in and out of this town?”</p> <p>Darcy turned away, heading around the opposite side of the dining table to get to the front door.</p><p>Columbo started barking violently. She’d scarcely registered the addition of a third voice in the conversation when the leash whipped around her neck and yanked her back.</p><p>Her head slammed into the edge of the table and her vision blackened...</p><p>JARED WAS SEALING up the contents of Mitch Quinn’s locker at the fire station when the hairs on his nape prickled with warning. He paused, knowing he was wasting time closing off an avenue that was a dead end to begin with. In the meantime, something was wrong. It hit him in the gut, and he knew better than to ignore it.</p><p>He pulled out his phone and called Darcy. When he reached her voice mail twice in a row, he went to the contact list hung on the station’s wall and called Ralston. When he got no answer there, either, he returned to the sheriff’s department and entered the interview room to confront Quinn.</p><p>Setting his palms on the table, he asked, “Why did you run?”</p> <p>“I didn’t run, I—”</p><p>“Listen, I don’t give a shit, Quinn. The recorder isn’t on. It’s just you and me.”</p><p>Mitch shot him a look. “Do I look like a moron?”</p><p>“You look like a guy who’s being set up. You have no one to corroborate your alibis for the nights of the fires, you have electrical wiring in your locker similar to the type Merkerson was known to use...With everything else we’ve got, it’s not looking good.” Jared saw cold defiance shift across Quinn’s face and changed tactics. “You consider Darcy Michaels a friend, don’t you? I know she’s real hopeful that you’ll be promoted to full-time soon. I bet she puts in a good word for you every chance she gets. Does that mean anything to you? Or do you just care about yourself?”</p><p>Jaw ticcing, Mitch said, “I like Darcy.”</p><p>“I think it’s possible the person responsible for the fires is responsible for Dr. Danielle Michaels’s death, too. I think it’s possible they’re going to go after Darcy Michaels at some point. And I think it’s really fucking unlikely that you had anything to do with any of it, but someone wants to deflect attention from himself by drawing it to you. Someone who knows something about you that would make you antsy, make you run, make you lawyer up right off the bat so you look guilty and waste my time. Who would know you’re into something shady, Mitch? Who would know your schedule? Gimme a name. Help Darcy after all she’s done to help you.”</p><p>Mitch scrubbed a hand over his face. “I don’t trust you.”</p><p>“You don’t have to.” He bent closer and lowered his voice. “Miller? Ralston?”</p> <p>“No way. Both of them are gonzo over her.” He gripped his head in his hands. “The chief makes the schedule. He knows my hours and days.”</p><p>Jared straightened, remembering his brief introduction to the Lion’s Bay fire chief. “Chief Sendak?”</p><p>“He’s gay, dude. He wouldn’t have been messing around with Dr. Michaels.”</p><p>“But he has access to your locker, your schedule, and the mailing room?”</p><p>“Listen.” Mitch leaned closer and lowered his voice. “Occasionally—rarely—some of the guys have things shipped to them at the station that they don’t want their wives finding out about. You know? Aside from that, there’s nothing hinky going on. The guys are all straight up.”</p><p>“Fuck.” Leaving the room, Jared pulled out his phone and called Darcy again. As it rang, he went by Miller’s office and found it empty, then crossed through the bull pen to the desk and the blond deputy who manned it. He hung up when he got Darcy’s voice mail.</p><p>“Hi, Deputy,” the blonde greeted him.</p><p>He managed a brief, distracted smile. “Where’s Miller?”</p><p>“He left while you were at the fire station.”</p><p>“Where did he go?”</p><p>She shrugged and smiled prettily. “I don’t know. He took personal time.”</p><p>“Get him on the radio. Please.” He watched her make the attempt a few times with no answer before he turned around and looked for Trish. She was pouring a cup of coffee but sensed his gaze. She looked at him with a frown, then set the carafe down. She was walking toward him before he gestured to her.</p><p>“What’s wrong?” she asked.</p><p>“I don’t know. Something’s bugging me. I need to find Darcy.”</p><p>“I’m coming with you.”</p><p>He didn’t question her assertion, knowing her instincts were as keen as his own. He looked at the deputy at the desk. “I need Chief Inspector Ralston’s home address. And Sheriff Miller’s, too.”</p><p>TRISH DROVE WHILE Jared continued to try to reach Darcy. When his other line beeped, he looked at the screen and saw Kelley’s name.</p><p>“Cameron,” he answered.</p><p>“Cameron, it’s Kelley. I got your e-mail about Sheriff Miller. Thanks for keeping me in the loop.”</p><p>“It’s your case, Kelley. I hope you can close it.”</p><p>“I’m on my way to the airport now. I’ll be back there to talk with Miller myself tonight, but in the meantime, in the spirit of sharing, I thought you’d be interested to know that I poked around his background a little this morning and discovered his second cousin was aide to the lead detective on the Prophet case in Memphis.”</p><p>“Well, shit.” He glanced at Trish and mouthed, “Miller.”</p><p>Trish adjusted the GPS and changed direction.</p><p>“Thank you,” he said to Kelley. “Have a safe flight.”</p><p>“Try not to get blown up before I get there. It’d be nice to meet you in one piece.”</p><p>DARCY WOKE WITH a groan, her head throbbing. Blinking, she tried to move and found her wrists bound. Awareness shot through her like a bullet, setting her heart racing. Her jaw ached from the ball gag that stuffed her mouth. She turned her head from side to side, trying to figure out where she was. Something wet touched her cheek, followed by the soft stroke of a tongue.</p><p>Columbo. The German shepherd lay beside her on the floor in an unknown bedroom. The room was shrouded by drawn curtains and cloaked in eerie quiet.</p><p>She rolled to the side and managed to prop herself up with an elbow. The room spun and her stomach roiled. She fought off a wave of nausea, knowing she’d choke with the gag in her mouth. Leaning against the side of the bed, she sucked in air through her nose like a swimmer too long underwater. Her gaze fell on a badge lying on the floor near an antique dresser.</p><p>Chris’s sheriff badge.</p><p>A chill moved through her as she remembered his angry voice intruding on her conversation with Jim just before she’d lost consciousness.</p><p>Darcy managed to sit up, her gaze falling to the standard-issue handcuffs on her wrists. Chris’s cuffs. Fear settled like a rock in her gut.</p><p>She jerked as she heard a door open somewhere in the house, then close, followed by heavy boot steps crossing hardwood floors, increasing in volume as they drew closer. The doorbell rang and they paused.</p><p>Struggling to her knees and then her feet, she was frantic to get to the door and get help.</p><p>The bell rang again and the screen door creaked open. Knocking ensued.</p><p>“Miller? It’s Deputy Cameron.”</p><p>The sound of Jared’s voice brought tears to her eyes. She was fumbling with the knob to the door when it opened. Stumbling backward, she fell onto the bed. Relief poured through her when Jim stepped into the room.</p><p>Then she saw the gun in his hand.</p><p>“Make a sound,” he said softly, “and I’ll shoot Cameron as he comes in. Understand?”</p><p>Outside, Jared knocked and called out again. Tears coursed down her face, her brain trying to process the feverish brightness of Jim’s eyes. She’d never seen him look that way, never had him eye her coldly as he was doing now...</p><p>“He can’t come in here without a warrant,” Jim said calmly, as if he weren’t brandishing a deadly weapon. “If you’re quiet, he’ll leave and live another day.”</p><p>It seemed like an eternity before Jared gave up.</p><p>Darcy’s lungs heaved for breath, spots swimming before her eyes.</p><p>Jim raised the gun to point at her chest. “After everything I’ve done for you...Damn it. It breaks my heart to have to kill you again.”</p><p>JARED STARED AT the police cruiser parked at the curb in front of Miller’s house and shoved a hand through his hair. He called the station and asked what kind of personal vehicle the sheriff drove.</p><p>Trish stood on the sidewalk with her hands on her hips. “Miller is hugely territorial, but we get a suspect in custody and he bails?”</p><p>“He knows something we don’t.”</p><p>“You like him for this? The fires or the vet? Or both?”</p><p>He went to the cruiser and set his hand on the hood, feeling the heat that told him the car had very recently been driven. “Do you?”</p><p>“No.” She looked at the house. “I’m not keen on Quinn, either.”</p><p>“Let’s run by Ralston’s.”</p><p>As they pulled away from the curb, the unsettled feeling in his gut grew. He dialed Darcy’s phone again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>DARCY LIFTED HER gaze from the barrel of the gun and looked into Jim’s eyes. Fear slithered through her veins like ice water, chilling her to the bone. She flinched when he stepped closer.</p><p>“Scream and I’ll shoot you.” He released the ball gag with one hand.</p><p>Flexing her aching jaw, she asked, “What are you doing, Jim? Where’s Chris?”</p> <p>“Thinking about taking up with him again? After he blew you off like a whore?”</p><p>She frowned. Chris hadn’t broken it off with her; she’d ended their relationship, as gently as possible. That was common knowledge. “We’re in his house, right? I figured he’d be around.”</p><p>“He’s around.”</p><p>Her chest expanded on a sharp inhalation. “Can you take the handcuffs off, too? Please.”</p><p>“Don’t be sweet now. You fucked everything up by sending for the Marshals Service. If you’d left things alone, none of this would have happened.”</p> <p>“None of what? The fires?” Her lower lip quivered violently. “Dani?”</p><p>“The fires were bringing us closer together again. You were staying the night at my place...We were working the case during the day...”</p><p>A choked noise escaped her as her chest tightened painfully. “You targeted places that meant something to me. You wanted me vulnerable, so I’d turn to you.”</p><p>“Cameron had no right to come in and push me out of the picture.” Jim leaned into the dresser, looking totally relaxed. His easy demeanor was scarier than if he’d been a raving lunatic.</p><p>“The people who owned those businesses you torched are our friends. They trusted you to keep them safe. You’ve ruined their lives, stolen their livelihoods—”</p><p>“No, I didn’t. I know exactly what kind of hazard insurance covered each of those properties. They can rebuild better than before.”</p> <p>She gaped at the man with whom she’d shared her body but didn’t know at all. “You’re insane.”</p><p>His jaw hardened. “If I am, you’ve made me that way. I gave you everything, I was committed to you, and you got pregnant with someone else’s baby. Who the fuck do you think you are, playing with people like that? After the way Miller treated you, you of all people should know how it feels.”</p><p>“I’ve never been pregnant in my life,” she shot back, anger slowly chasing away the terror. “I’m not Danielle. Did you kill my sister, Jim? Did you cut her up and do those horrible things to her?”</p><p>“I know who you are,” he snapped, his free hand waving with agitation. “And Dani killed herself. She was screwing everyone, most especially anyone who had a tie of some kind to you. When I found out she was banging Mitch, I confronted her. We had a relationship. I expected you to be faithful, damn you. I was.”</p><p>Darcy pushed slowly to her feet, alarmed by his shifting perceptions of who she was.</p><p>He straightened, tension stiffening his frame. “If you hadn’t tried to leave, I wouldn’t have reached for you. You shouldn’t have pulled away. If you’d stayed where you were, you’d never have fallen. You’d never have hit your head.”</p><p>Unsure of what to do, whether it would be wiser to play into his delusions or keep reminding him of reality, she asked, “So what now?”</p><p>He exhaled harshly. “I hate that you’re making me do this. We were happy together. I don’t understand why that couldn’t be enough for you.”</p> <p>“It’s this place.” She tried to swallow, but her mouth was too dry. “It’s Lion’s Bay. I can’t take it here, Jim. That’s the reason I spent time with Deputy Cameron—he’s going to leave and take me with him. But maybe you’d take me instead? We can be happy anywhere, and with the fires...it’s better if we leave.”</p><p>“I’m not stupid. Don’t try to play me.”</p><p>“I’m being practical, for once. I know you can make me happy. I don’t know Cameron at all.”</p><p>Jim’s mouth thinned grimly. “It’s too late for that. I don’t trust you anymore. You’ve whored around one too many times.”</p><p>“You’re digging yourself a hole you won’t be able to crawl out of,” she warned, hoping he had some sense of self-preservation left.</p><p>“No one’s looking at me, Dani.” His finger twitched on the trigger. “And when they find your body with Miller’s and pin the fires on Quinn, this will all go away and I can get on with my life.”</p><p>Thinking her time was just about up, Darcy took a risk and launched herself into him.</p><p>“STOP THE CAR,” Jared said.</p><p>Trish braked to a halt. “What?”</p><p>He hopped out. “We don’t both need to check out Ralston’s. I’m heading back to Miller’s. If you catch Darcy, tell her to fucking call me. Now.”</p><p>“Be careful,” she called out, then she drove off.</p><p>Jared headed the two miles back at a brisk pace, spurred by a sense of urgency he couldn’t qualify. He was still two blocks away when he heard a gunshot. He broke into a run. The house came into sight and he drew his weapon, racing past curious neighbors who straggled onto the sidewalk.</p><p>“Get back in your homes,” he shouted. “Call nine-one-one.”</p><p>He’d just reached the lawn when the door to Miller’s house burst open and Darcy stumbled out, her wrists handcuffed in front of her. Relief burst through him, followed immediately by blood-chilling fear.</p><p>He darted forward, catching her and pulling her to the side of the house, out of the line of fire. “Are you hurt?”</p><p>“N-No...no, I’m okay.”</p><p>“Where’s Miller?”</p><p>“I don’t know.” Her lower lip quivered. “It’s Jim. He did it all. Everything.”</p><p>Peering around the corner, he eyed the porch. “Where is he?”</p><p>“I tackled him into the closet in a bedroom on the right side of the hallway.”</p><p>He glanced at her, his heart finally slowing from its frantic pounding. “A fucking crazy thing to do.”</p><p>She sucked in a rasping, shaky breath. “God, I’m glad to see you.”</p><p>Another shot rent the quiet.</p><p>“Oh, no...” she breathed. “Columbo.”</p><p>He stood in a rush. “Someone else is in there?”</p><p>“Yes. No. It’s Jim’s dog. I tripped on a runner in the hall and Jim was behind me with the gun...Columbo took him down. The gun went off and shot into the wall, but Columbo had his arm and he was snarling—”</p><p>Cupping her nape, he gave her a quick hard kiss. “Stay down.”</p><p>Jared moved quickly and silently down the side of the house, looking in each window. The silence was brutal. When he saw blood and gray matter spattered on a paned window, he knew what the crime scene unit would find inside.</p><p>The dog was fine. It was his owner they’d have to scrape off the walls.</p><p>DARCY WATCHED THE frenzy in the police station with an odd detachment. Jared was bent over a desk, talking with the federal agents who’d arrived just a few minutes before. Outside, night had fallen and she was cold, but she suspected that came more from the inside than out.</p><p>“Coffee?” Deputy Morales sank into the seat beside her and held out a paper cup filled halfway with steaming java.</p><p>“Thank you.”</p><p>“I checked with the hospital. Sheriff Miller’s fine. He has a nasty concussion, so they’re going to keep him overnight, but he’ll be good as new after a little time off.”</p><p>Exhaling in a rush, Darcy’s eyes stung with grateful tears. “I’m glad.”</p><p>“Cameron’s going to drive you home in a bit.” Morales studied her. “Are you all right? I mean, as much as you can be under the circumstances?”</p><p>It took Darcy a moment to gather her thoughts into something coherent. “I don’t know how I feel about what Jim did...today.”</p><p>“It was pretty much inevitable that he’d self-destruct. I don’t know if that’s any comfort or not. There’s nothing you could have done differently. You’re alive, that’s what matters.”</p><p>Darcy rolled the warm cup between her bloodless hands. “I expected to feel a sense of justice when I found Dani’s killer. Instead I still can’t believe it was Jim. I don’t know if I’ll ever understand it. And Columbo...That dog loved Jim, but he turned on him like he was a stranger.”</p><p>“Dogs are smarter than we are. They sense things we can’t.”</p><p>“Dani used to say that she couldn’t trust people who didn’t like animals, but more than that, she couldn’t trust people that animals didn’t like.”</p><p>Morales patted her knee, then excused herself, getting back to work.</p><p>A few minutes later, Jared walked over. He crouched beside her chair and caught her free hand, his thumb stroking over the minor cuts and bruising left by Chris’s handcuffs. “Let me take you home.”</p><p>Her gaze met his and her heart warmed. “Are you done?”</p><p>“I’ll have to come back, but you need a hot bath and your bed. I’ll hurry and get back to you as quick as I can.”</p><p>Her mouth curved. “Don’t rush for me. I understand the job.”</p><p>“I know you do, just like I’ll understand yours when it takes you away from me. It’s one of the reasons why we fit so well.”</p><p>“Is that what it is?” Her widening smile betrayed the sexual undercurrent of her thoughts.</p><p>He blew out his breath, looking relieved. “You’re going to be all right.”</p><p>She realized then how worried he’d been that she wouldn’t be. “Yes. I’ll be fine.” Standing, she said, “Take me home so I can get out of your hair.”</p><p>Jared linked his fingers with hers and started toward the door. “Won’t matter. You’ll still be under my skin.”</p><p>“Good. That’s right where I want to be.”</p><p>Epilogue</p><p>The closing of the rolling metal door on the back of the moving truck was loud in the otherwise quiet afternoon. Darcy leaned into Jared as he draped his arm around her shoulders and they watched the truck drive away. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>He nuzzled his lips against her temple. “Anything left inside?”</p><p>“A couple boxes.” She glanced at her childhood home, now sporting a Realtor’s sign in the lawn. “I’m glad to be going, but I have fond memories of this house.”</p><p>“So do I,” he murmured, his mouth curving against her cheek.</p> <p>She laughed softly, then jumped a little when he gathered her close and squeezed her tight.</p><p>“It’s good to hear you laugh, sweetheart.”</p><p>“I’m getting there.”</p><p>“We’re getting there.” He pushed his fingers into her hair and cupped her scalp. His blue eyes were clear and warm, filled with a tender heat that never failed to touch her deeply. “And we better get moving. We’re supposed to be at your parents’ house in a few hours.”</p><p>Placing her hand in his, Darcy whistled for Columbo. Together, they went into the house to gather the last of her things.</p>   </body></html>"]