["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>His shoulders back and his head held high, Rory stood before Marco, Alpha of the Dark Hollow Wolf Pack, and tried his best to ignore Marco’s mate, Nicky. Lounging on a sofa behind the alpha, Nicky looked gorgeous as usual in the morning sunlight streaming in the windows. His golden hair, streaked with silver highlights, was tousled and messy, probably from a recent romp in bed with Marco, his blood mate. Nicky was lying on his back, wearing only a tight pair of leather pants, with his bare feet up on the back of the sofa, pretending to read a magazine, but shamelessly eavesdropping on their conversation.</p><p>“So you think you can handle this, Rory? You’re still pretty young. Training these rogue wolves to help them assimilate into our pack is a big job, not to mention getting them ready for possible battle. The Hunters are on the move again. They’ve been seen within a hundred miles of us, probably heading right for us. I’m assigning Ian to start training the wolves and I’m laying in a supply of weapons and ammunition. You’ll help to make sure everything runs smoothly.”</p><p>“I know I can do it, Marco. Give me a chance and you won’t be sorry.”</p> <p>Nicky made a scoffing noise behind his magazine, and Rory clenched his fists. “You got something to say, Nicky, just come out and say it.” Nicky lowered the magazine, and his beautiful blue gaze raked Rory up and down. “I never said a word.”</p><p>“No, but you made a noise, and I can see the doubt written all over that smart-aleck face of yours.”</p><p>“Rory,” the alpha said quietly. “Don’t insult my pet, and Nicky, stop baiting him.”</p><p>Nicky and Rory glared at each other. Nicky made another little sound and raised the magazine back in front of his face. The two had a long-standing love/hate relationship. Rory had changed Nicky to werekin to save his life after muggers had slit his throat. He’d been careful, though, not to give him a mating bite, knowing he was Marco’s designated bloodmate. Rory had also fed Nicky his wolf blood after Nicky turned into a feral, monstrous werewolf and Marco had given Nicky all he could without endangering his own life. Both events had formed a bond between them. They were close like brothers, but, like a slightly older brother, Nicky loved to tease and bait Rory whenever he got the chance.</p><p>Marco smiled indulgently at his mate. Everyone knew he spoiled Nicky shamefully. It was even rumored Nicky had only received one or two spankings the whole time he’d been Marco’s pet, and afterward Marco had taken him to bed and made love to him for hours. If Nicky had been Rory’s pet, he’d have spanked him daily, whether he needed it or not.</p> <p>“I think you’ll do a great job with the rogues, Rory. Only a few of them are older than you, and I’ve only noticed one or two who seem a bit dominant. You’ll have to show them who’s boss right away and not let up on them.”</p><p>“That should be easy enough for you, Rory,” Nicky said sarcastically from behind his magazine. “The only problem you might have is if they try to outwit you, unarmed as you are.”</p><p>“Just let me swat his backside one time, Marco, please,” Rory said, shooting Nicky a menacing look.</p><p>Nicky jumped to his feet and threw down the magazine, striking a fighting pose. “Bring it on, Rory, if you think you can do it!”</p><p>Marco intervened. “That backside is my property, and I’ll give it a smack myself if I hear one more word.”</p><p>Marco hooked an arm around Nicky’s waist and pulled him down in his lap, wrapped both arms around him and gave him a little shake. Rory suspected his threat was an idle one.</p> <p>“Settle down, baby,” he purred, and Nicky laid his head on Marco’s shoulder, giving Rory a self-satisfied little smirk, making Rory’s hands itch to spank his butt.</p><p>“You can meet with them in the morning then, Rory, and get them started first by helping with building. With the rogue pack joining us, we need more room. We need the addition finished asap, so we can concentrate on training with weapons. Ian will be there to supervise the actual construction, so all your new gammas have to do is general clean-up of the site, carrying wood, or roofing, that kind of thing. Helping out, basically. Just a few days and then they can go out to train in the field.”</p><p>“No problem. Thanks again, Marco, for the assignment. I’ll let you know how things go tomorrow.”</p><p>Rory turned and walked to the door, letting himself out quietly. Marco already had Nicky laid back across his arm, kissing his lips, his hands busy roaming all over him. They’d be making love again in a minute, and that was one image he didn’t need seared in his brain.</p><p>Nicky was beautiful, probably the most beautiful young man he’d ever seen, but Rory liked girls. A petite but curvy brunette, with dark eyes would be his ideal woman. Someone like the girl who worked in the beauty shop, Tara, who was Cody’s mate. She was a pretty, sweet little thing, very quiet and ladylike. Not a mean brat, like Nicky. It wasn’t that Nicky was male. A magical, supernatural element in their blood picked their mates, and a wolf knew them immediately when he met them whether they were the same sex or not. Once recognition happened, there was no use in fighting it. Attempting to avoid the inevitable with denial made everyone miserable. The magic was strong. A wolf’s blood sang for only one mate, and that person was his mate for life.</p><p>No, Rory just liked the way girls looked, smelled, and felt. They were all so smooth and smelled so good. He just knew in his heart his blood mate would be a cute girl, and he couldn’t wait to meet her. Like Nicky and Tara, she’d probably have to be an adopted human. He knew all the pet girls of the pack, and none of them were his blood mate. Wolves only mated with pets, either werekin who didn’t inherit the wolf gene from their wolf parent or a bloodmate human turned werekin. Soon he’d have to take a trip to some of the local towns in the valley and see if he could find her. Still pretty young, with his whole life ahead of him, he was in no real hurry.</p><p>This was an important job Marco had given him, and he took it seriously. The Hunters were an ancient group, well over a hundred years old, dating from the early nineteen hundreds. Their founder was a self-styled monster hunter named Abraham Van Helsing. Even after Van Helsing’s death, the group of hunters he’d established continued his mission, coming to be known simply as the Hunters. They’d been waging a war against the werekin ever since. They’d been quiet for over two years, but intelligence reports from various wolf clans around the country had them preparing themselves for more fighting. The Dark Hollow Pack had to be ready to defend itself.</p><p>Rory had called a meeting of his new crew in the main hall. He walked toward it, anxiety fluttering in his belly. He was always a little nervous when he met new wolves. Small for his age, he’d pretty much stopped growing and filling out when he was about fifteen. Marco assured him he’d hit another growth spurt, but so far it hadn’t happened. Most wolves his age were already quite large, well over six feet and muscular, while Rory was leaner and not nearly as tall. The ten new gammas all came from the rogues who had just rejoined the family. For Marco to pick Rory to train them in pack discipline was quite an honor and meant Rory was moving up in pack hierarchy. To be the lead gamma had been his goal for as long as he could remember. Or rather, it had been Marco’s goal for him, and he hated to let him down.</p> <p>He’d walked no more than two feet into the main hall when he was assailed by a mouthwatering scent, delicious, and like nothing he’d ever smelled before. A little like cotton candy, the scent drew him in like a beacon, and he tried to figure out where it was coming from. He quickly scanned the room, but only gammas stood gathered around the fireplace.</p><p>Rory shook his head, trying to clear it. His mind screamed, “Mate,” and his cock stood up, paying close attention. Exciting and puzzling at the same time, he couldn’t see anyone in the room as a potential mate. Yet the smell was almost overpowering. Rory crossed over to the gammas and stood in front of them, trying to keep his mind focused on the task ahead. He wanted to make a good first impression on these former rogue wolves, but the closer he got to them, the stronger the smell became.</p><p>“Hi, it’s good to see all of you here,” he announced to the assembled group. “I’ve been assigned by the alpha to be your leader on this part of the project. I expect you all to work very hard on this temporary job. You can be assigned a permanent job after training. There have been some alarming reports about the Hunters, as you know, and we have to prepare for them. You’ll all have a vital role in our preparations.”</p><p>Rory paused and looked around the group to check their reactions. Most were listening politely, but one big wolf over by the side of the fireplace glared at him. Rory didn’t know the guy and had done nothing to warrant such a challenging look. He glanced nervously away and tried to concentrate on getting through his speech before the scent of his mate completely overcame him.</p><p>“Be back here in the morning at seven o’clock sharp, ready to work. Any questions?” The big guy spoke up. “Yeah, I have a question. How old are you? You look like you’re about fifteen. Are we really expected to take orders from a fifteen-year-old?”</p><p>Rory was so surprised by the remark and the attitude he was speechless for a moment. The guy wasn’t all that much older than Rory. Admittedly, Rory looked a little younger than nineteen, but not that much.</p><p>Surveying the man up and down, he asked, “What’s your name?” He kept his voice low and calm, imitating the way he’d heard Marco speak many times when he was really pissed off.</p><p>“Casey. And why are you avoiding the question? How old are you?” The guy straightened up from the wall where he leaned. He was even bigger than Rory first thought. At least six foot two, he was extremely muscular, even for wolves well known for their well-toned bodies. His hair was brown and spiky, and his eyes were a startling cat’s eyes shade of green. His face was handsome, despite the scowl and the sneer turning his lips down. As a matter of fact, those lips were full and surprisingly luscious. Rory couldn’t seem to take his eyes off them.</p><p>Casey advanced on Rory in a cocky, self-assured manner, despite the efforts of a few of his friends to catch his arm and pull him back. He shrugged them off and came to stand right in front of Rory. He was most definitely where the scent came from. Up so close, like a cloud drifting off him, the smell hit Rory full force, causing him to take an involuntary step backward. Rory couldn’t understand why everyone around him wasn’t commenting on it, it smelled so delicious. Shocked, Rory looked up into those cat eyes, and his brain screamed at him. Mate! His dick hardened until Rory was afraid everyone would notice the bulge in his pants. Right on the heels of that thought was another one. His mate was a male wolf? No fucking way! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They gazes locked, and Casey must have felt it too. He stared down into Rory’s face, and some strong emotion showed behind those incredible eyes. They stood locked in the moment and might have stood that way forever if a strong voice hadn’t called out behind them.</p><p>“Hey! What are you two doing? Break it up immediately!” Marco stood in the doorway, with Nicky just behind him. Nicky had a curious look on his pretty face, though Marco just looked angry. Marco came over to stand between them and put a hand on each man’s chest. “Were you two about to fight? We’ll have none of that in here. Is that understood?”</p><p>He nodded to the other uneasy wolves standing around. “Go on and be back here tomorrow at seven.” Marco turned his head toward Casey, indicating a chair by the fireplace. “Sit over there and don’t move till I come back. Nicky, stay with him.” He took Rory by the arm and pulled him, stunned and unresisting, into the kitchen. “You come with me.”</p> <p>Rory’s brain whirled. How could that big wolf be his mate? The smell was unmistakable and so was the message his brain still screamed at him. He actually felt physical pain being pulled away from him. Rory had no idea who he was or how in the hell his screwed-up supernatural blood could have picked another wolf to be his blood match. It didn’t make sense. Wolves didn’t mate wolves.</p><p>Marco shoved Rory down into a chair by the big, wooden kitchen table and stood looking down at him. “Care to tell me what that was all about?”</p><p>Rory put a shaky hand to his face. “I don’t know, Marco. I don’t understand.”</p><p>Marco sat down across from him. Marco, in addition to being the alpha of the pack was also his uncle. More than that, since Rory’s dad had died in a logging accident some ten years before, Marco had been the nearest thing to a father figure he had.</p><p>Marco looked at him with concern. “What’s going on, Rory? Tell me.”</p> <p>Rory grabbed Marco’s hand, a move so unusual for him Marco raised his eyebrows in concern. “Marco, I-I think that man is my bloodmate. But how? How can that be? He’s a wolf!”</p><p>Marco narrowed his gaze. “What are you talking about? Your bloodmate? What are you feeling?”</p><p>“When I first walked in, I could smell him, all the way across the room over the smell of the fire. A cotton candy smell, strong and overpowering, but I couldn’t figure out where it was coming from, you know? I looked all over and just saw the gammas by the fire. He challenged my authority right away, asking how old I was, and then he walked over to me, and, oh my God, the smell almost knocked me down. And his eyes! I couldn’t look away from them, and I think he felt it too. We both just stood there like in shock. That’s what you saw when you walked in. We weren’t about to fight at all. I think...I think he was about to kiss me! What am I going to do, Marco? I can’t be in love with another wolf!”</p><p>Before Marco could answer, Nicky spoke up from the doorway. “Well, you’d better figure something out quick, because Casey says he’s coming in there.”</p><p>“Coming in here? No!” Rory jumped to his feet and took a few steps backward. The idea of his bloodmate standing in front of him again made Rory’s heart pound, and he had trouble catching his breath.</p><p>“Calm down, I stopped him. He’s freaking out in there too, and yes, he felt the same thing you did. He wants to see you. Marco, I think you’d better talk to him. I can’t make him stay out there much longer.”</p> <p>Marco got up immediately and walked toward the common room. Nicky took his place, taking Rory’s hand in his. “You okay, kid? You look like you’re about to pass out.”</p><p>“It’s not supposed to be this way, Nicky. Two wolves can’t be mates. They’d wind up killing each other. One mate is always the dominant partner, and the other is the submissive. One has to be a pet. That’s the only way this works. Even if two wolves could mate, you can tell which role he’d play. Toppy bastard! I’m not a pet. I’m a wolf.”</p><p>Nicky patted his hand and kept quiet, but Rory shot him a furious look. “I guess you think this is funny, huh?”</p><p>“No, Rory, after all the problems Marco and I had, I don’t think there’s anything funny at all about this blood match thing. Are you sure he’s the one?”</p><p>“I think so. Hell, I don’t know. How does it feel, Nicky? You and Marco have the most intense blood match I’ve ever seen.”</p><p>“For me it was different, because when I first saw Marco, I was already in heat from your bite and just changed to werekin. It was pretty crazy all the way around even before Marco got there. I do remember the instant he walked in, I couldn’t get close enough. I loved him right away, and I don’t think it was just the magic. I think I would have loved him at first sight no matter what. And the scent of him! It drove me crazy.”</p><p>“That’s the way it is for me. What am I going to do, Nicky?”</p><p>Before Nicky could answer, Marco appeared in the doorway. “Rory, I’m going to bring him in. You two need to talk.”</p> <p>“No!” Rory jumped to his feet. “I don’t want to see him!”</p><p>Casey’s deep voice came from behind Marco. “Yes, you do, and the alpha says we need to talk too. So let’s talk.” He stepped into the kitchen, and right away Rory’s heart beat kicked up. He was so handsome. How had he not noticed that sooner? The smell was strong, wafting around him, and Rory really wanted to pull him close and put his nose up into his throat. What was wrong with him?</p><p>Marco held out a hand to Nicky and the two of them left the kitchen, Nicky casting a sympathetic glance over at Rory as he left. Casey walked slowly up to Rory and took a deep breath. “Damn, you smell good. What is that anyway? Smells a little like...” He took another suspicious sniff. “Chocolate chip cookies fresh out of the oven. Do I smell like that to you?”</p><p>“No,” Rory shook his head firmly.</p><p>Casey looked a little taken aback. “Oh, well, okay.”</p><p>“No.” Rory sighed in defeat. “You smell like cotton candy.”</p><p>Casey smiled, showing beautiful strong white teeth. “Really? And that’s a good thing, right?”</p><p>“Yeah, very good.” Rory could feel his face turning redder by the minute.</p><p>“I guess we should sit down.”</p><p>Rory nodded nervously and sank to a chair. He shifted nervously while Casey simply sat and gazed at him. He was so aware of the man his body temperature had gone up a few degrees since Casey walked into the room. Casey didn’t color in embarrassment, like Rory, or act nervous in any way. Rory sensed it in him—the ability to be a leader, maybe even more so than Rory.</p><p>“Settle down, honey, I’m not going to bite you.”</p><p>“Don’t call me that—I’m not your honey. Wolves don’t mate with wolves and you’re sure as hell not going to make me a sub here. I’m a wolf, just like you are.”</p><p>“Wolves mate whoever the blood tells them to mate, darlin’. Don’t get yourself all upset.”</p><p>“Don’t do that! I’m not your darlin’ either!” Rory jumped back to his feet and stood with clenched fists. “This is all some kind of crazy mix-up. I’m not even all that attracted to you!”</p><p>Casey smiled and looked pointedly down at a huge bulge in the crotch of Rory’s jeans. “Your hard cock tells me otherwise, darlin’.” He got up and walked around the table toward him. Rory found his feet backing up, almost before he knew it was happening. To stand his ground, to show Casey he was just as dominant was his intention, but as the big wolf stalked toward him, he couldn’t stand still. He backed up until he came up against the kitchen counter and could go no farther. Casey didn’t stop until his cock rubbed Rory’s. The sensation made Rory catch his breath.</p><p>“Get away from me, before I knock you down,” Rory said through gritted teeth.</p><p>Casey smiled and pushed even closer. “Now darlin’, you know you don’t want to do that.”</p><p>Rory shoved him as hard as he could, barely moving the larger man. Hands on Casey’s chest, Rory pushed again. Casey knocked Rory’s arms away and wrapped both arms around Rory, pinning his arms to his side. Rory struggled violently, but Casey clasped him in a bear hug, tighter and tighter until Rory’s knees began to buckle, and he couldn’t catch his breath. Only when he sagged did Casey relent, easing his grip, lowering his head to take Rory’s mouth with his own.</p><p>Casey kissed him, but the word kiss was too simple for what was happening to Rory. Casey shook him to his core and gave him feelings he’d never had before. He’d never really kissed too many girls. He’d never kissed a male at all, especially a man who seemed to know exactly how to kiss him to make him feel like he was spinning out of control. Already out of breath, Rory felt like he was drowning, but he didn’t care. He never wanted it to end. Casey did wild things with his tongue inside Rory’s mouth. Rory couldn’t get close enough to him, and he never wanted him to stop.</p><p>Casey lifted his head and gazed down at him. His voice was soft and sexy. “I’m sorry I asked you how old you were out there. When you walked in, I knew you were my mate right away, and when you didn’t acknowledge me or even glance my way, I didn’t like it much. I had to get you to notice me, darlin’. I didn’t mean to embarrass you, though, and I’m sorry if I did. But you’re wrong about not being my honey.” He kissed Rory softly. “And my darlin’.” He bent and kissed him again. “And my baby too.” He kissed him once again. “Cause you’re all those things, aren’t you?”</p><p>Rory still couldn’t catch his breath. He stared up at Casey like a rabbit charmed by a fox.</p><p>Casey gave him a little squeeze. “Aren’t you, baby? Just nod your head now.”</p><p>Rory flushed painfully but nodded his head. Casey smiled and brushed his lips over Rory’s one more time. “That’s right. I know you’re a wolf, and a very beautiful little wolf, I might add, but I am going to fuck you very soon, darlin’. I’m telling you, so you’ll have a chance to get used to the idea. I’m afraid there’s nothing you can do about it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Casey rubbed his huge cock against Rory’s again, causing him to gasp aloud. “When we tie up, when I put my knot deep inside you, I’ll make you scream my name so many times you’ll be hoarse the next day.”</p><p>The knot or bulbus glandis in canines was a large glandular ring of hard tissue around the base of the penis. During the mating, the gland swelled even larger, making it impossible to withdraw until the ritual was finished. A submerged gland secreted chemicals that caused multiple orgasms during the length of time the wolf remained tied with his mate, sometimes for hours. The extreme experience usually caused the chosen mate to pass out from the intensity, frequency, and extended duration of the orgasms. Some orgasms went on for over four minutes. During the first knot-induced climax, the wolf gave his partner the mating bite, sealing their union for life.</p><p>“Maybe those screams will be a little payback for not acknowledging me right away. You never get to ignore me, baby. Not ever again. I’ll show you no mercy when I get you in bed. No mercy at all, darlin’.”</p> <p>He bent and kissed Rory one more time, grinding his lips against Rory’s, sweeping his tongue over the inside of his mouth and nipping at his bottom lip. “I’ll see you in the morning. Seven sharp, I think you said? You’ll dream about me tonight, and I’ll dream of you too. Goodnight, my little wolf.”</p><p>Casey let him go, turned, and left the room quickly, leaving Rory trembling. At the door, Casey nearly ran into Nicky, followed more slowly by Marco. Nicky was back, Rory knew, because he was so damned nosy he couldn’t stay away.</p><p>“Whoa, Casey, slow down.” Nicky put his hands up to stop Casey, with an amused glance over at Rory. “Is everything okay with you guys?”</p><p>“Oh, everything’s just fine with me.” Casey smiled wolfishly, looking over his shoulder at Rory. “As for Ian, he’s getting there.”</p><p>“Ian?” Nicky said blankly. He looked from Casey to Rory and back again. “His name’s not Ian. This is Rory.”</p> <p>Casey’s head whipped around and a look of absolute shock came over his handsome features. “Rory?” he said, shaking his head back and forth slowly. “No, not Rory. He’s Ian.”</p><p>Nicky tilted his head, puzzled. “Casey, are you okay? Ian is our beta. This is Rory, our new lead gamma.” A little smile played around his pretty lips. “Don’t you even know your future mate’s name?”</p><p>Casey turned and, stumbling, practically ran from the hall, leaving Nicky looking after him in surprise, and Rory quaking as he stood against the counter staring at the empty doorway.</p><p>“What in the world was that about?” Nicky bounced over to him and arched a smile at Rory. “Well? What happened? Is he the one?”</p><p>Rory nodded. “I think so. Yes, I know he is.” He put his hands over his face and groaned.</p><p>Marco came over to stand beside him and put a hand on his shoulder. “Surely it’s not as bad as all that. Sit down for a minute. Let’s talk.”</p> <p>Talking was the last thing he wanted to do. He wasn’t sure exactly what he did want to do, except go running after a complete stranger and beg to stay with him. Unable to refuse an order from his alpha, he allowed Marco to draw him over to the table and sit him down.</p><p>“Now start from the beginning. Why are you so upset?” Marco’s tone was soothing, and Nicky put a companionable arm around him, even though Marco shot Nicky a jealous, disapproving glance. A wolf never touched a mated pet, unless they were family. Even with his nephew, Marco was possessive and jealous of sharing Nicky’s touch.</p><p>Rory took a deep breath. “He’s so...he’s such a...oh God, Marco. He said I’m his mate, and he knew it the minute I walked in. He called me his baby, and his darlin’.” Rory’s tone was bitter, yet a shiver of sexual pleasure ran through him at the words.</p><p>Nicky laughed out loud, and both men shot him a look of dismay. “I’m sorry,” Nicky said, wiping his eyes. “I don’t mean to laugh, but you said that like those were fighting words, or like it’s such a terrible thing to be someone’s darling. I think it’s wonderful! I’m Marco’s darling, aren’t I, sweetheart? And I love it!”</p><p>Marco shook his head, though he smiled at his mate. “Yes, you certainly are, baby, but that’s exactly what Rory means. Wolves are supposed to be the dominant partners. We call our mates those names, and we certainly mean them,” he hastened to say at Nicky’s sharp look. “But in this case, I think Rory’s saying Casey is making a bid for dominance over him. For a wolf, that’s very...uh...pack law forbids wolves mating.”</p><p>“Very what?” Nicky demanded. “My Lord, you wolves are so Neanderthal when it comes to being the dominant partner. You, Tarzan, me, Jane. So last century!”</p><p>Marco blushed. Nicky was the only one who could ever make him do that, Rory thought irrelevantly as Marco spoke. He’d snap anyone else’s head off for daring to speak to him that way. Nicky totally bossed him around and he seemed to love it. “Well, we’ll talk about all that later, honey. Right now, Rory has a problem, and I need to concentrate on that issue if you don’t mind.”</p><p>Nicky shrugged, pouting, and allowed Marco to take over. “We’ve never had a situation like this before that I can remember, Rory, so we’re in uncharted territory here. It may be that it isn’t so much that it’s forbidden as it’s never happened before. What is obvious is, if it’s a blood match, it’s too strong to be denied and ignoring it would make you both miserable. I don’t know what the reason is for forbidding two wolves to mate, except for the obvious when it’s two males, of course.”</p> <p>“What obvious?” Nicky asked, unable to stay out of this.</p><p>“The dominance. Remember when I gave you my knot, baby?”</p><p>“Mmm, yes I do. It was amazing.” Nicky got a dreamy look on his face.</p><p>Marco smiled fondly and colored a little again. “Only one can give the knot and mating bite. As far as I know, no one knows what taking the knot and getting the mating bite would do to a male wolf or feeding from the dominant’s blood to complete the bonding. We know what the changes do to a pet or human, not wolf. He could be changed in some way just like you were.”</p><p>Nicky dropped his arm from Rory’s shoulders. “Oh, I get it. He could become werekin instead of wolf. It could mean a fate worse than death, huh? He could actually become a pet, like me.”</p><p>“Now, Nicky...” Marco put his hand out to cover his mate’s, but Nicky brushed it away.</p><p>“Don’t patronize me, Marco. I knew all along how you wolves really feel. Pets are second class, no matter how much you go on and on about loving and treasuring us.”</p><p>Rory spoke up quickly with a firm shake of his head. “No, you’re wrong, Nicky. We do love and treasure our pets. More than you could know! And they’re not second class anything. It’s just that a wolf has a strong need to protect and yes, dominate. If we can’t do that, it might destroy us, tear us apart, and cause such a split inside we’d never be whole again. I’m so torn right now between wanting to be with my mate and let him do whatever he wants to do with me, and at the same time, I want to care for him, protect him, and own him. I can’t stand the thought of him with someone else.”</p><p>Nicky’s voice was softer as he gazed into Rory’s eyes. “Sounds just like me. Don’t you know if you mate, you own him as much as he owns you?” He glanced up at Marco, who nodded slowly.</p><p>“Nicky’s right, Rory. I never thought of it like that, but it’s absolutely true. Nicky totally owns me, just as I do him.”</p><p>“What if you couldn’t shift again, Marco? If you couldn’t care for your family? No, I can’t do this. I’ll just have to reject him as my mate. It’s the only way.”</p><p>Marco sighed deeply. “You can try, but you’ll wind up miserable, maybe even sick. You’ve never shown any alpha traits, Rory, so it may not be as hard or different as you think.”</p><p>Rory stood up, resolute, shaking his head. “But you don’t know what will happen. I have to try to fight it.” He looked down at Marco and Nicky. “Thanks for trying to help me. Please, Nicky, don’t mention this to anyone.”</p><p>Nicky looked hurt. “Of course not. I don’t gossip.” Marco and Rory both looked at him dubiously, but wisely let it drop.</p><p>Rory went to the door. “I’ll let you know what happens, Alpha. Don’t worry. I can do my job tomorrow.”</p><p>“I have no doubt, Rory.”</p><p>Closing the door behind him, Rory leaned his back against it for a moment and heard Nicky sigh, even through the thickness of the wood. He hadn’t meant to eavesdrop but when he heard Nicky speak, he couldn’t stop himself. “I wonder how long it will be before Rory gives in?” he heard Nicky say. “Casey looked to me to be a man who won’t easily take no for an answer. And what do you think all that was about Ian? He looked pretty shocked to hear Rory’s name.”</p><p>“I’m sure it’s just your imagination, honey,” Marco replied. “They were both a little stunned by the whole thing.”</p><p>“Maybe so,” Nicky said softly. “But something tells me there’s more to this than meets the eye.”</p><p>The next morning, Rory was at the common room early, by six forty-five. He half-hoped Casey would be early too, but he was nowhere to be seen. Rory got a cup of coffee and stood by the fire, warming himself before going out in the cold March morning. He’d dreamed about Casey the night before, just like he’d told him he would. Crazy, disjointed dreams making no sense, except for one of them. In that dream, he lost his mate and couldn’t find him, no matter how hard he searched. He was alone in the forest, roaming the trails as a wolf, howling for his mate, lifting his face to the indifferent moon and crying out for him.</p><p>With a headache, he was feeling irritable and out of sorts. When the men finally started filing in a few minutes before seven, Casey was among them with a scowl on his face. Rory had smelled them coming across the courtyard because of Casey and that damn cotton candy scent of his. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The evening before, Rory’s lack of acknowledgment had irritated Casey. Rory planned today to ignore him completely, and what he would say to that? He had to show the larger wolf he was not about to be dominated or told what to do. He was a wolf, not a submissive. He would not, could not be anything but a wolf. So why were his palms damp just thinking about Casey’s possible displeasure?</p><p>As they came over, Casey was right up front. Oddly, he didn’t make eye contact with Rory, and Rory felt a tug of disappointment.</p><p>Rory spoke to the group, assuming a confidence he didn’t really feel. “Is everyone ready to work? The alpha wants us to do the unskilled labor, just general clean-up of the work site, picking up nails and discarded lumber, and so forth, pretty much whatever the beta tells us. We’ll break for lunch around noon for an hour and get off at three o’clock. Any questions?”</p> <p>“Yes, I have one.”</p><p>Rory knew without even looking who was speaking. He tightened his lips and turned toward Casey. “Yes? Still need to know how old I am before you can go to work?”</p><p>Casey raised his eyebrows innocently and said, “No. Although you never did say, come to think of it. But no, I was just going to ask about bathroom breaks. Do we get those? I was just wondering.”</p><p>Knowing he was being a smartass, Rory tried to answer calmly, not letting Casey rattle him. “Just as many as you need, uh...Connor, isn’t it?”</p><p>Casey’s eyes narrowed, promising payback for pretending to forget his name, and Rory got a stomach full of butterflies.</p> <p>“The name’s Casey. Not a hard name to remember, but maybe after you shout it out a few times, it’ll stick with you.”</p><p>Rory felt the hot blood staining his cheeks. He lifted his chin, walked quickly past him and out the door to the worksite, hearing a soft chuckle behind him.</p><p>Ian already had a construction crew on site, getting started. Rory introduced him to the new crew and then stood aside for Ian to tell them what needed to be done. Ian, a quiet person, carefully considered his words before he ever spoke, the sign of a good advisor and a good beta. His mate had died in childbirth over two years ago, and he had almost grieved himself to death. Sorrow to such a degree was another drawback to mating for life. When your mate was unavailable to you, for whatever reason, there was no backup plan. If you were very lucky, you might find a love match, but that was difficult and rare for wolves.</p><p>Jobs were assigned, and Rory was happy to see his crew working hard and doing a good job. Casey stayed near the back of the new addition, working with some of the roofers, sparing Rory his remarks and sidelong looks. He could still smell him though, even from so far away, and he was really becoming used to that smell, clogging his nostrils and setting up a deep craving in him. All he wanted to do was go find Casey, step into his arms, and breathe him in deeply. He could see Nicky in his mind’s eye, always putting his nose against Marco’s neck. Now he understood why.</p><p>As the morning wore on, the sun became very warm, with only the cool southwesterly breeze keeping it from being uncomfortable. Unusually warm weather for March, but it made for ideal working conditions. At lunchtime, Casey came around the building, minus his shirt, and Rory caught his breath. His body was sculpted and cut with muscles, skin was tanned and brown. His abs were washboard flat, and he had almost no hair on his chest at all, just a little treasure trail below his navel, disappearing into his jeans. Perfect, of course, Rory thought bitterly, and dropped his gaze quickly when Casey caught him looking.</p><p>Casey walked over to where he was making notes. He was sweating a little, and the cool breeze picked up the scent and waved it temptingly under Rory’s nose, begging him to take a bite of those enticing abs.</p> <p>He stood for a moment until Rory looked up at him. “I changed my mind, you know. You’re not my mate, after all.”</p><p>Momentarily shocked by the sharp pain slashing through him at the words, Rory dropped his gaze for a moment before raising his head again. “Good. Then we agree, so leave me alone.”</p><p>“Not a problem.” Casey shot him a furious look and stalked off to stand a few feet away talking to one of the other gammas, his back firmly turned to Rory.</p><p>Rory clenched his fists, determined not to let this man get to him, but he’d crawled under his skin with ease. To Rory’s shame, his cock jumped to attention, rigid and ready, at the sound of Casey’s voice. He couldn’t let Casey see how much he wanted him, and he definitely couldn’t let Casey see how much his words hurt.</p><p>Wanting to get away from him, Rory jumped to his feet and turned, running into one of the day laborers brought onto the job from the nearby town of Brevard. The big, burly man was carrying a large sheet of plywood. Rory knocked the sheet from the man’s hand, almost knocking him over as well. The man turned on Rory angrily.</p><p>“Hey, watch where you’re going! Dammit!” A meaty hand on Rory’s chest shoved him backward. Caught off balance, Rory fell hard, smashed his elbow against the ground and yelped out in pain.</p><p>Before Rory could react, Casey crossed the short distance between them and was in the man’s face, his expression murderous. “You got a problem, buddy, take it up with me. Keep your fucking hands off him! It was an accident, and you’re fixing to have a bad one if you touch him again!”</p><p>“Okay, okay, sorry!” His nerve breaking at the sight of the furious, massive young wolf in his face, the man picked up his piece of plywood and moved quickly away.</p> <p>Rory watched the exchange with his mouth open and the strangest warm tingling he’d ever had swept over him.</p><p>Casey turned to Rory and stood over him looking down. “Did he hurt you?”</p><p>“No, no, I’m fine.”</p><p>“What about your elbow?”</p><p>Rory realized he was cradling his elbow in his hand. He dropped it quickly. “No, no. I’m okay, really.”</p><p>“Right. Good. Okay then.” Casey turned around and walked away quickly. Grabbing his shirt, he shrugged it on and hurried back toward the compound for lunch, leaving Rory still on the ground, staring after him in surprise and feeling as strangely bereft from Casey walking away as he’d felt excited when Casey protected him.</p><p>The rest of the day passed slowly. Casey tried to stay away from Rory as much as he could, his feelings in conflicting confusion. He finished his work for the day and walked tiredly back to the compound. Rory had left an hour or so before.</p><p>Casey knew when Rory left, as certainly as if he’d come to tell him. He could already sense a great deal about him, and he knew if—or when—they mated, he’d be able to pick up his thoughts as well.</p><p>Casey was by far the most dominant wolf in the equation, and he suffered no doubts Rory, as driven as he was, would answer the blood call. The problem was the idea of mating with Rory was the most difficult thing in the world. It just wasn’t possible for Rory to be his mate. What kind of crazy cosmic joke was this, anyway? He’d come to the Mountain Wolf compound for one reason and one reason only—to kill the wolf called Rory, taking his justifiable revenge against the man who’d killed his brother. How could this killer be his bloodmate? It just didn’t seem within the realm of possibility.</p><p>When he’d first arrived with the rogue group, he’d been given a list and told to pick a work station. When he saw Rory’s name as a gamma, along with a wolf named Ian as crew leader, he’d been excited over how easily he’d located his brother’s murderer and could get close to him. He’d signed up for the work detail immediately. He’d shown up for work early, anxious to get a good look at the man he was soon going to kill. The delicious smell wafting into the common room stunned him at first and then fascinated him. Wolves never knew when they might meet their blood match, and it usually came when they least expected. Certainly, now, while he was on a vengeance quest for his brother, was not a time he expected to run into his mate, but the scent intrigued and beckoned him.</p><p>When the young, gorgeous wolf walked into the room, Casey could barely restrain himself from leaping over the chairs between them and taking him right there in front of everyone. He was smaller than average, but perfect, with beautiful little features and curly brown hair. He definitely had the cutest little bubble butt Casey had seen in a long time. Casey had a sudden vision of his cock stuck firmly between those delectable ass cheeks. The young wolf seemed not to even notice him, and Casey found himself incensed and determined to make him pay attention. He assumed the young man was Ian, the crew leader. When they stood close together, just before the alpha told them to break it up, he had been very tempted to kiss his beautiful young wolf right then.</p><p>When the alpha’s mate, Nicky, called him not Ian, but Rory, Casey was devastated and rocked to his core. All he could do was run back to his room and lick his wounds, trying to figure out how such an insane thing could have happened.</p><p>By morning, he’d pretty much convinced himself he was mistaken, and he wasn’t nearly as attracted to Rory as he thought he was. Casey was strong—he’d always been strong willed and able to do anything he put his mind to doing. He could beat this thing. He’d steel himself against the little murdering bastard and not be bothered by any stupid smell. He could do this. Rory was not his mate. The very idea was ludicrous. He left his room the next morning confident and strong, ready to put aside any tender feelings he might still be harboring for the young wolf.</p><p>That lasted until Rory walked in with his little notebook, looking nervous and tired, with bluish shadows under his pretty eyes, like he hadn’t slept well. Tenderness, love, and passion almost overwhelmed Casey, and his shoulders slumped in defeat. He planned on ignoring him, but once again, he had to speak to him, to tease him, to make Rory notice him, like a damn kid. Later, when the dude pushed him down at the work site, he literally saw red. Damn! He felt so protective of him, he wanted to wrap him up in cotton and keep him safe.</p><p>Casey walked back to the compound dragging his feet, dreading the evening when he might see him again at supper. In the common room for dinner, he looked for Rory right away, spotting him sitting at the table of the alpha, Marco. Marco’s beautiful mate, Nicky, was with them, and he gave Casey a little wave as he walked in. Rory pretended not to see Casey. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That’s okay, darlin’. You know I’m here, and it’s taking your appetite away, isn’t it? Good. Suffer, damn it. You need to suffer like my brother did. Like I’m suffering now seeing how fuckin’ gorgeous you are. Damn you!</p><p>Despite his harsh thoughts, every protective instinct in his body wanted to go to Rory and make sure he ate a good meal. He had to make himself stop being so protective, not think of him as his mate and fortify himself against him. He had to stop thinking of him, period. Only how in the hell was he going to do that?</p><p>After supper, he waited until he saw Rory go upstairs for the night. He went to his own room for a long, hot shower. Afterward, he slid into bed. Once there he tossed and turned, trying to sleep, trying to make his mind a blank. Instead, all he could think about was Rory. He wondered if Rory was in bed too, lying there, maybe thinking of him.</p> <p>Giving up, he slipped out of bed and got into his clothes. He went to find Rory, unable to stay away, unable to stop thinking about him. He needed to see him. He needed to be alone with him to figure out if he was really the one. If he was, everything would have to be different, and he wouldn’t be able to complete his quest for revenge. At least not the way he’d originally planned. A wolf was unable to kill his mate—physically, emotionally unable without killing himself. It was unthinkable. In his heart, he already knew Rory was the one, and the real reason he left his room was he couldn’t stay away.</p><p>He knew where Rory’s room was, but he could have found it without prior knowledge. Right up until the moment he entered the hallway, Casey still had faint hopes he was mistaken about Rory being his mate. The overpowering smell of chocolate chip cookies, his favorite smell, drew him right to Rory’s room. The door was unlocked, and he eased it open, finding the room glowing as pale silver moonlight streamed through an open window. Rory must have gone right to bed after he ate dinner and was stretched out on his back under a single sheet.</p><p>His mate was naked, his T-shirt and underwear lying on the floor beside the bed as if he’d pulled them off while he slept. Had been dreaming and got too hot? Was it Casey he dreamed about? At the idea, a wolfish smile lit up his face. Everyone in the compound thought Nicky was the most beautiful male anyone had ever seen, and he truly was something to see, but looking down at his pretty mate, Casey thought Rory was gorgeous in his own right. His hair was a soft and silky brown, streaked with golden highlights. He had a handsome face, with high cheekbones and a cute little nose turned up ever so slightly on the end. Casey wanted to bend over and kiss the tip of his nose, but settled for brushing his finger over the tip. He smiled when Rory reached up to scratch at it. Stepping back, he dragged the sheet with him to admire Rory’s body, lean and perfect, with wide shoulders, tapering down to a small waist. His abs rippled with muscles, and Casey couldn’t stop himself from bending over to brush his lips across them. Rory sighed in his sleep and tried to turn over. A hand on his stomach kept him in place, but disturbed, Rory twisted his legs restlessly and moaned.</p><p>Sitting down on the side of the bed, Casey shook Rory gently. Coming awake slowly, he murmured something in his sleep, saying Casey’s name. He came wide awake as he realized who sat on the bed beside him.</p><p>“What...what are you doing here?” His voice was panicky and breathless. “Shhh. Don’t talk.” Rory sat up, scooting high up in the bed next to the headboard to get as far away as possible. He yanked the sheet back up to his chest. “Get out of here, Casey! We have nothing to talk about. Please. I-I’ll see you tomorrow.”</p> <p>Casey shook his head. “No. It’s no good. You’re my mate, and I can’t fight it. I’m tired of fighting it. Now that I’ve found you, I can’t eat, sleep, or do anything but think about you. You know it will be that way until we mate. Maybe then I can get some peace.”</p><p>“No! You don’t understand. I’m not ready yet. I have to have some time.” “Time to talk yourself out of it? Time to run away? No, it has to be soon. I can’t wait much longer.”</p><p>He gripped Rory’s ankle and pulled him down from the headboard. Catching him under the arms, he lifted him onto his lap. Though Rory struggled a little, Casey took his mouth with his own and kissed him, grinding his mouth into his and battling his tongue for control until Rory kissed him back, arms wrapping tight around Casey’s neck. Casey licked gently at his mouth, teasing his bottom lip with his teeth.</p><p>He laid Rory’s unresisting body back on the covers and trailed kisses down his throat and onto his chest. He spent some time with each nipple, while Rory writhed under his tongue. When Rory’s hand gripped his own cock, Casey pushed his hand away and took Rory’s beautiful cock, rubbing the tip with his thumb while he finished his ministrations on Rory’s nipples with his mouth and tongue. Slowly he continued a trail of kisses to Rory’s groin where he engulfed the sweet weeping cock in his mouth, sucking it to the back of his throat when Rory’s hips surged up in welcome. Over the length of the shaft, licking at the underside, he moved slowly up and down.</p><p>Rory gripped the sheets on the mattress so hard his knuckles went white, and he groaned so loudly Casey was afraid someone would come in to check on him any minute. He brought his tongue up to the tip of Rory’s cock and made a rolling swirl. Rory couldn’t hang on any longer. His hips bucked, fucking Casey’s mouth hard, gasping out, “Casey, Casey,” over and over as he came explosively. Casey took every drop of his salty cum, sucking it down his throat and kept on sucking until Rory begged him to stop. Only then did he pull his mouth away with a soft plop. Rory trembled all over, limp when Casey pulled him into his arms and kissed him. Rory’s arms slipped around his waist, snuggling close to him.</p><p>“Tell me the truth, baby. Was that your first time?”</p> <p>Rory dropped his long lashes over his eyes and nodded shyly. “Yes,” he said breathlessly.</p><p>Casey smiled, a thrill of ownership coursing through him. “Good. I’ll be your first and your last, darlin’. No one else will ever touch you like this except me.”</p><p>Rory nodded slowly, refusing to raise his gaze.</p><p>“That was your first lesson, Rory. We can’t deny our blood song. Do you understand?”</p><p>Rory nodded again.</p><p>“Say it.”</p><p>“Yes, I understand.”</p><p>“Good. Next time you’ll come to me. Come to my room tomorrow night, baby. Don’t make me come looking for you.”</p> <p>Casey stood up and walked out of the room as silently as he’d come, leaving Rory sitting on the bed looking stunned.</p><p>Chapter Two</p><p>Casey trudged back to the compound wearily after a long day. They’d begun their combat training with hand to hand fighting, and shifting back and forth into their wolves. He was bruised all over. Rory never showed up, and Casey was dying to get his hands on him. He knew Rory was hiding from him.</p><p>When he passed the common room, he was surprised to see decorations adorning the walls and tables, with fresh flowers everywhere. He stopped one of the pretty young pets passing by with her arms full of streamers to ask the occasion.</p><p>“It’s the first anniversary party of our alpha and his mate, Nicky. We’re having a big party tonight, with dinner and dancing. Nicky said it would get our minds off all this war talk. It should be fun!” She batted her eyelashes at him. “Maybe you can save a dance for me, sir.”</p><p>Casey smiled and nodded, but his interests didn’t lie in pretty little dark-haired girls. The object of his desire happened to be a stubborn, beautiful, murdering little wolf. Maybe he’d make him dance with him tonight. He smiled at the thought of the look on Rory’s face if he approached him for a dance. He was so afraid of losing his status, of having to submit to another wolf. Submitting to your alpha was one thing—all the wolves in Marco’s pack had to yield to him. But to be submissive to another wolf, one who was his mate and would dominate him, was giving him terrible trouble. It was why he kept denying Casey, despite the evidence of his body and mind.</p><p>For Casey, it was a good thing, the one thing that might salvage this situation for him. It was painfully obvious he couldn’t kill him as he’d planned. Rory was his bloodmate, and he would rip out the throat of anyone else who dared even threaten him. He could, however, take him over and make him submit, make him, in effect, his prisoner. He could, and he would. Before another day went by, Rory would be his mate and his captive. Rory would be in his custody for life. For a wolf shapeshifter, being owned body and soul by another wolf would be torture. He would make it an exquisite torture for his beloved mate, but torture it would be. He’d pay for what he’d done, one way or the other.</p><p>Marco called to him from across the room, and he turned to face him with a respectful tilt of his head. The alpha walked over to him.</p><p>“Casey, I hope you’ve had a chance to talk things over with Rory.”</p><p>Casey was noncommittal, spreading his hands. “I’ve tried, Alpha, but he refuses to talk to me. I don’t think he’s interested in having a mate right now.”</p><p>Marco frowned. “We’ve never had a situation like this before. Unfortunately, you know as well as I do neither of you has much choice. Do I understand correctly you’re not opposed to so uncertain a mating if he changes his mind?”</p><p>“I am not.”</p><p>“I’ll speak with him again. Nothing good can come of his denial. He simply has to face whatever is going to come of this. Give him a little time to come around. Don’t try to force it on him. Maybe you can talk to him tonight at the party?”</p><p>“Oh, I plan to.”</p><p>Marco looked at him sharply.</p><p>Casey tried to look as non-threatening as he could, not wanting to arouse Marco’s suspicions. He wasn’t ready yet for them to know who he really was and his reason for being there.</p><p>“Good,” Marco said. “Thanks for being understanding about this. He’s a good boy, Casey. I wouldn’t want to see him hurt.”</p><p>“Neither would I,” Casey replied. It was true, he didn’t want to physically hurt him and would kill anyone who tried. He just wanted to own him, body and soul, stripping him of every ounce of pride. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“By the way, Casey, I spoke to Shawna about you. She said you joined their rogue pack only a few days before they rejoined us. Is that correct?”</p><p>“Yes.”</p><p>“Where had you been before that?”</p> <p>“I suppose you could say I was unaffiliated.” Casey grinned at the alpha, mixing truth with insinuation. “My parents were rogues, and after they died, it was just me and my brother. He passed away too, and I sort of drifted around until I met up with Shawna’s group. They took me in. End of story, I guess.” The story was fairly true, as far as it went.</p><p>“How have you been identified as far as rank? Did Shawna or anyone in her pack submit you to a challenge?”</p><p>A challenge was traditionally a way for a wolf pack to determine what rank their wolves belonged to. Once a wolf reached puberty, he would go into the ancestral ring to wrestle with other wolves of his age. In this way, potential alphas were picked out of the pack for further training. Alphas and betas were both rare and highly prized, although in Casey’s own pack, the old ways were not practiced with any diligence.</p><p>Casey shook his head, and by answering only the second part of Marco’s question, he as much as lied again. He knew his rank very well. He was alpha. “No, there wasn’t time for that— when I got to the pack, things were sort of in flux, and they were trying to reconnect with the Dark Hollow Wolves.”</p><p>Marco studied him silently. “I think we should put you in the ring very soon, then. Something tells me you’re an alpha. Has anyone ever told you that before?”</p> <p>“No,” Casey answered in a complete out and out lie.</p><p>“If you are, it would make it even harder on Rory, I’m afraid, but it can’t be helped. It’s time he faced his insecurities and his responsibilities to his mate. I’ve tried to be patient with him, but perhaps it’s time for firmness now.”</p><p>“I can do that.”</p><p>Marco looked at him in surprise. Then he nodded thoughtfully. “I believe you can. Well, I hope you’ve found a home here with us and Rory. I hope you’ll have a good time tonight.”</p><p>“I’m sure I will. Thank you, Alpha.”</p><p>Watching Marco walk away, Casey’s mind strayed back to not quite a year ago, when his brother Aaron, then the Alpha of the Sapphire Wolf Clan, had told him of some news he’d just heard.</p> <p>“Marco, Alpha of the Dark Hollow Pack, has a new mate. They say it’s a pretty young man. Pretty special, too, and Marco’s besotted with him.”</p><p>“Really?” Casey shrugged, only mildly interested in what was going on with the rival Clan. The two clans had been at odds since before anyone could remember, often raiding each other’s camps, and taking prisoners for ransom. There hadn’t been a raid for many years, and Casey was content to keep it that way. The Dark Hollow Pack had grown large and prosperous under Marco’s leadership, and Casey thought it would be a good idea to let sleeping dogs lie.</p><p>“Nicky is his name. I’ll bet Marco would pay a pretty penny to get him back should anyone decide to kidnap him.”</p><p>“Oh, no, Aaron. I don’t like the look in your eye. Marco’s pack is larger than ours, and if we took his mate, he’d be furious. This is not a good idea.”</p><p>“I’m the alpha, Casey, and I decide what’s a good idea and what’s not. It’s your job just to go along with me. Is that clear?”</p><p>Casey bit his lip and nodded. “Yes, Alpha.”</p><p>The old alpha had allowed challenges almost to go out of style, and when he died, Aaron was the only one who stepped up to take his place, claiming to be an alpha without any real challenge of any kind. Casey hadn’t wanted to go up against his brother, though he knew in his heart he was the natural-born leader. His brother was too hot-headed, too rash ever to be a good alpha. But Aaron, seven years older, had raised Casey like his own son after their parents died in a car accident, and Casey felt he owed him everything. Certainly he owed him his allegiance if he wanted to be the alpha male. He’d put aside his own feelings and gave his total loyalty to his brother, no matter how painful it was to him. This latest idea, however, struck him as just asking for trouble.</p><p>“I’ve decided. We’ll go over to the Dark Hollow Pack’s compound and just sniff around a little. We won’t take any untoward risks, but if a situation happens to present itself, why then...”</p> <p>They had sniffed around for several days, camping nearby, out of range of the nightly patrols and slipping across the boundary lines during the daytime. On the third day, they’d seen him. He was outside on the lawns, near the woods, playing football with a young boy of around twelve or thirteen. The boy was a pet too, by the look of him. Both were barefoot and wearing the characteristic tight leather pants and no shirt. Immediately struck by his golden beauty, Casey still got a very bad feeling about the whole thing. First of all, why were these two valuable pets left alone and unguarded? Where were their masters? Something about it didn’t feel right, and Casey tried to caution Aaron, who shrugged him off, saying, “Their loss is my gain! Who cares where their masters are? This is being served up to us on a golden platter, and I’m taking advantage of it!”</p><p>Aaron seized the young boy first when his ball came rolling into the edge of the woods and threw him to Casey to bind and gag. He caught Nicky next when he came looking for the boy. He put up quite a fight. It was all Aaron could do to subdue him without seriously hurting him. He finally got him tied and gagged, but Aaron had hit him a few times to get him to settle down. It was unusual for a pet to be so aggressive when fighting off two grown wolves, and Casey’s uneasiness came back with a vengeance, even more so when he saw the cockstand Aaron had after fighting with the beautiful creature.</p><p>“Just you wait till I get you home, pretty boy. I’ll show you what a real man can do. You might even decide to stay with me once you get a taste of this,” he bragged crudely, grabbing himself and thrusting his groin toward Nicky’s face. Nicky turned his head and bucked his hips wildly, trying to loosen his bonds, but Aaron laughed and threw him over his shoulder.</p><p>As they ran down the trail back to their temporary camp, Casey holding the young boy and Nicky slung over Aaron’s shoulder, his uneasiness built, like something bad was coming and coming soon. He didn’t doubt Marco had bonded with his beautiful mate and was probably picking up on his distress right that minute. They ran as fast as they could, with Nicky struggling every step of the way, until they heard an unearthly howl of rage and pain behind them on the trail. It shook Casey badly, and he knew it must have affected Aaron too, because he cast a wild glance over his shoulder and threw Nicky to the ground. He turned, looked back over his shoulder at his brother, and said one word, “Run!”</p><p>“Please, Aaron, let me stay with you and fight.”</p><p>Aaron held a knife to Nicky’s throat. “No. Get home. I’ll be along in a few minutes after I deal with Marco. Since his mate’s not hurt, he’ll make a deal with me. Now get! Do as I say!”</p><p>Reluctantly, Casey put the young boy down by the side of the trail and ran all the way back to camp. He waited around for almost two hours, could stand it no longer and circled back to where he’d last seen his brother. There, on the ground, his throat ripped out, lay his brother, his blood already cold. He must have been killed right after Casey left him. They hadn’t even bothered to bury him or cover his body, just left him lying on the trail like garbage. Casey howled his grief and rage and took his brother home for a decent burial. Every step of the way, he vowed revenge. Nothing had happened to Nicky or the young boy that warranted his brother’s death. Aaron had touched another wolf’s mate, and he had made threats to Nicky, yes, but he hadn’t hurt him, really, just roughed him up a bit when he struggled. He couldn’t believe Marco had taken such a drastic action, regardless of how much he cared for his mate.</p><p>Only later did he learn from the rogue pack in the area that it hadn’t been Marco who killed his brother, but a young relative of his named Rory. According to those sources, Rory jumped on his brother in wolf form, not giving Aaron a chance to shift, and killed him before Marco could even interrogate Aaron. As far as Casey was concerned it was murder, pure and simple. A man didn’t stand a chance against a wolf, and Rory must have known it. Aaron had put himself in a bad position, yes, but he deserved at least a fair fight, and he hadn’t received it. For that, Casey vowed, Rory would pay with his own life. He would find him and kill him for what he’d done.</p><p>Coming back to the present with sigh, Casey wished it could be as easy as he’d once thought it would be.</p><p>Once in his room, he stripped off his clothing and got into the shower, turning on the water as hot as he could stand it. He wished Rory was in the shower with him, his little body slick with soap and water.</p><p>Casey would take his own soapy hand and slick it up and down slowly on Rory’s cock, then turn him around and take care of the backside as well. Rory’s knees would be trembling, and Casey would put his arms around him and hold him close, kissing him sweetly and tenderly, rubbing his hardness against him, while his hands roamed over his body.</p><p>Smiling at his own daydreams, he finished his shower. Tonight, little wolf. Tonight I’ll make you mine. He stepped out of the shower and dried himself before stretching out on the bed still naked to rest before dinner. He’d told Rory to come to him tonight, but he didn’t think Rory would. He was still too terrified of Casey and what he might do to him. What he would do to him. Despite what he’d told Marco, force might be needed, but he hoped to avoid that. He wanted him to come to him willingly, because he couldn’t stay away.</p><p>Tonight, one way or the other, Rory would become his mate. He wasn’t waiting any longer. If Rory wanted to avoid it, forcing him to submit would make it that much sweeter. After submission, he would make him his pet. No more wolf for you, baby. That’s your punishment, sweetheart, and I’ll see to it that you never shift again. From tomorrow on, you’re mine to do with as I will. You’ll wear my collar. Every night, I’ll feed you my blood to make you docile, and then fuck you hard and make you like it. Instead of lead gamma, you’ll be little bitch to my alpha. How will you like that, my little wolf? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Casey closed his eyes and drifted off to sleep with a smile on his lips and his cock hard and aching with need.</p><p>Nicky and Marco motioned to Rory from across the room. He didn’t want to even be at this party. He knew Casey would be there, and Casey had ordered him to go to his room tonight. He’d implied he would mate with him, and Rory was terrified. Not of Casey physically. He’d face him and try to fight him off if he had to. No, he was terrified of his feelings for the handsome young wolf. He was so terribly drawn to him. The night before, when he’d come to his room, Rory felt as if he were drowning in his passion and love. He hated to admit to anyone he was a virgin. Until Casey’s mouth closed over him, his poor cock had known only his own hand. Casey was the first person he’d ever been with in any sexual way. When Casey put his mouth on him, he’d lost his free will, never wanting the feelings to stop. That loss of his will to resist was what frightened him. If Casey made love to him again, he might totally lose himself and fall headlong into submission to him. What he feared the most was the fact he didn’t trust Casey to catch him if he fell. Sometimes when he gazed into his eyes, he saw emotions he didn’t understand, almost as if Casey despised him yet loved him at the same time.</p><p>If he went to Marco for protection, he’d probably give it to him, but what kind of man would he be to run to his uncle for help. No, he had to stand up to Casey and tell him firmly he was not interested in him as a mate. He had to look him straight in the eye and tell him to leave him alone, with no assurances Casey would abide by his wishes even if he believed him. He strongly suspected Casey was not going to take no for an answer. The best plan for him was to avoid him if at all possible. He’d stay close to Marco and Nicky tonight and hope Casey would give up and go away. Maybe he was only postponing the inevitable, but he wanted a reprieve for just one night.</p> <p>Nicky had never looked more handsome and happy. He was dressed in a lovely white robe, the same robe he’d worn for his ceremony to introduce him to the clan and proclaim him Marco’s mate. He and Rory had a knock-down, drag-out argument about him wearing the robe at all. Rory remembered with a smile how Nicky had threatened to beat him up if he made him wear what he called a dress. Nicky thought it looked too girly. Marco had to force him wear it that night, and he really did look nice. He bet Nicky hadn’t objected for their anniversary. He jumped up and gave Rory a hug as he came over to the table.</p><p>“Sit down, Rory, and tell me what’s going on with you and Casey. You’ve been avoiding me all day.”</p><p>“I haven’t been avoiding you. I’ve been busy.”</p><p>“Busy doing what? Hiding in your room so Casey wouldn’t see you?”</p><p>“Shut up, Nicky. Marco, tell him to shut his mouth, or I’ll shut it for him.” Marco rolled his eyes and pulled Nicky closer to him with an arm around his waist. “Will</p> <p>you two stop fighting? Nicky, behave yourself. If Rory doesn’t want to talk about Casey, he doesn’t have to, though I believe Casey said he’d be at the party tonight.”</p><p>“Who cares if he’s at the party? I’m not his mate, Marco, no matter how many times he says I am.”</p><p>“I’m not the one you have to convince.”</p><p>“Don’t look now, Rory, but tall, dark, and dominant just walked in the door, and he’s headed</p><p>this way.” Nicky gazed toward the door and laughed at the panicked expression on Rory’s face. Casey, looking impossibly gorgeous and sexy, made his way with determination across the crowded room. Rory felt like a deer in the headlights, frozen as Casey held his gaze with his eyes, refusing to release him. Rory wrenched his gaze away at the last minute and tried to dodge out onto the dance floor, anywhere to avoid speaking to him, but he was too late. Casey snapped him back by his wrist and drew him into his arms, holding him there with a steely grip.</p><p>“Let’s dance, darlin’. I believe they’re playing our song.”</p> <p>Both hands against his chest, Rory pushed. “No! I’m not dancing with you. Stop it!” He may as well have been pushing against a stone pillar for all the good it did. Casey drew</p><p>him inexorably out onto the floor, and unless Rory wanted to make a scene, bringing everyone’s attention to what was going on, he had to go along with him. Dragging his feet, his face beet red, he hissed at Casey, “You’re embarrassing me, as you well know. I don’t dance with other wolves.”</p><p>“Well, you do now, sweetheart. If you’d stop fighting me, you might even enjoy it. C’mon baby, relax.”</p><p>“I don’t know even know how to do this!”</p><p>“What, dance? Or dance with another man? Relax and I’ll lead.” He put both arms around Rory’s waist. “Now put your arms around my neck, baby. That’s it. See? We’re dancing.”</p><p>Dancing might have been too elaborate a word for what they were doing, which was mostly standing in one place swaying a little to the music. Rory put his head down facing Casey’s chest so he wouldn’t have to see Nicky laughing at him, as he was sure he was. He found himself wanting to rest his head against Casey’s chest, thinking it might be a very comfortable place to stay, and wished he might stay there for a very long time. Casey’s closeness soothed something deep inside him.</p><p>As the music played on, Rory decided he’d been missing out on something by never learning to dance. It was really quite nice. Casey began to move him across the floor, and Rory went along with him, still keeping his head down, letting himself relax and enjoy being close to Casey, even if for only a few minutes. Finally he raised his head and saw that Casey was moving him slowly to the outer edge of dancers, toward the dim recesses of the room.</p><p>“Oh no, you don’t, Casey. I’m not leaving here with you, so stop trying to pull me out of here.”</p> <p>“C’mon, baby. You know you want to be alone with me. Just for a little while.” Casey bent his head and put his lips beside Rory’s ear, causing him to shiver deliciously. Rory pushed against him again though, and stopped moving anywhere.</p><p>“No! Let me go, Casey. You’ve had your fun.”</p><p>“Actually I’m just getting started, darlin’.”</p><p>“Yeah, well, fuck you, Casey.”</p><p>“I’d rather fuck you, honey. Let’s go to my room for a little while.”</p><p>Rory stomped down on Casey’s foot as hard as he could, taking him completely by surprise. The look on his face was almost comical, as he dropped his arms and stumbled back a few steps. Rory jerked away from him and took off across the dance floor, heading not toward Marco’s table, but toward a large group standing by the buffet table. He arrived slightly out of breath, not daring to look back over his shoulder, uneasy at the thought of Casey’s anger at his resistance. He grabbed a plate from the buffet and started down the line, dishing food onto his plate, but barely glancing to see what he’d even selected.</p><p>Someone came up to stand at his elbow. Thinking it was Casey, he turned viciously to growl at him, but instead of Casey, a handsome young werekin named Chad stood there.</p><p>“Whoa, dude! I was just coming over to say hello.”</p><p>“Oh, I’m sorry, Chad. I thought you were someone else!” Rory ducked his head in embarrassment. “Someone much more annoying. Sorry.”</p><p>“It’s okay,” Chad said warmly, putting his hand on Rory’s arm. “I saw you dancing with Casey. I never knew you liked boys before. I was wondering if you’d dance with me?”</p><p>Rory raised his gaze to say something kind, but dismissive. He didn’t like boys. He just craved Casey, and he had to get him out of his system. When he glanced into Chad’s eyes, they were so hopeful and sweet he didn’t want to hurt his feelings. “Sure, Chad. I’ll dance with you,” he heard himself say. “Let me eat a bite or two first, okay?”</p><p>“Sure. I’ll sit with you while you eat if that’s okay?”</p><p>Rory shrugged and was about to make some kind of excuse when he saw Casey glaring across the room at Chad’s hand still on his arm. A kind of thrill went through him. Casey was jealous, really jealous, from the look of fury on his face. Some perverse little demon took hold of him, and suddenly he wanted to make Casey miserably jealous. He wanted to make Casey just as uncomfortable and confused as Casey made him. He put his arm around Chad’s shoulders and squeezed. “Sure you can, honey. Let’s find a place to sit down.”</p><p>He led Chad over to an empty table, feeling the waves of disapproval coming off Casey. They hit him in a palpable tide of anger and jealousy, spurring him on to do even more. When they arrived at the table, he pulled out the chair for Chad and even dropped a little kiss on his cheek. Chad blushed, evidently pleased at the attention.</p><p>He was a cute little thing, taking after his human mother in size, not much smaller than Rory. Until the recent changes instigated by Nicky, male pets, mated or unmated, were not permitted to wear shirts. Though now many had adapted to common clothes, Chad hadn’t, showing off lean muscles across his shoulders and arms and a full expanse of smooth, tanned skin on his abs. He had very pretty brown eyes shining with excitement. A part of Rory felt guilty at the idea of leading him on. He really had no interest in anyone except Casey, but the temptation of irritating Casey was too great to allow him to stop. Sitting down beside the young man and scooting his chair up close, Rory ate a little, not really tasting anything, too aware of Casey glaring at them from across the room. Chad babbled about something the whole time. Rory paid little attention, just nodding occasionally to make him think he was.</p><p>When he finished, he pushed his plate back and stood up, offering his hand to Chad. “Let’s dance. I’m not very good at it. In fact, I really can’t dance at all. You may have to show me.”</p><p>Chad jumped up eagerly, and the two of them went to the dance floor as a slow song started up. Chad put both his arms enthusiastically around Rory’s neck and pushed his body up close, brushing his groin against Rory’s. Rory blushed and almost pulled away, but he heard Casey growl from across the room. Rory glanced nervously over at him and saw Casey get to his feet and start their way. He wrapped both arms around Chad’s waist and deliberately turned his back on Casey. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rory bent down to kiss the side of Chad’s neck, knowing it would enflame Casey even further, and sure enough, a big hand came down hard on his shoulder and ripped him away from the pet. Casey put himself between Rory and the confused and frightened boy, but said gently, “Sorry pet, this wolf is playing games with you. Please excuse us.”</p><p>Chad ducked his head, mumbling, “Yes, sir,” and moved quickly away, casting a glance back over his shoulder at Rory. Before Rory could react, Casey turned back to him, took him firmly by the arm, and proceeded to drag him outside.</p><p>The cool air hit Rory like a wake-up call as they stepped outside, and he shivered, half from the cold and half from the excitement of Casey being so responsive to jealousy and being so forceful. What had he been doing? He felt guilty for leading Chad on just to make Casey jealous, yet he could feel his cock hardening and his stomach fluttering like a bucket full of butterflies. Casey backed him up against the nearest wall and leaned over him, a hand on either side of his head.</p> <p>“What the hell do you think you’re doing?”</p><p>“I’m not doing anything. I was just dancing with a friend.”</p><p>“Dancing with a friend, my ass. You two were practically making out on the dance floor. You belong to me, buddy, and you better get used to the idea.”</p><p>Rory tried to push him away, but it was like trying to push a brick wall. “Leave me alone! First you say I belong to you, whatever that means, and then you say I don’t. Then you come to my room and—damn it, I’m not interested in you! And I’m getting whiplash from your changing moods.”</p><p>“I’m not going to leave you alone, so get used to it.” Casey cupped Rory’s balls through his jeans and squeezed. Rory yelped in surprise, not pain, and tried to pull away in embarrassment.</p> <p>Casey squeezed harder. “Stop struggling or you’ll get hurt.”</p><p>Rory gazed up into those green eyes, mesmerized by them. He stopped moving immediately and stood still, trembling all over, his cock throbbing.</p><p>“Good boy. Now kiss me.”</p><p>Rory had to stand on tiptoe to reach his lips, and Casey didn’t bend an inch. Kissing Casey while he held his balls in a firm grip was definitely a different experience. He felt controlled and humiliated, but excited too, and his damn, traitorous dick got even harder.</p><p>Casey didn’t kiss him back, just stood there while Rory pressed a chaste little kiss to his lips.</p><p>“You call that a kiss? I said, kiss me.”</p> <p>Rory sighed and stood on tiptoe again, putting both arms around Casey’s neck and pressing his lips firmly against Casey’s. He tried his best to part Casey’s lips with his tongue and nearly despaired before Casey relaxed the tension around his mouth and allowed him access. Rory swept his tongue over his lips and the inside of his mouth, ending with a little lick and a nibble on his lips. That wonderful smell of Casey’s overpowered him again, and his knees sagged a little. Casey relented and put his free arm around Rory’s waist, holding him up.</p><p>Casey broke the kiss, and when it was over, Rory slumped, trying to bury his nose in Casey’s neck.</p><p>“No more dancing with other boys, you understand? Or girls either.”</p><p>“Okay.”</p><p>Casey gave his balls a little harder squeeze. “Yes, sir.”</p><p>“Yes, sir,” Rory whispered, another little thrill shooting through him.</p><p>“Now you’re coming with me to my room.”</p><p>“No!” The idea of leaving with Casey scared Rory to death. He knew exactly what would happen if he went to Casey’s room. The possible repercussions were too scary to deal with. Flirting and kissing were one thing, even Casey visiting him in his room, but to totally surrender to him was quite another. Even though Casey’s aggressiveness gave him a thrill, something deep inside Rory warned that to surrender to him would mean the end of his life as he knew it. He had to be certain he could live with the results before he made that commitment. He wasn’t quite ready to give himself over to someone else like that. He didn’t know if he could do it, and he didn’t trust Casey enough.</p> <p>Casey still held his balls, so he dropped straight down, tearing himself away. Surprised, Casey stepped back to help him up. Rory head butted him and staggered to his feet. He ran back inside as quickly as he could, not daring to look back to see if Casey was coming after him. He practically ran over to the buffet table, to try to lose himself in the crowd of people hovering around the table. After a few minutes of standing around, filling a plate with desserts he didn’t even want, and listening to the inane chatter around him, his pulse returned to almost normal.</p><p>“Well, did you get that out of your system?” Nicky’s voice was at his elbow, sounding amused.</p><p>“Leave me alone, Nicky. I need to get out of here. Casey’s beginning to get on my nerves.”</p><p>Nicky leaned closer. “That dominance thing is really more for role-playing in the bedroom, and if you keep pushing him away, he’s liable to really leave you alone. What would you do if you lost Casey?”</p><p>Rory glanced up at Nicky in surprise. The idea of Casey breaking off his pursuit had never even occurred to him. The feeling of something like panic at the thought stunned him. They were bloodmates. He glanced around behind him quickly and when he couldn’t locate Casey, butterflies went crazy in his belly again. He was beginning to really hate the stupid feeling.</p><p>“He came back in after you, but left when he saw you by the buffet table,” Nicky told him. “He didn’t look very happy, and...”</p><p>“And what?”</p><p>“He wasn’t alone. He grabbed one of the female pets standing near the door and took her along. He seemed pretty angry. If he were my mate, I’d go after him.”</p><p>Rory handed Nicky his plate. “Will you take care of this for me, Nicky? I think I have something I have to do.” He thrust the plate at Nicky without waiting for an answer and crossed hurriedly to the door. What the hell did Casey think he was doing? White hot jealousy gripped him as he went directly to Casey’s room. He said no one would ever touch him but Casey. Well the same thing went for him. He was not going to fuck any pet. He could only be seconds ahead of him, and Rory was determined to get rid of the girl, and have this out with Casey once and for all. His earlier feeling of panic was gone. Casey was only giving him a dose of his own medicine, but it worked. He was furious at the thought of his mate with anybody else.</p><p>He caught Casey at the door to his room, leading the young, pretty pet inside. Rory caught her by the arm, twisting her gently around to face him. Casey turned in surprise.</p><p>Unconsciously, he used almost the same words Casey had used on Chad earlier. “Go back to the common room. This wolf is playing games with you, and I need to talk to him.”</p><p>The girl looked up in confusion at Casey, who leaned against the door frame, a smile playing around his lips. Keeping his gaze on Rory, he spoke to her softly. “Go on, sweetheart. I do need to talk to Rory. Maybe I’ll come find you later.”</p><p>She dropped her head in disappointment and moved away down the corridor, glancing back over her shoulder at the two wolves standing close together in the doorway.</p><p>“So talk,” Casey said provocatively. “I thought you made it pretty clear you had no interest in me.”</p><p>“You know that’s not true. I’m confused, Casey, and you don’t help me when you boss me around and act so tough, or when you force your way into my room and practically force me to have oral sex with you.”</p><p>“I didn’t force you, baby. I specifically remember you participating more than willingly, so don’t play that shit with me. You’re a grown man, and you know what you want. I simply showed you how much you wanted me, but you’re too afraid to let it happen. I told you to come to me tonight, and now you have, so I think you want this as much as I do. Do you?”</p><p>He pulled Rory into his arms and took control of his mouth, hard at first, grinding against his lips and then easing off some, licking and nipping at him. Rory relaxed into him, loving his body next to his. Casey pulled his head back and looked down into Rory’s eyes.</p><p>“Do you want this, Rory? Be very sure, because there’s no going back.”</p><p>Rory took a deep breath, his shoulders slumping. “Yes, I want it. I’m tired of fighting it— tired of fighting you. I’m scared of losing myself, though, Casey. If I—submit to you—will you be there for me, help me keep myself? Will you do that?”</p><p>Casey hesitated a fraction of a second too long, and Rory felt the unease sweep back over him again. Even so, his desire and the singing in his blood wouldn’t let him back out. He loved Casey. Casey loved him. That was all that mattered. Together they could overcome any adjustments that needed to be made.</p><p>“Sure I will,” Casey said confidently, smoothly.</p><p>Casey stood back, letting Rory go in first. Rory’s gaze fell on the bed, and his throat tightened up a little. He was determined to see this thing through, though, and he turned to face Casey. Casey, who’d been staring at him warily, got a look of grudging respect on his face. He began to unbutton his shirt.</p><p>“Maybe you should get out of those clothes, honey.”</p><p>Rory nodded and pulled them off. Once he’d decided to go through with this, he was anxious to begin, anxious to be mated with this big, beautiful wolf, and to see finally what would happen next. His biggest fear had been submitting himself to another wolf’s dominance and power, fear that he would somehow not be a real wolf anymore, but some kind of hybrid pet. If that was to be his fate, he’d have to embrace it. This crazy blood match had left him no easy choice, and he was tired of running from his fate in fear of the unknown. Casey’s blood sang to his and that was really all that mattered in the end. Love had to be all that mattered.</p><p>He realized Casey would be dominant, had known from the beginning, but he also knew what Nicky said was true. Casey would belong to him every bit as much as he would belong to Casey. Rory didn’t think Casey knew it yet, and it might be fun to teach him.</p><p>When he’d stripped off his clothing, he waited for Casey to tell him what to do next. Casey was in charge for now, and Rory knew he loved every minute of it. Casey was gloriously naked, and for the first time, Rory saw Casey totally bare. He was big all over, that was for sure, and his erect cock was lovely, thick, and dark skinned, rising up out of curly dark hair and curving back toward his stomach. A dark blue vein throbbed down its length, and Rory thought he might want to explore that vein with his tongue. A graceful ridge curved at the tip and unable to stop himself, Rory bent over to sweep his tongue over the ridge. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Casey gasped and gripped Rory by the shoulders, pushing him to his knees in front of him. Rory didn’t have any experience, but he knew instinctively what to do. He spent several minutes just kissing Casey’s dick and fondling his heavy balls, spending some time kneading them with his hands and rubbing lightly with his fingernails. With long, slow sweeps of his tongue, he covered the length of Casey’s shaft before coming to a stop at the tip, lavishing attention on it with kisses and little licks. Casey’s hands fisted in his hair and his legs trembled, though he hadn’t made a sound. Rory wanted badly to make him cry out as he had for him. He put his mouth down over the entire shaft, swallowing and sucking at it until it hit the back of his throat. He didn’t gag though, and moved his mouth up and down the length slowly and sensuously, not quite deep-throating it, ending each journey back to the top with a swirling kiss, until Casey cried out, his hips pumped to fuck Rory’s mouth.</p><p>“Oh God, Rory!”</p><p>Rory smiled. He’d made him call out his name after all. Rory turned back to his ministrations, but was suddenly hauled up off the floor and tossed on his back on the bed. Casey’s voice was hoarse with emotion when he spoke to him.</p><p>“Turn over, baby. Get up on your hands and knees.”</p><p>Rory took a deep breath and then did as he was told, looking nervously back over his shoulder at the big wolf. Casey took a tube of lube out of a bedside drawer, but he caught the look from Rory and smiled.</p><p>“Don’t be scared, baby. I don’t want to hurt you. I’ll take it as slow as I can.”</p><p>Casey knelt behind him and caressed his ass, rubbing his cheeks in little concentric circles, massaging ever closer to his goal. Rory tried his best to relax, bracing himself for the cold lube on Casey’s fingers. Instead, Casey spread his cheeks with the palms of his hands, and his soft lips kissed him there on his tight, puckered little hole. He gasped in surprise and flinched away, but Casey hooked a strong arm around his hips, holding him in place.</p><p>“Relax, sweetheart. Let me love you.” He sucked, licked, even nipped him a little.</p><p>Rory responded with deep groans of pleasure, his arms refusing to hold him up any longer. Falling, his head rested on the pillows, his ass still high in the air. Casey pushed several pillows under his stomach so he could lie down, relaxing further and still have his ass elevated.</p><p>A finger slick with lube, probed his tight virgin hole, sliding in and out in rhythm, deeper with each drive inside Rory. Stretching, rubbing, a second and then a third finger penetrated, keeping a slow rhythm until Rory thought he’d go mad from the sensations. At the same time, Casey’s other hand, slipped under him to caress his cock and rub his balls, his hands seeming to be everywhere at once. Rory shoved back his hips for more, unable to be still any longer.</p><p>“Don’t move until I tell you, honey. You could hurt yourself.” Casey slapped his ass, not hard, but enough to let him know he wasn’t in charge of any of this, and Rory struggled to hold still. Casey’s hands in his hair pulled his head around, forcing him to look at him over his shoulder. “I want you to see me fuck you, baby. I want you to know you belong to me.”</p><p>Rory whimpered in need, pushing back when Casey rubbed the wet head of his cock at his stretched hole. Casey pushed his cock in past the ridge Rory had lavished attention on such a short time ago through the tight ring of muscles at Rory’s entrance. It burned, and Rory held his breath against the pain.</p><p>“Shhh, baby. I know it hurts at first. Just try to relax. Push out a little, like you’re bearing down, open up for me. That’s it, sweetheart.” Casey eased deeper inside an inch at time, holding still, letting Rory adjust by degrees to being stretched and filled. Buried all but a few inches to his balls, Casey waited again for Rory to relax, then pulled nearly out and drove into him, hard, fast, and deep.</p><p>Rory cried out, his body flailing to escape the impalement. Casey held him down, one hand planted in the middle of his back, and drove in again, touching something inside Rory with each new thrust to turn pain into an aching pleasure. An underlying groan escaped his lips as Casey thrust at him. With drive after drive following, Rory heard himself making hard, breathy sounds he’d never heard himself make before. Casey’s cock repeatedly touched the spot deep within him he didn’t even know he had, feeling so damn good he thought he might die from the pleasure. Casey still had one hand in his hair, and Rory looked at him, holding his gaze. He whimpered, and Casey stilled for a moment, still throbbing deep inside him, out of breath, his eyes dark with need.</p><p>“Are-are you okay, baby? Am I hurting you?” Rory shook his head, but Casey gentled his movements and leaned over to kiss the back of Rory’s neck. “I love you, sweetheart,” he whispered.</p><p>Rory whispered back, “I love you too.”</p><p>Casey moved again a little faster, until he seemed to get swept away and thrust harder and harder. As he hit that sweet spot inside Rory with each ram of his cock, Rory’s climax built closer until he cried out against the intensity of the dam breaking, cum spurting from his cock onto the bed. Casey came at the same time, his hips ramming and holding for each pump from his sack.</p><p>As the waves of pleasure washing through him stilled, he went limp all over. Casey, incredibly, was still hard inside him. He slipped a finger in alongside his cock, pushing against Rory harder, pulling with his finger to stretch Rory open even more, forcing in the knot, the ring of flesh around the base of his cock that all wolves have.</p><p>“You’re hurting me,” Rory murmured, thinking all he had to do was tell Casey and Casey would stop, but he didn’t. He held Rory to the bed with his chest and forced a second finger in on the opposite side of his cock. Rory struggled, trying to get away, but Casey’s weight held him down, pulling his asshole up and out, pushing with his hips to work the knot in.</p><p>“You’re tearing me.”</p><p>“Hush, baby. It’s not tearing you. You can stretch to hold it. I know it hurts, but it’ll feel good in a little while. Try to push out and back against me—that’s it.”</p><p>“You’re ripping me open,” Rory cried with a sob, arms and legs flailing in a hopeless attempt to break free. “Stop.”</p> <p>“It’s not ripping, baby, and I can’t. I can’t stop.” Casey panted, driven by instincts of centuries and hormones gone wild.</p><p>He braced his feet on the bed, got two more fingers inside.</p><p>Rory wept and pleaded. “Stop, Casey, please, please.”</p><p>“I’m sorry. I can’t stop. I have to do this. I have to.” He pulled out on the ring of tender flesh and rammed with the power of his legs at the same time, forcing the large knot of flesh inside, past the tight ring of muscles at his entrance which clamped tight behind it as soon as Casey pulled his fingers free.</p><p>Rory screamed. Impaled and totally helpless, painfully stretched and feeling as if his insides were crushed, Rory gasped out each breath. Even that little movement made the large gland wedged deep inside his body slide firmly against his prostate, setting off a second orgasm.</p><p>While Rory’s body convulsed and he wept, Casey’s canine teeth, extended the instant the knot was successfully buried, bit deep into the back of Rory’s neck, sinking into his flesh with the mating bite.</p><p>The orgasm magnified. The intense pleasure coming from the bite coursing through Rory’s blood intensified his orgasm until he thought his entire body was ripping apart. His back arched as he pushed up with his arms, driving his neck into the bite, wanting to never let go. One orgasm faded away. Another began, rolling waves of bliss that seemed to go on forever his body caught in spasms of ecstasy, and he clawed at the bed under him.</p><p>Casey, still covering him with his body to hold him down, still buried inside him, caught his wrists with his hands, soothing him, crooning loving words.</p><p>“I’m sorry, baby. I couldn’t stop. We had to finish.”</p><p>After what seemed like forever, the orgasm tapered off, and Rory slumped on the pillows, not knowing if he’d be able to survive another one. “It hurts, Casey.”</p><p>Casey’s dick and knot was still firmly lodged in his ass, and no amount of pulling or struggling would remove him. Struggling only made it worse, rubbing his prostate until incredibly, another orgasm came on.</p><p>Panicking, he screamed, and his scream turned into a howl as his body tried to shift. Helpless to prevent it, he sagged onto the bed, afraid suddenly of what his wolf would do to Casey when it emerged. He could tell it tried, and fought hard, but his wolf was trapped inside. Casey’s gland pulsated inside him, secreting fluid that seeped out of his ass, dripped to his balls and soaked the bed, mixing with the cum of his multiple orgasms. He yelled out in rage and pain as his wolf retreated deep inside him, crying and whimpering in agony.</p><p>The mating was killing his wolf. Rory could feel it dying. He struggled desperately to get away, to pull the knot and cock out of his body. He only succeeded in bringing on another orgasm, ripping into him and twisting every muscle in his body. Milked dry and spent, he no longer spurted cum. His wolf surged one last time, trying to come out to protect him, but it fell back, defeated, vanquished, and crying helplessly. Rory wept in grief and helpless rage, as his wolf retreated deep down inside him, and he tried to howl his pain. It came out as an impotent cry.</p><p>“Please, Casey, please release me. My wolf.”</p><p>“No, baby.” He heard Casey’s satisfaction in his ear. “I couldn’t even if I wanted to, and I don’t. No more murdering little wolf for you. That’s over. You belong to me now, pet.”</p><p>Murdering wolf? What could he mean? Rory slumped in despair and felt the edges of darkness grow closer together, overwhelming him and pulling him under when yet another orgasm shook his body.</p><p>Reeling in and out of consciousness, Rory suffered from lethargy and weakness he’d never known before and was barely aware of the fact Casey was no longer tied to him. He tried to raise his head from the pillow, but it fell back weakly. Something pressed against his lips, and he opened his eyes to see Casey, pushing his bleeding wrist against his mouth. Why was Casey feeding him his blood? He tried to turn his head away, but Casey wouldn’t let him, gripping his hair and forcing his head still. “Final step of the mating, baby. Drink. You need my blood.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rory drank, swept with a desire to do anything to please him. His blood tasted so delicious, he slurped greedily at it, closed his eyes, and sucked it down until Casey stopped him by inserting a finger into his mouth and breaking the suction. Rory sucked at his finger then, only stopping when Casey pulled it away with a little plop.</p><p>“Enough for now, baby. You’ll make yourself sick.”</p><p>Casey sat back on his heels, looking down at him. He was still naked, and Rory reached for his beautiful cock, driving to hold it in his hands and guide it inside him. Casey pushed his hands away, smiling. “You’re in heat, darlin’. It won’t last too long, but until it’s over, you’ll be dizzy and disoriented—and pretty horny. I can’t fuck you too much, or I’ll make you too weak. How do you feel?” He gazed down at him closely, looking for signs of distress.</p> <p>“I-I feel...tired. Weak. I want you, though. Fuck me, Casey, make love to me. Please, Casey.”</p><p>“I will, baby, after you’ve rested. You’re not yourself right now. You need to sleep some, and I’ll hold you while you sleep. We need to make love again soon to get you through the heat, but just not right now. It will soothe you some when we can do it again. Do you trust me to take care of you?”</p><p>“Oh yes,” Rory said, reaching for him again. “I trust you, darling. I love you so much.”</p><p>“I love you too, baby. You’re mine now. You know that, don’t you?”</p><p>“Mmm-hmm. Come and hold me, Casey. I need you.”</p> <p>Casey looked almost conflicted as he gazed down at him, but as Rory reached for him, he lay down beside him and gathered him closely in his arms, Casey’s lips on the top of his head. Rory scooted his ass back into Casey’s groin and pulled his arm tightly around him. Damn his ass hurt and his insides ached, but he still squirmed and twisted, seeking to drive Casey’s cock deep inside him. He drifted off, soothed with Casey fondling his balls and kissing his neck.</p><p>Chapter Three</p><p>Casey awoke to an insistent knocking on the door. Exhausted, having been up half the night making love to Rory, holding and fondling him, it took him a minute to come fully awake and realize what was going on.</p><p>“Open the door, Casey. It’s Marco.” He sat up, rubbing the sleep from his eyes, and pulled away from Rory. The knocking came again, harder this time. “Casey! I know you’re in there. Open the door!”</p><p>“Okay, okay,” he said irritably and got out of bed, picking up his jeans from the floor and pulling them on before going to open the door.</p><p>Marco stood there with his hands shoved in his pockets. “Is Rory in there with you?”</p> <p>Casey stood so his body blocked the door. “Yeah, he’s in here.”</p><p>Marco nodded tersely. “I know you mated with him. Everyone in the compound does. Is he —is he okay?”</p><p>“Of course he’s okay. What did you think?”</p><p>Marco looked up sharply at the tone, but Casey held his ground. Maybe it was time to let Marco know who he really was. Casey was an alpha too, and it had been hard taking orders all these weeks.</p><p>“You know what I mean, Casey. He was worried about what would happen if he mated with you.”</p><p>“I know, and he was right to be worried. I think his wolf is dead. Rory’s changed now.”</p><p>“What?” Marco looked shocked. “What do you mean he’s changed? What happened? What did you do to him?”</p><p>“I didn’t do anything but mate with him. He tried to shift while we were tied up, after I’d given him the mating bite. It didn’t work, and he tried again. It retreated deep inside him and finally—died, I think. Anyway, it’s gone, but I didn’t do anything but mate with him.”</p> <p>Marco shook his head sadly. “He’ll be devastated.”</p><p>“It’s for the best. His wolf made him a murderer, and I’m glad that little son-of-a-bitch is dead.”</p><p>Stunned, Marco exclaimed, “What are you talking about? How can you say such a thing?”</p><p>“Because it’s true! You asked me yesterday how I came to be with Shawna’s pack. Well, it’s time you know the truth. I was never with Shawna’s pack, not really. I used them to get inside this compound. I’m Alpha of the Sapphire Valley Wolf Pack. My brother was the man Rory killed last year.”</p><p>“Your brother! Your brother was the man who kidnapped Nicky?”</p><p>“Yes. He was wrong in what he did, I admit, but he didn’t deserve to die like that. Your people—Rory—killed him and left him on the side of the trail like garbage. Did you really expect he wouldn’t be avenged by his family?”</p><p>“Your brother kidnapped and would have raped my mate if we hadn’t caught him, and he was going to kill him!”</p><p>“Says who? You have no proof of anything more than he took him. The truth is your mate wasn’t harmed, not really, and you never waited to ask questions or talk to my brother. Rory attacked him before he could shift. He never had a chance, and you stood by and let it happen.”</p><p>The two alphas stood and glared at each other for a long moment, both of their wolves close to the surface. They might even have shifted and fought it out right there in the hallway, except for a voice calling out behind them.</p><p>“Marco! Casey! What are you doing?” Nicky ran up beside Marco, and Marco instinctively pushed Nicky behind him, but he wouldn’t stay put. “Stop it right now, both of you.” Nicky put a hand on both their chests, holding them apart. Casey was so shocked at the sensation of Nicky’s warm hand on his chest he jumped back out of the way. Nicky belonged to Marco, and universal pack law forbade him to touch another wolf’s mate or be touched by one unless they were family. It was one of the oldest laws. The thought that Aaron had broken that law when he took Nicky flashed through Casey’s mind. He ignored it, watching Marco pull Nicky roughly back from him, giving Casey a vicious look, even though it hadn’t been his fault.</p><p>“Nicky, get out of here and let me deal with him.”</p><p>“You can’t, Marco. Think of Rory. They’re mated now.”</p><p>The reminder made Marco back off a step, but the hatred and anger were still there.</p><p>Nicky worked to smooth the explosive situation. “I could hear the two of you yelling all the way outside, and so could half the compound.” Nicky turned to Casey and spoke gently to him. “Casey, can I please see Rory? I know he’s your mate now, but I just want to see him. I promise I won’t get him upset.”</p><p>Casey bit his lip in indecision, but Nicky stretched out a hand to him in supplication, careful not to touch him again. “Please, Casey.”</p><p>“All right. But just you—not him!”</p><p>Nicky pushed back against Marco’s chest when he growled and would have charged Casey again and smiled up at Casey. “Thank you, Casey. Marco, please wait for me right here while I go check on him, okay? Please, darling.”</p><p>Casey stepped back to allow Nicky inside. Nicky blew Marco a kiss as the door closed firmly in his face. He crossed over to the bed. Even sound asleep, Rory’s hands grasped for Casey, and he moaned his name.</p><p>“God, he’s pretty bad, isn’t he?” Nicky bent over and laid a hand on his forehead. “He’s burning up, Casey. Are you sure he’s okay?”</p><p>“I think so,” he said worriedly, putting a hand on Rory’s head and smoothing back his hair. “It’s not like I have a lot of experience in this either, you know. He woke up a little while ago, and he said he felt all right—just dizzy and tired.”</p><p>“Yes, I remember I felt that way, too, after I fed. If he’s not out of this before tonight, you might call the doctor.”</p><p>“I’ll think about it.”</p><p>“I heard you and Marco shouting as I came inside. You said his wolf—died—inside him?” “Yeah, I’m pretty sure. That’s what it felt like.”</p><p>“That may be why he has such a fever. The doctor—”</p><p>“I said I’d think about it.”</p><p>Nicky nodded, not pushing anymore. “So his wolf really might be dead. Poor Rory.”</p><p>“You don’t have to feel sorry for him. He’s fine. He’s perfect now that murdering wolf of his is gone. I’ll take care of him. He’s mine and under my control.”</p><p>“Nicky, get back out here!” A loud banging sounded on the door, and Marco’s voice came through, sounding anxious.</p><p>Nicky shrugged and grinned. “My master’s voice.” Turning serious, he said, “Now that you have a mate maybe you’ll understand better how Marco felt when your brother took me and why Rory did what he did.” He walked over to the door and opened it, stepping out and into Marco’s arms.</p><p>Casey was momentarily stunned at the idea of someone taking Rory like Aaron took Nicky, but he quickly put that disloyal thought out of his mind and refused to listen. He stepped out behind Nicky. “We’ll be leaving as soon as he’s able to travel,” Casey said, glaring at Marco.</p><p>“Where are you taking him?” Marco demanded.</p><p>“Back to my pack. They’ve been without my guidance long enough.”</p><p>“You can’t take him away from the only home he’s ever known.”</p><p>“He’s mine now. He belongs with me in my home just like your mate does with you,” he said pointedly.</p><p>“I can’t kill you for what you’ve done, but I can stop you from taking your revenge out on Rory. You aren’t going to hurt him.”</p><p>Casey looked at him with disgust. “He’s mine, and I’ll do what I want to him. That’s all you need to know.”</p><p>“Watch your mouth, asshole! You’re on my turf now!” Marco bristled visibly and acted like he would have attacked if Nicky hadn’t stood between them. He settled for pointing a finger in Casey’s face. “You won’t leave here with him. Is that clear? If you try, I’ll stop you!”</p><p>“You can’t keep me here against my will! My pack will attack you.”</p><p>“Yeah, well, bring it! You’re free to go any time you want to—Rory is not going anywhere!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He’s my mate. I won’t leave without him.”</p><p>“Then you got a problem, don’t you?”</p><p>The two alphas glared at each other, neither willing to give an inch.</p> <p>Casey stood for a long moment with his fists clenched before turning and going back into the room with Rory, slamming the door in Marco’s face. Rory was still sound asleep. He slipped off his jeans and got into bed beside him, wrapping his arms around his waist and pulling his hot body up close to him. He kissed the side of his neck and trailed kisses down to his shoulder, giving it a little nip. Casey thought he’d never be able to get enough of him. He put his hand over Rory’s smooth penis, fingering the base, stunned by the lack of Rory’s knot. It dissolved, was absorbed into his body, or something when they mated, or maybe when his wolf died. Either way his penis was no longer wolfish in shape, but like a human’s or a pet’s.</p><p>Mine, he thought possessively, stroking it tenderly. Rory moaned in his sleep. He thought about his words the night before and how prophetic they had been. No more wolf for you, baby. That’s your punishment, sweetheart. He smiled to himself. Now I’ve seen to it you’ll never shift again.</p><p>He meant what he’d said to Marco. He was glad Rory’s wolf, the bestial, murderous part of him, was gone. Rory was different now, and his life would be changed forever. He loved Rory— he couldn’t deny that. But he owed his brother some measure of revenge, and he had to see this through and not be weakened by his feelings for Rory. The first steps had been taken. Now he had to stay the course. Rory was no longer a wolf, but a pet, and his mate. Casey’s natural dominant nature thrilled to the idea. He hadn’t been able to kill Rory, but he’d killed the wolf, and Rory belonged to him. Body and soul. Maybe he hadn’t been honest with Rory and told him who he really was, but he hadn’t lied when he said he’d take care of him.</p><p>Nicky stared out the window at the coming storm. The clouds were gathering over the mountain, piling up on top of each other and competing to see which one could turn the darkest blue. The sky was taking on the strange, almost greenish hue that sometimes comes before a bad storm, and electricity seemed to crackle in the air. Marco tugged on his back pocket and pulled him down into his lap.</p><p>“Don’t stand by the window—we’re about to have a lightning storm.” Nicky put his head down on Marco’s shoulder. “What’s the matter, baby?” Marco said softly. “Is it Rory?”</p> <p>“Yes,” he said with a sigh. “I kind of miss him already.”</p><p>Marco tightened his lips. “He’s not gone anywhere yet. I’ve given orders not to let them leave until I say so.”</p><p>“You can’t keep them here forever if Casey wants to leave.”</p><p>“Watch me.”</p><p>“Oh, Marco, be serious. You never given much thought to the family I left behind when I became werekin. You only knew you had to have me, and I belonged with you. Rory’s his mate now, and he gave himself to Casey willingly.”</p><p>“Under false pretenses. Casey didn’t tell him who he really was or what his intentions were.”</p> <p>“He tried so hard to avoid this situation, and we kept telling him he had to face it. Now look what’s happened.”</p><p>Marco put a hand to Nicky’s cheek. “It was a blood match, baby. I just wish I’d discovered who he was before they mated. Rory would have had all the information at least and could have decided if he wanted to stay away from him.”</p><p>“He still can if he has the strength to.”</p><p>“I don’t think he’s that strong. It took everything I had to stay away from you as long as I did. I couldn’t have kept it up much longer.”</p><p>Nicky gave him a kiss and stood to pace around the room. “I need to talk to Casey again. I have to tell him about his brother.”</p><p>“I think you need to stay out of this and let me handle it.”</p><p>“I’m involved in this too, Marco. I’m the one his brother kidnapped, you know. I know what he told me and I saw his face. I know what he was planning to do to me, and if Casey understands that, he’ll understand why Rory attacked him.”</p><p>Marco blew out a strong breath. “Yes, but he didn’t actually do more than kidnap you, Nicky. Casey was right. I never should have allowed Rory to attack him like that. I was just so damned enraged when he took you in the first place and then held the knife to your throat. I wanted to jump him myself, I guess. When Rory charged in, I should have stopped him. I knew he was young and inexperienced and in poor control of his wolf. It was my fault just as much as Rory’s.”</p> <p>Marco dropped his head into his hands, and Nicky quickly went to him, putting his hands on his shoulders, kneading them. “Well, we can play the blame game all day, but it won’t help, sweetheart.</p><p>“I know. This is the last damn thing I needed. I’m worried about this Hunter situation. We got word yesterday they’re moving this way. Some of their scouts may already be in our area.”</p><p>“Is there anything we can do for Rory?” Nicky asked softly.</p><p>“I don’t know. I’ll speak to some of the elders and look through some of the old books, but I doubt I’ll find anything about this kind of situation. I’ve never known of a blood match between wolves, but wolves must have bred with wolves in the early years. Casey said he sensed Rory’s wolf was gone, so we just have to accept the idea. My issue is with Rory’s state of mind. Can he accept this change? Can he accept the fact that Casey lied to him and wants to control him? You know how difficult it was for you and you weren’t a wolf or even used to our ways.”</p><p>“And Casey isn’t doing it because of traditions. He’s doing it to hurt him.”</p><p>“I don’t trust Casey not to physically abuse him, either. He wants to punish Rory for his brother’s death. If he does, I swear I’ll...”</p><p>“Casey loves him. I know he does, and he was worried about him too. Besides Casey said Rory’s wolf is dead and the part of Rory he hates is gone. Once he fully realizes that, maybe there won’t even be an issue. We have to give them time to work this out. Give Casey time to realize love is more important than revenge. In the meantime, is there anything you can do to keep them here without totally going to war with him?”</p><p>“I have something in mind, but it depends on Casey and how willing he is to cooperate. He blames me as much as he does Rory.”</p><p>“He likes me though,” Nicky teased, batting his eyelashes to lighten the mood.</p><p>Marco smiled. “Everybody likes you, baby.”</p><p>“Really? Everybody? So can I be the one to talk to Casey, Marco? You tell me what you have in mind and let me try to sell him on it.”</p><p>Marco pulled him into his lap. “Hmm. And how exactly did you plan to ‘sell him’ on it, Nicky?”</p><p>“I’m not sure. What do you think I should I do to win him over? Do you think I should flirt with him a bit? I don’t really like boys except for you, sweetheart, but Casey is very good looking. Sexy too. I could make an exception I guess, just this once.”</p><p>A hard swat on his backside got Nicky’s attention. “Ow! What was that for? I was just asking your opinion.”</p><p>“And I was giving it to you. You don’t flirt with anyone but me, Nicky. You got that?” He ran his hands over Nicky’s gorgeous body. “This is all mine, baby, and don’t you ever forget it. As a matter of fact, maybe I should give you a little refresher course on just how much you belong to me.”</p><p>“Mmm...my memory has been bad lately. Maybe a little memory jog would be good for me. Tell me again what I need to know.”</p><p>Marco was so busy stripping off Nicky’s pants, he didn’t answer. Once he had him naked, he picked him up and settled him on his lap, straddling and facing him. He traced Nicky’s muscled abs with his tongue.</p><p>“Oh God,” Nicky whispered when Marco’s tongue flicked over his nipple.</p><p>Marco licked down toward his navel. He slid out of the chair, never losing his grip on his mate and laid Nicky on his back on the carpeted floor. Wrapping his hand around Nicky’s cock, he held it out of the way so he could tease Nicky around the base with his tongue and teeth. Nicky wiggled his hips, trying to get Marco to tighten his grip or move or do something more. Marco nipped the sensitive area between his groin and his thigh, and Nicky yelped.</p><p>“Be still.”</p><p>Hearing something in Marco’s tone he hadn’t expected, Nicky held himself rigid, watching Marco closely as he licked up the shaft of his cock to reach the slit in his cockhead. He stuck his tongue inside the slit, and Nicky bucked his hips and moaned loudly. Marco’s finger penetrated his ass, searching for and finding his prostate. He pressed on it, and Nicky almost lost it, but just as he was about to come, Marco removed his finger, leaving him moaning in frustration. Marco was deliberately teasing him.</p><p>Marco took Nicky’s pre-cum to lubricate them both, Nicky raised his knees to his shoulders, making it easier, and Marco plunged his cock into Nicky’s ass. Nicky moaned his pleasure as Marco thrust gently into him, again and again, using his hands to stroke along his sides. The head of Marco’s dick stroked Nicky’s prostate, teasing and torturing him.</p><p>“Make yourself come for me, baby. Put your hands on yourself and make yourself come.”</p><p>Nicky opened his eyes and whimpered a little, but Marco was firm. “Do it now, Nicky, while I watch you.”</p><p>Nicky kept his eyes on Marco’s as he slowly hooked his legs over Marco’s broad shoulders and took his hard cock in hand. He pulled at it and at the same time Marco shifted his position.</p><p>“You need a lesson as well as a reminder, Nicky.”</p><p>In that instant Nicky realized what he’d sensed in Marco’s actions. He had broken a pack law in touching a male who was not family. Marco was going to show him how much he belonged exclusively to him. Only on rare occasions did Marco impale him with his knot. Pain and pleasure awaited. Excited, knowing what was coming, Nicky pushed out hard, opening the ring of muscle clinging to Marco’s cock. Marco put the strength of his legs and hips into the thrust, and the hard gland knot shot in, like having a small baseball shoved up his ass. Nicky yelped in pain. He could swear the knot grew just as his cock grew in his hands. Marco’s hips flexed, grinding his knot against Nicky’s prostate. Nicky stroked himself as he’d been ordered to do, his hands and body jerking wildly. Marco watched his face, breathing hard, matching his strokes to Nicky’s. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Bite me, Marco,” he screamed.</p><p>Nicky’s orgasm seared its way through his body and as he began to spurt, he gave in to mindless pleasure, coming so hard when Marco’s love bite clamped down on his throat he almost blacked out, and the room went dim around him. When Marco climaxed, seconds later, Nicky was hardly even aware of it for the waves of ecstasy shaking his body. When he came back to himself, Marco was kissing him all over his face and down his throat.</p><p>“Who do you belong to, baby?”</p> <p>“You and only you forever,” Nicky said dazedly, already drifting off to sleep. He raised one eyelid. “And what about you, Marco? Who do you belong to?”</p><p>Marco smiled. “You, darling. Always and forever.”</p><p>Nicky nodded, satisfied. “Good,” he said, and went contentedly back to sleep.</p><p>It was much later when Nicky rolled over and nuzzled Marco to wake him up. “We’re still on the floor, babe.”</p><p>“Mmm-hmm.”</p> <p>Nicky laughed and kissed him again. “So now that I’ve had my refresher course, can I go see Casey?”</p><p>Marco nodded, and Nicky leaned over for a kiss to seal the deal.</p><p>“So long as you’re not totally alone with him. Leave the door open, and don’t you dare touch him again. I have to protect my mate too, you know.” He pulled Nicky closer, smiling over Nicky’s little self-satisfied moans.</p><p>Nicky, of course, was thoroughly tempted to be bad, just to have to suffer his lesson again.</p><p>Rory woke up slowly, stretching like a cat. The bed was warm and cozy, and he could hear a storm raging outside the windows. He was a little sore and his backside was achy, but mostly he felt wonderful. He turned over to find Casey stretched on his back beside him, his arms thrown up over his head, and snoring gently with his mouth open. Smiling, he put a leg over Casey’s and snuggled up close to him before to putting a finger under his chin and closing his mouth. Casey snorted and jumped, only half awake. His arms flailed in the air and Rory pushed them down. He pulled Casey closer, patting him. “Settle down, baby, I’m right here.”</p><p>Coming more fully awake, Casey opened his eyes wider in surprise. “Rory!” “Hi, baby,” Rory smiled down at him.</p> <p>“Hi yourself. Are you...are you all right?” Casey looked closely at him.</p><p>“Of course I am. Why wouldn’t I be?”</p><p>“Uh...I don’t know. You’ve been kind of uh...in heat...for the past twenty-four hours or</p><p>so.”</p><p>“I have? In heat, huh? I don’t remember a thing about it. The last thing I remember was you</p><p>were making love to me. We’re mated now, right?”</p><p>“Oh yeah. Definitely mated. We were tied up for hours. You sure you don’t remember any</p><p>of it?”</p> <p>“No, not a thing. Well, I do kind of remember your knot and didn’t you feed me your blood</p><p>at one point?”</p><p>“Yes,” Casey said slowly. “Several times actually, trying to calm you. You were a little</p><p>upset.”</p><p>“About what?”</p><p>Casey sat up and pulled some pillows behind him before pulling Rory up to settle him</p><p>against his arm. “When we were making love...when you started to have the multiple orgasms</p><p>that the gland and bite bring on, you—you tried to shift.”</p><p>“I did?”</p><p>“Yeah, and you couldn’t. You tried a couple of times, and you weren’t able to. Look down</p><p>at yourself.” He pulled the sheet back to expose Rory’s re-shaped penis. Rory looked down at</p><p>himself for a moment seemingly without comprehension and then his eyebrows raised almost</p><p>comically, and he looked back up at Casey. “What the fuck?”</p><p>“Your knot—your gland is gone. Your penis is like a pet’s now or a human’s.” Rory looked at him, not understanding. “What?”</p><p>“I guess it happened when you tried to shift and couldn’t or maybe because it was two</p><p>wolves mating. I’m not sure, Rory, but your wolf is gone. I think it’s dead.”</p><p>“What?” Throwing back the covers, Rory jumped to his feet and ran into the bathroom to get</p><p>a look at himself in the mirror. He looked up in horror at Casey who was right on his heels.</p><p>“What did you do to me?”</p><p>Casey shrugged and shook his head. “I didn’t do anything. It just happened.” “Oh my God, Casey! What does this mean?” Even upset, Rory still stepped closer to Casey</p><p>to be comforted.</p><p>Casey put his arm around him. “I don’t know. Come back in here and sit down. We need to</p><p>talk about some things.”</p><p>Rory followed him back to the bedroom as if in a daze. He sat on the bed, and Casey sat</p><p>beside him. The time had come to announce his revenge.</p><p>“Do you remember almost a year ago when Nicky and another boy were kidnapped?” Rory nodded. “Yes, of course. The other boy was my little brother, Adam.” “Your brother?”</p><p>“Yes. They were both in my charge that day, and I-I fell asleep.”</p><p>“You fell asleep?” Casey looked at him in disbelief. This was the first time he’d ever heard</p><p>about Rory watching the two boys. To fall asleep when pets were in your charge was pretty</p><p>unforgiveable. If Rory had been attentive, he and Aaron would never have been able to get their</p><p>hands on the boys to start with. His brother would never have been killed. Rory would never</p><p>have become his enemy.</p><p>“Yeah. I know. Marco almost took my head off for that one, but nobody could have blamed</p><p>me more than I blamed myself.”</p><p>“Yeah, well the point is, Rory, the man who kidnapped your brother was me. And my</p><p>brother, Aaron, got Nicky.”</p><p>Rory stared at him uncomprehendingly. “I-I don’t understand. How can that be?” “I’m not who you think I am, Rory. I’m Alpha of the Sapphire Pack. Look, I’ve got to just</p><p>come out and say this. I came to this compound for one reason—to kill you.”</p><p>Rory tilted his head slightly. “K-kill me?”</p><p>“I didn’t know you, baby. I only knew your name, but you killed my brother, Rory. We have</p><p>to face the fact and find a way to move on. The man you attacked when you shifted was my</p><p>brother, Aaron. He never had a chance against you in your wolf form, and you had to know that.” Rory was silent, still staring at Casey, looking as if someone had kicked him in the head. “I-I</p><p>protected my alpha’s mate. He was holding a knife to Nicky’s throat.”</p><p>“Aaron told me he was going to negotiate with Marco. Wasn’t that what he was doing?” “He had a knife, Casey, at Nicky’s throat.”</p><p>“But he hadn’t hurt anybody.”</p><p>“That didn’t mean he wasn’t about to. I did what I thought I had to do.”</p><p>“Doesn’t make it right.”</p><p>Rory snapped out of his daze. “You’re going to talk to me about what’s right? The two of</p><p>you kidnapped my brother and Nicky.”</p><p>“Be quiet. Don’t argue with me! I’m trying to tell you I have these crazy mixed-up feelings</p><p>about you. I came here to kill you before I knew you were my bloodmate. I took a vow of vengeance against you. How in the hell am I going to reconcile that with wanting to fuck you</p><p>every time you come close to me.”</p><p>“Fuck me, not make love to me? So you’re saying you don’t love me.”</p><p>“No, damn it! I do love you. That’s what’s tearing me apart. Suppose I’d killed your little</p><p>brother that day. On purpose. How would you feel about me?”</p><p>Rory shook his head. “It’s a totally different situation. My little brother was an innocent pet,</p><p>kidnapped away from his home. Your brother was a wolf who deliberately put himself into that</p><p>situation.”</p><p>“He was still my brother, and he didn’t have to die like that!”</p><p>“Well, I guess I’d have to try to forgive you then if it were me. If I couldn’t, then I’d reject</p><p>you as my mate.”</p><p>“Not a chance,” Casey said angrily. “Stop trying to get away from me. No, I can’t let you</p><p>go, but you have to be punished. It’s the only thing I can do to stay loyal to my brother.” “Punished? I’m not your child, Casey. Or your prisoner.”</p><p>“That’s exactly what you are. You’ll do as I tell you to now, Rory. I’m in charge, and it’s</p><p>time you learned that and took your proper role in this relationship. Now be quiet and say yes sir</p><p>like a good pet.”</p><p>Rory stood up abruptly. “You go to hell!” He began to pace around the room still stark</p><p>naked.</p><p>Casey could see the anger in his face. He watched him carefully.</p><p>“Don’t tell me to be quiet, like I’m some kind of slave here. You tell me you’re an alpha</p><p>who came here to avenge your brother’s death, that you’re the man who kidnapped my brother,</p><p>and oh yeah, you came here to kill me. And I’m supposed to do what? Kneel down and present</p><p>my throat for you to rip out? Or just kneel down and kiss your ass? Or maybe give you mine?” “Shut up, Rory, I’m warning you.”</p><p>“Warning me? What’s your plan, Casey? Gonna kill me now?”</p><p>Casey lunged up, crossing the room, hand out toward Rory’s throat. “Shut up, Rory!” Rory knocked his hand away. “No! I won’t shut up. I’m leaving!” He turned looked for his</p><p>clothes, swaying a little. “Where are my clothes?”</p><p>Casey pointed. Rory went over to the chair and held up a pair of the traditional leather pants</p><p>worn by pets before the rules had been relaxed. “I’m not wearing these!”</p><p>“You can stay naked if you like. Suits me just fine.”</p><p>“You know what I mean! I won’t wear these to go out!”</p><p>“Who said you were going anywhere?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rory threw the pants down on the floor and stood with his arms folded across his chest.</p><p>Casey lunged up, pulled back his arm and dealt a hard blow to Rory’s butt. Whirling around and</p><p>holding both hands to his backside, he looked at Casey with horror.</p><p>“You hit me!”</p> <p>“I spanked your ass. I’ll put you over my knee and do it properly if you show your temper</p><p>again. Now get into those pants or don’t. Either way I don’t give a shit. But that’s all you’ll wear</p><p>from now on.”</p><p>Backing away, Rory shook his head. “No, Casey. I won’t do it!”</p><p>“Boy, you know and I know that I can make you. So put them on like a nice pet, or I’ll put</p> <p>you over my knee and spank you. Then I’ll put them on you myself.”</p><p>Rory, still in shock, glared at him, saying nothing.</p><p>Cody picked up a collar from the table. “Come here.” Casey crooked his finger at him.</p><p>“Next we’ll take a little trip downstairs to have some of that hair taken off your chest, legs, and</p><p>other places.”</p><p>Rory stared at the collar and shook his head.</p> <p>“Everyone is going to know your murdering wolf is gone and that you are my property, my</p><p>pet, doing only what I allow you to do.”</p><p>Rory’s face drained of all color. “God, you really hate me, don’t you?”</p><p>Casey tightened his lips, and he stared straight into Rory’s eyes. “You’re my mate, Rory. I</p><p>can’t hate you, damn it! And I couldn’t kill you if I wanted to. But humiliation—it won’t physically harm you, but it will hurt. I can do that much at least for my brother. From now on, you’ll submit to me totally. No more wolf for you. You’re a pet now—dress the part. Get used to</p><p>it!”</p><p>Rory shook his head in disbelief. “No. No, I won’t let you do this to me. If you do this, if</p><p>you try to humiliate me like this, I’ll end up despising you. Is that really what you want?” Casey gripped tight Rory’s arm. “Shut up, Rory, and take orders. You’re my property! My</p> <p>boy! You’ll do what I say, when I say. Is that understood?”</p><p>Rory glared at him. “Oh yeah, it’s understood. Now understand this. I may not be a shifter</p><p>anymore, but I’m still a wolf, lead gamma of the Dark Hollow Wolf Pack. You can beat me up,</p><p>’cause you’re bigger and stronger than I am. You can feed me your damn blood until I’m</p><p>drugged with it, and you can rape me if you want to. But it will be rape from now on, Casey,</p><p>make no mistake about it. I’ll never submit to you willingly again. I reject you as my mate. Do</p><p>you understand? I reject you! We’re through!”</p><p>Casey pushed him roughly onto the bed, ripped the blanket off, and fell on him. “Bullshit! I</p><p>won’t allow that. You’ll do as you’re told!”</p><p>Rory pushed back against his chest. “Oh no, I won’t!”</p><p>As they struggled, an insistent knocking made the door shudder in its frame, and Marco’s</p><p>voice rang out. “Rory, Casey, I know you’re in there. What’s going on? Let me speak to Rory.</p><p>Open the damned door!”</p><p>“Help me, Marco!” Rory’s voice called out before Casey could stop him. A bare second's</p><p>hesitation passed before the door burst open. Marco took one look at what was going on and</p><p>grabbed Casey from behind. Hauling him up and off Rory, he flung him across the room. Marco</p><p>turned and reached a hand out to Rory, but Casey jumped up off the floor and was on him. They</p><p>crashed around the room, their powerful, muscular bodies breaking up the furniture and making a</p><p>wreck of everything.</p><p>Chapter Four</p><p>Rory jumped off the bed and to his feet. “Stop! Please stop! You’ll kill each other!” The loud crashing and sounds of yelling soon drew others crowding into the room, trying to pull the two furious wolves apart. Rory grabbed the blanket from the bed to wrap around himself and fell back miserably on the bed. He shivered under his blanket, rocking back and forth, eyes tightly closed, waiting for it all to be over. His emotions were ripping him apart. Devastated by Casey’s betrayal and furious with him, he didn’t want to care about him, wanted him punished for what he’d done. At the same time he couldn’t help loving him and was terrified Casey would be hurt. Strong hands on his shoulders lifted him to his feet. He opened his eyes to see the kind face of Marco’s beta, Ian.</p><p>“Let’s get you out of here, son, until these two get it all worked out.” Ian pushed him gently from the room, and Rory glanced back over his shoulder to see a pile of bodies on the floor. Instinctively, he knew Casey was on the bottom, and he tried to turn and go back to him. Ian tugged him away.</p><p>“They won’t really hurt him. They’re only holding him down. He just needs to cool off, and so does Marco. Let that happen and you can see him later. C’mon, Rory, come with me.”</p><p>Rory allowed Ian to draw him away and down the hall, and he’d almost made it safely away when he heard the howl of a wolf. Bloodcurdling, and lonely and full of heartbreak, he knew it had to be Casey. The sound called Rory back as clearly as if it had been calling his name. Out of Rory’s throat came a weak answering howl, and his wolf stirred somewhere deep inside him. Ian steered him gently down the hall to his suite of rooms.</p><p>Ian must have known he wasn’t really cold—the shaking was no more than reaction to all that had happened in the last forty-eight hours or so. He sat Rory down on the sofa and made him a cup of hot chocolate. Rory tried to calm down and make sense of what was happening.</p><p>Ian sat quietly beside him on a sofa. The room was neat and orderly, like Ian, and had a restful quality to it. Ian’s wife had decorated the room not long before she died. Rory began to relax ever so slightly.</p><p>“How are you feeling, son? Any better?”</p><p>Rory nodded, still frowning. “I guess so. I’m worried sick about Casey though.”</p><p>“Do you want to see him?”</p><p>“No—yes.” Rory looked up, his eyes shining with tears. “No—hell, I don’t know. I’m so confused.”</p><p>“What are you confused about?”</p><p>“I love him so much—I can’t help it. To me, he’s the most handsome, most sexy man I’ve ever met. When he...when we...you know...I can’t get enough of him.” Rory blushed furiously, He’d been a virgin, and Casey had blown his mind with his lovemaking. “But if his blood would let him, he’d kill me. I don’t think he’ll ever feel any differently. All he really wants to do is hurt me. How can we have a life together? How can I live like that?”</p><p>Nothing seemed to rock Ian. He listened without looking shocked. Rory guessed as loud as they were yelling everyone already knew what was going on.</p><p>Ian said, “At least you love him, and it sounds like he has very strong feelings for you, even if he’s really mixed up right now.”</p><p>Rory set down his cup and leaned his head back on the sofa. “I thought so too, in the beginning, before he told me why he came here. He came here to k-kill me, because I killed his brother last year, the man who kidnapped my brother and Nicky. Finding out I was his bloodmate must have freaked him out.”</p><p>“Has he hurt you, Rory? Tell me the truth.”</p><p>“Not really. He did hit me.”</p><p>“He hit you?”</p><p>“Well, on the butt. He said it was a spanking, but he forgets how strong he is. It was only once. What really bothered me was what he said afterward. He said he wanted to humiliate me by making me wear the leather pants and collar pets wear so everybody would know I was not a wolf anymore, nothing but a weak pet with no mind of my own.”</p><p>“Why would he say you aren’t a wolf anymore?”</p><p>“It’s because of my...you know...my private parts. They look more like a human pet’s than a wolf’s.” When Ian still looked puzzled, Rory whispered, “No knot.”</p><p>“That may to be a result of a wolf mating a wolf, nature’s way of ensuring there is only one dominant when both are male. Since Casey is alpha and you’re gamma, it would naturally be him anyway.” He considered that for a moment longer before asking, “How do you feel about having Casey dominate you?”</p><p>Rory sighed and admitted, “In a way, I don’t really mind that part of it. I’ve never been as muscular and tall as the other wolves. After all, you’re right. He is an alpha. I’d owe him my obedience and allegiance anyway. When I was growing up, for a long time my parents thought I might be a pet. I never minded the idea, but when my wolf matured, I didn’t want to let Marco down. He’s really tried to help me.”</p><p>“Marco wants you to be happy, Rory. That’s all. You’ve got a strange idea about pets. There’s absolutely no shame involved in being one. They’re precious to us. We cherish our pets, and not because we just want someone to control. A wolf’s nature is to dominate. They’re like our other halves. Yin to our yang, I guess.”</p><p>“Yeah, I know that, but it’s a whole different mindset for me. I’ve always been wolf, and even if my knot is gone, I still feel wolf. I don’t know if I could be submissive, depending on him for everything, and I know I can’t be the way Casey says he’s going to force me to be. I can’t trust him either. He lied to me.” Tears welled up in his eyes again to embarrass him even though Ian ignored them.</p><p>“I think we wolves flatter ourselves with the notion our pets are totally dependent on us. My pet was the strongest, smartest woman I ever knew. She couldn’t shift, but she had me to do that for her. I worked for her, Rory, not the other way around. We’d be nothing but animals without them. They truly are our better halves.”</p><p>“But we discipline them and make them mind us and wear collars on their necks.”</p><p>Ian smiled gently. “You’re very young, Rory. Most of that is sex play. They allow us to do that, don’t you see? What are we going to do to them if they say no? We can’t hurt them—it goes totally against our nature. They could totally dominate us if they wanted to. No, they enjoy being taken care of and pampered, and in return they let us pretend we control them. Who goes out and works every day in the cold and rain while the other one stays at home and drinks coffee and reads magazines? Who’s really in charge? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not everyone likes it, obviously. The collar is no more than a mark of ownership they allow us to put on them. We’re very jealous of our pets, because we love them so much, and we need them so much. If they left us, we’d die. Wolves are dominants by nature, so we need submissives as our ideal partners. We complete each other, and the dominance is a part of that, but it’s not real, Rory. Do you understand?”</p><p>“Kind of, I guess. If it was just sex play like when he spanked me, I could stand it. I might even like it a little, but Casey wants to strip me of everything. He wants to punish me. He said so.”</p><p>Ian shrugged. “Maybe he does, a little. He has whole other issues with you. He’s trying to punish you because he blames you for his brother’s death. I think I need to speak to Casey to make sure of his intentions. It sounds like he might be confused himself. And you need to get the idea that being a submissive is shameful out of your head. Some of the strongest people I know are submissives. Look at Nicky.”</p> <p>“True.” Rory shrugged. “He really does run Marco, doesn’t he, but Marco lets him and allows him freedom to be himself.”</p><p>“Nicky lets Marco think he gives him freedoms. It’s all a kind of game, Rory. Nicky does whatever he pleases, and he and Marco both know it. It just took Nicky a little time to catch on.”</p><p>“That isn’t what Casey plans on.” Rory sighed and glanced up at the clock on the wall in worry. “Where’s Casey? I want to see him.”</p><p>“Are you sure that’s a good idea?”</p><p>“He’s my blood match. I think I have to be with him.”</p> <p>“No, Rory, you don’t have to be—not if you don’t want to be, or if the two of you can’t work things out. I know some of the others have said you can’t fight it, that you can’t live without him. It is possible to live without your true mate, even if it’s hard. Unfortunately, I know that for sure.”</p><p>Rory dropped his gaze, remembering how terribly the beta had grieved for his mate after she died. The entire pack had mourned along with him and had been upset by his inconsolable grief.</p><p>“I don’t know how you do it,” he said softly.</p><p>Ian shrugged. “You do what you have to do.”</p><p>“I don’t want to stay away from him.”</p><p>“Nicky did until Marco gave in and realized he had to make the changes. If you feel as strongly about the total submission, and Casey can’t accept that, you can too. If you and Casey can’t work it out, it doesn’t mean you have to be alone forever. You can love someone again—it may not be a blood match, but you can fall in love. Maybe even deeply in love.”</p> <p>Rory shook his head firmly. “There’s no one else like Casey. I still want him. I just don’t know if I can forgive him for wanting to deliberately hurt me, Ian. He doesn’t mean his dominance as any kind of love play. He means it to hurt me. He hates me.”</p><p>Rory couldn’t help it; his eyes filled with tears. Ian nodded. “All right. Let me see what I can do. If that’s true, you need to know it now, so you can walk away.” He went over to the phone, dialed a number and spoke softly into the receiver for a few moments. “Marco’s bringing him. Rory, are you sure about this? He hasn’t changed, you know. He’s the same Casey he was a little while ago.”</p><p>“I know. I still need to talk to him. I said some things I maybe shouldn’t have because I was so hurt and angry. Now that the shock’s over, maybe we can talk.”</p><p>“We’ve never had a pairing like this before, Rory—two wolves. We don’t know exactly what it means for the two of you even without the added issue of his vengeance for his brother. Do you think your wolf is really gone?”</p><p>“I did at first, but a while ago, when I heard Casey howl, I felt something. I wanted to shift and go to him. I don’t know if I could have or not. I think maybe if I needed to shift—to protect my mate or for some other really good reason—I think I might be able to.”</p><p>Ian patted his hand. “I heard your howl. For now though, I suggest you keep that to yourself.”</p><p>Marco opened the door and pushed Casey into the room in front of him. Casey’s hands were tied in front of him, and his face was flushed with anger. His eyes searched the room for Rory, and he seemed to relax a bit when he saw him sitting on the couch.</p><p>Rory got up immediately and went to stand by him, appealing to Marco. “Please, Marco, untie him.”</p> <p>“No, not until I find out exactly what’s going on. Sit down, both of you.” Marco shoved Casey, and Casey turned to snarl at him.</p><p>Rory took his arm. “Please, Casey. Sit down with me.”</p><p>Casey pulled away from Rory’s touch, but allowed him to sit beside him on the sofa. He was sullen and furious, his face bruised high on his cheekbone. He glared up at Marco. “When I get my hands free, we’ll finish this, Alpha.”</p><p>Marco laughed shortly. “You’re already finished. The only reason I haven’t thrown you in a jail cell already is because of Rory, and I still might.”</p><p>Ian came over to stand beside his alpha. “Rory says he hasn’t been abused. I’d like to talk to Casey about the way he’s seeing things, but not now, I think it’s best if everyone calms down tonight and gets some rest. We can talk in the morning.”</p><p>Marco hesitated, looking doubtful, perhaps still caught up in his anger. Ian put a hand on his shoulder. “Go on to your suite, Marco. You know Nicky will be dying to find out what’s going on.</p><p>Nicky was everybody’s favorite around the compound, because of his beauty, his quirky charm, and his courage in forcing Marco into making changes for all the pets. At the mention of his name, Marco seemed anxious to go, but he still hesitated in leaving Rory.</p><p>“What about sleeping arrangements for the night?”</p><p>“Rory belongs to me. He stays where I stay,” Casey stated in challenge and frowned at Marco belligerently.</p><p>“That’s not up to you, you son-of-a-bitch!” Marco took a step toward him, and Casey tried to get up off the couch but Rory pulled him back.</p><p>“I’ll stay with him, Marco. We need to talk.”</p><p>“They can stay here tonight in my other bedroom if that’s okay, Marco. You can post a guard outside if it will make you feel better about it.”</p><p>Marco nodded. “I will.” He looked at Rory. “Are you sure this is what you want? If you don’t want to stay with him, you can go to your own room or I’ll take you with me.”</p><p>Casey made a move as if to jump up off the couch again, but Rory put a restraining hand on his arm. “I’ll stay with Casey,” he said.</p><p>Marco nodded and left, casting Casey a warning look and closing the door firmly behind him.</p><p>“My other bedroom is through there,” Ian said, “along with the adjoining bathroom. Fresh towels are in the closet. If you need anything else, let me know.” He yawned behind his hand. “I’m going to bed, but make yourselves at home.” He bent over and untied Casey’s hands and smiling at both of them, turned to go to his bedroom.</p><p>Casey got up without another word and stalked off to the bedroom, not even looking back to see if Rory followed him. He threw himself on the bed and lay on his back, his chest heaving with emotion. Rory came hesitantly into the bedroom and stood in the doorway. Casey glanced over at him.</p><p>“Oh, you’re actually coming in here with me, huh? I’m surprised. I thought you rejected me as your mate. You said we were through.” His voice was angry and bitter.</p><p>“You hurt me, Casey. You meant to, and I-I was mad.”</p><p>“Yeah, well, no matter how mad I was, I’d never reject you.”</p><p>“You wouldn’t?” Casey came further into the room, easing the door closed behind him.</p><p>“No, and I wouldn’t call out for help to get away from you, or go off and leave you when you were being attacked by a bunch of big jerks either.”</p><p>“Did they hurt you?”</p><p>Casey made a dismissive sound with his lips. “Of course not.”</p><p>Rory perched on the bed next to him, ready to run if Casey made any threatening moves. He reached out to touch the bruise on Casey’s cheek, half thinking he would pull away, but Casey lay still and allowed him to rub his fingers gently over it. Rory was shocked to see tears forming in his beautiful green eyes. They didn’t spill out onto his cheeks, but glistened in the dim light.</p><p>This wasn’t Casey’s pack, and he was an outsider here. It must have been frightening for him to have been held down by so many of the other wolves, no matter what he said. Especially since his mate had just rejected him.</p><p>Knowing Casey’s pride, Rory knew he had to make the first move. Rory took Casey’s hand in his, heartened by the fact he didn’t jerk it away. “I didn’t mean it about rejecting you. I love you, but I can’t live like you said I would have to, and I can’t stand the idea of you hurting me for revenge. I don’t want to start hating you. I’m sorry about your brother, but what he did was wrong. When I attacked him, he was holding a knife to Nicky’s throat, making him bleed. I found out later, he told Nicky he was going to rape him and had the hard on to prove it. I’m sorry that it hurt you, baby. If we can forgive each other, I think we can be happy.”</p><p>Casey glanced up at him, but still stayed silent. Rory didn’t know what the silence signified, but Casey hadn’t shoved him away. Taking the silence as agreement or at least understanding, hoping he wasn’t suffering from a bad case of wishful thinking, Rory bent down and kissed the bruise on Casey’s face. He trailed kisses down to his lips. Casey didn’t pull away, encouraging Rory to gently lick at his lips until they fell open slightly. He pushed the tip of his tongue inside Casey’s mouth ever so slightly, running his tongue over his teeth and just touching Casey’s tongue gently. Casey’s mouth fell open a little more. Rory swept his tongue over the inside of Casey’s mouth, ending with a teasing little nip at his lower lip.</p><p>Rory whispered against his mouth. “Can you forgive me for saying I rejected you? I really... really...really...didn’t mean it.” Each really was punctuated by a soft little lick on Casey’s lips. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Casey groaned, pulled him into his arms, and rolled Rory beneath him. He stretched out on top of Rory and ground his cock into his as he kissed him thoroughly. His hands strayed down to part the blanket and give him access to Rory’s still naked body. He ran his hands over it possessively and pushed both hands under Rory’s ass, holding him firmly beneath him.</p><p>“I love you too,” he whispered against his mouth. “I went a little crazy when you said you were leaving me. I didn’t mean to hit you so hard. I’m sorry, and I’ll never do it again. When you did walk out and Marco kept me away from you, I thought I might never see you again, baby. I couldn’t have stood that. I would have gone crazy.”</p><p>“We’re together now.”</p> <p>Casey shuddered and together they pulled at his clothes. Once his skin was gloriously bare, Rory kissed every inch of it he could get to while pinned down again so completely. Breathing hard, Casey looked desperately around the room. “Lube?”</p><p>Rory smiled happily. “Check the bedside drawer. Knowing Ian, he thought of everything.”</p><p>Casey reached across to it and eagerly grabbed the new tube lying inside the drawer. Ian had, indeed, anticipated their needs. Casey got on his knees and squeezed some on his fingers. Keeping eye contact with Rory, whose legs fell open for him, he gently prepared him, stretching with his fingers and smoothing it deep inside Rory’s still tender ass.</p><p>Casey leaned down between Rory’s spread legs to kiss the tip of Rory’s cock and when it responded enthusiastically by rising even farther up to stand against Rory’s stomach, he put his mouth over the length, taking him in all the way to the bottom of his shaft, then slowly sliding his mouth up and down until Rory moaned and twisted beneath him. He finished with a swirling kiss to the tip before he pulled Rory’s legs up over his shoulders.</p><p>“I want to see you when I’m loving you,” he whispered to Rory, and Rory nodded, unable to speak.</p> <p>He positioned the tip of his cock at Rory’s entrance, slid in slowly, pausing to see if Rory showed discomfort before gently pressing in farther. When he had filled him completely, he bent to kiss his nipples, licking at them and teasing with his tongue.</p><p>“Oh God,” Rory groaned. “Casey, I love you so much.”</p><p>Casey moved, seeking the spot deep inside that would drive Rory crazy and when he found it, Rory gasped aloud.</p><p>Casey smiled and teased some more with his cock. “There, baby? Right there?”</p><p>Rory came, spurting cum hard against his and Casey’s chests. Casey followed him seconds later, adding his groans to Rory’s. Finally they lay together, happily spent and breathing hard. Casey let himself soften inside Rory before he rose and went to the bathroom to clean himself. He brought a warm cloth back for Rory and tenderly wiped him clean as he lay exhausted on the bed. Finished, he got into bed and turned Rory on his side to spoon him and cradle him in his arms.</p><p>He whispered softly, “I love you, Rory. I’ll never stop loving you. I can’t do what I said. I knew I couldn’t keep hurting you when you walked out of that room. If I’d lost you, I’d have lost everything.”</p> <p>Rory heard him, but was too sleepy to do more than murmur unintelligibly back at him before sinking down into his dreams.</p><p>Chapter Five</p><p>Casey woke up slowly, comfortable with Rory’s sweet, little body close to his. Someone knocked insistently on the bedroom door. “Casey? Rory? I’ve cooked breakfast for us. Come out when you’re ready.”</p><p>Leaving Rory sleeping soundly, Casey went into the bathroom to pee and splash water on his face. He put on his jeans and T-shirt and padded softly out to the kitchen, where Ian was already drinking a cup of coffee and buttering a piece of toast.</p><p>“I hope you like sausage and eggs.” Ian spread some blackberry jam on his toast and took a big bite.</p><p>“I’m starving.” Casey sat down to eat, motioning over his shoulder at the bedroom. “Rory’s still asleep. He hadn’t had a chance to recover from the mating and being in heat before all this started.”</p><p>“We’ll save him some. Actually, I wanted to talk to you anyway before Marco comes over to question you both.”</p><p>“God, Marco again? I’m gonna punch his lights out before this is over.”</p> <p>“I know you two don’t get along, but Marco is Rory’s uncle, don’t forget, and he’s practically raised him since his father died. He loves Rory, just like you do.”</p><p>“Not just like I do. Nobody loves him as much as I do.”</p><p>“Sorry, I stand corrected, but you understand what I mean. He does love Rory and wants him to be happy. If he finds happiness with you, fine, but if not...”</p><p>“Rory’s happy. I keep him well satisfied.”</p><p>“I have no doubt you’ll keep him sexually satisfied, but are you capable of giving him the other things he needs to be happy?”</p><p>“What do you mean?”</p><p>“You have to forgive him for your brother and end your quest for revenge.” “Rory’s wolf killed him, and now the wolf is dead.” He shrugged. “End of problem.”</p><p>“That isn’t what you told him, and mental abuse is as cruel as physical. Rory’s wolf may have died physically, but he’s still wolf in his mind. He isn’t a pet and shouldn’t be treated or exhibited as such.”</p><p>“That’s over with. I told him I was wrong, and I meant it.”</p><p>Ian nodded and moved away from the subject. “Wolves are all dominants—some more than others, though. You’re obviously an alpha, and I suspect, like myself, you are the type who likes the dominant lifestyle domestically, and plays it, shall we say, a little rough in the bedroom.”</p><p>Casey flushed. “I wouldn’t abuse him, if that’s what you’re getting at.”</p><p>“Maybe not intentionally. Playing the dominant may not be new to you, but being a submissive in any way is to Rory. That swat you gave him, hurt him. Sometimes we don’t realize our own strength. Remember, you are trying to correct behavior, not inflict pain. And you never ever correct when you’re angry or upset.” Ian leaned forward to emphasize the point.</p><p>Cody blushed and ducked his head. “I know that now. I’ll tell him how sorry I am.”</p><p>“As for sexual play,” Ian continued. “Does he have a safe word?”</p><p>“A what?”</p><p>“A word he can say when it gets to be too much for him. A random word you know he wouldn’t say in the normal course of your love play.”</p><p>“We really haven’t had much love play yet.” They hadn’t. They’d only had sex once after Rory woke from the mating and heat induced sleep.</p><p>“Be sure you give him one, and if he uses it, everything stops immediately. I have some books you could read. You really need to be trained properly if you want to dominate him seriously. Remember being a Dom doesn’t mean you have the right to be an asshole. It’s got to be consensual, or it’s abuse, plain and simple. Talk to Rory. I think he must be a natural sexual submissive since your blood chose him, but he’s very young and very shy. Find out what his limits are. Then respect them. Understand?”</p><p>Casey had been paying careful attention and nodded thoughtfully. “I’d never hurt him, you know.” Not again, not knowing what losing Rory did to him even if it had only been a few hours. When Rory rejected their mating, he had gone crazy, and once he calmed down, he understood what Marco had felt when Nicky had been kidnapped and how those feelings had been transmitted to his pack, and to Rory. It was what made Rory attack his brother. He had to believe what Nicky said too. No matter how painful it was to think of his brother as a rapist, he knew deep down Aaron had intended to rape him.</p><p>“I know you wouldn’t hurt him intentionally. If he’s agreed to put himself in your hands, then he’s given you a great gift and an awesome responsibility. Respect it.”</p><p>“Are you talking about me, Ian?”</p><p>Both men turned as Rory came into the room, still wrapped in a blanket. In all the confusion of the night before, he’d never retrieved anything to wear. He walked over and poured a cup of coffee, repeating his question. “Are you?”</p><p>Ian smiled at him. “Maybe just a little. How are you feeling, Rory? Did you sleep well?”</p><p>Rory smiled shyly. “Yes, very well, thanks.”</p><p>“Eat some breakfast, honey,” Casey told him. “You haven’t had anything for hours.”</p><p>“I just want coffee for now. Maybe later.”</p><p>Casey filled a plate with some toast and eggs and pushed it over to him. “Eat. I don’t want you to get sick.”</p><p>Rory sighed and blushed. “Oh all right.” He picked up a fork and began to eat, while Casey watched him carefully. He must have been hungrier than he thought, because he finished it in just a few minutes. Ian smiled across the table at Casey and nodded.</p><p>A knock came on the door, but before Ian could open it, Nicky poked in his golden head and bounced into the room and over to the table. Marco came in more slowly and much more solemnly. Nicky bent down and hugged Rory, smiling over at Casey. “Hey, brat! Are you still causing trouble?”</p><p>Rory rolled his eyes. “God, did you have to bring Nicky, Marco? My life is not irritating enough?”</p><p>Nicky laughed and went back over to Marco, who opened his arms, it seemed, automatically. Nicky certainly had Marco well trained, Casey thought with amusement. Then Rory scooted his chair over next to his and leaned heavily against him. He immediately put an arm around him. The little sneer on Casey’s face at Marco’s expense suddenly died as he realized Rory was doing the same thing to him.</p><p>Marco spoke to Rory. “Nicky wanted a chance to see you, Rory, but I think it would be a good idea if you and I went for a walk. Nicky wants to talk to Casey alone.”</p><p>Rory turned to Casey. “Is it okay if I go with him?”</p><p>Marco frowned, but Casey thrilled at the fact he asked permission and kissed the top of Rory’s head. “Sure, baby, go ahead. I’ll stay and talk to Nicky.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I don’t have any clothes,” Rory said, blushing.</p><p>Ian stood up. “I’ll get you some of mine, Rory. They’ll be a little big, but you can roll them up. It’ll get you to your room for your own clothes, anyway.”</p><p>Rory glanced at Casey, hesitating to see if Casey objected before he said, “Okay, thanks, Ian.”</p> <p>In a few minutes, they all left, including Ian, who was on his way to a council meeting. Marco made sure the door was left open and glanced back, looking nervous as he left.</p><p>Nicky sat down across from Casey and smiled at him. “So you crazy about my boy or what?”</p><p>Casey smiled back at him. “Yeah, pretty much.”</p><p>“You know he saved my life twice. I may tease him, but there’s nothing I wouldn’t do for him.”</p><p>“Me either.”</p> <p>“Good answer. Now let’s see if you really mean it.”</p><p>“What are you talking about?”</p><p>“Marco wants to make you an offer. Now don’t say no right away, just because you don’t like Marco. You two are both too alpha to ever like each other, but maybe you can come to an understanding. For Rory’s sake.”</p><p>“About what?” Casey’s face creased with suspicion.</p><p>“About staying on here indefinitely.” Nicky held his hand up. “Now wait before you get all mad and huffy. Marco is willing to let the Sapphire Valley Wolf Pack join with ours. It would be good for your people and bring them prosperity and safety. With the Hunters being such a threat and on the move again, there’s safety in numbers. He would build you your own wing, and make your people welcome to our pack. We have our own doctor, our own school. It really would be to your benefit to join us.”</p><p>“And what about me, Nicky? I’m their alpha. A pack can’t have two.”</p> <p>“No, but again with the Hunters posing such a threat, we do need a battle commander, someone strong and a good leader, whom the other wolves would look up to. It needs to be an alpha. You would take orders directly from the council, not necessarily Marco. What do you say?”</p><p>Casey hesitated, looking down at the table. Nicky pressed his advantage when Casey didn’t say no immediately. “Rory would be so happy to stay here with his family. You know, his little brother really needs him now that his mother is getting older.” Nicky caught his eye and fluttered his lashes. “Please, Casey.”</p><p>Casey rolled his eyes and smiled. “You really are something, aren’t you? I was warned about you, and every warning was right on.” He laughed. “All right. I agree. But I want all this in writing, so Marco can’t back out of it.”</p><p>Nicky jumped up in excitement. “He won’t back out! Thanks, Casey—you won’t be sorry! C’mon, let’s go find Rory and Marco and tell them.”</p><p>Casey let Nicky lead him downstairs and out to the park area on the side of the building that faced the woods. They walked through the small area, looking for Marco and Rory. As they drew nearer the end of the garden, about to give up and look elsewhere, they realized a fight of some kind was going on just inside the tree line, evidenced by the violent sounds of struggle. Casey started walking faster and then began to run. If Rory was involved in this, he had to get to him. He heard the crack of a rifle, and his heart hammered madly. He heard Nicky cry out behind him, but he couldn’t stop. He raced ahead to where he saw a small body crumpled in the grass, a large silver wolf standing over it protectively, snarling at something moving off through the trees.</p><p>Casey knew it was Rory on the ground, but couldn’t stop until he was sure the danger was over. He shifted as he ran. The silver wolf howled, the sound echoing through the compound. Casey, ran out into the woods, but all he could see was a human’s dead body, blood pooling under him, just inside the trees. No sign of other movement and there was absolutely no sound or smell. Confused, he ran back to where Nicky knelt in the grass, cradling Rory in his arms. He shifted back, dreading what he would see when he got closer. Rory lay white and insensible in Nicky’s arms. Marco stood over them in human form, protectively, swaying dangerously, blood running down his arm.</p><p>Casey fell down beside Nicky and took Rory away from Nicky. “Is he...?”</p><p>“No,” Nicky shook his head firmly. “No, he’s been hit though. The bullet went in his side. I think it went clear through, but we have to get the doctor.” He jumped up and wrapped his arms around Marco, whose knees were about to buckle, and eased him to the ground.</p> <p>Wolves had poured out of the compound to run to them. Some shifted and ran off into the woods, others crowded around them.</p><p>“Hunters,” Marco said raggedly. “We felt someone watching us from the woods, and we turned to run. They started shooting, the bastards, and Rory fell. I tried to pick him up and run, but they shot me too. I shifted, and they took off. I got one of them just inside the tree line there, but I couldn’t leave Rory. There could have been more of them in the woods.” He gasped in pain, and Nicky pulled him close, soothing him, holding his hand tightly over the blood flowing from the wound in Marco’s arm.</p><p>The doctor knelt first beside Marco, but he waved him away. “Take care of Rory. They’re using silver bullets, the bastards.”</p><p>“What do you mean? Like on TV?” Nicky looked at Marco in horror.</p><p>“Wolves can heal from a gunshot wound so long as we aren’t shot in such a way that a vital organ is destroyed,” the doctor replied. “A silver bullet’s different. Our wounds will take longer to heal. Marco and Rory were lucky, and the bullets passed through. They still might get an infection though.”</p><p>Nicky looked terrified, and Casey clutched Rory to his chest as he stood with him to carry him inside. The doctor spoke encouragingly, but he was still frightened and angry. He wanted to kill whoever hurt Rory. It was all he could do to keep from shifting and running off howling into the woods to hunt. Rory begun to stir, coming around slowly. He looked up at Casey.</p><p>“What happened? Where’s Marco?”</p><p>“You’ve been shot, baby, but you’ll be okay. Marco is all right. Don’t worry about anything, I’ve got you.” Casey was vaguely aware Marco was being helped along behind him. He still resented Marco, but he was grateful to him for protecting his mate. If anything had happened to Rory, he couldn’t survive. He knew that. Rory still wasn’t out of the woods yet, and anxiety clawed at Casey. Carrying him into the clinic, he placed him gently on the table, and stood by him holding his hand. The doctor came in right behind them, followed by Marco and Nicky, Nicky’s face drained of all color. Nicky looked like Casey felt, shocked and scared half to death.</p><p>The doctor forced both of them outside. Nicky refused outright at first, but when Marco pointed one stern finger, too exhausted and weak to even speak. Nicky reluctantly left, after covering his face with kisses. Casey went too, because he had a feeling Nicky would fall apart once he got out in the waiting room and sure enough, he had his hands full with him. It did help keep his mind off how still and white Rory had been when he first saw him. He’d been so afraid he was dead, he still trembled with reaction.</p><p>Finally, the doctor came and motioned them both inside. Nicky almost knocked him down getting in to Marco. Rory was sitting up, and Casey felt his knees go weak. He rushed over to him and kissed him gently, as if he might break. “Are you all right, baby? God, I was so scared.”</p><p>“I-I think so. Just sore and achy on my side. I think it’s trying to heal over already.”</p><p>“Yes,” the doctor said behind them. “Both their wounds are healing up from the inside. Marco’s faster, of course, since he’s full wolf.”</p><p>Rory blushed at his words and dropped his head. Casey put his arm around him. “Can I feed him some of my blood? Would that help?”</p><p>“It’s hard to say with the two of you. We’ve never had this situation before. Go ahead—it might do him some good.”</p><p>Casey bit into his wrist and held it up to Rory’s mouth. Rory took it and sucked, gazing up at Casey so adoringly Casey thought he’d have to climb in bed with him in a minute.</p><p>Nicky pouted on the other side of the room. “I wish I could give you some of my blood, darling. Do you think it would help you if I did?”</p><p>Marco smiled. “No, baby, but I appreciate the thought. Instead of making me stronger, I’m afraid your blood would make me want to stay on the sofa all day, read magazines, and make smart remarks.”</p><p>Nicky’s mouth dropped open in outrage, and Marco leaned up to cover it with his own, holding the back of his head so he couldn’t get away. Nicky didn’t struggle long and fell across Marco’s chest, trying to get in bed with him until the doctor put a stop to it.</p><p>The doctor pulled at Marco’s hand on the back of Nicky’s head until Marco looked over at him. “Alpha, I don’t mean to be disrespectful, but as your physician, I must caution you to not to get over-stimulated. You’re not completely healed yet.”</p><p>“It’s not me you have to worry about being over-stimulated—it’s Nicky. Get off the bed, baby, and stop trying to lick me.”</p><p>Casey laughed, while Rory sucked more and more gently, the blood putting him to sleep. Finally, he fell off onto the pillow and began to softly snore. Casey bent down and pressed a soft kiss to his forehead, realizing more every minute how important he was to him.</p><p>“If you’re sure you’re all right then, I’m going out to hunt with the others.” “Of course I’m all right, or I would be if you’d stop feeding me your blood and making me so sleepy. I slept for twelve hours yesterday!”</p><p>“Well,” Casey said moodily. “You needed it. It’s helping you, and you still need to regain your strength. Why don’t you try to take another little nap while I’m gone? I could give you a little more of my blood.”</p><p>“Absolutely not! I have more of it inside me now than you probably do. I appreciate what you’re trying to do, honey, but really, enough is enough. I need to get out of bed.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Okay, but just for a little while. Don’t do anything strenuous and don’t you dare go outside. The Hunters may still be in the woods. We haven’t figured out how they got away. There was absolutely no smell of them at all, and we should have been able to track them. They might have developed some new chemical to mask their scent.”</p><p>“I don’t much like the idea of you out there either, you know. You could be shot or captured.”</p><p>“I’m a big, bad wolf, baby. I’ll be okay.” He leaned over to kiss Rory before he left and Rory clung to his neck.</p> <p>“Yeah, well, Big and Bad, don’t do anything risky. Stay with the rest of the pack.”</p><p>“Of course!” Casey grinned and took off out the door, whistling loudly, leaving the room strangely empty without him. They’d grown much closer in the days since he’d been shot, with Casey staying by his side constantly, making love to him and holding him for hours while he slept. Neither of them had talked about the issues that still separated them—the fact that Casey hadn’t forgiven him totally for his brother’s death or how much submissiveness Casey was going to want.</p><p>He had, at least, not said a word when Rory continued to wear his own clothes. Rory hoped he’d not give him an argument about his continuing with his gamma duties as well when he recovered. That would be a deal breaker for Rory. Soon they would have to sit down together and figure this whole thing out. They were in a holding pattern, neither one of them wanting to push the issues, for fear of it coming between them.</p><p>Rory sighed and wandered over to the window to look outside. He watched as Casey neared several of his friends. They all started laughing together, their easy wolf camaraderie a thing which had to be in the past for Rory now. As a wolf’s mate, tradition forbade him letting another dominant wolf touch him. He was pretty conservative when it came to the traditions of his pack, and he would uphold them, Casey or no Casey. Still, he had a secret he hadn’t shared with anyone. When he was shot and he lay on the ground listening to the sounds of a terrible struggle going on with Marco and the Hunter, he had shifted a little. Not all the way, or even enough to change his body, but he did shift some when he was afraid Marco was in danger. He was pretty sure he’d be able to again if he really needed to. Maybe all the way the next time it happened when he was stronger.</p><p>He was happy his wolf wasn’t dead, as Casey thought, but what would the news mean to his relationship with Casey? Casey hadn’t said anything different about hating his wolf. If he knew his wolf was alive and if not well, at least healed a little, what would he think? His knot was still absolutely gone, so he knew he was no longer exactly a wolf, so what was he?</p> <p>Watching them from the window, Rory was amazed to see them all suddenly transform into wolves. Casey was big and brown and as beautiful as he was as a human. They all sprang out into the woods together, howling and nipping at each other’s flanks playfully. Rory watched them go, not really wanting to join them, just worried about his mate.</p><p>He put his head back against the chair and lethargy overtook him. Damn Casey’s strong blood anyway! Maybe he’d take just a short nap. No sooner did he think it than he dozed off and woke up after about an hour. Gazing out the window into the woods he slowly came awake. From his vantage point on the second floor, he could see into the woods for a good little way, especially since the foliage hadn’t fully come out yet for spring. He got a glimpse now and then of a wolf darting by as they trained and hunted in the woods near the compound, ordered by Marco not to venture too far away.</p><p>Then, off on the opposite side of the woods from the wolves, perhaps a hundred or more yards away, Rory saw human forms moving through the trees, sneaking up quietly toward the compound. Hunters! For a moment he couldn’t move, and then he raced to the phone to call for help. He told the operator where he’d last seen the Hunters then he was out the door and running to warn Casey. He could feel the excitement building in him as he ran. He had to get to him, and he felt a low growl start in his throat.</p><p>With a sharp pain in his stomach and groin, he started to shift, pulled off his clothes as his wolf formed and ran through the woods, faster and faster. He howled in anger and outrage as he saw the Hunters taking aim on the group from a hiding place in the trees. They turned and saw him, and one of them turned his rifle toward him. Before he could squeeze the trigger, he was knocked to the ground, and wolves surrounded him on all sides, snarling and yipping, concentrating on one Hunter while the others ran, trying to control their rage enough to take the one alive for questioning.</p><p>Rory stopped at the edge of the trees, panting in relief and reaction, resting for a moment before he tried to make it back to his room. He was about to shift back when a big, brown wolf stalked toward him. The wolf bared huge, glistening fangs, emitting a warning growl as it moved forward. It was Casey. He knew Casey recognized him too, yet looked like he was about to attack, and there was no way he could stop him. Instinctively, Rory dropped to his belly and began to crawl toward the giant wolf. Casey stood still, his large yellow eyes glistening. When Rory got to within a few feet of him, he rolled over on his back and offered his throat, making his surrender clear. Casey could kill him if he wanted to. He would offer no resistance. Casey’s wolf whimpered and came closer, sniffing at him. He straddled Rory’s body and brought his snout right down to his neck. Yet instead of ripping out his throat, his tongue flickered out, and he licked Rory’s mouth and nose before he jumped off and ran away into the woods.</p><p>Rory got to his feet, shaking and shifting back to his human form. Still trembling, he made it back to the compound and up to their room, falling to the bed in complete exhaustion. Shifting took a lot of energy, and it was obviously energy he still didn’t have. There was the added trauma of seeing Casey and exposing his secret. He knew deep down Casey wouldn’t kill him, yet there had been just a moment in the woods when he was a little doubtful. Still he’d offered his throat to him, and Casey had licked him. Licked him! That had to mean he forgave him. Didn’t it? His mind whirling over the possibilities, he closed his eyes and fell asleep. In his dreams, he hunted alongside a big brown wolf, and they ran together under the moonlit night sky.</p> <p>When he awoke, Casey sat quietly in the chair by the bed, staring at him.</p><p>Rory cleared his throat nervously. “Hi.”</p><p>“How long?”</p><p>“Huh? Oh. You mean how long since I knew I could shift? Just since the day I got shot. I shifted a little when Marco was fighting the Hunter. I think I can only do it when someone I love is threatened.”</p><p>“And you didn’t think you should share this information with your mate?”</p><p>“Well, I guess. I...uh...”</p><p>“And today?”</p><p>“I saw them from the window. I called for help and then ran to warn you. I shifted on the way. It wasn’t a real decision—I just did it because I was so worried about you.”</p> <p>“Your wolf gave me complete submission.”</p><p>“Of course. I love you, Casey. I’ll do whatever you tell me to.” He batted his eyelashes at Casey as he’d seen Nicky do so many times, while both understood whatever came with conditions.</p><p>“Mmm-hmm. Except stay inside when the Hunters are around. God, you’re going to be just like Nicky, aren’t you? You’ve learned from the master, I guess. You’ll do whatever I want you to as long as you want it too. I believe I told you specifically not to go outside.”</p><p>“Well, yeah, but I had to. I had to go to you.”</p><p>“So you’ll be glad to follow my orders, except when it doesn’t suit you.”</p><p>“But Casey...”</p><p>“No buts! Do you know the Hunter tried to shoot you again? Do you have any idea how it made me feel?”</p><p>“I’m sorry.”</p><p>“Right. Okay, Rory, your safe word is tornado.”</p><p>“My what?”</p><p>“Your safe word. Ian said, you have to have a safe word so if you’re uncomfortable when I spank you it all stops.”</p><p>“Okay, then tornado.”</p><p>Casey smiled grimly. “No, baby, it doesn’t work like that. You can only use it during the punishment, and then only if you really need to. Then we’ll wait and try it again later. But the punishment happens, one way or another. Best to get it over with. So what do you say?”</p><p>“What-what exactly are you going to do?”</p><p>“I’m going to spank you, Rory. Take your clothes off, put you over my knee, and spank your bottom. Probably for a while. You have to learn when I give you an order it’s for your own safety. Now take off your clothes and put yourself across my lap.”</p><p>Rory got up off the bed and slowly took off his clothes. He walked over to Casey and hesitated. “One thing. When Nicky gets a spanking, Marco takes him to bed afterward and makes love to him. Are you going to do that to me?”</p><p>Casey tried to hide his smile as he reached up and touched Rory’s erection. “Would you like me to?”</p><p>“Oh yes,” Rory said, nodding his head.</p><p>“Then I think that most definitely can be arranged, darlin’.”</p><p>Rory lowered himself across Casey’s knees with a satisfied smile on his face. He arranged himself so his cock rubbed firmly against Casey’s thighs. This discipline stuff might not be half bad.</p><p>*THE END* </p> </body></html>"]